{"organizations": [], "uuid": "0f9ee4003120bf074074893c0edc94d1b277133a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-sl-green-realty-corp-reports-fourth-quarter-and-full-year-2017-eps-of-0-point-29-and-0-point-87-per-share-and-ffo-of-1-point.html", "country": "US", "domain_rank": 767, "title": "SL Green Realty Corp. Reports Fourth Quarter and Full Year 2017 EPS of $0.29 and $0.87 Per Share; and FFO of $1.60 and $6.45 Per Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:05:00.000+02:00", "replies_count": 0, "uuid": "0f9ee4003120bf074074893c0edc94d1b277133a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-sl-green-realty-corp-reports-fourth-quarter-and-full-year-2017-eps-of-0-point-29-and-0-point-87-per-share-and-ffo-of-1-point.html", "ord_in_thread": 0, "title": "SL Green Realty Corp. Reports Fourth Quarter and Full Year 2017 EPS of $0.29 and $0.87 Per Share; and FFO of $1.60 and $6.45 Per Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "sl green realty corp.", "sentiment": "negative"}, {"name": "sl green realty corp", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "nareit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Raises 2018 Earnings Guidance\nNEW YORK--(BUSINESS WIRE)-- SL Green Realty Corp. (NYSE: SLG):\nFinancial and Operating Highlights\nNet income attributable to common stockholders of $0.29 per share for the fourth quarter and $0.87 per share for the full year 2017 as compared to $0.44 and $2.34 per share for the same periods in 2016. FFO of $1.60 per share for the fourth quarter and $6.45 per share for the year ended December 31, 2017 as compared to $1.43 and $8.29 per share for the same periods in 2016. FFO for the fourth quarter of 2017 included a $4.1 million charge to MG&A expense related to forfeiture of the Company's 2014 Outperformance Plan awards, partially offset by a $3.2 million real estate tax refund that was received in the Suburban portfolio. Raising 2018 earnings guidance by $0.05 per share to net income per share of $2.32 to $2.42, and NAREIT defined FFO per share of $6.70 to $6.80 after taking into consideration the $4.1 million charge taken in the fourth quarter of 2017 related to forfeiture of the Company's 2014 Outperformance Plan awards, which was previously projected to be a 2018 expense. Same-store cash NOI, including our share of same-store cash NOI from unconsolidated joint ventures, increased 2.0% for the full year, or 2.7% excluding lease termination income, as compared to the prior year. Signed 47 Manhattan office leases covering 358,135 square feet in the fourth quarter and 191 Manhattan office leases covering 1,472,657 square feet during the year ended December 31, 2017. The mark-to-market on signed Manhattan office leases was 12.1% higher for the fourth quarter and 11.3% higher for the year over the previously fully escalated rents on the same spaces. Signed 22 Suburban office leases covering 116,212 square feet in the fourth quarter and 89 Suburban office leases covering 542,084 square feet during the year ended December 31, 2017. The mark-to-market on signed Suburban office leases was 3.7% higher for the fourth quarter and 2.9% higher for the year over the previously fully escalated rents on the same spaces. Manhattan same-store occupancy, inclusive of leases signed but not yet commenced, increased by 50 basis points to 95.3% as of December 31, 2017. Suburban same-store occupancy, inclusive of leases signed but not yet commenced, increased by 60 basis points to 87.2% as of December 31, 2017.\nInvesting Highlights\nDuring the fourth quarter, the Company repurchased 4.9 million shares of common stock at an average price of $100.76 per share and announced a $500 million increase to the size of its share repurchase program to $1.5 billion. To date, the Company has acquired 9.3 million shares of its common stock under the program at an average price of $101.46 per share. Closed on the sale of a 30% interest in 1515 Broadway at a gross asset valuation of $1.950 billion, or $1,045 per square foot, pursuant to the previously announced agreement to sell interests totaling 43%. The balance of the transaction is scheduled to close in the first quarter. The two closings, in total, are expected to generate net proceeds of $433.8 million. Closed on the previously announced sale of 600 Lexington Avenue in January at a gross asset valuation of $305.0 million, or $1,005 per square foot. The transaction generated net proceeds of $290.4 million. Closed on the previously announced sale of 125 Chubb Avenue in Lyndhurst, New Jersey, for a total gross asset valuation of $29.5 million. The transaction generated net proceeds of $28.7 million. Together with our joint venture partner, entered into an agreement to sell the multi-family property at 1274 Fifth Avenue at a gross asset valuation of $44.1 million. The transaction is expected to close during the first quarter and generate net proceeds of $4.0 million.\nFinancing Highlights\nFitch Ratings upgraded the corporate credit ratings for the Company, including the Company's Issuer Default Rating (IDR), to 'BBB' from 'BBB-' with a Rating Outlook of Stable. Refinanced, extended and expanded our unsecured corporate credit facility by $217 million, to $3.0 billion. The new facility, which reduced overall borrowing costs, includes a $1.5 billion revolving line of credit and $1.3 billion funded term loan component that both mature in 2023 as well as a new $200.0 million 7-year term loan component that matures in 2024. Together with our joint venture partner, closed on a $195.0 million refinancing of 1552 Broadway, which bears interest at a floating rate of 2.65% over LIBOR. The new loan matures in 2022, as extended, and replaces the previous $185.4 million of indebtedness on the property. Issued an additional $100.0 million of 4.50% senior unsecured notes due December 2022. The Notes priced at 105.334% plus accrued interest with a yield to maturity of 3.298% and generated net proceeds of $104.7 million. Together with our joint venture partner, closed on a $195.0 million refinancing of 55 West 46th Street, known as Tower 46, which bears interest at a floating rate of 2.125% over LIBOR. The new loan matures in 2023, as extended, and replaces the previous $165.6 million of indebtedness on the property. Together with our joint venture partner, closed on a new $65.0 million mezzanine loan at 650 Fifth Avenue. The loan matures in October 2022 and carries a fixed interest rate of 5.450%. The property is also financed with a $210.0 million mortgage that matures in October 2022 and bears interest at a fixed interest rate of 4.460%.\nSummary\nSL Green Realty Corp. (the \"Company\") (NYSE: SLG) today reported net income attributable to common stockholders for the quarter ended December 31, 2017 of $28.0 million, or $0.29 per share, as compared to net income attributable to common stockholders of $44.0 million, or $0.44 per share, for the same quarter in 2016.\nThe Company also reported net income attributable to common stockholders for the year ended December 31, 2017 of $86.4 million, or $0.87 per share, as compared to net income attributable to common stockholders of $234.9 million, or $2.34 per share, for the same period in 2016. Net income attributable to common stockholders for the year ended December 31, 2017 includes $89.4 million, or $0.86 per share, of net gains recognized from the sale of real estate as compared to $282.1 million, or $2.69 per share, for the same period in 2016.\nThe Company reported funds from operations, or FFO, for the quarter ended December 31, 2017 of $161.7 million, or $1.60 per share, as compared to FFO for the same period in 2016 of $150.8 million, or $1.43 per share. FFO for the fourth quarter of 2017 included a $4.1 million charge to MG&A expenses related to forfeiture of the Company's 2014 Outperformance Plan awards, partially offset by a $3.2 million real estate tax refund that was received at 1-6 International Drive in Rye Brook, NY, following a successful appeal.\nThe Company also reported FFO for the year ended December 31, 2017 of $667.3 million, or $6.45 per share, as compared to FFO for the same period in 2016 of $869.9 million, or $8.29 per share. FFO for 2016 included $207.6 million, or $1.98 per share, of income related to the sale of 388-390 Greenwich Street, which was closed in the second quarter of 2016.\nAll per share amounts in this press release are presented on a diluted basis.\nOperating and Leasing Activity\nFor the quarter ended December 31, 2017, the Company reported consolidated revenues and operating income of $361.3 million and $204.7 million, respectively, compared to $374.2 million and $199.5 million, respectively, for the same period in 2016.\nSame-store cash NOI, including our share of same-store cash NOI from unconsolidated joint ventures, increased by 1.1% for the quarter ended December 31, 2017, or 2.0% excluding lease termination income, as compared to the same period in 2016. For the quarter, consolidated property same-store cash NOI increased by 0.1% to $148.2 million, while unconsolidated joint venture property same-store cash NOI increased by 6.5% to $30.6 million in 2017 as compared to the same period in 2016.\nSame-store cash NOI, including our share of same-store cash NOI from unconsolidated joint ventures, increased by 2.0% for the year ended December 31, 2017, or 2.7% excluding lease termination income, as compared to the same period in 2016. For the year, consolidated property same-store cash NOI increased by 0.9% to $572.6 million, inclusive of the effect of expected tenant move-outs at 485 Lexington Avenue, 1515 Broadway and 220 East 42 nd Street, while unconsolidated joint venture property same-store cash NOI increased by 7.8% to $116.8 million in 2017 as compared to the same period in 2016.\nIn the fourth quarter, the Company signed 47 office leases in its Manhattan portfolio totaling 358,135 square feet. Thirty-three leases comprising 195,887 square feet, representing office leases on space that had been occupied within the prior twelve months, are considered replacement leases on which mark-to-market is calculated. Those replacement leases had average starting rents of $76.86 per rentable square foot, representing a 12.1% increase over the previously fully escalated rents on the same office spaces. The average lease term on the Manhattan office leases signed in the fourth quarter was 7.9 years and average tenant concessions were 5.1 months of free rent with a tenant improvement allowance of $55.92 per rentable square foot.\nDuring 2017, the Company signed 191 office leases in its Manhattan portfolio totaling 1,472,657 square feet. Manhattan office leasing volume for 2017 was below the Company’s goal of 1,600,000 square feet as a result of leases signed in January 2018 that were expected to be signed in December 2017. One hundred thirty-eight leases comprising 888,144 square feet, representing office leases on space that had been occupied within the prior twelve months, are considered replacement leases on which mark-to-market is calculated. Those replacement leases had average starting rents of $72.97 per rentable square foot, representing an 11.3% increase over the previously fully escalated rents on the same office spaces. The average lease term on the Manhattan office leases signed in the year ended December 31, 2017 was 8.2 years and average tenant concessions were 4.6 months of free rent with a tenant improvement allowance of $56.48 per rentable square foot.\nOccupancy in the Company's Manhattan same-store portfolio increased 50 basis points to 95.3% as of December 31, 2017, inclusive of 627,956 square feet of leases signed but not yet commenced, as compared to 94.8% as of September 30, 2017.\nIn the fourth quarter, the Company signed 22 office leases in its Suburban portfolio totaling 116,212 square feet. Fourteen leases comprising 92,684 square feet, representing office leases on space that had been occupied within the prior twelve months, are considered replacement leases on which mark-to-market is calculated. Those replacement leases had average starting rents of $34.45 per rentable square foot, representing a 3.7% increase over the previously fully escalated rents on the same office spaces. The average lease term on the Suburban office leases signed in the fourth quarter was 4.6 years and average tenant concessions were 1.4 months of free rent with a tenant improvement allowance of $17.84 per rentable square foot.\nDuring the year ended 2017, the Company signed 89 office leases in its Suburban portfolio totaling 542,084 square feet. Forty-eight leases comprising 281,396 square feet, representing office leases on space that had been occupied within the prior twelve months, are considered replacement leases on which mark-to-market is calculated. Those replacement leases had average starting rents of $33.62 per rentable square foot, representing a 2.9% increase over the previously fully escalated rents on the same office spaces. The average lease term on the Suburban office leases signed in the year ended December 31, 2017 was 6.3 years and average tenant concessions were 5.1 months of free rent with a tenant improvement allowance of $25.93 per rentable square foot.\nOccupancy in the Company's Suburban same-store portfolio increased 60 basis points to 87.2% as of December 31, 2017, inclusive of 8,608 square feet of leases signed but not yet commenced, as compared to 86.6% as of September 30, 2017.\nSignificant leases that were signed in the fourth quarter included:\nRenewal and expansion with Consolidated Edison Solutions, Inc. for 47,868 square feet at 100 Summit Lake Drive in Valhalla, New York, for 5.9 years; Renewal with Pride Technologies LLC and Pride Global Finance, LLC for 40,075 square feet at 420 Lexington Avenue, for 8.9 years; New lease with Columbia Management Investment Advisors for 38,651 square feet at 485 Lexington Avenue, for 11.2 years; New lease with Ankura Consulting Group, LLC for 29,574 square feet at 485 Lexington Avenue, for 15.7 years; and New lease with Laidlaw & Company (UK) Ltd. for 20,987 square feet at 521 Fifth Avenue, for 10.8 years.\nMarketing, general and administrative, or MG&A, expenses for the year ended December 31, 2017 were $100.5 million, or 5.3% of total combined revenues and 53 basis points of total assets, including our share of assets from unconsolidated joint ventures. MG&A expenses for 2017 included $11.6 million related to the Company's 2014 Outperformance Plan which expired valueless to the recipients.\nInvestment Activity\nDuring the fourth quarter, the Company repurchased 4.9 million shares of common stock at an average price of $100.76 per share and announced that the Company's Board of Directors had authorized a $500 million increase to the size of its share repurchase program, to $1.5 billion. To date, the Company has acquired 9.3 million shares of its common stock under the program at an average price of $101.46 per share.\nIn January, the Company closed on the previously announced sale of 600 Lexington Avenue, a 36-story, 303,515 square foot Midtown Manhattan office building, for a gross sales price of $305.0 million, or $1,005 per square foot. The transaction generated net proceeds of $290.4 million.\nIn November, the Company closed on the sale of a 30% interest in 1515 Broadway, a 1.86 million-square-foot, Class-A Times Square office building, for a gross sales price of $1.950 billion, or $1,045 per square foot , pursuant to the previously announced agreement to sell interests totaling 43%. The balance of the transaction is scheduled to close in the first quarter. The two closings, in total, are expected to generate net proceeds of approximately $433.8 million.\nIn October, the Company closed on the previously announced sale of 125 Chubb Avenue in Lyndhurst, New Jersey, at a gross asset valuation of $29.5 million. The transaction generated net proceeds of $28.7 million.\nIn January, the Company, along with its joint venture partner, reached an agreement to sell 1274 Fifth Avenue, a 54-unit multifamily building know as Stonehenge on Fifth, at a gross asset valuation of $44.1 million, or $923 per square foot. The transaction is expected to close during the first quarter and generate net proceeds of approximately $4.0 million.\nDebt and Preferred Equity Investment Activity\nThe carrying value of the Company’s debt and preferred equity investment portfolio totaled $2.27 billion at December 31, 2017, including $2.11 billion of investments at a weighted average current yield of 9.1% that are classified in the debt and preferred equity line item on the balance sheet, and investments aggregating $0.16 billion at a weighted average current yield of 8.9% that are included in other balance sheet line items for accounting purposes. The weighted average yield of 9.1% excludes our investments in 2 Herald Square, which were moved to non-accrual status in August 2017. Our investments in 2 Herald are currently the subject of an uncontested foreclosure action, for which we have received summary judgment and we expect to complete foreclosure in 2018. During the fourth quarter, the Company originated or acquired new debt and preferred equity investments totaling $447.8 million, of which $252.2 million was retained and $164.4 million of which was funded, at a weighted average current yield of 7.5%.\nFinancing Activity\nIn December, Fitch Ratings upgraded the corporate credit ratings for the Company, including the Company's Issuer Default Rating (IDR), to 'BBB' from 'BBB-' with a Rating Outlook of Stable.\nIn November, the Company refinanced, extended and expanded its unsecured corporate credit facility by $217 million, to $3.0 billion. The 5-year funded term loan component of the facility was increased by $117 million to $1.3 billion, the maturity date extended from June 2019 to March 2023 and the current borrowing cost reduced to 110 basis points over LIBOR. The revolving line of credit component of the facility was reduced by $100 million to $1.5 billion, the maturity date extended from March 2019 to March 2023, inclusive of as-of-right extension options aggregating 1-year, and the current borrowing cost reduced to 100 basis points over LIBOR. In addition, a new $200 million, 7-year funded term loan component was added to the facility, which matures in November 2024 and currently bears interest at 165 basis points over LIBOR.\nIn November, the Company, along with its joint venture partner, closed on a new mezzanine loan at 650 Fifth Avenue. The new $65.0 million loan matures in October 2022 and carries a fixed interest rate of 5.450%. The property is also financed with a $210.0 million mortgage that matures in October 2022 and bears interest at a fixed interest rate of 4.460%.\nIn October, the Company, along with its joint venture partner, closed on the refinancing of 1552 Broadway. The new $195.0 million mortgage has a 5-year term, as extended, bears interest at a floating rate of 2.65% over LIBOR and replaces the previous $185.4 million of indebtedness on the property that bore interest at a floating rate of 4.17% over LIBOR.\nIn October, the Company issued an additional $100.0 million of 4.50% senior unsecured notes due December 2022. The Notes priced at 105.334% plus accrued interest with a yield to maturity of 3.298% and generated net proceeds of $104.7 million.\nIn October, the Company, along with its joint venture partner, closed on the refinancing of 55 West 46th Street, known as Tower 46. The new $195.0 million mortgage, of which $167.8 million was funded at closing, has a 6-year term, as extended, bears interest at a floating rate of 2.125% over LIBOR and replaces the previous $165.6 million of indebtedness on the property that bore interest at a floating rate of 2.30% over LIBOR.\nGuidance\nThe Company is raising its earnings guidance for the year ending December 31, 2018 by $0.05 per share after taking into consideration a $4.1 million charge taken in the fourth quarter of 2017 related to forfeiture of the Company's 2014 Outperformance Plan awards, which was previously projected to be a 2018 expense.\nThe Company's revised earnings guidance for the year ending December 31, 2018 is net income per share of $2.32 to $2.42, and FFO per share of $6.70 to $6.80, increased from the previous guidance range of $2.27 to $2.37 and $6.65 to $6.75 per share, respectively.\nDividends\nIn the fourth quarter of 2017, the Company declared quarterly dividends on its outstanding common and preferred stock as follows:\n$0.8125 per share of common stock, which was paid on January 16, 2018 to shareholders of record on the close of business on January 2, 2018; and $0.40625 per share on the Company's 6.50% Series I Cumulative Redeemable Preferred Stock for the period October 15, 2017 through and including January 14, 2018, which was paid on January 16, 2018 to shareholders of record on the close of business on January 2, 2018, and reflects the regular quarterly dividend, which is the equivalent of an annualized dividend of $1.625 per share.\nConference Call and Audio Webcast\nThe Company's executive management team, led by Marc Holliday, Chief Executive Officer, will host a conference call and audio webcast on Thursday, January 25, 2018 at 2:00 pm ET to discuss the financial results.\nThe supplemental data will be available prior to the quarterly conference call in the Investors section of the SL Green Realty Corp. website at http://slgreen.com/ under “Financial Reports.”\nThe live conference call will be webcast in listen-only mode in the Investors section of the SL Green Realty Corp. website at http://slgreen.com/ under “Presentations & Webcasts”. The conference may also be accessed by dialing toll-free (877) 312-8765 or international (419) 386-0002, and using passcode 3996788.\nA replay of the call will be available 7 days after the call by dialing (855) 859-2056 using passcode 3996788. A webcast replay will also be available in the Investors section of the SL Green Realty Corp. website at http://slgreen.com/ under “Presentations & Webcasts”.\nCompany Profile\nSL Green Realty Corp., an S&P 500 company and New York City's largest office landlord, is a fully integrated real estate investment trust, or REIT, that is focused primarily on acquiring, managing and maximizing value of Manhattan commercial properties. As of December 31, 2017, SL Green held interests in 121 Manhattan buildings totaling 50.0 million square feet. This included ownership interests in 29.5 million square feet of Manhattan buildings and debt and preferred equity investments secured by 20.5 million square feet of buildings. In addition, SL Green held ownership interests in 25 suburban buildings totaling 3.7 million square feet in Brooklyn, Long Island, Westchester County, and Connecticut.\nTo be added to the Company's distribution list or to obtain the latest news releases and other Company information, please visit our website at www.slgreen.com or contact Investor Relations at (212) 594-2700.\nDisclaimers\nNon-GAAP Financial Measures\nDuring the quarterly conference call, the Company may discuss non-GAAP financial measures as defined by SEC Regulation G. In addition, the Company has used non-GAAP financial measures in this press release. A reconciliation of each non-GAAP financial measure and the comparable GAAP financial measure can be found in this release and in the Company’s Supplemental Package.\nForward-looking Statements\nThis press release includes certain statements that may be deemed to be \" \" within the meaning of the Private 1995 and are intended to be covered by the safe harbor provisions thereof. All statements, other than statements of historical facts, included in this press release that address activities, events or developments that we expect, believe or anticipate will or may occur in the future, are . These are based on certain assumptions and analyses made by us in light of our experience and our perception of historical trends, current conditions, expected future developments and other factors we believe are appropriate. Forward-looking statements are not guarantees of future performance and actual results or developments may differ materially, and we caution you not to place undue reliance on such statements. Forward-looking statements are generally identifiable by the use of the words \"may,\" \"will,\" \"should,\" \"expect,\" \"anticipate,\" \"estimate,\" \"believe,\" \"intend,\" \"project,\" \"continue,\" or the negative of these words, or other similar words or terms.\nForward-looking statements contained in this press release are subject to a number of risks and uncertainties, many of which are beyond our control, that may cause our actual results, performance or achievements to be materially different from future results, performance or achievements expressed or implied by made by us. Factors and risks to our business that could cause actual results to differ from those contained in the are described in our filings Commission. We undertake no obligation to publicly update or revise any , whether as a result of future events, new information or otherwise.\nSL GREEN REALTY CORP.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(unaudited and in thousands, except per share data)\nThree Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Revenues: Rental revenue, net $ 265,492 $ 279,869 $ 1,100,993 $ 1,323,767 Escalation and reimbursement 41,378 49,501 172,939 196,858 Investment income 45,130 38,661 193,871 213,008 Other income 9,342 6,211 43,670 130,348 Total revenues 361,342 374,242 1,511,473 1,863,981 Expenses: Operating expenses, including related party expenses of $6,459 and $21,400 in 2017 and $6,719 and\n$21,890 in 2016.\n72,079 78,590 293,364 312,859 Real estate taxes 58,150 60,457 244,323 248,388 Ground rent 8,308 8,308 33,231 33,261 Interest expense, net of interest income 60,933 64,873 257,045 321,199 Amortization of deferred financing costs 4,297 4,384 16,498 24,564 Depreciation and amortization 84,404 104,026 403,320 821,041 Transaction related costs (2,199 ) 1,541 (1,834 ) 7,528 Marketing, general and administrative 28,136 25,785 100,498 99,759 Total expenses 314,108 347,964 1,346,445 1,868,599 Net income (loss) before equity in net income (loss) from unconsolidated joint ventures, equity in net gain\non sale of interest in unconsolidated joint venture/real estate, gain on sale of real estate net, depreciable real\nestate reserves, and gain (loss) on sale of marketable securities\n47,234 26,278 165,028 (4,618 ) Equity in net income (loss) from unconsolidated joint ventures 7,788 (95 ) 21,892 11,874 Equity in net gain on sale of interest in unconsolidated joint venture/real estate — 421 16,166 44,009 Gain on sale of real estate, net 76,497 27,366 73,241 238,116 Depreciable real estate reserves (93,184 ) — (178,520 ) (10,387 ) Gain (loss) on sale of marketable securities — — 3,262 (83 ) Net income 38,335 53,970 101,069 278,911 Net income attributable to noncontrolling interests in the Operating Partnership (1,288 ) (1,966 ) (3,995 ) (10,136 ) Net (income) loss attributable to noncontrolling interests in other partnerships (2,478 ) (1,398 ) 15,701 (7,644 ) Preferred unit distributions (2,850 ) (2,853 ) (11,401 ) (11,235 ) Net income attributable to SL Green 31,719 47,753 101,374 249,896 Perpetual preferred stock dividends (3,737 ) (3,737 ) (14,950 ) (14,950 ) Net income attributable to SL Green common stockholders $ 27,982 $ 44,016 $ 86,424 $ 234,946 Earnings Per Share (EPS) Net income per share (Basic) $ 0.29 $ 0.44 $ 0.88 $ 2.35 Net income per share (Diluted) $ 0.29 $ 0.44 $ 0.87 $ 2.34 Funds From Operations (FFO) FFO per share (Basic) $ 1.61 $ 1.44 $ 6.47 $ 8.32 FFO per share (Diluted) $ 1.60 $ 1.43 $ 6.45 $ 8.29 Basic ownership interest\nWeighted average REIT common shares for net income per share 96,018 100,321 98,571 100,186 Weighted average partnership units held by noncontrolling interests 4,514 4,473 4,556 4,322 Basic weighted average shares and units outstanding 100,532 104,794 103,127 104,508 Diluted ownership interest\nWeighted average REIT common share and common share equivalents 96,265 100,695 98,847 100,558 Weighted average partnership units held by noncontrolling interests 4,514 4,473 4,556 4,322 Diluted weighted average shares and units outstanding 100,779 105,168 103,403 104,880 SL GREEN REALTY CORP.\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except per share data)\nDecember 31, December 31, 2017 2016 Assets (Unaudited) Commercial real estate properties, at cost: Land and land interests $ 2,357,051 $ 3,309,710 Building and improvements 6,351,012 7,948,852 Building leasehold and improvements 1,450,614 1,437,325 Properties under capital lease 47,445 47,445 10,206,122 12,743,332 Less accumulated depreciation (2,300,116 ) (2,264,694 ) 7,906,006 10,478,638 Assets held for sale 338,354 — Cash and cash equivalents 127,888 279,443 Restricted cash 122,138 90,524 Investment in marketable securities 28,579 85,110 Tenant and other receivables, net of allowance of $18,637 and $16,592 in 2017 and 2016, respectively 57,644 53,772 Related party receivables 23,039 15,856 Deferred rents receivable, net of allowance of $17,207 and $25,203 in 2017 and 2016, respectively 365,337 442,179 Debt and preferred equity investments, net of discounts and deferred origination fees of $25,507 and $16,705 in 2017 and\n2016, respectively\n2,114,041 1,640,412 Investments in unconsolidated joint ventures 2,362,989 1,890,186 Deferred costs, net 226,201 267,600 Other assets 310,688 614,067 Total assets $ 13,982,904 $ 15,857,787 Liabilities Mortgages and other loans payable $ 2,865,991 $ 4,140,712 Revolving credit facility 40,000 — Unsecured term loan 1,500,000 1,183,000 Unsecured notes 1,404,605 1,133,957 Deferred financing costs, net (56,690 ) (82,258 ) Total debt, net of deferred financing costs 5,753,906 6,375,411 Accrued interest payable 38,142 36,052 Other liabilities 189,231 212,493 Accounts payable and accrued expenses 137,142 190,583 Deferred revenue 208,119 217,955 Capitalized lease obligations 42,843 42,132 Deferred land leases payable 3,239 2,583 Dividend and distributions payable 85,138 87,271 Security deposits 67,927 66,504 Liabilities related to assets held for sale 4,074 — Junior subordinate deferrable interest debentures held by trusts that issued trust preferred securities 100,000 100,000 Total liabilities 6,629,761 7,330,984 Commitments and contingencies — — Noncontrolling interest in the Operating Partnership 461,954 473,882 Preferred units 301,735 302,010 Equity Stockholders’ equity: Series I Preferred Stock, $0.01 par value, $25.00 liquidation preference, 9,200 issued and outstanding at both December 31,\n2017 and December 31, 2016\n221,932 221,932 Common stock, $0.01 par value 160,000 shares authorized, 93,858 and 101,617 issued and outstanding at December 31,\n2017 and December 31, 2016, respectively (including 1,055 held in Treasury at December 31, 2017 and December 31, 2016)\n939 1,017 Additional paid-in capital 4,741,697 5,624,545 Treasury stock at cost (124,049 ) (124,049 ) Accumulated other comprehensive income 18,604 22,137 Retained earnings 1,365,970 1,578,893 Total SL Green Realty Corp. stockholders’ equity 6,225,093 7,324,475 Noncontrolling interests in other partnerships 364,361 426,436 Total equity 6,589,454 7,750,911 Total liabilities and equity $ 13,982,904 $ 15,857,787 SL GREEN REALTY CORP.\nRECONCILIATION OF NON-GAAP FINANCIAL MEASURES\n(unaudited and in thousands, except per share data)\nThree Months Ended Twelve Months Ended December 31, December 31, Funds From Operations (FFO) Reconciliation: 2017 2016 2017 2016 Net income attributable to SL Green common stockholders $ 27,982 $ 44,016 $ 86,424 $ 234,946 Add:\nDepreciation and amortization 84,404 104,026 403,320 821,041 Joint venture depreciation and noncontrolling interest adjustments 29,397 27,662 102,334 69,853 Net income (loss) attributable to noncontrolling interests 3,766 3,364 (11,706 ) 17,780 Less:\nGain on sale of real estate, net 76,497 27,366 73,241 238,116 Equity in net gain on sale of interest in unconsolidated joint venture/real estate — 421 16,166 44,009 Depreciable real estate reserve (93,184 ) — (178,520 ) (10,387 ) Depreciation on non-rental real estate assets 554 522 2,191 2,027 FFO attributable to SL Green common stockholders and noncontrolling interests $ 161,682 $ 150,759 $ 667,294 $ 869,855 Three Months Ended Twelve Months Ended December 31, December 31, Operating income and Same-store NOI Reconciliation: 2017 2016 2017 2016 Net income $ 38,335 $ 53,970 $ 101,069 $ 278,911 Equity in net gain on sale of interest in unconsolidated joint venture/real estate — (421 ) (16,166 ) (44,009 ) Gain on sale of real estate, net (76,497 ) (27,366 ) (73,241 ) (238,116 ) Depreciable real estate reserves 93,184 — 178,520 10,387 (Gain) loss on sale of marketable securities — — (3,262 ) 83 Depreciation and amortization 84,404 104,026 403,320 821,041 Interest expense, net of interest income 60,933 64,873 257,045 321,199 Amortization of deferred financing costs 4,297 4,384 16,498 24,564 Operating income 204,656 199,466 863,783 1,174,060 Equity in net (income) loss from unconsolidated joint ventures (7,788 ) 95 (21,892 ) (11,874 ) Marketing, general and administrative expense 28,136 25,785 100,498 99,759 Transaction related costs, net (2,199 ) 1,541 (1,834 ) 7,528 Investment income (45,130 ) (38,661 ) (193,871 ) (213,008 ) Non-building revenue (4,522 ) 1,061 (23,781 ) (4,937 ) Net operating income (NOI) 173,153 189,287 722,903 1,051,528 Equity in net income (loss) from unconsolidated joint ventures 7,788 (95 ) 21,892 11,874 SLG share of unconsolidated JV depreciation and amortization 35,136 30,018 126,456 83,346 SLG share of unconsolidated JV interest expense, net of interest income 28,692 22,296 96,554 72,015 SLG share of unconsolidated JV amortization of deferred financing costs 1,696 2,471 8,220 8,309 SLG share of unconsolidated JV loss on early extinguishment of debt 131 — 3,950 972 SLG share of unconsolidated JV transaction related costs — 97 110 3,116 SLG share of unconsolidated JV investment income (4,438 ) (4,550 ) (16,777 ) (16,250 ) SLG share of unconsolidated JV non-building revenue (2,005 ) (3,852 ) (4,989 ) (7,179 ) NOI including SLG share of unconsolidated JVs 240,153 235,672 958,319 1,207,731 NOI from other properties/affiliates (50,128 ) (44,248 ) (216,513 ) (466,762 ) Same-Store NOI 190,025 191,424 741,806 740,969 Ground lease straight-line adjustment 524 531 2,096 2,312 Straight-line and free rent (4,244 ) (7,061 ) (25,276 ) (30,231 ) Rental income - FAS 141 (4,318 ) (4,035 ) (17,144 ) (19,802 ) Joint Venture straight-line and free rent (2,538 ) (3,560 ) (10,195 ) (15,517 ) Joint Venture rental income - FAS 141 (608 ) (411 ) (1,852 ) (1,723 ) Same-store cash NOI $ 178,841 $ 176,888 $ 689,435 $ 676,008 SL GREEN REALTY CORP.\nNON-GAAP FINANCIAL MEASURES - DISCLOSURES\nFunds from Operations (FFO)\nFFO is a widely recognized non-GAAP measure of REIT performance. The Company computes FFO in accordance with standards established by the National Association of Real Estate Investment Trusts, or NAREIT, which may not be comparable to FFO reported by other REITs that do not compute FFO in accordance with the NAREIT definition, or that interpret the NAREIT definition differently than the Company does. The revised White Paper on FFO approved by the Board of Governors of NAREIT in April 2002, and subsequently amended, defines FFO as net income (loss) (computed in accordance with Generally Accepted Accounting Principles, or GAAP), excluding gains (or losses) from sales of properties, debt restructurings and real estate related impairment charges, plus real estate related depreciation and amortization and after adjustments for unconsolidated partnerships and joint ventures.\nThe Company presents FFO because it considers it an important supplemental measure of the Company’s operating performance and believes that it is frequently used by securities analysts, investors and other interested parties in the evaluation of REITs, particularly those that own and operate commercial office properties. The Company also uses FFO as one of several criteria to determine performance-based bonuses for members of its senior management. FFO is intended to exclude GAAP historical cost depreciation and amortization of real estate and related assets, which assumes that the value of real estate assets diminishes ratably over time. Historically, however, real estate values have risen or fallen with market conditions. Because FFO excludes depreciation and amortization unique to real estate, gains and losses from property dispositions, and extraordinary items, it provides a performance measure that, when compared year over year, reflects the impact to operations from trends in occupancy rates, rental rates, operating costs, and interest costs, providing perspective not immediately apparent from net income. FFO does not represent cash generated from operating activities in accordance with GAAP and should not be considered as an alternative to net income (determined in accordance with GAAP), as an indication of the Company’s financial performance or to cash flow from operating activities (determined in accordance with GAAP) as a measure of the Company’s liquidity, nor is it indicative of funds available to fund the Company’s cash needs, including our ability to make cash distributions.\nFunds Available for Distribution (FAD)\nFAD is a non-GAAP financial measure that is calculated as FFO plus non-real estate depreciation, allowance for straight line credit loss, adjustment for straight line ground rent, non-cash deferred compensation, and a pro-rata adjustment for FAD for SLG’s unconsolidated JV, less straight line rental income, free rent net of amortization, second cycle tenant improvement and leasing costs, and recurring building improvements.\nFAD is not intended to represent cash flow for the period and is not indicative of cash flow provided by operating activities as determined in accordance with GAAP. FAD is presented solely as a supplemental disclosure with respect to liquidity because the Company believes it provides useful information regarding the Company’s ability to fund its dividends. Because all companies do not calculate FAD the same way, the presentation of FAD may not be comparable to similarly titled measures of other companies. FAD does not represent cash flow from operating, investing and finance activities in accordance with GAAP and should not be considered as an alternative to net income (determined in accordance with GAAP), as an indication of the Company’s financial performance, as an alternative to net cash flows from operating activities (determined in accordance with GAAP), or as a measure of the Company’s liquidity.\nEarnings Before Interest, Taxes, Depreciation and Amortization for Real Estate (EBITDAre)\nEBITDAre is a non-GAAP financial measure. The Company computes EBITDAre in accordance with standards established by the National Association of Real Estate Investment Trusts, or NAREIT, which may not be comparable to EBITDAre reported by other REITs that do not compute EBITDAre in accordance with the NAREIT definition, or that interpret the NAREIT definition differently than the Company does. The White Paper on EBITDAre approved by the Board of Governors of NAREIT in September 2017 defines EBITDAre as net income (loss) (computed in accordance with Generally Accepted Accounting Principles, or GAAP), plus interest expense, plus income tax expense, plus depreciation and amortization, plus (minus) losses and gains on the disposition of depreciated property, plus impairment write-downs of depreciated property and investments in unconsolidated joint ventures, plus adjustments to reflect the entity's share of EBITDAre of unconsolidated joint ventures.\nThe Company presents EBITDAre, because the Company believes that EBITDAre, along with cash flow from operating activities, investing activities and financing activities, provides investors with an additional indicator of the Company’s ability to incur and service debt. EBITDAre should not be considered as an alternative to net income (determined in accordance with GAAP), as an indication of the Company’s financial performance, as an alternative to net cash flows from operating activities (determined in accordance with GAAP), or as a measure of the Company’s liquidity.\nNet Operating Income (NOI) and Cash NOI\nNOI is a non-GAAP financial measure that is calculated as operating income before transaction related costs, gains/losses on early extinguishment of debt, marketing general and administrative expenses and non-real estate revenue. Cash NOI is calculated by subtracting free rent (net of amortization), straight-line rent, FAS 141 rental income from NOI, while adding ground lease straight-line adjustment and the allowance for straight-line tenant credit loss.\nThe Company presents NOI and Cash NOI because the Company believes that these measures, when taken together with the corresponding GAAP financial measures and our reconciliations, provide investors with meaningful information regarding the operating performance of properties. When operating performance is compared across multiple periods, the investor is provided with information not immediately apparent from net income that is determined in accordance with GAAP. NOI and Cash NOI provide information on trends in the revenue generated and expenses incurred in operating our properties, unaffected by the cost of leverage, straight-line adjustments, depreciation, amortization, and other net income components. The Company uses these metrics internally as performance measures. None of these measures is an alternative to net income (determined in accordance with GAAP) and same-store performance should not be considered an alternative to GAAP net income performance.\nDebt to Market Capitalization Ratio\nDebt to Market Capitalization is a non-GAAP measure that is calculated as the Company’s consolidated debt divided by the Company's estimated market value based upon the quarter-end trading price of the Company’s common stock multiplied by all common shares and operating partnership units outstanding plus the face value of the Company’s preferred equity.\nThe Company presents the ratio of debt to market capitalization as a measure of the Company’s leverage position relative to the Company’s estimated market value. The Company believes this ratio may provide investors with another measure of the Company’s current leverage position. The debt to market capitalization ratio should be used as one measure of the Company’s leverage position, and this measure is commonly used in the REIT sector; however, such measure may not be comparable to those used by other REITs that do not compute such measure in the same manner. The debt to market capitalization ratio does not represent the Company’s borrowing capacity and should not be considered an alternative measure to the Company’s current lending arrangements.\nCoverage Ratios\nThe Company presents fixed charge and debt service coverage ratios to provide a measure of the Company’s financial flexibility to service current debt amortization, interest expense and ground rent from current cash net operating income. These coverage ratios represent a common measure of the Company’s ability to service fixed cash payments; however, these ratios are not used as an alternative to cash flow from operating, financing and investing activities (determined in accordance with GAAP).\nSLG-EARN\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006177/en/\nSL Green Realty Corp.\nMatt DiLiberto\nChief Financial Officer\n(212) 594-2700\nSource: SL Green Realty Corp.", "external_links": ["http://www.businesswire.com/news/home/20180124006177/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fslgreen.com%2F&esheet=51748463&newsitemid=20180124006177&lan=en-US&anchor=http%3A%2F%2Fslgreen.com%2F&index=1&md5=5587cfb3aa190911ce065f8f0257215e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fslgreen.com%2F&esheet=51748463&newsitemid=20180124006177&lan=en-US&anchor=http%3A%2F%2Fslgreen.com%2F&index=3&md5=c6adfcc5319aaf6d39592e89cf932653", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.slgreen.com&esheet=51748463&newsitemid=20180124006177&lan=en-US&anchor=www.slgreen.com&index=4&md5=0b938833b6ab98681f2730ba3be9baa2", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fslgreen.com%2F&esheet=51748463&newsitemid=20180124006177&lan=en-US&anchor=http%3A%2F%2Fslgreen.com%2F&index=2&md5=f4fd10dde0438c5901539dc6d2bd6961", "http://slgreen.com/"], "published": "2018-01-25T00:05:00.000+02:00", "crawled": "2018-01-25T02:36:53.003+02:00", "highlightTitle": ""}