{"organizations": [], "uuid": "9385b0901fc77bc10cd9b3c20f0572f389e97450", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/22/104726630-RTX3H4U6-tim-cook.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/17/apple-announces-350-billion-investment-20k-jobs-over-5-years.html", "country": "US", "domain_rank": 767, "title": "Apple announces $350 billion investment, 20k jobs over 5 years", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T20:01:00.000+02:00", "replies_count": 0, "uuid": "9385b0901fc77bc10cd9b3c20f0572f389e97450"}, "author": "Anita Balakrishnan", "url": "https://www.cnbc.com/2018/01/17/apple-announces-350-billion-investment-20k-jobs-over-5-years.html", "ord_in_thread": 0, "title": "Apple announces $350 billion investment, 20k jobs over 5 years", "locations": [], "entities": {"persons": [{"name": "tim cook", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "united states.that", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "7 Mins Ago | 00:46 \nApple on Wednesday made a slew of announcements about its investment in and contribution to the U.S. economy in part because of the new tax law. \nThe headline from Apple is that it will make a $350 billion \"contribution\" to the U.S. economy over the next five years, although it's unclear exactly how the company came to that number. \nThe company also promised to create 20,000 new jobs and open a new campus . \nIt said it expects to pay about $38 billion in taxes for the horde of cash it plans to bring back to the United States. This implies it will repatriate virtually all of its $250 billion in overseas cash. \nApple also said it will spend over $30 billion in capital expenditures over the next five years. About $10 billion in capital expenditures will be investments in U.S. data centers, the company said. \nApple added that it will spend $5 billion as part of an innovation fund, up from the $1 billion CEO Tim Cook announced last year on CNBC's \" Mad Money .\" \nThe job creation will include direct employment and also suppliers and its app business, which it had already planned to grow substantially (app developers earned $26.5 billion in 2017.) The new campus will focus on customer support. \nWednesday's announcement indicates that Apple will still have hundreds of billions of dollars in cash. It could spend that money on buybacks, dividends or acquisitions or moonshot projects. show chapters 2 Hours Ago | 01:21 \nThe announcement raises the bar for the world's most valuable company — now a huge driver of the economy — to continue its dominance and growth in the wake of political pressure on big tech companies. The plan calls for Apple to keep up 2018's $55 billion \" supercycle \" spending rate with domestic suppliers and manufacturers. \n\"We have a deep sense of responsibility to give back to our country and the people who help make our success possible,\" Cook said in a statement. \nIn 2016, then president-elect Donald Trump publicly called out Apple's reliance on its Chinese supply chain, telling The New York Times that he would \"get Apple to build a big plant in the United States, or many big plants in the United States.\" \nApple shares were up about half a percent after the announcement, adding about $5.6 billion to the company's market capitalization after the stock opened Wednesday's trading session down 0.3 percent. \nHere's the full release: \nApple today announced a new set of investments to build on its commitment to support the American economy and its workforce, concentrated in three areas where Apple has had the greatest impact on job creation: direct employment by Apple, spending and investment with Apple's domestic suppliers and manufacturers, and fueling the fast-growing app economy which Apple created with iPhone(R) and the App Store(R). Apple is already responsible for creating and supporting over 2 million jobs across the United States and expects to generate even more jobs as a result of the initiatives being announced today.Combining new investments and Apple's current pace of spending with domestic suppliers and manufacturers -- an estimated $55 billion for 2018 -- Apple's direct contribution to the US economy will be more than $350 billion over the next five years, not including Apple's ongoing tax payments, the tax revenues generated from employees' wages and the sale of Apple products.Planned capital expenditures in the US, investments in American manufacturing over five years and a record tax payment upon repatriation of overseas profits will account for approximately $75 billion of Apple's direct contribution.\"Apple is a success story that could only have happened in America, and we are proud to build on our long history of support for the US economy, \" said Tim Cook, Apple's CEO. \"We believe deeply in the power of American ingenuity, and we are focusing our investments in areas where we can have a direct impact on job creation and job preparedness. We have a deep sense of responsibility to give back to our country and the people who help make our success possible.\"Apple, already the largest US taxpayer, anticipates repatriation tax payments of approximately $38 billion as required by recent changes to the tax law. A payment of that size would likely be the largest of its kind ever made.Growing Apple's US OperationsApple expects to invest over $30 billion in capital expenditures in the US over the next five years and create over 20,000 new jobs through hiring at existing campuses and opening a new one. Apple already employs 84,000 people in all 50 states.The company plans to establish an Apple campus in a new location, which will initially house technical support for customers. The location of this new facility will be announced later in the year.Over $10 billion of Apple's expanded capital expenditures will be investments in data centers across the US. Over the last decade, Apple has invested billions of dollars in data centers and co-located facilities in seven US states, including North Carolina, Oregon, Nevada, Arizona, and a recently announced project in Iowa.Today, Apple is breaking ground on a new facility in downtown Reno, which will support its existing Nevada facilities.All of Apple's US facilities, including offices, retail stores and data centers, are powered by 100 percent renewable energy sources like solar, wind and micro-hydro power, which Apple generates or purchases from local projects. The new campus announced today will also be powered entirely by green energy.Investing in Apple's Domestic Suppliers and Manufacturing PartnersBuilding on the initial success of the Advanced Manufacturing Fund announced last spring, Apple is increasing the size of the fund from $1 billion to $5 billion. The fund was established to support innovation among American manufacturers and help others establish a presence in the US. It is already backing projects with leading manufacturers in Kentucky and rural Texas.Apple works with over 9,000 American suppliers -- large and small businesses in all 50 states -- and each of Apple's core products relies on parts or materials made in the US or provided by US-based suppliers.Preparing Students for the App EconomyApple, which has a 40-year history in education, also plans to accelerate its efforts across the US in support of coding education as well as programs focused on Science, Technology, Engineering, Arts and Math (STEAM).The iOS app economy has created more than 1.6 million jobs in the US and generated $5 billion in revenue for American app developers in 2017. With demand for coding skills stronger than ever, today there are more than 500,000 unfilled programming-related positions across the country, and the US Bureau of Labor Statistics predicts that by 2020 there will be 1.4 million more software development jobs than applicants qualified to fill them.(1)To address the coding skills gap and help prepare more people for jobs in software development, Apple created a powerful yet easy-to-learn coding language called Swift(TM), th", "external_links": [], "published": "2018-01-17T20:01:00.000+02:00", "crawled": "2018-01-17T20:16:56.007+02:00", "highlightTitle": ""}