{"organizations": [], "uuid": "13112b7dd0b07c54e9f07bc37642013e6c15723e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-baltimore-abortion/court-voids-baltimore-law-requiring-no-abortion-disclaimers-at-clinics-idUSKBN1EU1X1", "country": "US", "domain_rank": 408, "title": "Court voids Baltimore law requiring 'no abortion' disclaimers at clinics", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T21:49:00.000+02:00", "replies_count": 0, "uuid": "13112b7dd0b07c54e9f07bc37642013e6c15723e"}, "author": "", "url": "https://www.reuters.com/article/us-baltimore-abortion/court-voids-baltimore-law-requiring-no-abortion-disclaimers-at-clinics-idUSKBN1EU1X1", "ord_in_thread": 0, "title": "Court voids Baltimore law requiring 'no abortion' disclaimers at clinics", "locations": [], "entities": {"persons": [{"name": "j. harvie wilkinson iii", "sentiment": "none"}, {"name": "jonathan stempel", "sentiment": "none"}], "locations": [{"name": "baltimore", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "richmond", "sentiment": "none"}], "organizations": [{"name": "4th u.s. circuit court of appeals", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "greater baltimore center for pregnancy concerns", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 7:49 PM / in 8 minutes Court voids Baltimore law requiring 'no abortion' clinic disclaimers Jonathan Stempel 3 Min Read \n(Reuters) - A federal appeals court on Friday declared unconstitutional a Baltimore law requiring pregnancy clinics that do not offer or refer women for abortions to post signs disclosing that fact in their waiting rooms. \nThe 4th U.S. Circuit Court of Appeals ruled 3-0 that the law violated the First Amendment free speech rights of the Greater Baltimore Center for Pregnancy Concerns, a Christian nonprofit that provides prenatal services and counsels women on abortion alternatives. \nFriday’s decision in the nearly eight-year-old case followed dozens of court submissions from abortion rights, anti-abortion and religious freedom advocates, and came as the U.S. Supreme Court prepares to consider a similar case from California. \nMaryland’s largest city had argued that its 2009 law was meant to address deceptive advertising and reduce the potential health risks from waiting too long to have an abortion. \nCircuit Judge J. Harvie Wilkinson III, however, wrote for the Richmond, Virginia-based appeals court that Baltimore’s approach amounted to “too loose a fit” with those ends. \n“The ordinance forces the center to utter in its own waiting room words at odds with its foundational beliefs and with the principles of those who have given their working lives to it,” he wrote. “Without proving the inefficacy of less restrictive alternatives, providing concrete evidence of deception, or more precisely targeting its regulation, the city cannot prevail.” \nFriday’s decision upheld an October 2016 ruling by U.S. District Judge Marvin Garbis in Baltimore. \n“This court ruling means that we can do our job and the government can’t tell us what to say or how to say it,” the clinic’s executive director Carol Clews said in a statement. \nTen U.S. states with Republican attorneys general supported the clinic. \nSuzanne Sangree, a lawyer who argued Baltimore’s appeal, said the city was disappointed, and may appeal to the Supreme Court and perhaps also submit a brief in the California case. \nIn that case, the Supreme Court is expected by June to decide whether California violates the free speech rights of private “crisis pregnancy centers” opposed to abortion by requiring signs about how to obtain state-sponsored services including abortion and contraception. \nCalifornia Attorney General Xavier Becerra, a Democrat, has said the law, upheld by a federal appeals court in San Francisco in October 2016, helps inform women about their options. \nWilkinson called the California disclaimer “markedly different” from Baltimore‘s, and said a separate requirement that unlicensed clinics disclose their lack of licensing does not mention abortion. \nThe case is Greater Baltimore Center for Pregnancy Concerns Inc v Mayor and City Council of Baltimore et al, 4th U.S. Circuit Court of Appeals, No. 16-2325. Reporting by Jonathan Stempel in New York; Editing by Jonathan Oatis and Rosalba O'Brien", "external_links": [], "published": "2018-01-05T21:49:00.000+02:00", "crawled": "2018-01-05T21:57:03.015+02:00", "highlightTitle": ""}