{"organizations": [], "uuid": "03a2ba14ebc80e2f564088e5a9520ace87bd14ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-ford-veteran-jim-benintende-named-autoalert-chief-operations-officer.html", "country": "US", "domain_rank": 767, "title": "Ford Veteran Jim Benintende Named AutoAlert Chief Operations Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T21:00:00.000+02:00", "replies_count": 0, "uuid": "03a2ba14ebc80e2f564088e5a9520ace87bd14ed"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-ford-veteran-jim-benintende-named-autoalert-chief-operations-officer.html", "ord_in_thread": 0, "title": "Ford Veteran Jim Benintende Named AutoAlert Chief Operations Officer", "locations": [], "entities": {"persons": [{"name": "jim benintende", "sentiment": "negative"}, {"name": "mike dullea", "sentiment": "none"}, {"name": "benintende", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}], "locations": [{"name": "kansas city", "sentiment": "none"}, {"name": "mo.", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}], "organizations": [{"name": "ford", "sentiment": "negative"}, {"name": "ford motor co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KANSAS CITY, Mo., Jan. 18, 2018 /PRNewswire/ -- AutoAlert is pleased to announce that its new COO is long-time Ford Motor Co. executive Jim Benintende.\nA Ford employee who started on the assembly line, he eventually became the first President of its Middle East and Africa (MEA) business unit. Benintende led that venture from its 2013 inception until August 2016. During that time, he oversaw a business unit made up of 67 countries and 3,800 employees. Over that period Ford's Ranger truck production spiked by 46% and exports of the vehicle expanded to 150 countries.\nAfter leading the MEA Business Unit development, Benintende returned to the United States as Ford's Director of Sales Support to work on and facilitate the restructuring of the company's U.S. sales and service field force, improve its digital presence, and develop a \"go to market\" strategy for 2017. He retired from Ford in December 2016.\n\"AutoAlert is fortunate that Jim has joined the team,\" says AutoAlert CEO Mike Dullea. \"His strategic experience will help guide us as we continue to grow relationships with our current customers, and his experience overseas will help propel our rapid growth in international markets.\"\nAdds Benintende: \"I'm excited to join the AutoAlert team. Its track record of finding a better way to do business, for both dealerships and OEMs, is proven. My background will hopefully expand the reach of its already successful suite of products and services and continue to bolster its loyal customer base.\"\nBenintende worked at Ford from the ground up starting at age 20, as an assembly line worker. From there, he held a series of marketing and sales positions domestically until he was promoted, in 1993, as Sales Manager of Export Operations of Saudi Arabia and Egypt. In 2002, Benintende became Managing Director of Ford Middle East and North Africa.\nDuring his tenure at Ford, Benintende was known not only for his leadership skills, but for fostering the same qualities as a mentor to other employees through integrity, collaboration, respect, courage and overall team building.\nA pioneer in equity mining and new client engagement, AutoAlert was founded in 2002 and now leads the automotive industry in data-mining, communication platforms, and other software solutions. AutoAlert's technology bridges the communication gap between a dealership's management, employees, and customers, creating high-quality sales opportunities, increased gross margin, and improved customer retention.\nVisit www.autoalert.com to learn more about AutoAlert's software solutions for growing and supporting dealerships.\nCONTACT: Ryan Rigdon, ryan.rigdon@autoalert.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/ford-veteran-jim-benintende-named-autoalert-chief-operations-officer-300584771.html\nSOURCE AutoAlert", "external_links": ["http://www.mmsend50.com/link.cfm?r=T7p_p5TuufPrUdE7FPS8Eg~~&pe=Kc-ef48m9DMWP5T54PGc4gf_SZiMGD5RpTC1ECLT_BqKKC9ZV85dhudU8LI8ZpKBAkqQ7hBHH98_p5vPFWOn5w~~", "http://www.prnewswire.com/news-releases/ford-veteran-jim-benintende-named-autoalert-chief-operations-officer-300584771.html"], "published": "2018-01-18T21:00:00.000+02:00", "crawled": "2018-01-18T21:47:36.007+02:00", "highlightTitle": ""}