{"organizations": [], "uuid": "c99fb5c9e8aef49287cda0c967f36e3b0c975b67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/us-britain-eu-polls-icm/most-britons-favor-a-vote-on-final-brexit-terms-guardian-icm-poll-idUSKBN1FF2FE", "country": "US", "domain_rank": 408, "title": "Most Britons favor a vote on final Brexit terms: Guardian/ICM poll", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T02:05:00.000+02:00", "replies_count": 0, "uuid": "c99fb5c9e8aef49287cda0c967f36e3b0c975b67"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-eu-polls-icm/most-britons-favor-a-vote-on-final-brexit-terms-guardian-icm-poll-idUSKBN1FF2FE", "ord_in_thread": 0, "title": "Most Britons favor a vote on final Brexit terms: Guardian/ICM poll", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Most Britons would support a vote on whether or not to leave the European Union once the terms of departure are known, a poll by ICM for the Guardian newspaper said on Friday, but the result of a new vote would be too close to call.\nThe Guardian-ICM survey that found 47 percent of people favored a vote on the final Brexit deal, with 34 percent opposed. Excluding undecideds, 58 percent supported a new vote, giving it a 16-point lead over 42 percent who were against it.\nBritain has repeatedly ruled out the idea of giving the public a vote on the final Brexit deal, and Prime Minister Theresa May says the original vote must be accepted.\nHowever, some opponents of the government have said that Britons should have another vote as the government’s current proposals, such as leaving the EU’s single market and customs union, were decided upon after the 2016 referendum, which simply asked whether voters wanted to be in or out of the EU.\nEven two of Britain’s most prominent Brexit campaigners this month endorsed a second referendum on leaving the European Union to solidify support for a clear break with the bloc.\nBut one of them, Nigel Farage, later rowed back on his comments, saying he didn’t want a new vote but that Brexit campaigners needed to be prepared for one.\nPolls have generally shown muted appetite for reopening the Brexit question. Another, smaller Guardian/ICM poll in December found 45 percent of voters wanted Britain to leave the EU whatever happens in negotiations, with 32 percent favoring a second referendum.\nSurveys have also been divided as to whether another referendum would reverse the decision to leave the bloc. While Friday’s poll showed 51 percent of those with a view would vote to stay, polls gave Remain the edge before the 2016 referendum, which nevertheless produced a surprise Leave result.\n“On the results of this poll... the result of a second EU referendum would be far from a foregone conclusion,” Alex Turk, a senior research executive at polling firm ICM, told the Guardian.\nICM surveyed 5,075 people between January 10-19 using an online panel of participants, the polling firm said.\nReporting by Alistair Smout; editing by Stephen Addison\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T02:05:00.000+02:00", "crawled": "2018-01-27T00:08:09.004+02:00", "highlightTitle": ""}