{"organizations": [], "uuid": "756edfe951b0b1f2cd8847c99a1bdb4a191c0873", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225070443&w=1200&r=LYNXMPEE0O0CZ", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-halep/halep-outlasts-kerber-in-thriller-to-reach-final-idUKKBN1FE0SR", "country": "US", "domain_rank": 408, "title": "Halep outlasts Kerber in thriller to reach final", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T10:12:00.000+02:00", "replies_count": 0, "uuid": "756edfe951b0b1f2cd8847c99a1bdb4a191c0873"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-halep/halep-outlasts-kerber-in-thriller-to-reach-final-idUKKBN1FE0SR", "ord_in_thread": 0, "title": "Halep outlasts Kerber in thriller to reach final", "locations": [], "entities": {"persons": [{"name": "halep", "sentiment": "negative"}, {"name": "angelique kerber", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "caroline wozniacki", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 8:12 AM / Updated 10 hours ago Halep outlasts Kerber in thriller to reach final Martyn Herman 4 Min Read \nMELBOURNE (Reuters) - World number one Simona Halep quelled a tenacious Angelique Kerber fightback and saved two match points to reach her first Australian Open final with a riveting 6-3 4-6 9-7 victory on Rod Laver Arena on Thursday. \nA wildly unpredictable match veered one way, then the other, before the Romanian ended Kerber’s resistance on her fourth match point in a spellbinding deciding set that pushed both players to the limit of their endurance. \nFormer champion Kerber, who won only five points in losing the opening five games, was jelly-legged at times but fought off two match points in the 10th game of the third set before seeing two of her own come and go two games later. \nIn the end Halep’s insatiable desire for a maiden grand slam title proved the greater force as an exhausted Kerber struck a backhand over the baseline. \nHalep will now face Denmark’s Caroline Wozniacki in the first Australian Open final between two players still chasing a first major since 1980. On top of that the showdown between the top two seeds will have the number one ranking on the line. \n“I feel happy. I feel proud that I could stay there and fight till the end,” said Halep who has fought for 12 hours and 16 minutes to reach her third grand slam final and saved match points against American Lauren Davis in a third-round epic. \n“I tried to be calm but today I was like a rollercoaster, up and down. But I was not afraid of losing, so maybe that’s why I won those match points.” \nShe will need to dredge the depths of her energy reserves against Wozniacki if she is to join the grand slam winners’ circle after falling at the last hurdle twice in Paris. \n“If it’s going to come, it’s going to come,” added the 26-year-old. \nHalep predicted a marathon against former world number one Kerber but when she charged to a 5-0 lead in 14 minutes it looked as though she might have caught the German on an off-day. Tennis - Australian Open - Semifinals - Rod Laver Arena, Melbourne, Australia, January 25, 2018. Simona Halep of Romania reacts during her match against Angelique Kerber of Germany. REUTERS/Edgar Su CATCHING FIRE \nBut Kerber roused herself to win 12 of the next 13 points and although Halep closed the set, the touch-paper had been lit and the match caught fire. \nIt felt like Halep was turning the screw when she ran a red-faced Kerber into the ground to seize a 3-1 lead in the second set and had a point for 4-1 lead. Slideshow (6 Images) \nBut Kerber fought back, saving two break points at 3-4 and then fending off a flurry of Halep backhands to hold. \nWith Kerber in lockdown mode Halep’s patience snapped in the next game as she put a backhand into the tramlines to drop serve before 21st seed Kerber held to level the match. \nAt various times in the 69-minute decider, the players were left propping themselves up with their rackets, lungs heaving, as the rallies grew ever more excruciating. Related Coverage Halep reaps reward for aggressive approach \nKerber won a 22-point exchange featuring drop shots, moon balls and impossible gets to break at the start of the third, but it took its toll and Halep hit back immediately and eventually worked her way into a 5-3 lead. \nKerber was literally on her knees when she struck a sensational backhand to win a 26-point exchange to break back before saving two match points to make it 5-5. \nHalep began to feel the strain, shooting angry looks at her coach Darren Cahill as Kerber broke for 6-5, then led 40-15, only for Houdini-like Halep to extricate herself with some courageous deep hitting. \nIt was exhausting to watch as the battle raged on but Halep found some extra aggression, crashing two forehand winners for an 8-7 lead before holding her nerve to finish it. Reporting by Martyn Herman; Editing by John O'Brien and Catherine Evans", "external_links": [], "published": "2018-01-25T10:12:00.000+02:00", "crawled": "2018-01-25T10:35:49.095+02:00", "highlightTitle": ""}