{"organizations": [], "uuid": "3a26040b2782a168186daa94f4d23b7bbe09f36e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-venezuela-politics-factbox/factbox-who-could-run-for-venezuelas-presidency-idUSKBN1FE2QO", "country": "US", "domain_rank": 408, "title": "Factbox: Who could run for Venezuela's presidency?", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T20:30:00.000+02:00", "replies_count": 0, "uuid": "3a26040b2782a168186daa94f4d23b7bbe09f36e"}, "author": "", "url": "https://www.reuters.com/article/us-venezuela-politics-factbox/factbox-who-could-run-for-venezuelas-presidency-idUSKBN1FE2QO", "ord_in_thread": 0, "title": "Factbox: Who could run for Venezuela's presidency?", "locations": [], "entities": {"persons": [{"name": "rafael ramirez", "sentiment": "none"}, {"name": "chavez", "sentiment": "none"}, {"name": "maduro", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}, {"name": "hugo chavez", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "socialist party", "sentiment": "none"}, {"name": "pdvsa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 6:31 PM / a minute ago Factbox: Who could run for Venezuela's presidency? Reuters Staff 5 Min Read \n(Reuters) - Venezuela is to hold a presidential election before April 30, with the ruling socialists hoping to keep power against an opposition whose most popular figures are barred from standing. \nThe following are confirmed or aspiring candidates: NICOLAS MADURO \nThe 55-year-old president and self-described “son” of former leader Hugo Chavez is seeking re-election after being in power since 2013. Despite massive opposition protests against him last year, an unprecedented economic crisis, and international sanctions, Maduro has consolidated political power at home and will run for the ruling Socialist Party. The former bus driver and long-serving foreign minister is the favorite to win given his party’s political grip on Venezuela, opposition disarray, a complicit national election board and vote-winning state food handouts. RAFAEL RAMIREZ \nThe once powerful former oil minister and head of state energy company PDVSA was a major figure throughout Chavez’s 1999-2013 rule, but became increasingly estranged from Maduro. After the 54-year-old Ramirez vociferously criticized Maduro’s running of Venezuela’s economy, they split late last year and he was ordered out of his last government post as U.N. envoy in New York. Ramirez has gone into exile, in an unknown destination, from where he has accused Maduro of betraying “Chavismo” and stated he would like to run against him for president. Given that the Venezuelan government has accused him of involvement in a multimillion-dollar corruption scheme, an allegation that Ramirez has denied, it seems impossible that he could run. HENRI FALCON \nThe 56-year-old former governor of Lara state, who left the Socialist Party in 2010 to join the opposition, was quick to declare his candidacy after the announcement of the presidential vote. Falcon has long been viewed as someone who could potentially appeal across both sides of Venezuela’s political divide. But his defection from the ruling party has led some government loyalists to call him a “traitor,” while his socialist roots have also raised suspicions among opposition supporters. The former military man and self-styled center-leftist politician managed the 2013 presidential campaign of opposition leader Henrique Capriles, who narrowly lost to Maduro. HENRY RAMOS \nThe pugnacious 74-year-old veteran lawyer and leader of Venezuela’s oldest active political party, Democratic Action, has said he wants to run but will also respect primaries to select a unity candidate for the opposition coalition. Knowing he is unpopular among young opposition supporters, Maduro has repeatedly urged Ramos to stand against him. The wily and sharp-talking Ramos commands a powerful party machinery: Democratic Action took the largest number of seats in a 2015 congress vote. Always controversial, a U.S. ambassador once described Ramos as “abrasive” and “arrogant,” and Maduro has branded him a “fascist dinosaur.” ANDRES VELASQUEZ \nThe 64-year-old former governor of southern Bolivar state and leader of the Radical Cause party is interested in standing for president, but has also said the conditions are not free and fair, and he will wait to see what the opposition coalition decides. The former steel union representative ran for the governorship of Bolivar state again last year, but lost narrowly to a government candidate in what he and supporters say was a clear example of ballot fraud. LORENZO MENDOZA \nThe long-haired, 52-year-old head of Venezuela’s largest private business, Polar, is mooted by many as a possible “outside” candidate. But he has given no indication of wanting to stand. Venezuelans are generally fond of the Venezuelan company, which produces beer and flour for the national staple ‘arepa’ cornmeal pancakes, and U.S.-educated Mendoza is widely viewed as a competent business leader. The government, however, has accused him of being part of a capitalist conspiracy and threatened to nationalize Polar facilities as punishment for alleged hoarding and price-gouging. Of late, when he appears in public, crowds have chanted “presidente, presidente!” HENRIQUE CAPRILES/LEOPOLDO LOPEZ \nFormer state governor Henrique Capriles and protest leader Leopoldo Lopez are the most popular opposition leaders, and would both love to run against Maduro. But Capriles, 45, is barred from standing over alleged “administrative irregularities” during his running of Miranda state. Lopez, 46, is under house arrest and serving a 15-year sentence on charges of fomenting violence and terrorism. Critics say Maduro has sidelined them because either would beat him easily. Reporting by Andrew Cawthorne and Leon Wietfeld; Editing by Brian Ellsworth and Tom Brown", "external_links": [], "published": "2018-01-25T20:30:00.000+02:00", "crawled": "2018-01-25T20:46:39.000+02:00", "highlightTitle": ""}