{"organizations": [], "uuid": "30a94f210929ed0245a3dda303b517fcd99e8aba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-metals-ahome/column-five-stand-outs-in-chinas-base-metals-trade-last-year-andy-home-idUSL8N1PO45W", "country": "US", "domain_rank": 408, "title": "COLUMN-Five stand-outs in China's base metals trade last year: Andy Home", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:01:00.000+02:00", "replies_count": 0, "uuid": "30a94f210929ed0245a3dda303b517fcd99e8aba"}, "author": "", "url": "https://www.reuters.com/article/china-metals-ahome/column-five-stand-outs-in-chinas-base-metals-trade-last-year-andy-home-idUSL8N1PO45W", "ord_in_thread": 0, "title": "COLUMN-Five stand-outs in China's base metals trade last year: Andy Home", "locations": [], "entities": {"persons": [{"name": "andy", "sentiment": "negative"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "kazakhstan", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "tmsnrt.rs/2Ejo8HN LEAD TURNAROUND \nChina flipped from marginal net exporter of refined lead in the previous four years to big importer in 2017. \nIndeed, net imports of 70,900 tonnes were the second highest ever, eclipsed only in 2009, a year of global financial and trade upheaval. \nTwo countries accounted for the bulk of last year’s inbound flows, Australia with 39,400 tonnes and Kazakhstan with 26,300 tonnes. \nWhat caused this dramatic reversal in trade patterns? \nIt was a combination of the steady global tightening in mined raw materials availability and disruption to domestic supply, particularly in the scrap sector, from waves of environmental inspections. \nIt’s worth noting that China’s imports of lead concentrates at 1.28 million tonnes bulk weight were the lowest since 2008. \nAll imports from North Korea, China’s fourth largest supplier in 2016, stopped in the fourth quarter of last year due to international sanctions. \nThat leaves China ever more dependent on an already stretched international supply chain and its ability to secure raw materials this year will determine its appetite for more metal in refined form. \nThe pace of refined lead imports dropped sharply in the fourth quarter, suggesting the scramble for units in the domestic market has diminished. \nBut for how long? \ntmsnrt.rs/2Eiu4AI \nZINC‘S LATE-YEAR SURGE \nAfter a slow start China’s imports of refined zinc steadily accelerated over the second half of the year to reach a record monthly high of 122,814 tonnes in November. \nThe annual count of 675,00 tonnes was also an all-time high, just beating the 670,000 tonnes imported in 2009. \nThe top two suppliers were Australia (164,000 tonnes) and Spain (161,000 tonnes). The former has long been a core shipper to China but Spain only sporadically so in the past. \nThe scale of imports over November and December, a cumulative 224,000 tonnes, suggests these “imports” were metal being customs cleared after sitting in bonded warehouses at Chinese ports. \nThat said, stronger imports fit well within zinc’s narrative of physical supply chain tightness and if they continue at this sort of pace, China’s trade figures will add further fuel to zinc’s already raging bull fires. \nContrarians may want to take note of the 22 percent increase in imports of mined zinc concentrates, suggesting that China is winning its share of raw materials in a tough market. \nGraphic on China’s copper scrap imports: \nChina's scrap imports: tmsnrt.rs/2DfjoSY COPPER SCRAP IN FOCUS \nChina’s net imports of refined copper dropped 9 percent last year to 2.9 million tonnes, the second consecutive year of reduced appetite for overseas metal. \nThat could change this year, though, depending on what happens to China’s copper scrap imports. \nScrap has been an important, albeit often overlooked, part of China’s copper dynamics for many years. \nThe country’s imports of secondary material seemed to be locked in a long-term downtrend until last year, when they rose by 6 percent to 3.56 million tonnes in bulk weight. \nImproved global supply was a key factor in the turnaround as a rising copper price unlocked material that had been bought at higher prices. \nStronger inbound flows may also have been down to traders maximising their import quotas ahead of potentially massively disruptive rule changes on scrap this year. \nIf fully implemented, the new regulations on quality and purity levels could lead to an almost complete cessation of copper scrap imports. \nIt seems almost inconceivable that China would shut off such an important alternative supply of copper, but the level of 2018 import quotas granted so far points to a drastic reduction. \nThe precedent for what might happen this year is already there in China’s ban on imports of plastic waste, a largely unexpected move that has sent shockwaves down the plastics supply chain. NICKEL - FEAST AND FAMINE \nAny lingering fears that resource nationalism in Indonesia and the Philippines would starve Chinese nickel pig iron (NPI) producers of raw material should be laid to rest. \nSure, imports of nickel ore from the Philippines dropped 5 percent last year to 29.11 million tonnes but Indonesia returned to help plug any gap. \nImports of Indonesian ore rocketed tenfold to 3.84 million tonnes as that country’s government partly reversed its previous ban on exports of unprocessed minerals. \nThe offshoring of Chinese NPI production to Indonesia, meanwhile, continues apace, with the flow of such material back to China surging 32 percent last year to almost 1 million tonnes. \nAmid this feast of raw materials, look no further to understand why China’s imports of refined nickel slumped 38 percent last year. \nThere was, however, a noticeable pick-up in December itself. At 40,500 tonnes net imports were the highest they’d been since April 2016. \nRussian material accounted for half that amount, which is significant since the London Metal Exchange will start in April the delisting process for two Norilsk Nickel brands of nickel commonly used by metals financiers. \nBoth brands remain deliverable to the Shanghai Futures Exchange, raising the possibility of a mass relocation of Russian metal into China. \nWas December’s high tally an end-of-year one-off or the start of something bigger? TIN AND THE MYANMAR TRADE \nChina’s net imports of refined tin collapsed to just 1,800 tonnes last year, the lowest level in a decade. \nThis is down to the flow of raw materials from neighbouring Myanmar, which has allowed Chinese smelters to lift output despite challenged domestic mine supply. \nImports of tin concentrate from Myanmar fell 38 percent at a headline level in 2017 but that is misleading. Tin producers’ association ITRI argues that improving grades in the Myanmar material meant that in contained tin terms imports were actually 7 percent higher in the first 11 months of 2017. \nMyanmar’s ability to keep supplying tin concentrates at the pace of recent years is the critical dynamic in both the Chinese and global tin markets. \nJust beware the headline figure! Editing by Susan Fenton", "external_links": [], "published": "2018-01-29T16:01:00.000+02:00", "crawled": "2018-01-29T16:22:25.007+02:00", "highlightTitle": ""}