{"organizations": [], "uuid": "47e2d125faf9d3cfc526f1a31fdd54ecb82bcd67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222776657&w=1200&r=LYNXMPEE0G1B7", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-verizon-nba/verizon-renews-nba-deal-as-it-seeks-to-be-go-to-screen-for-sports-idUSKBN1F625R", "country": "US", "domain_rank": 408, "title": "Verizon renews NBA deal as it seeks to be go-to screen for sports", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.056, "site_type": "news", "published": "2018-01-18T00:43:00.000+02:00", "replies_count": 0, "uuid": "47e2d125faf9d3cfc526f1a31fdd54ecb82bcd67"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-verizon-nba/verizon-renews-nba-deal-as-it-seeks-to-be-go-to-screen-for-sports-idUSKBN1F625R", "ord_in_thread": 0, "title": "Verizon renews NBA deal as it seeks to be go-to screen for sports", "locations": [], "entities": {"persons": [{"name": "brian angiolet", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "verizon", "sentiment": "negative"}, {"name": "nba", "sentiment": "negative"}, {"name": "verizon communications", "sentiment": "negative"}, {"name": "national basketball association", "sentiment": "negative"}, {"name": "yahoo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 4:43 PM / a few seconds ago Verizon renews NBA deal as it seeks to be go-to screen for sports Jessica Toonkel 3 Min Read \n(Reuters) - Verizon Communications has renewed its deal with the National Basketball Association for two years, allowing users to live-stream games on its Yahoo platform and mobile devices and access out-of market live games. \nVerizon will partner with the NBA to create original content as well as establish a technology innovation fund to experiment with new formats, such as virtual reality, executives at Verizon and the NBA told Reuters. \nThe new deal opens up Yahoo’s pro-basketball fantasy sports to Verizon users globally. The companies declined to comment on the terms of the agreement. \nVerizon is seeking to make live sports a focus in the wake of last year’s acquisition of Yahoo, said Brian Angiolet, global chief media and content officer at Verizon. \nLive sports is valuable for advertisers because viewers are willing to pay for it and watch it for long periods of time in real-time. There is increasing competition between broadcasters, tech companies and cable operators for live sports rights as it remains one of the few areas where viewers watch in real-time. \nLast month, Verizon paid around $2.25 billion for a five-year partnership with the National Football League for non-exclusive rights that include games on its Yahoo and Oath sites. \nIt has spent the past several months renewing deals for its FIOs TV service that enable it to also include more live sports and other league-related content on its digital Oath and Yahoo platforms. \nFor example, Verizon recently signed TV distribution deals with Spanish language broadcaster Univision Communications and A&E that include Mexican soccer league Liga MX and National Women’s Soccer League games respectively on Yahoo. \n“We want to be the first screen consumers go to find live sports,” Angiolet said. \nThe NBA is looking to tap Verizon’s data and technology to help it continue to reformat its game telecasts to appeal to younger fans, said Bill Koenig, NBA president, global content and media distribution. \nAnother attractive element for the NBA about the deal is the marriage of Verizon’s data with fantasy sports presence, he said. \nYahoo has tens of millions of fantasy players and its users spend 30 billion minutes playing fantasy sports every year, according to Verizon. \n“Fantasy is a good business on its own, but we think fantasy can be an important driver to becoming deeper fans and watching more telecasts,” Koenig said. Reporting By Jessica Toonkel; Editing by Susan Thomas", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T00:43:00.000+02:00", "crawled": "2018-01-17T18:44:15.027+02:00", "highlightTitle": ""}