{"organizations": [], "uuid": "59361cf434f980421bd2c9e0baa49c024163cca0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-one-equity-partners-acquires-majority-share-in-ericsson-media-solutions.html", "country": "US", "domain_rank": 767, "title": "One Equity Partners Acquires Majority Share in Ericsson Media Solutions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.986, "site_type": "news", "published": "2018-01-31T16:00:00.000+02:00", "replies_count": 0, "uuid": "59361cf434f980421bd2c9e0baa49c024163cca0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-one-equity-partners-acquires-majority-share-in-ericsson-media-solutions.html", "ord_in_thread": 0, "title": "One Equity Partners Acquires Majority Share in Ericsson Media Solutions", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "ericsson media solutions", "sentiment": "negative"}, {"name": "one equity partners", "sentiment": "negative"}, {"name": "media solutions", "sentiment": "none"}, {"name": "ericsson", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 31, 2018 /PRNewswire/ -- One Equity Partners, a leading middle market private equity firm, today announced that it has signed an agreement to acquire a majority stake in Media Solutions, a global provider of media processing, delivery and TV service platforms, from Ericsson (NASDAQ:ERIC). Ericsson will continue to own a 49% stake in the Company. Additional terms of the private transaction were not disclosed.\nOver the last several years, Ericsson has transformed Media Solutions' products with a cloud-enabled, standards-based, integrated end-to-end roadmap. The overall mission has been to advance video service delivery with state-of-the-art infrastructure and software. At the same time, all products and operations have been upgraded to match Ericsson's carrier-grade standards for reliable telecommunications operations and services.\nUpon completion of this transaction, Media Solutions will be positioned as a premier independent pure-play video software technology vendor. Today, all of Media Solutions' next-generation software products, platforms and services have been reengineered to support rapidly evolving media consumption patterns with microservices-based software and managed services that can be deployed flexibly in both public and private cloud infrastructures. Media Solutions delivers these products and services at scale to:\n9 of the top 10 global telecommunications companies 9 of the top 10 global cable companies 9 of the top 10 global satellite operators 8 of the top 10 broadcast/media companies TV platform used every day by over 18 million pay-TV subscribers in 26 countries and regulatory environments Enabling the delivery of class-leading digital media services to over 1bn homes globally Recording 3m video assets daily, with over 200 petabytes of time-shifted video storage deployed More than 100,000 events per second tracked by its combined analytics data warehouse 6 Technology and Engineering Emmys for our industry-leading technology\nAngel Ruiz, who will continue to lead Media Solutions as the CEO, says: \"The work we have done to integrate and advance our end-to-end roadmap is paying off in strong customer engagement. One Equity Partners brings valuable experience in the media and telecom sectors, and we're confident that we have found the right partner to further develop and grow the business.\"\nAndrew Dunn, Managing Director of One Equity Partners, says: \"We are thrilled to partner with Ericsson to grow Media Solutions. We look forward to supporting the customers of Media Solutions with continuing investment in strategic technology innovation.\"\nJamie Koven, Senior Managing Director of One Equity Partners, says: \"Angel and his team have done a great job with Media Solutions. The technology is industry-leading, the customers are world class, and we are excited by the prospect of working with this team on the opportunity ahead.\"\nMedia Solutions employees and contractors, as well as specified assets and liabilities, will transfer to a newly formed company upon closing. Ericsson and One Equity Partners are committed to a seamless transition for employees, customers, partners and suppliers.\nOEP has a strong track record investing in and growing market-leading technology businesses, including European IT system and integration provider Lutech, and Zodiac, a supplier of cloud and embedded software solutions to multichannel video programming distributors.\nThe transaction is subject to customary closing conditions, including regulatory approval.\nAbout One Equity Partners\nOEP is a middle-market private equity firm focused on the industrial, healthcare, and technology sectors in North America and Europe. The firm builds market-leading companies by identifying and executing transformative business combinations. OEP is a trusted partner with a differentiated investment process, a broad and senior team, and an established track record generating long-term value for its partners. Since 2001, the firm has completed more than 150 transactions worldwide. OEP, founded in 2001, spun out of JP Morgan in 2015. The firm has offices in New York, Chicago, and Frankfurt. For more information, please visit www.oneequity.com .\nAbout Media Solutions\nEricsson Media Solutions has a longstanding and broad customer base in cable, satellite, and telecom service providers, as well as major broadcasters. Globally, Ericsson Media Solutions serves over 900 operators, service providers, broadcasters, content providers and aggregators. The wide-ranging media portfolio of end-to-end offerings includes Emmy award-winning hardware and software video compression solutions for Contribution and Direct-to-Consumer video service distribution, advertising and content personalization solutions, high efficiency Cloud DVR, and TV and video delivery platforms. Ericsson Media Solutions has approximately 1,600 employees operating out of multiple locations across the globe.\nView original content: http://www.prnewswire.com/news-releases/one-equity-partners-acquires-majority-share-in-ericsson-media-solutions-300590904.html\nSOURCE One Equity Partners", "external_links": ["http://www.prnewswire.com/news-releases/one-equity-partners-acquires-majority-share-in-ericsson-media-solutions-300590904.html"], "published": "2018-01-31T16:00:00.000+02:00", "crawled": "2018-01-31T15:55:14.000+02:00", "highlightTitle": ""}