{"organizations": [], "uuid": "3ea9eb3fce959740f613aca5405c5127fb4d9b41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104926570-GettyImages-900452292.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/trumps-pakistan-action-could-raise-costs-of-afghan-war-analysts-say.html", "country": "US", "domain_rank": 767, "title": "Trump's Pakistan action could raise costs of Afghan war, analysts say", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.149, "site_type": "news", "published": "2018-01-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "3ea9eb3fce959740f613aca5405c5127fb4d9b41"}, "author": "Jeff Daniels", "url": "https://www.cnbc.com/2018/01/04/trumps-pakistan-action-could-raise-costs-of-afghan-war-analysts-say.html", "ord_in_thread": 0, "title": "Trump's Pakistan action could raise costs of Afghan war, analysts say", "locations": [], "entities": {"persons": [{"name": "asif hassa", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "nikki haley", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "karachi", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "difa-e-pakistan council", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Besides withholding financial aid, some experts are suggesting the Trump administration impose sanctions and travel restrictions on Pakistan to pressure it stop providing a safe haven for terrorists.\nYet such action comes with risks that it could raise the cost of the Afghanistan war and jeopardize the U.S.-led coalition's access to key Pakistani supply lines, according to national security analysts.\nIn his first tweet of 2018, President Donald Trump on Monday vented that Pakistan has already received more than $33 billion in U.S. in the past 15 years and \"given us nothing but lies & deceit.\"\nhttps://twitter.com/realDonaldTrump/status/947802588174577664\nThen, Nikki Haley, the U.S. ambassador to the United Nations, announced Tuesday the U.S. will withhold $255 million in assistance to Pakistan. \"They work with us at times, and they also harbor the terrorist that attack our troops in Afghanistan,\" she said. \"That game is not acceptable to this administration.\"\n\"We could actually recognize that Pakistan isn't a friend but is an enemy, and then calibrate our policies accordingly,\" said Bill Roggio, a senior fellow at the Foundation for Defense of Democracies, a Washington-based hawkish think tank.\nRoggio suggests Washington impose sanctions on Pakistan and unleash travel restrictions on some individuals as a way to get Islamabad to change course. Also, he said the U.S. could formally designate Pakistan as a state sponsor of terrorism.\nReuters reported Wednesday that the administration has been letting members of Congress know it plans to cut \"security assistance\" to Pakistan.\nAnalysts say calling out Pakistan's \"games\" is long overdue, but it still comes with risks.\n\"It will increase the violence in Afghanistan and make any U.S. progress in Afghanistan much more complicated and expensive,\" said Bharath Gopalaswamy, director of the South Asia Center at the Atlantic Council, a Washington think tank.\nSpecifically, Gopalaswamy said the U.S. coalition's logistics supply to Afghanistan could suffer if Pakistan cuts access. Also, he said, the U.S. may ultimately \"push Pakistan more into the Chinese orbit.\"\nIndeed, Pakistan's top diplomat this week threatened that Islamabad might shift policies away from the U.S. and establish closer ties with Russia and China . In addition, the Pakistan central bank plans to use the Chinese yuan for bilateral trade and investment activities with Beijing.\n\"The administration is facing a set of questions that all previous U.S. administrations have faced in the last 18 years,\" said Alyssa Ayres, who served in the State Department during the Obama administration and now is a senior fellow at the Council on Foreign Relations, a nonpartisan think tank based in Washington.\nThe U.S. has spent well over $800 billion fighting the Afghanistan conflict, and there have been more than 2,400 U.S. military fatalities and tens of thousands of soldiers wounded.\nOn Monday, a U.S. Special Forces soldier was killed by enemy fire in an area where the coalition forces have been battling the Taliban and an affiliate of the Islamic State. It followed at least 15 deaths last year of U.S. service members in Afghanistan.\nAyres said 2011 was one of the worst years of U.S.-Pakistani relations when U.S. forces killed Osama bin Laden in a raid on his compound in Pakistan. It led the Pakistanis to then shut supply routes for the U.S.-led coalition fighting in Afghanistan. However, those routes later got reopened but Ayres said there's a chance Pakistan could shut them again.\nIf the supply lines do get cut, defense experts say, it could make the Afghanistan war costlier to wage from an economic standpoint. Even so, the number of U.S. troops in Afghanistan today is far below the roughly 100,000 forces that were in the country during the peak in 2011 so presumably any impacts maybe lessened.\nThere are approximately 14,000 U.S. forces in Afghanistan, according to the Pentagon.\nA Department of Defense spokesman was asked Wednesday about how critical the Pakistan supply routes are today for the U.S.-led troops in Afghanistan.\n\"Due to operational security, we won't be able to provide a specific percentage of U.S. supplies going into Afghanistan through multiple routes,\" he said. \"While the U.S. favors shipping cargo via Pakistan because of cost, we have built flexibility and redundancy into our overall system of air, sea, and ground routes to transport cargo into and out of Afghanistan.\"\nSome believe the U.S. military in 2018 will accelerate the use of drone strikes against terrorist networks in tribal regions of Pakistan. This includes the U.S. targeting the Taliban-affiliated Haqqani terror network, which has conducted attacks in Afghanistan and has links to al-Qaeda.\nThere were eight U.S. drone counter-terrorism strikes during 2017 in Pakistan compared with just three in 2016 and 117 strikes in 2010, according to figures from the Foundation for Defense of Democracies .\n\"The Obama administration tried to wind it down,\" said Roggio. He said the Trump administration was \"trying to be judicious\" with just eight strikes in 2017, although given the president's frustration over Pakistan now \"I don't expect the U.S. to pull punches this year.\"", "external_links": [], "published": "2018-01-03T02:00:00.000+02:00", "crawled": "2018-01-04T16:34:16.007+02:00", "highlightTitle": ""}