{"organizations": [], "uuid": "a8fb8cf950b3f321e442af90f5a433669d20534c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226817340&w=1200&r=LYNXMPEE0U06S", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-sport-doping-wada-bottles/doping-usada-chief-says-simple-fix-to-testing-bottles-issue-idUSKBN1FK0ER", "country": "US", "domain_rank": 408, "title": "Doping: USADA chief says 'simple' fix to testing bottles issue", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T06:29:00.000+02:00", "replies_count": 0, "uuid": "a8fb8cf950b3f321e442af90f5a433669d20534c"}, "author": "", "url": "https://www.reuters.com/article/us-sport-doping-wada-bottles/doping-usada-chief-says-simple-fix-to-testing-bottles-issue-idUSKBN1FK0ER", "ord_in_thread": 0, "title": "Doping: USADA chief says 'simple' fix to testing bottles issue", "locations": [], "entities": {"persons": [{"name": "tygart", "sentiment": "none"}, {"name": "travis tygart", "sentiment": "none"}], "locations": [{"name": "cologne", "sentiment": "none"}], "organizations": [{"name": "usada", "sentiment": "negative"}, {"name": "international olympic committee", "sentiment": "none"}, {"name": "world anti-doping agency", "sentiment": "none"}, {"name": "u.s. anti-doping agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ioc", "sentiment": "none"}, {"name": "gene cherry", "sentiment": "none"}, {"name": "wada", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 4:33 AM / in 6 hours Doping: No need for panic action over testing bottles, says anti-doping group Gene Cherry 3 Min Read \n(Reuters) - Anti-doping officials do not need to take panic actions over a potential integrity issue with new doping sample collection bottles, the global group of national anti-doping organizations told Reuters on Wednesday. \nThe new generation bottles, introduced after the 2014 Sochi Olympics doping scandal, are being investigated after the accredited laboratory in Cologne said it had discovered they might be susceptible to manual opening on freezing. \nThe International Olympic Committee (IOC) said on Monday it was very concerned about the issue just ahead of next month’s Pyeongchang Winter Games, where the bottles are due to be used. \nBut Graeme Steel, chief executive officer of the Institute of National Anti-Doping Organizations (iNADO), downplayed the severity of the problem. \n“While there is apparently a potential for a small proportion of sample bottles which have been frozen to be opened, without evidence, there is no immediate need to take panic measures,” Steel told Reuters via email. \n“Any problem is easily discovered and, if it comes to it, the result management process should ensure that athletes cannot be found to have committed rule violations if the integrity of the sample can be brought into legitimate doubt.” \nHe said iNADO was continuing to gather information on the bottles and would issue more complete advice to its member organizations shortly. SIMPLE WORKAROUND \nTravis Tygart, chief executive of the U.S. Anti-Doping Agency (USADA), said there was a simple workaround for the collection bottles and no major changes were needed for the Winter Olympics, which begin on Feb. 9 in South Korea. \n“I think the simple solution for the Games is that they just don’t freeze any of the samples until the full analysis is completed,” Tygart told Reuters in a telephone interview. \n“Based on what we understand that will cure this problem.” \nThe bottles are used to collect and store urine and/or blood samples when an athlete undergoes a doping control test. \n“What we have been able to verify is it is a very rare occurrence in the bottle caps, and it happens to some bottles but not all,” Tygart said. \n”When those bottles are frozen for a period of time at less than -5 degrees Fahrenheit, the caps can come loose. \n“If the bottle has been frozen, and the cap is one of the rare ones that becomes unsealed, that may have created a technicality for a doped athlete to walk,” Tygart said. \n“On the one hand it is extremely frustrating,” he said of the problems with the bottles, “but on the other, it is a good thing when potential holes in the global anti-doping system are exposed so that they can be fixed.” \nThe manufacturer, Berliner Special AG, told the World Anti-Doping Agency (WADA) it was unable to replicate the issue when the security bottles were handled according to the product’s instructions, WADA said. \nWADA added that it would be updating relevant stakeholders shortly on what its investigation had found. Editing by Peter Rutherford and Ken Ferris", "external_links": [], "published": "2018-01-31T06:29:00.000+02:00", "crawled": "2018-01-31T06:43:16.001+02:00", "highlightTitle": ""}