{"organizations": [], "uuid": "ae98f20b41455102b9f7102bc45e677b75a76909", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-elbit-systems-of-america-names-brian-sinkiewicz-as-senior-vice-president-of-airborne-solutions.html", "country": "US", "domain_rank": 767, "title": "Elbit Systems of America Names Brian Sinkiewicz as Senior Vice President of Airborne Solutions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.236, "site_type": "news", "published": "2018-01-23T14:30:00.000+02:00", "replies_count": 0, "uuid": "ae98f20b41455102b9f7102bc45e677b75a76909"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-elbit-systems-of-america-names-brian-sinkiewicz-as-senior-vice-president-of-airborne-solutions.html", "ord_in_thread": 0, "title": "Elbit Systems of America Names Brian Sinkiewicz as Senior Vice President of Airborne Solutions", "locations": [], "entities": {"persons": [{"name": "brian sinkiewicz", "sentiment": "negative"}, {"name": "brian", "sentiment": "none"}, {"name": "sinkiewicz", "sentiment": "none"}], "locations": [{"name": "fort worth", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "elbit systems of america", "sentiment": "negative"}, {"name": "airborne solutions", "sentiment": "negative"}, {"name": "sensor systems", "sentiment": "none"}, {"name": "textron systems corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT WORTH, Texas, Elbit Systems of America, LLC (NASDAQ: ESLT and TASE: ESLT), announced today that Mr. Brian Sinkiewicz has joined the company as Senior Vice President of its Airborne Solutions business unit.\nSinkiewicz comes to Elbit Systems of America from Textron Systems Corporation, where he most recently served as Senior Vice President and General Manager for the Weapon and Sensor Systems business.\nIn his new role, Sinkiewicz will be responsible for the overall performance, growth and customer engagement for the company's extensive portfolio of airborne solutions for U.S. and allied military customers. These solutions include intelligent pilot interface solutions, such as advanced cockpit and helmet mounted display systems; laser and dual-mode seekers for precision guided munitions; advanced aviation threat detection systems; and embedded avionics for aircraft communications, mission processing, and training and simulation.\n\"Brian's reputation and extensive experience in our industry exemplify a customer-first approach that aligns with our mission to provide innovative solutions for protecting and saving lives,\" commented Raanan Horowitz, President and Chief Executive Officer of Elbit Systems of America. \"We look forward to Brian's leadership and contributions in helping Elbit America deliver advanced solutions that provide our military pilots the decisive edge in mission effectiveness.\"\nSinkiewicz earned a Bachelor's Degree in Business Administration from Bryant University, and a Master of Business Administration from Northeastern University.\nFor more information on Elbit Systems of America, please visit: www.ElbitAmerica.com\nAbout Elbit Systems of America, LLC\nElbit Systems of America is a leading provider of high performance products, system solutions, and support services focusing on the defense, homeland security, commercial aviation, and medical instrumentation markets. With facilities throughout the United States, Elbit Systems of America is dedicated to supporting those who contribute daily to the safety and security of the United States. Elbit Systems of America, LLC is wholly owned by Elbit Systems Ltd. (NASDAQ: ESLT and TASE: ESLT), a global high technology company engaged in a wide range of programs for innovative defense and commercial applications. For additional information, visit: www.elbitsystems-us.com or follow us on Twitter .\nAbout Elbit Systems\nElbit Systems Ltd. is an international high technology company engaged in a wide range of defense, homeland security and commercial programs throughout the world. The Company, which includes Elbit Systems and its subsidiaries, operates in the areas of aerospace, land and naval systems, command, control, communications, computers, intelligence surveillance and reconnaissance (\"C4ISR\"), unmanned aircraft systems, advanced electro-optics, electro-optic space systems, EW suites, signal intelligence systems, data links and communications systems, radios and cyber-based systems. The Company also focuses on the upgrading of existing platforms, developing new technologies for defense, homeland security and commercial applications and providing a range of support services, including training and simulation systems.\nFor additional information, visit: www.elbitsystems.com or follow us on Twitter .\nTrademarks\nElbit Systems of America and other trademarks, service marks and logos are registered or unregistered marks of Elbit Systems of America companies in the United States and in foreign countries. Copyright ©2018 Elbit Systems of America. All rights reserved.\nForward Looking Statement\nThis press release contains forward‑looking statements (within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended) regarding Elbit Systems Ltd. and/or its subsidiaries (collectively the Company), to the extent such statements do not relate to historical or current fact. Forward-looking statements are based on management's expectations, estimates, projections and assumptions. Forward‑looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended. These statements are not guarantees of future performance and involve certain risks and uncertainties, which are difficult to predict. Therefore, actual future results, performance and trends may differ materially from these forward‑looking statements due to a variety of factors, including, without limitation: scope and length of customer contracts; governmental regulations and approvals; changes in governmental budgeting priorities; general market, political and economic conditions in the countries in which the Company operates or sells, including Israel and the United States among others; differences in anticipated and actual program performance, including the ability to perform under long-term fixed-price contracts; and the outcome of legal and/or regulatory proceedings. The factors listed above are not all-inclusive, and further information is contained in Elbit Systems Ltd.'s latest annual report on Form 20-F, which is on file with the U.S. Securities and Exchange Commission. All forward‑looking statements speak only as of the date of this release. The Company does not undertake to update its forward-looking statements.\nContacts:\nRod Gibbons | 817-234-6834 | rod.gibbons@elbitsystems-us.com\nShari Clarkson I 682-286-2363 I sharon.clarkson@elbitsystems-us.com\nView original content with multimedia: releases/elbit-systems-of-america-names-brian-sinkiewicz-as-senior-vice-president-of-airborne-solutions-300586568.html\nSOURCE Elbit Systems of America, LLC", "external_links": ["http://www.elbitsystems.com/", "https://twitter.com/ElbitSystemsUS", "https://twitter.com/ElbitSystemsLtd", "http://www.prnewswire.com/news-releases/elbit-systems-of-america-names-brian-sinkiewicz-as-senior-vice-president-of-airborne-solutions-300586568.html", "http://www.elbitsystems-us.com/", "http://www.elbitamerica.com/"], "published": "2018-01-23T14:30:00.000+02:00", "crawled": "2018-01-23T14:16:13.017+02:00", "highlightTitle": ""}