{"organizations": [], "uuid": "09cc8d402541bb99cdb0dc94ade836f485f32fd7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/19/104719014-GettyImages-493732104-real-estate.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/mortgage-rates-highest-in-4-years-ominous-sign-for-spring-housing.html", "country": "US", "domain_rank": 767, "title": "Mortgage rates highest in 4 years, ominous sign for spring housing", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-29T18:15:00.000+02:00", "replies_count": 0, "uuid": "09cc8d402541bb99cdb0dc94ade836f485f32fd7"}, "author": "Diana Olick", "url": "https://www.cnbc.com/2018/01/29/mortgage-rates-highest-in-4-years-ominous-sign-for-spring-housing.html", "ord_in_thread": 0, "title": "Mortgage rates highest in 4 years, ominous sign for spring housing", "locations": [], "entities": {"persons": [{"name": "daniel acker", "sentiment": "positive"}, {"name": "matthew graham", "sentiment": "none"}], "locations": [{"name": "sparland", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "positive"}, {"name": "mortgage news daily", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Daniel Acker | Bloomberg | Getty Images A realtor, right, walks with potential home buyers as they tour the property of a home for sale in Sparland, Illinois. \nA huge sell-off in the bond market is about to make buying a home more expensive. Mortgage rates, which loosely follow the yield on the 10-year Treasury, have been rising for the past few weeks, but are seeing their biggest move higher Monday. \n\"Bottom line, rate sheets are going to be ugly this morning,\" wrote Matthew Graham, chief operating officer of Mortgage News Daily. \"Some lenders will be at 4.5 percent on their best-case-scenario 30-year fixed quotes.\" \nThat is the highest rate since 2014. \nThe average rate on the popular 30-year fixed started the year right around 4 percent but then began to climb on positive news in the U.S. economy, solid company earnings reports and a shift in foreign central bank policies which appear to now be following the Federal Reserve's tightening of monetary policy. The rate was at 4.28 percent by the end of last week. \n\"Apart from central banks, there's a ton of bond market supply coming down the pike due to infrastructure and tax bill spending,\" Graham said. That new supply will send yields and, consequently, mortgage rates higher. show chapters 10:36 AM ET Thu, 25 Jan 2018 | 00:57 \nWhile mortgage rates are still historically low, they were even lower in the years following the financial crisis. That not only helped juice the sharp increase in home prices, but it has also given borrowers a new sense of normal. Both will hurt affordability this spring on several fronts. \n\"Today is one more reason for Realtors and buyers to move up their spring schedule,\" said Chris Kopec, a mortgage loan consultant at Chicago-based Lakeside Bank. \nThe housing market is already facing a supply crisis, with demand substantially higher than the supply of homes for sale. Higher mortgage rates will exacerbate that problem because most current homeowners have likely refinanced to rates in the 3 percent range over the past few years and will be reluctant to give those rates up, either to downsize or upsize to a new home. Hence, fewer new listings. \nFor first-time buyers, even a quarter point difference in mortgage rates could price them out of the type of home they're looking to buy. Today's buyers are saving less, due to high levels of student debt and high rent rates. Confidence in the current economy is driving spending even higher and savings even lower. \n\"With spending rising faster, what also drove spending was credit card debt as the US savings rate is down to just 2.4 percent in December from 2.5 percent in November and 3 percent in October. September 2005 was the last time it was this low,\" Peter Boockvar, chief investment officer with Bleakley Advisory Group, wrote in a note to clients. \"Lower taxes and higher wages couldn't have come at a better time for the average consumer, but some of that will likely go towards paying down some of the accumulated debt.\" \nWages may be growing, but the rate is nowhere near the now-nearly 7 percent annual home price growth. Price gains are highest on the lower end of the housing market, where demand is highest and supply is lowest. That is also where buyers are most sensitive to mortgage rates because they are already squeezing to make the monthly payment. WATCH: Mortgage rates on the rise in 2018 show chapters", "external_links": [], "published": "2018-01-29T18:15:00.000+02:00", "crawled": "2018-01-29T18:16:36.003+02:00", "highlightTitle": ""}