{"organizations": [], "uuid": "1320d79b175afab2e216fa9c03f690fc3dbc7596", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224776533&w=1200&r=LYNXMPEE0N0X7", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-venezuela-politics/venezuelas-presidential-battle-begins-maduro-favorite-idUSKBN1FD1BQ", "country": "US", "domain_rank": 408, "title": "Venezuela's presidential battle begins, Maduro favorite", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T13:05:00.000+02:00", "replies_count": 0, "uuid": "1320d79b175afab2e216fa9c03f690fc3dbc7596"}, "author": "", "url": "https://www.reuters.com/article/us-venezuela-politics/venezuelas-presidential-battle-begins-maduro-favorite-idUSKBN1FD1BQ", "ord_in_thread": 0, "title": "Venezuela's presidential battle begins, Maduro favorite", "locations": [], "entities": {"persons": [{"name": "maduro", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "cawthorne", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}, {"name": "hugo chavez", "sentiment": "none"}, {"name": "andreina aponte", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "min read  caracas", "sentiment": "none"}, {"name": "socialist party", "sentiment": "none"}, {"name": "constituent assembly", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CARACAS (Reuters) - Venezuela’s presidential election race has begun with favorite and incumbent Nicolas Maduro signaling a nationalist, “anti-Trump” campaign while his demoralized foes scramble to find a viable candidate for a vote they predict will be unfair.\nCritics of the 55-year-old Maduro, who succeeded Hugo Chavez in 2013, say he has ruined a once-prosperous oil economy, turned Venezuela into a dictatorship and skewed the election system to perpetuate power for his Socialist Party.\nGovernment officials say they are fighting a U.S.-led right-wing conspiracy determined to end socialism in Latin America, hobble Venezuela’s economy, and steal its oil wealth.\n“Donald Trump is not the boss of Venezuela!” thundered Maduro at a rally late on Tuesday. He spoke hours after the pro-government Constituent Assembly, a legislative superbody, announced the vote would be held by April 30.\nMaduro’s candidacy seems a formality: he says he will stand if the Socialist Party wants him, and party leaders say there is no other candidate under consideration.\nThe president’s approval ratings have plunged during a crushing four-year recession caused by failed state economic policies such as decade-old currency controls, and the fall in global oil prices since 2014.\nThe U.S. State Department weighed in on Wednesday, criticizing the decision to hold an election, saying the vote would deepen the country’s internal tensions. [S0N1O401O]\nForeign sanctions against Maduro’s government, including a U.S. prohibition on investors dealing with any new Venezuelan debt, have exacerbated the grim panorama as millions suffer food and medicine shortages and the world’s highest inflation.\nBut having survived massive protests last year and consolidated his grip, the international pressure has now given Maduro a powerful rallying cry to seek re-election.\n“The people rule in Venezuela, not empires,” he said at Tuesday’s rally, going straight into campaign mode with jingles from past elections. “I‘m ready ... We’re going to win big.”\n‘MADURO‘S FARCE’\nVenezuelan opposition presidential candidate Henri Falcon talks to the media during a news conference in Caracas, Venezuela January 24, 2018. REUTERS/Marco Bello Venezuela’s opposition, which brought hundreds of thousands of people onto the streets last year in an attempt to oust Maduro, is in a quandary. Its most popular figures - including Leopoldo Lopez and Henrique Capriles - are prevented from standing. Some are in jail, others are in exile or barred from politics.\n“The election will be held on Maduro’s terms, allowing him to ensure his victory,” the Eurasia consultancy said. “All of this will come at a cost of increased international isolation, something that the government seems willing to stomach if the tradeoff is to lose power.”\nThe most militant of government opponents believe it is useless to fight the socialists at the polls, given the election board - whose head is on U.S. and EU sanctions lists - favors the government and turns a blind eye to use of state resources for campaign purposes.\nElectoral council documents seen by Reuters appeared to show pro-government numbers were inflated in last year’s vote for the Constituent Assembly, and the opposition produced strong evidence of fraud in Bolivar state during governor elections.\nSlideshow (2 Images) The government denied any voting fraud, saying its election system is the cleanest in the world.\n“The dictatorship does not want free elections. No-one in Venezuela or abroad should support another of Maduro’s farces,” said Antonio Ledezma, a hardline opposition leader who recently escaped house arrest to flee to Spain.\nIf militants campaign for a boycott of the election, that would complicate plans by the already disparate Democratic Unity (MUD) coalition to hold a primary election to choose its best candidate. Leaders of the major MUD parties were meeting later on Wednesday to discuss strategy and possible primaries.\n“To participate or not, vote or not, protest or not? If we’re not united, no strategy will work. If we go forward together, nobody can beat us,” said young opposition leader Hasler Iglesias.\nTwo opposition leaders, Henry Ramos and Henri Falcon, have already announced presidential aspirations. But both are divisive figures within the opposition: Ramos is seen as too old-school by many, while Falcon is viewed with suspicion due to his origins within the ruling “Chavismo” movement.\nAnnouncing his would-be candidacy on Wednesday, Falcon said the government was incapable of resolving the country’s crisis, adding, “We need to get rid of this rubbish government, democratically.”\nGiven the dismal state of the economy and years of bitter political standoff, many Venezuelans are fed up with all parties and yearning for a fresh face.\nSome have been calling for Lorenzo Mendoza, the long-haired billionaire head of Venezuela’s main private food company Polar, to stand, but he has given no hint he will.\nAdditional reporting by Corina Pons in Caracas and David Alexander and Patricia Zengerle in Washington; Editing by James Dalgleish and Frances Kerry\n ", "external_links": [], "published": "2018-01-24T13:05:00.000+02:00", "crawled": "2018-01-24T13:21:58.002+02:00", "highlightTitle": ""}