{"organizations": [], "uuid": "0ecbc3c2e841425438e08534e98f47935ffb237a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-integra-lifesciences-announces-preliminary-fourth-quarter-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Integra LifeSciences Announces Preliminary Fourth Quarter 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:30:00.000+02:00", "replies_count": 0, "uuid": "0ecbc3c2e841425438e08534e98f47935ffb237a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-integra-lifesciences-announces-preliminary-fourth-quarter-2017-financial-results.html", "ord_in_thread": 0, "title": "Integra LifeSciences Announces Preliminary Fourth Quarter 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "plainsboro", "sentiment": "none"}], "organizations": [{"name": "integra lifesciences", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}, {"name": "integra lifesciences holdings corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Preliminary Fourth Quarter Highlights:\nFourth quarter 2017 reported revenue is expected to be approximately $365 million, exceeding the high-end of the company’s previous implied guidance range of $345 million to $355 million; Organic revenue growth in the fourth quarter is expected to be about 5.5%, above the company’s implied guidance of about 4%; The Company is still evaluating the impact of the Tax Cuts and Jobs Act of 2017 on its GAAP financial results; Fourth quarter 2017 adjusted earnings per share, excluding any impact from the Tax Cuts and Jobs Act of 2017, is expected to exceed the high-end of the company’s previous guidance range of $0.53 to $0.57.\nPLAINSBORO, N.J., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Integra LifeSciences Holdings Corporation (Nasdaq:IART), a leading global medical technology company, announced today certain unaudited preliminary fourth quarter 2017 financial results.\nThe company expects reported revenue for the fourth quarter 2017 to be approximately $365 million, an increase of over 40% compared to $255.7 million for the fourth quarter of 2016. The strong results in the fourth quarter were driven by outperformance in both the Derma Sciences and Codman Neurosurgery acquisitions, as well as higher than expected organic growth, including improved performance in dural repair.\n“We closed the year with strong performance in revenue and adjusted earnings per share,” said Peter Arduini, Integra’s president and chief executive officer. “This performance resulted from higher organic sales growth in both of our divisions and a faster recovery in our Puerto Rico manufacturing facility. We expect that this top-line performance will result in adjusted earnings per share above the high-end of our guidance range for the fourth quarter.”\nThe company is scheduled to present at the 36 th Annual J.P. Morgan Healthcare Conference on Wednesday, January 10, 2018 at 3:30pm PT (6:30pm ET). A live audio webcast of the presentation will be available on the Investor section of the company’s website at www.integralife.com\nThe company will report its final, audited fourth quarter and full year 2017 financial results during a conference call in late February 2018. A press release with the date, time and webcast information will be provided closer to the reporting date.\nAbout Integra\nIntegra LifeSciences (NASDAQ:IART) is dedicated to limiting uncertainty for clinicians, so they can concentrate on providing the best patient care. Integra offers innovative solutions, including leading plastic and regenerative technologies, in specialty surgical solutions, orthopedics and tissue technologies. For more information, please visit www.integralife.com .\nThis news release contains forward-looking statements within the meaning of the federal securities law, including statements regarding the company’s unaudited preliminary fourth quarter 2017 financial results. These forward-looking statements are necessarily estimates reflecting the judgment of the company’s management as of the date of this release and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. Such risks and uncertainties include, but are not limited to the following: the company's ability to execute its operating plan effectively; the company’s ability to successfully integrate the Codman Neurosurgery business and other acquired businesses; the company's ability to successfully sustain manufacturing operations at full capacity at our Puerto Rico facility and the restoration of infrastructure and other essential services in Puerto Rico; the company's ability to manufacture and ship sufficient quantities of its products to meet its customers' demands; the ability of third-party suppliers to supply us with raw materials and finished products; global macroeconomic and political conditions; the company's ability to manage its direct sales channels effectively; the company's ability to maintain relationships with customers of acquired entities and businesses; physicians' willingness to adopt and third-party payors' willingness to provide or maintain reimbursement for the company's recently launched, planned and existing products; initiatives launched by the company's competitors; downward pricing pressures from customers; the company's ability to secure regulatory approval for products in development; the company's ability to remediate quality systems violations; fluctuations in hospitals’ spending for capital equipment; the company's ability to comply with and obtain approvals for products of human origin and comply with regulations regarding products containing materials derived from animal sources; difficulties in controlling expenses, including costs to procure and manufacture our products; the impact of changes in management or staff levels; the impact of goodwill and intangible asset impairment charges if future operating results of acquired businesses are significantly less than the results anticipated at the time of the acquisitions, the company's ability to leverage its existing selling organizations and administrative infrastructure; the company's ability to increase product sales and gross margins, and control non-product costs; the company’s ability to achieve anticipated growth rates, margins and scale and execute its strategy generally; the amount and timing of acquisition and integration-related costs; the geographic distribution of where the company generates its taxable income; the effect of legislation effecting healthcare reform in the United States and internationally; fluctuations in foreign currency exchange rates; the amount of bank borrowings outstanding and other factors influencing liquidity; and the economic, competitive, governmental, technological, and other risk factors and uncertainties identified under the heading “Risk Factors” included in Item 1A of Integra's Annual Report on Form 10-K for the year ended December 31, 2016 and information contained in subsequent filings with the Securities and Exchange Commission. These forward-looking statements are made only as of the date hereof, and the company undertakes no obligation to update or revise the forward-looking statements, whether as a result of new information, future events, or otherwise.\nDiscussion of Adjusted Financial Measures\nIn addition to our GAAP results, we provide organic revenues and adjusted earnings per diluted share. Organic revenues consist of total revenues excluding the effects of currency exchange rates, acquired revenues and product discontinuances. The adjusted earnings per diluted share measure is calculated by dividing adjusted net income attributable to diluted shares by adjusted diluted weighted average shares outstanding. The measure of adjusted net income consists of GAAP net income from continuing operations, excluding: (i) global enterprise resource planning (\"ERP\") implementation charges; (ii) structural optimization charges; (iii) ", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/7bd0384d-f0f2-482e-9fd7-14487b06b349", "https://www.globenewswire.com/Tracker?data=lmZ2F00Qiirew9VBZ2nYGxGFz_Avuq5a7k8fQCjV-l6q0UT278rJWNEShZ3iSIN0FrRCjLTC68mRe-z0t4qCgVsSEhQqiWlLFsZYOvYa-6hqwdH6EbgdMh9qR55ks312", "https://www.globenewswire.com/Tracker?data=-Ehok26G9N8R-OtIIooPUnrGZSo0MQQUev3ex7K35aVyo9UmgzuPIJySG1CWJzEgfiVHG5QfE9-qkBPGI5znLj1_rWh6cT03e9-BIdL84d5OS64evlVbeyZ5GTbvaipu", "https://www.globenewswire.com/Tracker?data=DOMTMjiotpVPSRwIvnmCwrZR1Cs8U12r38H9VisYSezZMOBz-6ZO0UPialswHvhOi9MP0gmzo-etnXeTd821k8IkAzy_DgzlAA4p2wVu8eIzNKM_VzjrFySzywhnuYCB", "https://www.globenewswire.com/Tracker?data=xkEB31sHZQ0S5WRkq5O8jjzFkjAEITqLIuWfwlKNR-fJfdS4IL_oY7Nxz6pCUZW0UD-R3LuYbC5bxalJCp15UES7CMewaLrHdiCYrh88358=", "https://www.globenewswire.com/Tracker?data=xkEB31sHZQ0S5WRkq5O8jt_ssjtFDSbefP6E7Ve12HJJBjs4gXQCQIMEh1inFF27mYSq6wCwfbktxRLRrEFLzKrKVLwwdd5mp500z_C2yEI="], "published": "2018-01-08T14:30:00.000+02:00", "crawled": "2018-01-08T15:31:06.001+02:00", "highlightTitle": ""}