{"organizations": [], "uuid": "2f65360843f960ed6d3151c2f95e0c7f85ad59da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-teleflex-surpasses-200000-successfully-reprocessed-closurefasta-catheters.html", "country": "US", "domain_rank": 767, "title": "Teleflex Surpasses 200,000 Successfully Reprocessed ClosureFast® Catheters", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.095, "site_type": "news", "published": "2018-01-09T14:30:00.000+02:00", "replies_count": 0, "uuid": "2f65360843f960ed6d3151c2f95e0c7f85ad59da"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-teleflex-surpasses-200000-successfully-reprocessed-closurefasta-catheters.html", "ord_in_thread": 0, "title": "Teleflex Surpasses 200,000 Successfully Reprocessed ClosureFast® Catheters", "locations": [], "entities": {"persons": [{"name": "stewart", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "wayne", "sentiment": "none"}], "organizations": [{"name": "teleflex", "sentiment": "negative"}, {"name": "northeast scientific, inc.", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "teleflex incorporated", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reprocessing service designed to help hospitals and vein clinics reduce costs and cut down on medical waste\nWAYNE, Pa.--(BUSINESS WIRE)-- Teleflex Incorporated (NYSE: TFX), a leading global provider of medical technologies for critical care and surgery, today announced that more than 200,000 ClosureFast ® Catheters have been successfully reprocessed by the company’s partner, Northeast Scientific, Inc. (NES), since NES received FDA clearance for reprocessing the popular vein ablation catheter in 2011.\nThe ClosureFast ® Catheter is one of the most widely used devices in the United States for performing endovenous treatment of venous reflux disease, a serious medical condition affecting blood circulation in the lower legs that causes varicose veins.\n“As we approach the sixth anniversary of the launch of our reprocessing service and mark the attainment of another significant milestone in the number of ClosureFast ® Catheters that have been successfully reprocessed, we are proud of the exceptional value this service continues to deliver to our customers,” said Stewart Strong, President and General Manager of the Interventional business unit of Teleflex. “The reprocessing service is designed to help hospitals and vein clinics reduce costs and cut down on medical waste, objectives that are at the very core of Teleflex’s commitment to cost-effective healthcare.”\nTeleflex is offering the ClosureFast ® Catheter reprocessing service under contract with NES, an established third-party reprocessor of medical devices. NES received 510(k) clearance from the U.S. Food and Drug Administration on November 30, 2011 for reprocessing the ClosureFast ® Catheter. Since the reprocessing service was introduced jointly by NES and Vascular Solutions, Inc. in January 2012, several hundred U.S. hospitals and vein clinics have enrolled in the program.\n“Since Teleflex’s acquisition of Vascular Solutions in February 2017, we have been very pleased to be working in collaboration with NES. We share the commitment to helping hospitals and vein clinics reduce costs and cut down on medical waste,” said Strong. “We have recently augmented the level of customer service for the ClosureFast ® Catheter reprocessing program by introducing an in-house sales team to support the ongoing efforts of our direct sales force.”\nCraig Allmendinger, Chief Executive Officer of NES, commented, “We are gratified by the achievements of the ClosureFast ® Catheter reprocessing service. The reprocessed vein ablation catheters have demonstrated an excellent record for a sustained period of time and the program has earned the respect of a growing number of vein clinic practitioners. With Teleflex’s vast experience in the vein clinic market and its focus on the needs of its physician customers and patient outcomes, we look forward to the continued success of the program.”\nIn addition to offering the reprocessing service for ClosureFast ® Catheters, Teleflex markets a full range of accessory products that are needed to perform both RF- and laser-based vein ablation procedures. The company offers procedure packs designed for either RF or laser procedures, micro-introducers and 7F micro-HV kits, 0.018” and 0.025” guidewires, 18G echogenic needles for percutaneous entry, products for administering tumescent anesthesia, and disposable vein hooks for use in phlebectomy procedures.\nAbout Northeast Scientific\nNortheast Scientific, Inc. (NES), a privately-held company headquartered in Waterbury, Connecticut, is registered with the U.S. Food and Drug Administration as both a reprocessor of single-use medical devices and as a manufacturer. NES recently relocated to a new 20,000 square-foot facility specifically designed for its operations. Founded in 2005, NES received its first 510(k) clearance in 2007 and is developing multiple 510(k)s for the interventional markets. NES performs all reprocessing and manufacturing on site and is ISO 13485 registered. NES is not affiliated with the original equipment manufacturers of the devices it reprocesses. For more information about NES, visit the company’s website at www.smarthealth-care.com .\nAbout Teleflex Incorporated\nTeleflex is a global provider of medical technologies designed to improve the health and quality of people’s lives. We apply purpose driven innovation – a relentless pursuit of identifying unmet clinical needs – to benefit patients and healthcare providers. Our portfolio is diverse, with solutions in the fields of vascular and interventional access, surgical, anesthesia, cardiac care, urology, emergency medicine and respiratory care. Teleflex employees worldwide are united in the understanding that what we do every day makes a difference. For more information, please visit teleflex.com .\nTeleflex is the home of Arrow ® , Deknatel ® , Hudson RCI ® , LMA ® , Pilling ® , Rusch ® and Weck ® – trusted brands united by a common sense of purpose.\nForward-Looking Statements\nAny statements contained in this press release that do not describe historical facts may constitute forward-looking statements. Any forward-looking statements contained herein are based on our management's current beliefs and expectations, but are subject to a number of risks, uncertainties and changes in circumstances, which may cause actual results or company actions to differ materially from what is expressed or implied by these statements. These risks and uncertainties are identified and described in more detail in our filings with the Securities and Exchange Commission, including our Annual Report on Form 10-K.\nClosureFast is a registered trademark of Covidien LP (a subsidiary of Medtronic plc). Reprocessing of ClosureFast ® Catheters is performed by Northeast Scientific, Inc. and is not licensed by or affiliated in any way with Covidien, Covidien LP, VNUS Medical Technologies, Inc., Tyco Healthcare Group, LP, or Medtronic plc.\nTeleflex, the Teleflex logo, Arrow, Deknatel, Hudson RCI, LMA, Pilling, Rüsch, and Weck are trademarks or registered trademarks of Teleflex Incorporated or its affiliates, in the U.S. and/or other countries.\n© 2018 Teleflex Incorporated. All rights reserved. MC-003836\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109005353/en/\nTeleflex Incorporated\nJake Elguicze\nTreasurer and Vice President, Investor Relations\n610-948-2836\nSource: Teleflex Incorporated", "external_links": ["http://www.businesswire.com/news/home/20180109005353/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.smarthealth-care.com&esheet=51739784&newsitemid=20180109005353&lan=en-US&anchor=www.smarthealth-care.com&index=1&md5=50e2f3d449d49523e05aed24d182591a"], "published": "2018-01-09T14:30:00.000+02:00", "crawled": "2018-01-09T15:41:45.022+02:00", "highlightTitle": ""}