{"organizations": [], "uuid": "6fdbfe669da15d9c3ea414942427ac6e1f57f364", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222685012&w=1200&r=LYNXMPEE0G0JT", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/autoshow-detroit-gm-dhl/gm-dhl-use-a-chinese-plant-to-lead-manufacturing-change-idINKBN1F612B", "country": "US", "domain_rank": 408, "title": "GM, DHL use a Chinese plant to lead manufacturing change", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T11:52:00.000+02:00", "replies_count": 0, "uuid": "6fdbfe669da15d9c3ea414942427ac6e1f57f364"}, "author": "", "url": "https://in.reuters.com/article/autoshow-detroit-gm-dhl/gm-dhl-use-a-chinese-plant-to-lead-manufacturing-change-idINKBN1F612B", "ord_in_thread": 0, "title": "GM, DHL use a Chinese plant to lead manufacturing change", "locations": [], "entities": {"persons": [{"name": "norihiko shirouzu", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "liuzhou", "sentiment": "none"}], "organizations": [{"name": "gm", "sentiment": "negative"}, {"name": "dhl", "sentiment": "negative"}, {"name": "saic motor corp", "sentiment": "none"}, {"name": "general motors co", "sentiment": "none"}, {"name": "guangxi automobile group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 9:55 AM / Updated an hour ago GM, DHL use a Chinese plant to lead manufacturing change Norihiko Shirouzu 6 Min Read \nLIUZHOU, China, (Reuters) - Inside General Motors Co’s vehicle assembly plant in this southern China city, many workers wear the red-and-yellow uniforms of DHL, the logistics company. \nThe DHL employees work side-by-side with GM workers handling the flow of parts within the plant, which builds about 400,000 Baojun brand vehicles a year and is owned jointly by GM, Chinese partner SAIC Motor Corp and Guangxi Automobile Group. \nDHL assembles thousands of kits of parts daily in a strategy to avoid assembly errors, and reduce costs. At some GM-run final assembly plants in China, seats are unloaded from delivery trucks, put on a conveyer system that runs underneath an assembly line, and are delivered to the assembly line operator untouched by human hands. \nSome parts are delivered by small self-guided robots that would be at home on the set of a “Star Wars” movie. \nGM is now deploying third-party logistics contractors inside all 17 of its joint-venture general assembly plants in China to transport materials, and manage parts warehousing outside the plant and delivery to the plant, a senior GM executive told Reuters. \nOutsourcing in-plant material handling jobs, traditionally done by GM workers, allows the automaker’s workforce to focus on the more critical work of improving quality and efficiency, GM China’s manufacturing chief Paul Buetow said. \nGM has not previously shared details of its strategy for using DHL and other contractors in its Chinese joint-venture factories. Early on in developing its Chinese manufacturing, GM used relatively simple manufacturing systems, relying more on cheap labour than advanced technology. CONTROL OF MANUFACTURING \nNow, GM’s Chinese operations are deploying advanced manufacturing systems ahead of many factories in mature markets, and leading the way in many aspects of factory floor innovation. \nGM’s increasing use of contractors in China points toward a future where much more of the work involved in producing vehicles, or even all of it, could be handed over to third-party specialists, as Apple Inc does by outsourcing production of its devices. \nEstablished automakers have used contract assemblers, such as Magna International Inc, to build small numbers of niche models. \nBut union agreements have limited the use of outside contractors within many plants run by global automakers in Europe and the United States. Some electric-car startups, including NIO, formally known as NextEV, are already experimenting with handing over the bulk of production work to third parties. \nNIO’s founder and chief executive William Li, who has his entrepreneurial roots in e-commerce, has been lobbying China’s industrial policymakers to allow existing automakers to subcontract for electric car ventures such as his, so that startups could channel limited resources into technology and product development. \nUnder current policy, EV startups in China are required to have their own manufacturing capacity. Buetow said he has “thought about” the possibility of fully outsourcing production, but has concluded the automaker should still control manufacturing. \n“The building and assembling of vehicles is still a core competency for General Motors,” Buetow told Reuters in an interview in Liuzhou. “I am not sure we would ever contract that out.” \nIt is critical, he said, to have the “technical control” necessary to build vehicle bodies with precision in order to assure crashworthiness. EFFICIENCY GAIN \nGM and SAIC, and Guangxi Automobile have roughly 6,000 employees at the Liuzhou manufacturing complex. \nTo support them, DHL has deployed 1,500 of its own workers according to DHL. \nCars have 20,000 to 30,000 parts, and modern auto factories often produce multiple models on the same assembly line. The parts kits, delivered in the proper order according to computerised schedules, help reduce errors. \nAssembly line workers, for example, do not have to decide what color sun visor to use in a car. That choice is made by the people assembling the kit. \nParts kits put together by DHL are delivered by DHL workers just-in-time for a given vehicle coming down the assembly line. DHL uses a system for creating kits of parts that was pioneered by Toyota and later shared with GM. \nAccording to GM, most of these DHL workers are doing warehousing and parts delivery to the plants. DHL workers who handle parts-kitting and just-in-time delivery to the assembly line are much fewer in number than those working outside the assembly plants and they do not engage in vehicle assembly work, the company said. \nSimilar outsourcing arrangements are being carried out on a small scale in GM’s North American manufacturing facilities and elsewhere, but “what we have done in China is more (evolved),” Buetow told Reuters, without elaborating. \nGM declined to provide detailed information on the presence of third-party logistics service providers inside its Chinese plants, saying that is competitive information. \nGM China manufacturing facilities also have adopted technologies such as “zero-downtime” welding and other robots, as well as collaborative robots which work side-by-side with human operators on the assembly line, Buetow said. \nAs a result, GM’s Chinese production facilities have enjoyed a big jump in efficiency, Buetow said. Buetow and GM declined to give specific data, but Buetow said the number of vehicles assembled with the wrong components has fallen to a quarter of the level seen a decade or two ago. \n“You rarely see any vehicles that are mis-built at the end of the line these days,” Buetow said. Reporting By Norihiko Shirouzu; Editing by Joseph White and Neil Fullick", "external_links": [], "published": "2018-01-17T11:52:00.000+02:00", "crawled": "2018-01-17T12:09:37.013+02:00", "highlightTitle": ""}