{"organizations": [], "uuid": "7283f4f5547cc22cc3f9b569f55cac99965847dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/16/reuters-america-diary-top-economic-events-to-feb-27.html", "country": "US", "domain_rank": 767, "title": "DIARY-Top Economic Events to Feb 27", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T02:00:00.000+02:00", "replies_count": 0, "uuid": "7283f4f5547cc22cc3f9b569f55cac99965847dd"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/reuters-america-diary-top-economic-events-to-feb-27.html", "ord_in_thread": 0, "title": "DIARY-Top Economic Events to Feb 27", "locations": [], "entities": {"persons": [{"name": "loretta mester", "sentiment": "none"}, {"name": "michael saunders", "sentiment": "none"}, {"name": "jerome powell", "sentiment": "none"}, {"name": "henry ohlsson", "sentiment": "none"}, {"name": "robert kaplan", "sentiment": "none"}, {"name": "charles evans", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "uppsala", "sentiment": "none"}, {"name": "uppsala", "sentiment": "none"}, {"name": "new brunswick", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "senate banking committee", "sentiment": "none"}, {"name": "new jersey - federal reserve bank of cleveland", "sentiment": "none"}, {"name": "launch of financial intermediary", "sentiment": "none"}, {"name": "american council of life insurers executive roundtable", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "federal reserve bank of dallas", "sentiment": "none"}, {"name": "general news  this diary", "sentiment": "none"}, {"name": "offentlig ekonomi (public finance", "sentiment": "none"}, {"name": "palm beach - federal reserve bank of chicago", "sentiment": "none"}, {"name": "boe member of monetary policy committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 17 (Reuters) - For other diaries, please see: \nU.S. Federal Reserve\nPolling Unit Diary\nToday in Washington\nPolitical and General News\n\nThis Diary is filed daily. ** Indicates new events\n\nWEDNESDAY, JANUARY 17\n** UPPSALA, Sweden - Deputy Governor Henry Ohlsson will talk about the current monetary policy situation at the Offentlig Ekonomi (Public Finance) conference in Uppsala 1350 GMT.\n** LONDON - BOE Member of Monetary Policy Committee Michael Saunders: Launch of Financial Intermediary and Broker Association 1145 GMT.\nWASHINGTON - Senate Banking Committee holds a vote on the nomination of Jerome Powell to be chairman of the Federal Reserve 1500 GMT.\nNEW BRUNSWICK, New Jersey - Federal Reserve Bank of Cleveland President Loretta Mester gives a lecture on monetary policy communications 2130 GMT.\nPALM BEACH - Federal Reserve Bank of Chicago President Charles Evans and Federal Reserve Bank of Dallas President Robert Kaplan participate in a moderated discussion on current economic conditions and monetary policy before the American Council of Life Insurers Executive Roundtable - 2000 GMT. OTTAWA - The Bank of Canada issues its monetary policy report 1500 GMT. OTTAWA - Bank of Canada Governor Stephen Poloz and Bank of Canada Senior Deputy Governor Carolyn Wilkins will hold a press conference to discuss the contents of the monetary policy report 1615 GMT. THURSDAY, JANUARY 18\n** FRANKFURT - IMF Managing Director Christine Lagarde, ECB board member Benoit Coeure and Bundesbank president Jens Weidmann speak at a conference in Frankfurt.\n** NEW YORK - Federal Reserve Bank of Cleveland President Loretta Mester speaks on monetary policy at the Council for Economic Education's Economists on the Economy - 2305 GMT. FRANKFURT - ECB Board Member Benoit Cure is a panel participant on 'A post-crisis agenda for the euro area and Germany: which way forward?' at a joint conference by the IMF and Bundesbank on \"Germany Current Economic Policy Debates\" 1430 GMT.\nPARIS - Bank of France Governor Francois Villeroy de Galhau gives annual start-of-year address to the financial sector - 1730 GMT.\nFRIDAY, JANUARY 19\n** BERLIN - German Chancellor Angela Merkel and IMF Managing Director Christine Lagarde meet for informal talks in Berlin.\n* SAN FRANCISCO - Federal Reserve Bank of San Francisco President John Williams speaks at the Bay Area Council Economic Institute's 11th Annual Forecast Conference: \"Visualizing the Future of the Bay, - 1830 GMT.\nWASHINGTON - Federal Reserve Vice Chair for Supervision Randal Quarles speaks on \"Bank Regulation\" before the American Bar Association Banking Law Committee Annual Meeting 1800 GMT.\nMONDAY, JANUARY 22\nBRUSSELS - Eurogroup finance ministers' meeting.\nTOKYO - Bank of Japan monetary policy meeting (to Jan. 23).\nTUESDAY, JANUARY 23\n** CHICAGO - Federal Reserve Bank of Chicago President Charles Evans gives introductory remarks before the Chicago Council on Global Affairs conference: \"The Future of Monetary Policy: Embracing the Unconventional\" - 2330 GMT. BRUSSELS - EU Economic and Financial Affairs Council meeting.\nTHURSDAY, JANUARY 25 FRANKFURT - ECB Governing Council meeting, followed by an interest rate announcement and a press conference by President Mario Draghi. OSLO - Norway Central Bank interest rate decision 0900 GMT.\nTOKYO - Bank of Japan releases the minutes of its Dec. 20-21 monetary policy meeting - 2350 GMT.\nFRIDAY, JANUARY 26 LONDON - Bundesbank Vice President Claudia Buch speaks at the Imperial College 1530 GMT.\nSTOCKHOLM - Riksbank executive board meeting 0800 GMT.\nTUESDAY, JANUARY 30\nWASHINGTON - U.S. Federal Reserve's Federal Open Market Committee (FOMC) starts its two-day meeting on interest rates (to Jan. 31).\nTOKYO - Bank of Japan to release a summary of opinions from board members at its Jan. 22-23 policy meeting 2350 GMT.\nWEDNESDAY, JANUARY 31 OITA, Japan - Bank of Japan Deputy Governor Kikuo Iwata speaks to business leaders - 0130 GMT. WASHINGTON - U.S. Federal Reserve's Federal Open Market Committee (FOMC) announces its decision on interest rates, followed by statement 1900 GMT.\nMONDAY, FEBRUARY 5 LONDON - OMFIF lunch discussion with Cecilia Skingsley, deputy governor of the Swedish central bank and co-chair of the World Economic Forum's working group, examining the prospects for central bank-issued digital currencies - 1200 GMT\nWEDNESDAY, FEBRUARY 7 FRANKFURT - ECB Governing Council meeting. No interest rate announcements scheduled. STOCKHOLM - Riksbank executive board meeting 0800 GMT. THURSDAY, FEBRUARY 8 FRANKFURT - Federal Reserve Bank of Dallas President Robert Kaplan speaks on \"Monetary Policy Issues in an European Context\" before the Global Interdependence Center \"Central Banking Series: Frankfurt\" 0915 GMT. OTTAWA Speech by Carolyn Wilkins, Bank of Canada Senior Deputy Governor at Bank of Canada 1800 GMT. LONDON - European Central Bank executive board member Yves Mersch gives a lecture.\nLONDON - Bank of England releases its inflation report.\nLONDON - Bank of England announces its rate decision and publishes the minutes of the meeting 1200 GMT. WELLINGTON - Reserve Bank of New Zealand's Official Cash Rate (OCR) and Monetary Policy Statement.\nFRIDAY, FEBRUARY 9 STOCKHOLM - Riksbank general council meeting - 1200 GMT. TUESDAY, FEBRUARY 13\n** DAYTON, Ohio - Federal Reserve Bank of Cleveland President Loretta Mester speaks on the economic outlook at the Dayton Area Chamber of Commerce Government Affairs Breakfast - 1300 GMT.\nSTOCKHOLM - Riksbank monetary policy meeting 0800 GMT.\nWEDNESDAY, FEBRUARY 14\nSTOCKHOLM - Swedish Central Bank interest rate decision and monetary policy report - 0830 GMT.\nTHURSDAY, FEBRUARY 15 WINNIPEG, Canada - Speech by Lawrence Schembri, Bank of Canada Deputy Governor at Manitoba Association for Business Economics 1845 GMT. STOCKHOLM - Riksbank executive board meeting 0800 GMT.\nFRIDAY, FEBRUARY 16 STOCKHOLM - Riksbank general council meeting - 1200 GMT. MONDAY, FEBRUARY 19 BRUSSELS - Eurogroup meeting.\nWEDNESDAY, FEBRUARY 21\nWASHINGTON - Federal Open Market Committee will release the minutes from its January policy meeting. FRANKFURT - ECB Governing Council meeting. No interest rate announcements scheduled.\nWEDNESDAY, FEBRUARY 27 STOCKHOLM - Swedish Central Bank minutes of its monetary policy meeting will be published 0830 GMT.", "external_links": [], "published": "2018-01-17T02:00:00.000+02:00", "crawled": "2018-01-17T07:26:27.029+02:00", "highlightTitle": ""}