{"organizations": [], "uuid": "457239fee5d7c84985d4532c89eabcc86317c3d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-strongbridge-biopharma-plc-announces-pricing-of-public-offering-of-ordinary-shares.html", "country": "US", "domain_rank": 767, "title": "Strongbridge Biopharma plc Announces Pricing of Public Offering of Ordinary Shares", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-26T02:43:00.000+02:00", "replies_count": 0, "uuid": "457239fee5d7c84985d4532c89eabcc86317c3d3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-strongbridge-biopharma-plc-announces-pricing-of-public-offering-of-ordinary-shares.html", "ord_in_thread": 0, "title": "Strongbridge Biopharma plc Announces Pricing of Public Offering of Ordinary Shares", "locations": [], "entities": {"persons": [{"name": "strongbridge", "sentiment": "none"}], "locations": [{"name": "dublin", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "trevose", "sentiment": "none"}], "organizations": [{"name": "strongbridge biopharma plc announces pricing of public offering of ordinary shares", "sentiment": "negative"}, {"name": "nasd", "sentiment": "negative"}, {"name": "strongbridge biopharma plc", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "inc.", "sentiment": "none"}, {"name": "jmp securities llc", "sentiment": "none"}, {"name": "oppenheimer & co", "sentiment": "none"}, {"name": "h.c. wainwright & co.", "sentiment": "none"}, {"name": "cantor fitzgerald & co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBLIN, Ireland and TREVOSE, Pa., Jan. 25, 2018 (GLOBE NEWSWIRE) -- Strongbridge Biopharma plc (NASDAQ:SBBP) (the “Company”) today announced that it has priced its previously announced underwritten public offering of 5 million ordinary shares at a price to the public of $6.75 per share. The offering is expected to close on or about January 30, 2018 subject to satisfaction of customary closing conditions. Strongbridge granted the underwriters a 30-day option to purchase up to an additional 750,000 ordinary shares. Before deducting the underwriting discount and estimated offering expenses payable by the Company, the Company expects to receive gross proceeds of approximately $33.8 million, assuming no exercise of the underwriters’ option to purchase additional shares.\nCantor Fitzgerald & Co. is acting as the sole bookrunner for the offering. JMP Securities LLC is acting as the lead manager for the offering. Oppenheimer & Co. Inc. is acting as lead co-manager and H.C. Wainwright & Co. is acting as co-manager for the offering.\nThe Company intends to use the net proceeds from the offering for investment in commercial infrastructure for its two commercial products, Keveyis ® and Macrilen™, continued development of its clinical-stage product candidates, Recorlev™ and veldoreotide, and for other general corporate purposes, which may include working capital, capital expenditures, acquisition of additional technologies or other forms of intellectual property, acquisition of assets or businesses that are complementary to its existing business, and general and administrative expenses.\nA shelf registration statement relating to the ordinary shares was previously filed with the SEC and declared effective on May 8, 2017. A preliminary prospectus supplement and accompanying prospectus relating to the offering were filed with the SEC on January 23, 2018. A final prospectus supplement and accompanying prospectus relating to the offering will be filed with the SEC and will be available on the SEC’s website. Copies of the final prospectus supplement (when available) and accompanying prospectus may be obtained from Cantor Fitzgerald & Co., Attention: Capital Markets, 499 Park Ave., 6th Floor, New York, New York 10022 or by e-mail at prospectus@cantor.com .\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or other jurisdiction. Any offer, if at all, will be made only by means of the prospectus supplement and accompanying prospectus forming a part of the effective registration statement.\nAbout Strongbridge Biopharma plc\nStrongbridge Biopharma is a global commercial-stage biopharmaceutical company focused on the development and commercialization of therapies for rare diseases with significant unmet needs. Strongbridge's commercial portfolio within its rare neuromuscular and rare endocrine franchises includes Keveyis ® (dichlorphenamide), the first and only FDA-approved treatment for hyperkalemic, hypokalemic, and related variants of primary periodic paralysis, and Macrilen™ (macimorelin), the first and only FDA-approved oral drug indicated for the diagnosis of adult growth hormone deficiency. The Company’s rare endocrine franchise also includes a clinical-stage pipeline of therapies: Recorlev ™ (levoketoconazole), a cortisol synthesis inhibitor currently being studied for the treatment of endogenous Cushing's syndrome, and veldoreotide, a next-generation somatostatin analog being investigated for the treatment of acromegaly, with potential additional applications in other conditions amenable to somatostatin receptor activation.\n“Safe Harbor” Statement Under the Private Securities Litigation Reform Act of 1995\nThis press release contains within the meaning of the federal securities laws. These statements involve risks and uncertainties that could cause actual results to differ materially, and relate to whether or not Strongbridge will be able to consummate the offering of ordinary shares described herein, including due to the satisfaction of customary closing conditions and prevailing market conditions, the anticipated use of the proceeds of the offering which could change as a result of market conditions or for other reasons, and the impact of general economic, industry or political conditions in the United States or internationally. Additional risks and uncertainties relating to the proposed offering, Strongbridge and its business can be found under the heading “Risk Factors” in the preliminary prospectus supplement and accompanying prospectus relating to the offering filed with the SEC. Strongbridge assumes no duty or obligation to update or revise any for any reason.\nContacts:\nCorporate and Media Relations\nElixir Health Public Relations\nLindsay Rocco\n+1 862-596-1304\nlrocco@elixirhealthpr.com\nInvestor Relations\nU.S.:\nThe Trout Group\nMarcy Nanus\n+1 646-378-2927\nmnanus@troutgroup.com\nEurope:\nFirst House\nMitra Hagen Negård\n+47 21 04 62 19\nstrongbridgebio@firsthouse.no\nUSA\n900 Northbrook Drive\nSuite 200\nTrevose, PA 19053\nTel. +1 610-254-9200\nFax. +1 215-355-7389\nSource:Strongbridge Biopharma plc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/6a48dba0-8534-461c-b78f-01fc3b7290c1"], "published": "2018-01-26T02:43:00.000+02:00", "crawled": "2018-01-26T03:37:11.003+02:00", "highlightTitle": ""}