{"organizations": [], "uuid": "233342339a038633b7ef2b8bb2a452c8766238c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-capella-education-company-shareholders-approve-proposed-merger-with-strayer-education-inc.html", "country": "US", "domain_rank": 767, "title": "Capella Education Company Shareholders Approve Proposed Merger with Strayer Education, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:05:00.000+02:00", "replies_count": 0, "uuid": "233342339a038633b7ef2b8bb2a452c8766238c7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-capella-education-company-shareholders-approve-proposed-merger-with-strayer-education-inc.html", "ord_in_thread": 0, "title": "Capella Education Company Shareholders Approve Proposed Merger with Strayer Education, Inc.", "locations": [], "entities": {"persons": [{"name": "minne", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "capella education company shareholders approve proposed merger", "sentiment": "negative"}, {"name": "capella education company", "sentiment": "negative"}, {"name": "strayer education, inc", "sentiment": "neutral"}, {"name": "strategic education, inc.", "sentiment": "none"}, {"name": "capella university", "sentiment": "none"}, {"name": "strayer university", "sentiment": "none"}, {"name": "department of education", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Capella Education Company to Report Fourth Quarter and Full Year 2017 Results on March 1, 2018\nMINNEAPOLIS--(BUSINESS WIRE)-- Capella Education Company (NASDAQ: CPLA) announced today that at a special meeting this morning, its shareholders approved a proposal to effect the previously announced merger between Capella Education Company and Strayer Education, Inc.\nAs a result of the proposed merger, Strategic Education, Inc. will be the corporate entity under which both Capella University and Strayer University will continue to operate as independent and separately accredited institutions. Together, the two universities will serve approximately 80,000 students across all 50 states. The combination is expected to achieve corporate level efficiencies that will enable each university to accelerate innovations that improve affordability, and enhance academic and career outcomes for students. The proposed merger, which is anticipated to close in the third quarter of 2018, is subject to the satisfaction of customary closing conditions, including approvals by the Department of Education, State regulators, and relevant accreditation bodies.\nFor more information on the proposed merger and shareholder voting results, see the definitive proxy statement filed with the Securities and Exchange Commission on Dec. 8, 2017, and 8-K filed on Jan. 19, 2018, available on the Securities and Exchange Commission’s website, www.sec.gov , and Capella Education Company’s website, www.capellaeducation.com in the investor relations section.\nCapella Education Company also announced today that it will release fourth quarter and full year 2017 financial results after the market closes on Thursday, March 1, 2018. The press release will be archived at www.capellaeducation.com in the investor relations section. In light of the pending merger, Capella Education Company will not be hosting an investor conference call following the issuance of its fourth quarter and full year 2017 earnings release.\nAbout Capella Education Company\nCapella Education Company ( http://www.capellaeducation.com ) is an educational services company that provides access to high-quality education through online postsecondary degree programs and job-ready skills offerings needed in today’s market. Capella Education Company’s portfolio of companies is dedicated to closing the skills gap by providing the most direct path between learning and employment.\nForward Looking Statements\nThis communication contains certain forward-looking statements made pursuant to the Private Securities Litigation Reform Act of 1995 (the “Reform Act”). Such statements may be identified by the use of words such as “expect,” “estimate,” “assume,” “believe,” “anticipate,” “will,” “forecast,” “outlook,” “plan,” “project,” or similar words and may include statements with respect to, among other things, the proposed merger (the “Merger”) of a wholly-owned subsidiary of Strayer Education, Inc. (“Strayer”) with and into Capella Education Company (“Capella”), including the expected timing of completion of the Merger; the anticipated benefits of the Merger, including estimated synergies; the combined company’s plans, objectives and expectations; future financial and operating results; and other statements that are not historical facts. The statements are based on Capella’s current expectations and are subject to a number of assumptions, uncertainties and risks. In connection with the safe-harbor provisions of the Reform Act, Capella has identified important factors that could cause Capella’s actual results to differ materially from those expressed in or implied by such statements. The assumptions, uncertainties and risks include:\nthe risk that the Merger may not be completed in a timely manner or at all due to the failure to satisfy other conditions (including obtaining required regulatory and educational agency approvals) to completion of the Merger; the occurrence of any event, change or other circumstance that could give rise to the termination of the merger agreement; the outcome of any legal proceeding that may be instituted against Capella, Strayer, and others following the announcement of the Merger; the amount of the costs, fees, expenses and charges related to the Merger; the risk that the benefits of the Merger, including expected synergies, may not be fully realized or may take longer to realize than expected; the risk that the Merger may not advance the combined company’s business strategy and growth strategy; the risk that the combined company may experience difficulty integrating Capella’s and Strayer’s employees or operations; the potential diversion of Capella’s management’s attention resulting from the proposed merger; and other risks and uncertainties identified in Capella’s filings with the Securities and Exchange Commission.\nActual results may differ materially from those projected in the forward-looking statements. Capella undertakes no obligation to update or revise forward-looking statements.\nAdditional Information and Where to Find It\nInvestors and security holders are urged to carefully review and consider each of Capella’s and Strayer’s public filings with the Securities and Exchange Commission (the “SEC”), including but not limited to their Annual Reports on Form 10-K, their proxy statements, their Current Reports on Form 8-K and their Quarterly Reports on Form 10-Q. The documents filed by Capella with the SEC may be obtained free of charge at Capella’s website at www.capellaeducation.com , in the “Investor Relations” section, or at the SEC’s website at www.sec.gov . These documents may also be obtained free of charge from Capella by requesting them in writing to 225 South 6 th Street, Minneapolis, MN 55402. The documents filed by Strayer with the SEC may be obtained free of charge at Strayer’s website at www.strayereducation.com , in the “Investor Relations” tab at the top of the page, or at the SEC’s website at www.sec.gov . These documents may also be obtained free of charge from Strayer by requesting them in writing to 2303 Dulles Station Boulevard, Herndon, VA 20171.\nIn connection with the proposed transaction, on Nov. 20, 2017, Strayer filed a registration statement on Form S-4 with the SEC which included a joint proxy statement of Strayer and Capella and a prospectus of Strayer. The registration statement was amended on Dec. 4, 2017 and declared effective on Dec. 8, 2017. On Jan. 19, 2018 at their respective special meetings, Capella shareholders approved the Agreement and Plan of Merger dated as of Oct. 29, 2017, by and among the Company, Capella and Sarg Sub Inc., and Strayer’s shareholders approved the issuance of Strayer common stock and the amendment and restatement of Strayer’s charter, each in connection with the Merger. INVESTORS AND SECURITY HOLDERS OF CAPELLA AND STRAYER ARE URGED TO CAREFULLY READ THE ENTIRE REGISTRATION STATEMENT AND PROXY STATEMENT, AS WELL AS ANY AMENDMENTS OR SUPPLEMENTS TO THESE DOCUMENTS AND ANY OTHER RELEVANT DOCUMENTS FILED WITH THE SEC, WHEN THEY BECOME AVAILABLE, BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT THE PROPOSED TRANSACTION. Investors and security holders can obtain the registration statement and the Proxy Statement free of charge from the SEC’s website", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.capellaeducation.com&esheet=51746161&newsitemid=20180119005676&lan=en-US&anchor=www.capellaeducation.com&index=8&md5=bf0ca1e8397c606bd36d3d0e1934348c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.capellaeducation.com%2Finvestor-relations%2Fdefault.aspx&esheet=51746161&newsitemid=20180119005676&lan=en-US&anchor=investor+relations&index=6&md5=07bbba5aef4de5d1ea2387d2b0603135", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.capellaeducation.com%2F&esheet=51746161&newsitemid=20180119005676&lan=en-US&anchor=Capella+Education+Company&index=1&md5=98100077ce9f56e158fef1ff2a8c0ced", "http://www.businesswire.com/news/home/20180119005676/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.capellaeducation.com&esheet=51746161&newsitemid=20180119005676&lan=en-US&anchor=www.capellaeducation.com&index=3&md5=d288d7db9fdfaacfbfe748387dc015bf", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51746161&newsitemid=20180119005676&lan=en-US&anchor=www.sec.gov&index=2&md5=7f5852107df9caa09980dc1a771c9f6e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51746161&newsitemid=20180119005676&lan=en-US&anchor=www.sec.gov&index=9&md5=659093c31c8f9003b53ec99abebf5275", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.capellaeducation.com&esheet=51746161&newsitemid=20180119005676&lan=en-US&anchor=http%3A%2F%2Fwww.capellaeducation.com&index=7&md5=feb78ea18852401fd27bfb2eac7a3277", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.strayereducation.com&esheet=51746161&newsitemid=20180119005676&lan=en-US&anchor=www.strayereducation.com&index=10&md5=3dc437300bc05b7ee22923ef5031f21c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.capellaeducation.com%2Finvestor-relations%2Fdefault.aspx&esheet=51746161&newsitemid=20180119005676&lan=en-US&anchor=investor+relations&index=4&md5=d120cbcd6579e53ddfbc4e0f7764184f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.capellaeducation.com%2F&esheet=51746161&newsitemid=20180119005676&lan=en-US&anchor=www.capellaeducation.com&index=5&md5=fe076a7a94f7744fab40e99db154d8fa", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51746161&newsitemid=20180119005676&lan=en-US&anchor=www.sec.gov&index=11&md5=41b982f8f0198e27486b7aa25c6424b5"], "published": "2018-01-20T00:05:00.000+02:00", "crawled": "2018-01-20T00:56:02.000+02:00", "highlightTitle": ""}