{"organizations": [], "uuid": "2869d40f3b605f54ecbfb22640a8404cd98d50d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221095980&w=1200&r=LYNXMPEE0A0MX", "site_section": "https://www.reuters.com/places/china", "section_title": "China | Reuters.com", "url": "https://www.reuters.com/article/us-china-yuan-factor/one-way-or-another-chinas-yuan-policy-tweak-a-warning-shot-in-old-battle-idUSKBN1F015E", "country": "US", "domain_rank": 408, "title": "One way or another: China's yuan policy tweak a warning shot in old battle", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.585, "site_type": "news", "published": "2018-01-11T18:32:00.000+02:00", "replies_count": 0, "uuid": "2869d40f3b605f54ecbfb22640a8404cd98d50d6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-yuan-factor/one-way-or-another-chinas-yuan-policy-tweak-a-warning-shot-in-old-battle-idUSKBN1F015E", "ord_in_thread": 0, "title": "One way or another: China's yuan policy tweak a warning shot in old battle", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "shanghai/hong kong", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI/HONG KONG (Reuters) - China’s adjustment to the way it sets the reference rate for its tightly managed currency, suspending a tool for fine-tuning the exchange rate, is a fresh warning to would-be speculators that gives the yuan scope to retreat after a year of heady gains.\nThe decision by the central bank to reduce the effect of a so-called “counter-cyclical” factor, introduced in May to limit market volatility in the yuan’s calculation, initially knocked the currency lower when it was reported on Tuesday.\nThe move makes the yuan more open to market forces, which could add downward pressure on the currency in the near-term, a help for the country’s export competitiveness.\nBut while it sends a message to a market with a penchant for betting on currency momentum in one direction or another, analysts say it’s unlikely to be the silver bullet Beijing needs to eliminate wild swings.\nMore tinkering is likely ahead as policymakers look to reduce volatility on either side of the 6.5 yuan to the dollar mark, seen in recent months as a critical level for regulators.\n“Whenever there’s a one-way trade and one-way expectation, they tend to do something,” said Zhou Hao, senior emerging markets economist at Commerzbank. “If you don’t defend this (6.5 yuan) level, maybe the currency sees another leg of rapid appreciation.”\nThe yuan’s past tendency to be pushed one way or another by surges in expectations has long troubled regulators who have sought to liberalize China’s foreign exchange market without triggering disruptive capital flight.\nIn 2016, persistent depreciation expectations drove the yuan down around 6.5 percent against the dollar, prompting a raft of policy measures - including the May 2017 introduction of the secret and discretionary “counter-cyclical factor” - to stop the bleeding.\nLast year, though, the currency rebound by around 7 percent as policies bit and sentiment shifted.\nSome speculated Tuesday’s move was aimed at trade tensions, with Beijing annoyed by the dollar’s persistent weakness and the yen’s decline. To that end, China has been diversifying its foreign exchange reserves, and Bloomberg reported on Wednesday that it was considering reducing or halting purchases of U.S. Treasuries. China’s forex authority dismissed the report.\nFor now, the PBOC seems to have drawn a critical line around 6.5 yuan per dollar.\nOn Tuesday, it effectively neutralized its “counter-cyclical factor”, after the yuan had hovered on the strong side of 6.5 per dollar for several days.\nWhen the yuan tested 6.5 in September, the PBOC removed reserve requirements on some yuan contracts to nudge it back to the weaker side of that line.\nU.S. policymakers have accused China of manipulating the yuan, but on the other side, a source close to China’s commerce ministry said Beijing’s private frustrations about a weak dollar are growing.\nWhile the yuan was relatively stable throughout October and November, the weak U.S. dollar and the Japanese yen’s falls against the yuan posed challenges for the yuan’s regulators.\n“China feels that when the dollar falls, the yen does not rise much, which puts big pressures on China,” the person said.\n“Major central banks have a consensus that competitive devaluation is rule-breaking. But the dollar should appreciate rather than depreciate. Nobody says anything if the U.S. manipulates its currency.”\nThe yuan may not be poised to fall much, though.\n“Capital flow dynamics are favoring renminbi strength, not weakness,” Chi Lo, senior economist at BNP Paribas Asset Management, wrote in a note to clients.\n“What is likely to result is higher volatility (two-way trading) for renminbi trading. The outlook for a still balanced flow environment looks likely to continue on the back of moderate GDP growth, improving external environment and improving renminbi sentiment.”\nKen Cheung, senior Asian FX strategist at Mizuho Bank in Hong Kong, said he expected the currency to hover between 6.5 and 6.7 per dollar for at least the first half of the year.\nThe PBOC declined to confirm the latest change, but said the level of influence of the “counter-cyclical factor” was up to the individual banks that contribute estimates each day for the mid-point calculation. Market participants say the central bank has always wielded control.\nEither way, the “x factor” remains in the PBOC’s box of tools, along with others, should the yuan start to move too much in a direction it doesn’t like.\n“The PBOC will not give up intervention in the FX market. It will continue to seek new measures for currency intervention, either through an adjustment of the ‘counter-cyclical factor’, or a full revamp of the mid-point formula,” said Jianwei Xu, senior economist for Greater China at Natixis in Hong Kong.\nReporting by John Ruwitch and Winni Zhou in SHANGHAI, Kevin Yao in BEIJING, Michelle Chen and Marius Zaharia in HONG KONG, and Vidya Ranganathan in SINGAPORE; Editing by Jacqueline Wong and Sam Holmes\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T18:32:00.000+02:00", "crawled": "2018-01-11T17:03:13.009+02:00", "highlightTitle": ""}