{"organizations": [], "uuid": "5b21b69b1d44c8f8e37083164b70174095b86a95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223430998&w=1200&r=LYNXMPEE0I1LT", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-figureskating-europe-fernandez/fernandez-blows-away-rivals-to-claim-sixth-european-title-idUSKBN1F82JO", "country": "US", "domain_rank": 408, "title": "Fernandez blows away rivals to claim sixth European title", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:11:00.000+02:00", "replies_count": 0, "uuid": "5b21b69b1d44c8f8e37083164b70174095b86a95"}, "author": "", "url": "https://www.reuters.com/article/us-figureskating-europe-fernandez/fernandez-blows-away-rivals-to-claim-sixth-european-title-idUSKBN1F82JO", "ord_in_thread": 0, "title": "Fernandez blows away rivals to claim sixth European title", "locations": [], "entities": {"persons": [{"name": "fernandez", "sentiment": "negative"}, {"name": "mikhail kolyada", "sentiment": "none"}, {"name": "gabrielle tetrault-farber", "sentiment": "none"}, {"name": "karl schaefer", "sentiment": "none"}, {"name": "javier fernandez", "sentiment": "none"}, {"name": "dmitri aliev", "sentiment": "none"}, {"name": "schaefer", "sentiment": "none"}], "locations": [{"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 8:12 PM / in 10 minutes Fernandez blows away rivals to claim sixth European title Gabrielle Tetrault-Farber 3 Min Read \nMOSCOW (Reuters) - A flawed routine could not stop Javier Fernandez from becoming the first man in more than 80 years to win six consecutive European figure skating titles as the Spaniard proved he will be among the title favourites at next month’s Winter Olympics. \nDespite losing his balance on a double toeloop and stumbling on a triple Salchow, the twice world champion blew away his rivals by more than 20 points with a combined total of 295.55. \nRussian Dmitri Aliev earned silver with 274.06 while his compatriot Mikhail Kolyada improved on his fourth place finish in the short program to snatch the bronze with 258.90. \nSkating to the music from the “Man of La Mancha” musical, the 26-year-old Fernandez became the first man since Karl Schaefer in 1936 to win six in a row. Austrian Schaefer won eight successive golds from 1929. \nThe Pyeongchang Olympics will be Fernandez’s third and final Games. He is keen to end his country’s 26-year Winter Olympic medal drought after finishing fourth in Sochi four years ago. \nKolyada won the bronze despite struggling with his quadruple jumps throughout his free skate, starting with a fall on his opening quad Lutz. Figure Skating - ISU European Championships 2018 - Men's Victory Ceremony - Moscow, Russia - January 19, 2018 - Gold medallist Javier Fernandez of Spain attends the ceremony. REUTERS/Grigory Dukor FRENCH ICE DANCERS LEAD \nEarlier on Friday French ice dancers Gabriella Papadakis and Guillaume Cizeron took the lead with an upbeat short dance that puts them on pace to win their fourth consecutive European title. \nDancing to music by British singer Ed Sheeran, the twice world champions produced a solid performance that gave them a comfortable lead with 81.29 points, less than one point away their personal best in the short dance. \nPapadakis and Cizeron, who last year became the first ice dancers to break the 200-points barrier, were left frustrated as they went out of sync on their twizzles. \n“It’s not something that happens often and it’s very frustrating,” Papadakis told reporters. “I guess we will have to work on that.” \nRussians Alexandra Stepanova and Ivan Bukin finished nearly six points behind their French rivals after an energetic performance on home ice. \nItalians Anna Cappellini and Luca Lanotte finished third with 74.76 points. Reporting by Gabrielle Tétrault-Farber; Editing by Christian Radnedge and Pritha Sarkar", "external_links": [], "published": "2018-01-19T22:11:00.000+02:00", "crawled": "2018-01-19T22:31:05.032+02:00", "highlightTitle": ""}