{"organizations": [], "uuid": "1d0445f4d1a5a62cfa02076c0d96eb2b828f0389", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-court-party/u-s-top-court-backs-police-over-arrests-at-racy-washington-party-idUSKBN1FB2FQ", "country": "US", "domain_rank": 408, "title": "U.S. top court backs police over arrests at racy Washington party", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T19:38:00.000+02:00", "replies_count": 0, "uuid": "1d0445f4d1a5a62cfa02076c0d96eb2b828f0389"}, "author": "", "url": "https://www.reuters.com/article/us-usa-court-party/u-s-top-court-backs-police-over-arrests-at-racy-washington-party-idUSKBN1FB2FQ", "ord_in_thread": 0, "title": "U.S. top court backs police over arrests at racy Washington party", "locations": [], "entities": {"persons": [{"name": "lawrence hurley", "sentiment": "none"}, {"name": "clarence thomas", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "u.s. supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The U.S. Supreme Court on Monday threw out almost $1 million in damages won by a group of partygoers in a civil rights lawsuit against Washington police stemming from a 2008 gathering in a vacant house featuring scantily clad women with money tucked in their garter belts. \nThe justices ruled 9-0 that police in the U.S. capital could not be sued for detaining those in attendance at the party thrown by a woman dubbed “Peaches,” finding that officers had acted lawfully. \nPartygoers had won a lawsuit accusing the city and police of violating their rights to be free of unreasonable search and seizure under the U.S. Constitution’s Fourth Amendment. \nJustice Clarence Thomas, writing for the court, said, “Most homeowners do not live in near-barren houses. And most homeowners do not invite people over to use their living room as a strip club, to have sex in their bedroom, to smoke marijuana inside, and to leave their floors filthy.” \nBefore making arrests, the officers determined the homeowner had not given permission for the party. \nSeven of the justices agreed that police had probable cause to make the arrests based on various pieces of evidence, including the fact that many partygoers sought to flee when police entered, including one who hid in a closet and another in a bathroom. \nThe partygoers were arrested in 2008 for trespassing but not charged. They did not know that the owner of the property had not given permission for the party, according to lawyers representing 16 of the 21 people arrested. As such, police did not have reason to arrest them, the lawyers contended. \nThomas noted that the partygoers gave police “vague and implausible responses” when asked who gave them permission to be in the house. \nMetropolitan Police Department officers went to the house late at night on March 16, 2008, following a neighbor’s complaint. Officers testified they saw scenes resembling a strip club. \n“Several women were wearing only bras and thongs, with cash tucked into their garter belts. The women were giving lap dances while other partygoers watched,” Thomas wrote. \nThe partygoers won almost $1 million after a federal judge ruled in 2012 that their rights were violated. A divided U.S. Court of Appeals for the District of Columbia Circuit in 2014 upheld the damages award. The city and officers appealed that ruling to the Supreme Court. \nReporting by Lawrence Hurley; Editing by Will Dunham\n ", "external_links": [], "published": "2018-01-22T19:38:00.000+02:00", "crawled": "2018-01-22T19:59:49.022+02:00", "highlightTitle": ""}