{"organizations": [], "uuid": "099c0bac87a9c6094492fdbe1bd7ff613dd44ddd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955379-GettyImages-490198268.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/31/malala-yousafzai-on-feminism-and-raising-awareness-about-female-rights.html", "country": "US", "domain_rank": 767, "title": "How Nobel Peace Prize Laureate Malala Yousafzai embraced feminism", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:37:00.000+02:00", "replies_count": 0, "uuid": "099c0bac87a9c6094492fdbe1bd7ff613dd44ddd"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/31/malala-yousafzai-on-feminism-and-raising-awareness-about-female-rights.html", "ord_in_thread": 0, "title": "How Nobel Peace Prize Laureate Malala Yousafzai embraced feminism", "locations": [], "entities": {"persons": [{"name": "malala yousafzai", "sentiment": "negative"}, {"name": "yousafzai", "sentiment": "none"}, {"name": "emma watson", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The term \"feminism\" has different meanings to different people across the world; but for Malala Yousafzai, she sees it as another expression for equality — a matter that the Nobel Peace Prize laureate takes very seriously.\nWhen she first heard about feminism, Yousafzai wasn't exactly sure what the word meant. According to the messages Yousafzai initially saw, the term \"feminism\" was seen as controversial — about superiority rather than equality.\nIn 2015, the activist revealed in a conversation with actor Emma Watson, that she initially saw feminism as a \"tricky word.\"\nHowever, after listening to the movie star's speech to world leaders as part of Watson's \" HeForShe \" campaign, the \"Harry Potter\" star's speech inspired Yousafzai to look further into the movement, leading Yousafzai to describe herself as a feminist.\n\"I just looked more into it and I realized that feminism is just another word for equality — it means equality and no one would object equality, no one should object equality and it just means that women should have equal rights as men,\" Malala Yousafzai told an audience during a session at the World Economic Forum in Davos last week.\nFABRICE COFFRINI | AFP | Getty Images Pakistani Nobel Peace Prize Malala Yousafzai gestures while talking during a session at the Economic Forum (WEF) annual meeting on January 25, 2018 in Davos, eastern Switzerland \"And then I embraced feminism — and I was already a feminist speaking out about female education, speaking out for women in Pakistan and then all around the world,\" she said, adding that when people speak out about women's rights, they become feminist — even if they choose to embrace it or not.\nOver the last year, women's rights have been pushed further into the spotlight: from people participating in global demonstrations to promote women's rights , or the #MeToo and Time's Up movements that bring to light sexual misconduct seen inside and out of the workplace.\nCommenting on the movements recently seen, Yousafzai said that initiatives like Time's Up and #MeToo were helping women understand that their voice \"is so important to the change they want to see.\"\n\"When we talk about feminism and women's rights, we're actually addressing men and we want them to recognize that women should be accepted.\" -Malala Yousafzai, Nobel Peace Prize Laureate The activist went on to encourage people to speak out if they saw any violence or discrimination in their society.\n\"I said long ago at the UN speech, that first we wanted men to do something for us, but that time has gone now, we're not going to ask men to change the world. We are going to do it ourselves, we are going to stand up for ourselves, we're going to raise our voices and we are going to change the world.\"\n\"So I'd really encourage women and girls to speak out against any discrimination, any violence that they see in their community, in their society,\" said Yousafzai , who went on to discuss how there was no standard that defined what women should say, wear or do — it is the woman's own decision.\nshow chapters #MeToo encourages younger people to speak up: Nadja Swarovski 11:41 AM ET Wed, 24 Jan 2018 | 03:19 When concluding her discussion at the World Economic Forum , the Nobel Prize winner went onto emphasize that when it comes to feminism, \"men have a big role to play\" too.\n\"When we talk about feminism and women's rights, we're actually addressing men and we want them to recognize that women should be accepted, that women should not be prevented, that women should not be stopped from a role — just because they are women.\"\n\"I think that men have a big role to play,\" said Yousafzai, when discussing feminism and how crucial it is to get young men to take on a role in shutting down gender inequality.\n\"We have to teach young boys how to be men. To me, in order to be a man, you have to recognize that all women and everyone around have equal rights as you and that you are also part of this movement for equality.\"\nLike this story? Like CNBC Make It on Facebook .\nDon't miss:\nAt Davos, top execs discuss the #MeToo movement and women at work\n3 key lessons that WWE's Stephanie McMahon learned on her way up to the top\nRichard Branson's top 10 inspirational Quote: s for 2018\nshow chapters Arianna Huffington: Women's March, #MeToo and Time's Up will be historic moments for changes in the workplace 8:58 AM ET Sat, 20 Jan 2018 | 01:15", "external_links": ["https://www.theguardian.com/world/2015/nov/05/malala-yousafzai-tells-emma-watson-im-a-feminist-thanks-to-you", "https://www.facebook.com/CNBCMakeIt/"], "published": "2018-01-31T17:37:00.000+02:00", "crawled": "2018-01-31T16:49:29.006+02:00", "highlightTitle": ""}