{"organizations": [], "uuid": "13dfcc6b2acd90c58e15b9a92ba73f4c8f6bec2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-houston-lawyer-deborah-repman-named-partner-at-caldwell-boudreaux-lefler.html", "country": "US", "domain_rank": 767, "title": "Houston Lawyer Deborah Repman Named Partner at Caldwell Boudreaux Lefler", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:57:00.000+02:00", "replies_count": 0, "uuid": "13dfcc6b2acd90c58e15b9a92ba73f4c8f6bec2a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-houston-lawyer-deborah-repman-named-partner-at-caldwell-boudreaux-lefler.html", "ord_in_thread": 0, "title": "Houston Lawyer Deborah Repman Named Partner at Caldwell Boudreaux Lefler", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 31, 2018 /PRNewswire/ -- Texas oil and gas pipeline law firm Caldwell Boudreaux Lefler PLLC is pleased to announce that firm attorney Deborah Repman has been promoted to partner, effective January 1, 2018.\nMs. Repman advises clients in regulatory compliance at both the federal and state levels regarding the pipeline transportation of crude oil, natural gas liquids and other petroleum products. She has experience with the Federal Energy Regulatory Commission, the Railroad Commission of Texas, and the California Public Utilities Commission. To learn more about her practice, please visit https://www.cblpipelinelaw.com/bios/deborah-repman.html .\nA graduate of the University of Texas at Austin, Ms. Repman earned her law degree at South Texas College of Law Houston with honors, began her legal career with the pipeline regulatory team at Vinson & Elkins LLP, and joined Caldwell Boudreaux upon its founding in 2013.\n\"Debbie is simply an outstanding energy regulatory attorney, and her promotion to partner highlights Caldwell Boudreaux's continued commitment to affording our clients the highest level of service,\" said managing partner Charles Caldwell.\n\"Several of us worked with Debbie at Vinson & Elkins, so we were thrilled when she joined our firm upon its founding, and we are pleased to promote her to partner,\" said firm co-founder Michelle Boudreaux. \"She provides our clients with insightful advice during a challenging regulatory period for midstream companies.\"\nCaldwell Boudreaux Lefler is recognized globally and nationally for its regulatory and litigation work, earning a listing in the prestigious Chambers & Partners legal guides for 2017, Chambers Global and Chambers USA. The firm also is included in the 2017 edition of The Legal 500.\nHouston-based Caldwell Boudreaux Lefler PLLC is an oil and natural gas pipeline law firm that combines a deep bench of highly experienced energy attorneys with the nimbleness of a small firm. The firm's attorneys have spent years helping companies in the pipeline industry successfully navigate the maze of state and federal energy regulations. They bring an unrivaled breadth of experience to each regulatory issue, transaction, and development project, providing clients with up-to-date understandings of critical regulatory developments. Learn more at http://www.cblpipelinelaw.com .\nMedia Contact\nKit Frieden\n800-559-4534\nkit@androvett.com\nView original content: http://www.prnewswire.com/news-releases/houston-lawyer-deborah-repman-named-partner-at-caldwell-boudreaux-lefler-300591146.html\nSOURCE Caldwell Boudreaux Lefler PLLC", "external_links": ["http://www.prnewswire.com/news-releases/houston-lawyer-deborah-repman-named-partner-at-caldwell-boudreaux-lefler-300591146.html", "http://www.cblpipelinelaw.com/", "https://www.cblpipelinelaw.com/bios/deborah-repman.html"], "published": "2018-01-31T17:57:00.000+02:00", "crawled": "2018-01-31T18:38:33.004+02:00", "highlightTitle": ""}