{"organizations": [], "uuid": "40c1d1bd15f2cf4f173640ab035225a9804d9b65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225167283&w=1200&r=LYNXMPEE0O139", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-europe-migrants-asylum/eu-ministers-clash-again-over-reforming-asylum-system-idUKKBN1FE1Z9", "country": "US", "domain_rank": 408, "title": "EU ministers clash again over reforming asylum system", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:13:00.000+02:00", "replies_count": 0, "uuid": "40c1d1bd15f2cf4f173640ab035225a9804d9b65"}, "author": "", "url": "https://uk.reuters.com/article/uk-europe-migrants-asylum/eu-ministers-clash-again-over-reforming-asylum-system-idUKKBN1FE1Z9", "ord_in_thread": 0, "title": "EU ministers clash again over reforming asylum system", "locations": [], "entities": {"persons": [{"name": "jean asselborn", "sentiment": "none"}], "locations": [{"name": "greece", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "mediterranean", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "sofia", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "min read  sofia", "sentiment": "none"}, {"name": "reuters) - european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 2:12 PM / Updated an hour ago EU ministers clash again over reforming asylum system Reuters Staff 3 Min Read \nSOFIA (Reuters) - European Union interior ministers grappled on Thursday with the politically charged issue of reforming the bloc’s broken asylum system, which the bloc wants to fix by June. \nFor more than two years ex-communist states led by Poland and Hungary have defied pressure from other EU capitals to accept refugees at times of high immigration across the Mediterranean to help ease the burden on frontline states such as Greece and wealthy destination nations such as Germany. \nPoland, Hungary and others are reluctant to take in more refugees, who are mostly from Muslim nations in the Middle East and northern Africa, under a quota system. Germany and others say it is a question of EU solidarity. \n“We cannot leave it all to the countries at the external borders (of the EU),” Luxembourg’s Jean Asselborn said ahead of talks with other interior ministers in Sofia, capital of Bulgaria, which holds the EU’s rotating six-month presidency. \n“We need relocation in times of crisis... so every country knows which burdens it will take on,” he said of plans to oblige each EU state to host a certain number of people when arrivals jump. “If we do not manage this, we will choke on it.” \nThe EU asylum system collapsed in 2015 as a million refugees and migrants arrived across the sea, overwhelming Greece and Italy. Poland, Hungary, Slovakia and the Czech Republic refused to take some of the people in. FILE PHOTO: Interior ministers and ministry representives pose for the family photo after the 'V4 Plus' Visegrad Group meeting in Warsaw, Poland November 21, 2016. First row (L-R): Czech Deputy Interior Minister Jiri Novacek, Slovakian Interior Minister Robert Kalinak, Polish Interior Minister Mariusz Blaszczak and Hungarian Interior Minister Sandor Pinter, second row (L-R): Secretary of state in the Slovenian Interior Ministry Andrej Spenga, Croatian Interior Minister Vlaho Orepic, Austrian Interior Minister Wolfgang Sobotka, Bulgarian Deputy Interior Minister Philip Gounev, Polish Deputy Interior Minister Jakub Skiba and Secretary of state of Migration and Asylum of the Belgian Interior Ministry Theo Francken. Agencja Gazeta/Slawomir Kaminski/via REUTERS \nThe dispute ended up in the courts and weakened the bloc’s unity, spilling over to many other policy areas. \n“The quota is not a good thing. But we still have other solutions,” said Slovak Interior Minister Robert Kalinak, referring to a proposal by the eastern states to contribute money, experts and equipment instead of accepting people. \nThe EU has given itself until June to find a compromise acceptable to all, though there are no signs yet of progress. \nThe bloc could then defeat the reluctant easterners in a majority vote, but this would cause even more bad blood between EU states. \nThe EU’s migration chief, Dimitris Avramopoulos, said the “stalemate” had much to do with populist politicians stoking up immigration fears among voters. \n“It’s a question of how you think politically addressing... your domestic audience,” he said on entering the talks. Reporting by Tsvetelia Tsolova in Sofia, Gabriela Baczynska, Robert-Jan Bartunek and Peter Maushagen in Brussels, Writing by Gabriela Baczynska; Editing by Gareth Jones", "external_links": [], "published": "2018-01-25T16:13:00.000+02:00", "crawled": "2018-01-25T16:32:06.033+02:00", "highlightTitle": ""}