{"organizations": [], "uuid": "7bd4fc9e9c2ca77e97eab93639e05bf44970e463", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-correction--arzeda-strengthens-board-of-directors-with-addition-of-biotechnology-veteran-william-baum.html", "country": "US", "domain_rank": 767, "title": "CORRECTION -- Arzeda Strengthens Board of Directors with Addition of Biotechnology Veteran William Baum", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.983, "site_type": "news", "published": "2018-01-17T02:53:00.000+02:00", "replies_count": 0, "uuid": "7bd4fc9e9c2ca77e97eab93639e05bf44970e463"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-correction--arzeda-strengthens-board-of-directors-with-addition-of-biotechnology-veteran-william-baum.html", "ord_in_thread": 0, "title": "CORRECTION -- Arzeda Strengthens Board of Directors with Addition of Biotechnology Veteran William Baum", "locations": [], "entities": {"persons": [{"name": "william baum", "sentiment": "negative"}, {"name": "jeff klunzinger", "sentiment": "none"}, {"name": "arzeda", "sentiment": "none"}, {"name": "william “bill” baum", "sentiment": "none"}, {"name": "baum", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE, Jan. 16, 2018 (GLOBE NEWSWIRE) -- In a release issued under the same headline on December 21, 2017 by Arzeda, we are advised by the company that \"OP Fund\" in the second paragraph should have read \"OS Fund.\" The corrected release follows:\nArzeda , The Protein Design Company™, today announced that biotechnology veteran William “Bill” Baum has joined the company’s board of directors. Baum is a highly respected biotech executive who has held leadership positions at numerous companies, from biotech startups to publicly-traded companies.\nBaum joins Jeff Klunzinger, Co-Founder and General Partner at OS Fund, as the latest additions to the board in the wake of Arzeda closing a $15.2 million Series A fundraising round.\nBaum is an accomplished biotech business strategy and transaction consultant. During his career he has secured and negotiated more than $500M in partner funded biotech and renewable business deals, and has held leadership positions with some of the most dynamic and innovative companies in biofuels, biobased chemicals, agbiotech and human nutrition.\n“There are very few people as well respected as Bill that also have his combination of expertise in both startup and commercial-scale biotechnology businesses,” said Alex Zanghellini, founder and chief executive officer of Arzeda. “We’re thrilled that he’s chosen to help Arzeda achieve our aggressive innovation and corporate growth goals.”\nBaum served on the board of Genomatica for 10 years, where he served as Board Chairman and Chief Business Development Officer from 2010-2014, negotiating partnership and licensing deals with industry leaders such as Waste Management; Tate & Lyle; M&G; Novamont; Versalis/ENI; BASF; DuPont/Tate & Lyle JV and DSM. He also serves as a board director at Gevo, Inc., a publicly traded biofuels company based in Colorado; and Leaf Resources, an Australian public company converting plant biomass into fermentable sugars.\nFrom 1997 to 2010 Baum served in various roles at Diversa/Verenium Corporation, a protein discovery and engineering company later acquired by BASF. Baum has also held leadership positions with International Specialty Products, Inc., a $600M intermediates and specialty chemicals company, and Betz Laboratories, a specialty chemicals company.\n“Arzeda’s protein design technology will dramatically improve how we make food, chemicals, and the advanced materials we need for daily life, including many that have never been possible before,” said Baum. “Arzeda’s founders have built an incredible team and I believe we are just scratching the surface of what their technology can accomplish.”\nArzeda has already successfully developed proteins for global manufacturers, such as DuPont, Mitsubishi Chemical, INVISTA and others to: improve crop yield and resilience; increase the performance and sustainability of advanced polymers; and reduce the cost of producing high-value food ingredients.\nAbout Arzeda\nSince 2008 Arzeda has been harnessing the power of computational and synthetic biology to create new enzymes and chemical products that can compete on performance, cost and sustainability. In partnership with Fortune 500 companies and industrial leaders, the company has developed a portfolio of enzymes and specialty chemicals for polymers, advanced materials and health and nutrition products. Arzeda's proprietary platform and validation process rapidly create \"cell factories\" that can be used at an industrial scale to solve problems and create opportunities that otherwise would be impossible.\nMore information is available at www.arzeda.com .\nMedia Contact John Williams, Scoville PR for Arzeda (206) 625-0075, jwilliams@scovillepr.com\nSource: Arzeda", "external_links": ["https://www.globenewswire.com/Tracker?data=y8M0Ao4TuTglKRncn5fMVcNsxyFuiiBcphpW3W-7O5KYkZlaNro41hSLunw97yyR", "https://www.globenewswire.com/Tracker?data=djCcQoHwSG8sztKI02Lx8PwrQP-YVWIcCi8cGUEQNkqAD2vvK9f6wJfEOoisMYge2Fy_Dnj8hXkr5lJstl4AAA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e779da5c-5857-4a98-87f5-8b1f7a257d06"], "published": "2018-01-17T02:53:00.000+02:00", "crawled": "2018-01-17T03:00:11.000+02:00", "highlightTitle": ""}