{"organizations": [], "uuid": "c972d6fb3db20811a21048a7e8eba6ea15445fd7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-stocks-classaction/a-lawsuit-a-day-u-s-securities-class-actions-soar-idUSKBN1FI2FM", "country": "US", "domain_rank": 408, "title": "A lawsuit a day: U.S. securities class actions soar", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T21:00:00.000+02:00", "replies_count": 0, "uuid": "c972d6fb3db20811a21048a7e8eba6ea15445fd7"}, "author": "", "url": "https://www.reuters.com/article/us-stocks-classaction/a-lawsuit-a-day-u-s-securities-class-actions-soar-idUSKBN1FI2FM", "ord_in_thread": 0, "title": "A lawsuit a day: U.S. securities class actions soar", "locations": [], "entities": {"persons": [{"name": "jo", "sentiment": "negative"}, {"name": "nathan stempel", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "nera", "sentiment": "none"}, {"name": "nera economic consulting", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 7:08 PM / Updated an hour ago A lawsuit a day: U.S. securities class actions soar Jonathan Stempel 3 Min Read \n(Reuters) - The number of class action lawsuits in the United States accusing companies of fraud and other securities law violations soared in 2017, topping one a day even as the value of settlements plunged, a study released on Monday shows. \nThere were 432 shareholder lawsuits accusing companies of making false or misleading statements or concealing bad news about their businesses or mergers, up 44 percent from 300 in 2016, NERA Economic Consulting said in the study. \nThat number was the highest since a federal law to curb frivolous lawsuits, the Private Securities Litigation Reform Act, took effect in 1995, without taking into account “laddering” cases related to initial public offerings. \nNERA, based in New York, said much of the jump came from lawsuits objecting to mergers, which more than doubled for a second straight year, to 197. \nThe number of settlements excluding merger cases also rose, to 148 from 113 a year earlier, but averaged less than $25 million each. Meanwhile, the number of dismissals rose to a record 205 from 146. \n“We’re seeing generally an increase in what I would call ‘smaller cases,’ which are ‘poor quality’ lawsuits often being dismissed or settled for pennies on the dollar,” said Brian Lutz, who defends companies as co-chair of the securities litigation practice at Gibson, Dunn & Crutcher. “Securities litigation for companies large and small has become common.” \nThe pickup in merger-related lawsuits came after Delaware state court judges soured on settlements requiring companies merely to reveal often immaterial details about their mergers. \nJudges found these “disclosure-only” settlements a common way for lawyers to win easy paydays without doing much for shareholder clients. About half of the Fortune 500 companies are incorporated in Delaware. \nNERA said the number of traditional securities class actions, often following revelations of weak financial results or regulatory probes, rose to 216 last year from 195 in 2016. Fifty-five targeted non-U.S. companies, up from 44. \nThe biggest settlement, $210 million, resolved claims that Salix Pharmaceuticals, now part of Canada’s Valeant Pharmaceuticals International Inc, misrepresented inventory levels. \nLast year was the first since 1998 that no settlement reached $250 million, NERA said. \nA $7.2 billion settlement in 2006 over energy company Enron Corp’s collapse remains the largest ever. \nIPO laddering is where investors implicitly agree with underwriters to buy more shares in the market as a condition of investing in an IPO. This can lead to gains for both parties, and let insiders sell stock at prices inflated by laddering. Reporting by Jonathan Stempel in New York; Editing by Frances Kerry", "external_links": [], "published": "2018-01-29T21:00:00.000+02:00", "crawled": "2018-01-29T21:11:32.008+02:00", "highlightTitle": ""}