{"organizations": [], "uuid": "1454aa40a07dc9cf1a35735d5cf881c0edb6ca00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/04/15/100643169-gold-bars-pyramid-ap.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/01/gold-begins-2018-on-a-firmer-note-on-strong-technicals.html", "country": "US", "domain_rank": 767, "title": "Gold begins 2018 on a firmer note on strong technicals", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.246, "site_type": "news", "published": "2018-01-02T03:43:00.000+02:00", "replies_count": 0, "uuid": "1454aa40a07dc9cf1a35735d5cf881c0edb6ca00"}, "author": "", "url": "https://www.cnbc.com/2018/01/01/gold-begins-2018-on-a-firmer-note-on-strong-technicals.html", "ord_in_thread": 0, "title": "Gold begins 2018 on a firmer note on strong technicals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gold hit its highest since late September on Tuesday, extending a year-end rally that saw the metal rise 4.4 percent in the last three weeks of 2017, as a further retreat in the dollar drove prices above $1,310 an ounce.\nThe weaker dollar , which posted its biggest annual drop since 2003 last year, helped to lift gold by more than 13 percent in 2017. The metal surged $55 an ounce in the last three weeks of the year alone.\nWhile technical analysts warn that gold's rally is now looking overstretched, spot prices rose to a peak of $1,312.34 an ounce early on Tuesday.\nSpot gold was up 0.76 percent at $1,312.36 an ounce, while U.S. gold futures for February delivery were up 0.39 percent at $1,314.40 an ounce.\n\"Gold starts 2018 at the highest level since September, and the highest January opening since 2013,\" Mitsubishi analyst Jonathan Butler said. \"It is only the fourth time ever that gold has opened the year above $1,300.\"\n\"The key questions for gold in 2018 will be how quickly developed economies can normalise interest rates after more than a decade of monetary largesse; how much further global equity market rallies can extend; what the longer-term impact of the Trump tax reforms will be on corporates and on U.S. government debt levels; and when inflation will finally start to pick up.\"\nFurther dollar weakness could support gold in the near term, he said. The U.S. currency slipped to a four-month low against the euro on Tuesday on optimism over a brightening economic picture in the euro zone, while stocks had a groggy start to the year.\nGold benefited from technical strength after closing above 200-day and 100-day moving averages over the past two weeks and breaching key psychological resistance at $1,300 on Friday, analysts and traders said.\nBut the bulk of its rally came during the holiday period with much lower-than-normal average daily volumes, Jeffrey Halley, senior market analyst at OANDA, said, and gold is looking overbought.\nSpot gold's 14-day relative strength index (RSI) touched 72.54 on Tuesday, it highest since September 2017. An RSI above 70 indicates a commodity is overbought. \"The RSI has been an excellent indicator of short-term price corrections in 2017,\" Halley said.\nAmong other precious metals, spot silver was up 1.25 percent at 17.158.\nSpot platinum was 1.77 percent higher at $942.10. Palladium reached $1,091.50, up 2.88 percent, exceeding its previous high of $1,077 in January 2001. It was the standout performer among the major precious metals last year, rising 56 percent to hit a series of multi-year highs.", "external_links": [], "published": "2018-01-02T03:43:00.000+02:00", "crawled": "2018-01-02T05:01:15.000+02:00", "highlightTitle": ""}