{"organizations": [], "uuid": "e34d25e8e2f00e5a0a01c3f11469de3ad433126d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://www.gannett-cdn.com/-mm-/41e41971b74a25ca0841ffb0882a9cf5acd9cf9c/c=0-36-580-362&r=x803&c=1600x800/local/-/media/2017/12/29/USATODAY/usatsports/woman-putting-money-in-piggy-bank-smiling-retirement-saving_large.jpg", "site_section": "http://rssfeeds.usatoday.com/_/20/110284352/all-nationnow", "section_title": "GANNETT Syndication Service", "url": "https://www.cnbc.com/2017/02/22/heres-how-much-money-you-should-have-saved-at-every-age.html", "country": "US", "domain_rank": 767, "title": "Retirement planning: Here&apos;s how much money you should have saved at every age", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T17:00:00.000+02:00", "replies_count": 0, "uuid": "e34d25e8e2f00e5a0a01c3f11469de3ad433126d"}, "author": "CNBC", "url": "https://www.cnbc.com/2017/02/22/heres-how-much-money-you-should-have-saved-at-every-age.html", "ord_in_thread": 0, "title": "Retirement planning: Here&apos;s how much money you should have saved at every age", "locations": [], "entities": {"persons": [{"name": "greene", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "More: Estate planning: How to ‘death clean’ your finances While the amount you need in savings is highly personal, and specific dollar amounts can be arbitrary, Greene offers a simple formula to help you figure out if you're setting aside enough money. In your 20s: Aim to save 25% of your overall gross pay, Greene tells CNBC. \"That 25% is the combination of 401(k) withholdings, matching funds from your employer and any cash savings that you have,\" she notes. \"It can also include debt repayment. \"Just make sure your lifestyle expenses don't exceed 75% of your gross income.\" By age 30: Have the equivalent of your annual salary saved, Greene says. If you earn $50,000 a year, aim to have $50,000 in savings when you hit 30. Again, this includes any retirement account contributions, matching funds from your company, cash savings, or money you have invested elsewhere, in index funds or robo-advisers. By age 35: Have twice your annual salary saved. By age 40: Have three times your annual salary saved. By age 45: Have four times your annual salary saved. By age 50: Have five times your annual salary saved. By age 55: Have six times your annual salary saved. By age 60: Have seven times your annual salary saved. By age 65: Have eight times your annual salary saved. CLOSE Study says Americans closing in on retirement now aren't as healthy as prior generations were in their late 50s. Buzz60 Greene's timeline is similar to the one recommended by retirement-plan provider Fidelity Investments , which says a good rule of thumb is to have the equivalent of your salary saved by age 30 and to have 10 times your final salary in savings if you want to retire by age 67. \"While this can sound super daunting today, if you're putting that money to work starting in your 20s, it's not as difficult as it sounds,\" says Greene. She also notes that \"life is anything but linear,\" and it's impossible to follow this formula to a tee. You may have to adjust accordingly and save more or less in any given year, depending on major life events, such as having a kid or buying a home. Need help spending less and saving more? Check out:", "external_links": [], "published": "2018-01-01T17:00:00.000+02:00", "crawled": "2018-01-01T17:02:31.007+02:00", "highlightTitle": ""}