{"organizations": [], "uuid": "7f9a56f30b8094a32022b82a7a7aad4ca7b47581", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226676557&w=1200&r=LYNXMPEE0T1CC", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-germany-politics-afd/we-wont-get-our-way-afd-candidate-for-german-budget-committee-says-idUSKBN1FJ2KN", "country": "US", "domain_rank": 408, "title": "RPT-We won't get our way, AfD candidate for German budget committee says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T19:56:00.000+02:00", "replies_count": 0, "uuid": "7f9a56f30b8094a32022b82a7a7aad4ca7b47581"}, "author": "", "url": "https://www.reuters.com/article/us-germany-politics-afd/we-wont-get-our-way-afd-candidate-for-german-budget-committee-says-idUSKBN1FJ2KN", "ord_in_thread": 0, "title": "RPT-We won't get our way, AfD candidate for German budget committee says", "locations": [], "entities": {"persons": [{"name": "peter boehringer", "sentiment": "negative"}, {"name": "reuters/axel schmidt", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 6:11 PM / in 2 hours We won't get our way, AfD candidate for German budget committee says Michelle Martin 3 Min Read \nBERLIN (Reuters) - The far-right Alternative for Germany (AfD) won’t be able to thwart government plans to spend on refugees or possible euro zone bailouts, even if it holds the chair of the powerful parliamentary budget committee, its candidate for that position said. \nThe AfD has nominated Peter Boehringer, a critic of euro zone rescues and the European Central Bank who made his name campaigning for Germany to bring home its gold reserves, for the role that traditionally falls to the largest opposition party. \nThe anti-immigrant AfD, which surged into parliament with almost 13 percent of the vote in September, will be the biggest opposition force if Chancellor Angela Merkel’s conservatives and the Social Democrats form a coalition. \nBoehringer, 48, who is likely to face a vote in the committee on Wednesday, told Reuters he would take a pragmatic approach to the “very big challenge” of chairing the committee. He was banking on cooperation from other parties on the vast majority of issues, he said. \n“Ninety-five percent of decisions will be made without difficult discussions and probably with consensus - we won’t always vote against things,” Boehringer said, adding that the committee had traditionally been relatively cooperative. \nBut the remaining 5 percent of decisions would be controversial, he said, pointing to the AfD’s opposition to taking in migrants granted “subsidiary protection” rather than full refugee status, euro zone rescues and spending by the European Stability Mechanism (ESM) bailout fund. Peter Boehringer, member of the German parliament from the Alternative for Germany (AfD) party, poses for a portrait in Berlin, Germany January 30, 2018. REUTERS/Axel Schmidt \n“I’ll definitely critically scrutinize that spending because we reject euro zone rescues in principle,” he said but added: “There’s no doubt we’ll be outvoted.” \nWhile Boehringer said he would focus on topics relevant to the AfD, he recognized he had a duty to moderate all topics. \n“It’s not very political - it’s more of a moderating job and that’s why this post is rather overestimated - it’s not as powerful as everyone always makes out,” he said. \nBoehringer said the committee the AfD’s scope for blocking anything would be limited, given that the parties that have a governing majority also have a majority in the committee. \n“We don’t have a majority, not even in the committee, and even having the chair doesn’t help,” he said. \nBoehringer has worked as a corporate consultant and wants all of Germany’s gold repatriated from vaults abroad such as in New York and Paris, arguing that it is too risky to keep the “ultimate reserve” of the central bank outside Germany. But he said this was not a matter for the budget committee. \nThere have been concerns that the AfD will gain credibility by taking positions like the budget committee chair, but the other parties are keen to maintain the informal rules to prevent it from taking on the role of victim by changing those rules. Reporting by Michelle Martin,; editing by Thomas Escritt, Larry King", "external_links": [], "published": "2018-01-30T19:56:00.000+02:00", "crawled": "2018-01-30T20:36:56.007+02:00", "highlightTitle": ""}