{"organizations": [], "uuid": "d40a7e27a0a96fd8362997e968c9607ee70c9d7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-fischer-block-expands-executive-team-to-support-growth.html", "country": "US", "domain_rank": 767, "title": "Fischer Block Expands Executive Team to Support Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:35:00.000+02:00", "replies_count": 0, "uuid": "d40a7e27a0a96fd8362997e968c9607ee70c9d7e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-fischer-block-expands-executive-team-to-support-growth.html", "ord_in_thread": 0, "title": "Fischer Block Expands Executive Team to Support Growth", "locations": [], "entities": {"persons": [{"name": "pete cona", "sentiment": "none"}, {"name": "fischer block", "sentiment": "none"}, {"name": "pete", "sentiment": "none"}, {"name": "greg wolfe", "sentiment": "none"}, {"name": "cona", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "fischer block, inc.", "sentiment": "neutral"}, {"name": "fischer block", "sentiment": "none"}, {"name": "electrical power industry", "sentiment": "none"}, {"name": "versify solutions", "sentiment": "none"}, {"name": "electric power industry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, Jan. 12, 2018 /PRNewswire/ -- Fischer Block, Inc., a leader in providing innovative high-resolution power waveform sensing devices and power reliability solutions, today announced the appointment of Pete Cona to the position of Executive Vice President of Business Development. Mr. Cona is a seasoned Electrical Power Industry executive who previously held executive management roles with successful technology start-ups including most recently Versify Solutions, a leader in cloud-based analytics applications for power generators. Mr. Cona is responsible for overseeing customer engagement and ensuring success with customer deployments.\n\"Pete brings a wide range of systems, software, and industry domain expertise to Fischer Block. He helped pioneer the adoption of cloud based analytics applications in the Electric Power Industry. We are pleased to welcome Pete to the team and look forward to working with him to drive the next stage of growth at Fischer Block,\" stated Fischer Block Co-founder & CEO Greg Wolfe. \"The acceptance of our 'intelligence at the edge' solution has validated our strong value proposition for electric transmission and distribution utilities and large industrial companies and we look forward to have Pete help us manage the growing demand for our products and services while also focusing on successful outcomes with our customers.\"\n\"Fischer Block's innovative waveform capture technology represents the next generation of grid analytics and power reliability management. I am extremely impressed with the Fischer Block product and team and excited about the feedback from the market,\" stated Pete Cona. \"Fischer Block has many unique capabilities starting with the ease of mechanical connection, the efficiency of the data management, the breadth of rich analytics applications, and most importantly their predictive capabilities. This solution is industry leading in many aspects.\"\nAbout Fischer Block\nFischer Block is a leading provider of power waveform analytics solutions for Power Utility and Industrial customers. The patented SMART Block® \"edge device\" mechanically connects to existing electromechanical and microprocessor based relays and motor control center panels in minutes without interrupting grid operations. The device provides continuous waveform data collection and digitization, enabling high-resolution waveform visibility and a full suite of innovative waveform analytics applications and services that identify and address a wide range of power quality and reliability challenges.\nFor information about Fischer Block devices and applications, or to contact a representative, visit the Fischer Block website at www.fischerblock.com .\nContact:\nMargaret Paietta\n188660@email4pr.com\nM: 610-248-4996\nSOURCE Fischer Block, Inc.", "external_links": ["http://www.fischerblock.com/", "http://www.prnewswire.com/news-releases/fischer-block-expands-executive-team-to-support-growth-300581944.html"], "published": "2018-01-12T15:35:00.000+02:00", "crawled": "2018-01-12T15:51:24.002+02:00", "highlightTitle": ""}