{"organizations": [], "uuid": "720fbc51cf4ca40a9ffd21f3be9db9a204ff7413", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224060796&w=1200&r=LYNXMPEE0L0D3", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-shutdown-commodities-factbox/factbox-effect-on-commodities-markets-due-to-u-s-government-shutdown-idUSKBN1FB0I4", "country": "US", "domain_rank": 408, "title": "Factbox: Effect on commodities markets due to U.S. government shutdown", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T14:07:00.000+02:00", "replies_count": 0, "uuid": "720fbc51cf4ca40a9ffd21f3be9db9a204ff7413"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-shutdown-commodities-factbox/factbox-effect-on-commodities-markets-due-to-u-s-government-shutdown-idUSKBN1FB0I4", "ord_in_thread": 0, "title": "Factbox: Effect on commodities markets due to U.S. government shutdown", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. department of agriculture", "sentiment": "none"}, {"name": "u.s. energy department", "sentiment": "none"}, {"name": "commodity futures trading commission", "sentiment": "none"}, {"name": "usda", "sentiment": "none"}, {"name": "u.s. energ", "sentiment": "none"}, {"name": "cftc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Commodities markets were trading normally on Monday even though key regulators, including the Commodity Futures Trading Commission (CFTC), will be operating with skeleton crews due to the U.S. government shutdown.\nDuring shutdowns, nonessential government employees are furloughed, or placed on temporary unpaid leave. Workers deemed essential, including those dealing with public safety and national security, keep working.\nPrivate exchange operators are generally not affected, but weekly economic reports from the U.S. Energy Department and U.S. Department of Agriculture (USDA), key for traders, have in the past been delayed until the government reopens.\nFINANCIAL OVERSIGHT: The CFTC said it would have to furlough 95 percent of employees immediately. An agency spokeswoman said the derivatives regulator could, however, call in additional staff in the event of a financial market emergency.\nThe 2013 shutdown caused weekly figures on positions in options and futures to be delayed until after the government reopened.\nENERGY: The U.S. Energy Information Administration (EIA) said on Monday that normal data collection and publications will continue “until further notice,” as it can operate for a short period of time despite the shutdown.\nIn 2013, the EIA did not send out weekly reports on U.S. inventories, as well as other reports, during the furloughs. Respondents to the department’s surveys were told they could continue to submit data but no one would be able to answer technical questions.\nA notice on the Energy Department’s website said the only functions that will continue are those related to public safety or the protection of property.\nThe U.S. Federal Energy Regulatory Commission said in a statement on Friday that it will continue operations until further notice because it still has funds available, though it will only retain 4.6 percent of its total employees and contractors during the shutdown.\nMonitoring of energy markets will be at a minimal level, according to its contingency plan. The same goes for monitoring of the bulk power system and “threats to energy infrastructures” under FERC’s jurisdiction.\nAGRICULTURE: The USDA said the shutdown may cause a lapse in the preparation and release of the monthly World Agriculture Supply and Demand Estimates report, though the next release is not until Feb. 8.\nThe USDA’s National Agriculture Statistics Service, in a statement on Friday, said none of its reports will be released until the government reopens. NASS was scheduled to publish monthly Cold Storage data on Tuesday and monthly Cattle on Feed data on Friday – reports that can move cattle and hog futures at the Chicago Mercantile Exchange.\nThe USDA’s Agricultural Marketing Service office on Monday said it would continue operating. The office publishes daily livestock, meat and dairy prices, some of which are used to settle CME futures contracts.\nReporting By David Gaffen, Michael Hirtzer, Devika Krishna Kumar, Tim Gardner, Theopolis Waters and Julie Ingwersen; Editing by Jonathan Oatis\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T14:07:00.000+02:00", "crawled": "2018-01-22T10:49:46.042+02:00", "highlightTitle": ""}