{"organizations": [], "uuid": "d72878d544b1fa95d1d6958687af95fe356bab06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104943407-IMG_0148.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/16/blackrocks-message-contribute-to-society-or-risk-losing-our-support.html", "country": "US", "domain_rank": 767, "title": "BlackRock’s Message: Contribute to Society, or Risk Losing Our Support", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:09:00.000+02:00", "replies_count": 0, "uuid": "d72878d544b1fa95d1d6958687af95fe356bab06"}, "author": "Andrew Ross Sorkin", "url": "https://www.cnbc.com/2018/01/16/blackrocks-message-contribute-to-society-or-risk-losing-our-support.html", "ord_in_thread": 0, "title": "BlackRock’s Message: Contribute to Society, or Risk Losing Our Support", "locations": [], "entities": {"persons": [{"name": "fink", "sentiment": "none"}, {"name": "laurence d. fink", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "blackrock", "sentiment": "negative"}, {"name": "wall street", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "On Tuesday, the chief executives of the world's largest public companies will be receiving a letter from one of the most influential investors in the world. And what it says is likely to cause a firestorm in the corner offices of companies everywhere and a debate over social responsibility that stretches from Wall Street to Washington.\nLaurence D. Fink , founder and chief executive of the investment firm BlackRock , is going to inform business leaders that their companies need to do more than make profits — they need to contribute to society as well if they want to receive the support of BlackRock.\nMr. Fink has the clout to make this kind of demand: His firm manages more than $6 trillion in investments through 401(k) plans, exchange-traded funds and mutual funds, making it the largest investor in the world, and he has an outsize influence on whether directors are voted on and off boards.\nMore from The New York Times:\nOil Briefly Reaches $70 as Buoyant Global Economy Bolsters Demand\nBP to Take $1.7 Billion Charge Over Deepwater Horizon Spill\nChinese Carmaker May Use Fiat Chrysler for Foothold in United States\n\"Society is demanding that companies, both public and private, serve a social purpose,\" he wrote in a draft of the letter that was shared with me. \"To prosper over time, every company must not only deliver financial performance, but also show how it makes a positive contribution to society.\"\nIt may be a watershed moment on Wall Street, one that raises all sorts of questions about the very nature of capitalism. \"It will be a lightning rod for sure for major institutions investing other people's money,\" said Jeffrey Sonnenfeld, a senior associate dean at the Yale School of Management and an expert on corporate leadership. \"It is huge for an institutional investor to take this position across its portfolio.'' He said he's seen \"nothing like it.''\nOlivia Michael | CNBC Larry Fink In a candid assessment of what's happening in the business world — and perhaps taking a veiled shot at Washington at the same time — Mr. Fink wrote that he is seeing \"many governments failing to prepare for the future, on issues ranging from retirement and infrastructure to automation and worker retraining.\" He added, \"As a result, society increasingly is turning to the private sector and asking that companies respond to broader societal challenges.\"\nIt is a refrain that we're hearing more and more from various pockets of the business community, and in fact last year company leaders found themselves taking stands on issues like immigration policy, race relations, gay rights and more.\nBut for the world's largest investor to say it aloud — and declare that he plans to hold companies accountable — is a bracing example of the evolution of corporate America. Mr. Fink says he is adding staff to help monitor how companies respond; only time will tell whether BlackRock truly uses his firm's heft to influence new social initiatives.\nPart of Mr. Fink's argument rests on the changing mood of the country regarding social responsibility. He contends that if a company doesn't engage with the community and have a sense of purpose \"it will ultimately lose the license to operate from key stakeholders.\"\nCompanies often talk about contributing to society — sometimes breathlessly — but it is typically written off as a marketing gimmick aimed at raising profits or appeasing regulators.\nMr. Fink's declaration is different because his constituency in this case is the business community itself. It pits him, to some degree, against many of the companies that he's invested in, which hold the view that their only duty is to produce profits for their shareholders, an argument long espoused by economists like Milton Friedman.\n\"What does it mean to say that 'business' has responsibilities? Only people can have responsibilities,\" Friedman wrote, almost rhetorically, back in 1970 in this very newspaper. \"Businessmen who talk this way are unwitting puppets of the intellectual forces that have been undermining the basis of a free society these past decades.\"\nUntil recently, companies like BlackRock have traditionally been passive investors and have done little to pressure the leaders of companies they invested in; in fact they were known for rubber stamping management's plans. It was active investors who sought to hold companies accountable — either by agitating for change or by selling their shares to express their displeasure.\nIndeed, Mr. Fink has in the past denounced \"activist\" shareholders as too focused on the short term. \"If you asked me if activism harms job creation, the answer is yes,\" he told me back in 2014. Now he is changing his stripes.\nOver the past two years, for example, BlackRock quietly became a thorn in the side of Exxon . In 2016, the firm withheld support from two directors as a protest against Exxon's \"non-engagement\" policy, which barred independent board members from meeting with shareholders like Mr. Fink. Then, in 2017, BlackRock supported a shareholder proposal to enhance the company's disclosures on climate, in part because Exxon's policy prevented the firm from getting a full understanding of its long-term strategy and risk exposure.\nThe climate disclosure proposal ultimately passed, and just last month Exxon agreed to publish climate impact reports. Perhaps even more notably, Exxon also changed its policy of non-engagement, and now permits meetings between shareholders and independent directors.\nBlackRock has even begun siding with activist investors themselves, something it hasn't publicized. One of its funds voted in favor of the activist Nelson Peltz last year in his proxy fight with Procter & Gamble . It also voted in favor of Bill Ackman against ADP . BlackRock voted in favor of activist-led proposals in 19 percent of proxy fights last year and that number is likely to rise.\nIn a surprising twist, even activist investors are taking up social causes. Jana Partners and Calstrs, the huge California retirement system that manages the pensions of the state's public schoolteachers, wrote a letter to Apple last week demanding that it focus more on the detrimental effects its products may have on children.\nThe chief executive of Whole Foods, John Mackey, once referred to Jana as \"greedy bastards\" when the firm was attacking him. But here was Jana espousing the importance of issues like public health, human capital management and environmental protection, and saying that \"companies pursuing business practices that make short-term sense may be undermining their own long-term viability.\"\n\"In the case of Apple,\" Jana wrote, \"we believe the long-term health of its youngest customers and the health of society, our economy, and the company itself, are inextricably linked.\" (Side note: It isn't clear why Jana went after Apple, considering that it has better tools to manage the use of its products by children than anyone else in the industry; but the general idea of technology companies paying more attention to children's health is a good one.)\nMr. Fink makes a point in his letter that the recent corporate tax cut could bring out the kind of activist investors he once denounced. \"Tax changes will embolden those activists with a short-term focus to demand answers on the use of increased cash flows,\" he said, \"and companies who have not already developed and explained their plans will find it difficult to defend against these ", "external_links": [], "published": "2018-01-16T13:09:00.000+02:00", "crawled": "2018-01-16T13:46:17.017+02:00", "highlightTitle": ""}