{"organizations": [], "uuid": "98281c279baa55ef9b0f76563db31b8b62c05035", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/morningcall/update-1-asia-morning-call-global-markets-idUSL4N1PJ5JO", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Asia Morning Call-Global Markets", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.026, "site_type": "news", "published": "2018-01-25T05:31:00.000+02:00", "replies_count": 0, "uuid": "98281c279baa55ef9b0f76563db31b8b62c05035"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/morningcall/update-1-asia-morning-call-global-markets-idUSL4N1PJ5JO", "ord_in_thread": 0, "title": "UPDATE 1-Asia Morning Call-Global Markets", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "stock markets net chng stock markets net chng s&p/asx", "sentiment": "neutral"}, {"name": "krw", "sentiment": "none"}, {"name": "lme", "sentiment": "none"}, {"name": "ssec", "sentiment": "none"}, {"name": "bonds net chng bonds net chng jp", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 25 (Reuters) - Stock Markets Net Chng Stock Markets Net Chng S&P/ASX 200** 6,054.70 17.70 NZX 50** 8,324.09 2.30 DJIA** 26,252.12 41.31 NIKKEI** 23,940.78 -183.37 Nasdaq** 7,415.059 -45.23 FTSE** 7,643.43 -88.40 S&P 500** 2,837.54 -1.59 Hang Seng** 32,958.69 27.99 SPI 200 Fut 5,982.0 -19.0 STI** 3,609.24 17.16 SSEC** 3,560.7329 14.23 KOSPI** 2,538.00 1.40 -- Bonds Net Chng Bonds Net Chng JP 10 YR Bond 0.08 0.001 KR 10 YR Bond 2.643 -0.015 AU 10 YR Bond 2.842 0.028 US 10 YR Bond 2.6447 0.023 NZ 10 YR Bond 2.995 0.045 US 30 YR Bond 2.9267 0.025 -- Currencies Net Chng Net Chng SGD US$ 1.3076 -0.0096 KRW US$ 1,064.06 -8.83 AUD US$ 0.8075 0.0075 NZD US$ 0.7424 0.0072 EUR US$ 1.24 0.0103 Yen US$ 109.15 -1.14 THB US$ 31.54 -0.27 PHP US$ 50.813 -0.251 IDR US$ 13,311 -9 INR US$ 63.65 -0.1 MYR US$ 3.911 -0.014 TWD US$ 29.302 -0.1 CNY US$ 6.359 -0.035 HKD US$ 7.818 -0.0007 -- Commodities Net Chng Net Chng Spot Gold 1,358.48 17.47 Silver (Lon) 17.55 0.505 U.S. Gold Fut 1,358 21.3 Brent Crude 70.82 0.86 Iron Ore CNY523.5 2.5 TRJCRB Index 199.509 2.5698 TOCOM Rubber JPY204.2 0.1 LME Copper 7,144.5 221.5 -- ** indicates closing price All prices as of 2104 GMT EQUITIES GLOBAL -The U.S. dollar extended recent weakness, hitting three-year lows again, and U.S. bond prices eased on Wednesday after U.S. Treasury Secretary Steven Mnuchin said he welcomed its weakness in the currency. Fear of protectionism from the U.S. economy, the world's largest, had already pushed the greenback to a three-year low, but Mnuchin's remark at the annual Davos summit of business and political leaders pushed it down further. For a full report, click on - - - - NEW YORK - Both the Dow and S&P 500 edged higher on Wednesday while the Nasdaq lost ground in choppy trading in the wake of comments by U.S. Commerce Secretary Wilbur Ross which hinted at action against China in a trade war. The Dow Jones Industrial Average rose 63.55 points, or 0.24 percent, to 26,274.36, the S&P 500 gained 3.17 points, or 0.11 percent, to 2,842.3 and the Nasdaq Composite dropped 24.34 points, or 0.33 percent, to 7,435.95. For a full report, click on - - - - LONDON - A slump in the dollar hit European shares on Wednesday and dragged most of the continent's indexes into negative territory as Wall Street rose. The pan-European STOXX 600 index closed down 0.4 percent while Germany's DAX and the FTSE dipped 0.8 and 0.9 percent respectively, with British shares also suffering from gains by sterling against the greenback. For a full report, click on - - - - TOKYO - Japan's Nikkei share average took a breather on Wednesday morning after rising to a fresh 26-year high in the previous session, as weakness in exporters such as Murata and Fanuc offset gains in real estate stocks. The Nikkei dropped 0.4 percent to 24,021.73 in midmorning trade, after touching 24,129.34 on the previous day, the highest level since November 1991. For a full report, click on - - - - SHANGHAI - China stocks extended their climb on Wednesday, with the main indexes reaching new two-year peaks and one for start-up firms having its best day in five months. At the close, the Shanghai Composite index was up 14.23 points or 0.4 percent at 3,560.73. For a full report, click on - - - - AUSTRALIA - Australian shares are expected to open lower on Thursday taking their cues from Wall Street, where stocks faltered after U.S. Commerce Secretary Wilbur Ross' comments, which hinted at action against China in a trade war. The local share price index futures fell 0.3 percent or 19 points, a 72.7 point discount to the underlying S&P/ASX 200 index close. The benchmark rose 0.3 percent on Wednesday. For a full report, click on - - - - SEOUL - South Korea's KOSPI stock index rose on Wednesday. At 06:30 GMT, the KOSPI was up 1.40 points or 0.06 percent at 2,538.00. For a full report, click on - - - - FOREIGN EXCHANGE NEW YORK - The dollar fell to a fresh three-year low against a basket of major currencies on Wednesday after the U.S. Treasury secretary said he welcomed weakness in the currency, and as investors worried about U.S. President Donald Trump's protectionist agenda. The dollar index, which measures the greenback against a basket of six major currencies, was down 0.93 at 89.283, slipping below 90 for the first time since December 2014. The dollar was down about 1 percent against the yen. For a full report, click on - - - - CHINA - China's yuan rose and finished its domestic session on Wednesday at the firmest against the U.S. dollar since November 2015, underpinned by broad weakness in the greenback. The onshore yuan opened at 6.3983 per dollar and changed hands at 6.3875 by the 0830 GMT domestic close, the strongest such close since Nov. 20, 2015. For a full report, click on - - - - AUSTRALIA - The New Zealand dollar celebrated a fresh four-month peak on Wednesday aided by heightened risk appetite globally, while its Australian counterpart was still wrestling with stiff resistance atop 80 U.S. cents. The Aussie fared a bit better against the unloved U.S. dollar, bouncing to $0.8005 from a low of $0.7957 on Tuesday. For a full report, click on - - - - SEOUL - The Korean won was unbudged on the local platform while bond yields climbed. The won was Quote: d at 1,070.2 per dollar on the onshore settlement platform , unchanged from the previous close. In offshore trading, the won was Quote: d at 1,069.59 per dollar, up 0.31 percent from the day earlier. For a full report, click on - - - - TREASURIES NEW YORK - U.S. Treasury debt prices slumped on Wednesday, after Treasury Secretary Steven Mnuchin backed a weaker dollar to help boost America's global trade, breaking from the traditional strong currency policy of past administrations. U.S. 30-year bond yields, which move inversely to prices, rose to their highest in more than three months, while those on 10-year and 2-year notes touched session highs. For a full report, click on - - - - LONDON - Bond yields in the euro zone crept higher on Wednesday, as investors struck a cautious tone the day before a European Central Bank meeting. But a strong euro, which rose above $1.23 to its highest level since December 2014, could encourage the ECB to play down talk of an imminent change in its policy stance. For a full report, click on - - - - TOKYO - Japanese government bond prices edged higher on Wednesday, with the Bank of Japan's stance towards maintaining its easy policy providing support. March 10-year JGB futures rose 0.06 point to 150.53. For a full report, click on COMMODITIES GOLD Gold prices rose on Wednesday, hitting their highest since August, 2016, as investors sought insurance against possible inflation after U.S. Treasury Secretary Steven Mnuchin welcomed a weaker dollar. Spot gold was up 1.4 percent $1,360.23 an ounce at 2:05 p.m. EST (1905 GMT). U.S. gold futures for February delivery settled up $19.60, 1.5 percent, at $1,356.30 per ounce. For a full report, click on - - - - IRON ORE Iron ore futures in China fell for a second straight session on Wednesday, reflecting concerns over higher supply that could add to record stockpiles of the steelmaking raw material in the world's top buyer. The most-active iron ore on the Dalian Commodity Exchange closed down 1.1 percent at 522 yuan ($82) a tonne, having hit 518 yuan earlier, near Tuesday's three-week trough. For a full report, click on - - - - BASE METALS A sharply weaker dollar helped copper to rebound on Wednesday from a one-month low despite a second day of rapidly rising inventories that suggested there is plentiful supply of the metal used in power and construction. Nickel, meanwhile, pushed through a key technical level to reach a 2-1/2 year peak and lead and zinc advanced to multi-year highs. For a full report, click on - - - - OIL Oil prices rallied on heavy volume on Wednesday, boosted by a record 10th straight weekly decline in U.S. crude inventories, though reduced refining activity and rising production signaled U.S. stocks could rise in coming weeks. U.S. West Texas Intermediate (WTI) futures settled up $1.14, or 1.8 percent, to $65.80. Brent futures gained 57 cents to $70.53 a barrel. Both benchmarks were at their highest since December 2014. For a full report, click on - - - - PALM OIL Malaysian palm oil futures rose over 1 percent in their second half of trading on Wednesday, charting a third consecutive session of gains, as bullish sentiment on declining production lifted the market. The benchmark palm oil contract for April delivery on the Bursa Malaysia Derivatives Exchange rose 1.1 percent to 2,521 ringgit ($644.59) a tonne at the end of the trading day. It rose earlier to an intraday high of 2,526 ringgit, its strongest since Jan. 16. For a full report, click on - - - - RUBBER Benchmark Tokyo rubber futures extended declines on Wednesday to hit a one-month low, weighed down by sluggish Shanghai futures and the yen's advance to its highest in four months, brokers said. The Tokyo Commodity Exchange rubber contract for June delivery, finished 2.5 yen lower at 204.1 yen ($1.85) per kg. Earlier in the session, it touched 203.9 yen, the lowest since Dec. 22. For a full report, click on - - - - (Bengaluru Bureau; +91 80 6749 1130)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T05:31:00.000+02:00", "crawled": "2018-01-25T13:22:15.019+02:00", "highlightTitle": ""}