{"organizations": [], "uuid": "acfc404ba02981ac72e89d8be213950241f8f361", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104929780-SpaceX_Falcon_Heavy.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/24/spacex-test-fires-falcon-heavy.html", "country": "US", "domain_rank": 767, "title": "SpaceX test fires Falcon Heavy", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T21:12:00.000+02:00", "replies_count": 0, "uuid": "acfc404ba02981ac72e89d8be213950241f8f361"}, "author": "Michael Sheetz", "url": "https://www.cnbc.com/2018/01/24/spacex-test-fires-falcon-heavy.html", "ord_in_thread": 0, "title": "SpaceX test fires Falcon Heavy", "locations": [], "entities": {"persons": [{"name": "elon musk", "sentiment": "none"}], "locations": [{"name": "kennedy space center", "sentiment": "none"}], "organizations": [{"name": "falcon heavy spacex", "sentiment": "negative"}, {"name": "falcon heavy", "sentiment": "negative"}, {"name": "boeing", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "nasa", "sentiment": "none"}, {"name": "spacex", "sentiment": "none"}, {"name": "falcon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SpaceX test-fired its Falcon Heavy rocket on Wednesday, bringing it one step closer to becoming one of the most powerful rockets to ever launch.\nThis was the first time SpaceX fired up Falcon Heavy, in a typical test that is critical to preparing a rocket for launch. CEO Elon Musk said in a tweet shortly after that the test firing \"was good,\" adding that Falcon Heavy will launch \"in a week or so.\"\nFalcon Heavy is built on top three of the company's Falcon 9 rocket cores, creating a 27-engine behemoth that should generate the thrust equivalent to about 18 Boeing 747 aircraft at liftoff. Musk has called Falcon Heavy the \"most powerful rocket in the world by a factor of two.\"\nTesting delays have pushed back the planned static fire, which is a test where the rocket ignites its engines while strapped to the launchpad.\nFalcon Heavy's static fire took place at Launch Complex 39A at NASA's Kennedy Space Center, where the inaugural launch should take place in the next few weeks.\n@SpaceX: First static fire test of Falcon Heavy complete—one step closer to first test flight!\nSpaceX did not immediately respond to CNBC's request for comment.\nAlthough it's built using the first stages of three Falcon 9 rockets, which cost around $62 million a piece, SpaceX says Falcon Heavy will cost only $92 million per launch. That's a fraction of the cost of any existing heavy rocket competitor, with costs running in the hundreds of millions.\nSpaceX plans to make Falcon Heavy reusable in the same way as the company's previous rockets. The first stages of Falcon 9 typically return to Earth and land upright on either a landing pad or the company's remote barge. SpaceX then refurbishes the first stages, making it possible to use them again. For Falcon Heavy, this means the two outer rocket cores will return first, with the central core following later.\nFor the upcoming test flight, the rocket will not carry a customer's payload. Instead, Musk will launch a Tesla Roadster playing David Bowie's \"Space Oddity\" into \"a billion year elliptic Mars orbit.\" Musk is also CEO of Tesla .", "external_links": [], "published": "2018-01-24T21:12:00.000+02:00", "crawled": "2018-01-24T21:28:23.031+02:00", "highlightTitle": ""}