{"organizations": [], "uuid": "f743a618c3b1b77eea76035bb5b521c5074b993f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/22/104726108-RTX3H4OM-tim-cook-apple.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/17/cramer-apples-tim-cook-credits-most-of-350b-plan-to-repatriation.html", "country": "US", "domain_rank": 767, "title": "Cramer: Apple's Tim Cook credits most of $350B plan to repatriation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T01:12:00.000+02:00", "replies_count": 0, "uuid": "f743a618c3b1b77eea76035bb5b521c5074b993f"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/17/cramer-apples-tim-cook-credits-most-of-350b-plan-to-repatriation.html", "ord_in_thread": 0, "title": "Cramer: Apple's Tim Cook credits most of $350B plan to repatriation", "locations": [], "entities": {"persons": [{"name": "tim cook", "sentiment": "negative"}, {"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "negative"}, {"name": "truman", "sentiment": "none"}, {"name": "cook", "sentiment": "none"}, {"name": "george marshall", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "western europe", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "While CNBC's Jim Cramer would be happy to talk about the tax benefits and windfall of bonuses that came from Washington's new tax law , he'd rather talk about Apple .\n\"Apple, using some of the gigantic $252 billion cash hoard that it has overseas, announced [Wednesday] what I think is a modern-day Marshall Plan for the U.S. economy,\" the \" Mad Money \" host said. \" Apple committed to directly investing $350 billion into the United States over the next five years, including $38 billion in repatriation taxes.\"\nCramer was referencing the United States' 1948 initiative in which the Truman administration devoted $140 billion, adjusted for inflation, to rebuilding Western Europe after World War II.\nIn some ways, Apple CEO Tim Cook's thinking was bigger than General George Marshall's, Cramer argued after a phone conversation with Cook himself.\nIn his conversation with Cook, Cramer said the CEO emphasized the need for his company to be a leading corporate citizen and create jobs that will last through technological advances.\n\"He emphasized that he's done his best to ensure that everyone Apple touches does better with this newfound money. And that's what made me think of the Marshall Plan,\" Cramer said.\n\"Cook told me something else today that crystallizes what is happening in the stock market and in the economy,\" the \"Mad Money\" host continued. \"He said that 'While some of these efforts were indeed in the works, Washington enabled most of this job-creating plan to occur by changing the tax code to allow companies to return capital to all stakeholders,' a series of reforms that Tim has championed for quite a long time.\"\nOf the $350 billion Cook's company committed, $55 billion is set to be directly injected into the U.S. economy sometime in 2018.\nIn addition, Apple announced Wednesday that it would create 20,000 jobs via direct hiring at its existing campus and the new campus it plans to build.\n\"Frankly, I think Apple's view of how to generate jobs, how to create wealth away from the shareholder base, is probably a heck of a lot better than anything the government could ever do,\" Cramer said.\nIn Cramer's last interview with Cook in May 2017, Cook said Apple was already supporting over 2 million jobs, if one considers its direct employees and the employees of its 9,000 suppliers.\nWith the plan announced today, Cramer predicted a \"multiplier effect\" that would create millions more.\nAnd while Apple is only one company and can't speak for its corporate compatriots when it comes to influencing the economy, Cramer said the bottom line was undeniable.\n\"Whatever you think of the president, part of his agenda is working. If Apple turns out to be the tip of the iceberg, then this already strong economy could get even stronger,\" Cramer said. \"And frankly, I don't know about you, [but] I'd rather have Tim Cook deciding what to do with this cash than anyone in the capital.\"\nWATCH: Cramer on Apple's $350 billion plan show chapters Cramer: Apple's Tim Cook credits most of $350B plan to repatriation tax holiday 17 Hours Ago | 12:30 Disclosure: Cramer's charitable trust owns shares of Apple.\nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-18T01:12:00.000+02:00", "crawled": "2018-01-18T01:23:29.001+02:00", "highlightTitle": ""}