{"organizations": [], "uuid": "13fc0732cbd60025b294908a5e921ce2353da99f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/11/30/103204433-IMG_1136.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/18/babysitting-helped-glossier-founder-emily-weiss-launch-her-career.html", "country": "US", "domain_rank": 767, "title": "Babysitting helped Glossier founder Emily Weiss launch her career", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T20:46:00.000+02:00", "replies_count": 0, "uuid": "13fc0732cbd60025b294908a5e921ce2353da99f"}, "author": "Courtney Connley", "url": "https://www.cnbc.com/2018/01/18/babysitting-helped-glossier-founder-emily-weiss-launch-her-career.html", "ord_in_thread": 0, "title": "Babysitting helped Glossier founder Emily Weiss launch her career", "locations": [], "entities": {"persons": [{"name": "emily weiss", "sentiment": "positive"}, {"name": "weiss", "sentiment": "none"}, {"name": "michael nagle", "sentiment": "none"}, {"name": "ralp", "sentiment": "none"}, {"name": "wilton", "sentiment": "none"}, {"name": "trish goff", "sentiment": "none"}], "locations": [{"name": "connecticut", "sentiment": "none"}], "organizations": [{"name": "vogue", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Emily Weiss is an expert at rising through the ranks.\nIn 2010, she captured the attention of millions with her beauty blog, Into The Gloss , which gives an insider's view of the routine and careers of beauty and fashion's biggest names. In 2014, she capitalized on her blog's popularity to launch Glossier, which now offers 22 different beauty products. \nWeiss's brand has become a cult favorite among millennials — to say the least (the brand once had a 10,000-person waitlist for its brow gel.) But her rise to prominence in the beauty industry didn't happen overnight. \nIn the seventh grade, the Connecticut native wrote a letter that was published in Vogue magazine about a fashion spread featuring model Trish Goff.\nMichael Nagle | Bloomberg | Getty Images Emily Weiss, founder and chief executive officer of Glossier She tells The Cut , \"I wrote in and said, 'Thank you for showing young women how to wear short skirts in a classy way, Signed, Emily Weiss, Wilton, Connecticut.' When they published it, I died.\"\nAs a teenager, she worked as a weekend babysitter for a neighbor who worked for Ralph Lauren. \n\"It was like, 'I like your kid and all, but what I really want is to work at Ralph Lauren,'\" she says.\nAfter expressing her interest in the company, Weiss scored an internship at 15 years old that helped to jump-start the rest of her career. Commuting from Connecticut to New York that summer, Weiss says she used the opportunity to prove she was willing to do whatever it took to succeed in the industry. \n\"I proved myself to be very valuable,\" she tells The Cut. \"You have to be so many things. You have to be a sponge, you have to be respectful, you have to roll up your sleeves. I really earned my right to be there. I was just like, 'Put me to work. I love work!' \"\n\"Put me to work. I love work!\" -Emily Weiss, founder and CEO, Glossier Eventually, her hard work caught the attention of senior design director Whitney Fairchild. Fairchild recommended Weiss to Amy Astley, who was editor-in-chief of Teen Vogue at the time. Astley was impressed with the young intern and brought her on board to work at the magazine. \nFrom there, Weiss held a number of assistant jobs at Condé Nast before making the decision to launch her blog in 2010. Today, Glossier is continuing to expand, and has plans for a retail space set to open later this year that will allow the company's customers to buy products both online and in-store. \nWeiss credits her parents with emphasizing hard work early. In an interview with Entrepreneur she explained the influence her father's career had on her. \n\"He was very much the American dream — didn't graduate college, printed his own business cards, worked his way up from door-to-door salesman,\" she says. \"I learned the value of hard work from them.\" \nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: How Kylie Jenner turned her $29 lipstick business into a $420 million empire in 18 months \nshow chapters Kylie Jenner turned a $29 lipstick into a $420 million beauty empire      8:33 AM ET Thu, 14 Sept 2017 | 01:12", "external_links": ["https://www.forbes.com/sites/celiashatzman/2016/03/14/emily-weiss-on-glossiers-new-makeup-why-she-launched-into-the-gloss-desert-island-beauty-staples/#3c7d5aac4b69", "https://intothegloss.com/", "https://www.thecut.com/2018/01/glossier-emily-weiss.html", "https://www.facebook.com/CNBCMakeIt/", "https://www.entrepreneur.com/article/298014"], "published": "2018-01-18T20:46:00.000+02:00", "crawled": "2018-01-18T19:54:31.008+02:00", "highlightTitle": ""}