{"organizations": [], "uuid": "59e4d1c0b4432b41eb797dcd6702e81fadb80b28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221234025&w=1200&r=LYNXMPEE0A1R9", "site_section": "http://feeds.reuters.com/reuters/UKScienceNews", "section_title": "Reuters: Science News", "url": "https://uk.reuters.com/article/us-science-dinosaur/fossil-of-dinosaur-swept-away-in-ancient-australian-river-found-idUKKBN1F02RV", "country": "US", "domain_rank": 408, "title": "Fossil of dinosaur swept away in ancient Australian river found", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T22:23:00.000+02:00", "replies_count": 0, "uuid": "59e4d1c0b4432b41eb797dcd6702e81fadb80b28"}, "author": "", "url": "https://uk.reuters.com/article/us-science-dinosaur/fossil-of-dinosaur-swept-away-in-ancient-australian-river-found-idUKKBN1F02RV", "ord_in_thread": 0, "title": "Fossil of dinosaur swept away in ancient Australian river found", "locations": [], "entities": {"persons": [{"name": "matthew herne", "sentiment": "none"}, {"name": "diluvicursor", "sentiment": "none"}, {"name": "peter trusler/handout", "sentiment": "none"}, {"name": "will dunham", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "antarctica", "sentiment": "none"}, {"name": "bass strait", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "university of queensland", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 8:24 PM / Updated 28 minutes ago Fossil of dinosaur swept away in ancient Australian river found Will Dunham 3 Min Read \nWASHINGTON (Reuters) - In sandstone next to the high tide mark at the edge of Bass Strait in southeastern Australia, scientists have unearthed fossils of a two-legged, turkey-sized, plant-eating dinosaur apparently swept away in a large, powerful ancient river. Artist's impression of two Diluvicursor pickeringi foraging on the bank of a high-energy river within the Australian-Antarctic rift valley are seen in this image provided January 11, 2018. Peter Trusler/Handout via REUTERS \nPaleontologists on Thursday said the partial skeleton of the previously unknown beastie, named Diluvicursor pickeringi, that lived about 113 million years ago provides insight into the array of dinosaurs that inhabited Australia during the Cretaceous Period when it was still connected to Antarctica. \n“Skeletons of dinosaurs from Australia are very rare,” said University of Queensland paleontologist Matthew Herne, noting that Diluvicursor brings to only 19 the number of Australian dinosaurs that have been named to date. \nDiluvicursor’s remains were found amongst a jumbled collection of large fossilized tree trunks also apparently swept down the river during a flood. The site is on the south coast of the state of Victoria, about 105 miles (170 km) from Melbourne. \nDiluvicursor was about 7-1/2-feet (2.3 meters) long. Herne said it was “comparable to a large domesticated turkey in weight, but of course much longer than a turkey because of its tail.” The fossils included an almost complete tail, the lower part of the right leg and most of the right foot. \nIt lived alongside meat-eating dinosaurs about 20 feet (6 meters) long, as well as armored dinosaurs, turtles, shrew-sized mammals and flying reptiles called pterosaurs. Herne said Diluvicursor, a member of a dinosaur group called ornithopods, was similar to another small, two-legged herbivorous dinosaur called Leaellynasaura that lived at about the same time and whose remains were unearthed about 9 miles (15 km) away. \nThe two may have occupied different ecological niches and eaten different plants. Leaellynasaura was more lightly built, had a longer tail and may have been a more agile runner. \n“An analogy can be seen in the kind of diversity seen in the kangaroos and wallabies in present-day Australia who occupy very different niches, from open plains to dense forest habitats,” Herne said. \nDiluvicursor roamed a forested broad rift valley floodplain between Australia and Antarctica, which remained connected until about 45 million years ago. \n“The jury’s out on the climate,” Herne said. “Some believe that the climate was cold with winter ice, while others suggest the climate was warmer or more temperate.” \nIts genus name, Diluvicursor, means “flood runner.” Its species name, pickeringi, honors the late paleontologist David Pickering. \nThe research was published in the scientific journal PeerJ. Reporting by Will Dunham; Editing by Sandra Maler", "external_links": [], "published": "2018-01-11T22:23:00.000+02:00", "crawled": "2018-01-11T22:54:42.004+02:00", "highlightTitle": ""}