{"organizations": [], "uuid": "4c7b51eabdd8d0481e0c8d784b41e8a795d68139", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226962470&w=1200&r=LYNXMPEE0U10K", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-eu-ryanair/ryanair-to-put-brexit-clause-into-ticket-sales-for-summer-2019-idUKKBN1FK1ZC", "country": "US", "domain_rank": 408, "title": "Ryanair to put Brexit clause into ticket sales for summer 2019", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:04:00.000+02:00", "replies_count": 0, "uuid": "4c7b51eabdd8d0481e0c8d784b41e8a795d68139"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-ryanair/ryanair-to-put-brexit-clause-into-ticket-sales-for-summer-2019-idUKKBN1FK1ZC", "ord_in_thread": 0, "title": "Ryanair to put Brexit clause into ticket sales for summer 2019", "locations": [], "entities": {"persons": [{"name": "alistair smout", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "kenny jacobs", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "ryanair", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 1:57 PM / Updated 3 hours ago Ryanair to put Brexit clause into ticket sales for summer 2019 Alistair Smout 3 Min Read \nLONDON (Reuters) - Irish budget airline Ryanair will put a “Brexit clause” into ticket sales for summer 2019, warning customers that their tickets will not be valid if the issue of aviation regulation after Britain’s departure from the EU remains unresolved. \nFlying rights to, from and within the European Union, as well as between the United States and Britain, are currently covered by EU-wide “Open Skies” agreements, but this arrangement is jeopardised by Brexit. \nThere is no fallback option for aviation if Britain leaves the EU without a deal, and Ryanair’s chief marketing officer said on Wednesday that airlines had no clarity how aviation will be regulated after Britain’s scheduled departure at the end of March 2019. \n“We’ll announce our (2019) summer schedule soon enough... and there’ll be a term and condition that this is subject to the regulatory environment allowing this flight to take place,” Kenny Jacobs told reporters, adding that the tickets would go on sale in September. \nCustomers will be refunded if the clause is exercised. \n“We don’t see a regulatory solution yet... If in the meantime between now and September, there’s a regulatory solution found, then those tickets will be sold as normal.” \nAirlines have said they need a new bilateral deal between Britain and Europe by September or October to replace the EU’s “Open Skies” regime, which allows EU airlines to fly wherever they wish within the bloc, to be able to provide scheduled flights in the months after Britain leaves the EU. FILE PHOTO - People disembark a Ryanair flight as some wait to board at Stansted airport in London, Britain September 27, 2017. REUTERS/Clodagh Kilcoyne \nBritain could also be excluded from the European Aviation Safety Agency (EASA) after it quits the EU. British government ministers have said they expect to remain included in both Open Skies and EASA. \nAirlines are beginning to draw up contigency plans for Brexit, with leading industry body IATA saying that a clear view of Brexit is needed by October at the latest. \nRyanair has applied for a British operating licence to protect its small domestic UK service, and last October, Thomas Cook inserted a similar clause to the one proposed by Ryanair into its ticket sales for April 2019. \nJacobs said it was likely that the clauses would not need to be exercised and a worst-case scenario, where flights between Britain and the European Union were grounded, would be avoided, as authorities look to buy more time under current rules. \nThe EU and Britain are both seeking a transition deal to help businesses adapt to Brexit, where Britain will follow EU regulations for at least 21 months after it departs. \n“There’s clearly going to be an extension to Brexit,” he said, adding current rules would likely continue beyond March next year. \n“They are going to find a solution to Open Skies, but it will take a bit longer.” Reporting by Alistair Smout; Editing by Adrian Croft", "external_links": [], "published": "2018-01-31T16:04:00.000+02:00", "crawled": "2018-01-31T16:32:33.014+02:00", "highlightTitle": ""}