{"organizations": [], "uuid": "2fb508801f0885b59123eba2cc6db0586b850ddc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-real-estate-acquisitions-company-enters-into-agreement-to-purchase-a-beverly-hills-real-estate-company-including-its.html", "country": "US", "domain_rank": 767, "title": "Real Estate Acquisitions Company Enters Into Agreement to Purchase a Beverly Hills Real Estate Company including its Student Housing Asset.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:49:00.000+02:00", "replies_count": 0, "uuid": "2fb508801f0885b59123eba2cc6db0586b850ddc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-real-estate-acquisitions-company-enters-into-agreement-to-purchase-a-beverly-hills-real-estate-company-including-its.html", "ord_in_thread": 0, "title": "Real Estate Acquisitions Company Enters Into Agreement to Purchase a Beverly Hills Real Estate Company including its Student Housing Asset.", "locations": [], "entities": {"persons": [{"name": "hubilu", "sentiment": "none"}], "locations": [{"name": "beverly hills", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}, {"name": "beverly hills", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "beverly hills real estate company", "sentiment": "negative"}, {"name": "real estate acquisitions company enters into agreement to purchase", "sentiment": "negative"}, {"name": "hubilu venture corporation", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "usc", "sentiment": "none"}, {"name": "astro meria investments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEVERLY HILLS, CA, Jan. 11, 2018 (GLOBE NEWSWIRE) -- Hubilu Venture Corporation (the \"Company\") (OTC PINK: HBUV), a publicly traded real estate consulting, asset management and business acquisition company, which specializes in student housing income properties and development/business opportunities located near USC and the Metro stations within the Los Angeles area, announces that it has entered into an agreement to purchase a Beverly Hills real estate company including its real property asset. The company, Astro Meria Investments, LLC, includes a student housing property at 1444 W. 28 th Street, Los Angeles, which is located 2 blocks from the USC campus and a short walk from a Metro/subway station. This property fits perfectly into Hubilu’s target market, being both in walking distance to the USC campus and the Metro/subway transportation system. The acquisition is subject to Astro Meria Investments, LLC completing an audit of its financial statements and the parties expect the transaction to close in the 1 st quarter of 2018. Hubilu, earlier this year announced it is now accepting cryptocurrency as a form of rent payment. Cryptocurrencies being accepted are Bitcoin, Ethereum, Bitcoin Cash and Litecoin, and are processed on the Coinbase Blockchain.\nPicture for Astro Meria Press Release\nA photo accompanying this announcement is available at\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/fa9a2997-450d-4e60-baaa-e946780e8991\nCommenting on the Company's investment activity, David Behrend, Chief Executive Officer, stated, \" HBUV is starting 2018 on a strong note, adding to our student housing portfolio by acquiring a turn-key student housing property, which we believe will bring net asset value and additional positive cash flow to Hubilu. We feel confident that our investors will be pleased with our expansion efforts, as we continue to aggressively execute on our business plan.”\nAbout Hubilu Venture Corporation:\nBased in Beverly Hills, California, Hubilu Venture Corporation, a real estate consulting, asset management and acquisition corporation is executing on its business plan, which besides consulting to real estate companies, is seeking to acquire student housing real estate and business opportunities in the niche markets of the USC campus area and the expanding urban transportation Metro stations facilitated by the development of the Los Angeles Metro/subway system. Hubilu, inspired by Strategic Growth Through Smart Ventures, focuses on acquiring high path of growth real estate and business opportunities that it believes are recession proof and have limited downside risk, while offering upside potential in equity appreciation and cash flow.\nForward-Looking Statements:\nThis press release contains forward-looking statements within the meaning of Federal securities laws, concerning the future performance of our business, its operations and its financial performance and condition and potential selected offerings presented without the context of accompanying financial results. The comments of Mr. Behrend, statements regarding the potential acquisition of property and the characteristics of its wholly owned property are examples of forward-looking statements. A number of factors could cause Hubilu Venture Corporation's actual results, performance or achievement to differ materially from those anticipated. Among those risks, trends and uncertainties are the general economic climate; the supply of and demand for real properties; interest rate levels, the availability of financing; and other risks associated with the acquisition and ownership of properties, including risks that the tenants will not pay rent, or the costs may be greater than anticipated. This executed purchase contract is subject to various closing conditions, including but not limited to due diligence and satisfaction of audited results. These forward-looking statements include, among others, statements with respect to objectives and strategies to achieve those objectives, as well as statements with respect to our beliefs, plans, expectations, anticipations, estimates or intentions. These forward-looking statements are based on our current expectations. We are under no obligation to (and expressly disclaim any such obligation to) update or alter our forward-looking statements, whether as a result of new information, future events or otherwise. For further information on factors that could impact Hubilu Venture Corporation, reference is made to filings with the Securities and Exchange Commission.\nContact: Tracy Black 310.420.9599 tracy@hubilu.com www.hubilu.com TW: @hubiluventure IG: hubiluventure\nSource:Hubilu Venture Corporation", "external_links": ["http://www.globenewswire.com/NewsRoom/AttachmentNg/fa9a2997-450d-4e60-baaa-e946780e8991", "https://www.globenewswire.com/Tracker?data=v2cQb2XakdneD4DQTXTYNMVxdRRVjyLCt5nxKZO8dIO_NmFoI5G1Th2dpC30tPiVHUgD0rBqQsy7bvA3PWJxPY6HD0BZKgVhLogawjWvo1y-u2GxFRFztKScwzbx8vP1WuZu9YGhjH7cs3q02EX0ErUSqJ8D_Z4lzmo75Ymt_Ydrp2vlde20FU_qSiGokq7dlATwkiFly02X5JwJDAhjdRHCniF3WFn0MVRMth9Bj0Gm4TBB54Qa7LH81UnKB9TQtp2lGlRuxT1Et61mUBLEkQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/fa9a2997-450d-4e60-baaa-e946780e8991/en", "https://www.globenewswire.com/NewsRoom/AttachmentNg/bb3564aa-ca60-45ee-9272-e4b7fbb4f3f0"], "published": "2018-01-11T16:49:00.000+02:00", "crawled": "2018-01-11T18:51:16.038+02:00", "highlightTitle": ""}