{"organizations": [], "uuid": "02bd2e10a6f8b4fc5c15195e0ea4a302b6621149", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mali-security/gunman-kill-three-soldiers-in-north-mali-as-security-worsens-idUSKBN1FH0TB", "country": "US", "domain_rank": 408, "title": "Gunman kill three soldiers in north Mali as security worsens", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T19:13:00.000+02:00", "replies_count": 0, "uuid": "02bd2e10a6f8b4fc5c15195e0ea4a302b6621149"}, "author": "", "url": "https://www.reuters.com/article/us-mali-security/gunman-kill-three-soldiers-in-north-mali-as-security-worsens-idUSKBN1FH0TB", "ord_in_thread": 0, "title": "Gunman kill three soldiers in north Mali as security worsens", "locations": [], "entities": {"persons": [{"name": "adama diarra", "sentiment": "none"}, {"name": "tiemoko diallo", "sentiment": "none"}], "locations": [{"name": "mali", "sentiment": "none"}, {"name": "niger", "sentiment": "none"}, {"name": "menaka", "sentiment": "none"}, {"name": "west africa", "sentiment": "none"}, {"name": "sahel", "sentiment": "none"}], "organizations": [{"name": "min read  bamako", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 5:13 PM / Updated 10 minutes ago Gunman kill three soldiers in north Mali as security worsens Adama Diarra , Tiemoko Diallo 3 Min Read \nBAMAKO (Reuters) - Gunmen killed at least three Malian soldiers in an attack on a military post in the northeast on Sunday, security sources and a local official said, capping a week of violence that has stoked concerns about worsening security in the arid region. \nThe unknown assailants came before dawn and surrounded the post in the town of Menaka in Mali’s remote desert near the border with Niger, killing three soldiers, a security source said. A local official said five were killed after a gunfire exchange that lasted 40 minutes. \nAn official Malian spokesman was not available to comment. \nThe scrubland of West Africa’s Sahel region has been the scene of growing militant violence over the past year, some perpetrated by groups with links to Islamic State and al Qaeda who roam the vast desert stretches and cross international borders often without detection. \nThe deteriorating situation has drawn a growing international military response including from France and the United States aimed at restoring security in Mali and the wider Sahel that includes Niger, Burkina Faso, Mauritania and Chad. \nFrench forces pushed back a northern Islamist insurgency in Mali in 2013, but since then attacks have spread further south towards the capital, Bamako, despite the presence of a U.N. peacekeeping mission. \nOn Saturday, a group of around 30 heavily armed fighters attacked a military camp in Soumpi, located in the center of the country near the southern boundary of Mali’s Timbuktu region. \nOn Thursday, a landmine blew up a civilian passenger vehicle, again in the country’s center, killing 26. The vehicle was passing through an area where militants loyal to Islamic State are known to operate. \nMali and its western neighbor Senegal plan to deploy 1,000 troops soon in an operation to pacify central Mali, but regional experts have raised concerns that military intervention will not solve a crisis in an impoverished rural region whose troubles have complex, local roots. Writing by Edward McAllister; Editing by Raissa Kasolowsky", "external_links": [], "published": "2018-01-28T19:13:00.000+02:00", "crawled": "2018-01-28T19:36:48.004+02:00", "highlightTitle": ""}