{"organizations": [], "uuid": "000b5236ba392dd49055a2c28371076b414be6da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/18/reuters-america-update-1-u-s-crude-stocks-drop-led-by-record-outflow-from-cushing-hub--eia.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-U.S. crude stocks drop, led by record outflow from Cushing hub - EIA", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:51:00.000+02:00", "replies_count": 0, "uuid": "000b5236ba392dd49055a2c28371076b414be6da"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/reuters-america-update-1-u-s-crude-stocks-drop-led-by-record-outflow-from-cushing-hub--eia.html", "ord_in_thread": 0, "title": "UPDATE 1-U.S. crude stocks drop, led by record outflow from Cushing hub - EIA", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "cushing", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "memphis", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cushing", "sentiment": "negative"}, {"name": "u.s. strategic petroleum reserve", "sentiment": "none"}, {"name": "genscape", "sentiment": "none"}, {"name": "eia", "sentiment": "none"}, {"name": "energy information administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details, prices, comments)\nJan 18 (Reuters) - U.S. crude oil stocks fell for a ninth straight week, led by a record drawdown at the U.S. storage hub in Cushing, Oklahoma, the Energy Information Administration said on Thursday.\nCrude inventories fell 6.9 million barrels in the week to Jan. 12, compared with analysts' expectations for a decrease of 3.5 million barrels.\nOverall crude inventories have been steadily dwindling as demand remains strong and refineries run at a steady clip. Excluding the U.S. Strategic Petroleum Reserve, inventories are now sitting at 412.7 million barrels, the lowest level since February of 2015.\nCrude stocks at the Cushing, Oklahoma, delivery hub for U.S. crude futures fell 4.2 million barrels, the largest weekly draw for Cushing dating back to 2004 when records began, the EIA said.\nLast week, traders said market intelligence firm Genscape reported notable outflows from Cushing on the start-up of a new pipeline from that location to Memphis, Tennessee.\nOil prices rebounded from earlier losses, but gains were minimal. U.S. West Texas Intermediate futures were up 10 cents to $64.03 a barrel as of 11:22 a.m. EST (1622 GMT), while Brent was down 5 cents to $69.33 a barrel, paring losses from earlier in the session.\n\"The report was really only supportive in terms of the further drop in crude oil inventories, which continue to plunge. Refiners dialed back operations, and domestic production leapt higher by a lot to 9.75 million barrels per day. The 10 million-bpd mark is easily within reach,\" said John Kilduff, partner at energy hedge fund Again Capital LLC in New York.\nAfter falling the previous week due to cold weather, U.S. crude production rose 258,000 barrels per day to 9.75 million bpd last week.\nRefinery crude runs fell by 448,000 bpd, the EIA data showed. Refinery utilization rates fell 2.3 percentage points to 93 percent of total capacity, which is still seasonally high. East Coast refining activity dropped in the most recent week to 81.1 percent of overall capacity, lowest since April.\nGasoline stocks rose 3.6 million barrels, compared with expectations in a Reuters poll for a 3.4 million-barrel gain.\nDistillate stockpiles, which include diesel and heating oil, fell 3.9 million barrels, versus expectations for a 86,000-barrel increase, the EIA data showed.\nNet U.S. crude imports rose last week by 58,000 bpd. (Reporting By David Gaffen; additional reporting by Scott DiSavino; Editing by Marguerita Choy)", "external_links": [], "published": "2018-01-18T18:51:00.000+02:00", "crawled": "2018-01-19T09:12:36.005+02:00", "highlightTitle": ""}