{"organizations": [], "uuid": "2c6eb1f51c0fa7c2b8529759dfe4e12651e7ae30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219496558&w=1200&r=LYNXMPEE0405V", "site_section": "https://www.reuters.com/finance/currencies", "section_title": "Currency Converter, Currencies News | Reuters.com", "url": "https://www.reuters.com/article/uk-forex-poll-sterling/sterling-2018-outlook-steady-but-much-depends-on-brexit-reuters-poll-idUSKBN1EU0BL", "country": "US", "domain_rank": 408, "title": "Sterling 2018 outlook steady, but much depends on Brexit - Reuters poll", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T12:03:00.000+02:00", "replies_count": 0, "uuid": "2c6eb1f51c0fa7c2b8529759dfe4e12651e7ae30"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-forex-poll-sterling/sterling-2018-outlook-steady-but-much-depends-on-brexit-reuters-poll-idUSKBN1EU0BL", "ord_in_thread": 0, "title": "Sterling 2018 outlook steady, but much depends on Brexit - Reuters poll", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "brexit - reuters", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - The British pound is set to mostly hold steady against both a shaky dollar and the firming euro this year, but much will hinge on progress in Britain’s talks with Brussels on its withdrawal from the European Union.\nCurrency strategists polled by Reuters in the first week of 2018 weren’t brimming with optimism on how the next stage of talks will go, but most do not think the pound is set for another major fall, either.\nThe results suggest growing risks for the British currency following its largest annual rally since 2009. Sterling rallied 10 percent last year, in large part because the U.S. dollar marked its worst performance in 14 years.\nBut the pound is still down about 10 percent from the around $1.50, where it was trading before British voters rejected EU membership in a referendum. And it is down 30 percent from the more than $2 nearly a decade ago, before the crisis.\nIndeed, at $1.35, the pound is still below the lowest close it reached in the first quarter of 2009 as the Great Recession gripped Britain’s economy and most of the developed world.\n“To us, the UK currency remains fundamentally undervalued and markets are still pricing in a generous set of Brexit related risks,” noted analysts at Investec.\n“But in contrast with our prediction of a pound rally a year ago, we are more cautious.”\nMarket doubts over whether a trade deal can be done may hurt sterling, as would delaying any agreement until early 2019. Markets focussing on implications of a possible Labour government could also hold back the pound, they said.\nInvestec forecasts $1.40 on the pound by the end of the year, considerably higher than the $1.36 median forecast in the January Reuters Poll. Their 87p forecast for the pound against the euro is also a bit stronger than the median view for 89p.\nDealers and leveraged funds remained mostly long sterling in the final week of 2017, according to the latest Commodity Futures Trading Commission data, although asset managers and institutional players are mostly betting against it.\nIndeed, while median forecasts in the latest poll were slightly firmer for the end of the year, considerable disagreement remains among analysts based in the UK, Europe, the United States and Canada, on sterling’s prospects in 2018.\n“The pound is likely to weaken in the near-term as the costs of Brexit become more tangible, but could eventually surge if the UK reverses its decision to leave the EU,” wrote William Adams of Pittsburgh-based PNC Financial Services.\nA Reuters poll taken about a month ago saw that as the least likely of outcomes, but also put the chances of a disorderly Brexit at just 25 percent.\nSterling got an unexpected lift late last year from the Bank of England’s blunt messaging ahead of the 25-basis-point interest rate rise it delivered in November, which most analysts said at the time was a policy error.\nWhile median forecasts point to one more rate rise this year, it’s not likely to come until late 2018 [ECILT/GB].\nWith many now expecting UK inflation to start slipping following the sterling-induced boost last year, the currency is vulnerable to bad economic news and further obstacles in Britain’s rocky path towards leaving the EU.\nBut only a handful of forecasters expect a drop to $1.20, the lowest forecast in the latest Reuters poll across the horizon.\n“A fall to GBP/USD 1.20 would require, above all else, a stronger U.S. dollar rather than a weaker pound alone,” noted Kit Juckes of Societe Generale in their 2018 FX outlook.\n“We think the chances of a fall that far are about 5 percent, whereas, by contrast, the chances of GBP/USD reaching 1.50 are around 15 percent, reflecting the possibility of another election being called and speculation emerging in earnest, that the UK could see a second Brexit referendum. That is unlikely but not impossible and not definitely priced in by the FX market.”\nPolling by Indradip Ghosh and Shrutee Sarkar, editing by Larry King\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T12:03:00.000+02:00", "crawled": "2018-01-05T09:58:05.001+02:00", "highlightTitle": ""}