{"organizations": [], "uuid": "89d820d5e153366fa9688d42f75618f14bacebc4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-coda-octopus-group-reports-fiscal-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Coda Octopus Group Reports Fiscal 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:00:00.000+02:00", "replies_count": 0, "uuid": "89d820d5e153366fa9688d42f75618f14bacebc4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-coda-octopus-group-reports-fiscal-2017-financial-results.html", "ord_in_thread": 0, "title": "Coda Octopus Group Reports Fiscal 2017 Financial Results", "locations": [], "entities": {"persons": [{"name": "annmarie gayle", "sentiment": "none"}], "locations": [{"name": "orlando", "sentiment": "none"}, {"name": "fl", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "coda octopus group reports fiscal 2017 financial results", "sentiment": "negative"}, {"name": "coda octopus group, inc.", "sentiment": "neutral"}, {"name": "group", "sentiment": "none"}, {"name": "coda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ORLANDO, FL , January 30, 2018 – Coda Octopus Group, Inc. (CODA) (Nasdaq:CODA) today reported its audited financial results for its fiscal 2017 year, ended October 31, 2017.\nAnnmarie Gayle, CODA’s Chairman and CEO commented: “Our business plan called for fiscal 2017 to be a year of investment in our technological advancement. We invested heavily in R&D to position the Company for breakout growth in capturing a greater share of the multibillion-dollar markets for our products and services, and developing new markets across all our offerings in fiscal 2018-2019. Having completed our turnaround and established the past five years of consistent growth and profit, our fiscal 2017 results reflect this strategic investment in the future. Our products business performed very well but, regrettably due to the U.S. defense budgets not being adopted, our engineering businesses did not receive some of the key contracts that we had anticipated. Our engineers across both businesses have done a tremendous job, accomplishing new technical breakthroughs that position the Group well for our springboard stage of growth, one we are very excited about.”\nCODA reported total revenue of approximately $18.025 million for the Current Year, compared to $21.118 million for the Prior Year ended October 31, 2016, a reduction of 14.6%. The Company reported net income of approximately $3.339 million for the Current Year, compared to $4.930 million for the Prior Year, a reduction of 32.3%. Net Income as a percentage of revenues was 18.5%, versus 23.3% during the Prior Year. Operating expenses for the Current Year were $8.150 million compared to $7.114 million for the Prior Year, an increase of 14.6%, attributed to an increase in R&D of $367,256 and an increase in Selling, General and Administrative (SG&A) expenditures of $668,100 reflecting costs associated with becoming a reporting company and listing on NASDAQ.\nMs. Gayle continued: “We opened this year with the launch of the first product of our advanced, breakthrough fourth generation real-time 3D sonar, Echoscope 4G ® Surface. The entire 4G line will feature significantly reduced form factors without compromising our superior real-time 3D imaging capabilities utilized in subsea environments. Our goal is to standardize real-time 3D sonar technology for the markets in which we operate.\n“Our engineering businesses have likewise invested in R&D to innovate our Thermite ® line of rugged mission computers, which is a significant part of this segment’s growth plans. This product rollout, to be phased in during late Fiscal 2018, will deliver a new standard of field mobility to Thermite’s ® established customer base. While extended continuing resolutions of the U.S. government budget and appropriations processes hinder the Company’s ability to give guidance in this sector, we look forward to improved performance later this year as we continue to provide our customers customized rugged solutions for mission critical integrated systems in harsh and military environments,” added Ms. Gayle.\nThe Company’s full financial results including its Annual Report for Fiscal Year 2017 are available at www.nasdaq.com/symbol/coda/sec-filings .\nAbout Coda Octopus Group, Inc.\nThe Company, founded in 1994, manufactures and markets patented real-time 3D subsea sonar technology, Echoscope ® , which enables real-time 3D imaging and mapping in zero visibility conditions underwater, and is used globally in numerous applications including defense, marine construction, oil and gas subsea infrastructure installation and surveys, and port and harbor security. For further information, please visit http://www.codaoctopusgroup.com or contact us at: coda@codaoctopusgroup.com .\nForward Looking Statement\nThis press release contains concerning Coda Octopus Group, Inc. within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Those include, without limitation, statements regarding the Company's expectations for the growth of the Company's operations and revenue. Such statements are subject to certain risks and uncertainties, and actual circumstances, events or results may differ materially from those projected in such . Factors that could cause or contribute to differences include, but are not limited to, customer demand for our products and market prices; the outcome of our ongoing research and development efforts relating to our products including our patented real time 3D solutions; our ability to develop the sales force required to achieve our development and other examples of forward looking statement set forth in our Annual Report on Form 10-K for the year ended October 31, 2017, filed with the Securities and Exchange Commission on January 30, 2018. Coda Octopus Group, Inc. does not undertake, and specifically disclaims any obligation to update or revise such statements to reflect new circumstances or unanticipated events as they occur.\nContact:\nMDC Group\nInvestor Relations:\nDavid Castaneda\nArsen Mugurdumov\n414.351.9758\nMedia Relations:\nSusan Roush\n805.624.7624\nSource:Coda Octopus Group, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/10268e49-4961-4dcc-a0f0-9b7472f136ce", "https://www.globenewswire.com/Tracker?data=lwe_CcYTY6wUwytkNoyEX68kSqFtEaeCtQMk9cmb5JNagV_EnHfLsd7H_urDYgYW11SXJnMY_2GJvNPxfRCJgkiHFrsvNDVI8I0Go2lYNxCmpUrut_l4Rkw1iggS_fh6", "https://www.globenewswire.com/Tracker?data=bS5_6kRAKRi_8vPLP_uBy9R9rZCetHqZpYgHhnraHEc9pXOfPIVevPq_OyBaK9AWGpMbo9BFuAD2FjXwz0NwWw0f2qiP3U5iNoA4fhZqEEY=", "https://www.globenewswire.com/Tracker?data=Mj45szPBsFMeHmdmC0JMNEzgTbWFY53rDSl1XC1fN_BEBYcNYJVvmkJy2Gr3n_SCycq_deQqFwq7rMtVVHFN5IDHVh4V25WBV6OnUGYkKkFzxXddrxKkzi_8l-7nYywOGxNaQVxOYrUiB3-APPtwZw=="], "published": "2018-01-31T01:00:00.000+02:00", "crawled": "2018-01-31T02:15:08.007+02:00", "highlightTitle": ""}