{"organizations": [], "uuid": "77824030657740b59461f9f9bf1a60f752e5b144", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-901831650.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/spotify-podcasts-apple-competition/", "country": "US", "domain_rank": 1196, "title": "Spotify Is Starting Podcast Program Called Spotlight | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.924, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "77824030657740b59461f9f9bf1a60f752e5b144"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/18/spotify-podcasts-apple-competition/", "ord_in_thread": 0, "title": "Spotify Is Starting Podcast Program Called Spotlight | Fortune", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "spotify", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "apple inc", "sentiment": "none"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "spotify", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Spotify Inside Spotify's Plan to Lure Listeners Away From Apple In this photo illustration, the logo of the Swedish music streaming service Spotify is displayed on the screen of an iPhone on January 06, 2017 in Paris, France. Chesnot Getty Images By Bloomberg January 18, 2018 \nSpotify, the world’s largest paid music service, will begin offering news and political coverage to lure listeners away from radio and podcasts from rival Apple Inc. \nEight companies, including BuzzFeed and Refinery29, have agreed to produce programming for the new initiative, called Spotlight. One of the first shows will be a four- to seven-minute daily newscast featuring reporting from BuzzFeed journalists across the globe. Spotlight will only be available to customers in the U.S. at first. \nNews programming can help Spotify capture some of the $18 billion spent on radio advertising each year and boost profitability as it prepares to trade on the New York Stock Exchange. While the company almost singlehandedly reversed the record industry’s long decline, it has been unable to turn a profit due to the high cost of music rights. \nSegments on news, pop culture, sports and politics add a new dimension to Spotify, which was already diversifying beyond music with videos and podcasts for its more than 70 million users. Such programming can be more profitable, but it also puts Spotify more in competition with YouTube and Apple, two powerful rivals. \n“I know people are coming to Spotify to listen first, but we’re starting to build something new,’’ Courtney Holt, the company’s head of studios and video, said in an interview. “I want to create content that can be seen and listened to.’’ \nSome of the programs will be versions of podcasts already available on the service, like Crooked Media’s “Pod Save America,” and will initially contain the same ads, read by the hosts. Other programs won’t have ads during the initial testing phase. The way podcasts are presented will be enhanced to let listeners more easily skip between different stories and topics, Holt said. They’ll also include visuals. \nHolt joined Spotify last year after stints in music and digital media to figure out what the company should be doing beyond music. He scrapped several original video series, which were tough for users to locate on the service and struggled to gain an audience. \nIn their place, he conceived Spotlight, which mimics the the most successful videos on Spotify to date — music videos and behind-the-scenes footage presented within playlists RapCaviar and Viva Latino. Users can listen to those videos without watching, or watch for additional information. \nBuzzFeed’s show will be audio-first, but include infographics and other visual elements, according to Ben Smith, editor-in-chief. \n“Spotify has this real opportunity to compete with terrestrial radio,’’ Smith said. “These are news updates for people of the generation we serve, 18- to 35-year-olds.’’ SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-19T18:39:38.009+02:00", "highlightTitle": ""}