{"organizations": [], "uuid": "074bda3f44e6ab4c116af4b2592740fe3da5e3e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKhealth/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-suicide-bariatric-surgery/weight-loss-surgery-tied-to-slight-increased-risk-of-suicide-idUKKBN1FJ2T6", "country": "US", "domain_rank": 408, "title": "Weight-loss surgery tied to slight increased risk of suicide", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T22:16:00.000+02:00", "replies_count": 0, "uuid": "074bda3f44e6ab4c116af4b2592740fe3da5e3e8"}, "author": "", "url": "https://uk.reuters.com/article/us-health-suicide-bariatric-surgery/weight-loss-surgery-tied-to-slight-increased-risk-of-suicide-idUKKBN1FJ2T6", "ord_in_thread": 0, "title": "Weight-loss surgery tied to slight increased risk of suicide", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}], "locations": [], "organizations": [{"name": "the lancet diabetes & endocrinology", "sentiment": "none"}, {"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 8:20 PM / Updated 31 minutes ago Weight-loss surgery tied to slight increased risk of suicide Lisa Rapaport 5 Min Read \n(Reuters Health) - Obese people who get surgery to lose weight are slightly more likely to attempt suicide than their counterparts who try other approaches to shed excess pounds, a Swedish study suggests. \nThe findings reinforce a need for thorough pre-surgery mental health assessments of bariatric patients, as well as for providing them with information about the risk of self-harm associated with the procedure and long term follow-up, the study team writes in The Lancet Diabetes & Endocrinology. \nThe researchers examined data from two patient registries of obese individuals who either got bariatric surgery or tried other types of treatment or intensive lifestyle changes to lose weight. In one registry, surgical patients were roughly three times more likely to commit suicide or try to harm themselves than people who used other weight loss approaches, while the risk was 78 percent higher with surgery in the other registry. \nThe absolute risk of suicide was less than 1 percent for both surgical and non-surgical patients in both registries. And the risk of non-fatal self-harm was also low, ranging from less than 1 percent to almost 4 percent. \n“We believe that the benefits of bariatric surgery, including lower mortality, outweigh our finding of an increased risk of suicide and self-harm,” lead study author Martin Neovius, a researcher at the Karolinska Institute in Stockholm said by email. \nGlobally, 1.9 billion adults are overweight or obese, according to the World Health Organization. Obesity increases the risk of heart disease, diabetes, joint disorders and certain cancers. \nPrevious research has found obese people often struggle to shed excess pounds or keep weight off when they do lose it. Lifestyle changes such as following a healthy diet and getting regular exercise can often help in the short-term but fail to produce lasting results, particularly among people who have more than 100 pounds to lose before reaching a healthy weight. \nIn the current study, one registry included 2,101 obese patients who underwent bariatric surgery and a control group of 2,037 obese people who received only usual care, such as education on healthy eating and exercise habits. \nIn this registry, half of the patients were followed for at least 18 years. During follow-up, 87 people who had surgery died by suicide or tried to harm themselves, compared with 49 individuals who didn’t get bariatric procedures. \nA second registry in the study included 20,256 obese patients who had bariatric surgery and a control group of 16,162 people who were treated with intensive lifestyle modifications. \nThe second registry followed half of the patients for almost four years or more. During follow-up, 341 people who had surgery and 84 people who didn’t died by suicide or tried to harm themselves. \nPatients were more likely to kill or harm themselves if they misused drugs or alcohol, researchers found. But in the first registry, surgery patients were also more likely to have a history of self-harm than people who didn’t receive surgery. \nThe study wasn’t a controlled experiment designed to prove whether or how bariatric surgery might directly impact the odds that patients attempt suicide or try to harm themselves. \nAnother limitation of the study is that none of the patients in the registries had a newer and increasingly more common type of bariatric surgery known as a sleeve gastrectomy, which is less invasive, the authors note. This makes it possible that the results might not reflect what would happen with people getting surgery today. \nEven so, the findings suggest that patients should be followed for several years after surgery to monitor for any potential mental health issues, said Matthew Spittal, co-author of an accompanying editorial and a researcher at the University of Melbourne in Australia. \nWhile the study didn’t explore why surgery might lead to an increased risk of suicide, it’s possible that some people might have dissatisfaction with their amount of weight loss or the appearance of loose flaps of skin that accompany dramatic weight loss, Spittal said by email. \nIt’s also possible that the surgical weight loss might lead to changes in the way the body absorbs nutrients and medications that might in turn make people more likely to contemplate suicide or self-harm, Spittal added. \nBut the benefits of surgery still outweigh this risk. \n“The take-home message from this research is that bariatric surgery remains the most effective way of treating severe obesity,” Spittal said. \nSOURCE: bit.ly/2Er2jWw and bit.ly/2nk7OPJ The Lancet Diabetes & Endocrinology, online January 9, 2018.", "external_links": [], "published": "2018-01-30T22:16:00.000+02:00", "crawled": "2018-01-30T22:51:52.005+02:00", "highlightTitle": ""}