{"organizations": [], "uuid": "79c88929677da5aa97f2e876eb1f227e966d5ad5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-discover-increases-acceptance-in-hong-kong.html", "country": "US", "domain_rank": 767, "title": "Discover Increases Acceptance in Hong Kong", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-18T18:00:00.000+02:00", "replies_count": 0, "uuid": "79c88929677da5aa97f2e876eb1f227e966d5ad5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-discover-increases-acceptance-in-hong-kong.html", "ord_in_thread": 0, "title": "Discover Increases Acceptance in Hong Kong", "locations": [], "entities": {"persons": [{"name": "amy parsons", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "riverwoods", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}, {"name": "hong kong first data", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "jcb", "sentiment": "negative"}, {"name": "first data", "sentiment": "none"}, {"name": "jcb international", "sentiment": "none"}, {"name": "discover financial services", "sentiment": "none"}, {"name": "jcb co., ltd.", "sentiment": "none"}, {"name": "diners club", "sentiment": "none"}, {"name": "global network", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "First Data and JCB Help Discover Grow Acceptance at Key Merchants\nRIVERWOODS, Ill. & TOKYO--(BUSINESS WIRE)-- Discover Global Network, the payments brand of Discover Financial Services, will expand card acceptance at key merchants in Hong Kong by working with First Data and JCB International, the international operations subsidiary of JCB Co., Ltd. (referred to below as “JCB”).\nTo expand into Hong Kong, Discover Global Network was able to leverage the existing acquiring partnership between JCB and First Data to accept all cards that run on Discover Global Network including Discover, Diners Club and affiliate network cards through Discover’s current net-to-net relationship with JCB.\n“This is a great example of partners working together to bring value to both customers and merchants,” said Amy Parsons, senior vice president of global acceptance at Discover. “Our strong existing relationships with First Data and JCB allow us to grow faster and reach merchants that are important to our customers.”\nFirst Data has a robust roll-out plan and will enable acceptance for Discover and Diners Club cards including key international restaurant chains, Airport duty free stores and national department stores to benefit cardholders visiting Hong Kong.\n“This unique relationship with Discover and JCB leverages First Data’s global footprint, scale, and innovative solutions to provide key merchants in Hong Kong with the ability to accept Discover and Diners Club Cards,” states Ivo Distelbrink, EVP, Head of Asia Pacific region for First Data. “At First Data, we are committed to enabling commerce for businesses around the world so they can, in turn, offer flexible payment options to their customers. We are delighted to collaborate with Discover and JCB to further this effort.”\nDiscover currently works with First Data as its acquiring partner in both the United States and Europe to grow acceptance of all cards that run on Discover Global Network.\nDiscover and JCB have worked together since 2006 and continue to increase acceptance of JCB cards on the Discover Network in the U.S., and of Discover cards on the JCB network in Japan. This is the third joint acquirer agreement between JCB and Discover following Kazakhstan and Republic of South Africa, leveraging Discover’s current net-to-net relationship with JCB with First Data.\n“JCB and Discover’s alliance has now stepped into a new stage opening up a new territory in Asia Region other than our mother market, Japan,” said Kimihisa Imada, President & COO of JCB International. “Thanks to First Data for their outstanding cooperation. This project allowed us to widen our technical collaboration with First Data and further business possibilities.”\nDiscover Global Network has over 42 million merchant acceptance locations and 1.9 million ATM and cash access locations across 185 countries and territories, Discover Global Network includes Discover, Diners Club International, PULSE and affiliated networks.\nAbout Discover Global Network\nDiscover Global Network, the global payments brand of Discover Financial Services, processes millions of cardholder transactions each day. With industry expertise, innovative technology and a closed-loop infrastructure, Discover Global Network provides effective, customized solutions that evolve as needs change. Discover Global Network has alliances with more than 10 payments networks around the world, and is led by three Discover businesses: Discover network, with millions of retail and cash access locations; PULSE, one of the nation’s leading ATM/debit networks; and Diners Club International, a global payments network with acceptance in more than 185 countries and territories. For more information visit www.discovernetwork.com\nAbout First Data\nFirst Data (NYSE: FDC) is a global leader in commerce-enabling technology and solutions, serving approximately six million business locations and 4,000 financial institutions in more than 100 countries around the world. The company’s 24,000 owner-associates are dedicated to helping companies, from start-ups to the world’s largest corporations, conduct commerce every day by securing and processing more than 2,800 transactions per second and $2.2 trillion per year.\nAbout JCB\nJCB is a major global payment brand and a leading payment card issuer and acquirer in Japan. JCB launched its card business in Japan in 1961 and began expanding worldwide in 1981. As part of its international growth strategy, JCB has formed alliances with hundreds of leading banks and financial institutions globally to increase merchant coverage and card member base. As a comprehensive payment solution provider, JCB commits to provide responsive and high-quality service and products to all customers worldwide. For more information, please visit: www.global.jcb/en/\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005232/en/\nDiscover\nSarah Grage Silberman\nTel: +1-224-405-6029\nEmail: sarahgragesilberman@discover.com\n@Discover_News\nor\nFirst Data\nLiidia Liuksila\nTel: +1 -212- 515-0174\nEmail: Liidia.Liuksila@FirstData.com\nor\nJCB\nKumiko Kida\nCorporate Communications\nTel: +81-3-5778-8353\nEmail: jcb-pr@info.jcb.co.jp\nSource: Discover Financial Services", "external_links": ["http://www.businesswire.com/news/home/20180118005232/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.global.jcb%2Fen%2F&esheet=51744977&newsitemid=20180118005232&lan=en-US&anchor=www.global.jcb%2Fen%2F&index=2&md5=dafd63f1fd16dc4c8bb4537f0936deb1", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.discovernetwork.com&esheet=51744977&newsitemid=20180118005232&lan=en-US&anchor=www.discovernetwork.com&index=1&md5=dc577d81453d82808438ccfb4ce5a0d3"], "published": "2018-01-18T18:00:00.000+02:00", "crawled": "2018-01-18T20:10:35.015+02:00", "highlightTitle": ""}