{"organizations": [], "uuid": "2fb16ac798d769edd0d3725119b41f5e93e33317", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-middlefield-banc-corp-reports-2017-full-year-and-fourth-quarter-financial-results.html", "country": "US", "domain_rank": 767, "title": "Middlefield Banc Corp. Reports 2017 Full Year and Fourth Quarter Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:05:00.000+02:00", "replies_count": 0, "uuid": "2fb16ac798d769edd0d3725119b41f5e93e33317"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-middlefield-banc-corp-reports-2017-full-year-and-fourth-quarter-financial-results.html", "ord_in_thread": 0, "title": "Middlefield Banc Corp. Reports 2017 Full Year and Fourth Quarter Financial Results", "locations": [], "entities": {"persons": [{"name": "thomas g. caldwell", "sentiment": "none"}], "locations": [{"name": "middlefield", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "middlefield banc corp.", "sentiment": "negative"}, {"name": "middlefield banc corp", "sentiment": "negative"}, {"name": "liberty bank n.a.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MIDDLEFIELD, Ohio--(BUSINESS WIRE)-- Middlefield Banc Corp. (NASDAQ: MBCN) today reported financial results for the three and twelve months ended December 31, 2017.\n2017 Financial Highlights (on a year-over-year basis unless noted):\nNet income increased 47.4% to $9.5 million Earnings per diluted share increased 2.3% to $3.10 per share, which includes a 43.7% increase in the average number of diluted shares outstanding Return on average tangible common equity was 10.15%, compared to 10.01% Total loans increased 51.6% to $923.2 million Nonperforming assets to total assets declined to 1.23% from 1.65% Net interest income improved 44.7% to $37.3 million Equity to assets was 10.83%, compared to 9.77%\n“We continued to enhance our operating and financial platform during 2017, which will be the base of our long-term success going forward,” stated Thomas G. Caldwell, President and Chief Executive Officer. During the year, we successfully integrated the Liberty Bank N.A. merger, and significantly grew our loan portfolio, which included a $44.7 million increase during the past three months. We ended the year with record total assets and net income, despite one-time merger related expenses, and the write down in our deferred tax asset.”\n“Middlefield’s community-oriented banking values and customer-centric approach is helping us differentiate the Bank within our Northeast and Central Ohio markets. To this end, I am pleased with the growth we are achieving in Central Ohio. In 12 months and ahead of schedule, Middlefield’s Sunbury location that was opened during the 2016 fourth quarter has become profitable. We expect Middlefield’s brand will continue to grow throughout Central Ohio, and we anticipate opening our fourth Central Ohio location in Powell during 2018.”\nMr. Caldwell concluded, “Our core Northeast Ohio and growing Central Ohio markets, both offer significant expansion opportunities and we believe we are well positioned to increase Middlefield’s market share throughout our footprint. Within the organization, we remain committed to providing our communities with a customer-centric, community-oriented banking approach. As we look to the new year, we are optimistic 2018 will be another good year for the Bank.”\nNet income for the twelve months ended December 31, 2017, was $9.5 million, or $3.10 per diluted share, compared to net income for the twelve months ended December 31, 2016, of $6.4 million, or $3.03 per diluted share. Net income for the 2017 fourth quarter was $2.4 million, or $0.73 per diluted share, compared to net income for the 2016 fourth quarter of $1.7 million, or $0.73 per diluted share.\nAnnualized returns on average equity (“ROE”) and average assets (“ROA”) were 8.52% and 0.88%, respectively, for the 2017 twelve-month period, compared with 9.33% and 0.85% for the same period last year. ROE and ROA for the 2017 fourth quarter were 7.72% and 0.86%, respectively, compared with 9.02% and 0.85% for the 2016 fourth quarter.\nReturn on average tangible common equity (1) was 10.15% for the 2017 twelve-month period, compared with 10.01%. Return on average tangible common equity (1) for the 2017 fourth quarter was 9.05%, compared to 9.69% for the 2016 fourth quarter.\nAs a result of the Tax Cut and Jobs Act that was signed into law on December 22, 2017, during the 2017 fourth quarter, the Company had a write down to its deferred tax asset of $547 thousand. This one-time, non-cash item impacted 2017 fourth quarter and twelve-month earnings by $0.18 per diluted share. In addition, during the 2017 fourth quarter and twelve-month period, the Company incurred one-time merger related costs associated with the Liberty merger of $28 thousand, and $1.1 million, respectively.\nIncome Statement\nNet interest income for the 2017 twelve-month period increased 44.7% to $37.3 million, compared to $25.8 million for the same period last year. The net interest margin for the 2017 twelve-month period was 3.82%, compared to 3.79% for the same period last year. Net interest income for the 2017 fourth quarter was $9.8 million, compared to $6.7 million for the 2016 fourth quarter. The net interest margin for the 2017 fourth quarter was 3.84%, compared to 3.84% for the same period of 2016. The 45.3% increase in net interest income for the 2017 fourth quarter was largely a result of a 56.2% increase in interest and fees on loans.\nFor the 2017 full year, noninterest income increased 22.7% to $4.9 million, compared to $4.0 million for the same period last year. Noninterest income for the 2017 fourth quarter was up 2.0% to $918 thousand, compared to the fourth quarter of 2016.\nNoninterest expense for the 2017 full year increased 31.7% to $27.5 million, compared to $20.9 million last year. For the 2017 fourth quarter, noninterest expense increased 25.4% to $6.2 million, compared to $5.0 million for the same period last year.\n“Asset quality remains strong despite the significant increase in assets we have experienced as a result of year-over-year organic loan growth and the contribution of Liberty’s loan portfolio. At December 31, 2017, nonperforming assets to total assets declined to 1.23%, from 1.65% for the same period last year,” said Donald L. Stacy, Chief Financial Officer. “Economic activity within our local economies remains stable, while conservative underwriting practices, and proactive risk management continues to help improve loan quality. During 2017, Middlefield incurred $1.1 million of nonrecurring merger related expenses. As we enter 2018, we do not anticipate any additional costs associated with the Liberty merger. As a result, given our current cost structure and outlook, we believe profitability should improve throughout 2018.”\nBalance Sheet\nTotal assets at December 31, 2017, increased 40.4% to $1.11 billion, from $787.8 million at December 31, 2016. Net loans at December 31, 2017, were $916.0 million, compared to $602.5 million at December 31, 2016. The 52.0% year-over-year increase in total net loans was across all loan categories, and was a result of organic growth and the contribution of the Liberty merger. Specifically, commercial mortgage loans increased 75.5%, residential mortgage loans increased 17.5%, commercial and industrial loans increased 67.2%, real estate construction loans increased 98.3%, and consumer installment loans increased 318.3%.\nTotal deposits at December 31, 2017, increased 39.4% to $878.2 million from $629.9 million at December 31, 2016. The company continued to proactively manage its cost of funds. The investment portfolio, which is entirely classified as available for sale, was $95.3 million at December 31, 2017, compared with $114.4 million at December 31, 2016.\nStockholders’ Equity, Dividends and Shares Outstanding\nAt December 31, 2017, stockholders’ equity was $119.9 million, an increase of 55.7% from $77.0 million at December 31, 2016. Tangible stockholders’ equity (1) at December 31, 2017 was $102.0 million, an increase of 41.0% from $72.4 million at December 31, 2016. On a per share basis, tangible stockholders’ equity was $31.71 at December 31, 2017, compared to $32.10 at December 31, 2016. The 1.2% decline in tangible book value per share reflects the increase in the number of shares outstanding as a result of the private placement of stock that closed in May 2017. For 2017, the company paid cash dividends of $1.08 per share. The dividend payout ratio for 2017 was 35.52%, compared to 36.18% last year.\nAt December 31, 2017, the company had an equity to assets leverage ratio of 10.83%, compared to 9.77% at December 31, 2016.\nAsset Quality\nThe provision for loan losses was $430 thousand for the 2017 fourth quarter, compared to $255 thousand for the 2016 fourth quarter. Nonperforming assets at December 31, 2017, were $13.6 million, compared to $13.0 million at December 31, 2016. Net charge-offs for the 2017 fourth quarter were $92 thousand, or 0.04% of average loans, annualized, compared to a net recovery of $9 thousand, or (0.01)% of average loans, annualized for the same 2016 period. For 2017, net charge-offs were $453 thousand, or 0.05% of average loans compared to $357 thousand, or 0.06% of average loans for 2016. The allowance for loan losses at December 31, 2017, stood at $7.2 million, or 0.78% of total loans, compared to $6.6 million, or 1.08% of total loans at December 31, 2016.\nMiddlefield Banc Corp., headquartered in Middlefield, Ohio, is a bank holding company with total assets of $1.11 billion at December 31, 2017. The bank operates 14 full-service banking centers and an LPL Financial® brokerage office serving Beachwood, Chardon, Cortland, Dublin, Garrettsville, Mantua, Middlefield, Newbury, Orwell, Solon, Sunbury, Twinsburg, and Westerville. The Bank also operates a Loan Production Office in Mentor, Ohio. Additional information is available at www.middlefieldbank.bank .\n(1) This press release includes disclosure of Middlefield Banc Corp.’s tangible book value per share and return on average tangible equity, which are financial measures not prepared in accordance with generally accepted accounting principles in the United States (GAAP). A non-GAAP financial measure is a numerical measure of historical or future financial performance, financial position or cash flows that excludes or includes amounts that are required to be disclosed by GAAP. Middlefield Banc Corp. believes that these non-GAAP financial measures provide both management and investors a more complete understanding of the underlying operational results and trends and Middlefield Banc Corp.’s marketplace performance. The presentation of this additional information is not meant to be considered in isolation or as a substitute for the numbers prepared in accordance with GAAP. The reconciliations of non-GAAP financial measures are included in the tables following Consolidated Financial Highlights below.\nThis press release of Middlefield Banc Corp. and the reports Middlefield Banc Corp. files with the Securities and Exchange Commission often contain “forward-looking statements” relating to present or future trends or factors affecting the banking industry and, specifically, the financial operations, markets and products of Middlefield Banc Corp. These forward-looking statements involve certain risks and uncertainties. There are a number of important factors that could cause Middlefield Banc Corp.’s future results to differ materially from historical performance or projected performance. These factors include, but are not limited to: (1) a significant increase in competitive pressures among financial institutions; (2) changes in the interest rate environment that may reduce interest margins; (3) changes in prepayment speeds, charge-offs and loan loss provisions; (4) less favorable than expected general economic conditions; (5) legislative or regulatory changes that may adversely affect businesses in which Middlefield Banc Corp. is engaged; (6) technological issues which may adversely affect Middlefield Banc Corp.’s financial operations or customers; (7) changes in the securities markets; or (8) risk factors mentioned in the reports and registration statements Middlefield Banc Corp. files with the Securities and Exchange Commission. Middlefield Banc Corp. undertakes no obligation to release revisions to these forward-looking statements or to reflect events or circumstances after the date of this press release.\nMIDDLEFIELD BANC CORP. Consolidated Selected Financial Highlights (Dollar amounts in thousands) (2017 unaudited) December 31, September 30, June 30, March 31, December 31, Balance Sheets (period end) 2017 2017 2017 2017 2016 ASSETS Cash and due from banks $ 39,886 $ 47,731 $ 37,971 $ 61,364 $ 31,395 Federal funds sold - 1,200 1,600 1,000 1,100 Cash and cash equivalents 39,886 48,931 39,571 62,364 32,495 Investment securities available for sale, at fair value 95,283 98,334 104,951 110,452 114,376 Loans held for sale 463 5,930 9,791 9,462 634 Loans 923,213 878,541 867,864 837,158 609,140 Less allowance for loan and lease losses 7,190 6,852 6,605 6,720 6,598 Net loans 916,023 871,689 861,259 830,438 602,542 Premises and equipment, net 11,853 11,768 11,511 11,481 11,203 Goodwill 15,071 15,299 15,435 15,646 4,559 Core deposit intangibles 2,749 2,848 2,948 3,051 36 Bank-owned life insurance 15,652 15,542 15,432 15,334 13,540 Other real estate owned 212 557 650 1,634 934 Accrued interest and other assets 9,144 9,928 9,528 9,605 7,502 TOTAL ASSETS $ 1,106,336 $ 1,080,826 $ 1,071,076 $ 1,069,467 $ 787,821 December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 LIABILITIES Deposits: Noninterest-bearing demand $ 192,438 $ 181,550 $ 172,199 $ 162,614 $ 133,630 Interest-bearing demand 83,990 91,184 87,084 94,605 59,560 Money market 150,277 161,101 160,858 162,843 74,940 Savings 208,502 212,371 181,259 183,845 172,370 Time 242,987 251,449 245,383 243,944 189,434 Total deposits 878,194 897,655 846,783 847,851 629,934 Short-term borrowings 74,707 20,274 63,388 76,213 68,359 Other borrowings 29,065 39,273 39,346 39,388 9,437 Accrued interest and other liabilities 4,507 5,130 4,357 6,700 3,131 TOTAL LIABILITIES 986,473 962,332 953,874 970,152 710,861 STOCKHOLDERS' EQUITY Common equity 84,859 84,722 84,587 69,123 47,943 Retained earnings 47,431 45,913 44,318 42,678 41,334 Accumulated other comprehensive income 1,091 1,377 1,815 1,032 1,201 Treasury stock (13,518 ) (13,518 ) (13,518 ) (13,518 ) (13,518 ) TOTAL STOCKHOLDERS' EQUITY 119,863 118,494 117,202 99,315 76,960 TOTAL LIABILITIES AND STOCKHOLDERS' EQUITY $ 1,106,336 $ 1,080,826 $ 1,071,076 $ 1,069,467 $ 787,821 MIDDLEFIELD BANC CORP. Consolidated Selected Financial Highlights (Dollar amounts in thousands) (2017 unaudited) For the Three Months Ended For the Twelve Months Ended December 31, September 30, June 30, March 31, December 31, December 31, December 31, Statements of Income 2017 2017 2017 2017 2016 2017 2016 INTEREST AND DIVIDEND INCOME Interest and fees on loans $ 10,696 $ 10,443 $ 9,916 $ 9,180 $ 6,849 $ 40,235 $ 25,798 Interest-bearing deposits in other institutions 80 107 92 49 11 328 53 Federal funds sold 6 5 1 3 4 15 20 Investment securities: Taxable interest 162 159 223 218 241 762 1,106 Tax-exempt interest 560 579 630 637 686 2,406 2,913 Dividends on stock 60 37 40 112 30 249 104 Total interest and dividend income 11,564 11,330 10,902 10,199 7,821 43,995 29,994 INTEREST EXPENSE Deposits 1,530 1,468 1,227 1,125 953 5,350 3,618 Short-term borrowings 101 202 273 177 34 753 322 Other borrowings 131 148 125 140 86 544 250 Total interest expense 1,762 1,818 1,625 1,442 1,073 6,647 4,190 NET INTEREST INCOME 9,802 9,512 9,277 8,757 6,748 37,348 25,804 Provision for loan losses 430 280 170 165 255 1,045 570 NET INTEREST INCOME AFTER PROVISION FOR LOAN LOSSES\n9,372 9,232 9,107 8,592 6,493 36,303 25,234 NONINTEREST INCOME Service charges on deposit accounts 478 479 449 469 497 1,875 1,940 Investment securities gains, net - 398 - 488 - 886 303 Earnings on bank-owned life insurance 115 109 98 109 106 431 403 Gains on sale of loans 106 255 231 234 97 826 419 Other income 219 200 211 211 200 841 894 Total noninterest income 918 1,441 989 1,511 900 4,859 3,959 NONINTEREST EXPENSE Salaries and employee benefits 3,134 3,725 3,203 3,696 2,509 13,758 10,249 Occupancy expense 449 476 433 488 319 1,846 1,252 Equipment expense 261 242 266 281 291 1,050 991 Data processing costs 416 468 588 320 407 1,792 1,335 Ohio state franchise tax 186 186 186 186 184 744 632 Federal deposit insurance expense 165 165 135 68 42 533 438 Professional fees 522 434 423 373 384 1,752 1,441 Net (gain) loss on other real estate owned (58 ) 18 15 55 (366 ) 30 (119 ) Advertising expenses 161 248 164 248 130 821 734 Core deposit intangible amortization 98 101 103 72 10 374 40 Merger expense 28 338 307 387 - 1,060 - Other expense 855 896 881 1,093 1,047 3,725 3,879 Total noninterest expense 6,217 7,297 6,704 7,267 4,957 27,485 20,872 Income before income taxes 4,073 3,376 3,392 2,836 2,436 13,677 8,321 Income taxes 1,687 914 885 736 776 4,222 1,905 NET INCOME $ 2,386 $ 2,462 $ 2,507 $ 2,100 $ 1,660 $ 9,455 $ 6,416 MIDDLEFIELD BANC CORP. Consolidated Selected Financial Highlights (Dollar amounts in thousands, except per share amounts) For the Three Months Ended For the Twelve Months Ended December 31, September 30, June 30, March 31, December 31, December 31, December 31, 2017 2017 2017 2017 2016 2017 2016 Per common share data Net income per common share - basic $ 0.73 $ 0.77 $ 0.84 $ 0.78 $ 0.74 $ 3.12 $ 3.04 Net income per common share - diluted $ 0.73 $ 0.76 $ 0.83 $ 0.78 $ 0.73 $ 3.10 $ 3.03 Dividends declared per share $ 0.27 $ 0.27 $ 0.27 $ 0.27 $ 0.27 $ 1.08 $ 1.08 Book value per share (period end) $ 37.25 $ 36.86 $ 36.49 $ 35.42 $ 34.14 $ 37.25 $ 34.14 Tangible book value per share (period end) (2) (3) $ 31.71 $ 31.21 $ 30.77 $ 28.76 $ 32.10 $ 31.71 $ 32.10 Dividend payout ratio 36.38% 35.22% 34.58% 36.00% 36.63% 35.52% 36.18% Dividends declared $ 868 $ 867 $ 867 $ 756 $ 608 $ 3,358 $ 2,318 Dividend yield 2.24% 2.34% 2.14% 2.39% 2.79% 2.24% 2.79% Average shares outstanding - basic 3,215,300 3,212,335 3,000,451 2,679,816 2,251,412 3,028,950 2,107,857 Average shares outstanding - diluted 3,231,791 3,223,753 3,014,140 2,692,015 2,264,712 3,045,779 2,119,214 Period ending shares outstanding 3,217,716 3,214,737 3,211,748 2,803,557 2,254,253 3,217,716 2,254,253 Selected ratios Return on average assets 0.86% 0.90% 0.94% 0.84% 0.85% 0.88% 0.85% Return on average equity 7.72% 8.12% 9.34% 8.73% 9.02% 8.52% 9.33% Return on average tangible common equity (2) (4) 9.05% 9.57% 11.30% 10.49% 9.69% 10.15% 10.01% Yield on earning assets 4.51% 4.52% 4.45% 4.45% 4.43% 4.48% 4.37% Cost of interest bearing liabilities 0.89% 0.92% 0.83% 0.78% 0.77% 0.86% 0.75% Net interest spread 3.62% 3.60% 3.62% 3.67% 3.66% 3.63% 3.61% Net interest margin 3.84% 3.81% 3.80% 3.84% 3.84% 3.82% 3.79% Efficiency (1) 55.58% 63.96% 63.30% 68.58% 62.54% 62.40% 66.63% Equity to assets at period end 10.83% 10.96% 10.94% 9.29% 9.77% 10.83% 9.77% (1)\nThe efficiency ratio is calculated by dividing non-interest expense less amortization of intangibles by the sum of net interest income on a fully taxable equivalent basis plus non-interest income.\n(2)\nSee reconciliation of non-GAAP measures below\n(3)\nCalculated by dividing tangible common equity by shares outstanding\n(4)\nCalculated by dividing annualized net income for each period by average tangible common equity\nFor the Three Months Ended December 31, September 30, June 30, March 31, December 31, End of Period Loan Balances 2017 2017 2017 2017 2016 Commercial and industrial $ 101,346 $ 99,314 $ 97,160 $ 91,777 $ 60,630 Real estate - construction 47,017 40,760 35,571 29,238 23,709 Real estate - mortgage: Residential 318,157 316,191 308,519 300,508 270,830 Commercial 437,947 403,135 406,670 395,102 249,490 Consumer installment 18,746 19,141 19,944 20,533 4,481 Total $ 923,213 $ 878,541 $ 867,864 $ 837,158 $ 609,140 December 31, September 30, June 30, March 31, December 31, Asset quality data 2017 2017 2017 2017 2016 (Dollar amounts in thousands) Nonaccrual loans $ 8,433 $ 8,525 $ 10,213 $ 6,545 $ 5,892 Troubled debt restructuring 4,982 5,608 5,990 5,515 6,151 90 day past due and accruing - 268 199 35 - Nonperforming loans 13,415 14,401 16,402 12,095 12,043 Other real estate owned 212 557 650 1,634 934 Nonperforming assets $ 13,627 $ 14,958 $ 17,052 $ 13,729 $ 12,977 Allowance for loan losses $ 7,190 $ 6,852 $ 6,605 $ 6,720 $ 6,598 Allowance for loan losses/total loans 0.78% 0.78% 0.76% 0.80% 1.08% Net charge-offs (recoveries): Quarter-to-date $ 92 $ 33 $ 285 $ 43 $ (9) Year-to-date $\n453 $\n361 $\n328 $\n43 $\n357 Net charge-offs to average loans, annualized Quarter-to-date 0.04% 0.02% 0.13% 0.02% -0.01% Year-to-date 0.05% 0.06% 0.08% 0.02% 0.06% Nonperforming loans/total loans 1.45% 1.64% 1.89% 1.44% 1.98% Allowance for loan losses/nonperforming loans 53.60% 47.58% 40.27% 55.56% 54.79% Nonperforming assets/total assets 1.23% 1.38% 1.59% 1.28% 1.65% Reconciliation of Common Stockholders' Equity to Tangible Common Equity For the Three Months Ended For the Twelve Months Ended December 31, September 30, June 30, March 31, December 31, December 31, December 31, 2017 2017 2017 2017 2016 2017 2016 Stockholders' Equity $ 119,863 $ 118,494 $ 117,202 $ 99,315 $ 76,960 $ 119,863 $ 76,960 Less Goodwill and other intangibles 17,820 18,147 18,383 18,697 4,595 17,820 4,595 Tangible Common Equity $ 102,043 $ 100,347 $ 98,819 $ 80,618 $ 72,365 $ 102,043 $ 72,365 Average Stockholders' Equity $\n122,586 $\n120,310 $\n107,615 $\n97,585 $\n72,979 $\n110,966 $\n68,741 Less Average Goodwill and other intangibles 17,987 18,251 18,633 16,402 5,004 17,818 4,615 Average Tangible Common Equity $ 104,599 $ 102,059 $ 88,982 $ 81,183 $ 67,975 $ 93,148 $\n64,126\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006152/en/\nCompany Contact:\nMiddlefield Banc Corp.\nThomas G. Caldwell, 440-632-1666 Ext. 3200\nPresident/Chief Executive Officer\ntcaldwell@middlefieldbank.com\nor\nInvestor and Media Contact:\nSM Berger & Company, Inc.\nAndrew M. Berger, 216-464-6400\nManaging Director\nandrew@smberger.com\nSource: Middlefield Banc Corp.", "external_links": ["http://www.businesswire.com/news/home/20180123006152/en/"], "published": "2018-01-24T00:05:00.000+02:00", "crawled": "2018-01-24T00:56:38.000+02:00", "highlightTitle": ""}