{"organizations": [], "uuid": "6021ff7971109fb10055403263fd048fdbf436cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "", "section_title": "", "url": "https://www.reuters.com/article/us-global-oil/oil-trades-near-strongest-levels-since-mid-2015-on-iranian-unrest-idUSKBN1ER024", "country": "US", "domain_rank": 408, "title": "Oil trades near strongest levels since mid-2015 on Iranian unrest", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.144, "site_type": "news", "published": "2018-01-02T18:22:00.000+02:00", "replies_count": 0, "uuid": "6021ff7971109fb10055403263fd048fdbf436cd"}, "author": "", "url": "https://www.reuters.com/article/us-global-oil/oil-trades-near-strongest-levels-since-mid-2015-on-iranian-unrest-idUSKBN1ER024", "ord_in_thread": 0, "title": "Oil trades near strongest levels since mid-2015 on Iranian unrest", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "negative"}, {"name": "dmitry zhdan", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "reuters markets energy sector  oil", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil trades near strongest levels since mid-2015 on Iranian unrest By Henning Gloystein, Dmitry Zhdannikov, Reuters Markets Energy Sector \nOil prices posted their strongest start to a year since 2014 on Tuesday, with crude rising to mid-2015 highs amid large anti-government rallies in Iran and ongoing supply cuts led by OPEC and Russia. \nU.S. West Texas Intermediate (WTI) crude futures CLc1 traded broadly flat at around $60.40 a barrel by 1425 GMT after hitting $60.74 earlier in the day, their highest since June 2015. \nBrent crude futures LCOc1, the international benchmark, were also flat at around $66.80 a barrel after hitting a May 2015 high of $67.29 earlier in the day. Read relevant legal disclosures \nIt was the first time since January 2014 that the two crude oil benchmarks opened the year above $60 per barrel. \n\"Growing unrest in Iran set the table for a bullish start to 2018,\" the U.S.-based Schork Report said in a note to clients on Tuesday. \nIran's Supreme Leader on Tuesday accused the country's enemies of stirring unrest as the death toll from anti-government demonstrations that began last week rose to 21. \nIran is OPEC's third largest crude producer. Iranian oil industry and shipping sources said protests have had no impact on oil production or exports so far. \n\"Geopolitical risks are clearly back on the crude oil agenda after having been absent almost entirely since the oil market ran into a surplus in the second half of 2014,\" Bjarne Schieldrop, chief commodities analyst at SEB, said, also citing Kurdistan and Libya. \nEven without the unrest in Iran, which is a major oil exporter, market sentiment was bullish. \n\"Falling inventories globally and strong economic growth offset the restart of the Forties pipeline and the resumption of production following a pipeline outage in Libya,\" said Jeffrey Halley, senior market analyst at futures brokerage Oanda in Singapore. \nThe 450,000 barrel per day (bpd) capacity Forties pipeline system in the North Sea returned to full operations on Dec. 30 after an unplanned shutdown. \nOil markets have been supported by a year of production cuts led by the Middle East-dominated Organization of the Petroleum Exporting Countries and Russia. The cuts started in January 2017 and are scheduled to cover all of 2018. \nU.S. commercial crude oil inventories have fallen by almost 20 percent from their historic highs last March, to 431.9 million barrels. \nStrong demand growth, especially from China, has also been supporting crude. \nHowever, rising U.S. production, which is on the verge of breaking through 10 million bpd, is somewhat hampering the outlook into 2018. \n\"We think U.S. tight oil production growth warrants close monitoring as it could spoil OPEC's market-balancing efforts, pushing the market into surplus in 2018,\" Barclays bank said. \nOctober U.S crude production rose 167,000 barrels per day to 9.64 million bpd, according to the EIA’s monthly production report. If the figure is not revised next month, it would be the highest monthly level since May 1971. For more news you can use to help guide your financial life, visit our Insights page . © Reuters 2018. All rights reserved. Republication or redistribution of Reuters content, including by caching, framing or similar means, is expressly prohibited without the prior written consent of Reuters. Reuters and the Reuters sphere logo are registered trademarks and trademarks of the Reuters group of companies around the world. Votes are submitted voluntarily by individuals and reflect their own opinion of the article's helpfulness. A percentage value for helpfulness will display once a sufficient number of votes have been submitted. Send to (Separate multiple e-mail addresses with commas) Please enter a valid e-mail address Your E-Mail Address Please enter a valid e-mail address Message (Optional) Important legal information about the e-mail you will be sending. By using this service, you agree to input your real e-mail address and only send it to people you know. It is a violation of law in some jurisdictions to falsely identify yourself in an e-mail. All information you provide will be used by Fidelity solely for the purpose of sending the e-mail on your behalf.The subject line of the e-mail you send will be \"Fidelity.com: \" Your e-mail has been sent. ", "external_links": [], "published": "2018-01-02T18:22:00.000+02:00", "crawled": "2018-01-10T12:18:33.013+02:00", "highlightTitle": ""}