{"organizations": [], "uuid": "dca476be777d7920a931d0af1f446567fefe1311", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-patrick-mccreery-promoted-to-executive-vice-president-of-operations-for-meredith-local-media-group.html", "country": "US", "domain_rank": 767, "title": "Patrick McCreery Promoted to Executive Vice President of Operations for Meredith Local Media Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-03T18:00:00.000+02:00", "replies_count": 0, "uuid": "dca476be777d7920a931d0af1f446567fefe1311"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-patrick-mccreery-promoted-to-executive-vice-president-of-operations-for-meredith-local-media-group.html", "ord_in_thread": 0, "title": "Patrick McCreery Promoted to Executive Vice President of Operations for Meredith Local Media Group", "locations": [], "entities": {"persons": [{"name": "patrick mccreery", "sentiment": "negative"}, {"name": "mccreery", "sentiment": "none"}, {"name": "patrick", "sentiment": "none"}, {"name": "paul karpowicz", "sentiment": "none"}], "locations": [{"name": "iowa", "sentiment": "none"}, {"name": "des moines", "sentiment": "none"}], "organizations": [{"name": "mdp", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "meredith corporation", "sentiment": "negative"}, {"name": "meredith local media group", "sentiment": "negative"}, {"name": "meredith", "sentiment": "none"}, {"name": "local media group", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DES MOINES, Iowa, Jan. 3, 2018 /PRNewswire/ -- Meredith Corporation (NYSE: MDP; www.meredith.com ) announced today that Patrick McCreery has been promoted to Executive Vice President of Operations for the Local Media Group, effective immediately. In his new role, McCreery will oversee all station operations and general managers will report directly to him. McCreery will continue to report to Meredith Local Media Group President Paul Karpowicz.\nIn his prior role as Vice President of News & Marketing, McCreery directed content and strategy for Meredith's news and creative services departments. Under McCreery's leadership, Meredith's portfolio of 17 television stations achieved the No. 1 or No. 2 audience positions in morning or late news in most markets. He increased news hours 15 percent across the group, grew ratings in all day-parts, and improved the group's digital reach, which now includes more than one million unique app users and more than five million Facebook fans.\n\"Patrick has done a great job strengthening our local news and entertainment content and expanding our digital reach,\" said Karpowicz. \"He is committed to finding new and creative ways to get our local content and our advertisers' messages to audiences when and where they want them. He is a strong leader and I'm confident he will guide our stations to even greater success.\"\nMcCreery has worked for Meredith since 2003, starting as a Special Projects Executive Producer at KPHO in Phoenix. He then spent more than 10 years at KPTV-TV/KPDX-TV, Meredith's Portland-based duopoly. He started as Assistant News Director, eventually working his way up to Vice President & General Manager, a position he held for six years.\n\"I am looking forward to working with our team of general managers and continuing to make improvements that benefit our viewers, followers and advertisers,\" McCreery said. \"Local news, weather, sports and entertainment are still an important part of people's lives, and we are committed to delivering that content in timely, innovative and creative ways.\"\nMcCreery earned a Bachelor of Arts in Broadcast Journalism from Ohio State University. He will remain based at Meredith's duopoly in Phoenix.\nAbout Meredith Corporation\nMeredith Corporation (NYSE: MDP; www.meredith.com ) has been committed to service journalism for more than 115 years. Today, Meredith uses multiple distribution platforms – including broadcast television, print and digital – to provide consumers with content they desire and to deliver the messages of its advertising partners.\nMeredith's Local Media Group includes 17 television stations reaching 11 percent of U.S. households. Meredith's portfolio is concentrated in large, fast-growing markets, with seven stations in the nation's Top 25 and 13 in Top 50 markets. Meredith's stations produce approximately 700 hours of local news and entertainment content each week, and operate leading local digital destinations.\nView original content with multimedia: http://www.prnewswire.com/news-releases/patrick-mccreery-promoted-to-executive-vice-president-of-operations-for-meredith-local-media-group-300577026.html\nSOURCE Meredith Corporation", "external_links": ["http://www.prnewswire.com/news-releases/patrick-mccreery-promoted-to-executive-vice-president-of-operations-for-meredith-local-media-group-300577026.html", "http://www.meredith.com/"], "published": "2018-01-03T18:00:00.000+02:00", "crawled": "2018-01-03T21:09:47.000+02:00", "highlightTitle": ""}