{"organizations": [], "uuid": "664aff4fb044e854831901fcb9a63a03e65c1805", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219368581&w=1200&r=LYNXMPEE0315A", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-healthcare-insurance/trump-administration-rule-would-let-more-people-drop-obamacare-idUSKBN1ET1YY", "country": "US", "domain_rank": 408, "title": "Trump administration rule would let more people drop Obamacare", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T19:00:00.000+02:00", "replies_count": 0, "uuid": "664aff4fb044e854831901fcb9a63a03e65c1805"}, "author": "", "url": "https://www.reuters.com/article/us-usa-healthcare-insurance/trump-administration-rule-would-let-more-people-drop-obamacare-idUSKBN1ET1YY", "ord_in_thread": 0, "title": "Trump administration rule would let more people drop Obamacare", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "obamac", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "obamacare", "sentiment": "none"}, {"name": "yasmeen abutaleb", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "department of labor", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The Trump administration on Thursday proposed a rule to allow Americans who are self-employed or work for small businesses to buy health insurance that does not comply with all Obamacare requirements in an effort to unwind the 2010 healthcare law.\nThe rule, put forward by the Department of Labor, would allow individuals and small businesses to form an association based on geography or industry and purchase health insurance that would be exempt from some rules of the Affordable Care Act.\nThe rule also allows sole proprietors to join such associations. Currently, sole proprietors can purchase individual insurance through the Obamacare individual market, created under former Democratic President Barack Obama’s healthcare law.\nThe rule must go through a comment period but is likely to gain approval, helping to enact an executive order Republican President Donald Trump signed in October.\nUnder Obamacare, all health insurance plans must cover a set of 10 essential health benefits, such as maternity and newborn care, addiction and mental health treatment and prescription drugs. The proposed rule would allow small business associations to purchase health plans that do not necessarily cover all of these benefits, which proponents say would help lower premiums.\nThe rule does not allow Small Business Health Plans to charge those with pre-existing conditions more or exclude employees because of their health.\nProponents of Obamacare say the rule would undermine the individual insurance market created under the law by allowing young and healthy people to purchase cheaper insurance, leaving the sickest and most expensive patients in the Obamacare markets, driving up costs. Hospitals, insurers and medical groups criticized the rule in December and said it would make health insurance unaffordable for people with pre-existing conditions.\nThe rule could destabilize several states’ individual insurance markets because healthier people could access cheaper insurance, said Evercore ISI analyst Michael Newshel, adding that it is still unclear whether significant numbers of people will opt for the slimmer plans.\nRepublicans, who have unified control of government, have repeatedly failed to repeal and replace Obamacare, a top 2016 presidential campaign promise of Trump. Instead, the administration has sought to dismantle the law through administrative rules and executive orders.\nRepublicans dealt their biggest blow to the healthcare program in their tax overhaul, which Trump signed into law last month. The law in 2019 repeals the individual mandate, the requirement that most Americans purchase health insurance or else pay a fine. Health policy experts say the mandate helps ensure a viable market.\nSeveral business groups, including the National Restaurant Association and the National Retail Federation, on Thursday praised the proposed rule, saying it would enable millions of people to obtain more affordable health insurance.\nBut Democrats and medical advocacy groups blasted the rule, saying it put affordable health insurance further out of reach for many Americans, including those with pre-existing conditions.\n“The Trump administration has declared open season for fraudsters selling junk insurance while those with pre-existing conditions will find healthcare further and further out of reach,” Democratic Senator Ron Wyden said.\nReporting By Yasmeen Abutaleb; Editing by Andrew Hay and Jonathan Oatis\n ", "external_links": [], "published": "2018-01-04T19:00:00.000+02:00", "crawled": "2018-01-04T19:13:17.000+02:00", "highlightTitle": ""}