{"organizations": [], "uuid": "2533e1657c3f49627966ea4260d941f862634047", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/aston-martin.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/09/james-bond-aston-martin-car-brand-ipo/", "country": "US", "domain_rank": 1196, "title": "Aston Martin Is Reportedly Weighing a $6.8 Billion IPO | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.197, "site_type": "news", "published": "2018-01-09T08:08:00.000+02:00", "replies_count": 0, "uuid": "2533e1657c3f49627966ea4260d941f862634047"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/09/james-bond-aston-martin-car-brand-ipo/", "ord_in_thread": 0, "title": "Aston Martin Is Reportedly Weighing a $6.8 Billion IPO | Fortune", "locations": [], "entities": {"persons": [{"name": "james bond", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "aston martin", "sentiment": "negative"}, {"name": "bloomberg 6:08 am est  aston martin", "sentiment": "neutral"}, {"name": "ferrari nv", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 6:08 AM EST \nAston Martin is targeting a valuation of as much as 5 billion pounds ($6.8 billion) in a potential initial public offering of the British sports car maker, according to people familiar with the matter. \nThe manufacturer has held preliminary talks with advisers about a valuation including debt that would put it on par with Ferrari NV, said the people, who asked not to be named discussing private deliberations. Investors’ interest in an IPO this year could be bolstered by the planned expansion into the lucrative sport utility vehicle segment starting in 2019, the people said. \nAn Aston Martin share sale in London would cement the iconic brand’s comeback and mark a significant test of investor appetite for British companies ahead of the U.K.’s March 2019 break with the European Union. The company, famous for its connection to movie spy James Bond, surpassed 5,000 deliveries last year for the first time since 2008, and expects to exceed its 2017 guidance of at least 180 million pounds in adjusted earnings before interest, taxes, depreciation and amortization on more than 840 million pounds of revenue. \nRead: Aston Martin’s New Luxury Convertible Has a Sporty Side \nThe valuation is a preliminary estimate and no decision has been made on the possible listing as advisers are also considering other options for the carmaker, the people said. \n“As a matter of policy, Aston Martin does not comment about speculation concerning future ownership or capital restructuring,” said Simon Sproule, a spokesman for the Gaydon, England-based carmaker. The company is controlled by Investindustrial Advisors, which declined to comment, and Kuwaiti investors. \nAston Martin 2022 bonds rose as much as 0.22 pence to 105.86 pence in London on Tuesday, the most since Nov. 28, after Bloomberg News reported on the IPO plans late Monday. \nThe carmaker has said it will start building the DBX SUV at its new factory in Wales by 2019. The new $150,000 Vantage model had sold out almost all of its production capacity for 2018, Aston Martin said in November. Group sales may increase by about 60% to 8,250 vehicles in 2020, according to IHS Markit estimates. \nRead: Aston Martin Is Recalling Over 5,000 Vehicles in the U.S. Over Safety Concerns \nFerrari has a current stock-market value of about $21.5 billion, and an enterprise value of about 18.5 times its expected 2018 earnings before interest, taxes, depreciation and amortization, based on data compiled by Bloomberg. The Italian carmaker exceeded 30% adjusted Ebitda margin in the third quarter, a rare feat that puts the company in the league of Apple or luxury goods makers LVMH and Gucci. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T08:08:00.000+02:00", "crawled": "2018-01-09T15:26:26.013+02:00", "highlightTitle": ""}