{"organizations": [], "uuid": "5f6f6f17783a1e3831f0e3402deb80fb61d5049e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221919720&w=1200&r=LYNXMPEE0D0F9", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-pakistan-airlines-pakistan-intl/pakistan-aims-to-sell-national-airline-before-election-idUKKBN1F30NI", "country": "US", "domain_rank": 408, "title": "Pakistan aims to sell national airline before election", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T16:26:00.000+02:00", "replies_count": 0, "uuid": "5f6f6f17783a1e3831f0e3402deb80fb61d5049e"}, "author": "", "url": "https://uk.reuters.com/article/uk-pakistan-airlines-pakistan-intl/pakistan-aims-to-sell-national-airline-before-election-idUKKBN1F30NI", "ord_in_thread": 0, "title": "Pakistan aims to sell national airline before election", "locations": [], "entities": {"persons": [{"name": "muslim league-nawaz", "sentiment": "none"}, {"name": "drazen jorgic", "sentiment": "none"}, {"name": "daniyal aziz", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}, {"name": "benazir bhutto international airport", "sentiment": "none"}], "organizations": [{"name": "etihad", "sentiment": "none"}, {"name": "min read  islamabad", "sentiment": "none"}, {"name": "pakistan international airlines", "sentiment": "none"}, {"name": "pia", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 2:26 PM / Updated 12 minutes ago Pakistan aims to sell national airline before election Drazen Jorgic 4 Min Read \nISLAMABAD (Reuters) - Pakistan will try to privatise its national airline before general elections due this year, privatisation minister Daniyal Aziz said, as the ruling party seeks to restart sales of state-run businesses. FILE PHOTO: A Pakistan International Airlines (PIA) passenger plane arrives at the Benazir Bhutto International Airport in Islamabad, Pakistan December 2, 2015. REUTERS/Faisal Mahmood/File Photo \nPakistan International Airlines ( PIAa.KA )(PIA), haemorrhaging money and losing market share to Gulf-based rivals such as Etihad and Emirates, has been hit by management turmoil in recent years and a 2016 plane crash that led to 47 deaths. \nThe privatisation of loss-making entities that were draining the exchequer was a key priority for the Pakistan Muslim League-Nawaz (PML-N) party when it swept to power in 2013. \nPIA was among 68 state-owned companies earmaked for privatisation in return for a $6.7 billion International Monetary Fund package that helped Pakistan to stave off a default in 2013. \nDespite some initial success, the process stalled in 2016 after staff protests caused havoc with PIA operations and the government passed a law that effectively made it impossible to privatise the airline. \nBut Aziz, chairman of the Privatisation Commission, told Reuters that new plans have been drawn up to sell off PIA and he would take the proposals to the cabinet committee on privatisation, chaired by Prime Minister Shahid Khaqan Abbasi. \n“Next step would be going to the cabinet committee ... and that’s imminent, maybe even next week,” Aziz said in his Islamabad office this week. \nThe new plans focus on splitting up the carrier, with the core airline business being separated from vast peripheral operations such as catering, hotels and maintenance, Aziz said. The core airline would then be sold. HEAVY LOSSES \nBut to complete the transaction, Aziz said, the government would have to pass laws in parliament to reverse the 2016 legislation that converted PIA into a limited company and effectively barred the government from giving up management control. \nThe impetus to sell PIA has grown as the airline has piled up huge losses estimated by its former CEO in March at about $30 million a month. Total debt stood at 186 billion rupees ($1.8 billion) at the end of 2016. \nWhen asked how soon could a buyer could acquire PIA, Aziz said: “Tomorrow morning. If you have the money, come and buy it.” \nAziz gave no indication of an expected valuation. \nBoth Emirates and Etihad had shown interest in buying PIA before the government backed down from privatisation in 2016, the English-language Express Tribune newspaper reported, citing an unnamed official. \nAnalysts have been sceptical about the government’s ability, or willingness, to take on powerful unions and embark on a privatisation process so close to general elections likely in July or August. \nAziz said that, owing to time restraints ahead of the elections, the privatisation commission will focus on one state company per sector, including a bank and an energy company. \nHe added that there has been “huge interest” in buying Pakistan Steel Mills, once the pride of Pakistan’s industrial output but now shut and bleeding cash. \n“We will get runs on the board, but the real challenge is to bring to fruition the two big animals: one is PIA and the other one is Steel Mills,” Aziz said. Reporting by Drazen Jorgic; Editing by David Goodman", "external_links": [], "published": "2018-01-14T16:26:00.000+02:00", "crawled": "2018-01-14T16:42:13.012+02:00", "highlightTitle": ""}