{"organizations": [], "uuid": "f0ed58c3fa7f7af6eac4f3312c09b647efed9931", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221123511&w=1200&r=LYNXMPEE0A0V3", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-africa-refugees-education-girls/african-refugees-help-girls-learn-to-avoid-abuse-early-marriage-idUSKBN1F01IR", "country": "US", "domain_rank": 408, "title": "African refugees help girls learn to avoid abuse, early marriage", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T20:33:00.000+02:00", "replies_count": 0, "uuid": "f0ed58c3fa7f7af6eac4f3312c09b647efed9931"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-africa-refugees-education-girls/african-refugees-help-girls-learn-to-avoid-abuse-early-marriage-idUSKBN1F01IR", "ord_in_thread": 0, "title": "African refugees help girls learn to avoid abuse, early marriage", "locations": [], "entities": {"persons": [{"name": "adelphine ingabire", "sentiment": "none"}, {"name": "mutesi", "sentiment": "none"}, {"name": "amari mutesi", "sentiment": "none"}], "locations": [{"name": "kyangwali", "sentiment": "none"}, {"name": "uganda", "sentiment": "none"}, {"name": "burundi", "sentiment": "none"}, {"name": "democratic republic of congo", "sentiment": "none"}, {"name": "rwanda", "sentiment": "none"}, {"name": "sudan", "sentiment": "none"}, {"name": "kyangwali", "sentiment": "none"}, {"name": "congo", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KYANGWALI, Uganda (Thomson Reuters Foundation) - In western Uganda’s Kyangwali refugee settlement, Tamari Mutesi teaches tailoring to young women who do not go to school.\nThe initiative she works with aims to combat violence against young single mothers and other refugee girls, including those mistreated by their husbands, by helping them gain economic independence.\nMutesi, 27, a refugee from Democratic Republic of Congo, has trained more than 25 of her peers since 2008, after she and several friends learned the trade from an experienced tailor.\nHer trainees have now started their own tailoring businesses, earning enough to be self-reliant. Adelphine Ingabire, 22, said her income is about 10,000 Ugandan shillings ($2.74) a day.\n“I feel so happy to see fellow girls getting skills to stand for themselves, to feed their families, and help their parents and neighbors,” said Mutesi.\nHer work is backed by a group started in 2005 by four refugee boys from Congo, Burundi, Rwanda and Sudan - named COBURWAS after those countries - who wanted to help children living in Kyangwali camp go to school.\nOne of the boys, Joseph Munyambanza, fled the war in Democratic Republic of Congo aged six.\nLater, he and his adolescent peers raised funds by working on farms and constructed a classroom. They identified the neediest children and enrolled them to study.\nRealising girls aged 10 and above were most at risk of falling out of school and into early marriage, the COBURWAS International Youth Organization to Transform Africa (CIYOTA) launched a scheme to help them complete primary school and enter secondary school. It set up a hostel for about 50 girls, enabling them to study.\nAccording to UNESCO, many African girls only receive five years of schooling, while 9 million girls between the ages of six and 11 will never go to school at all in sub-Saharan Africa.\n“Girl’s education is what I am passionate about. We have a big number of girls and less (education) infrastructure to support them,” Munyambanza told the Thomson Reuters Foundation.\nSheila Arach, 16, from South Sudan has just finished primary school and plans to continue studying. She said COBURWAS provides a safe environment for learning, as well as support for dealing with unwanted sexual advances.\n“(It) has good teachers - we study at night and they talk to us about how to avoid men,” she said.\nAnnet Atieno, CIYOTA’s education manager, said primary-age girls are at risk of sexual abuse, especially those who are orphans, cared for by guardians and living in poverty in the settlement.\n“Demand for sex is very high in such a set up,” she said. “But since we started the program, the dropout rate reduced, the rate of absenteeism also dropped, and (the girls) are now focused on education.”\nSCHOLARSHIPS For those looking to go on to higher education, philanthropic organizations can help, as with Munyambanza who received support from the Mastercard Foundation to pursue a biochemistry degree at London’s Westminster College.\nAdelphine Ingabire, a refugee girl learning tailoring skills at Kyangwali refugee settlement, repairs a sewing machine outside the workshop, on November 29, 2017. Thomson Reuters Foundation/Pius Sawa Since 2013, the foundation has offered scholarships to more than 30 male and female refugees living at Kyangwali to study at universities around the world.\nFavorite Regina from Rwanda graduated last October from the African Leadership Academy program at the United States International University in Nairobi, and has since returned to Kyangwali to oversee projects and motivate its young girls.\n“I talk to them about how everything is possible, and not to look at men as a solution,” said Regina.\nThose who complete primary education are sent to secondary schools outside the settlement, and come back to learn more skills and receive mentoring during the holidays.\nJohn Bosco Okoboi, head teacher at the COBURWAS primary school in Kyangwali, said the rate of teenage girls getting pregnant was very high, at almost 90 percent. “But the best is not to condemn them. We discuss with them about the consequences,” he said.\nSarah Tuyiramye, a refugee from Rwanda who is about to complete her secondary education, said most of her friends never finished primary school.\n“They dropped out, and some have three children. I think if I had not been given this chance, I would be married,” she said.\nSCIENCE EDUCATION Meanwhile, in Gisozi, a suburb of Rwanda’s capital Kigali, bright girls are able to study science at a special school run by the Forum for African Women Educationalists (FAWE).\nThe Mastercard Foundation pays fees for girls from poor families, and has enabled more than 2,000 to attend the school since 1999.\nAlumni visit the school to mentor pupils, and have also set up an orphanage for abandoned girl children and others born of rape.\nStudents at the school donate part of their allowance to help pay fees for other needy girls in their communities.\nMarie Aimee Keza has just finished her exams at FAWE, and wants to go to university to become a pilot. As the only child in her family of six to attend school, Keza has motivated other girls in her neighborhood to work hard and stay in school.\n“The country should continue investing in girls and motivate them through education,” she told the Thomson Reuters Foundation. “When I heard that during the (Rwandan) genocide, there were some women who rescued people from the killers, I said, ‘I want to be one of those women in society’.”\nDorothy Nyambi from the African Institute for Mathematical Sciences said Africa is short of female role models. “It is not enough to give opportunities to girls when men are not opening up (to equality),” she said.\nSharmi Surianarain, who connects African Leadership Academy graduates and other Mastercard Foundation scholars with opportunities for making a difference across the continent, said one former student had gone on to start a school in Zimbabwe.\n“After they graduate, girls give more to the community, so investing in girls is fundamental,” she said.\n($1 = 3,655.0000 Ugandan shillings)\nReporting by Pius Sawa; editing by Megan Rowling. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, resilience, women's rights, trafficking and property rights. Visit news.trust.org/\n ", "external_links": ["http://news.trust.org/", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T20:33:00.000+02:00", "crawled": "2018-01-11T17:01:03.003+02:00", "highlightTitle": ""}