{"organizations": [], "uuid": "74bcc5b284145913f35cd005ad5430e20a926924", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218731266&w=1200&r=LYNXMPEE01028", "site_section": "http://feeds.reuters.com/reuters/INtopNews", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/northkorea-missiles/south-koreas-moon-says-better-inter-korean-relations-go-in-hand-with-resolving-north-korea-nuclear-issue-idINKBN1ER050", "country": "US", "domain_rank": 408, "title": "South Korea offers talks with defiant North ahead of Olympics", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T11:35:00.000+02:00", "replies_count": 0, "uuid": "74bcc5b284145913f35cd005ad5430e20a926924"}, "author": "", "url": "https://in.reuters.com/article/northkorea-missiles/south-koreas-moon-says-better-inter-korean-relations-go-in-hand-with-resolving-north-korea-nuclear-issue-idINKBN1ER050", "ord_in_thread": 0, "title": "South Korea offers talks with defiant North ahead of Olympics", "locations": [], "entities": {"persons": [{"name": "christine kim", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "u.n. security council", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 3:25 AM / Updated 6 hours ago South Korea offers talks with North ahead of Olympics Christine Kim 6 Min Read \nSEOUL (Reuters) - South Korea on Tuesday offered talks with North Korea next week amid a standoff over its weapons programmes, a day after North Korean leader Kim Jong Un said he was open to negotiations but that his country would push ahead with “mass producing” nuclear warheads. \n  Trump, who has led a global drive to pressure North Korea to give up development of nuclear-tipped missiles capable of hitting the United States, held back judgment on Pyongyang’s offer to talk, saying: Perhaps that is good news, perhaps not - we will see!” \nThe offer for high-level talks next Tuesday had been discussed with the United States, South Korea’s Unification Minister Cho Myong-gyon said, while a decision on whether to push back massive joint military drills until after the Winter Olympics which South Korea hosts next month is pending. \nCho suggested the talks be held at the border village of Panmunjom and said they should be focused on North Korea’s participation at the Olympics, but other issues would likely arise, including the denuclearisation of North Korea. \n“We look forward to candidly discussing interests from both sides face-to-face with North Korea along with the North’s participation in the Pyeongchang Winter Olympics,” Cho told reporters. \n“I repeat: The government is open to talking with North Korea, regardless of time, location and form.” \nShould the talks be held, it would be the first such dialogue since a vice-ministerial meeting in December 2015. \nTension has been rising over North Korea’s nuclear and missile programmes, which it pursues in defiance of years of U.N. Security Council resolutions, with bellicose rhetoric coming from both Pyongyang and the White House. North Korea sees regular war drills between South Korea and the United States as preparations for war. \nBut Kim said in a New Year’s Day speech he was “open to dialogue” with Seoul, and for North Korean athletes to possibly take part in the Winter Games, but he persistently declared North Korea a nuclear power. \nThe White House has yet to offer a detailed response to the speech, which analysts saw as an attempt to weaken the U.S.-South Korean alliance and the U.S. led campaign to raise pressure on Pyongyang through sanctions. \nA State Department spokesman said Washington was “in close contact with (South Korea) about our unified response to North Korea” and added: “We are confident in (South Korea‘s) commitment to hosting a safe and successful Olympic Winter Games.” \nSouth Korean President Moon Jae-in welcomed Kim’s address and asked his government to move as quickly as possible to bring North Korea to the Olympics, but he stressed that an improvement in inter-Korean relations “cannot go separately with resolving North Korea’s nuclear programme”. People look toward the north through a barbed-wire fence near the militarized zone separating the two Koreas, in Paju, South Korea, December 21, 2017. REUTERS/Kim Hong-Ji \nTrump said sanctions and other pressures were starting to have a big impact on North Korea. “Rocket man now wants to talk to South Korea for first time,” he said on Twitter, using his nickname for Kim. “Perhaps that is good news, perhaps not - we will see!” \nChina, which has persistently urged a return to talks to ease tensions, said recent positive comments from North and South Korea were a good thing. \n“China welcomes and supports North Korea and South Korea taking earnest efforts to treat this as an opportunity to improve mutual relations, promote the alleviation of the situation on the Korean peninsula and realize denuclearisation on the peninsula,” Foreign Ministry spokesman Geng Shuang said. \n‘DEEP BREATH’ NEEDED Slideshow (4 Images) \nChun Yung-woo, a former South Korean national security adviser, criticised Seoul for reacting so quickly to Kim. \n“I regret the government had even lost the flexibility to spend one day or two taking a deep breath and meticulously analysing Kim Jong Un’s ulterior motive before hastily issuing a welcoming statement,” he said. \n“The government will have to strive more to come up with a countermeasure not to get caught in a trap set by Kim Jong Un.” \nChoi Moon-soon, governor of Gangwon Province where the Olympics are to be held next month, has proposed South Korea send cruise ships to bring North Korean athletes and officials to Pyeongchang, according to South Korean media. \nChoi met North Korean sports official Mun Woong in China on Dec. 18 on the sidelines of a international youth football tournament where North and South Korea soccer teams competed, the Dong-A Ilbo newspaper reported. \nThis week’s exchanges follow a year dominated by fiery threats from Kim and Trump, who warned   would have no choice but to “totally destroy” North Korea if forced to defend itself or its allies, even as U.S. diplomats pushed for a diplomatic solution. \nNorth Korea regularly threatens to destroy the United States, South Korea and Japan and tested its most powerful intercontinental ballistic missile in November, which it said was capable of delivering a warhead anywhere in the United States. \nKim said he would consider sending a delegation to the Olympics. \nAt the same time, he said North Korea would focus in 2018 on “mass-producing nuclear warheads and ballistic missiles for operational deployment” and that he had a nuclear button on his desk capable of launching missiles at the United States. Reporting by Christine Kim; Additional reporting by Jane Chung and Hyonhee Shin in Seoul, Michael Martina in Beijing and Doina Chiacu and David Brunnstrom in Washington; Editing by Andrew Hay and Alistair Bell", "external_links": [], "published": "2018-01-02T11:35:00.000+02:00", "crawled": "2018-01-02T11:59:42.000+02:00", "highlightTitle": ""}