{"organizations": [], "uuid": "e558d55355582a17264354991d8870fdf1a35f15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222407557&w=1200&r=LYNXMPEE0F0R6", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/carillion-restructuring/suppliers-and-staff-count-the-cost-of-uk-carillions-collapse-idINKBN1F51C3", "country": "US", "domain_rank": 408, "title": "Suppliers and staff count the cost of UK Carillion's collapse", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:06:00.000+02:00", "replies_count": 0, "uuid": "e558d55355582a17264354991d8870fdf1a35f15"}, "author": "", "url": "https://in.reuters.com/article/carillion-restructuring/suppliers-and-staff-count-the-cost-of-uk-carillions-collapse-idINKBN1F51C3", "ord_in_thread": 0, "title": "Suppliers and staff count the cost of UK Carillion's collapse", "locations": [], "entities": {"persons": [{"name": "paul sandle", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}, {"name": "elisabeth o'leary", "sentiment": "none"}, {"name": "rudi klein", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "uk carilli", "sentiment": "none"}, {"name": "carillion's royal liverpool hospital", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "specialist engineering contractors’ group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON/CAMBRIDGE, England (Reuters) - Britain ordered a fast-track inquiry into the role played by Carillion’s directors in the failure of the construction and services group, as some of its thousands of small suppliers started to lay off workers on Tuesday.\nThe 200-year-old company, swamped by debt and pension liabilities and burning through cash, went into liquidation on Monday, threatening suppliers, merchants and big banks.\nThe government, which relies on big outsourcing companies such as Carillion to provide services from school dinners to road building, stepped in to guarantee that key contracts would be unaffected.\nBut it said other work would only be paid for 48 hours after the collapse, and thousands of small suppliers face unpaid bills totalling millions of pounds.\nBusiness Secretary Greg Clark said a full picture of the events which caused Carillion to enter liquidation needed to be established by the Insolvency Service.\n“I have asked that the investigation looks not only at the conduct of the directors at the point of its insolvency, but also of any individuals who were previously directors,” he said.\n“Any evidence of misconduct will be taken very seriously.”\nCarillion’s auditors, KPMG, would also be examined, he added.\nCarillion was responsible for providing millions of pounds of public services as well as major infrastructure projects in Britain, Canada and the Middle East. It was winning state contracts as recently as November.\nHUNDREDS OF PROJECTS Rudi Klein, head of Britain’s Specialist Engineering Contractors’ Group, estimated that Carillion had left a trail of 1.2 billion pounds in unpaid bills to thousands of small subcontractors.\nExamples of private companies that could be hit included a small Northern Irish engineering contractor owed 150,000 pounds and a concrete frame manufacturer in northwest England owed 2 million pounds, Klein said.\nFlora-tec, a corporate horticulture company based in Cambridgeshire, eastern England, said it is owed almost 1 million pounds for its work on Carillion contracts at local prisons, schools and hospitals, and had to lay off 10 of its 90 staff.\n“People were in tears, colleagues we worked with for a long time. But as soon as we knew what happened we had to cut our cost base,” Managing Director Andy Bradley said.\nDefaced branding is seen outside Carillion's Royal Liverpool Hospital site in Liverpool, Britain, January 16, 2018. REUTERS/Phil Noble He told Reuters he felt he had been misled.\n“Government, even despite several profit warnings, continued to give Carillion large public sector contracts (...) and the message that sends to businesses like mine, the small guys in the supply chain, is that central government must have confidence in Carillion,” he said.\n“I want the government to think long and hard about the SME sector, because we are the people that will bear the brunt of this, not the shareholders and not the big multinational conglomerates.”\nOUTSOURCING BRITAIN\nSlideshow (2 Images) Britain began outsourcing public services in the late 1980s under Margaret Thatcher and the model expanded under successive governments. It is now the world’s second-largest outsourcing market behind the United States.\nSpun out of Tarmac nearly 20 years ago and incorporating construction names such as Wimpey and Alfred McAlpine, Carillion operated in Britain and Ireland, Canada, the Middle East and North Africa.\nIt was working on 450 British government projects, including the building and maintenance of hospitals, schools, defence sites and a high-speed rail line.\nThe government has faced questions as to why it continued to award Carillion contracts after it first signalled it was in financial difficulty in July last year.\nJust a week after that first warning, Carillion was named as one of the contractors on Britain’s new High Speed 2 rail line, a flagship project that will better connect London with the north of England. In November, it won a further two contracts with state-owned Network Rail.\nMike Cherry, chairman of the Federation of Small Businesses, said it was vital that Carillion’s small business suppliers were paid, or some of those firms could themselves be put in jeopardy, putting even more jobs at risk.\n“When the dust settles on this sorry saga, there is also a wider lesson to learn about the concentration of public contracts in the hands of a small number of very big businesses,” he said.\nCarillion former chief executive Richard Howson, who stepped down after the group warned on profit in July, was paid more than 1.51 million pounds ($2.08 million) in salary and bonuses in 2016, according to the company’s annual report.\nHe will continue to be paid a 660,000-pound salary until Oct. 2018 under the terms of his notice when he left the group in November, after handing over to interim CEO Keith Cochrane, according to a statement on the company’s website.\n($1 = 0.7261 pounds)\nAdditional reporting by Elisabeth O'Leary, Editing by Keith Weir and Andrew Heavens\n ", "external_links": [], "published": "2018-01-16T14:06:00.000+02:00", "crawled": "2018-01-16T14:20:19.003+02:00", "highlightTitle": ""}