{"organizations": [], "uuid": "47b0864c85836932028b46161631b11803b20243", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221721959&w=1200&r=LYNXMPEE0C0DY", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-czech-election-president/czech-presidential-vote-sets-up-zeman-drahos-second-round-clash-idUKKBN1F20MS", "country": "US", "domain_rank": 408, "title": "Czech presidential vote sets up Zeman-Drahos second round clash", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T17:40:00.000+02:00", "replies_count": 0, "uuid": "47b0864c85836932028b46161631b11803b20243"}, "author": "", "url": "https://uk.reuters.com/article/uk-czech-election-president/czech-presidential-vote-sets-up-zeman-drahos-second-round-clash-idUKKBN1F20MS", "ord_in_thread": 0, "title": "Czech presidential vote sets up Zeman-Drahos second round clash", "locations": [], "entities": {"persons": [{"name": "zeman-drahos sec", "sentiment": "negative"}, {"name": "zeman-drahos", "sentiment": "negative"}, {"name": "drahos", "sentiment": "none"}, {"name": "jan lopatka", "sentiment": "none"}, {"name": "robert muller", "sentiment": "none"}, {"name": "milos zeman", "sentiment": "none"}, {"name": "jiri drahos", "sentiment": "none"}, {"name": "zeman", "sentiment": "none"}, {"name": "cerny  zeman", "sentiment": "none"}], "locations": [{"name": "czech republic", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "min read  prague", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 3:41 PM / Updated an hour ago Pro-Russian Czech president faces challenge from newcomer in runoff election Jan Lopatka , Robert Muller 5 Min Read \nPRAGUE (Reuters) - Russia-friendly Czech President Milos Zeman won the first round of voting to retain his job on Saturday, but pro-western runner-up Jiri Drahos will be a formidable opponent in the second round vote in two weeks, nearly complete results showed. Czech presidential candidate Jiri Drahos waves to his supporters, after polling stations closed for the country's direct presidential election, in Prague, the Czech Republic January 13, 2018. REUTERS/David W Cerny \nThe vote is seen as a referendum on the 73-year-old Zeman, in office since 2013, who has criticised immigration flows from Muslim countries and Germany’s decision to accept many migrants. \nWhile most Czechs share his views on immigration, Zeman’s inclination towards far-right groups and his warm relations with Russia and China have split public opinion, with a sizeable chunk of the electorate favouring pro-western candidates, including 68-year-old academic Drahos. \nCzech presidents have limited executive powers, but Zeman and his predecessors have had a strong influence on public debate. They are also pivotal in forming governments -- which the European Union and NATO member country is now trying to do. \nWith votes from 98.9 percent of districts counted, Zeman led the race with 38.6 percent of votes, while Drahos had won 26.6 percent. \nThat means a run-off needs to be held, and the balance of power may be closer than the first round showed. Four other candidates who ended between the third and sixth place and among them won 32.5 percent, all endorsed Drahos for the second round due on Jan. 26-27. \n“This looks hopeful,” Drahos told supporters and reporters at a Prague theatre after most results had come in. “By far the toughest game now awaits against Milos Zeman and his advisers... Come to vote, come to vote, come to vote.” \nZeman, who had shunned public debates ahead of the first round, accepted Drahos’ challenge to a television duel and said he hoped voters could make up their own mind. \n“I assume citizens have their own opinion and their own reason. They are not puppets that can be manipulated by endorsement from whoever,” Zeman told reporters at his campaign headquarters. \nA win for the soft-spoken, grey-haired chemical engineer Drahos could mean the tone of the Czech leadership shifts closer to the EU mainstream. Czech President Milos Zeman arrives to cast a vote during the country's direct presidential election as a Femen activist is escorted by Zeman's bodyguards at a polling station in Prague, the Czech Republic January 12, 2018. REUTERS/David W Cerny \n“I voted for professor Drahos because I want someone who will not push us to the East and who will not be a disgrace,” said lawyer Matej Gredl, 30, after he voted in Prague. \nThe outcome may also influence Czech Prime Minister Andrej Babis’s chances of forming a cabinet. His first attempt to rule in a minority administration is likely to be rejected by parliament next week. \nZeman has backed Babis and said he would give him another chance even though the billionaire businessman has struggled to get support from other parties while he battles police allegations that he illegally obtained EU subsidies a decade ago. Babis denies wrongdoing. TOO SMALL WIN Slideshow (9 Images) \nA former centre-left prime minister and backer of a federal Europe, Zeman has gradually shifted to positions criticising the EU, echoing and reinforcing public sentiment. \nHe has won endorsements from some mainstream groups as well as the Communist Party and the main far-right anti-EU and anti-NATO SPD party. \n“The first round result is a heavy blow for Milos Zeman, although he won it formally. It shows he doesn’t have much more where to take the votes,” said political scientist Josef Mlejnek jr. \n“They will try to picture (Drahos) as a friend of migrants, an agent of the EU.” \nThe Czech Republic has a tiny Muslim minority and has seen only a few of the hundreds of thousands of people coming to Europe in recent years to seek safety from war or better life. \nZeman has sought more trade and closer ties with China and has warm relations with Russian President Vladimir Putin, calling for the removal of EU sanctions on Russia over its annexation of Ukraine’s Crimea to boost business. \nHe has strong support mainly in the countryside of the nation of 10.6 million people, and often snipes at Prague elites and the media. Drahos said he needed to boost his visibility outside the capital - the only region he won - and would focus on that ahead of the second round. Reporting by Jan Lopatka; Additional reporting by Jiri Skacel; Editing by Ros Russell and Hugh Lawson", "external_links": [], "published": "2018-01-13T17:40:00.000+02:00", "crawled": "2018-01-13T18:04:08.095+02:00", "highlightTitle": ""}