{"organizations": [], "uuid": "921b8455e5dcc5d50ab3af2dfe0140ebb9b7487b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-renasant-corporation-announces-earnings-for-the-fourth-quarter-of-2017.html", "country": "US", "domain_rank": 767, "title": "Renasant Corporation Announces Earnings For The Fourth Quarter Of 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:49:00.000+02:00", "replies_count": 0, "uuid": "921b8455e5dcc5d50ab3af2dfe0140ebb9b7487b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-renasant-corporation-announces-earnings-for-the-fourth-quarter-of-2017.html", "ord_in_thread": 0, "title": "Renasant Corporation Announces Earnings For The Fourth Quarter Of 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "tupelo", "sentiment": "none"}, {"name": "miss.", "sentiment": "none"}], "organizations": [{"name": "renasant corporation", "sentiment": "negative"}, {"name": "the company", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TUPELO, Miss., Jan. 16, 2018 /PRNewswire/ -- Renasant Corporation (NASDAQ: RNST) (the \"Company\") today announced earnings results for the fourth quarter of 2017. Although the Company expects to realize material tax savings in the future as a result of the Tax Cuts and Jobs Act, the Company was required to revalue its net deferred tax assets in the fourth quarter of 2017 to reflect the corporate tax rate reduction implemented by this legislation. This revaluation, addressed in more detail later in this release, resulted in an approximately $14.5 million after-tax write-down of the Company's net deferred tax assets, which was charged against fourth quarter earnings and is reflected in the following discussion of the Company's results of operations for the fourth quarter and full year of 2017.\nNet income for the fourth quarter of 2017 was approximately $16.5 million, as compared to $23.6 million for the fourth quarter of 2016. Basic and diluted earnings per share (\"EPS\") were $0.33 for the fourth quarter of 2017, as compared to basic and diluted EPS of $0.56 and $0.55, respectively, for the fourth quarter of 2016. The write down of the Company's net deferred tax assets resulted in a $14.5 million decrease to net income, or $0.30 in diluted EPS, for the fourth quarter of 2017.\nNet income for the year ending December 31, 2017, was $92.2 million, as compared to $90.9 million for the same period in 2016. Basic and diluted EPS were $1.97 and $1.96, respectively, for 2017, as compared to basic and diluted EPS of $2.18 and $2.17, respectively, for the same period in 2016. The write down of the Company's net deferred tax assets resulted in a $14.5 million decrease to net income, or $0.31 in diluted EPS, for 2017.\nThe Company's balance sheet and results of operations as of and for the year ended December 31, 2017, include the impact of the Company's acquisition of Metropolitan BancGroup, Inc. (\"Metropolitan\"), which was completed on July 1, 2017. As of the acquisition date, Metropolitan operated eight offices in Nashville and Memphis, Tennessee and the Jackson, Mississippi MSA and had approximately $1.4 billion in assets, which included approximately $968 million in total loans, including mortgage loans held for sale, and approximately $942 million in total deposits. The assets acquired and liabilities assumed have been recorded at estimated fair value and are subject to change pending finalization of all valuations.\nImpact from the Tax Cuts and Jobs Act and Other Infrequent or Nonrecurring Items\nThe Tax Cuts and Jobs Act, which was enacted on December 22, 2017, among other things, permanently lowers the federal corporate tax rate, effective for tax years including or beginning January 1, 2018. United States generally accepted accounting principles require the Company to revalue its net deferred tax assets on the date of enactment based on the reduction in the overall future tax benefit expected to be realized at the lower tax rate implemented by the new legislation. After reviewing the Company's inventory of deferred tax assets and liabilities on the date of enactment and giving consideration to the future impact of the lower corporate tax rates and other provisions of the new legislation, the Company's estimated write-down of its net deferred tax assets was approximately $14.5 million, which is inclusive of an approximately $2.0 million write-down of deferred tax items accounted for in accumulated other comprehensive income (\"AOCI\"). This write-down is reflected in the Company's operating results for the fourth quarter of 2017 as an increase to the provision for income taxes. The Company's initial estimate of the net deferred tax assets write-down and the components thereof may be adjusted in future periods based on a number of factors and uncertainties, including the finalization of the Company's 2017 tax returns, further clarification from the Financial Accounting Standards Board on the proper treatment of the tax effects of items presented in AOCI and additional guidance released on the new legislation.\nIn addition to the write-down of net deferred tax assets, the Company incurred other expenses and charges in connection with certain transactions that are considered to be infrequent or non-recurring in nature. The following table presents the impact of these charges on reported earnings for the dates presented (in thousands):\nThree months ended\nDecember 31, 2017\nThree months ended\nDecember 31, 2016\nPre-tax\nAfter-tax\nDiluted EPS\nPre-tax\nAfter-tax\nDiluted EPS\nEarnings, as reported\n$\n46,745\n$\n16,511\n$\n0.33\n$\n35,096\n$\n23,635\n$\n0.55\nWrite-down of net deferred tax assets\n—\n14,486\n0.30\n—\n—\n—\nMerger and conversion expenses\n723\n479\n0.01\n—\n—\n—\nLoss share termination\n—\n—\n—\n2,053\n1,495\n0.04\nEarnings, adjusted\n47,468\n31,476\n0.64\n37,149\n25,130\n0.59\nYear ended\nDecember 31, 2017\nYear ended\nDecember 31, 2016\nPre-tax\nAfter-tax\nDiluted EPS\nPre-tax\nAfter-tax\nDiluted EPS\nEarnings, as reported\n$\n159,869\n$\n92,188\n$\n1.96\n$\n135,777\n$\n90,930\n$\n2.17\nWrite-down of net deferred tax assets\n—\n14,486\n0.31\n—\n—\n—\nMerger and conversion expenses\n10,378\n6,925\n0.15\n4,023\n2,694\n0.06\nDebt prepayment penalty\n205\n137\n—\n2,539\n1,700\n0.04\nLoss share termination\n—\n—\n—\n2,053\n1,495\n0.04\nEarnings, adjusted\n170,452\n113,736\n2.42\n144,392\n96,819\n2.31\nManaging Assets Below $10 Billion at December 31, 2017\nAs a result of the acquisition of Metropolitan, coupled with organic balance sheet growth, the Company's assets exceeded $10 billion at the end of the third quarter of 2017. In order to delay the adverse impact of the Durbin Amendment to the Dodd-Frank Act, which, among other things, imposes limitations on the amount of debit card interchange fees certain banking institutions may collect, the Company initiated several strategic initiatives to manage its consolidated assets below $10 billion at December 31, 2017, which is the threshold at which bank holding companies would be subject to the Durbin Amendment. More specifically, the Company sold certain investment securities and shortened the holding period of mortgage loans held for sale. The proceeds from these initiatives were used to reduce certain wholesale funding sources. The pre-tax cost of the overall initiative for the fourth quarter of 2017, which includes interest income foregone on the securities and mortgage loans sold, was approximately $450 thousand, which amount was slightly offset by a pre-tax gain of $91 thousand resulting from the sale of certain investment securities. The Company had previously disclosed the estimated impact of the Durbin Amendment on the Company's interchange fee income in 2018 would be approximately $2.1 million to $2.3 million per quarter beginning in the third quarter. During the first quarter of 2018, the Company intends to lengthen the holding period of our mortgage loans held for sale portfolio and purchase securities to reestablish the balance of our investment securities portfolio at a level consistent with amounts reported in previous periods.\n\"Excluding the immediate impact from the Tax Cuts and Jobs Act, the Company closed the year with very strong results. Our continuous efforts to grow net interest income while focusing on efficiency contributed to our profitability during the year. Furthermore, neither our strategies to deleverage the balance sheet during the fourth quarter nor the conversion", "external_links": ["http://services.choruscall.com/links/rnst180117.html", "http://www.renasant.com/", "http://www.prnewswire.com/news-releases/renasant-corporation-announces-earnings-for-the-fourth-quarter-of-2017-300583546.html"], "published": "2018-01-17T00:49:00.000+02:00", "crawled": "2018-01-17T03:07:40.000+02:00", "highlightTitle": ""}