{"organizations": [], "uuid": "3ba16581a1255a80484e7f3399e630dbfa3d9b25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/11/the-associated-press-us-gives-2b-to-help-homeless-amid-plans-to-cut-housing-aid.html", "country": "US", "domain_rank": 767, "title": "US gives $2B to help homeless amid plans to cut housing aid", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T21:41:00.000+02:00", "replies_count": 0, "uuid": "3ba16581a1255a80484e7f3399e630dbfa3d9b25"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/11/the-associated-press-us-gives-2b-to-help-homeless-amid-plans-to-cut-housing-aid.html", "ord_in_thread": 0, "title": "US gives $2B to help homeless amid plans to cut housing aid", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "west coast", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump's administration announced $2 billion in grants Thursday for local agencies trying to help the homeless even as the government proposes deep cuts to federal housing programs.\nThe total awards in the Continuum of Care program is the most ever, though only slightly above collective grants of more than $1.9 billion in the last few years. About 7,300 programs are being funded.\nAcross the country, homelessness has been on a downward trend for years, according to government counts. But there's been a spike in numbers, particularly among homeless living on the streets along the West Coast, where rents have been rising fast, The Associated Press has reported .\nIn counts conducted in early 2017, the West Coast spike was so high that it raised the overall homelessness figure for the first time since 2010, to nearly 554,000 people.\nThe grants announced Thursday would send $383 million to California, up from $354 million last year. Oregon would get $36.3 million and Washington state, $59.6 million, both increases of less than $1 million from last year.\nThe awards consider the cost of funding current programs, how well projects perform and housing costs. Changes in homelessness counts are not a major factor.\nUnder Trump and Housing and Urban Development Secretary Ben Carson, the federal government has largely maintained the approach to homelessness taken by former Presidents George W. Bush and Barack Obama. That includes a focus on Housing First, which moves people quickly from homelessness into permanent housing, rather than using transitional housing as an intermediate step.\n\"We're looking at evidence,\" Carson said of the grant program that's a major part of a roughly $5 billion annual anti-homeless effort. \"We want to see things that are actually working and are preventing homelessness.\"\nThe Trump administration's budget proposal calls for cutting the number of people assisted through federal public housing programs and rental vouchers that can be used to prevent homelessness and to house the homeless.\n\"Any cuts to housing assistance are going to impact on homelessness,\" said Nan Roman, president and CEO of the National Alliance to End Homelessness.\nPlans from the administration and both chambers of Congress have different funding levels, with deepest cuts from the administration, reductions from the House and slight increases from the Senate.\nAn analysis from the liberal-leaning Center on Budget and Policy Priorities said all three proposals would result in fewer people receiving housing help from the federal government and warned that some of those who can't get help will end up homeless.\nThe administration's proposed budget also calls for the elimination of the Interagency Council on Homelessness, which coordinates the federal response to the problem.\nFollow Mulvihill at http://www.twitter.com/geoffmulvihill", "external_links": [], "published": "2018-01-11T21:41:00.000+02:00", "crawled": "2018-01-12T03:53:21.001+02:00", "highlightTitle": ""}