{"organizations": [], "uuid": "b8418617bc3b2690d74a13431de5228434c0d49a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-doubleline-income-solutions-fund-declares-january-distribution.html", "country": "US", "domain_rank": 767, "title": "DoubleLine Income Solutions Fund Declares January Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T17:05:00.000+02:00", "replies_count": 0, "uuid": "b8418617bc3b2690d74a13431de5228434c0d49a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-doubleline-income-solutions-fund-declares-january-distribution.html", "ord_in_thread": 0, "title": "DoubleLine Income Solutions Fund Declares January Distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "doubleline income solutions fund", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "board of trustees", "sentiment": "none"}, {"name": "fund's board of trustees", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 2, 2018 /PRNewswire/ -- DoubleLine Income Solutions Fund (the \"Fund\"), a closed-end fund traded on the New York Stock Exchange under the symbol DSL, today declared a distribution of $0.15 per share for the month of January. The distribution is subject to the following ex-dividend, record and payment dates set by the Fund's Board of Trustees.\nJanuary 2018\nDeclaration\nTuesday, January 2, 2018\nEx-Dividend\nWednesday, January 17, 2018\nRecord\nThursday, January 18, 2018\nPayment\nWednesday, January 31, 2018\nThis press release is not for tax reporting purposes. The press release has been issued to announce the amount and timing of the distributions declared by the Board of Trustees. There is a possibility that distributions may include ordinary income, long-term capital gains or return of capital. For information on whether the distribution includes a return of capital, please contact us on or after the distribution payment date. The amount of distributable income and the tax characteristics of the distributions are determined at the end of the taxable year. In early 2019, the Fund will send shareholders a Form 1099-DIV specifying how the distributions paid by the Fund during the prior calendar year should be characterized for purposes of reporting the distributions on a shareholder's tax return.\nAbout DoubleLine Income Solutions Fund\nThe Fund's primary investment objective is to seek high current income; its secondary objective is to seek capital appreciation. The Fund seeks to achieve its investment objectives by investing in a portfolio of investments selected for their potential to provide high current income, growth of capital, or both. DoubleLine Capital LP (\"DoubleLine\"), the Fund's investment adviser, expects that the Fund will normally invest at least 80% of its net assets (plus any borrowings for investment purposes) in debt securities and other income-producing investments anywhere in the world, including emerging markets. The Fund may invest in mortgage-backed securities of any kind and may invest without limit in securities rated below investment grade (commonly referred to as \"high yield\" securities or \"junk bonds\"). There is no guarantee that the Fund will achieve its investment objectives. Investing in the Fund involves the risk of principal loss.\nAbout DoubleLine Capital LP\nDoubleLine Capital LP, a registered investment adviser under the Investment Advisers Act of 1940, acts as the investment adviser for the Fund. DoubleLine's offices in Los Angeles can be reached by telephone at (213) 633-8200 or by e-mail at info@doubleline.com . Media can reach DoubleLine by e-mail at media@doubleline.com . DoubleLine® is a registered trademark of DoubleLine Capital LP.\nTo read about the DoubleLine Income Solutions Fund, please access the Annual Report at www.doublelinefunds.com or call 888.308.3838 to receive a copy. Investors should consider the Fund's investment objective, risks, charges and expenses carefully before investing. An investment in the Fund should not constitute a complete investment program. Investors should note that the Fund only can be obtained through a broker.\nThere is no assurance that the Fund will achieve its investment objectives.\nInvestments in this closed-end fund involves fees and expenses. Please refer to the prospectus for more information.\nThis document is not an offer to sell securities or the solicitation of an offer to buy securities, nor shall there be any sale or offer of these securities, in any jurisdiction where such sale or offer is not permitted.\nFund investing involves risk. Principal loss is possible.\nShares of closed-end investment companies frequently trade at a discount to their net asset value, which may increase investors' risk of loss. This risk may be greater for investors expecting to sell their shares in a relatively short period after the completion of the public offering. There are risks associated with investment in the fund.\nInvestments in debt securities typically decline in value when interest rates rise. This risk is usually greater for longer-term debt securities. Investments in asset-backed and mortgage-backed securities include additional risks that investors should be aware of including credit risk, prepayment risk, possible illiquidity and default, as well as increased susceptibility to adverse economic developments. The Fund may invest in foreign securities which involve greater volatility and political, economic and currency risks and differences in accounting methods. These risks are greater for investments in emerging markets. Investments in lower rated and non-rated securities present a greater risk of loss to principal and interest than higher rated securities. Debt securities of below investment grade quality are regarded as having predominantly speculative characteristics with respect to capacity to pay interest and to repay principal, and are commonly referred to as \"high yield\" securities or \"junk bonds.\" There is no assurance the Fund's leveraging strategies will be successful. Leverage is a speculative technique that may expose the Fund to greater risk and increased cost. The value of the Fund's investments in REITs may change in response to changes in the real estate market such as declines in the value of real estate, lack of available capital or financing opportunities, and increase in property taxes or operating costs. Derivatives may involve certain costs and risks such as liquidity, interest rate, market, credit, management and the risk that a position could not be closed when most advantageous. Investing in derivatives could lose more than the amount invested. The Fund may make short sales of securities, which involve the risk that losses may exceed the original amount invested. The Fund may invest in small companies, which involve additional risks such as limited liquidity and greater volatility. The Fund is a \"non-diversified\" investment company and therefore may invest a greater percentage of its assets in the securities of a single issuer or a limited number of issuers than funds that are \"diversified.\" Accordingly, the Fund is more susceptible to risks associated with a single economic, political or regulatory occurrence than a diversified fund might be.\nPast performance is no guarantee of future results.\nPast distribution history is not a projection of potential future distributions. Distributions include all distribution payments regardless of source and may include net income, capital gains, and/or return of capital. Information regarding the source of distributions other than net income may be found by calling 1 (877) 354-6311/1 (877) DLINE11.\nThis material may include statements that constitute \"forward-looking statements\" under the U.S. securities laws. Forward-looking statements include, among other things, projections, estimates, and information about possible or future results related to the Fund, market or regulatory developments. The views expressed herein are not guarantees of future performance or economic results a", "external_links": ["http://www.prnewswire.com/news-releases/doubleline-income-solutions-fund-declares-january-distribution-300576268.html", "http://www.doublelinefunds.com/"], "published": "2018-01-02T17:05:00.000+02:00", "crawled": "2018-01-02T16:23:13.004+02:00", "highlightTitle": ""}