{"organizations": [], "uuid": "797fa608f85417ccae4dfd8533b4d1fad05071db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-economy-loans/update-1-chinas-new-loans-halve-in-dec-but-hit-record-in-2017-idUSL4N1OZ2RN", "country": "US", "domain_rank": 408, "title": "UPDATE 1-China's new loans halve in Dec, but hit record in 2017", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T11:19:00.000+02:00", "replies_count": 0, "uuid": "797fa608f85417ccae4dfd8533b4d1fad05071db"}, "author": "", "url": "https://www.reuters.com/article/china-economy-loans/update-1-chinas-new-loans-halve-in-dec-but-hit-record-in-2017-idUSL4N1OZ2RN", "ord_in_thread": 0, "title": "UPDATE 1-China's new loans halve in Dec, but hit record in 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "nov  beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "pboc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "people’s bank of china", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 9:21 AM / Updated an hour ago UPDATE 2-China's new loans halve in Dec, but hit record in 2017 Reuters Staff \n* Dec new loans 584.4 bln yuan vs f‘cast of 1 trln yuan \n* China’s new loans hit record 13.53 trln yuan in 2017 \n* Dec M2 money supply up 8.2 pct y/y, vs f‘cast 9.1 pct \n* Dec TSF 1.14 trln yuan, vs 1.6 trln yuan in Nov (Adds comments from analyst, c.bank) \nBy Fang Cheng and Kevin Yao \nBEIJING, Jan 12 (Reuters) - China’s bank lending halved in December as the government kept up its campaign to curb financial system risks, but banks still managed to dole out a record amount for the year amid the tighter scrutiny. \nChinese authorities are trying to walk a fine line by containing riskier types of financing and slowing an explosive build-up in debt without stunting economic growth. \nBanks extended 584.4 billion yuan ($90.46 billion) in December, data from the People’s Bank of China (PBOC) showed on Friday, well below expectations of 1 trillion yuan and November’s 1.12 trillion yuan. But banks lent a record 13.53 trillion yuan of new loans in 2017. \nSome analysts believe the slowdown in December loans also reflects seasonal factors as banks usually lend less towards the year-end due to tight loan quotas and capital charges. \n“We expect bank loans to increase significantly in January 2018 due to strong demand,” analysts at ANZ said in a report. “With deleveraging remaining a policy priority over the medium term, the seasonal slowing in credit will not result in monetary easing.” \nNew bank loans last year surpassed 2016’s record tally of 12.65 trillion yuan, as a crackdown on riskier shadow lending have forced banks to shift such loans back onto their books. \nSince the start of this year, Chinese regulators have taken a slew of steps to force financial institutions to deleverage, targeting everything from bond trading, banks’ NCD debt issuance to entrusted loans. \nAnalysts have attributed the appetite for loans partly to the crackdown on off-balance sheet lending although there are signs tighter liquidity is starting to hit the economy. \n“Our China Activity Proxy suggests that growth has started to suffer recently as a result of this slowdown in credit growth. We expect further weakness in the months ahead, which we think will eventually trigger monetary easing by the PBOC,” said Capital Economics Senior China Economist Julian Evans-Pritchard. \n“NEW NORMAL” \nHousehold loans, mostly mortgages, fell to 329.4 billion yuan in December from 620.5 billion yuan in November, according to Reuters calculations based on the central bank’s data. \nHousehold loans accounted for 56 percent of total new loans in December, versus 55 percent in November. \nCorporate loans fell to 243.2 billion yuan in December from 522.6 billion yuan a month earlier. \nHousehold loans rose to 7.13 trillion yuan in 2017 from 6.33 trillion yuan in 2016, while corporate loans climbed to 6.71 trillion yuan from 6.1 trillion yuan, the data showed. \nBroad M2 money supply in 2017 grew 8.2 percent from a year earlier, missing forecasts for an expansion of 9.1 percent and hitting the slowest pace since records began in 1996. \nThe M2 growth rate was far lower than the official target of around 12 percent. \nThe Shanghai Securities News quoted central bank spokeswoman Ruan Jianhong as saying that the weak M2 growth was caused by a crackdown on banks’ off-balance sheet activities, even though they maintained support for the real economy. \n“As long as the financing needs of the real economy are met, the slowdown of M2 actually reflects the improvement of the efficiency of cashflows,” Ruan said. \n“The growth rate of M2, which is lower than in the past, may become a new normal and need not be over interpreted.” \nChina will keep its target for economic growth at “around 6.5 percent” in 2018, unchanged from last year, policy sources told Reuters last week. \nThe central bank is likely to keep its grip on money supply this year in line with its “prudent and neutral” policy, but no increases in benchmark interest rates are expected soon after a recent rise in corporate funding costs, sources have said. \nOutstanding yuan loans at end-December grew 12.7 percent from a year earlier, slower than an expected 13.1 percent rise. \nTotal social financing (TSF), a broad measure of credit and liquidity in the economy, fell to 1.14 trillion yuan in December from 1.60 trillion yuan in November, data showed. \nTSF includes off-balance sheet forms of financing that exist outside the conventional bank lending system, such as initial public offerings, loans from trust companies and bond sales. \nThat can provide hints of activity in China’s vast and unregulated shadow banking sector, which authorities have also been targeting in their campaign to reduce systemic risks. $1 = 6.4696 Chinese yuan Editing by Sam Holmes and Jacqueline Wong", "external_links": [], "published": "2018-01-12T11:19:00.000+02:00", "crawled": "2018-01-12T12:09:38.005+02:00", "highlightTitle": ""}