{"organizations": [], "uuid": "124b9a466cc7b261b2d6187b204afefbeba42d57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/germany-stocks-factors/german-stocks-factors-to-watch-on-january-8-idUSL8N1P00VE", "country": "US", "domain_rank": 408, "title": "German stocks - Factors to watch on January 8", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-08T14:12:00.000+02:00", "replies_count": 0, "uuid": "124b9a466cc7b261b2d6187b204afefbeba42d57"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/germany-stocks-factors/german-stocks-factors-to-watch-on-january-8-idUSL8N1P00VE", "ord_in_thread": 0, "title": "German stocks - Factors to watch on January 8", "locations": [], "entities": {"persons": [{"name": "stephen feinberg", "sentiment": "none"}, {"name": "kasper rorsted", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fas ag", "sentiment": "none"}, {"name": "fresenius", "sentiment": "none"}, {"name": "commerzbank", "sentiment": "none"}, {"name": "frankfurter allgemeine sonntagszeitung", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "adidas", "sentiment": "none"}, {"name": "cerberus", "sentiment": "none"}, {"name": "deutsche telekom", "sentiment": "none"}, {"name": "wirtschaftswoche", "sentiment": "none"}, {"name": "handelsblatt", "sentiment": "none"}, {"name": "deutsche bank shareholder union investment", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN/FRANKFURT, Jan 8 (Reuters) - The following are some of the factors that may move German stocks on Monday:\nADIDAS The sportswear firm is well under way to quadruple sales from online business to 4 billion euros ($4.81 billion) by 2020 and eyes further growth in subsequent years, Chief Executive Kasper Rorsted told Frankfurter Allgemeine Sonntagszeitung.\nBANKS U.S. buyout firm Cerberus opposes a merger between Germany’s two top lenders, Deutsche Bank and Commerzbank, Handelsblatt reported, citing Stephen Feinberg, the private equity investor’s co-founder.\nSeparately, Deutsche Bank shareholder Union Investment said the lender’s top management has about two quarters to show they were delivering an improvement after the bank on Friday announced its third-consecutive annual loss in 2017 results.\nDEUTSCHE TELEKOM New so-called IFRS 16 accounting rules may force the telecom company to add at least 14.4 billion euros of previously hidden leasing liabilities to its debt position, WirtschaftsWoche reported, citing estimates by consulting firm FAS AG.\nFRESENIUS The healthcare group will continue to look for acquisitions even if that leads to a temporary rise in debt, Boersen-Zeitung Quote: d the company’s finance chief as saying.\nINFINEON The chipmaker will in the fourth quarter start volume production of a new 3D image sensor that enables face recognition by smartphones and will present the technology at CES next week.\nLUFTHANSA The carrier said it expects unit revenue (RASK) to be slightly positive in the first quarter and unit costs (CASK) to fall between 1-2 percent.\nSeparately, the German government has commissioned a Lufthansa subsidiary to handle business travel payments for staff at federal authorities, Welt am Sonntag reported on Saturday, without citing the source of its information.\nVOLKSWAGEN A senior U.S. sales manager has quit Volkswagen’s North America operations, Automotive News reported, just as the carmaker’s deliveries in the world’s second-largest auto market fall steeply.\nSeparately, VW group sales probably rose to a record of around 10.7 million cars last year and kept the German behemoth ahead of Toyota as the world’s largest automaker, Bild am Sonntag reported, citing in-house VW estimates.\nIn addition, Nvidia Corp will partner with Uber Technologies Inc and Volkswagen AG as the graphics chipmaker’s artificial intelligence platforms make further gains in the autonomous vehicle industry.\nAIRBUS Chief Executive Tom Enders signed a non-binding agreement with Turkish Airlines on a potential order for 25 A350-900 aircraft during an official visit by Turkish president Tayyip Erdogan in Paris on Friday.\nOVERSEAS STOCK MARKETS Dow Jones +0.9 pct, S&P 500 +0.7 pct, Nasdaq +0.8 pct at Friday’s close.\nJapanese markets closed, Shanghai stocks +0.4 pct.\nTime: 0610 GMT.\nGERMAN ECONOMIC DATA German November industrial orders due at 0700 GMT. Seen +0.7 pct m/m.\nEUROPEAN FACTORS TO WATCH DIARIES REUTERS TOP NEWS ($1 = 0.8320 euros) (Reporting by Andreas Cremer and Christoph Steitz)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T14:12:00.000+02:00", "crawled": "2018-01-09T17:05:48.017+02:00", "highlightTitle": ""}