{"organizations": [], "uuid": "5d356d397debcdd67a2960182943b3dbf1d4ed09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/26/104916832-Clover_Health.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/clover-health-insurance-start-up-angered-customers-missed-financials.html", "country": "US", "domain_rank": 767, "title": "Clover Health insurance start-up angered customers, missed financials", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.164, "site_type": "news", "published": "2017-12-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "5d356d397debcdd67a2960182943b3dbf1d4ed09"}, "author": "Christina Farr", "url": "https://www.cnbc.com/2018/01/03/clover-health-insurance-start-up-angered-customers-missed-financials.html", "ord_in_thread": 0, "title": "Clover Health insurance start-up angered customers, missed financials", "locations": [], "entities": {"persons": [{"name": "clover", "sentiment": "none"}], "locations": [{"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "cms", "sentiment": "negative"}, {"name": "clover health", "sentiment": "negative"}, {"name": "atlanticare", "sentiment": "none"}, {"name": "shore medical center", "sentiment": "none"}, {"name": "oon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In the summer of 2015, senior citizens who had signed up for a fledgling insurance plan called Clover Health started receiving unexpected medical bills for blood work.\nMost were living on fixed incomes in New Jersey, the only state where Clover, a venture-backed start-up based in San Francisco, was available.\nAs a Medicare Advantage Plan, Clover makes most of its money from the federal government, which covers the bulk of insurance costs for people age 65 and over. Members expected the Clover plan to cover clinical lab tests, even if the providers were out of network.\nBut Clover was playing a different game -- one which would put patients in a bad situation. Before Clover would make payments, it first wanted patient data from the country's biggest lab-testing providers, LabCorp and Quest Diagnostics , according to two people familiar with the matter who asked not to be named because the information they provided was confidential.\nThat data would help Clover develop the predictive analytics technology that was supposed to help patients and keep costs down -- and was a big reason why venture capitalists plowed $425 million into the company.\nshow chapters Trump thinks Democrats Republicans will agree on health care plan 11:19 AM ET Tue, 26 Dec 2017 | 00:50 Sources say that despite its $1.2 billion valuation, Clover has struggled to navigate a highly challenging and slow-moving health insurance industry that rewards size and scale. The \"growth-hacking\" tricks and aggressive sales and marketing techniques that software start-ups and app developers use to juice their numbers have proven less effective in health care, which is heavily regulated.\nIn this case, as a small start-up plan, Clover had little negotiating power with giant lab companies. So Clover started pushing back on the claims, telling the labs that it lacked sufficient proof that the tests were medically necessary. The start-up outlined a list of items that it needed within 30 days before paying these bills.\nRather than adhering to Clover's demands, the labs turned around and billed the patients -- Clover's elderly members. It's not supposed to happen that way, as Clover tells its members that it doesn't allow for so-called balance billing by providers.\nBut in hundreds of instances, according to a person familiar with the matter, Clover customers contacted the company, angry and confused. \"Members were harassed with bills,\" the source said.\nThe Centers for Medicare and Medicaid Services (CMS) received a complaint about an unpaid claim from Quest in 2016, which was resolved when Clover told the member not to pay.\nClover eventually paid its bills to the labs after learning the full extent of the situation, and it negotiated in-network contracts and data-sharing deals with both Quest and LabCorp by the end of 2015. Internally, the company views the incident as a gamble that paid off.\nClover funding rounds Round Amount Date Lead investor A $100 mln Sept 2015 First Round B $35 mln Dec 2015 Sequoia C $160 mln May 2016 Greenoaks D $130 mln May 2017 Greenoaks But in Clover's efforts to take a Silicon Valley approach to health care and disrupt the insurance market, it also disrupted the lives of members.\nQuest didn't respond to requests for comment and LabCorp didn't provide one.\nCNBC spoke with six former Clover employees and advisers for this story. They all spoke on the condition of anonymity, because of various agreements they signed with Clover and because of the sensitivity of the topic.\nSources described an operation with some deep flaws, from its culture and leadership to its business model, which relies on payments from the government.\nThe turmoil has led to hefty turnover of late in Clover's C-suite. Co-founder and Chief Technology Officer Kris Gale stepped down in December, four months after Wilson Keenan , the chief operating officer, left the company.\n'New approach to health insurance' Clover has also missed internal financial targets, is reckoning with mounting losses and has seen its Medicare star rating dip from 3.5 out of 5 to 3, which is a problem because lower scores result in reduced payments from the government.\nBut the company is pushing ahead with some new hires and geographic expansion.\nIn September, it brought on Varsha Rao , the former head of operations at Airbnb, as COO. And the company is beginning to serve parts of Georgia, Texas and Pennsylvania in early 2018, after thus far being unable to operate outside of New Jersey.\nThe big-name venture capitalists, who have poured hundreds of millions of dollars into Clover, have plenty at stake in the company's success, as does board member Chelsea Clinton . They're all buying into an \"entirely new approach to health insurance,\" as Clover proclaims on its website.\nSequoia Capital and First Round Capital are among Clover's top backers. In May, Alphabet's venture arm GV joined a $130 million financing round that put Clover in the billion-dollar start-up club. And here's what an investor at Greenoaks Capital said about Clover in May 2016, after leading a $160 million financing round .\n\"By combining a data-driven approach to improving health outcomes and a genuine desire to delight its members, Clover offers a Medicare Advantage plan that creates a truly positive impact on member health, while delivering a superior member experience and value that continues to get better and better at a rapid pace.\"\nClover was started in 2012 by Vivek Garipalli, who previously co-founded a New Jersey hospital chain called CarePoint Health.\nAt CarePoint, Garipalli's model involved cutting ties with large private insurers to make these hospitals out of network for most plans. That meant insurers generally ended up paying higher rates, a scheme that Aetna's former head of national networks described as \"taking advantage of members who seek emergency services.\"\nIn 2013, a New York Times investigation revealed that Bayonne, one of the CarePoint medical centers, was the most expensive hospital in America, charging the highest amounts in the country for nearly one-quarter of the most common hospital treatments.\nThose close to Garipalli say he knows the industry and has the entrepreneurial drive necessary to battle entrenched interests. First Round's Josh Kopelman was so struck by Garipalli that in 2015, his early-stage firm wrote a $4 million check to Clover, the biggest initial investment it had ever made.\nSource: YouTube Vivek Garipalli, CEO of Clover Health. With Clover, Garipalli was jumping into a new market. Clover is among a small group of Medicare Advantage start-ups, along with Bright Health and Devoted Health, offering plans that are increasingly popular among the growing number of retirees because they purportedly offer greater consumer choice and extra coverage while still maintaining government subsidies. Consulting firm PricewaterhouseCoopers expects the Medicare Advantage market to generate more than $350 billion in annual revenue by 2020.\nBut despite the marketing hype and flood of investor dollars, Clover has been falling short of its goals. Rather than using tech to provide a more cost-efficient product, Clover is currently a money-losing insurance company.\n\"Terms like big data are good buzzwords to get you that better valuation when you're going to shop to VCs or growth equity funds,\" said Ari Gottlieb, director of health services and payer strategy at PwC. \"But at the end of the day, most established plans already use big d", "external_links": [], "published": "2017-12-26T02:00:00.000+02:00", "crawled": "2018-01-03T20:12:09.010+02:00", "highlightTitle": ""}