{"organizations": [], "uuid": "43ee0a358d0713e306a93180ccac2b36ca369e42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/donald-trump.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/donald-trump-korean-american-day-2018-pretty-lady/", "country": "US", "domain_rank": 1196, "title": "Commentary: Trump's Harmful Stereotyping of Korean Americans | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-17T02:00:00.000+02:00", "replies_count": 0, "uuid": "43ee0a358d0713e306a93180ccac2b36ca369e42"}, "author": "Jessica Lee", "url": "http://fortune.com/2018/01/17/donald-trump-korean-american-day-2018-pretty-lady/", "ord_in_thread": 0, "title": "Commentary: Trump's Harmful Stereotyping of Korean Americans | Fortune", "locations": [], "entities": {"persons": [{"name": "jessica lee january", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "u.s. house of representatives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jessica Lee January 17, 2018 \nThe recent story of President Donald Trump reportedly asking a Korean American intelligence officer where her “people” were from is all too familiar to me. As a Korean American woman working at a national organization of Korean American leaders, I feel compelled to point out how problematic and dangerous such remarks are. Unless our community tackles these comments questioning our Americanness head-on, we will continue to be subjected to such mischaracterizations. \nI started working in the U.S. House of Representatives when I was 24 years old. Working on a national security committee, I struggled to prove my worth in the eyes of my older, largely white colleagues. I brushed aside jokes about Asian women that made me feel uncomfortable and alone, fearing that openly confronting such comments would draw unwanted attention. I wanted to fit in and not let my appearance define my ability to do my job. \nOn most days, I actually felt that my Koreanness was a major advantage in my work. Because my job involved overseeing the U.S. government’s programs in the Asia-Pacific region, I frequently interacted with Asians in Washington and abroad. My fluency in Korean helped bridge the cultural gap that often existed in formal settings. Whether I was visiting an Indonesian women’s health clinic or meeting Lao Hmong refugees at risk of being repatriated to Laos, I was not offended to be mistaken for a local. When asked where I was from, I proudly explained that I am a citizen of a multi-ethnic country where your talent and passion dictate what you do, not your parents’ home country. \nBut many Americans still subscribe to the insidious myth that Korean Americans are somehow less American. Whatever his intention, Trump’s alleged words perpetuate the idea that no matter how long we’ve lived in the U.S., we will always “really” be from somewhere else. \nFor the nearly two million Korean Americans who vote, pay taxes, and love their country, such typecasting is a red flag that must be challenged. If the Korean American intelligence officer should work only on the North Korea issue, why don’t we expect the same standard for others? By that logic, Henry Kissinger should only have been consulted on matters affecting German Jews, Samantha Power should have only advised on Ireland-related issues, and Zbigniew Brzezinski should not have played an integral role in establishing diplomatic relations with China. Think of how much talent our national security apparatus would lose if we pigeonholed everyone based on their ethnicity. \nDespite our economic successes and high levels of educational attainment , Korean Americans still lack political power and visibility in the mainstream media. We are underrepresented in Congress and other visible leadership positions. We don’t have our own version of Congressman John Lewis, a storied figure with the courage and stature to stand up against racism directed toward people of Korean descent. That could change, but it will take time. Six Korean Americans are currently running for the House of Representatives. \nUntil we have strong voices to inform and shape public discourse, we will forever be painted in broad strokes by those who do not truly understand our lived experience. At a time when the U.S. military may be preparing for war with North Korea , Korean Americans must be especially vigilant about any characterizations that question our citizenship or allegiance. More than a century after the first Koreans set foot in Hawaii, we owe it to our intrepid ancestors to embrace our rich history and disabuse those who question our loyalty to our home. \nJessica Lee is the director of policy and advocacy of the Council of Korean Americans . She previously served on the House Foreign Affairs Committee and for a senior member of the Ways and Means Committee. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T02:00:00.000+02:00", "crawled": "2018-01-18T05:58:19.014+02:00", "highlightTitle": ""}