{"organizations": [], "uuid": "4df6bf34a066b505677b542db13674d52a4dfea5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 74, "shares": 74, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218853830&w=1200&r=LYNXMPEE010S4", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-handjani-iran-commentary/commentary-the-best-way-to-respond-to-iran-protests-idUSKBN1ER1FK", "country": "US", "domain_rank": 408, "title": "Commentary: The best way to respond to Iran protests", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-03T01:32:00.000+02:00", "replies_count": 0, "uuid": "4df6bf34a066b505677b542db13674d52a4dfea5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-handjani-iran-commentary/commentary-the-best-way-to-respond-to-iran-protests-idUSKBN1ER1FK", "ord_in_thread": 0, "title": "Commentary: The best way to respond to Iran protests", "locations": [], "entities": {"persons": [{"name": "hassan rouhani", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "lebanon", "sentiment": "none"}, {"name": "rasht", "sentiment": "none"}, {"name": "kermanshah", "sentiment": "none"}, {"name": "mashhad", "sentiment": "none"}, {"name": "qazvin", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "ahvaz", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Iran’s deadly wave of protests has taken the government and security forces by surprise.\nWhat started off in the holy city of Mashhad as demonstrations over unpaid wages and inflation quickly spread throughout the country, widening to include grievances about government mismanagement, corruption and Tehran’s involvement in Iraq, Lebanon and Syria. Unlike the mainly urban demonstrations that followed the contested 2009 election, these protests have spread to Ahvaz, Kermanshah, Rasht and Qazvin – all rural and relatively poorer cities.\nThe national groundswell means that the government must take these demonstrations seriously.\nHere are five points for policymakers to consider:\n1. Economics 101\nThe overarching theme of these protests seems to be Iran’s perpetually mismanaged economy. Inflation, unemployment, corruption and years of sanctions have led to a shadow financial system that often benefits elites and leaves the middle class and poor further behind every year. President Hassan Rouhani’s first campaign for the presidency in 2013 was framed in terms of getting a nuclear deal done and unshackling Iran’s economy from years of sanctions. Yet while sanctions certainly exacerbated long-standing structural problems of a mostly state-run economy, they were not the underlying cause of Iran’s woes.\nUnemployment today in Iran stands at 12 percent (youth unemployment is above 20 percent). Inflation since the 1979 revolution has fluctuated between 17 percent during the 1980s to a peak of 49 percent percent during the 1990s. In the early 2000s, under the stewardship of reformist President Mohammad Khatami, it was tamed at around 15 percent but then skyrocketed again under firebrand President Mahmoud Ahmadinejad to 30 percent – the latter occurring at a time when oil prices were at record highs and Iran’s currency had devalued by more than 450 percent .\nTo Rouhani's credit, his administration has had some success in taming inflation (it stands at closer to 10 percent today) and Iran’s economy has rebounded considerably since nuclear-related sanctions were lifted two years ago. The IMF recently forecast growth at 4.2 percent this year, after Iran’s economy grew at 7 percent last year. However, it is unclear who has benefited from this improvement. Those protesting have seen their purchasing power decrease as prices have risen and subsides were cut. Rouhani’s supporters argue that it will take time for the average Iranians to feel the benefits of sanctions relief and for the economy to stabilize; those protesting have lost hope that reforms can make their lives better in any meaningful way.\n2. The role of Iran’s regional policy\nOver the years, many protesters in Iran have chanted slogans against Iran’s activist foreign policy. The slogans amount to this: why is the government spending money on Iraq, Syria and Lebanon and not spending it on its own people?\nThis is a legitimate grievance, and the fact that it is now being expressed by poorer Iranians traditionally considered to be the regime’s base of support makes it particularly noteworthy.\nProtesters gather on the streets of Tehran, Iran December 30, 2017, in this picture obtained from social media. REUTERS. However, broad segments of Iranian society may not share the protesters’ opposition to Iran’s involvement in these countries. Islamic State and Wahhabi Islam, the state-sponsored religion of Saudi Arabia, are viewed as existential threats by many Iranians. They believe that it’s better to fight Sunni fundamentalism in Iraq and Syria rather than inside Iran’s borders. The attacks last summer by Islamic State on a religious shrine and parliament in Tehran drove this point home. Washington, Riyadh and Tel Aviv should not expect the protests to have an impact on Iran’s regional policies.\n3. Trump’s support doesn’t help the protesters\nDonald Trump has taken to Twitter to announce his support for the protesters. His words ring hollow. The fact remains that the U.S. president is deeply unpopular among Iranians, who view his administration as hostile to them, not just their government. His travel ban on Iranians has torn families apart and offended Americans who have Iranian relatives no longer able to visit them.\nTrump’s refusal to certify Iranian compliance with the nuclear deal (despite all evidence to the contrary), his attempts to discourage other countries from engaging Iran and his wholesale embrace of Saudi Arabia’s narrative blaming Tehran for all conflicts in the Middle East make him a strange bedfellow for Iran’s protesters.\nForeign interference in Iran’s internal affairs has left deep scars in the consciousness of the Iranian public for decades. The Trump administration should be mindful of exploiting the demonstrations and risk tainting the protesters as foreign agents, an easy tagline the regime uses to discredit dissidents.\n4. What will happen next?\nIt’s difficult to say at this nascent stage. The protests have been small and scattered. No indigenous leadership has been identified. Most Iranians have chosen to stay away for fear of reprisals – at least 14 people have died and hundreds have been arrested so far – or because they prefer to work within a political system they have lived under for 38 years to effect change rather than starting from scratch.\nIt is vital for President Rouhani to listen to the grievances of the demonstrators. He needs to deliver on his campaign promises of economic and social reforms. That means confronting elements of the deep state, nepotism and corruption. He can even utilize these protests to strengthen his mandate. Given the political upheaval and instability that has taken over the region since the Arab spring, it’s doubtful that most Iranians would prefer revolution to meaningful reform. What is certain is that they want their daily needs met and less government involvement in their personal lives.\n5. The fallout for Iranian politics\nDespite the portrayal of Iranian politics as a monolith by many Western analysts, it is highly factionalized with competing power centers and a myriad of special interests. Expect hard-line factions close to Ebrahim Raisi, Rouhani’s main rival in last year’s election, and the security services to blame President Rouhani for the protests. They will portray his government as having failed the urban poor and exaggerating the benefits of the nuclear deal. On the other side, expect Rouhani supporters to blame hard-line factions for blocking needed economic reforms and stifling the relaxation of Islamic dress code on women.\nBoth groups will aim to influence the Supreme Leader Ayatollah Khamenei, who will stay above the fray – at least in public. He will reprimand all sides for using the protests for political gain. He will blame outsiders, particularly those in the West for fomenting instability. In private, however, he should back Rouhani and give him the latitude to aggressively pursue his agenda. He should remind hardliners that time and demographics are not on their side as 60 percent of Iran’s population is under 30 . If the government’s only response is to contain the protests by force, more will follow.\nAbout the Author Amir Handjani is a Senior Fellow at the Atlantic Council and a Fellow with the Truman National Security Project @ahandjani\n ", "external_links": ["http://www.worldbank.org/en/country/iran/overview", "http://iranprimer.usip.org/resource/youth", "https://www.cnbc.com/2016/12/27/irans-rial-at-all-time-low-over-strong-dollar-other-woes.html", "https://www.statista.com/statistics/294320/iran-inflation-rate/", "https://twitter.com/realDonaldTrump/status/947810806430826496", "https://tradingeconomics.com/iran/inflation-cpi", "https://www.imf.org/en/News/Articles/2017/12/15/pr17499-imf-staff-completes-2017-article-iv-mission-to-islamic-republic-of-iran"], "published": "2018-01-03T01:32:00.000+02:00", "crawled": "2018-01-03T06:23:44.017+02:00", "highlightTitle": ""}