{"organizations": [], "uuid": "72d06a806d36884e2d41ace4ed532605c18d8349", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-j-alexanderas-holdings-inc-provides-update-on-ninety-nine-restaurants-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "J. Alexander’s Holdings, Inc. Provides Update on Ninety Nine Restaurants Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-13T01:36:00.000+02:00", "replies_count": 0, "uuid": "72d06a806d36884e2d41ace4ed532605c18d8349"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-j-alexanderas-holdings-inc-provides-update-on-ninety-nine-restaurants-full-year-2017-results.html", "ord_in_thread": 0, "title": "J. Alexander’s Holdings, Inc. Provides Update on Ninety Nine Restaurants Full Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Results In-Line with Expectations; Demonstrate Unique Position in Market\nNASHVILLE, Tenn.--(BUSINESS WIRE)-- J. Alexander’s Holdings, Inc. (NYSE:JAX) (“J. Alexander’s”) today provided an update on the full year 2017 results of Ninety Nine Restaurant & Pub (“99 Restaurants”), in connection with J. Alexander’s previously announced acquisition of 99 Restaurants.\n“These results are in-line with projections included in our proxy materials and underscore our deep conviction in pursuing the acquisition of 99 Restaurants,” said Lonnie J. Stout II, President and Chief Executive Officer. “Despite a challenging environment, Charlie and his team continue to demonstrate the unique value of the 99 Restaurant concept, which largely insulates it from the challenges faced by its competitors. We look forward to completing this accretive merger and capitalizing on the significant opportunities it provides to drive long-term, sustainable value for J. Alexander’s shareholders.”\nCannae Holdings, Inc. (NYSE: CNNE), the majority owner and operator of the 99 Restaurants, provided preliminary unaudited sales results for the fourth quarter and fiscal year ended December 31, 2017 relative to 99 Restaurants in a Form 8-K filing dated January 11, 2018. Based on these results, 99 Restaurants quarterly net revenue for 2017, compared to figures included in their projections for fiscal 2017, a summary of which was disclosed in the J. Alexander’s proxy statement filed with the Securities and Exchange Commission on December 21, 2017, was as set forth below:\n(Dollars in thousands) Q1 2017\nQ2 2017\nQ3 2017\nQ4 2017\nTotal\nActual Results for\n99 Restaurants $70,593 $72,679 $71,424 $96,504 $311,200 Included in Compiling Proxy Statement Disclosures/Projections\n$70,593 $72,679 $73,332 $96,517 $313,121 (Projected) (Projected) (Projected) The preliminary sales results are reported on the fiscal fourth quarter period from September 4, 2017 through December 31, 2017 (17 weeks) and the fiscal 2017 period from December 26, 2016 through December 31, 2017 (53 weeks). 99 Restaurants expects to report its full fourth quarter and fiscal 2017 results later in the first quarter of 2018. The fourth quarter of fiscal 2017 contained 17 weeks, or an additional week compared to the fourth quarter of fiscal 2016. 99 Restaurants estimates the impact of the additional week during both the fourth quarter and full fiscal year of 2017, which included six days of operations due to the closure of all restaurant locations on Christmas Day, totaled approximately $6.0 million. Both the fourth quarter and full year projections for fiscal 2017 included in compiling the proxy statement disclosures included the estimated impact of the additional week. For the full fiscal year, net revenue for 99 Restaurants for the 53 weeks ended December 31, 2017 totaled approximately $311.2 million, an increase of $7.2 million, or 2.4% compared to $304.0 million for the 52 weeks included in the fiscal year ended December 25, 2016.\nThe J. Alexander’s Board of Directors believes this transaction will create attractive value for, and is in the best interest of, all shareholders, for reasons including:\nThe transaction is expected to be accretive to J. Alexander’s earnings per share. The acquisition presents opportunities for synergies and management estimates that potential synergies could have an annual positive impact on pre-tax income of $1.5 million to $2.0 million. The combination with 99 Restaurants will help J. Alexander’s achieve more rapid growth and increase the scale of operations.\nJ. Alexander’s Board recommends that shareholders vote “ FOR ” this transaction on the WHITE proxy card. To learn more about the transaction, please visit www.jalexandersand99.com .\nAbout J. Alexander’s\nJ. Alexander’s Holdings, Inc. is a collection of boutique restaurants that focus on providing high quality food, outstanding professional service and an attractive ambiance. The company presently owns and operates the following concepts: J. Alexander’s, Redlands Grill, Stoney River Steakhouse and Grill and Lyndhurst Grill. J. Alexander’s Holdings, Inc. has its headquarters in Nashville, Tennessee. To learn more about J. Alexander’s, please visit www.jalexandersholdings.com .\nCAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS\nIn connection with the safe harbor established under the Private Securities Litigation Reform Act of 1995, J. Alexander’s Holdings, Inc. (the “Company,” “J. Alexander’s” or “JAX”) cautions that certain information contained or incorporated by reference in this document and its filings with the Securities and Exchange Commission (the “SEC”), in its press releases and in statements made by or with the approval of authorized personnel is forward-looking information that involves risks, uncertainties and other factors that could cause actual results to differ materially from those expressed or implied by the forward-looking statements contained herein. Forward-looking statements discuss the Company’s current expectations and projections relating to our financial condition, results of operations, plans, objectives, future performance and business. Forward-looking statements are typically identified by words or phrases such as “may,” “will,” “would,” “can,” “should,” “likely,” “anticipate,” “potential,” “estimate,” “pro forma,” “continue,” “expect,” “project,” “intend,” “seek,” “plan,” “believe,” “target,” “outlook,” “forecast,” the negatives thereof and other words and terms of similar meaning in connection with any discussion of the timing or nature of future operating or financial performance or other events. Forward-looking statements include all statements that do not relate solely to historical or current facts, including statements regarding the Company’s expectations, intentions or strategies and regarding the future. The Company disclaims any intent or obligation to update these forward-looking statements.\nImportant factors that could cause actual results to differ materially from those expressed or implied by the forward-looking statements include, among other things: the fact that certain directors and executive officers of the Company and 99 Restaurants, LLC (“99 Restaurants”) may have interests in the transactions that are different from, or in addition to, the interests of the Company’s shareholders generally; uncertainties as to whether the requisite approvals of the Company’s shareholders will be obtained; the risk of shareholder litigation in connection with the transactions and any related significant costs of defense, indemnification and liability; the possibility that competing offers will be made; the possibility that various closing conditions for the transactions may not be satisfied or waived; the occurrence of any event, change or other circumstances that could give rise to the termination of the merger agreement, including circumstances that may give rise to the payment of a termination fee by the Company; the effects of disruptions to respective business operations of the Company or 99 Restaurants resulting from the transactions, including the ability of the combined company to retain and hire key personnel and maintain relationships with suppliers and other business partners; the risk", "external_links": ["http://www.businesswire.com/news/home/20180112005702/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51742821&newsitemid=20180112005702&lan=en-US&anchor=www.sec.gov&index=3&md5=296917f333ed3cd2c4da138cf691369a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.jalexandersand99.com&esheet=51742821&newsitemid=20180112005702&lan=en-US&anchor=www.jalexandersand99.com&index=1&md5=d1ab1bf9add5b7b4fcc6b84c6111391a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.jalexandersholdings.com&esheet=51742821&newsitemid=20180112005702&lan=en-US&anchor=www.jalexandersholdings.com&index=2&md5=304e09140b24840e8c1ba343e550f84f"], "published": "2018-01-13T01:36:00.000+02:00", "crawled": "2018-01-13T02:07:34.033+02:00", "highlightTitle": ""}