{"organizations": [], "uuid": "fb4cee53efdfaad5f6677e15746b494ab5d8248f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/goldenglobes_thumb.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/08/ivanka-trump-golden-globes/", "country": "US", "domain_rank": 1196, "title": "Golden Globes, Gretchen Carlson, Ivanka Trump: Broadsheet Jan 8 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.573, "site_type": "news", "published": "2018-01-08T10:20:00.000+02:00", "replies_count": 0, "uuid": "fb4cee53efdfaad5f6677e15746b494ab5d8248f"}, "author": "Valentina Zarya", "url": "http://fortune.com/2018/01/08/ivanka-trump-golden-globes/", "ord_in_thread": 0, "title": "Golden Globes, Gretchen Carlson, Ivanka Trump: Broadsheet Jan 8 | Fortune", "locations": [], "entities": {"persons": [{"name": "valentina zarya", "sentiment": "negative"}, {"name": "ivanka trump", "sentiment": "negative"}, {"name": "gretchen carlson", "sentiment": "negative"}, {"name": "harvey weinstein", "sentiment": "none"}, {"name": "oprah", "sentiment": "none"}, {"name": "kristen", "sentiment": "none"}, {"name": "kevin spacey", "sentiment": "none"}, {"name": "meyers", "sentiment": "none"}, {"name": "cecil b. demille", "sentiment": "none"}, {"name": "oprah winfrey", "sentiment": "none"}, {"name": "seth meyers", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Valentina Zarya 8:20 AM EST \nGood morning, Broadsheet readers! Ivanka Trump may get sucked into the Russia investigation, a BBC editor calls out the network’s pay gap in a big way, and yes, the Golden Globes were all about #MeToo. Have a productive Monday. EVERYONE'S TALKING \n• The Oprah show. Host Seth Meyers’s opener at last night’s Golden Globes (“Good evening ladies and remaining gentlemen”) was a hint of what was to come. He made plenty of jabs throughout the night at Harvey Weinstein, Kevin Spacey, and other Hollywood heavy-hitters who have been accused of sexual harassment or assault. \nMeyers did an admirable job hosting, but Oprah Winfrey’s rousing remarks during her acceptance of the Cecil B. DeMille lifetime achievement award (she’s the first black woman ever to receive the award in its 66-year history) stole the show. “For too long women have not been heard or believed if they dared to speak their truth to the power of those men, but their time is up,” she said. \nOprah’s choice of words—”their time is up”—is not coincidental. In last week’s Broadsheets, Kristen wrote at length about Time’s Up, the anti-harassment campaign unveiled by some of Hollywood’s most powerful women. The associated legal fund has already reached its fundraising goal of $15 million, and last night’s awards show offered a glimpse into the kind of activism we may see from the coalition—backers include Reese Witherspoon, America Ferrera, Shonda Rhimes, and Eva Longoria—in the future. \nAs promised, many actresses wore black to protest sexual harassment in Hollywood . Some also brought activists as dates. Tarana Burke , the senior director of the nonprofit Girls for Gender Equity who founded the #MeToo movement over ten years ago, attended the show with Michelle Williams. \nThe evening was also a (literal) win for a female director and woman-led films and TV shows . Some highlights include: Lady Bird: The Greta Gerwig-directed film won best motion picture, musical or comedy. The Handmaid’s Tale: The show based on Margaret Atwood’s dystopian femininist novel won for best television series, drama. The Marvelous Mrs. Maisel : Created by Amy Sherman-Palladino, the show won for best television series, musical or comedy. Big Little Lies : The Nicole Kidman-produced show won for best television limited series or motion picture made for television. \nWhile there is still plenty to be done with regards to bringing attention to sexism and sexual abuse in Hollywood, last night seemed a bold marker of progress. To quote Oprah’s speech once more: “A new day is on the horizon.” ALSO IN THE HEADLINES \n• New year, same headlines. Four women have accused Paul Haggis , the filmmaker best know for his work on Million Dollar Baby and Crash, of sexual misconduct—including two rapes. Haggis denies the claims and is suing one of the accusers, claiming that she is an extortionist. Meanwhile, ESPN is distancing itself from former NFL Network analysts Donovan McNabb and Eric Davis in the wake of sexual misconduct allegations against the pair. Both men—who are former pro football players—were named in a lawsuit filed in October by former NFL Network wardrobe stylist Jami Cantor. \n• Ivanka under investigation? As Special Counsel Robert Mueller’s investigation into Russian meddling in last year’s election continues, it looks like Ivanka Trump will soon be part of the imbroglio. Mueller’s team is reportedly looking into an interaction between the first daughter and Russian lawyer Natalia Veselnitskaya during her father’s 2016 presidential campaign. Los Angeles Times \n• CES speaks. CES has issued a letter in response to the outcry over the lack of women delivering keynote speeches at the massive tech trade show, which kicks off today. The association that puts on the show says it will “redouble our efforts to expand women’s voices throughout the conference and as featured speakers” in 2019 and notes that it has added A+E Network’s Nancy Dubuc and 605’s Kristin Dolan to its “keynote stage.” For context, Dubuc and Dolan will appear on a panel—along with five men. CNET \n• Bowing out of the BBC . BBC China editor Carrie Gracie has resigned from her post over the broadcaster’s gender pay gap. In a letter posted on her website , Gracie accused it of a “secretive and illegal” salary system that pays men more than women. The editor says that when the BBC revealed top salaries as part of a legal settlement in July, she learned that the male international editors made at least 50% more money than the women in those roles (Gracie is one of those women). \nMOVERS AND SHAKERS: Libby Leffler Hoaglin has been promoted to Vice President, Membership at SoFi. IN CASE YOU MISSED IT \n• Well done, Waithe. Yesterday marked the premiere of The Chi, a new Showtime drama created by Lena Waithe, the first black woman to win an Emmy for comedy series writing. “My mission is to show these young black men are not born with a gun in their hand,” Waithe says about the series, which aims to portray the true complexity of her hometown, Chicago. It’s one of the VERY few shows on TV created by a woman of color. New York Times \n• Ice queens. Figure skaters Brandie Tennell, Mirai Nagasu, and Karen Chen are headed to the 2018 winter Olympics in South Korea. No American woman has won an Olympic skating medal since Sasha Cohen took silver at the 2006 Winter Games in Turin, Italy. New York Times \n• No suits on stage? Gretchen Carlson was just named chair of the Miss America Organization last week, but there’s already speculation that she will bring major changes to the pageant—including getting rid of the swimsuit competition. She will be taking a “very serious look” at the event, she told Judy Woodruff in a PBS News Hour interview Friday. PBS \n• Music history made. Music festival Coachella’s 2018 lineup features a record number of women: 33% of artists will be female, up from a past high of only 25%. What’s more, a woman of color (Beyonce) is headlining for the first time. Great news, but as R29 notes, “That it took the festival this long to meet that milestone is stupefying.” Refinery29 \n• Le Pen is le back. French nationalist Marine Le Pen is rebranding her National Front party—and changing its name. The far-right leader made it to the second round of France’s presidential elections in May, where she lost to Emmanuel Macron. ", "external_links": [], "published": "2018-01-08T10:20:00.000+02:00", "crawled": "2018-01-08T19:46:06.043+02:00", "highlightTitle": ""}