{"organizations": [], "uuid": "4c8b497894a5e53b5367b835ad4acdc5da71df46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/16/reuters-america-factbox-a-look-at-past-u-s-government-shutdowns.html", "country": "US", "domain_rank": 767, "title": "FACTBOX-A look at past U.S. government shutdowns", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:08:00.000+02:00", "replies_count": 0, "uuid": "4c8b497894a5e53b5367b835ad4acdc5da71df46"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/reuters-america-factbox-a-look-at-past-u-s-government-shutdowns.html", "ord_in_thread": 0, "title": "FACTBOX-A look at past U.S. government shutdowns", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "negative"}, {"name": "congressional research service", "sentiment": "none"}, {"name": "committee for a responsible federal budget", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 16 (Reuters) - Republicans who control the U.S. Congress are expected to try to pass a temporary spending bill before a Friday deadline, when existing federal funding is set to expire and federal agencies would begin to shut down.\nWhile past shutdowns have done little lasting economic damage, these events can hurt federal workers, rattle markets and shake confidence in the United States abroad.\nSince Congress implemented the modern budget process in the mid-1970s, there have been 18 gaps in government funding, according to the Congressional Research Service (CRS), but not all resulted in government shutdowns. In fact, only three of them had a significant impact.\nDuring six funding gaps before 1980, the government continued normal operations. There were nine funding gaps between 1981 and 1994, but they occurred over weekends with minimal government disruption, according to the Committee for a Responsible Federal Budget, a Washington think tank.\nHere are the three occasions when funding lapsed and significant government shutdowns occurred.\nNov. 14 to 18, 1995: This was the first of two government shutdowns that occurred after Democratic President Bill Clinton vetoed spending legislation passed by the Republican-controlled Congress. About 800,000 workers were furloughed from Nov. 15 to 19 during the first lapse in government funding, according to a CRS report.\nDec. 16, 1995 to Jan. 5, 1996: Clinton's continued clash with congressional Republicans over funding levels for the Medicare health insurance program for the elderly, education and other issues resulted in a second furlough of about 280,000 workers for 27 days beginning on Dec. 16, 1995, according to the CRS.\nOct. 1 to 16, 2013: During this standoff, about 800,000 federal workers were furloughed, and more than a million more reported to work without knowing when they would be paid, according to media reports. The shutdown occurred after conservative House of Representatives Republicans attempted to use the budget process to delay or defund implementation of Democratic President Barack Obama's Affordable Care Act, known as Obamacare.\nThe impasse between the House and the Democratic-controlled Senate, along with Obama, ended after both chambers passed a Senate-brokered bill that imposed stricter income verification requirements on people obtaining health insurance through Obamacare. The deal to end the shutdown coincided with a deadline to raise the U.S. debt ceiling, the country's borrowing limit.\n(Compiled by Amanda Becker; Additional reporting by Blake Brittain; Editing by Will Dunham)", "external_links": [], "published": "2018-01-17T00:08:00.000+02:00", "crawled": "2018-01-17T00:24:01.032+02:00", "highlightTitle": ""}