{"organizations": [], "uuid": "3eeeb6b4b1c2808a70de79aaed80b2ccd0cb6a0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-world-acceptance-corporation-reports-fiscal-2018-third-quarter-results.html", "country": "US", "domain_rank": 767, "title": "World Acceptance Corporation Reports Fiscal 2018 Third Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T15:30:00.000+02:00", "replies_count": 0, "uuid": "3eeeb6b4b1c2808a70de79aaed80b2ccd0cb6a0f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-world-acceptance-corporation-reports-fiscal-2018-third-quarter-results.html", "ord_in_thread": 0, "title": "World Acceptance Corporation Reports Fiscal 2018 Third Quarter Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "s.c.", "sentiment": "none"}, {"name": "greenville", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "world acceptance corporation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GREENVILLE, S.C.--(BUSINESS WIRE)-- World Acceptance Corporation (NASDAQ: WRLD) today reported financial results for its third fiscal quarter and nine months ended December 31, 2017.\nGross loans increased to $1.23 billion as of December 31, 2017, a 5.5% increase from the $1.17 billion of gross loans outstanding as of December 31, 2016. Gross loans in the US increased by 5.8%. Gross loans in Mexico increased 2.0% in US dollars. However, gross loans in Mexico decreased 3.1% in Mexican pesos. Our unique borrowers in the US increased by 49,480 or 6.3% during the third quarter of fiscal 2018. This is compared to an increase of 45,517 or 6.0% in the third quarter of fiscal 2017 and an increase of 27,545 or 3.5% in the third quarter of fiscal 2016.\nNet income for the third quarter decreased 82.6% to $1.7 million compared to $9.6 million for the same quarter of the prior year. Net income per diluted share decreased 82.9% to $0.19 in the third quarter of fiscal 2018 compared to $1.10 in the prior year quarter. The decreases in net income and net income per diluted share were primarily due to the write-down of our deferred tax asset (“DTA Write-Down”) as described below. Excluding the impact of the DTA Write-Down, net income for the third quarter increased 26.8% to $12.2 million compared to $9.6 million for the same quarter of the prior year. Excluding the DTA Write-Down, net income per diluted share increased 24.6% to $1.37 in the third quarter of fiscal 2018 compared to $1.10 in the prior year quarter.\nTotal revenues increased to $136.9 million for the third quarter of fiscal 2018, a 4.7% increase from the $130.8 million reported for the third quarter of fiscal 2017. Revenues from the 1,277 offices open throughout both quarterly periods increased by 3.9%. Interest and fee income increased 4.2%, from $118.3 million to $123.3 million in the third quarter of fiscal 2018 primarily due to an increase in average earning loans. Insurance and other income increased by 8.9% to $13.7 million in the third quarter of fiscal 2018 compared with $12.6 million in the third quarter of fiscal 2017. The increase was related to a $250,000 increase in insurance revenue and a $900,000 increase in other income compared with the third quarter of fiscal 2017. Other income increased $550,000 due to the receipt of interest in relation to the settlement of a state tax matter. Revenue from our motor club product also increased by $250,000 when comparing the third quarter of fiscal 2018 to the third quarter of fiscal 2017.\nAccounts in the US that were 61 days or more past due increased to 5.7% on a recency basis and to 7.3% on a contractual basis at December 31, 2017, compared to 5.4% and 7.0%, respectively, at December 31, 2016. On a consolidated basis, accounts that were 61 days or more past due increased to 6.6% on a recency basis and to 8.5% on a contractual basis at December 31, 2017, compared to 5.6% and 7.6%, respectively, at December 31, 2016. As a result of the higher delinquencies, our allowance for loan losses compared to net loans increased from 9.8% at December 31, 2016, to 10.9% at December 31, 2017.\nAs previously disclosed, the Company ceased all in-person collection visits at the end of fiscal 2016. Following the change in practice, in fiscal 2017 we experienced an increase in delinquencies and charge-offs. We have seen an improvement in net charge-offs during the first, second, and third quarters of fiscal 2018 compared to fiscal 2017. Consolidated net charge-offs as a percentage of average net loans on an annualized basis decreased from 16.9% to 15.5% when comparing third quarter of fiscal 2018 to the third quarter of fiscal 2017. However, the consolidated provision for the quarter increased by $3.8 million when comparing the third quarter of fiscal 2018 to the third quarter of fiscal 2017. This is primarily due to a $3.0 million adjustment to the provision in the prior year quarter as a result of improving credit metrics in the US during FY2017 and increasing delinquencies in Mexico. Consolidated net charge-offs were down $1.1 million when comparing third quarter of fiscal 2018 to the third quarter of fiscal 2017. The portion of the provision related to an increase in loans outstanding increased by $700,000 in the third quarter of fiscal 2018, as compared to the third quarter of fiscal 2017 due to gross loans outstanding increasing $81.7 million in the third quarter of fiscal 2018 versus $69.4 million in the third quarter of fiscal 2017. The US provision increased $2.9 million when comparing the third quarter of fiscal 2018 to the third quarter of fiscal 2017. The portion of the US provision related to an increase in loans outstanding increased $1.3 million current quarter over prior year quarter. There was also a $700,000 increase in the US provision due to a larger increase in accounts that became 90 days past due in the third quarter of fiscal 2018 compared to the third quarter of fiscal 2017. This was off-set by a decrease in net charge-offs of $2.1 million.\nGeneral and administrative (“G&A”) expenses amounted to $72.9 million in the third fiscal 2018 quarter, compared to $71.2 million in the same quarter of the prior fiscal year. As a percentage of revenues, G&A expenses decreased from 54.5% during the third quarter of fiscal 2017 to 53.2% during the third quarter of fiscal 2018. G&A expenses per average open office increased by 1.5 % when comparing the two fiscal quarters.\nPersonnel expense decreased $800,000 during the third quarter of fiscal 2018, as compared to the third quarter of fiscal 2017. Personnel expense in the US decreased by $2.7 million during the third quarter of fiscal 2018, as compared to the third quarter of fiscal 2017 primarily due to a decrease in share based compensation expense and a decrease in our health insurance expense.\nAdvertising expense decreased 4.0% or $350,000 relative to the same quarter last year.\nLegal and professional expense increased by $2.5 million primarily due to additional expense related to the previously disclosed investigation related to our operations in Mexico. We incurred $1.9 million in expense directly related to the investigation during the quarter. See “Other Matters” below for additional information regarding the investigation.\nInterest expense for the quarter ended December 31, 2017, decreased by $270,000, or 5.2% from the corresponding quarter of the previous year. The decrease in interest expense is due to an 8.5% decrease in the average debt outstanding, from $368.7 million to $337.5 million for the quarters ended December 31, 2016 and 2017, respectively. The Company’s debt to equity ratio decreased from 0.9:1 at December 31, 2016, to 0.8:1 at December 31, 2017.\nThe Tax Cuts and Jobs Act (“TCJA”) was enacted on December 22, 2017. U.S. accounting standards require the remeasurement of all U.S. deferred income tax assets and liabilities for temporary differences from the current corporate tax rate of 35 percent to the new corporate tax rate of 21 percent. The cumulative adjustment of $10.5 million was recognized in income tax expense from continuing operations as a discrete item in the current period, which includes the enactment date. The TCJA requires companies to pay a one-time transition tax on earnings of certain foreign subsidiaries that were previously tax deferred and creates new taxes on certain foreign-sourced earnings. As of January 26, 2018, we have not made sufficient progress on the earnings and profits analysis of our foreign subsidiaries to reasonably estimate the effects of the one-time transition tax and, therefore, have not recorded provisional amounts. We continued to apply ASC 740 based on the provisions of the tax laws that were in effect immediately prior to the TCJA being enacted. Because we had previously determined these amounts were indefinitely reinvested, no deferred taxes have been recorded.\nOther key return ratios for the third quarter included a 6.5% return on average assets and a return on average equity of 12.1% (both on a trailing 12-month basis).\nAt December 31, 2017, we had approximately 157,000 accounts and approximately $101.9 million in gross loans outstanding in Mexico. There were $99.9 million in gross loans in Mexico as of December 31, 2016. Annualized net charge-offs for Mexico as a percentage of average net loans increased from 10.9% for the third quarter of fiscal 2017 to 15.6% for the third quarter of fiscal 2018. Additionally, our Mexican 61+ day delinquencies were 16.3% and 21.7% on a recency and contractual basis, respectively, as of December 31, 2017, a change from 8.5% and 13.6%, respectively, as of December 31, 2016.\nNine-Month Results\nFor the first nine-months of fiscal 2018, net income decreased 41.2% to $24.5 million compared with $41.7 million for the nine-months ended December 31, 2016. Fully diluted net income per share decreased 41.9% to $2.76 in the first nine months of fiscal 2018 compared with $4.75 for the first nine-months of fiscal 2017.\nTotal revenues for the first nine-months of fiscal 2018 increased 2.5% to $396.8 million compared with $387.2 million during the corresponding period of the previous year. Annualized net charge-offs as a percent of average net loans decreased from 15.8% during the first nine-months of fiscal 2017 to 14.5% for the first nine-months of fiscal 2018.\nOther Matters\nAs previously disclosed, we are conducting an investigation of our operations in Mexico, focusing on the legality under the U.S. Foreign Corrupt Practices Act and certain local laws of certain payments related to loans, the maintenance of the Company’s books and records associated with such payments, and the treatment of compensation matters for certain employees. We promptly retained outside legal counsel and forensic accountants to lead the investigation upon receipt of an anonymous letter regarding compliance matters, and we have voluntarily contacted the U.S. Securities and Exchange Commission (“SEC”) and the U.S. Department of Justice (“DOJ”) to advise both agencies that an investigation is underway. We are committed to compliance with applicable laws and regulations, intend to cooperate fully with both the SEC and the DOJ, and are developing and executing a remediation plan to ensure compliance with applicable laws and regulations and to remediate the material weaknesses in our internal control over financial reporting.\nAs previously disclosed, on March 12, 2014, the Company received a Civil Investigative Demand (“CID”) from the Consumer Financial Protection Bureau (the “CFPB”). The stated purpose of the CID is to determine whether the Company has been or is “engaging in unlawful acts or practices in connection with the marketing, offering, or extension of credit in violation of Sections 1031 and 1036 of the Consumer Financial Protection Act, 12 U.S.C. §§ 5531, 5536, the Truth in Lending Act, 15 U.S.C. §§ 1601, et seq., Regulation Z, 12 C.F.R. pt. 1026, or any other Federal consumer financial law” and “also to determine whether Bureau action to obtain legal or equitable relief would be in the public interest.” The Company responded, within the deadlines specified in the CID, to broad requests for production of documents, answers to interrogatories and written reports related to loans made by the Company and numerous other aspects of the Company’s business. By letter dated January 18, 2018, the CFPB informed the Company that it had concluded its investigation and would not be proceeding with an enforcement action against the Company.\nNon-GAAP financial measures\nOn December 22, 2017, the TCJA was signed into law. The results of the third quarter of fiscal 2018 and first nine months of fiscal 2018 reflect the estimated impact of the enactment of the TCJA, which resulted in a $10.5 million decrease in net income. Net income and earnings per share excluding the impact of these significant items are non-GAAP financial measures. Management believes these measures help investors understand the effect of these items on reported results.\nAbout World Acceptance Corporation\nWorld Acceptance Corporation is one of the largest small-loan consumer finance companies, operating 1,334 offices in 15 states and Mexico.\nThird Quarter Conference Call\nThe senior management of World Acceptance Corporation will be discussing these results in its quarterly conference call to be held at 10:00 a.m. Eastern time today. A simulcast of the conference call will be available on the Internet at https://www.webcaster4.com/Webcast/Page/1118/24150 . The call will be available for replay on the Internet for approximately 30 days.\nThis press release may contain various “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, that represent the Company’s expectations or beliefs concerning future events. Statements other than those of historical fact, as well as those identified by the words “anticipate,” “estimate,” intend,” “plan,” “expect,” ”project,” “believe,” “may,” “will,” “should,” “would,” “could” and any variation of the foregoing and similar expressions are forward-looking statements. Such forward-looking statements are about matters that are inherently subject to risks and uncertainties. Factors that could cause actual results or performance to differ from the expectations expressed or implied in such forward-looking statements include the following: recently enacted, proposed or future legislation and the manner in which it is implemented, including the effects of the TCJA on the earnings of our foreign subsidiaries; the nature and scope of regulatory authority, particularly discretionary authority, that may be exercised by regulators, including, but not limited to, the SEC, DOJ, or the CFPB, having jurisdiction over the Company; the unpredictable nature of regulatory proceedings and litigation; any determinations, findings, claims or actions made or taken by the SEC, DOJ, or other regulators or third parties in connection with or resulting from the previously disclosed investigation of our operations in Mexico; uncertainties associated with management turnover and the effective succession of senior management; the impact of changes in accounting rules and regulations, or their interpretation or application, which could materially and adversely affect the Company’s reported financial statements or necessitate material delays or changes in the issuance of the Company’s audited financial statements; the Company's assessment of its internal control over financial reporting, and the timing and effectiveness of the Company's efforts to remediate any reported material weakness in its internal control over financial reporting; changes in interest rates; risks related to expansion and foreign operations; risks inherent in making loans, including repayment risks and value of collateral; the timing and amount of revenues that may be recognized by the Company; changes in current revenue and expense trends (including trends affecting delinquencies and charge-offs); the potential impact of limitations in the Company’s amended revolving credit facility; and changes in the Company’s markets and general changes in the economy (particularly in the markets served by the Company). These and other factors are discussed in greater detail in Part I, Item 1A, “Risk Factors” in the Company’s most recent annual report on Form 10-K for the fiscal year ended March 31, 2017 filed with the SEC and the Company’s other reports filed with, or furnished to, the SEC from time to time. World Acceptance Corporation does not undertake any obligation to update any forward-looking statements it makes. The Company is also not responsible for updating the information contained in this press release beyond the publication date, or for changes made to this document by wire services or Internet services.\nWorld Acceptance Corporation Consolidated Statements of Operations (unaudited and in thousands, except per share amounts) Three Months Ended Nine Months Ended December 31, December 31, 2017 2016 2017 2016 Interest & fees $ 123,259 118,257 357,292 349,282 Insurance & other 13,675 12,558 39,557 37,882 Total revenues 136,934 130,815 396,849 387,164 Expenses: Provision for loan losses 43,755 39,985 113,572 107,870 General and administrative expenses Personnel 41,623 42,395 130,804 124,792 Occupancy & equipment 10,998 10,517 32,586 31,650 Advertising 8,150 8,491 18,409 14,934 Intangible amortization 271 108 732 383 Other 11,844 9,725 34,181 25,882 72,886 71,236 216,712 197,641 Interest expense 5,001 5,274 14,038 16,380 Total expenses 121,642 116,495 344,322 321,891 Income before taxes 15,292 14,320 52,527 65,273 Income taxes 13,612 4,679 27,980 23,524 Net income $ 1,680 9,641 24,547 41,749 Diluted earnings per share $ 0.19 1.10 2.76 4.75 Diluted weighted average shares outstanding 8,938 8,783 8,887 8,786\nConsolidated Balance Sheets (unaudited and in thousands) December 31, March 31, December 31, 2017 2017 2016 ASSETS Cash $ 24,971 15,200 15,986 Gross loans receivable 1,229,304 1,059,804 1,165,009 Less: Unearned interest & fees (341,926 ) (291,908 ) (327,308 ) Allowance for loan losses (96,474 ) (72,195 ) (81,803 ) Loans receivable, net 790,904 695,701 755,898 Property and equipment, net 24,973 24,184 23,762 Deferred income taxes, net 36,326 39,025 43,612 Goodwill 7,035 6,067 6,067 Intangibles, net 6,792 6,614 2,588 Other assets, net 15,090 13,797 13,024 $ 906,091 800,588 860,937 LIABILITIES AND SHAREHOLDERS' EQUITY Liabilities: Notes payable 376,850 295,136 397,936 Income tax payable 5,403 12,519 10,984 Accounts payable and accrued expenses 34,897 31,869 30,027 Total liabilities 417,150 339,524 438,947 Shareholders' equity 488,941 461,064 421,990 $ 906,091 800,588 860,937\nSelected Consolidated Statistics (dollars in thousands) Three Months Ended Nine Months Ended December 31, December 31, 2017 2016 2017 2016 Expenses as a percent of total revenues: Provision for loan losses 32.0 % 30.6 % 28.6 % 27.9 % General and administrative expenses 53.2 % 54.5 % 54.6 % 51.0 % Interest expense 3.7 % 4.0 % 3.5 % 4.2 % Average gross loans receivable $ 1,180,035 $ 1,119,658 $ 1,131,578 $ 1,098,837 Average net loans receivable $ 850,634 $ 807,310 $ 815,761 $ 793,807 Loan volume $ 757,849 $ 724,320 $ 2,058,709 $ 1,990,196 Net charge-offs as percent of average loans 15.5 % 16.9 % 14.5 % 15.8 % Return on average assets (trailing 12 months) 6.5 % 8.4 % 6.5 % 8.4 % Return on average equity (trailing 12 months) 12.1 % 17.6 % 12.1 % 17.6 % Offices opened (closed) during the period, net 3 1 7 (16 ) Offices open at end of period 1,334 1,323 1,334 1,323\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005117/en/\nWorld Acceptance Corporation\nJohn L. Calmes Jr., 864-298-9800\nChief Financial Officer\nSource: World Acceptance Corporation", "external_links": ["http://www.businesswire.com/news/home/20180126005117/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.webcaster4.com%2FWebcast%2FPage%2F1118%2F24150&esheet=51749267&newsitemid=20180126005117&lan=en-US&anchor=https%3A%2F%2Fwww.webcaster4.com%2FWebcast%2FPage%2F1118%2F24150&index=1&md5=2e0fc7cca2598788f18fc6e03e28a593", "https://www.webcaster4.com/Webcast/Page/1118/24150"], "published": "2018-01-26T15:30:00.000+02:00", "crawled": "2018-01-26T17:58:25.019+02:00", "highlightTitle": ""}