{"organizations": [], "uuid": "3a31a9a57277fa499a9953e4bc8d8f37ae4e9a12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104923605-GettyImages-890488792.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/hoda-kotb-joins-savannah-guthrie-as-first-female-co-anchors-of-today.html", "country": "US", "domain_rank": 767, "title": "Hoda Kotb joins Savannah Guthrie as first female co-anchors of ‘TODAY’", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.729, "site_type": "news", "published": "2018-01-02T18:39:00.000+02:00", "replies_count": 0, "uuid": "3a31a9a57277fa499a9953e4bc8d8f37ae4e9a12"}, "author": "Ruth Umoh", "url": "https://www.cnbc.com/2018/01/02/hoda-kotb-joins-savannah-guthrie-as-first-female-co-anchors-of-today.html", "ord_in_thread": 0, "title": "Hoda Kotb joins Savannah Guthrie as first female co-anchors of ‘TODAY’", "locations": [], "entities": {"persons": [{"name": "nathan congleton", "sentiment": "negative"}, {"name": "hoda kotb", "sentiment": "negative"}, {"name": "savannah guthrie", "sentiment": "negative"}, {"name": "kotb", "sentiment": "none"}, {"name": "matt lauer", "sentiment": "none"}, {"name": "lack", "sentiment": "none"}, {"name": "guthrie", "sentiment": "none"}, {"name": "diane sawyer", "sentiment": "none"}, {"name": "robin roberts", "sentiment": "none"}, {"name": "andrew lack", "sentiment": "none"}], "locations": [], "organizations": [{"name": "nbcu", "sentiment": "negative"}, {"name": "abc news", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hoda Kotb made her official debut as a co-anchor for NBC's \"TODAY\" this Tuesday. Kotb, 53, sat alongside Savannah Guthrie, who has co-anchored the show since 2012, during the first two hours of the morning news show.\nThey are the first all-woman pair to anchor the NBC news program. However, they are not the first all-female morning show duo: ABC News' Diane Sawyer and Robin Roberts co-anchored from 2006-2009, according to Today.com.\nIn an email announcing Kotb's new role, NBC News Chairman Andrew Lack stated that Kotb has \"seamlessly stepped\" into the co-anchor position, which she filled temporarily after Matt Lauer was fired in November amid accusations of inappropriate sexual behavior.\n\"They have an undeniable connection with each other and most importantly, with viewers, a hallmark of TODAY,\" Lack said in a statement.\nOn Tuesday, Guthrie, 46, told viewers, \"This has to be the most popular decision that NBC News has ever made and I am so thrilled.\"\n\"I am pinching myself,\" Kotb, who said she was offered the role over the holidays, replied. She joked that someone should check on her mother who had likely fainted after hearing the news that she is now co-anchor.\nKotb joined \"TODAY\" in 2008 as a co-host of the show's fourth hour, a role that she will continue to fill, and has been a frequent substitute in the program's anchor chair for a number of years. She also hosts \"The Hoda Show on SiriusXM.\"\nIn an interview with People magazine , Guthrie relayed her excitement about co-anchoring with a woman and said that the two are \"grateful to NBC for not having some old-fashioned notion\" about what an anchoring team should look like\n\"I think they looked at it and said, 'Why would you change this? This is working, it feels good,'\" she said.\n\"When you click with someone, man, woman, it doesn't matter. If it works, it works,\" Kotb told the magazine. \"We're sort of like sisters.\"\nDuring Tuesday's early morning broadcast, Guthrie once again expressed her enthusiasm for working with Kotb. \"Hoda, you are a partner, and a friend, and a sister and I am so happy to be doing this,\" she said.\nKotb replied, \"There's no one I'd rather be sitting next to in 2018 than you.\"\nLike this story? Like CNBC Make It on Facebook\nSee also:\nBarack Obama: 2017 has been a tough year, but here's what to look forward to in 2018\n3 ways you should use your co-workers to help you succeed\nTop Google recruiter: You have to 'absolutely nail' this if you want to score your dream job\nshow chapters A 'work spouse' could be the secret to your success 12:22 PM ET Tue, 21 Nov 2017 | 00:59 Disclosure: NBC and CNBC are owned by Comcast's NBCUniversal unit.", "external_links": [], "published": "2018-01-02T18:39:00.000+02:00", "crawled": "2018-01-02T18:54:50.006+02:00", "highlightTitle": ""}