{"organizations": [], "uuid": "3e3157fd2b9ba308c443cb36176f7c79559cc367", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/13/104945039-GettyImages-903239842.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/13/if-irans-protests-made-the-country-more-moderate-it-could-reap-financial-reward--commentary.html", "country": "US", "domain_rank": 767, "title": "If Iran's protests made the country more moderate, it could reap financial reward - commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-14T05:46:00.000+02:00", "replies_count": 0, "uuid": "3e3157fd2b9ba308c443cb36176f7c79559cc367"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/13/if-irans-protests-made-the-country-more-moderate-it-could-reap-financial-reward--commentary.html", "ord_in_thread": 0, "title": "If Iran's protests made the country more moderate, it could reap financial reward - commentary", "locations": [], "entities": {"persons": [{"name": "ayatollah khamenei", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}], "organizations": [{"name": "iran revolutionary guard corps", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If Iran's protests made the country more moderate, it could reap financial reward Tony Nash and Jay Heisler Published 12 Hours Ago SHARES Ali Mohammadi | Bloomberg | Getty Images A briefcase filled with Iranian rial banknotes sits on display at a currency exchange market on Ferdowsi street in Tehran, Iran, on Saturday, Jan. 6, 2018. \nRecent weeks have seen a new wave of protests in Iran . Unlike the 2009 protests, which were largely carried out by educated urbanites, the current round of protests have included smaller towns and the middle class. \nThe regime claims to have quelled an uprising with each passing day, but history shows that such movements often mark the beginning of long-term change. \nFrom the outside, it's difficult to know exactly what's happening, aside from small reports and videos on social media. Do the protests have staying power? Will the police and elements of the Iran Revolutionary Guard Corps, the country's security and military organization, eventually side with the protestors? Are Iran's \"reformers,\" led by Ayatollah Khamenei, in danger of being displaced by a more moderate movement? All of these questions are fascinating, but very difficult for many westerners to answer. \nThere are plenty of domestic problems that will shape Iran if a more moderate regime comes to power. But Iran's external relationships — through economic engagement and diplomacy — will be a serious factor in the well-being of everyday Iranians and will determine the regional and global influence of a potentially new Iran. \nNo matter how sharp of a break from the current regime any newly moderate Iran takes, it would be difficult to make an accurate and detailed prediction at this point. \nThat said, here are some factors that are worth considering: The economy \nIran's economy is in a two-year slump. For 2017, GDP fell more than 4 percent while inflation hit 8 percent, according to forecasting firm Complete Intelligence. In 2018, the recession is projected to get worse, with GDP expected to fall 7 percent and inflation remaining above 5 percent. \nThe Iranian government isn't in a position to help much, either. After massive hikes in government spending in 2014 (124 percent) and revenue in 2015 (36 percent), both cratered in 2017 to declines of 15 percent and 2.2 percent, respectively. Consumer spending fell from 90 percent growth in 2014 (against 3 percent 2014 GDP growth) to a decline of 2 percent in 2017 (against 4.4 percent 2017 GDP decline). There will, however, likely be a small recovery in 2019. How current relationships could spur growth in a new regime \nWhile Iran is famously on the receiving end of American sanctions, the country maintains an excellent trade relationship with neighboring and globally prominent states. That includes enormous economic and military ties with China – with a whopping $42 billion of trade in 2016. There are also substantial military and diplomatic ties with Russia, a trade relationship valued at less than $2 billion, so the influence is more political than commercial. Iran has vibrant trade with nearby Turkey and India (worth $10 billion and $13 billion in 2016, respectively), and with global middle powers like South Korea and South Africa. The biggest surprise relationships for Iran may come from developed countries like Japan and Germany, with 2016 trade worth $4 billion and $3 billion, respectively. \nAs a result, it would be no stretch to envision an Iran that can cooperate to its own benefit with those countries and more. That is potentially true even with a continued worsening of relations with the United States. Despite all the bluster around sanctions, their importance as more than a tool to isolate Iran diplomatically can be measured mainly in preventing Iran from achieving its full economic potential. Sanctions are unlikely to spur economic collapse as is currently being seen in Venezuela. \nIn fact, a more open and moderate Iran may find greater appetite for oil and gas exports among U.S. allies like Japan, South Korea and Germany. Those relationships would find the U.S. and Iran competing for customers in global energy markets. \nChina, of course, will continue to support Iran, with or without the Ayatollahs. Since 2005, China has invested $12 billion in Iran's energy sector and nearly double that across all sectors, according to the China Global Investment Tracker from the American Enterprise Institute, a Washington-based think tank. \nNonetheless, the current protests are partially motivated by dissatisfaction with the economy. Given ample opportunity with major economies, Iran may soon have to finally provide an answer for its inability to sufficiently offset sanctions with relations elsewhere. The politics of those relationships \nIt is foreseeable that a severe crackdown on dissent in Iran could embarrass Germany, but even that is far from guaranteed. Bashar al-Assad's Syria managed to maintain trade ties to Europe well into the Syrian War. \nMeanwhile, no such qualms are likely to arise for Turkey, China or India. All famously face criticism for treatment of journalists and for police abuses and they are solidly positioned as independent countries carving their own path internationally. Other middle powers would likely follow suit. Even an individual spat with a neighbor like Turkey would likely be contained mostly between the two states. \nFinally, while Iran itself prefers to remain a fiercely independent regional power, its support from China and Russia is unlikely to waver. It is foreseeable that, were Iran to gradually change in one direction or another, the current regime could dig in deeper in its relations with Moscow and Beijing. \nSo, who is best placed for a new Iran? It's more of the same, really. \nChina, India, Turkey, Japan, and Germany seem to be in the best position, given both their current economic relationships and their global political influence. Russia, for its part, would likely lose influence in a more secular Iran. Given Russia's relatively weak economic ties and Iran's likely new diplomatic optionality, Russia may take a backseat to more economically vibrant and diplomatically powerful partners. That could be the opening the U.S. is looking for. \nTony Nash is the CEO and Chief Economist at data technology firm Complete Intelligence. Jay Heisler is a counter-terrorism analyst, writer and blogger who is a longtime staffer at Washington D.C.-based Young Professionals in Foreign Policy. \nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": ["http://www.twitter.com/CNBCopinion"], "published": "2018-01-14T05:46:00.000+02:00", "crawled": "2018-01-14T06:16:00.073+02:00", "highlightTitle": ""}