{"organizations": [], "uuid": "563a61f51b6b360596272d7fe4d17517ba84758d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-oil/oil-dips-as-dollar-halts-slide-short-term-demand-outlook-weakens-idUSL4N1PL14H", "country": "US", "domain_rank": 408, "title": "Oil dips as dollar halts slide, short-term demand outlook weakens", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.579, "site_type": "news", "published": "2018-01-26T09:16:00.000+02:00", "replies_count": 0, "uuid": "563a61f51b6b360596272d7fe4d17517ba84758d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-oil/oil-dips-as-dollar-halts-slide-short-term-demand-outlook-weakens-idUSL4N1PL14H", "ord_in_thread": 0, "title": "Oil dips as dollar halts slide, short-term demand outlook weakens", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar halts slide after falling to 3-year low\n* Demand outlook seasonally weakens at end of winter\n* Rising U.S. output undermines OPEC/Russia supply cuts\nBy Henning Gloystein\nSINGAPORE, Jan 26 (Reuters) - Oil prices fell on Friday as the U.S. dollar halted its slide and as crude market fundamentals are expected to weaken in the near future.\nBrent crude futures were at $70.11 per barrel at 0103 GMT, down 31 cents, or 0.4 percent, from their last close. Brent the previous day hit its highest since December, 2014 at $71.28.\nU.S. West Texas Intermediate (WTI) crude futures were at $65.24 a barrel, down 27 cents, or 0.4 percent from their last close. WTI also marked a December-2014 high the day before, at $66.66.\nTraders said prices received some support from a firmer dollar. The U.S. currency halted earlier slides on Thursday after U.S. President Donald Trump said he wanted a “strong dollar”. Earlier that day, the greenback had tumbled when U.S. Treasury Secretary Steven Mnuchin said he welcomed a weaker dollar.\nTraders often shift money between the dollar and crude futures, depending on their specific outlook. As oil is traded in dollars, swings in the greenback can also impact oil demand as it affects the price of fuel purchases for countries using other currencies domestically.\nBeyond currency markets, analysts said the short-term outlook for oil was slightly weaker.\n“Supply remains high ... for crude and we expect it to increase further. Our expectations are anchored at the potential improvement in productivity of U.S. oil rigs, increase in the nominal number of rigs in operation and a strong chance for other non-OPEC producers to ramp up exports,” said Georgi Slavov, head of research at commodities brokerage Marex Spectron.\nU.S. oil production C-OUT-T-EIA is edging ever more closely towards 10 million barrels per day (bpd), hitting 9.88 million bpd last week.\nOutput has grown by more than 17 percent since mid-2016, and is now on par with that of top exporter Saudi Arabia.\nOnly Russia produces more, averaging 10.98 million bpd in 2017.\nRising U.S. output is threatening to undermine efforts led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia to withhold supplies to tighten the market and prop up prices.\nThis supply restraint, coupled with healthy demand growth, has contributed to a near 60-percent rise in oil prices since mid-2017 as excess crude inventories around the world have gradually been drawn down.\nDespite the generally healthy outlook for oil demand, Slavov said there were short-term headwinds due to the upcoming end of the peak demand winter season in the northern hemisphere.\nMany petroleum refiners shut down after winter for maintenance, resulting in lower orders for crude, their most important feedstock.\n“Demand is starting to weaken as ... refining capacity was taken out of the market,” Slavov said.\nReporting by Henning Gloystein; Editing by Joseph Radford\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T09:16:00.000+02:00", "crawled": "2018-01-26T21:28:25.016+02:00", "highlightTitle": ""}