{"organizations": [], "uuid": "487d0b4c9815bff59ebac60fa26747459e2492e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/04/reuters-america-update-2-uber-ex-ceo-kalanick-selling-nearly-a-third-of-stake-for-1-point-4-bln-source.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-Uber ex-CEO Kalanick selling nearly a third of stake for $1.4 bln -source", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T05:58:00.000+02:00", "replies_count": 0, "uuid": "487d0b4c9815bff59ebac60fa26747459e2492e3"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/reuters-america-update-2-uber-ex-ceo-kalanick-selling-nearly-a-third-of-stake-for-1-point-4-bln-source.html", "ord_in_thread": 0, "title": "UPDATE 2-Uber ex-CEO Kalanick selling nearly a third of stake for $1.4 bln -source", "locations": [], "entities": {"persons": [{"name": "travis", "sentiment": "negative"}, {"name": "kalanick", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "reuters) - uber technologies inc", "sentiment": "neutral"}, {"name": "uber", "sentiment": "none"}, {"name": "softbank", "sentiment": "none"}, {"name": "softbank group corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "-source@ (Adds details on Kalanick's sale)\nJan 4 (Reuters) - Uber Technologies Inc co-founder Travis Kalanick, who was ousted as chief executive in June, is selling nearly a third of his 10 percent stake in the ride-services company for about $1.4 billion, a person familiar with the matter said on Thursday.\nKalanick's sale is part of a deal struck by a consortium led by SoftBank Group Corp which is taking a 17.5 percent stake in Uber, mostly by buying shares from early investors and employees. SoftBank last week secured agreements from shareholders who were willing to sell, and the deal will close early this year, Uber said.\nThe SoftBank deal values Uber at $48 billion, about a 30 percent discount from its most recent valuation of $68 billion. However, the investor consortium is also making a $1.25 billion investment of fresh funding at the older, higher valuation.\nKalanick had offered to sell half of his total shares, but because there was a limit on how much SoftBank will buy, he will sell just 29 percent, according to the source. Other investors also did not get to unload as many shares as they had hoped because of such widespread interest to sell.\nThe former CEO owns 10 percent of the company, which means his sale will unload 2.9 percent of Uber shares and earn him about $1.4 billion, the source added.\nA spokesman for Kalanick declined to comment. SoftBank and Uber could not be reached immediately for comment.\nThe sale would make the Uber co-founder a billionaire for the first time, not just on paper. Kalanick has never before sold shares of the company he ran for almost a decade, the source said.\nThe SoftBank deal offers investors and employees what could be their last chance to sell shares in a company-approved transaction before Uber's long awaited initial public offering, planned for 2019.\nThe transaction marks a victory for new CEO Dara Khosrowshahi, who helped broker the deal and who will benefit from a deep-pocketed investor like SoftBank.\nBloomberg first reported Kalanick's plans to sell part of his stake.\n(Reporting by Liana B. Baker and Heather Somerville in San Francisco; Additional reporting by Philip George in Bengaluru; Editing by Lisa Shumaker and Muralikumar Anantharaman)", "external_links": [], "published": "2018-01-05T05:58:00.000+02:00", "crawled": "2018-01-05T06:33:39.008+02:00", "highlightTitle": ""}