{"organizations": [], "uuid": "850d1e85d369bfbfc59331bfe458d549ea6e4eea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1220993828&w=1200&r=LYNXMPEE0A03T", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-women/serena-absence-gives-chance-for-a-new-superstar-to-emerge-idUKKBN1F006O", "country": "US", "domain_rank": 408, "title": "Serena absence gives chance for a new superstar to emerge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T04:04:00.000+02:00", "replies_count": 0, "uuid": "850d1e85d369bfbfc59331bfe458d549ea6e4eea"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-women/serena-absence-gives-chance-for-a-new-superstar-to-emerge-idUKKBN1F006O", "ord_in_thread": 0, "title": "Serena absence gives chance for a new superstar to emerge", "locations": [], "entities": {"persons": [{"name": "john o'brien", "sentiment": "negative"}, {"name": "serena", "sentiment": "negative"}, {"name": "williams", "sentiment": "none"}, {"name": "serena williams", "sentiment": "none"}, {"name": "venus williams", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 2:08 AM / Updated 7 hours ago Serena absence gives chance for a new superstar to emerge John O'Brien 5 Min Read \nSINGAPORE (Reuters) - Women’s tennis starts its 2018 campaign with the usual early focus on the Australian Open and a huge question mark over who can fill the yawning gap left by the absence of Serena Williams. FILE PHOTO: Tennis - Australian Open - Melbourne Park, Melbourne, Australia - 28/1/17 Serena Williams of the U.S. hits a shot during her Women's singles final match against Venus Williams of the U.S. .REUTERS/Thomas Peter/File Photo \nNo one was able to get anywhere close last year, not just in terms of consistently winning the biggest tournaments but also when it comes to charisma. \nWilliams left Melbourne a year ago with a 23rd grand slam title under her belt but soon hung up her racket for the remainder of 2017 upon discovering she was eight weeks pregnant at the time of her triumph. \nHer forced hiatus will extend past this year’s tournament after she decided last week that she was not fully match-ready, giving the chasing pack more opportunities to stamp their authority on the women’s game. \nBoris Becker, who knows a bit about both winning grand slams and star appeal, believes the landscape at the top of the women’s game is just too confused at the moment. \n“I think there is a real opportunity for the next superstar. It’s not clear cut,” he told Reuters. \n”(Simona) Halep is number one at the moment but we have four or five different girls. It’s just that there is no one dominating, but it’s up to them. \n“I could mention 10 names who could win the Australian Open, that’s good and that’s bad. I think the sport needs a strong rivalry because that’s good for fans. But the women’s game doesn’t have that at the moment.” \nThe remaining 2017 majors were shared by three rising stars of the game, with Latvian teen Jelena Ostapenko storming to the French Open title, Garbine Muguruza winning Wimbledon and Sloane Stephens returning from injury to lift the U.S. Open crown. \nThe world rankings saw three new names ascend to the top last season with big-serving Czech Karolina Pliskova’s two-month reign ended by Spain’s Muguruza in September, before Romania’s Halep took over to end the year in pole position. \nHowever, perhaps the most significant indicator of who could shine brightest in 2018 came in October when Caroline Wozniacki battled to a maiden WTA Finals title, displaying a new brand of ruthless tennis that suggested a first grand slam was imminent. \nThe Dane had lost six straight finals before winning the Pan Pacific Open in Tokyo a month earlier and she carried that momentum to Singapore before starting the season with a solid showing in Auckland to move up to second in the world rankings. \n“For me, the biggest thing was when I lost the first six finals of the year, I didn’t let it really put me down,” the 27-year-old said after her Singapore triumph. \n“I looked at the positive and said I put myself in contention almost every week and eventually it will have to turn.” \nAs Williams sits out a fourth straight grand slam, Halep and Pliskova will join Wozniacki in a quest for a major breakthrough in Australia. \nHalep is probably the best placed to claim the first grand slam of the season, the Romanian cementing her number one status with a Shenzhen Open triumph. \nMaria Sharapova, however, is the one player who can match Williams’ intensity and single-minded desire for success, not to mention her status as a drawcard. VICTIM \nThe Russian is lurking in the shadows as a major contender as she continues to rebuild her career after a 15-month doping ban after she tested positive for meldonium at the 2016 Australian Open. \nDespite irking her critics with a tendency to paint herself as a victim, the 30-year-old has been welcomed back with open arms by fans and tournament organisers alike. \nInjury and illness stalled her initial return to the circuit but a Tianjin Open win in October and run to the Shenzhen Open semi-finals suggests the five-time major winner is nearing her best and the 2008 champion will expect to go deep in Melbourne. \nOne former champion who will not be at Melbourne Park is Victoria Azarenka, whose protracted custody battle for her young son has prevented the Belarusian from playing since Wimbledon last July. \nWith Muguruza an injury doubt after withdrawing from her first two events of the year, Ukrainian Elina Svitolina, improving Frenchwoman Caroline Garcia and Julia Goerges of Germany will also attract backing after solid early form. \nBecker, though, has his eye on another of his compatriots, the 2016 Melbourne Park champion Angelique Kerber. \n”It’s so tough to predict,“ the German said. ”Kerber can come back, I think she had a good winter training camp and did well at the Hopman Cup. \n“She did it two years ago in Melbourne and that will give her belief. You can’t buy that feeling of how to win a slam.” Additional reporting by Martyn Herman; Editing by Peter Rutherford", "external_links": [], "published": "2018-01-11T04:04:00.000+02:00", "crawled": "2018-01-11T04:21:23.064+02:00", "highlightTitle": ""}