{"organizations": [], "uuid": "eeeedb98cc3e6d6b6895eb6ecef3e7db12cd1995", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219026844&w=1200&r=LYNXMPEE020J0", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-eu-markets-regulations/eu-watchdog-says-mifid-market-rules-off-to-smooth-start-idUKKBN1ES0RK", "country": "US", "domain_rank": 408, "title": "Markets take EU's new financial rules in their stride", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T14:54:00.000+02:00", "replies_count": 0, "uuid": "eeeedb98cc3e6d6b6895eb6ecef3e7db12cd1995"}, "author": "", "url": "https://uk.reuters.com/article/us-eu-markets-regulations/eu-watchdog-says-mifid-market-rules-off-to-smooth-start-idUKKBN1ES0RK", "ord_in_thread": 0, "title": "Markets take EU's new financial rules in their stride", "locations": [], "entities": {"persons": [{"name": "huw jones", "sentiment": "none"}, {"name": "alasdair", "sentiment": "none"}, {"name": "steven maijoor", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "esma", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european securities and markets authority", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 11:21 AM / Updated 41 minutes ago Markets take EU's new financial rules in their stride Huw Jones , Alasdair Pal 5 Min Read \nLONDON (Reuters) - The rollout of new rules on Wednesday that aim to make European Union financial markets safer and more transparent has been glitch-free so far, though disruptions cannot be ruled out, the EU’s markets watchdog said. FILE PHOTO: Steven Maijoor, Chair of the European Securities and Markets Authority, attends a policy dialogue during the Asian Financial Forum in Hong Kong, China January 18, 2016. REUTERS/Bobby Yip/File Photo \nThe new regime shines a spotlight on the inner workings of stock, bond, commodity and derivatives markets by forcing banks, asset managers and traders to provide detailed information on trillions of euros in transactions. \nBig banks spent an estimated $2 billion collectively last year to upgrade IT systems to prepare. \n“What we can see for our part, is no glitches so far,” Steven Maijoor, chairman of the European Securities and Markets Authority (ESMA), told reporters. \n“It will be the first time we have a complete overview of all financial instruments in the EU.” \nEuropean stock and bond volumes were light in early trading. \n“So far [there is] no difference compared to a regular day,” said Markus Huber, a trader at City of London Markets. \n“Volume isn’t expected to be massive or back to normal either due to not everybody being back from holidays, and not much going on in regard to major news or economic data.” \nFixed income volumes were lower at 1000 GMT compared with their average at that time over the previous 30 days, according to data provider Trax, a subsidiary of MarketAxess that tracks around 65 percent of all secondary market bond deals. \nSterling corporate bond volumes were 46 percent lower than their 30-day average, with euro sovereign bond volumes 24 percent lower and sterling sovereign bond volumes 11 percent lower. Euro corporate bond volumes were 2 percent higher, according to Trax. \nThe new rules, known as Markets in Financial Instruments Directive II (MiFID II), were delayed by a year to give banks, asset managers and exchanges more time to get ready. \nHarps Sidhu, head of capital markets at consultants KPMG, said it would become clearer by the end of the week if transaction reporting was working properly. \n“The key thing to realize is MiFID II isn’t done. People are at various stages of readiness, which I think everyone accepts,” Sidhu said. \nMarket nerves were eased by ESMA announcing measures just before Christmas to give companies more time to comply with some key requirements. \nRegulators have said they will not crack down on poor compliance initially, as long as market participants show they are doing everything they can to get up to speed. \nMaijoor said given the complexity and size of the reform, ESMA glitches could not be ruled out in coming days or weeks. BREXIT CLEARING \nRegulators in Britain and Germany intervened just hours before MiFID went live to give three clearing houses an exemption from having to give customers more choice over where to clear some of their derivative contracts. \nICE Futures Europe ( ICE.N ), London Metal Exchange ( 0388.HK ) and Eurex Clearing ( DB1Gn.DE ) were granted exemptions until July 2020 from opening themselves up to more competition. \nMaijoor said this would be a “one-off” waiver and the new requirements for clearing houses would come into effect in 2020. \nAlexandra Hachmeister, chief regulatory officer at Deutsche Boerse, said the waiver was needed for its Eurex arm because it was unclear how Britain’s financial market will look once the UK has left the EU in 2019. \n“That means that access provisions need to be thought about in an uncertain legal and regulatory environment,” Hachmeister told CNBC news channel. FROM DARK TO LIGHT \nOne of MiFID II’s main objectives is to shift trading in stocks, bonds and derivatives from private venues called “dark pools” to “lit” markets where everyone in the market can see the prices being offered. \nA trader at one of Europe’s largest inter-dealer brokers, which help investment banks trade with each other, said it had seen an increase in volumes on its public trading platforms on Wednesday as activity moved from dark pools. \n“On the trading side, it seems that the exchanges benefit at the expense of these off-exchange markets,” said Martin Van Vliet, a rates strategist at ING. \nThe rules also require that fund managers pay for research provided by investment analysts, a change that could lead to a fall in the number of reports that pour daily into professional investors’ inboxes. \nA fund manager at one of Europe’s largest asset managers said he had received around a third fewer research reports compared with Tuesday. Additional reporting by John O'Donnell and Tom Sims in Frankfurt, Gus Trompiz in Paris, Fanny Potkin, Simon Jessop and Tricia Wright in London,; editing by Jason Neely and Jane Merriman", "external_links": [], "published": "2018-01-03T14:54:00.000+02:00", "crawled": "2018-01-03T15:17:20.004+02:00", "highlightTitle": ""}