{"organizations": [], "uuid": "c0b677468f14de9cf83299678a4710735afad05b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/wmac-iphonex-crop.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/apple-iphone-x-sales/", "country": "US", "domain_rank": 1196, "title": "Apple iPhone X Sales Hard to Gauge, CIRP Data Shows | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.092, "site_type": "news", "published": "2018-01-22T12:36:00.000+02:00", "replies_count": 0, "uuid": "c0b677468f14de9cf83299678a4710735afad05b"}, "author": "Don Reisinger", "url": "http://fortune.com/2018/01/22/apple-iphone-x-sales/", "ord_in_thread": 0, "title": "Apple iPhone X Sales Hard to Gauge, CIRP Data Shows | Fortune", "locations": [], "entities": {"persons": [{"name": "don reisinger", "sentiment": "negative"}, {"name": "josh lowitz", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "fortune", "sentiment": "none"}, {"name": "cirp", "sentiment": "none"}, {"name": "consumer intelligence research partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Don Reisinger 10:36 AM EST \nWhen Apple unveiled the iPhone X last year, the company called it the “future of smartphones.” But its fourth-quarter performance doesn’t necessarily tell that tale. \nApple’s iPhone X accounted for 20% of all U.S. iPhone sales during the fourth quarter, Consumer Intelligence Research Partners said ( PDF ) on Monday. That was enough for the iPhone X to top the iPhone 8 Plus , which accounted for 17% of total iPhone sales during the period, but well behind the iPhone 8 , which tallied 20% of sales. \nOverall, the three newest iPhone models made up 61% of total iPhone sales. That was down significantly from the 72% share the iPhone 7 and iPhone 7 Plus accounted for in 2016 when they hit store shelves. \nAt first blush, then, the iPhone X might not seem like a breakout hit . The iPhone 7 Plus in 2016, for instance, earned more than 30% iPhone market share in its first quarter on store shelves. But CIRP partner Josh Lowitz said the iPhone X is altogether different than earlier releases. \nGet Data Sheet , Fortune’s technology newsletter \n“Comparisons to earlier launches are tricky at best,” Lowitz said in a statement. “First, iPhone X wasn’t available for the full quarter. The Apple model pie is further divided, as they now offer eight models, the most ever. And, Apple launched the new phones on a different schedule, announcing three new models at once, but delaying the launch of the most advanced and expensive one, iPhone X, for five weeks following the launch of iPhone 8 and 8 Plus.” \nWhile Apple announced the iPhone X alongside the iPhone 8 and iPhone 8 Plus in September, the $1,000 handset didn’t actually reach store shelves until November. That gave the iPhone 8 and iPhone 8 Plus nearly two months of time on store shelves before the iPhone X was released. Apple kept a similar September release schedule with other previous iPhones. The fact that the iPhone X was able to reach 20% share in just a couple of months, therefore, suggests it was a reasonable success. \nFor its part, Apple hasn’t commented on iPhone X sales and how they compare to iPhone 8 or iPhone 8 Plus sales. But the company will hold an earnings call next month that could shed some light on exactly how well its iPhone is performing. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-22T12:36:00.000+02:00", "crawled": "2018-01-22T19:46:36.046+02:00", "highlightTitle": ""}