{"organizations": [], "uuid": "3e3626287f59bde2f8baaef0f9c51e6b89c0b2b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2017/12/31/the-associated-press-anticipation-high-as-california-rolls-out-retail-pot-sales.html", "country": "US", "domain_rank": 767, "title": "Anticipation high as California rolls out retail pot sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-31T19:17:00.000+02:00", "replies_count": 0, "uuid": "3e3626287f59bde2f8baaef0f9c51e6b89c0b2b2"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2017/12/31/the-associated-press-anticipation-high-as-california-rolls-out-retail-pot-sales.html", "ord_in_thread": 0, "title": "Anticipation high as California rolls out retail pot sales", "locations": [], "entities": {"persons": [{"name": "khalil moutawakkil", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "shasta lake", "sentiment": "none"}, {"name": "santa cruz", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (AP) — Californians may awake on New Year's Day to a stronger-than-normal whiff of marijuana as America's cannabis king lights up to celebrate the state's first legal retail pot sales.\nThe historic day comes more than two decades after California paved the way for legal weed by passing the nation's first medical marijuana law, though other states were quicker to allow the drug's recreational use.\nFrom the small town of Shasta Lake just south of Oregon to San Diego on the Mexican border, the first of about 90 shops licensed by the state will open Monday to customers who previously needed a medical reason or a dope dealer to score pot.\nIn November 2016, California voters legalized recreational marijuana for adults 21 and older, making it legal to grow six plants and possess an ounce of pot. The state was given a year to set retail market regulations that are still being formalized and will be phased in over the next year.\n\"We're thrilled,\" said Khalil Moutawakkil, founder of KindPeoples, which grows, manufactures and sells weed in Santa Cruz. \"We can talk about the good, the bad and the ugly of the specific regulations, but at the end of the day it's a giant step forward, and we'll have to work out the kinks as we go.\"\nThe long, strange trip to get here has been a frustrating one for advocates of a drug that in the federal government's eyes remains illegal and in a class with heroin.\nThe state banned \"loco-weed\" in 1913, according to a history by the National Organization for the Reform of Marijuana Laws, the pot advocacy group known as NORML. The first attempt to undo that by voter initiative in 1972 failed, but three years later felony possession of less than an ounce was downgraded to a misdemeanor.\nIn 1996, over objections of law enforcement, the drug czar under President Bill Clinton and three former presidents who warned it was an enormous threat to the public health of \"all Americans,\" California voters approved marijuana for medicinal purposes.\nWhile the rollout of grassroots collectives of growers and dispensaries where marijuana could be sold to patients was at times messy, the law led to wider acceptance of the drug as medicine.\n\"The heavens didn't fall,\" said Dale Gieringer, director of California NORML. \"We didn't see increased youth drug abuse or increased accidents or crazy things happening as our opponents predicted.\"\nToday, 28 other states have adopted similar laws. In 2012, Colorado and Washington became the first states to legalize recreational marijuana. California is one of five states, plus Washington, D.C., that followed suit. Retail sales are scheduled to begin in Massachusetts in July.\nWith wider acceptance, the aroma of marijuana smoke has become more pervasive in parts of California, and use accelerated after the legalization vote.\nEven with other states as models for what works and what can go wrong as marijuana strains known as Sweet Skunk, Trainwreck and Russian Assassin hit the street, the next year is expected to be a bumpy one as more shops open and more stringent regulations take effect.\nAlex Traverso, a spokesman for the state's Bureau of Cannabis Control, said Sunday that the agency has been working throughout the weekend to process as many licenses as possible. He says licenses will also be issued on New Year's Day. The agency so far has issued more than 300 licenses statewide for marijuana distributors, retailers and cultivators, he said.\nThe California Police Chiefs Association, which opposed the ballot measure, remains concerned about stoned drivers, the appeal the drug will have for young people as it becomes more normalized, and the cost of policing the new rules in addition to an existing black market.\n\"There's going to be a public health cost and a public safety cost enforcing these new laws and regulations,\" said Jonathan Feldman, a legislative advocate for the chiefs. \"It remains to be seen if this can balance itself out.\"\nFor consumers, the most surprising revelation may be the dearth of places to get ganja. In theory, buying a joint, loose weed or a hash brownie should be as easy as finding a craft beer, but options are few as some cities have rejected retail sales and others have taken a more mellow approach toward licensing operations.\nPot-friendly San Francisco, a counter-culture hub where marijuana smoke has been a fixture for half a century, was late to establish local regulations and won't have any retail outlets open for business until later in the week. It's a similar situation in Los Angeles.\nMeantime, Fresno, Riverside, Anaheim, Bakersfield and all of surrounding Kern County have prohibited pot shops, and Long Beach has a temporary ban.\nFor shop owners lucky enough to receive temporary licenses from the state and clear local red tape, anticipation is high.\nWill Senn, founder of Urbn Leaf in San Diego, said the shop's four phone lines have been ringing off the hook for three months, but he's not sure what to expect when doors open at 7 a.m. with extra security and more than 60 employees at the ready for sales and deliveries.\n\"We're preparing for the worst and hoping for the best,\" Senn said. \"We never want lines out the door and around the block. That's not what we're trying to accomplish here.\"\nShops at first will be able to sell marijuana harvested without the regulatory controls that eventually will require extensive testing for potency, pesticides and other contaminants. A program to track all pot from seed to sales also will be phased in, along with other protections such as child-proof containers for pot products.\nPot shop founder Jamie Garzot said she's concerned that when the current crop dries up, she'll encounter a shortage of marijuana that meets state regulations. The irony is that her 530 Cannabis shop in Shasta Lake is close to some of California's most productive growing areas, yet most of the surrounding counties won't allow cultivation that could supply her.\n\"Playing in the gray market is not an option,\" Garzot said. \"California produces more cannabis than any state in the nation, but going forward, if it's not from a state-licensed source, I can't put it on my shelf. If I choose to do so, I run the risk of losing my license.\"\nIn 2016, the state produced an estimated 13.5 million pounds of pot, and 80 percent was illegally shipped out of state, according to a report prepared for the state by ERA Economics, an environmental and agricultural consulting firm. Of the remaining 20 percent, only a quarter was sold legally for medicinal purposes.\nThat robust black market is expected to continue to thrive, particularly as taxes and fees raise the cost of retail pot by as much as 70 percent.\nMatt Brancale, 47, a marijuana user since the 1980s and a connoisseur of the plant's flowery buds, said he welcomes regulations that will bring a higher-quality product because of required testing. But he fears the price could spike once the government takes its share, and worries that revenue will be misspent.\n\"I also don't want to get taxed to the teeth on it,\" he said. \"Are they going to try to squeeze every last ounce of tax revenue out of it? I assume they will. There's people that are drooling in Sacramento with the potential resource money.\"\nFollow AP's complete coverage of marijuana legalization in California here: https://apnews.com/tag/CaliforniaMarijuana", "external_links": [], "published": "2017-12-31T19:17:00.000+02:00", "crawled": "2018-01-01T08:01:08.046+02:00", "highlightTitle": ""}