{"organizations": [], "uuid": "82ee7027dcbd4f312d425fb51d16052047f5462a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-baird-appoints-john-taft-vice-chairman.html", "country": "US", "domain_rank": 767, "title": "Baird Appoints John Taft Vice Chairman", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.187, "site_type": "news", "published": "2018-01-29T17:18:00.000+02:00", "replies_count": 0, "uuid": "82ee7027dcbd4f312d425fb51d16052047f5462a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-baird-appoints-john-taft-vice-chairman.html", "ord_in_thread": 0, "title": "Baird Appoints John Taft Vice Chairman", "locations": [], "entities": {"persons": [{"name": "baird appoints john taft", "sentiment": "negative"}, {"name": "baird", "sentiment": "negative"}, {"name": "john taft", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "taft", "sentiment": "none"}], "locations": [{"name": "milwaukee", "sentiment": "none"}], "organizations": [{"name": "securities industry and financial markets association", "sentiment": "none"}, {"name": "baird's private wealth management", "sentiment": "none"}, {"name": "rbc wealth management", "sentiment": "none"}, {"name": "executive committee", "sentiment": "none"}, {"name": "deloitte & touche", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILWAUKEE, Jan. 29, 2018 /PRNewswire/ -- Baird , an international, employee-owned wealth management, capital markets, private equity and asset management firm, announced today that it has named John Taft Vice Chairman and a member of its Executive Committee. Taft, who has more than 35 years of industry experience, will pursue strategic business opportunities across Baird's platform, focusing his attention initially on collaborating with Baird's Private Wealth Management leadership team to advance key priorities.\nTaft served as CEO of RBC Wealth Management, a full-service brokerage firm with nearly 2,000 financial advisors and over $280 billion in assets, for more than 10 years (2005-2016). He is a past chairman of the Securities Industry and Financial Markets Association (SIFMA), where he advocated for responsible financial reform. Most recently, he served in a consulting capacity for Deloitte & Touche.\n\"John is very highly regarded for his industry knowledge and leadership, his tremendous record of success and his ability to make the deep personal connections that are so important in this business,\" said Steve Booth, Baird President and Chief Executive Officer. \"He will be a wonderful addition to Baird's senior leadership team and we could not be more proud that he has chosen to continue his exemplary career at Baird.\"\n\"Baird embodies all the things I have cared about throughout my career: a client-focused culture; great people; ethical business practices; and a long history of quality and excellence,\" Taft said. \"Baird's independence, employee ownership, diversified business mix and tremendous momentum uniquely position the firm for strong growth. There really is no other firm like Baird in America today, and I am incredibly excited to be a part of it.\"\nPaul E. Purcell, Chairman of Baird, noted, \"I've known John for many years and have long admired him as a visionary leader. Importantly, he has used his considerable influence to bring about change that has made our industry better.\"\nPurcell added, \"We are humbled that John was drawn to Baird's privately held, employee-owned business model and strong culture, which continues to help us attract top talent across the business.\" He noted that Baird continues to make strategic investments to expand its capabilities for clients. Earlier this month, Strategas , an independent private partnership focused on macro research, became a wholly-owned Baird company. In recent years, Baird has also broadened its global and international equity offerings through the acquisition of Chautauqua Capital Management , a global investment manager. And, it continues to add veteran financial advisors and teams to its Private Wealth Management business, which now encompasses approximately 860 advisors through 93 locations in 30 states and has client assets of $126 billion.\nTaft is a frequent public speaker and media contributor, and has authored two books, \"Stewardship: Lessons Learned from the Lost Culture of Wall Street\" and \"A Force for Good: How Enlightened Finance Can Restore Faith in Capitalism.\"\nTaft's other past roles include president and CEO of Voyageur Asset Management; president and CEO of Dougherty Summit Securities; a member of the board of directors of Segall Bryant & Hamill, The Clifton Group and Columbia Threadneedle Funds; and a managing director at Piper, Jaffray & Hopwood.\n\"John is a renowned and innovative industry leader,\" said Mike Schroeder, President of Baird's Private Wealth Management group. \"We are excited to add his strategic vision and experience to the Baird team as we continue to grow and evolve our Private Wealth Management business to best serve our clients' needs.\"\nDeeply committed to community involvement, inclusion and diversity and many other important issues, Taft credits his family, including his great grandfather, 27 th U.S. President William Howard Taft, for instilling strong core values that shape his definition of business success and belief in the importance of treating all people with dignity.\nAdditional Taft Biographical Information\nTaft graduated magna cum laude, Phi Beta Kappa with a Bachelor of Arts degree from Yale University, and earned a master's degree in public and private management from the Yale School of Organization and Management. As a member of the board of directors and as a volunteer, Taft has served a wide range of not-for-profit and public service organizations. Currently he is an active member of the Itasca Project, and serves on the boards of The Minneapolis Foundation and The Andy Warhol Foundation for the Visual Arts.\nAbout Baird\nBaird is an employee-owned, international wealth management, capital markets, private equity and asset management firm with offices in the United States, Europe and Asia. Established in 1919, Baird has more than 3,400 associates serving the needs of individual, corporate, institutional and municipal clients. Baird has $171 billion in client assets. Committed to being a great place to work, Baird ranked No. 4 on FORTUNE's 100 Best Companies to Work For in 2017 – its 14 th consecutive year on the list. Baird is the marketing name of Baird Financial Group. Baird's principal operating subsidiaries are Robert W. Baird & Co. Incorporated in the United States and Robert W. Baird Group Ltd. in Europe. Baird also has an operating subsidiary in Asia supporting Baird's investment banking and private equity operations. For more information, please visit Baird's Web site at www.rwbaird.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/baird-appoints-john-taft-vice-chairman-300589467.html\nSOURCE Baird", "external_links": ["http://www.rwbaird.com/news/Baird-Announces-Strategic-Investment-in-Strategas", "http://www.rwbaird.com/news/baird-closes-on-acquisition-of-global-asset-manager-chautauqua-capital-management", "http://www.rwbaird.com/", "http://www.prnewswire.com/news-releases/baird-appoints-john-taft-vice-chairman-300589467.html"], "published": "2018-01-29T17:18:00.000+02:00", "crawled": "2018-01-29T19:37:24.017+02:00", "highlightTitle": ""}