{"organizations": [], "uuid": "bafb99c1be6ea9e638f6c3e65d7e0585f51983ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/11", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-cox-enterprises-promotes-robert-woodard-to-vice-president-cox-talent-acquisition.html", "country": "US", "domain_rank": 767, "title": "Cox Enterprises Promotes Robert Woodard to Vice President, Cox Talent Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T21:00:00.000+02:00", "replies_count": 0, "uuid": "bafb99c1be6ea9e638f6c3e65d7e0585f51983ce"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-cox-enterprises-promotes-robert-woodard-to-vice-president-cox-talent-acquisition.html", "ord_in_thread": 0, "title": "Cox Enterprises Promotes Robert Woodard to Vice President, Cox Talent Acquisition", "locations": [], "entities": {"persons": [{"name": "robert woodard", "sentiment": "negative"}, {"name": "jill campbell", "sentiment": "none"}, {"name": "woodard", "sentiment": "none"}, {"name": "robert", "sentiment": "none"}, {"name": "campbell", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cox talent acquisition atlanta", "sentiment": "negative"}, {"name": "cox enterprises", "sentiment": "negative"}, {"name": "cox talent acqu", "sentiment": "none"}, {"name": "cox talent acquisition", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 25, 2018 /PRNewswire/ -- Cox Enterprises has named Robert Woodard to the position of vice president of Cox Talent Acquisition, effective March 12. He reports to Jill Campbell, executive vice president.\nWoodard will lead a team of more than 150 talent acquisition specialists and oversee the company's talent acquisition strategy and organization, which recruits on behalf of all Cox Enterprises businesses — broadband communications, automotive services and media. His team is responsible for recruiting technology and marketing programs as well as promoting Cox as a great place to work through social media, recruiting events and conferences. He will continue to improve recruiting centers of excellence and leverage his deep knowledge of Cox's businesses, industries and people to ensure the right skillsets are in place as Cox Enterprises continues to grow and diversify.\n\"Robert is a proven Cox leader, with over 15 years of experience,\" said Campbell. \"He understands that our values and employees are what sets Cox apart. I am confident in his ability to lead our Cox Talent Acquisition team and know that he and Cox will thrive in his new role.\"\nBefore Cox, Woodard worked for Verizon Wireless, formerly GTE Mobilnet, in Illinois, Texas, Florida, Georgia and North Carolina. He started as a collections agent and worked his way up through the ranks to director of the Great Lakes Region, where he managed three collections call centers for Verizon Wireless.\nWoodard earned a master's degree in business administration from Auburn University and is a graduate of East Carolina University. He is a graduate of The Dartmouth College — Tuck School of Business/SCTE Leadership Development Program; The Harvard Business School — Executive Development Program; and the University of Georgia, Terry College of Business — Cox Executive Development Program.\nAbout Cox Enterprises:\nCox Enterprises is a leading communications, media and automotive services company. With revenues exceeding $21 billion and approximately 60,000 employees, the company's major operating subsidiaries include Cox Communications (cable television distribution, high-speed internet access, telephone, home security and automation, commercial telecommunications and advertising solutions); Cox Automotive (automotive-related auctions, financial services, media and software solutions); and Cox Media Group (television and radio stations, digital media, newspapers and advertising sales rep firms).\nThe company's major national brands include Autotrader, Kelley Blue Book and Manheim. Through Cox Automotive, the company's international operations stretch across Asia, Australia, Europe and Latin America. To learn more about Cox's commitment to people, sustainability and our communities, please visit www.CoxCSRReport.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/cox-enterprises-promotes-robert-woodard-to-vice-president-cox-talent-acquisition-300588331.html\nSOURCE Cox Enterprises", "external_links": ["http://www.prnewswire.com/news-releases/cox-enterprises-promotes-robert-woodard-to-vice-president-cox-talent-acquisition-300588331.html", "http://www.coxcsrreport.com/"], "published": "2018-01-25T21:00:00.000+02:00", "crawled": "2018-01-26T02:02:15.014+02:00", "highlightTitle": ""}