{"organizations": [], "uuid": "3605e77f233d99aa04c8de4e55db60f518957d8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-regains-footing-after-recent-drop-despite-murky-outlook-idUSL4N1PI4J0", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar regains footing after recent drop, despite murky outlook", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T20:36:00.000+02:00", "replies_count": 0, "uuid": "3605e77f233d99aa04c8de4e55db60f518957d8b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-regains-footing-after-recent-drop-despite-murky-outlook-idUSL4N1PI4J0", "ord_in_thread": 0, "title": "FOREX-Dollar regains footing after recent drop, despite murky outlook", "locations": [], "entities": {"persons": [{"name": "kuroda", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "saikat chatterjee", "sentiment": "none"}, {"name": "nick d‘onofrio", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "boj", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "north asset management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Sterling standout performer in early trading\n* Yen weakens after BOJ’s Kuroda comments\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Saikat Chatterjee\nLONDON, Jan 23 (Reuters) - The dollar edged higher as some investors decided that its recent three-year low may mark a turning point amid growing concern over the U.S. stance on global trade.\nInvestors also pointed to widening interest rate differentials between U.S. and European and British bond markets, which are supporting the dollar’s short-term outlook.\n“We are a bit more constructive about the dollar’s outlook,” Nick D‘Onofrio, chief executive with London-based hedge fund North Asset Management, said on Tuesday.\nTen year yields adjusted for inflation between the U.S. and Europe are near a six month-high of 1.3 percent, while the euro is holding near a two-year high against the dollar.\nU.S. President Donald Trump’s imposition of import tariffs on washing machines and solar panels has left a cloud over global trade at a time when its revival has fuelled hopes for a stronger world economy.\nTrump is slated to give the closing address at this year’s Davos summit of political and business leaders on Friday, and some analysts expect him to strike a protectionist tone.\n“If Trump decides to strike a strong anti-trade stance, it will spark a selloff in global trade-oriented currencies such as the Korean won and the Chinese yuan and eventually weigh on the U.S. dollar as well,” said Viraj Patel, an FX strategist at ING.\nBlackRock strategists said in a recent note that the global economy has never been so integrated at this point of an expansion, with world trade making up about 50 percent of global gross domestic product -- much more than in the last cycle.\nThe dollar rose 0.1 percent to 90.51 against a basket of rivals, not far off last week’s three-year low of 90.11.\nCAUTION, EURO BULLS The euro fell against the dollar, down 0.2 percent at $1.2236 after hitting a two-year high of $1.2323 last Wednesday.\nThe euro has rallied this year, strengthened by growing optimism that a strengthening economy would prompt the ECB to signal a quicker exit from its years of policy stimulus than previously forecast, although some investors advised caution.\nMike Bell, a global markets strategist at JP Morgan Asset Management said markets may have got a bit ahead of themselves by pricing about a 40 percent chance of a rate rise this year and he does not expect the ECB to raise rates in 2018.\nBut the Japanese yen headed back towards the day’s highs against the U.S. dollar near 110.40 after BoJ Governor Haruhiko Kuroda reiterated his commitment to monetary easing .\n“Today’s price action talks more about how the market is preoccupied with the idea that the BOJ will adjust its monetary policy at some stage in the future,” Minori Uchida, chief FX analyst at the Bank of Tokyo-Mitsubishi UFJ, said.\nRelatively high-yielding currencies such as the Australian and Canadian dollars fell the most against the greenback, by 0.7 percent and 0.3 percent each.\nThe British pound stood out in early trading, holding its own against the euro after reaching a post-Brexit high of $1.40 in early Asian trading.\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets\nReporting by Saikat Chatterjee; Additional reporting by Hideyuki Sano in TOKYO; editing by Alexander Smith\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T20:36:00.000+02:00", "crawled": "2018-01-23T20:47:02.015+02:00", "highlightTitle": ""}