{"organizations": [], "uuid": "48fb3f32b8279ae40057320a5a26e1cbf766e125", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221471399&w=1200&r=LYNXMPEE0B116", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/uk-britain-markets-sterling/sterling-surges-after-report-spain-netherlands-open-to-softer-brexit-idUSKBN1F11PQ", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Sterling surges after report Spain, Netherlands open to softer Brexit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T16:36:00.000+02:00", "replies_count": 0, "uuid": "48fb3f32b8279ae40057320a5a26e1cbf766e125"}, "author": "", "url": "https://www.reuters.com/article/uk-britain-markets-sterling/sterling-surges-after-report-spain-netherlands-open-to-softer-brexit-idUSKBN1F11PQ", "ord_in_thread": 0, "title": "UPDATE 1-Sterling surges after report Spain, Netherlands open to softer Brexit", "locations": [], "entities": {"persons": [{"name": "jemima kelly", "sentiment": "none"}, {"name": "brexit tommy wilkes", "sentiment": "none"}, {"name": "neil jones", "sentiment": "none"}], "locations": [{"name": "netherlands", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "mizuho", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 2:14 PM / in an hour Sterling soars to highest level since Brexit vote Tommy Wilkes , Jemima Kelly 4 Min Read \nLONDON (Reuters) - Sterling on Friday rocketed to its highest level against the dollar since the vote to leave the European Union, after a report that the Netherlands and Spain were open to a deal for Britain to remain as close as possible to the trading bloc. \nThe pound traded up more than one percent on the day, pushing to as high as $1.37 GBP=D3 and in the process hitting its highest level since June 24, 2016, when the pound plunged after Britain voted to quit the EU. \nThe gains came after Bloomberg reported that the Spanish and Dutch finance ministers had agreed to work together for a Brexit agreement that maintains close ties between the EU and Britain, in what would be a clear divergence in views among the 27 EU member states about how to treat Britain after it leaves. \nOfficials from the Spanish and Dutch finance ministries denied the report and said there was no new agreement between the countries on how Britain should leave the EU. \nSterling was already gaining on Friday before the report, helped by demand for euros and the continued weakness for the dollar, before spiking higher. The pound held on to most of those gains. \n“I would suggest this [sterling’s jump] is purely because of news that the Dutch and Spanish are open to a softer Brexit,” Neil Jones, Mizuho’s head of hedge fund currency sales in London. \n“It’s not so significant as the rally would suggest. Just because two of the 27 members say this, it doesn’t mean a softer Brexit will happen. I doubt it’s as straightforward as that,” he said. \nAfter slumping in 2016, the pound last year had its best performance in a decade as Britain made some progress on negotiating its exit from the European Union and economic data came in better than expected. \nSome traders expect Britain to secure a transition deal to leave the bloc soon, which could help lift sterling higher. Others said the pound would struggle to maintain Friday’s gains without more positive news. \nAgainst the euro, which has rallied since minutes from the European Central Bank on Thursday pointed to tighter monetary policy in the euro zone, sterling was up 0.3 percent at 88.64 pence per euro EURGBP=D3. \nThe FTSE 100 .FTSE briefly fell into negative territory and touched its session low before rebounding and closing higher. \nTwo-year gilt yields GB2YT=RR rose more than 5 basis points on the day to peak at 0.615 percent, their highest level since Jan. 4, 2016. Five-year gilt yields GB5YT=RR rose more than 6 basis points on the day to 0.885 percent, matching the post-Brexit vote high of 0.885 percent set on Oct. 25. \nNomura currency strategist Jordan Rochester said the move higher for sterling was driven by a “big algo move”, referring to an algorithmic trade, while he also played down attaching too much importance to the Bloomberg report. \n“I‘m sceptical this (report) is necessarily a game-changer at this stage as there will also be member states pushing the other way,” he said. Reporting by Jemima Kelly and Tommy Wilkes, additional reporting by Julien Ponthus and David Milliken, editing by Larry King", "external_links": [], "published": "2018-01-12T16:36:00.000+02:00", "crawled": "2018-01-12T17:03:51.008+02:00", "highlightTitle": ""}