{"organizations": [], "uuid": "3095a0446600eabe5f5366c197cdf4890593c993", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219689350&w=1200&r=LYNXMPEE0416W", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-fski-williams/freestyle-skiing-williams-hoping-for-last-chance-at-olympics-yet-heart-remains-in-backcountry-idUKKBN1EU1Y5", "country": "US", "domain_rank": 408, "title": "Freestyle Skiing - Williams hoping for last chance at Olympics, yet heart remains in backcountry", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T22:55:00.000+02:00", "replies_count": 0, "uuid": "3095a0446600eabe5f5366c197cdf4890593c993"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-fski-williams/freestyle-skiing-williams-hoping-for-last-chance-at-olympics-yet-heart-remains-in-backcountry-idUKKBN1EU1Y5", "ord_in_thread": 0, "title": "Freestyle Skiing - Williams hoping for last chance at Olympics, yet heart remains in backcountry", "locations": [], "entities": {"persons": [{"name": "williams", "sentiment": "negative"}, {"name": "nas", "sentiment": "none"}, {"name": "mcrae williams", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "park city", "sentiment": "none"}, {"name": "tignes", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "u.s. olympic committee media summit", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 9:00 PM / Updated 13 minutes ago Freestyle Skiing - Williams hoping for last chance at Olympics, yet heart remains in backcountry Jack Tarrant 3 Min Read \nLONDON (Reuters) - While many athletes dream of competing at successive Winter Olympics, American freestyle skier McRae Williams knows that at the age of 27, next month’s Games in Pyeongchang could be his first and last shot at Olympic glory. Freestyle skier McRae Williams poses for a portrait at the U.S. Olympic Committee Media Summit in Park City, Utah, U.S. September 26, 2017. He listens to Nas and Mob Deep while training. REUTERS/Mike Blake \nIn a sport where even teenagers can dominate, Williams’ breakout year did not come until he was 24 when he won the men’s ski slopestyle competition at the 2013 X Games in Tignes, France. \nSince then, he has added two podium finishes and appears to have peaked at just the right time heading into an Olympic season. \nThe previous Winter Games in Sochi came too early in Williams’ blossoming career. But whether he is successful or not in getting to South Korea, the Utah resident says he has already achieved everything he ever dreamed of growing up by competing and winning medals at the X Games. \nSpeaking at Team USA’s training camp in Austria, Williams did say, however, that he was determined to make the most of what may be his only opportunity of adding an Olympic medal to his collection. \n“I didn’t make it in 2014 so it is a big deal and I am 27 so this might be my last shot at it so I am going to give it my all,” said Williams whilst relaxing on a slack line outside the team’s hotel. \nHe added: “At 27 I am getting nervous. I am getting older and seeing the end of my career a little bit and starting to think about what is next and I can’t imagine doing anything else. I have been doing this for so long.” Freestyle Skiing - FIS Snowboarding and Freestyle Skiing World Championships - Men's Slopestyle final - Sierra Nevada, Spain - 19/03/17 - Mcrae Williams of the US in action. REUTERS/Albert Gea \nWilliams, who resides in Salt Lake City - the venue of the 2002 Winter Games - insists that he will be happy as long as he performs to his maximum capability. \nHe also plans to showcase a new trick, details of which he refused to disclose. \n“If it is something you have been working hard at and you have a particular trick you have been working on for a slopestyle run or in Big Air or whatever, just to land that under the pressure is an achievement in itself, personally,” he said. \n“Obviously winning feels good too but, if you ski your best and have a good time out there then that is a win for everybody.” \nPyeongchang may be the pinnacle for Williams in his career, yet even though he cast doubt on being involved in the next Games scheduled to take place in Beijing in 2022, he will not be shelving his skis anytime soon. \nWilliams will be found with his friends, shredding powder in the Utah backcountry. \n“I will probably end up going back to school one of these days and doing the real life thing,” said Williams. “But I am going to live this out as long as I can.” \nThere remain two U.S. qualifying events this month for Williams to either collect enough ranking points or impress the judges sufficiently to book his place in South Korea. Reporting by Jack Tarrant; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-05T22:55:00.000+02:00", "crawled": "2018-01-05T23:20:17.024+02:00", "highlightTitle": ""}