{"organizations": [], "uuid": "6f59e9e65f48d354f6b5f311848321f1b10fbc97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226035018&w=1200&r=LYNXMPEE0R0JQ", "site_section": "http://feeds.reuters.com/reuters/UKEntertainment/", "section_title": "Reuters: Entertainment News", "url": "https://uk.reuters.com/article/us-awards-grammys/metoo-gun-violence-despacito-make-for-potent-grammys-brew-idUKKBN1FH0LH", "country": "US", "domain_rank": 408, "title": "#MeToo, gun violence, 'Despacito' make for potent Grammys brew", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T19:22:00.000+02:00", "replies_count": 0, "uuid": "6f59e9e65f48d354f6b5f311848321f1b10fbc97"}, "author": "", "url": "https://uk.reuters.com/article/us-awards-grammys/metoo-gun-violence-despacito-make-for-potent-grammys-brew-idUKKBN1FH0LH", "ord_in_thread": 0, "title": "#MeToo, gun violence, 'Despacito' make for potent Grammys brew", "locations": [], "entities": {"persons": [{"name": "cyndi lauper", "sentiment": "none"}, {"name": "kesha", "sentiment": "none"}, {"name": "pink", "sentiment": "none"}, {"name": "cardi", "sentiment": "none"}, {"name": "neil portnow", "sentiment": "none"}, {"name": "miley cyrus", "sentiment": "none"}, {"name": "jill serjeant", "sentiment": "none"}, {"name": "sam smith", "sentiment": "none"}, {"name": "julia michaels", "sentiment": "none"}, {"name": "elton john", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "recording academy", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 2:22 PM / Updated an hour ago #MeToo, gun violence, 'Despacito' make for potent Grammys brew Jill Serjeant 3 Min Read \nNEW YORK (Reuters) - Lady Gaga, U2, Cardi B, Pink, Miley Cyrus, Sting, Elton John and Sam Smith are just a few of the artists due to perform at the Grammy Awards on Sunday in a 60th anniversary celebration of music across the board. \nBut like many of the major U.S. award shows this year, entertainment and trophies won’t be the only matters on the minds of performers. \nArtists are expected to wear white roses as a symbol of solidarity with victims of sexual harassment as the #MeToo movement spreads from Hollywood to the music industry. \n“You’ll hear individual comments from artist who are there. That’s really what it’s about and we welcome that,” said Recording Academy president Neil Portnow. \nKesha, a best pop vocal album nominee who has been battling her former record producer Dr.Luke for years in U.S. courts over allegations of emotional and sexual abuse, is expected to perform her emotional single “Praying” with Cyndi Lauper, Julia Michaels and a full choir. \nDr. Luke has repeatedly denied Kesha’s allegations. \n“i‘m so proud and nervous and overwhelmed to be performing it at the grammys on sunday, and if you need it i hope this song finds you,” Kesha tweeted on Saturday. An advertisement for the upcoming 60th Annual Grammy Awards is displayed on the side of Madison Square Garden in Manhattan in New York City, U.S., January 25, 2018. REUTERS/Lucas Jackson \nGrammy nominees Alessia Cara, Khalid and Logic will take the stage with a group of suicide survivors to perform their song “1-800-273-8255,” the telephone number of the National Suicide Prevention hotline. \nAnd country artists Brothers Osborne, Eric Church and Maren Morris, who appeared at the Las Vegas country music festival where 51 people and more than 500 were wounded last October, will mark the victims of gun violence and extremist attacks at music events. \nRapper Jay-Z goes into Sunday’s awards show with a leading eight nominations, mostly from his soul-baring “4:44” album. Slideshow (6 Images) \nHe faces Kendrick Lamar, Bruno Mars, Childish Gambino and New Zealand-born singer-songwriter Lorde to see whether hip-hop can break a 14-year dry spell and win the top prize of album of the year. \nMars, Jay-Z, Lamar and Gambino are also nominated for record of the year, but so too is Latin dance hit “Despacito” by Luis Fonsi, Daddy Yankee and featuring Justin Bieber. The single last summer broke records as the most-streamed global track of all time, with more than 4.6 billion plays across leading platforms. Related Coverage Key nominations for the 2018 Grammy Awards \nRoss Scarano, vice president of content at Billboard magazine, gave “Despacito” the edge. \n“It appealed to a lot of people. It also speaks to the more global sound of pop this year, the emphasis on Latin music,” Scarano told Reuters. \nThe Grammy Awards will be broadcast live on CBS television in a ceremony hosted by James Corden from New York City starting at 7:30 pm ET. Additional reporting by Alicia Powell; Editing by Susan Thomas", "external_links": [], "published": "2018-01-28T19:22:00.000+02:00", "crawled": "2018-01-28T19:48:25.008+02:00", "highlightTitle": ""}