{"organizations": [], "uuid": "e6b204fdd5820ea3cf0376af6f9093b6c0b8da56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/28/104865005-GettyImages-869494750-pelosi-schumer.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/democrats-criticize-trumps-economy-claims-in-state-of-the-union.html", "country": "US", "domain_rank": 767, "title": "Democrats criticize Trump's economy claims in State of the Union", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-31T17:50:00.000+02:00", "replies_count": 0, "uuid": "e6b204fdd5820ea3cf0376af6f9093b6c0b8da56"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/31/democrats-criticize-trumps-economy-claims-in-state-of-the-union.html", "ord_in_thread": 0, "title": "Democrats criticize Trump's economy claims in State of the Union", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "democratic", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In his first State of the Union address, President Donald Trump hammered home that the economy shows his success in office. Roaring stock markets, steady jobs growth and the GOP tax law all featured prominently in his speech to Congress.\n\"There has never been a better time to start living the American dream,\" Trump said.\nAfter the speech, Democrats struck a different tone, arguing that Trump inherited a strong economy and has not done enough to help American workers. The responses from Democratic lawmakers signal how they could counter Trump should he and the GOP use the economy as their main pitch to voters in the 2018 midterms and beyond.\nRepublicans will partly count on a healthy economy to help them overcome Trump's dismal approval ratings during the elections this year. The GOP is trying to hold on to majorities in both the House and Senate as Democrats see an opportunity to gain ground amid anti-Trump sentiment.\nIn his speech, Trump tied strong economic indicators to his policies. He took credit for 2.4 million jobs created since the election, although the 2.1 million added during his first year in office represented the slowest pace in six years, according to NBC News .\nTrump highlighted a record low unemployment rate among black and Hispanic-Americans, parts of a yearslong downward trend. He also claimed \"tremendous\" relief for middle class Americans under the new GOP tax law.\nGetty Images U.S. Rep Steny Hoyer, D-Md., and U.S. House Minority Leader Nancy Pelosi, D-Calif., watch during the State of the Union address in the chamber of the U.S. House of Representatives January 30, 2018 in Washington, DC. During the speech, Democrats were stoic as Trump ran through what he deemed his economic accomplishments. After it, they aimed to poke holes in his narrative, and previewed the rebuttals they could give if Trump and GOP lawmakers tout the economy on the campaign trail in 2018 and 2020.\nAfter Trump cited the unemployment rate among black Americans, television cameras cut to members of the Congressional Black Caucus, a group consisting mostly of Democrats. Most of the lawmakers stared stone-faced and did not clap.\nFollowing the address, Sen. Kamala Harris — a California Democrat and member of that caucus — said the reaction was due to Trump taking credit for a trend that started well before he took office.\n\"Probably because we all know that the way that he should have made that statement is at the end of that statement, he should have said, 'Thank you, President Obama,'\" the senator and potential 2020 presidential candidate told CNN on Tuesday night.\nEarlier in the day, Senate Minority Leader Chuck Schumer , D-N.Y., urged Trump to say, \"Thanks, Obama\" during his address.\nOther Democrats argued that Trump's policies have not helped the working and middle class as much as he claims. They particularly cited the GOP tax changes, and the fact that the law makes massive corporate tax cuts permanent and individual reductions only temporary.\nDemocrats also argued that Trump has overplayed stock records because ownership of most shares is concentrated among wealthy individuals.\n\"We see an economy that makes stocks soar, investor portfolios bulge and corporate profits climb, but fails to give workers their fair share of the reward,\" said Rep. Joe Kennedy III, D-Mass., in Tuesday night's official Democratic response to Trump's address.\nOn Wednesday morning, House Minority Whip Steny Hoyer, D-Md., contended that Democrats would take \"a lot\" of seats in November, partly driven by the party's economic messaging.\n\"That's what we're gonna be focused on — making sure that Americans, particularly working Americans who we don't think were very advantaged by this tax bill — that working Americans have better jobs and a better future,\" he told CNBC's \" Squawk Box .\"\nGOP lawmakers see improving public perception of the tax changes as essential to electoral success in November. Public opinion of the law was dismal when it passed, but Republicans hope voters will warm to it when they see increases in their paychecks as soon as next month.\nThe Koch brothers' Republican advocacy network plans to spend up to $400 million on campaign contributions and policy initiatives ahead of the midterms, CNBC reported Saturday . That includes $20 million put to selling the benefits of the tax bill to voters.\nThe president and congressional Republicans have also promoted announcements from many major corporations that they will give one-time bonuses, increase investment in the U.S. or raise wages. Even some Republicans who backed the tax bill have expressed cynicism about the corporate reaction.\nSen. Bob Corker, R-Tenn., recently told CNBC that there may be \"a little coordinated effort taking place\" to promote what the law has done.\nWATCH: Here are the most memorable reactions to Trump's State of the Union address show chapters Here are the most memorable reactions to Trump’s State of the Union address 4 Hours Ago | 01:43", "external_links": [], "published": "2018-01-31T17:50:00.000+02:00", "crawled": "2018-01-31T17:50:37.005+02:00", "highlightTitle": ""}