{"organizations": [], "uuid": "011495718f61c9ad744b8419ec19aa34c9f47663", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-jernigan-capital-inc-announces-commencement-of-public-offering-of-series-b-cumulative-redeemable-perpetual-preferred-stock.html", "country": "US", "domain_rank": 767, "title": "Jernigan Capital, Inc. Announces Commencement of Public Offering of Series B Cumulative Redeemable Perpetual Preferred Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.151, "site_type": "news", "published": "2018-01-18T16:43:00.000+02:00", "replies_count": 0, "uuid": "011495718f61c9ad744b8419ec19aa34c9f47663"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-jernigan-capital-inc-announces-commencement-of-public-offering-of-series-b-cumulative-redeemable-perpetual-preferred-stock.html", "ord_in_thread": 0, "title": "Jernigan Capital, Inc. Announces Commencement of Public Offering of Series B Cumulative Redeemable Perpetual Preferred Stock", "locations": [], "entities": {"persons": [{"name": "b. riley", "sentiment": "none"}], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "memphis", "sentiment": "none"}, {"name": "fl", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "jernigan capital, inc", "sentiment": "neutral"}, {"name": "jernigan capital, inc.", "sentiment": "neutral"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "raymond james & associates, inc.", "sentiment": "none"}, {"name": "msa", "sentiment": "none"}, {"name": "morgan stanley & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MEMPHIS, Tenn.--(BUSINESS WIRE)-- Jernigan Capital, Inc. (NYSE: JCAP) (the \"Company\") today announced that it has commenced an underwritten public offering of its newly designated Series B cumulative redeemable perpetual preferred stock (the \"Series B Preferred Stock\").\nThe Company expects to grant the underwriters a 30-day option to purchase additional shares of Series B Preferred Stock. The Company intends to apply to list the shares of Series B Preferred Stock on the New York Stock Exchange under the symbol \"JCAP PR B.\"\nThe Company intends to use the net proceeds from the offering to fund an investment in bridge financing with respect to five self-storage facilities located in the Miami, FL MSA for which the Company has executed a non-binding term sheet, or if such investment is not consummated, for other existing or future investments in its development portfolio and operating property loan portfolio and for general corporate purposes.\nRaymond James & Associates, Inc. and Morgan Stanley & Co. LLC are acting as joint book-running managers for the offering and B. Riley FBR, Inc., BMO Capital Markets Corp. and KeyBanc Capital Markets Inc. are acting as co-managers.\nThis offering may only be made by means of a prospectus supplement and the accompanying prospectus. Copies of the preliminary prospectus supplement and accompanying prospectus related to the offering may be obtained, when available, by visiting EDGAR on the Securities and Exchange Commission’s (the “SEC”) website at www.sec.gov or from Raymond James & Associates, Inc., 880 Carillon Parkway, St. Petersburg, FL 33716, telephone: (800) 248-8863, email: prospectus@raymondjames.com ; and Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, 2nd Floor, New York, New York 10014.\nThe offering is being made pursuant to a shelf registration statement on Form S-3 that was declared effective by the SEC on June 24, 2016. A prospectus supplement relating to the offering will be filed with the SEC. This press release shall not constitute an offer to sell or the solicitation of an offer to buy any of these securities, nor shall there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or other jurisdiction.\nAbout Jernigan Capital, Inc.\nJernigan Capital, Inc. is a New York Stock Exchange-listed real estate investment trust (NYSE: JCAP) that provides debt and equity capital to private developers, owners, and operators of self-storage facilities. Our mission is to be the preeminent capital partner for self-storage entrepreneurs nationwide by offering creative solutions through an experienced team demonstrating the highest levels of integrity, dedication, excellence and community, while maximizing shareholder value. The Jernigan Capital team has extensive experience in over 100 U.S. markets—from acquiring and managing self-storage properties to new self-storage development—providing JCAP with knowledge unmatched by any lender, broker or advisor to the sector. Jernigan Capital is the only source of construction and development capital focused solely on the self-storage sector.\nForward-Looking Statements\nThis press release may include \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. The ultimate occurrence of events and results referenced in these forward-looking statements is subject to known and unknown risks, uncertainties, and other factors that may cause the actual results or performance to differ from those projected in the forward-looking statement. These statements relate to the Company's offering of Series B Preferred Stock and the anticipated use of the net proceeds. No assurance can be given that the offering will be completed on the terms described, or at all, or that the net proceeds from the offering will be used as indicated. Completion of the offering on the terms described, and the application of the net proceeds, are subject to numerous conditions, many of which are beyond the control of the Company, including market conditions, general economic conditions and other factors, including those set forth under the heading \"Risk Factors\" in the Company's Annual Report on Form 10-K for the year ended December 31, 2016, and those set forth in the Company's other reports and information filed with the SEC, which are accessible on the SEC's website at www.sec.gov .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005744/en/\nJernigan Capital, Inc.\nJohn Good, 901-567-9517\nPresident and Chief Operating Officer\njohn@jernigancapital.com\nSource: Jernigan Capital, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180118005744/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51745202&newsitemid=20180118005744&lan=en-US&anchor=www.sec.gov&index=2&md5=d53b9c5049c7ae895215ed1c4f39ae07", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51745202&newsitemid=20180118005744&lan=en-US&anchor=www.sec.gov&index=1&md5=188d0c15ab697e67325479753b6bc8bb"], "published": "2018-01-18T16:43:00.000+02:00", "crawled": "2018-01-18T16:22:18.006+02:00", "highlightTitle": ""}