{"organizations": [], "uuid": "5bc32a1b0bbe5ae181782f4faf93a729127c36c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-ablynx-announces-board-changes.html", "country": "US", "domain_rank": 767, "title": "ABLYNX ANNOUNCES BOARD CHANGES", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T19:32:00.000+02:00", "replies_count": 0, "uuid": "5bc32a1b0bbe5ae181782f4faf93a729127c36c1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-ablynx-announces-board-changes.html", "ord_in_thread": 0, "title": "ABLYNX ANNOUNCES BOARD CHANGES", "locations": [], "entities": {"persons": [{"name": "hansen", "sentiment": "none"}, {"name": "peter fellner", "sentiment": "none"}, {"name": "bo jesper hansen", "sentiment": "none"}], "locations": [{"name": "ghent", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "ablynx", "sentiment": "none"}], "organizations": [{"name": "ablynx nv", "sentiment": "negative"}, {"name": "orfacare consulting gmbh", "sentiment": "none"}, {"name": "ablynx board", "sentiment": "none"}, {"name": "swedish orphan international ab", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8 January 2018 - 5:30 pm CET\nGHENT, Belgium, 8 January 2018 (5:30 pm CET) - Ablynx NV [Euronext Brussels and Nasdaq: ABLX] today announced that Dr Peter Fellner, who has served as Chairman since 2013 [1] , has decided to resign from the Board with immediate effect. He will be succeeded by Dr Bo Jesper Hansen, acting as permanent representative of Orfacare Consulting GmbH, who has been a Non-executive Director of Ablynx since November 2013, and has been unanimously elected by the Ablynx Board as the new Chairman.\nDr Bo Jesper Hansen is a highly-accomplished industry veteran with significant expertise in orphan drug research and development, international marketing and commercialization and has extensive regulatory, pharmacovigilance, medical marketing and business development knowledge. Previously, during his time at Swedish Orphan International AB from 1993 and then as Chief Executive Officer and Director of the Board from 1998, Dr Hansen grew the business to an international organization, with over 60 products across Europe. He became Executive Chairman in 2010 following the merger with Biovitrum.\nDr Hansen is currently Chairman of Laborie Inc., and is also non-executive Director of a number of biotech and pharma companies including Orphazyme ApS, Newron Pharmaceuticals SpA, CMC AB and Azanta A/S.\nDr Edwin Moses, Chief Executive Officer at Ablynx, commented :\n\"We are very fortunate to have an extremely suitable successor with Bo Jesper, allowing for an orderly transition at this important time. Bo Jesper is the ideal person to lead the Board moving forward and his wealth of experience is particularly relevant as we advance towards the potential approvals and global launches of our lead, wholly-owned product, caplacizumab, in addition to advancing our extensive pipeline. On behalf of the Board, I would like to thank Peter for his leadership and contribution in the development of the company over the past years and wish him well with his future endeavours.\"\nDr Bo Jesper Hansen, commented:\n\"I am delighted to accept this position, having worked with the Ablynx Board over the past four years. After the positive Phase III caplacizumab data and highly successful NASDAQ IPO, Ablynx has been transformed and is on a trajectory to become a global leading independent healthcare company. With caplacizumab approaching self-commercialisation, and with a broad and diverse pipeline of exciting assets with multiple value inflection points, I look forward to the value these can add in future years with great confidence.\"\nFrom 8 January 2018, the composition of the Board of Ablynx is as follows:\nBo Jesper Hansen, Chairman of the Board, acting as permanent representative of Orfacare Consulting GmbH Edwin Moses, Director and Chief Executive Officer Russell G. Greig, Independent Director, acting as permanent representative of Greig Biotechnology Global Consulting Inc. William Jenkins, Independent Director, acting as principal of William Jenkins Pharma Consulting Catherine Moukheibir, Independent Director Remi Vermeiren, Independent Director Lutgart Van den Berghe, Independent Director, acting as permanent representative of NV Feadon Hilde Windels, Independent Director, acting as permanent representative of Hilde Windels BVBA\nAbout Ablynx\nAblynx is a biopharmaceutical company engaged in the development of Nanobodies ®, proprietary therapeutic proteins based on single-domain antibody fragments, which combine the advantages of conventional antibody drugs with some of the features of small-molecule drugs. Ablynx is dedicated to creating new medicines which will make a real difference to society. Today, the Company has more than 45 proprietary and partnered programmes in development in various therapeutic areas including inflammation, haematology, immuno-oncology, oncology and respiratory disease. The Company has collaborations with multiple pharmaceutical companies including AbbVie; Boehringer Ingelheim; Eddingpharm; Merck & Co., Inc., Kenilworth, New Jersey, USA; Merck KGaA; Novartis; Novo Nordisk; Sanofi and Taisho Pharmaceuticals. The Company is headquartered in Ghent, Belgium. More information can be found on www.ablynx.com .\nFor more information, please contact\nAblynx:\nDr Edwin Moses\nCEO\nt: +32 (0)9 262 00 07\nm: +32 (0)473 39 50 68\ne: edwin.moses@ablynx.com\nLies Vanneste\nDirector Investor Relations\nt: +32 (0)9 262 01 37\nm: +32 (0)498 05 35 79\ne: lies.vanneste@ablynx.com\nFollow us on Twitter @AblynxABLX\nAblynx media relations:\nConsilium Strategic Communications\nMary-Jane Elliott, Philippa Gardner, Sukaina Virji\nt: +44 (0)20 3709 5700\ne: ablynx@consilium-comms.com\nDisclaimer\nCertain statements, beliefs and opinions in this press release are forward-looking, which reflect the Company or, as appropriate, the Company directors' current expectations and projections about future events. By their nature, forward-looking statements involve a number of risks, uncertainties and assumptions that could cause actual results or events to differ materially from those expressed or implied by the forward-looking statements. These risks, uncertainties and assumptions could adversely affect the outcome and financial effects of the plans and events described herein. A multitude of factors including, but not limited to, changes in demand, competition and technology, can cause actual events, performance or results to differ significantly from any anticipated development. Forward looking statements contained in this press release regarding past trends or activities should not be taken as a representation that such trends or activities will continue in the future. As a result, the Company expressly disclaims any obligation or undertaking to release any update or revisions to any forward-looking statements in this press release as a result of any change in expectations or any change in events, conditions, assumptions or circumstances on which these forward-looking statements are based. Neither the Company nor its advisers or representatives nor any of its parent or subsidiary undertakings or any such person's officers or employees guarantees that the assumptions underlying such forward-looking statements are free from errors nor does either accept any responsibility for the future accuracy of the forward-looking statements contained in this press release or the actual occurrence of the forecasted developments. You should not place undue reliance on forward-looking statements, which speak only as of the date of this press release.\n[1] Current term until 2018\nAttachments:\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/faad8c06-c693-488e-83bf-d93d34545993\nSource:Ablynx NV", "external_links": ["http://www.globenewswire.com/NewsRoom/AttachmentNg/faad8c06-c693-488e-83bf-d93d34545993", "https://www.globenewswire.com/Tracker?data=LX1kYEf5AxhfshqjDrsHHWwxRQfyeaojmyem_VwT5aKz2yWoMomXFTveDgZie_tTp4ihA9PcV3gk5MDgBXD1lBtXCXFTDMXa62qm5YdHW7U=", "https://www.globenewswire.com/Tracker?data=_ue68Z2gphZioWRYu7Bb7ovSRi7k55dZa7PluIQDSOAI22CuW2gH7-1F9Poe4Iy8Qi4iBRhPXNEhCAnjen_CFK4mMY6zmS2A_HHuIYeEoty0BeUrCI5YUze_1RrHUE6gWC0P6QF_5s4fcXQhABaDSA==", "https://www.globenewswire.com/Tracker?data=eAdalvewbxoUvn7k5JVG0_u__xl1cQLS-VZY-X54xEr68KtEXpE3vFu_Vz5rE6PRp1Gs7DtngFkoPeS1hMGKM5CGl9wtg5h5HeHg99TwUlfACZUW50EFhgY5tmHupNjboOIfxN1huoTHj7osX8ts4GRyMTQJKFhctnLZfMOmboKdKiMAx8VAIDv8rhPH01y81_U_D7u3G04MLAepHTpyv_rnWWL9-5yc34vOgtABGr5lD4t0CSV-ROwMLRjFTCYbDVY1N_4sY1TwthT0tYHEvQ==", "https://www.globenewswire.com/Tracker?data=0_Lg6hJoewSYZdY8B5blGjbqGgH8LlBqf80vvDLemCM41V13ICXcVZds_t-1gV2OD4bQp4jHWySbysI9zOHvJo9eCAKIc-oqMWnb4MEu_7Q=", "https://www.globenewswire.com/Tracker?data=bKvRox7sfo1gSGRV5ZALIT2creh1WXohZd5So9VEqA_ozdmITMEFl7XMpfhRS3AaXVb7Q1Z6GRtEr3oXcwBKSxE33ZXFnmOKd3x1tioiapYhwqDkQX6UN7c97KyUKf_58pM8T2ovssHlt-_Uf_zLqg==", "https://www.globenewswire.com/Tracker?data=ZeuFT6YTTD4IMVXFTSUvZ463cYfWv_cHIaQ8C0fxbx49ReUCVJrxkXGR5WYUEm9pQs4UTjKdwytsKm66GLuWYA==", "https://www.globenewswire.com/Tracker?data=Nyr66tgYjQh_TCm9uOHVLymGHcRJDBsbSltWPLgxdgy3-ojZRCM-lQs1o33htOMdJ55V-7--XJ3brGzELPjR0NT3MKhnNEHSUM3ml4SIa8QnhriupjpModdlFeE6uyot", "https://www.globenewswire.com/Tracker?data=TMpM6I1JylVnDfhNwdiwf4MqZcn8eqkgRN6ccRiOjyj8qolkCzZDgtE2V_cd_HglqKFxVNtg6XwhGBy0tPS-9w==", "https://www.globenewswire.com/Tracker?data=4EDxP8n8LoCo_6VG9-JTxG3S9KU6VRzzHUz9D4x0MLW1Nd_kQALjiwCSrxOa50ghcPLC-rp0wnb6X3BY6FdCLRumpjMaZZnAo7xY6RmOJo0="], "published": "2018-01-08T19:32:00.000+02:00", "crawled": "2018-01-08T21:18:14.000+02:00", "highlightTitle": ""}