{"organizations": [], "uuid": "90ab5cd43ba7e0e2993b48dcd09e2cddfc6b06c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220198052&w=1200&r=LYNXMPEE070DM", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-china-taiwan-flights/taiwan-calls-chinas-new-aviation-routes-in-taiwan-strait-irresponsible-idUKKBN1EX0IG", "country": "US", "domain_rank": 408, "title": "Taiwan calls China's new aviation routes in Taiwan Strait irresponsible", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T09:23:00.000+02:00", "replies_count": 0, "uuid": "90ab5cd43ba7e0e2993b48dcd09e2cddfc6b06c9"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-taiwan-flights/taiwan-calls-chinas-new-aviation-routes-in-taiwan-strait-irresponsible-idUKKBN1EX0IG", "ord_in_thread": 0, "title": "Taiwan calls China's new aviation routes in Taiwan Strait irresponsible", "locations": [], "entities": {"persons": [{"name": "tsai ing-wen", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "taiwa", "sentiment": "none"}, {"name": "taiwan strait", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "strait", "sentiment": "none"}, {"name": "hamacher  china", "sentiment": "none"}, {"name": "taipei", "sentiment": "none"}, {"name": "taipei", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 7:28 AM / Updated 40 minutes ago Taiwan calls China's new aviation routes in Taiwan Strait irresponsible Reuters Staff 3 Min Read \nTAIPEI (Reuters) - Taiwan’s government has called China’s recent unilateral expansion of civil aviation routes in the Taiwan Strait an irresponsible act that threatens regional security, in the latest row between Beijing and the self-ruled island. Taiwan's President Tsai Ing-wen speaks during the end-of-year news conference in Taipei, Taiwan December 29, 2017. REUTERS/Fabian Hamacher \nChina opened several disputed air routes last week, including a northbound M503 route in the Taiwan Strait, without informing Taiwan, contravening what the democratic government in Taipei said is a 2015 deal to first discuss such flight paths. \nTaiwan’s President Tsai Ing-wen, after meeting with ministry heads to assess the situation on Sunday, said the move ”not only seriously affects aviation safety, but also damages the current situation in the Taiwan strait. \n“This kind of unilateral changing of the situation, this practice that harms regional stability, is not something that will be viewed favourably by the international community,” Tsai said in a statement. \nTsai, who also said during her meeting with officials that China’s increased military activities in the region were threatening stability, called on Beijing to give priority to restore technical discussions on the flight paths. \nBeijing’s move comes as China has pressed ahead with a military modernisation programme that includes building aircraft carriers and stealth fighters to give it the ability to project power far from its shores, and stepped up what it calls “island encirclement patrols” near Taiwan. \nLast Thursday, China’s civil aviation authority said in a statement announcing the new routes that planes “will strictly follow the announced flight path”. \n“In recent years, the scheduled flights for the strait’s west coast airspace have quickly increased, and the delays are becoming more critical. Using the northbound M503 and related routes will effectively ease the currently existing air route’s traffic pressure,” it said. \nChina considers Taiwan a wayward province, and broke off official communication with the Taiwan government after Tsai’s independence-leaning Democratic Progressive Party won power in 2016. \nChina suspects Tsai wants to push for formal independence though, she has said she wants to maintain the status quo with China and is committed to ensuring peace. Reporting by Jess Macy Yu; Additional reporting by Brenda Goh and Michael Martina; Editing by Michael Perry", "external_links": [], "published": "2018-01-08T09:23:00.000+02:00", "crawled": "2018-01-08T09:53:48.004+02:00", "highlightTitle": ""}