{"organizations": [], "uuid": "b41badbd0e94628efb9ecf827f1fdfab1c05a423", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/china-economy-rates/update-1-china-need-not-hike-its-benchmark-rate-near-term-c-bank-advisor-idUSL3N1PB2ZZ", "country": "US", "domain_rank": 408, "title": "REFILE-UPDATE 1-China need not hike its benchmark rate near-term - c.bank advisor", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T18:30:00.000+02:00", "replies_count": 0, "uuid": "b41badbd0e94628efb9ecf827f1fdfab1c05a423"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-economy-rates/update-1-china-need-not-hike-its-benchmark-rate-near-term-c-bank-advisor-idUSL3N1PB2ZZ", "ord_in_thread": 0, "title": "REFILE-UPDATE 1-China need not hike its benchmark rate near-term - c.bank advisor", "locations": [], "entities": {"persons": [{"name": "sheng songcheng", "sentiment": "none"}, {"name": "sheng", "sentiment": "none"}, {"name": "yicai", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "pboc", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "people’s bank of china", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Refiles to correct word in sub-head)\n* Says China already raised interest rates before Fed did\n* China deleveraging has driven up market rates, funding costs\n* Advisor expects yuan to be relatively steady this year\nBEIJING, Jan 16 (Reuters) - China does not need to raise benchmark interest rates in the near-term as market rates and corporate borrowing costs have gone up amid a deleveraging drive, a central bank advisor said in remarks published on Tuesday.\nSheng Songcheng, an advisor to the People’s Bank of China (PBOC), told the Chinese financial news outlet Yicai in an interview that he expected the yuan’s exchange rate to be relatively stable without big fluctuations this year.\nChina’s market interest rates have risen quickly due to the government’s financial deleveraging push, which has also driven up borrowing costs for the real economy, Sheng said.\nOn Tuesday, the PBOC lifted the interest rate on 63-day reverse repos by 5 basis points, bringing it in line with other interbank rates raised on Dec. 14, just hours after the Federal Reserve raised the U.S. benchmark.\n“In fact, we have already raised interest rates before the Fed,” Sheng said. “Interest rates in our financial markets have been rising faster even though we have yet to raise deposit and lending rates.”\n“Under such circumstances, it’s not necessary to raise benchmark deposit and lending rates in the near future,” he said.\nSTEADY YUAN SEEN The weighted average lending rate for non-financial firms, a key indicator of corporate funding costs in China, rose by 49 basis points in the first nine months of 2017 to 5.76 percent, according to central bank data.\nThe latest Reuters poll forecast that the PBOC would keep its benchmark lending rate unchanged at 4.35 percent at least through the second quarter of 2019.\nSheng expected the yuan, which has gained just over 1 percent against the dollar this year after strengthening 6.8 percent in 2017, to be relatively steady this year.\nThe yuan’s recent appreciation is due to market forces, rather than central bank interventions, Sheng said, adding that the currency could be around 6.6 per dollar over the long term.\nLast week, the PBOC recalibrated the template for daily yuan fixings to nullify a discretionary counter-cyclical factor it had introduced into the formula in 2017 to contain the currency’s decline.\nThat, analysts said, meant the yuan would move in line with the currencies of its trading partners and was seen as an attempt by authorities to cap the currency.\nThe PBOC said last week it would let banks that contribute to its yuan fixing to determine the counter-cyclical factor but traders estimate the factor has stayed neutral since then.\nSheng also told the Chinese news outlet a planned national property tax would be unlikely to be rolled out in the short-term due to its complexities. (Reporting by Beijing Monitoring Desk and Kevin Yao; Editing by Richard Borsuk)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T18:30:00.000+02:00", "crawled": "2018-01-17T20:05:17.000+02:00", "highlightTitle": ""}