{"organizations": [], "uuid": "6c678b1e0b39ebc8d0af9afecdb455f9368bd31c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219404726&w=1200&r=LYNXMPEE031CA", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-iran-rallies-ebadi/iranian-nobel-laureate-urges-u-s-to-back-protests-with-political-sanctions-idUSKBN1ET2AG", "country": "US", "domain_rank": 408, "title": "Iranian Nobel laureate urges U.S. to back protests with 'political sanctions'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T21:52:00.000+02:00", "replies_count": 0, "uuid": "6c678b1e0b39ebc8d0af9afecdb455f9368bd31c"}, "author": "", "url": "https://www.reuters.com/article/us-iran-rallies-ebadi/iranian-nobel-laureate-urges-u-s-to-back-protests-with-political-sanctions-idUSKBN1ET2AG", "ord_in_thread": 0, "title": "Iranian Nobel laureate urges U.S. to back protests with 'political sanctions'", "locations": [], "entities": {"persons": [{"name": "ebadi", "sentiment": "none"}, {"name": "shirin ebadi", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "min read  london", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 7:52 PM / Updated 6 minutes ago Iranian Nobel laureate urges U.S. to back protests with 'political sanctions' Bozorgmehr Sharafedin 4 Min Read \nLONDON (Reuters) - Iranian Nobel Peace laureate Shirin Ebadi urged the United States and international community to support nationwide protests in Iran with political sanctions and not economic measures that could hit the general population. \nThe protests, which began over economic hardships suffered by the young and working class, pose one of the most sustained challenges to the clerical rulers in almost a decade. \nIn an interview with Reuters on Thursday, Ebadi said she supported the protests “one hundred percent” and urged the people of Iran to stay in the streets in peaceful protests and engage in civil disobedience. \n“People should stop paying electricity, water and gas bills. They should not pay their tax. They should withdraw their money from banks,” said Ebadi who was awarded the Nobel Peace Prize in 2003. \nIran’s army chief declared on Thursday that police had already quelled anti-government unrest that has killed 21 people but that his troops were ready to intervene if needed. \n“I call on my dear children in the police forces and the Revolutionary Guards to put down their guns and do not kill their own brothers and sisters. If the country’s situation improves, you would also benefit from it,” said Ebadi, one of the exiled critics of Iran’s leadership. \nReacting to the Revolutionary Guards commander, Mohammad Ali Jafari who said on Wednesday that the protests were over, Ebadi said: “That’s his opinion. People are still in the streets. Even if they go home, their anger would remain, and the protests would resurface months or years later.” SANCTIONS \nA senior U.S. official said on Wednesday that the United States aimed to collect “actionable information” that could allow it to pursue sanctions against Iranian individuals and organizations involved in a crackdown on protesters. \nThe move is part of an effort by President Donald Trump’s administration to swiftly side with anti-government protesters who have rattled Iran’s clerical leadership. \nTrump tweeted on Wednesday that United States would throw its support behind Iranian protesters at an “appropriate time”. \nEbadi said: “If Iranian government has the right to talk about human rights abuses in Yemen, Saudi Arabia, Lebanon and Syria, other countries, including America, have the right to talk about human rights abuses in Iran.” \nShe said the economic sanctions and U.S. visa restriction on Iranians -- that both started under Obama -- had only made life more difficult for people, not the government. \n“During the Obama presidency, I said they should impose political sanctions on Iran, not economic ones. For example, they should ban sales of arms or any tools that can be used to suppress people,” Ebadi said. \nShe also called for a restriction on Iran’s dozens of radio and television stations, that she said were part of Iran’s “wrongful” foreign policy, and “spread hatred and lies” in different languages. \nShe asked world powers to provide young Iranians with “free and fast” satellite internet that cannot be censored by the Iranian authorities. \nIt was unclear how the protests might affect Trump’s thinking about the 2015 nuclear pact that eased economic pressure on Tehran in exchange for limits on its nuclear program. \nTrump must decide by mid-January whether to continue waiving U.S. sanctions on Iran’s oil exports under the terms of the international deal. \nIf he reimposes sanctions on oil, it could increase the economic pain for Iran’s leaders. But analysts said it could also send the wrong message about U.S. support for Iran’s people in the middle of the boldest challenge to the leadership in a decade. \n(amends mispunch in `12th paragraph.) Reporting by Bozorgmehr Sharafedin; editing by Ralph Boulton", "external_links": [], "published": "2018-01-04T21:52:00.000+02:00", "crawled": "2018-01-04T22:00:38.022+02:00", "highlightTitle": ""}