{"organizations": [], "uuid": "772c0e695dddf2f0234d35ccc5c69ef1b7db6ac9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-optium-cyber-systems-welcomes-brigadier-general-retired-mark-g-beesley-to-advisory-board.html", "country": "US", "domain_rank": 767, "title": "Optium Cyber Systems Welcomes Brigadier General (Retired) Mark G. Beesley to Advisory Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.98, "site_type": "news", "published": "2018-01-31T16:30:00.000+02:00", "replies_count": 0, "uuid": "772c0e695dddf2f0234d35ccc5c69ef1b7db6ac9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-optium-cyber-systems-welcomes-brigadier-general-retired-mark-g-beesley-to-advisory-board.html", "ord_in_thread": 0, "title": "Optium Cyber Systems Welcomes Brigadier General (Retired) Mark G. Beesley to Advisory Board", "locations": [], "entities": {"persons": [{"name": "mark g. beesley", "sentiment": "negative"}, {"name": "beesley", "sentiment": "none"}], "locations": [{"name": "tx", "sentiment": "none"}], "organizations": [{"name": "optium cyber systems, inc.", "sentiment": "neutral"}, {"name": "optium cyber systems inc.", "sentiment": "none"}, {"name": "company’s board of advisors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "THE WOODLANDS, TX, Jan. 31, 2018 (GLOBE NEWSWIRE) -- Optium Cyber Systems, Inc. (the “Company”) (OTC:OCSY) is pleased to announce that Brigadier General (Retired) Mark G. Beesley has been appointed to the Company’s Board of Advisors. General Beesley will be responsible for spearheading the development and marketing of the Company’s cyber security platform for the defense industry.\n“I am pleased and honored to lend my abilities and networks to Optium Cyber Systems Inc. as they establish and develop the global standard for cyber security,” stated General Beesley. “Cyber security is a must for operations of all companies and individuals today and forever in the future. I am excited about the development involved and on-going future that has been laid out for Optium Cyber Systems. Every day great attention must be paid to operating on the global web in order to protect an individual and a company’s operations and reputation. It is not sufficient to adapt after the fact of a cyber breach. Individuals and companies must stay ahead of those who mean harm to a company’s ability to operate and conduct commerce and operations,” concluded General Beesley.\n“We are very proud to have Brigadier General Beesley join our esteemed Board of Advisors,” commented George Rutherford, President of Optium Cyber Systems, Inc. “We will be looking to him to oversee our entry into the very lucrative defense industry. We could not ask for a better suited and more accomplished representative for our company,” continued Mr. Rutherford.\nAbout Brigadier General (Retired) Mark Beesley\nBrigadier General (Retired) Mark Beesley has over thirty years of proven leadership including project management, ﬁnancial cost analysis, budgeting, innovation, and personnel management. He has a diverse background with military personnel, government civil servants and companies serving the Department of Defense. He has a complete understanding of the Department of Defense Biannual Planning, Programming, and Budgeting System processes. General Beesley was a fighter pilot with 3,000 plus ﬂying hours in the F-15C Eagle, the F-l5E Strike Eagle, and the F-I6 Fighting Falcon aircraft. He is also a space, national missile defense and command control center certified expert.\nGeneral Beesley was solely responsible for conﬁguration control in the air operations center for two democratic allied countries, the United States and South Korea. He led the United States and South Korean militaries in the development of a strategic air campaign plan that supported the combatant commander of the US forces, Korea. This air campaign plan still serves as the principal basis for the United States and South Korean offensive air and space operations against North Korea should the need ever arise.\nGeneral Beesley holds a secret security clearance with the United States government.\nAbout Optium Cyber Systems, Inc.\nOCSI has developed a proprietary process to analyze, identify and address cyber security vulnerabilities in an organization’s critical IT infrastructure which is scalable to any size organization in any industry. OCSI is a publicly traded company having its common shares Quote: d on the OTC Markets under the symbol \"OCSY\".\nForward-Looking Statements\nExcept for the historical information contained herein, the matters discussed in this press release are . Actual results may differ materially from those described in and are subject to risks and uncertainties. See Optium Cyber Systems, Inc.'s filings with OTC Markets which may identify specific factors that may cause actual results or events to differ materially from those described in the .\nSafe Harbor Statement\nThis release includes , which are based on certain assumptions and reflects management's current expectations. These are subject to a number of risks and uncertainties that could cause actual results or events to differ materially from current expectations. Some of these factors include: general global economic conditions; general industry and market conditions, sector changes and growth rates; uncertainty as to whether our strategies and business plans will yield the expected benefits; increasing competition; availability and cost of capital; the ability to identify and develop and achieve commercial success; the level of expenditures necessary to maintain and improve the quality of services; changes in the economy; changes in laws and regulations, including codes and standards, intellectual property rights, and tax matters; or other matters not anticipated; our ability to secure and maintain strategic relationships and distribution agreements. The Company disclaims any intention or obligation to update or revise any , whether as a result of new information, future events or otherwise.\nContact Investor Relations Ten Associates LLC 11529 N. 120th St. Scottsdale, Arizona 85259 USA Telephone: 480-326-8577 Contact: Thomas E. Nelson Email: tenassociates33@gmail.com Optium Cyber Systems, Inc. 8350 Ashlane Way, Suite 104 The Woodlands, Texas 77382 USA Telephone: 936-559-7407 Web: www.optiumcyber.com Email: info@optiumcyber.com Twitter: https://twitter.com/OCSI4INVESTOR Facebook: https://www.facebook.com/OCSI4INVESTOR\nSource:Optium Cyber Systems, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/b3b01c4c-6881-495e-9815-7fe8a490585d", "https://www.facebook.com/OCSI4INVESTOR", "https://twitter.com/OCSI4INVESTOR"], "published": "2018-01-31T16:30:00.000+02:00", "crawled": "2018-01-31T17:53:41.000+02:00", "highlightTitle": ""}