{"organizations": [], "uuid": "41c4dd219122942c7d44313bafe2d14a2d637b53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104952283-GettyImages-905768954.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19794221/device/rss", "section_title": "Europe News", "url": "https://www.cnbc.com/2018/01/18/french-leader-macron-meets-may-in-first-official-visit-to-the-uk.html", "country": "US", "domain_rank": 767, "title": "French leader Macron meets May in first official visit to the UK", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T09:50:00.000+02:00", "replies_count": 0, "uuid": "41c4dd219122942c7d44313bafe2d14a2d637b53"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/18/french-leader-macron-meets-may-in-first-official-visit-to-the-uk.html", "ord_in_thread": 0, "title": "French leader Macron meets May in first official visit to the UK", "locations": [], "entities": {"persons": [{"name": "emmanuel macron", "sentiment": "negative"}, {"name": "macron", "sentiment": "negative"}, {"name": "sylvain lefevre", "sentiment": "none"}, {"name": "aarti shankar", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "shankar", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "sandhurst", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}], "organizations": [{"name": "getty images", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "open europe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "French President Emmanuel Macron is visiting the U.K. Thursday for the first time since taking office, in an attempt to secure defense cooperation post-Brexit.\n\"I do think this meeting is particularly about quick resolutions,\" Aarti Shankar, policy analyst at Open Europe, told CNBC Thursday. The meeting \"will be setting the roadmap, I think, for what we can expect from the Franco-British relationship in the future,\" she added.\nMacron and Prime Minister Theresa May are holding talks at the at Sandhurst military academy, suggesting that both leaders are putting security cooperation at the heart of their future ties.\nSylvain Lefevre | Getty Images \"Clearly defense and security cooperation is a very important, fundamental aspect of this bilateral partnership and given that the U.K. will be leaving the EU in the future, both sides, I think, are very keen in this summit to underline their continued commitment to defense cooperation,\" Shankar added.\nOvernight, the U.K. government announced it is to send helicopters to support French operations in Africa as well as providing £50 million ($69 million) of humanitarian aid to some African countries. In return, France is to commit to send troops to the U.K.-led operations in Estonia in 2019.\n\"Today's Summit will underline that we remain committed to defending our people and upholding our values as liberal democracies in the face of any threat, whether at home or abroad,\" May said in a statement Wednesday night.\n\"But our friendship has always gone far beyond defense and security and the scope of today's discussions represents its broad and unique nature,\" she added.\nAlso among the leaders' many discussion topics will be the contentious issue of the Calais migrant camp. Back in 2003, both countries agreed to carry out immigration controls in each other's territory at sea ports.\nTweet 1 \nMacron, who visited Calais earlier this week, said that France cannot be Britain's coastguard. As a result, they are due to agree that the U.K. will speed up the process of asylum application for those migrants waiting at the French border and will increase contributions toward transport security.\nHowever, Macron and May are unlikely to talk much about the Brexit process. \"When it comes to talking about Brexit (Macron) is a lot more reticent than other EU leaders, he's very willing to say 'this is the area of the EU, this is the area of Michel Barnier as the EU's chief negotiator, I'm not going to say anything about this.' So I don't think there will be formal declarations on that,\" Shankar told CNBC.", "external_links": [], "published": "2018-01-18T09:50:00.000+02:00", "crawled": "2018-01-18T10:22:12.012+02:00", "highlightTitle": ""}