{"organizations": [], "uuid": "2a06c60143d621b467c54bee8cb135e4c83befa0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/britain-stocks-factors/uk-stocks-factors-to-watch-on-jan-30-idUSL4N1PP22H", "country": "US", "domain_rank": 408, "title": "UK Stocks-Factors to watch on Jan 30", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T07:25:00.000+02:00", "replies_count": 0, "uuid": "2a06c60143d621b467c54bee8cb135e4c83befa0"}, "author": "", "url": "https://www.reuters.com/article/britain-stocks-factors/uk-stocks-factors-to-watch-on-jan-30-idUSL4N1PP22H", "ord_in_thread": 0, "title": "UK Stocks-Factors to watch on Jan 30", "locations": [], "entities": {"persons": [{"name": "melrose", "sentiment": "none"}, {"name": "elliott", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "gkn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 30 (Reuters) - Britain's FTSE 100 index is seen opening 30 points lower at 7,641.1 on Tuesday, according to financial bookmakers. * SKY: U.S. hedge fund Elliott, which often wages activist campaigns at companies, has lifted its stake in British pay-television broadcaster Sky to 1.29 percent, a stock exchange filing issued on Monday shows. * MELROSE: Melrose said on Monday it was \"surprised\" GKN had not disclosed that the turnaround specialist had offered to make a voluntary cash contribution of as much as 150 million pounds to GKN's pension schemes when it first contacted the bid target about a takeover on Jan. 8. * BREXIT: The European Union offered on Monday to let Britain keep its membership benefits for 21 months after Brexit to help businesses adapt but it rejected the idea that London could block new EU laws during the transition. * BREXIT: A confidential analysis by the British government on the impact of Brexit suggests all U.K. industries will be hurt by leaving the European Union, BuzzFeed News reported on Monday. * IRELAND ABORTION: Ireland's government on Monday proposed holding a referendum to liberalise the country's abortion regime at the end of May, offering voters the first opportunity in 35 years to overhaul some of the world's strictest laws. * BRITAIN CONSUMERS: The confidence of British households rose at the fastest pace in a year in January, suggesting the Brexit-bound economy might hold up better than expected again this year, according to a survey published on Tuesday. * BRITAIN CONSTRUCTION: British cities are reporting record levels of construction activity as confidence in prospects for city centre residential development stays strong, a industry survey said on Tuesday. * CHINA TRADE: British Prime Minister Theresa May promised to hold \"frank discussions\" with China during a crucial trade visit later this week, with several awkward diplomatic issues like North Korea and Brexit expected to be discussed. * METALS: Most base metals gave up early gains on Tuesday due to a strengthening dollar, as investors awaited positive signals about infrastructure building in U.S. President Donald Trump's State of the Union address later in the day. * OIL: Oil prices fell on Tuesday for a second day as rising U.S. output and a strengthening dollar sapped demand for crude, pushing Brent below $70 a barrel. * The UK blue chip index closed up 0.1 percent at 7,671.53 points on Monday, pulling ahead of sluggish European markets thanks to its strong cyclical tilt as mining and oil stocks powered higher. * For more on the factors affecting European stocks, please click on: cpurl://apps.cp./cms/?pageId=livemarkets * UK CORPORATE DIARY: CYBG Plc Q1 Trading Statement Filtronic Plc Half Year Earnings Release Domino's Pizza Group Plc Q4 Trading Statement PZ Cussons Plc Half Year Earnings Release Avocet Mining Plc Trading Statement UDG Healthcare Plc Q1 Trading Statement TODAY'S UK PAPERS > Financial Times > Other business headlines Multimedia versions of Reuters Top News are now available for: * 3000 Xtra : visit topnews.session.rservices.com * For Top News : topnews.reuters.com (Reporting by Noor Zainab Hussain in Bengaluru)\n ", "external_links": [], "published": "2018-01-30T07:25:00.000+02:00", "crawled": "2018-01-30T07:37:11.009+02:00", "highlightTitle": ""}