{"organizations": [], "uuid": "c85a7d584bb8950f73708f9f21f87b3046f41ec5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1219974857&w=1200&r=LYNXMPEE06057", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/us-usa-weather/brutal-dangerous-cold-grips-east-coast-idINKBN1EV0C8", "country": "US", "domain_rank": 408, "title": "Brutal cold snap stuns U.S. East Coast after blizzard", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T04:39:00.000+02:00", "replies_count": 0, "uuid": "c85a7d584bb8950f73708f9f21f87b3046f41ec5"}, "author": "", "url": "https://in.reuters.com/article/us-usa-weather/brutal-dangerous-cold-grips-east-coast-idINKBN1EV0C8", "ord_in_thread": 0, "title": "Brutal cold snap stuns U.S. East Coast after blizzard", "locations": [], "entities": {"persons": [{"name": "scott", "sentiment": "negative"}, {"name": "malone", "sentiment": "none"}, {"name": "dan petersen", "sentiment": "none"}, {"name": "gina cherelus", "sentiment": "none"}, {"name": "liz gallagher", "sentiment": "none"}], "locations": [{"name": "u.s. east coast", "sentiment": "none"}, {"name": "bangor", "sentiment": "none"}, {"name": "midwest", "sentiment": "none"}, {"name": "whoopie pie cafe", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "national weather service", "sentiment": "none"}, {"name": "min read  boston/new york", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 11:37 AM / Updated 2 hours ago Brutal cold snap stuns East Coast after blizzard Scott Malone , Gina Cherelus 4 Min Read \nBOSTON/NEW YORK (Reuters) - A shroud of bone-chilling arctic air covered the U.S. East Coast and Midwest on Saturday, creating dangerous conditions as tens of millions of people struggled to clean up from a blizzard that dumped deep, drifting snow in many areas earlier this week. \nWind chill and freeze warnings stretched from New England to Ohio and Pennsylvania, while the National Weather Service warned of freezing rain in Missouri and areas to the northeast. \nIn some of those places, exposed skin could freeze within 30 minutes, said meteorologist Dan Petersen of the National Weather Service’s Maryland-based Weather Prediction Center. \nAt the Whoopie Pie Cafe in Bangor, Maine, business was slow because of the cold, cashier and waiter Liz Gallagher, 58, said by phone. “Nobody goes out when it’s really cold, at least I wouldn‘t,” said the life-long Bangor resident. \nThe cold snap complicated efforts by crews to clear snow and ice from roadways after the blizzard, which clobbered the Northeast after sprinkling snow in areas as far south as Savannah, Georgia and Tallahassee, Florida. \nIn New England and the Middle Atlantic states, the storm forced hundreds of schools to close and commuter rail services to suspend or reduce service. \nCold and snowy weather was blamed for at least 18 deaths in the past few days, including four in North Carolina traffic accidents and three in Texas. \n“The magnitude of the cold and the area of coverage of the cold is really what’s impressive to me,” said meteorologist Ed Vallee, owner of Vallee Weather Consulting. \nKillington, the famous Vermont ski resort, closed on Saturday even though snow conditions were excellent, saying wind chill on the slopes was at least minus 50 degrees Fahrenheit (minus 46 degrees Celsius). A winter storm sweeping across Ontario, eastern Canada and the northeastern United States is pictured in a NASA handout satellite photo January 6, 2018. NASA/Handout via REUTERS \n“It’s just too cold to put folks out there,” the resort said on its website. \nIn neighboring New Hampshire, the ambient air temperature on Mount Washington plunged to -36 F (minus 38C), two degrees short of a record low for Jan. 6. But sustained winds of 99 miles per hour (159 km/h) and gusts of up to 112 mph (180 km/h) atop the 6,200-foot (1,990-metre) peak made it feel more like minus 92 F (minus 69 Celsius), the NWS said. \nThe brutal cold in parts of the East Coast and Midwest shows no sign of abating this weekend, but a thaw should begin on Monday, said meteorologist Bob Oravec of the Weather Prediction Center. Before then, conditions will probably worsen. Slideshow (7 Images) \nOvernight, more than 30 cities from New England to the mid-Atlantic states could experience record cold, Petersen said. New York and Boston are among the big cities where records could fall. \nAmong the coldest places in the country on Saturday afternoon were the small Minnesota towns of Cotton and Embarrass, where the mercury plummeted to minus 39F (minus 39C), the NWS said. \n“The air hurt my face,” Charlie Jessen, 25, an employee at the Superamerica gas station in Cotton, 36 miles (58 km) northwest of Duluth, said by phone. \nEven so, temperatures for those hamlets in the northeastern corner of Minnesota fell short of a record low for the area, where sub-zero readings are not unusual in January. \nIn the more populous Northeast, New York’s John F. Kennedy International Airport set an all-time low for Jan. 6 at 8 F (minus 13C), Oravec said. \nThe airport had closed from Thursday to Friday morning when snow created white-out conditions. Some passengers endured more delays on Saturday after the wing of a China Southern plane clipped the tail of a Kuwait Airlines jet on the tarmac. \nThe East Coast’s first snowstorm of 2018 was energized by a rapid drop in barometric pressure that some weather forecasters called a bombogenesis, or a “bomb cyclone.” The phenomenon gave rise to gusts of more than 70 mph (113 km/h) and produced snowfall totals of 22 inches (56 cm) in parts of Maine and 17 inches (43 cm) in parts of Massachusetts, the NWS said. Additional reporting by Alex Dobuzinskis in Los Angeles, Brendan O'Brien in Milwaukee and Harriet McLeod in Charleston, South Carolina; Editing by Frank McGurty and Meredith Mazzilli", "external_links": [], "published": "2018-01-07T04:39:00.000+02:00", "crawled": "2018-01-07T11:11:09.020+02:00", "highlightTitle": ""}