{"organizations": [], "uuid": "054463d9c47a49462a440bf9226ada713d9a4bd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224606938&w=1200&r=LYNXMPEE0M1VQ", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-handball-europe/denmark-reach-euro-handball-semis-as-slovenia-stun-spain-idUSKBN1FC33M", "country": "US", "domain_rank": 408, "title": "Denmark reach Euro handball semis as Slovenia stun Spain", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:05:00.000+02:00", "replies_count": 0, "uuid": "054463d9c47a49462a440bf9226ada713d9a4bd9"}, "author": "", "url": "https://www.reuters.com/article/us-handball-europe/denmark-reach-euro-handball-semis-as-slovenia-stun-spain-idUSKBN1FC33M", "ord_in_thread": 0, "title": "Denmark reach Euro handball semis as Slovenia stun Spain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ZAGREB (Reuters) - Olympic champions Denmark became the first nation to reach the European championship semi-finals as other results in main round Group II sent them through without throwing a ball on Tuesday.\nSlovenia’s stunning 31-26 win over Spain in the Varazdin Arena was followed by the Czech Republic’s 25-24 defeat of Macedonia, leaving Denmark top on six points from four games before the final round of matches on Wednesday.\nSecond-placed Spain, third-placed holders Germany and the Czech Republic in fourth have four points each and everything to play for in a dramatic home straight.\nWith a myriad of mind-boggling mathematical combinations at hand, Denmark are assured of finishing in the section’s top two no matter what they do against Macedonia in their last match, while the section’s other semi-final berth is up for grabs.\nHandball - Men's EHF European Handball Championship - main round Group II - Germany v Denmark - Arena Varazdin, Varazdin, Croatia - January 21, 2018. Hans O. Lindberg of Denmark shoots on goal. REUTERS/Antonio Bronic With all 12 teams still in the competition in action on Wednesday, Group I leaders France face a stern test against Croatia while Sweden meet Norway in a Scandinavian derby as all four teams are vying for a pair of medal round berths.\nSpain started as strong favorites against the Slovenians but were rocked by a string of good saves from goalkeeper Urh Kastelic and a fine attacking display from his team mates as Gasper Marguc led the way with five goals.\nSlideshow (2 Images) Slovenia, who had 11 different scorers, stretched their 13-12 halftime lead to 26-19 in the last quarter of the game, sparking raucous celebrations amongst a full house of their fans at the final whistle.\nThe Czechs trailed Macedonia for much of their contest and looked out for the count after falling behind 21-17 but turned the match on its head in a frantic finale.\nTheir goalkeeper Tomas Mrkva emerged as the hero after saving a seven-meter penalty on the buzzer.\nWriting by Zoran Milosavljevic in Belgrade; Editing by Ken Ferris\n ", "external_links": [], "published": "2018-01-24T00:05:00.000+02:00", "crawled": "2018-01-24T00:11:16.000+02:00", "highlightTitle": ""}