{"organizations": [], "uuid": "f9a29caf5e538a38c1352c1e7049e7eb004f1c2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/usa-congress-shutdown/update-1-clock-running-out-to-avert-u-s-government-shutdown-as-trump-blames-democrats-idUSL1N1PE0H4", "country": "US", "domain_rank": 408, "title": "REFILE-UPDATE 10-With no deal in sight, U.S. Congress faces looming government shutdown", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T20:34:00.000+02:00", "replies_count": 0, "uuid": "f9a29caf5e538a38c1352c1e7049e7eb004f1c2a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-congress-shutdown/update-1-clock-running-out-to-avert-u-s-government-shutdown-as-trump-blames-democrats-idUSL1N1PE0H4", "ord_in_thread": 0, "title": "REFILE-UPDATE 10-With no deal in sight, U.S. Congress faces looming government shutdown", "locations": [], "entities": {"persons": [{"name": "susan cornw", "sentiment": "negative"}, {"name": "mulvaney", "sentiment": "negative"}, {"name": "mike", "sentiment": "negative"}, {"name": "mick", "sentiment": "negative"}, {"name": "richard cowan", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "schumer", "sentiment": "none"}, {"name": "mick mulvaney", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "democratic senate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Corrects Mulvaney’s first name in 4th paragraph to Mick from Mike)\nBy Richard Cowan and Susan Cornwell\nWASHINGTON, Jan 19 (Reuters) - The U.S. Congress raced the clock to avoid a federal government shutdown before a midnight deadline on Friday after a meeting between President Donald Trump and Democratic Senate leader Chuck Schumer failed to produce a deal.\nTrump invited Schumer to the White House for talks as a stopgap bill to fund the federal government through Feb. 16 appeared headed to defeat in the Senate, where Democratic votes are needed to pass it.\nTrump said the meeting was “excellent” and that efforts were continuing. “Making progress - four week extension would be best,” Trump said in a tweet.\nShortly after Trump’s tweet, White House budget director Mick Mulvaney told CNN he expected an agreement would be reached in the next 24 hours, meaning the government would shut down at midnight but be reopened over the weekend.\nSchumer said earlier that the White House meeting lasted about 90 minutes but that differences remained in the pursuit of a short-term spending bill to keep the government running.\nDemocrats are demanding that the stopgap bill include protections for hundreds of thousands of young undocumented immigrants but Republicans have so far refused.\n“We discussed all of the major outstanding issues. We made some progress, but we still have a good number of disagreements. The discussions will continue,” Schumer told reporters after the meeting, also attended by each man’s chief of staff - John Kelly for Trump and Mike Lynch for Schumer.\nThe Republican-controlled House of Representatives approved the stopgap spending measure late on Thursday, but it has been sidetracked in the Senate by a dispute over immigration.\nThe House recessed on Friday for a week-long break, but members were warned they could be called back for votes.\nThe shutdown would begin on the first anniversary of Trump’s inauguration as president, and put hundreds of thousands of ‘non-essential’ federal workers on temporary unpaid leave.\n‘Essential’ employees who deal with public safety and national security would keep working. There have only been three meaningful government shutdowns since 1995.\nThe showdown follows a months-long struggle in Congress to agree on government funding levels and the immigration issue. The federal government is operating on a third temporary funding measure since the new fiscal year began in October.\nDemocrats have demanded the bill include protections from deportation for 700,000 young undocumented immigrants. Those children, known as “Dreamers,” were brought into the United States as children, largely from Mexico and Central America, and given temporary legal status under a program started by former President Barack Obama. Many have been educated in the United States and know no other country.\nIn September, Trump announced he was ending the program and giving Congress until March 5 to come up with a legislative replacement.\nLeaders of both parties blamed each other for the impasse.\n“Now that we’re 13 hours away from a government shutdown that Democrats would initiate and Democrats would own, the craziness of this seems to be dawning on my friend the Democratic leader,” Senate Republican leader Mitch McConnell said, referring to Schumer.\n‘DON‘T TURN YOUR BACK’\nDick Durbin, the No. 2 Democrat in the Senate, said Republicans needed to sit down and negotiate and called on House Republicans not to leave town until the crisis was averted.\n“I would beg them, don’t turn your back on your responsibility right here in Washington to work with us, to try to find a way forward,” Durbin said.\nTrump said in a morning tweet that Democrats were holding up a resolution over the immigration issue.\n“Democrats are needed if it is to pass in the Senate - but they want illegal immigration and weak borders. Shutdown coming?” he said.\nDemocratic Senator Tim Kaine told reporters that lawmakers were close to a longer-term deal and should not pass another 30-day funding measure. “We can get there, we’re close enough we can get there if we just stay on it,” he said. “I think we can get one in the next few days.”\nRepublican Senator Tom Cotton said he was willing to provide protection to DACA recipients in future negotiations.\n“We have another six weeks to solve that problem. It doesn’t really involve government funding,” he told Fox News Channel. “We should take those two issues up in sequence.”\nRepublicans have a 51-49 majority in the Senate, but with Senator John McCain undergoing cancer treatment at home in Arizona they need at least 10 Democrats to reach the 60 votes required to pass a spending bill. In addition to strong Democratic opposition, at least three Republican senators have said they will not back the resolution in its current form.\nRepublican Senator Mike Rounds, who had earlier said he could not back the bill, on Friday said in a statement that while the measure was “not ideal,” he would support it after being assured that other legislation to adequately fund the U.S. military would be raised soon.\nDemocratic Senator Joe Donnelly of Indiana said he would support the stopgap spending bill and another Democratic senator, Joe Manchin of West Virginia, said he was leaning in favor of the bill.\nBoth men are among 10 Democratic senators up for re-election this year in states Trump won in the 2016 presidential election.\nAmid the deadlock, more senators were raising the possibility of merely approving enough new federal funds for a few days. The idea is to put pressure on negotiators to then cut deals on immigration, defense spending and non-defense funding by next week.\nBut McConnell shot down that plan on Friday. “Let’s fund the government for a full month so we can actually get something done” and negotiate other issues including immigration, he said. (Reporting by Richard Cowan; Additional reporting by Roberta Rampton, Steve Holland, Lisa Lambert, Blake Brittain and Amanda Becker; Writing by John Whitesides; Editing by Bill Trott and James Dalgleish)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T20:34:00.000+02:00", "crawled": "2018-01-20T02:55:29.000+02:00", "highlightTitle": ""}