{"organizations": [], "uuid": "555a93ad4c04f756aff2ae0acacbde58ef4f897d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219870750&w=1200&r=LYNXMPEE050HM", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-trump-republicans/trump-meeting-with-republican-leaders-says-welfare-reform-may-have-to-wait-idUKKBN1EV0MZ", "country": "US", "domain_rank": 408, "title": "Trump, meeting with Republican leaders, says welfare reform may have to wait", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T20:22:00.000+02:00", "replies_count": 0, "uuid": "555a93ad4c04f756aff2ae0acacbde58ef4f897d"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump-republicans/trump-meeting-with-republican-leaders-says-welfare-reform-may-have-to-wait-idUKKBN1EV0MZ", "ord_in_thread": 0, "title": "Trump, meeting with Republican leaders, says welfare reform may have to wait", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "james oliphant", "sentiment": "none"}, {"name": "reuters/yuri gripas  trump", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}], "locations": [{"name": "camp david", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "md.", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "republican", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 6:21 PM / Updated 25 minutes ago Trump, meeting with Republican leaders, says welfare reform may have to wait James Oliphant 3 Min Read \nCAMP DAVID, Md. (Reuters) - U.S. President Donald Trump and Republican congressional leaders said after talks on Saturday that they would make an election-year push this year for an immigration overhaul and infrastructure spending but that welfare reform may have to wait for later. U.S. President Donald Trump speaks to the media after the Congressional Republican Leadership retreat at Camp David, Maryland, U.S., January 6, 2018. REUTERS/Yuri Gripas \nTrump was joined for two days of talks with Senate Majority Leader Mitch McConnell, House of Representatives Speaker Paul Ryan and other top Republicans to sketch out a legislative agenda during a year in which they will battle to keep the U.S. Congress in Republican control in November elections. \nTaking questions from reporters after the talks, Trump said he planned an active year on the campaign trail on behalf of Republican candidates. \n“They want me to be involved, and very involved,” Trump said of Republican leaders. “We have to have more Republicans ... So I will be actually working for incumbents and anybody else that has my kind of thinking.”The party that controls the White House typically loses seats in the first congressional election after a presidential election, and Trump’s relatively low approval rating could increase the chances of Republican losses. \nTrump and party leaders face a Jan. 19 deadline on passing legislation to prevent a government shutdown. The White House has said its next top priorities are a plan to invest in roads, bridges and other infrastructure. \nRepublicans also want to reach an agreement on immigration policy, including addressing protections for hundreds of thousands of young adults who were brought to the United States illegally as children. U.S. President Donald Trump leaves with members of the government and Republican leaders after speaking to the media following the Congressional Republican Leadership retreat at Camp David, Maryland, U.S., January 6, 2018. REUTERS/Yuri Gripas \nWelfare reform, a priority for Ryan and other House Republicans, appeared to be waning as a Trump goal for this year. \nHe said “we are looking at it” but that the goal was to get a bipartisan deal on welfare reform. If that is not possible, the effort might be left to do later, he said. Slideshow (4 Images) \nTrump called his top economic adviser, Gary Cohn, to the microphone to say he planned to stay in the administration. Cohn’s status has been in doubt since a tax overhaul was approved and his departure could rattle stock markets that have soared in recent months. \n“Yes, I‘m happy,” Cohn said. “How’s that?” \n“Gary hopefully will be staying for a long time,” Trump said. \nTrump said he also wants a bipartisan agreement on an immigration overhaul but the reality is that both sides are far apart on an agreement. Democrats do not want to fund the border wall that Trump has long sought and Republicans want any agreement to protect the “Dreamer” children of illegal immigrants to include increased border security. Reporting By James Oliphant and Steve Holland; Writing by Steve Holland; Editing by Bill Trott", "external_links": [], "published": "2018-01-06T20:22:00.000+02:00", "crawled": "2018-01-06T20:52:12.004+02:00", "highlightTitle": ""}