{"organizations": [], "uuid": "f77d4fda06dabd97b3111fa5857d91db57c9de4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223000043&w=1200&r=LYNXMPEE0H0S4", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/pakistan-polio-attack/gunmen-in-pakistan-kill-two-women-working-to-eradicate-polio-idINKBN1F71A0", "country": "US", "domain_rank": 408, "title": "Gunmen in Pakistan kill two women working to eradicate polio", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T12:58:00.000+02:00", "replies_count": 0, "uuid": "f77d4fda06dabd97b3111fa5857d91db57c9de4b"}, "author": "", "url": "https://in.reuters.com/article/pakistan-polio-attack/gunmen-in-pakistan-kill-two-women-working-to-eradicate-polio-idINKBN1F71A0", "ord_in_thread": 0, "title": "Gunmen in Pakistan kill two women working to eradicate polio", "locations": [], "entities": {"persons": [{"name": "naseebullah khan", "sentiment": "none"}, {"name": "khan", "sentiment": "none"}, {"name": "sakina bibi", "sentiment": "none"}, {"name": "gul yousafzai", "sentiment": "none"}, {"name": "alizah", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "quetta", "sentiment": "none"}, {"name": "quetta", "sentiment": "none"}, {"name": "baluchistan province", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 11:01 AM / Updated 6 hours ago Gunmen in Pakistan kill two women working to eradicate polio Gul Yousafzai 3 Min Read \nQUETTA, Pakistan (Reuters) - Gunmen in Pakistan shot and killed two women working on a polio eradication campaign on Thursday, the latest in a string of attacks on efforts to protect children from the crippling and sometimes deadly disease. \nNo group claimed responsibility for the killings in the southwestern city of Quetta but such attacks have in the past been carried out by Islamist militants, who oppose the immunization of children as un-Islamic. \nSakina Bibi, 50, and her 20-year-old daughter, Alizah, were giving immunisation drops to children when two gunmen riding on a motorcycle shot them, said police official Naseebullah Khan. \n“They died on their way to a hospital,” said Khan. \nThe women were taking part in an immunization campaign in five districts of Baluchistan province, Khan said. Quetta is the provincial capital. \nPakistan is one of only three countries in the world, along with Afghanistan and Nigeria, that suffers from endemic polio, a childhood virus that can cause paralysis or death. \nEfforts to eradicate the disease have been undermined by opposition from militants, who say immunization is a foreign ploy to sterilize Muslim children or a cover for Western spies. \nIn 2015, a suicide bomber killed 15 people outside a vaccination centre in Quetta in an attack claimed by the Pakistani Taliban and another militant group, Jundullah. \nSuspicion of immunization drives was compounded by the hunt for al Qaeda leader Osama bin Laden, architect of the 2001 attacks on the United States. \nA Pakistani doctor has been accused of using a fake vaccination campaign to collect DNA samples that the U.S. Central Intelligence Agency (CIA) was believed to have been using to try to track down bin Laden. \nBin Laden was killed in a covert raid by U.S. special forces in 2011 in the Pakistani town of Abbottabad, where he had been hiding. \nPakistan Prime Minister Shahid Khaqan Abbasi condemned the Thursday attack and ordered an investigation. \n“Polio teams are rendering a huge national service to save our children from the crippling disease. Attack on these dedicated workers, risking their lives for their nation, is an attack on our future,” Abbasi’s office said in a statement. \nIn another attack on Thursday, unidentified gunmen killed two policemen on patrol in Quetta, police said. \nBaluchistan, a strategically important region bordering Iran as well as Afghanistan, is plagued by violence by Sunni Islamist sectarian groups linked to the Taliban, al Qaeda and Islamic State. It also has an indigenous ethnic Baloch insurgency fighting against the central government. Writing by Asif Shahzad; Editing by Robert Birsel", "external_links": [], "published": "2018-01-18T12:58:00.000+02:00", "crawled": "2018-01-18T13:14:19.011+02:00", "highlightTitle": ""}