{"organizations": [], "uuid": "0c28b9d08c32fdf4f11e2980cf09008d542b2189", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-walter-investment-management-corp-prepackaged-chapter-11-plan-approved-by-court.html", "country": "US", "domain_rank": 767, "title": "Walter Investment Management Corp. Prepackaged Chapter 11 Plan Approved By Court", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-18T02:16:00.000+02:00", "replies_count": 0, "uuid": "0c28b9d08c32fdf4f11e2980cf09008d542b2189"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-walter-investment-management-corp-prepackaged-chapter-11-plan-approved-by-court.html", "ord_in_thread": 0, "title": "Walter Investment Management Corp. Prepackaged Chapter 11 Plan Approved By Court", "locations": [], "entities": {"persons": [{"name": "walter", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "walter investment management corp", "sentiment": "negative"}, {"name": "walter investment management corp.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "reverse mortgage solutions, inc.", "sentiment": "none"}, {"name": "ditech financial llc", "sentiment": "none"}, {"name": "united states bankruptcy court for the southern district of new york", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT WASHINGTON, Pa., Walter Investment Management Corp. (\"Walter\" or the \"Company\") (NYSE: WAC.BC) today announced that the United States Bankruptcy Court for the Southern District of New York (the \"Court\") has approved the Company's prepackaged financial restructuring plan (the \"Prepackaged Plan\"). The Company expects to emerge from Chapter 11 by no later than January 31, 2018, after the conditions to the Prepackaged Plan are satisfied, and the Company is on track to complete its financial restructuring in the first quarter of 2018.\nAs previously announced, the Company's comprehensive financial restructuring plan is expected to reduce the Company's outstanding corporate debt by approximately $800 million 1 and create enhanced financial flexibility. Walter's operating entities, including Ditech Financial LLC (\"Ditech\") and Reverse Mortgage Solutions, Inc. (\"RMS\"), are continuing to operate in the ordinary course.\nProposed Board Appointments\nIn connection with the approval of its Prepackaged Plan, Walter has also announced the proposed composition of its post-emergence date Board of Directors.\nThe Walter Board will be comprised of nine (9) directors. Current directors George Awad, Daniel Beltzman, and Neal Goldman will continue to serve as directors of the Company post-emergence. Messrs. Frederick Arnold, David Ascher, Seth Bartlett, Claude LeBlanc, Thomas Marano, and Thomas Miglis, who have each been designated by an ad hoc group of consenting senior noteholders, will also serve as directors.\nThe term of the new board members will begin upon the Company's emergence from Chapter 11 later this month, at which time the Company expects to supplement this press release with a formal announcement of the Company's emergence and the installation of its new board.\n\"We look forward to officially welcoming the incoming members of our Board, who will bring proven track records and new perspectives from both inside and outside our industry, and will play an important role in helping guide our Company forward following our financial restructuring process,\" said Mr. Awad, the current Chairman of the Board of Walter. \"Once formally appointed, I look forward to working closely with them to create value as we advance our mission of serving our customers throughout the homeownership journey.\"\nMr. Awad continued, \"I would also like to thank Walter's outgoing board members for their service to the Company. Their leadership was instrumental in building Walter into a diversified mortgage banking company and they helped oversee the transformation that is expected to position our Company for future growth and success.\"\nAdditional Information\nAdditional information about Walter's financial restructuring is available on the Company's website at http://www.walterinvestment.com/restructuring.html or by calling the Company's Restructuring Hotline, toll-free at 866-430-6844 or 1-646-795-6176 for calls originating outside of the U.S. Questions can also be emailed to walterinfo@PrimeClerk.com . In addition, court filings and other documents related to the court proceedings are available on a separate website administered by Walter's claims agent, Prime Clerk, at http://cases.primeclerk.com/Walter .\nAdvisors\nWeil, Gotshal & Manges LLP is acting as legal counsel, Houlihan Lokey is acting as investment banking debt restructuring advisor and Alvarez & Marsal North America, LLC is acting as financial advisor to the Company in connection with the financial restructuring.\nAbout Walter Investment Management Corp.\nWalter Investment Management Corp. is an independent servicer and originator of mortgage loans and servicer of reverse mortgage loans. Based in Fort Washington, Pennsylvania, the Company has approximately 4,100 employees and services a diverse loan portfolio. For more information about Walter Investment Management Corp., please visit the Company's website at www.walterinvestment.com . The information on the Company's website is not a part of this release.\nCautionary Statements Regarding Forward-Looking Information\nCertain statements in this press release constitute \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act, as amended. Statements that are not historical fact are forward-looking statements. Certain of these forward-looking statements can be identified by the use of words such as \"believes,\" \"anticipates,\" \"expects,\" \"intends,\" \"plans,\" \"projects,\" \"estimates,\" \"assumes,\" \"may,\" \"should,\" \"could,\" \"would,\" \"shall,\" \"will,\" \"seeks,\" \"targets,\" \"future,\" or other similar expressions. Such forward-looking statements involve known and unknown risks, uncertainties and other important factors, and our actual results, performance or achievements could differ materially from results, performance or achievements expressed in these forward-looking statements. Such statements include, but are not limited to, statements relating to the Prepackaged Plan and court-supervised restructuring process, descriptions of management's strategy, plans, objectives, expectations, or intentions and descriptions of assumptions underlying any of the above matters and other statements that are not historical fact.\nThese forward-looking statements are based on the Company's current beliefs, intentions and expectations and are not guarantees or indicative of future performance, nor should any conclusions be drawn or assumptions be made as to any potential outcome of any proposed transactions the Company considers. Risks and uncertainties relating to the restructuring include: the Court's rulings in the Chapter 11 case and the outcome of the Chapter 11 case in general; the length of time the Company will operate under Chapter 11; risks associated with third-party motions in the Chapter 11 case, which may interfere with the Company's ability to develop and consummate the Prepackaged Plan or other plan of reorganization; the ability to satisfy all conditions precedent to the Prepackaged Plan; the ability of the Company to successfully execute the Prepackaged Plan without substantial disruption to the business of, or a Chapter 11 bankruptcy filing by, one or more of its primary operating or other subsidiaries; the effects of disruption from the restructuring making it more difficult to maintain business, financing and operational relationships, to retain key executives and to maintain various licenses and approvals necessary for the Company to conduct its business; increased legal and advisor costs related to the Chapter 11 cases and other litigation and the inherent risks involved in a bankruptcy process; the ability of the Company to comply with the terms of the restructuring support agreements, including completing various stages of the restructuring within the dates specified by the restructuring support agreements; the ability of the Company to maintain the listing of its common stock on the New York Stock Exchange; and the ability of the Company to continue as a going concern. Important assumptions and other important factors that could cause actual results to differ materially from those forward-looking statements include, but are not limited to, those factors, risks and uncertainties described in more detail under the heading \"Risk Factors\" and elsewhere in the Company's annual and quarterly reports, including amendments th", "external_links": ["http://www.walterinvestment.com/", "http://cases.primeclerk.com/Walter", "http://www.walterinvestment.com/restructuring.html", "http://www.prnewswire.com/news-releases/walter-investment-management-corp-prepackaged-chapter-11-plan-approved-by-court-300584299.html"], "published": "2018-01-18T02:16:00.000+02:00", "crawled": "2018-01-18T03:21:03.014+02:00", "highlightTitle": ""}