{"organizations": [], "uuid": "5638486fb621633700ea589ba875d6fd566db7f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104924001-GettyImages-831175246.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/16/youtube-is-trying-to-clean-itself-up-by-making-it-much-harder-for-small-video-makers-to-make-money.html", "country": "US", "domain_rank": 767, "title": "YouTube is trying to clean itself up by making it much harder for small video makers to make money", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T01:27:00.000+02:00", "replies_count": 0, "uuid": "5638486fb621633700ea589ba875d6fd566db7f0"}, "author": "Peter Kafka", "url": "https://www.cnbc.com/2018/01/16/youtube-is-trying-to-clean-itself-up-by-making-it-much-harder-for-small-video-makers-to-make-money.html", "ord_in_thread": 0, "title": "YouTube is trying to clean itself up by making it much harder for small video makers to make money", "locations": [], "entities": {"persons": [{"name": "travis kalanick", "sentiment": "none"}], "locations": [{"name": "mozilla", "sentiment": "none"}], "organizations": [{"name": "youtube", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "fcc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YouTube is going to make it harder for small video makers to make money.\nThe world's largest video site will kick thousands of people out of its ad revenue-sharing program, and will make it much harder for new ones to get into the program.\nThe change, which goes into effect today, is one of YouTube's responses to a year of criticism it has generated for a series of scandals involving questionable and offensive content that has appeared on the site.\nMore from Recode:\nFrom 22 state attorneys general to Mozilla, net neutrality supporters have asked a court to reject the FCC's recent repeal Travis Kalanick discussed compensating the driver he berated in that viral video Senate Democrats say they're a vote shy of reviving net neutrality. They're doomed to fail anyway. Another change, as Recode reported last week : An overhaul of YouTube's \"Google Preferred\" program, which is already aimed at creating ad-friendly sections of the site for marketers.\nMost important is a pledge from YouTube that every single video in its Preferred program — including the thousands of clips uploaded so far — will be approved by a human \"for their compliance with our advertiser-friendly guidelines.\"\nThe changes won't prevent people from uploading offensive content to YouTube, which hoovers up hundreds of hours of new video per minute. But they are meant to make it hard for the people who upload that stuff to make money from it. And they are an important symbolic change for YouTube, which was founded on the idea that anyone can use the platform, and has spent years trying to entice video makers to find audiences and create careers on the site.\nYouTube's new rules require anyone who wants to generate ad dollars on the platform to first generate 4,000 hours of \"watchtime\" over a 12-month period, and to attract at least 1,000 subscribers. That replaces a lower hurdle of 10,000 lifetime views, which the site instituted last spring, after a first wave of negative stories about rogue content .\nThe rules are retroactive for existing YouTube \"partners,\" who share ad revenue with the platform, which means that the site will kick some out of the rev-share program after a 30-day grace period.\nIn a blog post, YouTube says the new rules will affect \"a significant\" number of its user-created channels, but won't provide an official tally. One person with knowledge of the situation said it will affect \"tens of thousands\" of creators.\nBut YouTube does say that most people who are being kicked out weren't making much money to begin with: \"99 percent of those affected were making less than $100 per year in the last year, with 90 percent earning less than $2.50 in the last month,\" the company says in a post credited to chief product officer Neal Mohan and chief business officer Robert Kyncl.\nThe idea: If you're serious about making stuff — and money — on YouTube, no problem. But this will theoretically make it harder for people to game the system.\nYouTube is also promising to manually review all of the videos in its Google Preferred program, which is aimed at advertisers who want assurances that their videos will run next to brand-safe clips. Google instituted that program years ago to woo advertisers more comfortable with TV than with user-generated content.\nYouTube will use an army of contractors to review the clips — the company has said it will employ more than 10,000 people for the task this year . And within Google Preferred, the company says it will also make distinctions about how brand-safe its content will be, via a \"three-tier suitability system\" that the company says will \"give them appropriate placements for their brand, while understanding potential reach trade offs.\" Translation: More popular stuff may be riskier, brand-wise, but we will sell it to you if you want.\nWe'll talk to YouTube CEO Susan Wojcicki about this next month, when she comes to our Code Media event in Huntington Beach, Calif. You can join us there .\n— By Peter Kafka , Recode\nCNBC's parent NBCUniversal is an investor in Recode's parent Vox, and the companies have a content-sharing arrangement.\nWATCH: YouTube takes on Spotify show chapters YouTube takes on Spotify 6:15 PM ET Fri, 8 Dec 2017 | 00:51", "external_links": [], "published": "2018-01-17T01:27:00.000+02:00", "crawled": "2018-01-17T02:17:05.024+02:00", "highlightTitle": ""}