{"organizations": [], "uuid": "f7b85c029d4f6f79515fe49f7d7e3da771996b60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/venezuela-economy-cryptocurrency/advisers-urge-deep-discount-in-venezuelan-cryptocurrency-offering-idUSL1N1PB0O3", "country": "US", "domain_rank": 408, "title": "Advisers urge deep discount in Venezuelan cryptocurrency offering", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T01:46:00.000+02:00", "replies_count": 0, "uuid": "f7b85c029d4f6f79515fe49f7d7e3da771996b60"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/venezuela-economy-cryptocurrency/advisers-urge-deep-discount-in-venezuelan-cryptocurrency-offering-idUSL1N1PB0O3", "ord_in_thread": 0, "title": "Advisers urge deep discount in Venezuelan cryptocurrency offering", "locations": [], "entities": {"persons": [{"name": "maduro", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}], "locations": [{"name": "caracas", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CARACAS, Jan 16 (Reuters) - Advisers to the Venezuelan government are recommending it sell $2.3 billion of its new cryptocurrency, the petro, in a private offering at a discount of up to 60 percent, according to a document reviewed by Reuters.\nPresident Nicolas Maduro is pressing ahead with an attempt to capitalize on the success of cryptocurrencies like bitcoin by creating one for Venezuela as its traditional currency, the bolivar, plunges to all-time lows against the dollar and the country struggles with hyperinflation.\nMaduro said each petro would be backed by one barrel of Venezuelan oil, and would be sold at the same price, which last week averaged $60.40 per barrel. That would put the value of the entire petro issuance of 100 million tokens at just over $6 billion.\nThe recommendation to sell at a discount by newly formed advisory group VIBE, made up of cryptocurrency experts close to the government, indicates that Maduro’s valuation of the nascent petro faces significant market skepticism.\nThe OPEC nation, struggling with widespread shortages of food and medicine, is seeking to raise hard currency amid the crippling crisis.\nMaduro surprised many in early December when he announced the creation of a cryptocurrency as a way to circumvent U.S. sanctions that have hurt Venezuela’s access to international banks.\n“The center of financial policy will be the consolidation of the petro,” said Maduro in his annual message on Monday.\n“This cryptocurrency is the future of humanity. Venezuela has entered the future.”\nHowever, many were left confused.\nVenezuela’s opposition-run Congress has declared the petro an illegal debt issuance by a government desperate for cash, and has said it will not recognize it.\nSanctions by Washington prevent U.S. citizens from acquiring newly issued Venezuelan debt, but do not specifically mention cryptocurrencies.\n‘ILLEGAL’ ISSUANCE\nVIBE recommended Venezuela sell 38.4 million petros with a face value of around $2.3 billion in private placements starting on Feb. 15 at a discount of up to 60 percent. Another 44 million petros with a face value of $2.7 billion should be offered to the public a month later.\nThe remainder should be shared between the government and VIBE, the document said.\nHigh-ranking government advisers have discussed the proposal, according to a source familiar with the situation. It was not immediately clear if the proposal would be accepted.\nThe Information Ministry did not immediately respond to a request for comment.\nThe document suggested the government accept tax payments in petros, and that state oil company PDVSA incorporate cryptocurrencies in its dealings with foreign companies.\nThe country’s opposition said it is illegal to use oil reserves — of which Venezuela has the largest in the world — to issue debt.\n“I remind President Maduro that the hydrocarbons law prevents him from using the country’s oil reserves without parliamentary approval,” wrote opposition lawmaker Angel Alvarado on Twitter earlier this month.\n“His claim to issue $6 billion in debt, denominated in petro, against 100 million barrels is illegal.”\nMaduro said the cryptocurrency issuance would take place via online exchanges, but he did not give further details.\nSome of the exchanges would work with bolivars, Venezuela’s collapsing local currency, while others would exchange other cryptocurrencies for the petro, said an adviser.\nThe petro will be pre-mined, meaning that unlike bitcoin, for example, new tokens cannot be created. This is the case with another popular cryptocurrency, ripple.\nThe document suggested the petro be a token on the Ethereum network, widely used by the cryptocurrency community. Its native coin is the ether, whose market capitalization is second only to bitcoin. (Additional reporting by Corina Pons; Editing by Brian Ellsworth and Jeffrey Benkoe)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T01:46:00.000+02:00", "crawled": "2018-01-17T20:02:18.000+02:00", "highlightTitle": ""}