{"organizations": [], "uuid": "6b212da9da7df85faa05a718fc6abcf23538c5f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/canada-forex/canada-fx-debt-c-slides-as-nafta-worries-dent-rate-hike-bets-idUSL1N1P51TX", "country": "US", "domain_rank": 408, "title": "CANADA FX DEBT-C$ slides as NAFTA worries dent rate hike bets", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.282, "site_type": "news", "published": "2018-01-11T04:24:00.000+02:00", "replies_count": 0, "uuid": "6b212da9da7df85faa05a718fc6abcf23538c5f5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/canada-forex/canada-fx-debt-c-slides-as-nafta-worries-dent-rate-hike-bets-idUSL1N1P51TX", "ord_in_thread": 0, "title": "CANADA FX DEBT-C$ slides as NAFTA worries dent rate hike bets", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "mark mccormick", "sentiment": "none"}, {"name": "fergal smith", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "bank of canada", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "fx strategy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds strategist Quote: and details throughout; updates prices) * Canadian dollar at C$1.2574, or 79.53 U.S. cents * Loonie touches its weakest since Dec. 29 at C$1.2583 * Bond prices rise across the yield curve * Canada-U.S. 2-year spread widens by 6.7 basis points By Fergal Smith TORONTO, Jan 10 (Reuters) - The Canadian dollar weakened to its lowest this year against the greenback on Wednesday as worries about the outlook for NAFTA tempered bets that the Bank of Canada will raise interest rates next week. Canada is increasingly convinced that U.S. President Donald Trump will soon announce that the United States intends to pull out of the North American Free Trade Agreement, two government sources said. Canada sends about 75 percent of its exports to the United States. Developments on NAFTA could throw a \"monkey wrench\" into prospects of a rate hike next week, said Mark McCormick, North American Head of FX Strategy at TD Securities. Chances of the Bank of Canada raising rates next week slipped to 64 percent, the overnight index swaps market indicated. They had climbed to nearly 90 percent after much stronger-than-expected domestic jobs data on Friday and a business survey on Monday that showed optimism. At 2:59 p.m. EST (1959 GMT), the Canadian dollar was trading at C$1.2574 to the greenback, or 79.53 U.S. cents, down 0.9 percent. The currency touched its weakest since Dec. 29 at C$1.2583, extending its retreat from a three-month high on Friday at C$1.2355. The price of oil, one of Canada's major exports, was buoyed by a fall in U.S. crude inventories. U.S. crude oil futures settled nearly 1 percent higher at $63.57 a barrel. The U.S. dollar fell against a basket of major currencies after a report that China may slow or halt its purchases of U.S. Treasury bonds, with the greenback on track to post its biggest single-day drop against the Japanese yen in seven weeks. The value of Canadian building permits fell by 7.7 percent in November from October, Statistics Canada said. Analysts surveyed by Reuters had expected a decrease of 0.3 percent. Canadian government bond prices rose across the yield curve. The 10-year climbed 40 Canadian cents to yield 2.155 percent, after having touched its highest intraday since September 2014 at 2.231 percent. The gap between Canada's two-year yield and its U.S. counterpart widened by 6.7 basis points to a spread of -23.7 basis points. (Reporting by Fergal Smith; Editing by Meredith Mazzilli and Tom Brown)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T04:24:00.000+02:00", "crawled": "2018-01-11T12:20:20.000+02:00", "highlightTitle": ""}