{"organizations": [], "uuid": "85839fb583ee49978b037022b54a4848ba286665", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221142071&w=1200&r=LYNXMPEE0A11V", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-alitalia-m-a-lufthansa-exclusive/exclusive-lufthansa-ceo-calls-for-significant-alitalia-cuts-letter-idUKKBN1F01RW", "country": "US", "domain_rank": 408, "title": "Exclusive - Lufthansa CEO calls for 'significant' Alitalia cuts: letter", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:45:00.000+02:00", "replies_count": 0, "uuid": "85839fb583ee49978b037022b54a4848ba286665"}, "author": "", "url": "https://uk.reuters.com/article/us-alitalia-m-a-lufthansa-exclusive/exclusive-lufthansa-ceo-calls-for-significant-alitalia-cuts-letter-idUKKBN1F01RW", "ord_in_thread": 0, "title": "Exclusive - Lufthansa CEO calls for 'significant' Alitalia cuts: letter", "locations": [], "entities": {"persons": [{"name": "carlo calenda", "sentiment": "none"}, {"name": "khan", "sentiment": "none"}, {"name": "spohr", "sentiment": "none"}, {"name": "carsten spohr", "sentiment": "none"}, {"name": "reuters/michaela rehle", "sentiment": "none"}], "locations": [{"name": "east jerusalem", "sentiment": "none"}, {"name": "munich", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "lufthansa", "sentiment": "negative"}, {"name": "alitalia", "sentiment": "negative"}, {"name": "tesco", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "reuters tv united states", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 1:53 PM / Updated an hour ago Exclusive: Lufthansa CEO calls for significant Alitalia cuts - letter Ilona Wissenbach 3 Min Read \nFRANKFURT (Reuters) - Lufthansa ( LHAG.DE ) sees a need for significant restructuring at Italy’s Alitalia before the German group would be prepared to buy the airline, Lufthansa’s chief executive said in a letter seen by Reuters, tempering expectations for a quick deal. \n“While recognizing the valuable measures that have been undertaken to date... we strongly believe that there remains a considerable amount of work to be achieved before Lufthansa would be in the position to enter comprehensively into the next phase of the process,” Carsten Spohr said in the letter to Italian Industry Minister Carlo Calenda on Thursday. \nHe said a restructured “NewAlitalia” would be smaller in terms of both staff and its fleet. \nAlitalia, which has made a profit only a few times in its 70-year history, was put under special administration last year after staff rejected a plan to cut jobs and salaries. \nThere was no immediate response from the Italian ministry or the airline itself. \nAlitalia has around 9,200 full-time staff, plus a further 1,600 in a state-backed temporary layoff scheme. Any permanent job cuts would be particularly sensitive ahead of a national election in March. \nItaly has said it aims to strike a deal before the election, and a person familiar with the matter has said the commissioners managing Alitalia were hoping to agree exclusive talks within the coming days. Slideshow (2 Images) \nLufthansa, British low-cost carrier easyJet ( EZJ.L ) and U.S. private equity fund Cerberus are among companies that have expressed an interest in Alitalia. \nA source close to the matter had told Reuters in November that Lufthansa had offered 250 million euros ($300 million) to take on most of Alitalia’s fleet of aircraft and half of its staff. \nLufthansa had offered to keep around 90 to 100 Alitalia planes, down from a fleet of 123. It is not interested in Alitalia’s ground handling services. \nAlitalia was once a symbol of Italy’s post-war economic boom but is now struggling to compete against low-cost carriers and high speed trains at home. It has not invested sufficiently in higher-margin long-haul routes to get back to profit. \nRome has ruled out renationalising Alitalia, but the fate of the airline remains politically sensitive and any tough restructuring to suit a foreign investor would rankle - especially if it involved thousands of job cuts. \nSpohr said in the letter to Calenda that he saw “considerable merit” in developing the opportunity to add Alitalia to Lufthansa’s stable of airlines but that the German group was not in position to play a leading role in the Italian company’s restructuring. \n“We therefore strongly recommend and indeed encourage the commissioners to start implementing key restructuring measures which would be common and beneficial to all prospective bidders,” he said. \nLufthansa surpassed Ryanair last year to retake the crown as Europe’s largest airline by passenger numbers. Reporting by Ilona Wissenbach; Additional reporting by Agnieszka Flak; Writing by Maria Sheahan; Editing by Tom Sims and Keith Weir", "external_links": [], "published": "2018-01-11T15:45:00.000+02:00", "crawled": "2018-01-11T16:02:55.000+02:00", "highlightTitle": ""}