{"organizations": [], "uuid": "5a9da405aea279432e0ac6b47fd63ff17d7076bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/19/104228332-GettyImages-83728815.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/06/heres-why-its-still-tough-to-buy-the-winter-coat-you-want-in-january.html", "country": "US", "domain_rank": 767, "title": "Here's why it's still tough to buy the winter coat you want in January", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-06T21:00:00.000+02:00", "replies_count": 0, "uuid": "5a9da405aea279432e0ac6b47fd63ff17d7076bc"}, "author": "Lauren Hirsch", "url": "https://www.cnbc.com/2018/01/06/heres-why-its-still-tough-to-buy-the-winter-coat-you-want-in-january.html", "ord_in_thread": 0, "title": "Here's why it's still tough to buy the winter coat you want in January", "locations": [], "entities": {"persons": [{"name": "frank layo", "sentiment": "none"}, {"name": "kurt salmon", "sentiment": "none"}, {"name": "york", "sentiment": "none"}], "locations": [{"name": "white plains", "sentiment": "none"}, {"name": "moncler", "sentiment": "none"}, {"name": "canada goose", "sentiment": "none"}], "organizations": [{"name": "burlington coat factory", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If a winter snowstorm followed by bone-chilling cold made you finally rethink your plan to hang on to your coat another year, you may be disappointed when you look to find a replacement. A number of winter coats at Moncler , Canada Goose and Mackage are already sold out on their websites and in some department stores. Same can be said for long underwear.\nThe storm, and its subsequent deep freeze, come at a precarious time for retailers.\n\"Retailers are exhaling because they just made it through the big holiday season. Many will be light on inventory, people are catching up from vacations, they're focusing on returns,\" said Frank Layo, managing director at Kurt Salmon, part of Accenture Strategy.\n\"It's not a great time for retailers to have a storm.\"\nRetailers and brands are coming off a strong holiday season, but they still have things they need to prove .\nAnd while the holiday shopping season has long been the most crucial for retailers, sales now extend beyond the holidays, and so do the importance of the weeks that follow. If shoppers look for a scarf, gloves or hat that sold out during the holiday rush, that doesn't so much denote a victory for the retailer as it does a lost sale.\n\"If I sold out of an item, it means I've missed a sale, and you're going to buy it elsewhere. That is never a good thing for a retailer,\" said Mikey Vu, a partner in Bain's retail practice.\nJust two or three out of stocks can drive a shopper to defect to another retailer for the long haul, Vu said.\nThe challenges for retailers to stay in stock are the same for brick and mortar as they are online. Retailers need to make sure they have the right amount of inventory sitting in either their online warehouses or in their stores. Simply moving one item to another location is costly, let alone difficult in the snow.\n\"The most important thing about the supply chain is predictability and consistency,\" said Bain's Vu. \"Anything that disrupts that can be painful. \"Weather impacts retailers in a huge way.\"\nWarehouse space, meanwhile, is precious and expensive. No retailer wants an unwanted scarf taking up warehouse space in July. Retailers have in recent years bought less inventory in hopes of staving off unused excess and fire sale discounts.\nCanada Goose said its sell-outs are part of its strategy. Demand outstripping supply wards off department store discounts. It also told CNBC it sells out of coats regardless of weather.\n\"We actively build customer demand ahead of supply to avoid the promotional activity that is common to the apparel industry, allowing us and our wholesale partners to sell our products at full price,\" said Dani Reiss, president and CEO of Canada Goose .\nMeantime, executives have also worked aggressively to improve their supply chains and inventory management as shoppers become more demanding. Fast fashion has trained consumers to expect new styles at a frequent turnover, and to shop the week, not the season.\nSome of these changes have hinged on using data and advanced analytics to better predict weather and shopping patterns. Retailers have looked to automate their distribution centers, making the turnaround from warehouse to store faster. They've also sought to expedite their suppliers' work itself, expecting them to produce and deliver faster.\nThis means you may have an easier time finding gloves in January, but don't count on it. It's a delicate balance as the retailers try to maximize profits.\n\"After many retailers did a stellar job of fast delivery over Christmas, it's unfortunate that a storm has the potential to undo customer goodwill,\" said Accenture's Layo.", "external_links": [], "published": "2018-01-06T21:00:00.000+02:00", "crawled": "2018-01-06T21:40:29.019+02:00", "highlightTitle": ""}