{"organizations": [], "uuid": "460e1ff9b434cb110c2856dd84be1292c40a64bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-cox-enterprises-promotes-paul-scolese-to-vice-president-of-government-affairs.html", "country": "US", "domain_rank": 767, "title": "Cox Enterprises Promotes Paul Scolese to Vice President of Government Affairs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:30:00.000+02:00", "replies_count": 0, "uuid": "460e1ff9b434cb110c2856dd84be1292c40a64bc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-cox-enterprises-promotes-paul-scolese-to-vice-president-of-government-affairs.html", "ord_in_thread": 0, "title": "Cox Enterprises Promotes Paul Scolese to Vice President of Government Affairs", "locations": [], "entities": {"persons": [{"name": "paul scolese", "sentiment": "negative"}, {"name": "scolese", "sentiment": "none"}, {"name": "joey lesesne", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "cox enterprises", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "public policy office", "sentiment": "none"}, {"name": "akin gump strauss hauer & feld", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 29, 2018 /PRNewswire/ -- Cox Enterprises today announced the promotion of Paul Scolese to Vice President of Government Affairs.\nScolese will be responsible for representing Cox Enterprises before lawmakers in Washington, developing and implementing key public policy positions and building relationships with members of Congress, their staff, industry peers and trade associations.\n\"Paul is absolutely deserving of this promotion,\" said Joey Lesesne, Senior Vice President of Government Affairs. \"He has been an instrumental member of the Public Policy Office, becoming a more active and effective voice on automobile policy issues. He also has exemplified Cox Enterprises' mission and values by leading the community service efforts of the Public Policy Office.\"\nPrior to joining Cox in 2012, Scolese served as an outside government relations consultant to the company's Public Policy Office through the Public Law and Policy practice at the law firm of Akin Gump Strauss Hauer & Feld.\nScolese spent over ten years in the House of Representatives, including three years as a professional staff member to the House Energy and Commerce Committee under Chairman Tom Bliley (VA). He also worked for his hometown Congressman, Representative Bill Paxon (NY) for over seven years.\n\"It is an honor to continue to serve Cox in my new role as Vice President of Government Affairs,\" said Scolese. \"I am privileged to have the opportunity to ensure that Cox Enterprises and our employees have a voice in Washington. As an avid student of politics, I enjoy advising executives across our divisions on the occasionally mysterious ways of Washington.\"\nScolese earned a bachelor of arts in history and German from the State University of New York and a master of arts degree in history from Brown University. He is a former president of the John Carroll Society of the Archdiocese of Washington.\nAbout Cox Enterprises:\nCox Enterprises is a leading communications, media and automotive services company. With revenues exceeding $21 billion and approximately 60,000 employees, the company's major operating subsidiaries include Cox Communications (cable television distribution, high-speed internet access, telephone, home security and automation, commercial telecommunications and advertising solutions); Cox Automotive (automotive-related auctions, financial services, media and software solutions); and Cox Media Group (television and radio stations, digital media, newspapers and advertising sales rep firms).\nThe company's major national brands include Autotrader, Kelley Blue Book and Manheim. Through Cox Automotive, the company's international operations stretch across Asia, Australia, Europe and Latin America. To learn more about Cox's commitment to people, sustainability and our communities, please visit www.CoxCSRReport.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/cox-enterprises-promotes-paul-scolese-to-vice-president-of-government-affairs-300588803.html\nSOURCE Cox Enterprises", "external_links": ["http://www.prnewswire.com/news-releases/cox-enterprises-promotes-paul-scolese-to-vice-president-of-government-affairs-300588803.html", "http://www.coxcsrreport.com/"], "published": "2018-01-29T17:30:00.000+02:00", "crawled": "2018-01-29T19:38:07.000+02:00", "highlightTitle": ""}