{"organizations": [], "uuid": "457c3a02f6948f123df025ee45adbd3afc4d70b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-wolf-greenfield-promotes-four-attorneys-to-shareholder-in-2018.html", "country": "US", "domain_rank": 767, "title": "Wolf Greenfield Promotes Four Attorneys to Shareholder in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.998, "site_type": "news", "published": "2018-01-08T17:05:00.000+02:00", "replies_count": 0, "uuid": "457c3a02f6948f123df025ee45adbd3afc4d70b7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-wolf-greenfield-promotes-four-attorneys-to-shareholder-in-2018.html", "ord_in_thread": 0, "title": "Wolf Greenfield Promotes Four Attorneys to Shareholder in 2018", "locations": [], "entities": {"persons": [{"name": "wolf", "sentiment": "negative"}, {"name": "wolf greenfield", "sentiment": "negative"}, {"name": "brandon s. blackwell", "sentiment": "none"}, {"name": "dan", "sentiment": "none"}, {"name": "brandon blackwell", "sentiment": "none"}, {"name": "daniel t. wehner", "sentiment": "none"}, {"name": "oona", "sentiment": "none"}, {"name": "tim oyer", "sentiment": "none"}, {"name": "brandon", "sentiment": "none"}, {"name": "daniel w. young", "sentiment": "none"}, {"name": "oona m. johnstone", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "greenfield & sacks", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON--(BUSINESS WIRE)-- Intellectual property law firm Wolf, Greenfield & Sacks, P.C. is pleased to announce the promotion of Brandon S. Blackwell PhD, Oona M. Johnstone PhD, Daniel T. Wehner PhD and Daniel W. Young PhD to the position of shareholder, effective January 1, 2018. The promoted attorneys’ legal and technical know-how covers a range of practice areas, including biotechnology, chemical and materials technologies, and electrical and computer technologies.\n“Brandon, Oona, Dan and Dan exemplify the industry-leading skill and extraordinary dedication for which Wolf Greenfield is known,” said Tim Oyer , Wolf Greenfield’s President and Managing Partner. “Their talent, energy and hard work play a key part in helping our clients achieve their business goals. We look forward to seeing them continue to grow and succeed in their new roles.”\nBrandon Blackwell works on domestic and international patent issues for clients in academia and industry. He helps clients build and maintain patent portfolios, and implement patent strategies that help them achieve their business goals. Brandon’s practice focuses on patent prosecution, post-grant activities, freedom to operate and validity opinions, intellectual property transactions and agreements, and portfolio management strategy. Brandon’s technical expertise spans a variety of fields, including chemical and biochemical process engineering, chemistry, materials science, microelectromechanical systems (MEMS), cleantech, medical devices, and nanotechnology.\nOona Johnstone focuses her practice on U.S. and foreign patent prosecution, IP due diligence, client counseling, and post-grant proceedings, including inter partes review (IPR), in the areas of biotechnology, pharmaceuticals and cleantech. Her technical expertise includes RNA-based therapeutics, transgenics, antibodies, metabolic engineering, and systems and synthetic biology. She has extensive experience advising clients on issues related to biologics and biosimilars, and on strategies for maximizing patent term.\nDan Wehner counsels clients in the areas of patent prosecution and portfolio development, patent litigation support, and post-grant proceedings before the U.S. Patent Office. Dan’s practice focuses primarily on assisting healthcare and medical device companies with IP strategy within technical areas including healthcare IT, microfluidics, medical imaging, robotics, diagnostics, artificial intelligence, software-controlled devices and microelectromechanical systems (MEMS). His diverse background crossing the biological-electrical-mechanical spectrum has also enabled Dan to develop patent strategies for clients with technologies related to signal and image processing, semiconductor systems including computer memory and image sensors, power systems, computer software development including mobile apps, speech recognition, and nanotechnology.\nDan Young works with clients across a broad range of technology areas to develop and implement IP strategies that are aligned with their business goals through portfolio management, patent prosecution, due diligence support and third-party IP evaluations, focusing primarily in the areas of cell-based therapies, nucleic acid-based therapies, immuno-oncology approaches, antibodies, vaccines, gene therapies, genomics and bioinformatics, biomedical devices, and marine and clean energy technologies. He currently serves as the Treasurer of the Boston Patent Law Association.\nAbout Wolf Greenfield\nWolf, Greenfield & Sacks, P.C. is the largest Boston-based law firm focused solely on intellectual property (IP) law. The firm’s lawyers are at the forefront of their fields and support leading companies, inventors, and research facilities with a full range of intellectual property portfolio management including patent, copyright and trademark acquisition, prosecution and litigation; post-grant proceedings; opinions and strategic counseling; trade dress protection; intellectual property audits and due diligence; and licensing and other issues related to commercialization of intellectual property. Now in its ninth decade, Wolf Greenfield continues to represent innovators in the fields of biotechnology, chemical & materials technologies, pharmaceuticals, clean technology, electrical & computer technologies, mechanical technologies, medical devices, and consumer products.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005263/en/\nMSL\nBats Jafferji, 781-684-0770\nbats.jafferji@mslgroup.com\nSource: Wolf, Greenfield & Sacks, P.C.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.wolfgreenfield.com%2Fprofessionals%2Fb%2Fblackwell-brandon-s&esheet=51738609&newsitemid=20180108005263&lan=en-US&anchor=Brandon+Blackwell&index=3&md5=470366c4df65c0f7b0aa6f42aac98819", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.wolfgreenfield.com%2F&esheet=51738609&newsitemid=20180108005263&lan=en-US&anchor=Wolf%2C+Greenfield+%26+Sacks%2C+P.C.&index=1&md5=40e734a595de602bea7b33dcc3f8b35f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.wolfgreenfield.com%2Fprofessionals%2Fy%2Fyoung-daniel-w&esheet=51738609&newsitemid=20180108005263&lan=en-US&anchor=Dan+Young&index=6&md5=56c3986e7cc693b2142d30d9d3150a5c", "http://www.businesswire.com/news/home/20180108005263/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.wolfgreenfield.com%2Fprofessionals%2Fw%2Fwehner-daniel-t&esheet=51738609&newsitemid=20180108005263&lan=en-US&anchor=Dan+Wehner&index=5&md5=efcc7ab436e455401ed6e08c22e03f45", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.wolfgreenfield.com%2Fprofessionals%2Fo%2Foyer-timothy-j&esheet=51738609&newsitemid=20180108005263&lan=en-US&anchor=Tim+Oyer&index=2&md5=c0fd34ad2467c7037f60f58b300bca83", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.wolfgreenfield.com%2Fprofessionals%2Fj%2Fjohnstone-oona-m&esheet=51738609&newsitemid=20180108005263&lan=en-US&anchor=Oona+Johnstone&index=4&md5=18d0ecc7ba3bce1534ca40157817f9fc"], "published": "2018-01-08T17:05:00.000+02:00", "crawled": "2018-01-08T19:06:08.008+02:00", "highlightTitle": ""}