{"organizations": [], "uuid": "edd5acf4492ba8afe5915dd76b2ad3e974bd2674", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-women/preview-tennis-survivors-wozniacki-halep-set-for-high-stakes-showdown-idUKL4N1PL2DF", "country": "US", "domain_rank": 408, "title": "PREVIEW-Tennis-Survivors Wozniacki, Halep set for high stakes showdown", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T14:00:00.000+02:00", "replies_count": 0, "uuid": "edd5acf4492ba8afe5915dd76b2ad3e974bd2674"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-women/preview-tennis-survivors-wozniacki-halep-set-for-high-stakes-showdown-idUKL4N1PL2DF", "ord_in_thread": 0, "title": "PREVIEW-Tennis-Survivors Wozniacki, Halep set for high stakes showdown", "locations": [], "entities": {"persons": [{"name": "halep", "sentiment": "negative"}, {"name": "wozniacki", "sentiment": "negative"}, {"name": "serena williams", "sentiment": "none"}, {"name": "lauren davis", "sentiment": "none"}, {"name": "hana mandlikova", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "caroline wozniacki", "sentiment": "none"}, {"name": "wendy turnbull", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}], "organizations": [{"name": "preview-tennis-survivors wozniacki", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 12:03 PM / Updated an hour ago PREVIEW-Tennis-Survivors Wozniacki, Halep set for high stakes showdown Ian Ransom 4 Min Read \nMELBOURNE, Jan 26 (Reuters) - Simona Halep and Caroline Wozniacki will compete for high stakes in Saturday’s Australian Open final, having each needed to save match points to prevent a premature exit at Melbourne Park. \nThe winner at Rod Laver Arena is not only guaranteed a long-awaited maiden grand slam title but also the world number one ranking in the game of thrones that women’s tennis has become in Serena Williams’s absence. \nThe final will be the first between two non-slam winners in 38 years, since Hana Mandlikova beat home favourite Wendy Turnbull in 1980. \nBut in a fortnight where the seeds have been scattered to the wind, Halep and Wozniacki may both feel fortunate to still be in the hunt. \nIn arguably the clash of the tournament, top seed Halep had to save three match points and battle back from a set down in a marathon thriller against American Lauren Davis in the third round. \nStill recovering from an ankle injury, the Romanian needed to save two further match points in another three-set classic against 2016 champion Angelique Kerber in the semi-finals. \nSecond seed Wozniacki also had to save two match points and claw back from 5-1 down in her early round match against Croatia’s Jana Fett. \nLittle wonder Denmark’s most accomplished tennis player described herself as feeling like she was playing with “house money” at Melbourne Park. \nBoth Halep and Wozniacki have been at pains to downplay the significance of Saturday’s decider at Rod Laver Arena. \nHalep said it was “just another match”, while Wozniacki spoke as if steeling herself for disappointment. \n“It’s another finals, it’s another great two weeks,” the 27-year-old told reporters. “Regardless of what happens now, I’ve done my best.” THIRD TIME LUCKY \nBut they will both privately burn for a breakthrough as two players who have come close but never quite been able to seal the deal. \nEach have failed twice in grand slam finals and long played with queries about whether they have the mental fortitude to clinch one of the major trophies. \nWozniacki, who lost the 2009 U.S. Open final to Belgian Kim Clijsters and again in 2014 to Williams, laboured under the tag of “world number one without a grand slam” for the 67 weeks she was at the top in 2010-12. \nSince October, 26-year-old Halep is now the holder of that dubious honour, having missed out in last year’s French Open final to Latvian teen Jelena Ostapenko and also to Maria Sharapova at Roland Garros in 2014. \nIn a tournament that has shaken out a raft of baseline bashers, it is two scrambling counter-punchers that have survived and now have their chance. \nWhen they last met, eventual champion Wozniacki thrashed Halep in straight sets in the round-robin phase of the WTA Finals in Singapore in October and holds a 4-2 career record over the Romanian. \nBut on hardcourts, the ledger is square at 2-2. \n“It’s going to be a different match, new match, a tough one. Emotions are there,” Halep said. \n“Pressures are there for both of us. We’ll see what is going to happen.” \nFactbox on the finalists. (Editing by John O‘Brien)", "external_links": [], "published": "2018-01-26T14:00:00.000+02:00", "crawled": "2018-01-26T14:30:01.017+02:00", "highlightTitle": ""}