{"organizations": [], "uuid": "b914aaf524b50d8459366601855714da3a728564", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-palatin-technologies-inc-announces-fda-clearance-of-investigational-new-drug-ind-application-for-pl-8177-for-ulcerative.html", "country": "US", "domain_rank": 767, "title": "Palatin Technologies, Inc. Announces FDA Clearance of Investigational New Drug (IND) Application for PL-8177 For Ulcerative Colitis", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.885, "site_type": "news", "published": "2018-01-03T15:30:00.000+02:00", "replies_count": 0, "uuid": "b914aaf524b50d8459366601855714da3a728564"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-palatin-technologies-inc-announces-fda-clearance-of-investigational-new-drug-ind-application-for-pl-8177-for-ulcerative.html", "ord_in_thread": 0, "title": "Palatin Technologies, Inc. Announces FDA Clearance of Investigational New Drug (IND) Application for PL-8177 For Ulcerative Colitis", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "cranbury", "sentiment": "none"}], "organizations": [{"name": "fda clearance of investigational new drug", "sentiment": "negative"}, {"name": "palatin technologies, inc", "sentiment": "neutral"}, {"name": "palatin technologies, inc.", "sentiment": "neutral"}, {"name": "fda", "sentiment": "none"}, {"name": "u.s. food and drug administration", "sentiment": "none"}, {"name": "palatin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CRANBURY, N.J., Jan. 3, 2018 /PRNewswire/ -- Palatin Technologies, Inc. (NYSE MKT: PTN), a biopharmaceutical company developing targeted, receptor-specific peptide therapeutics for the treatment of diseases with significant unmet medical need and commercial potential, today announced that the U.S. Food and Drug Administration (FDA) has notified Palatin that it may proceed with its clinical investigation of subcutaneous injection PL-8177 as a potential treatment for patients with ulcerative colitis. The notice to proceed was received following Palatin's submission of an investigational new drug (IND) application for this program. Palatin expects to commence a Phase 1 single and multiple ascending dose study in the current quarter.\nPL-8177, a selective melanocortin receptor 1 (MC1r) agonist peptide, is Palatin's lead clinical development candidate for ulcerative colitis and other inflammatory bowel diseases. Agents that modulate the MC1r system may have therapeutic potential in a variety of inflammatory disease indications.\n\"The FDA's acceptance of this IND application is an important milestone for Palatin, as we accelerate our drug discovery programs following the successful licensing of bremelanotide for hypoactive sexual desire disorder,\" said Carl Spana, Ph.D., president and chief executive officer of Palatin Technologies. \"We are excited about the potential of modulating the melanocortin system in the treatment of a wide variety of diseases, and have multiple programs to develop melanocortin based therapeutics for patients with inflammatory diseases.\"\nPL-8177 is a cyclic peptide that has demonstrated efficacy in animal inflammatory bowel disease models. Palatin has developed an oral formulation of PL-8177 that has been validated in animal studies, and is scheduled to be explored in future clinical investigations. PL-8177 is highly specific for MC1r, with sub-nanomolar affinity binding and EC 50 functional values.\nAbout Palatin Technologies, Inc.\nPalatin Technologies, Inc. is a biopharmaceutical company developing targeted, receptor-specific peptide therapeutics for the treatment of diseases with significant unmet medical need and commercial potential. Palatin's strategy is to develop products and then form marketing collaborations with industry leaders in order to maximize their commercial potential. For additional information regarding Palatin, please visit Palatin's website at www.Palatin.com .\nForward-looking Statements\nStatements in this press release that are not historical facts, including statements about future expectations of Palatin Technologies, Inc., such as statements about potential clinical indications for PL-8177, clinical trial results with PL-8177, potential actions by regulatory agencies including the FDA, regulatory plans, development programs, proposed indications for product candidates and market potential for product candidates, are \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934 and as that term is defined in the Private Securities Litigation Reform Act of 1995. Palatin intends that such forward-looking statements be subject to the safe harbors created thereby. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that could cause Palatin's actual results to be materially different from its historical results or from any results expressed or implied by such forward-looking statements. Palatin's actual results may differ materially from those discussed in the forward-looking statements for reasons including, but not limited to, results of clinical trials, regulatory actions by the FDA and the need for regulatory approvals, Palatin's ability to fund development of its technology and establish and successfully complete clinical trials, the length of time and cost required to complete clinical trials and submit applications for regulatory approvals, products developed by competing pharmaceutical, biopharmaceutical and biotechnology companies, commercial acceptance of Palatin's products, and other factors discussed in Palatin's periodic filings with the Securities and Exchange Commission. Palatin is not responsible for updating for events that occur after the date of this press release.\nView original content with multimedia: http://www.prnewswire.com/news-releases/palatin-technologies-inc-announces-fda-clearance-of-investigational-new-drug-ind-application-for-pl-8177-for-ulcerative-colitis-300576748.html\nSOURCE Palatin Technologies, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/palatin-technologies-inc-announces-fda-clearance-of-investigational-new-drug-ind-application-for-pl-8177-for-ulcerative-colitis-300576748.html"], "published": "2018-01-03T15:30:00.000+02:00", "crawled": "2018-01-03T17:08:10.000+02:00", "highlightTitle": ""}