{"organizations": [], "uuid": "66617bda1f6edb7fc32da674f173be109ad4b3b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224061929&w=1200&r=LYNXMPEE0L0DU", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/ongc-stocks/ongc-shares-surge-on-deal-to-buy-majority-stake-in-hpcl-idINKBN1FB0IY", "country": "US", "domain_rank": 408, "title": "ONGC shares surge on deal to buy majority stake in HPCL", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T08:11:00.000+02:00", "replies_count": 0, "uuid": "66617bda1f6edb7fc32da674f173be109ad4b3b9"}, "author": "", "url": "https://in.reuters.com/article/ongc-stocks/ongc-shares-surge-on-deal-to-buy-majority-stake-in-hpcl-idINKBN1FB0IY", "ord_in_thread": 0, "title": "ONGC shares surge on deal to buy majority stake in HPCL", "locations": [], "entities": {"persons": [], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "ongc", "sentiment": "neutral"}, {"name": "hpcl", "sentiment": "none"}, {"name": "jefferies", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "hindustan petroleum corp ltd", "sentiment": "none"}, {"name": "oil and natural gas corp ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Reuters) - Shares of Oil and Natural Gas Corp Ltd jumped as much as 6.3 percent on Monday after the explorer said it would buy a majority stake in refiner Hindustan Petroleum Corp Ltd for a smaller premium than expected.\nThe gains, which took ONGC’s shares to their highest in nearly one year, came after India’s biggest explorer said on Saturday it would pay 369 billion rupees ($5.77 billion) for a 51.1 percent stake in HPCL from the government at 473.97 rupees per share.\nHPCL shares, however, fell as much as 4.3 percent as the premium paid was only about 14 percent higher than Friday’s closing price, smaller than expected. ONGC also said it would not buy shares from minority investors.\nThe deal was first announced last year, but the companies did not say how much ONGC would pay. Analysts said the agreement would be positive for the state-owned explorer, allowing it to expand into the refining sector where it has a smaller presence.\n“The deal will allow ONGC to navigate periods of oil price downturns relatively smoothly, as refining margins typically expand during such periods,” brokerage Emkay said in a note.\n“Integrated companies tend to generate higher returns during a down-cycle in oil prices compared to a pure-play upstream company.”\nJefferies said it had expected ONGC to pay 500 rupees per share. It added the deal would boost ONGC’s earnings per share by 4-6 percent, while leaving its valuations at just 8.5 times price-to-earnings for the 2019 financial year.\n“ONGC will not be paying an egregious premium,” the brokerage said in a note.\nHPCL Chairman M. K. Surana said on Monday the company would likely be merged with ONGC’s subsidiary Mangalore Refinery and Petrochemicals Ltd to achieve synergy benefits in the refining and petrochemicals sectors, although he noted no discussions had yet taken place.\nMRPL runs a 300,000 barrels-per-day refinery and an adjoining petrochemical project in the Karnataka.\n“As far as MRPL and HPCL are concerned, because it is the same line of business, a merger is a better mode there,” he told Reuters over phone.\nFor the government, the sale of a majority stake in HPCL would provide critical funds as it seeks to meet a fiscal deficit target of 3.2 percent of the gross domestic product.\nThe deal is expected to close by the end of this month.\nONGC shares were up 3.1 percent as of 0855 GMT, compared with a 0.4 percent gain in the broader NSE index. HPCL shares were down 3.5 percent.\n($1 = 63.8675 Indian rupees)\nReporting by Promit Mukherjee in MUMBAI and Jessica Kuruthukulangara in BENGALURU; Editing by Biju Dwarakanath\n ", "external_links": [], "published": "2018-01-22T08:11:00.000+02:00", "crawled": "2018-01-22T08:32:47.035+02:00", "highlightTitle": ""}