{"organizations": [], "uuid": "e577863f20735ca9cadde3046216eab9d979ea49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/14/104587671-cuddy.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/05/8-body-language-mistakes-you-must-avoid-at-work.html", "country": "US", "domain_rank": 767, "title": "8 body language mistakes you must avoid at work", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T20:33:00.000+02:00", "replies_count": 0, "uuid": "e577863f20735ca9cadde3046216eab9d979ea49"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/8-body-language-mistakes-you-must-avoid-at-work.html", "ord_in_thread": 0, "title": "8 body language mistakes you must avoid at work", "locations": [], "entities": {"persons": [{"name": "bernard marr", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Since you're not on the receiving end of your non-verbal communication with others, it's challenging to really \"see\" what signals you convey with your body language. Body language is important. In fact, your non-verbal signals are responsible for communicating 55 percent of your message .\nIf you keep getting passed up for a coveted promotion or are frequently perplexed by how exchanges with co-workers end up not the way you intended, it just might be time to get some feedback about the non-verbal messages you send at work. Ask a trusted mentor or colleague for honest feedback, practice dialogue in front of the mirror or video yourself to see opportunities you have for improvement.\nIf you exhibit any of the body language mistakes to avoid at work that I outline below, it's time to commit to breaking the habit.\nMore from Bernard Marr:\n9 simple tricks to boost your confidence at work\n10 more tell-tale signs that you have a great boss\n7 habits successful people avoid\n1. Concentration face instead of smiles Even though many of you who don't smile often at work aren't necessarily grumpy and dissatisfied, that's what your face conveys. When you walk into a meeting, smile. When you talk on the phone, smile. People want to interact with positive and confident people, so do what you can to plaster a smile on your face whenever you can. And, it's not just good for others. Smiling or even forcing a smile will reduce your stress and make you happier.\n2. Wimpy handshake The way you connect with another when you grab their hand in a handshake is important. You should have good posture, a firm (not rigid) shake and look them in the eye. These actions exude your self-assuredness. A wimpy grip just opens you up to be misunderstood by those you interact with.\n3. Hand placement In addition to your handshake, your hands play an important role in complementing or distracting from your verbal communication. If you are too animated with your hands while you speak, others may believe you're unprofessional and immature. Yet, you should use your hands when you speak, because according to a study by Colgate University people are more likely to listen to you when you do. Those that hide their hands when interacting with others are often viewed as untrustworthy.\n4. Breaking eye contact When interviewing for a job, most of us know it's important to maintain eye contact with the person across the table yet some of us forget to continue this practice once on the job. While you shouldn't stare at the other person, your gaze shouldn't dart back and forth across the room or break away too soon.\nWhen someone is speaking to you, look them in the eye—not at your phone, your computer or your notepad. Eye contact helps connection and builds trust. And, no matter how irritated you are, follow your mom's rules from when you were a teen and never roll your eyes. That's just rude.", "external_links": [], "published": "2018-01-05T20:33:00.000+02:00", "crawled": "2018-01-05T20:51:57.012+02:00", "highlightTitle": ""}