{"organizations": [], "uuid": "5f433db54e98efffd0af3ef2e413c9f439b461cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222378498&w=1200&r=LYNXMPEE0F0KJ", "site_section": "https://www.reuters.com/finance/currencies", "section_title": "Currency Converter, Currencies News | Reuters.com", "url": "https://www.reuters.com/article/uk-britain-sterling-inflation/sterling-drops-slightly-after-uk-inflation-dips-idUSKBN1F50Z6", "country": "US", "domain_rank": 408, "title": "Sterling snaps three-day rally as UK inflation dips", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:50:00.000+02:00", "replies_count": 0, "uuid": "5f433db54e98efffd0af3ef2e413c9f439b461cd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-sterling-inflation/sterling-drops-slightly-after-uk-inflation-dips-idUSKBN1F50Z6", "ord_in_thread": 0, "title": "Sterling snaps three-day rally as UK inflation dips", "locations": [], "entities": {"persons": [{"name": "michael hewson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "cmc markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Sterling snapped a three-day rising streak and fell on Tuesday after data showed softening U.K. inflation in December, although following a recent rally the pound remains close to its highest levels since the vote to leave the European Union in 2016.\n“Headline inflation has trended lower but retail price inflation is firm which is a bit of a mixed bag for sterling and the market will wait for retail sales data to get a clearer picture on the outlook,” said Michael Hewson, chief markets analyst at CMC Markets in London.\nThe latest figures showed UK consumer prices rose 3 percent in December year-on-year, in line with expectations and down from 3.1 percent in November, marking the first drop in inflation since June.\nSterling has rallied in recent days as hopes grew that some European Union member states are prepared to offer Britain more favourable terms when it leaves the bloc, and traders increasingly downplay political risks and instead focus on the better-than-expected performance of the UK economy.\n(Graphic for UK inflation eases as sterling strengthens, click reut.rs/2DEXjNW )\nSterling was trading 0.1 percent weaker at $1.3773 from a high of $1.3780 before the inflation data.\nAgainst a broadly weaker euro, sterling was up slightly at 88.82 cents.\nThe FTSE 100 stock index turned positive while gilt prices were little unchanged after the data release.\n“The market may be reacting to the core inflation rate coming in a little below expectations,” said Kallum Pickering, senior UK economist at Berenberg Bank, referring to the 2.5 percent year-on-year rise in core inflation, below expectations of a 2.6 percent increase.\nPickering said Tuesday’s data did little to change his view of the direction of inflation and monetary policy.\nHe said the impact of a weakened pound on import inflation would shrink in the coming quarters but the Bank of England would remain concerned about the underlying rate of inflation rising over the next year or two.\nAs a result, he said he expected it to hike twice this year as central banks around the world tighten, against the market’s view of one raise.\nThe BoE has said it expects inflation peaked in late 2017 before falling slowly over the next three years to just above its 2 percent target. Many private economists think the fall could be faster, possibly to 2 percent this year.\nThe BoE is widely expected to keep interest rates unchanged at 0.5 percent next month as it waits for signs that wages are rising more quickly.\n“While we expect a notable fall in consumer price inflation over the course of 2018 this decline hasn’t really got underway yet. As the FX impact on sterling fades during the year we expect rising domestically generated inflation (DGI) to only partially take its place,” said George Buckley, chief UK economist at Nomura.\nEditing by Matthew Mpoke Bigg\n ", "external_links": ["http://reut.rs/2DEXjNW", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T17:50:00.000+02:00", "crawled": "2018-01-16T23:14:47.014+02:00", "highlightTitle": ""}