{"organizations": [], "uuid": "eb4cecc29de85107257706de1305e3b0376b7320", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-somalia-insurgency/somali-authorities-say-troops-rescue-32-children-from-terrorist-school-idUSKBN1F816C", "country": "US", "domain_rank": 408, "title": "Somali authorities say troops rescue 32 children from 'terrorist school'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-19T19:26:00.000+02:00", "replies_count": 0, "uuid": "eb4cecc29de85107257706de1305e3b0376b7320"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-somalia-insurgency/somali-authorities-say-troops-rescue-32-children-from-terrorist-school-idUSKBN1F816C", "ord_in_thread": 0, "title": "Somali authorities say troops rescue 32 children from 'terrorist school'", "locations": [], "entities": {"persons": [{"name": "al shabaab", "sentiment": "negative"}, {"name": "abdiasis abu musab", "sentiment": "none"}, {"name": "abdirahman omar osman", "sentiment": "none"}], "locations": [{"name": "middle shabelle", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOGADISHU (Reuters) - Somali authorities said troops stormed a school run by al Shabaab on Thursday night and rescued 32 children who had been taken as recruits by the Islamist militant group.\n“The 32 children are safe and the government is looking after them. It is unfortunate that terrorists are recruiting children to their twisted ideology,” Abdirahman Omar Osman, information minister for the Somali federal government, told Reuters on Friday.\n“It showed how desperate the terrorists are, as they are losing the war and people are rejecting terror.”\nAl Shabaab said government forces, accompanied by drones, had attacked the school in Middle Shabelle region. It said four children and a teacher were killed.\nNo comment was immediately available from the Somali government on the reports of casualties or the use of drones.\n“They kidnapped the rest of the students,” said Abdiasis Abu Musab, al Shabaab’s military spokesman.\n“Human Rights Watch is responsible for the deaths of the students and their teacher because it pointed fingers at them,” he added.\nIn a report this week, the New York-based rights group said that since September 2017, al Shabaab had ordered village elders, teachers in Islamic religious schools, and rural communities to hand over hundreds of children as young as eight.\nThe al Qaeda-linked al Shabaab militia is fighting to topple the U.N.-backed Somali government and establish its own rule based on a strict interpretation of Islam’s sharia law.\nSomalia has been plagued by conflict since the early 1990s, when clan-based warlords overthrew authoritarian ruler Mohamed Siad Barre then turned on each other.\nIn recent years, regional administrations headed by the Mogadishu-based federal government have emerged, and African Union peacekeepers supporting Somali troops have gradually clawed back territory from the Islamist insurgents.\nAdditional reporting by Abdi Sheikh; Writing by Clement Uwiringiyimana; Editing by Andrew Roche\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T19:26:00.000+02:00", "crawled": "2018-01-19T13:34:47.000+02:00", "highlightTitle": ""}