{"organizations": [], "uuid": "1ed6c982b030c65b7ec0c5b88ce6af7b9bf14750", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/australia-stocks-midday/australia-nz-shares-track-global-equities-lower-as-investors-eye-stimulus-exit-idUSL4N1PP15L", "country": "US", "domain_rank": 408, "title": "Australia, NZ shares track global equities lower as investors eye stimulus exit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T03:41:00.000+02:00", "replies_count": 0, "uuid": "1ed6c982b030c65b7ec0c5b88ce6af7b9bf14750"}, "author": "", "url": "https://www.reuters.com/article/australia-stocks-midday/australia-nz-shares-track-global-equities-lower-as-investors-eye-stimulus-exit-idUSL4N1PP15L", "ord_in_thread": 0, "title": "Australia, NZ shares track global equities lower as investors eye stimulus exit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Aussie shares down 0.5 pct\n* Banks lose the most and materials fall on weak commodities prices\n* NZ falls 0.2 pct on consumer staples\nBy Aditya Soni\nJan 30 (Reuters) - Australian shares dipped on Tuesday, led by financials after global equity markets fell on hawkish remarks by a European Central Bank official, which fuelled expectations policymakers will reduce stimulus as world economy improves.\nEquity markets world-over eased on Monday and U.S. Treasury yields surged to more than three-year highs, following the comments made by the ECB official. “The quantitative easing premium coming out of Japan and Europe is helping global bond markets and is pushing bond yields higher,” said Chris Weston, institutional lender at IG Markets.\n“So effectively, when you look at the inflows, what you get from holding Australian financials with high yield becomes relatively less attractive.”\nWeston noted stocks become less attractive when investors can get a higher yield in the fixed income market.\nNine out of 10 main sectors traded in the red as the S&P/ASX 200 index fell 31.4 points, or 0.5 percent, to 6,044 by 0138 GMT. The benchmark added 0.4 percent on Monday.\nBanks accounted for most of the losses on the benchmark, with the Australian financial index dipping 0.5 percent. The “big four” banks fell between 0.3 and 0.6 percent.\nMaterials also fell, underpinned by a drop in Chinese iron ore futures, which touched their weakest level in a month on Monday. Global miner BHP Billiton dipped 1 percent to a near four-week low, while its rival Rio Tinto Ltd slid 0.1 percent.\nShares of gold miner Newcrest Mining Ltd fell 1.7 percent after it posted a 0.3 percent decline in second-quarter gold production, missing analyst estimates.\nBucking the trend, Fortescue Metals Group rose to a two-week high. Fortescue, the world’s fourth-largest producer of iron ore, reported a 3.7 pct fall in second-quarter cash production costs on Tuesday.\nHurt by a fall in oil prices, energy was the worst performing sector on the benchmark. Oil and gas company Woodside Petroleum Ltd dipped 1.8 percent, while Santos Ltd fell to a one-week low.\nEducation provider Navitas Ltd was the biggest percentage loser on the benchmark as it fell 7.1 percent to its lowest since November 2017.\nNavitas saw its net profits crumble by more than 50 percent over the first half of the year, hurt by college closures and lower demand for its English language programmes for migrants. In New Zealand, the benchmark S&P/NZX 50 index declined 0.2 percent, or 12.61 points, to 8,314.98.\nConsumer staples led the decliners, with dairy firm a2 Milk Company Ltd falling 2 percent, dragging the index.\nReporting by Aditya Soni in Bengaluru; Editing by Sam Holmes\n ", "external_links": [], "published": "2018-01-30T03:41:00.000+02:00", "crawled": "2018-01-30T04:22:59.025+02:00", "highlightTitle": ""}