{"organizations": [], "uuid": "e84493435d7040c9f5cf0dd3e290b2f9835f81c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219575258&w=1200&r=LYNXMPEE040LC", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-northkorea-missiles-southkorea-phone/unique-hotline-sets-stage-for-new-north-and-south-korea-talks-idUKKBN1EU104", "country": "US", "domain_rank": 408, "title": "Unique 'hotline' sets stage for new North and South Korea talks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T13:11:00.000+02:00", "replies_count": 0, "uuid": "e84493435d7040c9f5cf0dd3e290b2f9835f81c6"}, "author": "", "url": "https://uk.reuters.com/article/uk-northkorea-missiles-southkorea-phone/unique-hotline-sets-stage-for-new-north-and-south-korea-talks-idUKKBN1EU104", "ord_in_thread": 0, "title": "Unique 'hotline' sets stage for new North and South Korea talks", "locations": [], "entities": {"persons": [{"name": "hyon", "sentiment": "negative"}, {"name": "heekyong yang", "sentiment": "none"}, {"name": "shin", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "koreas", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "paju", "sentiment": "none"}, {"name": "panmunjom", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "liaison office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 14 AM / Updated 3 minutes ago Unique 'hotline' sets stage for new North and South Korea talks Hyonhee Shin , Heekyong Yang 5 Min Read \nSEOUL (Reuters) - The two sides sit within shouting distance, but when North and South Korea this week arranged the first official talks in more than two years, liaison officials spoke using desktop telephone consoles each the size of a small refrigerator. South Korean soldiers patrol along a barbed-wire fence near the demilitarized zone separating the two Koreas in Paju, South Korea, January 3, 2018. REUTERS/Kim Hong-Ji \nThe inter-Korean Liaison Office at the heart of this new spurt of dialogue between the two sides, sits at the Joint Security Area in Panmunjom, the only spot along the heavily fortified demilitarized zone that divides North and South Korea where troops from both sides stand face to face. \nIf the telephone operators wanted to, they could step out of their office and talk to their counterparts only 80 meters (260 feet) away in a separate building across the demarcation line. \n“Like what happened today (Friday), we mostly exchange what we call a ‘telephone notice,’ which basically means that a liaison officer calls the other side and reads a document carrying a proposal or official position on the other’s proposal,” said a senior official with South Korea’s Ministry of Unification, which mans the phone and fax lines at the office. \n\"But other times, say, if you need to deliver a document with official seals, you would call them to arrange a face-to-face meeting at a certain time on the demarcation line.\" (Graphics on 'Lines of communication' - tmsnrt.rs/2m2mx0U ) \nThat happened on a regular basis in the past, when relations were better, the official said, and now Seoul is hoping that these new high-level talks, scheduled for January 9, may bring back an era of more cordial relations between the two Koreas. \n“A VERY DELICATE JOB” \nNorth Korean officials had effectively not answered the phone at Panmunjom since February 2016. During that time, South Korean officials would sometimes use a bull horn to shout messages across the border. \nFor the first time in nearly two years, the hotline was used on Wednesday. On the orders of leader Kim Jong Un, a North Korean official called the South in a preliminary step to a formal dialogue. \nOfficials have released few details of that conversation and several others that have since occurred, although some were decidedly anticlimactic. \nAfter several calls on Wednesday, a North Korean official called to check the line. When the South’s officer asked if the North had anything new to say, the official on the other end of the line said “no” and hung up, according to the Ministry of Unification. \nBut by Friday, the conversations paid off, officials said, with North Korea officially accepting the South’s invitation for formal, face-to-face talks next week on North Korean participation at the Pyeongchang Winter Olympics in South Korea next month. \nThe phone line used to arrange the talks dates to the 1970s, with the current phone installed in 2009, the ministry said. \nPhotos of the phone show a large, wood-panelled console set into a desktop. \nThe system features a computer screen, disk drives, and USB ports, as well as two telephone handsets, one red and one green. \nNo other numbers can be called - the phones use a dedicated line between rooms on the two sides. \n“The red phone is for incoming calls from North Korea and South Korea uses the green phone to make outgoing calls to the North,” a unification ministry spokeswoman said. “We have installed two phones just in case one breaks or something.” \nThe Unification Ministry employees who man the phones on the South side are experts in diplomatic protocol and have in the past played roles in face-to-face talks as well. \n“At first sight it may seem a very simple job,” the senior ministry official said. “But actually it’s a very delicate job because they are not only in charge of the Panmunjom line but when inter-Korean meetings are held, they are also dispatched to the venue as a contact point between the two sides.” \nWhile the phone operators are discouraged from making any jokes about official issues during their conversations, they have in the past built a personal relationship with their counterparts during periods of close communication. \n“As they man the position for a long time, they would talk to each other frequently and therefore naturally foster some personal rapport,” the official said. \nLess is known about the North Koreans on the other end of the line. A South Korean liaison officer who engaged in some of the recent conversations said he has never seen his counterparts’ office on the other side, and referred further questions to the Unification Ministry. Writing by Josh Smith; Editing by Raju Gopalakrishnan", "external_links": [], "published": "2018-01-05T13:11:00.000+02:00", "crawled": "2018-01-05T13:27:03.040+02:00", "highlightTitle": ""}