{"organizations": [], "uuid": "c12804d9fa4da72a747b76c088ec20d2e0a730d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-penn-virginia-announces-accretive-acquisition-in-core-area-and-provides-operational-update-on-significant-well-results.html", "country": "US", "domain_rank": 767, "title": "Penn Virginia Announces Accretive Acquisition in Core Area and Provides Operational Update on Significant Well Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.993, "site_type": "news", "published": "2018-01-02T16:00:00.000+02:00", "replies_count": 0, "uuid": "c12804d9fa4da72a747b76c088ec20d2e0a730d5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-penn-virginia-announces-accretive-acquisition-in-core-area-and-provides-operational-update-on-significant-well-results.html", "ord_in_thread": 0, "title": "Penn Virginia Announces Accretive Acquisition in Core Area and Provides Operational Update on Significant Well Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "penn virginia", "sentiment": "none"}, {"name": "lavaca counties", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "gonzales", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}, {"name": "eagle ford", "sentiment": "none"}, {"name": "hunt oil company", "sentiment": "none"}, {"name": "penn virginia corporation", "sentiment": "none"}, {"name": "eagle ford shale", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "--- Increases Core Net Leasehold Position and Net Drilling Inventory By 13% and 17%, Respectively ---\n--- Strong Well Results Ahead of Type Curve to Drive Early 2018 Production ---\nHOUSTON, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Penn Virginia Corporation (\"Penn Virginia\" or the \"Company\") (NASDAQ:PVAC) today announced that it has entered into a definitive agreement to acquire assets in the Eagle Ford Shale, primarily in Gonzales and Lavaca Counties, from Hunt Oil Company (“Hunt”) for $86 million in cash, subject to customary post-closing adjustments. The Company anticipates the acquisition will close on or before March 1, 2018, with an effective date of October 1, 2017. The acquisition is expected to be funded with borrowings under the Company’s credit facility.\nTransaction Highlights:\nExpands the Company’s core net leasehold position by approximately 13%, or 9,700 net acres (substantially all acreage is held by production) in Area 1, of which 5,700 net acres are currently operated by Penn Virginia. The Company’s operated net Eagle Ford acreage will increase from 93% to more than 99% as a result of the transaction; Includes production of approximately 1,870 barrels of oil equivalent per day (“BOEPD”), of which approximately 89% is oil and 75 de-risked net lower Eagle Ford locations; Adds PDP reserves of approximately 3.8 million barrels of oil equivalent (“MMBOE”), of which approximately 86% is oil; total resource potential is estimated at more than 29 MMBOE; Provides economies of scale which will increase the Company’s cash operating margin since no additional G&A or drilling rigs are required to capture value; and Accretive to Penn Virginia under all measures, including earnings, cash flow and net asset value per share. Acquiring acreage at an estimated price of approximately $2,100 per net acre, including net production value of approximately $65.5 million ($35,000 per flowing BOEPD).\nPenn Virginia Pre-acquisition and Post-acquisition\nAll numbers are approximate\nPre-\nAcquisition\nPenn Virginia\nAcquisition\nPost-\nAcquisition\nPenn\nVirginia (5) Percent\nChange\nNet production (BOEPD) 12,200 (1) 1,870 (2) 14,070 15% Oil - percent of BOEPD 72% (1) 89% (2) 74% 2% Net acreage (3) 75,800 9,700 85,500 13% Gross drilling inventory (3) 605 - 605 - Net drilling inventory (3) 454 75 529 17% Net treatable lateral length (4) 2.8 MM feet 0.45 MM feet 3.25 MM feet 16% (1) Average production for the month of October 2017.\n(2) Average production for the month of September 2017.\n(3) Pre-acquisition Penn Virginia net acreage and drilling inventory as of September 30, 2017.\n(4) Represents total treatable lateral length in net drilling inventory.\n(5) Metrics represent direct impact of acquisition as shown but does not necessarily represent the Company’s results for future periods.\nJohn A. Brooks, President and Chief Executive Officer of Penn Virginia, commented, “This bolt-on acquisition is an excellent fit at an attractive price, increasing our working interest in properties we already own but did not operate. It will establish the Company as operator in 99% of its Eagle Ford assets and improve our ability to optimize our development plan across Area 1. The production is nearly 90% crude oil like most of Penn Virginia’s acreage in Area 1, which receives premium LLS pricing as compared to WTI. The acquisition will increase our net drilling inventory by 17% while requiring no additional G&A expense. Through the combination of increased production and working interest provided by the acquisition, we anticipate full year 2018 production to grow approximately 120% from 2017, and have revised guidance accordingly.”\nOperational Update\nPenn Virginia recently turned to sales the four-well Rhino Hunter pad, in which the Company will hold a 80.5% working interest (post Hunt acquisition). Combined, the four-well pad had a 24-hour initial production rate (“IP”) of 4,455 BOEPD. This IP represents 110% of the Company’s Area 1 type curve. Penn Virginia also turned to sales the three-well Oryx Hunter pad. Combined, the three-well pad had a 24-hour IP of 2,681 BOEPD and is producing at 95% of the Company’s Area 1 type curve. The Company will have a 81.8% working interest (post Hunt acquisition) in all three wells. Additionally, Penn Virginia recently turned to sales the two-well Geo Hunter pad, which was Penn Virginia's second test of its slickwater completion design in Area 2. The two-well pad had a preliminary 24-hour IP of 5,465 BOEPD and is producing at 120% of the Company’s Area 2 type curve. The Company has a 93.17% working interest in both wells. All wells were completed in the lower Eagle Ford Shale.\nThe Company is currently running a three-rig drilling program and is encouraged by improvements made to drilling times since contracting three new drilling rigs in the latter half of 2017. In Area 1, Penn Virginia is actively drilling its third well on the three-well Dubose pad. Drilling and completion of the pad is expected to be completed in early 2018. Two rigs are active in Area 2, where the Company is currently drilling on the three-well McCreary-Technik pad and preparing to commence drilling operations on the three-well Medina pad.\nUpdated Pro Forma Guidance\nThe table below sets forth the Company’s operational pro forma guidance for 2018, which has been updated to reflect the acquisition of the Hunt acreage, assuming the acquisition closes on March 1, 2018.\n2018 Production (BOEPD) Full Year 22,000 – 25,000 74% oil Full Year Capital Expenditures (millions) $320 - $360 Due to the Hunt acquisition, the Company’s working interest in Area 1 will increase from 58% to 77% across 39,500 acres. As a result, the Company expects production growth for the full year of 2018 to be approximately 120% over 2017 levels. The Company’s capital expenditures for 2018 are also projected to be higher due to anticipated drilling on the acquired Hunt acreage. The Company currently plans to maintain a three-rig drilling program throughout 2018 and expects to spend within cash flow by year-end 2018.\nAcquisition Financing\nThe Company expects to finance the Hunt acquisition with borrowings under the Company’s credit facility. In addition, Penn Virginia is in discussions with its bank lending group to further amend and increase its credit facility beyond the current borrowing base of $237.5 million. Consistent with Penn Virginia’s strategy to hedge production, upon closing the Company expects to hedge a significant portion of the oil production associated with the Hunt acquisition. Prior to any additional hedging associated with the acquisition, approximately 50% of the Company’s estimated oil production for 2018 is hedged.\nThe Company is committed to maintaining financial discipline and a strong balance sheet with a targeted net debt to EBITDAX ratio of 1.5x or below. Penn Virginia believes it will achieve that level by the end of 2018. Additionally, the Company still expects to spend within cash flow by year-end 2018.\nPresentation\nAn updated investor presentation has been posted to the Company’s website at www.pennvirginia.com/news-media/presentations .\nAbout Penn Virginia Corporation\nPenn Virginia Corpor", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/a735d629-d48a-4a66-841a-43e3b477e26a", "http://www.pennvirginia.com/news-media/presentations"], "published": "2018-01-02T16:00:00.000+02:00", "crawled": "2018-01-02T16:30:24.003+02:00", "highlightTitle": ""}