{"organizations": [], "uuid": "7fa6fcb3823ff6ea97a3ae063fce01da0bc38b80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-danaher-reports-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Danaher Reports Fourth Quarter And Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.993, "site_type": "news", "published": "2018-01-30T14:00:00.000+02:00", "replies_count": 0, "uuid": "7fa6fcb3823ff6ea97a3ae063fce01da0bc38b80"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-danaher-reports-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Danaher Reports Fourth Quarter And Full Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "danaher corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "dhr", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 30, 2018 /PRNewswire/ -- Danaher Corporation (NYSE: DHR) today announced results for the fourth quarter and full year 2017. For the quarter ended December 31, 2017, net earnings were $856.6 million, or $1.21 per diluted share which represents a 13.0% year-over-year increase.\nNon-GAAP adjusted diluted net earnings per share for the quarter ended December 31, 2017 were $1.19. This represents a 13.5% increase over the comparable 2016 period. For the fourth quarter 2017, revenues increased 11.0% year-over-year to $5.1 billion, with non-GAAP core revenue growth of 5.5%.\nFor the full year 2017, net earnings were $2.5 billion, or $3.50 per diluted share which represents a 13.5% year-over-year increase. Non-GAAP adjusted diluted net earnings per share for 2017 was $4.03 per share, which represents an 11.5% increase over the comparable 2016 amount. Revenues for the full year 2017 increased 8.5% to $18.3 billion, with non-GAAP core revenue growth of 3.5%. The Company generated strong operating cash flow of $3.5 billion for the full year 2017.\nFor the first quarter of 2018, the Company anticipates that diluted net earnings per share will be in the range of $0.71 to $0.74 and non-GAAP adjusted diluted net earnings per share will be in the range of $0.90 to $0.93.\nFor the full year 2018, the Company anticipates that diluted net earnings per share will be in the range of $3.50 to $3.60. The Company continues to expect its 2018 non-GAAP adjusted diluted net earnings per share to be in the range of $4.25 to $4.35.\nThomas P. Joyce, Jr., President and Chief Executive Officer, stated, \"We are very pleased with our strong fourth quarter results. The team delivered 5.5% core revenue growth, solid margin expansion, and double-digit adjusted earnings per share growth. As we reflect back, 2017 was a year of accelerating revenue growth, solid margin improvement, continued growth investment, and great performance at our more recently acquired larger businesses. In addition, mid-teens growth in free cash flow helps position us for more significant capital deployment in 2018.\"\nJoyce continued, \"As we look ahead, we believe that the strength of our portfolio, combined with the power of the Danaher Business System, provide us with the foundation for long-term shareholder value creation.\"\nDanaher will discuss its results during its quarterly investor conference call today starting at 8:00 a.m. ET. The call and an accompanying slide presentation will be webcast on the \"Investors\" section of Danaher's website, www.danaher.com , under the subheading \"Events & Presentations.\" A replay of the webcast will be available in the same section of Danaher's website shortly after the conclusion of the presentation and will remain available until the next quarterly earnings call.\nThe conference call can be accessed by dialing 800-239-9838 within the U.S. or by dialing +1-323-794-2551 outside the U.S. a few minutes before the 8:00 a.m. ET start and telling the operator that you are dialing in for Danaher's investor conference call (access code 9928573). A replay of the conference call will be available shortly after the conclusion of the call and until February 4, 2018. You can access the replay dial-in information on the \"Investors\" section of Danaher's website under the subheading \"Events & Presentations.\" In addition, presentation materials relating to Danaher's results have been posted to the \"Investors\" section of Danaher's website under the subheading \"Quarterly Earnings.\"\nAll results in this release reflect only continuing operations unless otherwise noted.\nABOUT DANAHER\nDanaher is a global science and technology innovator committed to helping its customers solve complex challenges and improving quality of life around the world. Its family of world class brands has leadership positions in some of the most demanding and attractive industries, including health care, environmental and industrial. With more than 20 operating companies, Danaher's globally diverse team of approximately 67,000 associates is united by a common culture and operating system, the Danaher Business System. For more information, please visit www.danaher.com .\nNON-GAAP MEASURES\nIn addition to the financial measures prepared in accordance with generally accepted accounting principles (GAAP), this earnings release also contains non-GAAP financial measures. Calculations of these measures, the reasons why we believe these measures provide useful information to investors, a reconciliation of these measures to the most directly comparable GAAP measures and other information relating to these non-GAAP measures are included in the supplemental reconciliation schedule attached.\nFORWARD-LOOKING STATEMENTS\nStatements in this release that are not strictly historical, including the statements regarding the Company's anticipated financial performance for the first quarter and full year 2018, the Company's opportunities and positioning for 2018 and beyond and any other statements regarding events or developments that we believe or anticipate will or may occur in the future are \"forward-looking\" statements within the meaning of the federal securities laws. There are a number of important factors that could cause actual results, developments and business decisions to differ materially from those suggested or indicated by such forward-looking statements and you should not place undue reliance on any such forward-looking statements. These factors include, among other things, deterioration of or instability in the economy, the markets we serve and the financial markets, contractions or growth rates and cyclicality of markets we serve, competition, our ability to develop and successfully market new products and technologies and expand into new markets, the potential for improper conduct by our employees, agents or business partners, our compliance with applicable laws and regulations (including regulations relating to medical devices and the health care industry), our ability to effectively address cost reductions and other changes in the health care industry, our ability to successfully identify, consummate and integrate appropriate acquisitions and successfully complete divestitures and other dispositions, our ability to integrate the recent acquisitions of Pall Corporation and Cepheid and achieve the anticipated benefits of such transactions, contingent liabilities relating to acquisitions and divestitures (including tax-related and other contingent liabilities relating to the distributions of each of Fortive Corporation and our communications business), security breaches or other disruptions of our information technology systems or violations of data privacy laws, the impact of our restructuring activities on our ability to grow, risks relating to potential impairment of goodwill and other intangible assets, currency exchange rates, tax audits and changes in our tax rate and income tax liabilities, changes in tax laws applicable to multinational companies, litigation and other contingent liabilities including intellectual property and environmental, health and safety matters, the rights of the United States government to use, disclose and license certain intellectual property we license if we fail to commercialize it, risks relating to product, service or software defects, product liability and recalls, risks relating to product manufacturing, the impact of our debt obligations on our operations and liquidity, our relationships with and the performance of our channel partners, uncertainties relating to collaboration arrangements with third parties, commodity costs and surcharges, our ability to adjust purchases and manufacturing capacity to reflect market conditions, reliance on sole sources of supply, the impact of deregulation on demand for our products and services, labor matters, international economic, political, legal, compliance and business factors (including the impact of the UK's decision to leave the EU), disruptions relating to man-made and natural disasters, and pension plan costs. Additional information regarding the factors that may cause actual results to differ materially from these forward-looking statements is available in our SEC filings, including our 2016 Annual Report on Form 10-K and Quarterly Report on Form 10-Q for the third quarter of 2017. These forward-looking statements speak only as of the date of this release and except to the extent required by applicable law, the Company does not assume any obligation to update or revise any forward-looking statement, whether as a result of new information, future events and developments or otherwise.\nDANAHER CORPORATION\nRECONCILIATION OF GAAP TO NON-GAAP FINANCIAL MEASURES\nAdjusted Diluted Net Earnings Per Share from Continuing Operations\nThree-Month Period Ended\nYear Ended\nDecember 31,\n2017\nDecember 31,\n2016\nDecember 31,\n2017\nDecember 31,\n2016\nDiluted Net Earnings Per Share from Continuing\nOperations (GAAP)\n$\n1.21\n$\n1.07\n$\n3.50\n$\n3.08\nPretax amortization of acquisition-related intangible assets A\n0.24\n0.22\n0.94\n0.83\nPretax gains on resolution of acquisition-related matters B,C\n(0.02)\nB\n—\n(0.02)\nB\n(0.02)\nC\nPretax gain on sales of investments D,E\n(0.10)\nD\n—\n(0.10)\nD\n(0.32)\nE\nPretax restructuring, impairment and other related charges\nrecorded in the second quarter of 2017 F\n—\n—\n0.11\n—\nPretax charge for early extinguishment of borrowings G\n—\n—\n—\n0.26\nPretax acquisition-related transaction costs deemed\nsignificant, change in control payments and restructuring\ncosts and fair value adjustments to inventory and deferred\nrevenue H\n—\n0.12\n—\n0.12\nTax effect of all adjustments reflected above I\n(0.01)\n(0.09)\n(0.19)\n(0.21)\nDiscrete tax adjustments and other tax-related adjustments J,K\n(0.13)\nJ\n(0.27)\nK\n(0.21)\nJ\n(0.13)\nK\nAdjusted Diluted Net Earnings Per Share from\nContinuing Operations (Non-GAAP)\n$\n1.19\n$\n1.05\n$\n4.03\n$\n3.61\nForecasted Adjusted Diluted Net Earnings Per Share from Continuing Operations\nThree-Month Period Ending\nMarch 30, 2018\nYear Ending\nDecember 31, 2018\nLow End\nHigh End\nLow End\nHigh End\nForecasted Diluted Net Earnings Per Share from\nContinuing Operations (GAAP)\n$\n0.71\n$\n0.74\n$\n3.50\n$\n3.60\nAnticipated pretax amortization of acquisition-related intangible assets A\n0.24\n0.24\n0.95\n0.95\nTax effect of all adjustments reflected above I\n(0.05)\n(0.05)\n(0.20)\n(0.20)\nForecasted Adjusted Diluted Net Earnings Per Share from\nContinuing Operations (Non-GAAP) 1\n$\n0.90\n$\n0.93\n$\n4.25\n$\n4.35\n1\nThe forward-looking estimates set forth above do not reflect future gains and charges that are inherently difficult to predict and estimate due to their unknown timing, effect and/or significance, such as certain future gains or losses on the sale of investments, acquisition or divestiture-related gains or charges and discrete tax items.\nRevenue Performance\nThree-Month Period\nEnded December 31,\n2017 vs. Comparable\n2016 Period\nYear Ended\nDecember 31, 2017\nvs. Comparable 2016\nPeriod\nTotal Revenue Growth from Continuing Operations (GAAP)\n11.0\n%\n8.5\n%\nLess the impact of:\nAcquisitions and other\n(2.5)\n%\n(4.5)\n%\nCurrency exchange rates\n(3.0)\n%\n(0.5)\n%\nCore Revenue Growth from Continuing Operations (Non-GAAP) 2\n5.5\n%\n3.5\n%\n2\nWe use the term \"core revenue\" to refer to GAAP revenue from continuing operations excluding (1) sales from acquired businesses recorded prior to the first anniversary of the acquisition less the amount of sales attributable to divested businesses or product lines not considered discontinued operations (\"acquisition sales\") and (2) the impact of currency translation. The portion of GAAP revenue from continuing operations attributable to currency translation is calculated as the difference between (a) the period-to-period change in revenue (excluding acquisition sales) and (b) the period-to-period change in revenue (excluding acquisition sales) after applying current period foreign exchange rates to the prior year period. We use the term \"core revenue growth\" to refer to the measure of comparing current period core revenue with the corresponding period of the prior year.\nDANAHER CORPORATION\nRECONCILIATION OF GAAP TO NON-GAAP FINANCIAL MEASURES\n(continued)\nA\nAmortization of acquisition-related intangible assets in the following historical and forecasted periods ($ in millions) (only the pretax amounts set forth below are reflected in the amortization line item above):\nForecasted\nThree-Month Period Ended\nYear Ended\nThree-Month\nPeriod Ending\nYear Ending\nDecember 31,\n2017\nDecember 31,\n2016\nDecember 31,\n2017\nDecember 31,\n2016\nMarch 30, 2018\nDecember 31,\n2018\nPretax\n$\n167.7\n$\n156.5\n$\n660.5\n$\n583.1\n$\n170.1\n$\n679.9\nAfter-tax\n132.5\n123.9\n523.5\n449.7\n134.4\n537.1\nB\nNet gains on resolution of acquisition-related matters in the Life Sciences and Diagnostics segments ($11 million pretax as presented in this line item, $8 million after-tax) for the three-month period and year ended December 31, 2017.\nC\nGains on resolution of acquisition-related matters ($18 million pretax as presented in this line item, $14 million after-tax) for the year ended December 31, 2016.\nD\nGain on sales of investments in the three-month period and year ended December 31, 2017 ($73 million pretax as presented in this line item, $46 million after-tax).\nE\nGain on sales of investments in the year ended December 31, 2016 ($223 million pretax as presented in this line item, $140 million after-tax).\nF\nDuring the year ended December 31, 2017, the Company recorded $76 million of pretax restructuring, impairment and other related charges ($51 million after-tax) primarily related to the Company's strategic decision to discontinue a molecular diagnostic product line in its Diagnostics segment. As a result, the Company incurred noncash charges for the impairment of certain technology-related intangibles as well as related inventory and plant, property and equipment with no further use totaling $49 million. In addition, the Company incurred cash restructuring costs primarily related to employee severance and related charges totaling $27 million. This is addressed in more detail in the \"Statement Regarding Non-GAAP Measures.\"\nG\nCharge for early extinguishment of borrowings ($179 million pretax as presented in this line item, $112 million after-tax) incurred in the third quarter of 2016.\nH\nAcquisition-related transaction costs deemed significant ($12 million pretax as presented in this line item, $9 million after-tax), change in control payments and restructuring costs ($49 million pretax as presented in this line item, $30 million after-tax), and fair value adjustments to inventory and deferred revenue ($23 million pretax as presented in this line item, $14 million after-tax), in each case related to the acquisitions of Cepheid and Phenomenex and incurred in the three-month period and year ended December 31, 2016. The Company deems acquisition-related transaction costs incurred in a given period to be significant (generally relating to the Company's larger acquisitions) if it determines that such costs exceed the range of acquisition-related transaction costs typical for Danaher in a given period.\nI\nThis line item reflects the aggregate tax effect of all nontax adjustments reflected in the table above. In addition, the footnotes above indicate the after-tax amount of each individual adjustment item. Danaher estimates the tax effect of the adjustment items identified in the reconciliation schedule above by applying Danaher's overall estimated effective tax rate to the pretax amount, unless the nature of the item and/or the tax jurisdiction in which the item has been recorded requires application of a specific tax rate or tax treatment, in which case the tax effect of such item is estimated by applying such specific tax rate or tax treatment.\nJ\nDiscrete tax adjustments and other tax-related adjustments for the three-month period and year ended December 31, 2017 include:\n($ in millions)\nThree-Month Period\nEnded December 31,\n2017\nYear Ended\nDecember 31, 2017\nDiscrete income tax gains, primarily related to expiration of statute of limitations 1\n$\n94\n$\n129\nImpact of ASU No. 2016-09, Compensation—Stock Compensation 2\n—\n16\nRemeasurement of deferred tax assets and liabilities as a result of the Tax Cuts and Jobs Act of\n2017 3\n1,219\n1,219\nTransition tax on deemed repatriation of foreign earnings as a result of the Tax Cuts and Jobs Act\nof 2017 4\n(1,218)\n(1,218)\n$\n95\n$\n146\nRepresents (1) discrete income tax gains, primarily related to expiration of statute of limitations ($94 million in the three-month period ended December 31, 2017 and $129 million in the year ended December 31, 2017), (2) equity compensation-related excess tax benefits ($16 million in the year ended December 31, 2017), (3) remeasurement of deferred tax assets and liabilities, net related to enactment of the Tax Cuts and Jobs Act ($1.2 billion gain in the three-month period and year ended December 31, 2017), and (4) transition tax on deemed repatriation of foreign earnings in connection with enactment of the Tax Cuts and Jobs Act ($1.2 billion provision in the three-month period and year ended December 31, 2017).\nOn January 1, 2017, Danaher adopted the updated accounting guidance required by ASU No. 2016-09, Compensation—Stock Compensation, which requires income statement recognition of all excess tax benefits and deficiencies related to equity compensation. We exclude from Adjusted Diluted Net EPS any excess tax benefits that exceed the levels we believe are representative of historical experience. In the first quarter of 2017, we anticipated $10 million of equity compensation-related excess tax benefits and realized $26 million of excess tax benefits, and therefore we have excluded $16 million of these benefits in the calculation of Adjusted Diluted Net Earnings per Share. In the second, third and fourth quarters of 2017, realized equity compensation-related excess tax benefits approximated the anticipated benefit and no adjustments were required.\nK\nDiscrete income tax gains net of discrete income tax charges incurred in the three-month period ended December 31, 2016 ($190 million). Discrete income tax gains net of discrete income tax charges and Fortive separation-related tax costs related to repatriation of earnings and legal entity realignments incurred in the year ended December 31, 2016 ($91 million).\nStatement Regarding Non-GAAP Measures\nEach of the non-GAAP measures set forth above should be considered in addition to, and not as a replacement for or superior to, the comparable GAAP measure, and may not be comparable to similarly titled measures reported by other companies. Management believes that these measures provide useful information to investors by offering additional ways of viewing Danaher Corporation's (\"Danaher\" or the \"Company\") results that, when reconciled to the corresponding GAAP measure, help our investors to:\nwith respect to Adjusted Diluted Net EPS, understand the long-term profitability trends of our business and compare our profitability to prior and future periods and to our peers; and with respect to core revenue, identify underlying growth trends in our business and compare our revenue performance with prior and future periods and to our peers.\nManagement uses these non-GAAP measures to measure the Company's operating and financial performance, and uses a non-GAAP measure similar to Adjusted Diluted Net EPS in the Company's executive compensation program.\nThe items excluded from the non-GAAP measures set forth above have been excluded for the following reasons:\nWith respect to Adjusted Diluted Net EPS: We exclude the amortization of acquisition-related intangible assets because the amount and timing of such charges are significantly impacted by the timing, size, number and nature of the acquisitions we consummate. While we have a history of significant acquisition activity, we do not acquire businesses on a predictable cycle, and the amount of an acquisition's purchase price allocated to intangible assets and related amortization term are unique to each acquisition and can vary significantly from acquisition to acquisition. Exclusion of this amortization expense facilitates more consistent comparisons of operating results over time between our newly acquired and long-held businesses, and with both acquisitive and non-acquisitive peer companies. We believe however that it is important for investors to understand that such intangible assets contribute to revenue generation and that intangible asset amortization related to past acquisitions will recur in future periods until such intangible assets have been fully amortized. We exclude costs incurred pursuant to discrete restructuring plans that are fundamentally different (in terms of the size, strategic nature and planning requirements, as well as the inconsistent frequency, of such plans) from the ongoing productivity improvements that result from application of the Danaher Business System. Because these restructuring plans are incremental to the core activities that arise in the ordinary course of our business and we believe are not indicative of Danaher's ongoing operating costs in a given period, we exclude these costs from the calculation of Adjusted Diluted Net EPS to facilitate a more consistent comparison of operating results over time. With respect to the other items excluded from Adjusted Diluted Net EPS, we exclude these items because they are of a nature and/or size that occur with inconsistent frequency, occur for reasons that may be unrelated to Danaher's commercial performance during the period and/or we believe are not indicative of Danaher's ongoing operating costs or gains in a given period; we believe that such items may obscure underlying business trends and make comparisons of long-term performance difficult. With respect to core revenue, (1) we exclude the impact of currency translation because it is not under management's control, is subject to volatility and can obscure underlying business trends, and (2) we exclude the effect of acquisitions and divested product lines because the timing, size, number and nature of such transactions can vary significantly from period-to-period and between us and our peers, which we believe may obscure underlying business trends and make comparisons of long-term performance difficult.\nDANAHER CORPORATION AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS (unaudited)\n($ and shares in millions, except per share amount)\nAs of December 31\n2017\n2016\nASSETS\nCurrent assets:\nCash and equivalents\n$\n630.3\n$\n963.7\nTrade accounts receivable, less allowance for doubtful accounts of $116.1 and $102.4,\nrespectively\n3,521.8\n3,186.1\nInventories\n1,840.8\n1,709.4\nPrepaid expenses and other current assets\n857.1\n805.9\nTotal current assets\n6,850.0\n6,665.1\nProperty, plant and equipment, net\n2,454.6\n2,354.0\nOther assets\n538.3\n631.3\nGoodwill\n25,138.6\n23,826.9\nOther intangible assets, net\n11,667.1\n11,818.0\nTotal assets\n$\n46,648.6\n$\n45,295.3\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities:\nNotes payable and current portion of long-term debt\n$\n194.7\n$\n2,594.8\nTrade accounts payable\n1,509.9\n1,485.0\nAccrued expenses and other liabilities\n3,087.7\n2,794.2\nTotal current liabilities\n4,792.3\n6,874.0\nOther long-term liabilities\n5,161.1\n5,670.3\nLong-term debt\n10,327.4\n9,674.2\nStockholders' equity:\nCommon stock - $0.01 par value, 2.0 billion shares authorized; 812.5 and 807.7 issued;\n696.6 and 692.2 outstanding, respectively\n8.1\n8.1\nAdditional paid-in capital\n5,538.2\n5,312.9\nRetained earnings\n22,806.1\n20,703.5\nAccumulated other comprehensive income (loss)\n(1,994.2)\n(3,021.7)\nTotal Danaher stockholders' equity\n26,358.2\n23,002.8\nNoncontrolling interests\n9.6\n74.0\nTotal stockholders' equity\n26,367.8\n23,076.8\nTotal liabilities and stockholders' equity\n$\n46,648.6\n$\n45,295.3\nThis information is presented for reference only. Final audited financial statements will include footnotes, which should be referenced when available, to more fully understand the contents of this information.\nDANAHER CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EARNINGS (unaudited)\n($ and shares in millions, except per share amounts)\nThree-Month Period Ended\nDecember 31\nYear Ended December 31\n2017\n2016\n2017\n2016\nSales\n$\n5,085.7\n$\n4,584.3\n$\n18,329.7\n$\n16,882.4\nCost of sales\n(2,246.6)\n(2,084.3)\n(8,137.2)\n(7,547.8)\nGross profit\n2,839.1\n2,500.0\n10,192.5\n9,334.6\nOperating costs:\nSelling, general and administrative expenses\n(1,594.1)\n(1,503.4)\n(6,042.5)\n(5,608.6)\nResearch and development expenses\n(298.9)\n(268.0)\n(1,128.8)\n(975.1)\nOperating profit\n946.1\n728.6\n3,021.2\n2,750.9\nNonoperating income (expense):\nOther income\n72.8\n—\n72.8\n223.4\nLoss on early extinguishment of borrowings\n—\n—\n—\n(178.8)\nInterest expense\n(41.8)\n(32.3)\n(162.7)\n(184.4)\nInterest income\n1.9\n0.1\n7.5\n0.2\nEarnings from continuing operations before income taxes\n979.0\n696.4\n2,938.8\n2,611.3\nIncome taxes\n(122.4)\n50.6\n(469.0)\n(457.9)\nNet earnings from continuing operations\n856.6\n747.0\n2,469.8\n2,153.4\nEarnings from discontinued operations, net of income taxes\n—\n—\n22.3\n400.3\nNet earnings\n$\n856.6\n$\n747.0\n$\n2,492.1\n$\n2,553.7\nNet earnings per share from continuing operations:\nBasic\n$\n1.23\n$\n1.08\n$\n3.55\n$\n3.12\nDiluted\n$\n1.21\n$\n1.07\n$\n3.50\n$\n3.08\nNet earnings per share from discontinued operations:\nBasic\n$\n—\n$\n—\n$\n0.03\n$\n0.58\nDiluted\n$\n—\n$\n—\n$\n0.03\n$\n0.57\nNet earnings per share:\nBasic\n$\n1.23\n$\n1.08\n$\n3.58\n$\n3.69\n*\nDiluted\n$\n1.21\n$\n1.07\n$\n3.53\n$\n3.65\nAverage common stock and common equivalent shares\noutstanding:\nBasic\n697.2\n693.0\n695.8\n691.2\nDiluted\n707.6\n701.9\n706.1\n699.8\n* Net earnings per share amount does not add due to rounding.\nThis information is presented for reference only. Final audited financial statements will include footnotes, which should be referenced when available, to more fully understand the contents of this information.\nDANAHER CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS (unaudited)\n($ and shares in millions)\nYear Ended December 31\n2017\n2016\nCash flows from operating activities:\nNet earnings\n$\n2,492.1\n$\n2,553.7\nLess: earnings from discontinued operations, net of income taxes\n22.3\n400.3\nNet earnings from continuing operations\n2,469.8\n2,153.4\nNoncash items:\nDepreciation\n577.8\n545.0\nAmortization\n660.5\n583.1\nStock-based compensation expense\n139.4\n129.8\nRestructuring and impairment charges\n56.1\n12.0\nPretax loss on early extinguishment of borrowings\n—\n178.8\nPretax gain on sales of investments\n(72.8)\n(223.4)\nChange in deferred income taxes\n(426.9)\n(383.9)\nChange in trade accounts receivable, net\n(161.4)\n(183.1)\nChange in inventories\n(27.4)\n9.4\nChange in trade accounts payable\n(54.4)\n78.1\nChange in prepaid expenses and other assets\n4.4\n(62.4)\nChange in accrued expenses and other liabilities\n312.7\n250.7\nTotal operating cash provided by continuing operations\n3,477.8\n3,087.5\nTotal operating cash provided by discontinued operations\n—\n434.3\nNet cash provided by operating activities\n3,477.8\n3,521.8\nCash flows from investing activities:\nCash paid for acquisitions\n(385.8)\n(4,880.1)\nPayments for additions to property, plant and equipment\n(619.6)\n(589.6)\nProceeds from sales of property, plant and equipment\n32.6\n9.8\nProceeds from sales of investments\n137.9\n264.8\nAll other investing activities\n(8.5)\n21.9\nTotal investing cash used in continuing operations\n(843.4)\n(5,173.2)\nTotal investing cash used in discontinued operations\n—\n(69.8)\nNet cash used in investing activities\n(843.4)\n(5,243.0)\nCash flows from financing activities:\nProceeds from the issuance of common stock\n68.8\n164.5\nPayment of dividends\n(378.3)\n(399.8)\nPayment for purchase of noncontrolling interest\n(64.4)\n—\nMake-whole premiums to redeem borrowings prior to maturity\n—\n(188.1)\nNet (repayments of) proceeds from borrowings (maturities of 90 days or less)\n(3,778.5)\n2,218.1\nProceeds from borrowings (maturities longer than 90 days)\n1,782.1\n3,240.9\nRepayments of borrowings (maturities longer than 90 days)\n(668.4)\n(2,480.6)\nAll other financing activities\n(59.8)\n(27.0)\nTotal financing cash provided by (used in) continuing operations\n(3,098.5)\n2,528.0\nCash distributions to Fortive Corporation, net\n—\n(485.3)\nNet cash provided by (used in) financing activities\n(3,098.5)\n2,042.7\nEffect of exchange rate changes on cash and equivalents\n130.7\n(148.6)\nNet change in cash and equivalents\n(333.4)\n172.9\nBeginning balance of cash and equivalents\n963.7\n790.8\nEnding balance of cash and equivalents\n$\n630.3\n$\n963.7\nSupplemental disclosure:\nDistribution of noncash net assets to Fortive Corporation\n—\n(1,983.6)\nThis information is presented for reference only. Final audited financial statements will include footnotes, which should be referenced when available, to more fully understand the contents of this information.\nDANAHER CORPORATION AND SUBSIDIARIES\nSEGMENT INFORMATION (unaudited)\n($ in millions)\nThree-Month Period Ended\nDecember 31\nYear Ended December 31\n2017\n2016\n2017\n2016\nSales:\nLife Sciences\n$\n1,625.1\n$\n1,454.1\n$\n5,710.1\n$\n5,365.9\nDiagnostics\n1,623.9\n1,431.8\n5,839.9\n5,038.3\nDental\n758.8\n739.3\n2,810.9\n2,785.4\nEnvironmental & Applied Solutions\n1,077.9\n959.1\n3,968.8\n3,692.8\nTotal\n$\n5,085.7\n$\n4,584.3\n$\n18,329.7\n$\n16,882.4\nOperating Profit:\nLife Sciences\n$\n324.3\n$\n244.8\n$\n1,004.3\n$\n818.9\nDiagnostics\n316.7\n180.1\n871.6\n786.4\nDental\n99.3\n113.8\n400.7\n419.4\nEnvironmental & Applied Solutions\n248.6\n229.9\n914.6\n870.0\nOther\n(42.8)\n(40.0)\n(170.0)\n(143.8)\nTotal\n$\n946.1\n$\n728.6\n$\n3,021.2\n$\n2,750.9\nOperating Margins:\nLife Sciences\n20.0\n%\n16.8\n%\n17.6\n%\n15.3\n%\nDiagnostics\n19.5\n%\n12.6\n%\n14.9\n%\n15.6\n%\nDental\n13.1\n%\n15.4\n%\n14.3\n%\n15.1\n%\nEnvironmental & Applied Solutions\n23.1\n%\n24.0\n%\n23.0\n%\n23.6\n%\nTotal\n18.6\n%\n15.9\n%\n16.5\n%\n16.3\n%\nThis information is presented for reference only. Final audited financial statements will include footnotes, which should be referenced when available, to more fully understand the contents of this information.\nView original content: http://www.prnewswire.com/news-releases/danaher-reports-fourth-quarter-and-full-year-2017-results-300589934.html\nSOURCE Danaher Corporation", "external_links": ["http://www.prnewswire.com/news-releases/danaher-reports-fourth-quarter-and-full-year-2017-results-300589934.html", "http://www.danaher.com/"], "published": "2018-01-30T14:00:00.000+02:00", "crawled": "2018-01-30T15:32:27.039+02:00", "highlightTitle": ""}