{"organizations": [], "uuid": "04bb082ca27a4e776ab04ff40dc9213761bb5fe9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 11}, "facebook": {"likes": 25, "shares": 25, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/25/104729444-GettyImages-810723322.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/03/the-us-can-benefit-from-fair-and-reciprocal-trade-in-a-growing-world-economy--commentary.html", "country": "US", "domain_rank": 767, "title": "The US can benefit from fair and reciprocal trade in a growing world economy - commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.028, "site_type": "news", "published": "2018-01-03T11:12:00.000+02:00", "replies_count": 0, "uuid": "04bb082ca27a4e776ab04ff40dc9213761bb5fe9"}, "author": "Dr. Michael Ivanovitch", "url": "https://www.cnbc.com/2018/01/03/the-us-can-benefit-from-fair-and-reciprocal-trade-in-a-growing-world-economy--commentary.html", "ord_in_thread": 0, "title": "The US can benefit from fair and reciprocal trade in a growing world economy - commentary", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "sigmar gabriel", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "state", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "While the American political analysts keep looking for the \"Trump doctrine\" of global relations in terms of military confrontations, their Chinese , French and German colleagues are focusing on economic and financial aspects of the policy slogans \"America First\" and \"Make America Great Again.\"\nTo understand that, recall that President Donald Trump did not make many waves abroad with military threats, but he did raise existential issues by announcing a review of trade policies that got America stuck with annual deficits of $700 billion to $800 billion.\nThat's what got Germans fizzing with fury. Foreign Minister Sigmar Gabriel insisted on coming to Washington in February 2017 for clarifications from Vice President Mike Pence and Secretary of State Rex Tillerson while they were still moving into their new offices. Berlin then followed that up in mid-March with a meeting in Washington that looked like an inter-governmental economic seminar with the new administration, chaired by Trump and Chancellor Angela Merkel .\nWorried about their $164 billion of bilateral trade with the U.S., the Germans were moving fast in trying to protect their export business that accounts for nearly one-half of the economy.\nLet Trump talk dollars and sense The Chinese were not far behind. President Xi Jinping came to Florida in early April to meet Trump and convince him that a \"win-win cooperation\" was much better than intractable frictions in dealing with decades of Washington's neglect while the Chinese were pocketing trillions of dollars from U.S. trade transactions.\nChina's $580 billion of annual trade with the U.S. is an essential feature of Beijing's economic policy as the country rushes to modernize, eradicate poverty and build a \"moderately prosperous society\" over the next two years. That trade is a vector of investment flows and technology transfers that China needs to upgrade the quality of its economic development.\nJobs, incomes and a real wealth creation is what the Europeans and Chinese are fretting about — a sharp contrast to American global strategists who give the economy short shrift, ignore the wellsprings of American power and argue instead about whom to hit next.\nLuckily, the Europeans and the Chinese will continue to focus on sustained economic growth. That should help America to sell them more goods and services to reinvigorate the economy and overcome structural obstacles to a faster potential and noninflationary growth.\nGermany is a good example of such an opportunity. At the moment, the country is experiencing brisk economic activity, full employment and widespread labor shortages. By insisting on a more balanced trade relationship, the U.S. now has a chance to step up export sales to a thriving German economy.\nGermans are also working on new business possibilities. Echoing similar voices in other European countries, members of Germany's possibly new governing coalition are forcefully advocating friendlier U.S.-Russian ties to get rid of sanction wars and reopen access to commerce and investments the Europeans are currently losing to their Asian competitors.\nWith about $80 billion of U.S. trade, France is a much smaller economic partner, but its economy is perking up and offering more lively markets for American products. Paris will also play an important role in future trans-Atlantic economic relations once Germany gets its government and further European Union integration initiatives become top policy issues.\nEuropeans want a trade axis with China For the U.S., China will remain a structurally difficult trade problem in the years ahead — even though some unexpectedly fast progress is being made. For example, in the first 10 months of 2017, American exports to China grew at an annual rate of 13 percent. That is a big turnaround from a 3.5 percent decline during the same period of 2016.\nUnfortunately, political tensions are a serious obstacle to a more balanced bilateral trade. The Chinese view with suspicion and disappointment Washington's refusal to accept Beijing's concepts of \"big power diplomacy\" and \"win-win cooperation.\" The U.S. continues to consider China as a \"strategic competitor,\" and it recently also declined to agree to China's WTO status as a market economy — a big setback for China because that status would have shielded Chinese exports from an avalanche of anti-dumping investigations and lawsuits.\nChina looks like it is taking all that in stride. Beijing has stepped up efforts to diversify China's global trade business, with particular emphasis on East Asia, Belt and Road projects and the Russia-led Eurasian Economic Union, Middle East, Balkans and East Europe, including Ukraine.\nThe EU will also help China with its proposed new \"trade axis linking the EU and China via Russia.\" The French President Emmanuel Macron will be pushing that idea next week during his state visit to Beijing.\nAll that, however, is hardly an alternative to China's estimated $520 billion worth of export sales to the U.S. in the course of 2017. Washington, therefore, retains an enormous trade leverage. But it will be a hard slog to reach a fourfold increase of current monthly exports to China to meaningfully narrow annual trade deficits of $350 billion to $400 billion.\nTrump may wish to think again about linking the China trade with Beijing's efforts to rid North Korea of nuclear weapons and their delivery vehicles. But the president is perfectly justified in his determination to use the principle of fair and reciprocal trade to wind down America's massive wealth and technology transfers through manifestly excessive trade imbalances.\nInvestment thoughts An accelerating increase of American domestic demand (private and government spending plus all segments of investment outlays) will trigger rising imports of foreign goods and services, a widening trade deficit and a drag on GDP growth.\nThat can be offset to a certain extent by ensuring that increasing volumes of American products are sold overseas in accordance with the rule of fair and reciprocal trade to avoid the past experience of systematic and excessive trade deficits with Europe and China. That task would be relatively easier now in an environment of a steadily growing world economy.\nThose running for office in mid-term Congressional elections next November would do well to remember that trade deficits and inflation affect real incomes, asset values, economic activity and the mood on Main Street and Wall Street. That's more important and easier to understand than the sequels to the likely Korean meeting in Panmunjom next week.\nFighting to sell American products abroad, and to hold inflation where it is now, would make it possible for the Fed to support the economy and the real value of dollar-denominated savings instruments.\nCommentary by Michael Ivanovitch, an independent analyst focusing on world economy, geopolitics and investment strategy. He served as a senior economist at the OECD in Paris, international economist at the Federal Reserve Bank of New York, and taught economics at Columbia Business School.\n Twitter.", "external_links": ["http://www.twitter.com/CNBCopinion"], "published": "2018-01-03T11:12:00.000+02:00", "crawled": "2018-01-03T10:27:50.001+02:00", "highlightTitle": ""}