{"organizations": [], "uuid": "80b5be2c17950aca20b50e3498b1f849abd16a25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 60, "shares": 60, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220845285&w=1200&r=LYNXMPEE090XE", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-usa-fed-evans/feds-evans-says-wanted-to-wait-until-midyear-for-rate-hike-idUSKBN1EZ1RS", "country": "US", "domain_rank": 408, "title": "Fed's Evans wants rate hike pause, not concerned on yield curve", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.286, "site_type": "news", "published": "2018-01-10T22:31:00.000+02:00", "replies_count": 0, "uuid": "80b5be2c17950aca20b50e3498b1f849abd16a25"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-fed-evans/feds-evans-says-wanted-to-wait-until-midyear-for-rate-hike-idUSKBN1EZ1RS", "ord_in_thread": 0, "title": "Fed's Evans wants rate hike pause, not concerned on yield curve", "locations": [], "entities": {"persons": [{"name": "evans", "sentiment": "negative"}, {"name": "charles evans", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fed", "sentiment": "negative"}, {"name": "chicago federal reserve bank", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Chicago Federal Reserve Bank President Charles Evans on Wednesday said he would like to wait until mid-2018 before raising rates, a “modest” proposal that would still allow the Fed to raise rates gradually as his colleagues anticipate.\nEvans was one of two policymakers who dissented on the Fed’s decision last month to raise U.S. interest rates, even though he agrees that tax cuts will boost economic growth this year and the labor market will continue to strengthen.\nWhile most other Fed policymakers believe that those conditions will help boost inflation this year, justifying continued rate hikes, Evans said he has seen that forecast for several years running and it has not panned out. Evans says even with a pause in rate hikes, he does not expect inflation to reach the Fed’s 2-percent goal until late 2019 or early 2020.\n“I’d feel a lot more confident if I saw those transitory reductions in the inflation rate go away,” he said, adding that the cost of waiting until midyear would be low. “And if in fact things are worked out we could resume a nice gradual pace (of rate hikes) at that point, and still get the funds rate up to its natural level before too long,” he told reporters.\nEvans said he is not too concerned about the flattening yield curve and a potential inversion, a possibility over which several of his fellow policymakers including St. Louis Fed President James Bullard have recently fretted.\nSome of the flattening, he said, is explained by the fact that economists at the Fed and elsewhere now believe that slower long-run growth means that interest rates in a healthy economy likely need to be only about 2.75 percent, rather than the 4 percent that was the historical norm.\n“I think we have to be mindful of the fact that as we have all repriced real interest rates downwards that’s going to find its way into lower long term interest rates,” he told reporters. “We’ve been increasing short-term rates; it’s natural then almost mechanically for there to be a flattening of it.”\nSome steepening of the yield curve would be consistent with a stronger economy, he said, adding that he expects the U.S. economy to grow a touch faster than 2.5 percent this year, helped by recent tax cuts. That is faster than trend growth and should allow the labor market to continue to strengthen.\nStill, he said, “I do not yet think that we have gotten to a point where we have overshot” on full employment, he added, saying that wage growth would be faster if it had.\nReporting by Ann Saphir; Editing by Chizu Nomiyama\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T22:31:00.000+02:00", "crawled": "2018-01-11T12:17:09.021+02:00", "highlightTitle": ""}