{"organizations": [], "uuid": "2325bc83c94a39afeb34253798f74530b837af04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/algeria-energy/update-2-algerias-sonatrach-to-refine-crude-abroad-to-cut-fuel-import-bill-idUSL8N1PB2HC", "country": "US", "domain_rank": 408, "title": "UPDATE 4-Algeria signs deal with Vitol to cut fuel import bill", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T20:20:00.000+02:00", "replies_count": 0, "uuid": "2325bc83c94a39afeb34253798f74530b837af04"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/algeria-energy/update-2-algerias-sonatrach-to-refine-crude-abroad-to-cut-fuel-import-bill-idUSL8N1PB2HC", "ord_in_thread": 0, "title": "UPDATE 4-Algeria signs deal with Vitol to cut fuel import bill", "locations": [], "entities": {"persons": [{"name": "lamine chikhi", "sentiment": "none"}, {"name": "julia payne", "sentiment": "none"}, {"name": "ahmad ghaddar tiguentourine/london", "sentiment": "none"}], "locations": [{"name": "algeria", "sentiment": "none"}], "organizations": [{"name": "sonatrach", "sentiment": "negative"}, {"name": "vitol", "sentiment": "negative"}, {"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "reuters opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Sonatrach signs deal with Vitol to refine crude abroad\n* Algerian fuel imports more than tripled in value in 2017\n* Agreement to last until end of year\n* Vitol to load first cargo in February (Adds detail)\nBy Lamine Chikhi, Julia Payne and Ahmad Ghaddar\nTIGUENTOURINE/LONDON, Algeria, Jan 16 (Reuters) - Algeria’s state oil firm Sonatrach will exchange crude for refined products with the world’s largest oil trader Vitol, a Sonatrach official said of the rare move that aims to reduce a record fuel import bill.\nVitol would receive up to 2 million barrels a month of the OPEC member’s light, sweet crude and would deliver gasoline and gasoil in return until the end of the year, sources familiar with the matter said.\nA spokeswoman for Vitol, which has a global refining capacity of 480,000 barrels per day (bpd), declined to comment.\nSonatrach, Algeria’s only domestic oil producer, produced about 1 million bpd of crude in December, according to the Reuters OPEC survey.\nThe North African country, which needs to meet surging domestic fuel demand, paid $800 million for fuel imports in 2016 but that more than tripled in 2017 to a record $2.5 billion because of refining problems, a Sonatrach source said.\nThis is the first time in decades that Algeria has done a deal that was arranged like a swap, the sources said.\nCEO Abdelmoumen Ould Kaddour said Sonatrach would pay processing costs before bringing refined fuel back to Algeria.\nTwo of the sources described the deal as a hybrid between a straight swap and a refinery processing agreement, whereby Sonatrach would pay a fee to process crude abroad.\n“Our goal is to reduce our imports of gasoline, they are too high,” Ould Kaddour told reporters on Tuesday.\nHe said the firm was also negotiating to buy shares in a foreign refinery, but did not give details.\nThe deal is due to take effect in early February, according to a document seen by Reuters.\nOne of the sources familiar with the matter said Vitol would have the option to resell the crude on the open market as long as the products provided to Sonatrach met the contract’s specifications.\nOuld Kaddour was speaking on a visit to the southern gas complex of Tiguentourine, operated by Sonatrach, BP and Statoil, where he said gas output was stable at 8.8 billion cubic metres (bcm) per year, just below maximum capacity of around 9 bcm.\nAlgeria, a key supplier of gas to Europe, exported 55 bcm of gas in 2017, Ould Kaddour said. That was up slightly from the 54 bcm it exported in 2016, according to Sonatrach officials.\nHe said Sonatrach was improving relations with its foreign partners and had resolved more than 10 of 15 litigation cases.\nOuld Kaddour’s visit marked the fifth anniversary of an attack by al Qaeda-linked militants at Tiguentourine that killed 40 mostly foreign contractors. (Writing by Aidan Lewis and Julia Payne; Editing by Susan Fenton and Edmund Blair)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T20:20:00.000+02:00", "crawled": "2018-01-17T20:17:46.000+02:00", "highlightTitle": ""}