{"organizations": [], "uuid": "275e7495f196b682bf5fad4db17f7444863117cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225632646&w=1200&r=LYNXMPEE0Q003", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/czech-election-president/pro-russian-president-academic-challenger-face-off-in-dead-heat-czech-presidential-vote-idINKBN1FG008", "country": "US", "domain_rank": 408, "title": "Pro-Russian president, academic challenger face off in dead-heat Czech presidential vote", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T02:03:00.000+02:00", "replies_count": 0, "uuid": "275e7495f196b682bf5fad4db17f7444863117cf"}, "author": "", "url": "https://in.reuters.com/article/czech-election-president/pro-russian-president-academic-challenger-face-off-in-dead-heat-czech-presidential-vote-idINKBN1FG008", "ord_in_thread": 0, "title": "Pro-Russian president, academic challenger face off in dead-heat Czech presidential vote", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "robert muller", "sentiment": "none"}, {"name": "milos zeman", "sentiment": "none"}, {"name": "jiri drahos", "sentiment": "none"}, {"name": "zeman", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "min read  prague", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRAGUE (Reuters) - Czech President Milos Zeman won a second term in a presidential election on Saturday, gaining the backing of voters for his tough stance against immigration and his courtship of Russia and China.\nIn the run-off against strongly pro-European Union academic Jiri Drahos, Zeman scored 51.4 percent to 48.6 percent for his challenger.\nZeman, 73, is the last prominent figure among active politicians from the country’s post-communist transitional period in the 1990s, and has shifted from being a centre-left prime minister 16 years ago to being a president with leanings toward the far-right.\nThe vote showed Czech voters’ concerns over security despite a period of fast economic growth and rising wages. Immigration was a key issue, more than two years after the European Union first faced a major influx of refugees - almost none of whom ever appeared in the Czech Republic.\nThe result will also influence the formation of the next Czech government, with Zeman one of the few political backers of Prime Minister Andrej Babis, whose minority cabinet lost a confidence vote this month due to fraud allegations hanging over the billionaire businessman.\nZeman has been a polarising force, publicly belittling opponents and sniping at intellectual elites and the media. He was one of the few European politicians to back Donald Trump in the 2016 U.S. presidential election.\nHe has upset many with his warm relations with Russian President Vladimir Putin and calls to end EU sanctions against Moscow imposed over its annexation of Crimea.\nHis stance toward Brussels has been lukewarm. He calls himself a federalist and supports membership of the EU while also favouring holding an in-or-out referendum, like the one that led to Britain’s impending exit.\nSpeaking to supporters after claiming victory, Zeman said he would continue travelling the country to meet citizens and hear their worries.\n“This is my last political victory, there will be no political defeats,” he told the crowd, flanked by advisers and the leaders of the far-right, anti-EU and anti-NATO SPD party and the Social Democrat party that he once led.\nPresidential candidate Jiri Drahos votes at a polling station during the second round of the presidential election in Prague, Czech Republic January 26, 2018. REUTERS/Rene Volfik CLASH OF PERSONALITIES Zeman has benefited from rising hostility to immigration, especially to people coming from Muslim states, although the country of 10.6 million received just 116 asylum applications between January and November last year and has only a tiny Muslim community.\nBoth candidates rejected the EU’s refugee quotas, but Drahos was labelled weaker on the issue in attack ads in the last week by Zeman supporters.\n“People around Milos Zeman ... managed to incite fear, a very strong emotion, which is much more important than reason,” political analyst Tomas Lebeda said.\nSlideshow (4 Images) The two presidential candidates were as different personally as politically. Zeman has a self-advertised appetite for alcohol and tobacco and his health is a concern - he suffers from diabetes, and walks with a stick.\nDrahos is a soft-spoken chemistry professor who promised a stronger voice in the EU, reversing the country’s aloofness that has put it closer to Poland and Hungary - two states often at loggerheads with the bloc’s executive.\n“We did not win, but we didn’t lose either. I am terribly happy for this huge wave of energy,” Drahos told supporters.\n“I am convinced this energy will not disappear.”\nZeman’s victory is good news for Babis, who was a runaway winner in parliamentary elections in October with pledges to fight political corruption and run the state better.\nBut police charges that Babis illegally obtained subsidies as a businessman a decade ago - which he denies - have left his party without ruling partners.\nZeman has pledged to give Babis a second chance to form a government and repeated on Saturday that he would let him have ample time.\nReporting by Robert Muller and Jason Hovet; Additional reporting by Jiri Skacel and Jan Lopatka; Editing by Andrew Bolton\n ", "external_links": [], "published": "2018-01-27T02:03:00.000+02:00", "crawled": "2018-01-27T02:26:03.003+02:00", "highlightTitle": ""}