{"organizations": [], "uuid": "9c3b18891446ac7f7c5eb2943da50d74aea5cc92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-qantas-china/prodded-by-china-qantas-amends-website-references-to-taiwan-other-regions-idUSKBN1F5059", "country": "US", "domain_rank": 408, "title": "Prodded by China, Qantas amends website references to Taiwan, other regions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T04:31:00.000+02:00", "replies_count": 0, "uuid": "9c3b18891446ac7f7c5eb2943da50d74aea5cc92"}, "author": "", "url": "https://www.reuters.com/article/us-qantas-china/prodded-by-china-qantas-amends-website-references-to-taiwan-other-regions-idUSKBN1F5059", "ord_in_thread": 0, "title": "Prodded by China, Qantas amends website references to Taiwan, other regions", "locations": [], "entities": {"persons": [{"name": "colin packham", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "macau", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "tibet", "sentiment": "none"}], "organizations": [{"name": "qantas", "sentiment": "negative"}, {"name": "marriott international", "sentiment": "none"}, {"name": "qantas airways", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 2:31 AM / Updated 4 hours ago Prodded by China, Qantas amends website references to Taiwan, other regions Reuters Staff 3 Min Read \nSYDNEY/TAIPEI (Reuters) - Australia’s Qantas Airways said on Tuesday it had amended its website to no longer refer to Taiwan and Hong Kong as countries, rather than Chinese territories, after China issued a warning to foreign airlines last week. \nChina has stepped up efforts to police how foreign businesses refer to parts of China, or territories claimed by Beijing, including Taiwan and Hong Kong - even if only in pull-down menus on websites. \n“Due to an oversight, some Chinese territories were incorrectly listed as countries on parts of our website. We are correcting this error,” said Qantas in an emailed statement. \nChina’s civil aviation authority told foreign airlines to check their websites and make any needed changes, but the campaign goes beyond just airlines. \nTo comply, Qantas has now deleted several lists that categorized destinations by country. \nChina last week suspended Marriott International’s Chinese website for a week to punish the world’s biggest hotel chain for listing Tibet, Taiwan, Hong Kong and Macau as separate countries in a customer questionnaire. \nA Qantas spokeswoman did not immediately respond to questions as to whether the airline expected a similar action by the Chinese authorities. \nPublic apologies from Delta Air Lines, Zara and Medtronic for similar offences have so far satisfied China, which has grown increasingly sensitive to issues of sovereignty. \nQantas is the first Australian company to respond to Beijing’s heightened vigilance, though all firms exporting everything from iron ore to baby formula should be taking heed. \nChina, which is easily Australia’s biggest trading partner, bought A$93 billion ($73.98 billion) worth of Australian goods and services last year. \nHong Kong and Macau are former European colonies that are now part of China but run largely autonomously. China annexed Tibet in 1950, although Beijing has long claimed the Himalayan region has been an indivisible part of China throughout history. \nTaiwan is China’s most sensitive territorial issue. The ruling Communist Party considers the self-ruled, democratic island a wayward province and refuses to renounce the threat of force to bring it into the fold. \nOn Tuesday, Taiwan’s foreign ministry said it had contacted relevant companies to comply with its own government’s strict position on this issue, and to reject China’s difficult and unilateral requests. \n“We are closely watching the following developments,” said foreign ministry spokesman Andrew H.C. Lee. \n“Of course, with the fact that Taiwan is a sovereign, independent country, there won’t be any change to this as a result of China’s unilateral way of handling things.” Reporting by Colin Packham in SYDNEY; Additional reporting by Jess Macy Yu in TAIPEI; Editing by Simon Cameron-Moore", "external_links": [], "published": "2018-01-16T04:31:00.000+02:00", "crawled": "2018-01-16T04:46:56.002+02:00", "highlightTitle": ""}