{"organizations": [], "uuid": "b5ea313e97202391f1454315879b6110256dd21d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/04/104751693-active.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/an-11-million-opportunity-its-time-for-advisors-to-think-about-estate-planning.html", "country": "US", "domain_rank": 767, "title": "An $11 million opportunity: It’s time for advisors to think about estate planning", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.14, "site_type": "news", "published": "2018-01-31T21:00:00.000+02:00", "replies_count": 0, "uuid": "b5ea313e97202391f1454315879b6110256dd21d"}, "author": "Darla Mercado", "url": "https://www.cnbc.com/2018/01/31/an-11-million-opportunity-its-time-for-advisors-to-think-about-estate-planning.html", "ord_in_thread": 0, "title": "An $11 million opportunity: It’s time for advisors to think about estate planning", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Here's a way for financial advisors to strengthen their client relationships: Start a chat about the legacy your client would like to leave for heirs.\nSuch was the focal point of a panel Wednesday at the TD Ameritrade National LINC conference in Orlando.\n\"There is an opportunity for you to get into that conversation,\" said Michael Cyrs, a panelist and director of wealth advisory at Savant Capital. \"It's a people conversation: You don't have to follow the estate-tax nuances we were dealing with in the past.\"\nThe Tax Cuts and Jobs Act has opened the door for financial advisors to have more meaningful conversations with their clients about their legacies – and to team up with estate-planning attorneys to update plans.\n\"With $22 million in exemptions, it's not so much of a tax issue as it used to be. It's really helping to coach people through important decisions.\" -Brent Brodeski, CEO, Savant Capital The estate-tax exemption is now about $11 million for singles ($22 million for married filing jointly), which means wealthy clients have more of their assets protected from this levy.\nAs a result, the estate-planning conversation has changed from being highly technical and centered on tax savings to one that focuses on the wishes of the client.\n\"There are certain conversations you will be able to have and some are easier than others,\" said Cyrs.\nThose personal conversations include covering how a client's estate plan can affect her community, family and the charitable causes she finds meaningful.\nValues and visions Topics to touch on include fitting the estate plan within the context of the investor's overall financial plan.\n\"With $22 million in exemptions, it's not so much of a tax issue as it used to be,\" said Brent Brodeski, a panelist and CEO of Savant Capital.\n\"It's really helping to coach people through important decisions: How to make sure money isn't squandered and aligning assets with values and visions,\" he said.\nWhy some fear is good for investors\nAdvisors turn to life coaches and counselors\nRetirees leave $100B in Social Security benefits on table\nThat also means reviewing beneficiary designations and questioning the trustees named within the estate plan. \"It's reprogramming clients,\" said Brodeski. \"Do you want really want to have that kid in charge?\"\nAdvisors can also impart their investment management expertise when reviewing clients' estate plans.\nBasis planning Estate-planning tools that are now up for debate, thanks to the new tax law, include the bypass trust. This tool allows married couples to pass assets on to their children, all the while sheltering them from estate taxes.\nThe downside of the bypass trust, however, is that the appreciated assets inside of it miss out on a step-up in basis following the death of the second spouse.\nThis means that if the kids inherit from the second spouse, and they were to sell these assets right away, they would take a large hit on capital gains taxes.\nSee below for an example of how step-up in basis works on inherited assets.\nStep up vs. no step up Sale price per share Cost basis Capital gain per share Tax per share Step up $40 $40 $0 $0 No step up $40 $2 $38 $7.6 Source: CNBC \"If we have an old arrangement and it requires funding into a bypass trust, but the taxable estate is $5 million, then that is a situation where we'd want to re-evaluate,\" said Keith Fenstad, director of financial planning at Tanglewood Total Wealth Management.\nThe right team member There's an element of match-making when it comes to finding the right estate-planning attorney to collaborate with your financial advisory practice.\nBe wary of merely referring clients out to a lawyer. Sniff out true specialists who view estate planning as part of a comprehensive financial plan.\n\"There are attorneys who just do trusts and estates all day, every day,\" said Cyrs at Savant Capital. \"Then there's the other 80 percent of the association, which is handling a bankruptcy in the afternoon or a dissolution proceeding.\"", "external_links": [], "published": "2018-01-31T21:00:00.000+02:00", "crawled": "2018-01-31T21:00:59.003+02:00", "highlightTitle": ""}