{"organizations": [], "uuid": "cbe4ada934b941ee02637fa7a8a4cae25dba371d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 22}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/01/104439995-IMG_3563.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/10/dominos-pizza-ceo-on-departure-theres-a-rhythm-to-these-things.html", "country": "US", "domain_rank": 767, "title": "Domino's Pizza CEO on departure: 'There's a rhythm to these things'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T01:23:00.000+02:00", "replies_count": 0, "uuid": "cbe4ada934b941ee02637fa7a8a4cae25dba371d"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/10/dominos-pizza-ceo-on-departure-theres-a-rhythm-to-these-things.html", "ord_in_thread": 0, "title": "Domino's Pizza CEO on departure: 'There's a rhythm to these things'", "locations": [], "entities": {"persons": [{"name": "patrick doyle", "sentiment": "negative"}, {"name": "doyle", "sentiment": "none"}, {"name": "jim cramer", "sentiment": "none"}, {"name": "richard allison", "sentiment": "none"}, {"name": "allison", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "domino's international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "17 Hours Ago | 01:33 \nDomino's Pizza CEO Patrick Doyle could not be more at peace with his recently announced departure . \n\"I accomplished the goals that I had set out for myself when I took over in 2010,\" Doyle told CNBC in an interview with \" Mad Money \" host Jim Cramer. \"We've got an amazing team in place, and so I would not leave unless I was confident that this business was going to do even better going forward.\" \nDoyle confessed that he always thought he would be at Domino's for 10 years. Instead, he will clock out at eight and a half years at the end of June, passing the CEO role to Richard Allison, the president of Domino's International. \n\"There's a rhythm to these things, and this is the right time to do it,\" Doyle said, adding that he \"couldn't be more thrilled\" about Allison taking over. \"I'll run hard until the end of June, take the back half of the year off and figure out what I'm going to do next.\" \nShares of Domino's fell nearly 3 percent on Tuesday after news broke of Doyle's departure. The stock continued to sink on Wednesday, closing the day down over 3 percent. \nAs CEO, Doyle engineered a turnaround for the country's largest pizza delivery chain, investing in online ordering technology , driving huge stock gains and, perhaps most important, improving the taste of the pizza. \nAs soon as news broke that Doyle would step down, shares of Chipotle Mexican Grill popped on rumors that Doyle would be considered for the CEO position at the troubled fast-casual chain. \nDoyle, however, told Cramer he was nowhere near a decision about where to go next. \n\"I'm in a position that, fortunately, I can do this sequentially. So I am thinking about nothing but Domino's until midnight on June 30,\" the CEO said. \"I'm not going to retire. I'm too young for that. I'm going to keep doing something, but I have no idea what that's going to look like and I'm going to take a little bit of time in the back half of the year and figure that out.\" \nEven with Doyle's departure, Wall Street remained fairly bullish on the pizza powerhouse. BTIG and Credit Suisse reiterated their \"buy\" ratings and Wells Fargo Securities initiated coverage with a \"market perform\" rating. \n\"Doyle was viewed as one of the top CEOs in the restaurant industry (if not all of consumer), so this is a significant loss,\" the Credit Suisse analysts wrote. \"The silver lining is that DPZ has a talented team around Doyle (not to mention a very strong franchisee network).\" \nCredit Suisse also maintained its price target of $220 per share for the $200 stock. Because Domino's business is 97 percent franchised, the firm said it would keep its positive outlook. \nThat outlook matched Doyle's, particularly when it came to his successor. \n\"You look at his track record in international. He's been running it for seven years. It's been growing faster with him running it than it's ever grown before,\" Doyle said of Allison. \"Before he came, he worked with a lot of different restaurant companies as a consultant and then came here and has just lit it up as a leader. He's smart, he's disciplined and he is an incredibly good person. And all of those three things together, with the track record, make him a terrific choice.\" Watch Patrick Doyle's full interview here: show chapters", "external_links": [], "published": "2018-01-11T01:23:00.000+02:00", "crawled": "2018-01-11T01:33:10.004+02:00", "highlightTitle": ""}