{"organizations": [], "uuid": "3257bcfd0d7feb02bc8013b593ad93cacfe33d68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224163360&w=1200&r=LYNXMPEE0L19H", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-skat-blokhuijsen/dutch-team-player-blokhuijsen-hopes-for-solo-success-idUKKBN1FB1S0", "country": "US", "domain_rank": 408, "title": "Dutch team player Blokhuijsen hopes for solo success", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T15:48:00.000+02:00", "replies_count": 0, "uuid": "3257bcfd0d7feb02bc8013b593ad93cacfe33d68"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-skat-blokhuijsen/dutch-team-player-blokhuijsen-hopes-for-solo-success-idUKKBN1FB1S0", "ord_in_thread": 0, "title": "Dutch team player Blokhuijsen hopes for solo success", "locations": [], "entities": {"persons": [{"name": "jan blokhuijsen", "sentiment": "negative"}, {"name": "blokhuijsen", "sentiment": "negative"}, {"name": "mark tuitert", "sentiment": "none"}, {"name": "koen verweij", "sentiment": "none"}, {"name": "simon kuipers", "sentiment": "none"}, {"name": "arie koops", "sentiment": "none"}, {"name": "sven kramer", "sentiment": "none"}, {"name": "kramer", "sentiment": "none"}], "locations": [{"name": "netherlands", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "gangneung oval", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 52 PM / Updated 8 minutes ago Dutch team player Blokhuijsen hopes for solo success Simon Jennings 3 Min Read \n(Reuters) - Jan Blokhuijsen was part of the formidable Dutch speed skating squad that won gold in the team pursuit in Sochi and while he has come to be known as a real ‘team player’ he will be setting his sights on a first individual Olympic title in Pyeongchang. \nBlokhuijsen has been a fixture on the speed skating circuit in the Netherlands since junior level and finished second in the Sochi 5,000 metres behind team mate Sven Kramer, who he will go up against over the same distance in South Korea next month. \nThe 28-year-old got his first taste of Olympic success at the 2010 Vancouver Games, when he took a bronze medal in the team pursuit along with Kramer, Mark Tuitert and Simon Kuipers. \nFour years later, Kramer, Blokhuijsen and Koen Verweij stormed to the top of the podium in Sochi, and the same trio will represent the Dutch in the team pursuit at the Gangneung Oval next month. \n”I think Jan is a real good all round skater,“ Arie Koops, the Dutch team’s technical director, told Reuters. ”Sometimes he is even close on the 1,500m, a distance which is a little bit hard for him. \n“He will be there for the 5,000m because at the Olympics in Sochi he was also there for a medal, and that’s also a possibility again I think in Korea.” CONSUMMATE PROFESSIONAL \nThe Netherlands has a strong professional speed skating circuit and the rivalries between individual skaters can make teamwork difficult, which enhances Blokhuijsen’s reputation as a team skater. FILE PHOTO: The Netherlands' Jan Blokhuijsen competes during the men's 5000m ISU European Speed Skating Championships in Minsk, Belarus January 9, 2016. REUTERS/Vasily Fedosenko/File Photo \n“The Dutch have a lot of (professional) teams,” said former Dutch speed skater Bob de Jong, who is currently assistant coach of the South Korean national team. \n“They’re always competing as well outside the skating rink. And during training, well, sometimes they help each other and sometimes they are absolutely not helping each other.” \nDe Jong praised Blokhuijsen’s professionalism and commitment to the sport. \n“I was training in another team and we got the same sponsor so we trained a little bit together,” De Jong said. “I know he is really focused on his weight and focusing on his food level and energy level.” \nThat focus helped Blokhuijsen overcome a broken ankle in May last year that could have thrown his preparations for the upcoming Games into disarray. \nSuch is Blokhuijsen’s importance to the Dutch team that Verweij called for him to be given a place in the Olympic squad when it looked like his participation might be in doubt. \n“It’s simple. Sven Kramer, Jan Blokhuijsen and I know what to do on the team pursuit, so I think we should stay there,” Verweij was quoted as saying by Dutch online newspaper NU.nl in early December. \n“We should not suddenly make crazy changes.” \nVerweij’s call was heeded by selectors two weeks later, when the Dutch named the same trio of skaters who won gold in Sochi to their team pursuit squad for the Games in South Korea. Editing by Peter Rutherford", "external_links": [], "published": "2018-01-22T15:48:00.000+02:00", "crawled": "2018-01-22T16:01:44.033+02:00", "highlightTitle": ""}