{"organizations": [], "uuid": "8bdd1bed20b21adfb2ff24ff231668c6e04512e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/awards-oscars-nominations-snubs/wonder-woman-stumbles-get-out-surprises-at-oscar-nominations-idUSL2N1PH1AT", "country": "US", "domain_rank": 408, "title": "REFILE-'Wonder Woman' stumbles, 'Get Out' surprises at Oscar nominations", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T22:51:00.000+02:00", "replies_count": 0, "uuid": "8bdd1bed20b21adfb2ff24ff231668c6e04512e9"}, "author": "", "url": "https://www.reuters.com/article/awards-oscars-nominations-snubs/wonder-woman-stumbles-get-out-surprises-at-oscar-nominations-idUSL2N1PH1AT", "ord_in_thread": 0, "title": "REFILE-'Wonder Woman' stumbles, 'Get Out' surprises at Oscar nominations", "locations": [], "entities": {"persons": [{"name": "patty jenkins", "sentiment": "none"}, {"name": "jenkins", "sentiment": "none"}, {"name": "piya sinha-roy", "sentiment": "none"}, {"name": "jill serjeant", "sentiment": "none"}, {"name": "gal gadot", "sentiment": "none"}, {"name": "guillermo del toro", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "osc", "sentiment": "negative"}, {"name": "hollywood", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "warner bros.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 6:26 PM / in 7 minutes REFILE-'Wonder Woman' stumbles, 'Get Out' surprises at Oscar nominations Reuters Staff \n(In paragraph 6, corrects title to read “King” instead of “Kings”) \nBy Piya Sinha-Roy and Jill Serjeant \nLOS ANGELES, Jan 23 (Reuters) - “Wonder Woman” failed to conquer Oscar voters on Tuesday despite riding to one of the biggest box office hits of 2017 on a wave of female empowerment, making it one of the biggest snubs for Hollywood’s highest honors. \nThe Warner Bros. movie, featuring Gal Gadot as the sword-wielding Wonder Woman, was the first stand-alone female superhero film since 2005 and earned some $825 million globally, making its filmmaker Patty Jenkins, 46, the highest-grossing female director in Hollywood. \nBut at Tuesday’s Oscar nominations, Jenkins was left off the director’s race and the film was snubbed in the best picture category, despite nods for other movies about women and made by women. \nInstead, it was Guillermo Del Toro’s surreal fantasy romance “The Shape of Water” that led the Oscar nominations with 13 nods. The Academy of Motion Picture Arts and Sciences have traditionally disdained big action and superhero movies in favor of smaller art-house fare, like last year’s Oscar champion “Moonlight” and this year’s dark comedy “Three Billboards Outside Ebbing, Missouri,” which landed seven nods. \nSince 1990, only the 2003 fantasy epic “Lord of the Rings; The Return of the King” snapped that trend to win the top Oscar honor. Sci-fi movie “Avatar,” still the biggest box office movie of all time, received a best picture nomination in 2010 but lost out to “The Hurt Locker.” \nThis year’s surprises include four nominations in key categories for Jordan Peele’s “Get Out,” in which an African-American man finds himself trapped at his white girlfriend’s house with her strange family. The $5 million horror movie from Universal Pictures became a box office success with more than $250 million globally and became a talking point for modern day race relations in America. \nVeteran actor Christopher Plummer, 88, was also a surprise contender in the supporting actor race for Sony Pictures’ Getty kidnapping film “All the Money in the World.” Plummer boarded the movie a month before its release, replacing actor Kevin Spacey because of sexual misconduct allegations. \nJames Franco was excluded from the best actor race for “The Disaster Artist” after facing accusations of sexual misconduct earlier this month following his Golden Globe win. \nFranco said the accusations were “not accurate.” He lost out on Sunday at the Screen Actors Guild awards to Gary Oldman for “Darkest Hour.” \n“The Disaster Artist,” a comedy about the worst Hollywood film ever made, received early awards attention but on Tuesday, only landed one Oscar nomination, for adapted screenplay. \nOther snubs included Steven Spielberg in the directing race for press freedom movie “The Post,” and its star Tom Hanks. “Mudbound” was left out of best picture and filmmaker Dee Rees was also excluded from the directing race, but she landed a nod for adapted screenplay. \nGerman film “In The Fade,” which won the Golden Globe for best foreign language film and received praise for its lead star Diane Kruger, was left out of the Oscar foreign language race. Reporting by Jill Serjeant; Editing by Andrew Hay", "external_links": [], "published": "2018-01-23T22:51:00.000+02:00", "crawled": "2018-01-23T23:14:54.000+02:00", "highlightTitle": ""}