{"organizations": [], "uuid": "7e3352b8c0b8da7fd89105aeabafdbf917d7dece", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2016/04/memphismeats-107.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/29/tyson-memphis-meats-investment/", "country": "US", "domain_rank": 1196, "title": "Tyson Foods Invests In Clean Meat Startup Memphis Meats | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.968, "site_type": "news", "published": "2018-01-29T02:00:00.000+02:00", "replies_count": 0, "uuid": "7e3352b8c0b8da7fd89105aeabafdbf917d7dece"}, "author": "Beth Kowitt", "url": "http://fortune.com/2018/01/29/tyson-memphis-meats-investment/", "ord_in_thread": 0, "title": "Tyson Foods Invests In Clean Meat Startup Memphis Meats | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 \nAlternative or “clean” meat startup Memphis Meats is on a mission to eradicate protein sourced from livestock. \nBut this morning the Silicon Valley-based company announced an investment from just the type of company it’s trying to disrupt: Tyson Foods , one of the world’s biggest meat producers. \nTyson, which produces about one in five pounds of chicken, beef, and pork in the U.S., invested in Memphis through its venture capital arm. It joins the likes of Cargill, Richard Branson, Bill Gates, Atomico, and DFJ . The terms of the deal were not disclosed, but Memphis said the funding will go toward research and development and expanding the Memphis team. \nMemphis Meats co-founder and CEO Uma Valeti told Fortune that he has intentionally pursued a wide range of investors that represent different parts of the food and financial ecosystem. “We want to continue building alliances and being inclusive,” he says. “Taking a divisive approach in this is not going to be helpful for us as well as everyone else.” \nIn the case of the investments from Tyson and Cargill, Valeti noted that Memphis will benefit from their deep knowledge of meat distribution. “They really understand how to scale up,” he says. “They’ll help us learn a lot about getting meat on the shelf.” \nTyson CEO and president Tom Hayes acknowledged in a post on the company’s site that the investment “might seem counterintuitive,” including “to some inside our company.” \nBut he explained that in a world with a ballooning population and where the No. 1 thing consumers say they want in their diet is protein, companies like Tyson will have to figure out how to answer these demands in a sustainable way. \nTyson has also backed Beyond Meat, which is attempting to replicate the taste of meat with plants. Memphis, meanwhile, is trying to create meat by growing it from animal cells. \n“We believe it will take a combination of innovative and traditional approaches,” Hayes wrote, adding “This isn’t an “either or” scenario; it’s a “yes and” scenario.” \nValeti believes that “cultured” meat, as the industry calls it, will eventually win out. But in the meantime cultured, plant-based, and meat from animals will live side by side. “At the end of the day, taste is going to win and pricing is going to win.” \nAs Fortune reported in December, the reception of Big Food’s investment in the alternative meat industry has been a strange twist: “When legacy packaged food companies began gobbling up natural food startups, the latter lost much of their street cred. But the opposite has happened with meat nouveau: Big Food’s backing has helped validate the burgeoning industry.” \nEditor’s Note: The headline of this story has been updated for clarity. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-29T02:00:00.000+02:00", "crawled": "2018-01-30T04:20:40.005+02:00", "highlightTitle": ""}