{"organizations": [], "uuid": "46b95aa05eb2aa530bac67e2c0f9a007a0469765", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/dell-ipo-public-consideration.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/26/dell-ipo-public-consideration/", "country": "US", "domain_rank": 1196, "title": "Dell Is Considering IPO in Move to Reduce Debt: Report | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.522, "site_type": "news", "published": "2018-01-26T11:18:00.000+02:00", "replies_count": 0, "uuid": "46b95aa05eb2aa530bac67e2c0f9a007a0469765"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/26/dell-ipo-public-consideration/", "ord_in_thread": 0, "title": "Dell Is Considering IPO in Move to Reduce Debt: Report | Fortune", "locations": [], "entities": {"persons": [{"name": "michael dell", "sentiment": "neutral"}], "locations": [{"name": "silver lake", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "neutral"}, {"name": "dell", "sentiment": "neutral"}, {"name": "vmware", "sentiment": "none"}, {"name": "emc corp.", "sentiment": "none"}, {"name": "dell technologies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 9:18 AM EST \nJust over four years since Michael Dell took his namesake PC company private, the billionaire is considering taking Dell Technologies public again in a move to help it raise cash and reduce its substantial debt. An initial public offering would undo one of the biggest leveraged buyouts the tech industry has ever seen. \nThe board is meeting later this month and will discuss its options, according to people familiar with the matter. Round Rock, Texas-based Dell may also decide not to make any such moves at this time, said the people who asked not to be identified because the talks are private. \nDell took took his company private in 2013, when he teamed up with Silver Lake on a leveraged buyout. That freed Dell to cut costs and work to become a bigger supplier of hardware and software for corporate data centers without the quarterly investor scrutiny that comes with being a public company. Three years later, Dell acquired storage-technology provider EMC Corp. and its majority stake in data-center software vendor VMware, taking on a massive debt load to seal the $67 billion deal. \nRaising cash could help the company further expand or pay off some of the debt. Dell Technologies has about $46 billion of debt, according to data compiled by Bloomberg. That includes about $3 billion of bonds maturing in 2018 and $4.35 billion due next year while the company also has loans outstanding, the data show. \nAnother option is to buy the rest of VMware that Dell does not already own, one person familiar with the matter said. VMware shares, which have risen more than 60 percent in the past year, hit a record high on Thursday. They gained 6.8 percent in pre-market trading Friday to $147. \nDell is also considering a public share sale for its Pivotal Software Inc. cloud-computing venture. Dell met with bankers last year to discuss that possibility and was told the company could fetch a valuation of $5 billion to $7 billion, said one of the people. Still, any Pivotal offering may wait until the company has converted more of its business into wider-margin software and subscriptions and away from less-profitable services businesses, the person said. \nPivotal, a cloud software and services firm, was once a joint venture of VMware, EMC and General Electric Co. and became part of Dell after the EMC acquisition. \nDell and VMware couldn’t immediately be reached for comment. \nA public offering would add to a growing list of big tech companies preparing to go public in 2018. File-sharing company Dropbox Inc. has filed confidentially for an IPO and is aiming to list in the first half of the year, people familiar with the matter said earlier this month. Spotify, owner of the world’s largest paid music service, plans to execute its unconventional direct listing this quarter, a person familiar with the matter said this month. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-26T11:18:00.000+02:00", "crawled": "2018-01-26T17:15:25.005+02:00", "highlightTitle": ""}