{"organizations": [], "uuid": "fc4eae615300001aca508930874ce6ac5e3e90a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/14/104945671-GettyImages-904054592.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/14/asia-markets-currencies-commodities-and-inflation-in-focus.html", "country": "US", "domain_rank": 767, "title": "Asia markets: Currencies, commodities and inflation in focus", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.706, "site_type": "news", "published": "2018-01-15T01:47:00.000+02:00", "replies_count": 0, "uuid": "fc4eae615300001aca508930874ce6ac5e3e90a7"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/14/asia-markets-currencies-commodities-and-inflation-in-focus.html", "ord_in_thread": 0, "title": "Asia markets: Currencies, commodities and inflation in focus", "locations": [], "entities": {"persons": [], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "wells fargo", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Most major indexes in Asia closed higher on Monday after Wall Street closed out last week at records and the dollar continued to struggle.\nThe Nikkei 225 rose 0.26 percent, or 61.06 points, to close at 23,714.88, despite the yen's climb higher. Financial names rose in the session, but automakers and technology stocks proved to be a mixed picture .\nShares of SoftBank Group closed 3.22 percent higher following news from Nikkei Asian Review that the company aimed to list SoftBank Corp., its mobile arm, both in Tokyo and abroad this year. The listing could raise around 2 trillion yen ($18 billion) for the company, Nikkei added.\nSoftBank said in a statement the listing of its mobile unit was an option for the company, but that no official decision had been made.\nSymbol Name Price Change %Change NIKKEI --- HSI --- ASX 200 --- SHANGHAI --- KOSPI --- CNBC 100 --- Across the Korean Strait, the Kospi tacked on 0.29 percent to finish at 2,503.73. Heavyweight Samsung Electronics , which had fallen for most of last week on the release of poorer-than-expected profit guidance , closed higher by 0.71 percent. Other tech names, however, were in negative territory, with SK Hynix declining 2.28 percent.\nMeanwhile, bitcoin-exposed stocks retraced losses seen last week following news about a potential ban on cryptocurrency trading in South Korea. Omnitel rose 28.86 percent and Kakao advanced 3.2 percent on the day.\nSydney's S&P/ASX 200 rose 0.12 percent to end at 6,077.1, with the materials and gold producer sectors among the best-performing on the day. Major miners BHP and Rio Tinto closed up 1.17 percent and 1.46 percent, respectively.\nGold producers also finished the session in positive territory after the yellow metal hit four-month highs on softness in the greenback. Newcrest Mining rose 2.92 percent and Evolution Mining was up 6.64 percent by the end of the day.\nIn greater China markets, Hong Kong's Hang Seng Index , which had traded convincingly higher earlier in the day, slipped into negative territory in the last hour of trade. The index edged down 0.14 percent by 3:03 p.m. HK/SIN after closing higher for the 14th consecutive day last Friday. Still, the benchmark traded not far from its all-time high of 31,958.41.\nMainland markets traded lower. The Shanghai composite shed 0.55 percent to close at 3,409.99 and the Shenzhen composite lost 1.8 percent to end at 1,913.77. The blue chip CSI 300 index closed flat. Financials listed on mainland markets made gains, but those were offset by losses in telecommunication services, materials and industrials names.\nThe Chinese currency rose to a more than two-year high after an official at Germany's central bank said it would add the yuan to its currency reserves, Reuters reported. The on-shore yuan traded at 6.4320 at 2:53 p.m. HK/SIN while the offshore yuan traded at 6.4362. The central bank lets the yuan rise or fall a maximum of 2 percent against the dollar, relative to the fixing rate.\nThe People's Bank of China set the yuan midpoint at 6.4574 to the dollar, its firmest level in more than 1 1/2 years, earlier on Monday, Reuters said.\nMSCI's broad index of shares in Asia Pacific excluding Japan on Monday recorded a fresh record high, clearing a peak of 591.50 set in 2007. The index was up 0.28 percent at 591.80 at 3:16 p.m. HK/SIN.\nMeanwhile, at least a dozen people were injured at the Indonesia Stock Exchange following the collapse of a floor in the building, Reuters reported. Police said a bomb was not the reason for the collapse, the news agency added. Afternoon trade at the exchange resumed at regular hours.\nDollar struggles The dollar index , which tracks the U.S. currency against a basket of six currencies, extended losses to trade at 90.750 at 2:50 p.m. HK/SIN. That was below the close of 90.902 last session despite the positive consumer price read on Friday. The index had traded at levels around the 92 handle at the beginning of last week.\n\"The global reflation trade continues to be associated with a weaker greenback, which in turn, has amplified the market's sensitivity to any posturing by the European Central Bank and the Bank of Japan to end their ultra-loose monetary policies,\" DBS Group Research strategists Eugene Leow and Philip Wee said in a note.\nThe euro edged higher to trade at $1.2212, near its highest levels in around three years. The common currency advanced following Friday news that German Chancellor Angela Merkel had made progress on the formation of a coalition government. It also followed the release of European Central Bank minutes earlier last week that had been interpreted as hawkish by markets.\nAgainst the yen, the greenback edged lower to trade at 110.81.\nUS stocks touch record highs U.S. stocks touched record levels on Friday after major banks announced better-than-expected quarterly reports. Earnings season kicked off last week and is expected to be robust , with fourth-quarter S&P 500 profits forecast to increase 11.2 percent, according to UBS.\nMeanwhile, data released Friday showed U.S. consumer prices excluding food and energy rose 0.3 percent in December from the prior month, beating the 0.2 percent forecast in a Reuters poll. Retail sales for December rose 0.4 percent compared to the month before.\nMarkets stateside are closed on Monday for Martin Luther King, Jr. Day.\nCorporate news In other public offering news, online finance platform Lufax aims to list in Hong Kong in April, the South China Morning Post reported on Friday, citing anonymous sources. Lufax's potential IPO would come hot on the heels of other \"new economy\" companies in Hong Kong last year, including online-only insurer ZhongAn Online Property & Casualty Insurance .\nMeanwhile, smartphone maker Xiaomi has reportedly chosen Citic Securities, Goldman Sachs and Morgan Stanley as sponsors for the company's proposed listing , Thomson Reuters publication IFR said, citing sources.\n— CNBC's Fred Imbert contributed to this report.", "external_links": [], "published": "2018-01-15T01:47:00.000+02:00", "crawled": "2018-01-15T02:12:17.000+02:00", "highlightTitle": ""}