{"organizations": [], "uuid": "117b20473d6812d7b60519ee42707c95b0f086af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-bioivt-launches-scientific-advisory-board-expands-drug-development-expertise.html", "country": "US", "domain_rank": 767, "title": "BioIVT Launches Scientific Advisory Board, Expands Drug Development Expertise", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.029, "site_type": "news", "published": "2018-01-11T17:00:00.000+02:00", "replies_count": 0, "uuid": "117b20473d6812d7b60519ee42707c95b0f086af"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-bioivt-launches-scientific-advisory-board-expands-drug-development-expertise.html", "ord_in_thread": 0, "title": "BioIVT Launches Scientific Advisory Board, Expands Drug Development Expertise", "locations": [], "entities": {"persons": [{"name": "chris hansis", "sentiment": "none"}, {"name": "hansis", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "westbury", "sentiment": "none"}], "organizations": [{"name": "bioivt launches scientific advisory board", "sentiment": "negative"}, {"name": "sab", "sentiment": "none"}, {"name": "qualyst transporter solutions", "sentiment": "none"}, {"name": "asterand bioscience", "sentiment": "none"}, {"name": "bioivt scientific advisory board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WESTBURY, N.Y., Jan. 11, 2018 /PRNewswire/ -- BioIVT, a leading provider of biospecimens and related services, today announced the launch of its BioIVT Scientific Advisory Board (SAB). BioIVT's eminent and world-renowned SAB members will provide the company with scientific and business insights and help it to identify future growth areas.\n\"During the past year, with our acquisition of Asterand Bioscience and Qualyst Transporter Solutions, BioIVT has evolved from a global biological products provider into a true drug discovery research partner. We now offer a comprehensive range of cell processing, target and biomarker validation, ADME-toxicology, and phenotypic and clinical assay development services, in addition to producing control and disease-state matrices,\" said BioIVT's Chief Scientific Officer Dr. Chris Hansis.\n\"Furthermore, through our BioIVT SAB, we gain access to a group of world-class scientific advisors, who are willing to share their wisdom and further broaden and deepen our areas of drug research and development expertise,\" added Dr. Hansis.\nBioIVT's SAB is chaired by James Rothman, PhD, co-recipient of the 2013 Nobel Prize in Physiology or Medicine for his research into how molecular messages are transmitted by human cells. Professor Rothman is the Sterling Professor of Cell Biology and Chair of the Department of Cell Biology, Yale School of Medicine.\nHis fellow SAB members include Professor Amin Rostami, PharmD, PhD, Senior Vice President of Research and Development, and Chief Scientific Officer at Certara. An expert in the use of modeling and simulation to facilitate drug development and enable precision drug dosing for individual patients, Professor Rostami is also Professor of Systems Pharmacology and Co-director of the Centre for Applied Pharmacokinetic Research at the University of Manchester, UK. Professor Rostami has authored/co-authored more than 220 articles. In 2017, he was recognized by ISI as one of the world's most highly-cited researchers in pharmacology and toxicology.\nThey are joined by Binodh DeSilva, PhD, Head of Analytical and Bioanalytical Operations at Bristol-Myers Squibb Company. Dr. DeSilva is well known for helping to set standards for ligand binding assays in the regulated environment. She was President of the American Association of Pharmaceutical Scientists, and a member of the Steering Committee of the Global Bioanalytical Consortium representing North America. Dr. DeSilva is also Chair of the Biotech Special Interest Group of the International Pharmaceutical Federation, and a BioAgilytix SAB member.\nProviding clinical insights are Johannes Zakrzewski, MD, a pediatric oncologist at Memorial Sloan Kettering Cancer Center with expertise in cell therapy and bone marrow transplantation, and Martin Rosenberg, PhD, retired Chief Scientific Officer, Senior Vice President, and Corporate Director at Promega Corporation, and current Director of DNASTAR, Scarab Genomics, and the International Biomedical Research Alliance. Dr. Rosenberg also spent 20 years of his career as a Senior Vice President in Research and Development at GlaxoSmithKline.\nAbout BioIVT\nBioIVT, formerly BioreclamationIVT, is a leading global provider of high-quality biological specimens and value-added services. We specialize in control and disease-state samples including human and animal tissues, cell products, blood and other biofluids. Our unmatched portfolio of clinical specimens directly supports precision medicine research and the effort to improve patient outcomes by coupling comprehensive clinical data with donor samples. Our PHASEZERO® Research Services team works collaboratively with clients to provide target and biomarker validation, phenotypic assays to characterize novel therapeutics, clinical assay development and in vitro hepatic modeling solutions. And as the premier supplier of ADME-toxicology model systems, including hepatocytes and subcellular fractions, BioIVT enables scientists to better understand the pharmacokinetics and drug metabolism of newly-discovered compounds and their effects on disease processes. By combining our technical expertise, exceptional customer service, and unparalleled access to biological specimens, BioIVT serves the research community as a trusted partner in elevating science. For more information, please visit www.bioivt.com or follow the company on Twitter @BiorecIVT .\nBioIVT Contact : Courtney Noah, Vice President of Marketing, 516-483-1196\nMedia Contact : Lisa Osborne, Rana Healthcare Solutions, 206-992-5245, lisa@ranahealth.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/bioivt-launches-scientific-advisory-board-expands-drug-development-expertise-300581132.html\nSOURCE BioIVT", "external_links": ["http://www.prnewswire.com/news-releases/bioivt-launches-scientific-advisory-board-expands-drug-development-expertise-300581132.html", "https://twitter.com/BiorecIVT", "http://www.bioivt.com/"], "published": "2018-01-11T17:00:00.000+02:00", "crawled": "2018-01-11T19:01:37.002+02:00", "highlightTitle": ""}