{"organizations": [], "uuid": "1a6259d6ae932b08c55fce5aa6caeba8cca89734", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-global-swf-pwc/alternative-assets-raised-to-23-percent-of-sovereign-investors-holdings-pwc-report-idUKKBN1FJ00G", "country": "US", "domain_rank": 408, "title": "Alternative assets raised to 23 percent of sovereign investors' holdings - PWC report", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T02:05:00.000+02:00", "replies_count": 0, "uuid": "1a6259d6ae932b08c55fce5aa6caeba8cca89734"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-swf-pwc/alternative-assets-raised-to-23-percent-of-sovereign-investors-holdings-pwc-report-idUKKBN1FJ00G", "ord_in_thread": 0, "title": "Alternative assets raised to 23 percent of sovereign investors' holdings - PWC report", "locations": [], "entities": {"persons": [], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "pwc", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 05 AM / Updated 11 minutes ago Alternative assets raised to 23 percent of sovereign investors' holdings - PWC report Reuters Staff 3 Min Read \nLONDON (Reuters) - Sovereign wealth funds have increased their exposure to alternative assets such as private equity, property, commodities and infrastructure to almost a quarter of their overall assets, a report from PWC said on Tuesday. \nThe shift reflects a search for yield after interest rates plunged in developed markets and central banks in the United States and Europe adopted quantitative easing programmes. \nThe PWC report, based on the firm’s proprietary database with information on over 115 sovereign wealth funds, found that alternative investments accounted for 23 percent of their total assets in 2016, up from 19 percent in 2010. \nAt the same time, sovereign investors reduced their exposure to low-yielding fixed-income assets such as government bonds from a peak of 40 percent in 2013 to 30 percent in 2016, PWC said. \nThe report acknowledged that interest rates in Europe and the United States were likely to rise in coming years as quantitative easing ends, but said that was expected to have only a modest impact - the search for yield would continue. \nIt noted that private equity was becoming a “mainstream” option for sovereign investors, with 61 percent of them holding it in their portfolios. In 2016, private equity accounted for 6.1 percent of their assets, up from 3.7 percent in 2011. \nSome 63 percent of sovereign funds invested in both real estate and infrastructure in 2016, up from 59 percent in real estate and 60 percent in infrastructure two years earlier. \nPWC suggested that sovereign funds’ presence in the asset classes could have a big impact on prices and development plans in coming years. It noted that high demand and limited supply were making competition for real estate fierce, even in second-tier markets. \n“With mass urbanisation and the associated economic growth in emerging regions, and the renewal of dilapidated infrastructure in developed countries, this asset class might play a larger role in the future,” it said. \nThe report also found that total assets under management grew to $7.4 trillion in 2016, albeit at a slower pace, with some funds facing adverse conditions since 2014 because of falling oil prices. \nPWC expects assets under management to grow faster in coming years as the diversification into alternatives enhances returns. Reporting by Claire Milhench, editing by Larry King", "external_links": [], "published": "2018-01-30T02:05:00.000+02:00", "crawled": "2018-01-30T02:19:35.013+02:00", "highlightTitle": ""}