{"organizations": [], "uuid": "cd176c918f8c2034db90c380ddd4b590cc15d599", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-ssr-mining-reports-fourth-quarter-and-year-end-2017-production-results-and-2018-guidance.html", "country": "US", "domain_rank": 767, "title": "SSR Mining Reports Fourth Quarter and Year-End Production Results and 2018 Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T01:55:00.000+02:00", "replies_count": 0, "uuid": "cd176c918f8c2034db90c380ddd4b590cc15d599"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-ssr-mining-reports-fourth-quarter-and-year-end-2017-production-results-and-2018-guidance.html", "ord_in_thread": 0, "title": "SSR Mining Reports Fourth Quarter and Year-End Production Results and 2018 Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "ssr mining inc.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, Jan. 15, 2018 /PRNewswire/ - SSR Mining Inc. (NASDAQ: SSRM) (TSX: SSRM ) (\"SSR Mining\") reports fourth quarter and year-end 2017 operating results. Additionally, we are providing 2018 guidance.\nFourth Quarter and 2017 Operating Highlights\nAchieved total production guidance: Produced over 370,000 gold equivalent ounces in 2017, meeting or exceeding initial guidance for a sixth consecutive year. Delivered attributable gold equivalent production of over 358,000 ounces in 2017 and over 88,000 ounces in the fourth quarter, 14% higher than the third quarter of 2017.\nAchieved gold production guidance at Marigold: Quarterly gold production of 52,768 ounces, 36% higher than the third quarter of 2017, resulted in annual production of 202,240 ounces of gold in 2017.\nRecord quarterly production at Seabee: Achieved record mill throughput of 89,237 tonnes or 970 tonnes per day during the fourth quarter, which combined with higher milled grades and improved recovery resulted in record quarterly gold production of 24,227 ounces.\nDelivered record annual gold production at Seabee: The mine achieved the highest annual production in its 27-year history, producing 83,998 ounces of gold in 2017, at the upper end of the upwardly revised annual guidance.\nExceeded annual production guidance at Puna Operations: Exceeded the upper end of the upwardly revised annual production guidance with a total of 6.2 million ounces of silver. Continued excellent performance of stockpile processing resulted in silver production of 1.2 million ounces in the fourth quarter.\nPaul Benson, President and CEO said, \"A strong fourth quarter at all three operations resulted in annual production of over 370,000 gold equivalent ounces. This marks the sixth consecutive year that we have met or exceeded our production guidance. All three operations performed well, particularly Puna Operations which exceeded the top end of its improved production guidance. These results are driven by our teams and their continued focus on Operational Excellence to optimize our operations. In the year ahead, we are positioning the company to grow production as Seabee ramps up and the Chinchillas deposit comes on-line in Argentina. Importantly, our exceptionally strong balance sheet enables us to increase our investment in brownfields exploration at both Marigold and Seabee.\"\nMarigold Mine, U.S.\nQ4 2017\nQ3 2017\n% Change 1\nFY 2017\nFY 2016\n% Change 1\nTotal material mined\nkt\n13,979\n20,311\n(31.2%)\n69,011\n75,093\n(8.1%)\nWaste removed\nkt\n8,136\n13,149\n(38.1%)\n43,422\n51,480\n(15.7%)\nOre to leach pad\nkt\n5,843\n7,162\n(18.4%)\n25,589\n23,613\n8.4%\nStrip ratio\nw/o\n1.4\n1.8\n(22.2%)\n1.7\n2.2\n(22.7%)\nGold grade to leach pad\ng/t\n0.37\n0.31\n19.4%\n0.35\n0.45\n(22.2%)\nGold recovery\n%\n74%\n72%\n2.8%\n73%\n72%\n1.4%\nGold produced\noz\n52,768\n38,699\n36.4%\n202,240\n205,116\n(1.4%)\nGold sold\noz\n51,420\n38,818\n32.5%\n200,192\n204,315\n(2.0%)\nNotes:\n(1)\nPercent changes are calculated using rounded numbers presented in the table.\nIn 2017, the Marigold mine produced 202,240 ounces of gold, achieving the upper end of our revised production guidance. This compares to 205,116 ounces of gold produced in 2016. Gold sales were 200,192 ounces for the year.\nMaterial mined during the year totaled 69.0 million tonnes, 8% lower compared to the record tonnage moved in 2016, due to adverse weather conditions in the first quarter of 2017 and a lower mining rate in the fourth quarter as discussed below. The mine achieved a record 25.6 million tonnes of ore stacked on leach pads in 2017.\nDuring the fourth quarter of 2017, a total of 14.0 million tonnes of material were mined, down 31% from the third quarter due to planned maintenance of the rope shovel and operational shut-downs and interruptions resulting from the fatal incident in October. The operation focused on addressing the leaching constraints related to clay ore encountered in the second half of the year. Multiple actions were implemented resulting in improvement of the leach pad operation over the last three months of the year. A combination of ore blending, adding surfactants to reduce ponding and improving ripping practices have allowed solution application rates to return to normal and recovery rates to expected levels. This was reflected in the increased gold production in the fourth quarter.\nApproximately 5.8 million tonnes of ore were delivered to the heap leach pads at a gold grade of 0.37 g/t in the fourth quarter. This compares to 7.2 million tonnes of ore delivered to the leach pads at a gold grade of 0.31 g/t in the third quarter. Gold grade mined in the fourth quarter was 19% higher than the third quarter due to mining deeper in the current phase of the Mackay pit. The strip ratio declined to 1.4:1 in the quarter, a 22% reduction compared to the previous quarter.\nIn the fourth quarter of 2017, Marigold produced 52,768 ounces of gold, 36% higher than the previous quarter. Gold sales totaled 51,420 ounces for the quarter.\nSeabee Gold Operation, Canada\nQ4 2017\nQ3 2017\n% Change 1\nFY 2017\nFY 2016 2\n% Change 1\nTotal ore milled\nt\n89,237\n84,315\n5.8%\n330,415\n312,679\n5.7%\nOre milled per day\nt/day\n970\n916\n5.9%\n905\n854\n6.0%\nGold mill feed grade\ng/t\n8.89\n7.03\n26.5%\n8.25\n7.91\n4.3%\nGold recovery\n%\n97.4%\n97.2%\n0.2%\n97.4%\n96.7%\n0.7%\nGold produced\noz\n24,227\n18,058\n34.2%\n83,998\n77,640\n8.2%\nGold sold\noz\n23,969\n21,798\n10.0%\n86,087\n76,474\n12.6%\nNotes:\n(1)\nPercent changes are calculated using rounded numbers presented in the table.\n(2)\nThe data presented in this column is for the period from January 1, 2016 to December 31, 2016 and includes operating results for the Seabee Gold Operation for the period from January 1, 2016 to May 30, 2016 prior to our acquisition.\nThe Seabee Gold Operation produced 83,998 ounces of gold in 2017, marking record annual production in its 27-year history, resulting from an improved milling rate and higher gold grades. A total of 86,087 ounces of gold were sold during the year.\nIn 2017, the operation milled 330,415 tonnes of ore, another operating record, due largely to our ongoing Operational Excellence initiatives. During the year, average gold mill feed grade was 8.25 g/t, 4% higher compared to the average gold grade milled in 2016. The Santoy mine supplied 82% of ore milled, predominantly from long hole stopes, with the remaining ore sourced from the Seabee mine.\nIn the fourth quarter of 2017, the operation produced 24,227 ounces of gold, a 34% increase compared to the previous quarter and a quarterly record mainly due to record throughput and higher gold grades. Gold sales totaled 23,969 ounces during the quarter.\nA record 89,237 tonnes of ore were milled during the fourth quarter at an average gold grade of 8.89 g/t and recovery of 97.4%. This compares to a total of 84,315 tonnes of ore milled at an average gold grade of 7.03 g/t and recovery of 97.2% in the third quarter of 2017. During the fourth quarter, the mill maintained a higher throughput of 970 tonnes per day, a record quarterly performance. The Santoy mine supplied approximately 72% of total ore milled, with the remainder sourced from the Seabee mine.\nPuna Operations, Argentina (1)\nQ4 2017\nQ3 2017\n% Change 1\nFY 2017\nFY 2016\n% Change 1\nOre milled\nkt\n442\n461\n(4.1%)\n1,798\n1,774\n1.4%\nSilver mill feed grade\ng/t\n125\n153\n(18.3%)\n152\n235\n(35.3%)\nSilver recovery\n%\n66.0%\n67.8%\n(2.7%)\n7", "external_links": ["http://www.ssrmining.com/", "http://markets.financialcontent.com/prnews/quote?Symbol=SSRM"], "published": "2018-01-16T01:55:00.000+02:00", "crawled": "2018-01-16T03:06:46.017+02:00", "highlightTitle": ""}