{"organizations": [], "uuid": "8b7c8fd0f0c99bc28661c5d184002b5be7a11c06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/18/104478215-GettyImages-684237010.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/trump-news-trump-makes-mark-with-judge-confirmations-in-first-year.html", "country": "US", "domain_rank": 767, "title": "Trump makes mark with judge confirmations in first year", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.167, "site_type": "news", "published": "2018-01-22T19:11:00.000+02:00", "replies_count": 0, "uuid": "8b7c8fd0f0c99bc28661c5d184002b5be7a11c06"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/22/trump-news-trump-makes-mark-with-judge-confirmations-in-first-year.html", "ord_in_thread": 0, "title": "Trump makes mark with judge confirmations in first year", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "neil gorsuch", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}], "locations": [{"name": "iowa", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "circuit court of appeals", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "gop-majority senate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES show chapters 3 Hours Ago | 01:09 \nAs a candidate, the ideologically flexible Donald Trump urged skeptical conservatives to support him with one simple pitch. \n\"If you really like Donald Trump, that's great, but if you don't, you have to vote for me anyway,\" he said at a July 2016 rally in Iowa. \"You know why? Supreme Court judges, Supreme Court judges. Have no choice, sorry, sorry, sorry. You have no choice.\" \nA year into Trump's presidency, conservatives have reason to be pleased with the judicial branch. Since Trump's inauguration on Jan. 20, 2017, the GOP-majority Senate has confirmed 23 judges to lifetime posts. The figure includes 50-year-old Supreme Court Justice Neil Gorsuch and a dozen Circuit Court of Appeals judges — the latter a record for a president's first year. \nFor every first-year achievement Trump has trumpeted — particularly the passage of a GOP tax plan — none may have the lasting effects of his effort to reshape the judiciary. In December, Senate Majority Leader Mitch McConnell cited \"Neil Gorsuch and the changes we're making in the circuit courts\" as his biggest achievement of 2017, even ahead of reaching his long-held goal to overhaul the U.S. tax system. Drew Angerer | Getty Images President Donald Trump \nSince judges serve for life and can have a major role in determining whether policy goes into effect, Trump's picks will affect American law for long after he leaves the White House. \n\"Republicans have long objected to the Court's liberal drift, and, at the same time, they want courts to defend rights they care about, particularly the 2nd Amendment and narrowing the scope of federal regulatory authority,\" University of North Carolina School of Law professor Michael Gerhardt said in an email. \"With judges appointed for life, they have support for their agenda on the courts for decades.\" \nGorsuch — whom Trump cast as the next coming of the late hardline conservative Antonin Scalia — drew the most attention of Trump's judicial picks because he will likely have decades to sit on the nation's top court. Beyond the top court, though, Trump and McConnell have had remarkable success in filling out vacancies on the appellate courts, which have the final say on the vast majority of challenges because the Supreme Court hears few cases. \nA dozen of those judges got confirmed from Trump's inauguration through Friday — the end of the president's first year in office. The four presidents who preceded Trump had no more than six appellate judges seated in the same time frame, according to Anne O'Connell, a law professor at the University of California, Berkeley, who studies presidential nominations. \nTrump hasn't been quite as successful as some of his more recent predecessors in filling out federal district courts. Through Friday, 10 of those judges had been confirmed during Trump's tenure. That figure is on par with Presidents Barack Obama and George H.W. Bush, but well behind the pace set by Presidents Bill Clinton and George W. Bush. \nTrump still has much room to leave his mark. As of Monday, 145 federal judgeships were vacant, according to a government website . Forty-three nominees to those seats are pending, including six more appellate judges. \nTrump has seen firsthand the effect the judicial branch can have on a president's policies. He has repeatedly criticized federal courts for what he deems flawed decisions on controversial policies such as his travel ban and his decision to end the Obama-era Deferred Action for Childhood Arrivals program. \nSideswipes like these led Gorsuch during his confirmation process to declare that attacks on an independent judiciary are \"disheartening\" and \"demoralizing.\" How it's happening \nTrump has faced relatively few roadblocks on the path to getting his judicial nominees confirmed. Not only does his party hold a majority in the Senate, but Senate Democrats have little recourse to hold up nominees they find objectionable. \nIn 2013, majority Senate Democrats made a change allowing most presidential nominees to advance to a confirmation vote with only a majority of the chamber's support, instead of the previous 60-vote threshold. The tweak allowed them — and now the majority GOP — to push nominees through without bipartisan support. \nAfter successfully blocking Obama's nomination of Appeals Judge Merrick Garland to the Supreme Court in 2016, McConnell and the GOP also did away with the filibuster for Supreme Court confirmations last year. Gorsuch was confirmed with 54 votes in April, with nearly all Democrats objecting to the lack of a vote to confirm Garland. \nMcConnell's own desire to reshape the federal courts has played a major role in Trump's success in filling the posts, said Jessica Levinson, a professor of law at Loyola Law School in Los Angeles. \n\"Senator McConnell and other GOP senators rightly realize that they can make an enormous impact on the fabric of our country if they can confirm as many judges as possible, as quickly as is possible,\" she said. \nSenate Republicans moved slowly on confirming judicial nominees other than Garland during Obama's final years in office, leaving Trump a sea of seats to fill. Roadblocks \nThe rush to change the makeup of the judicial branch in Trump's first year has come with its own problems. Even some Republicans have questioned the qualifications of certain nominees Trump has put forward for federal posts. \nIn a matter of 10 days in December, three Trump judicial nominees were withdrawn. Matthew Petersen, a district judge nominee, pulled out of consideration after an embarrassing video circulated of him failing to answer Sen. John Kennedy 's questions about trial procedure. \nKennedy, a Louisiana Republican, later said he \"would strongly suggest [Petersen] not give up his day job\" at the Federal Election Commission . \nThe White House also pulled the nomination of Brett Talley, a lawyer and horror-fiction writer who was considered for a district court seat in Alabama. He was rated \"unanimously unqualified\" for the post by the American Bar Association , and he allegedly failed to disclose controversial blog posts and personal connections to Trump's White House. \nSenate Judiciary Committee Chairman Chuck Grassley , R-Iowa, recommended that the White House drop Talley's nomination. \nThe other man who did not make it through the confirmation process, Jeffrey Mateer, described transgender children as evidence of \"Satan's plan,\" according to NBC News. Executive branch lag \nTrump's relative success in getting judges confirmed comes as he has lagged the four presidents who came before him in filling out his executive branch. \nAs of Thursday, Trump had seen only 301 executive branch nominees confirmed, according to the Partnership for Public Service, which tracks presidential nominations. That figure is more than 100 fewer than any president dating to George H.W. Bush during the same time period. \nOf the 633 posts the organization describes as key positions, 241 are confirmed. Trump still has not nominated someone for 245 posts, the organization said. \n\"No president has done that fast. This president has just done it slower than ever before,\" said Max Stier, Partnership for Public Service president and CEO. \nBoth Loyola's Levinson and North Carolina's Gerhardt believe Senate priorities can partially explain the pace of confirmations. Senate Republicans know judges will have a bigger long-term effect on the United States. \nGerhardt called judicial confirmations one of the highest priorities for Trump and Senate Republicans, along with national security. \nSaid Gerhardt: \"The Senate will work with Trump to ram through as many [judges] as possible for as long as possible.\" WATCH: Here's why Trump's judicial nominations are more important than they seem show chapters", "external_links": [], "published": "2018-01-22T19:11:00.000+02:00", "crawled": "2018-01-22T19:13:33.070+02:00", "highlightTitle": ""}