{"organizations": [], "uuid": "8aac9b0e8e6b7c99cb462962d5f0508cf8f230fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219572666&w=1200&r=LYNXMPEE040KN", "site_section": "http://feeds.reuters.com/reuters/INformulaOne", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/cricket-test-zaf-ind/cricket-bhuvneshwar-kumar-has-south-africa-reeling-but-de-villiers-leads-fight-back-idINKBN1EU0YW", "country": "US", "domain_rank": 408, "title": "Cricket: Bhuvneshwar Kumar has South Africa reeling but de Villiers leads fight back", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T12:59:00.000+02:00", "replies_count": 0, "uuid": "8aac9b0e8e6b7c99cb462962d5f0508cf8f230fa"}, "author": "", "url": "https://in.reuters.com/article/cricket-test-zaf-ind/cricket-bhuvneshwar-kumar-has-south-africa-reeling-but-de-villiers-leads-fight-back-idINKBN1EU0YW", "ord_in_thread": 0, "title": "Cricket: Bhuvneshwar Kumar has South Africa reeling but de Villiers leads fight back", "locations": [], "entities": {"persons": [{"name": "bhuvneshwar kumar", "sentiment": "negative"}, {"name": "de villiers", "sentiment": "none"}, {"name": "faf du plessis", "sentiment": "none"}, {"name": "hashim amla", "sentiment": "none"}, {"name": "kumar", "sentiment": "none"}, {"name": "dean elgar", "sentiment": "none"}, {"name": "aiden markram", "sentiment": "none"}, {"name": "reuters/sumaya hisham  de villiers", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "newlands stadium", "sentiment": "none"}, {"name": "cape town", "sentiment": "none"}, {"name": "newlands", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ab de villiers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 11:00 AM / Updated 8 hours ago Cricket: Bhuvneshwar Kumar has South Africa reeling but de Villiers leads fight back Reuters Staff 2 Min Read \nCAPE TOWN (Reuters) - Opener Bhuvneshwar Kumar took a wicket in each of his first three overs as India laid waste to South Africa’s top order on the opening day of the first test at Newlands on Friday. But a counterattack led by AB de Villiers, who hit a quick fire half century, saw South Africa go to lunch on 107 for three wickets, fighting back on a hot day in an intriguing battle between the top two ranked test nations. Cricket - India v South Africa - First Test cricket match - Newlands Stadium, Cape Town, South Africa - 05/01/2018. India's Bhuvneshwar Kumar makes a delivery. REUTERS/Sumaya Hisham \nDe Villiers was 59 not out after the first session, along with captain Faf du Plessis, unbeaten on 37. \nKumar snagged opener Dean Elgar with just the third ball of the day and then in the next two overs had Aiden Markram and Hashim Amla dismissed cheaply to have the home side reeling at 12 for three inside only the fifth over. \nBut de Villiers staged a fight back as he took on Kumar, hitting four 4s off him in an over as he relentlessly punished loose deliveries. Cricket - India v South Africa - First Test cricket match - Newlands Stadium, Cape Town, South Africa - 05/01/2018. Indian cricket players celebrate after India's Shikhar Dhawan bowls out South Africa's Dean Elgar. REUTERS/Sumaya Hisham \nDe Villiers reached his 50 off just 55 deliveries. Du Plessis was more circumspect at the other end, no doubt also reflecting on his decision to bat after winning the toss before the start of play. \nHis argument that he was going to gamble on batting because the wicket was still soft and would get quicker later in the day as it dried out, looked without substance as Kumar made full use of grass-covered track and had South Africa, who pick four seamers themselves, in early trouble. Cricket - India v South Africa - First Test cricket match - Newlands Stadium, Cape Town, South Africa - 05/01/2018. South Africa's AB de Villiers plays a shot. REUTERS/Sumaya Hisham \nHe had Elgar caught behind by Wriddhiman Saha as he moved the ball away from the left-hander and then Markram leg before for five runs in the third over of the day. \nAmla (3) followed soon thereafter as he flashed at a delivery on off stump and nicked it behind to Sahara. Kumara bowled nine overs before lunch for 3-39. \nSouth Africa host India in three tests this month with the next two to be played in Pretoria and Johannesburg. Reporting by Mark Gleeson; Editing by William Maclean", "external_links": [], "published": "2018-01-05T12:59:00.000+02:00", "crawled": "2018-01-05T13:28:03.003+02:00", "highlightTitle": ""}