{"organizations": [], "uuid": "18d9e1917ce3c5244cf09d842efdc445274abda7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/f02covpromo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/job-interview-hiring-advice-tips/", "country": "US", "domain_rank": 1196, "title": "How to Make Your Next Job Interview Count | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.856, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "18d9e1917ce3c5244cf09d842efdc445274abda7"}, "author": "Ellen Mcgirt", "url": "http://fortune.com/2018/01/18/job-interview-hiring-advice-tips/", "ord_in_thread": 0, "title": "How to Make Your Next Job Interview Count | Fortune", "locations": [], "entities": {"persons": [{"name": "ellen mcgirt", "sentiment": "neutral"}], "locations": [], "organizations": [{"name": "fortune", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Ellen McGirt January 18, 2018 \nAs Fortune reports in a new feature story this week , employers are increasingly looking beyond traditional credentials to find job candidates whose life experiences show their “grit,” the persistence, resilience and creativity under pressure that can be a better proxy for success than any posh internship or Ivy League degree. \nThe growing importance of grit is changing the dynamics of the typical job interview. If you’re a job candidate, every conversation you have with a recruiter, a sponsor, or an interviewer is an opportunity to frame your story and telegraph your strengths through this new lens. And if you are the interviewer, you face the challenge of looking past preconceptions and connecting with unconventional candidates in order to find the talent your company needs. \nHere are tips for navigating the interview, for people on either side of the desk. 3 Tips for Job Candidates \n➜ Let your own light shine. Potential employers may not feel comfortable asking or talking about family struggles or difficult experiences like foster care. But if such experiences helped you develop and display strength, resilience, or ingenuity, bring them up. “We encourage young men to look at their story through the asset prism, not the deficit prism,” says Blair Taylor, former CEO of My Brother’s Keeper Alliance, an organization dedicated to improving the odds for men of color. (It’s now being folded into the Obama Foundation.) \n➜ Ask for help. When preparing for a hiring or advancement conversation, find a mentor to help you craft your talking points. “I’m always amazed at how few young employees of color seek out mentors or advice,” says Zackarie Lemelle, former CIO of Johnson & Johnson and current executive coach. The same can be said of folks of all ages and backgrounds who haven’t spent time at the most sought-after schools and workplaces. Many people in positions of authority “would gladly take the time to give you this type of feedback,” says Lemelle. “And they know how things work.” \n➜ Craft a story that people can share. It helps to shape your talking points into a narrative, with a beginning, middle, and end that an interviewer can remember and repeat. “Some of the most important conversations happen when the candidate is not in the room,” says Kailei Carr, director of the Emerge Academy, a women’s leadership-development program. “It’s critical that people with political clout and influence understand you well enough to be able to advocate on your behalf.” 3 Tips for Interviewers \n➜ Stay open and curious. Hiring managers and interviewers can be prone to fixating on familiar keywords (schools, job titles, references) on résumés, overreacting to their presence or absence. “Remember that the person sitting in front of you is a stranger, no matter what their résumé does or doesn’t say,” says Carla J. Ogunrinde, chair of the Information Technology Senior Management Forum, an organization dedicated to advancing black professionals in tech. “You don’t know them. If you begin at that entry point, then curiosity is the only natural next step.” \n➜ Let them try you on for size. Many companies give life-complexity candidates room to prove themselves by letting them audition for jobs, rather than just applying. “We let people come and sit side by side with us while we work on a real challenge,” says Briana van Strijp, head of people and culture for Anthemis, an investment and advisory fund focusing on digital financial services. Since collaboration is a key value, “it leads to richer interactions and actual conversations.” \n➜ Share your own story. For applicants without elite educational backgrounds, interviews can be daunting. Opening up about your own life story can put an interviewee at ease, establishing rapport and trust. “Everyone has a story, everyone has stumbled, and everyone has succeeded,” says Salesforce’s Tony Prophet. Strategic disclosure can be disarming and lead to better conversations—giving the candidates a chance to describe the strengths they’re bringing to you. “It’s part of being an authentic leader,” he notes. \nA version of this post appears as a sidebar in the article “ How Your Life Experience Could Help You Land a Great Job ” from the Feb. 1, 2018 issue of Fortune. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-19T16:42:18.001+02:00", "highlightTitle": ""}