{"organizations": [], "uuid": "85597b36767373768fdd85c97e8b82609cffc8df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220676878&w=1200&r=LYNXMPEE09007", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-britain-economy-bcc/uk-economy-set-for-underwhelming-2018-says-british-chambers-of-commerce-idUSKBN1EZ00J", "country": "US", "domain_rank": 408, "title": "UK economy set for 'underwhelming' 2018, says British Chambers of Commerce", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T08:15:00.000+02:00", "replies_count": 0, "uuid": "85597b36767373768fdd85c97e8b82609cffc8df"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-economy-bcc/uk-economy-set-for-underwhelming-2018-says-british-chambers-of-commerce-idUSKBN1EZ00J", "ord_in_thread": 0, "title": "UK economy set for 'underwhelming' 2018, says British Chambers of Commerce", "locations": [], "entities": {"persons": [{"name": "suren th", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "british chambers of commerce london", "sentiment": "negative"}, {"name": "british chambers of commerce", "sentiment": "none"}, {"name": "bcc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Britain’s economy looks set for an underwhelming 2018, according to a major survey on Wednesday that showed businesses are in a subdued mood ahead of Brexit.\nCompanies continued to grapple with cost pressures in the last three months of 2017 and were reluctant to invest more, the British Chambers of Commerce’s (BCC) Quarterly Economic Survey showed.\nThe services sector, which represents the lion’s share of Britain’s economy, continued to expand at a subdued pace, the BCC said. Manufacturers did better than services firms, but still reported a slowdown in both domestic and export sales.\nOverall the survey suggested the economy grew modestly at the end of last year, after picking up slightly in the three months to September with quarterly growth of 0.4 percent - below a historic trend of nearer 0.6 percent.\n“The economy is set to continue on an underwhelming growth trajectory over the near term with uncertainty over the impact of Brexit coupled with high inflation and weak productivity likely to dampen overall economic activity,” the BCC’s head of economics, Suren Thiru, said.\nEconomists polled by Reuters generally think the world’s sixth-largest economy will expand modestly during 2018, underperforming most of its peers but doing better than the gloomy predictions made around the time of the shock vote to quit the European Union in mid-2016.\nThe survey of 7,000 companies - the largest of its type - showed the proportion of services companies reporting recruitment difficulties rose to 71 percent, the highest since records started in 1989.\nThe BCC warned that this could prove to be the biggest drag on businesses in 2018, and urged its members to train more staff, rather than simply complain about staff shortages.\nMore than a third of services companies expected to raise prices over the next three months, the most since late 2008.\nThat will concern Bank of England officials, since the BCC’s gauges link well with official measures of producer prices that are a guide to future inflation pressure, even if past reports of skills shortages have not brought faster wage growth.\nLast month the BoE said inflation was likely to fall slowly in 2018. Consumer price inflation rose to its highest in nearly six years in November at 3.1 percent.\nThe central bank also anticipates a further improvement in business investment in 2018.\nBut the BCC survey showed no sign of a firm upswing in investment plans among either services or manufacturing companies, similar to a Deloitte survey of major company bosses out earlier this week.\nOfficial data for industrial and construction output in November, as well as trade, are due at 0930 GMT.\nReporting by Andy Bruce, editing by David Milliken\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T08:15:00.000+02:00", "crawled": "2018-01-10T02:53:10.010+02:00", "highlightTitle": ""}