{"organizations": [], "uuid": "4952d99318d0456494c51cbd213f027ebd6d02f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/15/the-associated-press-chinas-gac-to-scrap-trump-sounding-brand-for-us-market.html", "country": "US", "domain_rank": 767, "title": "China's GAC to scrap Trump-sounding brand for US market", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T21:42:00.000+02:00", "replies_count": 0, "uuid": "4952d99318d0456494c51cbd213f027ebd6d02f1"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/15/the-associated-press-chinas-gac-to-scrap-trump-sounding-brand-for-us-market.html", "ord_in_thread": 0, "title": "China's GAC to scrap Trump-sounding brand for US market", "locations": [], "entities": {"persons": [{"name": "wang qiujing", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "wang", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "trumpchi", "sentiment": "none"}], "organizations": [{"name": "gac motor", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "gac engineering institute china", "sentiment": "none"}, {"name": "gac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (AP) — Chinese automaker GAC Motor will scrap the brand name it uses in China when it enters the U.S. market next year because it could be confused with President Donald Trump's surname.\nFor the past eight years, GAC has sold cars and SUVs under the brand Trumpchi in its home market, but is now researching new names before the company's expected U.S. debut in the fourth quarter of 2019.\n\"We want to provide the best service for American customers, so we want to not be closely linked with politics,\" Wang Qiujing, president of GAC Engineering Institute China, said through an interpreter in an interview at the Detroit auto show. \"This is the reason we want to rename the brand.\"\nGAC picked the Chinese name Trumpchi in 2010, well before Trump was elected. The similarity to Trump is just a coincidence, Wang added. GAC will continue to use Trumpchi in China, where the word means legend and good fortune.\nGAC's first vehicle in the U.S. will be the GS8, a loaded-out full-size SUV that will cost about $35,000. Two more vehicles are being researched for U.S. sales, but have not been selected yet.\nThe company showed seven different of its models on a video and unveiled two more at the Detroit show. One is a gull-wing compact electric SUV called the Enverge, which is still in the concept phase. The automaker says it will go over 370 miles on a single charge. Also unveiled was the GA4 midsize sedan that will go on sale in China later this month.\nThe GS8 would be comparable to a big luxury SUV, many of which go for more than $60,000. Wang said he didn't know what the brand's lowest-price vehicle would be in the U.S.\nGAC sold just over 500,000 automobiles in China last year, up 37 percent from 2016.\nThe company says it is negotiating with partner Fiat Chrysler about possible distribution of vehicles. Wang said GAC is the top-ranked domestic brand for initial quality in China in J.D.Power and Associates surveys, and it ranks fourth or fifth when joint ventures with foreign automakers are included. He says the company's vehicle quality will be ready for U.S. buyers, and it will work with U.S. partners to meet stricter U.S. safety standards.\nChinese automakers are advanced and have expertise in mass production but the American market may not be ready yet to accept GAC, said Jake Fisher, Consumer Reports' director of auto testing.\nOther Chinese companies showed vehicles at the CES gadget show in Las Vegas last week such as Byton, which unveiled an electric prototype that's like a Tesla Model X SUV but costs thousands less, Fisher said.\n\"There will be Chinese automakers at the top of the market and at the bottom of the market, and it will be very interesting to see how they are received,\" he said.\nGAC already has a research center in Silicon Valley and is working on another one in Detroit, as well as a Los Angeles design center. Initially it will import vehicles from China but depending on sales, plans to build a factory in the U.S.\nGAC, which stands for Guangzhou Automobile Group Co., also plans to enter other global markets after the U.S., including Europe.\nAuto Writer Dee-Ann Durbin contributed to this report.", "external_links": [], "published": "2018-01-15T21:42:00.000+02:00", "crawled": "2018-01-16T08:05:33.017+02:00", "highlightTitle": ""}