{"organizations": [], "uuid": "3f81fc34b79e63ea226917e755daa8ac9ec42637", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222550703&w=1200&r=LYNXMPEE0F1NT", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-cup/leicester-through-in-cup-as-var-gives-first-goal-in-england-idUKKBN1F52U3", "country": "US", "domain_rank": 408, "title": "Leicester through in Cup as VAR gives first goal in England", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:34:00.000+02:00", "replies_count": 0, "uuid": "3f81fc34b79e63ea226917e755daa8ac9ec42637"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-cup/leicester-through-in-cup-as-var-gives-first-goal-in-england-idUKKBN1F52U3", "ord_in_thread": 0, "title": "Leicester through in Cup as VAR gives first goal in England", "locations": [], "entities": {"persons": [{"name": "kelechi iheanacho", "sentiment": "none"}, {"name": "nathan pond", "sentiment": "none"}, {"name": "iheanacho", "sentiment": "none"}, {"name": "jon moss", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "fleetwood town - king power stadium", "sentiment": "none"}], "organizations": [{"name": "var", "sentiment": "negative"}, {"name": "leicester", "sentiment": "negative"}, {"name": "reuters/carl recine  iheanacho", "sentiment": "none"}, {"name": "fleetwood", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "england reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "fleetwood town", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 10:37 PM / Updated 12 hours ago Leicester through as Iheanacho scores first VAR goal in England Toby Davis 4 Min Read \nLONDON (Reuters) - Leicester City’s Kelechi Iheanacho scored the first goal in English football to be awarded using the Video Assistant Referee (VAR) as they reached the FA Cup fourth round with a 2-0 replay victory over third-tier Fleetwood Town on Tuesday. \nIheanacho, who had put the hosts ahead in the first half, was initially ruled offside when he deftly chipped the ball over the keeper into the net in the 77th minute but the goal was given after consultation between referee Jon Moss and the VAR. \nVideo replays showed former Manchester City striker Iheanacho was level with Fleetwood defender Nathan Pond’s back foot before the Nigeria international raced clear to finish. \n“I didn’t know if I was onside or offside but I agree totally now that I was onside,” Iheanacho told BT Sport. \n“I was concentrating on the goal, I didn’t think if I was onside or offside but Riyad (Mahrez) told me that I was onside. We just waited to see what the decision was.” \nPremier League side West Ham United were given a severe test by third-tier Shrewsbury Town but came through in extra time thanks to Reece Burke’s first goal for the London club. \nChampionship sides Cardiff City, Sheffield Wednesday and Reading all reached the next round with victories over Mansfield Town, Carlisle United and Stevenage respectively. \nIheanacho, a 25 million pounds ($34 million) signing from Manchester City in August, had endured a barren spell in front of goal since making the move, but was given a chance to shine with former Fleetwood striker Jamie Vardy starting on the bench. \nThe 21-year-old Nigerian opened the scoring with only his second goal for the club in the 43rd minute as Islam Slimani played a neat ball over the top and Iheanacho coolly converted. Soccer Football - FA Cup Third Round Replay - Leicester City vs Fleetwood Town - King Power Stadium, Leicester, Britain - January 16, 2018 Leicester City's Kelechi Iheanacho celebrates scoring their second goal after a VAR (Video Assistant Referee) decision Action Images via Reuters/Carl Recine VAR DECISION \nHe was similarly sharp with 13 minutes remaining as he latched onto Riyad Mahrez’s through ball and lifted it precisely over Fleetwood keeper Chris Neal only for his celebrations to be temporarily halted by the linesman’s flag. \nThe goal was awarded, however, 68 seconds after it hit the net as video official Mike Jones told Moss that Pond’s back foot had kept Iheanacho onside. Soccer Football - FA Cup Third Round Replay - Leicester City vs Fleetwood Town - King Power Stadium, Leicester, Britain - January 16, 2018 Referee Jonathan Moss reacts after Leicester City's Kelechi Iheanacho scored their second goal after a VAR (Video Assistant Referee) decision REUTERS/Darren Staples \nThe second goal effectively ended Fleetwood’s resistance and set up a fourth round match between Leicester and League One side Peterborough United. \nWest Ham had been held to a goalless draw at Shrewsbury in the first tie and needed 112 minutes of the replay to break the deadlock at the London Stadium. \nThe goal was worth waiting for, however, as Burke met a cross and thrashed the ball into the top corner off the underside of the bar leaving West Ham to play Bournemouth or Wigan Athletic in the next round. \nCardiff swatted League Two Mansfield aside 4-1 away to set up a tie at home to Premier League leaders Manchester City, whose manager Pep Guardiola was watching the third round replay from the stands. \nSheffield Wednesday scored in each half through Marco Matias and Atdhe Nuhiu to beat visiting League Two outfit Carlisle 2-0. \nReading’s Icelandic forward Jon Dadi Bodvarsson got a hat-trick for the second-tier side who beat Stevenage 3-0. Reporting by Toby Davis; Editing by Ken Ferris", "external_links": [], "published": "2018-01-17T00:34:00.000+02:00", "crawled": "2018-01-17T00:57:36.013+02:00", "highlightTitle": ""}