{"organizations": [], "uuid": "c1403a06c18a28aeb4b449d040ce5f40b960ec47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://asset.wsj.net/images/im-1244/social", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/trump-administration-seeks-curbs-on-student-loan-forgiveness-1515027140", "country": "US", "domain_rank": 387, "title": "Trump Administration Seeks Curbs on Student-Loan Forgiveness", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.937, "site_type": "news", "published": "2018-01-04T03:52:00.000+02:00", "replies_count": 0, "uuid": "c1403a06c18a28aeb4b449d040ce5f40b960ec47"}, "author": "Michelle Hackman", "url": "https://www.wsj.com/articles/trump-administration-seeks-curbs-on-student-loan-forgiveness-1515027140", "ord_in_thread": 0, "title": "Trump Administration Seeks Curbs on Student-Loan Forgiveness", "locations": [], "entities": {"persons": [{"name": "obama", "sentiment": "none"}], "locations": [], "organizations": [{"name": "trump administration seeks curbs on student-loan forgiveness the trump", "sentiment": "negative"}, {"name": "education department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Jan 4, 2018 1:37 p.m. ET Share \nITT Tech students fought for a seat at the table in the company’s bankruptcy Getty Images The trustee overseeing the bankruptcy of ITT Educational Services, a for-profit college chain, which collapsed last year, filed a motion Wednesday urging the judge in the case to accept a settlement with a class of former students. \nBy Jillian Berman Reporter \nFormer students of a for-profit college who say they were duped into paying for worthless degrees could get some of their money back, thanks to a recent motion in the now-defunct school’s bankruptcy case. \nThe trustee overseeing the bankruptcy of ITT Educational Services, a for-profit college chain, which collapsed last year, filed a motion Wednesday urging the judge in the case to accept a settlement with a class of former students. If the judge approves the agreement, the court would recognize a $1.5 billion claim from students who attended the school between 2006 and 2016. \nPractically speaking, that means that if there’s money left at the end of the bankruptcy, the class of students would be in line with ITT’s other creditors to receive a total payment of up to $1.5 billion, that would be divided among the class. \nIt’s unlikely that kind of money will be left when ITT’s bankruptcy is wrapped up, but the proposed settlement serves at least as a symbolic acknowledgment that the school owes students money for the harm it allegedly caused them. \nThe proposed settlement comes roughly a year after ITT students filed a class-action lawsuit as part of the company’s bankruptcy claiming the school lured them into enrolling with misleading information about their career prospects and left them worse off than when they enrolled — often owing debt for degrees that didn’t help them in the labor market. \n“In our view, the proposed settlement agreement is a victory for former students who were defrauded by ITT,” the students’ lawyers at Harvard Law School’s Project on Predatory Lending wrote in an email to students Wednesday evening. “However, we know that the student class still faces billions of dollars of federal and private student loans from ITT and we will continue fight for all ITT-related debt to be canceled.” \nIndeed, the financial fate borrowers who say they were duped by their colleges remains in limbo. Betsy DeVos’s Department of Education announced late last year that some students seeking to have their loans forgiven under a law that allows borrowers to cancel their loans if they were misled by their school would only get partial relief , instead of the full relief touted by the Obama administration. Reports this week also indicate that the Trump administration is considering holding students who say they were defrauded by their colleges to a higher standard of proof. \nIf approved, the ITT bankruptcy settlement would have tangible benefits for students. The settlement would cancel nearly $600 million in money ITT claimed students owed the school. It would also return the nearly $3 million students have paid to ITT since it filed for bankruptcy in 2016. \nThough it’s rare for former for-profit college students to get this kind of relief through a company’s bankruptcy, deals with classes of consumers are relatively common in corporate bankruptcies, said Bruce Markell, a professor of bankruptcy law and practice at Northwestern University’s Pritzker School of Law. \n“The trustee’s goal is obviously to resolve the case as quickly as possible and many times what that involves is compromise and settlement with various claimants,” he said. “My guess is there won’t be too much upset here, the only people who are going to complain would the people who think they should get more, but then they could opt out of the settlement.” MarketWatch Partner Center Most Popular", "external_links": [], "published": "2018-01-04T03:52:00.000+02:00", "crawled": "2018-01-04T04:22:18.018+02:00", "highlightTitle": ""}