{"organizations": [], "uuid": "14d29cd69835c2b4e93d666537e4aa57e3bf237a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-tax-agriculture/whoops-last-minute-change-to-u-s-tax-overhaul-splits-grains-sector-idUSL1N1P61F0", "country": "US", "domain_rank": 408, "title": "Whoops! Last-minute change to U.S. tax overhaul splits grains sector", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.668, "site_type": "news", "published": "2018-01-13T03:21:00.000+02:00", "replies_count": 0, "uuid": "14d29cd69835c2b4e93d666537e4aa57e3bf237a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-tax-agriculture/whoops-last-minute-change-to-u-s-tax-overhaul-splits-grains-sector-idUSL1N1P61F0", "ord_in_thread": 0, "title": "Whoops! Last-minute change to U.S. tax overhaul splits grains sector", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "john hoeven", "sentiment": "none"}, {"name": "john thune", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "south dakota", "sentiment": "none"}, {"name": "north dakota", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "archer daniels midland co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan 12 (Reuters) - Republican U.S. senators are working with some of the world’s biggest agricultural merchants to undo a last-minute provision in the tax overhaul that threatens to distort the grains market and starve private firms of corn, soy and wheat supplies.\nIt was included during final revisions of the tax bill that passed the Republican-controlled Congress last month. The restructuring of the tax code, the biggest in 30 years, handed President Donald Trump his first major legislative victory since taking office.\nThe provision gives farmers a 20 percent deduction on payments for sales of crops to farmer-owned cooperatives, but not for sales to private or investor-owned grains handlers such as global firm Archer Daniels Midland Co.\nThe modification was introduced to compensate co-ops and their farmer owners when Congress eliminated a part of the tax code, known as Section 199, which had benefited them for more than a decade.\nRepublican Senators John Hoeven of North Dakota and John Thune of South Dakota are among the lawmakers whose offices said their attempt to create an equivalent to the old tax code had backfired by incentivizing sales to co-ops at the expense of others in the market.\n“Sen. Thune is now aware of the unintended situation this new provision could create in the agriculture industry,” his spokesman Ryan Wrasse said in a statement. He added that Thune believes tax laws should not sway where farmers sell their harvests.\nThe government wants to correct the disparity, and the U.S. Department of Agriculture said on Friday it expects a solution to be forthcoming.\n“The federal tax code should not pick winners and losers in the marketplace,” Greg Ibach, an undersecretary at the USDA, said in a separate statement.\nADM and Cargill Inc, two of the world’s top agricultural traders, joined talks with Hoeven, Senate aides, and trade associations that represent co-ops and private firms to come up with a way to even the playing field. Representatives of grain companies and lawmakers met in Washington twice this week in a sign of the urgency of the matter.\nIf legislators don’t address the provision by the autumn harvest, private grain companies could lose out on deals to buy billions of bushels of corn and soybeans. Farmers already are looking at how they can transfer grain stored at private elevators to co-ops to take advantage of the new law.\n“It’s a massive issue for people like us, ADM, Cargill, all the private ethanol buyers and on and on and on,” said Dale Beyer, chief financial officer for Minn-Kota Ag Products, a private grain handler in Minnesota.\nThune and Hoeven began hearing in early January that the provision would influence where farmers sell their products, according to the National Grain and Feed Association, a trade group that has met repeatedly with the lawmakers’ aides this month to discuss the issue.\nThe association told members in an email that it learned of the provision in late December, after it was included in the final version of the tax law, and immediately asked tax experts for advice. The group then met with Thune and Hoeven staffers to learn why the senators included it in the law.\nThe association, in a separate statement with the National Council of Farmer Cooperatives, said it was working with Hoeven, Thune and Senator Pat Roberts of Kansas, also a Republican, to reach “an equitable solution” that preserves benefits formerly available to co-ops under Section 199.\nTENSIONS RISE Farmers generally decide to whom they want to sell their grain based on the prices offered by different handlers, how close they live to delivery sites and personal affiliations.\nHowever, the wording of the new provision wrongly assumes that all farmers deliver their grain to co-ops, said Bob Zelenka, executive director of the Minnesota Grain and Feed Association, a trade group that represents co-ops and private companies.\n“It tells me that someone who wrote this is unused to how things work in the ag industry,” he said.\nEfforts to adjust the provision have some co-ops pushing back out of concerns farmers could lose tax benefits.\nChris Pearson, chief executive of the South Dakota Wheat Growers co-op, said on Twitter on Wednesday that the law “gives farmers some nice tax advantages when doing business with the ORGANIZATION THEY OWN!”\nPearson did not respond to calls and emails seeking comment.\n“I would hate to see private companies raise our farmers’ taxes!” he tweeted on his account @CEOWheatGrowers. (Additional reporting by David Morgan in Washington; Editing by Simon Webb and Paul Simao)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T03:21:00.000+02:00", "crawled": "2018-01-13T14:44:14.005+02:00", "highlightTitle": ""}