{"organizations": [], "uuid": "4731725da11b300bcfdfb156f0ef4806c3db9ba4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/asia-oil/graphic-rising-brent-crude-price-shuts-window-on-european-oil-exports-to-asia-idUSL3N1PD416", "country": "US", "domain_rank": 408, "title": "GRAPHIC-Rising Brent crude price shuts window on European oil exports to Asia", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-24T14:08:00.000+02:00", "replies_count": 0, "uuid": "4731725da11b300bcfdfb156f0ef4806c3db9ba4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/asia-oil/graphic-rising-brent-crude-price-shuts-window-on-european-oil-exports-to-asia-idUSL3N1PD416", "ord_in_thread": 0, "title": "GRAPHIC-Rising Brent crude price shuts window on European oil exports to Asia", "locations": [], "entities": {"persons": [{"name": "florence tan", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "mediterranean", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "thomson reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Europe crude loadings to Asia at lowest in 4 yrs - Reuters data\n* Strong diesel, jet fuel margins drive light crude demand\nBy Florence Tan\nSINGAPORE, Jan 24 (Reuters) - European crude oil loadings bound for Asia have dropped to their lowest in four years at the start of 2018 as rising Brent prices shut the arbitrage window, causing the premiums of similar Middle Eastern and Russian grades to rise as refiners make up the shortfall.\nThat refiners are willing to pay up for these grades underscores the demand in Asia for light crudes, which typically yield a high volume of diesel fuel when refined, in order to cash in on high profit margins for diesel and jet fuel.\nThe volume of crude loading in the North Sea and the Mediterranean for Asia slumped in January to 7.6 million barrels, less than half of the 17 million barrels in January 2017, Thomson Reuters trade flow data showed.\nThe drop reflects the widening of the premium of European benchmark Brent to Middle East benchmark Dubai, a proxy measure of the economic viability of shipping arbitrage cargoes from Europe to Asia.\nThe monthly average of the Brent-Dubai spread widened in November to above $3 a barrel, a level where the arbitrage window is considered shut, for the first time since June 2016, Thomson Reuters data showed. In mid-2017 that spread narrowed to below $1. DUB-EFS-1M\nThe spread widened as Brent prices rose after a pipeline disruption blocked supplies of Forties, a North Sea crude grade that is key in pricing the benchmark. The wider spread combined with rising tanker rates and strong European crude demand that kept supplies there to further cut arbitrage supplies to Asia.\n“The arbitrage is blocked because of a wider Brent-Dubai spread,” said a trader with a North Asian refiner, adding that the lower arbitrage volume supports prices for light grades.\nAs western supplies of light crude, particularly Forties, have dried up, Asian refiners are turning to Middle East and Russian crude to profit from the higher middle distillate margins, driving up spot premiums, said multiple traders that participate in the market.\nMurban crude, a light grade from Abu Dhabi, is currently valued at a premium of 23 cents a barrel to its official selling and has traded at a premium for the past six months, the longest streak since 2016. MUR-1Madn-\nRussian Sokol crude, which has a high middle distillate yield, this month sold at its highest premium in a year, while ESPO was at its highest since February 2016 and Sakhalin Blend at the highest in two years.\nSince the start of November, gasoil margins have climbed 32 percent while gasoline margins have slumped 17 percent and fuel oil discounts have more than doubled.\n“Refining margins are good now so there’s a strong pull for cargoes that can reach promptly,” said a Singapore-based oil trader.\nLight crude demand has also risen after China decided in late 2017 to switch to low-sulphur diesel fuel for industrial uses, a third trader said.\nReporting by Florence Tan in SINGAPORE; Additional reporting by Jessica Jaganathan in SINGAPORE, Olga Yagova in MOSCOW and Alex Lawler in LONDON; Editing by Christian Schmollinger\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T14:08:00.000+02:00", "crawled": "2018-01-25T12:57:49.026+02:00", "highlightTitle": ""}