{"organizations": [], "uuid": "ca5f5c0b9068e7d6390df0baf02d96b7cabc2b93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-fiat-chrysler-corruption-labor/former-fiat-chrysler-vp-pleads-guilty-in-u-s-union-corruption-probe-idUKKBN1FB36B", "country": "US", "domain_rank": 408, "title": "Former Fiat Chrysler VP pleads guilty in U.S. union corruption probe", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T01:35:00.000+02:00", "replies_count": 0, "uuid": "ca5f5c0b9068e7d6390df0baf02d96b7cabc2b93"}, "author": "", "url": "https://uk.reuters.com/article/uk-fiat-chrysler-corruption-labor/former-fiat-chrysler-vp-pleads-guilty-in-u-s-union-corruption-probe-idUKKBN1FB36B", "ord_in_thread": 0, "title": "Former Fiat Chrysler VP pleads guilty in U.S. union corruption probe", "locations": [], "entities": {"persons": [{"name": "david shepardson", "sentiment": "none"}, {"name": "alphons iacobelli", "sentiment": "none"}, {"name": "iacobelli", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}], "organizations": [{"name": "fiat chrysler", "sentiment": "negative"}, {"name": "fiat chrysler automobiles nv", "sentiment": "none"}, {"name": "united auto workers", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "district court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 11:37 PM / Updated 15 minutes ago Former Fiat Chrysler VP pleads guilty in U.S. union corruption probe David Shepardson 3 Min Read \n(Reuters) - Former Fiat Chrysler Automobiles NV ( FCHA.MI ) vice president Alphons Iacobelli pleaded guilty on Monday in connection with a U.S. investigation into allegations he made at least $1.5 million in improper payments to senior union officials, the U.S. attorney’s office in Detroit said. \nIacobelli, 58, a former Fiat Chrysler vice president of employee relations, was charged in July in U.S. District Court in Detroit with taking part in a conspiracy to pay prohibited money and gifts to United Auto Workers union officials. \nSentencing was set for May 29. Iacobelli faces a statutory maximum of eight years in prison, and prosecutors said he will be required to repay $835,000. \nA lawyer for Iacobelli did not immediately comment on Monday. \nIacobelli plead guilty to conspiracy to violate the Labor Management Relations Act and to subscribing a false tax return based on his failure to report hundreds of thousands of dollars in income that he illegally diverted, the government said. \nThe government said Iacobelli conspired to make illegal payments in an effort to obtain concessions and advantages for Fiat Chrysler “in the negotiation, implementation and administration of the collective bargaining agreements between FCA and the UAW.” \nMonica Morgan, the wife of former UAW Vice President General Holiefield, who died in March 2015, is also expected to plead guilty, Reuters reported last week, citing a person briefed on the matter. She faces a plea hearing on Feb. 6. \nMorgan was charged with conspiring with Iacobelli to violate federal labour law. Morgan’s lawyer, Steve Fishman, declined comment. \nThe Justice Department has a wide-ranging investigation under way. In November, General Motors Co ( GM.N ) and Ford Motor Co ( F.N ) confirmed they were cooperating with the investigation into alleged misspending at UAW union training centres funded by U.S. automakers. \nIt was not clear if Iacobelli is cooperating in the ongoing investigation. \nGeneral Motors is conducting an internal investigation into the matter. \nJerome Durden, a former Fiat Chrysler official whom the government charged with conspiring to divert over $4.5 million in UAW training centre funds, pleaded guilty in August. \nThe UAW said in a statement Monday that it is “appalled at these charges. We have worked with the (national training centre) and Fiat Chrysler to implement a range of measures aimed at enhancing transparency and internal controls at the NTC to reduce the risk of any future recurrence of these activities.” \nFiat Chrysler Chief Executive Sergio Marchionne has said the “deplorable” conduct “had nothing whatsoever to do with the collective bargaining process” and the “egregious acts were neither known to nor sanctioned by (Fiat Chrysler).” The company had no further comment Monday. Reporting by David Shepardson", "external_links": [], "published": "2018-01-23T01:35:00.000+02:00", "crawled": "2018-01-23T01:58:55.022+02:00", "highlightTitle": ""}