{"organizations": [], "uuid": "d0683f759f7fec3167884581ff288d2f415623c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-oath-announces-new-cfo-to-take-company-through-next-phase-of-growth.html", "country": "US", "domain_rank": 767, "title": "Oath New CFO To Take Company Through Next Phase of Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.994, "site_type": "news", "published": "2018-01-26T16:00:00.000+02:00", "replies_count": 0, "uuid": "d0683f759f7fec3167884581ff288d2f415623c7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-oath-announces-new-cfo-to-take-company-through-next-phase-of-growth.html", "ord_in_thread": 0, "title": "Oath New CFO To Take Company Through Next Phase of Growth", "locations": [], "entities": {"persons": [{"name": "oath", "sentiment": "none"}, {"name": "vanessa wittman", "sentiment": "none"}, {"name": "vanessa", "sentiment": "none"}, {"name": "tim armstrong", "sentiment": "none"}, {"name": "wittman", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "verizon", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "yahoo", "sentiment": "none"}, {"name": "marsh & mclennan", "sentiment": "none"}, {"name": "motorola", "sentiment": "none"}, {"name": "aol", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Today, Oath, a Verizon (NYSE, Nasdaq: VZ) subsidiary and the parent company of Yahoo, AOL, HuffPost, and other dynamic brands that serve a combined billion global consumers, announces that Vanessa Wittman will join the company as Chief Financial Officer (CFO). Ms. Wittman is a recognized business leader with impressive financial experience in the tech and media industries, having previously served as CFO at Dropbox, Motorola, and Marsh & McLennan.\nAt Oath, Ms. Wittman will lead global financial strategy and operations. She will partner with Oath CEO Tim Armstrong to help propel Oath's strategic expansion as it becomes one of the world's largest internet and mobile brand companies.\n“Vanessa is an exceptional leader with singular experience, and she will be a great partner to help drive Oath's vision, strategy, and operations to reach our long term goals,” said Tim Armstrong, CEO, Oath. “Vanessa joins Oath at an exciting point in our journey to build a differentiated company creating the future of mobile and the internet in combination with Verizon. I want to thank Holly Hess for being a founding force at Oath, as well as a driver behind the original Verizon and AOL deal. She made significant contributions to Oath and we look forward to continued collaboration with Holly in her new role at Verizon.”\n“I’m thrilled to join the Oath leadership team to help accelerate its growth,” said Vanessa Wittman, CFO, Oath. “The team has laid a solid foundation through the integration efforts over the last several months, and I look forward to helping drive the expansion of current business lines while investing in innovative bets for the future.”\nOath’s former CFO Holly Hess will take on a newly created role at Verizon where she will lead Verizon’s previously announced $10B cost savings initiative. Ms. Hess will report to Verizon CFO Matt Ellis. In her three years at Oath, Ms. Hess lead the Oath team through the close of Verizon’s acquisition of Yahoo in June 2017, strengthening Oath’s global financial infrastructure and establishing best-in-class revenue and accounting systems through the integration.\nAbout Oath\nOath, a subsidiary of Verizon, is a values-led company committed to building brands people love. Oath reaches one billion people around the world with a dynamic house of media and technology brands. A global leader in digital and mobile, Oath is shaping the future of media. For more on Oath, visit www.oath.com .\nAbout Verizon\nVerizon Communications Inc. (NYSE, Nasdaq: VZ), headquartered in New York City, generated $126 billion in 2017 revenues. The company operates America’s most reliable wireless network and the nation’s premier all-fiber network, and delivers integrated solutions to businesses worldwide.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005133/en/\nOath Media Relations:\nSuzanne Philion\npress@oath.com\nor\nVZ Media Relations\nAdria Tomaszewski\nAdria.tomaszewski@verizonwireless.com\nSource: Oath", "external_links": ["http://www.businesswire.com/news/home/20180126005133/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.oath.com&esheet=51749301&newsitemid=20180126005133&lan=en-US&anchor=www.oath.com&index=1&md5=1d606e9f9137d32917518336c2e5a5c2"], "published": "2018-01-26T16:00:00.000+02:00", "crawled": "2018-01-26T18:12:18.005+02:00", "highlightTitle": ""}