{"organizations": [], "uuid": "8f82a8068045f19e50f9a02335a83928d139e7d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-park-electrochemical-corp-areports-third-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Park Electrochemical Corp. Reports Third Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-04T16:30:00.000+02:00", "replies_count": 0, "uuid": "8f82a8068045f19e50f9a02335a83928d139e7d3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-park-electrochemical-corp-areports-third-quarter-results.html", "ord_in_thread": 0, "title": "Park Electrochemical Corp. Reports Third Quarter Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "melville", "sentiment": "none"}], "organizations": [{"name": "park electrochemical corp", "sentiment": "neutral"}, {"name": "park electrochemical corp.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Announces Repayment of Outstanding Debt\nDeclares Special Cash Dividend\nAnnounces Strategic Evaluation of Electronics Business\nAn investor presentation will be available on the Company's web site at\nhttps://parkelectro.com/shareholders/investor-conference-calls/ .\nTHIRD QUARTER RESULTS\nMELVILLE, N.Y., Jan. 04, 2018 (GLOBE NEWSWIRE) -- Park Electrochemical Corp. (NYSE:PKE) reported net sales of $26,139,000 for the 2018 fiscal year’s third quarter ended November 26, 2017 compared to net sales of $26,462,000 for last fiscal year’s third quarter ended November 27, 2016 and net sales of $29,836,000 for the 2018 fiscal year’s second quarter ended August 27, 2017. Park’s net sales for the nine months ended November 26, 2017 were $83,392,000 compared to net sales of $87,010,000 for the nine months ended November 27, 2016. Net earnings for the current year’s third quarter were $716,000 compared to $1,875,000 for last year’s third quarter and $520,000 for the current year’s second quarter. Net earnings were $2,630,000 for the current year’s nine-month period compared to $6,806,000 for last year’s nine-month period.\nPark reported net earnings before special items of $1,131,000 for the current fiscal year’s third quarter compared to net earnings before special items of $1,944,000 for last year’s third quarter and net earnings before special items of $2,343,000 for the current year’s second quarter. Pre-tax earnings before special items were $1,508,000 for the current fiscal year’s third quarter compared to pre-tax earnings before special items of $2,117,000 for last year’s third quarter and pre-tax earnings before special items of $2,882,000 for the current year’s second quarter. In the current fiscal year’s third quarter, the Company recorded pre-tax restructuring charges of $472,000 related to the consolidation of its Nelco Products, Inc. electronics Business Unit located in Fullerton, California, and its Neltec Inc. electronics Business Unit located in Tempe, Arizona and the closure, in fiscal year 2009, of its New England Laminates Co., Inc. electronics facility located in Newburgh, New York and advisory fees related to the strategic evaluation discussed below of $190,000 included in selling, general and administrative expenses. In the 2017 fiscal year’s third quarter, the Company recorded pre-tax restructuring charges of $113,000 in connection with the Newburgh facility closure. In the current fiscal year’s second quarter, the Company recorded pre-tax restructuring charges of $2,902,000 in connection with the consolidation of its Nelco Products, Inc. and its Neltec Inc. electronics Business Units and the closure of the Newburgh facility.\nFor the nine-month period ended November 26, 2017, Park reported net earnings before special items of $5,958,000 compared to net earnings before special items of $6,932,000 for last fiscal year’s first nine-month period. Pre-tax earnings before special items were $6,599,000 for the nine-month period ended November 26, 2017 compared to pre-tax earnings before special items of $7,771,000 for last fiscal year’s first nine-month period. The current year’s nine-month period included pre-tax charges of $4,925,000 related to the consolidation, facility closure, the advisory fees mentioned above and a one-time pretax litigation expense of $375,000 included in the selling, general and administrative expenses. Last year’s nine-month period included pre-tax charges of $206,000 related to the Newburgh facility closure mentioned above.\nPark reported basic and diluted earnings per share of $0.04 for the 2018 fiscal year’s third quarter compared to $0.09 for the 2017 fiscal year’s third quarter and $0.03 for the 2018 fiscal year’s second quarter. Basic and diluted earnings per share before special items were $0.06 for the 2018 fiscal year’s third quarter compared to $0.10 for the 2017 fiscal year’s third quarter and $0.12 for the 2018 fiscal year’s second quarter.\nPark reported basic and diluted earnings per share of $0.13 for the 2018 fiscal year’s first nine months compared to $0.34 for the 2017 fiscal year’s first nine-month period and basic and diluted earnings per share before special items of $0.29 for the 2018 fiscal year’s first nine months compared to $0.34 for the 2017 fiscal year’s first nine-month period.\nPark believes that an evaluation of its ongoing operations would be difficult if the disclosure of its financial results were limited to accounting principles generally accepted in the United States of America (“GAAP”) financial measures, which include special items, such as restructuring charges, advisory fees and one-time litigation expense. Accordingly, in addition to disclosing its financial results determined in accordance with GAAP, Park discloses non-GAAP operating results that exclude special items in order to assist its shareholders and other readers in assessing the Company’s operating performance, since the Company’s on-going, normal business operations do not include such special items. The detailed operating information presented below reconciles the non-GAAP operating results before special items to earnings determined in accordance with GAAP. Such non-GAAP financial measures are provided to supplement the results provided in accordance with GAAP.\nREPAYMENT OF OUTSTANDING DEBT\nPark announced the voluntary repayment of all outstanding debt under the Credit Agreement, dated as of January 15, 2016, between the Company and HSBC Bank USA, in the amount of approximately $69 million, including principal and accrued interest, effective January 3, 2018. The Company also announced the termination of the Credit Agreement.\nThe repayment of the outstanding debt was funded from the Company’s cash balances. The change in the U.S. tax code, as provided by the Tax Cuts and Jobs Act (“Act”), has allowed the Company to repatriate its foreign accumulated income at a lower effective tax rate. The Act, which was passed in December 2017, provides an incentive for United States companies to repatriate accumulated income earned in foreign jurisdictions at a reduced U.S. income tax expense. The estimated income tax expense and related liability associated with the repatriation is approximately $20 million compared to an estimated $60 million in income tax expense that the Company would have incurred if it had repatriated the accumulated foreign income before the effectiveness of the Act. The repatriation of accumulated foreign income will be reported in the fourth quarter of the 2018 fiscal year.\nSPECIAL CASH DIVIDEND\nPark announced that its Board of Directors has declared a special cash dividend of $3.00 per share payable February 13, 2018 to shareholders of record at the close of business on January 23, 2018. The special cash dividend will be funded from the Company’s cash balances.\nThis special dividend, together with the Company’s regular quarterly dividend of $0.10 per share payable February 6, 2018 to shareholders of record on January 2, 2018, brings the total amount of dividends paid to shareholders to $20.10 per share, a total of approximately $412 million, since the Company’s 2005 fiscal year.\nSTRATEGIC EVALUATION OF ELECTRONICS BUSINESS\nPark announced that it is conducting a strategic evaluation, including the potential sale, of its iconic high-technology digital and radio frequency/microwave printed circuit materials business, collectively the Electronics Business. Park has retained Green", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/e1c56383-13a1-40d0-bb4f-67ce5ea6fdaa", "https://www.globenewswire.com/Tracker?data=BVyvmazH9Mr0XSyqIPDtj9kQ9kiitTc0RvgEvAarobnZlODQM-sV8Y_Id-z7m9SPN2-4pt1MqCB00YaaZeHqBa4izWhXtqvOUpeCP3WPNj5RKdgA369brUSsS0UYIlreDqCURRKfGtEQ8BEtYkY7FYpgc1d9phvd_QK7ahLIJAJyQQnwFc9GQS-97JF6yRcQWC34DaAMRb1WD2OqPv_1Mg==", "https://www.globenewswire.com/Tracker?data=mWKMFH84rb2V8n3ACf7NmxSs76Ry6CNE7jirpCUY_BXEB5e80j1-ygDlYomu4fmYsbT7SS1G1LuViPbcZVItYydcGKyVJKqKFKqc1NDmNdc=", "https://parkelectro.com/shareholders/investor-conference-calls/", "https://www.globenewswire.com/Tracker?data=BVyvmazH9Mr0XSyqIPDtj9kQ9kiitTc0RvgEvAarobnZlODQM-sV8Y_Id-z7m9SPN2-4pt1MqCB00YaaZeHqBYUdlF7CUD2nSDtY2SFTv1xBTflpEtpE6npWKwIHNiNOjtYTt6FZEV7lyJi5g0Ucma8MpT9ILPYRmXJUAs8hDnHKX2bk1Fi_mCHZsECMNOBHHS9YWL03lJEMeiARPTmNoQ==", "https://www.globenewswire.com/Tracker?data=BVyvmazH9Mr0XSyqIPDtj9kQ9kiitTc0RvgEvAarobnZlODQM-sV8Y_Id-z7m9SPN2-4pt1MqCB00YaaZeHqBVN4mp2ttlScIMPp7CehftYQlVB2Nl5MSmhBDCR6xGrTzJVKq4NSZHY5D9CvwQkbN33UGnFeJSWT4ZCHCr2CMhqVuQY0iAHowLqJq1Rh7fdsV9dJ254xrs8Ep_pfGLErFg=="], "published": "2018-01-04T16:30:00.000+02:00", "crawled": "2018-01-04T16:44:57.003+02:00", "highlightTitle": ""}