{"organizations": [], "uuid": "cdf298563aba2bc75dfdc002ff3984f8cf90cc80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-aerie-pharmaceuticals-announces-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Aerie Pharmaceuticals Announces Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.036, "site_type": "news", "published": "2018-01-24T00:03:00.000+02:00", "replies_count": 0, "uuid": "cdf298563aba2bc75dfdc002ff3984f8cf90cc80"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-aerie-pharmaceuticals-announces-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Aerie Pharmaceuticals Announces Public Offering of Common Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "aerie pharmaceuticals announces public offering of common stock", "sentiment": "negative"}, {"name": "aerie pharmaceuticals, inc.", "sentiment": "neutral"}, {"name": "cantor fitzgerald & co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif.--(BUSINESS WIRE)-- Aerie Pharmaceuticals, Inc. (NASDAQ:AERI), an ophthalmic pharmaceutical company focused on the discovery, development and commercialization of first-in-class therapies for the treatment of patients with glaucoma or ocular hypertension and other diseases of the eye, today announced that it has commenced a registered underwritten public offering of $75 million of shares of its common stock. The underwriter will have a 30-day option from the date of the offering to purchase up to an additional $11.25 million of shares of common stock.\nCantor Fitzgerald & Co. is acting as the sole bookrunner for the offering.\nAerie intends to use the net proceeds of the offering for general corporate purposes, including to fund expansion of its commercialization programs in North America for both Rhopressa ® and Roclatan™, its clinical and commercialization efforts beyond North America, further development of other potential pipeline opportunities, including activities to support the ongoing development of its retina programs and evaluating possible uses of its existing proprietary portfolio of molecules beyond ophthalmology, its external business development efforts, and its manufacturing activities, including the construction of its own manufacturing plant in Ireland.\nA shelf registration statement relating to the shares is effective with the Securities and Exchange Commission. The shares may be offered only by means of the prospectus forming a part of the effective registration statement and a related prospectus supplement. A preliminary prospectus supplement related to the offering will be filed with the Securities and Exchange Commission today. An electronic copy of the preliminary prospectus supplement and the accompanying prospectus will be available on the website of the Securities and Exchange Commission at www.sec.gov . Copies of the preliminary prospectus supplement and the final prospectus supplement, when available, and the accompanying prospectus may be obtained by contacting Cantor Fitzgerald & Co., Attention: Capital Markets, 499 Park Ave., 6th Floor, New York, New York 10022, or by e-mail at prospectus@cantor.com .\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy any securities of Aerie, and shall not constitute an offer, solicitation or sale of any security in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Aerie Pharmaceuticals, Inc.\nAerie is an ophthalmic pharmaceutical company focused on the discovery, development and commercialization of first-in-class therapies for the treatment of patients with glaucoma or ocular hypertension and other diseases of the eye.\nForward-Looking Statements\nThis press release contains for purposes of the safe harbor provisions of the Private 1995. We may, in some cases, use terms such as “predicts,” “believes,” “potential,” “proposed,” “continue,” “estimates,” “anticipates,” “expects,” “plans,” “intends,” “may,” “could,” “might,” “will,” “should,” “exploring,” “pursuing” or other words that convey uncertainty of future events or outcomes to identify these . Forward-looking statements include statements regarding our expectations related to the offering discussed in this press release, including the completion, timing and size of the offering and the use of proceeds therefrom. By their nature, involve risks and uncertainties because they relate to events and other factors beyond our control. We discuss many of these risks in greater detail under the heading “Risk Factors” in the quarterly and annual reports that we file with the Securities and Exchange Commission (SEC). Any that we make in this press release speak only as of the date of this press release. We assume no our whether as a result of new information, future events or otherwise, after the date of this press release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006482/en/\nAerie Pharmaceuticals\nRichard Rubino, 908-947-3540\nrrubino@aeriepharma.com\nor\nBurns McClellan, Inc., on behalf of Aerie Pharmaceuticals\nInvestors\nAmi Bavishi, 212-213-0006\nabavishi@burnsmc.com\nor\nMedia\nJustin Jackson, 212-213-0006\njjackson@burnsmc.com\nSource: Aerie Pharmaceuticals, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180123006482/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51747772&newsitemid=20180123006482&lan=en-US&anchor=www.sec.gov&index=1&md5=d6f85be4017187312a2b96204f755ec3"], "published": "2018-01-24T00:03:00.000+02:00", "crawled": "2018-01-24T00:55:30.015+02:00", "highlightTitle": ""}