{"organizations": [], "uuid": "b312b2668e232f5e11890843c933ed35dfd8aae9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-stocks/rpt-us-stocks-sp-500-tops-2700-on-tech-advance-dow-nasdaq-hit-records-idUSL1N1OY1UY", "country": "US", "domain_rank": 408, "title": "RPT-US STOCKS-S&P 500 tops 2,700 on tech advance; Dow, Nasdaq hit records", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T01:44:00.000+02:00", "replies_count": 0, "uuid": "b312b2668e232f5e11890843c933ed35dfd8aae9"}, "author": "", "url": "https://www.reuters.com/article/usa-stocks/rpt-us-stocks-sp-500-tops-2700-on-tech-advance-dow-nasdaq-hit-records-idUSL1N1OY1UY", "ord_in_thread": 0, "title": "RPT-US STOCKS-S&P 500 tops 2,700 on tech advance; Dow, Nasdaq hit records", "locations": [], "entities": {"persons": [{"name": "caroline valetkevitch", "sentiment": "none"}, {"name": "bucky hellwig", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "bb&t wealth management", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 11:45 PM / Updated 31 minutes ago RPT-US STOCKS-S&P 500 tops 2,700 on tech advance; Dow, Nasdaq hit records Reuters Staff \n(Repeats story for wider distribution) \n* Fed minutes offer some support \n* Oracle rises after rating upgrades \n* Indexes up: Dow 0.4 pct, S&P 0.6 pct, Nasdaq 0.8 pct \nBy Caroline Valetkevitch \nNEW YORK, Jan 3 (Reuters) - The S&P 500 index rose above 2,700 for the first time on Wednesday and other major indexes hit record closing highs as technology stocks climbed after signs of robust economic growth. \nStocks added slightly to gains late, with some support from minutes from the Federal Reserve’s last policy meeting showing the U.S. central bank would likely stick to gradual interest rate hikes this year. \n“They reiterated gradual rate increases, so that’s steady as she goes, which the stock market seems to like,” said Bucky Hellwig, senior vice president at BB&T Wealth Management in Birmingham, Alabama. \nEarlier in the session, data showed U.S. factory activity increased more than expected in December, a sign of economic momentum at the end of 2017. Meanwhile, manufacturing surveys pointed to a strong start for the European economy. \nFor technology stocks, Alphabet Inc, IBM and chipmakers were among the biggest drivers. The S&P 500 tech index, the best-performing S&P sector in 2017 with a 37 percent jump, ended the day up 1.1 percent. \nU.S. chipmaker stocks surged for a second straight session, with the Philadelphia Semiconductor index up 1.7 percent in its strongest two-day performance since June 2016. \n“The (recent) selloff in tech stocks may have made that group look attractive today given that there’s still significant growth potential there both short term and long term,” Hellwig said. \nThe Dow Jones Industrial Average rose 98.67 points, or 0.4 percent, to 24,922.68, the S&P 500 gained 17.25 points, or 0.64 percent, to 2,713.06 and the Nasdaq Composite added 58.63 points, or 0.84 percent, to 7,065.53. \nThe Cboe Volatility Index, better known as the VIX and a popular options-based gauge of expected near-term price volatility, closed at 9.15, just shy of its record low close of 9.14 on Nov. 3. \nGains in energy and healthcare also boosted the market. The S&P energy index gained 1.5 percent while S&P healthcare rose 1 percent. \nIntel Corp ended down 3.4 percent. The company acknowledged a report that a design flaw in its chips could let hackers steal data but said it was working on a solution that would not significantly slow computers. \nRival chipmaker Advanced Micro Devices climbed 5.2 percent. Nvidia Corp gained 6.6 percent and Micron Technology Inc rose 3 percent. \nOracle Crop shares were up 2.3 percent after Morgan Stanley upgraded its rating on the business software maker. \nAdvancing issues outnumbered declining ones on the NYSE by a 1.47-to-1 ratio; on Nasdaq, a 1.45-to-1 ratio favored advancers. \nAbout 7.1 billion shares changed hands on U.S. exchanges. That compares with the 6.3 billion daily average for the past 20 trading days, according to Thomson Reuters data. Additional reporting by Sruthi Shankar in Bengaluru and Saqib Iqbal Ahmed in New York; Editing by Nick Zieminski and Meredith Mazzilli", "external_links": [], "published": "2018-01-04T01:44:00.000+02:00", "crawled": "2018-01-04T02:29:54.015+02:00", "highlightTitle": ""}