{"organizations": [], "uuid": "978c01f39764e34870304612042455489e23c1b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938558-GettyImages-903214946.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/17/davos-and-the-world-economic-forum--a-rough-guide.html", "country": "US", "domain_rank": 767, "title": "Davos and the World Economic Forum - a rough guide", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T14:06:00.000+02:00", "replies_count": 0, "uuid": "978c01f39764e34870304612042455489e23c1b3"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/17/davos-and-the-world-economic-forum--a-rough-guide.html", "ord_in_thread": 0, "title": "Davos and the World Economic Forum - a rough guide", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "klaus schwab", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "negative"}, {"name": "wef", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The World Economic Forum (WEF) 2018 is kicking into action in Davos, Switzerland and CNBC has the lowdown on what you need to know about the event, its participants, the food, security and coverage.\nJust what is Davos? The World Economic Forum's annual meeting is a four-day event that is expected to attract over 2,500 participants, including many leaders from the world of politics, business and civil society. The event is taking place between January 23 and 26.\nThe name \"Davos\" refers both to the Alpine ski resort where WEF takes place every January, but it has also become interchangeable with the Forum's proper title.\nWEF is a Swiss non-profit, politically neutral organization that was founded by Klaus Schwab in 1971. Although it's headquartered in Geneva, the Forum has become synonymous with the snow-covered town Davos.\nWhat is WEF's mission? In simple terms, the Forum is \"committed to improve the state of the world.\"\nIt aims to do this by bringing together what it calls public and private \"stakeholders\" — in the main, heads of state, business, academia and society — and providing them with a space to discuss shared interests and problems.\n\"We believe that progress happens by bringing together people from all walks of life who have the drive and the influence to make positive change,\" WEF states.\nIt hopes that dialogue will lead to shared action to tackle the world's most pressing issues, such as climate change and inequality.\nIn 2018, the Forum's theme is \"Creating a shared future in a fractured world,\" saying that it \"aims to rededicate leaders from all walks of life to developing a shared narrative to improve the state of the world.\"\nWho pays for Davos? The Forum notes that a large majority of its funding is provided by \"business entities\" who join the Forum as members and partners in order to participate in our activities.\nMembership and partnership fees range from 60,000 Swiss francs ($62,243) to 600,000 Swiss francs (around $622,000) \"depending on the level of engagement.\"\nThe Forum notes that most types of membership include the opportunity to participate in the Annual Meeting for the chief executive of the company, \"although Davos participation incurs a fee over and above membership or partnership fees.\"\nThe Forum also works with government agencies on some projects and initiatives and says that these agencies fund those activities through the Forum.\nNon-business participants in the meeting — from heads of state to leaders of the arts — do not pay to participate.\nIn wider terms, in the financial year from July 2016 to June 2017, the WEF foundation reported a turnover of 280 million Swiss francs and a surplus of 1.2 million Swiss francs .\nThe latest figures available showed that, in 2015, the Forum's Annual Meeting generated an estimated turnover of around 79 million Swiss francs throughout Switzerland, with 50 million Swiss francs benefiting the commune of Davos.\nWhat is the point of Davos? Every year the Forum adopts a theme that is a talking point — or a starting point — for discussion. In 2017, the theme was \"Responsive and responsible leadership,\" the year before that it was \"Mastering the fourth industrial revolution.\"\nIn 2018, the theme for the meeting is \" Creating a shared future in a fractured world \" with WEF identifying a number of fractures in global politics, economics and society that it says need attention:\n\"Politically, new and divisive narratives are transforming governance. Economically, policies are being formulated to preserve the benefits of global integration while limiting shared obligations such as sustainable development, inclusive growth and managing the Fourth Industrial Revolution. Socially, citizens yearn for responsive leadership; yet, a collective purpose remains elusive despite ever-expanding social networks. All the while, the social contract between states and their citizens continues to erode.\"\nAs such, the meeting this year aims to find ways \"to reaffirm international cooperation on crucial shared interests, such as international security, the environment and the global economy,\" WEF said.\nDavos in stats Now in its 48 th year, the forum has come far from its humble beginnings, attracting global political and business leaders, economists, policymakers and celebrities.\n2018 is no exception. This year, WEF executives expect over 2,500 participants from more than 110 countries.\nOnly 21 percent of the participants are women yet the event is being entirely co-chaired by seven women this year , including International Monetary Fund Director Christine Lagarde, IBM Chief Executive Ginni Rometty and Norwegian Prime Minister Erna Solberg. The all-female panel is seen as a response to criticism that the event lacks more representation from women.\nOverall, the Annual Meeting will feature over 340 top political leaders with 10 heads of state and government from Africa, nine from the Middle East and North Africa and six from Latin America.\nWEF said that 1,900 business leaders from all industries will be attending, there will be 230 media representatives and almost 40 cultural leaders.\nIn addition, WEF notes there will be social entrepreneurs, technology pioneers and leaders of civil society, unions and faith-based institutions.\nDavos will be covered by some 500 journalists reporting for domestic and foreign news outlets.\nWho's who in Davos in 2018 Headline guests this year include President Donald Trump , Indian Prime Minister Narendra Modi and French President Emmanuel Macron.\nIn addition, U.K. Prime Minister Theresa May, Italian Premier Paolo Gentiloni, Argentinian President Mauricio Macri and new Zimbabwean President Emmerson Mnangagwa are among the 340 top political leaders attending.\nOther well-known participants include actors Cate Blanchett, Shah Rukh Khan and musician Will.i.am and singer Elton John.\nCheck out the world leaders and celebrities that are going to Davos this year Larry Busacca | Getty Images Entertainment | Getty Images In previous years, attendants have included Angelina Jolie and Brad Pitt, Bono from U2, Matt Damon, Leonardo DiCaprio, Yo-Yo Ma, Forest Whitaker, Goldie Hawn and Yao Chen.\nSchmoozing and exclusive parties are a part of the Davos experience for its high-profile participants although getting an invite can prove tricky .\nWhat happens in Davos? The Forum holds multiple sessions, panels, speeches and seminars over the course of the meeting where participants can listen to debates by key policymakers and audiences on a variety of subjects.\nArtificial intelligence, the digital economy, poverty, conflict and the gender pay gap are common themes of sessions held in the main congress center but there are many more unusual, fascinating alternative talks. The \"IdeasLab\", for instance, is hosting a range of topics on neuroscience, the \"Science Hub\" will focus on innovations in the scientific world whereas the \"Mixed Reality Space\" hosts the latest virtual reality tech.\nThe Forum states that the key pillars of the program of events are to allow participants to experience, discover, debate and collaborate.\nMany of the sessions will be webcast on the Forum's website, here's a program of WEF events taking place.\nSecurity at Davos With so many world leaders in one place, security is tight at the World Economic Forum with vehicle checks and armed police and soldiers a common sight .\nSecurity is also extremely tight to enter the congress center ", "external_links": ["https://widgets.weforum.org/participants-graphic-am18/", "http://www.wef.gr.ch/DE/faq/FAQ_Dokumente/01_2018_FAQ_Jahrestreffen_WEF_2018_EN.pdf", "https://weforum.box.com/s/jsw4wp3v2suwsov81uhvpvgwo6faa6tn", "https://weforum.ent.box.com/s/voiufylctj8qxrx0w7onx04tyt9sv1yn"], "published": "2018-01-17T14:06:00.000+02:00", "crawled": "2018-01-19T10:19:04.000+02:00", "highlightTitle": ""}