{"organizations": [], "uuid": "fdfbb40be8f4dba44a777197dbc96f689aa381d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/australia-stocks-midday/australia-shares-lose-steam-as-real-estate-weighs-nz-drops-idUSL4N1P514K", "country": "US", "domain_rank": 408, "title": "Australia shares lose steam as real estate weighs; NZ drops", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T03:27:00.000+02:00", "replies_count": 0, "uuid": "fdfbb40be8f4dba44a777197dbc96f689aa381d2"}, "author": "", "url": "https://www.reuters.com/article/australia-stocks-midday/australia-shares-lose-steam-as-real-estate-weighs-nz-drops-idUSL4N1P514K", "ord_in_thread": 0, "title": "Australia shares lose steam as real estate weighs; NZ drops", "locations": [], "entities": {"persons": [{"name": "chris thomas", "sentiment": "negative"}, {"name": "ric spooner", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "nz", "sentiment": "none"}], "organizations": [{"name": "goodman group pty ltd", "sentiment": "none"}, {"name": "gpt group", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "cmc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}, {"name": "s&p/asx", "sentiment": "none"}, {"name": "goodman group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 28 AM / Updated an hour ago Australia shares lose steam as real estate weighs; NZ drops Chris Thomas 3 Min Read \nJan 10 (Reuters) - Australian shares gave up early gains to post their biggest intraday drop in over a week on Wednesday, dragged by losses in real estate and materials stocks. \nThe S&P/ASX 200 index declined 22.8 points, or 0.4 percent, to 6,113 by 0117 GMT, after rising as much as 0.2 percent to breach the 6,150 level - its highest in 10 years earlier in the session. The benchmark closed up 0.1 percent on Tuesday, its fifth straight day of gains. \nProperty stocks weighed the most on the index, with Goodman Group Pty Ltd and GPT Group slipping as much as 2.5 percent and 2.8 percent, respectively. \nGoodman Group fell to its lowest since October 2017. \n“Real estate tends to have a negative correlation to higher bond yields, on concerns of the possibility of higher interest rates,” said Ric Spooner, Chief market strategist at CMC Markets. \nBenchmark U.S. Treasury yields hit a 10-month high on Tuesday after the Bank of Japan tweaked its bond-buying program. \n“Real estate stocks have also been a yield play in Australia, with people looking to buy into real estate investment trusts as a way of earning yields.” \n“As U.S. bond yields start to rise, there would be some valuation pressure on the REITs,” said Spooner. \nMiners also slipped into the red though heavyweights such as Rio Tinto continued to enjoy gains at near six-and-a-half year highs. \nSouth32 Ltd shed 1.6 percent, while BlueScope Steel Ltd slumped 3.2 percent in its biggest fall in eight weeks. \n“Materials and energy stocks have been on a tear recently, and I think they’re taking a pause for breath,” said Chris Weston, chief market strategist at IG Markets. \nGold miner Newcrest Mining Ltd fell 2.8 percent to a two-week low after prices edged lower, weighed down by a stronger U.S. dollar on the back of concerns about political uncertainty in Europe. \nNew Zealand’s benchmark S&P/NZX 50 index fell as much as 0.6 percent, its biggest drop in nearly nine weeks, as healthcare stocks sold off. \nFisher & Paykel Healthcare Corporation Ltd lost 2.8 percent to wallow at four-week lows, while Ryman Healthcare Ltd marked its biggest percentage drop in five weeks. \nDairy company a2 Milk Company Ltd also pinned the index down, falling as much as 1.9 percent to a one-week low. (Reporting by Chris Thomas in Bengaluru; Editing by Sam Holmes)", "external_links": [], "published": "2018-01-10T03:27:00.000+02:00", "crawled": "2018-01-10T03:55:53.002+02:00", "highlightTitle": ""}