{"organizations": [], "uuid": "50288d82f407a9317df32ff577297f2462a7db46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221771362&w=1200&r=LYNXMPEE0C0LF", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-tot-eve-kane/kane-to-break-all-english-goal-records-says-pochettino-idUKKBN1F20WP", "country": "US", "domain_rank": 408, "title": "Kane to break all English goal records, says Pochettino", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T23:19:00.000+02:00", "replies_count": 0, "uuid": "50288d82f407a9317df32ff577297f2462a7db46"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-tot-eve-kane/kane-to-break-all-english-goal-records-says-pochettino-idUKKBN1F20WP", "ord_in_thread": 0, "title": "Kane to break all English goal records, says Pochettino", "locations": [], "entities": {"persons": [{"name": "poch", "sentiment": "negative"}, {"name": "pochettino", "sentiment": "negative"}, {"name": "kane", "sentiment": "negative"}, {"name": "mauricio pochettino", "sentiment": "none"}, {"name": "reuters/eddie keogh", "sentiment": "none"}, {"name": "jimmy greaves", "sentiment": "none"}, {"name": "teddy sheringham", "sentiment": "none"}, {"name": "harry kane", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "wembley stadium", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "wembley", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "tottenham hotspur", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "everton", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "bt sport", "sentiment": "none"}, {"name": "tottenham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 9:22 PM / Updated 8 minutes ago Kane to break all English goal records, says Pochettino Reuters Staff 3 Min Read \nLONDON (Reuters) - Harry Kane is on course to break all the goalscoring records in top-flight English football after setting his latest landmark on Saturday, the striker’s Tottenham Hotspur manager, Mauricio Pochettino, believes. Soccer Football - Premier League - Tottenham Hotspur vs Everton - Wembley Stadium, London, Britain - January 13, 2018 Tottenham's Harry Kane celebrates scoring their third goal REUTERS/Eddie Keogh \nThe Argentine was left purring again after watching Kane break the club’s Premier League record, set by Teddy Sheringham, with a double that took his career tally to 98 goals in the 4-0 thrashing of Everton at Wembley. \n“He’s such a talented player, so professional and I‘m very happy. He deserves all the credit and the praise. This way, he’s going to break all the records in the Premier League and in England,” Pochettino told BT Sport. \n“The good thing is Jimmy Greaves’ (all-time club record) is far away, so not every week he is going to break something.” \nKane, who ended 2017 as Europe’s leading marksman of the year in the top five leagues, has started 2018 in the same vein but, even while homing in on 100 league goals for Spurs, he remains far adrift of the 220 notched by the great Greaves. \nYet Pochettino believes the England man, who is still only 24, may have 10 to 12 years ahead of him, should he steer clear of major injuries, to attack all the landmarks. \nThe modest Kane, for his part, just shrugs as he ticks off another milestone. Soccer Football - Premier League - Tottenham Hotspur vs Everton - Wembley Stadium, London, Britain - January 13, 2018 Tottenham's Harry Kane scores their second goal REUTERS/Eddie Keogh \n“It’s something I‘m very proud of but it’s on to the next one, we’ve got to keep going,” he said. “These boys are great, they set me up and we’ve got to keep going and winning games. Hopefully I’ll keep scoring.” \nKane has now scored 20 league goals this season, three more than the next most prolific, Liverpool’s Mohamed Salah. In total, he has 28 in 28 appearances in all competitions. \nLuck is on his side too, with his first goal from Son Heung-min’s delivery soon after halftime that put Spurs 2-0 ahead looking fractionally offside. \n“Sometimes you get it, sometimes you don‘t. Luckily it went my way,” Kane said. \nNothing, though, went the way of Everton manager Sam Allardyce, who ended up lambasting his side afterwards. \n“I‘m hugely disappointed in the professionalism of my players today,” he said, admitting that the result could have been even worse than the 4-0 drubbing, which also featured goals from Son and Christian Eriksen, suggested. \n“It’s hugely out of order that you relinquish that defensive responsibility when you’ve just gone 2-0 down.” Reporting by Ian Chadband; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-13T23:19:00.000+02:00", "crawled": "2018-01-13T23:34:33.007+02:00", "highlightTitle": ""}