{"organizations": [], "uuid": "aa4f4695717edaa99508d88133d5b57b1c9cab5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/britain-stocks/britains-ftse-led-lower-by-ab-foods-utilities-idUSL8N1PD27G", "country": "US", "domain_rank": 408, "title": "Britain's FTSE led lower by AB Foods, utilities", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T17:59:00.000+02:00", "replies_count": 0, "uuid": "aa4f4695717edaa99508d88133d5b57b1c9cab5b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/britain-stocks/britains-ftse-led-lower-by-ab-foods-utilities-idUSL8N1PD27G", "ord_in_thread": 0, "title": "Britain's FTSE led lower by AB Foods, utilities", "locations": [], "entities": {"persons": [{"name": "severn trent", "sentiment": "none"}, {"name": "danilo masoni", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}], "organizations": [{"name": "ab foods", "sentiment": "negative"}, {"name": "national grid", "sentiment": "none"}, {"name": "sse", "sentiment": "none"}, {"name": "associated british foods", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "centrica", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* FTSE 100 down 0.3 pct; mid caps down 0.1 pct\n* Utilities among biggest fallers\n* AB Foods down on caution over its sugar business\n* Break-up talk lifts Whitbread\nBy Danilo Masoni\nMILAN, Jan 18 (Reuters) - Britain’s top share index fell on Thursday led lower by utilities and a decline in Associated British Foods after the food processor and retailer cautioned over its sugar business.\nThe FTSE was down 0.3 percent by 0938 GMT, while the mid cap index also fell by 0.1 percent.\nUtilities were weaker after a junior minister told a parliamentary committee that Britain hoped to pass laws to allow the capping of the most common form of gas and electricity tariffs for millions of households by the summer.\nAlthough the story regarding price caps are not new, some traders said that was weighing on the sector.\nSSE was the top loser on the FTSE, down 3.1 percent, as the stock traded ex dividend, while elsewhere in the sector, National Grid fell 1.1 percent, Severn Trent added 0.7 percent and Centrica slipped 0.5 percent.\n“The sector is struggling a bit mainly because there seems to be loads of competition partially because of search engines who supposedly help people to find the best deal,” said Markus Huber, trader at City of London Markets.\nAlso with wholesale energy prices on the way up at the moment, there might be concerns that they won’t be able to pass these fully on to customers in the future especially with the price cap legislation hanging over them,” he added.\nPrimark owner AB Foods dropped 4 percent.\nThe company maintained full-year earnings guidance on Thursday, but cautioned revenue and profit at its sugar business would fall by more than previously expected due to lower European Union sugar prices.\nAnother gainer was Hargreaves, up 3.7 percent, after a price target upgrade from Barclays.\nWhitbread also rose, by 2.3 percent, as prospects of a break-up of the company more than offset disappointment over a drop in sales for its Costa Coffee business in a tough British retail market.\nReuters reported late on Wednesday that investor Sachem Head was pushing the FTSE 100 company to consider splitting the Costa Coffee chain from its hotels and restaurant businesses, according to two people familiar with the matter.\nAmong mid caps, Balfour Beatty rose after the infrastructure group released financial details on the positive impact expected from tax cuts in the United States. (Reporting by Danilo Masoni; Editing by Toby Chopra)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T17:59:00.000+02:00", "crawled": "2018-01-19T12:29:27.008+02:00", "highlightTitle": ""}