{"organizations": [], "uuid": "de7e45724a4949d3a54f677ec23aa85c21afc1dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-marquette-national-corporation-declares-quarterly-dividend-25-percent.html", "country": "US", "domain_rank": 767, "title": "Marquette National Corporation Declares Quarterly Dividend 25%", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T15:00:00.000+02:00", "replies_count": 0, "uuid": "de7e45724a4949d3a54f677ec23aa85c21afc1dd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-marquette-national-corporation-declares-quarterly-dividend-25-percent.html", "ord_in_thread": 0, "title": "Marquette National Corporation Declares Quarterly Dividend 25%", "locations": [], "entities": {"persons": [], "locations": [{"name": "new lenox", "sentiment": "none"}, {"name": "bridgeview", "sentiment": "none"}, {"name": "lemont", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "oak lawn", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "romeoville", "sentiment": "none"}, {"name": "bolingbrook", "sentiment": "none"}, {"name": "hickory hills", "sentiment": "none"}, {"name": "evergreen park", "sentiment": "none"}, {"name": "orland park", "sentiment": "none"}], "organizations": [{"name": "marquette national corporation", "sentiment": "negative"}, {"name": "chicagoland", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "marquette", "sentiment": "none"}, {"name": "marquette bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 24, 2018 /PRNewswire/ -- Marquette National Corporation (OTCQX: MNAT) today announced that its Board of Directors declared a cash dividend of $0.13 per share, an increase of 25% from the previous quarter dividend rate. The dividend will be payable on April 2, 2018 to shareholders of record on March 23, 2018. As of December 31, 2017, Marquette had 4,479,751 shares issued and outstanding.\nMarquette National Corporation is a diversified bank holding company with total assets of approximately $1.6 billion. The Company's banking subsidiary, Marquette Bank, is a full-service, community bank that serves the financial needs of communities in Chicagoland, offering an extensive line of financial solutions, including retail banking, real estate lending, trust, investments, wealth management and business banking to consumers and commercial customers. Marquette Bank has 21 branches located in Chicago, Bolingbrook, Bridgeview, Evergreen Park, Hickory Hills, Lemont, New Lenox, Oak Forest, Oak Lawn, Orland Park, Romeoville and Summit, Illinois. For more information visit: http://www.emarquettebank.com .\nSpecial Note Concerning Forward-Looking Statements\nThis document contains, and future oral and written statements of the Company and its management may contain, forward-looking statements with respect to the financial condition, results of operations, plans, objectives, future performance and business of the Company. Forward-looking statements, which may be based upon beliefs, expectations and assumptions of the Company's management and on information currently available to management, are generally identifiable by the use of words such as \"believe,\" \"expect,\" \"anticipate,\" \"plan,\" \"intend,\" \"estimate,\" \"may,\" \"will,\" \"would,\" \"could,\" \"should\" or other similar expressions. A number of factors, many of which are beyond the ability of the Company to control or predict, could cause actual results to differ materially from those in its forward-looking statements. These factors include, among others, the following: (i) the strength of the local and national economy; (ii) the economic impact of any future terrorist threats and attacks, and the response of the United States to any such threats and attacks; (iii) changes in state and federal laws, regulations and governmental policies concerning the Company's general business, including Basel III, the Dodd-Frank Wall Street Reform and Consumer Protection Act and the regulations issued thereunder; (iv) changes in interest rates and prepayment rates of the Company's assets; (v) increased competition in the financial services sector and the inability to attract new customers; (vi) changes in technology and the ability to develop and maintain secure and reliable electronic systems; (vii) the loss of key executives or employees; (viii) changes in consumer spending; (ix) unexpected outcomes of existing or new litigation involving the Company; and (x) changes in accounting policies and practices. These risks and uncertainties should be considered in evaluating forward-looking statements and undue reliance should not be placed on such statements. Additionally, all statements in this document, including forward-looking statements, speak only as of the date they are made, and the Company undertakes no obligation to update any statement in light of new information or future events.\nFor more information:\nPaul Eckroth\nEVP & CFO\n708-364-9011\npeckroth@emarquettebank.com\nView original content: http://www.prnewswire.com/news-releases/marquette-national-corporation-declares-quarterly-dividend-25-300587203.html\nSOURCE Marquette National Corporation", "external_links": ["http://www.prnewswire.com/news-releases/marquette-national-corporation-declares-quarterly-dividend-25-300587203.html", "http://www.emarquettebank.com/"], "published": "2018-01-24T15:00:00.000+02:00", "crawled": "2018-01-24T14:59:11.000+02:00", "highlightTitle": ""}