{"organizations": [], "uuid": "0730464f53c668598a660bf91e6eb64b2711b9ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222533081&w=1200&r=LYNXMPEE0F1KW", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-cargill-salt/cargill-shakes-up-its-product-mix-with-new-salt-alternative-idUSKBN1F52Q1", "country": "US", "domain_rank": 408, "title": "Cargill shakes up its product mix with new salt alternative", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.826, "site_type": "news", "published": "2018-01-17T05:21:00.000+02:00", "replies_count": 0, "uuid": "0730464f53c668598a660bf91e6eb64b2711b9ba"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-cargill-salt/cargill-shakes-up-its-product-mix-with-new-salt-alternative-idUSKBN1F52Q1", "ord_in_thread": 0, "title": "Cargill shakes up its product mix with new salt alternative", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "watkins glen", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cargill", "sentiment": "negative"}, {"name": "cargill inc", "sentiment": "negative"}, {"name": "archer daniels midland co", "sentiment": "none"}, {"name": "bunge ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Commodity trader Cargill Inc [CARG.UL] is starting to produce a salt-alternative for food manufacturers wanting to cut back the sodium levels in their soups, breads and other processed goods.\nThe company’s existing salt plant in Watkins Glen, New York has for several weeks produced and shipped out a new line of food-grade potassium chloride, the latest move by Cargill to boost its food and ingredients portfolio and buffer its bottom line from the wild swings of the global commodity markets.\nLast fall, the Minnesota-based company said it was selling new “native starches” produced from plants such as corn and wheat, as an alternative to more processed starch derivatives used to bulk up food products such as pasta sauce.\nGrains and oilseeds rivals Archer Daniels Midland Co and Bunge Ltd have also made aggressive moves into the ingredient space, as four years of bumper global crops have squeezed profit margins across the sector.\nFinding a salt replacement that tastes like the real thing has long been a pain-point for food manufacturers amid mounting pressure by public health groups to stem a rising tide of chronic health problems including diabetes and obesity. Potassium chloride can give a salty flavor to foods, and reduce the amount of sodium chloride - or salt - in a recipe, according to industry officials.\nCargill officials declined to say how much it is spending on the venture. It previously sold potassium chloride products made by other firms.\n“We’ve heard from our customers they want reduced sodium options, and this allows us to meet their needs by making potassium chloride more available,” Janice Johnson, a Cargill technical service leader, told Reuters on Tuesday.\nThe new product line could also come as a boost to Cargill’s existing salt division.\nEarlier this month, the company reported a 6 percent drop in quarterly profits for the period ended Nov. 30 - with its unit that buys, trades and processes grains and oilseeds being the only division that saw a quarterly earnings decline over the same period a year earlier. The drop was offset by sharp growth in its higher-margin businesses, such as food ingredients, the company said.\nBut quarterly salt sales were down, the company said, “due in part to lower sales volume for de-icing products after two mild North American winters.”\nReporting by P.J. Huffstutter in Chicago; Editing by Lisa Shumaker\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T05:21:00.000+02:00", "crawled": "2018-01-17T11:46:53.004+02:00", "highlightTitle": ""}