{"organizations": [], "uuid": "bb9a0527cf146935a6ab9eaad1eec85f7bb5c98f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221981194&w=1200&r=LYNXMPEE0D0M9", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-figs-canada-team/olympic-virtue-and-moir-lead-strong-canada-figure-skating-team-idUSKBN1F30XL", "country": "US", "domain_rank": 408, "title": "Olympic: Virtue and Moir lead strong Canada figure skating team", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T23:20:00.000+02:00", "replies_count": 0, "uuid": "bb9a0527cf146935a6ab9eaad1eec85f7bb5c98f"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-figs-canada-team/olympic-virtue-and-moir-lead-strong-canada-figure-skating-team-idUSKBN1F30XL", "ord_in_thread": 0, "title": "Olympic: Virtue and Moir lead strong Canada figure skating team", "locations": [], "entities": {"persons": [{"name": "moir", "sentiment": "positive"}, {"name": "gabrielle daleman", "sentiment": "none"}, {"name": "tessa virtue", "sentiment": "none"}, {"name": "meagan duhamel", "sentiment": "none"}, {"name": "isabelle charest", "sentiment": "none"}, {"name": "scott moir", "sentiment": "none"}, {"name": "patrick chan", "sentiment": "none"}, {"name": "kaetlyn osmond", "sentiment": "none"}, {"name": "eric radford", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "team canada chef de mission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 9:24 PM / Updated 6 minutes ago Olympic: Virtue and Moir lead strong Canada figure skating team Reuters Staff 3 Min Read \n(Reuters) - A powerful and experienced figure skating team headlined by 2010 Olympic ice dance champions Tessa Virtue and Scott Moir and 2014 Olympic silver medalist Patrick Chan will represent Canada at next month’s Winter Olympics, Skate Canada said on Sunday. \nThe 17 athletes, including women’s world medalists Gabrielle Daleman and Kaetlyn Osmond and twice world pairs champions Meagan Duhamel and Eric Radford, will be the largest figure skating team at the Feb. 9-25 Pyeongchang Games. \nOnly six newcomers were named in the team of three women, two men, three pairs teams and three ice dance couples, giving Canada multiple medal opportunities. \n“I’m impressed by the depth of this team. There are so many strong contenders and we have tremendous hope for them heading into the Games,” said Isabelle Charest, Team Canada Chef de Mission for the Pyeongchang Games. \nVirtue and Moir, who won silver at the 2014 Sochi Olympics after taking gold at the 2010 Vancouver Games, turned in a perfect free dance score in winning the weekend’s national championships in Vancouver. \nThree-times Olympians, they are the reigning world champions. \n“It is especially a privilege to be named to the team with this group of skaters. We have grown up together and its going to be a special moment to take the ice with them and go for gold,” Moir said. \nThey will be joined in the ice dance competition by 2014 Olympians Kaitlyn Weaver and Andrew Poje and the team of Piper Gilles and Paul Poirier. \nChan, a three-times world champion, won a record 10th national title over the weekend. \nRunner-up Keegan Messing, who holds dual U.S. and Canadian citizenship, will also be going to Pyeongchang. \nDaleman and Osmond give multiple Canada medal contenders in the women’s skate. \nDaleman, the 2017 world bronze medallist, overcame pneumonia to win national honors on her 20th birthday. \n“This means the absolute world to me going into the Olympics,” she told reporters. \nOsmond took silver at the nationals just as she did at the 2017 world championships. Jan 13, 2018; Vancouver, British Columbia, CAN; Patrick Chan skates in the Mens free program at Doug Mitchell Thunderbird Sports Centre. Mandatory Credit: Anne-Marie Sorvin-USA TODAY Sports \nDuhamel and Radford will be joined by Julianne Seguin and Charlie Bilodeau and Kirsten Moore-Towers and Michael Marinaro in pairs. \nCanadian team:", "external_links": [], "published": "2018-01-14T23:20:00.000+02:00", "crawled": "2018-01-14T23:38:14.014+02:00", "highlightTitle": ""}