{"organizations": [], "uuid": "296a12ae916b2a1c94aefbc077dae657d2b10c09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/27/104863972-GettyImages-869865532-bitcoin.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/cryptocurrency-and-taxes-what-you-need-to-know.html", "country": "US", "domain_rank": 767, "title": "Cryptocurrency and taxes: What you need to know", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.168, "site_type": "news", "published": "2018-01-30T16:15:00.000+02:00", "replies_count": 0, "uuid": "296a12ae916b2a1c94aefbc077dae657d2b10c09"}, "author": "Vincenzo Villamena", "url": "https://www.cnbc.com/2018/01/30/cryptocurrency-and-taxes-what-you-need-to-know.html", "ord_in_thread": 0, "title": "Cryptocurrency and taxes: What you need to know", "locations": [], "entities": {"persons": [{"name": "jaap arriens", "sentiment": "none"}, {"name": "vincenzo villamena", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "irs", "sentiment": "none"}, {"name": "getty images  bitcoin", "sentiment": "none"}, {"name": "internal revenue service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bitcoin had its coming-out party in 2017. With all the excitement and opportunities around cryptcurrency, it might be easy to forget about crypto taxation. Almost every bitcoin or other \"altcoin\" transaction — mining, spending, trading, exchanging, air drops, etc. — will likely be a taxable event for U.S. tax purposes.\nWithout a doubt, 2018 will be a landmark year for Internal Revenue Service enforcement of cryptocurrency gains. Taxpayers should stay ahead of the game rather than be reactionary. The IRS is always more lenient with taxpayers who come forward on their own accord rather than those that get discovered. Coming forward now actually could be the difference between criminal penalties and simply paying interest.\nWith only several hundred people reporting their crypto gains each year since bitcoin's launch, the IRS suspects that many crypto users have been evading taxes by not reporting crypto transactions on their tax returns.\nMore from Investor Toolkit:\nThis advisor is riding the bitcoin roller coaster\nIt's time for financial services firms to regain consumer trust\nDon't put all your financial eggs in one investment basket\nUnfortunately, the IRS has provided very little guidance with regard to bitcoin taxation. One thing, however, is clear: Although both the public and the crypto community refer to bitcoin and altcoins as virtual currencies, the IRS treats them as property for tax purposes. Therefore, selling, spending and even exchanging crypto for other tokens all likely have capital gain implications. Likewise, receiving it as compensation or by other means will be ordinary income.\nWhile bitcoin receives most of the attention these days, it is only one of hundreds of cryptocurrencies. Everything discussed with regard to bitcoin taxation applies to all cryptocurrencies.\nLet's look at specific crypto transactions and their tax implications:\nTrading cryptocurrencies p roduces capital gains or losses, with the latter being able to offset gains and reduce tax. Exchanging one token for another — for example, using Ethereum to purchase an altcoin — creates a taxable event. The token is treated as being sold, thus generating capital gains or losses. Receiving payments in crypto in exchange for products or services or as salary is treated as ordinary income at the fair market value of the coin at the time of receipt. Spending crypto is a tax event and may generate capital gains or losses, which can be short-term or long-term. For example, say you bought one coin for $100. If that coin was then worth $200 and you bought a $200 gift card, there is a $100 taxable gain. Depending on the holding period, it could be a short- or long-term capital gain subject to different rates. Converting a cryptocurrency to U.S. dollars or another currency at a gain is a taxable event, as it is treated as being sold, thus generating capital gains. Air drops are considered ordinary income on the day of the air drop. That value will become the basis of the coin. When it's sold, exchanged, etc., there will be a capital gain. Mining coins is considered ordinary income equal to the fair market value of the coin the day it was successfully mined. Initial coin offerings do not fall under the IRS's tax-free treatment for raising capital. Thus, they produce ordinary income to individuals and businesses alike. Although specific identification of the particular coin being sold or exchanged would allow taxpayers to manage their short- and long-term capital gains, exchanges and wallets are currently not set up to choose which coins to sell or exchange. Therefore, the IRS will likely default to First-In-First-Out treatment, although no guidance has been provided, so taxpayers are allowed to pick their methodology as long as it is consistent throughout the return.\nThat being said, the best way to minimize is to buy and hold for more than a year. Short-term capital gains are taxed at your normal ordinary income tax rate while long-term gains are taxed at a reduced rate (15 percent to 23.8 percent, depending on your bracket). Of course, given the volatility, it still might be in your best interest to lock in the profit now and take the tax hit, but that is up to you to decide.\nDigital exchanges are not broker-regulated by the IRS, which makes matters more complicated for preparing tax documents if you traded cryptocurrency. Exchanges do not issue a 1099 form, nor do they calculate gains or cost basis for the trader. Many don't even allow transacting in dollars, instead opting for Ethereum. This means that self-reporting is necessary.\nYour Wealth: Weekly advice on managing your money Sign up to get Your Wealth\nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Submit Please enter a valid email address Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Exchanges are starting to take note of tax reporting, however. Coinbase, for example, now provides a Form 1099-K, but only to certain business users and GDAX users who have received at least $20,000 cash for sales of cryptocurrency related to at least 200 transactions in a calendar year.\nOther users need to use their account transaction history. The reporting of gains/losses and cost basis is still in beta and not guaranteed to be accurate. Therefore, we strongly recommend keeping detailed records of all crypto transactions at all exchanges in order to have all the crypto information needed for your U.S. tax return. Those records include dates of earning, buying or exchanging coins, market value at that date to calculate cost basis and the date and sales proceeds when a coin is sold, exchanged or spent.\nFortunately, there are some services available that can take your trading history and provide you with a fairly clean output for Schedule D on your tax return. Many investors have used bitcoin.tax and cointracking.info, for example.\n— By Vincenzo Villamena, founder and CEO of Online Taxman", "external_links": [], "published": "2018-01-30T16:15:00.000+02:00", "crawled": "2018-01-30T16:14:56.025+02:00", "highlightTitle": ""}