{"organizations": [], "uuid": "f60fe8c9b142e26d347d2dd4b070a2bf7c64001d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-littelfuse-and-ixys-announce-election-deadline-for-ixys-stockholders-to-elect-merger-consideration-and-expected-closing.html", "country": "US", "domain_rank": 767, "title": "Littelfuse and IXYS Announce Election Deadline for IXYS Stockholders to Elect Merger Consideration and Expected Closing Date", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:30:00.000+02:00", "replies_count": 0, "uuid": "f60fe8c9b142e26d347d2dd4b070a2bf7c64001d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-littelfuse-and-ixys-announce-election-deadline-for-ixys-stockholders-to-elect-merger-consideration-and-expected-closing.html", "ord_in_thread": 0, "title": "Littelfuse and IXYS Announce Election Deadline for IXYS Stockholders to Elect Merger Consideration and Expected Closing Date", "locations": [], "entities": {"persons": [], "locations": [{"name": "milpitas", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "littelfuse, inc.", "sentiment": "neutral"}, {"name": "littelfuse", "sentiment": "neutral"}, {"name": "ixys announce election deadline", "sentiment": "neutral"}, {"name": "ixys", "sentiment": "neutral"}, {"name": "computershare trust company", "sentiment": "none"}, {"name": "xys corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO and MILPITAS, Calif., Jan. 04, 2018 (GLOBE NEWSWIRE) -- Littelfuse, Inc. (NASDAQ:LFUS) and IXYS Corporation (NASDAQ:IXYS) today announced the election deadline by which IXYS stockholders of record may elect to receive cash, shares of Littelfuse common stock or both as merger consideration in connection with the Littelfuse acquisition of IXYS. The election deadline is 5:00 p.m. Eastern Time on January 12, 2018.\nThe parties expect to close the transaction on January 17, 2018. However, the closing remains subject to the conditions of the Agreement and Plan of Merger that Littelfuse and IXYS entered into on August 25, 2017, as amended, including the adoption of the merger agreement by IXYS stockholders.\nIXYS stockholders of record wishing to make an election must deliver to Computershare Trust Company, N.A. a properly completed election form and letter of transmittal and any other applicable election materials by the election deadline of 5:00 p.m. Eastern Time on January 12, 2018. IXYS stockholders that hold their shares through a bank, broker or other nominee may be subject to an earlier deadline for making their elections, based on the instructions of their banks, brokers or other nominees.\nEach IXYS stockholder will be entitled to receive, for each share of IXYS common stock held immediately prior to the closing of the transaction, (i) $23.00 in cash, less any applicable withholding tax and without interest (the cash consideration), or (ii) 0.1265 of a share of Littelfuse common stock (the stock consideration). The merger consideration is subject to proration so that 50% of the shares of IXYS common stock outstanding immediately prior to the closing of the transaction will be converted into the cash consideration and the remaining shares of IXYS common stock will be converted into the stock consideration.\nEach IXYS stockholder will receive cash in lieu of any fractional shares of Littelfuse common stock that the stockholder otherwise would be entitled to receive. Each IXYS stockholder that does not submit properly completed election materials to Computershare by the election deadline will be treated as having elected to receive the cash consideration or the stock consideration in accordance with the proration methodology in the merger agreement.\nAll of the documents necessary to make an election were previously mailed to IXYS stockholders of record as of December 11, 2017. IXYS stockholders of record with questions regarding the election process should contact D.F. King & Co., Inc., the information agent for the election, at (800) 334-0384 as soon as possible. IXYS stockholders holding shares of IXYS common stock in “street name” should contact their bank, broker or other nominee with questions regarding the election process.\nA more detailed description of the merger consideration and the allocation and proration procedures applicable to elections is contained in the parties’ proxy statement/prospectus dated December 13, 2017. IXYS stockholders are urged to read the proxy statement/prospectus carefully and in its entirety. Copies of the proxy statement/prospectus may be obtained free of charge by following the instructions below under “Important Other Information.”\nForward-Looking Statements\nThis press release contains forward-looking statements, which address a variety of subjects including, for example, the expected timing of the closing of the proposed transaction between Littelfuse, Inc. (“Littelfuse”) and IXYS Corporation (“IXYS”). Statements that are not historical facts, including statements about Littelfuse and IXYS beliefs, plans and expectations, are forward-looking statements. Such statements are based on current expectations of Littelfuse and IXYS management and are subject to a number of factors and uncertainties, which could cause actual results to differ materially from those described in the forward-looking statements. The following important factors and uncertainties, among others, could cause actual results to differ materially from those described in these forward-looking statements: the ability to satisfy the conditions to closing of the proposed transaction, on the expected timing or at all; the occurrence of any event that could give rise to the termination of the merger agreement; the risk of stockholder litigation relating to the proposed transaction, including resulting expense or delay. For additional information about factors that could cause actual results to differ materially from those described in the forward-looking statements, please refer to both Littelfuse and IXYS filings with the Securities and Exchange Commission (“SEC”), including the risk factors contained in each of the most recent Quarterly Reports on Form 10-Q and Annual Report on Form 10-K of each of Littelfuse and IXYS. Forward-looking statements represent management’s current expectations and are inherently uncertain. Except as required by law, neither Littelfuse nor IXYS undertakes any obligation to update forward-looking statements made by it to reflect new information, subsequent events or circumstances.\nImportant Other Information\nIn connection with the proposed transaction, Littelfuse and IXYS have filed and will file relevant information with the SEC. Littelfuse has filed with the SEC a registration statement on Form S-4 (Registration No. 333-221147) (the “registration statement”) containing a proxy statement of IXYS that also constitutes a prospectus of Littelfuse (the “proxy statement/prospectus”). INVESTORS AND SECURITY HOLDERS OF IXYS ARE URGED TO CAREFULLY READ THE ENTIRE REGISTRATION STATEMENT, PROXY STATEMENT/PROSPECTUS AND OTHER RELEVANT DOCUMENTS FILED WITH THE SEC, BECAUSE THEY CONTAIN IMPORTANT INFORMATION ABOUT LITTELFUSE, IXYS AND THE PROPOSED TRANSACTION. A definitive proxy statement/prospectus has been sent to IXYS stockholders. The registration statement, proxy statement/prospectus and other documents filed by Littelfuse with the SEC may be obtained free of charge at Littelfuse’s website at www.littelfuse.com or at the SEC’s website at www.sec.gov . These documents may also be obtained free of charge from Littelfuse by requesting them by mail at Littelfuse, Inc., 8755 West Higgins Road, Suite 500, Chicago, Illinois 60631, Attention: Investor Relations, or by telephone at (773) 628-1000. The documents filed by IXYS with the SEC may be obtained free of charge at IXYS’ website at www.ixys.com or at the SEC’s website at www.sec.gov . These documents may also be obtained free of charge from IXYS by requesting them by mail at IXYS Corporation, 1590 Buckeye Drive, Milpitas, California 95035, Attention: Investor Relations, or by telephone at (408) 457-9000.\nParticipants in the Solicitation\nIXYS, Littelfuse and certain of their directors, executive officers and employees may be deemed participants in the solicitation of proxies from IXYS stockholders in connection with the proposed transaction.\nInformation regarding the persons who may be deemed to be participants in the solicitation of IXYS stockholders in connection with the proposed transaction, including a description of their direct or indirect interests, by security holdings or otherwise, is set forth in the proxy statement/prospectus.\nInformation about the directors and executive officers of Littelfuse and their ownership of Littelfuse common stock is set forth in the Li", "external_links": ["https://www.globenewswire.com/Tracker?data=jUSR1MjgeFvFOyD7gh6YI2VhFn7e1mUnuadet8vZlKVK3iGOWOQB5s-qvtV0tXS0pl3smqqV5DD_jPhTa-wcaQ=="], "published": "2018-01-05T00:30:00.000+02:00", "crawled": "2018-01-05T01:23:45.009+02:00", "highlightTitle": ""}