{"organizations": [], "uuid": "b7a864b636fb234fdeac8f5d103d64932e38654c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226990803&w=1200&r=LYNXMPEE0U17A", "site_section": "https://www.reuters.com/home", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-portugal-benfica-corruption/benfica-club-president-named-suspect-in-corruption-probe-idUSKBN1FK2AG", "country": "US", "domain_rank": 408, "title": "Benfica club president named suspect in corruption probe", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.642, "site_type": "news", "published": "2018-01-31T23:50:00.000+02:00", "replies_count": 0, "uuid": "b7a864b636fb234fdeac8f5d103d64932e38654c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-portugal-benfica-corruption/benfica-club-president-named-suspect-in-corruption-probe-idUSKBN1FK2AG", "ord_in_thread": 0, "title": "Benfica club president named suspect in corruption probe", "locations": [], "entities": {"persons": [{"name": "luis filipe vieir", "sentiment": "negative"}, {"name": "vieira", "sentiment": "none"}, {"name": "fernando tavares", "sentiment": "none"}, {"name": "joao correia", "sentiment": "none"}, {"name": "tavares", "sentiment": "none"}], "locations": [{"name": "lisbon", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "lisbon", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "benfica", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 3:50 PM / in 39 minutes Benfica club president named suspect in corruption probe Andrei Khalip 3 Min Read \nLISBON (Reuters) - Portugal’s prosecutors on Wednesday named the head of football club Benfica, Luis Filipe Vieira, as a formal suspect in an investigation into a corruption scheme, the second high-profile inquiry to involve the Lisbon club in less than a week. \nThe prosecutor general’s office said Benfica Vice President Fernando Tavares was also a suspect in the case, along with a high-ranking judge and nine other people, five of whom were detained in a police operation on Tuesday. \nThe club’s lawyer, Joao Correia, declined to comment on the investigation against either man. Benfica said the investigation had nothing to do with the club itself. Vieira and Tavares were not immediately available for comment. \nPolice on Tuesday raided the premises of the Portuguese champions, as well as Vieira’s home, among other locations in Lisbon and elsewhere. \nBenfica is Portugal’s most popular club by membership. \nThe prosecutor’s office said the investigation focused on “suspicions of receiving undue advantages, or possibly corruption, money laundering, influence peddling and tax fraud,” but would not provide specific details. \nThe prosecutors said the investigation is linked to a long-running case that involves former Benfica director Jose Veiga, who was detained in 2016 on suspicions of corruption and money laundering in his business dealings in various countries, from Portugal to Cape Verde, Equatorial Guinea, Congo and Gabon. \nBenfica and its president also made headlines over the weekend after police on Friday searched the finance ministry. \nLocal media said the raid targeted finance chief Mario Centeno, who heads the Eurogroup of euro zone finance ministers, over his alleged request last year for tickets to a Benfica-Porto game and on Vieira’s alleged role in obtaining a property tax break for his son. \nThe prosecutor’s office said that was a separate investigation to the one that named Vieira a suspect, and nobody has been accused of any crime. The finance ministry has said Centeno obtained his tickets without breaching any rules, and denied any government interference in Vieira’s tax matters. \nPrime Minister Antonio Costa has dismissed the tickets allegations as “ridiculous” and having “no impact on the credibility and good name of Centeno”, who he said will stay on as finance minister. Reporting by Andrei Khalip; Editing by Axel Bugge and Richard Balmforth", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T23:50:00.000+02:00", "crawled": "2018-01-31T17:57:43.000+02:00", "highlightTitle": ""}