{"organizations": [], "uuid": "4e1b3f8e75b61f8967edcabbed28358396aa3a4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey/turkish-minister-says-military-operation-in-syrias-afrin-should-happen-without-delay-idUSKBN1F80XX", "country": "US", "domain_rank": 408, "title": "Turkish minister says military operation in Syria's Afrin should happen without delay", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.092, "site_type": "news", "published": "2018-01-19T17:42:00.000+02:00", "replies_count": 0, "uuid": "4e1b3f8e75b61f8967edcabbed28358396aa3a4d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey/turkish-minister-says-military-operation-in-syrias-afrin-should-happen-without-delay-idUSKBN1F80XX", "ord_in_thread": 0, "title": "Turkish minister says military operation in Syria's Afrin should happen without delay", "locations": [], "entities": {"persons": [{"name": "nurettin canikli", "sentiment": "negative"}, {"name": "tuvan gumrukcu", "sentiment": "none"}, {"name": "canikli", "sentiment": "none"}, {"name": "ezgi erkoyun", "sentiment": "none"}, {"name": "dominic evans", "sentiment": "none"}, {"name": "ece toksabay", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 9:42 AM / in 2 hours Turkey shells Syria's Afrin region, minister says operation has begun Mert Ozkan 5 Min Read \nSUGEDIGI, Turkey (Reuters) - Turkish artillery fired into Syria’s Afrin region on Friday in what Ankara said was the start of a military campaign against the Kurdish-controlled area. \nThe cross-border bombardment took place after days of threats from Turkish President Tayyip Erdogan to crush the Syrian Kurdish YPG militia in Afrin in response to growing Kurdish strength across a wide stretch of north Syria. \nDirect military action against territory held by Kurdish militia would open a new front in Syria’s civil war and would see Ankara confronting Kurds allied to the United States at a time when Turkey’s relations with Washington are reaching breaking point. \n“The operation has actually de facto started with cross-border shelling,” Turkish Defence Minister Nurettin Canikli said, adding that no troops had crossed into Afrin. \nA U.S. State Department official said such moves would undermine regional stability and would not help protect Turkey’s border security. \n“We do not believe that a military operation serves the cause of regional stability, Syrian stability or indeed Turkish concerns about the security of their border,” the official told reporters, stressing he had limited information about Turkey’s reported military moves. \n“The kind of threats or activities which these initial reports may be referring to, we don’t think advance any of these issues. They are destabilizing.” \nThe United States has instead called on Turkey to focus on the fight against Islamic State militants and not take military action in Afrin. \nReuters TV filmed Turkish artillery at the border village of Sugedigi firing on Friday morning into Afrin region, and the YPG militia said Turkish forces fired 70 shells at Kurdish villages between midnight and Friday morning. Shelling continued in the late afternoon, said Rojhat Roj, a YPG spokesman in Afrin. \nRoj said it was the heaviest Turkish bombardment since Ankara stepped up threats to take military action against the Kurdish region. A woman holds a picture of Kurdish leader Abdullah Ocalan of the Kurdistan Workers Party (PKK) during a protest against Turkish attacks on Afrin, in Hasaka province, Syria, January 18, 2018. REUTERS/Rodi Said \n“YPG is ready to confront Turkish troops and FSA terrorists. If they dare to attack, we are ready to bury them one by one in Afrin,” a YPG statement said. \nSeparately, Russia’s RIA news agency quoted Foreign Minister Sergei Lavrov as saying that media reports on Russian military units withdrawing from the Afrin region had been denied, though he did specify who had denied them. \nTurkey had sent its military chief to Moscow on Thursday to seek approval for an air campaign in Afrin, although Damascus warned it could shoot down any Turkish planes in its skies. \n‘NO OTHER WAY’ \nCanikli said Ankara was determined to destroy the Kurdish group. “All terror networks and elements in northern Syria will be eliminated. There is no other way,” he said. \n“The operation in central Afrin may last a long time, but the terrorist organization will swiftly come undone there.” \nAlthough Canikli said no Turkish troops have gone into Afrin, Turkish newspapers said 20 buses carrying Free Syrian Army rebels crossed on Friday from Turkey into a Turkish-controlled part of northern Syria, on Afrin’s eastern flank. Related Coverage Reported Turkish activity in Syria's Afrin destabilizing: U.S. official \nThey said the FSA rebels would deploy near the town of Azaz, where Kurdish shelling overnight struck a psychiatric hospital. The Turkish armed forces said several civilians wounded in the attack were taken to Turkey for treatment, and Turkish television footage showed rubble and damaged walls. \nTurkey has been angered by U.S. military support for the Kurdish YPG-dominated Syrian Democratic Forces which spearheaded the fight against Islamic State in Syria, and by an announcement that the United States would stay in Syria to train about 30,000 personnel in the swathe of eastern Syria under SDF control. \nTurkey says the YPG is a terrorist group and a branch of the outlawed Kurdistan Workers Party which has waged an insurgency in southeast Turkey for decades, and Canikli criticized Washington for its continued emphasis on countering Islamic State. \n“The threat of Daesh has been removed in both Syria and Iraq. With this reality out in the open, a ‘focus on Daesh’ statement is truly a meaningless remark,” he said. Additional reporting by Tuvan Gumrukcu and Ece Toksabay in Ankara; Tom Perry and Lisa Barrington in Beirut; Arshad Mohammed in Washington; Writing by Dominic Evans; Editing by David Dolan, Angus MacSwan and Hugh Lawson", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T17:42:00.000+02:00", "crawled": "2018-01-19T12:06:47.047+02:00", "highlightTitle": ""}