{"organizations": [], "uuid": "77f2e76740515fc4239bd628330f38e3a59c1532", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-core-lab-announces-q1-2018-quarterly-dividend.html", "country": "US", "domain_rank": 767, "title": "Core Lab Announces Q1 2018 Quarterly Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:05:00.000+02:00", "replies_count": 0, "uuid": "77f2e76740515fc4239bd628330f38e3a59c1532"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-core-lab-announces-q1-2018-quarterly-dividend.html", "ord_in_thread": 0, "title": "Core Lab Announces Q1 2018 Quarterly Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "amsterdam", "sentiment": "none"}], "organizations": [{"name": "the board of supervisory directors of core laboratories n.v", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "euronext amsterdam exchange", "sentiment": "none"}, {"name": "core", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AMSTERDAM, Jan. 16, 2018 /PRNewswire/ -- The Board of Supervisory Directors of Core Laboratories N.V. (NYSE: \"CLB US\" and Euronext Amsterdam Exchange: \"CLB NA\") has announced a cash dividend of $0.55 per share of common stock payable in the first quarter of 2018. This first quarter dividend would mean a total payout of $2.20 per share of common stock, if maintained for the entire year. The quarterly $0.55 per share cash dividend will be payable on Friday, 16 February 2018, to shareholders of record on Friday, 26 January 2018. Dutch withholding tax will be deducted from the dividend at a rate of 15%.\nAny determination to declare a future quarterly cash dividend, as well as the amount of any such cash dividend that may be declared, will be based on the Company's financial position, earnings, earnings outlook, capital expenditure plans, ongoing share repurchases, potential acquisition opportunities, and other relevant factors at the time.\nThe Company has scheduled a conference call to discuss Core's fourth quarter and year ended 2017 earnings. The call will begin at 7:30 a.m. CST / 2:30 p.m. CET on Thursday, 1 February 2018. To listen to the call, please go to Core's website at www.corelab.com .\nCore Laboratories N.V. ( www.corelab.com ) is a leading provider of proprietary and patented reservoir description and production enhancement services used to optimize petroleum reservoir performance. The Company has over 70 offices in more than 50 countries and is located in every major oil-producing province in the world.\nThis release includes forward-looking statements regarding the future revenues, profitability, business strategies and developments of the Company made in reliance upon the safe harbor provisions of Federal securities law. The Company's outlook is subject to various important cautionary factors, including risks and uncertainties related to the oil and natural gas industry, business conditions, international markets, international political climates and other factors as more fully described in the Company's 2016 Form 10-K filed on 10 February 2017, and in other securities filings. These important factors could cause the Company's actual results to differ materially from those described in these forward-looking statements. Such statements are based on current expectations of the Company's performance and are subject to a variety of factors, some of which are not under the control of the Company. Because the information herein is based solely on data currently available, and because it is subject to change as a result of changes in conditions over which the Company has no control or influence, such forward-looking statements should not be viewed as assurance regarding the Company's future performance. The Company undertakes no obligation to publicly update any forward-looking statement to reflect events or circumstances that may arise after the date of this press release.\nView original content with multimedia: http://www.prnewswire.com/news-releases/core-lab-announces-q1-2018-quarterly-dividend-300583406.html\nSOURCE Core Laboratories N.V.", "external_links": ["http://www.prnewswire.com/news-releases/core-lab-announces-q1-2018-quarterly-dividend-300583406.html"], "published": "2018-01-17T00:05:00.000+02:00", "crawled": "2018-01-16T23:44:18.000+02:00", "highlightTitle": ""}