{"organizations": [], "uuid": "8d7aae01305c53243e81b3de01c7710c2df39bab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218834016&w=1200&r=LYNXMPEE010Q2", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/norway-government/norway-pm-solberg-opens-talks-to-include-liberals-in-coalition-idINKBN1ER175", "country": "US", "domain_rank": 408, "title": "Norway PM Solberg opens talks to include Liberals in coalition", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T17:28:00.000+02:00", "replies_count": 0, "uuid": "8d7aae01305c53243e81b3de01c7710c2df39bab"}, "author": "", "url": "https://in.reuters.com/article/norway-government/norway-pm-solberg-opens-talks-to-include-liberals-in-coalition-idINKBN1ER175", "ord_in_thread": 0, "title": "Norway PM Solberg opens talks to include Liberals in coalition", "locations": [], "entities": {"persons": [{"name": "joachim dagenb", "sentiment": "negative"}, {"name": "solberg", "sentiment": "negative"}, {"name": "erna solberg", "sentiment": "none"}, {"name": "reuters/benoit tessier", "sentiment": "none"}], "locations": [{"name": "norway", "sentiment": "none"}, {"name": "boulogne-billancourt", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "christian democrats", "sentiment": "none"}, {"name": "liberal party", "sentiment": "none"}, {"name": "progress party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  moss", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 3:31 PM / in 33 minutes Norway PM Solberg opens talks to include Liberals in coalition Joachim Dagenborg 3 Min Read \nMOSS, Norway (Reuters) - Norwegian Prime Minister Erna Solberg began negotiations on Tuesday to add the small Liberal Party to her cabinet, emphasising jobs creation and energy policy among top priorities for the talks. Norway's Prime Minister Erna Solberg attends the One Planet Summit at the Seine Musicale center in Boulogne-Billancourt, near Paris, France, December 12, 2017. REUTERS/Benoit Tessier \nAdding the Liberals to her coalition of the Conservatives and the anti-immigration Progress Party may make day-to-day governing easier for Solberg. But the three parties together would hold only 80 seats in Norway’s 169-seat assembly. \nSolberg would still need the backing of another small party, the Christian Democrats, who hold eight seats. She had initially tried to form a majority government by including both Liberals and Christian Democrats, but the Christian Democrats have so far rejected the offer. \n“Norway’s economy is improving, unemployment is coming down and we have won a competitiveness that it is essential to maintain in the coming years,” Solberg told reporters as the talks started. They are provisionally scheduled to last until Jan. 19. \nThe comments echoed recent speeches by the prime minister, in which she praised labour unions and employers for agreeing to moderate wage increases that helped keep inflation low and the crown, Norway’s currency, weak against the euro. \nWhile Norway is western Europe’s largest exporter of oil and gas, the country also supports the 2015 Paris climate accord, which aims to end the fossil fuel era this century. \n“It’s very important that we can come to an agreement on policies that will help us tackle the new challenges our country is facing,” Solberg said, adding that a gradual shift to a greener economy was necessary. \nEnergy policy may be a stumbling block for the talks, though. The Liberals want to curtail exploration, while the Progress Party and Solberg’s own Conservatives both intend to continue drilling for hydrocarbons. \nSolberg narrowly retained power in a September election by promising further tax cuts and economic progress for Norway, which has only partly recovered from a 2015-2016 downturn caused by a plunge in the price of oil. Editing by Terje Solsvik, Larry King", "external_links": [], "published": "2018-01-02T17:28:00.000+02:00", "crawled": "2018-01-02T17:50:06.003+02:00", "highlightTitle": ""}