{"organizations": [], "uuid": "76886d9306151eca99aaf5156c909dbf3d94c24c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-mexico-oil-auctiondetails-factbox/factbox-mexican-deepwater-oil-auction-offers-up-potentially-lucrative-areas-idUSKBN1FK27E", "country": "US", "domain_rank": 408, "title": "Factbox: Mexican deepwater oil auction offers up potentially lucrative areas", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-31T23:31:00.000+02:00", "replies_count": 0, "uuid": "76886d9306151eca99aaf5156c909dbf3d94c24c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mexico-oil-auctiondetails-factbox/factbox-mexican-deepwater-oil-auction-offers-up-potentially-lucrative-areas-idUSKBN1FK27E", "ord_in_thread": 0, "title": "Factbox: Mexican deepwater oil auction offers up potentially lucrative areas", "locations": [], "entities": {"persons": [], "locations": [{"name": "mexico city", "sentiment": "none"}, {"name": "perdido fold belt", "sentiment": "none"}, {"name": "salina", "sentiment": "none"}, {"name": "gulf of mexico", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "cordilleras mexicanas", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "china offshore oil corp.", "sentiment": "none"}, {"name": "bhp billiton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MEXICO CITY (Reuters) - The Mexican government is seeking to auction off development rights to 29 deepwater oil and gas blocks in its territorial waters in the Gulf of Mexico on Wednesday, the country’s eighth tender since a landmark energy opening was finalized in 2014.\nThe following details the blocks up for grabs, the companies and consortia pre-qualified and registered to bid, the process by which winners are determined and previous deepwater auction winners:\n* Among the deepwater contractual areas in the auction, 9 blocks are located in the Perdido Fold Belt that straddles the U.S.-Mexico maritime border.\n* Ten blocks are on offer in the Cordilleras Mexicanas basin located along the southwestern rim of the Gulf, and another ten in the Salina basin clustered along the southeastern edge of the Gulf.\n* Twenty-six companies and consortia have pre-qualified and registered to bid on the available blocks, meeting minimum standards for both technical and financial capability.\n* The firms pre-qualified and registered as individual bidders include BHP Billiton, China Offshore Oil Corp., ExxonMobil, Noble Energy, Pemex, PC Carigali, Royal Dutch Shell, Statoil and Total.\nThe consortia pre-qualified and registered to bid include BP and Statoil; BP, Statoil and Total; Chevron and Pemex; Chevron, Pemex and Inpex; Chevron, Pemex and ONGC Videsh; China Offshore Oil Corp. and PC Carigali; Eni, Qatar Petroleum International and Citla Energy; Eni and Qatar Petroleum International; Noble Energy and Deutsche Erdoel; Noble Energy, Pemex and Deutsche Erdoel; Pemex and China Offshore Oil Corp.; PC Carigali, Ophir and PTTEP; Repsol and PC Carigali; Repsol, PC Carigali, Sierra Nevada and PTTEP; Repsol, PC Carigali and Ophir; Royal Dutch Shell and Pemex; and Royal Dutch Shell and Qatar Petroleum International.* In order to meet minimum technical capacity as a potential operator, interested firms must have previous experience operating a deepwater exploration and/or production area at a water depth of at least 1,640 feet (500 meters) in the past five years.\n* To meet minimum financial capacity as a potential operator, interested firms must have at least $2 billion in capital, total assets worth at least $10 billion as well as an investment-grade credit rating.\n* Winners are determined based on the highest bid offered calculated as a weighted formula that favors an additional royalty offered to the government but also includes an extra investment commitment in the exploration phase of each license contract.\n* In the event of a tie, a cash payment offered to the government will serve as the tie-breaker.\n* Mexico’s previous deepwater Gulf oil auction took place on Dec. 5, 2016, and eight of ten blocks up for grabs were awarded.\n* The winners included individual bidder China Offshore Oil Corp., and the following consortia: Total and ExxonMobil; Statoil, BP and Total; Chevron, Pemex and Inpex; PC Carigali and Sierra Coronado; and Murphy, Ophir, PC Carigali and Sierra Offshore Exploration.\nReporting by David Alire Garcia; Editing by Joseph Radford\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T23:31:00.000+02:00", "crawled": "2018-01-31T17:42:40.019+02:00", "highlightTitle": ""}