{"organizations": [], "uuid": "b8d77552f21b5bc9a27c47d57abebb679a557039", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225450455&w=1200&r=LYNXMPEE0P0L2", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-figureskating-fourcontinents/north-korean-skaters-say-theyll-treat-olympics-just-like-any-other-competition-idUKKBN1FF18Z", "country": "US", "domain_rank": 408, "title": "North Korean skaters say they'll treat Olympics just like any other competition", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T12:45:00.000+02:00", "replies_count": 0, "uuid": "b8d77552f21b5bc9a27c47d57abebb679a557039"}, "author": "", "url": "https://uk.reuters.com/article/uk-figureskating-fourcontinents/north-korean-skaters-say-theyll-treat-olympics-just-like-any-other-competition-idUKKBN1FF18Z", "ord_in_thread": 0, "title": "North Korean skaters say they'll treat Olympics just like any other competition", "locations": [], "entities": {"persons": [{"name": "ryom", "sentiment": "none"}, {"name": "kim ju sik", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}], "locations": [{"name": "taipei", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "min read  taipei", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 10:49 AM / Updated 26 minutes ago North Korean skaters say they'll treat Olympics just like any other competition Reuters Staff 3 Min Read \nTAIPEI (Reuters) - North Korea’s figure skating team took bronze in a competition in Taipei on Friday and opened a window on what life is like for sports people in the world’s most isolated country as they head for next month’s Winter Olympics in the rich, democratic South. \nFans cheered as Kim Ju Sik, 25, and Ryom Tae Ok, 18, performed at the Four Continents Figure Skating Championships in Taiwan’s capital, dressed in black outfits with flashes of silver. The crowds clapped whenever the skating pair jumped gracefully to a French song playing in the background. \n“Our practice is very free. As we said, the three hours that we practise can be slightly more or less. Our government really supports us, so we can pay full attention to our skating,” Kim told reporters after the performance. \nThe pair are expected to compete at next month’s Winter Olympics in the South Korean mountain resort of Pyeongchang, although Ryom said they treat every competition the same. \n“Every competition is important for us, so even though we will attend the Olympics, we put our full effort into every competition,” Ryom said. Figure Skating - ISU Four Continents Figure Skating Championships 2018 - Pairs Free Skating - Taipei, Taiwan - January 26, 2018 - Ryom Tae Ok and Kim Ju Sik of North Korea compete. REUTERS/Tyrone Siu \n“To participate in the Olympics, we will still use our usual training. We just hope that we can increase our points and do well. We haven’t thought about the medals, we just want to go according to our practice and perform better and better,” Kim added. \nFirst and second place at the figure skating competition for the pairs category went to the United States. \nMost North Koreans are unable to leave their country, where behind the displays of military pomp lies an impoverished state from which hundreds of people try to flee each year, sometimes through dangerous routes dotted with landmines. \nNorth Korea will send 22 athletes to the Winter Games next month and compete in three sports and five disciplines, the International Olympic Committee said on Saturday. \nNorth Korea’s planned involvement in Pyeongchang is viewed as a sign of easing tensions over its nuclear and missile programmes, which it pursues in defiance of U.N. Security Council resolutions. \nNorth and South Korea remain technically at war after their 1950-53 conflict ended in a truce rather than a peace treaty. Tensions escalated dramatically last year as the regime of Kim Jong Un stepped up its programme aimed at developing a nuclear-tipped missile capable of striking the United States. Reporting By Jessica Macy Yu; Writing by Anne Marie Roantree; Editing by Nick Macfie", "external_links": [], "published": "2018-01-26T12:45:00.000+02:00", "crawled": "2018-01-26T13:05:14.007+02:00", "highlightTitle": ""}