{"organizations": [], "uuid": "2286d1e8b4a427b2efd51c6cdf7fb1efcb74b5b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-sunoco-lp-announces-upsizing-and-pricing-of-private-offering-of-senior-notes.html", "country": "US", "domain_rank": 767, "title": "Sunoco LP Announces Upsizing and Pricing of Private Offering of Senior Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-10T01:19:00.000+02:00", "replies_count": 0, "uuid": "2286d1e8b4a427b2efd51c6cdf7fb1efcb74b5b0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-sunoco-lp-announces-upsizing-and-pricing-of-private-offering-of-senior-notes.html", "ord_in_thread": 0, "title": "Sunoco LP Announces Upsizing and Pricing of Private Offering of Senior Notes", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "sunoco lp", "sentiment": "negative"}, {"name": "sunoco finance corp.", "sentiment": "none"}, {"name": "sunoco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 9, 2018 /PRNewswire/ -- Sunoco LP (NYSE: SUN) (\"Sunoco\") today announced that it has priced at 100% an upsized private offering of $2.2 billion of senior notes, comprised of $1 billion in aggregate principal amount of 4.875% senior notes due 2023, $800 million in aggregate principal amount of 5.500% senior notes due 2026 and $400 million in aggregate principal amount of 5.875% senior notes due 2028 (collectively, the \"notes\"). This represents a $450 million increase in the original offering amount. Sunoco Finance Corp., a wholly owned direct subsidiary of Sunoco, will serve as co-issuer of the notes. The sale of the notes is expected to settle on January 23, 2018, subject to the satisfaction of customary closing conditions.\nSunoco intends to use the net proceeds from the offering to redeem in full (i) its 5.500% senior notes due 2020 at a call premium of 102.750%, plus accrued and unpaid interest, and (ii) each of its 6.250% senior notes due 2021 and 6.375% senior notes due 2023 at a make-whole premium, plus accrued and unpaid interest. Sunoco intends to use the proceeds from its previously announced sale of certain company-operated retail fuel outlets to 7-Eleven, Inc. (the \"7-Eleven Transaction\") to (i) repay in full and terminate its existing senior secured term loan agreement, (ii) repay a portion of the outstanding borrowings under its existing $1.5 billion revolving credit facility, (iii) pay all closing costs and taxes in connection with the 7-Eleven Transaction, (iv) redeem all of its outstanding Series A Preferred Units and (v) fund the repurchase of a portion of its outstanding common units.\nThe offering of the notes has not been registered under the Securities Act of 1933, as amended (the \"Securities Act\"), or any state securities laws and, unless so registered, the notes may not be offered or sold in the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities laws.\nThis press release is neither an offer to sell nor a solicitation of an offer to buy the notes or any other securities and shall not constitute an offer to sell or a solicitation of an offer to buy, or a sale of, the notes or any other securities in any jurisdiction in which such offer, solicitation or sale is unlawful.\nAbout Sunoco LP\nSunoco LP (NYSE: SUN) is a master limited partnership that operates 1,346 convenience stores and retail fuel sites and distributes motor fuel to 7,898 convenience stores, independent dealers, commercial customers and distributors located in more than 30 states. Our parent – Energy Transfer Equity, L.P. (NYSE: ETE) – owns Sunoco's general partner and all of Sunoco's incentive distribution rights.\nCautionary Statement Relevant to Forward-Looking Information\nThis press release includes forward-looking statements regarding future events. These forward- based on Sunoco's current plans and expectations, including with respect to the notes offering, the 7-Eleven Transaction and the use of net proceeds therefrom, and involve a number of risks and uncertainties that could cause actual results and events to vary materially from the results and events anticipated or implied by such forward-looking statements. For a further discussion of these risks and uncertainties, please refer to the \"Risk Factors\" section of Sunoco's most recently filed annual report on Form 10-K, Sunoco's quarterly report on Form 10-Q for the quarter ended March 31, 2017 and in other filings made by Sunoco with the Securities and Exchange Commission. While Sunoco may elect to update these forward-looking statements at some point in the future, it specifically disclaims any obligation to do so, even if new information becomes available in the future.\nContacts\nScott Grischow\nSenior Director – Investor Relations and Treasury\n(214) 840-5660, scott.grischow@sunoco.com\nDerek Rabe, CFA\nSenior Analyst – Investor Relations and Finance\n(214) 840-5553, derek.rabe@sunoco.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/sunoco-lp-announces-upsizing-and-pricing-of-private-offering-of-senior-notes-300580392.html\nSOURCE Sunoco LP", "external_links": ["http://www.prnewswire.com/news-releases/sunoco-lp-announces-upsizing-and-pricing-of-private-offering-of-senior-notes-300580392.html"], "published": "2018-01-10T01:19:00.000+02:00", "crawled": "2018-01-10T02:11:24.000+02:00", "highlightTitle": ""}