{"organizations": [], "uuid": "e694230d4a189219bd7a05b37b8f011b79ec4dc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224303191&w=1200&r=LYNXMPEE0L28K", "site_section": "http://feeds.reuters.com/reuters/INhealth\r", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/us-usa-flu-cdc/cdc-director-urges-flu-vaccinations-as-pediatric-deaths-mount-idINKBN1FB36O", "country": "US", "domain_rank": 408, "title": "CDC director urges flu vaccinations as pediatric deaths mount", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T01:54:00.000+02:00", "replies_count": 0, "uuid": "e694230d4a189219bd7a05b37b8f011b79ec4dc6"}, "author": "", "url": "https://in.reuters.com/article/us-usa-flu-cdc/cdc-director-urges-flu-vaccinations-as-pediatric-deaths-mount-idINKBN1FB36O", "ord_in_thread": 0, "title": "CDC director urges flu vaccinations as pediatric deaths mount", "locations": [], "entities": {"persons": [{"name": "fitzgerald", "sentiment": "none"}, {"name": "brenda fitzgerald", "sentiment": "none"}, {"name": "julie steenhuysen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cdc", "sentiment": "negative"}, {"name": "centers for disease control and prevention", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  chicago", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 11:49 PM / Updated 6 hours ago CDC director urges flu vaccinations as pediatric deaths mount Julie Steenhuysen 3 Min Read \nCHICAGO (Reuters) - Of the 30 U.S. children who have died from the flu so far this season, some 85 percent had not been vaccinated, said Centers for Disease Control and Prevention Director Dr. Brenda Fitzgerald, who urged Americans to get flu shots amid one of the most severe flu seasons in years. \n“My message is, if you haven’t gotten a vaccine, please get a vaccine. Also, please get your children vaccinated,” said Fitzgerald, who is urging citizens “to take every advantage that you can to protect yourself.” \nThe dominant strain during this flu season is an especially nasty type called influenza A (H3N2) that in seasons past has been linked with severe disease and death, especially in the elderly and young. This year’s seasonal flu epidemic is especially severe. \nIn its latest report, the CDC said the virus is present in every state, with 32 states reporting severe flu activity. \nAlthough the vaccine is only estimated to be about 30 percent effective against the H3N2 strain, it has been shown in studies to reduce severity and duration if people do become infected, said Dr. Dan Jernigan, director of the influenza division at the Centers for Disease Control and Prevention. \nFitzgerald conceded in a telephone interview that reports that the flu vaccine in Australia was only 10 percent effective may have caused people to think the vaccine would not be worth the trouble. \nFitzgerald said the agency’s flu division has been on the job during the three-day federal government shutdown. Senators on Monday reached a deal to keep the government funded through Feb. 8. \nStudies have shown that even a vaccine that has lower overall effectiveness can decrease the number of days spent in hospital, duration of the flu and the degree of symptoms. \n“That helps support the point of getting a vaccine,” Jernigan said. \nFitzgerald said the flu vaccine and antiviral drugs used to fight the flu are widely available across the country, noting that people can go to the CDC website and enter their zip code to find the nearest flu clinics with vaccines. ( here ) \nFitzgerald also recommended that people frequently wash their hands or use hand sanitizer, avoid those who are sick or coughing and carry disinfectant wipes. \nThe CDC does not have numbers for adult deaths from the flu because adult flu is not a reportable disease in all U.S. states. But she said North Carolina, which collects such data, has reported 42 adult flu deaths so far this season. \nOfficial estimates from the CDC are expected at the end of the current season, based on a calculation from hospitals and states reporting data to the agency. \nIn the 2014/2015 flu season, in which the H3N2 strain was also the leading strain, there were an estimated 35.6 million cases, 710,000 hospitalizations and 56,000 deaths. At this point, it is not clear whether the current flu season will surpass those estimates, Jernigan said. Reporting by Julie Steenhuysen; Editing by Cynthia Osterman", "external_links": [], "published": "2018-01-23T01:54:00.000+02:00", "crawled": "2018-01-23T02:21:37.010+02:00", "highlightTitle": ""}