{"organizations": [], "uuid": "c46aee2bf5c096b7bb3ec02d36eb09599d34d771", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-dozr-names-adeel-zaman-new-cto.html", "country": "US", "domain_rank": 767, "title": "DOZR Names Adeel Zaman New CTO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.154, "site_type": "news", "published": "2018-01-24T20:20:00.000+02:00", "replies_count": 0, "uuid": "c46aee2bf5c096b7bb3ec02d36eb09599d34d771"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-dozr-names-adeel-zaman-new-cto.html", "ord_in_thread": 0, "title": "DOZR Names Adeel Zaman New CTO", "locations": [], "entities": {"persons": [{"name": "zaman", "sentiment": "none"}, {"name": "navi", "sentiment": "none"}, {"name": "adeel zaman", "sentiment": "none"}], "locations": [{"name": "kitchener", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}], "organizations": [{"name": "dozr names adeel zaman new cto", "sentiment": "negative"}, {"name": "dozr", "sentiment": "none"}, {"name": "cto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AI expert joins fast-growing startup\nKITCHENER, Ontario--(BUSINESS WIRE)-- DOZR, an online platform for heavy equipment rentals, has hired data acquisition and deep learning expert Adeel Zaman as Chief Technology Officer.\nZaman’s hiring follows a year of heavy investment in construction technology, including online equipment sharing. Zaman will help DOZR develop new data acquisition strategies and AI-powered products to drive continued growth for DOZR in the equipment sharing industry.\nPrior to joining DOZR, Zaman founded and served as CTO at Navi and DeepVision. His experience using deep learning to create new value in digital media products will help him build out disruptive AI-powered products for the construction industry, where technology is only just beginning to disrupt traditional approaches to business management. Zaman will lead DOZR’s shift in focus to large scale data acquisition and machine learning to power increased automation and smarter decisions in the marketplace.\n“I am very excited to join DOZR and help power our growth as a leader in the equipment rental space,” Zaman said. “The construction industry has yet to leverage the full potential of collecting data and extracting business insights from it. There is an immense opportunity for DOZR to use large scale vertical datasets and harness the power of AI. DOZR is well-positioned to use AI to help contractors not only use machines more effectively, but also help suppliers improve on procurement and fleet management strategies.”\nDOZR experienced marked growth through 2017, expanding operations from Canada down the U.S. East Coast and into the Midwest. DOZR saw significant revenue growth in 2017, and gross merchandise value increased by 307% year-over-year. That growth also helped DOZR attract new sales, marketing and development talent to support further expansion of service territories and offerings in 2018.\n“Adeel is an excellent addition to the DOZR leadership team,” said Kevin Forestell, DOZR co-founder and CEO. “DOZR already gives equipment owners and renters the tools to make smarter equipment decisions, and Adeel’s expertise in leading AI-powered products will help us use the data we have to create new tools that can have a bigger impact on our business strategy.”\nAbout DOZR\nDOZR is an online heavy equipment platform revolutionizing the way the construction industry rents, buys and sells equipment. ﻿﻿Renting on the DOZR platform is quick and efficient – users can search for equipment they need and book it in minutes. For contractors seeking equipment, DOZR allows users to search for what they need and receive Quote: s at the lowest industry rates. For contractors who own equipment, idle machines can be listed for rent as an additional stream of revenue in the off season. Founded by experienced construction veterans, DOZR connects owners of high quality equipment with trusted buyers and renters in our network. www.dozr.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005933/en/\nThe Dialog Lab\nMatt Isaacs, 512-640-9780\nmatt@thedialoglab.com\nSource: DOZR", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.dozr.com&esheet=51748357&newsitemid=20180124005933&lan=en-US&anchor=www.dozr.com&index=1&md5=4c9cbc204cd31a803a9b7c0edc77c9f9", "http://www.businesswire.com/news/home/20180124005933/en/"], "published": "2018-01-24T20:20:00.000+02:00", "crawled": "2018-01-24T20:58:49.004+02:00", "highlightTitle": ""}