{"organizations": [], "uuid": "f3225f3e811891ee6434eb4fe41890d0a85416fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-children-hypertension/kids-often-get-incorrect-blood-pressure-screening-results-idUKKBN1FE2NJ", "country": "US", "domain_rank": 408, "title": "Kids often get incorrect blood pressure screening results", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T20:04:00.000+02:00", "replies_count": 0, "uuid": "f3225f3e811891ee6434eb4fe41890d0a85416fe"}, "author": "", "url": "https://uk.reuters.com/article/us-health-children-hypertension/kids-often-get-incorrect-blood-pressure-screening-results-idUKKBN1FE2NJ", "ord_in_thread": 0, "title": "Kids often get incorrect blood pressure screening results", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}, {"name": "corinna koe", "sentiment": "none"}], "locations": [{"name": "southern california", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "kaiser permanente", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 6:07 PM / Updated an hour ago Kids often get incorrect blood pressure screening results Lisa Rapaport 5 Min Read \n(Reuters Health) - One in four children and teens who get their blood pressure screened at routine checkups may appear to have hypertension, but that result often doesn’t hold up in repeat tests, a U.S. study suggests. \nResearchers examined data from electronic medical records for almost 755,795 children and adolescents treated at Kaiser Permanente facilities in Southern California, including 186,732 patients diagnosed with high blood pressure. \nAbout 18 percent of kids diagnosed with mild hypertension and 51 percent of youth with more severe high blood pressure got repeat tests at the same visit when their condition was initially detected. \nWhen the tests were repeated during the same visit, 52 percent of kids diagnosed with high blood pressure in the first assessment no longer had hypertension based on the average result from two screenings. \nThis means a lot of kids got falsely diagnosed with high blood pressure, said lead study author Corinna Koebnick of Kaiser Permanente Southern California. \n“Repeating high blood pressure readings will avoid unnecessary follow-up visits but also to prevent the possibility that true hypertension is overlooked,” Koebnick said by email. \nAmong kids initially diagnosed with high blood pressure, the diagnosis was confirmed at a follow-up checkup for 2.3 percent of patients with mild hypertension and 11.3 percent of youth with more severe cases, the study also found. \nOne limitation of the study is that different clinicians or methods for measuring blood pressure might impact which patients were diagnosed with hypertension, the authors note. Because most clinicians didn’t follow recommendations to repeat blood pressure screenings during initial visits and schedule follow-up appointments, it’s also possible that this influenced the proportion of kids with misdiagnosed hypertension, they add. \nStill, the results suggest that pediatricians should repeat blood pressure tests during the same visit to verify the results and make sure children get the appropriate follow-up care if needed, the study team concludes in The Journal of Clinical Hypertension. \n“If the first blood pressure reading is normal, it does not need to be repeated at that visit,” said Dr. Joyce Samuel, a researcher at the McGovern Medical School at the University of Texas Health Science Center at Houston. \n“However, if the first reading is high, taking a few minutes to repeat it may save considerable time, anxiety and cost in the long-run by avoiding unnecessary referrals to blood pressure specialists,” Samuel, who wasn’t involved in the study, said by email. \nInitial blood pressure readings may falsely suggest hypertension if the tests are done too quickly, especially if screening happens right at the start of the visit before children have a chance to sit and relax for a few minutes, noted Dr. David Kaelber a researcher at Case Western Reserve University and chief medical informatics officer of the MetroHealth System in Cleveland, Ohio. \nIf children appear to have hypertension with the first assessment using an automated blood pressure machine, doctors might get a different result when they repeat the test manually, Kaelber, who wasn’t involved in the study, said by email. \n“Automated machines are known to typically generate at least slightly higher blood pressure measures than manually taken blood pressure,” Kaelber said. \nDoctors should check blood pressure at each annual physical, according to recommendations from the American Academy of Pediatrics (AAP). Children who have high blood pressure should try to lower it with lifestyle changes like improving diet and exercise habits before trying medication, the AAP advises. \n“I think the most important message for parents is that they should be asking about their child’s blood pressure just like they ask about their child’s height and weight,” said Dr. Joseph Flynn, a researcher at the University of Washington and Seattle Children’s Hospital who was lead author of the AAP blood pressure guidelines. \n“I’m sure that many parents request their child be re-measured if they don’t believe the height or weight for some reason,” Flynn, who wasn’t involved in the study, said by email. “Similarly, if the child’s blood pressure is high, they should ask that it be repeated at the same visit if that hasn’t already happened.” \nSOURCE: bit.ly/2DKEcnP The Journal of Clinical Hypertension, online January 12, 2018.", "external_links": [], "published": "2018-01-25T20:04:00.000+02:00", "crawled": "2018-01-25T20:43:11.002+02:00", "highlightTitle": ""}