{"organizations": [], "uuid": "4fc6188e3c9e1fcd75abf218994f7c1975d308e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-mavenlink-appoints-doug-tilford-as-svp-of-global-sales.html", "country": "US", "domain_rank": 767, "title": "Mavenlink Appoints Doug Tilford as SVP of Global Sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.651, "site_type": "news", "published": "2018-01-23T17:05:00.000+02:00", "replies_count": 0, "uuid": "4fc6188e3c9e1fcd75abf218994f7c1975d308e0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-mavenlink-appoints-doug-tilford-as-svp-of-global-sales.html", "ord_in_thread": 0, "title": "Mavenlink Appoints Doug Tilford as SVP of Global Sales", "locations": [], "entities": {"persons": [{"name": "doug tilford", "sentiment": "negative"}, {"name": "ray grainger", "sentiment": "none"}, {"name": "mavenlink", "sentiment": "none"}, {"name": "doug", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "mavenlink", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "akamai technologies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif., Jan. 23, 2018 /PRNewswire/ -- Mavenlink , the leading provider of cloud-based software for the modern services organization and a G2 Crowd Leader, announced today that accomplished technology sales leader, Doug Tilford, has joined Mavenlink to lead the company through hyper-growth and international expansion. In his role, Doug is responsible for building a world-class global sales team, delivering a differentiated client experience, and expanding strategic partnerships.\n\"We're excited and proud to have Doug join our talented and ambitious team,\" said Ray Grainger, CEO and founder of Mavenlink. \"With a wealth of knowledge and leadership in global enterprise sales and unwavering commitment to client success, he is the perfect fit to lead our sales organization as we continue to expand globally.\"\nPrior to Mavenlink, Doug spent more than 16 years at Akamai Technologies. While there he helped grow the company from $100 million to more than $2 billion in revenue, holding several leadership positions. He most recently served as the General Manager of Europe, Middle East, Africa and Russia, where he led a team of 500 people and $500 million in revenue. Under his leadership, the EMEA region became one of Akamai's leading divisions. Prior to this appointment, Doug held the role of SVP of Sales for the Americas, where he managed 500 people and $1 billion in revenue. Doug has also held roles responsible for leading high-performing sales and marketing teams at MarketWire.com and the Xerox Corporation.\n\"This is an incredibly exciting time to join Mavenlink,\" stated Doug Tilford. \"With the company's software, services, expertise, and vision, it is uniquely positioned to lead the $3 trillion global services industry through a state of transformation. I look forward to redefining the future of the services economy along with Mavenlink's forward-thinking clients and incredibly talented team.\"\nDoug joins Mavenlink following a year of significant growth and distinction. In the last 12 months, the company has rapidly added jobs at all of its four US locations, as well as international offices in the UK, Australia and the Philippines. Mavenlink has also recently received several awards. In November, Mavenlink was named on Deloitte's Technology Fast 500™, a ranking of the 500 fastest growing technology, media, telecommunications, life sciences, and energy tech companies in North America. The company has been named a 2017 SIIA CODiE Awards finalist in three categories including Best Project Management Solution, Best Collaboration Solution, and Best Cloud Enterprise Resource Planning (ERP) Solution, and awarded the winner of the Gold Stevie Award in the Project Management Category. The organization was also named a Glassdoor Best Place to Work in 2017.\nFor more information about Doug and the Mavenlink executive team, visit https://www.mavenlink.com/team .\nAbout Mavenlink\nMavenlink delivers enterprise-class Software as a Service (SaaS) that transforms how services organizations work with distributed teams, contractors and clients around the globe. Mavenlink's innovative technology platform enables teams of any size to successfully manage and scale their people, projects, and profits. Consulting firms, IT services organizations, creative agencies, and professional services organizations in more than 100 countries are running their businesses more effectively and predictably with Mavenlink. Mavenlink was recently named one of the fastest growing technology companies in North America by Deloitte, a Leader in both Project Management and Professional Services Automation Software grids on G2 Crowd, a Red Herring Global 100 business, a Glassdoor Best Place to Work, and a Cool Vendor by Gartner, the world's leading technology research and advisory firm. Learn more at www.mavenlink.com .\nView original content: http://www.prnewswire.com/news-releases/mavenlink-appoints-doug-tilford-as-svp-of-global-sales-300585564.html\nSOURCE Mavenlink", "external_links": ["https://www.mavenlink.com/", "http://www.prnewswire.com/news-releases/mavenlink-appoints-doug-tilford-as-svp-of-global-sales-300585564.html", "https://www.mavenlink.com/team", "http://www.mavenlink.com/"], "published": "2018-01-23T17:05:00.000+02:00", "crawled": "2018-01-23T17:37:33.041+02:00", "highlightTitle": ""}