{"organizations": [], "uuid": "1c1cd6e6ffa9273e49f7b830a1617bf4da05574d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-enservco-announces-expectations-for-improved-revenue-net-income-and-adjusted-ebitda-performance-in-fourth-quarter-and-full.html", "country": "US", "domain_rank": 767, "title": "ENSERVCO Announces Expectations for Improved Revenue, Net Income, and Adjusted EBITDA Performance in Fourth Quarter and Full Year 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:00:00.000+02:00", "replies_count": 0, "uuid": "1c1cd6e6ffa9273e49f7b830a1617bf4da05574d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-enservco-announces-expectations-for-improved-revenue-net-income-and-adjusted-ebitda-performance-in-fourth-quarter-and-full.html", "ord_in_thread": 0, "title": "ENSERVCO Announces Expectations for Improved Revenue, Net Income, and Adjusted EBITDA Performance in Fourth Quarter and Full Year 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "fourth quarter", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}], "organizations": [{"name": "enservco corporation", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "enservco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER, Jan. 09, 2018 (GLOBE NEWSWIRE) -- ENSERVCO Corporation (NYSE American:ENSV), a diversified national provider of specialized well-site services to the domestic onshore conventional and unconventional oil and gas industries, today announced it expects to report significant year-over-year increases in revenue and improved profitability for the fourth quarter and full year ended December 31, 2017.\nThe Company expects to report fourth quarter revenue of $14.1 to $14.2 million compared to revenue of $6.7 million in the same quarter last year and $5.7 million in the third quarter of 2017. That represents a year-over-year increase of 112% to 113% and a sequential quarter increase of 146% to 147%.\nFor the full year ENSERVCO expects to report revenue in the range of $40.7 to $40.8 million, up approximately 65% over revenue of $24.6 million in 2016.\nIn addition, the Company expects year-over-year improvements in net income and adjusted EBITDA, as it does not anticipate the higher revenue will be accompanied by a corresponding increase in fixed costs. Based on these improvements, ENSERVCO expects to be in compliance with the financial covenants of its senior revolving credit facility upon reporting final results for the quarter.\n“We are pleased to announce a continuation of the momentum we built throughout 2017 in both revenue and adjusted EBITDA,” said Ian Dickinson, President and CEO. “In addition to benefitting from higher commodity prices and an uptick in drilling, completion and maintenance activities in virtually all of our key operating areas, we have added new customers in multiple basins, including a major domestic E&P. Our fleet utilization increased substantially during the fourth quarter and we expect to maintain a high utilization rate in the first quarter of 2018. We look forward to reporting our final fourth quarter and year-end results later this quarter and, assuming oil prices remain stable, are optimistic about extending our momentum in 2018.”\nThe Company also announced that the Board of Directors has named Dustin Bradford, currently Chief Accounting Officer and Controller, to the additional position of Chief Financial Officer effective January 31, 2018. Bradford will succeed Tucker Franciscus, who will remain as CFO through January 31, 2018, and then act in a consulting role for a few months to ensure a smooth transition.\n“Dustin Bradford is a CPA and a seasoned financial executive who is highly qualified to serve in his new position as CFO,” said Ian Dickinson. “We appreciate Tucker’s contributions to ENSERVCO during our turnaround transition and wish him well in his future endeavors.” Dickinson and Franciscus jointly noted that the CFO transition did not result from any issues involving the Company’s financial results, business practices, internal controls or financial reporting procedures. Franciscus added, “I am pleased for the Company on its strong performance and that Dustin will be named CFO.”\n“I’m excited and honored to be named CFO of ENSERVCO and look forward to pursuing what we believe are some very compelling growth opportunities,” said Bradford. “We are focused on reducing the seasonality of our business, strengthening our sales and marketing initiatives, and increasing utilization of our expanded fleet. And with stable to rising commodity prices, we are enjoying some solid industry tailwinds that bode well for the future.”\nPrior to joining ENSERVCO, Bradford was Controller with TapInfluence, Inc., a venture-backed SaaS technology company. Previous assignments included finance positions with Dividend Capital Diversified Property Fund and Sun Microsystems. He began his career as an auditor with KPMG, LLP.\nAbout ENSERVCO\nThrough its various operating subsidiaries, ENSERVCO provides a wide range of oilfield services, including hot oiling, acidizing, frac water heating, water transfer, bacteria and scaling treatment and water hauling. The Company has a broad geographic footprint covering seven major domestic oil and gas basins and serves customers in Colorado, Kansas, Montana, New Mexico, North Dakota, Oklahoma, Pennsylvania, Ohio, Texas, Wyoming and West Virginia. Additional information is available at www.enservco.com\nCautionary Note Regarding Forward-Looking Statements\nThis news release contains information that is \"forward-looking\" in that it describes events and conditions ENSERVCO reasonably expects to occur in the future. Expectations for the future performance of ENSERVCO are dependent upon a number of factors, and there can be no assurance that ENSERVCO will achieve the results as contemplated herein. Certain statements contained in this release using the terms \"may,\" \"expects to,\" and other terms denoting future possibilities, are forward-looking statements. The accuracy of these statements cannot be guaranteed as they are subject to a variety of risks, which are beyond ENSERVCO's ability to predict, or control and which may cause actual results to differ materially from the projections or estimates contained herein. Among these risks are those set forth in ENSERVCO’s annual report on Form 10-K for the year ended December 31, 2016, and subsequently filed documents with the SEC. Forward looking statements in this news release that are subject to risk include the ability to achieve and continue revenue, net income and adjusted EBITDA improvements; expectations to be in compliance with loan covenants; expectations that fixed costs will not increase substantially; and the ability to reduce seasonality, increase fleet utilization and strengthen sales and marketing programs. It is important that each person reviewing this release understand the significant risks attendant to the operations of ENSERVCO. ENSERVCO disclaims any obligation to update any forward-looking statement made herein.\nContact:\nJay Pfeiffer\nPfeiffer High Investor Relations, Inc.\nDirect: 303-880-9000\nEmail: jay@pfeifferhigh.com\nSource:ENSERVCO", "external_links": ["https://www.globenewswire.com/Tracker?data=cysutiKrZb38uLzNFrJdjE1Np7yUjmb0jHESjNP3vFR78vG1u4p76R1whIFwWvBMVB56KG1xJN9ULC0x4SFDsw==", "https://www.globenewswire.com/Tracker?data=WIi4iyncPMgGP4rbNjRpFK1SZo3WgWSCHoa_BogiHBumten5UEOH4ubvMI8Nhb7VhGcINaGAZe45FHjK82giNnwbSVhmOGwPLYCEB4qISIM=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/38f9eca9-323f-406d-8214-b3eb672b0e47"], "published": "2018-01-09T15:00:00.000+02:00", "crawled": "2018-01-09T15:27:45.016+02:00", "highlightTitle": ""}