{"organizations": [], "uuid": "1338b58d00b088ebcde88972f1fe110353de0b83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-eiger-biopharmaceuticals-appoints-david-apelian-md-phd-mba-chief-operating-officer-and-executive-medical-officer.html", "country": "US", "domain_rank": 767, "title": "Eiger BioPharmaceuticals Appoints David Apelian, MD, PhD, MBA Chief Operating Officer and Executive Medical Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "1338b58d00b088ebcde88972f1fe110353de0b83"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-eiger-biopharmaceuticals-appoints-david-apelian-md-phd-mba-chief-operating-officer-and-executive-medical-officer.html", "ord_in_thread": 0, "title": "Eiger BioPharmaceuticals Appoints David Apelian, MD, PhD, MBA Chief Operating Officer and Executive Medical Officer", "locations": [], "entities": {"persons": [{"name": "david apelian", "sentiment": "negative"}, {"name": "apelian", "sentiment": "none"}, {"name": "eiger", "sentiment": "none"}, {"name": "david cory", "sentiment": "none"}], "locations": [{"name": "palo alto", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "eiger biopharmaceuticals, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALO ALTO, Calif., Eiger BioPharmaceuticals, Inc. (Nasdaq: EIGR), focused on the development and commercialization of therapies for rare diseases, announced today the appointment of David Apelian, MD, PhD, MBA as Chief Operating Officer and Executive Medical Officer. Dr. Apelian's clinical development and regulatory experience spans 17 years between large pharma and biotechnology companies in all phases of development ranging from discovery to registration, across multiple therapeutic areas including gastroenterology, hepatology, immuno-oncology, infectious diseases, and rare diseases.\n\"I am very pleased to have Dr. Apelian join the Eiger executive team as Chief Operating Officer and Executive Medical Officer,\" said David Cory, President and CEO. \"His background and experience will be invaluable to Eiger in this new operating role as we transform from a mid-stage proof of concept company into a late-stage biotechnology company. Dr. Apelian has already added great value to Eiger since joining the Company's Board of Directors in June 2017, and we expect his transition to operating executive in the Company to be swift and immediately impactful. It's great to welcome Dr. Apelian to the team ahead of such a strategically important year for the company.\"\n\"I am very pleased to join Eiger's executive team at this exciting point in the Company's development, and look forward to working closely with Eiger management to advance a diverse set of exciting clinical stage orphan disease programs in therapeutic areas of high unmet medical need,\" said Dr. Apelian.\nDr. Apelian was most recently Executive VP and Chief Medical Officer of Achillion Pharmaceuticals, Inc., a position he held since 2013. At Achillion, he was responsible for creating portfolio strategy and managing the company's clinical development programs. He was instrumental in securing a partnership between Achillion and J&J, which resulted in a $225 million equity investment. More recently, he led the rare disease development program for novel small-molecule complement factor D inhibitors for alternative pathway-mediated diseases. From 2005 to 2013, Dr. Apelian was Chief Medical Officer and subsequently head of all R&D and Regulatory Affairs for GlobeImmune. He was previously at Bristol-Myers Squibb where he served as Clinical Director and Medical Leader for development of Baraclude ® (entecavir) for chronic HBV through NDA filing. Prior to that, Dr. Apelian was Clinical Director in the Department of Hepatology & Gastroenterology at Schering Plough, where he coordinated a supplemental NDA filing for interferon alpha-2b and ribavirin for the treatment of pediatric patients with chronic HCV.\nDr. Apelian completed his residency training in pediatrics at New York Hospital, Cornell Medical Center and is board certified in Pediatrics. He received a PhD in Biochemistry from Rutgers University, an MD from the University of Medicine and Dentistry of New Jersey and an MBA from Quinnipiac University. He earned a BA in Biochemistry from Rutgers University.\nAbout Eiger\nEiger is a clinical-stage biopharmaceutical company focused on the development and commercialization of targeted therapies for orphan diseases. We are committed to translational innovation and developing well-characterized drugs acting on newly identified or novel, validated targets. Our mission is to systematically reduce the time and cost of the drug development process to more rapidly deliver important medicines to patients with orphan diseases. For additional information about Eiger and its clinical programs, please visit www.eigerbio.com .\nNote Regarding Forward-Looking Statements\nThis press release contains forward-looking statements that involve substantial risks and uncertainties. All statements, other than statements of historical facts, included in this press release regarding our strategy, future operations, future financial position, future revenue, projected expenses, prospects, plans and objectives, intentions, beliefs and expectations of management are forward-looking statements. These forward-looking statements may be accompanied by such words as \"anticipate,\" \"believe,\" \"could,\" \"estimate,\" \"expect,\" \"forecast,\" \"intend,\" \"may,\" \"plan,\" \"potential,\" \"project,\" \"target,\" \"will\" and other words and terms of similar meaning. Examples of such statements include, but are not limited to, whether or not the study results from the Phase 2 ULTRA study will be positive and whether ubenimex may be further developed and approved and whether promising earlier clinical study results will obtain in larger, later clinical studies, statements relating to the availability of cash for Eiger's future operations, Eiger's ability to develop its drug candidates for potential commercialization, the timing of the commencement and number and completion of Phase 2 trials and whether the products can be successfully developed or commercialized. Various important factors could cause actual results or events to differ materially from the forward-looking statements that Eiger makes, including the risks described in the \"Risk Factors\" sections in the most recent Quarterly Report on Form 10-Q for the period ended September 30, 2017 and Eiger's other periodic reports and filings with the SEC. Eiger does not assume any obligation to update any forward-looking statements, except as required by law.\nInvestors: Ingrid Choong, PhD\nEmail: ichoong@eigerbio.com\nPhone: 1-650-619-6115\nView original content with multimedia: releases/eiger-biopharmaceuticals-appoints-david-apelian-md-phd-mba-chief-operating-officer-and-executive-medical-officer-300576766.html\nSOURCE Eiger BioPharmaceuticals, Inc.", "external_links": ["http://www.eigerbio.com/", "http://www.prnewswire.com/news-releases/eiger-biopharmaceuticals-appoints-david-apelian-md-phd-mba-chief-operating-officer-and-executive-medical-officer-300576766.html"], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T16:51:31.000+02:00", "highlightTitle": ""}