{"organizations": [], "uuid": "501a21261307448207b32b6176a2915f08441d68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-infinera-expands-leadership-team-increasing-focus-on-growth-and-operational-efficiency.html", "country": "US", "domain_rank": 767, "title": "Infinera Expands Leadership Team, Increasing Focus on Growth and Operational Efficiency", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-11T17:45:00.000+02:00", "replies_count": 0, "uuid": "501a21261307448207b32b6176a2915f08441d68"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-infinera-expands-leadership-team-increasing-focus-on-growth-and-operational-efficiency.html", "ord_in_thread": 0, "title": "Infinera Expands Leadership Team, Increasing Focus on Growth and Operational Efficiency", "locations": [], "entities": {"persons": [{"name": "david heard", "sentiment": "none"}, {"name": "infinera", "sentiment": "none"}, {"name": "laxdal", "sentiment": "none"}, {"name": "glenn laxdal", "sentiment": "none"}, {"name": "alexander derecho", "sentiment": "none"}], "locations": [{"name": "sunnyvale", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "infinera", "sentiment": "none"}, {"name": "ericsson north america", "sentiment": "none"}, {"name": "product realization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SUNNYVALE, Calif., Jan. 11, 2018 (GLOBE NEWSWIRE) -- Infinera, the leading provider of Intelligent Transport Networks , announced the appointment of two new executives, increasing the company’s focus on growth and operational efficiency. Glenn Laxdal joins Infinera as senior vice president of product management and Alexander Derecho joins Infinera as senior vice president of global customer service. The new positions report to David Heard, general manager of the recently established Product Realization organization, and are instrumental in bringing Infinera’s optical networking innovations to market faster with a focus on improving the company’s bottom line.\nAs senior vice president of product management, Glenn Laxdal is tasked with driving profitable growth of Infinera’s industry-leading optical networking portfolio with an expanded go-to-market approach. Previously, Mr. Laxdal was head of Ericsson North America’s multi-billion dollar network products business, overseeing strategy, product management and solution development. Mr. Laxdal also served as chief technology officer and head of strategy for Ericsson North America. Prior to Ericsson, Mr. Laxdal served as vice president of global product management at Research in Motion.\nAs senior vice president of global customer service, Alex Derecho is tasked with growing Infinera’s global services business while continuing to deliver the differentiated Infinera experience. Previously, Mr. Derecho served as the senior vice president of global services and support at Harmonic Inc. Mr. Derecho helped establish Harmonic as a premier provider of digital media infrastructure solutions. Prior to Harmonic, Mr. Derecho held various executive leadership positions with telecommunications equipment providers.\n“As we increase the cadence and breadth of our industry-leading portfolio of optical networking platforms, I’m excited at the opportunity to align top notch talent with disruptive technology. This combination will continue to deliver unprecedented economic and operational advantage to Infinera’s customers,” said David Heard, Infinera general manager of Product Realization. “I expect Glenn and Alex will be great partners, working to increase the reach of our optical networking solutions into new markets and applications. Their appointments reflect the significant opportunity ahead for Infinera.”\nContacts:\nMedia:\nAnna Vue\nTel. +1 (916) 595-8157\navue@infinera.com\nInvestors:\nJeff Hustis\nTel: + 1 (408) 213-7150\njhustis@infinera.com\nAbout Infinera\nInfinera (NASDAQ:INFN) provides Intelligent Transport Networks, enabling carriers, cloud operators, governments and enterprises to scale network bandwidth, accelerate service innovation and automate optical network operations. Infinera’s end-to-end packet-optical portfolio is designed for long-haul, subsea, data center interconnect and metro applications. Infinera’s unique large scale photonic integrated circuits enable innovative optical networking solutions for the most demanding networks. To learn more about Infinera visit www.infinera.com , follow us on Twitter @Infinera and read our latest blog posts at blog.infinera.com .\nInfinera and the Infinera logo are registered trademarks of Infinera Corporation.\nThis press release contains forward-looking statements based on current expectations and assumptions that involve risks and uncertainties. Such forward-looking statements include, without limitation, Infinera’s ability to bring its optical networking innovations to market faster; Infinera’s ability to deliver world-class quality and industry leading technology; Infinera’s ability to provide a superior economic and operational advantage to Infinera’s customers; and Infinera’s expectations regarding the ability of its new appointments’ to increase the reach of optical networking solutions to new markets and applications. These statements are not guarantees of results and should not be considered as an indication of future activity or future performance. Actual results may vary materially from these expectations as a result of various risks and uncertainties. Information about these risks and uncertainties, and other risks and uncertainties that affect Infinera’s business, is contained in the risk factors section and other sections of Infinera’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2017 as filed with the SEC on November 8, 2017, as well subsequent reports filed with or furnished to the SEC. These reports are available on Infinera’s website at www.infinera.com and the SEC’s website at www.sec.gov . Infinera assumes no obligation to, and does not currently intend to, update any such forward-looking statements.\nSource:Infinera Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=8igXSU6xzJd-z9KA3SSzG1dgBVBTXsGhyN1RURay3qUuoSquQdzBOLaZpBgj4_9J5t4jGPo0Y8Z075cjqMgChZbPBZOVBR21AJuLTyTrauk=", "https://www.globenewswire.com/Tracker?data=WrzeuV5cHJ2ZkstEv6I0D7rjwpli8sT0UFGnP61UhYA9tPkQoL7ZlnSeoKUatrXsuswjli67spmPiG_bD3Vweg==", "https://www.globenewswire.com/Tracker?data=fKXHdI8dW8ppkF47fX16rPv79Pdjk6SWxXeTu67B0cXgA60I9yD5CWpQa5Vam7SIg-n_gMRKOo4C1WEghCYhRw==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/b07a39c7-9848-4b37-8aef-74e84b3fcc8c", "https://www.globenewswire.com/Tracker?data=fKXHdI8dW8ppkF47fX16rPWQYtuy4dQ1ChfHNe_bTUDY2opNXvlDmAmDj-pgd_Skqr1hnMNDIjH2ahKg-2t-DQ==", "https://www.globenewswire.com/Tracker?data=bQhXqTmnf3SPXhBuTLa6BdRXk2dczIjZ5_ha7lMYnxCgww6VwrZ4j1ROdiMgM_VYYLO40vSDYOh-so0a_qO5_zsF4bR9nQxK02uHInbA-A3rFW6YykKDTev8WvgNrMdb66WIVcE_zuPaoOvWdxqKXjahL_rIhz3_jRfRmRihGXQ=", "https://www.globenewswire.com/Tracker?data=6lJDqjte3NztDXKf5SJbGI6kSRRL3ABaqWgUPD1WdVGmI8w-UquUuU4RygjS9USs6NnqKoSqflTglZXRpdHSZw==", "https://www.globenewswire.com/Tracker?data=5CLjAtJ3eqVKROEiat5a4j7mjugSjJFIw_HtpnJTi9myAR_hQq84tuKTEbu1TA0kALls72Ge82Dj2Z_6bmrKiA=="], "published": "2018-01-11T17:45:00.000+02:00", "crawled": "2018-01-11T18:54:29.001+02:00", "highlightTitle": ""}