{"organizations": [], "uuid": "3cf2d0d280cd04a4371ec1b5aa26038c1fea3e87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-transdigm-group-incorporated-appoints-james-skulina-interim-cfo.html", "country": "US", "domain_rank": 767, "title": "TransDigm Group Incorporated Appoints James Skulina Interim CFO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T00:10:00.000+02:00", "replies_count": 0, "uuid": "3cf2d0d280cd04a4371ec1b5aa26038c1fea3e87"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-transdigm-group-incorporated-appoints-james-skulina-interim-cfo.html", "ord_in_thread": 0, "title": "TransDigm Group Incorporated Appoints James Skulina Interim CFO", "locations": [], "entities": {"persons": [{"name": "skulina", "sentiment": "none"}, {"name": "terrance paradie", "sentiment": "none"}, {"name": "w. nicholas howley", "sentiment": "none"}, {"name": "james skulina", "sentiment": "none"}, {"name": "paradie", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}], "locations": [{"name": "cleveland", "sentiment": "none"}], "organizations": [{"name": "tdg", "sentiment": "negative"}, {"name": "transdigm group incorporated appoints james skulina interim cfo", "sentiment": "negative"}, {"name": "transdigm group incorporated", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "transdigm group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Jan. 2, 2018 /PRNewswire/ -- TransDigm Group Incorporated (NYSE: TDG), a leading global designer, producer and supplier of highly engineered aircraft components, today announced that James Skulina, an Executive Vice President of the Company, has been appointed Interim Chief Financial Officer, effective immediately. Mr. Skulina replaces Terrance Paradie, who resigned for personal reasons. Mr. Paradie will remain an employee of the Company until April 2, 2018 and will be available to assist Mr. Skulina during the transition as needed. Mr. Paradie's departure is unrelated to the Company's financial condition, financial disclosure or strategic direction. The Company will initiate a search process to identify a permanent Chief Financial Officer.\n\"Jim has been a key member of the TransDigm management team and closely involved in many of the significant developments at TDG for over 20 years. He has substantial experience as a financial and operating executive and we are pleased he has agreed to step in as our interim CFO,\" said W. Nicholas Howley, TransDigm Group's Chairman and CEO. \"Our financial performance and outlook remain strong, and I am confident Jim will help guide us through a seamless transition as we search for a permanent successor.\"\nMr. Skulina has been with the Company since 1994. For the last six years, Mr. Skulina has been an Executive Vice President responsible for many of TransDigm's existing businesses and new acquisitions. He has also served the Company in financial roles, including Corporate Controller and Controller for the Company's AeroControlex business unit, and in other roles, including President of the Company's AeroFluid Products business. Mr. Skulina has an MBA from Cleveland State University and Bachelor of Accounting degree from Bowling Green State University.\nAbout TransDigm Group\nTransDigm Group, through its wholly-owned subsidiaries, is a leading global designer, producer and supplier of highly engineered aircraft components for use on nearly all commercial and military aircraft in service today. Major product offerings, substantially all of which are ultimately provided to end-users in the aerospace industry, include mechanical/electro-mechanical actuators and controls, ignition systems and engine technology, specialized pumps and valves, power conditioning devices, specialized AC/DC electric motors and generators, NiCad batteries and chargers, engineered latching and locking devices, rods and locking devices, engineered connectors and elastomers, databus and power controls, cockpit security components and systems, specialized cockpit displays, aircraft audio systems, specialized lavatory components, seatbelts and safety restraints, engineered interior surfaces and related components, lighting and control technology, military personnel parachutes, high performance hoists, winches and lifting devices, and cargo loading, handling and delivery systems.\nContact:\nLiza Sabol\nInvestor Relations\n(216) 706-2945\nir@transdigm.com\nView original content: http://www.prnewswire.com/news-releases/transdigm-group-incorporated-appoints-james-skulina-interim-cfo-300576571.html\nSOURCE TransDigm Group Incorporated", "external_links": ["http://www.prnewswire.com/news-releases/transdigm-group-incorporated-appoints-james-skulina-interim-cfo-300576571.html"], "published": "2018-01-03T00:10:00.000+02:00", "crawled": "2018-01-03T02:20:18.003+02:00", "highlightTitle": ""}