{"organizations": [], "uuid": "25a1c875b9b39da9a2cb7f61f7ab7ad360942591", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/24/103890151-GettyImages-74280025.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/15/martin-luther-king-jr-day-marked-by-trump-criticism-others-pledge-to-fight-racism.html", "country": "US", "domain_rank": 767, "title": "Martin Luther King, Jr. Day marked by Trump criticism, others pledge to fight racism", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.084, "site_type": "news", "published": "2018-01-15T22:59:00.000+02:00", "replies_count": 0, "uuid": "25a1c875b9b39da9a2cb7f61f7ab7ad360942591"}, "author": "Michael Ochs Archives", "url": "https://www.cnbc.com/2018/01/15/martin-luther-king-jr-day-marked-by-trump-criticism-others-pledge-to-fight-racism.html", "ord_in_thread": 0, "title": "Martin Luther King, Jr. Day marked by Trump criticism, others pledge to fight racism", "locations": [], "entities": {"persons": [{"name": "martin luther king", "sentiment": "neutral"}, {"name": "martin lu", "sentiment": "neutral"}, {"name": "trump", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "none"}, {"name": "martin luther king jr.", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "palm beach", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "cherokee nation", "sentiment": "none"}, {"name": "mar-a-lago", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Taxes Martin Luther King, Jr. Day marked by Trump criticism, others pledge to fight racism Martin Luther King Jr.'s children and the pastor of an Atlanta church where he once preached decried disparaging remarks Trump is said to have made about African countries. Down the street from Trump's Mar-a-Lago retreat in Palm Beach, Florida, on Monday, Haitian protesters and Trump supporters yelled at each other from opposing corners. The MLK holiday took on renewed meaning for descendants of black slaves owned by the Cherokee Nation but whose tribal citizenship was in flux until recently. Published Updated Moments Ago SHARES Michael Ochs Archives | Getty Images Civil rights leader Reverend Martin Luther King, Jr. delivers a speech to a crowd on October 16, 1965 in New York City, New York. \nMartin Luther King Jr.'s children and the pastor of an Atlanta church where he once preached decried disparaging remarks President Donald Trump is said to have made about African countries, while protests between Haitian immigrants and Trump supporters broke out near the president's Florida resort Monday, the official federal holiday honoring King. \nAt gatherings across the nation, activists, residents and teachers honored the late civil rights leader on what would have been his 89th birthday and ahead of the 50th anniversary of his assassination in Memphis, Tennessee. \nTrump marked his first King holiday as president buffeted by claims that during a meeting with senators on immigration last week, he used a vulgarity to describe African countries and questioned the need to allow more Haitians into the U.S. He also is said to have asked why the country couldn't have more immigrants from nations like Norway . \nIn Washington, King's eldest son, Martin Luther King III, criticized Trump, saying, \"When a president insists that our nation needs more citizens from white states like Norway, I don't even think we need to spend any time even talking about what it says and what it is.\" \nHe added, \"We got to find a way to work on this man's heart.\" \nIn Atlanta, King's daughter, the Rev. Bernice King, told hundreds of people who packed the pews of the Ebenezer Baptist Church that they \"cannot allow the nations of the world to embrace the words that come from our president as a reflection of the true spirit of America.\" \n\"We are one people, one nation, one blood, one destiny. ... All of civilization and humanity originated from the soils of Africa,\" Bernice King said. \"Our collective voice in this hour must always be louder than the one who sometimes does not reflect the legacy of my father.\" \nChurch pastor the Rev. Raphael Warnock also took issue with Trump's campaign slogan to \"Make America Great Again.\" \nWarnock said he thinks America \"is already great ... in large measure because of Africa and African people.\" \nDown the street from Trump's Mar-a-Lago retreat in Palm Beach, Florida, on Monday, Haitian protesters and Trump supporters yelled at each other from opposing corners. Trump was staying at the resort for the Martin Luther King Jr. holiday weekend. Video posted by WPEC-TV showed several hundred pro-Haiti demonstrators yelling from one side of the street Monday while waving Haitian flags. The Haitians and their supporters shouted \"Our country is not a shithole,\" referring to comments the president reportedly made. Trump has said that is not the language he used. \nThe smaller pro-Trump contingent waved American flags and campaign posters and yelled \"Trump is making America great again.\" One man could be seen telling the Haitians to leave the country. Police kept the sides apart. \nThe Martin Luther King Jr. holiday took on renewed meaning for descendants of black slaves owned by the Cherokee Nation but whose tribal citizenship was in flux until recently, despite a treaty guaranteeing rights equal to native Cherokees. \nThe tribe— one of the country's largest — is recognizing the King holiday for the first time this year with calls to service and speeches in which the tribe plans to confront its past. King's writings spoke of injustices against Native Americans and colonization, but Cherokee Secretary of State Chuck Hoskin Jr. said the tribe had its own form of internal oppression and dispossession. \n\"The time is now to deal with it and talk about it,\" Hoskin saide. \"It's been a positive thing for our country to reconcile that during Dr. King's era, and it's going to be a positive thing for Cherokee to talk about that history as part of reconciling our history with slavery.\" \nSuch talk from tribal officials would have been surprising before a federal court ruled last year that the descendants of former slaves, known as Freedmen, had the same rights to tribal citizenship, voting, health care and housing as blood-line Cherokees. \nOne descendant of Freedmen, Rodslen Brown-King, said her mother was able to vote as a Cherokee for the first and only time recently. Other relatives died before getting the benefits that come with tribal citizenship, including a 34-year-old nephew with stomach cancer, she said. \n\"He was waiting on this decision,\" said Brown-King, of Fort Gibson, Oklahoma. \"It's just a lot of struggle, a lot of up and down trauma in our lives. It's exciting to know we are coming together and moving forward in this.\" \nDerrick Reed, a city councilman in Muskogee, Oklahoma, and director of the Dr. Martin Luther King Jr. Community Center there, said Monday's events were the first attended by the Cherokee Nation in honor of the holiday. Principal Chief Bill John Baker was scheduled to speak at an after-party the tribe is sponsoring, and Hoskin served breakfast earlier in the day. \n\"All the freedmen are finally relieved to be recognized, and their story itself has been a civil rights struggle,\" Reed said. \"It's definitely a turning point in the history of the relationship with the Freedmen Indians as well as the message the tribe is sending to the nation.\" ", "external_links": [], "published": "2018-01-15T22:59:00.000+02:00", "crawled": "2018-01-15T22:59:58.001+02:00", "highlightTitle": ""}