{"organizations": [], "uuid": "be535d8412e2f65a25093670dc2968e1f731a8a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 20, "shares": 20, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223087105&w=1200&r=LYNXMPEE0H1IA", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-nigeria-oil-jpmorgan/nigeria-sues-jp-morgan-for-875-mln-over-malabu-oilfield-deal-idUSKBN1F72HB", "country": "US", "domain_rank": 408, "title": "Nigeria sues JP Morgan for $875 mln over Malabu oilfield deal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:20:00.000+02:00", "replies_count": 0, "uuid": "be535d8412e2f65a25093670dc2968e1f731a8a2"}, "author": "", "url": "https://www.reuters.com/article/us-nigeria-oil-jpmorgan/nigeria-sues-jp-morgan-for-875-mln-over-malabu-oilfield-deal-idUSKBN1F72HB", "ord_in_thread": 0, "title": "Nigeria sues JP Morgan for $875 mln over Malabu oilfield deal", "locations": [], "entities": {"persons": [{"name": "libby george", "sentiment": "none"}, {"name": "julia payne", "sentiment": "none"}], "locations": [{"name": "malabu", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "jp morgan", "sentiment": "negative"}, {"name": "jp morgan chase", "sentiment": "none"}, {"name": "royal dutch shell", "sentiment": "none"}, {"name": "eni", "sentiment": "none"}, {"name": "shell", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 5:21 PM / Updated 10 minutes ago Nigeria sues JP Morgan for $875 million over Malabu oilfield deal Libby George , Julia Payne 4 Min Read \nLONDON (Reuters) - Nigeria has filed a claim against JP Morgan Chase for more than $875 million, accusing it of negligence in transferring funds from a disputed 2011 oilfield deal to a company controlled by the country’s former oil minister. \nA spokeswoman for JP Morgan dismissed the accusation on Thursday, saying the firm “considers the allegations made in the claim to be unsubstantiated and without merit”. \nThe suit filed in British courts relates to a purchase of the offshore OPL 245 oilfield in Nigeria by oil majors Royal Dutch Shell and Eni in 2011. \nAt the core of the case is a $1.3 billion payment from Shell and Eni to secure the block that the lawsuit says was deposited into a Nigerian government escrow account managed by JP Morgan. \nThe lawsuit said JP Morgan then received a request from finance ministry workers to transfer more than $800 million of the funds to accounts controlled by the previous operator of the block, Malabu Oil and Gas, itself controlled by former oil minister Dan Etete. \nThe lawsuit said that JP Morgan then transferred the funds to two accounts controlled by Etete, without sufficient due diligence to make sure the money did not leave accounts controlled by the Nigerian government. \nReuters was unable to reach either Etete or Malabu for comment. MILAN CASE \nThe filing seen by Reuters was made in London in November on behalf of the Federal Republic of Nigeria, and says that JP Morgan acted with gross negligence by allowing the transfer of the money without further checks. \nIt said JP Morgan should have known that, under Nigerian law, the money should never have been transferred to an outside company. \n“If the defendant acted with reasonable care and skill and/or conducted reasonable due diligence it would or should have known or at least suspected ... that it was being asked to transfer funds to third parties who were seeking to misappropriate the funds from the claimant and/or that there was a significant risk that this was the case,” the filing said. \nLate last year, a Milan judge ruled that Shell and Eni must stand trial in Italy, where Eni is headquartered, for a separate legal case in which Milan prosecutors allege bribes were paid to Etete and others as part of the same oilfield deal, including sums that went to Etete’s Malabu.[nL8N1OK25L] \nBoth Eni and Shell have repeatedly denied any wrongdoing in relation to that case. Malabu has never commented on the case and Reuters has not been able to contact it. [nL8N1HI1NA] \nShell last year said it knew some of its payment to the Nigerian government as part of the deal would go to Malabu “to settle its claim on the block”, but that it was a legal transaction. [nL8N1HJ4EN] [nL8N1OK25L] \nThere are also ongoing investigations regarding the deal in Nigeria and the Netherlands, where Shell is based. [nL8N1O53PS][nL5N1FG757] \nThe license for the offshore block was awarded to Malabu in 1998 under then-President Sani Abacha, but Shell finalised a deal for the block with the Nigerian government in 2011. \nA British court, in a judgment late last year that agreed to return to Nigeria $85 million in frozen funds related to the deal, said that Malabu was controlled by Etete. [nL8N1N244M] Additional reporting by Alexis Akwagyiram in Lagos, Writing by Libby George; Editing by Andrew Heavens", "external_links": [], "published": "2018-01-18T19:20:00.000+02:00", "crawled": "2018-01-18T19:32:48.012+02:00", "highlightTitle": ""}