{"organizations": [], "uuid": "556867a12ab642b96bdbf496bc9176bbeb78319a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-ratehub-inc-raises-12-million-to-accelerate-growth-of-mortgage-and-insurance-offerings.html", "country": "US", "domain_rank": 767, "title": "Ratehub Inc. Raises $12 Million to Accelerate Growth of Mortgage and Insurance Offerings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:00:00.000+02:00", "replies_count": 0, "uuid": "556867a12ab642b96bdbf496bc9176bbeb78319a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-ratehub-inc-raises-12-million-to-accelerate-growth-of-mortgage-and-insurance-offerings.html", "ord_in_thread": 0, "title": "Ratehub Inc. Raises $12 Million to Accelerate Growth of Mortgage and Insurance Offerings", "locations": [], "entities": {"persons": [{"name": "andy hunt", "sentiment": "none"}, {"name": "simon nixon", "sentiment": "none"}, {"name": "jeremiah daly", "sentiment": "none"}, {"name": "warby parker", "sentiment": "none"}, {"name": "alyssa furtado", "sentiment": "none"}], "locations": [{"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "accelerate growth of mortgage and insurance offerings canadian financial technology company", "sentiment": "negative"}, {"name": "ratehub inc", "sentiment": "neutral"}, {"name": "ratehub inc.", "sentiment": "none"}, {"name": "general partner at elephant", "sentiment": "none"}, {"name": "prnewswire/ - ratehub inc.", "sentiment": "none"}, {"name": "canwise financial", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Canadian financial technology company secures first round of funding from Elephant\nTORONTO, Jan. 15, 2018 /PRNewswire/ - Ratehub Inc. has raised a $12 million Series A investment led by Elephant , a venture capital firm founded by Jeremiah Daly and Andy Hunt, co-founder of Warby Parker. Simon Nixon, co-founder of U.K.-based MoneySuperMarket , also participated in the funding round. Jeremiah Daly, General Partner at Elephant, has joined Ratehub Inc.'s board of directors.\nFounded in 2010, Ratehub Inc. connects Canadians with the best financial products and services on the market. Ratehub Inc. owns and operates financial product comparison site, Ratehub.ca , and CanWise Financial , a national mortgage brokerage which funds over $1 billion of annual mortgage volume.\n\"Canadians don't always look at all of their options when they need a new financial product, due to ingrained loyalty to their home bank,\" said Alyssa Furtado, co-founder of Ratehub Inc. and CEO of Ratehub.ca. \"We are looking forward to launching new and enhanced financial product comparisons, and to continuing to bring financial transparency to Canadians.\"\n\"Working with Elephant and Simon Nixon will be a tremendous asset in accelerating Ratehub Inc.'s future growth,\" said James Laird, co-founder of Ratehub Inc. and President of CanWise Financial. \"Elephant brings valuable connections and insight into developing a successful online brand, based on their experience at Warby Parker, Allbirds, Scopely, and other leading online brands. Simon Nixon will bring his expertise in growing a financial comparison website into a billion-dollar company, thanks to his experience with MoneySuperMarket.\"\n\"Ratehub Inc.'s founders have executed on an ambitious vision to build the leading source of financial information for Canadian consumers, alongside a marketplace to connect them with financial institutions. They offer a compelling value proposition to both parties that doesn't otherwise exist in Canada,\" said Jeremiah Daly, co-founder and General Partner at Elephant. \"With this initial investment in Ratehub Inc., we're looking forward to seeing the company continue to scale and lead the Canadian market.\"\nRatehub Inc. is using the funds to build a digital platform that will allow Canadians to go through the entire mortgage process online. This digital platform will bring much needed efficiency and simplicity to Canadian homebuyers.\nThe funds will also be used to invest in Ratehub.ca's other verticals, including credit cards, deposits and insurance. In 2018, the company will launch a new suite of tools allowing Canadians to compare home, auto, and life insurance policies.\nAbout Elephant\nElephant is a venture capital firm focused on disruptive software, internet, and mobile companies. The firm was founded in 2015 by Jeremiah Daly and Andy Hunt and has offices in Boston and New York. Elephant is currently investing out of its $156 million debut fund.\nAbout Ratehub Inc.\nRatehub Inc. connects Canadians to the best financial products on the market through its financial product comparison site, Ratehub.ca, and mortgage brokerage, CanWise Financial. More than five million Canadians visit Ratehub.ca every year to get personalized recommendations on the best mortgage rates, credit cards, savings accounts, GICs, and insurance products. CanWise Financial's experienced mortgage professionals guide Canadian homebuyers through the mortgage process, helping them choose the most appropriate lender at the best rate. As a trusted source of financial transparency and information, Ratehub Inc. empowers Canadians to make smart financial decisions. To learn more, visit www.ratehub.ca or www.canwise.com .\nRELATED LINKS\nhttps://www.ratehub.ca/\nhttps://www.canwise.com/\nSOURCE Ratehub Inc.", "external_links": ["https://www.canwise.com/", "http://elephantvc.com/", "https://www.ratehub.ca/", "http://www.ratehub.ca/", "http://www.canwise.com/", "http://www.moneysupermarket.com/"], "published": "2018-01-15T16:00:00.000+02:00", "crawled": "2018-01-15T16:27:14.000+02:00", "highlightTitle": ""}