{"organizations": [], "uuid": "97609a837d9127c7727816da267be70e3fe40b66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 206, "shares": 206, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226656475&w=1200&r=LYNXMPEE0T16N", "site_section": "https://www.reuters.com/commentary", "section_title": "Columns | Reuters.com", "url": "https://www.reuters.com/article/us-apps-arctic-commentary/commentary-the-u-s-risks-losing-an-arctic-cold-war-idUSKBN1FJ2DM", "country": "US", "domain_rank": 408, "title": "The U.S. risks losing an Arctic Cold War", "performance_score": 2, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.027, "site_type": "news", "published": "2018-01-31T00:53:00.000+02:00", "replies_count": 0, "uuid": "97609a837d9127c7727816da267be70e3fe40b66"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-apps-arctic-commentary/commentary-the-u-s-risks-losing-an-arctic-cold-war-idUSKBN1FJ2DM", "ord_in_thread": 0, "title": "The U.S. risks losing an Arctic Cold War", "locations": [], "entities": {"persons": [{"name": "high north", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "arctic ocean", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "kremlin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Last August, a Russian tanker sailed direct from Norway to South Korea through the Arctic Ocean, the first time such a ship had done so without an icebreaker escort. It was a defining moment in the opening up of previously frozen northern trade routes – and it looks to have supercharged an already intensifying arms race and jostle for influence on the roof of the world.\nIt’s a dynamic that brings particular challenge for the United States. In part because Washington has never regarded the High North as a major strategic priority, the area has been seen as falling within Russia’s sphere of influence. Now China too is stepping up its plans to become a major player in the region.\nLast week, China issued its first white paper on its national Arctic strategy , pledging to work more closely with Moscow in particular to create an Arctic maritime counterpart – a “Polar silk road” – to its “one belt, one road” overland trade route to Europe. Both the Kremlin and Beijing have repeatedly stated that their ambitions are primarily commercial and environmental, not military.\nWashington, however, is increasingly suspicious and – aware it risks falling behind – the Pentagon has been reviewing its Arctic strategy .\nSpeaking to Congress in May , the commandant of the U.S. Coast Guard, Admiral Paul Zukunft, revealed that Washington was considering fitting anti-ship cruise missiles to its latest generation of icebreakers, a major departure from these vessels’ primary research and rescue role.\nIt’s a suggestion mocked by pro-Kremlin news channels , with one of Russia’s top officials saying in Norway in January that the Arctic region posed no “military challenges” to any country.\nIn fact, Russia’s military expansion in the Arctic Circle far exceeds that of any other nation, and it has other nearby nations alarmed – particularly Norway and Canada , which have vast swathes of largely unpopulated northern territory as well as offshore oil, gas and mineral interests they worry may be increasingly challenged. (Both countries have ramped up defense spending, based more of their militaries in the North, and lobbied the United States to do the same.)\nAs Reuters reported last year , Moscow has plowed more resources into its northern defense than at any point since the Berlin Wall fell, in some cases giving it even greater capability and reach in the region than it enjoyed before 1989. That includes creating or reopening six military outposts and building three new, large nuclear icebreakers to add to its already 40-strong fleet.\nRussia’s Northern Fleet, based in Murmansk, will also receive its own raft of new investment, including two icebreaking corvettes specifically designed to carry Moscow’s own latest anti-ship missiles. Russia says its Northern Fleet launched more than 200 missiles as part of nearly 300 exercises in 2017, almost certainly a post-Cold War record.\nCrowds gather in St. Petersburg for the launch of the 'Sibir' (Siberia), a new Russian nuclear icebreaker. Sept. 22, 2017. REUTERS/Anton Vaganov Moscow regards its northern waters as crucial to its defense. In particular, it sees them as a “bastion” in which to hide the nuclear ballistic missile submarines it would rely on to deter foreign attack. While U.S. and other NATO subs might potentially penetrate such waters undetected, Moscow’s defenses would make it all but impossible for any surface shipping to survive near Russian territory in any war.\nThe first new U.S. icebreaker is unlikely to enter service before 2023, the U.S. Coast Guard says – but that will be contingent on additional funding this year that is not yet guaranteed. The U.S. military’s only operational heavy icebreaker, the Polar Star, is seen as incapable of remaining in service more than another five years. The ship also has other commitments at the other end of the world – it is currently in the Antarctic .\nChina’s first indigenously-built icebreaker, Snow Dragon 2, launched in December and will operate alongside its namesake, built by Ukraine for Beijing and put in service in 1994. Neither of the Snow Dragons is believed to be armed but, given the change in direction of other Arctic-operating navies, that could easily change.\nIn truth, though, it is the commercial potential in the Arctic – and the diplomatic campaigns behind it – that may be even more significant. And it’s an area in which America looks even more likely to be left behind.\nRussia is the only country with enough icebreakers to reliably escort other shipping through still periodically frozen waters, and that gives it massive influence over regional shipping patterns.\nThe U.S. Geological Survey estimates the Arctic may hold more than a fifth of the world’s undiscovered oil and gas reserves. Russia has been aggressively staking out its claims there for more than a decade, using midget submarines to plant flags on the ocean floor as part of its claim to some half a million square miles of undersea continental shelf.\nChina’s increasing appetite for the region is another significant dynamic in the mix. Canadian experts were shocked to see last week’s Chinese white paper categorizing the Northwest Passage as an “international strait.” Canada has long claimed that area as its own “internal waters.” The difference in wording is more than semantic – it could change who manages and uses the waterway.\nIn its official briefing on the paper , China said it believed any disputes or shipping routes should be handled through “friendly consultations” in accordance with international law.\nBeijing’s “Northern Link” charm offensive is designed to mollify concerns, with President Xi Jinping visiting Finland, Alaska and Iceland in May last year. But that hasn’t been enough to ease concerns in Canada, Greenland and elsewhere, not least over rising numbers of Chinese migrant workers moving to the region for mining and other ventures.\nThe United States may never have to fight the war in the Arctic – not least because it is very hard to imagine how one might begin without sparking a wider global conflict. But that doesn’t mean it may not find itself eased out of what could become an important region without any fight at all.\nAbout the Author Peter Apps is Reuters global affairs columnist, writing on international affairs, globalization, conflict and other issues. He is founder and executive director of the Project for Study of the 21st Century; PS21, a non-national, non-partisan, non-ideological think tank in London, New York and Washington. Before that, he spent 12 years as a reporter for Reuters covering defense, political risk and emerging markets. Since 2016, he has been a member of the British Army Reserve and the UK Labour Party. @pete_apps\nThe views expressed in this article are not those of Reuters News.", "external_links": ["http://www.newshub.co.nz/home/new-zealand/2017/12/us-ice-cutting-ship-polar-star-helps-out-in-christchurch-en-route-to-antarctica.html", "https://library.ecc-platform.org/news/pentagon-arctic-melt-requires-updated-us-strategy", "http://www.newsweek.com/russian-navy-has-fired-hundreds-rockets-northern-fleets-arctic-drills-770632", "https://www.theguardian.com/environment/2017/aug/24/russian-tanker-sails-arctic-without-icebreaker-first-time", "https://news.usni.org/2017/05/18/zukunft-changing-arctic-environment-could-lead-to-more-armed-icebreakers-in-future-fleet", "https://thediplomat.com/2018/01/china-issues-its-arctic-policy/", "http://www.telegraph.co.uk/news/world/china-watch/technology/chinese-icebreaker/", "http://www.newsweek.com/chinas-arctic-goals-620794", "http://www.xinhuanet.com/english/2018-01/26/c_136927327.htm", "https://www.defensenews.com/smr/defense-news-conference/2017/09/06/us-coast-guards-last-heavy-icebreaker-wont-make-it-past-2023/", "https://www.vice.com/en_ca/article/a378y4/canadian-forces-track-russian-subs-as-new-cold-war-brews-under-the-atlantic", "https://sputniknews.com/world/201801181060866886-us-icebreakers-cruise-missiles-now/", "http://www.cbc.ca/news/canada/north/what-does-china-s-new-arctic-policy-mean-for-canada-1.4506754"], "published": "2018-01-31T00:53:00.000+02:00", "crawled": "2018-01-31T04:40:05.007+02:00", "highlightTitle": ""}