{"organizations": [], "uuid": "a5e095e0effa975ef3693dd590333f05c7c70b4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/05/18/103646424-GettyImages-532088294.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/why-apple-sells-just-2-point-5-percent-of-indias-smartphones.html", "country": "US", "domain_rank": 767, "title": "Why Apple sells just 2.5% of India's smartphones", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-30T06:43:00.000+02:00", "replies_count": 0, "uuid": "a5e095e0effa975ef3693dd590333f05c7c70b4d"}, "author": "Manish Singh", "url": "https://www.cnbc.com/2018/01/29/why-apple-sells-just-2-point-5-percent-of-indias-smartphones.html", "ord_in_thread": 0, "title": "Why Apple sells just 2.5% of India's smartphones", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tech Guide Why Apple sells just 2.5% of India's smartphones The U.S. tech giant has regularly reiterated its commitment to India, but there are two pressing issues that analysts and users say continue to cripple the reach of iPhones in the nation: The company's phones are too expensive for many Indian consumers, and Apple's core services such as Apple Maps and Siri don't work well locally. Manish Singh, Special to CNBC Published 10 Hours Ago Punit Paranjpe | AFP | Getty Images Apple chief executive Tim Cook leaves the Taj Mahal Palace hotel in Mumbai \nTen years after Apple began selling iPhones in India , perhaps the last great growth market for the iconic handset, the company is inching toward opening stores in the nation. \nSetting up shop at busy malls in megacities could help with marketing, but it's unlikely to be enough for the company to make inroads in the world's second-largest smartphone market. \nThe U.S. tech giant has regularly reiterated its commitment to India, but there are two pressing issues that analysts and users say continue to cripple the reach of iPhones in the nation: The company's phones are too expensive for many Indian consumers, and Apple's core services such as Apple Maps and Siri don't work well locally. \nA spokesman for Apple in India declined to offer comment on its services in the country, and the company declined an invitation for an interview about its efforts in Asia's third-largest economy. India's unique market \nApple's iPhones remain an aspirational product for thrifty Indians, most of whom purchase smartphones priced below $150, according to market and research firms Counterpoint and IDC. Elsewhere, Apple sells its high-priced iPhones to customers through partnership with telecom operators that subsidise the cost of the product, but phones in India are sold sans tie-up deals with carriers. \nSo iPhones have remained beyond the budget for most Indians. The least expensive iPhone X model, for instance, is priced at 92,430 rupees ($1,450) in India, while the least costly iPhone 8 unit ships at Rs 66,120 ($1,040). The devices are so much more expensive in India because the local government imposes a heavy charge on imported electronics items. \nThe iPhone-maker, for its part, is trying to circumvent the customs duty by manufacturing the iPhone SE model locally in India through a partnership with Taiwanese contract manufacturer Wistron. That's made the iPhone SE the least costly iPhone model from the recent generations in the country. \nBut the company ought to do more, analysts told CNBC. \nSamsung, and Chinese smartphone makers including Xiaomi, Vivo and Oppo, many of which entered the Indian market in the last five years, are increasingly claiming dominance in the nation. Xiaomi and Samsung ship more handsets in India in under two months than Apple does in a year. \nSamsung and the Chinese companies now control 80 percent of the smartphone market in India, while Apple settles for a meager 2.2 percent, Counterpoint and IDC said, citing data for the quarter that ended in September last year. \nAs of the quarter ending in December, Apple had 2.5 percent of India's overall smartphone market, according to Counterpoint. \nMore worrisome for Apple should be the models that are selling well in the nation. Even as the company doesn't list the resurrected iPhone 6 (now with 32GB storage as the base model) and iPhone 5s on its India website, both the handsets have been among the top selling iPhone models in India in the recent quarters. \nEven in the premium smartphone segment where Apple operates, it is losing share to Samsung and OnePlus, Counterpoint said. Apple's share in the premium smartphone market (handsets priced above $470) dropped from 59 percent in the holiday season of 2016 to 35 percent during the same period last year, Counterpoint estimates. The OnePlus 5 was the most popular premium smartphone to ship during that quarter, the research firm added. \nIndustry watchers say Samsung and Xiaomi have benefited from offering a wide range of smartphones to customers. Samsung's J2 lineup of smartphones, priced between $100 to $150, were the best selling handsets for the company in Q3 2017. The companies have also benefited from investments in features that address the local challenges, they added. \nXiaomi's Android-based MIUI operating system, for instance, has integration with several popular local services such as Paytm. The software also offers features to block unwanted phone calls and texts, a persistent problem that millions of Indians face. The ecosystem \nApple's services catalog for India, in contrast, is fairly thin and overlooks many challenges unique to the country, users say. \nApple Music, an outlier among other Apple services, is perhaps the best music streaming service in India thanks to the gradual broadening of the catalog and affordable monthly fee. Several users interviewed by CNBC said they preferred Apple Music over other streaming services — but the same wasn't true of Apple Maps and Siri. \nApple Maps in India offers sparse mapping data of cities and towns, and often misses landmarks. It also lacks the basic turn-by-turn direction feature. \"Apple Maps is a joke in India,\" Bangalore-based Mihir Sharma, who drives on the roads of India's Silicon Valley each day said. His experience was echoed by more than two dozen people CNBC spoke with. In the last several years, Apple has begun to acknowledge the issue and has hired hundreds of engineers at its mapping facility in Hyderabad. \nServices are the hooks that keep users engaged with a platform, said Satish Meena, an analyst at Forrester. CarPlay, Apple's automobile infotainment system, is available on various vehicle models in India but it doesn't offer basic navigation functionality, another user complained. \nSiri, Apple's digital AI-powered assistant, is no different. It doesn't understand many words of Indian origination and often struggles to make sense of Indian accents, users said. Apple has added support for Hindi diction and a Hinglish keyboard in the recent iOS updates, but users said it still isn't good enough. In comparison, Google Assistant and Amazon's Alexa, which was launched in India last year, are said to perform better in India. \nAmid India's demonetization move in late 2016, which saw many international giants such as Samsung and Google launch their payment services in the country, several people waited for the launch of Apple Pay in India — to no avail. In a recent interview, Eddy Cue, Apple's senior vice president of internet and services, said the company was still exploring the service for the country. \n\"There is no denial that Apple ecosystem isn't aligned much to the usage and value of Indian users. So, the services offered don't have flavors that would entice the Indian users,\" Faisal Kawoosa, an analyst with research firm CMR India said. \"At the same time, the typical segment buying Apple products isn't that typical Indian user. But, no brand can afford to underserve a segment — big or small,\" he added. \nApple's strategy for India, in general, is different from other Silicon Valley giants including Google, Facebook, and Microsoft — all of which have launched specialized apps and customized several of their core services to make them work on the country's slow and patchy networks. \nThe Cupertino-based giant seemingly had an early advantage in India since it was one of the handful of international firms to maintain a software development team in the nation more than a decade ago. It laid off most of the staff from the development team in 2006, however, as it shifted focus to other markets. \nIn the recent years, Apple's opinion of India, which Cook identified as a small market for the company in 2012, has changed as the sales of iPhones slowed in Western markets. In 2016, Cook paid his maiden visit to the country as the CEO of the company. During his four-day stay in the nation, he met with Bollywood stars, hung out at a cricket match and announced the first App Accelerator for India . \nBased on the account of more than a dozen developers who have enrolled for the program, Apple executives are urging them to make apps for the local market instead of chasing the Western audience. Developers, many of whom work at major IT firms in the country, have also been urged to advise their companies to embrace new technologies in a timely fashion. show chapters 1:26 PM ET Wed, 17 May 2017 | 01:44 \nApple has also started to address the local buying habits of Indians. In the recent years, Amazon India and Flipkart have offered lofty discounts on select iPhone models to users. The iPhone SE model, for instance, can often be spotted with price label of Rs 17,999 ($280). The amount of discount seen on these e-commerce platforms has widened in the recent quarters, said Harpreet Singh, who tracks gadget prices on Twitter account Deal for Geeks. \nDuring the company's 2017 fiscal fourth quarter earnings call, Cook noted that the company needs to build stores, improve channels, help the developer ecosystem, and offer the \"right\" product lineup to succeed in India. \n\"I feel like we're making good progress there and are gaining understanding of the market, but we still have a long way to go, which I sort of see as an opportunity instead of a problem. And I do feel great about the growth rate,\" he said. \nBut the company might be facing internal roadblocks as its local leadership shifts. \nSanjay Kaul, who was appointed as the country manager for Apple in India in 2016, quit the company last month. His predecessor, Maneesh Dhir left the company two years ago. Michel Coulomb, who has been with the company for more than a decade, will be replacing Kaul. \nA spokesman for Apple in India declined to comment on the departures. \nYet despite the changes at the top, Forrester's Meena and Jayanth Kolla, founder and partner at research firm Convergence Catalyst, said they are optimistic about Apple's future in India and they believe the company could dramatically improve its performance in the next few years. \n\"India market for a company such as Apple has still not hit the inflexion point. But the company is in the right direction and the market is reacting accordingly as well,\" Kolla said. Related Securities", "external_links": [], "published": "2018-01-30T06:43:00.000+02:00", "crawled": "2018-01-30T07:10:13.648+02:00", "highlightTitle": ""}