{"organizations": [], "uuid": "8fabaf98d9bbbf218259c1db9ae4f956c2ec285f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://rdcnewscdn.realtor.com/wp-content/uploads/2018/01/realtor-home-for-sale-columbus.jpg", "site_section": "", "section_title": "", "url": "http://www.wsj.com/articles/realtors-licking-their-wounds-get-ready-for-their-next-battle-1515538892", "country": "US", "domain_rank": 387, "title": "Realtors, Licking Their Wounds, Get Ready for Their Next Battle | realtor.com®", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "", "spam_score": 0.252, "site_type": "news", "published": "2018-01-10T21:00:00.000+02:00", "replies_count": 0, "uuid": "8fabaf98d9bbbf218259c1db9ae4f956c2ec285f"}, "author": "Laura Kusisto", "url": "http://www.wsj.com/articles/realtors-licking-their-wounds-get-ready-for-their-next-battle-1515538892", "ord_in_thread": 0, "title": "Realtors, Licking Their Wounds, Get Ready for Their Next Battle | realtor.com®", "locations": [], "entities": {"persons": [{"name": "elizabeth mendenhall", "sentiment": "none"}], "locations": [], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "bipartisan senate", "sentiment": "none"}, {"name": "fannie mae", "sentiment": "none"}, {"name": "freddie mac", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "nar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Wall Street Journal \nYet, the tax overhaul signed into law in late December significantly diminished the incentives for homeownership, leaving little distinction for most Americans between owning a home and renting. \nNAR President Elizabeth Mendenhall said the group “achieved major improvements to the tax legislation passed in Congress, and from here, our work continues to improve that law and ensure, as Congress turns to housing finance reform, that there are no negative impacts on the country’s homeowners.” \nThe housing lobby scored some 11th-hour victories. The bill preserved the mortgage-interest deduction for second homes, which had been eliminated in the House version. It also left in place a break that lets homeowners shield some of the profits they make selling their homes from capital-gains taxes. \nNow political leaders are turning their attention to remaking mortgage giants Fannie Mae and Freddie Mac , a decade after the government-backed entities received federal bailouts. \nBipartisan Senate legislation expected to be introduced early this year is expected to preserve government backing of 30-year mortgages—a critical goal for the NAR—while eventually dialing back federal ownership of the two entities. But the NAR could find itself at odds with some members of Congress who want to see an end to the federal housing guarantees the Realtors consider essential to delivering affordable mortgages to millions of Americans. \nThe tax overhaul marked a significant legislative defeat for the NAR that raises questions about its lobbying strategy and whether it will have more success in the next round. \nIn the fight over the tax bill, the NAR argued that doubling the standard deduction, which eliminates the incentive for most Americans to itemize their tax returns and claim the mortgage-interest deduction, could turn the U.S. into a “nation of renters.” \nIt was a tough sell. Since the housing crash, politicians on both sides of the aisle have been less eager to tout the government’s role in encouraging homeownership. Rising home prices and tighter mortgage credit in recent years, meanwhile, have meant that new loans and purchases have skewed toward the affluent, making government subsidies less politically palatable. \n“All these flies in the ointment started to add up and it made the [mortgage-interest deduction] quite vulnerable,” said Nela Richardson, chief economist at Redfin, a Seattle-based real-estate brokerage. \nThe NAR’s opposition from the outset, meanwhile, undermined its ability to win compromises, analysts said. \nAfter the president released an outline of the tax overhaul in April, the Realtors called it a “nonstarter,” saying homeowners could see their “home’s value plummet and their equity evaporate.” Online ads in the states of critical swing votes, such as Maine Sen. Susan Collins, described the plan as a “tax increase on middle-class homeowners.” \n“The Realtors made the decision to do a fairly resolute, if not scorched-earth, resistance to this. … [They] really got screwed in the House bill because they came out early in opposition,” said Charles Gabriel, president of Capital Alpha Partners, a political forecasting company for investors. \nA turning point came in the lead-up to the house bill when the National Association of Home Builders split from the Realtors for the first time in three decades, proposing a tax credit it said would be better targeted to less wealthy Americans. \nThe builders were convinced the proposal had momentum but received calls from House Ways and Means Committee Chairman Kevin Brady and Speaker Paul Ryan telling them the Republican leadership didn’t want to complicate the bill with an untested concept like the tax credit, recalled Jerry Howard, chief executive of the NAHB. \nMr. Howard insists that even though the builders group was defeated, it was still the right decision to come to the table because the builders were able to win a number of important concessions for small-business owners and affordable-housing construction. \n“The Realtors have a very, shall I call it, one-dimensional view of the tax code and that is the mortgage-interest deduction,” Mr. Howard said. “We have to look at this thing holistically.” \nThe industry split gave lawmakers an opening, but so did fissures in the NAR’s own membership between agents in high-cost states that could see prices decline due to the bill and agents who hope to benefit from a potential exodus to lower-cost ones . A plea for members to call, email or write to members of Congress generated just over 200,000 sign-ups, which amounts to less than a quarter of NAR’s membership. The NAR said that was the largest response in the group’s history. \nAs the Fannie and Freddie debate begins, analysts said the NAR’s power is likely diminished, but it remains a force. \n“The mortgage industrial complex took it on the chin during the tax debate,” said Isaac Boltansky, director of policy research at Compass Point Research & Trading, a Washington, D.C.-based investment bank. But, he added, the housing industry “is part of the fabric of every single congressional district and its capacity to influence the policy-making process will remain substantial.” Popular Homes Based on your last search Editors' Picks ", "external_links": [], "published": "2018-01-10T21:00:00.000+02:00", "crawled": "2018-01-10T22:09:13.004+02:00", "highlightTitle": ""}