{"organizations": [], "uuid": "aa9beb75d1d08259d9277152b165e7e049641dc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/rtx472tp.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/08/north-south-korea-winter-olympics-talks/", "country": "US", "domain_rank": 1196, "title": "2018 Olympics: North, South Korea Meet for Talks on Cooperation | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-09T23:30:00.000+02:00", "replies_count": 0, "uuid": "aa9beb75d1d08259d9277152b165e7e049641dc0"}, "author": "Reuters", "url": "http://fortune.com/2018/01/08/north-south-korea-winter-olympics-talks/", "ord_in_thread": 0, "title": "2018 Olympics: North, South Korea Meet for Talks on Cooperation | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Olympics 2018 World Watches As North and South Korea Open Historic Talks on Winter Olympics Head of the North Korean delegation Ri Son Gwon shakes hands with his South Korean counterpart Cho Myoung-gyon at the truce village of Panmunjom in the demilitarised zone, South Korea, Jan. 9, 2018. Yonhap/Reuters By Reuters 9:30 PM EST \nNorth and South Korea kicked off their first formal talks in more than two years on Tuesday, with both sides expressing optimism ahead of discussions on how the North’s athletes can attend the Winter Olympics in the South despite tensions. \nRegardless of its narrow, primarily sporting agenda, the meeting is being closely watched by world leaders eager for any sign of a reduction in tensions on the Korean peninsula amid rising fears over North Korea’s development of nuclear weapons and defiance of United Nations Security Council resolutions. \n“We came to this meeting today with the thought of giving our brethren, who have high hopes for this dialogue, invaluable results as the first present of the year…,” said head of North Korea’s delegation Ri Son Gwon. \nNorth Korea entered the talks with a “serious and sincere stance”, said Ri, chairman of the North’s Committee for the Peaceful Reunification of the Fatherland. \nHis counterpart, South Korea’s Unification Minister Cho Myoung-gyon, also expressed optimism. \n“Our talks began after North and South Korea were severed for a long time, but I believe the first step is half the trip,” said Cho. “It would be good for us to make that ‘good present’ you mentioned earlier.” \nThe two sides are discussing North Korea’s participation in the Pyeongchang Winter Olympics and the Paralympics as well as the improvement of inter-Korean relations. \nCho has said his delegation is also preparing to discuss resuming reunions of family members separated by the Korean War, which ended in a ceasefire and technically left the two Koreas still at war. \nSome South Korean officials are hoping the two Koreas may even march under a single flag at the Winter Games, which would be the first time in more than a decade that the two Koreas united under one flag at a sporting event opening. \nPointing to his briefcase before departing for the border, Cho smiled and said, “I have a bit of luggage,” adding, “Everything feels slightly new as we have not had talks in a while”. \nJust before the delegation drove into the demilitarized zone some 20 South Koreans were seen waving a banner reading: “We wish the success of the high-ranking inter-Korean talks”. One man was spotted waving a flag with a unified Korean peninsula. \nFive senior officials from each side met at the three-storey Peace House on the South Korean side of the Panmunjom truce village from 10 a.m. (0100 GMT). \nThe North Korean delegation walked over the border inside the joint security area (JSA) to the Peace House around 0030 GMT, a Unification Ministry official told reporters. \nCameras and microphones are usually placed in the room to ensure that officials from both sides can monitor the talks. \nThe United States, which has 28,500 troops stationed in South Korea as a legacy of the 1950-1953 Korean War, initially responded coolly to the idea of inter-Korean meetings. A Good Thing \nThe State Department had said Pyongyang “might be trying to drive a wedge” between Washington and Seoul and weaken a U.S.-led campaign to force North Korea to give up its development of nuclear-tipped missiles capable of hitting the United States. \nU.S. President Donald Trump spent much of the past year deriding negotiations as useless and lobbing insults at North Korean leader Kim Jong Un, but recently Trump called the new talks “a good thing” and said they had been prompted by his “firm, strong” stance. \nTrump has said he would like to see talks go beyond the Olympics and added: “At the appropriate time, we’ll get involved.” \nA spokeswoman for the U.S. State Department, Katina Adams, did not respond directly when asked about suggestions from some South Korean officials that the two Koreas could march under a single flag at the Olympic opening ceremony and even compete as a single nation in some events, but said: \n“We are in close contact with the Republic of Korea about our unified response to North Korea, including the need to maintain pressure to achieve a denuclearised Korean Peninsula. \n“Diplomatic options remain viable and open and the United States remains committed to finding a peaceful path to denuclearising the Korean Peninsula.” \nAt the same time, Adams said Washington remained “clear-eyed about (North Korea’s) track record when it comes to negotiations” and added: “Time will tell if this is a genuine gesture.” \nU.S. Secretary of State Rex Tillerson reiterated last week that any future talks between the United States and North Korea must be aimed at denuclearisation and warned that diplomatic efforts were backed by a strong military option if necessary. \nU.S. Defense Secretary James Mattis and Japanese Defense Minister Itsunori Onodera spoke by phone on Monday and discussed “the importance of maximizing pressure” on North Korea to abandons its nuclear and missile programs, the Pentagon said in a statement. \nSouth Korea and the United States have agreed to delay joint military exercises until after the Olympics in a bid to reduce tensions and possibly create room for diplomacy. \nThe talks come after North Korea’s Kim used his New Year’s Day speech to announce he was open to sending a delegation to the Olympics as well as reducing tensions on the Korean peninsula, while vowing to never give up his nuclear weapons program. \nRi, the committee chairman who was promoted to his current position in June 2016, is a seasoned negotiator for inter-Korean talks although his previous experience has mostly been military-related due to his career in the armed forces. \nThe talks come after North Korea’s Kim used his New Year’s Day speech to announce he was open to sending a delegation to the Olympics as well as reducing tensions on the Korean peninsula, while vowing to never give up his nuclear weapons program. \nNorth Korea’s delegation will be led by Ri Son Gwon, chairman of the North’s Committee for the Peaceful Reunification of the Fatherland. Committee vice chairman Jon Song Su and Hwang Chung Song, a director, will join Ri. \nRi, the committee chairman who was promoted to his current position in June 2016, is a seasoned negotiator for inter-Korean talks although his previous experience has mostly been military-related due to his career in the armed forces. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T23:30:00.000+02:00", "crawled": "2018-01-09T09:37:47.683+02:00", "highlightTitle": ""}