{"organizations": [], "uuid": "0d8e34a945a3e5b62415991d55ac83730b8bd54d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-trump-immigration-reaction/africa-calls-trump-racist-after-shithole-remark-idUSKBN1F11VC", "country": "US", "domain_rank": 408, "title": "Africa calls Trump racist after 'shithole' remark", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-12T23:19:00.000+02:00", "replies_count": 0, "uuid": "0d8e34a945a3e5b62415991d55ac83730b8bd54d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-trump-immigration-reaction/africa-calls-trump-racist-after-shithole-remark-idUSKBN1F11VC", "ord_in_thread": 0, "title": "Africa calls Trump racist after 'shithole' remark", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "jessie duarte", "sentiment": "none"}, {"name": "duarte", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "east london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "african national congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG/LUSAKA (Reuters) - African politicians labeled U.S. President Donald Trump a racist on Friday after he was reported to have described some immigrants from Africa and Haiti as coming from “shithole” countries.\nSources told Reuters on Thursday that Trump had questioned why the United States would want immigrants from “shithole countries” like Haiti and some African countries during a briefing on draft immigration legislation.\nTrump denied on Friday using such derogatory language, but he had already been widely condemned in many African countries and by international rights organizations.\n“Ours is not a shithole country and neither is Haiti or any other country in distress,” Jessie Duarte, the deputy secretary general of South Africa’s ruling African National Congress told reporters at a news conference in East London.\n“We would not deign to make comments as derogatory as that about any country that has any kind of socio-economic or other difficulties,” Duarte said, adding that much like their African counterparts millions of U.S. citizens were affected by problems such as unemployment.\nBotswana’s foreign ministry summoned the U.S. ambassador in protest and called the comments “highly irresponsible, reprehensible and racist.”\nIt said in a statement that it had asked the U.S. government, through its ambassador, to “clarify” if the derogatory remark also applied to Botswana given that there were Botswana nationals living in the United States and others who wished to go there.\nU.N. human rights spokesman Rupert Colville told reporters in Geneva that Trump’s comments were “shocking and shameful”.\nSince taking office a year ago, Trump has pursued controversial policies aimed at curbing illegal immigration into the United States as part of a hard-line “America First” agenda.\nTrump said on Twitter on Friday that he merely used “tough” language when discussing a new immigration bill with a group of U.S. senators.\nHe said the bill was a step backwards because it would force the United States “to take large numbers of people from high crime countries which are doing badly”.\nThe Trump administration has spoken little about how it wants to engage with African countries, focusing its foreign policy instead on issues like North Korea and Islamic State.\nIn November it ended Temporary Protected Status for immigrants from Haiti and Nicaragua, giving 59,000 Haitian immigrants until July 2019 to return home or legalize their presence in the United States.\nOn the streets of Lusaka, capital of the southern African country of Zambia, Trump’s reported remark reinforced long-held views about the U.S. leader.\n“Trump has always been a racist, only a racist can use such foul language,” said Nancy Mulenga, a student at the University of Zambia. Robert Chiponda, a communications consultant in Lusaka, said he never took Trump seriously.\nOthers used humor to ridicule the offensive comments.\n“As someone from South Shithole, Trevor is deeply offended by the president’s remarks,” U.S. television program The Daily Show wrote on Twitter, referring to its South Africa-born host Trevor Noah.\nReporting by Ed Stoddard in East London, Chris Mfula in Lusaka and Stephanie Nebehay in Geneva; Writing by Alexander Winning in Johannesburg; Editing by Richard Balmforth\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T23:19:00.000+02:00", "crawled": "2018-01-12T18:16:52.003+02:00", "highlightTitle": ""}