{"organizations": [], "uuid": "609701be7809150b6b0558b6f62c04f758d81540", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224096700&w=1200&r=LYNXMPEE0L0M5", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-china-pollution-gas/china-rushes-to-replenish-gas-supplies-ahead-of-icy-blast-holiday-idUSKBN1FB0W3", "country": "US", "domain_rank": 408, "title": "China rushes to replenish gas supplies ahead of icy blast, holiday", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T17:02:00.000+02:00", "replies_count": 0, "uuid": "609701be7809150b6b0558b6f62c04f758d81540"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-pollution-gas/china-rushes-to-replenish-gas-supplies-ahead-of-icy-blast-holiday-idUSKBN1FB0W3", "ord_in_thread": 0, "title": "China rushes to replenish gas supplies ahead of icy blast, holiday", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "angola", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "trinidad and tobago", "sentiment": "none"}, {"name": "north asia", "sentiment": "none"}, {"name": "equatorial guinea", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "thomson reuters eikon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China is pulling in ships from all over to avoid a natural gas supply squeeze ahead of another cold snap and as the world’s most populous nation prepares for Spring Festival celebrations.\nFuel demand in January and February typically slows as temperatures improve compared with the busiest month, December, but data suggests this year could buck the trend.\nAnother cold wave is about to hit North Asia, and Spring Festival, also known as Chinese or Lunar New Year, takes place later than usual this year in mid-February.\nTo ensure supplies before the longest holiday in the Chinese calendar, some 60 ships carrying more than 4 million tonnes of LNG are on their way to China this month, the third highest total behind December’s 5.1 million and November’s 4.36 million tonnes, according to shipping data in Thomson Reuters Eikon.\nThe shipments are coming from unusual origins - Equatorial Guinea and Angola in Africa, Peru in South America, and Trinidad and Tobago - and several are also coming from the United States.\n“The Chinese have bought loads of short-term delivery cargoes to meet an expected spike in demand,” the head of LNG trading at a major fuel merchant based in Singapore said.\nDomestic producers are also churning out more gas. China’s December gas output was the highest since at least 2014, with state energy majors boosting operations at key gas fields like Changqing and Fuling.\nWith temperatures in capital Beijing set to drop as low as -15 Celsius (5 Fahrenheit) this week, heating demand will soar and authorities want to avoid a repeat of December’s chaos, which saw serious supply shortages.\nMaintaining stability is a main priority for the Communist Party, particularly ahead of and during Spring Festival.\nThe rush for supply comes after Beijing ordered millions of households and some industrial plants in northern China to change to gas heating from coal as part of its war on pollution.\nThe resulting jump in demand as well as inadequate storage and pipeline networks created a supply crunch in late 2017, leaving homes freezing.\n“This year, we have a surge in residential and commercial demand,” said Miaoru Huang of energy consultancy Wood Mackenzie.\nThe crisis eased over the past month after the government ordered big gas users like fertilizer makers to suspend operations to move supplies north, and reversed a ban on coal heating for some cities.\nINDUSTRIAL CUTBACK Asian spot LNG prices are at their highest in more than three years, at almost $12 per million British thermal units, as buyers across North Asia order tankers in preparation for the cold snap.\nThe urgency for gas has lifted Chinese prices by 15-18 percent within a week to 6,650 yuan ($1,039.87) per tonne.\nThis has also cut into industrial use, said Li Ruipeng, a manager at trucked-LNG dealer Tangshan Huapu Gas based in Tangshan, a city in northern China’s Hebei province.\nCustomers like steelmakers have stopped operations or switched to coal, as they cannot afford the higher LNG prices.\n“We’re only serving for heating purposes and gas refilling stations. Industrial users are out,” said Li, who doesn’t expect industrial demand to recover until after Spring Festival.\n(Graphic: China's surging gas imports - reut.rs/2DjBzWO )\n(Graphic: : North Asia weather outlook - reut.rs/2DLQIkQ )\nReporting by Josephine Mason and Chen Aizhu; Additional reporting by Henning Gloystein in SINGAPORE; Editing by Tom Hogue\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://reut.rs/2DLQIkQ", "http://reut.rs/2DjBzWO"], "published": "2018-01-22T17:02:00.000+02:00", "crawled": "2018-01-22T19:12:27.019+02:00", "highlightTitle": ""}