{"organizations": [], "uuid": "8d9481550fc7deea4fdf24435071969413cc1701", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224338611&w=1200&r=LYNXMPEE0M03Q", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-shutdown-moderates/with-trump-absent-in-shutdown-debate-moderate-u-s-senators-fill-void-idUSKBN1FC08P", "country": "US", "domain_rank": 408, "title": "With Trump absent in shutdown debate, moderate U.S. senators fill void", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T10:58:00.000+02:00", "replies_count": 0, "uuid": "8d9481550fc7deea4fdf24435071969413cc1701"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-shutdown-moderates/with-trump-absent-in-shutdown-debate-moderate-u-s-senators-fill-void-idUSKBN1FC08P", "ord_in_thread": 0, "title": "With Trump absent in shutdown debate, moderate U.S. senators fill void", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "susan", "sentiment": "none"}, {"name": "susan collins", "sentiment": "none"}, {"name": "joe donn", "sentiment": "none"}, {"name": "joe manchin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "west virginia", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mon Jan 22, 2018 / 9:56 PM EST With Trump absent in shutdown debate, moderate U.S. senators fill void Ginger Gibson U.S. Senators' Susan Collins (R-ME) and Joe Manchin (R-WV) brief reporters after lawmakers struck a deal to reopen the federal government three days into a shutdown on Capitol Hill in Washington, U.S., January 22, 2018. Reuters/Leah Millis FILE PHOTO: U.S. President Donald Trump addresses the annual March for Life rally, taking place on the National Mall, from the White House Rose Garden in Washington, U.S., January 19, 2018. Reuters/Kevin Lamarque \nWASHINGTON (Reuters) - With President Donald Trump standing back from negotiations to end the U.S. government shutdown, it was a group of around two dozen moderate senators that took the lead in hammering out a compromise. \nCongress voted on Monday to end the three-day closure of federal agencies by approving the latest short-term bill to fund the government. Trump signed the bill late on Monday. \nDemocrats had initially balked at backing a spending bill without protections for young “Dreamers,” who were brought illegally to the country as children. Republicans refused to put such protections in the bill. \nWith party leaders blaming each other, a group of senators, who considered themselves pragmatists, began meeting. ADVERTISEMENT \nThe group, about evenly divided between Democrats and Republicans, was led by Senator Susan Collins, a moderate Republican from Maine, and Senator Joe Manchin, a Democrat from the heavily Republican state of West Virginia. \n“When we saw this heading sideways, I called Susan and I said: ‘I think this is going the wrong way, we might want to get ready,'\" said Senator Joe Donnelly, a Democrat from Indiana. \"And she was already thinking the same thing and all of us were.\" \nSnacking on \"Thin Mint\" Girl Scout cookies and popcorn, they met repeatedly over the weekend and by Sunday, offered ideas for the party leaders to consider. ADVERTISEMENT \nOf the 13 Democrats in the group, eight are seeking re-election in November’s congressional elections, including five who represent states won by Trump in 2016. Of the 11 Republicans, none is up for re-election and two plan to retire. SWITZERLAND \nCollins' office, where the talks were held, was dubbed “Switzerland.” \nDuring the shutdown, Trump fired off tweets blaming Democrats for the impasse and spoke by phone to Republican lawmakers. He met on Friday with Senate Democratic leader Chuck Schumer, but those talks went badly and the Republican president stayed out of the fray after that. \nA source with knowledge of internal White House discussions said White House Chief of Staff John Kelly and other top aides told Trump that \"it is better if you don't inject yourself right now.\" \nBut White House aides continued to talk with lawmakers from both parties. \nOn Friday, Senate Republican Leader Mitch McConnell and Schumer tried but failed to reach an agreement. \nHours before the midnight deadline to avert a shutdown, Collins convened 18 senators in her office, one of several meetings that would take place. 'TALKING STICK' \nEventually, the group widened to include about 24 senators. \nDuring their conversations, a \"talking stick\" was handed around to each person when it was that lawmaker's turn to speak in order to avoid people talking over one another. \nChairs were arranged in a semi-circle so people could face each other, said Senator Gary Peters, a Democrat from Michigan. \nOn Sunday afternoon, several senators emerged from Collins’ office expressing cautious optimism. \nCollins later met with Schumer to try to finalize the deal. \nDemocratic Senator Heidi Heitkamp, an original member of the group, said it became clear that for Democrats to be willing to cut a deal, they wanted a “more robust statement” from McConnell underscoring his promise to take up immigration legislation. \nThe bipartisan group met one last time on Monday morning over coffee and breakfast pastries. Heitkamp said a deal seemed within reach when it became clear McConnell was willing to offer a more concrete commitment to take up immigration legislation. ADVERTISEMENT \nMcConnell promised to allow the Senate to conduct an open vote process in early February, which will ensure at least that the Senate will hold a vote. \n\"I thought: 'This could work,'\" Heitkamp said. \nThe group is now considering its role going forward. Members have talked of establishing a weekly meeting. \nThe newly approved bill will keep the government funded through Feb. 8. That leaves another deadline for working out the next spending bill and trying to tackle the immigration issue. \n\"We have 17 days to show that the Senate as a whole can hammer out a compromise and move forward on a huge menu of issues that have been stalled,\" said Senator Chris Coons, a Delaware Democrat and member of the bipartisan group. \"What I'm confident of is that I'm now going to have to work harder if we're going to take advantage of any of this.\" \n(Reporting by Ginger Gibson. Additional reporting by Steve Holland, Susan Cornwell, Richard Cowan, Amanda Becker, Blake Brittain, and David Morgan; Editing by Caren Bohan and Peter Cooney)", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T10:58:00.000+02:00", "crawled": "2018-01-23T07:19:46.026+02:00", "highlightTitle": ""}