{"organizations": [], "uuid": "2c1f8c7e15b35aa1afe616e2b2a7a6f049bb312f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222447849&w=1200&r=LYNXMPEE0F11B", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-cycling-tour-presentation/belgium-to-mark-merckx-anniversary-in-2019-tour-start-idUKKBN1F51TU", "country": "US", "domain_rank": 408, "title": "Belgium to mark Merckx anniversary in 2019 Tour start", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:50:00.000+02:00", "replies_count": 0, "uuid": "2c1f8c7e15b35aa1afe616e2b2a7a6f049bb312f"}, "author": "", "url": "https://uk.reuters.com/article/uk-cycling-tour-presentation/belgium-to-mark-merckx-anniversary-in-2019-tour-start-idUKKBN1F51TU", "ord_in_thread": 0, "title": "Belgium to mark Merckx anniversary in 2019 Tour start", "locations": [], "entities": {"persons": [{"name": "merckx", "sentiment": "negative"}, {"name": "giro d‘italia", "sentiment": "none"}, {"name": "reuters/francois lenoir  merckx", "sentiment": "none"}, {"name": "eddy merckx", "sentiment": "none"}], "locations": [{"name": "belgium", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "mur de grammont", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "waterloo", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "merckx", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 2:52 PM / Updated 14 minutes ago Belgium to mark Merckx anniversary in 2019 Tour start Reuters Staff 2 Min Read \nBRUSSELS (Reuters) - Belgium will host the start of the Tour de France in 2019 with two stages paying homage to the country’s greatest ever cyclist, Eddy Merckx, on the 50th anniversary of his first victory in the race. Former Belgian cycling champion Eddy Merckx attends the presentation of the Grand Depart of the 2019 Tour de France cycling race in Brussels, Belgium, January 16, 2018. REUTERS/Francois Lenoir \nMerckx, nicknamed the Cannibal, won the Tour de France five times from 1969 to 1974, along with five Giro d‘Italia, Spain’s Vuelta once and a series of one-day classic races, including Belgium’s Tour of Flanders. \nThe first stage on July 6, 2019, will run 192 kilometres (119 miles) out of and back to Brussels. The circuit will include the Mur de Grammont, a steep and narrow cobblestone road, a staple of the Tour of Flanders and part of the route for the Tour de France in 1969. \nOn its return towards the capital, it will pass the site of the Battle of Waterloo and the Brussels suburb of Woluwe-St-Pierre, where Merckx grew up. Belgian politician Alain Courtois, Tour de France director Christian Prudhomme and former Belgian cycling champion Eddy Merckx pose during the presentation of the Grand Depart of the 2019 Tour de France cycling race in Brussels, Belgium, January 16, 2018. REUTERS/Francois Lenoir \nThe second stage on July 7 will be a 28-km team time trial from central Brussels and concluding at the Atomium, a landmark building constructed for the World Fair of 1958, when the Tour de France last began in Brussels. \nThis will be the fifth time Belgium has hosted the start and will also mark the mark the 100th anniversary of the yellow jersey worn by the race leader. Slideshow (4 Images) \nTour director Christian Prudhomme said organisers often faced criticism when they choose to start the race outside France, but did not hear a single bad word when Brussels was announced for 2019. \n“We will depart from the city where was born the greatest champion in cycling history, a man, a runner, who made us shudder, who gave us dreams for our entire life: Eddy,” he told a news conference. \nBrussels mayor Philippe Close said the event would be an important moment in the relaunch of Brussels, where tourism suffered after Islamist suicide bombers killed 32 people in March 2016. Reporting by Philip Blenkinsop and Clement Rossignol;  ", "external_links": [], "published": "2018-01-16T16:50:00.000+02:00", "crawled": "2018-01-16T17:12:34.015+02:00", "highlightTitle": ""}