{"organizations": [], "uuid": "18c246e55d2fc4a0cdde7d3db29e9b3e07c8a27d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-world-stocks-hit-records-euro-near-three-year-high-idUSL1N1OZ1DL", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-World stocks hit records, euro near three-year high", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T03:24:00.000+02:00", "replies_count": 0, "uuid": "18c246e55d2fc4a0cdde7d3db29e9b3e07c8a27d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-world-stocks-hit-records-euro-near-three-year-high-idUSL1N1OZ1DL", "ord_in_thread": 0, "title": "GLOBAL MARKETS-World stocks hit records, euro near three-year high", "locations": [], "entities": {"persons": [{"name": "jacob deppe", "sentiment": "none"}, {"name": "stephanie kelly", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Strong growth data pushes global stocks up\n* Euro near three-year high\n* Oil hits highest since mid 2015 (Updates to European trading close; adds commentary)\nBy Stephanie Kelly\nNEW YORK, Jan 4 (Reuters) - Global shares shattered records and European stocks closed higher on Thursday, bolstered by upbeat data from the world’s largest economies, while the euro hovered near a three-year high and the U.S. dollar fell against major currencies.\nMSCI’s gauge of stocks across the globe broke a new record, last gaining 0.83 percent.\nThe ADP National Employment Report on Thursday showed that U.S. private employers added 250,000 jobs in December, marking the biggest monthly increase since March.\nThe Dow Jones Industrial Average rose 161.5 points, or 0.65 percent, to 25,084.18, sailing past the 25,000-mark for the first time.\n“With the Dow Jones hitting 25,000 for the first time, there seems no end in sight to a stock market rally spurred on by much stronger-than-expected jobs data for December, offering yet further evidence of the strength of the U.S. economy,” said Jacob Deppe, head of trading at online trading platform Infinox in London, in a note.\nThe S&P 500 gained 13.82 points, or 0.51 percent, to 2,726.88 and the Nasdaq Composite added 14.07 points, or 0.2 percent, to 7,079.60, with both indexes hitting fresh highs.\nSeparately, China’s services sector activity hit its highest level in more than three years and manufacturing data from Japan came in strong. Services PMI data also showed the euro area was close to its best growth in seven years, confirming a strengthening economy was boosting corporate activity.\nThe euro zone’s STOXX 50 had its best day since April 2017, closing up 1.68 percent. London’s FTSE set a record on Thursday, up 0.32 percent, while Tokyo’s Nikkei - Asia’s biggest market - had earlier shot to its highest since 1992 and was up 3.26 percent.\nMSCI’s broadest index of Asia-Pacific shares outside Japan closed up 0.49 percent, scaling a decade-high peak as a fifth day of gains in China helped emerging market stocks to a six-and-a-half year high.\nThose gains come after Wednesday’s release of the minutes from the Federal Reserve’s mid-December meeting that did little to change a view that it will stick to measured increases in U.S. interest rates.\nThe minutes showed policymakers expect U.S. President Donald Trump’s tax overhaul will boost consumer spending but are still uncertain about the wider impact the stimulus would have on factors such as inflation.\nEURO RALLIES The euro resumed a rally that has taken it near its highest levels in three years, while the U.S. dollar index, which measures the greenback against a basket of major currencies, failed to hold its previous session’s gains after upbeat U.S. data and minutes from the Federal Reserve.\nThe euro rose 0.42 percent to $1.2063, while the dollar index was down 0.26 percent.\nThe Japanese yen weakened 0.29 percent versus the greenback at 112.83 per dollar, while Sterling was last trading at $1.3541, up 0.20 percent on the day.\nU.S. Treasury yields rose, with two-year yields hitting a more than nine-year peak as upbeat December private hiring data boosted expectations that the Fed would raise interest rates at its March policy meetings.\nBenchmark 10-year notes last fell 3/32 in price to yield 2.4543 percent, from 2.445 percent late on Wednesday.\nThe 30-year bond last fell 4/32 in price to yield 2.7894 percent, from 2.783 percent late on Wednesday.\nOil rose above $68 a barrel to its highest since May 2015 after unrest in Iran sparked concerns about supply risks and with support coming from OPEC-led output cuts and demand-boosting cold weather in the United States.\nU.S. crude rose 0.68 percent to $62.05 per barrel and Brent was last at $68.01, up 0.25 percent on the day.\nAdditional reporting by Helen Reid, Marc Jones, Alex Lawler and Jemima Kelly in London, Gertrude Chavez-Dreyfuss and Richard Leong in New York; Editing by Bernadette Baum and Nick Zieminski\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T03:24:00.000+02:00", "crawled": "2018-01-05T09:54:46.005+02:00", "highlightTitle": ""}