{"organizations": [], "uuid": "7696807a7602894f3c6b4537f340d18922473e30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-biocept-announces-closing-of-14-point-8-million-public-offering-of-32854606-shares-of-common-stock-and-warrants-to-purchase.html", "country": "US", "domain_rank": 767, "title": "Biocept Announces Closing of $14.8 Million Public Offering of 32,854,606 Shares of Common Stock and Warrants to Purchase 32,854,606 Shares of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:05:00.000+02:00", "replies_count": 0, "uuid": "7696807a7602894f3c6b4537f340d18922473e30"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-biocept-announces-closing-of-14-point-8-million-public-offering-of-32854606-shares-of-common-stock-and-warrants-to-purchase.html", "ord_in_thread": 0, "title": "Biocept Announces Closing of $14.8 Million Public Offering of 32,854,606 Shares of Common Stock and Warrants to Purchase 32,854,606 Shares of Common Stock", "locations": [], "entities": {"persons": [{"name": "biocept", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "biocept, inc", "sentiment": "neutral"}, {"name": "dawson james securities, inc.", "sentiment": "none"}, {"name": "westpark capital, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 30, 2018 /PRNewswire/ -- Biocept, Inc . (NASDAQ: BIOC) (\"Biocept\" or the \"Company\"), a leading commercial provider of liquid biopsy tests designed to provide physicians with clinically actionable information to improve the outcomes of patients diagnosed with cancer, announces the closing of a \"best efforts\" public offering of 32,854,606 shares of its common stock and warrants to purchase up to an aggregate of 32,854,606 shares of its common stock at a combined offering price of $0.45. The warrants have a per share exercise price of $0.50, are exercisable immediately and will expire five years from the date of issuance. Biocept received proceeds from the offering of approximately $13.3 million, after deducting the applicable placement agents' fee and estimated offering expenses payable by Biocept. Biocept intends to use the proceeds for general corporate purposes, to fund ongoing operations and expansion of its business, and to service its existing indebtedness.\nDawson James Securities, Inc. and WestPark Capital, Inc. acted as placement agents in connection with the offering. Dawson James Securities, Inc. served as sole bookrunner.\nThe shares of common stock and warrants were offered pursuant to a registration statement on Form S-1 (File No. 333-221648), which was declared effective by the United States Securities and Exchange Commission (\"SEC\") on January 25, 2018. A final prospectus relating to the offering was filed with the SEC and is available for free on the SEC's website at http://www.sec.gov , and may be obtained from Dawson James Securities, Inc. Attention: Prospectus Department, 1 North Federal Highway, 5th Floor, Boca Raton, FL 33432, mmaclaren@dawsonjames.com or toll free at 866.928.0928.\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy, nor will there be any sales of these securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such jurisdiction.\nAbout Biocept\nBiocept, Inc. is a molecular diagnostics company with commercialized assays for lung, breast, gastric, colorectal and prostate cancers, and melanoma. The Company uses its proprietary liquid biopsy technology to provide physicians with information for treating and monitoring patients diagnosed with cancer. The Company's patented Target Selector™ liquid biopsy technology platform captures and analyzes tumor-associated molecular markers in both circulating tumor cells (CTCs) and in plasma (ctDNA). With thousands of tests performed, the platform has demonstrated the ability to identify cancer mutations and alterations to inform physicians about a patient's disease and therapeutic options. For additional information, please visit www.biocept.com .\nForward-Looking Statements Disclaimer Statement\nThis release contains forward-looking statements that are based upon current expectations or beliefs, as well as a number of assumptions about future events. Although we believe that the expectations reflected in the forward-looking statements and the assumptions upon which they are based are reasonable, we can give no assurance that such expectations and assumptions will prove to have been correct. Forward-looking statements are generally identifiable by the use of words like \"may,\" \"will,\" \"should,\" \"could,\" \"expect,\" \"anticipate,\" \"estimate,\" \"believe,\" \"intend,\" or \"project\" or the negative of these words or other variations on these words or comparable terminology. To the extent that statements in this release are not strictly historical, including without limitation statements as to our intended use of the proceeds from the offering, such statements are forward-looking, and are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. The reader is cautioned not to put undue reliance on these forward-looking statements, as these statements are subject to numerous risk factors as set forth in our SEC filings. The effects of such risks and uncertainties could cause materially from the forward-looking statements contained in this release. We do not plan to update any such forward-looking statements and expressly disclaim any duty to update the information contained in this press release except as required by law. Readers are advised to review our filings with the SEC, which can be accessed over the Internet at the SEC's website located at www.sec.gov .\nView original content with multimedia: http://www.prnewswire.com/news-releases/biocept-announces-closing-of-148-million-public-offering-of-32854606-shares-of-common-stock-and-warrants-to-purchase-32854606-shares-of-common-stock-300590590.html\nSOURCE Biocept, Inc.", "external_links": ["http://www.globenewswire.com/newsroom/ctr?d=10107782&l=11&a=www.sec.gov&u=http%3A%2F%2Fwww.sec.gov", "http://www.prnewswire.com/news-releases/biocept-announces-closing-of-148-million-public-offering-of-32854606-shares-of-common-stock-and-warrants-to-purchase-32854606-shares-of-common-stock-300590590.html", "http://www.sec.gov/", "http://www.biocept.com/"], "published": "2018-01-31T00:05:00.000+02:00", "crawled": "2018-01-31T03:07:19.006+02:00", "highlightTitle": ""}