{"organizations": [], "uuid": "6a220e5bca3bc77e05a2155b5df07d84ea730abe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/11/104766850-GettyImages-858340328-wall-street.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/04/us-stock-futures-data-dow-fed-politics-on-the-agenda.html", "country": "US", "domain_rank": 767, "title": "US stock futures: data, Dow, Fed, politics on the agenda", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T13:30:00.000+02:00", "replies_count": 0, "uuid": "6a220e5bca3bc77e05a2155b5df07d84ea730abe"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/04/us-stock-futures-data-dow-fed-politics-on-the-agenda.html", "ord_in_thread": 0, "title": "US stock futures: data, Dow, Fed, politics on the agenda", "locations": [], "entities": {"persons": [{"name": "janet yellen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "dow", "sentiment": "negative"}, {"name": "federal open market committee", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "adp", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}, {"name": "fomc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. stock index futures pointed to a higher open on Thursday after the release of stronger-than-expected employment data.\nDow Jones industrial average futures rose 100 points, while S&P 500 and Nasdaq 100 futures gained 7.75 points and 30.75 points, respectively. The Dow was also indicated to open near 25,000.\nThe U.S. private sector added 250,000 jobs in December, according to a report from ADP and Moody's Analytics. Economists polled by Reuters expected a gain of 190,000.\nOther economic data set for release Thursday include the services purchasing managers' index (PMI) at 9:45 a.m. ET. These reports will be followed by the Labor Department's monthly jobs report, which is set for release on Friday.\nThe first week of the year has already shown 2018 to be beneficial for U.S. markets, with the S&P 500 closing above 2,700 for the first time Wednesday , and other stocks reaching all-time highs during trade.\nStan Honda | AFP | Getty Images Meanwhile, investors are likely to be digesting the latest minutes from the Federal Open Market Committee (FOMC). On Wednesday, the U.S. central bank's minutes revealed that the final interest rate hike of Janet Yellen's era as Fed chair was met by a divided central bank; however, the scales are now tipped towards the more hawkish voices.\nAt the December meeting, the bank approved to increase interest rates by a quarter-point, although concerns over inflation still remain.\nSt. Louis Fed President James Bullard is set to deliver a keynote address at Meltzer's Contributions to Monetary Economics and Public Policy in Philadelphia on Thursday.\nGeopolitics continues to linger at the back of investors' minds, as rising tensions between the U.S. and North Korea continue to put global markets on edge. On Tuesday, President Donald Trump tweeted that his \"nuclear button\" was \"much bigger and more powerful\" than the one controlled by North Korea's Kim Jong-Un.\nTrump's tweet comes after the North Korean leader said in his New Year's Day address that the isolated state's nuclear weapons could reach anywhere in the U.S.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nElsewhere, oil prices hit their highest in over 2.5 years , supported by geopolitical tensions seen in Iran.\n—CNBC's Patti Domm contributed to this report", "external_links": [], "published": "2018-01-04T13:30:00.000+02:00", "crawled": "2018-01-04T13:46:37.011+02:00", "highlightTitle": ""}