{"organizations": [], "uuid": "b0abd7a4b1f4175b01bc2568776cd17e565c9701", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/05/13/101668916-482099763.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/kohls-reports-2017-holiday-sales.html", "country": "US", "domain_rank": 767, "title": "Kohl's boosts outlook as holiday sales top forecasts, sending shares higher", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.029, "site_type": "news", "published": "2018-01-08T14:26:00.000+02:00", "replies_count": 0, "uuid": "b0abd7a4b1f4175b01bc2568776cd17e565c9701"}, "author": "Lauren Thomas", "url": "https://www.cnbc.com/2018/01/08/kohls-reports-2017-holiday-sales.html", "ord_in_thread": 0, "title": "Kohl's boosts outlook as holiday sales top forecasts, sending shares higher", "locations": [], "entities": {"persons": [{"name": "kohl", "sentiment": "negative"}, {"name": "kevin mansell", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kohl's on Monday reported same-store sales during the holidays climbed nearly 7 percent from 2016.\nRecent initiatives including partnering with Amazon and bringing in more items from popular athletic apparel brands Under Armour , Nike and Adidas are paying off for Kohl's, which said more people have been shopping its stores.\nThe department store chain's shares were climbing around 3 percent Monday morning on the news.\n\"All lines of business and all regions reported positive comp sales,\" CEO Kevin Mansell said in a statement. \"As expected, growth in digital demand accelerated significantly in the holiday period from the year-to-date trend.\"\nFueled by its stronger results for November and December, Kohl's raised its full-year profit outlook and now expects fiscal 2017 earnings per share to range from $4.10 to $4.20, versus a prior forecast of $3.72 to $3.92. Excluding a previously disclosed fourth-quarter tax settlement of $30 million, adjusted earnings per share are expected to be between $3.98 to $4.08, compared with a prior range of $3.60 to $3.80.\nAnalysts on average are expecting Kohl's to report an adjusted profit of $3.64 for fiscal 2017, according to a poll by Thomson Reuters.\nKohl's said these adjustments don't include the impact of recent changes in federal tax legislation, which are expected to have a \"positive impact\" on the company's effective tax rate and result in other noncash tax benefits.\nMany retailers have already started posting stronger sales for the 2017 holiday season compared with 2016, when results were largely dismal. That set the performance bar much lower for companies like Macy's , J.C. Penney and even Kohl's.\nLately, the retail industry has been benefiting from stronger consumer confidence and a booming stock market, which has made shoppers more willing to open their wallets. The biggest threat for many has become the growth of internet giants like Amazon, and the question becomes: how to compete in a digital age with so many stores?\nAbout this time last year, Kohl's had slashed its fiscal 2016 outlook when sales in the fourth quarter were worse than expected. Mansell called the 2016 holiday season \"volatile,\" and a strong Black Friday for the company couldn't offset \"softness\" in early November and December.\nKohl's was also struggling to grow profit margins amid a \"competitive promotional environment,\" where excessive discounting was the norm. For the 2017 holiday season, though, many retail analysts and consultants have said promotions appear to have tapered off.\n\"Our store checks found [Kohl's] to be one of the busiest department stores all season long,\" Retail Metrics Founder Ken Perkins told CNBC.\nKohl's is set to report fourth-quarter earnings and full-year results on March 1.", "external_links": [], "published": "2018-01-08T14:26:00.000+02:00", "crawled": "2018-01-08T14:27:03.006+02:00", "highlightTitle": ""}