{"organizations": [], "uuid": "70846c8e3a3a87a5811b5fbef449c0740f12eed3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224950593&w=1200&r=LYNXMPEE0N29L", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/us-davos-meeting-may/uks-may-seeks-to-harness-investor-power-in-fight-against-online-extremism-idUKKBN1FD36O", "country": "US", "domain_rank": 408, "title": "May seeks to harness investor power in fight against online extremism", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:36:00.000+02:00", "replies_count": 0, "uuid": "70846c8e3a3a87a5811b5fbef449c0740f12eed3"}, "author": "", "url": "https://uk.reuters.com/article/us-davos-meeting-may/uks-may-seeks-to-harness-investor-power-in-fight-against-online-extremism-idUKKBN1FD36O", "ord_in_thread": 0, "title": "May seeks to harness investor power in fight against online extremism", "locations": [], "entities": {"persons": [{"name": "william james", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 10:36 PM / Updated 19 minutes ago UK's May seeks to harness investor power in fight against online extremism William James 3 Min Read \nLONDON (Reuters) - Investors should use their financial clout to force internet firms into taking more responsibility for stopping militants and pedophiles using their platforms, British Prime Minister Theresa May will say on Thursday. \nMay will make the call at the World Economic Forum in Davos, Switzerland, where the world’s most powerful leaders, investors and executives are gathered to discuss the global agenda. \n“Technology companies still need to go further in stepping up to their responsibilities for dealing with harmful and illegal online activity,” May will say according to advance extracts of her speech. \n“These companies simply cannot stand by while their platforms are used to facilitate child abuse, modern slavery or the spreading of terrorist and extremist content.” \nMay, a former interior minister whose 18 months in power has been marked by a series of deadly attacks, has repeatedly called on firms like Facebook and Twitter to do more to deal with extremist and harmful content. \nOn Thursday, she will say that while some progress has been made on the automatic removal of harmful content, investors should exert their financial influence to force further action. Britain's Prime Minister Theresa May leaves 10 Downing Street, London, January 24, 2018. REUTERS/Toby Melville \n“Investors can play a vital role by considering the social impact of the companies they are investing in. They can use their influence to ensure these issues are taken seriously,” she will say. \nData published last week showed social media companies had accelerated removals of online hate speech in the face of a potential European Union crackdown. \nThe British government has so far met quiet resistance from tech leaders like Facebook, Google and Twitter, and critics say ending encryption will weaken security for legitimate actions and open a back door for government snooping. \nIn December, responding to a government threat to use taxes to push firms into action, Facebook said it had invested millions of pounds in people and technology to identify and remove terrorist content. \nYouTube, which is owned by Google, said in December it was doing more every day to tackle violent extremism. \nOn Thursday, May will demand a cross-industry approach to the problem, including smaller firms. She singled out messaging service Telegram as example of how small platforms “can quickly become home to criminals and terrorists”. \n“No one wants to be known as ‘the terrorists’ platform’ or the first choice app for pedophiles,” she will say. Editing by Stephen Addison", "external_links": [], "published": "2018-01-25T00:36:00.000+02:00", "crawled": "2018-01-25T01:02:40.030+02:00", "highlightTitle": ""}