{"organizations": [], "uuid": "b60c93dd25508dfe3703e9ec875d3a6698cbe340", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-limoneira-company-announces-fourth-quarter-and-fiscal-year-2017-financial-results-and-reiterates-fiscal-year-2018-eps.html", "country": "US", "domain_rank": 767, "title": "Limoneira Company Announces Fourth Quarter and Fiscal Year 2017 Financial Results and Reiterates Fiscal Year 2018 EPS Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T00:05:00.000+02:00", "replies_count": 0, "uuid": "b60c93dd25508dfe3703e9ec875d3a6698cbe340"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-limoneira-company-announces-fourth-quarter-and-fiscal-year-2017-financial-results-and-reiterates-fiscal-year-2018-eps.html", "ord_in_thread": 0, "title": "Limoneira Company Announces Fourth Quarter and Fiscal Year 2017 Financial Results and Reiterates Fiscal Year 2018 EPS Guidance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "- Achieves Record Revenue in Fiscal Year 2017 of $121.3 Million, an increase of 9% Compared to Prior Year -\n- Generates Record Fiscal Year 2017 Operating Income of $11.9 Million an increase of 29% Compared to Prior Year –\n-New Lemon Packinghouse Packs 300,000 more Cartons at $400,000 Less Cost Compared to Prior Year-\n- Reiterates Fiscal Year 2018 EPS Guidance of $0.55-$0.65 -\nSANTA PAULA, Calif.--(BUSINESS WIRE)-- Limoneira Company (the “Company” or “Limoneira”) (NASDAQ: LMNR), a leading global agribusiness with prime agricultural land and operations, real estate and water rights in California, Arizona and Chile today reported financial results for the fourth quarter ended October 31, 2017.\nFiscal Year 2017 Fourth Quarter Results\nFor the fourth quarter of fiscal year 2017, net revenue decreased to $15.9 million compared to net revenue of $19.5 million in the fourth quarter of the previous fiscal year. Agribusiness revenue was $14.6 million, compared to $18.2 million in the fourth quarter last year, primarily due to the previously announced decrease in lemon revenues stemming from the delayed lemon harvest at its Arizona ranches that were impacted by excessive heat during the quarter and lower prices. Rental operations revenue was $1.3 million in the fourth quarter of fiscal years 2017 and 2016. There were no real estate development revenues in the fourth quarter of fiscal year 2017.\nAgribusiness revenue for the fourth quarter of fiscal year 2017 includes $12.0 million in lemon sales, compared to $16.4 million of lemon sales during the same period of fiscal year 2016, with the decrease primarily the result of the aforementioned delay in the timing of the lemon harvest as well as lower prices versus the prior year period. Approximately 414,000 cartons of fresh lemons were sold during the fourth quarter of fiscal year 2017 at a $21.01 average price per carton compared to approximately 521,000 cartons sold at a $25.91 average price per carton during the fourth quarter of fiscal year 2016. As anticipated, the Company recognized minimal avocado revenue in the fourth quarter of fiscal year 2017, similar to the same period last year. The Company recognized a similar amount of orange revenue in the fourth quarter of fiscal year 2017 at $0.6 million, as compared to the fourth quarter of fiscal year 2016. Specialty citrus and other crop revenues in the fourth quarter of fiscal year 2017 were $0.8 million higher than the fourth quarter of fiscal year 2016 primarily due to increased wine grape harvest volume.\nTotal costs and expenses for the fourth quarter of fiscal year 2017 were $20.2 million, compared to $20.4 million in the fourth quarter of last fiscal year. The fourth quarter of fiscal year 2017 decrease in operating expenses was primarily attributable to decreases in the Company’s agribusiness costs mainly due to decreased third-party grower costs partially offset by increased packing, growing and depreciation costs and expenses. In addition, lemon packing costs were $4.1 million for the fourth quarter of fiscal year 2017 compared to $4.0 million for the fourth quarter of fiscal year 2016. For the fiscal year ended October 31, 2017, approximately 3.2 million cartons of fresh lemons were packed at an average cost per carton of $6.75 compared to 2.9 million cartons of fresh lemons packed at an average cost of $7.55.\nOperating loss for the fourth quarter of fiscal year 2017 was $4.3 million, compared to a loss of $0.9 million in the fourth quarter of the previous fiscal year, with lower lemon revenues being the primary factor in the decrease. Net loss applicable to common stock, after preferred dividends, for the fourth quarter of fiscal year 2017 was $2.8 million and compares to a net loss of $0.1 million in the fourth quarter of fiscal year 2016. Net loss per diluted share for the fourth quarter of fiscal year 2017 was $0.19 compared to a net loss per diluted share of $0.01 for the same period of fiscal year 2016.\nAdjusted EBITDA was a loss of $2.5 million in the fourth quarter of fiscal year 2017 compared to earnings of $2.0 million in the same period of fiscal year 2016. A reconciliation of EBITDA and adjusted EBITDA to net income is provided at the end of this release.\nFiscal Year 2017 Results\nFor the fiscal year ended October 31, 2017, revenue was $121.3 million, compared to $111.8 million in the same period last year. Operating income for the fiscal year ended October 31, 2017 was $11.9 million, compared to $9.2 million in the same period last year. Net income applicable to common stock, after preferred dividends, was $6.0 million for the fiscal year ended October 31, 2017, compared to net income applicable to common stock of $7.4 million in the same period last year. Net income per diluted share for the fiscal year ended October 31, 2017 was $0.42, compared to net income per diluted share of $0.52 in the same period of fiscal 2016. Net income per diluted share for the fiscal year ended October 31 2017 and 2016 is based on weighted average diluted common shares outstanding of approximately 14.3 million and 14.2 million, respectively.\nAdjusted EBITDA for the fiscal year ended October 31, 2017 was $19.0 million, compared to adjusted EBITDA of $20.1 million in the same period last year. A reconciliation of EBITDA and adjusted EBITDA to net income is provided at the end of this release.\nThe results of operations for the prior year fiscal year ended October 31, 2016 include a $3.4 million gain on sale of Calavo Growers, Inc. stock, a $1.0 million gain on sale of conservation easement, and $1.2 million of transaction costs associated with entering into the real estate development joint venture with The Lewis Group of Companies.\nBalance Sheet and Liquidity\nDuring fiscal year ended October 31, 2017, net cash provided by operating activities was $18.5 million, compared to $14.3 million in the prior year. Net cash used in investing activities was $26.4 million, compared to $11.5 million in the prior year. The Company purchased Pan de Azucar for $5.7 million and contributed $7.5 million to the East Area 1 real estate development joint venture in the fiscal year ended October 31, 2017, which compares to $2.3 million contributed to the joint venture in the same period of fiscal year 2016. Net cash provided by financing activities was $8.4 million in the fiscal year ended October 31, 2017, compared to $2.8 million used in the same period last year.\nLong-term debt as of October 31, 2017 was $102.1 million, compared to $88.2 million at the end of fiscal 2016.\nReal Estate Development\nOn November 10, 2015, the Company entered into a joint venture with The Lewis Group of Companies (“Lewis”) for the residential development of its East Area I real estate development project. The first phase of the project broke ground to commence mass grading on November 8, 2017. Project plans include approximately 632 residential units in Phase 1. The Company anticipates Phase 1 site improvements will begin during the winter of this year. The lot sale process with home builders is expected to begin in the spring of 2018 and initial closings of lots sales are anticipated to begin in the first quarter of fiscal year 2019.\nLimoneira Lewis Community Builders, LLC, is a 50%/50% real estate development joint venture between Limoneira Company and Lewis that will engage in the residential development of Harvest at ", "external_links": ["http://www.businesswire.com/news/home/20180108006433/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51739557&newsitemid=20180108006433&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=3&md5=6980c110341142fa9e036987ed6e21cc", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.limoneira.com&esheet=51739557&newsitemid=20180108006433&lan=en-US&anchor=www.limoneira.com&index=1&md5=92e82533dc81eba78a8d6f0cec60c12c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.limoneira.com&esheet=51739557&newsitemid=20180108006433&lan=en-US&anchor=www.limoneira.com&index=2&md5=92db818f927d48f1d62e70228b8edf95"], "published": "2018-01-09T00:05:00.000+02:00", "crawled": "2018-01-09T09:40:29.864+02:00", "highlightTitle": ""}