{"organizations": [], "uuid": "ac74ca61db3838e4d60fa8a58c59f92dc0280c6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 67}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/05/gettyimages-590464033.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/02/what-does-mifid-stand-for/", "country": "US", "domain_rank": 1196, "title": "What Does MiFID Stand For? Here’s What You Need to Know | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.768, "site_type": "news", "published": "2018-01-02T02:00:00.000+02:00", "replies_count": 0, "uuid": "ac74ca61db3838e4d60fa8a58c59f92dc0280c6d"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/02/what-does-mifid-stand-for/", "ord_in_thread": 0, "title": "What Does MiFID Stand For? Here’s What You Need to Know | Fortune", "locations": [], "entities": {"persons": [{"name": "tolstoy", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg January 2, 2018 \nEveryone in European finance has been abuzz over an obscure acronym—MiFID II—that’s about to radically change how assets from stocks to commodities are traded and investors’ money is managed. \nBanks and asset managers across the European Union have spent more than $2 billion preparing for it. Regulators say it will protect investors, boost transparency and rebuild trust that was tarnished by the 2008 global crash. The industry has even spent months finding ways to sidestep parts of it. \nBut you’d be forgiven for not paying attention: MiFID II is a law entering into force on Jan. 3 that, according to one count, is already close to 7,000 pages in length with all its addendums. That’s five times longer than Tolstoy’s War and Peace—and vastly less readable. \nIt has taken seven years to get the second iteration of the Markets in Financial Instruments Directive into shape because of its wide scope. For starters, it alters how investment research is paid for, how trades are documented and executed, and how brokers share information, find the best prices and pay one another. \n“It’s all about casting light in areas of the market that were previously dark, transparency and ultimately treating the investor at all times in a fair manner,” said Ronan Brennan, Dublin-based chief product officer at Compliance Solutions Strategies, which is working with firms to help them meet MiFID’s many demands. Here’s a look at what MiFID II will mean for European finance. 1) What’s all the fuss about changes to research? \nFund managers now have to pay for the research they use. They can no longer call up their favorite analyst for free for the lowdown on what stocks are hot or how the latest twist in Brexit negotiations will affect their portfolios. They may not even be able to access the hundreds of research reports that have long inundated their email inboxes daily unless they intend to pay. \nThat’s because MiFID II forces investment banks to charge separately for research and brokerage services to avoid conflicts of interest. Up to now, the cost of research was built into the fees that the likes of Goldman Sachs or Morgan Stanley get paid to execute trades. That worried regulators because it opened the way for commissions to go to banks that offered the best tips and access, rather than the best prices for putting through a client’s trades. \nAs fund managers get more choosy, it’s widely expected the prices being quoted for access to research will drop in 2018, and some analysts could lose their jobs. 2) How will MiFID make stock markets more transparent? \nMiFID II clamps down on so-called dark pools. Unlike public, or “lit” markets, such as the London Stock Exchange, dark pools are private markets that allow investors to buy and sell large blocks of shares without revealing beforehand the size of the orders or the price they paid. \nEven regulators acknowledge that they serve an important market function. Say a fund manager were to take a huge order for a stock, like two million shares, to a public exchange. On seeing the order, high-frequency traders, who use algorithms to spot block orders, could trade against them almost instantly. \nBut stock exchanges have complained for years that too much trading takes place on dark pools, depriving investors of the best prices and them of juicy trading fees. So MiFID II imposes limits: only 8 percent of volume in any stock can change hands this way. 3) Will the industry keep trading in the dark anyway? \nThe short answer: yes. There are two key ways trading will still take place beyond the public gaze for orders that are too small for dark pools but too big to risk placing on a stock exchange: \nThe most contentious is called a systematic internalizer. It’s the new name that banks and trading firms will go by when they fill their clients’ buy or sell orders directly using their own capital. Public exchanges and some other trading venues will also hold periodic auctions which hide the order size for a stock until sufficient volume has been accumulated to trigger a sale. \n“We are likely to see a distinct drop in dark trading once the caps are in force,” said Anish Puaar, European market structure analyst at Rosenblatt Securities. “Ultimately most of the trading will move to periodic auctions and eventually systematic internalizers. Some volume may shift to the SIs on day one, but many buy-side firms are still getting to grips with how they work.” 4) How does MiFID II subject traders to greater surveillance? \nRegulators want to be able to spot risks early and quickly reconstruct events when something suspicious happens, so MiFID II will force the investment community to keep tabs of almost everything. Here’s a sampling: \nInstitutions must report information about most trades immediately, including price and volume Traders of European Union securities must hand over personal identification, such as passport numbers, to every venue they trade on Brokers need to synchronize their clocks and time-stamp all trades Bond traders—for the first time—need to tell the market about deals they’ve done within 15 minutes of them taking place Brokers and investment managers will have to record all conversations related to a deal and store them for at least five years. 5) What’s in store for Jan. 3—and 2018? \nImplementing the technology needed to comply with MiFID II has some in the industry likening Jan. 3 to Jan. 1, 2000—or Y2K—when many feared the transition into the new century would create havoc on computer systems around the world. \nWhether there are IT malfunctions or not, trading volumes are projected to drop across Europe in January as everyone adjusts to the new MiFID world. Given the enormity of the changes, regulators aren’t likely to slap fines on companies for failing to be in full compliance, at least not at first. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-02T02:00:00.000+02:00", "crawled": "2018-01-03T08:30:19.001+02:00", "highlightTitle": ""}