{"organizations": [], "uuid": "e2991d59b2112c02798bb290ec9f7d3428505b48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/europe-electricity/europe-power-prompt-prices-fall-on-weather-but-remaining-winter-prices-rise-idUSL8N1P62Q5", "country": "US", "domain_rank": 408, "title": "EUROPE POWER-Prompt prices fall on weather but remaining winter prices rise", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-11T19:11:00.000+02:00", "replies_count": 0, "uuid": "e2991d59b2112c02798bb290ec9f7d3428505b48"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/europe-electricity/europe-power-prompt-prices-fall-on-weather-but-remaining-winter-prices-rise-idUSL8N1P62Q5", "ord_in_thread": 0, "title": "EUROPE POWER-Prompt prices fall on weather but remaining winter prices rise", "locations": [], "entities": {"persons": [], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "gw", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT, Jan 11 (Reuters) - European OTC day-ahead power sagged on Thursday on predictions for warmer weather and more wind supply near term, but most positions further ahead posted gains.\n* “There are a few question marks over medium-term demand and that’s why the prices for coming weeks and the remaining winter months are up, just in case,” one trader said.\n* Temperatures will turn lower next week and should this usher in a cooler trend for the remainder of the winter, it would be bullish, traders say. But weather reports have not taken a strong line for either cooler or milder weather.\n* The German baseload electricity contract for Friday delivery lost 8.7 percent to 43.15 euros ($51.55) a megawatt-hour (MWh).\n* The equivalent French contract was down 5 percent at 45 euros/MWh.\n* Wind power generation in Germany under one Thomson Reuters data scenario was seen rising to 5 gigawatts (GW) on Friday from an expected 2 GW on Thursday.\n* Temperatures are due to edge up to Friday but decline thereafter.\n* They may fall to 1.7 degrees Celsius on average next week in Germany from 3.1 degrees forecast for Friday. In France, the average could be 6.4 degrees, down from possibly 7 degrees on Friday.\n* French nuclear availability remains at a comfortable 93 percent of capacity.\n* Along the more distant curve, Germany’s Cal ‘19 baseload delivery hovered around an unchanged level after hitting a four-week low the previous session, driven by global coal price losses.\n* The German Cal’ 19 power contract traded at a steady 35.8 euros around midday.\n* The equivalent French year-ahead contract was untraded after a close at 41.1 euros\n* Cif Europe coal for 2019 also did not change hands after falling nearly 2 percent in the previous session which closed at $84.75 a tonne.\n* December 2018 expiry carbon emissions permits were level with their last close at 7.89 euros a tonne.\n* Among other related fuels, oil reversed some earlier losses and UK gas posted gains on cold forecasts and plans for cuts at the Dutch Groningen field.\n* In eastern Europe, the Czech day-ahead power contract was untraded, having closed at 45.31 euros on Wednesday. The Czech year-ahead contract was down 15 cents at 36.85 euros. ($1 = 0.8371 euros)\nFor Thomson Reuters' morning report and fundamental data please click here (Reporting by Vera Eckert; Editing by Susan Fenton and Edmund Blair)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://emea1.apps.cp.extranet.thomsonreuters.biz:443/cms/?pageid=pwr-conteu-ana-da-ac-mcom&landing=true"], "published": "2018-01-11T19:11:00.000+02:00", "crawled": "2018-01-12T18:41:40.005+02:00", "highlightTitle": ""}