{"organizations": [], "uuid": "a77edaba7022526b805e802508f21658b630d4b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/01/103910139-JennyBlake1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2017/12/29/former-google-career-coach-shares-ways-to-ace-your-first-week-at-work.html", "country": "US", "domain_rank": 767, "title": "Former Google career coach shares ways to ace your first week at work", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-01T19:01:00.000+02:00", "replies_count": 0, "uuid": "a77edaba7022526b805e802508f21658b630d4b4"}, "author": "Marguerite Ward", "url": "https://www.cnbc.com/2017/12/29/former-google-career-coach-shares-ways-to-ace-your-first-week-at-work.html", "ord_in_thread": 0, "title": "Former Google career coach shares ways to ace your first week at work", "locations": [], "entities": {"persons": [{"name": "jenny blake", "sentiment": "none"}, {"name": "blake", "sentiment": "none"}, {"name": "mark hanauer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images SHARES \nStarting a new job can feel overwhelming. You're surrounded by new people in a new office and have lots of new procedures to learn. \nBut acclimating yourself to a new environment and being successful from the outset doesn't have to involve a lot of anxiety, according to Jenny Blake , career coach and business strategist who co-founded Google's career mentorship program while working at the search giant. \nBlake, who also wrote the career guide book \" Pivot: The Only Move That Matters Is Your Next One ,\" says that doing three things at the start of a new job can help you be more successful. Source: Mark Hanauer Former Google career coach Jenny Blake shares her best advice in \"Pivot.\" 1. Learn what's important to your manager \n\"Talk to your manager about what success looks like in your new role,\" Blake tells CNBC Make It . \nYour first check in should make sure you and your boss are on the same page about what's expected of you in the short term and the long term. Having this meeting is also a great way to establish a solid relationship from the beginning. \n\"What would she or he like to see you doing in the next three months, six months, and one year?\" Blake says. \"What kind of impact would she or he like you to have on the team and the broader organization?\" 2. Create an onboarding plan \nNext, get a sense of what priorities your boss has in terms of new programs or technology you need to learn, projects you'll be working on and teams you'll be collaborating with, Blake suggests. \nIf you have questions, don't be afraid to ask, especially when it comes to tools and procedures you'll be using to do your job. It's always better to be clear on something than make a mistake. zoranm/Getty Images \nBring a notebook so you don't miss any important notes. And if you walk out with a bunch of deadlines, put them in your calendar and automate reminders for yourself so you stay organized. 3. Get to know your co-workers \nWhile you'll have a lot of work to do in the first few days, don't forget to make time to meet your colleagues. Ask a few co-workers out to lunch, coffee or even a simple \"walk and talk,\" Blake suggests. These quick meetings will help you feel more comfortable in your new space. Willie B. Thomas New Harvard University research examined over 300 online and in-person conversations. \nBlake suggests asking a few questions in particular, such as, \"What did you wish you knew when you started at the company?\" and \"What advice do you have for me as I get up to speed?\" \nBe sure to also get to know them by asking them about their role, their career history and what they're excited about at work. These quick meetings can lead to valuable career connections that not only help you in your new role, but potentially throughout your career. ", "external_links": [], "published": "2018-01-01T19:01:00.000+02:00", "crawled": "2018-01-01T19:03:28.002+02:00", "highlightTitle": ""}