{"organizations": [], "uuid": "f7d91febc4c9d0d77545e26f0e00540642514eb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220537491&w=1200&r=LYNXMPEE080VM", "site_section": "http://feeds.reuters.com/reuters/sportsNews/", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-fski-holmlund/swedes-inspired-by-injured-holmlunds-recovery-idUSKBN1EY1H0", "country": "US", "domain_rank": 408, "title": "Swedes inspired by injured Holmlund's recovery", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:05:00.000+02:00", "replies_count": 0, "uuid": "f7d91febc4c9d0d77545e26f0e00540642514eb3"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-fski-holmlund/swedes-inspired-by-injured-holmlunds-recovery-idUSKBN1EY1H0", "ord_in_thread": 0, "title": "Swedes inspired by injured Holmlund's recovery", "locations": [], "entities": {"persons": [{"name": "holmlund", "sentiment": "negative"}, {"name": "anna holmlund", "sentiment": "none"}, {"name": "o'connor", "sentiment": "none"}, {"name": "idrottsgalan", "sentiment": "none"}, {"name": "victor ohling norberg", "sentiment": "none"}, {"name": "batelson", "sentiment": "none"}, {"name": "joar batelson", "sentiment": "none"}], "locations": [{"name": "innichen", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "min read  stockholm", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 07   Swedes inspired by injured Holmlund's recovery Philip O'Connor 3 Min Read \nSTOCKHOLM (Reuters) - Having once hoped to travel alongside ski cross racer Anna Holmlund to Pyeongchang for the Winter Games, her Swedish team mates have instead found inspiration in her remarkable recovery from life-threatening injuries sustained in a training crash. \nThe accident occurred on a training run in Innichen, northern Italy on Dec. 19 2016. She was flown home and kept in a medically-induced coma for several months, with Sweden ski cross director Joar Batelson revealing in May that she was conscious and communicating again in May last year. \nHolmlund is now back on her feet and taking her first careful steps in a remarkable recovery that few thought possible. She hopes to attend Idrottsgalan, Sweden’s sporting awards dinner, in the middle of January together with her boyfriend and fellow ski race Victor Ohling Norberg. \n“In our eyes, who feared the worst, she has made fantastic steps forward,” Batelson told reporters recently as the team returned to Innichen for a competition in December. \nHaving made its Olympic debut at the 2010 Games in Vancouver, the hair-raising sport of ski cross has fast become popular with viewers around the world. \nCompetitors race against one another through a course featuring man-made and natural jumps and turns at high speeds, and while intentional contact with others is banned, crashes are not uncommon. FILE PHOTO: Anna Holmlund (C) of Sweden leads Kelsey Serwa (R) of Canada and Katrin Mueller of Switzerland in the ladies qualifying round during the at the World Cup Ski Cross race in Nakiska, Alberta, December 8, 2012. REUTERS/Todd Korol/File Photo \nFew, however, result in the kind of serious head injuries that left Holmlund, who won Olympic bronze in Sochi, fighting for her life. \nCross-country skier Charlotte Kalla, who won gold for Sweden with a stunning last leg in the women’s 4x5km relay, paid an emotional tribute to Holmlund as the two opened a ski centre together in December. FILE PHOTO: Sweden's Henrik Harlaut crashes during the men's freestyle skiing slopestyle qualification round at the 2014 Sochi Winter Olympic Games in Rosa Khutor February 13, 2014. REUTERS/Mike Blake/File Photo \n“Anna, you are a fighter, your fighting spirit to come back after the accident gives us perspective on life,” she told Holmlund in front of an audience of hundreds of locals in Alnoe, close to where Holmlund now lives in Sundsvall. \n“Your will and attitude have made a strong impression on me. Let your fire be an inspiration to us all - nothing is given, life is what you make it, in good times and in bad.” \nWhile Kalla heads off to chase more gold in Pyeongchang, Holmlund will stay at home to continue her recovery. \n“Anna is always happy, when I arrive now it’s to a very happy girl, the same old Anna,” her father Lars told Swedish radio. \n“It’s better and better, but there’s a long way to go.” Editing by Peter Rutherford", "external_links": [], "published": "2018-01-09T15:05:00.000+02:00", "crawled": "2018-01-09T15:22:27.060+02:00", "highlightTitle": ""}