{"organizations": [], "uuid": "00b9e090b13df7c5c315f3f33f0533beb4b3d644", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221073010&w=1200&r=LYNXMPEE0A0I1", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/germany-politics/german-spd-leader-says-still-big-hurdles-to-clear-in-coalition-talks-idINKBN1F00UM", "country": "US", "domain_rank": 408, "title": "German SPD leader says still 'big hurdles' to clear in coalition talks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T10:37:00.000+02:00", "replies_count": 0, "uuid": "00b9e090b13df7c5c315f3f33f0533beb4b3d644"}, "author": "", "url": "https://in.reuters.com/article/germany-politics/german-spd-leader-says-still-big-hurdles-to-clear-in-coalition-talks-idINKBN1F00UM", "ord_in_thread": 0, "title": "German SPD leader says still 'big hurdles' to clear in coalition talks", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "madeline chambers", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}, {"name": "michelle martin", "sentiment": "none"}, {"name": "schulz", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "spd", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "social democratic party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 8:41 AM / in 3 hours Merkel asked to show 'vision' in crunch German coalition talks Andreas Rinke 4 Min Read \nBERLIN (Reuters) - German Chancellor Angela Merkel said her conservatives still had high hurdles to clear in Thursday’s talks on forming a coalition with the Social Democrats (SPD), who are pressing for accelerated integration of European Union states. Acting German Chancellor Angela Merkel arrives for exploratory talks about forming a new coalition government at the SPD headquarters in Berlin, Germany, January 11, 2018. REUTERS/Hannibal Hanschke \nMerkel, weakened by an election setback in September, turned to the left-leaning SPD to seek a re-run of their so-called “grand coalition” after the collapse in November of talks on a three-way coalition with two smaller parties untested at national level. \nThe chancellor, who commands wide respect abroad after more than 12 years in power, needs coalition talks to succeed to avoid further erosion of her personal authority and Germany’s international influence, not least in the EU. \nAt the start of the final day of exploratory talks that could lead to formal negotiations, Merkel said it would be an arduous day but she recognised that Germans expected results. \n“Of course we also have in mind that we have to create a good policy platform for our country. So it’s going to be a tough day,” she said. \nThe political uncertainty is at odds with Germany’s flourishing economy, whose growth hit a six-year high in 2017, helping deliver a record 38.4-billion-euro ($46.20 billion) public sector surplus. \nThat spurred calls for Merkel, the ultimate pragmatist, to use the windfall to unveil a vision for Germany’s future. \n“What is your plan for Germany?” the mass-market Bild newspaper asked. “Fact is: the money is there for it,” it added, suggesting she restructure healthcare, promote public order or outline new targets for tackling climate change. \nGerman business echoed that call, with the DIHK Chambers of Industry and Commerce suggesting she use the fiscal windfall to simplify bureaucracy and others pushing for tax cuts. \nBut SPD leader Martin Schulz, a former president of the European Parliament, is pursuing a very different vision, calling for the creation of a United States of Europe by 2025 - seen as an expensive distraction by many conservatives. Acting German Chancellor Angela Merkel arrives for exploratory talks about forming a new coalition government at the SPD headquarters in Berlin, Germany, January 11, 2018. REUTERS/Hannibal Hanschke \n“On the last day of exploratory talks we will make clear that above all this must be a new start for the European Union,” he told reporters. “If we join a government it will be on the condition that it makes Europe strong.” \nShould the parties fail to reach a deal on Thursday they could extend the talks, though President Frank-Walter Steinmeier is eager for an agreement, keenly aware that businesses want a stable coalition to end uncertainty and avoid another vote. SPD HURDLE \nIn signs of incremental progress in the talks, negotiators agreed to reduce the use of the weed killer glyphosate, draft plans seen by Reuters showed. Social Democratic Party (SPD) leader Martin Schulz arrives for exploratory talks about forming a new coalition government at the SPD headquarters in Berlin, Germany, January 11, 2018. REUTERS/Hannibal Hanschke \nSPD Secretary General Lars Klingbeil told party members in a video message the party was striving for improvements in labour, health, education and family policy, and on Europe. \nMerkel has ruled with the SPD in a sometimes unwieldy “grand coalition” - or ‘GroKo’, the German-language acronym - in two of her three previous terms in office, including in the last parliament from 2013-2017. \nBut both parties bled support in the Sept. 24 election, which saw the far-right Alternative for Germany (AfD) enter the Bundestag lower house of parliament for the first time. \nMany SPD rank-and-file fear a repeat grand coalition would further diminish the identity of the party, which suffered its worst result in September’s vote since the modern Federal Republic was founded in 1949. \nKevin Kuehnert, head of the Jusos youth branch of the SPD, said he planned a ‘NoGroKo’ tour of Germany to persuade party delegates to vote against the grand coalition. \nShould the two biggest party groups fail to agree on moving ahead, Merkel, albeit reluctantly, could try to form a minority government or accept new elections. \n($1 = 0.8311 euros) Additional reporting by Michelle Martin and Madeline Chambers; Writing by Paul Carrel and Thomas Escritt; editing by Ralph Boulton", "external_links": [], "published": "2018-01-11T10:37:00.000+02:00", "crawled": "2018-01-11T10:50:17.000+02:00", "highlightTitle": ""}