{"organizations": [], "uuid": "3d7347e2cf3cc3de8b8bc0bc8ff397be00596320", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/10/gettyimages-857076604.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/north-carolina-gerrymandering-other-states-congressional-districts-redrawn/", "country": "US", "domain_rank": 1196, "title": "After NC, What Other States Could See Their Districts Redrawn? | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.198, "site_type": "news", "published": "2018-01-10T12:34:00.000+02:00", "replies_count": 0, "uuid": "3d7347e2cf3cc3de8b8bc0bc8ff397be00596320"}, "author": "Chris Morris", "url": "http://fortune.com/2018/01/10/north-carolina-gerrymandering-other-states-congressional-districts-redrawn/", "ord_in_thread": 0, "title": "After NC, What Other States Could See Their Districts Redrawn? | Fortune", "locations": [], "entities": {"persons": [{"name": "chris morris", "sentiment": "negative"}], "locations": [{"name": "north carolina", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "general assembly", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Chris Morris 10:34 AM EST \nTuesday’s ruling by federal judges that North Carolina’s congressional district map must be redrawn could have significant implications on the 2018 election. But the fight over gerrymandering around the country is far from over. \nA three-judge panel rejected the map drawn by the state’s Republican-controlled General Assembly, saying it violates the Equal Protection Clause, the First Amendment, and Article I of the Constitution. The panel gave authorities three weeks to put together a new plan. \nNorth Carolina is hardly the only state accused of gerrymandering, though. Here are a few others that could see legal fights in the not-too-distant future: \nMaryland – Some analysis of Maryland’s districts show it’s just as gerrymandered as North Carolina. In this case, it’s Democrats, not Republicans, accused of making things work in their favor, having redrawn districts in 2012. The Supreme Court is expected to hear arguments about the redistricting later this year. \nPennsylvania – Pennsylvania’s 7th district has been ranked as one of the 10 most gerrymandered in the country. A federal trial about the state’s district map began last month , with one expert testifying that randomly drawn computer maps would be more fair. Two other separate cases are pending in the state. \nTexas – While Texas is unquestionably a Republican stronghold, its 33rd district is considered one of the worst cases of gerrymandering in the country. Stretching from southwestern Dallas to the northern suburbs of Fort Worth, the area is 67% Hispanic and 16% black. Critics argue the districting limits the input of those groups. Legal cases are also looming here, with a three-judge panel ruling last year that several districts needed to be redrawn. That ruling is currently being appealed. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-10T12:34:00.000+02:00", "crawled": "2018-01-10T20:48:24.009+02:00", "highlightTitle": ""}