{"organizations": [], "uuid": "57aa2f0b36eeff735cad89ba44d404dc9e785bd3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/Euro-GoogleNews", "section_title": "EURO - Google News", "url": "https://www.reuters.com/article/usa-bonds/treasuries-yields-for-most-maturities-rise-track-euro-zone-bonds-idUSL2N1PK0WK", "country": "US", "domain_rank": 408, "title": "TREASURIES-Yields for most maturities rise, track euro zone bonds - Reuters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:59:00.000+02:00", "replies_count": 0, "uuid": "57aa2f0b36eeff735cad89ba44d404dc9e785bd3"}, "author": "", "url": "https://www.reuters.com/article/usa-bonds/treasuries-yields-for-most-maturities-rise-track-euro-zone-bonds-idUSL2N1PK0WK", "ord_in_thread": 0, "title": "TREASURIES-Yields for most maturities rise, track euro zone bonds - Reuters", "locations": [], "entities": {"persons": [{"name": "gertrude chavez-dreyfuss", "sentiment": "none"}, {"name": "mario draghi", "sentiment": "none"}, {"name": "draghi", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "treasuries", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 3:55 PM / Updated 5 hours ago TREASURIES-Yields for most maturities rise, track euro zone bonds Reuters Staff 5 Min Read * ECB's Draghi says euro zone inflation to rise in medium term * German bond yields climb, Treasuries follow * Treasury to auction 7-year notes (Adds comment, U.S. data, byline, table; updates prices in text) By Gertrude Chavez-Dreyfuss NEW YORK, Jan 25 (Reuters) - U.S. Treasury debt yields for most maturities rose from earlier lows on Thursday in line with gains in those of euro zone bonds after European Central Bank President Mario Draghi cited the region's \"solid and broad\" growth and said inflation was likely to rise in the medium term. The yield on 10-year German government bonds, the benchmark for the bloc, hit a six-month high at 0.579 percent following Draghi's remarks. In a press briefing after the ECB kept interest rates unchanged, Draghi said underlying inflation in the euro zone is expected to rise gradually over the medium term supported by the bank's monetary policy measures as well the economy's continued expansion. \"We're purely trading off Europe,\" said Tom di Galoma, managing director at Seaport Global in New York. \"European government bonds had a big reversal here after Draghi's comments that were a bit hawkish.\" In mid-morning trading, benchmark U.S. 10-year note yields rose to 2.659 percent, after earlier falls, and up from Wednesday's 2.654 percent. U.S. 30-year bond yields, however, were lower on the day, at 2.919 percent, down from 2.937 percent late on Wednesday. The yield on this maturity touched a 3-1/2-month peak in the previous session. U.S. 2-year yields, meanwhile, were up at 2.096 percent , from Wednesday's 2.084 percent. Thursday's U.S. economic data was mixed, with U.S. jobless claims rising less than expected to a seasonally-adjusted 233,000, for the week ended Jan. 20. U.S. new home sales, on the other hand, dropped 9.3 percent in December, their largest fall in nearly 1-1/2 years. Both reports though had little immediate impact on Treasuries, as the data, particularly new home sales, have done little to change expectations that the Federal Reserve will raise rates in March. Also on Thursday, the U.S. Treasury will auction $28 bln in 7-year notes. Aaron Kohli, rates strategist at BMO Capital Markets in New York, expects the seven-year rate to come slightly higher than the expected level at the bid deadline, suggesting a little more tepid demand than usual for this type of maturity. \"Seasonality of foreign buying has not been a big boost for January auctions,\" Kohli said. He noted that of the past five January auctions, foreign buying has averaged 16.6 percent, notably less than the historical average since 2009 of 20.4 percent. That said, Kohli pointed out that Japanese flows recently have been positive, with yield spreads between U.S. and foreign debt generally wide, suggesting there could be demand after all. January 25 Thursday 10:41AM New York / 1541 GMT Price US T BONDS MAR8 148-23/32 0-8/32 10YR TNotes MAR8 122-28/256 -0-24/25 6 Price Current Net Yield % Change (bps) Three-month bills 1.4025 1.427 -0.013 Six-month bills 1.6 1.6354 0.002 Two-year note 99-208/256 2.0962 0.012 Three-year note 99-98/256 2.2158 0.011 Five-year note 99-160/256 2.4552 0.013 Seven-year note 97-216/256 2.5919 0.013 10-year note 96-124/256 2.6596 0.006 30-year bond 96-164/256 2.9194 -0.018 DOLLAR SWAP SPREADS Last (bps) Net Change (bps) U.S. 2-year dollar swap 18.75 1.00 spread U.S. 3-year dollar swap 19.50 1.00 spread U.S. 5-year dollar swap 7.50 0.50 spread U.S. 10-year dollar swap 3.00 0.50 spread U.S. 30-year dollar swap -13.25 1.25 spread (Reporting by Gertrude Chavez-Dreyfuss; Editing by Frances Kerry and Susan Thomas)", "external_links": [], "published": "2018-01-25T17:59:00.000+02:00", "crawled": "2018-01-25T22:48:40.003+02:00", "highlightTitle": ""}