{"organizations": [], "uuid": "c3af582d58562ba75c129d2b689e7644d5e3353f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222799659&w=1200&r=LYNXMPEE0G1HP", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/apple-tax/apple-to-pay-38-billion-in-u-s-taxes-on-foreign-cash-open-new-campus-idINKBN1F62H0", "country": "US", "domain_rank": 408, "title": "Apple to pay $38 billion in U.S. taxes on foreign cash, open new campus", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T20:35:00.000+02:00", "replies_count": 0, "uuid": "c3af582d58562ba75c129d2b689e7644d5e3353f"}, "author": "", "url": "https://in.reuters.com/article/apple-tax/apple-to-pay-38-billion-in-u-s-taxes-on-foreign-cash-open-new-campus-idINKBN1F62H0", "ord_in_thread": 0, "title": "Apple to pay $38 billion in U.S. taxes on foreign cash, open new campus", "locations": [], "entities": {"persons": [{"name": "stephen nellis 2 min read", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "reno", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 6:35 PM / Updated 17 minutes ago Apple plans second U.S. campus, to pay $38 billion in foreign cash taxes Stephen Nellis 4 Min Read \n(Reuters) - Apple Inc ( AAPL.O ) will open a second U.S. campus as part of a 5-year, $30 billion U.S. investment plan and will make about $38 billion in one-time tax payments on its overseas cash, one of the largest corporate spending plans announced since the passage of a tax cut signed by U.S. President Donald Trump. \nBetween the spending plan, tax payments and business with U.S. based suppliers, Apple on Wednesday estimated it would spend $350 billion in the U.S. over the next five years. \nApple, however, did not say how much of its $252.3 billion in cash abroad, the largest of any U.S. corporation, it would bring to the United States, after the U.S. tax changes cut costs on bringing funds back from overseas. It also did not say whether the spending plan was driven by the new tax law. Apple has traditionally declined to publicly announce its spending plans. \nThe iPhone maker, whose products are mostly made in Asian factories, said it plans a wave of investing and hiring in the United States and will create 20,000 jobs through hiring at its existing campus and the new one. It will announce the location later this year. \nAbout a third of the new spending will be on data centres to house its iCloud, App Store and Apple Music services, a sign of the rising importance of subscription services to a company known for its computers and gadgets. The company has data centres in seven states and also on Wednesday broke ground on an expansion of its operations in Reno, Nevada, where local officials granted it tax breaks on a downtown warehouse. \nThe U.S spending would be a significant part of Apple’s overall capital expenditures. Globally, the company spent $14.9 billion in 2017 and expects to spend $16 billion in 2018, figures that include both U.S.-based investments in data centres and other projects and Asian investments in tooling for its contract manufacturers. \nIf Apple’s overall capital expenditures continue to expand at the same rate expected this year, the $30 billion investment in the U.S. could represent about a third of its capital expenditures over the next five years. An Apple logo is seen in a store in Los Angeles, California, U.S., March 24, 2017. REUTERS/Lucy Nicholson \nThe announced tax payment was roughly in line with expectations, said Cross Research analyst Shannon Cross. The tax bill requires companies to pay a one-time tax on foreign-held earnings whether they intend to bring them back to the United States or not. \nApple had set aside $36.3 billion in anticipation of tax payments on its foreign cash, meaning the payment would not represent a major impact on its cash flow this quarter. \nApple also said it would boost its advanced manufacturing fund, which it uses to provide capital and support to suppliers such as Finisar Corp ( FNSR.O ) and Corning Inc ( GLW.N ), from $1 billion to $5 billion. Apple said it plans to spend $55 billion with U.S.-based suppliers in 2018, up from $50 billion last year. AMAZON VS APPLE \nApple joins Amazon.com Inc ( AMZN.O ) in scouting for a location for a second campus. Amazon finished taking applications from cities in October for its second campus. Apple has not said whether it has settled on a second campus location yet. \nCurrently, Apple’s largest U.S. operations are in Cupertino, California, at its new “spaceship” Apple Park headquarters, followed by a facility in Austin, Texas where it houses customer service agents and where contract manufacturers assemble some Mac computers. The company also employs several thousand workers and contractors in Elk Grove, California, where it has customer service agents and refurbishes iPhones. \nApple also has built its own data centres in North Carolina, Oregon, Nevada, Arizona and a recently announced project in Iowa and leases data centre space in other states. Related Coverage", "external_links": [], "published": "2018-01-17T20:35:00.000+02:00", "crawled": "2018-01-17T21:11:09.009+02:00", "highlightTitle": ""}