{"organizations": [], "uuid": "eedcd8a9c8f9e47a2a9bf950ac9ffe5b3541b236", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/03/the-associated-press-new-mexico-moves-up-in-oil-and-gas-rankings.html", "country": "US", "domain_rank": 767, "title": "New Mexico moves up in oil and gas rankings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T20:29:00.000+02:00", "replies_count": 0, "uuid": "eedcd8a9c8f9e47a2a9bf950ac9ffe5b3541b236"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/03/the-associated-press-new-mexico-moves-up-in-oil-and-gas-rankings.html", "ord_in_thread": 0, "title": "New Mexico moves up in oil and gas rankings", "locations": [], "entities": {"persons": [{"name": "ryan flynn", "sentiment": "none"}, {"name": "flynn", "sentiment": "none"}], "locations": [{"name": "new mexico", "sentiment": "none"}, {"name": "n.m.", "sentiment": "none"}, {"name": "albuquerque", "sentiment": "none"}, {"name": "permian basin", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "permian", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "north dakota", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "u.s. energy information agency", "sentiment": "none"}, {"name": "new mexico oil and gas association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALBUQUERQUE, N.M. (AP) — Thanks to more barrels of oil being pumped monthly from the Permian Basin, New Mexico is among the nation's top producing states.\nIndustry officials in New Mexico on Wednesday celebrated the latest figures released by the U.S. Energy Information Agency, saying billions of dollars of investment by energy companies in the state over the past year is paying off as production is reaching record highs.\nThe figures show monthly production hitting more than 16.3 million barrels of oil in New Mexico in late 2017, and experts say the state is on pace to set an annual production record for the year. Those figures have yet to be released.\nNew Mexico surpassed Oklahoma and California in September and October to become the third-largest producer in the U.S., said Ryan Flynn, executive director of the New Mexico Oil and Gas Association. Texas and North Dakota top the list.\n\"We saw a surge of investment in the Permian basin, and that was really a precursor,\" Flynn said. \"When people are making those types of acquisitions, they aren't going to just sit on those investments. They are going to make sure they're able to turn those investments around and start getting returns.\"\nThe result, Flynn said, is that the production boom is funneling more revenue into the state's coffers, which will ease pressure on lawmakers as they set spending priorities for education and other government programs during the upcoming legislative session. Early projections by state economists indicate that income for the next fiscal year will surpass current spending by nearly $200 million thanks to surging tax revenues and a rebound in oil and gas sectors.\nOverall, U.S. crude oil production increased in 2017 to over 9 million barrels a day based on data through September and estimates for the remainder of the year. Federal energy analysts say the increase was driven especially by activity in the Permian Basin, which straddles the Texas-New Mexico border.\nAnalysts are expecting U.S. production to increase by an average of 800,000 barrels per day in 2018.\nIn the heart of New Mexico's oil and gas country, the community of Hobbs has seen an influx of families as the industry stabilized following a downturn a couple of years ago that saw prices plummet. Enrollment in public schools has now surpassed the high mark that was initially set in 2015, Mayor Sam Cobb said.\nCobb and other business and political leaders from the region have had conversations with top exploration and production companies as well as midstream companies that operate pipelines and processing facilities.\n\"They see southeastern New Mexico as being a long-term play for them and they are looking at substantial capital investments — not only this year, but in the years to come — so I think it's a good sign of sustainability not only for our area but it's going to be good for the state.\"", "external_links": [], "published": "2018-01-03T20:29:00.000+02:00", "crawled": "2018-01-04T01:08:33.002+02:00", "highlightTitle": ""}