{"organizations": [], "uuid": "f4cb855d86700804b7bb0652d2e8a90c2e607411", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-owens-realty-mortgage-inc-announces-repurchase-and-settlement-agreement-with-freestone-capital-management.html", "country": "US", "domain_rank": 767, "title": "Owens Realty Mortgage, Inc. Announces Repurchase and Settlement Agreement with Freestone Capital Management", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-04T00:05:00.000+02:00", "replies_count": 0, "uuid": "f4cb855d86700804b7bb0652d2e8a90c2e607411"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-owens-realty-mortgage-inc-announces-repurchase-and-settlement-agreement-with-freestone-capital-management.html", "ord_in_thread": 0, "title": "Owens Realty Mortgage, Inc. Announces Repurchase and Settlement Agreement with Freestone Capital Management", "locations": [], "entities": {"persons": [{"name": "bryan h. draper", "sentiment": "none"}, {"name": "freestone", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "walnut creek", "sentiment": "none"}, {"name": "freestone", "sentiment": "none"}], "organizations": [{"name": "freestone capital management", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "owens realty mortgage, inc.", "sentiment": "neutral"}, {"name": "owens realty mortgage, inc", "sentiment": "neutral"}, {"name": "llc", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "owens realty mortgage", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALNUT CREEK, Calif., Jan. 3, 2018 /PRNewswire/ -- Owens Realty Mortgage, Inc. (NYSE American: ORM) (the \"Company\") today announced that it has entered into an agreement with Freestone Capital Management, LLC and certain of its affiliates (collectively, \"Freestone\") to repurchase the 810,937 shares of the Company's common stock beneficially owned by Freestone. The Company agreed to repurchase the shares for $19.25 per share in a private, accretive transaction representing more than a 10% discount to the $22.12 per share GAAP book value of the Company's common stock as of September 30, 2017.\nThe aggregate purchase price was $15,610,537.25, approximately $4.1 million of which was paid with the remaining balance of the Company's $10 million stock repurchase plan previously announced on June 13, 2017. As a result of the shares already repurchased in the open market and the repurchase from Freestone, the Company's repurchase plan, which had been set to expire on January 15, 2018, has been terminated.\nBryan H. Draper, President and Chief Executive Officer of Owens Realty Mortgage, said, \"We are pleased to have reached this agreement, which will allow us to continue to prudently execute the business strategy of liquidating our real estate assets and investing the proceeds into commercial real estate loans in order to maximize value for our stockholders.\"\nThe repurchase represents a reduction of approximately 8 percent of the 10,041,938 shares outstanding on November 3, 2017, as reported in the Company's most recently filed Form 10-Q. As of December 29, 2017, the Company has repurchased approximately $31.5 million of its stock, not including commissions and fees, representing approximately 1,961,000 shares or 17.5 percent of the shares outstanding on May 20, 2013, at an average price of $16.06 per share.\nAs previously disclosed, the Board's Compensation Committee continues to analyze and evaluate a range of strategic options related to its external management structure, including amending the existing management agreement or internalizing the management function. While this review continues, the Company has negotiated a reduction of its management fee, effective as of July 2017.\nPremierCounsel LLP and Vinson & Elkins L.L.P. are representing Owens Realty Mortgage, Inc.\nAbout Owens Realty Mortgage, Inc.\nOwens Realty Mortgage, Inc., a Maryland corporation, is a specialty finance mortgage company organized to qualify as a real estate investment trust (\"REIT\") that focuses on the origination, investment, and management of commercial real estate mortgage loans. We provide customized, short-term acquisition and transition capital to small balance and middle-market investors that require speed and flexibility. Our primary objective is to provide investors with attractive current income and long-term shareholder value. Owens Realty Mortgage, Inc., is headquartered in Walnut Creek, California, and is externally managed and advised by Owens Financial Group, Inc.\nAdditional information can be found on the Company's website at www.owensmortgage.com .\nForward-Looking Statements\nThis press release includes \"forward-looking statements\" within the meaning of the safe harbor provisions of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements about Owens Realty Mortgage Inc.'s plans, strategies, and prospects are based on current information, estimates, and projections; they are subject to risks and uncertainties, as well as known and unknown risks, which could cause actual results to differ from expectations, estimates and projections and, consequently, readers should not rely on these forward-looking statements as predictions of future events. Words such as \"expect,\" \"target,\" \"assume,\" \"estimate,\" \"project,\" \"budget,\" \"forecast,\" \"anticipate,\" \"intend,\" \"plan,\" \"may,\" \"will,\" \"could,\" \"should,\" \"believe,\" \"predicts,\" \"potential,\" \"continue,\" and similar expressions are intended to identify such forward-looking statements.\nReaders are cautioned not to place undue reliance upon any forward-looking statements, which speak only as of the date made. The Company does not undertake or accept any obligation to release publicly any updates or revisions to any forward-looking statement to reflect any change in its expectations or any change in events, conditions or circumstances on which any such statement is based. Additional information concerning these and other risk factors is contained in the Company's most recent filings with the Securities and Exchange Commission. All subsequent written and oral forward-looking statements concerning the Company or matters attributable to the Company or any person acting on its behalf are expressly qualified in their entirety by the cautionary statements above.\nView original content with multimedia: http://www.prnewswire.com/news-releases/owens-realty-mortgage-inc-announces-repurchase-and-settlement-agreement-with-freestone-capital-management-300577149.html\nSOURCE Owens Realty Mortgage, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/owens-realty-mortgage-inc-announces-repurchase-and-settlement-agreement-with-freestone-capital-management-300577149.html"], "published": "2018-01-04T00:05:00.000+02:00", "crawled": "2018-01-04T00:34:55.009+02:00", "highlightTitle": ""}