{"organizations": [], "uuid": "d71096eb4146d8b837b18744598a462a2cbfbd63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 106, "shares": 106, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219022568&w=1200&r=LYNXMPEE020H1", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-royals-economy/prince-harrys-wedding-to-meghan-markle-set-to-boost-uk-economy-idUKKBN1ES0PO", "country": "US", "domain_rank": 408, "title": "Prince Harry's wedding to Meghan Markle 'set to boost UK economy'", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T12:55:00.000+02:00", "replies_count": 0, "uuid": "d71096eb4146d8b837b18744598a462a2cbfbd63"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-royals-economy/prince-harrys-wedding-to-meghan-markle-set-to-boost-uk-economy-idUKKBN1ES0PO", "ord_in_thread": 0, "title": "Prince Harry's wedding to Meghan Markle 'set to boost UK economy'", "locations": [], "entities": {"persons": [{"name": "harry", "sentiment": "negative"}, {"name": "meghan markle", "sentiment": "negative"}, {"name": "elizabeth", "sentiment": "none"}, {"name": "kate", "sentiment": "none"}, {"name": "markle", "sentiment": "none"}, {"name": "william", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "windsor castle", "sentiment": "none"}, {"name": "sunken garden of kensington palace", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "brand finance", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 10:50 AM / Updated 28 minutes ago Prince Harry's wedding to Meghan Markle 'set to boost UK economy' Reuters Staff 3 Min Read \nLONDON (Reuters) - Prince Harry’s wedding to American actress Meghan Markle could provide a 500 million pound boost to Britain’s economy as tourists flock to the country and Britons celebrate, according to an estimate. FILE PHOTO: Britain's Prince Harry poses with Meghan Markle in the Sunken Garden of Kensington Palace in London, Britain, November 27, 2017. REUTERS/Toby Melville/File Photo \nHarry, Queen Elizabeth’s grandson and fifth-in-line to the throne, will tie the knot with Markle on May 19 at Windsor Castle, the royal palace home of British kings and queens for almost 1,000 years. \nAccording to the Office for National Statistics, the wedding of Harry’s elder brother William to wife Kate in April 2011 led to an increase of 350,000 visitors to the UK compared to the same month the year before and business valuation consultancy Brand Finance predicted a similar surge in May. \nIn total, it estimates the nuptials will generate some 500 million pounds . \n“We think approximately 200 million pounds will come from tourism, travel, hotels,” the company’s chief executive David Haigh told Reuters. FILE PHOTO: Meghan Markle arrives at St Mary Magdalene's church for the Royal Family's Christmas Day service on the Sandringham estate in eastern England, Britain, December 25, 2017. REUTERS/Hannah McKay/File Photo \nAbout 150 million pounds would be spent on people having parties and celebrating with 50 million coming from people buying T-shirts, hats and other commemorative items, he said. \nThe wedding would also be worth about 100 million pounds in free advertising for Britain around the world, he added. FILE PHOTO: Britain's Prince Harry and his fiancee Meghan Markle arrive at an event in Nottingham, December 1, 2017. REUTERS/Eddie Keogh/File Photo \nBusinesses in Windsor are already gearing up to take advantage of the worldwide interest in the couple, with Harry, 33, one of the most popular members of the British royal family and Markle, 36, best known for her starring role in the TV legal drama “Suits”, providing some Hollywood sparkle. \n“It’s going to be a massive boost for the economy, it’s going to be great to see so many people here for the wedding and actually to host the wedding itself,” said Andrew Lee, manager of the Harte and Garter hotel opposite Windsor Castle. \nBritish tourism bosses are already predicting 2018 to be a bumper year for the industry, aided by a fall in the value of the pound since the 2016 vote to leave the European Union which has attracted visitors and deterred Britons from vacationing abroad. \nVisitBritain, the national tourism agency, estimates that 41.7 million visits from overseas will be made to the United Kingdom in 2018, generating 26.9 billion pounds in the process. Reporting by Jess Omari; writing by Michael Holden; editing by Stephen Addison", "external_links": [], "published": "2018-01-03T12:55:00.000+02:00", "crawled": "2018-01-03T13:02:59.004+02:00", "highlightTitle": ""}