{"organizations": [], "uuid": "c3639a86d08db9f42be1d7c6be934384543d4181", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224755692&w=1200&r=LYNXMPEE0N0PA", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-china-didichuxing-analysis/as-chinas-didi-looks-abroad-challenges-spring-up-at-home-idUKKBN1FD117", "country": "US", "domain_rank": 408, "title": "As China's Didi looks abroad, challenges spring up at home", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T11:38:00.000+02:00", "replies_count": 0, "uuid": "c3639a86d08db9f42be1d7c6be934384543d4181"}, "author": "", "url": "https://uk.reuters.com/article/us-china-didichuxing-analysis/as-chinas-didi-looks-abroad-challenges-spring-up-at-home-idUKKBN1FD117", "ord_in_thread": 0, "title": "As China's Didi looks abroad, challenges spring up at home", "locations": [], "entities": {"persons": [{"name": "didi", "sentiment": "negative"}, {"name": "didi chuxing", "sentiment": "none"}, {"name": "mo jia", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "cate cadell", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 9:41 AM / Updated 32 minutes ago As China's Didi looks abroad, challenges spring up at home Cate Cadell 6 Min Read \nBEIJING (Reuters) - Chinese ride-sharing giant Didi Chuxing is on a roll overseas, snapping up assets in South America and flexing its financial muscles to drive growth. \nAt home, however, the road is bumpier.New rivals have cropped up since Didi vanquished Uber [UBER.UL] in China two years ago. Drivers complain that reduced subsidies mean they are working longer hours for the less pay. And increased attention from regulators and police has made it harder for the company to grow. \nDidi, valued at more than $50 billion, is banking on its huge volume of rides in China as it squares off against Uber and other competitors globally. Any threat to its home dominance could take the gloss off its appeal for investors. \n“Didi has to improve its profitability inside the Chinese market and expand overseas if it wants to make its story more convincing to investors, as the Chinese market is kind of reaching the roof,” said Mo Jia, a Shanghai-based analyst at Canalys. \nDidi, which has $12 billion in cash reserves following a recent $4 billion funding round, is pouring money into overseas expansion and projects like artificial intelligence. \nThis month, it acquired control of 99, a Brazilian ride-hailing company. It has also started hiring in Mexico as part of a plan to enter the country this year and is looking to make inroads in Taiwan. \nThe company still holds more than 87 percent of the Chinese private ride-share market, but in the first weeks of 2018 several companies have signaled their intention to mount a challenge, including $30 billion valued on-demand services platform Meituan Dianping. \nDidi is also dealing with the fallout of a costly subsidy battle with Uber in China. The company said it cut subsidies after the deal with its rival; drivers confirmed their incomes suffered as a result. \n“In 2016 (Uber) and Didi were fighting like dogs. If you earned 100 yuan, they gave you 100 yuan in subsidies,” said one Beijing driver, surnamed Hu, who said he took out a loan to buy his Honda Civic that year when earning more than 18,000 yuan a month. \n“Now I still work eight hours a day, six days a week, but if I‘m lucky I earn 6,000 yuan,” Hu said, adding that he had only managed to pay off the loan in December with help from his wife’s family. NEW RIVALS \nIn China, the number of rides per day on Didi’s platform rose from 14 million to 20 million following the August 2016 deal with Uber. New regulations and a drop in subsidies caused a slump in the company’s ride growth soon afterward, but company data shows rides bounced back to 20 million a day, then edged up to 25 million at the end of 2017. \nBut competitors are pressing in. \nMeituan Dianping, backed by Sequoia Capital and Tencent Holdings Ltd ( 0700.HK ), launched its first ride-hailing project in Nanjing last year and is rolling out seven more pilot projects in 2018, including in Beijing, Shanghai and Chengdu, a spokeswoman said. \n“My hope is that (Meituan Dianping) will pay a lot of attention to attracting drivers,” said a 28-year-old Beijing Didi driver surnamed Zhou, who says he has been too lazy to switch employers until now. \n“If there’s subsidies around their early launch then I’ll definitely go to Meituan,” Zhou said. “I want to try something new.” \nThe internet company, better known for its ticketing and restaurant services, is hoping to gain an advantage from its sophisticated location-based technology, and lure drivers like Zhou, whose loyalty to Didi has suffered as pay has fallen. \nCao Cao, another platform backed by automotive giant Geely Automobile Holdings Ltd ( 0175.HK ), which owns Swedish car brand Volvo, raised 1 billion yuan in funding this month and now has around 10 million users across 17 cities. \nPopular bike sharing platform Mobike, also backed by Tencent, announced this month it would launch its own car ride-sharing platform in Guizhou province, backed by investors such as FAW Car Co Ltd ( 000800.SZ ). \nDidi says it has an advantage in technically complex services, such as the car-pooling feature that now makes up roughly 30 percent of its total private car rides and cuts down on the number of drivers required. \n“This market is not about burning cash, it’s not about subsidies anymore. People want reasonable wait times (and) reliable service,” a Didi spokeswoman said. \nTOUGHER RULES, “FAST PASSENGERS” \nAll the companies will have to grapple with tightening Chinese regulations, already slowing growth in larger, congested cities. Migrant drivers, for example, cannot get a permit to work and live - called a hukou - in major urban centers such as Beijing and Shanghai. And cars used for ride-hailing services in those cities must be registered there. \n“It has made the barrier to entry higher for all the ride-sharing players,” Jia said. \nDrivers who evade the regulations can face big fines. Statistics released by Didi show that drivers accepted 13 to 40 percent fewer ride calls in some densely populated areas across China’s largest cities. \nTwo drivers in the southern Chinese city of Guangzhou said sting operations involving police are common, where drivers are hailed by police and photographed. \n“There’s a couple of solutions,” said one driver surnamed Deng, 41, who has been working as a Didi driver for four years in Guangzhou even though his car is registered elsewhere. \n“You can put the trunk of your car up so they don’t see your number plate, or instead of stopping you can drive very slowly past and the passenger gets in quickly” to avoid police noticing a waiting car, Deng said. \n“Times are tough,” he added. “So these ‘fast passengers’ make me especially happy.” Reporting by Cate Cadell; Editing by Adam Jourdan and Gerry Doyle", "external_links": [], "published": "2018-01-24T11:38:00.000+02:00", "crawled": "2018-01-24T11:59:56.015+02:00", "highlightTitle": ""}