{"organizations": [], "uuid": "90e4ea6c3702d076e7d1307dbcac05df87acf2b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-empire-bancorp-announces-write-down-of-deferred-tax-asset-and-balance-sheet-restructuringayear-end-assets-at-900-million.html", "country": "US", "domain_rank": 767, "title": "Empire Bancorp Announces Write Down of Deferred Tax Asset and Balance Sheet Restructuring; Year End Assets at $900 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:02:00.000+02:00", "replies_count": 0, "uuid": "90e4ea6c3702d076e7d1307dbcac05df87acf2b2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-empire-bancorp-announces-write-down-of-deferred-tax-asset-and-balance-sheet-restructuringayear-end-assets-at-900-million.html", "ord_in_thread": 0, "title": "Empire Bancorp Announces Write Down of Deferred Tax Asset and Balance Sheet Restructuring; Year End Assets at $900 Million", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "islandia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "empire bancorp, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISLANDIA, N.Y., Jan. 22, 2018 (GLOBE NEWSWIRE) -- Empire Bancorp, Inc. (OTCQB:EMPK), today announced its financial results for the quarter and year ended December 31, 2017.\n“Our earnings for the quarter and year end reflect a substantial one-time downward revaluation of our deferred tax assets resulting from the recent reduction of the U.S. corporate tax rate. Upon enactment of the Tax Cuts and Jobs Act last month, the value of these assets was reduced to align with the lower current tax rate of 21%. This adjustment reduced net income by approximately $1.8 million and was recorded as additional income tax expense for the fourth quarter of 2017. Year end assets totaled approximately $900 million. Our capital ratios remained well above all minimum regulatory capital requirements.”\n“Additionally, during the fourth quarter of 2017, to restructure our balance sheet and to take advantage of the tax benefit associated with a higher corporate tax rate in 2017, we sold approximately $41.6 million of investment securities out of the available for sale portfolio, incurring losses, net of tax, of $1.0 million. Our plan is to re-leverage the balance sheet for future periods using the proceeds principally to fund loans. Going forward, net interest income earned on replacement of the assets will be subject to the new 21% marginal corporate federal income tax rate. We expect this strategy to be accretive to earnings in 2018. With the solid economy, the corporate tax cut and this repositioning of the balance sheet, we anticipate stronger shareholder returns in 2018 and beyond,” stated Douglas C. Manditch, Chairman and Chief Executive Officer.\n“Net income for 2017 decreased $1.3 million, or 48.1%, to $1.4 million, as compared to 2016. Adjusted for the impact of the deferred tax asset revaluation and the balance sheet restructure, net income totaled $4.2 million. Execution of this strategy made sense as the return from the considerable, double digit decline in the corporate tax rate in the New Year is projected to boost the rate of future earnings expanding our capacity to produce capital.”\nYear-to-Date Highlights\nFinancial Results\nNet income, measured on a consolidated basis for 2017 decreased $1.3 million, or 48.1%, to $1.4 million, as compared to 2016. This reduction in net income was largely attributable to the impact of sales of investment securities, as well as an increase in income tax expense for the fiscal year ended December 31, 2017 as the Company revalued its deferred tax assets to align with the lowered U.S. corporate tax rate. Net income, adjusted for the impact of tax reform, measured on a consolidated basis for 2017 increased $416 thousand, or 14.9%, to $3.2 million, as compared to 2016. Net income, adjusted for the impact of tax reform and the Company’s balance sheet restructuring, measured on a consolidated basis for 2017 increased $1.5 million, or 52.7%, to $4.3 million, as compared to 2016. Diluted earnings per common share for 2017 were $0.20 compared with $0.40 for 2016. Return on average assets and average common stockholders' equity for 2017 were 0.17% and 2.16%, respectively, compared with 0.39% and 4.19%, for 2016.\nQuarterly Highlights\nFinancial Results\nNet loss, measured on a consolidated basis, for the fourth quarter of 2017 was $1.4 million, compared to net income of $923 thousand for the third quarter of 2017 and net income of $843 thousand for the fourth quarter of 2016. Net income, adjusted for the impact of tax reform, measured on a consolidated basis for the fourth quarter of 2017 decreased $502 thousand, or 59.5%, to $341 thousand, as compared to 2016. Net income, adjusted for the impact of tax reform and the Company’s balance sheet restructuring, measured on a consolidated basis for the fourth quarter of 2017 increased $533 thousand, or 63.2 %, to $1.4 million, as compared to 2016. Diluted (loss) earnings per common share for the fourth quarter of 2017 were ($0.20), compared with $0.12 for both the third quarter of 2017 and the fourth quarter of 2016.\nFranchise Development\nTotal assets were $900.0 million at December 31, 2017, up from $781.4 million or 15.2% at December 31, 2016. Loans outstanding totaled $519.5 million at December 31, 2017, up from $494.3 million or 5.1% at December 31, 2016. Deposits totaled $812.5 million at December 31, 2017, up from $670.7 million or 21.1% at December 31, 2016.\nContinued Financial and Credit Strength\nStrong asset quality with an allowance for loan and lease losses of 1.13% of total loans and a ratio of non-performing loans to total loans of 1.14%. The provision for loan losses was $644 thousand for the year ended December 31, 2017, as compared to $632 thousand for the prior year.\n“Well capitalized” regulatory capital levels at Empire National Bank, as of December 31, 2017: Tier 1 leverage capital ratio of 9.06% Common equity tier 1 risk-based capital ratio of 14.93% Tier 1 risk-based capital ratio of 14.93% Total risk-based capital ratio of 16.01%\n“Tax reform promotes future after-tax earnings of the Company. We also foresee business owners reinvesting a portion of their tax savings by expanding into new technologies, markets and products, which would spark commercial lending markets. Our Small Business Administration loan program, specifically SBA 7(a) lending, as well as the expansion of our residential lending into jumbo mortgages, diversifies our revenue streams and broadens prospects in the loan market,\" commented Thomas M. Buonaiuto, President and Chief Operating Officer.\nBalance Sheet\nAssets totaled $900.0 million at December 31, 2017, up $24.3 million, or 2.8%, from September 30, 2017 and up $118.6 million, or 15.2%, from December 31, 2016. Investment securities available for sale were $300.0 million at the most recent quarter-end, down $38.6 million, or 11.4%, from September 30, 2017 and up $35.2 million or 13.3% from December 31, 2016. Gross loans were $519.5 million at December 31, 2017, up 5.8% from $490.8 million at September 30, 2017 and up 5.1% from $494.3 million from December 31, 2016.\nTotal deposits were $812.5 million at December 31, 2017, up $47.2 million, or 6.2%, from September 30, 2017 and up $141.8 million, or 21.1%, from December 31, 2016. Demand deposits were $164.8 million, a decrease of $6.3 million, or 3.7% from September 30, 2017, and down $12.5 million, or 7.1%, from December 31, 2016. Savings, N.O.W. and money market deposits totaled $621.7 million at December 31, 2017, an increase of $45.5 million, or 7.9%, over September 30, 2017, and $155.9 million, or 33.5%, from December 31, 2016. The growth in these deposits was driven in large part by new and existing municipal banking relationships. Certificates of deposit of $100,000 or more and other time deposits were $25.9 million at December 31, 2017, up $8.0 million or 44.6% from September 30, 2017 and down $1.6 million or 5.7%.\nStockholders’ equity decreased to $67.6 million at December 31, 2017 from $70.1 million at September 30, 2017 and increased $4.6 million from $63.0 million at December 31, 2016. The linked quarter decrease was primarily attributable to the net loss of $1.4 million and the increased net unrealized loss on securities available for sale, net of taxes, of $1.0 million. The year over year increase in stockholders’ equity resulted from net income of $1.4 million, $935 thousand associated with stock compensation plans and the exercise of both warrants and stock options, and net decrease in the net unrealized loss on securities available for sale, net of taxes of $2.2 million.\nAt December 31, 2017, the bank was “well capitalized” as defined by OCC regulation, with tier 1 leverage, common equity tier 1 risk-based, tier 1 risk-based and total risk-based capital ratios of 9.06%, 14.93%, 14.93% and 16.01%, respectively.\nNet Interest Margin/Net Interest Income\nNet interest income for the fourth quarter of 2017 decreased $158 thousand, or 2.5%, over the third quarter of 2017, and increased $389 thousand, or 6.9%, over the fourth quarter of 2016. Net interest margin was 2.77% for the three months ended December 31, 2017, a decrease from 2.91% for the three months ended September 30, 2017, and from 3.00% for the three months ended December 31, 2016.\nInterest income increased $38 thousand, or 0.5% for the fourth quarter of 2017, from the third quarter of 2017, and $1.1 million, or 16.4%, from the fourth quarter of 2016. The increase was attributable to an increase in income from securities available for sale, loans, and securities held to maturity taxable, of $680 thousand, $313 thousand and $54 thousand, respectively. The yield on interest earning assets decreased to 3.49% for the fourth quarter of 2017, compared to 3.55% for the third quarter of 2017 and increased from 3.46% for the fourth quarter of 2016. The linked quarter over quarter decrease was attributable to a decrease in prepayment fees to $123 thousand in the fourth quarter of 2017 from $291 thousand in the third quarter of 2017. The increase over the fourth quarter of 2016 was attributed to an increase in the average rate of return of all interest earning assets.\nInterest expense was $1.6 million in the most recent quarter and $1.4 million for the third quarter of 2017, as compared to $880 thousand for the fourth quarter of 2016. The cost of interest bearing liabilities was 0.96% for the three months ended December 31, 2017, an increase from 0.88% from the three months ended September 30, 2017, and an increase from 0.69% for the three months ended December 31, 2016. Generally the cost of retail deposits has remained steady, but in the fourth quarter of 2017 the Company began to see competitive pressure on the cost of funds on municipal deposits.\nNet interest income increased $3.1 million, or 14.6%, for year ended 2017 over year ended 2016. Net interest margin was 2.98% for 2017, a decrease from 3.05% for 2016.\nInterest income increased $4.8 million, or 19.2% for year ended 2017 over the year ended December 31, 2016. The increase was principally attributed to an increase in income from both investment securities and loans by $2.9 million and $1.7 million, respectively. Average interest earning assets increased $122.1 million for year ended 2017 over 2016. In addition, the yield on interest earning assets increased five basis points to 3.57% for year ended 2017 as compared to the prior fiscal year. Both the average volume and average yield on loans increased in 2017 as compared to 2016. The average yield on loans increased to 4.42% for 2017 from 4.31% in 2016, partially due to higher prepayment fees in 2017. Additionally, investment securities represented a greater percentage of the earning asset mix in 2017 as compared to the prior year, and the average rate of return for investment securities increased by 41 points over 2016.\nThe decrease in net interest margin was impacted by an increase of 10 basis points in the cost of average interest-bearing liabilities to 0.82% for the year ended 2017 from 0.72% for 2016. Generally the cost of retail deposits remained steady throughout 2017 but competitive pressure on the cost of funds on municipal deposits increased the cost of funds in the last quarter of the year.\nNoninterest Income and Expense\nThe Company recognized net securities losses of $1.6 million in the fourth quarter of 2017 compared to losses of $28 thousand in the third quarter of 2017 and gains for $131 thousand in the fourth quarter of 2016. For the year ended December 31, 2017, the Company recognized a net loss of $1.6 million on sale of investment securities as the Company sold a portion of its available for sale securities portfolio to execute specific tax strategies and better position the balance sheet under the lowered corporate tax rate. Comparatively, for the year ended December 31, 2016, the Company recognized net securities gains of $346 thousand on the sales of investment securities.\nExcluding net gains and losses on sales of investment securities, other noninterest income of $440 thousand for the fourth quarter of 2017 represented an increase of $54 thousand over the linked quarter and an increase of $172 million over the same period in 2016. The linked quarter increase resulted primarily from income on bank-owned life insurance of $69 thousand offset by decreased collection of miscellaneous loan charges of $18 thousand. The increase in the fourth quarter of 2017 over the fourth quarter of 2016 resulted from increase in both income on bank-owned life insurance of $162 thousand and customer related fees and services offset by decreases in both professional practice revenue and collection of miscellaneous loan charges.\nExcluding net gains and losses on sales of investment securities, other noninterest income increased $347 thousand, or 30.7% to $1.5 million, for the year ended December 31, 2017 as compared to the prior fiscal year. The net increase resulted from increases in bank-owned life insurance of $254 thousand and collection of miscellaneous loan charges offset by decreases in both professional practice revenue and customer related fees and service charges.\nOther expense in the fourth quarter of 2017 totaled $4.6 million, compared with $5.0 million in the third quarter of 2017 and $4.4 million in the fourth quarter of 2016. The linked quarter decrease was primarily attributable to a decrease of $319 thousand in salary and benefits expense. The increase in the fourth quarter of 2017 over the fourth quarter of 2016 was primarily attributable to an increase in other operating expenses of $78 thousand or 15.2% and increase in salaries and employee benefits expense of $74 thousand, or 3.2%, and an increase in professional fees of $68 thousand or 50.4%, or 1.7% partially offset by a lower FDIC expense of $40 thousand or 69.0%.\nOther expense in 2017 totaled $19.5 million, compared with $18.1 million for the year ended December 31, 2016. The increase in other expense was primarily attributable to an increase in salaries and employee benefits expense of $806 thousand, or 8.4%, over the previous year, largely due to base salary increases and benefit plans to support strategic plans and employee recognition and retention. Advertising and business development expense increased $246 thousand, or 25.0%, and professional fees increased $125 thousand or 18.8% as compared to the prior fiscal year. Costs associated with the collateralization of municipal deposits increased $69 thousand over last year.\nIncome Tax Rate\nOn December 22, 2017, H.R.1, also known as the Tax Cuts and Jobs Act, was enacted into law. Beginning in 2018, this legislation reduces the federal marginal tax rate for corporations from 34% to 21% and changes or limits certain tax deductions. Contributing to the increase in effective income tax rate for 2017 was a substantial one-time downward revaluation of deferred tax assets resulting from this recent reduction of the U.S. corporate tax rate. This adjustment was recorded as additional income tax expense reducing net income by approximately $1.8 million in the quarter ended December 31, 2017. This expense of approximately $1.8 million partially derived from the write down of deferred tax assets, resulting primarily from temporary differences between tax and financial reporting totaling of approximately $1.2 million, as well as an additional write down of approximately $0.6 million of the net deferred tax asset associated with the unrealized loss on the fair market value of securities available for sale.\nThe year to date 2017 effective income tax rate was 67.6% as compared to 35.8% for the year ended December 31, 2016. Notwithstanding the additional income tax recorded on the revaluation of the deferred tax assets, the effective tax rate for 2017 would have been 28.2%. Additionally, the Company recognized excess tax benefits relative to the exercise of stock options by employees in the fourth quarter of 2017. There were no excess tax benefits recognized by the Company in 2016.\nStrong Asset Quality/Provision for Loan Losses\nBased on management’s assessment of the adequacy of the allowance for loan and lease losses, a provision of $210 thousand was recorded for the fourth quarter of 2017, as compared with $164 thousand for the third quarter of 2017 and $300 thousand for the fourth quarter of 2016. For the year ended 2017 a provision of $644 thousand was recorded as compared to $632 thousand for 2016. Expressed as a percentage of outstanding loans, the allowance for loan and lease losses was 1.13% at December 31, 2017, compared with 1.16% at September 30, 2017, and 1.17% at December 31, 2016.\nCredit quality remained sound as the Company has not wavered from its rigorous underwriting standards despite improving economic conditions. At December 31, 2017 the Company had no delinquencies over thirty days past due in the loan portfolio. In addition, the overall number of criticized and classified loans declined as compared to December 31, 2016.\nLoans classified as nonaccrual totaled $5.9 million, or 1.14% of total loans outstanding at December 31, 2017, compared with $1.6 million, or 0.33%, at September 30, 2017 and $2.4 million, or 0.48%, at December 31, 2016. This increase in nonaccrual loans is principally caused by our relationship with one borrower whose loan is current and secured by commercial real estate and other collateral.\nIn the fourth quarter of 2017 there were net charge-offs of $17 thousand as compared to net charge-offs of $352 thousand in the third quarter of 2017 and net recoveries of $10 thousand in the fourth quarter of 2016. Net charge-offs for the year ended 2017 were $568 thousand, less than 1% of average loans outstanding for 2017, as compared to $101 thousand for the year ended 2016.\nAbout Empire Bancorp, Inc.\nEmpire Bancorp, Inc. is a bank holding company for Empire National Bank, a Long Island-based independent bank that specializes in serving the financial needs of small and medium sized businesses, professionals, nonprofit organizations, municipalities, real estate investors, and consumers. The bank has four full-service banking offices located in Islandia, Shirley, Port Jefferson Station, Mineola and a private banking branch office in Manhattan. Our bankers take pride in understanding the needs of each customer so the bank can deliver the highest quality service with a sense of urgency.\nThis release may contain certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. For this purpose, any statements contained in this press release that are not statements of historical fact may be deemed to be forward-looking statements. Without limiting the foregoing, words such as “may,” “will,” “expect,” “believe,” “anticipate,” “estimate” or “continue,” or comparable terminology, are intended to identify forward-looking statements. These statements by their nature involve substantial risks and uncertainties, and actual results may differ materially depending on a variety of factors, many of which are not within the control of the Company. The forward-looking statements included in this press release are made only as of the date of this press release. The Company has no intention, and does not assume any obligation, to update these forward-looking statements.\nConsolidated Statements of Condition (unaudi ted) (dollars in thousands, except per share data) December 31,\nSeptember 30,\nDecember 31,\n2017\n2017\n2016\nASSETS Total cash and cash equivalents $ 45,879 $ 10,486 $ 6,354 Securities available for sale, at fair value 299,969 338,531 264,734 Securities held to maturity 4,750 4,750 3,000 Securities, restricted 2,946 3,390 4,131 Loans 519,540 490,843 494,274 Allowance for loan losses (5,875 ) (5,682 ) (5,799 ) Loans, net 513,665 485,161 488,475 Premises and equipment, net 5,506 5,628 6,052 Bank-owned life insurance 20,254 20,092 - Other assets and accrued interest receivable 7,062 7,648 8,689 Total Assets $ 900,031 $ 875,686 $ 781,435 LIABILITIES AND STOCKHOLDERS' EQUITY Demand Deposits $ 164,790 $ 171,111 $ 177,299 Savings, N.O.W. and money market deposits 621,742 576,237 465,890 Certificates of deposit of $100,000 or more and other time deposits 25,932 17,936 27,494 Total Deposits 812,464 765,284 670,683 Short-term borrowings - 9,975 26,477 Subordinated debentures, net 14,778 14,767 14,735 Other liabilities and accrued expenses 5,204 15,605 6,548 Total Liabilities 832,446 805,631 718,443 Total Stockholders' Equity 67,585 70,055 62,992 Total Liabilities and Stockholders' Equity $ 900,031 $ 875,686 $ 781,435 Selected Financial Data (unaudited) Allowance for Loan Losses to Total Loans 1.13 % 1.16 % 1.17 % Non-performing Loans to Total Loans 1.14 % 0.33 % 0.48 % Non-performing Assets to Total Assets 0.66 % 0.18 % 0.30 % Book Value per Share $ 9.26 $ 9.75 $ 9.07 Capital Ratios (unaudited) (1) Tier 1 Leverage Ratio 9.06 % 9.46 % 10.22 % Common Equity Tier 1 Risk-Based Capital Ratio 14.93 % 15.80 % 16.26 % Tier 1 Risk-Based Capital Ratio 14.93 % 15.80 % 16.26 % Total Risk-Based Capital Ratio 16.01 % 16.89 % 17.46 % (1) Regulatory capital ratios presented on bank-only basis\nConsolidated Statements of Operations (unaud ited) (dollars in thousands, except per share data) For the three months ended For the year ended December 31,\nSeptember 30,\nDecember 31,\nDecember 31,\nDecember 31,\n2017 2017 2016 2017 2016 Interest income $ 7,618 $ 7,580 $ 6,546 $ 29,632 $ 24,868 Interest expense 1,563 1,367 880 4,916 3,301 Net interest income 6,055 6,213 5,666 24,716 21,567 Provision for loan losses 210 164 300 644 632 Net interest income after provision for loan losses 5,845 6,049 5,366 24,072 20,935 Net securities (losses) gains (1,568 ) (28 ) 131 (1,596 ) 346 Other income 440 386 268 1,478 1,131 Other expense 4,599 5,031 4,449 19,492 18,068 Income before income taxes 118 1,376 1,316 4,462 4,344 Income tax expense 1,536 453 473 3,015 1,554 Net (loss) income $ (1,418 ) $ 923 $ 843 $ 1,447 $ 2,790 Basic (loss) earnings per share $ (0.20 ) $ 0.13 $ 0.12 $ 0.20 $ 0.40 Diluted (loss) earnings per share $ (0.20 ) $ 0.12 $ 0.12 $ 0.20 $ 0.40 Weighted average common and equivalent shares outstanding 7,273,077 7,271,145 7,080,205 7,214,399 6,899,655 Selected Financial Data (unaudited) Return on Average Assets (0.63 )% 0.42 % 0.44 % 0.17 % 0.39 % Return on Average Equity (8.16 )% 5.34 % 5.04 % 2.16 % 4.19 % Net Interest Margin 2.77 % 2.91 % 3.00 % 2.98 % 3.05 % Efficiency Ratio 70.81 % 76.24 % 74.99 % 74.42 % 79.60 % Contact:\nWilliam Franz\nSVP, Director of Marketing\n& Investor Relations\n(631) 348-4444\nSource:Empire National Bank", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/3f5dc98e-43a2-4b6e-9e3c-3e041313bb71"], "published": "2018-01-23T00:02:00.000+02:00", "crawled": "2018-01-23T02:18:23.003+02:00", "highlightTitle": ""}