{"organizations": [], "uuid": "4ce55460a9bc07da40f055fc8c39c5c485d05c69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/bitcoin-nem-coincheck-hack-mt-gox.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/26/bitcoin-price-coincheck-nem-mt-gox/", "country": "US", "domain_rank": 1196, "title": "Bitcoin Prices React to Coincheck NEM Hack, Biggest Crypto Theft Ever | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.616, "site_type": "news", "published": "2018-01-26T15:54:00.000+02:00", "replies_count": 0, "uuid": "4ce55460a9bc07da40f055fc8c39c5c485d05c69"}, "author": "Lucinda Shen", "url": "http://fortune.com/2018/01/26/bitcoin-price-coincheck-nem-mt-gox/", "ord_in_thread": 0, "title": "Bitcoin Prices React to Coincheck NEM Hack, Biggest Crypto Theft Ever | Fortune", "locations": [], "entities": {"persons": [{"name": "coincheck", "sentiment": "negative"}, {"name": "lucinda shen", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "mt. gox", "sentiment": "none"}], "organizations": [{"name": "asahi shimbun", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Lucinda Shen 1:54 PM EST \nJapanese cryptocurrency exchange Coincheck confirmed that some $524 million worth of digital coins had been stolen—likely making it the largest single hack on an exchange, even outweighing the Mt. Gox breach of 2014. \nThat’s according to Japanese newspaper Asahi Shimbun , which reports that Coincheck said that some 500 million units of a cryptocurrency known as NEM, worth about 58 billion yen, had been taken from customers’ wallets. \nThe stake has now fallen to about $430 million, with spooked investors selling off their holdings following rumors of the hack earlier Friday. \nCoincheck is reportedly still trying to determine the nature of the attack, but noted that other cryptocurrencies were not impacted. Some critics point to Coincheck’s lack of multi-sig wallets, in which multiple keys are needed to authorize a transaction, as part of the vulnerabilities that facilitated the hack. \nThe most recent hack outranks a major trauma for early cryptocurrency investors in terms of U.S. dollar. In 2014, the largest exchange at the time, Mt. Gox, revealed that some 850,000 Bitcoin, valued at $470 million, had been stolen. The value of the stake later dropped to about $400 million in the hours following the revelation. \nSecurity flaws and hacks have been a major concern for investors of the Bitcoin and cryptocurrency community, with such thefts at times warding off potential investors. \nThose concerns were apparent in other cryptocurrencies Friday, not just in that of NEM. Bitcoin prices initially dropped 7% against the dollar, before paring some of those losses. Still, some investors appeared to buy into the dip. Bitcoin’s price rests at $11,000 as of publication, down 1% during the day. Ethereum and Ripple, which dropped 5% and 12% respectively at first, also bounced. Ethereum now stands flat at $1,055, while Ripple is down 6%. \nNEM, the tenth-largest currency based on CoinMarketCap figures, remains down 9%, at 85 cents a unit. \nWhat may also be keeping crypto markets relatively more propped up today than they were following the Mt. Gox hack is the fact that there are more players in the market today, with Coincheck being just one of many exchanges, and NEM being only one of many cryptocurrencies. 8/ All of that said, the #crypto markets are extremely different in 2018 than they were in 2014 from liquidity to # of exchanges to quality of exchanges to # of participants to developer activity, etc etc etc \n— Chris Burniske (@cburniske) January 26, 2018 \nChris Burniske, partner at venture capital firm Placeholder, notes that while Bitcoin in particular is having a worse start to the year than it did in the same period in 2014, the state of the markets are fundamentally different. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-26T15:54:00.000+02:00", "crawled": "2018-01-26T23:16:08.016+02:00", "highlightTitle": ""}