{"organizations": [], "uuid": "74cf90a7ca82f75fc5ff991d7cc542297afdeb90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221551615&w=1200&r=LYNXMPEE0B1IV", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-janapartners-sting/fields-of-gold-jana-seeks-new-money-allies-with-impact-hedge-fund-idUSKBN1F12L4", "country": "US", "domain_rank": 408, "title": "Fields of Gold? Jana seeks new money, allies with impact hedge fund", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T22:43:00.000+02:00", "replies_count": 0, "uuid": "74cf90a7ca82f75fc5ff991d7cc542297afdeb90"}, "author": "", "url": "https://www.reuters.com/article/us-janapartners-sting/fields-of-gold-jana-seeks-new-money-allies-with-impact-hedge-fund-idUSKBN1F12L4", "ord_in_thread": 0, "title": "Fields of Gold? Jana seeks new money, allies with impact hedge fund", "locations": [], "entities": {"persons": [{"name": "jana", "sentiment": "negative"}, {"name": "rosenstein", "sentiment": "none"}, {"name": "sting", "sentiment": "none"}, {"name": "barry rosenstein", "sentiment": "none"}, {"name": "ross kerber", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "jana partners", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 8:53 PM / Updated 30 minutes ago Fields of Gold? Jana seeks new money, allies with impact hedge fund Svea Herbst-Bayliss , Ross Kerber 7 Min Read \nBOSTON (Reuters) - Wall Street investor Barry Rosenstein’s new impact investing fund aimed at serving environmental and social causes could, if he plays his cards right, enhance his traditional business of pushing companies to boost earnings. \nThe founder of JANA Partners has tapped British musician and activist Sting to sit on the new fund’s advisory board and burnish his credentials with green and socially conscious investors he hopes will pledge at least $1 billion. \nThat amount is a fraction of the billions that have been pulled from Jana since 2015. Its assets have shrunk by more than half to $5 billion since then, as hedge fund investors fled to cheaper, passive products. Still, it gives him an important foothold in the growing arena of “responsible investing”. \nIndustry watchers said Rosenstein could forge more alliances with institutional investors that could carry over to Jana’s main business: pushing companies to make financial changes that often include recapitalizing or restructuring the business. \n“There is a longer game here than just this one fund,” said a hedge fund industry advisor who is not permitted to speak publicly about individual hedge fund firms. “The new fund will create a bridge with other institutional investors which Jana may need in its future activism.” \nPeople familiar with the fundraising say commitments have already been made and interest is high. The fund will not be a typical hedge fund product, people familiar with the matter say, noting the fees are expected to be lower. \nJana made its first foray into socially minded investments this month, pressuring Apple to give parents more control over the setup options of their children’s iPhones. The fund partnered with CalSTRS, the largest U.S. public sector teachers’ pension fund and one that is increasingly emphasizing social responsibility in its bets. \nCalstrs does not invest with Jana but with $222 billion in assets under management, more than half of it in stocks, it could be a powerful ally in future activist fights. Apple reacted quickly, promising new parental controls, and the hedge fund industry is chalking this up as a victory for Jana. \nCalstrs spokeswoman Michelle Mussuto declined to comment on its work with Jana. \nRosenstein cut his activist teeth during the 1980s heyday for corporate raiders, a background that has made traditional environmental, social and governance (ESG) activists doubt the sincerity of his pivot to socially conscious investing. \nLast year, John Mackey, CEO of Whole Foods, called Jana “greedy bastards” as the hedge fund pushed for a sale of the grocery chain. \nCharles Penner, a partner at Jana, defended the new direction. \n“It is not inconsistent with what we have done historically, it is just different,” he said. \nThe Jana Impact Capital Fund is set to launch later this year. Joining Sting as an advisor is Patricia Daly, a nun who battled Exxon Mobil Corp over environmental disclosures. Sustainability expert Robert Eccles, who has taught at Harvard Business School, will also be on board. None of the three were available to comment. WALL STREET CHOPS \nUntil recently, activism in the responsible investing space was largely the preserve of religious funds and public pension leaders with a genteel approach to boardroom battles and the patience to wait years for progress. \nBut now more major investors, including sovereign wealth funds and pensions, are pushing companies on issues like climate change, income and gender equality. By bringing some hard-charging Wall Street chops into this arena, Jana could stand out and, if successful, curry favor with such investors. \nIn its 17-year history, Jana has waged roughly 75 activist campaigns at companies ranging from Walgreens Boots Alliance to Tiffany & Co., delivering an annualized average return of 11 percent in its flagship fund. \nIts JSI fund, which concentrates purely on activist situations, has returned an annualized 18 percent since its 2010 launch after gaining 22 percent in 2017, matching the S&P 500’s 22 percent gain. \nThe flagship Jana Partners fund, meanwhile, gained 5.6 percent last year, underperforming the Standard & Poor’s 500 stock index. \nAt a time when flows to hedge funds have been thin, the socially responsible space is appealing. Net deposits into socially responsible mutual funds were $4.7 billion in 2017, a 22 percent jump from the year before and a large leap from 2013, when investors directed just $1 billion into the category. \nOne reason is returns. A Vanguard fund based on the popular FTSE4Good US Select Index of ESG stocks for instance beat the S&P 500 in three of the last five years, including in 2017, according to Morningstar. \nHedge funds are still smarting from $70 billion in redemptions in 2016, Hedge Fund Research data show. The sector, including activist funds, did see an uptick of investor inflows in 2017, with $2.9 billion added in the first three quarters. \n“A BIT OF A STRETCH” \nJana’s past record of shareholder activism means it is carrying some baggage as its climbs onto the responsible investing bandwagon, some people say. Some investors think the firm has a way to go to prove its commitment to social and environmental concerns. \nThe new fund is “a bit of stretch, no question” said Seamus Finn, chairman of the Interfaith Center on Corporate Responsibility, whose members include religious groups, foundations and other organizations. \nSome of Finn’s members have described Jana as disinterested at best in their efforts to get companies to heed environmental or social concerns. \nJana’s Penner said the firm would not have been able to take up such causes in the past because it was not part of its investment profile. \n“We didn’t have a mandate to do that,” he said. \nBoston Common Asset Management, which has a long-running partnership with energy producer Apache Corp aimed at improving sustainability and protecting the rights of indigenous peoples, said it did not hear from Jana when it took a stake in Apache in 2014. [ reut.rs/2AKl8AH ] \nBut Geeta Aiyer, Boston Common’s president, is willing to give Jana the benefit of the doubt. \n“If they move from the business of shortening already-short time horizons to taking a longer-term view, it could put to bed this whole debate about whether being a responsible investor is somehow bad for returns,” Aiyer said. Editing by Carmel Crimmins and David Gregorio", "external_links": [], "published": "2018-01-12T22:43:00.000+02:00", "crawled": "2018-01-12T23:04:34.004+02:00", "highlightTitle": ""}