{"organizations": [], "uuid": "ace0f1049afa7353744b235b500350577dd933ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-sudan-protests/sudan-bread-protests-spread-opposition-leader-detained-idUSKBN1EW0R6", "country": "US", "domain_rank": 408, "title": "Sudan bread protests spread, opposition leader detained", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T19:34:00.000+02:00", "replies_count": 0, "uuid": "ace0f1049afa7353744b235b500350577dd933ac"}, "author": "", "url": "https://www.reuters.com/article/us-sudan-protests/sudan-bread-protests-spread-opposition-leader-detained-idUSKBN1EW0R6", "ord_in_thread": 0, "title": "Sudan bread protests spread, opposition leader detained", "locations": [], "entities": {"persons": [{"name": "kha", "sentiment": "negative"}, {"name": "abdelaziz", "sentiment": "none"}], "locations": [{"name": "sudan", "sentiment": "none"}, {"name": "sennar", "sentiment": "none"}], "organizations": [{"name": "min read  khartoum", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 5:34 PM / in an hour Student killed, opposition leader detained as bread protests grip Sudan Khalid Abdelaziz 3 Min Read \nKHARTOUM (Reuters) - Protests over rising bread prices broke out across Sudan on Sunday, leading to the death of a student and the arrest of a prominent opposition leader as authorities confiscated newspapers and looked to clamp down on growing unrest. \nThe demonstrations followed a similar protest in the southeastern city of Sennar on Saturday after bread prices doubled following the government’s announcement late last month that it was eliminating subsidies in its 2018 budget. \nIn the southeastern city of al-Damazin, police fired tear gas on Sunday as about 400 demonstrators chanted “No, no to price rises!” and some burned tyres, a local resident told Reuters. \nThe removal of subsidies is part of austerity measures as the country struggles in the face of inflation running at about 25 percent and an acute shortage of hard currency that has sapped import activity. \nAusterity measures in Sudan have sparked sporadic public protests in the past few years. Amnesty International says that up to 185 people may have been killed in 2013 when thousands took to the streets in demonstrations against fuel price increases. \nProtests have since been much smaller and the main opposition parties have called for peaceful demonstrations against the bread price rises. \nProtests spread to downtown Khartoum on Sunday as well as three cities to the south; the southwestern cities of Nyala and Geneina; as well as al-Damazin, residents in these areas told Reuters. \nA high school student was killed and six others wounded in Geneina during the protests, a statement from the Geneina governor said. It did not give a reason for the death but said the incident would be investigated. \nAuthorities arrested Omar Al-Dageir, the president of one of the country’s largest opposition groups, the Sudanese Congress Party, members of the party said. \nAuthorities also blocked the sale of six daily newspapers carrying critical coverage of the subsidy cut and price rises, editors of the papers told Reuters. \nThe ministry of interior could not be reached for comment. \nSudan has begun a series of economic reforms in line with International Monetary Fund recommendations to try to bolster the economy, months after a U.S. decision to lift sanctions raised hopes that badly needed investment may return. \nThis month Sudan devalued its pound currency to 18 per U.S. dollar, more than double its previous peg of 6.7 pounds to the dollar. The rate on the black market hit about 29 pounds to the dollar last week. Reporting by Khalid Abdelaziz; Writing by Eric Knecht; Editing by Susan Fenton and David Goodman", "external_links": [], "published": "2018-01-07T19:34:00.000+02:00", "crawled": "2018-01-07T19:49:04.001+02:00", "highlightTitle": ""}