{"organizations": [], "uuid": "efaa95886ef18569a2817cd7f57b883b0348291a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-inhalers-heart-risk/starting-new-copd-inhaler-tied-to-heart-attack-risk-idUSKBN1ER1F1", "country": "US", "domain_rank": 408, "title": "Starting new COPD inhaler tied to heart attack risk", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T18:40:00.000+02:00", "replies_count": 0, "uuid": "efaa95886ef18569a2817cd7f57b883b0348291a"}, "author": "", "url": "https://www.reuters.com/article/us-health-inhalers-heart-risk/starting-new-copd-inhaler-tied-to-heart-attack-risk-idUSKBN1ER1F1", "ord_in_thread": 0, "title": "Starting new COPD inhaler tied to heart attack risk", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "negative"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 4:41 PM / Updated 2 hours ago Starting new COPD inhaler tied to heart attack risk Lisa Rapaport 4 Min Read \n(Reuters Health) - People with chronic obstructive pulmonary disease (COPD) who use long-acting inhaled bronchodilators may have an increased risk of heart attacks and strokes right after they start taking these medicines, a Taiwanese study suggests. \nCOPD is usually caused by smoking, and symptoms include breathing difficulty, cough, and wheezing. While some patients may use short-acting inhalers to quickly relieve occasional shortness of breath, people with more severe and persistent symptoms may be prescribed long-acting inhalers to help expand the airways and keep them open. \nCompared to COPD patients who didn’t use long-acting bronchodilators, those who did were 50 percent more likely have cardiovascular problems like a heart attack or stroke within the first 30 days of starting to use these inhalers, the study found. \nThe absolute risk of problems like stroke, heart attack, rhythm disorders, and heart failure was still very low – around 1 percent – and the increased risk associated with long-acting bronchodilators disappeared over time, researchers report in JAMA Internal Medicine. \n“Patients should know that their risk for cardiovascular diseases will be increased after initiation of bronchodilators even though the treatment is essential,” said Dr. Tadahiro Goto, a researcher at Massachusetts General Hospital in Boston who wasn’t involved in the study. \nWhile patients shouldn’t stop using inhalers, they should be vigilant about seeking medical attention for symptoms that might indicate a heart problem, such as chest pains or a suddenly rapid heart beat, Goto said by email. \nTo assess the connection between long-acting bronchodilators and heart problems, researchers examined data on 284,220 adults with COPD who had never used these medicines. \nAt the start of the study, patients were 71 years old on average, and researchers followed them for an average of 2 years. During that time, 37,719 people developed severe heart problems requiring emergency medical care. \nResearchers looked at long-acting bronchodilators in two different families of medicines – beta-agonists and antimuscarinic antagonists – and didn’t see a difference in the risk of heart disease based on the type of drug or the dose. \nThe study wasn’t a controlled experiment designed to prove whether or how long-acting bronchodilators might influence the odds of severe heart problems in patients with COPD. \nWhile these medicines are designed to widen the airways, they may also accelerate the heart rate, constrict blood vessels and increase blood pressure, said lead study author Meng-Ting Wang, of the National Defense Medical Center in Taipei, Taiwan. \nLong-acting bronchodilators might also increase inflammation, which then leads to blockage of the blood vessels, Wang said by email. \nIt’s also possible that heart problems that appear linked to the medications in the study might have been there all along and misdiagnosed in some patients, said Dr. Shawn Aaron, a researcher at the University of Ottawa Medical School who wasn’t involved in the study. \nPatients should have a follow-up exam after they start using these inhalers to make sure they’re not having symptoms that might be caused by cardiovascular disease, Aaron advised. \n“No one should avoid these drugs if they are prescribed by a physician,” said Dr. Prescott Woodruff, a researcher at the University of California San Francisco who wasn’t involved in the study. \n“They are very effective at improving lung function and reducing exacerbations in COPD,” Woodruff said by email. “The initiation of these drugs, in this instance, can simply be a marker for worsening symptoms of COPD or cardiovascular disease that is mistaken for COPD.” \nSOURCE: bit.ly/2A6F4NM JAMA Internal Medicine, online January 2, 2018.", "external_links": [], "published": "2018-01-02T18:40:00.000+02:00", "crawled": "2018-01-02T18:53:35.000+02:00", "highlightTitle": ""}