{"organizations": [], "uuid": "3d45dfe3451050f43e593e1c331337026ddd0c89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221248640&w=1200&r=LYNXMPEE0A1US", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-egypt-election/ex-military-chief-of-staff-to-run-in-egyptian-presidential-election-idUSKBN1F02XL", "country": "US", "domain_rank": 408, "title": "Ex-military chief of staff to run in Egyptian presidential election", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T05:33:00.000+02:00", "replies_count": 0, "uuid": "3d45dfe3451050f43e593e1c331337026ddd0c89"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-egypt-election/ex-military-chief-of-staff-to-run-in-egyptian-presidential-election-idUSKBN1F02XL", "ord_in_thread": 0, "title": "Ex-military chief of staff to run in Egyptian presidential election", "locations": [], "entities": {"persons": [{"name": "sami anan", "sentiment": "negative"}, {"name": "abdel fattah al-sisi", "sentiment": "none"}, {"name": "anan", "sentiment": "none"}, {"name": "sami balah", "sentiment": "none"}, {"name": "balah", "sentiment": "none"}], "locations": [{"name": "cairo", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "arabism egypt party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAIRO (Reuters) - Former military chief of staff General Sami Anan will run in Egypt’s upcoming presidential election, the party he leads said on Thursday, days after the most serious potential challenger to President Abdel Fattah al-Sisi pulled out.\nAn election commission said on Monday Egypt would hold the vote on March 26-28, with a run-off on April 24-26. Candidates must register between Jan 20 and 29.\n“The party leaders took a decision for General Sami Anan’s candidacy and informed him of the decision and there was no problem at all and no objection,” from him, said Sami Balah, the secretary general of the Arabism Egypt Party.\nBalah said party members and officials across the country had been contacted about collecting the required votes of nomination, starting from Saturday.\nElection regulations stipulate that would-be candidates must obtain the backing of at least 20 members of parliament for their candidacy or be supported by at least 25,000 eligible voters in at least 15 governorates.\nThe party will hold a news conference in the next few days for Anan to officially announce his candidacy, said Ragab Helal, a leading member in the party and member of parliament.\nOTHER CANDIDATES Anan’s candidacy news came days after former Egyptian Prime Minister Ahmed Shafik, and Sisi’s most serious competition, said he was no longer considering running for president in this year’s elections.\nThe 73-year-old ex-air force commander and former aviation minister, who had closely lost to Muslim Brotherhood President Mohamed Mursi in 2012, blamed his living abroad for his initial decision to run.\nEarlier on Thursday, prominent human rights lawyer Khaled Ali said in a news conference he will not pull out of the race despite “unfair competition conditions”. Ali also ran for president in the 2012 election and came in seventh.\n“We will not turn our back on this battle at a time like this,” Ali told a news conference on Thursday, calling on the youths who revolted in 2011 to support his campaign.\nThe 45-year-old lawyer was sentenced in September to three months in jail for public indecency over an allegedly rude hand gesture. If found guilty, Ali, whose next hearing is on March 7, will be disqualified from the race.\nEgyptian President Abdel Fattah al-Sisi is expected to seek a second term, but has yet to announce his candidacy. Over three-quarters of parliamentarians expressed support for Sisi the day after the election date was announced.\nSisi’s critics say his popularity has been dimmed by austerity reforms, security problems and a crackdown on dissidents.\nThe former general won a landslide victory in an election in 2014, a year after he led, as a military commander, the overthrow of elected President Mursi.\nReporting by Ali Abdelaty and Mahmoud Mourad; writing by John Davison and Arwa Gaballa; editing by Andrew Roche and Lisa Shumaker\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T05:33:00.000+02:00", "crawled": "2018-01-12T04:51:55.013+02:00", "highlightTitle": ""}