{"organizations": [], "uuid": "0fa9e3a21f19a253d30a8539d6efa3fe67e48d02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-proampac-completes-acquisition-of-bonita-pioneer-packaging-products.html", "country": "US", "domain_rank": 767, "title": "ProAmpac Completes Acquisition of Bonita Pioneer Packaging Products", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-09T14:00:00.000+02:00", "replies_count": 0, "uuid": "0fa9e3a21f19a253d30a8539d6efa3fe67e48d02"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-proampac-completes-acquisition-of-bonita-pioneer-packaging-products.html", "ord_in_thread": 0, "title": "ProAmpac Completes Acquisition of Bonita Pioneer Packaging Products", "locations": [], "entities": {"persons": [{"name": "greg tucker", "sentiment": "none"}, {"name": "bonita", "sentiment": "none"}], "locations": [{"name": "cincinnati", "sentiment": "none"}, {"name": "southeastern u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "bonita", "sentiment": "none"}], "organizations": [{"name": "proampac completes acquisition of bonita pioneer packaging products", "sentiment": "negative"}, {"name": "bonita pioneer packaging products", "sentiment": "none"}, {"name": "pritzker group private capital", "sentiment": "none"}, {"name": "bonita", "sentiment": "none"}, {"name": "proampac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CINCINNATI--(BUSINESS WIRE)-- ProAmpac, one of the nation’s largest and fastest-growing flexible packaging manufacturers, today announced the acquisition of Oregon-based Bonita Pioneer Packaging Products (Bonita). Specializing in paper packaging products including custom and stock shopping bags, merchandise bags, foodservice packaging, and folding cartons, Bonita product complements ProAmpac’s existing flexible packaging offerings. Financial terms of the deal were not disclosed.\n“The acquisition of Bonita expands ProAmpac’s paper packaging manufacturing footprint in the Western and Southeastern U.S., creating more value and optimizing services for our customers,” said ProAmpac CEO Greg Tucker.\nCincinnati-based ProAmpac, one of the top 10 flexible packaging converters in the United States, is owned by Pritzker Group Private Capital along with management and co-investors. With the addition of Bonita, ProAmpac now has 27 manufacturing sites globally with nearly 3,300 employees supplying more than 5,000 customers in 90 countries. ProAmpac primarily manufactures products servicing the food, pet care, health care, lawn care, and retail markets as well as providing secure packaging for the transport of cash and valuables.\nWhen founded in Portland, Oregon, in 1989, Bonita Packaging Products was the only full-line retail packaging supplier in the U.S. The business will become part of the ProAmpac brand and operate as part of the U.S. Flexibles Division, led by President Tom Geyer.\n“Bonita has a reputation for responsive customer service and quality. Couple that with its award-winning printing capabilities, and customers now have an unrivaled source for paper products within ProAmpac,” stated Geyer.\nChris Trick, Pritzker Group Private Capital principal, said, “The Bonita acquisition is a compelling opportunity for ProAmpac to further its leadership position in retail and foodservice paper bags and underscores our continued commitment to supporting ProAmpac’s growth strategy.”\nAbout ProAmpac\nProAmpac is a leading global flexible packaging company with a comprehensive product offering unparalleled in the industry. We provide creative packaging solutions, industry-leading customer service and award-winning innovation to a diverse global marketplace. We are guided in our work by four core values that are the basis for our success: Integrity, Intensity, Innovation and Involvement. For more information, visit proampac.com .\nAbout Pritzker Group\nPritzker Group, founded by Tony and J.B. Pritzker, has three principal investment teams: Private Capital, which acquires and operates leading North America-based companies; Venture Capital, which provides early-stage and growth venture funding to technology companies throughout the United States; and Asset Management, which partners with top-performing investment managers across global public markets.\nPritzker Group Private Capital acquires North America-based middle-market companies with leading positions in the manufactured products, services and health care sectors. The firm’s differentiated, long-dated capital base allows for efficient decision-making, broad flexibility with transaction structure and investment horizon, and alignment with management teams focused on creating long-term value. Pritzker Group brings significant resources, expertise and credibility in building businesses and is an ideal partner for entrepreneur- and family-owned companies. For more information, visit pritzkergroup.com .\n //www.businesswire.com/news/home/20180109005317/en/\nAileron Communications\nMartha Arendt, 312.629.9400\nmarendt@aileroninc.com\nor\nProAmpac\nKristy Paulin, 413.875.9872\nKristy.Paulin@ProAmpac.com\nSource: ProAmpac", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.pritzkergroup.com%2Fprivate-capital%2F&esheet=51739910&newsitemid=20180109005317&lan=en-US&anchor=pritzkergroup.com&index=2&md5=6deb22b91529357007187323e9369be6", "http://www.businesswire.com/news/home/20180109005317/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fprotect-us.mimecast.com%2Fs%2FlNGABmS7ZdOun%3Fdomain%3Dproampac.com&esheet=51739910&newsitemid=20180109005317&lan=en-US&anchor=proampac.com&index=1&md5=594f59f8b17f69f2511b1e26b8e42e60"], "published": "2018-01-09T14:00:00.000+02:00", "crawled": "2018-01-09T15:39:33.001+02:00", "highlightTitle": ""}