{"organizations": [], "uuid": "1d62c58d0f7bb72bb538fef2d7e7b167dfbba6c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/15/104284856-Reed_Hastings_Netflix.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/15839069/device/rss/rss.html", "section_title": "Investing", "url": "https://www.cnbc.com/2018/01/12/its-too-late-for-apple-to-buy-netflix-commentary.html", "country": "US", "domain_rank": 767, "title": "It's too late for Apple to buy Netflix COMMENTARY", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:56:00.000+02:00", "replies_count": 0, "uuid": "1d62c58d0f7bb72bb538fef2d7e7b167dfbba6c5"}, "author": "Eric Jackson", "url": "https://www.cnbc.com/2018/01/12/its-too-late-for-apple-to-buy-netflix-commentary.html", "ord_in_thread": 0, "title": "It's too late for Apple to buy Netflix COMMENTARY", "locations": [], "entities": {"persons": [{"name": "reed hastings", "sentiment": "none"}, {"name": "tim cook", "sentiment": "none"}, {"name": "barry ritholtz", "sentiment": "none"}], "locations": [{"name": "bloomberg view", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "netflix commentary getty images reed hastings", "sentiment": "negative"}, {"name": "netflix", "sentiment": "negative"}, {"name": "reed hastings", "sentiment": "none"}, {"name": "reed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images Reed Hastings, CEO, Netflix Recently, there's been a lot of talk about Apple possibly buying Netflix . The new round of speculation seems to have been kick-started by Barry Ritholtz in Bloomberg View last November . (Some skeptical takes are here and here .)\nForget it. It's too late. There's no chance this will happen now.\nHere's why.\nIt's too expensive — even for Apple.\nNetflix is trading at all-time highs. Its market cap is around $94 billion. Barry Ritholtz's piece in November thought that Apple could pick it up for $100 billion. I can guarantee you that there's no chance that Tim Cook could buy Netflix from Reed Hastings for just a 6% premium.\nAnd never forget that Reed Hastings is a Netflix founder. Founders generally see enormous potential ahead of the business and are reluctant to pass over the keys to their car for a tiny premium.\nIt would be especially difficult for Reed to sell when Netflix has reached escape velocity as an Over-The-Top (OTT) service and continues to see robust subscription growth across the world. Most new TVs today come with distinct Netflix buttons on the remotes.\nNetflix now has over 100 million subscribers worldwide. A few years ago, many analysts and observers thought it was unlikely that they'd break past 30 million domestic subscribers because that had previously been a ceiling for HBO.\nOf course, there's strategic logic to Apple buying Netflix. They have a subscription music service in Apple Music. They certainly need a subscription video service. They've already hired Hollywood talent to oversee their own original video strategy and they've earmarked money for stars like Jennifer Anniston and Reese Witherspoon . They're going to need a video service. They won't just throw it up on Apple Music and hope that you see it like Planet of the Apps.\nBut my guess is that, Apple being Apple (i.e., acquisition averse), they'll just do it themselves without buying anyone.\nDon't get me wrong, I've long wanted to see Apple go on an acquisition binge. I'd previously argued in 2011 when Facebook was worth $50 billion that Apple should buy it for $100 billion. Last year, around this time, I pointed out that Apple had really missed the window to buy Tesla , Netflix, and Instagram.\nThe time to acquire Netflix would have been back in 2014 or earlier. Back then, Netflix was still in the early days of rolling out its original programming strategy. Its subscriber base was much smaller. And — most importantly — its market cap was about 25% of where it is currently.\nAs a Netflix shareholder, I'd benefit if there was some buyout of the company. But I don't think Reed Hastings would accept an offer even at a 100% premium today. And it would likely take that type of premium just to get him and his board to consider it. That's simply too big a check — even for Apple, the biggest company in the world. You're talking a $200 billion takeout price.\nApple can still have success doing its own thing with its video service. It will probably be the #2 streaming service behind Netflix for a while (perhaps until Disney's service launches in 2019). It has the #2 music service with Apple Music after Spotify. Apple still has a lot of potential for future growth in front of it.\nI will still scratch my head though at why they weren't more aggressive from an M&A perspective a few years ago — even if they would have had to pay a little bit more in repatriation taxes to do so.\nThe window to buy Netflix is now firmly shut.\n[Affiliates controlled by Eric Jackson have long positions in NFLX, DIS and AAPL]\nCommentary by Eric Jackson, sign up for Eric's monthly Tech & Media Email and his Podcast . You can follow Eric on Twitter @ericjackson .", "external_links": ["http://deadline.com/2017/11/apple-reese-witherspoon-jennifer-aniston-morning-show-series-2-season-order-amazing-stories-reboot-1202204293/", "https://www.apple.com/ca/newsroom/2017/06/jamie-erlicht-and-zack-van-amburg-joining-apple-to-lead-video-programming/", "https://www.forbes.com/sites/ericjackson/2017/02/08/apple-needs-to-do-more-ma/#53af5bb27900", "https://www.twitter.com/ericjackson", "https://www.thestreet.com/story/11019757/1/why-apple-should-pay-100-billion-to-buy-facebook.html", "https://www.forbes.com/sites/ericjackson/2014/02/20/the-folly-of-stand-pat-apple/2/#4ab3d74057aa", "https://www.bloomberg.com/view/articles/2017-11-07/why-apple-should-buy-netflix", "https://investorplace.com/2018/01/apple-rumors-netflix-nflx-stock/#.Wle-k66nHIU", "http://twitter.us11.list-manage.com/subscribe?u=886b833e7ee9981fff7354cd9&id=5b7ea69431", "https://itunes.apple.com/ca/podcast/the-eric-jackson-podcast/id1009301965?mt=2", "https://seekingalpha.com/article/4136862-will-apple-buy-netflix"], "published": "2018-01-12T18:56:00.000+02:00", "crawled": "2018-01-12T17:59:19.000+02:00", "highlightTitle": ""}