{"organizations": [], "uuid": "f7ff30e548f44fd4d224e7e22f6ef1a313c953b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-metals/metals-shanghai-nickel-jumps-on-tight-stocks-output-concerns-idUSL4N1P61QA", "country": "US", "domain_rank": 408, "title": "METALS-Shanghai nickel jumps on tight stocks, output concerns", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T07:16:00.000+02:00", "replies_count": 0, "uuid": "f7ff30e548f44fd4d224e7e22f6ef1a313c953b1"}, "author": "", "url": "https://www.reuters.com/article/global-metals/metals-shanghai-nickel-jumps-on-tight-stocks-output-concerns-idUSL4N1P61QA", "ord_in_thread": 0, "title": "METALS-Shanghai nickel jumps on tight stocks, output concerns", "locations": [], "entities": {"persons": [{"name": "antaike", "sentiment": "none"}, {"name": "xu aidong", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "madagascar", "sentiment": "none"}, {"name": "zambales", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "shanghai futures exchange", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sumitomo corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 5:19 AM / Updated 2 hours ago METALS-Shanghai nickel hits 2-month high on tight stocks, output concerns Reuters Staff 5 Min Read \n(Adds Shanghai closing prices, updates London prices) BEIJING, Jan 11 (Reuters) - Nickel prices on the Shanghai Futures Exchange (ShFE) climbed by more than 1 percent to their highest in two months on Thursday, as concerns over low stock levels and production outages lent support to the market. \"Nickel cathode in the warehouses is very tight... so there is some possibility to squeeze selling positions,\" said Xu Aidong, chief nickel analyst, Antaike. Deliverable ShFE nickel warehouse stocks stood at 48,920 tonnes as of Jan. 5, compared with over 90,000 tonnes a year ago. Four nickel mines in the Zambales region of the Philippines, a key nickel exporter, remain shut on environmental grounds, an official said on Thursday, while Japan's Sumitomo Corp has suspended output at a mine in Madagascar following a cyclone. \"The four mines in Zambales are still not allowed to resume production,\" said Wilfredo Moncano, director of the Philippine Mines and Geosciences Bureau. \"No extraction, no new mining activities. What's only allowed is hauling of ores from their stockpiles.\" FUNDAMENTALS * SHFE NICKEL: The most traded Shanghai nickel contract finished up 1.1 percent at 101,430 yuan ($15,587.83) a tonne, its highest close since Nov. 8. * LME NICKEL: Benchmark nickel on the London Metal Exchange (LME) was down 0.50 percent at $12,870 a tonne, as of 0720 GMT, partly reversing Wednesday's gains, when it touched $13,200 a tonne, its highest since June 2015. * MADAGASCAR: Sumitomo said on Thursday the company and its partners Sherritt International Corp and Korea Resources Corp halted output at the Ambatovy nickel mine in Madagascar on Jan. 4, the day before Cyclone Ava hit the area. * ALUMINIUM: The most-traded aluminium contract on the ShFE closed up 1.2 percent at 15,210 yuan per tonne, and was up 1 percent in London. \"This was a metal that you couldn't give away 36 hours ago but now it seems the selling from the index rebalancing is viewed as very digestible,\" broker Marex Spectron said in a note on Thursday. * DUNKIRK: Liberty House, the industrial arm of British steel tycoon Sanjeev Gupta's GFG Alliance, has made a binding offer for miner Rio Tinto's aluminium smelter in Dunkirk, France, the largest in Europe. * COPPER: Three-month copper on the LME was up 0.1 percent at $7,163 a tonne, building on its 0.7 percent gain in the previous session. The most-traded SHFE copper contract closed up 0.4 percent at 55,110 yuan a tonne. * CHINA: Tongling Nonferrous Metals Group, one of China's top copper smelters, will suspend production at its Jinguan Copper unit for three days from Friday for repairs, a source familiar with the matter said. * PERU: The government of Peruvian President Pedro Pablo Kuczynski is evaluating a $2.4 billion railway project to transport mineral concentrates from a copper-rich Andean region to the Pacific coast for export. * COBALT: Democratic Republic of Congo is considering more than doubling royalties on cobalt, a key ingredient in lithium-ion batteries, under a new mining code nearing parliamentary approval, the mines minister said on Wednesday. * For the top stories in metals and other news, click or MARKETS NEWS * The New Year rally in Asian shares petered out on Thursday due to concerns about rising U.S. protectionism, while bonds rebounded after China's regulator called a report about Beijing slowing or halting of its U.S. bond buying possibly wrong. PRICES BASE METALS PRICES 0720 GMT Three month LME copper 7163 Most active ShFE copper 55100 Three month LME aluminium 2199 Most active ShFE aluminium 15210 Three month LME zinc 3362 Most active ShFE zinc 26255 Three month LME lead 2558.5 Most active ShFE lead 19385 Three month LME nickel 12870 Most active ShFE nickel 101410 Three month LME tin 20010 Most active ShFE tin 145160 BASE METALS ARBITRAGE LME/SHFE COPPER LMESHFCUc3 719.9 LME/SHFE ALUMINIUM LMESHFALc3 -1445.42 LME/SHFE ZINC LMESHFZNc3 380.23 LME/SHFE LEAD LMESHFPBc3 -676.22 LME/SHFE NICKEL LMESHFNIc3 1668.01 ($1 = 6.5070 Chinese yuan) (Reporting by Tom Daly; additional reporting by Enrico Dela Cruz in Manila; Editing by Sherry Jacob-Phillips and Subhranshu Sahu)", "external_links": [], "published": "2018-01-11T07:16:00.000+02:00", "crawled": "2018-01-11T07:35:34.034+02:00", "highlightTitle": ""}