{"organizations": [], "uuid": "50c64b9ca3b42b19d20d91d7031100a42ae25ac4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220043059&w=1200&r=LYNXMPEE060I8", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-israel-palestinians-usa/netanyahu-tiptoes-around-u-s-threat-to-cut-off-palestinian-aid-idUSKBN1EW0M4", "country": "US", "domain_rank": 408, "title": "Netanyahu tiptoes around U.S. threat to cut off Palestinian aid", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T16:51:00.000+02:00", "replies_count": 0, "uuid": "50c64b9ca3b42b19d20d91d7031100a42ae25ac4"}, "author": "", "url": "https://www.reuters.com/article/us-israel-palestinians-usa/netanyahu-tiptoes-around-u-s-threat-to-cut-off-palestinian-aid-idUSKBN1EW0M4", "ord_in_thread": 0, "title": "Netanyahu tiptoes around U.S. threat to cut off Palestinian aid", "locations": [], "entities": {"persons": [{"name": "netanyahu", "sentiment": "negative"}, {"name": "jeffrey heller", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "benjamin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "unrwa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 2:51 PM / Updated an hour ago Netanyahu tiptoes around U.S. threat to cut off Palestinian aid Jeffrey Heller 3 Min Read \nJERUSALEM (Reuters) - Israeli Prime Minister Benjamin trod carefully on Sunday around a threatened U.S. aid cut to Palestinians, stopping short of backing a funding halt as he repeated calls for a U.N. agency that helps Palestinian refugees to be dismantled. \nNetanyahu’s public comments appeared to reflect a desire to show support for a major ally, but also concern that choking off funds would deepen Palestinian hardship and could put Israel and militants on a course for war. \nWith Palestinians seething over U.S. President Donald Trump’s recognition last month of Jerusalem as Israel’s capital, he threatened on Tuesday to withhold aid money, accusing them of being “no longer willing to talk peace”. \nOn Friday, in a report denied by a State Department official, the Axios news site said Washington had frozen $125 million in funding for UNRWA. The U.N. agency, founded in 1949 to aid Palestinian refugees, is a main provider of educational and health services in the Gaza Strip. \nNetanyahu said UNRWA was “an organization that perpetuates the Palestinian problem.” \n“It also enshrines the narrative of the so-called ‘right of return’. Therefore, UNRWA should pass from the world,” he told a weekly cabinet meeting. \nNetanyahu made almost identical comments about dismantling UNRWA in June - a message he said at the time he had conveyed to the U.S. ambassador to the United Nations. Israeli Prime Minister Benjamin Netanyahu attends the weekly cabinet meeting at the Prime Minister's office in Jerusalem January 7, 2018. REUTERS/Abir Sultan/Pool \nPraising Trump’s “critical approach” on the aid issue, Netanyahu steered clear of advocating a suspension of funding for the Palestinians. He said U.N. money for them should be transferred gradually to its global refugee agency UNHCR “with clear criteria for supporting genuine refugees and not fictitious ones, as is happening today under UNRWA.” \nChris Gunness, an UNRWA spokesman, said the refugee crisis was being perpetuated by “failure of the parties to deal with the issue...” Israeli Prime Minister Benjamin Netanyahu arrives to attend the weekly cabinet meeting at the Prime Minister's office in Jerusalem January 7, 2018. REUTERS/Abir Sultan/Pool \n“UNRWA is mandated by the General Assembly to continue with its services until a just and lasting solution is found for the Palestine refugees,” Gunness said in a statement. \nPalestinian officials have said Trump’s declaration on Jerusalem, overturning decades of U.S. policy, meant he could not serve as an honest broker in peace negotiations that Washington has been trying to revive, and they condemned his remarks on a funding halt as blackmail. \nPalestinians want East Jerusalem as the capital of a state they seek to establish in the West Bank and Gaza Strip. \nThe United States is the largest donor to UNRWA, with a pledge of nearly $370 million as of 2016, according to the organization’s website. Gunness said the agency had not been “informed directly of a formal decision either way by the U.S. administration” on cuts. \nIn addition to its services in Gaza, UNRWA operates in the Israeli-occupied West Bank and in Jordan, Syria and Lebanon. editing by John Stonestreet", "external_links": [], "published": "2018-01-07T16:51:00.000+02:00", "crawled": "2018-01-07T17:04:56.005+02:00", "highlightTitle": ""}