{"organizations": [], "uuid": "be15b37bca3917d2a172b2ee72f08c32a589861a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-whats-worse-that-holding-a-carillion-share-idUSL8N1PC3XK", "country": "US", "domain_rank": 408, "title": "REFILE-LIVE MARKETS-What's worse than holding a Carillion share?", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T15:13:00.000+02:00", "replies_count": 0, "uuid": "be15b37bca3917d2a172b2ee72f08c32a589861a"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-whats-worse-that-holding-a-carillion-share-idUSL8N1PC3XK", "ord_in_thread": 0, "title": "REFILE-LIVE MARKETS-What's worse than holding a Carillion share?", "locations": [], "entities": {"persons": [{"name": "pearson", "sentiment": "none"}, {"name": "julien ponthus", "sentiment": "none"}, {"name": "danilo masoni", "sentiment": "none"}, {"name": "abhinav ramn", "sentiment": "none"}], "locations": [], "organizations": [{"name": "carillion", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "asml", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 1:12 PM / in an hour REFILE-LIVE MARKETS-What's worse than holding a Carillion share? Reuters Staff 10 Min Read (Fixes garble in headline) * European shares dip * Earnings in focus: ASML, Casino, Pearson * Informa agrees to buy UBM Jan 17 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Danilo Masoni. Reach him on Messenger to share your thoughts on market moves: danilo.masoni.thomsonreuters.com@reuters.net WHAT'S WORSE THAN OWNING A CARILLION SHARE? (1243 GMT) Holding a Carillion bond? While bond holders can usually expect to salvage some value in a bankruptcy, it appears the market is pricing in close to nothing for holders of Carillion's December 2019 convertible bond . It is trading at a cash price of less than 2, which roughly means it holds less than 2 percent of its face value. Yield: 286 percent... (the figure is purely theoretical given the bankruptcy procedure). Here's the bond's performance over the last 6 months: (Julien Ponthus and Abhinav Ramnarayan) U.S. EQUITIES, HAVE YOU SEEN THE RED FLAG? (NO, NOT THAT ONE) (1210 GMT) There's a warning sign creeping up on U.S. shares and, no, it's not the P/E ratios, Deutsche Bank's research found. \"While equity investors remain fixated on the market’s valuation relative to earnings, it is the dividend bubble quietly inflating in the background that should be of far greater concern\", the banks wrote in its \"13 tipping points in 2018\". It argues that \"History shows the Shiller multiple is terrible at indicating the right time to buy and sell\". \"The evidence shows that market gains in recent years have been propped up by unsustainable expectations of future dividends, and there are signs that 2018 could be the year the trend finally turns\", it believes. Here's a chart showing how a number of companies are stretching their pay-out ratio to keep up with dividend inflation: (Julien Ponthus) EUROPEAN BANKS ARE GARNERING ATTENTION (1153 GMT) In keeping with this wave of love for cyclical stocks, this time we've got analysts at Bankhaus Lampe saying that they prefer European banks over financial services. Bankhaus Lampe reckon that financial services, such as exchanges, will be supported by rising U.S. interest rates in the near term, but volatility is low and further gains for stocks such as asset managers may be more limited. \"Longer term (>12m), we believe that banks have greater upside potential, driven by yield curve steepening (QE tapering), cost savings (e-banking) and sector consolidation (or share buybacks) now that capital regulations (Basel 3) have been finalised,\" Bankhaus Lampe analysts say in a note. (Kit Rees) THE SILVER LINING TO A STRONGER EURO (1134 GMT) As the euro moves lower, European shares have cut losses with the STOXX 600 flat in late morning trade. But while there have been concerns more broadly about the euro's rise denting European company earnings, there is also a more positive view out there, as voiced by Chris Bailey, European strategist at Raymond James: \"Higher sentiment also means higher faith in pan-EU growth rates ... and with this comes the opportunity: outperformance and higher multiple potential for the more EU ‘domestic' -centred profit and cash flow generators,\" says Bailey in a note. \"That pushes you towards sectors including the financials, construction, retail, and telecoms versus the more export-centred ones.\" (Kit Rees) THE PROBLEM WITH \"VERY BRITISH\", BRITISH SHARES (1110 GMT) Viewed from the office of a Parisian asset manager, Carillion's collapse and this morning's concern surrounding Interserve are early signs of the pain Brexit is expected to bring and another reason to stay underweight on British shares. \"For all 'very British', British companies (that is almost entirely exposed to the UK economy) one can see that there is an issue with faltering sales\", said Olivier de Berranger, who heads asset management at France's La Financière de l’Echiquier. \"Markets pay little attention to Brexit but there are worrying signs like the bankruptcy of Carillion or the decrease in traffic at Eurotunnel\", de Berranger told Reuters' Paris markets team. (Blandine Henault and Julien Ponthus) WHAT COULD SPOIL THE EUROPEAN EQUITY PARTY? (1007 GMT) On a day like today, it's sobering to consider what could go wrong for European equities. \"No one wants to be dancing when the music stops, but the last part of a bull market tends to produce some of the most powerful returns,\" UBS' strategists say in a note, predicting around 15 percent of total returns in European equities in 2018. UBS flags rising U.S. yields, euro strength, PMIs rolling over and volatility picking up as potential spanners in the works, though. (Kit Rees) EUROPE JOINS GLOBAL GLOOM, INTERSERVE FALLS IN POST-CARILLION SCARE (0820 GMT) As expected, European markets opened on a downward trend, in sync with a gloomy global mood which dampened Wall Street and Asian markets. All main bourses and sectors are down with the exception of tech, boosted by the results of ASML. British contractor Interserve is taking a 10 percent hit after the Financial Times reported that government ministers are \"very worried\" and have set up a team of officials to monitor the company following the collapse of competitor Carillion. Still in the UK but on a brighter note, events organiser UBM is surging 15 percent after a 3.8 billion pound bid from Informa. Here are the top movers on the STOXX 600 which is down 0.22 percent. (Julien Ponthus) WHAT YOU NEED TO KNOW (0748 GMT) European shares are expected to open lower today with index futures pointing to losses of around 0.1-0.4 percent, as markets pull back following a new year rally that a lifted the pan-European STOXX 600 benchmark to its highest since August 2015. Earnings are likely to be the main focus with ASML in the spotlight after the chip tool maker reported a better-than-expected net profit for the fourth quarter as several customers asked for early delivery of products amid a booming semiconductor industry. For 2018, the company said it expected continued solid growth of sales and profitability. Eyes also on retailer Casino, which said it would deliver on its 2017 profit growth forecasts despite posting slightly softer fourth quarter sales, and manufacturing group Alstom, which reported higher third-quarter sales and kept its 2020 financial targets. UK education group Pearson predicted underlying profit growth in 2018 despite ongoing pressures in its North American business. In M&A, Britain's Informa made a cash and paper offer to buy events organiser UBM , while Nestle agreed to sell its U.S. confectionery business to Italy's Ferrero for $2.8 billion. Baader Bank noted Nestle got an attractive price for a business that's losing market share. Interserve could be hit after the FT reported that the construction service provider was under UK government watch over financial health fears. Other stock movers: European car sales drop 4.8 pct in December, Rio", "external_links": [], "published": "2018-01-17T15:13:00.000+02:00", "crawled": "2018-01-17T15:49:07.039+02:00", "highlightTitle": ""}