{"organizations": [], "uuid": "dcd15a4842afa74df76a923955ffa9833e9b6ae5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225148616&w=1200&r=LYNXMPEE0O0Z0", "site_section": "http://feeds.reuters.com/reuters/sportsNews/", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-alps-ligety/alpine-skiing-ligety-looks-to-reignite-rivalry-with-hirscher-idUSKBN1FE1T8", "country": "US", "domain_rank": 408, "title": "Alpine skiing: Ligety looks to reignite rivalry with Hirscher", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:05:00.000+02:00", "replies_count": 0, "uuid": "dcd15a4842afa74df76a923955ffa9833e9b6ae5"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-alps-ligety/alpine-skiing-ligety-looks-to-reignite-rivalry-with-hirscher-idUSKBN1FE1T8", "ord_in_thread": 0, "title": "Alpine skiing: Ligety looks to reignite rivalry with Hirscher", "locations": [], "entities": {"persons": [{"name": "ligety", "sentiment": "negative"}, {"name": "hirsc", "sentiment": "negative"}, {"name": "rory carroll", "sentiment": "none"}, {"name": "ted ligety", "sentiment": "none"}, {"name": "hirscher", "sentiment": "none"}, {"name": "marcel hirscher", "sentiment": "none"}], "locations": [{"name": "alta badia", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 1:10 PM / in 3 minutes Alpine skiing: Ligety looks to reignite rivalry with Hirscher Rory Carroll 3 Min Read \n(Reuters) - One of the great rivalries in alpine skiing will be renewed at the Pyeongchang Winter Olympics, but American Ted Ligety is well aware that Austria’s Marcel Hirscher could be in a league of his own at the moment. \nNot only is Hirscher dominating the World Cup circuit, but Ligety, who has won two Olympic golds, is only making his way back into form following knee surgery in 2016 and back surgery last year that sidelined the 33-year-old Utah native. \n“Before I had my string of injuries we were definitely rivals, going back and forth in giant slalom for a bunch of years,” Ligety told Reuters on Wednesday. “Hopefully after the Olympics we’ll be considered rivals again.” \nLigety said he was now completely healthy and despite failing to reach a podium since his return to the World Cup circuit late last year, has shown steady improvement, including a fifth place in Alta Badia in giant slalom last month. \nWhile the five-times world champion has struggled to reach the podium, the 28-year-old Hirscher has been virtually unstoppable on the World Cup circuit. \nHirscher claimed his sixth slalom victory this season on Tuesday with a win in Schladming and moved closer to a seventh successive overall title. \n“Hirscher has been on a tear this year and I’d rather not be competing against him,” Ligety said with a laugh. \n“He’s been that good.” \nThat form made him arguably the favorite to win his first gold medal in Pyeongchang, but Ligety said his previous success at the Yongpyong Alpine Centre, where he won his first World Cup giant slalom race in 2006, could be a factor. \n“That’s definitely a nice confidence booster because it’s a hill that suits my style really well,” he said. \nIn addition to defending his giant slalom gold medal from Sochi, Ligety will also compete in the super-G and the combined, where he won gold in Turin in 2006. \n“The hills for the combined and the super-G line up well for me as well,” he said. \n”They are technical hills where having turning ability is really important. \n”It’s a place where you really have to be able to turn and be able to tack and that’s something that suits my technique really well. \n“So I think I have a good chance there as well.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-25T15:05:00.000+02:00", "crawled": "2018-01-25T15:25:29.010+02:00", "highlightTitle": ""}