{"organizations": [], "uuid": "0fffffb63aa882147c0e1b0cdc9a95d837173aac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-heartwood-prefers-commodities-over-stocks-on-reflation-play-idUSL8N1PI5TB", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Heartwood prefers commodities over stocks on reflation play", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:43:00.000+02:00", "replies_count": 0, "uuid": "0fffffb63aa882147c0e1b0cdc9a95d837173aac"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-heartwood-prefers-commodities-over-stocks-on-reflation-play-idUSL8N1PI5TB", "ord_in_thread": 0, "title": "LIVE MARKETS-Heartwood prefers commodities over stocks on reflation play", "locations": [], "entities": {"persons": [{"name": "julien ponthus", "sentiment": "none"}, {"name": "graham bishop", "sentiment": "none"}], "locations": [{"name": "heartwood", "sentiment": "none"}], "organizations": [{"name": "heartwood investment management", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 23 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Julien Ponthus. Reach him on Messenger to share your thoughts on market moves: julien.ponthus.thomsonreuters.com@reuters.net HEARTWOOD PREFERS COMMODITIES OVER STOCKS ON REFLATION PLAY (1543 GMT) Heartwood Investment Management is sticking with its neutral view on equities - a position that can't be easy to hold in this exuberant environment. Graham Bishop, investment director at Heartwood, says they've slightly reduced their cash position, based on their short-term positive view on markets. But instead of ploughing that cash into the rally in stocks, Heartwood is putting it into commodities as a way to benefit from inflationary pressures they see rising. Indeed, UBS this morning noted that 63 percent of countries now have increasing core inflation, against less than 40 percent a year ago. Within equities Bishop says he's mindful of high valuations in some parts of the market, and is tilting portfolios towards value-orientated stocks. Alternative assets also provide diversification, he adds, and could benefit from higher levels of market volatility. (Helen Reid) ARE THERE MORE GOOD THINGS TO COME FOR EUROPE? (1528 GMT) Despite the prospect of an end of quantitative easing, rising oil prices and a stronger euro, Shweta Singh, director global macro at TS Lombard, reckons there might be \"more positive surprises in store\" for the euro area. And this is thanks to ease of financing (see chart below), strong consumer confidence, increasing capex and a broad-based recovery which looks \"increasingly self-sustaining\" and leaves room for more upgrades. (Kit Rees) CROSS-BORDER M&A IN EUROPEAN TELCOS IS NOT IMMINENT (1436 GMT) Goldman Sachs has also weighed in to the telco M&A developments we mentioned earlier, but they sound a rather less optimistic note than Deutsche Bank. The cross-border strategic rationale for pan-European consolidation in telcos is \"limited but growing\", write analysts. Cross-border M&A is not imminent, but they do see opportunities in the more medium term. \"Until investors become more confident in the sustainable benefits of 'digital divergence' cost-cutting, we do not see a material re-rating potential for the sector as a whole from this cross-border consolidation theme,\" they add. And of course there are still political obstacles. \"Governments still, for the most part, see telecoms networks as strategic assets and therefore may attempt to prevent any deals between companies.\" Indeed those concerns may have been part of what halted talks between Orange and Deutsche Telekom last year, as our story detailed. \"We continue to see in-market, fixed-mobile convergence-based M&A as more imminent,\" GS analysts add, recommending TDC, Vodafone and Liberty Global. Regardless, the hope of dealmaking has already helped the telcos sector push into positive territory year-to-date. The only remaining sectors that are down since January are real estate, and food & beverage. (Helen Reid) DOES IT MAKE ANY SENSE TO HOLD BITCOIN IN PORTFOLIOS? (1350 GMT) Quant strategists at Bernstein tackle the question on everybody's lips: does it make any sense to hold bitcoin in portfolios? Their answer, in short, is no. \"How to say anything sensible about future returns? We cannot value bitcoin like an equity or a bond as it has no cash flows. We also cannot value it like a fiat currency as it has no interest rate (at least not yet),\" write Bernstein's Inigo Fraser-Jenkins and team. One benefit of the cryptocurrency is its tiny correlation to any other asset class (see below) - but given how incredibly volatile it is, Bernstein analysts conclude it would have to reliably return a whopping 5 percent per month to have a meaningful weight in a portfolio. And the environmental footprint of bitcoin mining should turn off any investor with an ESG bent. \"The very significant power consumption may attract the attention of regulators, but even before that, we cannot imagine that any pension fund which has stated an ESG goal - e.g. many across northern Europe - would be able to allocate to bitcoin in any way,\" notes Bernstein. Bitcoin is currently trading around $10,366 - nearly half its value at its peak on Dec 17 . (Helen Reid) NETFLIX VS EUROPEAN MEDIA IN TWO CHARTS (1324 GMT) Netflix shares have scaled to fresh record highs in premarket trading in the U.S. after the video streaming service trounced Wall Street targets for new subscribers in the fourth quarter. That marks a stark contrast with the fortunes of European media, which have lost two thirds of their value from the all time peak they hit in 2000, underling the structural challenges of traditional players fighting against online rivals and changing audience habits. Looking at the short term, however, the outlook for European media looks a bit brighter. \"Following a tumultuous 2017 marked by earnings disappointments and contracting multiples, we see a brighter outlook for earnings growth in 2018 against a strong macro backdrop and a more favourable events calendar, but multiples remain at risk as secular challenges persist,\" say Goldman Sachs analysts. In the two charts you can see how Netflix's spectacular share price compares with the sluggish perfomance of European media over the last few years and how the streaming service is now worth nearly half of Europe's media index. (Danilo Masoni) MORE SIGNS BANKS HAVE FURTHER TO GO (1316 GMT) Analysts at Northern Trust Capital Markets see another sign that the gains in European banks could go further. One of these is the new high on the five-year Euro inflation-linked swap rate, which has had a close correlation with European banks (see chart below). \"Bank stocks are slowly making new highs on very little news flow. Perhaps this is reflective of the ongoing style rotation, one we suspect has further to run,\" Gary Paulin, head of institutional brokerage, EMEA and APAC at Northern Trust Capital Markets, says in a note. Today banks are down slightly, however. (Kit Rees) CANNABIS: IS 1,000 PERCENT HIGH ENOUGH? (1253 GMT) The global legal cannabis market is set to grow over 1,000 percent to reach 140 billion dollars by 2027, investment bank Bryan, Garnier & Co writes in an in-depth report it just published about the industry. \"Not only is there already a sizeable black market to take share from but legalisation itself seems to be creating its own momentum,\" the report says, highlighting that the legalisation of cannabis worldwide is creating a \"rapidly expanding industry\". There's more than pharmaceutical products: \"for alcoholic drinks, cannabis beverages could potentially deliver the same benefits (\"high\") without the traditional negatives (calories, hangover),\" the investment bank writes. Bryan, Garnier & Co recommends three Canadian stocks as investment opportunities : Canopy Growth, Aurora Cannabis and Aphria. See Reuters' latest story on the subject: \"Canada's small financial firms get buzz from weed stocks\" (Julien Ponthus) WARMING UP TO GREECE (1214 GMT) Lyxor Asset Management are overweight Europe, and say they like sectors which have been lagging in terms of valuation, such as consumer discretionary, construction and small caps. Jean Baptiste Berthon, senior cross-asset strategist at Lyxor AM, also says they are becoming increasingly overweight in Greek equity ahead of a debt renegotiation, even though they're aware the Greek indices have a heavy weighting in banks. \"We think it's clearly not over for Greece. It has a lot of leeway to catch up, so Greece in our view has really become interesting, even though the restructuring will take many more years than the market anticipates,\" Berthon says. (Kit Rees) VIEWS FROM THE STREET: WILL FOX-SKY DEAL STILL GO THROUGH? (1127 GMT) Twenty-First Century Fox was gearing up for its $15.7 billion takeover of Sky but the UK competition and markets regulator (CMA) today threw a spanner in the works, saying the deal would jeopardise media plurality in the UK. \"Quelle surprise,\" Neil Campling, co-head of the global thematic group at Mirabaud Securities, writes of the not entirely unexpected ruling. But there are chinks of light for those hoping the deal will go through: the CMA set out possible remedies to its concerns including a sale or spin-off of Sky News, and appointing independent directors for the company. Sky's shares are rising to their highest since the deal was announced (at a modest 4.2 percent discount on the £10.75 offer price), suggesting investors are optimistic. \"It is only on plurality grounds that the CMA has concerns, and that is a fixable situation as per the olive branches being offered through a range of potential remedies, whereas concerns on broadcasting standards would likely have been a complete deal breaker,\" Campling adds, noting the CMA found in favour of Fox's broadcasting standards. Others are less hopeful. Liberum downgraded Sky to 'hold' this morning, saying there is a greater risk of the deal - a major driver of its 'buy' case - not occurring. \"The language of the CMA in its provisional findings suggests they are more minded to blocking the deal as a way of addressing concerns,\" Liberum analysts write. They now see a 40 percent chance the deal doesn't go through. Fox meanwhile is sticking to its guns, saying it anticipates approval of the deal by June 30. Our colleagues over at BreakingViews also reckon the bid will ride out the regulatory storm: (Helen Reid) BACK FROM REGULATORY TRIP, CITI SEES TAILWINDS FOR EUROPE'S BANKS (1119 GMT) Banks have been stand-out outperformers in Europe so far this year, up 7 percent, and while the surge in bond yields and economic growth surprises have been the key driver, easing worries over regulation also played a role. Adding to the upbeat mood over the sector's regulatory prospects is a note today from analysts at Citi, who just got back from a regulatory trip in Europe. \"Last week we met with EU, Eurozone, German and French policy makers. We visited the EU Commission, Bundesbank, the French Central Bank, the French Treasury and banking experts. Our main takeaways... point to a constructive regulatory stance towards the European banks, which is positive for the sector,\" they say. One of their key points is the lengthy implementation of the so-called Basel 3.5/4 rules which should benefit Benelux, Nordic and French banks the most. Citi has a buy rating on KBC , ABN, ING, BNP, Credit Agricole, SocGen , Danske and Jyske. (Danilo Masoni) DEUTSCHE BANK CONFESSES TO \"INVESTMENT HERESY\" (1044 GMT) \"We commit ‘investment heresy’\", DB analysts admit in their latest research, as they take an unconventional (contrarian?) view on consumer staples. In a nutshell the German investment bank disagrees with the common wisdom that \"rising U.S. 10-year treasury yields = sell staples\". DB analysts make the case that in fact, European staples are \"ultimately correlated to the yield of the currency in which they report\". They, accordingly, have \"buy\" ratings on a number of stocks such as Nestle and Heineken. (Julien Ponthus) M&A, WHETHER \"REAL OR IMAGINED\", WILL BOOST TELCOS SECTOR (1016 GMT) Long-awaited consolidation deals could be a driving force behind a brighter year for the European telcos sector, Deutsche Bank analysts say, the day after Orange and Deutsche Telekom shares were boosted by a report they had held merger talks last year. \"Reports that Deutsche Telekom was in talks with Orange would appeal to the European Commission which has long argued for a single market for Telco services, and what better demonstration than a merger of French and German incumbents,\" note analysts. Whether ramping M&A is 'real or imagined', it will help inject more optimism into telcos, they say, with smaller operators, including those with limited government ownership or more flexible governments, likely to gain from increased deals speculation. Overall they're positive on the sector which they think will do well in 2018 after two years of underperformance drove its valuations sharply down, making them relatively attractive. DB's top sector picks are Vodafone, Telenet, KPN, Telefonica and Liberty Global. (Helen Reid) BREXIT WATCHERS, WHAT DO YOU MAKE OF BLANKFEIN'S LATEST TWEET? (0947 GMT) The CEO of Goldman Sachs, which has yet to announce precise plans as to how it will move staff from the City of London to Frankfurt and Paris post-Brexit, has just delivered some high praise to France's Macron after a meeting in Versailles. (Reuters was there:) \"Feels like a new day has dawned in France,\" Lloyd Blankfein tweeted, leaving Brexit watchers speculating whether this is a hint as to where the bulk of the London jobs will go. Last October, the CEO caused some English eyebrows to rise with this tweet: \"Just left Frankfurt. Great meetings, great weather, really enjoyed it. Good, because I'll be spending a lot more time there. #Brexit\" (Julien Ponthus and Helen Reid) OPENING SNAPSHOT: DAX AT NEW RECORD, STRONG POUND WEAKENS FTSE (0809 GMT) As expected European shares have opened in positive territory with the pan-regional STOXX 600 index edging up 0.3 percent. The outstanding mover however is the DAX. The main German stock index has hit a fresh all-time high and is up 0.8 percent, while Britain's FTSE looks the weakest among big European indexes after the pound reached a post-Brexit vote high. (Danilo Masoni) WHAT YOU NEED TO KNOW (0749 GMT) European shares are set for a strong start in the wake of the rally, which took place in Asia and on Wall Street following the deal to end the U.S. government shutdown. After yesterday’s M&A-fuelled session, there is little corporate news at this stage but faith in “global synchronised growth” should continue lifting indexes to new highs. Among possible movers is Sky: Britain's competition regulator said Rupert Murdoch buying all of Sky was not in the public interest because it would give the media mogul too much influence. Also EasyJet said recent reductions in capacity by competitors in the industry were contributing to a positive trading environment, as revenues improved in the first quarter. Still in the industry, Wizz Air is keen on Alitalia but only for short, medium-haul routes. Here are a few other interesting headlines: Netflix crosses $100 bln market capitalization as subscribers surge Trump deals blow to solar makers; forcing industry to look elsewhere for growth Sweden's Com Hem Q4 underlying EBITDA just beats forecasts SGS expects sales growth in 2018 after FY profit rises Niki Lauda to buy airline he founded, say administrators Carrefour CEO steps up digital push, inks deal in China Paragon's Q1 lending rises as buy-to-let focus pays off (Julien Ponthus) TRUMP'S SOLAR TARIFFS TO HIT EUROPE TOO (0734 GMT) U.S. President Donald Trump announced late yesterday tariffs on some imported solar cells, boosting shares in U.S. solar companies but hitting rivals in Asia, such as Korean solar panel manufacturers. There could be victims in Europe too, such as Germany's SMA Solar Technology , which develops photovoltaic system technology. \"This could bother SMA's already difficult US business furthermore. SMA hosts CMD Friday maybe giving some insight soon,\" a Frankfurt-based trader said. Another trader said also shares in Solarworld, REC Silicon, Solar A/S , Soitec and Solar-Fabrik could be under pressure following Trump's move. (Danilo Masoni) FUTURES POINT TO A STRONG START FOR EUROPEAN BOURSES (0706 GMT) There seems to be little doubt as to whether European shares will follow the rally in Asia and on Wall Street which followed the deal to end the U.S. government shutdown: (Julien Ponthus) AN ECB CHEAT SHEET: FROM \"VERY DOVISH\" TO \"VERY HAWKISH\" (0650 GMT) As Thursday's ECB meeting quickly approaches, ING has drafted a \"cheat sheet\" to help investors read through Mario Draghi's carefully scripted language and decide whether his message is \"dovish\" or \"hawkish\". Here it is: (Julien Ponthus)", "external_links": [], "published": "2018-01-23T17:43:00.000+02:00", "crawled": "2018-01-23T18:10:30.002+02:00", "highlightTitle": ""}