{"organizations": [], "uuid": "e91ce244205512e74d0d8b5563e1115c42146adc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-els-reports-fourth-quarter-results.html", "country": "US", "domain_rank": 767, "title": "ELS Reports Fourth Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.101, "site_type": "news", "published": "2018-01-30T00:16:00.000+02:00", "replies_count": 0, "uuid": "e91ce244205512e74d0d8b5563e1115c42146adc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-els-reports-fourth-quarter-results.html", "ord_in_thread": 0, "title": "ELS Reports Fourth Quarter Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Continued Strong Performance; 2018 Guidance Update\nCHICAGO--(BUSINESS WIRE)-- Equity LifeStyle Properties, Inc. (NYSE: ELS) (referred to herein as \"we,\" \"us,\" and \"our\") today announced results for the quarter and year ended December 31, 2017. All per share results are reported on a fully diluted basis unless otherwise noted.\nFinancial Results for the Quarter and Year Ended December 31, 2017\nFor the quarter ended December 31, 2017, total revenues increased $16.0 million, or 7.5 percent, to $230.0 million compared to $214.0 million for the same period in 2016. Net income available for Common Stockholders for the quarter ended December 31, 2017 increased $8.0 million, or $0.08 per Common Share, to $45.0 million, or $0.51 per Common Share, compared to $37.0 million, or $0.43 per Common Share, for the same period in 2016.\nFor the year ended December 31, 2017, total revenues increased $54.9 million, or 6.3 percent, to $925.3 million compared to $870.4 million for the same period in 2016. Net income available for Common Stockholders for the year ended December 31, 2017 increased $25.9 million, or $0.25 per Common Share, to $189.9 million, or $2.17 per Common Share, compared to $164.0 million, or $1.92 per Common Share, for the same period in 2016.\nNon-GAAP Financial Measures and Portfolio Performance\nFor the quarter ended December 31, 2017, Funds from Operations (\"FFO\") available for Common Stock and OP Unit holders increased $6.9 million, or $0.06 per Common Share, to $79.4 million, or $0.84 per Common Share, compared to $72.5 million, or $0.78 per Common Share, for the same period in 2016. For the year ended December 31, 2017, FFO available for Common Stock and OP Unit holders increased $28.9 million, or $0.28 per Common Share, to $331.7 million or $3.55 per Common Share, compared to $302.8 million, or $3.27 per Common Share, for the same period in 2016.\nFor the quarter ended December 31, 2017, Normalized Funds from Operations (\"Normalized FFO\") available for Common Stock and OP Unit holders increased $7.4 million, or $0.07 per Common Share, to $82.6 million, or $0.88 per Common Share, compared to $75.2 million, or $0.81 per Common Share, for the same period in 2016. For the year ended December 31, 2017, Normalized FFO available for Common Stock and OP Unit holders increased $29.4 million, or $0.29 per Common Share, to $335.9 million, or $3.60 per Common Share, compared to $306.5 million, or $3.31 per Common Share, for the same period in 2016.\nFor the quarter ended December 31, 2017, property operating revenues, excluding deferrals, increased $12.4 million to $215.3 million compared to $202.9 million for the same period in 2016. For the year ended December 31, 2017, property operating revenues, excluding deferrals, increased $56.8 million to $875.9 million compared to $819.1 million for the same period in 2016. For the quarter ended December 31, 2017, income from property operations, excluding deferrals and property management, increased $5.3 million to $125.0 million compared to $119.7 million for the same period in 2016. For the year ended December 31, 2017, income from property operations, excluding deferrals and property management, increased $28.9 million to $508.8 million compared to $479.9 million for the same period in 2016.\nFor the quarter ended December 31, 2017, Core property operating revenues, excluding deferrals, increased approximately 6.2 percent and Core income from property operations, excluding deferrals and property management, increased approximately 4.7 percent compared to the same period in 2016. For the year ended December 31, 2017, Core property operating revenues, excluding deferrals, increased approximately 5.8 percent and Core income from property operations, excluding deferrals and property management, increased approximately 5.0 percent compared to the same period in 2016.\nAcquisition Activity\nDuring the quarter, we completed the acquisition of Bethpage Camp Resort and Grey's Point Camp, two RV resorts located in Chesapeake Bay, Virginia, having 1,034 and 728 sites, respectively. The aggregate purchase price of $134.4 million was funded with sales of shares of our common stock under our at-the-market (\"ATM\") equity offering program as discussed further below, proceeds from our revolving credit facility, and available cash.\nBalance Sheet Activity\nDuring the quarter, we sold 895,104 shares of common stock as part of our ATM equity offering program at a weighted average price of $87.88, resulting in net cash proceeds of $77.7 million.\nOn October 16, 2017, we entered into a $204.4 million secured facility with Fannie Mae, maturing in 2037 and bearing interest at 3.97 percent per annum. We used the proceeds to pay, in full, $202.2 million of loans including $2.7 million in early debt retirement costs. These loans were scheduled to mature in 2018.\nOn October 27, 2017, we entered into a new credit agreement, which amends and restates the terms of the obligations owed by us under the previous credit agreement dated as of July 17, 2014. Under the new credit agreement, we have access to a $400.0 million unsecured line of credit (\"LOC\") and a $200.0 million senior unsecured term loan. In conjunction with the new credit agreement, we also extended the maturity of our term loan to April 27, 2023.\nHurricane Irma\nDuring the quarter ended December 31, 2017, we recorded expense of $4.3 million related to debris removal and cleanup following Hurricane Irma. In addition, we recorded insurance recovery revenue of $5.5 million, which includes insurance proceeds received as a result of our first claim submission. During the quarter ended December 31, 2017, operations at our Florida Keys RV resorts were interrupted, therefore we designated them as Non-core properties. This change is reflected throughout the results presented in this release and in our Supplemental Financial Information package.\nAbout Equity LifeStyle Properties\nWe are a self-administered, self-managed real estate investment trust (\"REIT\") with headquarters in Chicago. As of January 29, 2018, we own or have an interest in 406 quality properties in 32 states and British Columbia consisting of 151,323 sites.\nFor additional information, please contact our Investor Relations Department at (800) 247-5279 or at investor_relations@equitylifestyle.com .\nConference Call\nA live webcast of our conference call discussing these results will take place tomorrow, Tuesday, January 30, 2018, at 10:00 a.m. Central Time. Please visit the Investor Information section at www.equitylifestyleproperties.com for the link. A replay of the webcast will be available for two weeks at this site.\nReporting Calendar\nQuarterly financial results and related earnings conference calls for the next three quarters are expected to occur as follows:\nRelease Date Earnings Call Fourth Quarter 2017 Monday, January 29, 2018 Tuesday, January 30, 2018 10:00 a.m. CT First Quarter 2018 Monday, April 23, 2018 Tuesday, April 24, 2018 10:00 a.m. CT Second Quarter 2018 Monday, July 23, 2018 Tuesday, July 24, 2018 10:00 a.m. CT Third Quarter 2018 Monday, October 22, 2018 Tuesday, October 23, 2018 10:00 a.m. CT Forward-Looking Statements\nIn addition to historical information, this press release includes certain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. When used, words such as \"anticipate,\" \"expect,\" \"believe,\" \"project,\" \"intend,\" \"may be\" and \"will be\" and similar words or phrases, or the negative thereof, unless the context requires otherwise, are intended to identify forward-looking statements and may include without limitation, information regarding our expectations, goals or intentions regarding the future, and the expected effect of our acquisitions. These forward-looking statements are subject to numerous assumptions, risks and uncertainties, including, but not limited to:\nour ability to control costs, real estate market conditions, the actual rate of decline in customers, the actual use of sites by customers and our success in acquiring new customers at our properties (including those that we may acquire); our ability to maintain historical or increase future rental rates and occupancy with respect to properties currently owned or that we may acquire; our ability to retain and attract customers renewing, upgrading and entering right-to-use contracts; our assumptions about rental and home sales markets; our assumptions and guidance concerning 2018 estimated net income, FFO and Normalized FFO; our ability to manage counterparty risk; in the age-qualified properties, home sales results could be impacted by the ability of potential home buyers to sell their existing residences as well as by financial, credit and capital markets volatility; results from home sales and occupancy will continue to be impacted by local economic conditions, lack of affordable manufactured home financing and competition from alternative housing options including site-built single-family housing; impact of government intervention to stabilize site-built single-family housing and not manufactured housing; effective integration of recent acquisitions and our estimates regarding the future performance of recent acquisitions; the completion of future transactions in their entirety, if any, and timing and effective integration with respect thereto; unanticipated costs or unforeseen liabilities associated with recent acquisitions; ability to obtain financing or refinance existing debt on favorable terms or at all; the effect of interest rates; the dilutive effects of issuing additional securities; the effect of accounting for the entry of contracts with customers representing a right-to-use the properties under the Codification Topic \"Revenue Recognition\"; the outcome of pending or future lawsuits or actions brought against us, including those disclosed in our filings with the Securities and Exchange Commission; and other risks indicated from time to time in our filings with the Securities and Exchange Commission.\nFor further information on these and other factors that could impact us and the statements contained herein, refer to our filings with the Securities and Exchange Commission, including \"Risk Factors\" in our most recent Annual Report on Form 10-K and subsequent quarterly reports on Form 10-Q.\nThese forward-looking statements are based on management's present expectations and beliefs about future events. As with any projection or forecast, these statements are inherently susceptible to uncertainty and changes in circumstances. We are under no obligation to, and expressly disclaim any obligation to, update or alter our forward-looking statements whether as a result of such changes, new information, subsequent events or otherwise.\nInvestor Information\nEquity Research Coverage (1) Robert W. Baird & Company Cantor Fitzgerald Green Street Advisors Drew T. Babin Gaurav Mehta Ryan Burke/Ryan Lumb 215-553-7816 212-915-1221 949-640-8780 dbabin@rwbaird.com\ngmehta@cantor.com\nrburke@greenstreetadvisors.com\nrlumb@greenstreetadvisors.com\nBank of America Merrill Lynch\nGlobal Research\nCiti Research Wells Fargo Securities Jeffrey Spector Michael Bilerman/ Nick Joseph Todd Stender 646-855-1363 212-816-1383 562-637-1371 jeff.spector@baml.com\nmichael.bilerman@citi.com\ntodd.stender@wellsfargo.com\nnicholas.joseph@citi.com\nBMO Capital Markets Evercore ISI John Kim Steve Sakwa/ Samir Khanal 212-885-4115 212-446-5600 johnp.kim@bmo.com\nsteve.sakwa@evercoreisi.com\nsamir.khanal@evercoreisi.com\n1.\nAny opinions, estimates or forecasts regarding our performance made by these analysts or agencies do not represent our opinions, forecasts or predictions. We do not by reference to these firms imply our endorsement of or concurrence with such information, conclusions or recommendations.\nFinancial Highlights\n(In millions, except Common Stock and OP Units outstanding and per share data, unaudited)\nAs of and for the Three Months Ended December 31,\n2017\nSeptember 30,\n2017\nJune 30,\n2017\nMarch 31,\n2017\nDecember 31,\n2016\nOperating Information Total revenues $ 230.0 $ 241.6 $ 221.3 $ 232.4 $ 214.0 Net income $ 48.0 $ 54.9 $ 44.5 $ 63.1 $ 42.4 Net income available for Common Stockholders $ 45.0 $ 48.5 $ 39.5 $ 56.9 $ 37.0 Adjusted EBITDA (1) $ 106.7 $ 111.5 $ 100.8 $ 118.9 $ 101.4 FFO available for Common Stock and OP Unit holders (1)(2) $ 79.4 $ 84.3 $ 74.9 $ 93.1 $ 72.5 Normalized FFO available for Common Stock and OP Unit holders (1)(2) $ 82.6 $ 85.1 $ 75.1 $ 93.2 $ 75.2 Funds available for distribution (FAD) available for Common Stock and OP Unit holders (1)(2) $ 72.6 $ 74.0 $ 63.5 $ 86.0 $ 65.8 Common Stock Outstanding (In thousands) and Per Share Data\nCommon Stock and OP Units, end of the period 94,420 93,334 92,840 92,780 92,699 Weighted average Common Stock and OP Units outstanding - fully diluted 94,295 93,324 93,063 93,011 92,965 Net income per Common Share - fully diluted $ 0.51 $ 0.56 $ 0.45 $ 0.65 $ 0.43 FFO per Common Share - fully diluted $ 0.84 $ 0.90 $ 0.81 $ 1.00 $ 0.78 Normalized FFO per Common Share - fully diluted $ 0.88 $ 0.91 $ 0.81 $ 1.00 $ 0.81 Dividends per Common Share $ 0.488 $ 0.488 $ 0.488 $ 0.488 $ 0.425 Balance Sheet Total assets $ 3,610 $ 3,526 $ 3,485 $ 3,471 $ 3,479 Total liabilities $ 2,510 $ 2,511 $ 2,386 $ 2,371 $ 2,397 Market Capitalization Total debt $ 2,224 $ 2,200 $ 2,072 $ 2,078 $ 2,110 Total market capitalization (3) $ 10,629 $ 10,141 $ 10,224 $ 9,364 $ 8,930 Ratios Total debt / total market capitalization 20.9 % 21.7 % 20.3 % 22.2 % 23.6 % Total debt + preferred stock / total market capitalization 20.9 % 21.7 % 21.6 % 23.6 % 25.2 % Total debt / Adjusted EBITDA (4) 5.1 5.1 4.9 5.0 5.1 Interest coverage (5) 4.4 4.4 4.3 4.2 4.1 Fixed charges + preferred distributions coverage (6) 4.1 4.0 3.9 3.8 3.7 1.\nSee Non-GAAP Financial Measure Definitions and Other Terms at the end of the supplemental information for definitions of Adjusted EBITDA, FFO, Normalized FFO and FAD; and reconciliation of Consolidated net income to Adjusted EBITDA.\n2.\nSee page 7 for a reconciliation of Net income available for Common Stockholders to Non-GAAP financial measures FFO available for Common Stock and OP Unit holders, Normalized FFO available for Common Stock and OP Unit holders and FAD available for Common Stock and OP Unit holders.\n3.\nSee page 16 for market capitalization calculation as of December 31, 2017.\n4.\nCalculated using trailing twelve months Adjusted EBITDA. We believe trailing twelve months Adjusted EBITDA provides additional information for determining our ability to meet future debt service requirements.\n5.\nInterest coverage is calculated by dividing trailing twelve months Adjusted EBITDA by the interest expense incurred during the same period.\n6.\nSee Non-GAAP Financial Measure Definitions and Other Terms at the end of the supplemental information for a definition of fixed charges. This ratio is calculated by dividing trailing twelve months Adjusted EBITDA by the sum of fixed charges and preferred stock dividends during the same period.\nBalance Sheet\n(In thousands, except share and per share data)\nDecember 31,\n2017\n(unaudited)\nDecember 31,\n2016\nAssets Investment in real estate: Land $ 1,221,375 $ 1,163,987 Land improvements 3,045,221 2,893,759 Buildings and other depreciable property 649,217 627,590 4,915,813 4,685,336 Accumulated depreciation (1,516,694 ) (1,399,531 ) Net investment in real estate 3,399,119 3,285,805 Cash 31,085 56,340 Notes receivable, net 49,477 34,520 Investment in unconsolidated joint ventures 53,080 19,369 Deferred commission expense 31,443 31,375 Escrow deposits, goodwill, and other assets, net (1) 45,828 51,578 Total Assets $ 3,610,032 $ 3,478,987 Liabilities and Equity Liabilities: Mortgage notes payable $ 1,971,715 $ 1,891,900 Term loan 198,302 199,379 Unsecured lines of credit 30,000 — Accrued expenses and accounts payable (1) 80,744 89,864 Deferred revenue – upfront payments from right-to-use contracts 85,596 81,484 Deferred revenue – right-to-use annual payments 9,932 9,817 Accrued interest payable 8,387 8,379 Rents and other customer payments received in advance and security deposits 79,267 76,906 Distributions payable 46,047 39,411 Total Liabilities 2,509,990 2,397,140 Equity: Stockholders’ Equity: Preferred stock, $0.01 par value, 10,000,000 shares authorized as of December 31, 2017 and 9,945,539 shares authorized as of December 31, 2016; none issued and outstanding. — — 6.75% Series C Cumulative Redeemable Perpetual Preferred Stock, $0.01 par value, no shares authorized as of December 31, 2017 and 54,461 shares authorized as of December 31, 2016; none issued and outstanding as of December 31, 2017 and 54,458 shares issued and outstanding as of December 31, 2016. — 136,144 Common stock, $0.01 par value, 200,000,000 shares authorized as of December 31, 2017 and December 31, 2016; 88,585,160 and 85,529,386 shares issued and outstanding as of December 31, 2017 and December 31, 2016, respectively 883 854 Paid-in capital 1,242,109 1,103,048 Distributions in excess of accumulated earnings (211,980 ) (231,276 ) Accumulated other comprehensive income (loss) 942 (227 ) Total Stockholders’ Equity 1,031,954 1,008,543 Non-controlling interests – Common OP Units 68,088 73,304 Total Equity 1,100,042 1,081,847 Total Liabilities and Equity $ 3,610,032 $ 3,478,987 1. As of December 31, 2016, Escrow deposits, goodwill, and other assets, net includes insurance receivable of approximately $10.9 million, and Accrued expenses and accounts payable includes approximately $13.3 million litigation settlement payable related to resolution of the California lawsuits. These amounts were received and paid during the first quarter of 2017. Consolidated Income Statement\n(In thousands, unaudited)\nQuarters Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Revenues: Community base rental income $ 123,780 $ 118,120 $ 489,613 $ 464,745 Rental home income 3,515 3,535 14,344 14,107 Resort base rental income 49,212 46,881 218,806 201,533 Right-to-use annual payments 11,665 11,445 45,798 45,035 Right-to-use contracts current period, gross 2,920 3,037 14,132 12,327 Right-to-use contract upfront payments, deferred, net (342 ) (652 ) (4,108 ) (3,079 ) Utility and other income 24,181 19,937 93,252 81,427 Gross revenues from home sales 11,430 8,952 36,302 37,191 Brokered resale revenue and ancillary services revenues, net (290 ) 258 3,798 2,994 Interest income 2,038 1,793 7,580 6,845 Income from other investments, net 1,877 736 5,795 7,310 Total revenues 229,986 214,042 925,312 870,435 Expenses: Property operating and maintenance 73,000 65,238 294,119 268,249 Rental home operating and maintenance 1,698 2,009 6,610 6,883 Real estate taxes 13,024 13,502 55,010 53,036 Sales and marketing, gross 2,577 2,532 11,438 11,056 Right-to-use contract commissions, deferred, net 18 (11 ) (354 ) (223 ) Property management 12,509 11,413 51,252 47,083 Depreciation on real estate assets and rental homes 30,606 30,198 121,455 117,400 Amortization of in-place leases 103 1,234 2,231 3,373 Cost of home sales 11,122 8,949 36,513 37,456 Home selling expenses 885 1,027 4,186 3,575 General and administrative 8,398 7,688 31,737 31,004 Other expenses, including property rights initiatives (1) 334 2,950 1,148 4,986 Early debt retirement 2,785 — 2,785 — Interest and related amortization 25,842 25,395 100,570 102,030 Total expenses 182,901 172,124 718,700 685,908 Income before equity in income of unconsolidated joint ventures 47,085 41,918 206,612 184,527 Equity in income of unconsolidated joint ventures 889 463 3,765 2,605 Consolidated net income 47,974 42,381 210,377 187,132 Income allocated to non-controlling interest-Common OP Units (2,963 ) (3,099 ) (12,788 ) (13,869 ) Perpetual preferred stock dividends and original issuance costs (18 ) (2,316 ) (7,685 ) (9,226 ) Net income available for Common Stockholders $ 44,993 $ 36,966 $ 189,904 $ 164,037 1. Other expenses, including property rights initiatives includes net expense of $2.4 million for the quarter and year ended December 31, 2016, related to resolution of the California lawsuits. Non-GAAP Financial Measures\nFourth Quarter 2017 - Selected Non-GAAP Financial Measures\n(In millions, except per share data, unaudited)\nQuarter Ended December 31,\n2017\nIncome from property operations, excluding deferrals and property management - 2017 Core (1) $ 122.7 Income from property operations, excluding deferrals and property management - Non-Core (2) 2.3 Property management and general and administrative (excluding transaction costs) (20.5 ) Other income and expenses 4.0 Financing costs and other (25.9 ) Normalized FFO available for Common Stock and OP Unit holders (3) 82.6 Transaction costs (4) (0.4 ) Early debt retirement (2.8 ) FFO available for Common Stock and OP Unit holders (3) $ 79.4 Normalized FFO per Common Share - fully diluted $ 0.88 FFO per Common Share - fully diluted $ 0.84 Normalized FFO available for Common Stock and OP Unit holders (3) $ 82.6 Non-revenue producing improvements to real estate (10.0 ) FAD available for Common Stock and OP Unit holders (3) $ 72.6 Weighted average Common Stock and OP Units - fully diluted 94.3 1.\nSee Non-GAAP Financial Measure Definitions and Other Terms at the end of the supplemental information for definitions of Non-GAAP financial measures Income from property operations, excluding deferrals and property management, and Core, and reconciliation of income from property operations, excluding deferrals and property management to income before equity in income of unconsolidated joint ventures. See page 9 for details of the 2017 Core Income from Property Operations, excluding deferrals and property management.\n2.\nSee Non-GAAP Financial Measure Definitions and Other Terms at the end of the supplemental information for a definition of Non-Core properties. See page 10 for details of the Income from Property Operations, excluding deferrals and property management for the Non-Core properties.\n3.\nSee page 7 for a reconciliation of Net income available for Common Stockholders to Non-GAAP financial measures FFO available for Common Stock and OP Unit holders, Normalized FFO available for Common Stock and OP Unit holders and FAD available for Common Stock and OP Unit holders. See definitions of Non-GAAP financial measures of FFO, Normalized FFO and FAD and Non-revenue producing improvements in Non-GAAP Financial Measure Definitions and Other Terms at the end of the supplemental information.\n4.\nIncluded in General and administrative on the Consolidated Income Statement on page 4.\nReconciliation of Net Income to Non-GAAP Financial Measures\n(In thousands, except per share data, unaudited)\nQuarters Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Net income available for Common Stockholders $ 44,993 $ 36,966 $ 189,904 $ 164,037 Income allocated to Common OP Units 2,963 3,099 12,788 13,869 Right-to-use contract upfront payments, deferred, net (1) 342 652 4,108 3,079 Right-to-use contract commissions, deferred, net (2) 18 (11 ) (354 ) (223 ) Depreciation on real estate assets 28,075 27,519 111,014 106,736 Depreciation on rental homes 2,531 2,679 10,441 10,664 Amortization of in-place leases 103 1,234 2,231 3,373 Depreciation on unconsolidated joint ventures 362 324 1,533 1,292 FFO available for Common Stock and OP Unit holders (3) 79,387 72,462 331,665 302,827 Transaction costs (4) 400 292 724 1,217 Early debt retirement 2,785 — 2,785 — Preferred stock original issuance costs (5) — — 757 — Litigation settlement, net (6) — 2,415 — 2,415 Normalized FFO available for Common Stock and OP Unit holders (3) 82,572 75,169 335,931 306,459 Non-revenue producing improvements to real estate (10,010 ) (9,419 ) (39,833 ) (37,765 ) FAD available for Common Stock and OP Unit holders (3) $ 72,562 $ 65,750 $ 296,098 $ 268,694 Net income available per Common Share - Basic $ 0.51 $ 0.43 $ 2.18 $ 1.93 Net income available per Common Share - Fully Diluted $ 0.51 $ 0.43 $ 2.17 $ 1.92 FFO per Common Share & OP Units-Basic $ 0.85 $ 0.78 $ 3.57 $ 3.29 FFO per Common Share & OP Units-Fully Diluted $ 0.84 $ 0.78 $ 3.55 $ 3.27 Normalized FFO per Common Share & OP Units-Basic $ 0.88 $ 0.81 $ 3.61 $ 3.33 Normalized FFO per Common Share & OP Units-Fully Diluted $ 0.88 $ 0.81 $ 3.60 $ 3.31 Average Common Stock - Basic 88,115 85,163 86,997 84,778 Average Common Stock and OP Units - Basic 93,949 92,361 93,030 91,982 Average Common Stock and OP Units - Fully Diluted 94,295 92,965 93,425 92,569 1.\nWe are required by GAAP to defer, over the estimated customer life, recognition of non-refundable upfront payments from sales of new and upgrade right-to-use contracts. For 2017, the customer life is estimated to be 40 years and is based upon our experience operating the membership platform since 2008. The amount shown represents the deferral of a substantial portion of current period upgrade sales, offset by amortization of prior period sales.\n2.\nWe are required by GAAP to defer recognition of commissions paid related to the entry of right-to-use contracts. The deferred commissions will be amortized using the same method as used for the related non-refundable upfront payments from the entry of right-to-use contracts and upgrade sales. The amount shown represents the deferral of a substantial portion of current period commissions on those contracts, offset by the amortization of prior period commissions.\n3.\nSee Non-GAAP Financial Measure Definitions and Other Terms at the end of the supplemental information for Non-GAAP financial measure definitions of FFO, Normalized FFO and FAD and for a definition of Non-revenue producing improvements.\n4.\nIncluded in General and administrative on the Consolidated Income Statement on page 4.\n5.\nDuring the quarter ended September 30, 2017, we redeemed our 6.75% Series C Preferred Stock for $136.1 million. In connection with the redemption, we recorded expense of $0.8 million for the original issuance costs associated with the Series C Preferred Stock.\n6.\nLitigation settlement, net of $2.4 million for the quarter and year ended December 31, 2016, related to resolution of the California lawsuits.\nConsolidated Income from Property Operations (1)\n(In millions, except home site and occupancy figures, unaudited)\nQuarters Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Community base rental income (2) $ 123.8 $ 118.1 $ 489.6 $ 464.7 Rental home income 3.5 3.5 14.3 14.1 Resort base rental income (3) 49.2 46.9 218.8 201.5 Right-to-use annual payments 11.7 11.4 45.8 45.0 Right-to-use contracts current period, gross 2.9 3.0 14.1 12.3 Utility and other income (4) 24.2 20.0 93.3 81.5 Property operating revenues 215.3 202.9 875.9 819.1 Property operating, maintenance and real estate taxes (4) 86.0 78.7 349.1 321.2 Rental home operating and maintenance 1.7 2.0 6.6 6.9 Sales and marketing, gross 2.6 2.5 11.4 11.1 Property operating expenses 90.3 83.2 367.1 339.2 Income from property operations, excluding deferrals and property management (1) $ 125.0 $ 119.7 $ 508.8 $ 479.9 Manufactured home site figures and occupancy averages: Total sites 71,109 70,992 71,064 70,629 Occupied sites 67,098 66,482 66,894 65,893 Occupancy % 94.4 % 93.6 % 94.1 % 93.3 % Monthly base rent per site $ 615 $ 592 $ 610 $ 588 Resort base rental income: Annual $ 34.6 $ 32.7 $ 133.2 124.3 Seasonal 7.8 6.9 36.2 31.5 Transient 6.8 7.3 49.4 45.7 Total resort base rental income $ 49.2 $ 46.9 $ 218.8 $ 201.5 1. See page 4 for the Consolidated Income Statement and see Non-GAAP Financial Measure Definitions and Other Terms at the end of the supplemental information for Non-GAAP measure definitions and reconciliation of Income from property operations, excluding deferrals and property management. 2. See the manufactured home site figures and occupancy averages below within this table. 3. See resort base rental income detail included below within this table. 4. Includes impact for Hurricane Irma. Utility and other income includes insurance recovery revenues of $4.1 million and $7.2 million for the quarter and year ended December 31, 2017, respectively. Property operating, maintenance and real estate taxes includes debris removal and cleanup costs of $4.2 million and $7.5 million for the quarter and year ended December 31, 2017, respectively. 2017 Core Income from Property Operations (1)\n(In millions, except home site and occupancy figures, unaudited)\nQuarters Ended Year Ended December 31, % December 31, % 2017 2016 Change (2)\n2017 2016 Change (2)\nCommunity base rental income (3) $ 122.4 $ 117.0 4.6 % $ 484.5 $ 462.3 4.8 % Rental home income 3.5 3.5 (0.6 )% 14.3 14.1 1.7 % Resort base rental income (4) 46.0 42.6 7.9 % 199.9 188.8 5.9 % Right-to-use annual payments 11.6 11.4 1.7 % 45.7 45.0 1.6 % Right-to-use contracts current period, gross 2.9 3.0 (3.9 )% 14.1 12.3 14.6 % Utility and other income (5) 23.0 19.5 17.4 % 90.3 80.2 12.7 % Property operating revenues 209.4 197.0 6.2 % 848.8 802.7 5.8 % Property operating, maintenance and real estate taxes (5) 82.4 75.3 9.5 % 334.8 312.5 7.1 % Rental home operating and maintenance 1.7 2.0 (15.6 )% 6.6 6.9 (4.0 )% Sales and marketing, gross 2.6 2.5 1.7 % 11.4 11.1 3.4 % Property operating expenses 86.7 79.8 8.6 % 352.8 330.5 6.8 % Income from property operations, excluding deferrals and property management (1) $ 122.7 $ 117.2 4.7 % $ 496.0 $ 472.2 5.0 % Occupied sites (6) 66,201 65,726 Core manufactured home site figures and occupancy averages: Total sites 69,981 69,973 69,981 69,981 Occupied sites 66,099 65,597 65,942 65,377 Occupancy % 94.5 % 93.7 % 94.2 % 93.4 % Monthly base rent per site $ 617 $ 595 $ 612 $ 589 Resort base rental income: Annual $ 33.1 $ 31.2 6.1 % $ 128.0 $ 121.1 5.6 % Seasonal 7.0 5.9 17.4 % 29.8 27.4 9.0 % Transient 5.9 5.5 7.6 % 42.1 40.3 4.5 % Total resort base rental income $ 46.0 $ 42.6 7.9 % $ 199.9 $ 188.8 5.9 % 1. See Non-GAAP Financial Measure Definitions and Other Terms at the end of the supplemental information for definitions of Non-GAAP measures Income from property operations, excluding deferrals and property management, and Core. Core excludes the results of Sunshine Key and Fiesta Key RV Resorts. 2. Calculations prepared using actual results without rounding. 3. See the Core manufactured home site figures and occupancy averages included below within this table. 4. See resort base rental income detail included below within this table. 5. Includes impact for Hurricane Irma. Utility and other income includes insurance recovery revenues of $3.0 million and $6.0 million for the quarter and year ended December 31, 2017, respectively. Property operating, maintenance and real estate taxes includes debris removal and cleanup costs of $3.0 million and $6.3 million for the quarter and year ended December 31, 2017, respectively. 6. Occupied sites as of the end of the period shown. Occupied sites have increased by 475 from 65,726 at December 31, 2016. Non-Core - Income from Property Operations (1)\n(In millions, unaudited)\nQuarter\nEnded\nYear Ended\nDecember 31,\n2017\nDecember 31,\n2017\nCommunity base rental income $ 1.4 $ 5.1 Resort base rental income 3.2 18.9 Utility income and other property income (2) 1.3 2.9 Property operating revenues 5.9 26.9 Property operating expenses (2) 3.6 14.3 Income from property operations, excluding deferrals and property management $ 2.3 $ 12.6 1. See Non-GAAP Financial Measure Definitions and Other Terms at the end of the supplemental information for a definition of Non-Core properties. 2. Includes impact for Hurricane Irma. Utility and other income includes insurance recovery revenues of $1.1 million for both the quarter and year ended December 31, 2017. Property operating, maintenance and real estate taxes includes debris removal and cleanup costs of $1.2 million and $1.2 million for the quarter and year ended December 31, 2017, respectively. Income from Rental Home Operations\n(In millions, except occupied rentals, unaudited)\nQuarters Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Manufactured homes: New home $ 6.3 $ 6.4 $ 27.0 $ 25.2 Used home 5.5 5.9 21.9 24.6 Rental operations revenues (1) 11.8 12.3 48.9 49.8 Rental operations expense 1.7 2.0 6.6 6.9 Income from rental operations 10.1 10.3 42.3 42.9 Depreciation on rental homes 2.5 2.7 10.4 10.7 Income from rental operations, net of depreciation (2) $ 7.6 $ 7.6 $ 31.9 $ 32.2 Occupied rentals: (3) New 2,533 2,375 Used 1,884 2,376\nTotal occupied rental sites 4,417 4,751\nAs of December 31, 2017 December 31, 2016 Cost basis in rental homes: (4) Gross Net of\nDepreciation\nGross Net of\nDepreciation\nNew $ 132.5 $ 105.8 $ 126.5 $ 103.5 Used 43.4 23.8 51.5 32.3 Total rental homes\n$ 175.9 $ 129.6 $ 178.0 $ 135.8 1. For the quarters ended December 31, 2017 and 2016, approximately $8.3 million and $8.8 million, respectively, of the rental operations revenue are included in the Community base rental income in the Consolidated Income from Property Operations table on page 8. For the years ended December 31, 2017 and 2016 , approximately $34.6 million and $35.7 million, respectively, of the rental operations revenue are included in the Community base rental income in the Consolidated Income from Property Operations table on page 8. The remainder of the rental operations revenue is included in the Rental home income in the Consolidated Income from Property Operations table on page 8. 2. See Non-GAAP Financial Measure Definitions and Other Terms at the end of the supplemental information for the Non-GAAP measure definition of Income from rental operations, net of depreciation. 3. Occupied rentals as of the end of the period in our Core portfolio. Included in the quarters ended December 31, 2017 and 2016 are 268 and 183 homes rented through our ECHO joint venture, respectively. For the years ended December 31, 2017 and 2016, the rental home investment associated with our ECHO joint venture totals approximately $9.1 million and $7.1 million, respectively. 4. Includes both occupied and unoccupied rental homes. New home cost basis does not include the costs associated with our ECHO joint venture. At December 31, 2017 and 2016, our investment in the ECHO joint venture was approximately $15.6 million and $15.4 million, respectively. Total Sites and Home Sales\n(In thousands, except sites and home sale volumes, unaudited)\nSummary of Total Sites as of December 31, 2017 Sites Community sites 71,100 Resort sites: Annuals 27,800 Seasonal 11,200 Transient 11,200 Membership (1) 24,100 Joint Ventures (2) 5,900 Total 151,300 Home Sales - Select Data Quarters Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Total New Home Sales Volume (3) 184 150 597 658 New Home Sales Volume - ECHO joint venture 32 46 158 208 New Home Sales Gross Revenues (3) $ 9,035 $ 6,574 $ 25,759 $ 26,074 Total Used Home Sales Volume 326 278 1,280 1,266 Used Home Sales Gross Revenues $ 2,395 $ 2,378 $ 10,543 $ 11,117 Brokered Home Resales Volume 221 207 880 792 Brokered Home Resale Revenues, net $ 310 $ 314 $ 1,235 $ 1,198 1. Sites primarily utilized by approximately 106,500 members. Includes approximately 5,800 sites rented on an annual basis. 2. Joint venture income is included in the Equity in income from unconsolidated joint ventures in the Consolidated Income Statement on page 4. 3. Total new home sales volume includes home sales from our ECHO joint venture. New home sales gross revenues does not include the revenues associated with our ECHO joint venture. 2018 Guidance - Selected Financial Data (1)\nOur guidance acknowledges the existence of volatile economic conditions, which may impact our current guidance assumptions. Factors impacting 2018 guidance include, but are not limited to the following: (i) the mix of site usage within the portfolio; (ii) yield management on our short-term resort sites; (iii) scheduled or implemented rate increases on community and resort sites; (iv) scheduled or implemented rate increases in annual payments under right-to-use contracts; (v) occupancy changes; (vi) our ability to retain and attract customers renewing or entering right-to-use contracts; (vii) our ability to integrate and operate recent acquisitions in accordance with our estimates; (viii) completion of pending transactions in their entirety and on assumed schedule; (ix) ongoing legal matters and related fees; and (x) costs to restore property operations and potential revenue losses following storms or other unplanned events.\n(In millions, except per share data, unaudited)\nQuarter Ending Year Ending March 31, 2018 December 31, 2018 Income from property operations, excluding deferrals and property management - 2018 Core (2) $ 138.2 $ 527.2 Income from property operations - Non-Core (3) 1.3 9.3 Property management and general and administrative (20.9 ) (84.5 ) Other income and expenses 4.2 15.5 Financing costs and other (25.7 ) (103.5 ) Normalized FFO and FFO available for Common Stock and OP Unit holders (4) 97.1 364.0 Depreciation on real estate and other (29.5 ) (117.0 ) Depreciation on rental homes (2.5 ) (10.1 ) Deferral of right-to-use contract sales revenue and commission, net (1.1 ) (5.3 ) Income allocated to non-controlling interest-Common OP Units (3.8 ) (13.7 ) Net income available for Common Stockholders $ 60.2 $ 217.9 Net income per Common Share - fully diluted (5) $0.65 - $0.71 $2.40 - $2.50 FFO per Common Share - fully diluted $1.00 - $1.06 $3.80 - $3.90 Normalized FFO per Common Share - fully diluted $1.00 - $1.06 $3.80 - $3.90 Weighted average Common Stock outstanding - fully diluted 94.6 94.7 1. Each line item represents the mid-point of a range of possible outcomes and reflects management’s estimate of the most likely outcome. Actual Normalized FFO available for Common Stock and OP Unit holders, Normalized FFO per Common Share, FFO available for Common Stock and OP Unit holders, FFO per Common Share, Net income available for Common Stockholders and Net income per Common Share could vary materially from amounts presented above if any of our assumptions is incorrect. 2. See page 14 for 2018 Core Guidance Assumptions. Amount represents 2017 income from property operations, excluding deferrals and property management, from the 2018 Core properties of $133.4 million multiplied by an estimated growth rate of 3.6% and $505.5 million multiplied by an estimated growth rate of 4.3% for the quarter and year ending December 31, 2018, respectively. 3. See page 14 for the 2018 Assumptions regarding the Non-Core properties. 4. See Non-GAAP Financial Measure Definitions and Other Terms at the end of the supplemental information for definitions of Normalized FFO and FFO. 5. Net income per fully diluted Common Share is calculated before Income allocated to non-controlling interest-Common OP Units. 2018 Core Guidance Assumptions (1)\n(In millions, unaudited)\nQuarter\nEnded\nFirst\nQuarter 2018\nYear Ended 2018 March 31,\n2017\nGrowth\nFactors (2)\nDecember 31,\n2017\nGrowth\nFactors (2)\nCommunity base rental income $ 120.7 4.5 % $ 489.1 4.1 % Rental home income 3.6 (0.3 )% 14.3 (3.7 )% Resort base rental income (3) 57.7 5.1 % 211.1 4.7 % Right-to-use annual payments 11.3 1.2 % 45.8 1.0 % Right-to-use contracts current period, gross 3.2 (1.5 )% 14.1 1.1 % Utility and other income 21.9 (0.2 )% 92.0 (8.5 )% Property operating revenues 218.4 3.9 % 866.4 2.6 % Property operating, maintenance, and real estate taxes 80.7 4.3 % 342.9 0.1 % Rental home operating and maintenance 1.6 (0.1 )% 6.6 (2.8 )% Sales and marketing, gross 2.7 9.3 % 11.4 4.3 % Property operating expenses 85.0 4.3 % 360.9 0.1 % Income from property operations, excluding deferrals and property management $ 133.4 3.6 % $ 505.5 4.3 % Resort base rental income: Annual $ 31.8 5.6 % $ 131.7 5.1 % Seasonal 17.1 4.2 % 33.6 2.9 % Transient 8.8 5.0 % 45.8 5.0 % Total resort base rental income $ 57.7 5.1 % $ 211.1 4.7 % 2018 Assumptions Regarding Non-Core Properties (1)\n(In millions, unaudited)\nQuarter Ending Year Ending March 31,\n2018 (4)\nDecember 31,\n2018 (4)\nCommunity base rental income $ 0.2 $ 0.8 Resort base rental income 2.0 14.6 Utility income and other property income 0.9 3.7 Property operating revenues 3.1 19.1 Property operating, maintenance, and real estate taxes 1.8 9.8 Property operating expenses 1.8 9.8 Income from property operations, excluding deferrals and property management $ 1.3 $ 9.3 1. See Non-GAAP Financial Measure Definitions and Other Terms at the end of the supplemental information for a definition of Core and Non-Core properties. 2. Management’s estimate of the growth of property operations in the 2018 Core Properties compared to actual 2017 performance. Represents our estimate of the mid-point of a range of possible outcomes. Calculations prepared using actual results without rounding. Actual growth could vary materially from amounts presented above if any of our assumptions is incorrect. 3. See Resort base rental income table included below within this table. 4. Each line item represents our estimate of the mid-point of a possible range of outcomes and reflects management’s best estimate of the most likely outcome for the Non-Core properties. Actual income from property operations for the Non-Core properties could vary materially from amounts presented above if any of our assumptions is incorrect. Right-To-Use Memberships - Select Data\n(In thousands, except member count, number of Thousand Trails Camping Pass, number of annuals and number of upgrades, unaudited)\nYear Ended December 31,\n2014 2015 2016 2017 2018 (1)\nMember Count (2) 96,130 102,413 104,728 106,456 108,100 Thousand Trails Camping Pass (TTC) Origination (3) 18,187 25,544 29,576 31,618 32,800 TTC Sales 10,014 11,877 12,856 14,128 14,700 RV Dealer TTC Activations 8,173 13,667 16,720 17,490 18,100 Number of annuals (4) 5,142 5,470 5,756 5,843 6,100 Number of upgrade sales (5) 2,978 2,687 2,477 2,514 2,600 Right-to-use annual payments $ 44,860 $ 44,441 $ 45,036 $ 45,798 $ 46,300 Resort base rental income from annuals $ 12,491 $ 13,821 $ 15,413 $ 16,841 $ 18,400 Resort base rental income from seasonals/transients $ 13,894 $ 15,795 $ 17,344 $ 18,231 $ 19,900 Upgrade contract initiations (6) $ 13,892 $ 12,783 $ 12,312 $ 14,130 $ 14,300 Utility and other income $ 2,455 $ 2,430 $ 2,442 $ 2,254 $ 2,200 1. Guidance estimate. Each line item represents our estimate of the mid-point of a possible range of outcomes and reflects management’s best estimate of the most likely outcome. Actual figures could vary materially from amounts presented above if any of our assumptions is incorrect. 2. Members have entered into right-to-use contracts with us that entitle them to use certain properties on a continuous basis for up to 21 days. 3. TTCs allow access to any of five geographic areas in the United States. 4. Members who rent a specific site for an entire year in connection with their right-to-use contract. 5. Existing customers that have upgraded agreements are eligible for longer stays, can make earlier reservations, may receive discounts on rental units, and may have access to additional properties. Upgrades require a non-refundable upfront payment. 6. Revenues associated with contract upgrades, included in Right-to-use contracts current period, gross, on our Consolidated Income Statement on page 4. Market Capitalization\n(In millions, except share and OP Unit data, unaudited)\nCapital Structure as of December 31, 2017 Total\nCommon\nStock/Units\n% of Total\nCommon\nStock/Units\nTotal % of Total % of Total\nMarket\nCapitalization\nSecured Debt $ 1,994 89.7 % Unsecured Debt 230 10.3 % Total Debt (1) $ 2,224 100.0 % 20.9 % Common Stock 88,585,160 93.8 % OP Units 5,834,753 6.2 % Total Common Stock and OP Units 94,419,913 100.0 % Common Stock price at December 31, 2017 $ 89.02 Fair Value of Common Stock and OP Units $ 8,405 100.0 % Total Equity $ 8,405 100.0 % 79.1 % Total Market Capitalization $ 10,629 100.0 % 1. Excludes deferred financing costs of approximately $23.7 million. Debt Maturity Schedule\nDebt Maturity Schedule as of December 31, 2017\n(In thousands, unaudited)\nYear Secured\nDebt (1)\nWeighted\nAverage\nInterest\nRate\nUnsecured\nDebt\nWeighted\nAverage\nInterest\nRate (1)\nTotal Debt % of\nTotal\nDebt\nWeighted\nAverage\nInterest\nRate (1)\n2018 3,020 8.00 % — — 3,020 0.14 % 8.00 % 2019 197,226 6.27 % — — 197,226 9.00 % 6.27 % 2020 119,500 6.14 % — — 119,500 5.46 % 6.14 % 2021 187,065 5.01 % — — 187,065 8.54 % 5.01 % 2022 146,439 4.59 % — — 146,439 6.69 % 4.59 % 2023 108,642 5.10 % 200,000 2.96 % 308,642 14.09 % 3.77 % 2024 — — % — — — — % — % 2025 105,572 3.45 % — — 105,572 4.82 % 3.45 % 2026 — — % — — — — % — % Thereafter 1,123,029 4.19 % — — 1,123,029 51.27 % 4.19 % Total $ 1,990,493 4.63 % $ 200,000 2.96 % $ 2,190,493 100.0 % 4.49 % Line of Credit Borrowing (2) — 30,000 2.37 % 30,000 Note Premiums 3,253 — 3,253 Total Debt 1,993,746 230,000 2,223,746 Deferred Financing Costs (22,031 ) (1,698 ) (23,729 ) Total Debt, net 1,971,715 4.69 % (1)\n228,302 3.05 % 2,200,017 4.53 % (1)\nAverage Years to Maturity 13.0 5.2 12.2 1. Reflects effective interest rate including amortization of note premiums and amortization of deferred loan cost for secured, unsecured and total debt. 2. Reflects outstanding balance on the Line of Credit as of December 31, 2017. The Line of Credit matures in October 2021. Non-GAAP Financial Measures Definitions and Other Terms\nThis document contains certain Non-GAAP measures used by management that we believe are helpful in understanding our business, as further discussed in the paragraphs below. We believe investors should review these Non-GAAP measures along with GAAP net income and cash flow from operating activities, investing activities and financing activities, when evaluating an equity REIT’s operating performance. Our definitions and calculations of these Non-GAAP financial and operating measures and other terms may differ from the definitions and methodologies used by other REITs and, accordingly, may not be comparable. These Non-GAAP financial and operating measures do not represent cash generated from operating activities in accordance with GAAP, nor do they represent cash available to pay distributions and should not be considered as an alternative to net income, determined in accordance with GAAP, as an indication of our financial performance, or to cash flow from operating activities, determined in accordance with GAAP, as a measure of our liquidity, nor is it indicative of funds available to fund our cash needs, including our ability to make cash distributions.\nFUNDS FROM OPERATIONS (FFO). We define FFO as net income, computed in accordance with GAAP, excluding gains and actual or estimated losses from sales of properties, plus real estate related depreciation and amortization, impairments, if any, and after adjustments for unconsolidated partnerships and joint ventures. Adjustments for unconsolidated partnerships and joint ventures are calculated to reflect FFO on the same basis. We compute FFO in accordance with our interpretation of standards established by the National Association of Real Estate Investment Trusts (\"NAREIT\"), which may not be comparable to FFO reported by other REITs that do not define the term in accordance with the current NAREIT definition or that interpret the current NAREIT definition differently than we do. We receive up-front non-refundable payments from the entry of right-to-use contracts. In accordance with GAAP, the upfront non-refundable payments and related commissions are deferred and amortized over the estimated customer life. Although the NAREIT definition of FFO does not address the treatment of non-refundable right-to-use payments, we believe that it is appropriate to adjust for the impact of the deferral activity in our calculation of FFO.\nWe believe FFO, as defined by the Board of Governors of NAREIT, is generally a measure of performance for an equity REIT. While FFO is a relevant and widely used measure of operating performance for equity REITs, it does not represent cash flow from operations or net income as defined by GAAP, and it should not be considered as an alternative to these indicators in evaluating liquidity or operating performance.\nNORMALIZED FUNDS FROM OPERATIONS (NORMALIZED FFO). We define Normalized FFO as FFO excluding the following non-operating income and expense items: a) the financial impact of contingent consideration; b) gains and losses from early debt extinguishment, including prepayment penalties and defeasance costs; c) property acquisition and other transaction costs related to mergers and acquisitions; and d) other miscellaneous non-comparable items. Normalized FFO presented herein is not necessarily comparable to Normalized FFO presented by other real estate companies due to the fact that not all real estate companies use the same methodology for computing this amount.\nFUNDS AVAILABLE FOR DISTRIBUTION (FAD). We define FAD as Normalized FFO less non-revenue producing capital expenditures.\nWe believe that FFO, Normalized FFO and FAD are helpful to investors as supplemental measures of the performance of an equity REIT. We believe that by excluding the effect of depreciation, amortization, impairments, if any, and actual or estimated gains or losses from sales of real estate, all of which are based on historical costs and which may be of limited relevance in evaluating current performance, FFO can facilitate comparisons of operating performance between periods and among other equity REITs. We further believe that Normalized FFO provides useful information to investors, analysts and our management because it allows them to compare our operating performance to the operating performance of other real estate companies and between periods on a consistent basis without having to account for differences not related to our operations. For example, we believe that excluding the early extinguishment of debt, property acquisition and other transaction costs related to mergers and acquisitions from Normalized FFO allows investors, analysts and our management to assess the sustainability of operating performance in future periods because these costs do not affect the future operations of the properties. In some cases, we provide information about identified non-cash components of FFO and Normalized FFO because it allows investors, analysts and our management to assess the impact of those items.\nINCOME FROM PROPERTY OPERATIONS, EXCLUDING DEFERRALS AND PROPERTY MANAGEMENT. We define Income from property operations, excluding deferrals and property management as rental income, utility income and right-to-use income less property operating and maintenance expenses, real estate tax, sales and marketing expenses, property management and the GAAP deferral of right-to-use contract upfront payments and related commissions, net. We believe that this Non-GAAP financial measure is helpful to investors and analysts as a measure of the operating results of our manufactured home and RV communities.\nThe following table reconciles Net income available for Common Stockholders to Income from property operations (amounts in thousands):\nQuarters Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Net income available for Common Stockholders $ 44,993 $ 36,966 $ 189,904 $ 164,037 Perpetual preferred stock dividends and original issuance costs 18 2,316 7,685 9,226 Income allocated to non-controlling interests - Common OP Units 2,963 3,099 12,788 13,869 Equity in income of unconsolidated joint ventures (889 ) (463 ) (3,765 ) (2,605 ) Income before equity in income of unconsolidated joint ventures $ 47,085 $ 41,918 $ 206,612 $ 184,527 Right-to-use upfront payments, deferred, net 342 652 4,108 3,079 Gross revenues from home sales (11,430 ) (8,952 ) (36,302 ) (37,191 ) Brokered resale revenues and ancillary services revenues, net 290 (258 ) (3,798 ) (2,994 ) Interest income (2,038 ) (1,793 ) (7,580 ) (6,845 ) Income from other investments, net (1,877 ) (736 ) (5,795 ) (7,310 ) Right-to-use contract commissions, deferred, net 18 (11 ) (354 ) (223 ) Property management 12,509 11,413 51,252 47,083 Depreciation on real estate and rental homes 30,606 30,198 121,455 117,400 Amortization of in-place leases 103 1,234 2,231 3,373 Cost of homes sales 11,122 8,949 36,513 37,456 Home selling expenses 885 1,027 4,186 3,575 General and administrative 8,398 7,688 31,737 31,004 Other expenses, including property rights initiatives (1) 334 2,950 1,148 4,986 Early debt retirement 2,785 — 2,785 — Interest and related amortization 25,842 25,395 100,570 102,030 Income from property operations, excluding deferrals and property management 124,974 119,674 508,768 479,950 Right-to-use contracts, deferred and sales and marketing, deferred, net (360 ) (641 ) (3,754 ) (2,856 ) Property management (12,509 ) (11,413 ) (51,252 ) (47,083 ) Income from property operations $ 112,105 $ 107,620 $ 453,762 $ 430,011", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.equitylifestyleproperties.com&esheet=51749937&newsitemid=20180129006160&lan=en-US&anchor=www.equitylifestyleproperties.com&index=1&md5=558f27b06b1aa5e8d8a7ccc3cafcc33c"], "published": "2018-01-30T00:16:00.000+02:00", "crawled": "2018-01-30T03:40:35.003+02:00", "highlightTitle": ""}