{"organizations": [], "uuid": "4ff2d2027d56e6b729dc0cf9f4351b9af420ce9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222966723&w=1200&r=LYNXMPEE0H0JV", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews/", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/uk-cricket-icc-awards/cricket-indias-kohli-named-icc-cricketer-of-the-year-idUKKBN1F70UM", "country": "US", "domain_rank": 408, "title": "Cricket-India's Kohli named ICC Cricketer of the Year", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T10:01:00.000+02:00", "replies_count": 0, "uuid": "4ff2d2027d56e6b729dc0cf9f4351b9af420ce9d"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-icc-awards/cricket-indias-kohli-named-icc-cricketer-of-the-year-idUKKBN1F70UM", "ord_in_thread": 0, "title": "Cricket-India's Kohli named ICC Cricketer of the Year", "locations": [], "entities": {"persons": [{"name": "kohli", "sentiment": "negative"}, {"name": "virat kohli", "sentiment": "none"}, {"name": "ravichandran ashwin", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "odi", "sentiment": "none"}, {"name": "garfield sobers trophy", "sentiment": "none"}, {"name": "sir garfield sobers trophy", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 8:24 AM / Updated 40 minutes ago Cricket - India's Kohli named ICC Cricketer of the Year Reuters Staff 3 Min Read \nMUMBAI (Reuters) - India captain Virat Kohli had something to cheer on Thursday when he was named ICC World Cricketer of the Year, a day after suffering his first test series defeat as skipper in South Africa. \nThe 29-year-old was rewarded for his prolific run in the qualification period from Sept. 2016 to the end of 2017 when he amassed 2,203 runs -- including eight centuries -- in tests, 1,818 in ODIs and 299 in Twenty20 internationals. \nKohli, who also led India to the top of the world’s test rankings during the period, received the Sir Garfield Sobers Trophy, which team mate Ravichandran Ashwin had won last year. \nThe top order batsman, who shone with the bat in South Africa even if his team dropped 2-0 behind in the three-test series, was also adjudged the ODI player of the year. \n“It means a lot to win to win the Sir Garfield Sobers Trophy for becoming the ICC Cricketer of the Year 2017 and also the ICC ODI Player of the Year,” Kohli, who was named captain of both the ICC test and ODI teams for the year, said in an ICC statement. \n“I won that back in 2012 also but it’s the first time winning the Garfield Sobers Trophy, and it’s a huge honour for me. It’s probably the biggest of all in world cricket and two Indians getting it back-to-back makes it more special.” \nAustralia’s Ashes-winning captain Steve Smith was named the Test Cricketer of the Year, having scored 1,875 runs in 16 matches at an average of 78.12, with eight hundreds and five half-centuries. \nSmith scored 687 runs at an average of 137.40 against England in the Ashes series to go with three centuries in four tests in India in early 2017. \n“It’s a great honour to win the Test Player of the Year award. It’s called test cricket for a reason and I’m very humbled to win that award,” Smith said. \n“I’ve had a really good year... I am incredibly humbled and I love playing test cricket – it’s the game that challenges your skills and your mind the most.” \nICC awards \nTest team of the year: Dean Elgar, David Warner, Virat Kohli (captain), Steven Smith, Cheteshwar Pujara, Ben Stokes, Quinton de Kock (wicketkeeper), Ravichandran Ashwin, Mitchell Starc, Kagiso Rabada, James Anderson \nODI team of the year: David Warner, Rohit Sharma, Virat Kohli (captain), Babar Azam, AB de Villiers, Quinton de Kock (wicketkeeper), Ben Stokes, Trent Boult, Hasan Ali, Rashid Khan, Jasprit Bumrah \nICC Men’s Cricketer of the Year - Virat Kohli (India) \nMen’s Test Cricketer of the Year - Steve Smith (Australia) \nMen’s ODI Cricketer of the Year - Virat Kohli (India) \nMen’s Emerging Cricketer of the Year - Hasan Ali (Pakistan) \nMen’s Associate Cricketer of the Year - Rashid Khan (Afghanistan) \nMen’s T20I Performance of the Year - Yuzvendra Chahal (6-25 v England) (India) \nICC Umpire of the Year - Marais Erasmus \nICC Spirit of Cricket - Anya Shrubsole (England) Reporting by Sudipto Ganguly; editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-18T10:01:00.000+02:00", "crawled": "2018-01-18T10:39:17.050+02:00", "highlightTitle": ""}