{"organizations": [], "uuid": "bc06738af160671fc86c7677be3340f7123521cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-papa-johnas-announces-departure-of-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Papa John’s Announces Departure of Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.389, "site_type": "news", "published": "2018-01-17T00:30:00.000+02:00", "replies_count": 0, "uuid": "bc06738af160671fc86c7677be3340f7123521cb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-papa-johnas-announces-departure-of-chief-financial-officer.html", "ord_in_thread": 0, "title": "Papa John’s Announces Departure of Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "john", "sentiment": "negative"}, {"name": "steve ritchie", "sentiment": "none"}, {"name": "lance tucker", "sentiment": "none"}, {"name": "lance", "sentiment": "none"}], "locations": [{"name": "louisville", "sentiment": "none"}, {"name": "ky.", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "louisville", "sentiment": "none"}], "organizations": [{"name": "papa john's international, inc.", "sentiment": "neutral"}, {"name": "jack in the box inc", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOUISVILLE, Ky.--(BUSINESS WIRE)-- Papa John's International, Inc. (NASDAQ: PZZA), the world's third-largest pizza delivery company (the “Company”), today announced that Chief Financial Officer and Chief Administrative Officer Lance Tucker is departing the Company effective March 2, 2018, to assume the role of chief financial officer at Jack in the Box Inc. The Company will immediately commence a search, to include internal and external candidates, for a Chief Financial Officer.\n“Lance has been a critical member of our executive leadership team. He has also been instrumental in developing an already strong and deep finance department. I appreciate all his contributions during his many years with the Company and wish him the best in his new role,” said Steve Ritchie, the Company’s President and CEO.\nAbout Papa John’s\nHeadquartered in Louisville, Kentucky, Papa John's International, Inc. (NASDAQ: PZZA) is the world's third-largest pizza delivery company. For 16 of the past 18 years, consumers have rated Papa John's No. 1 in customer satisfaction among all national pizza chains in the American Customer Satisfaction Index (ACSI). For more information about the company or to order pizza online, visit Papa John's at www.papajohns.com .\nForward-Looking Statements\nCertain matters discussed in this press release constitute forward-looking statements within the meaning of the federal securities laws. Generally, the use of words such as \"expect,\" \"intend,\" \"estimate,\" \"believe,\" \"anticipate,\" \"will,\" \"forecast,\" \"plan,\" \"project,\" or similar words identify forward-looking statements that we intend to be included within the safe harbor protections provided by the federal securities laws. Such forward-looking statements may relate to projections or predictions concerning business performance, future strategy and prospects, the performance of the Papa John's brand, customer experience, as well as business and financial performance, including revenue, earnings, cash flow, and other financial and operational measures. Such statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions, which are difficult to predict and many of which are beyond our control. Therefore, actual outcomes and our results may differ materially from those matters expressed or implied in such forward-looking statements. The risks, uncertainties and assumptions that are involved in our forward-looking statements include, but are not limited to: the successful navigation of the brand's marketing and digital evolution, the performance of our new senior leadership, our ability to identify and hire a permanent CFO to succeed Mr. Tucker on a timely basis, our ability manage the finance and accounting function during the transition, aggressive changes in pricing or other marketing or promotional strategies by competitors, which may adversely affect sales and profitability; and new product and concept developments by food industry competitors; changes in consumer preferences or consumer buying habits, including changes in general economic conditions or other factors that may affect consumer confidence and discretionary spending; changes in our liquidity or changes in the debt markets in general, including adverse changes in interest rates, and our ability to meet debt service requirements; the adverse impact on the company or our results caused by product recalls, food quality or safety issues, incidences of foodborne illness, food contamination and other general public health concerns about our company-owned or franchised restaurants or others in the restaurant industry; failure to maintain our brand strength, quality reputation and consumer enthusiasm for our better ingredients marketing and advertising strategy; the ability of the company and its franchisees to meet planned growth targets and operate new and existing restaurants profitably, including difficulties finding qualified franchisees, store level employees or suitable sites; increases in food costs or sustained higher other operating costs. This could include increased employee compensation, benefits, insurance, tax rates, new regulatory requirements or increasing compliance costs; increases in insurance claims and related costs for programs funded by the company up to certain retention limits, including medical, owned and non-owned automobiles, workers' compensation, general liability and property; disruption of our supply chain or commissary operations which could be caused by our sole source of supply of cheese or limited source of suppliers for other key ingredients or more generally due to weather, natural disasters including drought, disease, or geopolitical or other disruptions beyond our control; increased risks associated with our international operations, including economic and political conditions, instability or uncertainty in our international markets, especially emerging markets, fluctuations in currency exchange rates, difficulty in meeting planned sales targets and new store growth; the impact of current or future claims and litigation, including labor and employment-related claims; current, proposed or future legislation that could impact our business; failure to effectively execute succession planning; disruption of critical business or information technology systems, or those of our suppliers, and risks associated with systems failures and data privacy and security breaches, including theft of confidential company, employee and customer information, including payment cards. These and other risk factors are discussed in detail in \"Part I. Item 1A. - Risk Factors\" in our Annual Report on Form 10-K for the fiscal year ended December 25, 2016. We undertake no obligation to update publicly any forward-looking statements, whether as a result of future events, new information or otherwise, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116006750/en/\nPapa John’s International, Inc.\nPeter Collins, 502-261-4233\nSenior Director, Public Relations\npeter_collins@papajohns.com\nSource: Papa John’s International, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.papajohns.com&esheet=51744047&newsitemid=20180116006750&lan=en-US&anchor=www.papajohns.com&index=2&md5=9e3410a3b16a5b841952bc1b172d9959", "http://www.businesswire.com/news/home/20180116006750/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.papajohns.com%2F&esheet=51744047&newsitemid=20180116006750&lan=en-US&anchor=Papa+John%27s+International%2C+Inc.&index=1&md5=1e1d6c0991128d96e30ad05cd0d94e24"], "published": "2018-01-17T00:30:00.000+02:00", "crawled": "2018-01-16T23:48:05.007+02:00", "highlightTitle": ""}