{"organizations": [], "uuid": "f03642b74518547415f65cd850a6db132845956f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WY795_waltru_SOC_20180111182055.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1515757459", "country": "US", "domain_rank": 387, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.04, "site_type": "news", "published": "2018-01-12T14:44:00.000+02:00", "replies_count": 0, "uuid": "f03642b74518547415f65cd850a6db132845956f"}, "author": "Paul Page", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1515757459", "ord_in_thread": 0, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "locations": [], "entities": {"persons": [{"name": "sarah nassauer", "sentiment": "none"}, {"name": "sam", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "logistics news from - wsj", "sentiment": "negative"}, {"name": "wal-mart", "sentiment": "neutral"}, {"name": "wsj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Sign up: With one click, get this newsletter delivered to your inbox .\nWal-Mart Stores Inc. is taking one of its biggest steps yet away from brick-and-mortar stores and into the digital world. The world’s biggest retailer is closing 63 of its Sam’s Club sites around the U.S. over the next few weeks, the WSJ’s Sarah Nassauer reports, and will covert about a dozen of the facilities into e-commerce fulfillment centers . The store closings, including what may total thousands of layoffs, come as Wal-Mart is raising its starting pay for U.S. workers and distributing one-time bonuses . The retailer is facing growing competition for low-wage workers in a tight labor market and likely expecting a windfall from the new tax law that will add billions to retailer profits. The moves at Sam’s Club are part of a bigger shift in the company’s underlying business. Wal-Mart’s overall online sales rose 50% in its most recent quarter, and the company’s big focus is getting more of those goods delivered to customers cheaper and faster.\nDemand for electric vehicles in China is growing, but not as fast as supply. Sales of electric passenger cars rose 72% to 578,000, a new sign of a big shift underway in the world’s biggest automobile market. Overall auto sales in China rose just 1.4% in 2017, the slowest pace in at least 15 years, the WSJ’s Trefor Moss reports. The end to the car-buying boom in China is part of a slowdown in the car industry world-wide over the past year that has defied the broader global economic resurgence. U.S. car sales slipped last year for the first time since the recession, and one forecaster expects North American output to decline 2.3% this quarter. The rapid growth in China’s electric-car sales suggests a new chapter in the business is opening. But figures from car makers suggest production is growing far faster than consumer demand: Even with the strong sales growth, China produced 170,000 more EVs than it sold last year.\nQualcomm Inc. is getting closer to taking over a bigger piece of the growing field of providing the brains for an increasingly automated world. The semiconductor maker is set to clinch as soon as next week conditional European Union antitrust approval for its $39 billion acquisition of NXP Semiconductors NV. The WSJ’s Natalia Drozdiak writes the deal would make Qualcomm one of the top suppliers of chips used in cars , adding more heat to the competition over technology being used to build automobiles with greater computer power and autonomous capabilities. The U.S. already has cleared the deal, and approval in Europe would pave the way for clearance in China and South Korea. Qualcomm has sought to soothe various European Commission antitrust concerns. Still, it’s unclear whether regulators still worry the pact would diminish competition in the auto sector and that the merged business would look to exclude rival suppliers from the market.\nE-COMMERCE Photo: Bloomberg News Fiat Chrysler Automobiles NV is joining the push toward more automotive production in the U.S. The company will invest $1 billion to move production of profitable pickup trucks from Mexico to Michigan, the WSJ’s Chester Dawson and John D. Stoll report, a move that will lower the auto maker’s exposure to potential changes to the North American Free Trade Agreement. The plan calls for shifting production of Ram Heavy Duty trucks from Saltillo, Mexico, to a factory in Warren, Mich., adding some 2,500 jobs there. The company says it will eventually build a vehicle “for global distribution” in Saltillo. Auto makers have been revamping production plans since President Donald Trump’s election, and foreign auto makers have been expanding factories or building new ones at a faster clip than Detroit’s Big 3. These foreign car companies are now poised to surpass domestic ones in U.S. production in coming years.\nQUOTABLE\n‘ I will say that if we don’t make a fair deal for this country, a Trump deal, then….I will terminate. ’\n—President Donald Trump, in a WSJ interview , on the Nafta negotiations.\nNumber of the Day 6.2% Year-over-year decline in U.S. and Canadian motor vehicle and parts rail carloads in 2017, to the lowest level since 2013, according to the Association of American Railroads.\nIN OTHER NEWS U.S. producer prices fell in December for the first time in more than a year. (WSJ)\nThe number of Americans filing applications for new unemployment benefits rose to a three-month high . (WSJ)\nChina’s chronically high trade surplus with the U.S. hit a record level in 2017. (WSJ)\nGermany’s economy grew at the fastest annual pace in six years in 2017. (WSJ)\nToyota Motor Corp. and Mazda Motor Corp. were offered at least $700 million in incentives to steer a $1.6 billion factory to Alabama. (WSJ)\nDelta Air Lines Inc.’s cargo revenue jumped 14.4% in the fourth quarter as overall profit dipped 8%. (WSJ)\nUnion Pacific Corp. estimates that changes in U.S. tax law will boost the railroad’s 2017 earnings by roughly $6 billion. (Associated Press)\nBoeing Co. released a prototype of a delivery drone that can carry up to 500 pounds up to 18 miles . (Air Cargo World)\nYRC Worldwide Inc. will pay Teamsters drivers $1 million for diverting too much freight to rails and brokers in the wake of last year’s hurricanes . (Journal of Commerce)\nCarrier Corp. is laying off another 215 workers at its Indiana heating and air conditioning factory. (Indianapolis Star)\nApple Inc. suppliers fueled record combined revenues for Taiwan’s technology companies in 2017. (Nikkei Asian Review)\nFurniture giant Ikea signed a lease for a 975,000-square-foot distribution center on New York’s Staten Island. (SILive)\n“Call of Duty” video game maker Activision Blizzard Inc.is shutting its U.S. distribution center as more gamers download games online . (MarketWatch)\nJapan plans to cull thousands of chickens after detecting an outbreak of bird flu , (South China Morning Post)\nMcDonald’s will eliminate foam cups and foam packaging throughout its network by the end of this year . (Chicago Tribune)\nLoaded container imports into the Port of Virginia rose 8.3% in December . (Virginian-Pilot)\nConsultants told Oregon’s Port of Portland it is unlikely to regain significant container shipping service . (Maritime Executive)\nBelgium Post Group took control of Dutch food logistics operator Leen Menken, a delivery arm of HelloFresh. (Nieuwsblad)\nBritish online grocer Ocado is testing a robot that would help maintain automation equipment in its warehouses. (The Guardian)\nABOUT US Paul Page is deputy editor of WSJ Logistics Report. Follow him at @PaulPage , and follow the entire WSJ Logistics Report team: @brianjbaskin , @jensmithWSJ and @EEPhillips_WSJ . Follow the WSJ Logistics Report on Twitter at @WSJLogistics .\nWrite to Paul Page at paul.page@wsj.com", "external_links": ["https://www.marketwatch.com/story/call-of-duty-maker-activision-shuts-down-sole-us-distribution-center-and-warehouse-2018-01-10", "https://maritime-executive.com/article/challenges-ahead-for-portland-s-container-terminal", "https://www.theguardian.com/business/2018/jan/11/ocado-to-wheel-out-c3po-style-robot-to-lend-a-hand-at-warehouses", "https://pilotonline.com/news/nation-world/virginia/article_5cc5651d-d3bf-5f2a-9dd7-2af3e43649a0.html", "http://www.scmp.com/news/asia/east-asia/article/2127881/japan-confirms-bird-flu-has-been-found-livestock-and-now-will", "https://www.indystar.com/story/news/local/2018/01/10/carrier-plant-lay-off-215-workers-thursday/1021745001/", "https://twitter.com/WSJLogistics?lang=en", "https://asia.nikkei.com/Business/Companies/Apple-suppliers-drove-record-Taiwan-tech-revenue-in-December", "https://twitter.com/jensmithWSJ", "http://www.nieuwsblad.be/cnt/dmf20180111_03292644", "https://twitter.com/brianjbaskin?lang=en", "https://aircargoworld.com/allposts/boeings-cargo-uav-a-shot-in-the-arm-for-drone-delivery-market-video/", "https://www.joc.com/trucking-logistics/labor/international-brotherhood-teamsters/yrc-freight-pay-teamsters-1m-contract-breach_20180111.html", "https://twitter.com/PaulPage", "http://www.chicagotribune.com/business/columnists/reed/ct-biz-mcdonalds-foam-cups-drop-robert-reed-0111-story.html", "https://twitter.com/EEPhillips_WSJ?lang=en", "http://www.silive.com/news/2018/01/ikea_to_open_staten_island_fac.html", "http://krvn.com/regional-news/union-pacific-estimates-6b-benefit-in-2017-from-tax-bill/"], "published": "2018-01-12T14:44:00.000+02:00", "crawled": "2018-01-12T21:01:34.000+02:00", "highlightTitle": ""}