{"organizations": [], "uuid": "be2a6616185f7ad86cddd282047281b29fee30c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-saudis-kingdom-soars-on-alwaleed-release-earnings-hit-sabic-idUSL8N1PN07S", "country": "US", "domain_rank": 408, "title": "MIDEAST STOCKS-Saudi's Kingdom soars on Alwaleed release, earnings hit SABIC", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T15:43:00.000+02:00", "replies_count": 0, "uuid": "be2a6616185f7ad86cddd282047281b29fee30c3"}, "author": "", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-saudis-kingdom-soars-on-alwaleed-release-earnings-hit-sabic-idUSL8N1PN07S", "ord_in_thread": 0, "title": "MIDEAST STOCKS-Saudi's Kingdom soars on Alwaleed release, earnings hit SABIC", "locations": [], "entities": {"persons": [{"name": "andrew torchia", "sentiment": "none"}, {"name": "alwaleed", "sentiment": "none"}, {"name": "prince alwaleed bin talal", "sentiment": "none"}], "locations": [{"name": "kingdom", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "sabic reuters", "sentiment": "none"}, {"name": "saudi basic industries", "sentiment": "none"}, {"name": "commercial international bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "saudi telecom", "sentiment": "none"}, {"name": "sabic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 1:45 PM / Updated 8 hours ago MIDEAST STOCKS-Saudi's Kingdom soars on Alwaleed release, earnings hit SABIC Reuters Staff \n* Saudi corruption probe seems to be drawing to close \n* Heavily weighted SABIC weighs on index \n* But gainers comfortably outnumber losers \n* Saudi Telecom rises after Q4 earnings beat \n* Commercial International Bank boosts Egypt’s index \nBy Andrew Torchia \nDUBAI, Jan 28 (Reuters) - Shares in Saudi Arabia’s Kingdom Holding soared on Sunday after owner Prince Alwaleed bin Talal was released from detention, but top petrochemical producer Saudi Basic Industries fell on weak fourth-quarter earnings. \nBecause of heavily weighted SABIC, the Saudi stock index rose only 0.2 percent, but rising stocks outnumbered losers by 109 to 67. \nThe release of Prince Alwaleed and at least several other senior Saudi businessmen at the weekend, after they were detained for over two months in a corruption probe, was seen as positive for their companies - and also for the market as a whole, by suggesting the probe, which sent shockwaves through political and business circles, was winding down. \nKingdom soared its 10 percent daily limit in its heaviest volume since the first trading day after Prince Alwaleed was detained in early November. It remains 2.3 percent below its level before Prince Alwaleed was detained; since then, the market index has gained over 8 percent. \nThe terms of the release of Prince Alwaleed and the other businessmen were not disclosed. A Saudi official said they had agreed to financial settlements after unspecified violations. \nBut Prince Alwaleed told Reuters that he had continued to maintain his innocence of any wrongdoing and did not expect to have to give up any assets. This suggested to investors that his company might not be seriously damaged by the affair. \nShares in Saudi fashion retailer Fawaz Abdulaziz Alhokair Co , some of whose major shareholders were released at the weekend, jumped 6.8 percent in its heaviest trade since early November. \nThe market index was weighed down, however, by a 2.8 percent drop by SABIC, which reported that quarterly net profit fell to 3.67 billion riyals ($979 million) from 4.51 billion riyals a year ago. SICO Bahrain had projected 5.34 billion riyals and NCB Capital, 5.41 billion riyals. \nSABIC attributed the fall in profit to planned turnarounds at certain plants, which hit output, and also noted that 2016’s quarterly profit was helped by recognition of deferred tax assets. \nYanbu National Petrochemicals closed 0.1 percent higher, coming well off the day’s highs, after reporting fourth-quarter profit of 778 million riyals, up 28 percent and beating SICO Bahrain’s forecast of 634 million riyals and NCB Capital’s 677 million riyals. \nSaudi Telecom also beat estimates with a rise of fourth-quarter net profit to 2.65 billion riyals from 2.08 billion riyals; its shares climbed 2.1 percent. \nThe rest of the Gulf was generally weak. Dubai’s index edged down 0.1 percent in this year’s thinnest trade so far, Abu Dhabi was down 0.3 percent and Qatar lost 0.5 percent. \nQatari real estate firm Ezdan, which had tumbled 6.8 percent on Thursday after reporting a drop in annual profit and halting its dividend, fell a further 1.1 percent. \nBut drilling rig provider Gulf International Services , the most heavily traded stock, climbed 3.6 percent to 20.52 riyals on the back of strong oil prices. It touched but then pulled back from technical resistance on the September peak of 20.99 riyals. \nEgypt’s index rose 0.9 percent as the biggest bank, Commercial International Bank, added 2.0 percent. HIGHLIGHTS \n* Index rose 0.2 percent to 7,538 points. DUBAI \n* Index fell 0.1 percent to 3,464 points. ABU DHABI \n* Index dropped 0.3 percent to 4,632 points. QATAR \n* Index lost 0.5 percent to 9,412 points. EGYPT \n* Index gained 0.9 percent to 15,311 points. KUWAIT \n* Index fell 0.3 percent to 6,629 points. BAHRAIN \n* Index edged up 0.04 percent to 1,342 points. OMAN", "external_links": [], "published": "2018-01-28T15:43:00.000+02:00", "crawled": "2018-01-28T16:14:28.001+02:00", "highlightTitle": ""}