{"organizations": [], "uuid": "f9d7d7f7cfd40c8ab88f64e13405543d57129233", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-mitek-reports-31-percent-revenue-growth-in-first-quarter-fiscal-2018.html", "country": "US", "domain_rank": 767, "title": "Mitek Reports 31% Revenue Growth in First Quarter Fiscal 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.138, "site_type": "news", "published": "2018-01-26T00:05:00.000+02:00", "replies_count": 0, "uuid": "f9d7d7f7cfd40c8ab88f64e13405543d57129233"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-mitek-reports-31-percent-revenue-growth-in-first-quarter-fiscal-2018.html", "ord_in_thread": 0, "title": "Mitek Reports 31% Revenue Growth in First Quarter Fiscal 2018", "locations": [], "entities": {"persons": [{"name": "james debello", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "mitek", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO,\nMitek (NASDAQ:MITK) ( www.miteksystems.com ), a global leader in mobile capture and digital identity verification software solutions, today announced its financial results for the first quarter of fiscal 2018 ended December 31, 2017.\nFiscal First Quarter 2018 Financial Highlights\nRevenue increased 31% year over year to $12.1 million. GAAP net loss of $(5.7) million, or $(0.17) per share, includes an estimated one-time non-cash charge of $4.4 million, or $0.13 per share, related to the enactment of the Tax Cuts and Jobs Act. Excluding the impact of tax reform, net loss was $(1.3) million, or $(0.04) per share. Non-GAAP net income was $1.0 million, or $0.03 per diluted share, up 4%. Total cash and investments was $45.8 million at the end of the fiscal first quarter.\nCommenting on the results, James DeBello, Chairman and CEO of Mitek, said:\n“Our results for the fiscal first quarter reflect continued solid growth from both our digital identity software solutions and our industry leading Mobile Deposit. Our growing and profitable recurring business in mobile deposit continues to be a solid springboard from which to capture the growth in the global digital identity verification market. During the quarter SaaS ID transactions increased 117% year over year, and we ended the quarter with 29% more ID customers than a year ago. With our continued momentum in both markets, we are well positioned for growth in fiscal 2018 and beyond.”\nFiscal 2018 Financial Guidance\nFor the fiscal year ending September 30, 2018, the Company is reiterating its previously provided guidance for full year total revenue of $57 million to $59 million, which would represent growth between 26% and 30% year over year. The Company continues to expect to generate a non-GAAP profit margin of approximately 19% to 20% for fiscal 2018.\nConference Call Information\nMitek management will host a conference call and live webcast for analysts and investors today at 1:30 p.m. Pacific Time (4:30 p.m. Eastern Time) to discuss the Company's financial results.\nTo listen to the live conference call, parties in the United States and Canada should dial 800-239-9838, access code 2115565. International parties should dial 323-794-2551, access code 2115565. Please dial in approximately 15 minutes prior to the start of the call.\nA live and archived webcast of the conference call will be accessible on the \"Investor Relations\" section of the Company's website at www.miteksystems.com . In addition, a phone replay will be available approximately two hours following the end of the call and it will remain available for one week. To access the call replay dial-in information, please click here .\nAbout Mitek\nMitek (MITK) is a global leader in mobile capture and identity verification software solutions. Mitek’s identity verification solution allows an enterprise to verify a user’s identity during a mobile transaction, enabling financial institutions, payments companies and other businesses operating in highly regulated markets to transact business safely while increasing revenue from the mobile channel. Mitek also reduces the friction in the mobile user experience with advanced data prefill. These innovative mobile solutions are embedded into the apps of 6,100 organizations and used by tens of millions of consumers daily for mobile check deposit, new account opening, insurance quoting and more. Learn more at www.miteksystems.com . [(MITK-F)]\nNotice Regarding Forward-Looking Statements\nStatements contained in this news release relating to the Company's or management's intentions, hopes, beliefs, expectations or predictions of the future, including, but not limited to, statements relating to the Company's long-term prospects and market opportunities are forward-looking statements. Such forward-looking statements are subject to a number of risks and uncertainties, including, but not limited to, risks related to the Company's ability to withstand negative conditions in the global economy, a lack of demand for or market acceptance of the Company's products, the Company's ability to continue to develop, produce and introduce innovative new products in a timely manner or the outcome of any pending or threatened litigation and the timing of the implementation and launch of the Company’s products by the Company's signed customers.\nAdditional risks and uncertainties faced by the Company are contained from time to time in the Company's filings with the U.S. Securities and Exchange Commission (SEC), including, but not limited to, the Company's Annual Report on Form 10-K for the fiscal year ended September 30, 2017 and its quarterly reports on Form 10-Q and current reports on Form 8-K, which you may obtain for free on the SEC's website at www.sec.gov . Collectively, these risks and uncertainties could cause the Company's actual results to differ materially from those projected in its forward-looking statements and you are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. The Company disclaims any intention or obligation to update, amend or clarify these forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required under applicable securities laws.\nNote Regarding Use of Non-GAAP Financial Measures\nThis news release contains non-GAAP financial measures for non-GAAP net income and non-GAAP net income per share that exclude stock compensation expenses, intellectual property litigation costs, acquisition-related costs and expenses, and deferred taxes. These financial measures are not calculated in accordance with generally accepted accounting principles (GAAP) and are not based on any comprehensive set of accounting rules or principles. In evaluating the Company's performance, management uses certain non-GAAP financial measures to supplement financial statements prepared under GAAP. Management believes these non-GAAP financial measures provide a useful measure of the Company's operating results, a meaningful comparison with historical results and with the results of other companies, and insight into the Company's ongoing operating performance. Further, management and the Board of Directors utilize these non-GAAP financial measures to gain a better understanding of the Company's comparative operating performance from period-to-period and as a basis for planning and forecasting future periods. Management believes these non-GAAP financial measures, when read in conjunction with the Company's GAAP financial statements, are useful to investors because they provide a basis for meaningful period-to-period comparisons of the Company's ongoing operating results, including results of operations against investor and analyst financial models, which helps identify trends in the Company's underlying business and provides a better understanding of how management plans and measures the Company's underlying business.\nMITEK SYSTEMS, INC. CONSOLIDATED BALANCE SHEETS (Unaudited) (amounts in thousands except share data) December 31, 2017 September 30, 2017 ASSETS Current assets: Cash and cash equivalents $ 6,341 $ 12,289 Short-term investments 31,999 30,279 Accounts receivable, net 5,652 7,099 Other current assets 3,077 1,209 Total current assets 47,069 50,876 Long-term investments 7,482 3,780 Property and equipment, net 833 613 Goodwill and intangible assets 18,355 5,311 Deferred income taxes 14,903 11,065 Other non-current assets 306 74 Total assets $ 88,948 $ 71,719 LIABILITIES AND STOCKHOLDERS’ EQUITY Current liabilities: Accounts payable $ 2,962 $ 1,918 Accrued payroll and related taxes 2,423 3,709 Deferred revenue, current portion 2,969 3,305 Other current liabilities 3,488 602 Total current liabilities 11,842 9,534 Deferred revenue, non-current portion 99 85 Other non-current liabilities 4,606 692 Total liabilities 16,547 10,311 Stockholders’ equity: Preferred stock, $0.001 par value, 1,000,000 shares authorized, none issued and outstanding — — Common stock, $0.001 par value, 60,000,000 shares authorized, 34,902,816 and 33,724,392 issued and outstanding, as of December 31, 2017 and September 30, 2017, respectively 35 34 Additional paid-in capital 87,020 78,677 Accumulated other comprehensive loss 277 147 Accumulated deficit (14,931 ) (17,450 ) Total stockholders’ equity 72,401 61,408 Total liabilities and stockholders’ equity $ 88,948 $ 71,719\nMITEK SYSTEMS, INC. CONSOLIDATED STATEMENTS OF OPERATIONS (Unaudited) (amounts in thousands except per share data) Three Months Ended December 31, 2017 2016 Revenue Software and hardware $ 7,206 $ 5,983 SaaS, maintenance, and consulting 4,930 3,286 Total revenue 12,136 9,269 Operating costs and expenses Cost of revenue—software and hardware 719 214 Cost of revenue—SaaS, maintenance, and consulting 898 677 Selling and marketing 4,775 3,838 Research and development 3,280 2,451 General and administrative 3,517 2,243 Acquisition-related costs and expenses 1,259 518 Total operating costs and expenses 14,448 9,941 Operating loss (2,312 ) (672 ) Other income, net 190 65 Loss before income taxes (2,122 ) (607 ) Income tax provision (3,614 ) — Net loss $ (5,736 ) $ (607 ) Net loss per share—basic and diluted $ (0.17 ) $ (0.02 ) Shares used in calculating net loss per share—basic and diluted 34,207 32,377\nMITEK SYSTEMS, INC. NON-GAAP NET INCOME RECONCILIATION (Unaudited) (amounts in thousands except per share data) Three Months Ended December 31, 2017 2016 Net loss $ (5,736 ) $ (607 ) Non-GAAP adjustments: Acquisition-related costs and expenses 1,259 518 Litigation costs 50 — Stock compensation expense 1,889 1,085 Income tax effect of pre-tax adjustments (960 ) — Impact of tax reform on deferred taxes 4,417 — Cash tax difference (1) 112 — Non-GAAP net income 1,031 996 Non-GAAP income per share—basic $ 0.03 $ 0.03 Non-GAAP income per share—diluted $ 0.03 $ 0.03 Shares used in calculating non-GAAP net income per share—basic 34,207 32,377 Shares used in calculating non-GAAP net income per share—diluted 36,235 34,695 (1) The Company’s non-GAAP net income per share is calculated using the cash tax rate of 4%. The estimated cash tax rate is the estimated tax payable on the Company’s tax returns as a percentage of estimated annual non-GAAP pre-tax net income. The Company uses an estimated cash tax rate to adjust for the historical variation in the effective book tax rate associated with the reversal of valuation allowances, the utilization of research and development tax credits, and the utilization of loss carryforwards which currently have an overall effect of reducing taxes payable. The Company believes that the cash tax rate provides a more transparent view of the Company’s operating results. The Company’s effective tax rate used for the purposes of calculating GAAP net loss for the three months ended December 31, 2017 was approximately 30%.", "external_links": ["https://www.globenewswire.com/Tracker?data=aVp_l8Qaxw_HcuiI57o71LXzb0FHS91PBht2RXFmoWuz9h9BjiEB52jqRkqF4rMFTHcmmR2rI28dUFzWkr_J5tSwenP3ofi7owp0yjw7ZSk=", "https://www.globenewswire.com/Tracker?data=aVp_l8Qaxw_HcuiI57o71LsFXLPVzUnihgiv5Wd9bEqqMii_uOOVemuMmEwubk5SKwgRDBoAm33PbBC2lWMni2dk5dhQKdlWiu6nn20fCt8=", "https://www.globenewswire.com/Tracker?data=iHNs-96CwsMI35MIIoYr2Fr0HrhKmvjnM56mDhc8VeIfYCRn3-o-8pbJfgnnZVf3mx5kMqgOyreK9LQBQURBew==", "https://www.globenewswire.com/Tracker?data=EEwBLBMP-vgPcsIXkdbxeG82gvxS0YvJ9DW6V_AdjFTHVAFJB_m0UcBfgiSPPbWNUUfOIvYPnQxlmwmct_y6O70UmqJPr9i4wxwmkcRUgYU9p8Z0V9ibylquYWqPYBTT7lRsid_mY2g3BKeenpIQpgVS7-i8CKmzBQf2VZTIXbcHkhH_I75q_llKshqjQqDIXhzLHlSKTgj0HtbJ0thWyw=="], "published": "2018-01-26T00:05:00.000+02:00", "crawled": "2018-01-26T02:58:16.000+02:00", "highlightTitle": ""}