{"organizations": [], "uuid": "c4eb31e3429d9f03bb857a1b2c59cbf2979f1d55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-liberia-fgm-law/liberia-bans-female-genital-mutilation-but-only-for-a-year-idUSKBN1FE1N7", "country": "US", "domain_rank": 408, "title": "Liberia bans female genital mutilation - but only for a year", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.04, "site_type": "news", "published": "2018-01-25T20:26:00.000+02:00", "replies_count": 0, "uuid": "c4eb31e3429d9f03bb857a1b2c59cbf2979f1d55"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-liberia-fgm-law/liberia-bans-female-genital-mutilation-but-only-for-a-year-idUSKBN1FE1N7", "ord_in_thread": 0, "title": "Liberia bans female genital mutilation - but only for a year", "locations": [], "entities": {"persons": [{"name": "johnson sirleaf", "sentiment": "none"}, {"name": "ellen johnson sirleaf", "sentiment": "none"}, {"name": "george weah", "sentiment": "none"}, {"name": "grace uwizeye", "sentiment": "none"}], "locations": [{"name": "liberia", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "equality now", "sentiment": "none"}, {"name": "fgm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Liberia has imposed a one-year ban on female genital mutilation - a highly contentious issue in the West African country - but campaigners said on Thursday it may not be enforceable and urged new president George Weah to push for a permanent law.\nThe ban came into force after former leader Ellen Johnson Sirleaf signed an executive order late last week before stepping down.\nBut the move received little publicity, overshadowed by this week’s inauguration of Johnson Sirleaf’s successor, former soccer star George Weah.\nThe ban makes it an offence to perform FGM on anyone under 18 but it can still be carried out on adults with their consent.\nCampaigners said FGM should be banned outright as even women who gave consent often did so under pressure.\n“It is too early to celebrate as there is still a long way to go before there is zero tolerance to FGM in Liberia,” said Grace Uwizeye, a consultant with international rights group Equality Now.\nActivists have long campaigned for FGM to be outlawed in Liberia, a country of about 4.6 million people, where around half of women have undergone the procedure.\nHowever, FGM has been an awkward issue for Johnson Sirleaf - Africa’s first female president - because it is overseen by a highly secretive and politically influential women’s society.\nSupporters say the ritual, involving the partial or total removal of the external genitalia, is a key rite of passage. But it often causes health problems and can be fatal.\nLast year parliamentarians removed FGM from Liberia’s domestic violence bill, saying it was a cultural matter.\nBut according to an official statement Johnson Sirleaf said on Friday that its omission undermined the law. Executive orders expire after a year.\nCampaigners have received death threats for speaking out about the practice which remains shrouded in taboo and is often performed during initiation ceremonies in bush schools with girls sworn to secrecy on their lives.\nFGM is practised in nearly 30 African countries, according to U.N. data, even though almost all have outlawed it.\nMackins Pajibo of Liberian group Women Solidarity Incorporated said the ban was good news, but probably not enforceable.\n“We call on President Weah ... to keep up the pressure for a permanent law which bans FGM completely for all women and children,” she told the Thomson Reuters Foundation.\nLakshmi Moore, acting country director with aid agency ActionAid, said there was a lot to do in the next year to push for a permanent and enforceable ban.\n“We know this is still a taboo topic in some communities, but we are seeing signs that attitudes are changing,” Moore said.\nAdditional reporting by James Giahyue in Monrovia. Editing by Belinda Goldsmith; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, which covers humanitarian news, women's rights, trafficking, corruption and climate change. Visit news.trust.org to see more stories.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T20:26:00.000+02:00", "crawled": "2018-01-26T21:39:43.001+02:00", "highlightTitle": ""}