{"organizations": [], "uuid": "6b2b86b8590d35d9cc7249afde2604c8630d30cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-asia-intelligence/southeast-asian-states-launch-intelligence-pact-to-counter-islamist-threat-idUSKBN1FE163", "country": "US", "domain_rank": 408, "title": "Southeast Asian states launch intelligence pact to counter Islamist threat", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T12:12:00.000+02:00", "replies_count": 0, "uuid": "6b2b86b8590d35d9cc7249afde2604c8630d30cd"}, "author": "", "url": "https://www.reuters.com/article/us-asia-intelligence/southeast-asian-states-launch-intelligence-pact-to-counter-islamist-threat-idUSKBN1FE163", "ord_in_thread": 0, "title": "Southeast Asian states launch intelligence pact to counter Islamist threat", "locations": [], "entities": {"persons": [{"name": "tom allard", "sentiment": "none"}], "locations": [{"name": "marawi", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "min read  jakarta/nusa dua", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JAKARTA/NUSA DUA, Indonesia (Reuters) - Six Southeast Asian nations launched an intelligence pact on Thursday aimed at combating Islamist militants and improving co-operation on security threats, overcoming what analysts described as a high level of distrust.\nUnder the “Our Eyes” initiative, senior defense officials will meet every two weeks to swap information on militant groups and develop a common database of violent extremists.\nThe intelligence sharing arrangement comes after insurgents aligned to Islamic State laid siege to the southern Philippine city of Marawi last year.\nDozens of foreigners - most notably Indonesians and Malaysians - were among hundreds of militants who seized large parts of Marawi and engaged in a ferocious battle with Philippine forces that left much of the city in ruins and more than 1,100 people dead, according to government figures.\nSome of the foreign fighters are believed to have traveled to Marawi via the porous maritime borders of the Sulu Sea, next to Indonesia, Malaysia and the Philippines.\n“This is something that seems so simple, but the effect is extraordinary,” said Indonesian Defence Minister Ryamizard Ryacudu at the “soft launch” in Bali.\nRyacudu said intelligence sharing would help ensure another incident like Marawi did not occur and prevent the region from “becoming like the Middle East”.\nHe added that the intelligence sharing was “specifically for (combating) terrorism and radicalism”.\nWhile led by military forces, the intelligence sharing would “involve all parties”, including police, he said.\nAlong with Indonesia, Malaysia, the Philippines, Singapore, Thailand and Brunei - all members of the Association of Southeast Asian Nations - have signed up to the pact.\n“It’s a significant development,” said John Blaxland, an intelligence analyst from the Australian National University.\n“ASEAN has long struggled with getting beyond superficiality when it comes to collaboration on security matters.”\nBlaxland said relations among ASEAN states had been bedeviled by a “high level of distrust” around intelligence cooperations.\n“Operational imperatives are overcoming that and you are seeing that come to fruition with this mechanism.”\nAnother security analyst, who declined to be named, said a “pact was better than not having a pact” but added that entrenched mistrust between nations, and between different counter-terrorism agencies within nations, had to be overcome for it to be effective.\nRyacudu said other nations could be invited to join the “Our Eyes” intelligence network, whose name is inspired by the Five Eyes long-standing intelligence pact between the United States, Britain, Australia, New Zealand and Canada.\nAs well as other ASEAN nations, Ryacudu identified the United States, Australia and Japan as possible future members.\n“Before joining, they will monitor first,” he said.\nRyacudu asked for assistance when he met U.S. Defence Secretary Jim Mattis on Tuesday in Jakarta.\n“General Mattis said that he would help,” he said. “I am very glad because, after all, the U.S. has more sophisticated equipment.”\nBali itself was the target of Islamist militant bombings in 2002 in which 202 people were killed, including 88 Australians.\nAdditional reporting by Bali stringer; Editing by Nick Macfie\n ", "external_links": [], "published": "2018-01-25T12:12:00.000+02:00", "crawled": "2018-01-25T12:29:21.000+02:00", "highlightTitle": ""}