{"organizations": [], "uuid": "740cfb88ffe72e05a83b96d252a6a8f60918c04a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-oil/update-1-oil-prices-hit-highest-since-2014-but-analysts-warn-of-overheated-mkt-idUSL4N1P51TB", "country": "US", "domain_rank": 408, "title": "UPDATE 9-U.S. crude inventory fall buoys oil, worries about rally persist", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.041, "site_type": "news", "published": "2018-01-10T12:21:00.000+02:00", "replies_count": 0, "uuid": "740cfb88ffe72e05a83b96d252a6a8f60918c04a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-oil/update-1-oil-prices-hit-highest-since-2014-but-analysts-warn-of-overheated-mkt-idUSL4N1P51TB", "ord_in_thread": 0, "title": "UPDATE 9-U.S. crude inventory fall buoys oil, worries about rally persist", "locations": [], "entities": {"persons": [{"name": "david gaffen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "eia", "sentiment": "negative"}, {"name": "wti", "sentiment": "negative"}, {"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "energy information administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Brent, WTI at multi-year highs\n* EIA reports 4.9 mln barrel draw in crude stocks last week\n* U.S. production drop supports bulls\n* OPEC cuts, global market rally have pushed up prices\n* Analysts warn of overheating (New throughout, updates prices, market activity and comments to settlement)\nBy David Gaffen\nNEW YORK, Jan 10 (Reuters) - Crude oil prices jumped on Wednesday and settled near three-year highs after U.S. government data showed a drop in crude inventories and production, even as fuel inventories rose.\nU.S. crude inventories fell 4.9 million barrels last week, more than the 3.9-million decline forecast, but bigger-than-expected builds in gasoline and fuel stocks offset that drawdown, the Energy Information Administration reported.\nThe market was bolstered modestly by data showing a sharp decline in U.S. production last week. Analysts said that could have been the result of extreme cold temperatures across the United States.\n“The lower draw in crude oil stocks, combined with the strong builds in product stocks is bearish news for prices. But market participants could also use the sharp drop in production as an excuse to buy,” said Carsten Fritsch, oil analyst at Commerzbank AG in Frankfurt, Germany.\nU.S. West Texas Intermediate (WTI) crude futures settled at $63.57 a barrel, up 61 cents, or 1 percent, their highest settlement since December of 2014. Earlier in the session, prices hit $63.67, their highest since Dec. 9, 2014.\nBrent crude futures settled at $69.20 a barrel, up 38 cents. The session high for the global benchmark was $69.37, highest since May 2015.\nThe oil market has been buoyant for weeks, with U.S. crude futures at highs not seen since late 2014, and Brent crude less than $1 per barrel away from a similar milestone.\nOil prices have surged more than 13 percent since early December, and there are indications of overheating. Analysts warned the market is not paying enough attention to U.S. production increases.\nA broad, global market rally, including stocks, has also fed investment into oil futures. Also, the dollar fell in a broad sell-off after a report that China was ready to slow or halt its U.S. treasury purchases. A weaker dollar generally boosts oil, which is priced in the U.S. currency.\n“When it comes to hedge fund buying in general the commodities trade is front-and-center and that momentum is building for oil,” said Rob Thummel, portfolio manager at energy investment manager Tortoise in Leawood, Kansas.\nThe rally has brought out some concerns that the market could overheat, especially as U.S. production is expected to rise to new records.\nOn Tuesday, the EIA boosted output expectations, saying it now sees overall production at record highs, surpassing 11 million barrels per day (bpd) by 2019.\nU.S. crude oil production C-OUT-T-EIA is expected to hit 10 million bpd next month, behind only Russia and Saudi Arabia.\nMembers of the Organization of the Petroleum Exporting Countries fear current price gains could prompt U.S. shale oil companies to flood the market. OPEC, along with non-members including Russia, have extended through the end of this year a deal to cut supply by 1.8 million bpd. (Additional reporting by Scott DiSavino in New York and Libby George in London; editing by Marguerita Choy and David Gregorio)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T12:21:00.000+02:00", "crawled": "2018-01-11T12:30:52.002+02:00", "highlightTitle": ""}