{"organizations": [], "uuid": "74f7902d55c451ad471318f8a6dce974b8bb951b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2012/08/23/48769155-48769155.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/americans-racked-up-more-than-1000-in-holiday-debt.html", "country": "US", "domain_rank": 767, "title": "Americans racked up more than $1,000 in holiday debt", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-02T19:13:00.000+02:00", "replies_count": 0, "uuid": "74f7902d55c451ad471318f8a6dce974b8bb951b"}, "author": "Jessica Dickler", "url": "https://www.cnbc.com/2018/01/02/americans-racked-up-more-than-1000-in-holiday-debt.html", "ord_in_thread": 0, "title": "Americans racked up more than $1,000 in holiday debt", "locations": [], "entities": {"persons": [{"name": "magnifymoney", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4:43 PM ET Fri, 29 Dec 2017 | 03:24 \nBy most accounts, shoppers were feeling particularly festive this holiday season . All that spending can leave a nasty financial hangover. \nAmericans racked up an average of $1,054 of debt over the period, about 5 percent more than last year, according to MagnifyMoney's annual post-holiday debt survey. \nOnly half of those surveyed said they plan to pay off their holiday-induced debt in three months or less. Of the remaining half, 29 percent said they will need five months or more. \nFor a shopper making a minimum payment of $25 a month on a $1,054 tab, that means it would take until 2023 to pay down the balance — and you'd also be coughing up $500 in interest over that time (assuming an annual percentage rate of 15.9 percent), MagnifyMoney said. The personal finance site surveyed nearly 700 adults from Dec. 21 to 26. \nWith that kind of burden, it's no surprise that about three-quarters, or 74 percent, of Americans said they failed to budget properly for the holidays, according to a separate survey from Varo Money. \nNearly half, or 46 percent, of Americans said they plan to pay off their credit cards within a month after the holidays. Another 16 percent will need one to three months, that survey found. A full quarter of consumers said it will take more than six months to pay off their holiday spending. The mobile banking start-up polled more than 1,000 U.S. adults in November. \nStill, Americans continue to take on ever-increasing amounts of debt. Consumer credit card debt now stands at $808 billion, according to recent data from the Federal Reserve Bank of New York. \nBecause of the particularly high interest rates that many credit cards carry, financial advisors recommend focusing on paying down this debt before other types of loans. Here are a few proven strategies for getting started. How to pay off credit card debt \nFor starters, figure out what you owe. Get balances and interest rates from your latest credit card and loan statements. \nIf you are juggling several different credit cards, check whether using a \"debt avalanche\" or \"debt snowball\" payment order would help you pay them off sooner or save you money on interest. \nThe avalanche method lists your debts from highest to lowest by interest rate. That way you pay off the debts that rack up the most in interest first. \nAlternatively, the snowball method prioritizes your smallest debts first, regardless of interest rate. The idea is that you'll gain momentum as the debts are paid off and that will motivate you to keep going. \nIf you need to take further steps to be debt-free, consider consolidating your debt with a personal loan or balance transfer credit card with more favorable terms – just make sure you choose a consolidation strategy with monthly payments you can manage. \nMore from Personal Finance:", "external_links": [], "published": "2018-01-02T19:13:00.000+02:00", "crawled": "2018-01-02T19:42:48.002+02:00", "highlightTitle": ""}