{"organizations": [], "uuid": "f6a1a97af8b1922441430ce320dd970c9081a9f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-sequans-communications-s-a-announces-proposed-underwritten-public-offering-of-american-depositary-shares.html", "country": "US", "domain_rank": 767, "title": "Sequans Communications S.A. Announces Proposed Underwritten Public Offering of American Depositary Shares", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:05:00.000+02:00", "replies_count": 0, "uuid": "f6a1a97af8b1922441430ce320dd970c9081a9f8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-sequans-communications-s-a-announces-proposed-underwritten-public-offering-of-american-depositary-shares.html", "ord_in_thread": 0, "title": "Sequans Communications S.A. Announces Proposed Underwritten Public Offering of American Depositary Shares", "locations": [], "entities": {"persons": [], "locations": [{"name": "paris", "sentiment": "none"}], "organizations": [{"name": "sequans communications s.a.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "american depositary shares", "sentiment": "none"}, {"name": "needham & company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS--(BUSINESS WIRE)-- Sequans Communications S.A. (NYSE: SQNS) (“Sequans” or the “Company”), a leading provider of single-mode 4G LTE semiconductor solutions for Internet of Things and a wide range of broadband data devices, today announced that it intends to offer newly issued American Depositary Shares (ADSs), representing ordinary shares, in an underwritten public offering under an effective shelf registration statement filed with the Securities and Exchange Commission (the “SEC”). The final terms of the offering will depend on market and other conditions at the time of pricing. Sequans intends to use the net proceeds from the offering for general corporate purposes.\nNeedham & Company is acting as the sole book-running manager of the offering.\nThe ADSs described above are being offered by Sequans pursuant to a shelf registration statement on Form F-3, including a base prospectus, previously filed with and subsequently declared effective by the SEC. The securities may be offered only by means of a prospectus. A preliminary prospectus supplement and accompanying base prospectus relating to the Offering will be filed with the SEC and will be available on the SEC’s website at http://www.sec.gov . Copies of the preliminary prospectus supplement and accompanying base prospectus relating to this offering may also be obtained, when available, from Needham & Company, LLC, Attention: Syndicate Prospectus Department, 250 Park Avenue, 10 th Floor, New York, New York 10177, by telephone at 1-800-903-4696, or by email at prospectus@needhamco.com . Before you invest, you should read the preliminary prospectus supplement and the accompanying base prospectus and other documents Sequans has filed or will file with the SEC for more complete information about Sequans and the Offering.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy any of the securities described herein, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Sequans Communications\nSequans Communications S.A. (NYSE: SQNS) is a leading provider of single-mode 4G LTE semiconductor solutions for the Internet of Things (“IoT”) and a wide range of broadband data devices. Founded in 2003, Sequans has developed and delivered seven generations of 4G technology and its chips are certified and shipping in 4G networks around the world. Today, Sequans offers two LTE product lines: StreamrichLTE™, optimized for broadband devices, including CPE, mobile and portable routers, and high-performance IoT devices, and StreamliteLTE™, optimized for lower data rate and narrowband IoT devices. The Company is based in Paris, France with additional offices in the United States, United Kingdom, Israel, Hong Kong, Singapore, Sweden, Taiwan, South Korea, and China. Visit Sequans online at www.sequans.com ; www.facebook.com/sequans ; www.twitter.com/sequans\nSafe Harbor\nThis press release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995 regarding the proposed public offering and the intended use of proceeds from the offering. The offering is subject to market and other conditions and there can be no assurance as to whether or when the offering may be completed or as to the actual size or terms of the offering. These forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially, including market conditions, risks associated with the cash requirements of our business and other risks detailed from time to time in our filings with the Securities and Exchange Commission, and represent our views only as of the date they are made and should not be relied upon as representing our views as of any subsequent date. We do not assume any obligation to update any forward-looking statements.\nDisclaimer\nThe announcement is for information purposes only and does not, and shall not, in any circumstances, constitute a public offering by Sequans, nor a solicitation of an offer to subscribe for securities in any jurisdiction outside the United States, including France. No prospectus (including any amendment, supplement or replacement thereto) or any other offering material has been prepared in connection with the offering of the ADSs that has been approved by the Autorité des marchés financiers or by the competent authority of another State that is a contracting party to the Agreement on the European Economic Area and notified to the Autorité des marchés financiers; no ADSs have been offered or sold nor will be offered or sold, directly or indirectly, to the public in France; the prospectus or any other offering material relating to the ADSs have not been distributed or caused to be distributed and will not be distributed or caused to be distributed to the public in France; such offers, sales and distributions have been and shall only be made in France to persons licensed to provide the investment service of portfolio management for the account of third parties, qualified investors (investisseurs qualifiés) and/or restricted circle of investors (cercle restreint d’investisseurs), in each case investing for their own account, all as defined in Articles L. 411-2, D. 411-1, D. 411-4, D.744-1, D.754-1 and D. 764-1 of the French Code monétaire et financier. The direct or indirect distribution to the public in France of any so acquired ADSs may be made only as provided by Articles L. 411-1, L. 411-2, L. 412-1 and L. 621-8 to L. 621-8-3 of the French Code monétaire et financier and applicable regulations thereunder. This communication does not constitute an offer or invitation to subscribe for or to purchase any of the ADSs and neither this communication nor anything herein shall form the basis of any contract or commitment whatsoever. Any contact with potential qualified investors in France does not and will not constitute financial and banking solicitation (démarchage bancaire et financier) as set forth in Articles L. 341-1 and seq. of the French Code monétaire et financier.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116006654/en/\nSequans Communications S.A.\nMedia Relations:\nKimberly Tassin, +1-425-736-0569\nKimberly@sequans.com\nor\nInvestor Relations:\nClaudia Gatlin, +1-212-830-9080\nClaudia@sequans.com\nSource: Sequans Communications S.A.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51744031&newsitemid=20180116006654&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=1&md5=7cf15d9a2bca2a30d1551b775b926a53", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.facebook.com%2Fsequans&esheet=51744031&newsitemid=20180116006654&lan=en-US&anchor=www.facebook.com%2Fsequans&index=3&md5=d4a19584b72c02105f9ac437467b2f20", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sequans.com&esheet=51744031&newsitemid=20180116006654&lan=en-US&anchor=www.sequans.com&index=2&md5=302b093eb75a628db8061fbe999a73c0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.twitter.com%2Fsequans&esheet=51744031&newsitemid=20180116006654&lan=en-US&anchor=www.twitter.com%2Fsequans&index=4&md5=85985b3038d35c63d0b9bc5edb989701", "http://www.businesswire.com/news/home/20180116006654/en/"], "published": "2018-01-17T00:05:00.000+02:00", "crawled": "2018-01-16T23:45:12.028+02:00", "highlightTitle": ""}