{"organizations": [], "uuid": "15db476b486a333c707134fa32c68f59a7d92f23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-gulf-rises-on-oil-global-trend-first-abu-dhabi-surges-idUSL8N1OZ1GX", "country": "US", "domain_rank": 408, "title": "MIDEAST STOCKS-Gulf rises on oil, global trend; First Abu Dhabi surges", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T15:26:00.000+02:00", "replies_count": 0, "uuid": "15db476b486a333c707134fa32c68f59a7d92f23"}, "author": "", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-gulf-rises-on-oil-global-trend-first-abu-dhabi-surges-idUSL8N1OZ1GX", "ord_in_thread": 0, "title": "MIDEAST STOCKS-Gulf rises on oil, global trend; First Abu Dhabi surges", "locations": [], "entities": {"persons": [{"name": "andrew torchia", "sentiment": "none"}, {"name": "abu dhabi", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "first abu dhabi", "sentiment": "negative"}, {"name": "al rajhi bank", "sentiment": "none"}, {"name": "first abu dhabi bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "abu dhabi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 1:27 PM / in 42 minutes MIDEAST STOCKS-Gulf rises on oil, global trend; First Abu Dhabi surges Reuters Staff \n* Abu Dhabi index hits highest level since August \n* Analysts believe First Abu Dhabi Bank undervalued \n* Dubai rebounding from base of long-term uptrend channel \n* Al Rajhi Bank outperforms in Saudi Arabia \n* Glaxo Egypt jumps on Q3 earnings \nBy Andrew Torchia \nDUBAI, Jan 4 (Reuters) - Gulf stock markets rose on Thursday, buoyed by rising oil prices and record closes on Wall Street, while strength in the United Arab Emirates’ biggest bank boosted Abu Dhabi’s market in particular. \nThe Abu Dhabi index climbed 1.5 percent to its highest level since mid-August as First Abu Dhabi Bank surged 2.4 percent to 10.90 dirhams, bringing its gains in the last three days to 6.3 percent. \nThe stock rose on Wednesday above its 200-day average for the first time since September, triggering a minor double bottom formed by the lows since October. Of 10 analysts polled by Reuters, one has a “strong buy” on the stock, five have a “buy” and four have a “hold”, with a median target of 11.75 dirhams. \nDubai’s index edged up 0.1 percent to 3,464 points following four days of gains. Amlak Finance added 2.9 percent after saying it signed a memorandum of understanding with Egypt’s Marseilia Group to develop a property project in Cairo. \nDubai’s medium-term technical outlook turned positive this week as it began to rebound from the bottom of an uptrend channel dating back to early 2016. Technically, a rise in coming months to near the top of the channel would not be surprising, and would take the index above 3,700 points. \nSaudi Arabia’s index rose 0.7 percent to its highest level since early October, passing resistance around 7,200 points, which was support in August and September. Any clean break - another daily close above that level on Sunday - would point up to at least the September peaks around 7,400 points. \nAl Rajhi Bank added 1.6 percent after its 2 percent gain on Wednesday. \nEgypt’s blue-chip index fell 0.4 percent. But Glaxo Egypt surged 7.0 percent after reporting a 26 percent year-on-year rise in third-quarter consolidated net profit. HIGHLIGHTS \n* The index rose 0.7 percent to 7,277 points. DUBAI \n* The index edged up 0.1 percent to 3,464 points. ABU DHABI \n* The index climbed 1.5 percent to 4,548 points. QATAR \n* The index rose 0.3 percent to 8,631 points. EGYPT \n* The index fell 0.4 percent to 14,782 points. KUWAIT \n* The index gained 0.8 percent to 6,454 points. BAHRAIN \n* The index dropped 1.0 percent to 1,312 points. OMAN \n* The index rose 0.3 percent to 5,105 points. Editing by Adrian Croft", "external_links": [], "published": "2018-01-04T15:26:00.000+02:00", "crawled": "2018-01-04T16:00:32.008+02:00", "highlightTitle": ""}