{"organizations": [], "uuid": "ee4aeb7254f3179e15a33f346cfaf34cc8bb68f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-gkn-m-a-melrose-inds/gkn-calls-melroses-hostile-offer-statement-misleading-idUKKBN1F70SK", "country": "US", "domain_rank": 408, "title": "GKN calls Melrose's hostile offer statement \"misleading\"", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T10:05:00.000+02:00", "replies_count": 0, "uuid": "ee4aeb7254f3179e15a33f346cfaf34cc8bb68f4"}, "author": "", "url": "https://uk.reuters.com/article/uk-gkn-m-a-melrose-inds/gkn-calls-melroses-hostile-offer-statement-misleading-idUKKBN1F70SK", "ord_in_thread": 0, "title": "GKN calls Melrose's hostile offer statement \"misleading\"", "locations": [], "entities": {"persons": [{"name": "melrose", "sentiment": "negative"}, {"name": "noor zainab hussain", "sentiment": "none"}, {"name": "paul sandle", "sentiment": "none"}], "locations": [{"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "gkn", "sentiment": "negative"}, {"name": "board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 8:06 AM / Updated 15 minutes ago GKN roundly dismisses 'fake' Melrose bid premium Noor Zainab Hussain 5 Min Read \n(Reuters) - British engineering group GKN ( GKN.L ) dismissed Melrose’s ( MRON.L ) 7.4 billion pound hostile bid as “misleading” and denied it was rushing into a break-up. \nGKN, which makes parts for the Boeing 737 jet, Black Hawk helicopter and components for Volkswagen and Ford cars, rejected turnaround specialist Melrose’s bid on Wednesday, saying that the share and cash offer was “effectively unchanged” from a first private approach on Jan. 8, which GKN also spurned. \n“GKN’s Board considers 32 percent to be a fake premium. Melrose’s market capitalisation on 5 January was significantly smaller than GKN’s on the same day ... and Melrose brings no industrial synergies,” it said in a robustly-worded statement. \n“The true, delivered premium is less than 11 percent,” GKN, which has since set out plans to split its business, added. \nMelrose’s bid is one of the biggest hostile takeover attempts in Britain since Kraft bought chocolate maker Cadbury in 2009. Pfizer’s attempt to buy AstraZeneca in 2014 and Kraft Heinz’s tilt at Unilever last year were both abandoned after successful defence fightbacks from the target companies. \nMelrose pounced on GKN after problems at the firm’s aerospace division led to profit warnings in October and November, sparking a sharp share price fall. \nIts offer of 1.49 new shares and 81 pence in cash for each GKN share, was worth 430.1 pence based on Melrose’s Jan. 16 closing price. But Melrose’s shares have risen since Jan. 5, the day before it approached GKN’s board, increasing the bid value. \nShares in GKN also jumped after it rejected Melrose’s approach on Jan. 12, but Melrose based its 32 percent premium on GKN’s share price on Jan. 5, which GKN said was misleading. \nGKN said its shareholders will end up funding the majority of the premium, adding Melrose’s leverage at the end of June was 2.3 times its core earnings, compared with GKN’s 0.6 times. \nOf the 1.39 billion pounds cash being offered, Melrose is only able to fund up to 75 million ponds without leverage exceeding 2.5 times its core earnings, GKN said, adding this was equal to less than 5 pence per GKN share. \n“We are actively engaging with shareholders to explain how our transformation plan will provide value, whilst debunking some of Melrose’s inaccurate assertions,” GKN’s chief executive Anne Stevens said in a statement. ACTIVIST INTEREST \nA source familiar with the situation said earlier this week that Elliott Advisors, which has a 1.7 percent interest in GKN, thinks it should open talks with Melrose, although the activist hedge fund thinks the existing offer unattractive. \nElliott, which declined to comment, also holds a short position in Melrose, which it increased on Tuesday to 0.7 percent, from 0.51 percent. \nMelrose, whose business model is to buy engineering companies, improve their margins and resell them, already owns diversified firm Nortek and the Brush electricity generating equipment businesses. \nGKN, whose roots date back to the 18th century and is currently valued at 7.7 billion pounds, also said it was significantly larger than any business that Melrose had bought and its board had “very limited experience ... of managing Tier 1 aerospace and automotive suppliers”. \n“GKN is more than five times larger than any of Melrose’s prior acquisitions by revenue,” Stevens said. \nThe target firm also refuted Melrose’s claim that it wanted a “hasty break-up”, saying that the timing of the separation “will be determined by the need to maximise the economic benefits and minimise the costs associated with separation”. TRACK RECORD \nFTSE-250 firm Melrose listed on London’s junior market in 2003 with a market value of 13 million pounds, making it to London’s blue-chip index in 2012, before dropping out in 2014. \nMelrose bought engineering firm Elster for 1.8 billion pounds in 2012, selling it to Honeywell Inc for 3.3 billion pounds three years later. It returned 2.4 billion pounds to shareholders in 2016. \nMelrose has some experience of aerospace businesses after buying McKechnie, a manufacturer of aerospace components, and Dynacast, which makes small engineered precision components, in 2005. It sold its aerospace and aftermarket businesses in 2007. \nRothschild, RBC Europe and Investec are advising Melrose, while GKN is working with Gleacher Shacklock, JPMorgan Cazenove and UBS. Reporting by Noor Zainab Hussain in Bengaluru and Paul Sandle in London; Editing by Alexander Smith", "external_links": [], "published": "2018-01-18T10:05:00.000+02:00", "crawled": "2018-01-18T10:27:04.019+02:00", "highlightTitle": ""}