{"organizations": [], "uuid": "8bd73befb7b6054eb8b0d6ce0c79f0aa6924b55a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-rex-energy-appoints-new-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Rex Energy Appoints New Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.264, "site_type": "news", "published": "2018-01-23T16:16:00.000+02:00", "replies_count": 0, "uuid": "8bd73befb7b6054eb8b0d6ce0c79f0aa6924b55a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-rex-energy-appoints-new-chief-financial-officer.html", "ord_in_thread": 0, "title": "Rex Energy Appoints New Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "curt walker", "sentiment": "none"}, {"name": "rex", "sentiment": "none"}, {"name": "curt", "sentiment": "none"}, {"name": "thomas rajan", "sentiment": "none"}, {"name": "tom stabley", "sentiment": "none"}, {"name": "walker", "sentiment": "none"}], "locations": [{"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "rex energy corporation", "sentiment": "negative"}, {"name": "rex energy", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "yrc worldwide", "sentiment": "none"}, {"name": "shippensburg university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STATE COLLEGE, Pa., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Rex Energy Corporation (the “Company”) (NASDAQ:REXX) today announced that it has appointed Curt Walker, the Company’s current Chief Accounting Officer, to the position of Chief Financial Officer, effective immediately. Mr. Walker will be responsible for all financial, accounting and treasury functions, as well as other related duties.\nMr. Walker has been the Company’s Chief Accounting Officer since May 2012. Prior to his promotion, he served as Vice President, Accounting, and has been with Rex Energy since 2007. Prior to joining Rex, Mr. Walker was with YRC Worldwide, a Fortune 500 trucking and transportation company. Mr. Walker holds a Bachelor of Science degree in Accounting and an M.B.A., both from Shippensburg University.\n“Curt has been a key part of the Rex team for over a decade and has been integral in the success of our company. We are very pleased that he has accepted the expanded role and we’re confident that he is very qualified for the job,” said Tom Stabley, President and Chief Executive Officer.\nThomas Rajan, the Company’s previous CFO, has resigned from his position effective immediately. There have been no disagreements with the Board of Directors or with executive management, and Mr. Rajan’s departure is not related to any issues regarding financial disclosures, accounting or legal matters. Mr. Stabley commented, “We thank Thomas for his service over the last three years at Rex and wish him the best going forward.”\nForward-Looking Statements\nThis release may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities and Exchange Act of 1934. Forward-looking statements are based on current beliefs and expectations and involve certain assumptions or estimates that involve various risks and uncertainties, such as financial market conditions, changes in commodities prices and the other risks discussed in detail in the Company's Annual Report on Form 10-K for the year ended December 31, 2016 and other subsequent filings with the Securities and Exchange Commission. Readers should not place undue reliance on any such forward-looking statements, which are made only as of the date hereof. Rex Energy has no duty, and assumes no obligation, to update forward-looking statements as a result of new information, future events or otherwise.\nAbout Rex Energy Corporation\nHeadquartered in State College, Pennsylvania, Rex Energy is an independent oil and gas exploration and production company with its core operations in the Appalachian Basin. The Company’s strategy is to pursue its higher potential exploration drilling prospects while acquiring oil and natural gas properties complementary to its portfolio.\nFor more information contact:\nInvestor Relations\n(814) 278-7130\nInvestorRelations@rexenergycorp.com\nSource:Rex Energy Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/659a46d0-d298-4244-b784-57ad579dfa81"], "published": "2018-01-23T16:16:00.000+02:00", "crawled": "2018-01-23T17:32:44.000+02:00", "highlightTitle": ""}