{"organizations": [], "uuid": "22f4efecd2db07cff2b02cb21d7d5ce87b324aca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-immigration-ruling/u-s-judge-blocks-prompt-deportation-of-cambodians-idUSKBN1FF2QO", "country": "US", "domain_rank": 408, "title": "U.S. judge blocks prompt deportation of Cambodians", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T22:49:00.000+02:00", "replies_count": 0, "uuid": "22f4efecd2db07cff2b02cb21d7d5ce87b324aca"}, "author": "", "url": "https://www.reuters.com/article/us-usa-immigration-ruling/u-s-judge-blocks-prompt-deportation-of-cambodians-idUSKBN1FF2QO", "ord_in_thread": 0, "title": "U.S. judge blocks prompt deportation of Cambodians", "locations": [], "entities": {"persons": [{"name": "dan lev", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mica rosenberg", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "cambodia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "san francisco/new york", "sentiment": "none"}], "organizations": [{"name": "khmer rouge", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 8:49 PM / Updated 16 minutes ago U.S. judge blocks prompt deportation of Cambodians Dan Levine , Mica Rosenberg 3 Min Read \nSAN FRANCISCO/NEW YORK (Reuters) - A federal judge late on Thursday said President Donald Trump’s administration cannot immediately deport 92 Cambodian citizens from the United States without first allowing them a chance to challenge the action in court. \nU.S. immigration authorities conducted raids last October and arrested approximately 100 Cambodians, many of whom had fled the Khmer Rouge government in the 1970s. \nAfter arriving in the United States, the Cambodians had been convicted of various criminal charges, and ordered deported years ago. However Cambodia refused to repatriate them, so they were released from immigration custody and many held down jobs until they were re-arrested last year. \nIn ongoing negotiations over immigration reform, the Trump administration is seeking stronger measures against immigrants who have been ordered deported but whose home countries refused to accept them, a senior administration official said. \nIn a ruling on Thursday, U.S. District Judge Cormac Carney in Santa Ana, California federal court ruled that 92 of the Cambodians still in custody could raise “serious questions” about the validity of their underlying convictions and deportation orders. \nThe government said the Cambodians’ request should be rejected because they knew they could be deported at any instant, an argument the judge called insensitive. \n“It is disingenuous for the Government to claim that throughout the many years that Petitioners were permitted to live and work on supervised release, they should not have built up any expectation that they would be permitted to remain in the country,” Carney wrote. \nA U.S. Department of Justice spokesman could not immediately be reached for comment. \nThree other U.S. judges have issued similar rulings stopping the government from quickly deporting immigrants who have long lived in the country, said Lee Gelernt, deputy director of the American Civil Liberties Union Immigrants’ Rights Project who represents the Cambodians. \nThose rulings involved Iraqis, Indonesians and Somalians, he said. \n“In each case, the courts have soundly rejected the administration’s claim that it is necessary to abruptly remove these long term residents without giving them due process,” Gelernt said. Additional reporting by Roberta Rampton in Washington; Editing by Alistair Bell", "external_links": [], "published": "2018-01-26T22:49:00.000+02:00", "crawled": "2018-01-26T22:59:38.032+02:00", "highlightTitle": ""}