{"organizations": [], "uuid": "662d59dc7662cdf7e5a6c5e9755789c49ec49eda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-deep-water-point-hires-healthcare-industry-veteran-amy-caro-as-partner.html", "country": "US", "domain_rank": 767, "title": "Deep Water Point Hires Healthcare Industry Veteran Amy Caro as Partner", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.947, "site_type": "news", "published": "2018-01-30T17:00:00.000+02:00", "replies_count": 0, "uuid": "662d59dc7662cdf7e5a6c5e9755789c49ec49eda"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-deep-water-point-hires-healthcare-industry-veteran-amy-caro-as-partner.html", "ord_in_thread": 0, "title": "Deep Water Point Hires Healthcare Industry Veteran Amy Caro as Partner", "locations": [], "entities": {"persons": [{"name": "amy caro", "sentiment": "negative"}, {"name": "caro", "sentiment": "none"}], "locations": [{"name": "partner mclean", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}], "organizations": [{"name": "globe newswire", "sentiment": "negative"}, {"name": "deep water point hires healthcare industry veteran", "sentiment": "negative"}, {"name": "healthcare practice", "sentiment": "none"}, {"name": "northrop grumman", "sentiment": "none"}, {"name": "social security administration", "sentiment": "none"}, {"name": "departments of health and human services and veterans affairs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MCLEAN, Va., Jan. 30, 2018 (GLOBE NEWSWIRE) --\nDeep Water Point, a leader in federal management consulting, today announced the addition of Amy Caro as a Partner. Caro will lead Deep Water Point’s Healthcare Practice focusing on clients that include product companies, small businesses and large systems integrators.\nCaro joins Deep Water Point after serving eight years as Vice President of Health Solutions for Northrop Grumman. In this capacity, Caro oversaw Northrop Grumman's overall health business consisting of a wide-range of clients, including the Departments of Health and Human Services and Veterans Affairs, as well as the Social Security Administration. Additionally, she was responsible for developing a comprehensive health business strategy, operational growth pipeline and program execution for the business unit.\nWith extensive expertise in providing mission-critical enterprise-wide health applications, interoperable architecture, large-scale systems integration and engineering to leading health organizations, Caro will bring all these skillsets to bear as she leads and defines the strategy for Deep Water Point’s Healthcare Practice.\n“We are pleased to have Amy join Deep Water Point. From program management to financial oversight to customer engagement, Amy brings a diverse skillset to our Healthcare Practice,” said Howard Seeger, Managing Partner of Deep Water Point. “Amy’s healthcare expertise, extensive connections, and sound leadership will provide us with a solid foundation to continue to deliver exceptional service to our healthcare related clients.”\nThe Deep Water Point Healthcare Practice includes a wide-array of government and industry subject matter experts who can address the different dimensions of the federal healthcare field. Deep Water Point pairs business development and capture teams with doctors, health IT specialists and informatics specialists, as well as experts in individual agencies, to drive successful outcomes. This multi-disciplined approach provides federal clients with a comprehensive view of the federal health market – not just upcoming opportunities, but the technology, policy and regulatory issues that shape the health IT environment in each agency.\nAbout Deep Water Point, LLC\nDeep Water Point helps companies accelerate their federal business by providing complete business life cycle support. As a result, Deep Water Point’s clients are some of the most successful in the federal market. The firm’s unique operating model allows its clients to benefit from the vast knowledge of its cadre of subject matter experts including successful high ranking industry and government executives within the Federal Civilian, DoD and Intelligence communities. For more information, visit www.deepwaterpoint.com .\nContact:\nMs. Ariel Glassman\n(301) 526-6478\nariel.glassman@deepwaterpoint.com\nwww.deepwaterpoint.com\nSource: Deep Water Point", "external_links": ["https://www.globenewswire.com/Tracker?data=lJQ73aIVQLXU_HVVjY83iXp2NXEoA7JXwrAs_1A_GdiTFQXcPYGhVEWZxwpQUHDsXQlaSkPLYkymnBINyZOihA==", "https://www.globenewswire.com/Tracker?data=I4TXJpoKeyyCCxcJ2jCZSDL67E4kxA3o2xgM_67JkqItqEFiXOF21T-AAeJbLPQDd55i3vucMVZyBUm0PTtIFgev3E21XuXGq5SIJyli41I=", "https://www.globenewswire.com/Tracker?data=C4OISXh1EybKuzT-sugsE_Aq0ch1-cTHzoARaqe0K9Wr3bTu9mtk5fJ-Aq8I2Z38q2TnSU_VSx4lKj80-Yp40jM3_iyv5CbdMDmTMerEMrrtRMJkoXBt3ycFVqtConL2", "https://www.globenewswire.com/NewsRoom/AttachmentNg/57eaaafa-6d01-4ab1-8424-4d42b171b47a", "https://www.globenewswire.com/Tracker?data=I4TXJpoKeyyCCxcJ2jCZSDL67E4kxA3o2xgM_67JkqLAwEVPk9nuMVnGjSOBxXop_MwFnSvt7KZXs1E8r7mnzKGYx3Os_aKRuHnCOyEv2m8="], "published": "2018-01-30T17:00:00.000+02:00", "crawled": "2018-01-30T18:44:24.027+02:00", "highlightTitle": ""}