{"organizations": [], "uuid": "0acf2199706d3a7d4db74010d6b380589ccef395", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224913473&w=1200&r=LYNXMPEE0N22D", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/davos-meeting-opec/u-s-tells-russia-saudi-shale-oil-wont-be-oil-market-spoiler-idINKBN1FD2V5", "country": "US", "domain_rank": 408, "title": "U.S. tells Russia, Saudi shale oil won't be oil market 'spoiler'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T21:58:00.000+02:00", "replies_count": 0, "uuid": "0acf2199706d3a7d4db74010d6b380589ccef395"}, "author": "", "url": "https://in.reuters.com/article/davos-meeting-opec/u-s-tells-russia-saudi-shale-oil-wont-be-oil-market-spoiler-idINKBN1FD2V5", "ord_in_thread": 0, "title": "U.S. tells Russia, Saudi shale oil won't be oil market 'spoiler'", "locations": [], "entities": {"persons": [{"name": "perry", "sentiment": "none"}, {"name": "alexander novak", "sentiment": "none"}, {"name": "khalid al-falih", "sentiment": "none"}, {"name": "rick perry", "sentiment": "none"}, {"name": "dmitry zhdannikov", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "energy", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland (Reuters) - U.S. Energy Secretary Rick Perry told oil super-powers Russia and Saudi Arabia he believed U.S. shale oil boom would not become a spoiler for oil markets because new production would be absorbed by fast rising global demand.\nPerry, a former governor of Texas, the heartland of the U.S. shale oil boom, was speaking at a rare joint panel with Russian and Saudi energy ministers, Alexander Novak and Khalid al-Falih, at the World Economic Forum in Davos.\n“I don’t think American shale production will be a spoiler. There is a lot of reforms going on around the world - in the kingdom (of Saudi Arabia), in Mexico, in India - those reforms have the potential to really drive the consumption,” he said.\nOPEC led by Saudi Arabia and non-OPEC Russia have reduced production during 2017-2018 to prop up oil prices.\nThe United States, which rivals Russia and Saudi Arabia for the position of the world’s largest oil producer, is not participating in cuts as its industry is represented by private producers who can be sued for collusion if they join the deal.\nPerry said President Donald Trump’s slogan “America First” meant first of all competition with rivals including in oil markets.\n“We have a bit of a feast rather than famine now but it is good for the world,” he added.\nNovak and Falih both said the markets were too much focussed on the swings in U.S. shale production, which still represented a fairly modest portion of the global output.\nFILE PHOTO - U.S. Energy Secretary Rick Perry attends the opening of the International Atomic Energy Agency (IAEA) General Conference at their headquarters in Vienna, Austria September 18, 2017. REUTERS/Leonhard Foeger Falih said Mexican and Venezuelan output were declining and predicted that global oil demand would soar in the next 25 years to 120 million barrels per day from the current levels of just under 100 million.\nU.S. shale output is expected to rise by 1 million bpd this year, to take U.S. total production well above 10 million bpd.\nRussian Energy Minister Alexander Novak (L) and Saudi Arabia's Oil Minister Khalid al-Falih address a news conference after an OPEC meeting in Vienna, Austria, November 30, 2017. REUTERS/Heinz-Peter Bader Novak also said demand was rising fast and old oilfields around the world were depleting, meaning U.S. production growth was unlikely to tip oil markets back into a surplus.\nRussia has previously voiced concerns oil prices might have risen too fast and were encouraging shale oil growth too much.\nNovak said oil producers would ultimately go back to direct competition when the OPEC/non-OPEC deal expires but did not say when it could happen.\nFalih said OPEC and its non-OPEC allies would exit from oil production cuts very gradually and smoothly in order not to shock markets in the early part of 2019, when demand will seasonally slow.\nHe said it was very unlikely cuts could be exited in June when OPEC meets next time and added that he believed they could be just adjusted at some point. He also said OPEC could change the level of stocks it was targeting by its output reductions.\nHe also said the strategy of maximising production during the previous minister Ali al-Naimi in 2014-2015 had caused too much pain for both producers and consumers when oil prices fell too steeply and became unpredictable.\nReporting by Dmitry Zhdannikov, Editing by David Evans and Alison Williams\n ", "external_links": [], "published": "2018-01-24T21:58:00.000+02:00", "crawled": "2018-01-24T22:22:33.000+02:00", "highlightTitle": ""}