{"organizations": [], "uuid": "31f530ea2619b88144c5e875d5d25f7d6ba5df6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-china-sweden-bookseller/china-says-it-has-no-information-on-seized-swedish-citizen-idUSKBN1FC10I", "country": "US", "domain_rank": 408, "title": "China says it has no information on seized Swedish citizen", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T11:49:00.000+02:00", "replies_count": 0, "uuid": "31f530ea2619b88144c5e875d5d25f7d6ba5df6b"}, "author": "", "url": "https://www.reuters.com/article/us-china-sweden-bookseller/china-says-it-has-no-information-on-seized-swedish-citizen-idUSKBN1FC10I", "ord_in_thread": 0, "title": "China says it has no information on seized Swedish citizen", "locations": [], "entities": {"persons": [{"name": "hua chunying", "sentiment": "none"}, {"name": "hua", "sentiment": "none"}, {"name": "angela gui", "sentiment": "none"}, {"name": "gui", "sentiment": "none"}, {"name": "gui minhai", "sentiment": "none"}, {"name": "margot wallstrom", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "hong kong-based", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "foreign ministry", "sentiment": "none"}, {"name": "radio sweden", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING/STOCKHOLM (Reuters) - Sweden said on Tuesday it had demanded the immediate release of Swedish citizen and Hong Kong-based bookseller Gui Minhai after he was detained for a second time by Chinese authorities.\nThe Swedish government confirmed media reports that Gui, who has published books on the personal lives of Communist Party leaders, was taken into custody on Saturday while travelling with Swedish diplomats to seek medical treatment in Beijing.\n“We expect the immediate release of our citizen and that he will be able to meet with diplomatic and medical staff,” Sweden’s Foreign Ministry said in a statement.\n“Chinese authorities have repeatedly assured us that Gui Minhai is a free man since being released after having served a sentence for a traffic-related crime, and that we can have any contact we wish with our citizen.”\nChina’s Foreign Ministry said on Tuesday it had no specific information on Gui Minhai, who according to his daughter Angela was taken off a train by plainclothes police while en route to the capital to get medical attention for a neurological ailment.\nShe said she was concerned for the safety of her father, whose whereabouts remain unclear.\nSweden also said it had summoned China’s ambassador to Stockholm for an explanation on both Saturday and Monday.\nChinese Foreign Ministry spokeswoman Hua Chunying said Sweden and China enjoy good communication and “if there are any problems ..., (we) can conduct timely and effective dialogue, this is no problem at all”.\nChina’s Ministry of Public Security did not respond to a faxed request for comment. It was not possible to reach the Ministry of State Security, which has no website and does not have a publicly available telephone number.\nIt was “incredible” to think a person could be taken away by Chinese police without reason, said the Global Times, a tabloid published by the People’s Daily, the official newspaper of the ruling Communist Party.\nGui Minhai was abducted in Thailand while on holiday in 2015, one of five Hong Kong booksellers who went missing that year and later appeared in mainland Chinese custody. The four others have returned to Hong Kong.\nChinese authorities said Gui was freed in October last year after serving a two-year sentence for a traffic offence in 2003.\nReporting by Philip Wen, Christian Shepherd, Johan Ahlander and Johan Sennero; Writing by Ben Blanchard; Editing by Mark Heinrich\n ", "external_links": [], "published": "2018-01-23T11:49:00.000+02:00", "crawled": "2018-01-23T12:02:03.017+02:00", "highlightTitle": ""}