{"organizations": [], "uuid": "5ae21fba86c9232e7e72810add07a4742448da40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/Euro-GoogleNews", "section_title": "EURO - Google News", "url": "https://www.reuters.com/article/us-eurozone-economy-inflation/euro-zone-inflation-drops-in-january-but-core-rate-rises-idUSKBN1FK17I", "country": "US", "domain_rank": 408, "title": "Euro zone inflation dip underpins ECB caution - Reuters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T13:08:00.000+02:00", "replies_count": 0, "uuid": "5ae21fba86c9232e7e72810add07a4742448da40"}, "author": "", "url": "https://www.reuters.com/article/us-eurozone-economy-inflation/euro-zone-inflation-drops-in-january-but-core-rate-rises-idUSKBN1FK17I", "ord_in_thread": 0, "title": "Euro zone inflation dip underpins ECB caution - Reuters", "locations": [], "entities": {"persons": [{"name": "phil", "sentiment": "negative"}, {"name": "blenkinsop", "sentiment": "none"}, {"name": "balazs koranyi", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 10:20 AM / in 8 hours Euro zone inflation dip underpins ECB caution Philip Blenkinsop , Balazs Koranyi 3 Min Read \nBRUSSELS/FRANKFURT (Reuters) - Euro zone inflation slowed further in January, underpinning the European Central Bank’s caution in removing stimulus any further as even a surge in crude oil prices is keeping consumer price pressures muted. \nInflation in the 19 countries sharing the euro dipped to 1.3 percent this month from 1.4 percent in December, in line with expectations and reinforcing projections that any rise in the months ahead will be slow, at best. \nBut in a hopeful sign for the ECB, underlying inflation excluding food and energy, a key measure studied to gauge price pressures, actually accelerated to 1.2 percent from 1.1 percent, reversing part of a puzzling dip. \nThe ECB decided last week to keep policy unchanged and hold off on any discussion about winding down its massive stimulus program as inflation has yet to show any convincing upward trend. \nLaunched three years ago, the bank’s 2.55 trillion euro ($3.17 trillion) bond purchase program has depressed borrowing costs and kick started growth but underlying slack in the economy has proven to be bigger than earlier thought, holding back inflation. \nIndeed, even with employment at record highs, unemployment remained 8.7 percent in December, Eurostat said separately on Wednesday, indicating that plenty of slack is left in the labor market despite five years of unabated growth. \nThe ECB expects inflation to hover near current levels in the coming months and to rise toward its target of almost 2 percent only over several years. ($1 = 0.8039 euros) \nWith the bloc’s economy expanding quickly, the ECB has already reduced stimulus twice and investors expect asset buys to end by the end of the year. \nThe biggest obstacle to ending the buys may be the strong euro, which will curtail import prices and put downward pressure on inflation. \nThe currency EURO= has gained 7 percent over the past three months against the dollar and comments by U.S. officials about a preference for a weak greenback leaves the door open to further foreign exchange volatility. \nBut even if the bond purchases, known as quantitative easing, are ended the year, the ECB has promised protracted stimulus through low rates and an oversized balance sheet for years to come. \n“An ample degree of monetary stimulus remains necessary for underlying inflation pressures to continue to build up,” ECB board member Benoit Coeure said in Dublin on Wednesday. \n“We expect the ECB’s key interest rates to remain at their present levels for an extended period of time, and well past the horizon of our net asset purchases,” he added. \nCoeure added that markets also see only limited upside risks to future inflation. \nECB projections see full year inflation at 1.4 percent this year, rising gradually to 1.7 percent by 2020, still short of target. Reporting by Philip Blenkinsop; Editing by Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-31T13:08:00.000+02:00", "crawled": "2018-01-31T16:13:43.000+02:00", "highlightTitle": ""}