{"organizations": [], "uuid": "e3565d0e5d9f0a29cc4086f0472b395b18255439", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-first-bancorp-announces-earnings-for-the-quarter-and-year-ended-december-31-2017.html", "country": "US", "domain_rank": 767, "title": "First Bancorp. Announces Earnings for the Quarter and Year Ended December 31, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:00:00.000+02:00", "replies_count": 0, "uuid": "e3565d0e5d9f0a29cc4086f0472b395b18255439"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-first-bancorp-announces-earnings-for-the-quarter-and-year-ended-december-31-2017.html", "ord_in_thread": 0, "title": "First Bancorp. Announces Earnings for the Quarter and Year Ended December 31, 2017", "locations": [], "entities": {"persons": [{"name": "maria", "sentiment": "none"}, {"name": "irma", "sentiment": "none"}], "locations": [], "organizations": [{"name": "first bancorp", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2017 Fourth Quarter Highlights and Comparison with Third Quarter\nNet income of $24.2 million for the fourth quarter, or $0.11 per diluted share, compared to a net loss of $10.8 million, or $0.05 per diluted share, for the third quarter of 2017. Financial results for the fourth and third quarters of 2017 include charges to the provision for loan and lease losses of $4.8 million ($2.9 million after-tax) and $66.5 million ($40.7 million after-tax), respectively, related to the estimate of inherent losses resulting from the impact of Hurricanes Maria and Irma. On a non-GAAP basis, adjusted net income of $28.1 million (which excludes Special Items, which are discussed below and consist of storm-related charges and other items that management believes are not reflective of core operating performance, are not expected to reoccur with any regularity or may reoccur at uncertain times and in uncertain amounts), compared to adjusted net income of $27.4 million for the third quarter of 2017. Net interest income decreased by $0.6 million to $122.3 million, compared to $122.8 million for the third quarter of 2017, primarily due to a reduction in the average balance of commercial loans and a decrease in the average balance and yield of U.S. agency mortgage-backed securities (“MBS”). Net interest margin was 4.26% compared to 4.33% for the third quarter of 2017, primarily reflecting higher levels of liquidity during the fourth quarter of 2017. Provision for loan and lease losses decreased by $49.3 million to $25.7 million, compared to $75.0 million for the third quarter of 2017. A $4.8 million incremental provision expense related to the impact of the storms was recorded during the fourth quarter, primarily due to an increase in estimated losses associated with storm events for its commercial and construction loan portfolios. On a non-GAAP basis (excluding storm-related charges), adjusted provision for loan and lease losses of $20.9 million, compared to an adjusted provision of $8.5 million for the third quarter. Non-interest income decreased by $3.7 million to $15.0 million compared to $18.6 million for the third quarter of 2017, primarily due to the effect in the third quarter of a $1.4 million gain on the repurchase and cancellation of $7.3 million in trust preferred securities. In addition, revenues from mortgage banking activities decreased by $1.2 million and service charges on deposit accounts decreased by $0.9 million, both adversely affected by the drop in business activity due to the storms. Non-interest expenses decreased by $0.5 million to $85.1 million, compared to $85.6 million for the third quarter of 2017, primarily reflecting reductions in professional service fees and credit and debit card processing expenses. Non-interest expenses for the fourth quarter of 2017 include $1.9 million of storm-related expenses, including insurance deductibles related to damages assessed on certain other real estate owned (“OREO”) properties and estimated storm-related costs not recoverable under insurance policies, compared to $0.6 million for the third quarter of 2017. Income tax expense of $2.2 million, compared to income tax benefit of $8.4 million for the third quarter of 2017, a variance mainly related to the income tax benefit recorded in the third quarter associated with the aforementioned storm-related charges and a final year-end tax provision that resulted in a lower than previously estimated effective tax rate for the year. Credit quality variances: Non-performing assets increased in the quarter by $9.9 million, to $650.6 million as of December 31, 2017, primarily from the identification of storm-impacted commercial credits. Non-performing loan inflows amounted to $58.3 million, compared to inflows of $103.9 million in the third quarter of 2017. A net charge-off rate of 1.12%, compared to 0.80% for the third quarter of 2017, an increase driven by charge-offs totaling $8.3 million taken on two collateral-dependent commercial and construction loans in Puerto Rico. Total deposits, excluding brokered certificates of deposit (“CDs”) and government deposits, increased in the quarter by $377.0 million to $7.2 billion as of December 31, 2017, reflecting increases of $291.4 million and $91.9 million in Puerto Rico and the Virgin Island regions, respectively, partially offset by a decrease of $6.2 million in the Florida region. The most significant increase was in noninterest-bearing demand deposits, which grew 16%, or $247.5 million, in the fourth quarter, which in part reflects the effect of payment deferral programs and disaster relief funds. Brokered CDs decreased in the quarter by $104.8 million to $1.2 billion as of December 31, 2017. Government deposits decreased in the quarter by $15.5 million to $652.0 million as of December 31, 2017, primarily due to a reduction in balances of transactional accounts of certain municipalities in Puerto Rico. Total loans decreased in the quarter by $21.3 million to $8.9 billion as of December 31, 2017. The decrease reflects reductions of $53.6 million and $24.0 million in the Puerto Rico and the Virgin Island regions, respectively, primarily in commercial and industrial loans, partially offset by a $56.2 million growth in the Florida region. Total loan originations, including refinancings, renewals and draws from existing commitments (excluding credit card utilization activity), of $546.0 million for the fourth quarter of 2017, compared to $589.7 million for the third quarter of 2017. The decrease was reflected in all major loan categories, including decreases of $23.4 million, $19.3 million, and $1.1 million in consumer, residential mortgage, and commercial and construction loan originations, respectively, adversely affected, among other things, by the initial drop in business activity after the storms. As of December 31, 2017, the Corporation had $214.5 million of direct exposure to loans and obligations of the Commonwealth of Puerto Rico government and instrumentalities, of which $184.6 million, or 86%, represented exposure to municipalities, which is supported by assigned property tax revenues, compared to total exposure of $214.8 million as of September 30, 2017, of which $184.6 million, or 86%, represented exposure to municipalities. Total capital, common equity Tier 1 capital, Tier 1 capital, and leverage ratios calculated under the transition provisions of the Basel III rules of 22.53%, 18.96%, 18.97%, and 14.03%, respectively, as of December 31, 2017. Tangible common equity ratio of 14.65% as of December 31, 2017.\nSAN JUAN, Puerto Rico--(BUSINESS WIRE)-- First BanCorp. (the “Corporation”) (NYSE: FBP), the bank holding company for FirstBank Puerto Rico (“FirstBank” or “the Bank”), today reported net income of $24.2 million for the fourth quarter of 2017, or $0.11 per diluted share, compared to a net loss of $10.8 million, or $0.05 per diluted share, for the third quarter of 2017 and net income of $23.9 million, or $0.11 per diluted share, for the fourth quarter of 2016.\nFor the year ended December 31, 2017, the Corporation reported net income of $67.0 million, or $0.30 per diluted share, compared to $93.2 million, or $0.43 per diluted share, for the year ended December 31, 2016.\nAurelio Alemán, President and Chief Executive Officer of First BanCorp., commented: “We are quite pleased with our results for the fourth quarter and fiscal year end 2017. Notwithstanding the uncertain macroeconomic backdrop in Puerto Rico, which was further affected by Hurricanes Irma and Maria in September, our institution continues to improve performance metrics and demonstrate the strength of its earnings capabilities. We generated net income for the fourth quarter of $24.2 million, or $0.11 per diluted share, and $67.0 million, or $0.30 per diluted share for the year. Fiscal year results were affected by the hurricanes, including the $66.5 million storm-related provision in the third quarter and $4.8 million in the fourth quarter as well as impact to overall business volumes. Adjusted pre-tax pre-provision income reached $218 million for 2017, a $10 million increase over 2016.\nDespite the continued impact of the hurricanes, our fourth quarter and fiscal year 2017 results demonstrate the strength of our franchise. Loan origination volumes in Puerto Rico and the Virgin Islands have been affected by the hurricanes while our steady growth in Florida continues to support our balance sheet. For the year prior to the hurricanes impact, we were averaging over $920 million in origination and renewal volume per quarter compared to an average $640 million over the past two quarters, we expect this to increase in the later part of 2018. During the fourth quarter, deposits net of government and brokered increased by $377 million; $247 million of this increase was noninterest-bearing deposits, mostly in Puerto Rico. Our nonperforming assets increased by $9.9 million related to storm-impacted commercial credits. Since December 31, 2016, we have reduced nonperforming assets by $83.9 million. We will have a better sense of the impact of the storms on our borrowers following the moratorium in the first quarter. While we continue monitoring the impact of the storms on our economy and our customers, we remain confident that our participation in the rebuilding efforts in Puerto Rico will drive better results in 2018.\nOn the capital front, during the course of 2017 we repurchased $7.3 million of our trust preferred securities; we successfully completed three secondary offerings, through which our private equity owners reduced their positions to below 5% each and the U.S. Treasury exited its position; we continue paying dividends on our preferred stock; and the Federal Reserve lifted the Written Agreement. We continue growing our capital base and at year end our tangible book value per common share grew to $8.28.\nOur leadership team is committed to continuing to enhance shareholder value as we rebuild and navigate the Puerto Rico and Virgin Islands economic turnaround and continue to grow our Florida franchise.”\nIMPACT ON FINANCIAL RESULTS RELATED TO HURRICANES IRMA AND MARIA\nDuring the fourth quarter of 2017, the Corporation continued to deal with the impact of hurricanes Irma and Maria that hit the Eastern Caribbean region and Puerto Rico in September and caused widespread property damage, flooding, power outages, and water and communication service interruptions, and severely disrupted normal economic activity in these regions. The Corporation continued normalizing its operations after the impact of the storms and have now returned close to their pre-storm levels.\nA summary of the more significant financial repercussions of these natural disasters on the Corporation is as follows:\nAs of the end of the third quarter of 2017, the Corporation established a $66.5 million provision for loan losses directly related to the initial estimate, based on available information, of inherent losses resulting from the impact of the storms. During the fourth quarter of 2017, loan officers performed reviews of the storms’ impact on large commercial borrowers, and the results of these reviews were factored into the determination of the allowance for loan and lease losses as of December 31, 2017. The Corporation recorded a provision expense of $4.8 million during the fourth quarter related to the impact of the storms, primarily related to an increase in estimated losses associated with storm events for its commercial and construction loan portfolios. The individual assessment of the storm impact on commercial customers also resulted in downgrades in the credit risk classification of certain loans. Adversely classified commercial and construction loans increased during the fourth quarter by $106.7 million to $474.2 million as of December 31, 2017. The storm-related allowance increased from $66.5 million as of September 30, 2017 to $68.4 million as of December 31, 2017 (net of a $2.9 million charge-off taken on a storm-impacted credit during the fourth quarter). As the Corporation acquires additional information on overall economic prospects in the storm-affected areas and the performance of consumer credits that had been under payment deferral programs and obtains further assessments of individual borrowers, the loss estimate will be revised as needed.\nThere was a $16.4 million increase in total non-performing loans during the fourth quarter of 2017, primarily related to storm-impacted commercial and construction credits. Refer to the Credit Quality – Non-performing Assets discussion below for additional information about early delinquency statistics and payment deferral programs established by the Corporation to assist individuals and businesses affected by the recent storms.\nThe Corporation implemented its disaster response plan as these storms approached its service areas. To operate in disaster response mode, the Corporation incurred expenses for, among other things, buying diesel and generators for electric power, debris removal, security matters, and emergency communication with customers regarding the status of Bank operations. The disaster response plan costs combined with the payroll and rental costs during the idle time caused by the storms totaled $6.6 million as of December 31, 2017. Also, certain of the Corporation's facilities and their contents were damaged by the storms. The Corporation has recognized asset impairments of approximately $0.6 million as of December 31, 2017.\nThe Corporation maintains insurance for casualty losses as well as for disaster response costs and certain revenue lost through business interruption. Management believes that recovery of $4.8 million of the $7.2 million above mentioned costs and asset impairments identified as of December 31, 2017 is probable. Accordingly, a receivable of $4.8 million was included in other assets as of December 31, 2017 for the expected recovery. Non-interest expenses for the fourth and third quarters of 2017 reflects approximately $1.9 million and $0.6 million, respectively, of insurance deductibles related to damages assessed on certain OREO properties and estimated storm-related costs not recoverable under insurance policies, partially offset by expected insurance recoveries recognized in the fourth and third quarters of 2017 of $0.2 million and $1.7 million, respectively, for compensation and rental costs that the Corporation incurred when Hurricanes Irma and Maria precluded employees from working during 2017.\nEARNINGS HIGHLIGHTS\nThe financial results for the fourth and third quarters of 2017 and the fourth quarter of 2016 included the following items that management believes are not reflective of core operating performance, are not expected to reoccur with any regularity or may reoccur at uncertain times and in uncertain amounts (the “Special Items”):\nQuarter ended December 31, 2017\nA $6.8 million ($4.1 million after-tax) impact related to Hurricanes Irma and Maria, which includes the following items: a $4.8 million charge to increase the storm-related allowance for loan losses and approximately $1.9 million of non-interest expenses associated with insurance deductibles related to damages assessed on certain OREO properties and estimated storm-related costs not recoverable under insurance policies. The $6.8 million impact was partially offset in the consolidated financial results by expected insurance recoveries of $0.2 million for rental costs that the Corporation incurred when Hurricanes Irma and Maria precluded the utilization of certain facilities during the fourth quarter.\nQuarter ended September 30, 2017\nA $67.1 million ($41.0 million after-tax) impact related to Hurricanes Irma and Maria, which includes the following items: a $66.5 million charge to establish a storm-related provision for loan losses and approximately $0.6 million of non-interest expenses associated with storm relief efforts and assistance to employees. The $67.1 million impact was partially offset in the consolidated financial results by expected insurance recoveries of $1.7 million for compensation and rental costs that the Corporation incurred when Hurricanes Irma and Maria precluded employees from working during September. A $1.4 million gain on the repurchase and cancellation of $7.3 million in trust preferred securities reflected in the statement of operations set forth below as “Gain on early extinguishment of debt.” The Corporation repurchased and cancelled the repurchased trust preferred securities, resulting in a commensurate reduction in the related Floating Rate Junior Subordinated Debenture. The Corporation’s purchase price equated to 81% of the $7.3 million par value. The 19% discount, plus accrued interest, resulted in the gain of $1.4 million. The gain, realized at the holding company level, has no effect on the income tax expense in 2017. Costs of $0.1 million associated with a secondary offering of the Corporation’s common stock by certain of our existing stockholders completed in the third quarter of 2017. The costs, incurred at the holding company level, had no effect on the income tax expense in 2017.\nQuarter ended December 31, 2016\nCharge to the provision for loan and lease losses of $1.8 million ($1.1 million after-tax) related to the sale of a $16.3 million pool of non-performing assets, mostly comprised of non-performing commercial loans. Gain of $1.5 million ($1.2 million after-tax) from recovery of a residual CMO previously written off once the trust was liquidated in the fourth quarter of 2016. Brokerage and insurance commissions of $1.7 million ($1.0 million after-tax) net of incentive costs, primarily from the sale of large fixed annuities contracts. Adjustment of $2.7 million ($1.7 million after-tax) recorded to reduce the credit card rewards program liability due to the expiration of reward points earned by customers up to September 2013 (the conversion date of the credit card portfolio acquired from FIA in May 2012). Costs of $0.6 million associated with a secondary offering of the Corporation’s common stock by certain of the existing stockholders. The costs, incurred at the holding company level, had no effect on the income tax expense in 2016.\nThe following table reconciles for the fourth and third quarters of 2017 and the fourth quarter of 2016 the reported net income (loss) to adjusted net income, a non-GAAP financial measure that excludes the Special Items identified above:\nQuarter Ended Quarter Ended Quarter Ended (In thousands) December 31, 2017 September 30, 2017 December 31, 2016 Net income (loss), as reported (GAAP) $ 24,169 $ (10,752 ) $ 23,858 Adjustments: Storm-related provision for loan and lease losses 4,814 66,490 - Storm-related expenses 1,945 599 - Idle time payroll and rental costs insurance recovery (157 ) (1,662 ) - Charge to the provision related to sale of the $16.3 million pool of non-performing assets - - 1,799 Gain from recovery of investments previously written off - - (1,547 ) Gain on repurchase and cancellation of trust preferred securities - (1,391 ) - Brokerage and insurance commissions, primarily from sale of large - fixed annuities contracts, net of incentive costs - - (1,692 ) Adjustment to reduce the credit card rewards liability due to - unusually large customer forfeitures - - (2,732 ) Secondary offering costs - 118 590 Income tax impact of adjustments (1) (2,636 ) (26,048 ) 1,333 Adjusted net income (Non-GAAP) $ 28,135 $ 27,354 $ 21,609 (1) See Basis of Presentation for the individual tax impact for each reconciling item. This press release includes certain non-GAAP financial measures, including adjusted net income, adjusted provision for loan and lease losses, adjusted non-interest income, adjusted non-interest expenses, adjusted pre-tax, pre-provision income, adjusted net interest income and margin, certain capital ratios, and certain other financial measures that exclude the effect of items that management identifies as Special Items because they are not reflective of core operating performance, are not expected to reoccur with any regularity or may reoccur at uncertain times and in uncertain amounts, and should be read in conjunction with the discussion below in “Basis of Presentation – Use of Non-GAAP Financial Measures” and the accompanying tables (Exhibit A), which are an integral part of this press release.\nINCOME (LOSS) BEFORE INCOME TAXES AND RECONCILIATION TO ADJUSTED PRE-TAX, PRE-PROVISION INCOME (NON-GAAP)\nIncome before income taxes for the fourth quarter of 2017 amounted to $26.4 million, compared to a loss before income taxes of $19.2 million for the third quarter of 2017. The following table reconciles income (loss) before income taxes to adjusted pre-tax, pre-provision income for the last five quarters. Adjusted pre-tax, pre-provision income for the fourth quarter of 2017 amounted to $53.9 million, up $0.3 million from the third quarter of 2017:\n(Dollars in thousands) Quarter Ended December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 Income (loss) before income taxes (GAAP) $ 26,377 $ (19,150 ) $ 37,288 $ 17,468 $ 37,198 Add: Provision for loan and lease losses 25,703 75,013 18,096 25,442 23,191 (Less)/Add: Net (gain) loss on investments and impairments - - (371 ) 12,231 - Less: Gain on early extinguishment of debt - (1,391 ) - - - Less: Storm-related idle time payroll and rental costs insurance recovery (157 ) (1,662 ) - - - Add: Storm-related expenses not recoverable under insurance policies 1,009 599 - - - Add: Storm-related insurance deductibles related to damages assessed on OREO properties 936 - - - - Add/(Less): Unrealized loss (gain) on derivative instruments - - - 1 (1 ) Less: Brokerage and insurance commissions, primarily from sales of large fixed annuities contracts, net of incentive costs - - - - (1,692 ) Less: Gain from recovery of investments previously written off - - - - (1,547 ) Less: Adjustment to reduce the credit card rewards liability due to unusually large customer forfeitures - - - - (2,732 ) Add: Secondary offering costs - 118 - 274 590 Adjusted pre-tax, pre-provision income (Non-GAAP) (1) $ 53,868 $ 53,527 $ 55,013 $ 55,416 $ 55,007 Change from most recent prior quarter (amount) $ 341 $ (1,486 ) $ (403 ) $ 409 $ 4,806 Change from most recent prior quarter (percentage) 0.6 % -2.7 % -0.7 % 0.7 % 9.6 % (1) See Basis of Presentation for additional information. Adjusted pre-tax, pre-provision income is a non-GAAP financial measure that management believes is useful to investors in analyzing the Corporation’s performance and trends. This metric is income (loss) before income taxes adjusted to exclude the provision for loan and lease losses, gains or losses on sales of investment securities and impairments, and fair value adjustments on derivatives. In addition, from time to time, earnings are adjusted also for Special Items because management believes these items are not reflective of core operating performance, are not expected to reoccur with any regularity or may reoccur at uncertain times and in uncertain amounts (for additional information about this non-GAAP financial measure, see Basis of Presentation - Adjusted Pre-Tax, Pre-Provision Income).\nNET INTEREST INCOME\nNet interest income, excluding fair value adjustments on derivatives (“valuations”), and net interest income on a tax-equivalent basis are non-GAAP financial measures. See Basis of Presentation – Net Interest Income, Excluding Valuations, and on a Tax-Equivalent Basis below for additional information. The following table reconciles net interest income in accordance with GAAP to net interest income excluding valuations, and net interest income on a tax-equivalent basis for the last five quarters. The table also reconciles net interest spread and net interest margin on a GAAP basis to these items excluding valuations, and on a tax-equivalent basis.\n(Dollars in thousands) Quarter Ended December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Net Interest Income Interest income - GAAP $ 147,826 $ 147,995 $ 147,374 $ 145,228 $ 143,954 Unrealized loss (gain) on derivative instruments - - - 1 (1 ) Interest income excluding valuations 147,826 147,995 147,374 145,229 143,953 Tax-equivalent adjustment 2,850 3,147 4,128 3,610 2,492 Interest income on a tax-equivalent basis excluding valuations $ 150,676 $ 151,142 $ 151,502 $ 148,839 $ 146,445 Interest expense - GAAP 25,560 25,163 23,470 22,679 22,890 Net interest income - GAAP $ 122,266 $ 122,832 $ 123,904 $ 122,549 $ 121,064 Net interest income excluding valuations - Non-GAAP $ 122,266 $ 122,832 $ 123,904 $ 122,550 $ 121,063 Net interest income on a tax-equivalent basis and excluding valuations - Non-GAAP $ 125,116 $ 125,979 $ 128,032 $ 126,160 $ 123,555 Average Balances Loans and leases $ 8,806,036 $ 8,855,406 $ 8,863,529 $ 8,862,271 $ 8,860,094 Total securities, other short-term investments and interest-bearing cash balances 2,593,716 2,395,298 2,336,986 2,375,060 2,346,243 Average interest-earning assets $ 11,399,752 $ 11,250,704 $ 11,200,515 $ 11,237,331 $ 11,206,337 Average interest-bearing liabilities $ 8,411,399 $ 8,404,242 $ 8,327,615 $ 8,456,848 $ 8,465,415 Average Yield/Rate Average yield on interest-earning assets - GAAP 5.14 % 5.22 % 5.28 % 5.24 % 5.11 % Average rate on interest-bearing liabilities - GAAP 1.21 % 1.19 % 1.13 % 1.09 % 1.08 % Net interest spread - GAAP 3.93 % 4.03 % 4.15 % 4.15 % 4.03 % Net interest margin - GAAP 4.26 % 4.33 % 4.44 % 4.42 % 4.30 % Average yield on interest-earning assets excluding valuations - Non-GAAP 5.14 % 5.22 % 5.28 % 5.24 % 5.11 % Average rate on interest-bearing liabilities excluding valuations - Non-GAAP 1.21 % 1.19 % 1.13 % 1.09 % 1.08 % Net interest spread excluding valuations - Non-GAAP 3.93 % 4.03 % 4.15 % 4.15 % 4.03 % Net interest margin excluding valuations - Non-GAAP 4.26 % 4.33 % 4.44 % 4.42 % 4.30 % Average yield on interest-earning assets on a tax-equivalent basis and excluding valuations - Non-GAAP 5.24 % 5.33 % 5.43 % 5.37 % 5.20 % Average rate on interest-bearing liabilities excluding valuations - Non-GAAP 1.21 % 1.19 % 1.13 % 1.09 % 1.08 % Net interest spread on a tax-equivalent basis and excluding valuations - Non-GAAP 4.03 % 4.14 % 4.30 % 4.28 % 4.12 % Net interest margin on a tax-equivalent basis and excluding valuations - Non-GAAP 4.35 % 4.44 % 4.58 % 4.55 % 4.39 % Net interest income for the fourth quarter of 2017 amounted to $122.3 million, a decrease of $0.6 million when compared to net interest income of $122.8 million for the third quarter of 2017. The decrease in net interest income was mainly due to:\nA $0.8 million decrease in interest income on commercial and construction loans primarily related to a $37.9 million decrease in the total average balance of these portfolios and higher interest income reversals on loans placed on nonaccrual status during the fourth quarter, partially offset by the upward repricing of variable rate commercial loans. A $0.5 million decrease in interest income on U.S. agency MBS associated with both a $38.6 million decrease in the average balance and a $0.2 million increase in the premium amortization expense resulting from higher prepayment rates used to forecast future cash flows. A $0.4 million increase in interest expense primarily related to the effect of higher market interest rates on the cost of new brokered CDs. A $0.2 million decrease in interest income on consumer loans primarily related to a decrease in late payment fees on credit cards. The Corporation did not assess late charges during the fourth quarter to credit card customers that qualified for the automatic three-month deferred repayment arrangements provided across-the-board to credit card customers that were current in their payments as of the date of Hurricanes Irma and Maria.\nPartially offset by:\nA $0.8 million increase in interest income from deposits maintained at the Federal Reserve Bank primarily due to a $230.3 million increase in the average balance and, to a lesser extent, the effect of the increase in the Federal Funds target rate in mid-December 2017. A $0.3 million increase in interest income on residential mortgage loans primarily related to lower inflows of loans to non-performing status, as compared to the third quarter. A $0.1 million increase in dividend income from investments in FHLB stock.\nNet interest margin was 4.26%, down 7 basis points from the third quarter of 2017. The decrease in the net interest margin was mainly related to higher levels of liquidity aligned with the increase in the average balance of the non-interest bearing deposit base, resulting in a margin compression of approximately 6 basis points.\nPROVISION FOR LOAN AND LEASE LOSSES\nThe provision for loan and lease losses for the fourth quarter of 2017 was $25.7 million, compared to $75.0 million for the third quarter of 2017. As mentioned above, the provision for the fourth and third quarters of 2017 included charges of $4.8 million and $66.5 million, respectively, directly related to the estimate of inherent losses resulting from the impact of Hurricanes Irma and Maria.\nAs noted above, reviews of the storms’ impact on large commercial and construction borrowers were performed during the fourth quarter of 2017, and the results were factored into the determination of the allowance as of December 31, 2017. There was a provision expense of $4.8 million recorded during the fourth quarter related to the impact of the storms, primarily related to an increase in estimated losses associated with storm events for its commercial and construction loan portfolios. The individual assessment of the storm impact on commercial customers also resulted in downgrades in the credit risk classification of certain loans. As the Corporation acquires additional information on overall economic prospects in the storm-affected areas and the performance of consumer credits that had been under payment deferral programs and obtains further assessments of individual borrowers, the loss estimate will be revised as needed.\nOn a non-GAAP basis (excluding the storm-related charges), the adjusted provision for loan and lease losses for the fourth quarter of $20.9 million increased $12.4 million, compared to the adjusted provision of $8.5 million for the third quarter of 2017. The $12.4 million increase in the adjusted provision for loan and lease losses was driven by the following variances:\nA $7.0 million adjusted provision for commercial and construction loans recorded in the fourth quarter, compared to an adjusted net loan loss reserve release of $10.1 million in the third quarter. The provision recorded in the fourth quarter was primarily related to charge-offs taken on collateral- dependent impaired loans. The adjusted net reserve release in the third quarter was primarily related to lower specific reserve requirements for two commercial loans classified as impaired in the third quarter as well as improvements in historical loss rates used for the general reserve calculation.\nPartially offset by:\nA $3.2 million decrease in the adjusted provision for residential mortgage loans, primarily related to lower charges to reserves for troubled debt restructurings (“TDRs”) in the fourth quarter. A $1.5 million decrease in the adjusted provision for consumer loans, mainly related to lower levels of personal and small loans delinquency. The automatic three-month deferred repayment arrangements provided across-the-board to all consumer borrowers current in their payments, or no more than two payments in arrears as of the date of the respective hurricane, prevented loans to increase their level of delinquency during the fourth quarter.\nSee Credit Quality and Basis of Presentation below for additional information regarding the allowance for loan and lease losses, including variances in net charge-offs, and the reconciliation of the provision for loan and lease losses in accordance with GAAP to the adjusted provision for loan and lease losses that excludes the storm-related provision for loan and lease losses.\nNON-INTEREST INCOME\nQuarter Ended December 31, September 30, June 30, March 31, December 31, (In thousands) 2017 2017 2017 2017 2016 Service charges on deposit accounts $ 4,924 $ 5,797 $ 5,803 $ 5,790 $ 5,759 Mortgage banking activities 1,912 3,117 4,846 3,616 5,304 Net gain (loss) on investments and impairments - - 371 (12,231 ) 1,547 Gain on early extinguishment of debt - 1,391 - - - Other operating income 8,114 8,340 9,529 11,068 10,951 Non-interest income $ 14,950 $ 18,645 $ 20,549 $ 8,243 $ 23,561 Non-interest income for the fourth quarter of 2017 amounted to $15.0 million, compared to $18.6 million for the third quarter of 2017. Non-interest income for the third quarter of 2017 includes the $1.4 million gain on the repurchase and cancellation of $7.3 million of trust preferred securities.\nThe GAAP non-interest income of $15.0 million for the fourth quarter of 2017 decreased $2.3 million, compared to the adjusted non-interest income of $17.3 million for the third quarter of 2017. The adjusted non-interest income for the third quarter of 2017 is a non-GAAP number that excludes the aforementioned $1.4 million gain on the repurchase and cancellation of trust preferred securities. The $2.3 million decrease was primarily due to:\nA $1.2 million decrease in revenues from mortgage banking activities driven by lower conforming loan origination and sale volumes reflecting the drop in business activity due to the storms. Total loans sold in the secondary market to U.S. government-sponsored entities amounted to $52.8 million with a related net gain of $1.4 million, net of To-Be-Announced MBS (“TBAs”) hedges losses of $54 thousand, in the fourth quarter of 2017, compared to $85.1 million with a related net gain of $2.4 million, net of TBAs hedges losses of $0.3 million, in the third quarter of 2017. A $0.9 million decrease in service charges on deposits primarily related to a decline in the number of returned items, overdraft and cash management transactions adversely affected by business activity disruptions caused by Hurricanes Irma and Maria. A $0.3 million decrease in merchant-related income, included as part of “Other operating income” in the above table. Transaction fee income from POS and credit and debit cards, included as part of “Other operating income” in the above table, decreased by $0.4 million. However, this was offset by a $0.4 million increase in ATMs fee income.\nNON-INTEREST EXPENSES\nQuarter Ended December 31, September 30, June 30, March 31, December 31, (In thousands) 2017 2017 2017 2017 2016 Employees' compensation and benefits $ 37,655 $ 37,128 $ 38,409 $ 38,653 $ 37,652 Occupancy and equipment 15,067 13,745 13,759 14,088 14,045 Deposit insurance premium 3,054 3,179 3,721 3,771 3,920 Other insurance and supervisory fees 1,363 1,174 1,134 1,138 987 Taxes, other than income taxes 3,366 3,763 3,745 3,676 3,664 Professional fees: Collections, appraisals and other credit related fees 2,341 2,295 2,452 2,072 2,344 Outsourcing technology services 5,088 5,403 5,398 5,354 5,435 Other professional fees 3,721 4,325 3,950 3,530 3,583 Credit and debit card processing expenses 3,078 3,737 3,566 2,831 3,533 Business promotion 2,768 3,244 3,192 3,281 199 Communications 1,374 1,603 1,628 1,543 1,515 Net loss on OREO operations 2,201 1,351 3,369 4,076 2,399 Other 4,060 4,667 4,746 3,869 4,960 Total $ 85,136 $ 85,614 $ 89,069 $ 87,882 $ 84,236 Non-interest expenses in the fourth quarter of 2017 amounted to $85.1 million, a decrease of $0.5 million from $85.6 million in the third quarter of 2017. Non-interest expenses for the fourth quarter of 2017 include insurance deductibles related to damages assessed on certain OREO properties damaged by Hurricane Maria and estimated storm-related costs not recoverable under insurance policies totaling $1.9 million, of which $0.9 million, $0.6 million, and $0.4 million is included as part of “Net loss on OREO operations,” “Occupancy and equipment,” and “Business promotion,” respectively, in the above table. Furthermore, expected insurance recoveries of $0.2 million related to rental costs that the Corporation incurred when Hurricanes Irma and Maria precluded the use of certain facilities during the fourth quarter of 2017 were recognized as an offset to “Occupancy and equipment” expenses in the above table.\nFor the third quarter of 2017, non-interest expenses include costs of $0.6 million associated with storm relief efforts and assistance to employees, included as part of “Business promotion” in the above table, and $0.1 million of professional service fees incurred in connection with a secondary offering of the Corporation’s common stock by certain of our existing stockholders. Furthermore, expected insurance recoveries of $1.7 million for employees’ compensation and rental costs that the Corporation incurred when Hurricanes Irma and Maria precluded employees from working during September were recognized as an offset to non-interest expenses ($1.4 million as an offset to “Employees’ compensation and benefits” expenses and $0.3 million as an offset to “Occupancy and equipment” expenses in the above table).\nOn a non-GAAP basis, excluding the effect of the aforementioned items, adjusted non-interest expenses of $83.3 million for the fourth quarter of 2017 decreased $3.2 million, compared to adjusted non-interest expenses of $86.6 million for the third quarter of 2017. The $3.2 million decrease in adjusted non-interest expenses was primarily due to:\nA $0.9 million decrease in adjusted employees’ compensation and benefits expenses, primarily related to lower bonus and incentive-compensation accruals as well as a decrease in full-time equivalent headcount during the fourth quarter. A $0.8 million decrease in adjusted total professional service fees, including a decrease of $0.3 million in outsourcing technology services, a $0.3 million decrease in labor-related legal fees, and a $0.2 million decrease in consulting fees mainly associated with taxes and regulatory matters and the effect in the third quarter of certain implementation costs for new information technology systems. A $0.7 million decrease in credit and debit card processing expenses primarily associated with a lower volume of transactions affected by the drop in business activity after the storms. A $0.5 million decrease in the provision for unfunded loan commitments, included as part of “Other” in the above table, primarily related to a decrease in the unused available balance of certain lines of credit. A $0.4 million decrease in “Taxes, other than income taxes” in the above table primarily related to a decrease in the sales and use tax expense recorded in the fourth quarter. A $0.3 million decrease in adjusted business promotion expenses primarily related to a $0.7 million decline in credit card rewards program costs, partially offset by a $0.4 million increase related to the timing of advertising and sponsorship activities. A $0.2 million decrease in costs of communication-related matters such as telephone and postage expenses.\nPartially offset by:\nA $0.6 million increase in adjusted occupancy and equipment costs, primarily related to lease-termination costs in connection with the closing of a Bank branch in Puerto Rico.\nINCOME TAXES\nThe Corporation recorded an income tax expense of $2.2 million for the fourth quarter of 2017 compared to an income tax benefit of $8.4 million for the third quarter of 2017. The $10.6 million variance was mainly driven by the tax benefit associated with the storm-related provision recorded in the third quarter and final year-end tax accounting that resulted in a lower than previously estimated effective tax rate for the year. The decrease in effective tax rate, when compared to the third quarter of 2017 estimate, was mainly driven by changes in the deferred tax asset valuation allowance for the current year due to the realization of higher than expected deductible carryforwards that were partially reserved. The effective tax rate, excluding entities with pre-tax losses from which a tax benefit cannot be recognized and the tax benefit associated with the change in the tax status of certain subsidiaries, decreased to 15% compared to the estimated effective tax rate of 20% as of the end of the third quarter. As of December 31, 2017, the Corporation had a net deferred tax asset of $294.8 million (net of a valuation allowance of $191.2 million, including a valuation allowance of $150.7 million against the deferred tax assets of the Corporation’s banking subsidiary, FirstBank).\nCREDIT QUALITY\nNon-Performing Assets\n(Dollars in thousands) December 31,\nSeptember 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 Non-performing loans held for investment: Residential mortgage $ 178,291 $ 178,530 $ 155,330 $ 154,893 $ 160,867 Commercial mortgage 156,493 137,059 122,035 174,908 178,696 Commercial and Industrial 85,839 84,317 65,575 77,972 146,599 Construction 52,113 46,720 47,391 48,468 49,852 Consumer and Finance leases 16,818 26,506 21,082 21,325 24,080 Total non-performing loans held for investment 489,554 473,132 411,413 477,566 560,094 OREO 147,940 152,977 150,045 137,784 137,681 Other repossessed property 4,802 6,320 5,588 6,235 7,300 Other assets (1) - - - 17,531 21,362 Total non-performing assets, excluding loans held for sale $ 642,296 $ 632,429 $ 567,046 $ 639,116 $ 726,437 Non-performing loans held for sale 8,290 8,290 8,079 8,079 8,079 Total non-performing assets, including loans held for sale (2) $ 650,586 $ 640,719 $ 575,125 $ 647,195 $ 734,516 Past-due loans 90 days and still accruing (3) $ 160,725 $ 140,656 $ 131,246 $ 143,089 $ 135,808 Non-performing loans held for investment to total loans held for investment 5.53 % 5.33 % 4.64 % 5.41 % 6.30 % Non-performing loans to total loans 5.60 % 5.41 % 4.71 % 5.48 % 6.36 % Non-performing assets, excluding non-performing loans held for sale, to total assets, excluding non-performing loans held for sale 5.24 % 5.20 % 4.76 % 5.38 % 6.10 % Non-performing assets to total assets 5.31 % 5.26 % 4.83 % 5.44 % 6.16 % (1) Fair market value of bonds of the Government Development Bank for Puerto Rico (\"GDB\") and the Puerto Rico Public Buildings Authority prior to the sale completed during the second quarter of 2017.\n(2) Purchased credit impaired (\"PCI\") loans of $158.2 million accounted for under ASC 310-30 as of December 31, 2017, primarily mortgage loans acquired from Doral Bank in the first quarter of 2015 and from Doral Financial in the second quarter of 2014, are excluded and not considered non-performing due to the application of the accretion method, under which these loans will accrete interest income over the remaining life of the loans using estimated cash flow analysis.\n(3) Amount includes PCI loans with individual delinquencies over 90 days and still accruing with a carrying value as of December 31, 2017 of approximately $29.3 million, primarily related to the loans acquired from Doral Bank in the first quarter of 2015 and from Doral Financial in the second quarter of 2014.\nVariances in credit quality metrics:\nTotal non-performing assets increased by $9.9 million to $650.6 million as of December 31, 2017, compared to $640.7 million as of September 30, 2017. Total non-performing loans, including non-performing loans held for sale, increased by $16.4 million from $481.4 million as of the end of the third quarter of 2017 to $497.8 million as of December 31, 2017. The increase in non-performing assets was primarily attributable to the inflow of storm-impacted commercial and construction credits in Puerto Rico and the Virgin Islands. Non-performing commercial and construction loans increased by $26.3 million, including the inflow of seven relationships with individual balances in excess of $1 million totaling $25.5 million. The increase in non-performing commercial and construction loans was partially offset by a $9.7 million decrease in non-performing consumer loans driven by charge-offs, auto repossessions, and the decline in inflows associated with the automatic three-month deferred repayment program provided across-the-board to consumer borrowers. See “Early Delinquency and Payment Deferral Programs” below for additional information. Inflows to non-performing loans held for investment were $58.3 million, a decrease of $45.5 million, compared to inflows of $103.9 million in the third quarter of 2017. The variance primarily reflects the effect in the previous quarter of interruptions in regular collection efforts caused by Hurricanes Irma and Maria and the impact of the three-month deferred repayment programs provided to consumer and residential mortgage borrowers. See “Early Delinquency and Payment Deferral Programs” below for additional information. Adversely classified commercial and construction loans held for investment increased by $106.7 million to $474.2 million as of December 31, 2017, driven by downgrades in the credit risk classification of three large commercial relationships in Puerto Rico totaling $94.6 million. The OREO balance decreased by $5.0 million, driven by sales of $3.1 million and adjustments to the OREO value of $3.0 million, partially offset by additions of $1.1 million in the fourth quarter. Total troubled debt restructuring (“TDR”) loans held for investment were $587.2 million as of December 31, 2017, up $1.4 million from September 30, 2017. Approximately $374.7 million of total TDR loans held for investment were in accrual status as of December 31, 2017.\nEarly Delinquency and Payment Deferral Programs\nTotal loans in early delinquency (i.e. 30-89 days past due loans as defined in regulatory report instructions) amounted to $244.7 million as of December 31, 2017, a decrease of $16.6 million compared to $261.3 million as of the end of the third quarter. The variances by major portfolio categories follow:\nConsumer loans in early delinquency decreased in the fourth quarter by $18.5 million to $111.2 million as of December 31, 2017, reflecting payments received and the effect of the automatic payment deferral programs established by the Corporation to assist individuals affected by the storms, as described below. Commercial and construction loans in early delinquency decreased in the fourth quarter by $13.1 million to $17.6 million as of December 31, 2017, reflecting a combination of both loans brought current and loans classified as non-performing during the fourth quarter. Residential mortgage loans in early delinquency increased in the third quarter by $15.0 million to $115.9 million as of December 31, 2017, primarily related to the migration of loans not eligible for the payment deferral programs.\nIn working with borrowers in the Virgin Islands and Puerto Rico affected by Hurricanes Irma and Maria, which made landfall on September 6, 2017 and September 20, 2017, respectively, the Corporation provided automatic three-month deferred repayment arrangements across-the-board to all consumer borrowers (i.e., personal loans, auto loans, finance leases and credit cards) current in their payments or no more than two payments in arrears as of the date of the respective hurricane. For residential mortgage loans, the Corporation entered during the third and fourth quarters of 2017 into deferral payment agreements on 9,588 residential mortgages totaling $1.3 billion as of December 31, 2017 that provided for a three-month payment deferral for those loans current or no more than two payments in arrears as of the date of the event. For both consumer and residential mortgage loans subject to the deferral programs, each borrower is required to begin making their regularly scheduled loan payment at the end of the deferral period and the deferred amounts were moved to the end of the loan. The payment deferral programs were applied prospectively from the date of the events and did not change the delinquency status of the loans as of such dates. For commercial and construction loans, the Corporation, on a case by case basis, entered into three-month deferral arrangements for the payment of principal on 351 commercial and construction loans totaling $1.2 billion, for customers current in their payment at the date of the event. As of December 31, 2017, residential mortgage and commercial and construction loans in early delinquency (i.e., 30-89 days past due as defined in regulatory report instructions) include $95.1 million and $3.2 million, respectively, of loans subject to the storm-related deferral programs established in Puerto Rico and the Virgin Islands.\nQuarter Ended (Dollars in thousands) December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 Allowance for loan and lease losses, beginning of period $ 230,870 $ 173,485 $ 203,231 $ 205,603 $ 214,070 Provision for loan and lease losses 25,703 (1 ) 75,013 (2 ) 18,096 25,442 (3 ) 23,191 (6 ) Net (charge-offs) recoveries of loans: Residential mortgage (5,341 ) (6,856 ) (6,076 ) (7,476 ) (5,487 ) Commercial mortgage (6,850 ) (223 ) (30,417 ) (1,332 ) (4,310 ) (7 ) Commercial and Industrial (545 ) (624 ) (1,754 ) (11,177 ) (4 ) (9,515 ) (8 ) Construction (2,764 ) (31 ) (462 ) 382 (1,132 ) Consumer and finance leases (9,230 ) (9,894 ) (9,133 ) (8,211 ) (11,214 ) Net charge-offs (24,730 ) (17,628 ) (47,842 ) (27,814 ) (5 ) (31,658 ) (9 ) Allowance for loan and lease losses, end of period $ 231,843 $ 230,870 $ 173,485 $ 203,231 $ 205,603 Allowance for loan and lease losses to period end total loans held for investment (10) 2.62 % 2.60 % 1.96 % 2.30 % 2.31 % Net charge-offs (annualized) to average loans outstanding during the period 1.12 % 0.80 % 2.16 % 1.26 % 1.43 % Net charge-offs (annualized), excluding charge-offs of $10.7 million related to the sale of the PREPA credit line in the first quarter of 2017 and net charge-offs of $4.6 million related to the sale of a $16.3 million pool of non-performing assets in the fourth quarter of 2016, to average loans outstanding during the period 1.12 % 0.80 % 2.16 % 0.78 % 1.22 % Provision for loan and lease losses to net charge-offs during the period 1.04x 4.26x 0.38x 0.91x 0.73x Provision for loan and lease losses to net charge-offs during the period, excluding impact of the storm-related provision in the fourth and third quarters of 2017, the impact of the sale of the PREPA credit line in the first quarter of 2017, and the sale of the $16.3 million pool of non-performing assets in the fourth quarter of 2016 0.96x 0.48x 0.38x 1.46x 0.79x (1) Includes a provision of $4.8 million associated with the impact of Hurricanes Irma and Maria. (2) Includes a provision of $66.5 million associated with the impact of Hurricanes Irma and Maria. (3) Includes a provision of $0.6 million associated with the sale of the PREPA credit line. (4) Includes a charge-off of $10.7 million associated with the sale of the PREPA credit line. (5) Includes the charge-off of $10.7 million associated with the sale of the PREPA credit line. (6) Includes a provision of $1.8 million associated with the sale of the $16.3 million pool of non-performing assets. (7) Includes net charge-offs totaling $3.0 million associated with the sale of the $16.3 million pool of non-performing assets. (8) Includes net charge-offs totaling $1.6 million associated with the sale of the $16.3 million pool of non-performing assets. (9) Includes net charge-offs totaling $4.6 million associated with the sale of the $16.3 million pool of non-performing assets. (10) The ratio of allowance for loan and lease losses to total loans held for investment, excluding the storm-related allowance, was 1.85% as of both December 31, 2017 and September 30, 2017. The ratio of the allowance for loan and lease losses to total loans held for investment was 2.62% as of December 31, 2017, compared to 2.60% as of September 30, 2017, a slightly higher coverage driven by the overall decrease in the loan portfolio and, to a lesser extent, the above mentioned increase in the storm-related allowance. The ratio of the total allowance to non-performing loans held for investment was 47.36% as of December 31, 2017, compared to 48.80% as of September 30, 2017.\nThe following table sets forth information concerning the composition of the Corporation’s allowance for loan and lease losses as of December 31, 2017 and September 30, 2017 by loan category and by whether the allowance and related provisions were calculated individually for impairment purposes or through a general valuation allowance:\n(Dollars in thousands) Residential\nMortgage Loans\nCommercial Loans\n(including Commercial\nMortgage, C&I, and\nConstruction)\nConsumer and\nFinance Leases\nTotal As of December 31, 2017 Impaired loans: Principal balance of loans, net of charge-offs $ 433,434 $ 318,480 $ 38,394 $ 790,308 Allowance for loan and lease losses 22,086 24,159 5,165 51,410 Allowance for loan and lease losses to principal balance 5.10 % 7.59 % 13.45 % 6.51 % PCI loans: Carrying value of PCI loans 153,991 4,183 - 158,174 Allowance for PCI loans 10,873 378 - 11,251 Allowance for PCI loans to carrying value 7.06 % 9.04 % - 7.11 % Loans with general allowance: Principal balance of loans 2,703,532 3,486,959 1,711,503 7,901,994 Allowance for loan and lease losses 26,016 77,349 65,817 169,182 Allowance for loan and lease losses to principal balance 0.96 % 2.22 % 3.85 % 2.14 % Total loans held for investment: Principal balance of loans $ 3,290,957 $ 3,809,622 $ 1,749,897 $ 8,850,476 Allowance for loan and lease losses 58,975 101,886 70,982 231,843 Allowance for loan and lease losses to principal balance 1.79 % 2.67 % 4.06 % 2.62 % As of September 30, 2017 Impaired loans: Principal balance of loans, net of charge-offs $ 425,835 $ 315,187 $ 38,237 $ 779,259 Allowance for loan and lease losses 19,417 23,561 5,177 48,155 Allowance for loan and lease losses to principal balance 4.56 % 7.48 % 13.54 % 6.18 % PCI loans: Carrying value of PCI loans 153,609 4,185 - 157,794 Allowance for PCI loans 9,863 372 - 10,235 Allowance for PCI loans to carrying value 6.42 % 8.89 % - 6.49 % Loans with general allowance: Principal balance of loans 2,694,896 3,555,962 1,689,303 7,940,161 Allowance for loan and lease losses 27,772 76,336 68,372 172,480 Allowance for loan and lease losses to principal balance 1.03 % 2.15 % 4.05 % 2.17 % Total loans held for investment: Principal balance of loans $ 3,274,340 $ 3,875,334 $ 1,727,540 $ 8,877,214 Allowance for loan and lease losses 57,052 100,269 73,549 230,870 Allowance for loan and lease losses to principal balance 1.74 % 2.59 % 4.26 % 2.60 % Net Charge-Offs\nThe following table presents annualized net charge-offs to average loans held-in-portfolio:\nQuarter Ended December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 Residential mortgage 0.66% 0.84% 0.74% 0.92% 0.67% Commercial mortgage 1.73% 0.06% 7.42% 0.33% 1.11% (3) Commercial and Industrial 0.10% 0.12% 0.34% 2.07% (1) 1.75% (4) Construction 7.86% 0.09% 1.19% -1.17% 3.36% Consumer and finance leases 2.13% 2.29% 2.13% 1.92% 2.61% Total loans 1.12% 0.80% 2.16% 1.26% (2) 1.43% (5) (1) Includes the charge-off of $10.7 million associated with the sale of the PREPA credit line. The ratio of commercial and industrial net charge-offs to average loans, excluding the charge-off associated with the sale of the PREPA credit line, was 0.08%. (2) Includes the charge-off of $10.7 million associated with the sale of the PREPA credit line. The ratio of total net charge-offs to average loans, excluding the charge-off associated with the sale of the PREPA credit line, was 0.78%. (3) Includes net charge-offs totaling $3.0 million associated with the sale of the $16.3 million pool of non-performing assets. The ratio of commercial mortgage net charge-offs to average loans, excluding charge-offs associated with the sale of the $16.3 million pool of non-performing assets, was 0.33%. (4) Includes net charge-offs totaling $1.6 million associated with the sale of the $16.3 million pool of non-performing assets. The ratio of commercial and industrial net charge-offs to average loans, excluding charge-offs associated with the sale of the $16.3 million pool of non-performing assets, was 1.46%. (5) Includes net charge-offs totaling $4.6 million associated with the sale of the $16.3 million pool of non-performing assets. The ratio of total charge-offs to average loans, excluding charge-offs associated with the sale of the $16.3 million pool of non-performing assets, was 1.22%. The ratios above are based on annualized net charge-offs and are not necessarily indicative of the results expected in subsequent periods.\nNet charge-offs for the fourth quarter of 2017 were $24.7 million, or an annualized 1.12% of average loans, compared to $17.6 million, or an annualized 0.80% of average loans, in the third quarter of 2017. The increase of $7.1 million in net charge-offs was mainly related to:\nA $9.3 million increase in commercial and construction loan net charge-offs, primarily related to charge-offs totaling $8.3 million taken on two collateral-dependent loans in Puerto Rico. Commercial and construction loan net charge-offs were just $0.9 million for the third quarter of 2017.\nPartially offset by:\nA $1.5 million decrease in residential mortgage loan net charge-offs, primarily related to a lower amount of charge-offs for loans evaluated for impairment purposes based on their respective delinquency status and loan-to-value ratio. A $0.7 million decrease in consumer loan net charge-offs, primarily due to lower delinquency levels reflecting the effect of the automatic three-month deferred repayment arrangements provided to consumer borrowers affected by the storms that maintained the delinquency status that existed at the date of the event until the end of the deferral period.\nSTATEMENT OF FINANCIAL CONDITION\nTotal assets were approximately $12.3 billion as of December 31, 2017, up $87.6 million from September 30, 2017.\nThe increase was mainly due to:\nA $131.5 million increase in investment securities driven by purchases toward the end of the quarter of approximately $116.5 million of 7-8 Year U.S. agency callable debt securities with an average yield of 2.80% and purchases of $95.7 million of 15-Year U.S. agency MBS with an average yield of 2.57%, partially offset by $58.5 million of U.S. agency MBS (including CMOs) principal prepayments, a $9.0 million decrease in investments in FHLB stock, and a $9.7 million decrease in the fair value of available-for-sale investment securities.\nPartially offset by:\nA $21.3 million decrease in total loans. The decrease consisted of reductions of $53.6 million and $24.0 million in the Puerto Rico and the Virgin Island regions, respectively, partially offset by a $56.2 million growth in the Florida region primarily reflected in the commercial and industrial portfolio.\nThe decrease in total loans in the Puerto Rico region was driven by a $100.9 million decline in commercial and construction loans, primarily related to a $40.5 million loan paid off during the fourth quarter and the decrease in balances on certain revolving lines of credit, partially offset by increases of $24.2 million and $23.1 million in residential mortgage and consumer loans, respectively. The increase in residential mortgage loans in Puerto Rico was primarily driven by a $17.0 million increase in loans previously sold to GNMA that meet GNMA’s specified delinquency criteria and are eligible for repurchase. These loans increased from $45.1 million as of September 30, 2017 to $62.1 million as of December 31, 2017. The Corporation has the right but not the obligation to repurchase such loans and the accounting guidelines require the Corporation to bring those loans back to its books and record a corresponding liability.\nThe reduction in total loans in the Virgin Islands reflects, among other things, the effect of a $14.3 million decrease in the balance of a pre-arranged overdraft account of a government entity.\nTotal loan originations, including refinancings, renewals and draws from existing commitments (excluding credit card utilization activity), of $546.0 million for the fourth quarter of 2017, compared to $589.7 million for the third quarter of 2017, reflecting reductions in all major loan categories adversely affected by the initial sharp drop in business activity after the storms. These figures exclude the credit card utilization activity.\nTotal loan originations in Puerto Rico decreased by $64.0 million to $352.9 million in the fourth quarter of 2017, compared to $417.0 million in the third quarter of 2017. The decrease in the Puerto Rico region consisted of a $25.5 million decrease in commercial and construction loan originations, a $22.9 million decrease in consumer loan originations, and a $15.7 million decrease in residential mortgage loan originations.\nTotal loan originations in the Virgin Islands of $5.3 million in the fourth quarter of 2017 decreased by $2.8 million, compared to $8.1 million in the third quarter of 2017. The decrease in the Virgin Islands region consisted of a $1.0 million decrease in commercial and construction loan originations, a $0.8 million decrease in residential mortgage loan originations, and a $0.9 million decrease in consumer loan originations.\nTotal loan originations in the Florida region increased by $23.1 million to $187.8 million in the fourth quarter of 2017, compared to $164.6 million in the third quarter of 2017. The increase in the Florida region consisted of a $25.4 million increase in commercial and construction loan originations and a $0.5 million increase in consumer loan originations, partially offset by a $2.8 million decrease in residential mortgage loan originations. A $20.8 million decrease in cash and cash equivalents, largely driven by liquidity invested in the above mentioned purchases of U.S. agency investment securities and funds used to pay short-term FHLB advances obtained in the previous quarter, almost entirely offset by funds obtained from the above mentioned deposit build-up in the fourth quarter attributable in part to storm-related factors. Most of the deposit growth is maintained at the Federal Reserve Bank cash account pending better information on the volatility of these funds.\nTotal liabilities were approximately $10.4 billion as of December 31, 2017, up $72.3 million from September 30, 2017.\nThe increase was mainly due to:\nA $377.0 million increase in total deposits, excluding brokered CDs and government deposits, reflecting increases of $291.4 million and $91.9 million in Puerto Rico and the Virgin Islands regions, respectively, partially offset by a decrease of $6.2 million in the Florida region. As mentioned above, the Corporation experienced a rapid accumulation of deposits in the months following the storms. The most significant increase was in noninterest-bearing demand deposits, which grew 16%, or $247.5 million, during the fourth quarter of 2017. Storm-related factors, such as the effect of payment deferral programs and disaster relief funds, contributed to this accumulation. Although management expects the balances accumulated by deposit customers in the storm-affected areas to reduce over time, it is difficult to predict when and to what degree, and there may be some further growth as insurance claims are resolved and additional disaster-recovery funds are distributed. Funds from the deposit build-up were primarily deposited at the Federal Reserve Bank, pending better information on the volatility of these funds. A $15.5 million increase in accounts payable and other liabilities, primarily related to the accounting for the above mentioned rebooked GNMA delinquent loans.\nPartially offset by:\nA $200.0 million decrease in FHLB advances, primarily due to the repayment of short-term FHLB advances that were obtained in the third quarter in anticipation of a potential increase in short-term liquidity requirements of deposit customers in the aftermath of Hurricanes Irma and Maria. A $104.8 million decrease in brokered CDs. Brokered CDs that matured in the fourth quarter totaled $203.2 million with an all-in cost of 1.21%, partially offset by issuances of $98.2 million with an all-in cost of 1.81%. A $15.5 million decrease in government deposits, reflecting a decrease of $17.9 million in Puerto Rico, primarily related to lower balances in transactional accounts of certain municipalities, partially offset by a $2.4 million increase in the Virgin Islands region.\nTotal stockholders’ equity amounted to $1.9 billion as of December 31, 2017, an increase of $15.3 million from September 30, 2017, mainly driven by the earnings generated in the fourth quarter, partially offset by a decrease in the fair value of available-for-sale investment securities recorded as part of other comprehensive income.\nThe Corporation’s common equity tier 1 capital, tier 1 capital, total capital and leverage ratios under the Basel III rules as of December 31, 2017 were 18.96%, 18.97%, 22.53% and 14.03%, respectively, compared to common equity tier 1 capital, tier 1 capital, total capital and leverage ratios of 18.62%, 18.62%, 22.18%, and 13.96%, respectively, as of the end of the third quarter of 2017. The Corporation paid interest for the fourth quarter of 2017 on the subordinated debt associated with its trust preferred securities and continued to pay monthly dividends on its non-cumulative perpetual monthly income preferred stock. As of December 31, 2017, the Corporation is current on all interest payments related to its subordinated debt.\nMeanwhile, the common equity tier 1 capital, tier 1 capital, total capital and leverage ratios as of December 31, 2017 of our banking subsidiary, FirstBank Puerto Rico, were 17.70%, 20.79%, 22.06%, and 15.39%, respectively, compared to common equity tier 1 capital, tier 1 capital, total capital and leverage ratios of 17.36%, 20.44%, 21.71% and 15.34%, respectively, as of the end of the third quarter of 2017.\nTangible Common Equity\nThe Corporation’s tangible common equity ratio increased to 14.65% as of December 31, 2017 from 14.63% as of September 30, 2017.\nThe following table presents a reconciliation of the Corporation’s tangible common equity and tangible assets over the last five quarters to the comparable GAAP items:\n(In thousands, except ratios and per share information) December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 Tangible Equity: Total equity - GAAP $ 1,869,097 $ 1,853,751 $ 1,859,910 $ 1,823,017 $ 1,786,243 Preferred equity (36,104 ) (36,104 ) (36,104 ) (36,104 ) (36,104 ) Goodwill (28,098 ) (28,098 ) (28,098 ) (28,098 ) (28,098 ) Purchased credit card relationship intangible (8,000 ) (8,633 ) (9,266 ) (9,899 ) (10,531 ) Core deposit intangible (5,478 ) (5,885 ) (6,297 ) (6,747 ) (7,198 ) Insurance customer relationship intangible (775 ) (813 ) (851 ) (889 ) (927 ) Tangible common equity $ 1,790,642 $ 1,774,218 $ 1,779,294 $ 1,741,280 $ 1,703,385 Tangible Assets: Total assets - GAAP $ 12,261,268 $ 12,173,648 $ 11,913,800 $ 11,890,398 $ 11,922,455 Goodwill (28,098 ) (28,098 ) (28,098 ) (28,098 ) (28,098 ) Purchased credit card relationship intangible (8,000 ) (8,633 ) (9,266 ) (9,899 ) (10,531 ) Core deposit intangible (5,478 ) (5,885 ) (6,297 ) (6,747 ) (7,198 ) Insurance customer relationship intangible (775 ) (813 ) (851 ) (889 ) (927 ) Tangible assets $ 12,218,917 $ 12,130,219 $ 11,869,288 $ 11,844,765 $ 11,875,701 Common shares outstanding (1) 216,278 216,175 215,964 218,431 217,446 Tangible common equity ratio 14.65 % 14.63 % 14.99 % 14.70 % 14.34 % Tangible book value per common share $ 8.28 $ 8.21 $ 8.24 $ 7.97 $ 7.83 (1) In May 2017, the U.S. Treasury sold its remaining shares of common stock in First BanCorp. As a result, approximately 2.4 million of restricted shares outstanding were forfeited.\nExposure to Puerto Rico Government\nAs of December 31, 2017, the Corporation had $214.5 million of direct exposure to the Puerto Rico Government, its municipalities and public corporations, compared to $214.8 million as of September 30, 2017. Approximately $184.6 million of the exposure consisted of loans and obligations of municipalities in Puerto Rico that are supported by assigned property tax revenues and for which, in most cases, the good faith, credit and unlimited taxing power of the applicable municipality have been pledged to their repayment. Approximately $6.8 million consisted of a loan to a unit of the central government, and approximately $15.1 million consisted of a loan to an affiliate of a public corporation. The Corporation’s total direct exposure also includes obligations of the Puerto Rico Government, specifically bonds of the Puerto Rico Housing Finance Authority, at an amortized cost of $8.0 million as part of its available-for-sale investment securities portfolio recorded on its books at a fair value of $6.8 million as of December 31, 2017.\nIn addition, the Corporation had three loans granted to the hotel industry in Puerto Rico guaranteed by the TDF with a book value of $70.8 million as of December 31, 2017, compared to $72.4 million as of September 30, 2017. As previously reported, the Corporation’s exposure to TDF commercial mortgage loans was placed in non-accrual status in the first quarter of 2016 and interest payments collected are now applied against principal. As of December 31, 2017, the non-performing commercial mortgage loans guaranteed by the TDF and related facilities are being carried (net of reserves and accumulated charge-offs) at 52% of the unpaid principal balance.\nThe exposure to municipalities in Puerto Rico includes $150.6 million of financing arrangements with Puerto Rico municipalities that were issued in bond form, but underwritten as loans with features that are typically found in commercial loans. These bonds are accounted for as held-to-maturity investment securities.\nAs of December 31, 2017, the Corporation had $490.3 million of public sector deposits in Puerto Rico, compared to $508.2 million as of September 30, 2017. Approximately 29% is from municipalities and municipal agencies in Puerto Rico and 71% is from public corporations and the central government and agencies in Puerto Rico.\nConference Call / Webcast Information\nFirst BanCorp’s senior management will host an earnings conference call and live webcast on Monday, January 29, 2018, at 10:00 a.m. (Eastern Time). The call may be accessed via a live Internet webcast through the investor relations section of the Corporation’s web site: www.1firstbank.com or through a dial-in telephone number at (877) 506-6537 or (412) 380–2001 for international callers. The Corporation recommends that listeners go to the web site at least 15 minutes prior to the call to download and install any necessary software. Following the webcast presentation, a question and answer session will be made available to research analysts and institutional investors. A replay of the webcast will be archived in the investor relations section of First BanCorp’s web site, www.1firstbank.com , until January 29, 2019. A telephone replay will be available one hour after the end of the conference call through March 1, 2019 at (877) 344-7529 or (412) 317-0088 for international callers. The replay access code is 10116386.\nSafe Harbor\nThis press release may contain “forward-looking statements” concerning the Corporation’s future economic, operational and financial performance. The words or phrases “expect,” “anticipate,” “intend,” “look forward,” “should,” “would,” “believes” and similar expressions are meant to identify “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and are subject to the safe harbor created by such sections. The Corporation cautions readers not to place undue reliance on any such “forward-looking statements,” which speak only as of the date made, and advises readers that various factors, including, but not limited to, the following could cause actual results to differ materially from those expressed in, or implied by such forward-looking statements: the actual pace and magnitude of economic recovery in the regions affected by the two hurricanes that affected the Corporation’s service areas during 2017 compared to management's current views on the economic recovery; uncertainties about how and when rebuilding will take place in the regions affected by the recent storms, including the rebuilding of the public infrastructure, such as Puerto Rico’s power grid, what level of government, private or philanthropic funds will be invested in the affected communities, how many displaced individuals will return to their homes in both the short- and long-term, and what other demographic changes will take place, if any; uncertainty as to the ultimate outcomes of actions taken, or those that may be taken, by the Puerto Rico government, or the oversight board established by the Puerto Rico Oversight, Management, and Economic Stability Act (PROMESA) to address Puerto Rico’s financial problems, including the filing of a form of bankruptcy under Title III of PROMESA that provides a court debt restructuring process similar to U.S. bankruptcy protection and the effect of measures included in the Puerto Rico government fiscal plan, or any revisions to it, on our clients and loan portfolios; the ability of the Puerto Rico government or any of its public corporations or other instrumentalities to repay its respective debt obligations, including the effect of payment defaults on the Puerto Rico government general obligations, bonds of the Government Development Bank for Puerto Rico and certain bonds of government public corporations, and recent and any future downgrades of the long-term and short-term debt ratings of the Puerto Rico government, which could exacerbate Puerto Rico’s adverse economic conditions and, in turn, further adversely impact the Corporation; uncertainty about whether the Federal Reserve Bank of New York (the “New York FED” or “Federal Reserve”) will provide approvals for receiving dividends from FirstBank, or for making payments of dividends on non-cumulative perpetual preferred stock, or payments on trust preferred securities or subordinated debt, incurring, increasing or guaranteeing debt or repurchasing any capital securities, despite the consents that have enabled the Corporation to pay quarterly interest payments on the Corporation’s subordinated debentures associated with its trust preferred securities since the second quarter of 2016, and to pay monthly dividends on the non-cumulative perpetual preferred stock since December 2016; a decrease in demand for the Corporation’s products and services and lower revenues and earnings because of the continued recession in Puerto Rico; uncertainty as to the availability of certain funding sources, such as brokered CDs; the Corporation’s reliance on brokered CDs to fund operations and provide liquidity; the risk of not being able to fulfill the Corporation’s cash obligations or resume paying dividends to the Corporation’s common stockholders in the future due to the Corporation’s need to receive regulatory approvals to declare or pay any dividends and to take dividends or any other form of payment representing a reduction in capital from FirstBank or FirstBank’s failure to generate sufficient cash flow to make a dividend payment to the Corporation; the weakness of the real estate markets and of the consumer and commercial sectors and their impact on the credit quality of the Corporation’s loans and other assets, which have contributed and may continue to contribute to, among other things, high levels of non-performing assets, charge-offs and provisions for loan and lease losses, and may subject the Corporation to further risk from loan defaults and foreclosures; the ability of FirstBank to realize the benefits of its deferred tax assets subject to the remaining valuation allowance; adverse changes in general economic conditions in Puerto Rico, the U.S., and the U.S. Virgin Islands and British Virgin Islands, including the interest rate environment, market liquidity, housing absorption rates, real estate prices, and disruptions in the U.S. capital markets, which reduced interest margins and affected funding sources, and have affected demand for all of the Corporation’s products and services and reduced the Corporation’s revenues and earnings and the value of the Corporation’s assets, and may continue to have these effects; an adverse change in the Corporation’s ability to attract new clients and retain existing ones; the risk that additional portions of the unrealized losses in the Corporation’s investment portfolio are determined to be other-than-temporary, including additional impairments on the Corporation’s remaining $8.0 million of the Puerto Rico government’s debt securities; uncertainty about regulatory and legislative changes for financial services companies in Puerto Rico, the U.S., and the U.S. and British Virgin Islands, which could affect the Corporation’s financial condition or performance and could cause the Corporation’s actual results for future periods to differ materially from prior results and anticipated or projected results; changes in the fiscal and monetary policies and regulations of the U.S. federal government and the Puerto Rico and other governments, including those determined by the Federal Reserve Board, the New York FED, the Federal Deposit Insurance Corporation (“FDIC”), government-sponsored housing agencies, and regulators in Puerto Rico and the U.S. and British Virgin Islands; the risk of possible failure or circumvention of controls and procedures and the risk that the Corporation’s risk management policies may not be adequate; the risk that the FDIC may increase the deposit insurance premium and/or require special assessments to replenish its insurance fund, causing an additional increase in the Corporation’s non-interest expenses; the impact on the Corporation’s results of operations and financial condition of acquisitions and dispositions; a need to recognize impairments on the Corporation’s financial instruments, goodwill or other intangible assets relating to acquisitions; the risk that downgrades in the credit ratings of the Corporation’s long-term senior debt will adversely affect the Corporation’s ability to access necessary external funds; the impact on the Corporation’s businesses, business practices and results of operations of a potential higher interest rate environment; uncertainty as to whether FirstBank will be able to satisfy its regulators regarding, among other things, its asset quality, liquidity plans, maintenance of capital levels and compliance with applicable laws, regulations and related requirements; and general competitive factors and industry consolidation. The Corporation does not undertake, and specifically disclaims any obligation, to update any “forward-looking statements” to reflect occurrences or unanticipated events or circumstances after the date of such statements, except as required by the federal securities laws.\nBasis of Presentation\nUse of Non-GAAP Financial Measures\nThis press release contains non-GAAP financial measures. Non-GAAP financial measures are used when management believes they will be helpful to an investor’s understanding of the Corporation’s results of operations or financial position. Where non-GAAP financial measures are used, the comparable GAAP financial measure, as well as the reconciliation of the non-GAAP financial measure to the comparable GAAP financial measure, can be found in the text or in the attached tables to this earnings release. Any analysis of these non-GAAP financial measures should be used only in conjunction with results presented in accordance with GAAP.\nTangible Common Equity Ratio and Tangible Book Value per Common Share\nThe tangible common equity ratio and tangible book value per common share are non-GAAP financial measures generally used by the financial community to evaluate capital adequacy. Tangible common equity is total equity less preferred equity, goodwill, core deposit intangibles, and other intangibles, such as the purchased credit card relationship intangible and the insurance customer relationship intangible. Tangible assets are total assets less goodwill, core deposit intangibles, and other intangibles, such as the purchased credit card relationship intangible and the insurance customer relationship intangible. Management and many stock analysts use the tangible common equity ratio and tangible book value per common share in conjunction with more traditional bank capital ratios to compare the capital adequacy of banking organizations with significant amounts of goodwill or other intangible assets, typically stemming from the use of the purchase method of accounting for mergers and acquisitions. Accordingly, the Corporation believes that disclosure of these financial measures is useful to investors. Neither tangible common equity nor tangible assets, or the related measures should be considered in isolation or as a substitute for stockholders’ equity, total assets, or any other measure calculated in accordance with GAAP. Moreover, the manner in which the Corporation calculates its tangible common equity, tangible assets, and any other related measures may differ from that of other companies reporting measures with similar names.\nAdjusted Pre-Tax, Pre-Provision Income\nAdjusted pre-tax, pre-provision income is a non-GAAP performance metric that management uses and believes that investors may find useful in analyzing underlying performance trends, particularly in times of economic stress, including as a result of natural catastrophes such as the recent hurricanes. Adjusted pre-tax, pre-provision income, as defined by management, represents net income (loss) excluding income tax expense (benefit) and the provision for loan and lease losses, as well as Special Items that management believes are not reflective of core operating performance, are not expected to reoccur with any regularity or may reoccur at uncertain times and in uncertain amounts.\nNet Interest Income, Excluding Valuations, and on a Tax-Equivalent Basis\nNet interest income, interest rate spread, and net interest margin are reported excluding the changes in the fair value of derivative instruments and on a tax-equivalent basis in order to provide to investors additional information about the Corporation’s net interest income that management uses and believes should facilitate comparability and analysis. The changes in the fair value of derivative instruments have no effect on interest due or interest earned on interest-bearing liabilities or interest-earning assets, respectively. The tax-equivalent adjustment to net interest income recognizes the income tax savings when comparing taxable and tax-exempt assets and assumes a marginal income tax rate. Income from tax-exempt earning assets is increased by an amount equivalent to the taxes that would have been paid if this income had been taxable at statutory rates. Management believes that it is a standard practice in the banking industry to present net interest income, interest rate spread, and net interest margin on a fully tax-equivalent basis. This adjustment puts all earning assets, most notably tax-exempt securities and certain loans, on a common basis that facilitates comparison of results to the results of peers.\nFinancial measures adjusted to exclude the effect of Special Items because they are not reflective of core operating performance, are not expected to reoccur with any regularity or may reoccur at uncertain times and in uncertain amounts.\nTo supplement the Corporation’s financial statements presented in accordance with GAAP, the Corporation uses, and believes that investors would benefit from disclosure of, non-GAAP financial measures that reflect adjustments to the provision for loan and lease losses, net charge-offs, non-interest income, non-interest expenses and net income to exclude items that management identifies as Special Items because management believes they are not reflective of core operating performance, are not expected to reoccur with any regularity or may reoccur at uncertain times and in uncertain amounts. This press release includes the following non-GAAP financial measures for the fourth and third quarters of 2017 and the fourth quarter of 2016 that reflect the described items that were excluded for one of those reasons:\nAdjusted provision for loan and lease losses excluded for the fourth and third quarters of 2017 and the fourth quarter of 2016, the following: The $4.8 million incremental charge recorded in the fourth quarter of 2017 related to the storm-related allowance established for inherent losses resulting from the impact of Hurricanes Irma and Maria. The $66.5 million storm-related allowance established in the third quarter of 2017 in connection with the initial estimate, based on available information, of inherent losses resulting from the impact of Hurricanes Irma and Maria. A $1.8 million charge to the provision in connection with the sale of the $16.3 million pool of non-performing assets in the fourth quarter of 2016. Adjusted net charge-offs excluded for the fourth quarter of 2016 the effect of net charge-offs totaling $4.6 million associated with the sale of the $16.3 million pool of non-performing assets in the fourth quarter of 2016. Adjusted non-interest income excluded for the third quarter of 2017 and the fourth quarter of 2016, the following: Gain of $1.4 million on the repurchase and cancellation of $7.3 million in trust preferred securities in the third quarter of 2017. Gain of $1.5 million from recovery of a residual CMO previously written off once the trust was liquidated in the fourth quarter of 2016. Brokerage and insurance commissions of $1.8 million from the sale of large fixed annuities contracts in the fourth quarter of 2016. Adjusted non-interest expenses reflected for the fourth and third quarters of 2017 and the fourth quarter of 2016, the following: Exclusion of costs of $1.9 million in the fourth quarter of 2017 and $0.6 million in the third quarter of 2017 related to insurance deductibles with respect to damages assessed on certain OREO properties and other estimated storm-related costs not recoverable under insurance policies. Inclusion of $0.2 million in the fourth quarter of 2017 and $1.7 million in the third quarter of 2017 of expected insurance recoveries for employees’ compensation and rental costs that the Corporation incurred when Hurricanes Irma and Maria precluded employees from working during October and September 2017. Exclusion of costs of $0.1 million in the third quarter of 2017 and $0.6 million in the fourth quarter of 2016 associated with secondary offerings of the Corporation’s common stock by certain of our existing stockholders. Inclusion of a $2.7 million adjustment recorded in the fourth quarter of 2016 to reduce the credit card rewards program liability due to the expiration of reward points earned by customers up to September 2013 (the conversion date of the credit card portfolio acquired from FIA in May 2012). Exclusion of incentive costs of $0.1 million related to the aforementioned sale of large fixed annuities contracts in the fourth quarter of 2016. Adjusted net income reflecting the effect of all of the items mentioned in the above bullets for the fourth and third quarters of 2017 and the fourth quarter of 2016, and their related tax impacts as follows: Tax benefit of $1.9 million in the fourth quarter of 2017 and $25.8 million in the third quarter of 2017 related to the storm-related allowance for loan and lease losses (calculated based on the statutory tax rate of 39%). Tax benefit of $0.8 million in the fourth quarter of 2017 and $0.2 million in the third quarter of 2017 related to insurance deductibles and estimated storm-related costs not recoverable under insurance policies (calculated based on the statutory tax rate of 39%). No tax expense was recorded for the gain on repurchase and cancellation of trust preferred securities and for costs related with secondary offerings recorded at the holding company level in the third quarter of 2017 and the fourth quarter of 2016. Tax benefit of $0.7 million related to the sale of the $16.3 million pool of non-performing assets in the fourth quarter of 2016 (calculated based on the statutory tax rate of 39%). Tax expense of $0.3 million related to the gain from recovery of a residual CMO previously written off, which was recorded in the fourth quarter of 2016 (calculated based on the applicable capital gain tax rate of 20%). Tax expense of $0.7 million related to the brokerage and insurance commissions from the sale of large fixed annuities contracts, net of incentive costs, recorded in the fourth quarter of 2016 (calculated based on the statutory tax rate of 39%). Tax expense of $1.1 million related to the adjustment recorded in the fourth quarter of 2016 to reduce the credit card rewards liability due to unusually large customer forfeitures (calculated based on the statutory tax rate of 39%).\nManagement believes that the presentations of the adjusted provision for loan and lease losses, adjusted net charge-offs, adjusted non-interest income, adjusted non-interest expenses, and adjusted net income enhance the ability of analysts and investors to analyze trends in the Corporation’s business and better understand the performance of the Corporation. In addition, the Corporation may utilize these non-GAAP financial measures as guides in its budgeting and long-term planning process.\nThe following table reconciles these non-GAAP financial measures to the corresponding measures presented in accordance with GAAP.\n(Dollars in thousands) 2017 Fourth Quarter As Reported\n(GAAP)\nStorm-related\nProvision for Loan\nand Lease Losses\nStorm-related expenses and\nrelated adjustments\nTax effect (1) Adjusted (Non-\nGAAP)\nProvision for Loan and Lease Losses $ 25,703 $ (4,814 ) $ - $ - $ 20,889 Non-interest expenses $ 85,136 $ - $ (1,788 ) $ - $ 83,348 Occupancy and Equipment 15,067 - (441 ) - 14,626 Business Promotion 2,768 - (393 ) - 2,375 Net loss on OREO operations 2,201 - (936 ) - 1,265 Other non-interest expenses 8,512 - (18 ) - 8,494 Net income $ 24,169 $ 4,814 $ 1,788 $ (2,636 ) $ 28,135 (1) See Basis of Presentation for the individual tax impact for each reconciling item. 2017 Third Quarter As Reported\n(GAAP)\nStorm-related\nProvision for Loan\nand Lease Losses\nGain on Repurchase and\nCancellation of Trust Preferred\nSecurities\nStorm-related\nexpenses and\nrelated adjustments\nSecondary Offering\nCosts\nTax effect (1) Adjusted (Non-\nGAAP)\nProvision for Loan and Lease Losses $ 75,013 $ (66,490 ) $ - $ - $ - $ - $ 8,523 Non-interest income $ 18,645 $ - $ (1,391 ) $ - $ - $ - $ 17,254 Gain on early extinguishment of debt 1,391 - (1,391 ) - - - - Non-interest expenses $ 85,614 $ - $ - $ 1,063 $ (118 ) $ - $ 86,559 Employees' compensation and benefits 37,128 - - 1,410 - - 38,538 Occupancy and Equipment 13,745 - - 252 - - 13,997 Business Promotion 3,244 - - (599 ) (20 ) - 2,625 Professional fees 12,023 - - - (98 ) - 11,925 Net (loss) income $ (10,752 ) $ 66,490 $ (1,391 ) $ (1,063 ) $ 118 $ (26,048 ) $ 27,354 2016 Fourth Quarter\nAs Reported\n(GAAP)\nGain from Recovery\nof Investments\nPreviously Written\nOff\nBrokerage and Insurance\nCommissions from Sale of Large\nFixed Annuities Contracts and\nRelated Incentive Costs\nSale of $16.3 million\nPool of Non-\nPerforming Assets\nCredit Card\nRewards Program\nUnusual Forfeiture\nSecondary Offering\nCosts\nTax effect (1) Adjusted (Non-\nGAAP)\nTotal net charge-offs (2) $ 31,658 $ - $ - $ (4,631 ) $ - $ - $ - 27,027 Total net charge-offs to average loans 1.43 % 1.22 % Commercial mortgage 4,310 - - (3,026 ) - - - 1,284 Commercial mortgage loans net charge-offs to average loans 1.11 % 0.33 % Commercial and industrial 9,515 - - (1,593 ) - - - 7,922 Commercial and industrial loans net charge-offs to average loans 1.75 % 1.46 % Residential mortgage 5,487 - - (12 ) - - - 5,475 Residential mortgage loans net charge-offs to average loans 0.67 % 0.67 % Provision for loan and lease losses $ 23,191 $ - $ - $ (1,799 ) $ - $ - $ - $ 21,392 Non-interest income $ 23,561 $ (1,547 ) $ (1,772 ) $ - $ - $ - $ - $ 20,242 Gain on investments and impairments 1,547 (1,547 ) - - - - - - Other non-interest income 10,951 - (1,772 ) - - - - 9,179 Non-interest expenses $ 84,236 $ - $ (80 ) $ - $ 2,732 $ (590 ) $ - $ 86,298 Employees' compensation and benefits 37,652 - (80 ) - - - - 37,572 Business promotion 199 - - - 2,732 (20 ) - 2,911 Professional fees 11,362 - - - - (548 ) - 10,814 Taxes, other than income taxes 3,664 - - - - (22 ) - 3,642 Net income $ 23,858 $ (1,547 ) $ (1,692 ) $ 1,799 $ (2,732 ) $ 590 $ 1,333 $ 21,609 (1) See Basis of Presentation for the individual tax impact for each reconciling item. FIRST BANCORP CONDENSED CONSOLIDATED STATEMENTS OF FINANCIAL CONDITION As of December 31, September 30, December 31, (In thousands, except for share information) 2017 2017 2016 ASSETS Cash and due from banks $ 705,980 $ 726,779 $ 289,591 Money market investments: Time deposits with other financial institutions 3,126 3,126 2,800 Other short-term investments 7,289 7,289 7,294 Total money market investments 10,415 10,415 10,094 Investment securities available for sale, at fair value 1,891,016 1,750,472 1,881,920 Investment securities held to maturity, at amortized cost 150,627 150,627 156,190 Other equity securities 43,119 52,119 42,992 Total investment securities 2,084,762 1,953,218 2,081,102 Loans, net of allowance for loan and lease losses of $231,843 (September 30, 2017 - $230,870; December 31, 2016 - $205,603) 8,618,633 8,646,344 8,681,270 Loans held for sale, at lower of cost or market 32,980 27,576 50,006 Total loans, net 8,651,613 8,673,920 8,731,276 Premises and equipment, net 141,895 144,247 150,828 Other real estate owned 147,940 152,977 137,681 Accrued interest receivable on loans and investments 57,172 49,231 45,453 Other assets 461,491 462,861 476,430 Total assets $ 12,261,268 $ 12,173,648 $ 11,922,455 LIABILITIES Deposits: Non-interest-bearing deposits $ 1,833,665 $ 1,586,198 $ 1,484,155 Interest-bearing deposits 7,188,966 7,179,693 7,347,050 Total deposits 9,022,631 8,765,891 8,831,205 Securities sold under agreements to repurchase 300,000 300,000 300,000 Advances from the Federal Home Loan Bank (FHLB) 715,000 915,000 670,000 Other borrowings 208,635 208,639 216,187 Accounts payable and other liabilities 145,905 130,367 118,820 Total liabilities 10,392,171 10,319,897 10,136,212 STOCKHOLDERS' EQUITY Preferred Stock, authorized 50,000,000 shares; issued 22,828,174 shares; outstanding 1,444,146 shares; aggregate liquidation value of $36,104 36,104 36,104 36,104 Common stock, $0.10 par value, authorized 2,000,000,000 shares; issued, 220,382,343 shares (September 30, 2017 - 220,220,026 shares issued; December 31, 2016 - 218,700,394 shares issued) 22,038 22,022 21,870 Less: Treasury stock (at par value) (410 ) (404 ) (125 ) Common stock outstanding, 216,278,040 shares outstanding (September 30, 2017 - 216,175,003; December 31, 2016 - 217,446,205 shares outstanding) 21,628 21,618 21,745 Additional paid-in capital 936,772 935,231 931,856 Retained earnings 895,208 871,708 830,928 Accumulated other comprehensive loss (20,615 ) (10,910 ) (34,390 ) Total stockholders' equity 1,869,097 1,853,751 1,786,243 Total liabilities and stockholders' equity $ 12,261,268 $ 12,173,648 $ 11,922,455 FIRST BANCORP CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS Quarter Ended Year Ended December 31, September 30, December 31, December 31, December 31, (In thousands, except per share information) 2017 2017 2016 2017 2016 Net interest income: Interest income $ 147,826 $ 147,995 $ 143,954 $ 588,423 $ 585,292 Interest expense 25,560 25,163 22,890 96,872 101,174 Net interest income 122,266 122,832 121,064 491,551 484,118 Provision for loan and lease losses 25,703 75,013 23,191 144,254 86,733 Net interest income after provision for loan and lease losses 96,563 47,819 97,873 347,297 397,385 Non-interest income: Service charges on deposit accounts 4,924 5,797 5,759 22,314 22,965 Mortgage banking activities 1,912 3,117 5,304 13,491 20,435 Net gain (loss) on investments and impairments - - 1,547 (11,860 ) 964 Gain on early extinguishment of debt - 1,391 - 1,391 4,217 Other non-interest income 8,114 8,340 10,951 37,051 39,373 Total non-interest income 14,950 18,645 23,561 62,387 87,954 Non-interest expenses: Employees' compensation and benefits 37,655 37,128 37,652 151,845 151,493 Occupancy and equipment 15,067 13,745 14,045 56,659 55,159 Business promotion 2,768 3,244 199 12,485 11,419 Professional fees 11,150 12,023 11,362 45,929 44,137 Taxes, other than income taxes 3,366 3,763 3,664 14,550 15,139 Insurance and supervisory fees 4,417 4,353 4,907 18,534 24,920 Net loss on other real estate owned operations 2,201 1,351 2,399 10,997 11,533 Other non-interest expenses 8,512 10,007 10,008 36,702 41,280 Total non-interest expenses 85,136 85,614 84,236 347,701 355,080 Income (loss) before income taxes 26,377 (19,150 ) 37,198 61,983 130,259 Income tax (expense) benefit (2,208 ) 8,398 (13,340 ) 4,973 (37,030 ) Net income (loss) $ 24,169 $ (10,752 ) $ 23,858 $ 66,956 $ 93,229 Net income (loss) attributable to common stockholders $ 23,500 $ (11,421 ) $ 23,635 $ 64,280 $ 93,006 Earnings (loss) per common share: Basic $ 0.11 $ (0.05 ) $ 0.11 $ 0.30 $ 0.44 Diluted $ 0.11 $ (0.05 ) $ 0.11 $ 0.30 $ 0.43 About First BanCorp.\nFirst BanCorp. is the parent corporation of FirstBank Puerto Rico, a state-chartered commercial bank with operations in Puerto Rico, the U.S. and the British Virgin Islands and Florida, and of FirstBank Insurance Agency. Among the subsidiaries of FirstBank Puerto Rico are First Federal Finance Corp. and First Express, both small loan companies, and FirstBank Puerto Rico Securities, a broker-dealer subsidiary. First BanCorp’s shares of common stock trade on the New York Stock Exchange under the symbol FBP. Additional information about First BanCorp. may be found at www.1firstbank.com .\nEXHIBIT A\nTable 1 – Selected Financial Data\n(In thousands, except per share amounts and financial ratios) Quarter Ended Year Ended December 31, September 30, December 31, December 31, December 31, 2017 2017 2016 2017 2016 Condensed Income Statements: Total interest income $ 147,826 $ 147,995 $ 143,954 $ 588,423 $ 585,292 Total interest expense 25,560 25,163 22,890 96,872 101,174 Net interest income 122,266 122,832 121,064 491,551 484,118 Provision for loan and lease losses 25,703 75,013 23,191 144,254 86,733 Non-interest income 14,950 18,645 23,561 62,387 87,954 Non-interest expenses 85,136 85,614 84,236 347,701 355,080 Income (loss) before income taxes 26,377 (19,150 ) 37,198 61,983 130,259 Income tax (expense) benefit (2,208 ) 8,398 (13,340 ) 4,973 (37,030 ) Net income (loss) 24,169 (10,752 ) 23,858 66,956 93,229 Net income (loss) attributable to common stockholders 23,500 (11,421 ) 23,635 64,280 93,006 Per Common Share Results: Net earnings (loss) per share - basic $ 0.11 $ (0.05 ) $ 0.11 $ 0.30 $ 0.44 Net earnings (loss) per share - diluted $ 0.11 $ (0.05 ) $ 0.11 $ 0.30 $ 0.43 Cash dividends declared $ - $ - $ - $ - $ - Average shares outstanding 214,412 214,187 213,225 213,963 212,818 Average shares outstanding diluted 216,069 214,187 217,396 216,118 215,794 Book value per common share $ 8.48 $ 8.41 $ 8.05 $ 8.48 $ 8.05 Tangible book value per common share (1) $ 8.28 $ 8.21 $ 7.83 $ 8.28 $ 7.83 Selected Financial Ratios (In Percent): Profitability: Return on Average Assets 0.79 (0.36 ) 0.80 0.56 0.75 Interest Rate Spread (2) 4.03 4.14 4.12 4.19 3.99 Net Interest Margin (2) 4.35 4.44 4.39 4.48 4.25 Return on Average Total Equity 5.16 (2.28 ) 5.29 3.63 5.28 Return on Average Common Equity 5.27 (2.32 ) 5.40 3.71 5.39 Average Total Equity to Average Total Assets 15.29 15.63 15.10 15.39 14.25 Total capital 22.53 22.18 21.37 22.53 21.37 Common equity Tier 1 capital 18.96 18.62 17.77 18.96 17.77 Tier 1 capital 18.97 18.62 17.77 18.97 17.77 Leverage 14.03 13.96 13.70 14.03 13.70 Tangible common equity ratio (1) 14.65 14.63 14.34 14.65 14.34 Dividend payout ratio - - - - - Efficiency ratio (3) 62.05 60.51 58.24 62.77 62.07 Asset Quality: Allowance for loan and lease losses to loans held for investment (4) 2.62 2.60 2.31 2.62 2.31 Net charge-offs (annualized) to average loans (5)(6) 1.12 0.80 1.43 1.33 1.37 Provision for loan and lease losses to net charge-offs (7)(8)(9) 103.94 425.54 73.26 122.23 71.19 Non-performing assets to total assets 5.31 5.26 6.16 5.31 6.16 Non-performing loans held for investment to total loans held for investment 5.53 5.33 6.30 5.53 6.30 Allowance to total non-performing loans held for investment (10) 47.36 48.80 36.71 47.36 36.71 Allowance to total non-performing loans held for investment excluding residential real estate loans (11) 74.48 78.37 51.50 74.48 51.50 Other Information: Common Stock Price: End of period $ 5.10 $ 5.12 $ 6.61 $ 5.10 $ 6.61 1 - Non-GAAP financial measure. See page 20 for GAAP to Non-GAAP reconciliations.\n2 - On a tax-equivalent basis and excluding changes in the fair value of derivative instruments (Non-GAAP financial measure). See page 8 for GAAP to Non-GAAP\nreconciliations and refer to discussions in Tables 2 and 3 below. 3 - Non-interest expenses to the sum of net interest income and non-interest income. The denominator includes non-recurring income\nand changes in the fair value of derivative instruments. 4 - The ratio of the allowance for loan and lease losses to loans held for investment, excluding the storm-related allowance, was 1.85% as of both December 31, 2017 and September 30, 2017.\n5 - The ratio of net charge-offs to average loans, excluding charge-offs associated with the sale of the PREPA credit line, was 1.21% for the year ended December 31, 2017. 6 - The ratio of net charge-offs to average loans, excluding charge-offs associated with the sale of the $16.3 million pool of non-performing assets completed in the fourth quarter of 2016, was 1.22% and 1.32% for the quarter and year ended December 31, 2016, respectively. 7 - The ratio of the provision for loan and lease losses to net charge-offs, excluding the storm-related provision, was 95.82% and 48.35%, for the quarters ended December 31, 2017 and\nSeptember 30, 2017, respectively. 8 - The ratio of the provision for loan and lease losses to net charge-offs, excluding the storm-related provision and the impact of the sale of the PREPA credit line, was 69.36% for the\nyear ended December 31, 2017. 9 - The ratio of the provision for loan and lease losses to net charge-offs, excluding the impact of the sale of the $16.3 million pool of non-performing assets completed in the fourth quarter of 2016,\nwas 79.15% and 72.46% for the quarter and year ended December 31, 2016, respectively. 10 - The ratio of the allowance for loan and lease losses to non-performing loans held for investment, excluding the storm-related allowance, was 33.39% and 34.74% as of December 31, 2017 and September 30, 2017, respectively. 11 - The ratio of the allowance for loan and lease losses to non-performing loans held for investment excluding residential real estate and the storm-related allowance, was 52.52% and 55.80% as of December 31, 2017 and September 30, 2017, respectively. Table 2 – Quarterly Statement of Average Interest-Earning Assets and Average Interest-Bearing Liabilities (On a Tax-Equivalent Basis and Excluding Valuations)\n(Dollars in thousands) Average volume Interest income (1) / expense Average rate (1) December 31, September 30, December 31, December 31, September 30, December 31, December 31, September 30, December 31, Quarter ended 2017 2017 2016 2017 2017 2016 2017 2017 2016 Interest-earning assets: Money market & other short-term investments $ 658,760 $ 428,639 $ 291,703 $ 2,110 $ 1,293 $ 359 1.27 % 1.20 % 0.49 % Government obligations (2) 664,449 657,119 753,888 4,502 4,469 4,176 2.69 % 2.70 % 2.20 % Mortgage-backed securities 1,225,520 1,264,155 1,265,628 8,779 9,594 7,880 2.84 % 3.01 % 2.48 % FHLB stock 42,282 42,682 32,428 645 511 388 6.05 % 4.75 % 4.76 % Other investments 2,705 2,703 2,596 2 2 3 0.29 % 0.29 % 0.46 % Total investments (3) 2,593,716 2,395,298 2,346,243 16,038 15,869 12,806 2.45 % 2.63 % 2.17 % Residential mortgage loans 3,247,910 3,263,348 3,282,422 43,434 43,132 44,514 5.31 % 5.24 % 5.40 % Construction loans 140,660 134,842 134,795 1,077 1,219 1,240 3.04 % 3.59 % 3.66 % C&I and commercial mortgage loans 3,682,659 3,726,341 3,726,374 44,008 44,649 41,576 4.74 % 4.75 % 4.44 % Finance leases 250,867 244,149 229,843 4,545 4,346 4,304 7.19 % 7.06 % 7.45 % Consumer loans 1,483,940 1,486,726 1,486,660 41,574 41,927 42,005 11.12 % 11.19 % 11.24 % Total loans (4) (5) 8,806,036 8,855,406 8,860,094 134,638 135,273 133,639 6.07 % 6.06 % 6.00 % Total interest-earning assets $ 11,399,752 $ 11,250,704 $ 11,206,337 $ 150,676 $ 151,142 $ 146,445 5.24 % 5.33 % 5.20 % Interest-bearing liabilities: Brokered CDs $ 1,221,183 $ 1,244,355 $ 1,502,386 $ 4,963 $ 4,711 $ 4,887 1.61 % 1.50 % 1.29 % Other interest-bearing deposits 5,936,146 5,904,022 5,887,005 12,356 12,187 11,192 0.83 % 0.82 % 0.76 % Other borrowed funds 508,635 515,202 592,274 4,724 5,056 5,263 3.68 % 3.89 % 3.54 % FHLB advances 745,435 740,663 483,750 3,517 3,209 1,548 1.87 % 1.72 % 1.27 % Total interest-bearing liabilities $ 8,411,399 $ 8,404,242 $ 8,465,415 $ 25,560 $ 25,163 $ 22,890 1.21 % 1.19 % 1.08 % Net interest income $ 125,116 $ 125,979 $ 123,555 Interest rate spread 4.03 % 4.14 % 4.12 % Net interest margin 4.35 % 4.44 % 4.39 % 1 - On a tax-equivalent basis. The tax-equivalent yield was estimated by dividing the interest rate spread on exempt assets by 1 less the Puerto Rico statutory tax rate of 39%\nand adding to it the cost of interest-bearing liabilities. When adjusted to a tax-equivalent basis, yields on taxable and exempt assets are comparable. Changes in the fair value of derivative instruments are excluded from interest income because the changes in valuation do not affect interest paid or received. See page 8 for GAAP to Non-GAAP reconciliations. 2 - Government obligations include debt issued by government-sponsored agencies.\n3 - Unrealized gains and losses on available-for-sale securities are excluded from the average volumes.\n4 - Average loan balances include the average of non-performing loans.\n5 - Interest income on loans includes $0.9 million, $1.7 million and $2.3 million for the quarters ended December 31, 2017, September 30, 2017, and December 31, 2016, respectively, of income\nfrom prepayment penalties and late fees related to the Corporation's loan portfolio. Table 3 – Year-To-Date Statement of Average Interest-Earning Assets and Average Interest-Bearing Liabilities (On a Tax-Equivalent Basis and Excluding Valuations)\n(Dollars in thousands) Average volume Interest income (1) / expense Average rate (1) December 31, December 31, December 31,\nDecember 31,\nDecember 31,\nDecember 31,\nYear Ended 2017 2016 2017 2016 2017 2016 Interest-earning assets: Money market & other short-term investments $ 416,578 $ 667,838 $ 4,614 $ 3,365 1.11 % 0.50 % Government obligations (2) 687,076 746,890 17,807 20,849 2.59 % 2.79 % Mortgage-backed securities 1,278,968 1,357,518 42,476 38,072 3.32 % 2.80 % FHLB stock 40,458 31,449 2,105 1,454 5.20 % 4.62 % Other investments 2,702 1,963 8 8 0.30 % 0.41 % Total investments (3) 2,425,782 2,805,658 67,010 63,748 2.76 % 2.27 % Residential mortgage loans 3,260,715 3,302,519 174,524 180,051 5.35 % 5.45 % Construction loans 140,038 143,095 4,898 5,225 3.50 % 3.65 % C&I and commercial mortgage loans 3,723,356 3,694,988 172,082 160,329 4.62 % 4.34 % Finance leases 242,303 229,632 17,538 17,349 7.24 % 7.56 % Consumer loans 1,480,265 1,526,475 166,107 171,858 11.22 % 11.26 % Total loans (4) (5) 8,846,677 8,896,709 535,149 534,812 6.05 % 6.01 % Total interest-earning assets $ 11,272,459 $ 11,702,367 $ 602,159 $ 598,560 5.34 % 5.11 % Interest-bearing liabilities: Brokered CDs $ 1,296,479 $ 1,805,443 $ 19,174 $ 21,928 1.48 % 1.21 % Other interest-bearing deposits 5,908,424 5,944,742 47,363 45,374 0.80 % 0.76 % Other borrowed funds 514,035 833,283 19,195 27,908 3.73 % 3.35 % FHLB advances 680,975 460,861 11,140 5,964 1.64 % 1.29 % Total interest-bearing liabilities $ 8,399,913 $ 9,044,329 $ 96,872 $ 101,174 1.15 % 1.12 % Net interest income $ 505,287 $ 497,386 Interest rate spread 4.19 % 3.99 % Net interest margin 4.48 % 4.25 % 1 - On a tax-equivalent basis. The tax-equivalent yield was estimated by dividing the interest rate spread on exempt assets by 1 less the Puerto Rico statutory tax rate of 39%\nand adding to it the cost of interest-bearing liabilities. When adjusted to a tax-equivalent basis, yields on taxable and exempt assets are comparable. Changes in the fair value of derivative instruments are excluded from interest income because the changes in valuation do not affect interest paid or received. See page 8 for GAAP to Non-GAAP reconciliation. 2 - Government obligations include debt issued by government-sponsored agencies.\n3 - Unrealized gains and losses on available-for-sale securities are excluded from the average volumes.\n4 - Average loan balances include the average of non-performing loans.\n5 - Interest income on loans includes $6.7 million and $9.9 million for the years ended December 31, 2017 and 2016, respectively, of income\nfrom prepayment penalties and late fees related to the Corporation's loan portfolio. Table 4 – Non-Interest Income\nQuarter Ended Year Ended December 31,\nSeptember 30,\nDecember 31, December 31, December 31, (In thousands) 2017 2017 2016 2017 2016 Service charges on deposit accounts $ 4,924 $ 5,797 $ 5,759 $ 22,314 $ 22,965 Mortgage banking activities 1,912 3,117 5,304 13,491 20,435 Insurance income 1,378 1,377 2,298 8,197 8,473 Other operating income 6,736 6,963 8,653 28,854 30,900 Non-interest income before net gain (loss) on investments and gain on early extinguishment of debt 14,950 17,254 22,014 72,856 82,773 Net gain on sale of investments - - - 371 6,104 Gain from recovery of investments previously written off - - 1,547 - 1,547 OTTI on debt securities - - - (12,231 ) (6,687 ) Net gain (loss) on investments - - 1,547 (11,860 ) 964 Gain on early extinguishment of debt - 1,391 - 1,391 4,217 $ 14,950 $ 18,645 $ 23,561 $ 62,387 $ 87,954 Table 5 - Non-Interest Expenses Quarter Ended Year Ended December 31, September 30, December 31, December 31, December 31, (In thousands) 2017 2017 2016 2017 2016 Employees' compensation and benefits $ 37,655 $ 37,128 $ 37,652 $ 151,845 $ 151,493 Occupancy and equipment 15,067 13,745 14,045 56,659 55,159 Deposit insurance premium 3,054 3,179 3,920 13,725 20,055 Other insurance and supervisory fees 1,363 1,174 987 4,809 4,865 Taxes, other than income taxes 3,366 3,763 3,664 14,550 15,139 Professional fees: Collections, appraisals and other credit-related fees 2,341 2,295 2,344 9,160 9,890 Outsourcing technology services 5,088 5,403 5,435 21,243 20,264 Other professional fees 3,721 4,325 3,583 15,526 13,983 Credit and debit card processing expenses 3,078 3,737 3,533 13,212 13,635 Business promotion 2,768 3,244 199 12,485 11,419 Communications 1,374 1,603 1,515 6,148 6,759 Net loss on OREO operations 2,201 1,351 2,399 10,997 11,533 Other 4,060 4,667 4,960 17,342 20,886 Total $ 85,136 $ 85,614 $ 84,236 $ 347,701 $ 355,080 Table 6 – Selected Balance Sheet Data\n(In thousands) As of December 31,\nSeptember 30,\nDecember 31,\n2017 2017 2016 Balance Sheet Data: Loans, including loans held for sale $ 8,883,456 $ 8,904,790 $ 8,936,879 Allowance for loan and lease losses 231,843 230,870 205,603 Money market and investment securities 2,095,177 1,963,633 2,091,196 Intangible assets 42,351 43,429 46,754 Deferred tax asset, net 294,809 299,751 281,657 Total assets 12,261,268 12,173,648 11,922,455 Deposits 9,022,631 8,765,891 8,831,205 Borrowings 1,223,635 1,423,639 1,186,187 Total preferred equity 36,104 36,104 36,104 Total common equity 1,853,608 1,828,557 1,784,529 Accumulated other comprehensive loss, net of tax (20,615 ) (10,910 ) (34,390 ) Total equity 1,869,097 1,853,751 1,786,243 Table 7 – Loan Portfolio\nComposition of the loan portfolio including loans held for sale at period-end.\n(In thousands) As of December 31,\nSeptember 30, December 31, 2017 2017 2016 Residential mortgage loans $ 3,290,957 $ 3,274,340 $ 3,296,031 Commercial loans: Construction loans 111,397 129,460 124,951 Commercial mortgage loans 1,614,972 1,601,638 1,568,808 Commercial and Industrial loans 2,083,253 2,144,236 2,180,455 Commercial loans 3,809,622 3,875,334 3,874,214 Finance leases 257,462 246,084 233,335 Consumer loans 1,492,435 1,481,456 1,483,293 Loans held for investment 8,850,476 8,877,214 8,886,873 Loans held for sale 32,980 27,576 50,006 Total loans $ 8,883,456 $ 8,904,790 $ 8,936,879 Table 8 – Loan Portfolio by Geography\n(In thousands) As of December 31, 2017 Puerto Rico Virgin Islands United States Consolidated Residential mortgage loans $ 2,413,379 $ 282,738 $ 594,840 $ 3,290,957 Commercial loans: Construction loans 41,511 43,314 26,572 111,397 Commercial mortgage loans 1,127,409 95,464 392,099 1,614,972 Commercial and Industrial loans 1,373,714 116,323 593,216 2,083,253 Commercial loans 2,542,634 255,101 1,011,887 3,809,622 Finance leases 257,462 - - 257,462 Consumer loans 1,389,560 46,412 56,463 1,492,435 Loans held for investment 6,603,035 584,251 1,663,190 8,850,476 Loans held for sale 30,397 325 2,258 32,980 Total loans $ 6,633,432 $ 584,576 $ 1,665,448 $ 8,883,456 (In thousands) As of September 30, 2017 Puerto Rico Virgin Islands United States Consolidated Residential mortgage loans $ 2,396,557 $ 284,467 $ 593,316 $ 3,274,340 Commercial loans: Construction loans 51,107 44,011 34,342 129,460 Commercial mortgage loans 1,130,550 97,753 373,335 1,601,638 Commercial and Industrial loans 1,461,870 134,683 547,683 2,144,236 Commercial loans 2,643,527 276,447 955,360 3,875,334 Finance leases 246,084 - - 246,084 Consumer loans 1,377,820 47,453 56,183 1,481,456 Loans held for investment 6,663,988 608,367 1,604,859 8,877,214 Loans held for sale 23,038 169 4,369 27,576 Total loans $ 6,687,026 $ 608,536 $ 1,609,228 $ 8,904,790 (In thousands) As of December 31, 2016 Puerto Rico Virgin Islands United States Consolidated Residential mortgage loans $ 2,480,076 $ 314,915 $ 501,040 $ 3,296,031 Commercial loans: Construction loans 42,753 44,687 37,511 124,951 Commercial mortgage loans 1,177,550 79,365 311,893 1,568,808 Commercial and Industrial loans 1,571,097 139,795 469,563 2,180,455 Commercial loans 2,791,400 263,847 818,967 3,874,214 Finance leases 233,335 - - 233,335 Consumer loans 1,383,485 48,958 50,850 1,483,293 Loans held for investment 6,888,296 627,720 1,370,857 8,886,873 Loans held for sale 38,423 - 11,583 50,006 Total loans $ 6,926,719 $ 627,720 $ 1,382,440 $ 8,936,879 Table 9 – Non-Performing Assets\nAs of (Dollars in thousands) December 31,\nSeptember 30,\nDecember 31, 2017 2017 2016 Non-performing loans held for investment: Residential mortgage $ 178,291 $ 178,530 $ 160,867 Commercial mortgage 156,493 137,059 178,696 Commercial and Industrial 85,839 84,317 146,599 Construction 52,113 46,720 49,852 Consumer and Finance leases 16,818 26,506 24,080 Total non-performing loans held for investment 489,554 473,132 560,094 OREO 147,940 152,977 137,681 Other repossessed property 4,802 6,320 7,300 Other assets (1) - - 21,362 Total non-performing assets, excluding loans held for sale $ 642,296 $ 632,429 $ 726,437 Non-performing loans held for sale 8,290 8,290 8,079 Total non-performing assets, including loans held for sale (2) $ 650,586 $ 640,719 $ 734,516 Past-due loans 90 days and still accruing (3) $ 160,725 $ 140,656 $ 135,808 Allowance for loan and lease losses $ 231,843 $ 230,870 $ 205,603 Allowance to total non-performing loans held for investment (4) 47.36 % 48.80 % 36.71 % Allowance to total non-performing loans held for investment, excluding residential real estate loans (5) 74.48 % 78.37 % 51.50 % (1) Fair market value of bonds of the GDB and the Puerto Rico Public Buildings Authority prior to the sale completed during the second quarter of 2017.\n(2) Purchased credit impaired loans of $158.2 million accounted for under ASC 310-30 as of December 31, 2017, primarily mortgage loans acquired from Doral Bank in the first quarter of 2015\nand from Doral Financial in the second quarter of 2014, are excluded and not considered non-performing due to the application of the accretion method, under which these loans will accrete interest income over the remaining life of the loans using estimated cash flow analysis. (3) Amount includes purchased credit impaired loans with individual delinquencies over 90 days and still accruing with a carrying value as of December 31, 2017 of approximately $29.3 million,\nprimarily related to loans acquired from Doral Bank in the first quarter of 2015 and from Doral Financial in the second quarter of 2014. (4) The ratio of the allowance for loan and lease losses to non-performing loans held for investment, excluding the storm-related allowance, was 33.39% and 34.74% as of December 31, 2017\nand September 30, 2017, respectively. (5) The ratio of the allowance for loan and lease losses to non-performing loans held for investment excluding residential real estate and the storm-related allowance, was 52.52% and 55.80% as of December 31, 2017 and September 30, 2017, respectively. Table 10– Non-Performing Assets by Geography\nAs of (In thousands) December 31, September 30, December 31, 2017 2017 2016 Puerto Rico: Non-performing loans held for investment:\nResidential mortgage $ 147,852 $ 148,984 $ 135,863 Commercial mortgage 128,232 124,450 167,241 Commercial and Industrial 79,809 78,235 141,916 Construction 14,506 9,297 10,227 Finance leases 1,237 1,888 1,335 Consumer 14,885 23,617 21,592 Total non-performing loans held for investment 386,521 386,471 478,174 OREO 140,063 145,005 128,395 Other repossessed property 4,723 6,161 7,217 Other assets (1) - - 21,362 Total non-performing assets, excluding loans held for sale $ 531,307 $ 537,637 $ 635,148 Non-performing loans held for sale 8,290 8,290 8,079 Total non-performing assets, including loans held for sale (2) $ 539,597 $ 545,927 $ 643,227 Past-due loans 90 days and still accruing (3) $ 151,724 $ 135,194 $ 131,783 Virgin Islands: Non-performing loans held for investment: Residential mortgage $ 22,110 $ 20,517 $ 19,860 Commercial mortgage 25,309 9,545 7,617 Commercial and Industrial 6,030 6,082 4,683 Construction 37,607 37,352 39,625 Consumer 281 609 452 Total non-performing loans held for investment 91,337 74,105 72,237 OREO 6,306 6,306 6,216 Other repossessed property 26 42 5 Total non-performing assets, excluding loans held for sale $ 97,669 $ 80,453 $ 78,458 Non-performing loans held for sale - - - Total non-performing assets, including loans held for sale $ 97,669 $ 80,453 $ 78,458 Past-due loans 90 days and still accruing $ 9,001 $ 5,462 $ 2,133 United States: Non-performing loans held for investment: Residential mortgage $ 8,329 $ 9,029 $ 5,144 Commercial mortgage 2,952 3,064 3,838 Construction - 71 - Consumer 415 392 701 Total non-performing loans held for investment 11,696 12,556 9,683 OREO 1,571 1,666 3,070 Other repossessed property 53 117 78 Total non-performing assets, excluding loans held for sale $ 13,320 $ 14,339 $ 12,831 Non-performing loans held for sale - - - Total non-performing assets, including loans held for sale $ 13,320 $ 14,339 $ 12,831 Past-due loans 90 days and still accruing $ - $ - $ 1,892\n(1) Fair market value of bonds of the GDB and the Puerto Rico Public Buildings Authority prior to the sale completed during the second quarter of 2017.\n(2) Purchased credit impaired loans of $158.2 million accounted for under ASC 310-30 as of December 31, 2017, primarily mortgage loans acquired\nfrom Doral Bank in the first quarter of 2015 and from Doral Financial in the second quarter of 2014, are excluded and not considered non-performing due to the application of the accretion method, under which these loans will accrete interest income over the remaining life\nof the loans using estimated cash flow analysis. (3) Amount includes purchased credit impaired loans with individual delinquencies over 90 days and still accruing with a carrying value\nas of December 31, 2017 of approximately $29.3 million, primarily related to loans acquired from Doral Bank in the first quarter of 2015 and from Doral Financial in the second quarter of 2014. Table 11 – Allowance for Loan and Lease Losses\nQuarter Ended Year Ended (Dollars in thousands) December 31, September 30, December 31, December 31, December 31, 2017 2017 2016 2017 2016 Allowance for loan and lease losses, beginning of period $ 230,870 $ 173,485 $ 214,070 $ 205,603 $ 240,710 Provision for loan and lease losses 25,703 (1 ) 75,013 (2 ) 23,191 (3 ) 144,254 (7 ) 86,733 (3 ) Net (charge-offs) recoveries of loans: Residential mortgage (5,341 ) (6,856 ) (5,487 ) (25,749 ) (30,680 ) Commercial mortgage (6,850 ) (223 ) (4,310 ) (4 ) (38,822 ) (19,638 ) (4 ) Commercial and Industrial (545 ) (624 ) (9,515 ) (5 ) (14,100 ) (8 ) (23,890 ) (5 ) Construction (2,764 ) (31 ) (1,132 ) (2,875 ) (1,454 ) Consumer and finance leases (9,230 ) (9,894 ) (11,214 ) (36,468 ) (46,178 ) Net charge-offs (24,730 ) (17,628 ) (31,658 ) (6 ) (118,014 ) (121,840 ) (6 ) Allowance for loan and lease losses, end of period $ 231,843 $ 230,870 $ 205,603 $ 231,843 $ 205,603 Allowance for loan and lease losses to period end total loans held for investment (9) 2.62 % 2.60 % 2.31 % 2.62 % 2.31 % Net charge-offs (annualized) to average loans outstanding during the period 1.12 % 0.80 % 1.43 % 1.33 % 1.37 % Net charge-offs (annualized), excluding charge-offs of $10.7 million related to the sale of the PREPA credit line in the first quarter of 2017 and net charge-offs of $4.6 million related to the sale of the $16.3 million pool of non-performing assets in the fourth quarter of 2016, to average loans outstanding during the period 1.12 % 0.80 % 1.22 % 1.21 % 1.32 % Provision for loan and lease losses to net charge-offs during the period 1.04x 4.26x 0.73x 1.22x 0.71x Provision for loan and lease losses to net charge-offs during the period, excluding impact of the storm-related provision in the fourth and third quarters of 2017, the impact of the sale of the PREPA credit line in the first quarter of 2017, and the sale of the $16.3 million pool of non-performing assets in the fourth quarter of 2016 0.96x 0.48x 0.79x 0.69x 0.72x (1) Includes a provision of $4.8 million associated with the impact of Hurricanes Irma and Maria.\n(2) Includes a provision of $66.5 million associated with the impact of Hurricanes Irma and Maria. (3) Includes a provision of $1.8 million associated with the sale of the $16.3 million pool of non-performing assets.\n(4) Includes net charge-offs totaling $3.0 million associated with the sale of the $16.3 million pool of non-performing assets.\n(5) Includes net charge-offs totaling $1.6 million associated with the sale of the $16.3 million pool of non-performing assets.\n(6) Includes net charge-offs totaling $4.6 million associated with the sale of the $16.3 million pool of non-performing assets.\n(7) Includes a provision of $71.3 million associated with the impact of Hurricanes Irma and Maria and a provision of $0.6 million associated with the sale of the PREPA credit line.\n(8) Includes the charge-off of $10.7 million associated with the sale of the PREPA credit line.\n(9) The ratio of allowance for loan and lease losses to total loans held for investment, excluding the storm-related allowance, was 1.85% as of both December 31, 2017 and September 30, 2017.\nTable 12 – Net Charge-Offs to Average Loans\nYear Ended December 31, December 31, December 31, December 31, December 31, 2017 2016 2015 2014 2013 Residential mortgage 0.79% 0.93% 0.55% 0.85% 4.77% (12) Commercial mortgage 2.42% 1.28% (3) 3.12% (6) 0.84% 3.44% (13) Commercial and Industrial 0.66% (1) 1.11% (4) 1.32% (7) 2.27% (10) 3.70% (14) Construction 2.05% 1.02% 1.42% (8) 2.76% 15.11% (15) Consumer and finance leases 2.12% 2.63% 2.85% 3.46% 2.76% Total loans 1.33% (2) 1.37% (5) 1.68% (9) 1.84% (11) 4.07% (16) (1) Includes the charge-off of $10.7 million associated with the sale of the PREPA credit line. The ratio of commercial and industrial net charge-offs to average loans, excluding charge-offs associated with the sale of the PREPA credit line, was 0.16%. (2) Includes the charge-off of $10.7 million associated with the sale of the PREPA credit line. The ratio of total net charge-offs to average loans, excluding charge-offs associated with the sale of the PREPA credit line, was 1.21%. (3) Includes net charge-offs totaling $3.0 million associated with the sale of the $16.3 million pool of non-performing assets in 2016. The ratio of commercial mortgage net charge-offs to average loans, excluding charge-offs associated with the sale of the $16.3 million pool of non-performing assets, was 1.09%. (4) Includes net charge-offs totaling $1.6 million associated with the sale of the $16.3 million pool of non-performing assets. The ratio of commercial and industrial net charge-offs to average loans, excluding charge-offs associated with the sale of the $16.3 million pool of non-performing assets, was 1.04%. (5) Includes net charge-offs totaling $4.6 million associated with the sale of the $16.3 million pool of non-performing assets. The ratio of total charge-offs to average loans, excluding charge-offs associated with the sale of the $16.3 million pool of non-performing assets, was 1.32%. (6) Includes net charge-offs totaling $37.6 million associated with a bulk sale of assets. The ratio of commercial mortgage net charge-offs to average loans, excluding charge-offs associated with the bulk sale of assets, was 0.77%. (7) Includes net charge-offs totaling $20.6 million associated with the bulk sale of assets. The ratio of commercial and industrial net charge-offs to average loans, excluding charge-offs associated with the bulk sale of assets, was 0.40%. (8) Includes net charge-offs totaling $3.3 million associated with the bulk sale of assets. The ratio of construction net charge-offs to average loans, excluding charge-offs associated with the bulk sale of assets, was (0.52)%. (9) Includes net charge-offs totaling $61.4 million associated with the bulk sale of assets. The ratio of total charge-offs to average loans, excluding charge-offs associated with the bulk sale of assets, was 1.01%. (10) Includes net charge-offs totaling $6.9 million associated with an acquisition of mortgage loans from Doral Financial. The ratio of commercial and industrial net charge-offs to average loans, excluding charge-offs associated with the acquisition of mortgage loans from Doral Financial, was 2.08%. (11 Includes net charge-offs totaling $6.9 million associated with the acquisition of mortgage loans from Doral Financial. The ratio of total net charge-offs to average loans, excluding charge-offs associated with the acquisition of mortgage loans from Doral Financial, was 1.77%. (12) Includes net charge-offs totaling $99.0 million associated with a bulk sale of non-performing residential assets. The ratio of residential mortgage net charge-offs to average loans, excluding charge-offs associated with the bulk sale of non-performing residential assets in 2013, was 1.13%. (13) Includes net charge-offs totaling $54.6 million associated with a bulk sale of adversely classified commercial assets and a transfer of loans to held for sale. The ratio of commercial mortgage net charge-offs to average loans, excluding charge-offs associated with the bulk sale of adversely classified commercial assets and the transfer of loans to held for sale, was 0.45%. (14) Includes net charge-offs totaling $44.7 million associated with the bulk sale of adversely classified commercial assets. The ratio of commercial and industrial net charge-offs to average loans, excluding charge-offs associated with the bulk sale of adversely classified commercial assets, was 2.15%. (15) Includes net charge-offs totaling $34.2 million associated with the bulk sale of adversely classified commercial assets and the transfer of loans to held for sale. The ratio of construction loan net charge-offs to average loans, excluding charge-offs associated with the bulk loan sales and the transfer of loans to held for sale, was 2.91%. (16) Includes net charge-offs totaling $232.4 million associated with the bulk loan sales and the transfer of loans to held for sale. The ratio of total net charge-offs to average loans, excluding charge-offs associated with the bulk loan sales and the transfer of loans to held for sale, was 1.70%.\nView source version on businesswire.com: http://www.businesswire.com/news/home/20180129005290/en/\nFirst BanCorp.\nJohn B. Pelling III, 787-729-8003\nInvestor Relations Officer\njohn.pelling@firstbankpr.com\nSource: First BanCorp.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.1firstbank.com&esheet=51749860&newsitemid=20180129005290&lan=en-US&anchor=www.1firstbank.com&index=3&md5=5ce173ff11e27570cbec76a705efeae2", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.1firstbank.com&esheet=51749860&newsitemid=20180129005290&lan=en-US&anchor=www.1firstbank.com&index=1&md5=83c5eedc80e650351016742900dac716", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.1firstbank.com&esheet=51749860&newsitemid=20180129005290&lan=en-US&anchor=www.1firstbank.com&index=2&md5=19a83e1af7045490da7e310d01b2ec3a", "http://www.businesswire.com/news/home/20180129005290/en/"], "published": "2018-01-29T15:00:00.000+02:00", "crawled": "2018-01-29T16:50:33.007+02:00", "highlightTitle": ""}