{"organizations": [], "uuid": "bed1e9f308b089561d67dfc5374e7ccea1204103", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225277987&w=1200&r=LYNXMPEE0O1O9", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-carillion-collapse-ireland/irish-schools-count-cost-of-collapse-of-britains-carillion-idUKKBN1FE324", "country": "US", "domain_rank": 408, "title": "Irish schools count cost of collapse of Britain's Carillion", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T23:34:00.000+02:00", "replies_count": 0, "uuid": "bed1e9f308b089561d67dfc5374e7ccea1204103"}, "author": "", "url": "https://uk.reuters.com/article/uk-carillion-collapse-ireland/irish-schools-count-cost-of-collapse-of-britains-carillion-idUKKBN1FE324", "ord_in_thread": 0, "title": "Irish schools count cost of collapse of Britain's Carillion", "locations": [], "entities": {"persons": [{"name": "carillion clodagh", "sentiment": "negative"}, {"name": "colaiste raithin", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}, {"name": "leo varadkar", "sentiment": "none"}, {"name": "gearoid o’ ciarain", "sentiment": "none"}, {"name": "kilcoyne", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "bray", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}], "organizations": [{"name": "ppp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 35 PM / Updated 16 minutes ago Irish schools count cost of collapse of Britain's Carillion Clodagh Kilcoyne 3 Min Read \nBRAY, Ireland (Reuters) - The completion of new buildings at six schools in Ireland will be delayed by several weeks due to the collapse of British construction outsourcing company Carillion ( CLLN.L ), the government said. \nCarillion, which built roads, hospitals and ran a host of public services in Britain, collapsed on Jan. 15 after costly contract delays and a slump in new business left it swamped by debt and pensions liabilities of at least 2.2 billion pounds. \nIn Ireland, Carillion was part of a consortium - via a state-run public-private partnership (PPP) - in the construction, finance and maintenance of buildings at six schools. The government said the buildings were 90 percent complete. \nPrime Minister Leo Varadkar said it would take a few weeks to resolve matters so pupils could move from old buildings. \nGearoid O’ Ciarain, principal at one of the schools, Colaiste Raithin in Bray on the outskirts of Dublin, said the move from old buildings was supposed to have happened two months ago. Slideshow (2 Images) \n“It just seems a terrible pity that there is a brand new building lying idle up there, the gates locked around it, we are really in terrible need of it and we can’t use it,” O’ Ciarain told Reuters. \nHe said his school had added an extra class in the academic year that began in September because it expected the new building to be complete by November. \nO’ Ciarain, who said work on site slowed from October, said the delays meant 12 and 13-year-old’s studying cooking, for example, would have to be taught without the use of kitchens. \nThe National Development Finance Agency (NDFA), the state agency that manages PPPs, said its contracts included detailed provisions that applied in the event of the liquidation of a consortium member to ensure the projects were completed. \nThe PPP consortium’s funders and remaining shareholders were required to intervene and implement rectification measures, it said, meaning the state was not obliged to make further payment until the full works and service were delivered. \nThe joint partner in the projects, independent fund manager Dutch Infrastructure Fund (DIF), pledged to resolve the situation as quickly as possible, Varadkar said. Writing by Padraic Halpin in Dublin; Editing by Edmund Blair", "external_links": [], "published": "2018-01-25T23:34:00.000+02:00", "crawled": "2018-01-25T23:53:49.005+02:00", "highlightTitle": ""}