{"organizations": [], "uuid": "967286507ff02da2e2e2a10658fc2e4bce9d7bac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104951567-GettyImages-904054612.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/17/asia-markets-china-gdp-data-and-central-banks-in-focus.html", "country": "US", "domain_rank": 767, "title": "Asia markets: China GDP data and central banks in focus", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T01:47:00.000+02:00", "replies_count": 0, "uuid": "967286507ff02da2e2e2a10658fc2e4bce9d7bac"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/17/asia-markets-china-gdp-data-and-central-banks-in-focus.html", "ord_in_thread": 0, "title": "Asia markets: China GDP data and central banks in focus", "locations": [], "entities": {"persons": [], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "osaka", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "asx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stock indexes in Asia closed mixed after the Nikkei 225 gave up early gains late in the session. Investors also digested a raft of China data released as mainland markets closed.\nTokyo's benchmark Nikkei 225 index declined 0.44 percent, or 104.97 points, to close at 23,763.37 as the index turned lower in the afternoon despite earlier recording a fresh 26-year high. Financials finished the session in negative territory, with Mizuho Financial Group closing down 1.83 percent. \nOf note, index heavyweights SoftBank Group and Fanuc fell 1.24 percent and 1.33 percent, respectively. Fast Retailing, another heavily-weighted constituent of the index, rose 0.34 percent as other retail names saw declines.\nShares of Nintendo closed up 2.36 percent on the same day the company introduced the new Nintendo Labo. The Nintendo Labo is a do-it-yourself cardboard kit intended to be used with the Nintendo Switch console.\nSymbol Name Price   Change %Change NIKKEI --- HSI --- ASX 200 --- SHANGHAI --- KOSPI --- CNBC 100 --- In Seoul, the Kospi tacked on 0.02 percent to end at 2,515.81. Samsung Electronics bounced 0.56 percent after recording losses in the last session. Rival chipmaker SK Hynix also saw gains, climbing 1.48 percent by the end of the day. Lotte Shopping fell 1.49 percent as other retail sector stocks traded mixed.\nThe Bank of Korea on Thursday held interest rates steady at 1.5 percent, as was mostly expected. The central bank was seen as likely to stand on the sidelines due to tighter monetary conditions driven by strength in the Korean won, Trinh Nguyen, senior economist at Natixis, said in a Wednesday note.\nOver in Sydney, the S&P/ASX 200 finished lower by 0.02 percent at 6,014.6 as gains in the heavily weighted financials sector were offset by losses in energy-linked stocks and gold producers. \nHong Kong's Hang Seng Index rose 0.47 percent at 3:14 p.m. HK/SIN after recording its second straight record close in the last session. Financials were most higher, with HSBC rising 0.53 percent and China Construction Bank advancing 2.69 percent. Property developers traded in negative territory in the afternoon, with Country Garden falling 1.55 percent by 3:18 p.m. HK/SIN.\nMainland stocks closed at their highest levels in two years, according to Reuters. The Shanghai composite advanced 0.91 percent to close at 3,475.91 and the Shenzhen composite added 0.13 percent to end at 1,924.2. T he blue chip CSI 300 index closed 0.58 percent higher as banking shares extended gains, with Industrial and Commercial Bank of China closing 6.25 percent higher.\nChina data released after the market close showed the economy grew 6.9 percent last year , above the official target of around 6.5 percent. Other numbers released in the afternoon were mixed: December retail sales rose 9.4 percent on year, missing the 10.1 percent forecast in a Reuters poll, but industrial output topped estimates. \nOn the corporate earnings front, Taiwan's TSMC announced that its fourth-quarter net profit came in at 99.29 billion Taiwan dollars ($3.4 billion) — 0.9 percent less than the year-ago period. The figure, however, came in slightly above the T$97.78 billion forecast in a Thomson Reuters I/B/E/S poll. \nU.S. stocks closed higher , with the Dow Jones industrial average advancing 322.79 points to finish above the 26,000 level for the first time.\nOther major stock indexes stateside also saw gains after the release of expectation-topping earnings from several U.S. corporates. U.S. investors also awaited developments related to a potential government shutdown should Congress fail to pass a funding bill by Friday.\nDollar pares gains Meanwhile, the dollar pared some gains against a basket of currencies. The dollar index stood at 90.782 at 2:52 p.m. HK/SIN, below Wednesday's close of 90.983.\nAgainst the yen, the greenback traded at 111.20, after rising as high as 111.48 earlier in the session. \nThe euro edged up to trade at $1.2201 on Thursday after earlier falling as low as $1.2163. The common currency had retreated from a three-year high overnight after several European Central Bank officials on Wednesday noted their concerns over recent strength in the currency.\nMeanwhile, bitcoin appeared to steady after a wild ride last session, which saw the cryptocurrency falling for a time below the $10,000 mark. \nThe digital currency tumbled as low as $9,199.59 on Wednesday before paring some losses trade at $11,204.30 at 2:54 p.m. HK/SIN, according to industry site CoinDesk. That's around 43 percent below its all-time high hit in December.\nThe move lower came after South Korea's finance minister said this week that the shutdown of cryptocurrency exchanges was an option it was still considering. A Bloomberg report earlier in the week also said China intended to clampdown on the centralized trading of cryptocurrencies.", "external_links": [], "published": "2018-01-18T01:47:00.000+02:00", "crawled": "2018-01-18T02:03:39.018+02:00", "highlightTitle": ""}