{"organizations": [], "uuid": "df5a3b00cda00c6b3743c3e496dfda36b6aa3d52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1209}, "facebook": {"likes": 155, "shares": 155, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/04/104877783-GettyImages-450831338.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/19/amazon-hired-seattles-martin-levine-from-iora-to-add-to-health-group.html", "country": "US", "domain_rank": 767, "title": "Amazon hired Seattle's Martin Levine from Iora to add to health group", "performance_score": 1, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:14:00.000+02:00", "replies_count": 0, "uuid": "df5a3b00cda00c6b3743c3e496dfda36b6aa3d52"}, "author": "Christina Farr", "url": "https://www.cnbc.com/2018/01/19/amazon-hired-seattles-martin-levine-from-iora-to-add-to-health-group.html", "ord_in_thread": 0, "title": "Amazon hired Seattle's Martin Levine from Iora to add to health group", "locations": [], "entities": {"persons": [{"name": "martin levine", "sentiment": "negative"}, {"name": "levine", "sentiment": "none"}, {"name": "missy krasner", "sentiment": "none"}, {"name": "krasner", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "iora", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "linkedin", "sentiment": "none"}, {"name": "medicare", "sentiment": "none"}, {"name": "iora health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images Amazon.com founder and CEO Jeff Bezos. \nAmazon has hired a top Seattle doctor in its latest push into health care, according to two people familiar with the matter. \nMartin Levine of Iora Health , which focuses on Medicare patients in six U.S. markets, is one of Amazon's most high-profile hires to date in health. It's not yet certain what Levine's role at the company will be, said the sources, who asked not to be named because no announcement has been made. \nLevine, a geriatrician who has focused on treating elderly patients with complex medical conditions, could be joining Amazon's internal health-care group known as 1492 , which is testing a variety of secretive projects. \nAmazon didn't immediately respond to a request for comment. We tried to contact Levine through LinkedIn and haven't heard back. \nLast year, Amazon recruited health-technology expert Missy Krasner from Box. Krasner works on \"special projects\" at Amazon, according to her LinkedIn profile . \nAmazon has also long been interested in learning about innovative health-care models. The company convened a secret meeting in Seattle a year ago with a group of executives that had rolled out creative approaches to patient care. show chapters 6:12 PM ET Wed, 26 July 2017 | 01:22 \nA half-dozen people outside of Amazon were in attendance, including representatives from Iora, Kaiser Permanente, and Qliance, a primary care group with funding from Amazon CEO Jeff Bezos that shut down in May of 2017, one source said. \nIora has long been a standard-bearer for better primary care, which it achieves by investing in customer service. Its practices accept patients through an employer or a private Medicare plan. Most of these groups are looking to cut down on their health care costs. \nIora has raised more than $124 million in venture capital from a mix of technology and health investors. \nLevine spent four years at Iora, according to LinkedIn . In the position of market medical director, he treated patients and also supervised a chain of clinics, designed the health plan and helped managed a team of about 45 staff. \nOne potential role for Levine at Amazon might be to investigate whether the company should invest in new forms of primary care for its own employees. Whole Foods, which Amazon acquired last year, once explored getting into the health clinic space. CEO John Mackey told Bloomberg that he saw healthy food as key to solving American's health care problems. \n\"Many smart employers over the last several years have developed an onsite or near-site clinic,\" said Dave Chase, a Seattle-based health investor and an expert in employer health benefits. Chase said a clinic that served Whole Foods and Amazon employees would make \"economic sense.\" Christina Farr Reporter for CNBC.com Related Securities ", "external_links": [], "published": "2018-01-20T00:14:00.000+02:00", "crawled": "2018-01-20T00:24:45.016+02:00", "highlightTitle": ""}