{"organizations": [], "uuid": "0876d3772c15186e5cc5ac0bc28a771170fab5d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-kyrgios/update-1-tennis-kyrgios-takes-down-idol-tsonga-to-reach-fourth-round-idUKL8N1PE2XT", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Tennis-Kyrgios takes down idol Tsonga to reach fourth round", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:38:00.000+02:00", "replies_count": 0, "uuid": "0876d3772c15186e5cc5ac0bc28a771170fab5d7"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-kyrgios/update-1-tennis-kyrgios-takes-down-idol-tsonga-to-reach-fourth-round-idUKL8N1PE2XT", "ord_in_thread": 0, "title": "UPDATE 1-Tennis-Kyrgios takes down idol Tsonga to reach fourth round", "locations": [], "entities": {"persons": [{"name": "tsonga", "sentiment": "negative"}, {"name": "rod laver", "sentiment": "none"}, {"name": "will smith", "sentiment": "none"}, {"name": "nick kyrgios", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}, {"name": "kyrgios", "sentiment": "none"}, {"name": "jo-wilfried tsonga", "sentiment": "none"}], "locations": [{"name": "hisense arena", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 2:41 PM / Updated 24 minutes ago UPDATE 1-Tennis-Kyrgios takes down idol Tsonga to reach fourth round Reuters Staff \n* Kyrgios rock solid in tiebreaks \n* Tsonga rages at chirpy fan (Adds details, quotes) \nBy Ian Ransom \nMELBOURNE, Jan 19 (Reuters) - Nick Kyrgios toppled his childhood idol Jo-Wilfried Tsonga to bury his Rod Laver Arena hoodoo and reach the fourth round of his home Australian Open on Friday. \nAway from his favoured Hisense Arena where he draws energy from the raucous atmosphere, the 17th seed reined supreme in the tiebreaks, downing former finalist Tsonga 7-6(5) 4-6 7-6(6) 7-6(5) on the floodlit centre court. \n“I knew it was going to be an incredibly tough match. I was very nervous going out there today,” Kyrgios told reporters after a riveting clash lasting three hours and 17 minutes. \n“I knew my best chance was probably to get in a couple breakers... Tiebreaks kind of favour the big server.” \nWith men’s great Rod Laver and Hollywood actor Will Smith in the terraces, Kyrgios grabbed his first win in front of fans in the posh seats, raising hopes among the locals he might return there for the title match in nine days. \nAustralia has waited 42 years for a new men’s champion, so expectations will rise again following Kyrgios’s impressive four-set win, a third successive match without a major meltdown for the hot-headed 22-year-old. \nAs the only native left in the draw, Kyrgios will carry the hopes of a nation into a blockbuster clash against Grigor Dimitrov, another supreme talent desperate to prove his major credentials. FRUSTRATIONS \nThe centre court pressure against the formidable Frenchman was a test of Kyrgios’s emotions and his frustrations did threaten to boil over on occasion. \nAfter being broken in the second set, he returned to his chair fuming and yelled a foul-mouthed lament for playing a match in the doubles tournament on Thursday instead of resting on a day of scorching heat. \nHeavy-legged, he lost the set to his childhood hero, who once signed autographs for a 12-year-old Kyrgios during his run to the 2008 final at Melbourne Park. \nKyrgios recovered from the setback but couldn’t breach Tsonga’s serve and was left repeatedly flat-footed by the 15th seed’s exquisite volleying. \nBut he raised his game again in the clinches of the tiebreak, pounding a return at set point that ricocheted harmlessly off Tsonga’s racquet. \nIt was the Frenchman’s turn to grow testy and he took great exception to a heckler in the crowd after Kyrgios served out the opening game of the fourth set to love. \nYelling in French at the offending fan, Tsonga ignored the chair umpire’s warnings to calm down and was given a code violation for unsportsmanlike conduct. \n“The guy was talking to me and telling me, ‘you are under pressure now, you are under pressure now’, when I was bouncing my balls,” Tsonga told reporters. \n“That’s it. I lost it and I drive a little bit crazy.” \nThe squall passed quickly, though, and he knuckled down to take Kyrgios into a third tiebreak, storming to a 5-2 lead after another charge to the net. \nBut the Australian roared back brilliantly, raising a match point by reeling Tsonga forward with a deftly placed drop shot and volleying his scooped recovery into an open court. \nWith tension at fever pitch, Tsonga surrendered by netting a forehand, leaving Kyrgios to soak up thunderous cheers. (Editing by Kevin Liffey and Christian Radnedge)", "external_links": [], "published": "2018-01-19T16:38:00.000+02:00", "crawled": "2018-01-19T17:13:23.012+02:00", "highlightTitle": ""}