{"organizations": [], "uuid": "d7cecf09bec863118bb88434d61de75b73ab4b0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-natgas/u-s-weekly-natgas-stock-draw-hits-record-high-during-cold-snap-idUSL1N1P613Z", "country": "US", "domain_rank": 408, "title": "U.S. weekly natgas stock draw hits record high during cold snap", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-12T00:20:00.000+02:00", "replies_count": 0, "uuid": "d7cecf09bec863118bb88434d61de75b73ab4b0a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-natgas/u-s-weekly-natgas-stock-draw-hits-record-high-during-cold-snap-idUSL1N1P613Z", "ord_in_thread": 0, "title": "U.S. weekly natgas stock draw hits record high during cold snap", "locations": [], "entities": {"persons": [{"name": "fahr", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "southeast", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. energy information administration", "sentiment": "none"}, {"name": "eia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 11 (Reuters) - U.S. utilities pulled a record 359 billion cubic feet (bcf) of natural gas from storage during the brutally cold week ended Jan. 5, the U.S. Energy Information Administration (EIA) said on Thursday.\nThat was the biggest weekly withdrawal ever, according to federal energy data going back to 1994, topping the previous weekly record decline of 288 bcf in January 2014 during the polar vortex winter.\nIt also easily surpassed the 333-bcf withdrawal analysts forecast for the week in a Reuters poll and compares with a decline of 151 bcf a year earlier and a five-year average decrease of 162 bcf.\nTemperatures last week were well below normal for this time of year as a rare type of winter storm hit the Southeast, dumping snow on Florida’s capital for the first time in three decades and a powerful blizzard battered the Northeast.\nThere were 287 heating degree days (HDD) last week. That compared with 187 HDDs in the same week last year and a 30-year normal of 201 HDDs for this time of year.\nHDDs measure the number of degrees a day’s average temperature is below 65 degrees Fahrenheit (18 degrees Celsius). The measure is used to estimate demand to heat homes and businesses.\nThe reduction last week cut stockpiles to 2.767 trillion cubic feet, 12.1 percent below the 3.149 tcf five-year average for this time of year and the lowest total gas in storage for that week since 2008.\nTraders, however, said supplies were more than adequate to meet heating demand this winter, especially if production remains near record highs and the latest weather forecasts for the rest of the season are correct.\nDespite the brutal freeze at the start of the year, the National Weather Service (NWS) has forecast that U.S. temperatures will remain mostly seasonal for the rest of the winter.\nThe NWS projected heating degree days (HDDs) would total 1,569 during in January and February. That compares with just 1,314 HDDs during the same period in the unusually warm winter of 2017 and a 10-year average of 1,598. (Reporting by Scott DiSavino; Editing by Marguerita Choy)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T00:20:00.000+02:00", "crawled": "2018-01-12T18:30:44.006+02:00", "highlightTitle": ""}