{"organizations": [], "uuid": "34b175fcb4c9943f16859f0951dafadfc6842c74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-vencore-labs-anthony-triolo-ph-d-appointed-to-nsc-executive-committee.html", "country": "US", "domain_rank": 767, "title": "Vencore Labs' Anthony Triolo, Ph.D., Appointed To NSC Executive Committee", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T22:00:00.000+02:00", "replies_count": 0, "uuid": "34b175fcb4c9943f16859f0951dafadfc6842c74"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-vencore-labs-anthony-triolo-ph-d-appointed-to-nsc-executive-committee.html", "ord_in_thread": 0, "title": "Vencore Labs' Anthony Triolo, Ph.D., Appointed To NSC Executive Committee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHANTILLY, Va., Jan. 8, 2018 /PRNewswire/ -- Vencore, Inc. announced today chief scientist and senior manager at Vencore Labs, Anthony Triolo, Ph.D., was appointed to National Spectrum Consortium's (NSC) executive committee as a representative of the large company sector.\nThe NSC is a spectrum industry consortium collaborating with multiple government agencies through a five-year, $1.25 billion, Section 815 Prototype Other Transaction Agreement (OTA) with the Office of the Deputy Assistant Secretary of Defense (ODASD), Emerging Capabilities and Prototyping (EC&P). The NSC's mission is to provide opportunities for collaboration between industry, government, and academia to help foster development of technologies that will allow more efficient use of the wireless spectrum. The executive committee is the leadership body of the NSC that is chartered to provide leadership and oversee the activities of the consortium. As a member of the executive committee, Dr. Triolo will work with other committee members to help advance the goals of the NSC.\nAs chief scientist, Triolo is responsible for programs related to spectrum sharing and other efficient uses of the wireless spectrum. He currently leads efforts to adapt commercial LTE for use in airborne telemetry applications and to develop real-time distributed spectrum monitoring systems. Triolo holds a Ph.D. in electromagnetics from the New Jersey Institute of Technology.\n\"I extend my personal congratulations to Anthony Triolo for being appointed to this prestigious leadership position with the consortium,\" said Petros Mouchtaris, president, Vencore Labs. \"We value our NSC participation and are confident that Dr. Triolo's perspective and experience will add tremendous value to this important leadership organization. Vencore Labs welcomes the opportunity to collaborate through NSC on the many consequential security and bandwidth issues, among others, associated with the ever-increasing demands on the wireless spectrum.\"\nVencore Labs is a member of NSC and is currently performing on four efforts to improve the efficiency, awareness, sharing and use of the electromagnetic spectrum by government organizations. The efforts include cellular based range telemetry, spectrum utilization monitoring system, next generation spectrum situational awareness and bolt-on MIMO (multiple-input and multiple-output) radio technology.\nAbout Vencore\nVencore is a proven provider of information solutions, engineering and analytics for the U.S. Government. With more than 40 years of experience working in the defense, civilian and intelligence communities, Vencore and its transformational applied research organization, Vencore Labs, design, develop and deliver high impact, mission-critical services and solutions to overcome its customers most complex problems.\nVencore has 3,750 employees and is based in Chantilly, Va. For more information about Vencore and Vencore Labs, visit www.vencore.com and www.vencorelabs.com .\nThis press release contains forward-looking statements. These forward-looking statements are made on the basis of the current beliefs, expectations and assumptions of the management of Vencore and are subject to significant risks and uncertainty. Readers are cautioned not to place undue reliance on any such forward-looking statements. All such forward-looking statements speak only as of the date they are made, and Vencore undertakes no obligation to update or revise these statements, whether as a result of new information, future events or otherwise. Although Vencore believes that the expectations reflected in these forward-looking statements are reasonable, these statements involve a variety of risks and uncertainties that may cause actual results to differ materially from what may be expressed or implied in these forward-looking statements.\nView original content with multimedia: http://www.prnewswire.com/news-releases/vencore-labs-anthony-triolo-phd-appointed-to-nsc-executive-committee-300579225.html\nSOURCE Vencore, Inc.", "external_links": ["http://www.vencore.com/", "http://www.vencorelabs.com/", "http://www.prnewswire.com/news-releases/vencore-labs-anthony-triolo-phd-appointed-to-nsc-executive-committee-300579225.html"], "published": "2018-01-08T22:00:00.000+02:00", "crawled": "2018-01-09T09:40:12.215+02:00", "highlightTitle": ""}