{"organizations": [], "uuid": "47a00bfd56ab21255c6063249ddff79957b7c3f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-euro-hits-3-year-high-as-europe-leads-global-optimism-idUSL8N1PA189", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Euro hits 3-year high as Europe leads global optimism", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.208, "site_type": "news", "published": "2018-01-15T18:04:00.000+02:00", "replies_count": 0, "uuid": "47a00bfd56ab21255c6063249ddff79957b7c3f2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-euro-hits-3-year-high-as-europe-leads-global-optimism-idUSL8N1PA189", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Euro hits 3-year high as Europe leads global optimism", "locations": [], "entities": {"persons": [{"name": "abhinav ramnarayan", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Growth and political progress boost bets on Europe\n* Investors watch ECB, BoJ for signs of tightening\n* World stocks hit record highs on Asia surge\n* But euro strength pushes European stocks touch lower\nBy Abhinav Ramnarayan\nLONDON, Jan 15 (Reuters) - The euro hit a fresh three-year high on Monday as optimism around growth buoys expectations of tighter policy from central banks, while the chance of a pro-European coalition in Germany also boosted confidence in the continent.\nWith the world in general and Europe in particular showing signs of sustained economic growth, global stocks benchmarks jumped to fresh highs, even though investors are now pricing in the withdrawal of central banks’ extraordinary stimulus.\nThat view was given further fuel last week by an account of European Central Bank discussions which suggested policymakers could soon start preparing the ground for a reduction in support.\nThe single currency rose to $1.2227 at one stage on Monday, a price last seen in December 2014, just before the ECB first announced its massive government bond purchase programme.\nNor is the ECB the only game in town: Bank of Japan Governor Haruhiko Kuroda offered a positive view on his nation’s economy and inflation on Monday, sending the yen to a four-month high against the dollar.\n“The latest leg up in the euro has clearly come from optimism that the German government is moving towards a agreement for a coalition government,” said Investec economist Victoria Clarke.\nGerman Chancellor Angela Merkel’s CDU party and the Social Democrats (SPD) are moving towards formal coalition talks, soothing concerns around Europe’s largest economy.\nThe SPD’s pro-European stance -- leader Martin Schulz recently argued for a “United States of Europe” -- also strengthens the case for investment in the euro.\n“This follows an earlier move triggered by the crucial line in the ECB account which has got people thinking about when the first move on rates will happen,” said Clarke.\nEuro zone money markets now price in a 70 percent chance of a 10 basis point hike from the European Central Bank by the end of the year, up from 50 percent a week before.\nThe strength in the euro pushed European stocks a touch lower, as exporters were hit by the currency strength. An index of pan-European stocks was down 0.2 percent on the day, but still not far from multi-year high hit last week.\nThe slight fall comes in the wider context of a storming 2018 for world stocks so far as investors bask in strong growth numbers from most of the world’s largest countries.\nMSCI’s all-country index of world stocks soared to new records overnight and MSCI’s Asia ex-Japan index breached its 2007 high for the first time to set a new all-time record.\nStocks in Hong Kong jumped 0.9 percent from Friday’s record closing high. Investors were optimistic that Chinese gross domestic product data for the December quarter due on Thursday would show growth of at least 6.7 percent for the world’s second biggest economy.\nThe momentum of global economic growth through the closing months of last year is being underlined by the early stages of the fourth-quarter earnings season.\nEarnings for S&P 500 companies are expected to increase on average by 12.1 percent in the quarter, with profit for financial services companies likely to increase 13.2 percent, according to Thomson Reuters I/B/E/S.\nWall St stocks set new records on Friday, but U.S. markets will be mostly closed on Monday for the Martin Luther King Day holiday.\nDOLLAR DOWN The dollar index showed no sign of bouncing early on Monday, instead edging down to a fresh trough of 90.571.\nThough the U.S. Federal Reserve is expected to continue to hike rates this year, this has been largely priced in and investors are starting to position for central bank action in Europe and Japan instead.\nThe dollar slipped to a six-week low on the yen at 110.73 yen, even as the head of the Bank of Japan reiterated his commitment to keeping yields low.\nOil prices consolidated following six straight sessions of gains, with output cuts led by OPEC and Russia as well as healthy demand keeping crude near December 2014 highs.\nBrent crude futures fell 23 cents to $69.64 a barrel, while U.S. crude was lower 11 cents at $64.20.\nReporting by Abhinav Ramnarayan; Additional reporting by Wayne Cole in SYDNEY; Editing by Toby Chopra\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T18:04:00.000+02:00", "crawled": "2018-01-15T22:25:16.000+02:00", "highlightTitle": ""}