{"organizations": [], "uuid": "8920c88e3ddb19d5cc280cad02382d45dfbac587", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 1285, "shares": 1285, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225635341&w=1200&r=LYNXMPEE0Q00W", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-oregon-standoff-lawsuit/family-of-rancher-slain-during-wildlife-refuge-standoff-sues-u-s-fbi-idUSKBN1FG00K", "country": "US", "domain_rank": 408, "title": "Family of rancher slain during wildlife refuge standoff sues U.S., FBI", "performance_score": 10, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T02:16:00.000+02:00", "replies_count": 0, "uuid": "8920c88e3ddb19d5cc280cad02382d45dfbac587"}, "author": "", "url": "https://www.reuters.com/article/us-oregon-standoff-lawsuit/family-of-rancher-slain-during-wildlife-refuge-standoff-sues-u-s-fbi-idUSKBN1FG00K", "ord_in_thread": 0, "title": "Family of rancher slain during wildlife refuge standoff sues U.S., FBI", "locations": [], "entities": {"persons": [{"name": "robert", "sentiment": "none"}, {"name": "lavoy finicum", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "portland", "sentiment": "none"}, {"name": "malheur national wildlife refuge", "sentiment": "none"}, {"name": "harney county", "sentiment": "none"}], "organizations": [{"name": "fbi", "sentiment": "negative"}, {"name": "federal bureau of investigation", "sentiment": "none"}, {"name": "min read  los angeles", "sentiment": "none"}, {"name": "oregon state police", "sentiment": "none"}, {"name": "fbi dan whitcomb", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "district court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 12:17 AM / Updated 18 hours ago Family of rancher slain during wildlife refuge standoff sues U.S., FBI Dan Whitcomb 3 Min Read \nLOS ANGELES (Reuters) - Family members of a rancher who was shot and killed by police during the 2016 armed occupation of a federal wildlife refuge have sued the U.S. government, Federal Bureau of Investigation, state of Oregon and others claiming he was willfully “executed.” \nThe lawsuit was filed in U.S. District Court in Portland nearly two years to the day after Robert “LaVoy” Finicum, 54, was shot dead by Oregon State Police on Jan. 26, 2016, along a snow-covered road near the Malheur National Wildlife Refuge. \n“As it turns out, he was deliberately executed by a pre-planned government ambush, after he had exited his vehicle with his hands up,” the plaintiffs allege in their 48-page lawsuit. \n“Along an isolated section of U.S. Route 395 in Harney County, Oregon where the only other people within miles were those who had set up the ambush, LaVoy Finicum was executed as he walked away from his truck in the deep snow,” the plaintiffs say in their court papers. \nA spokeswoman for the FBI’s office in Portland, Beth Anne Steele declined to comment on the lawsuit, citing an agency policy of not responding in the press to pending litigation. \nA spokesman for Oregon Governor Kate Brown said that her office would also have no comment. The Oregon State Police did not respond to requests by Reuters for comment on Friday afternoon. \nFinicum acted as a de facto spokesman for the group of some two dozen land rights protesters who seized buildings at the refuge on Jan. 2, 2016, a move sparked by the return to prison of two Oregon ranchers convicted of setting fires that spread to federal property in the area. \nIt also marked the latest flare-up in the so-called Sagebrush Rebellion, a decades-old conflict over federal control of millions of acres of land in the West. \nFinicum, an Arizona rancher, was shot three times in the back after running from his pickup truck at a roadblock, a killing a county prosecutor later found “justified and necessary.” \nIn October 2016, the leader of the standoff, activist Ammon Bundy, and six of his followers were acquitted of federal charges. Two other men who took part in the occupation were later convicted of federal conspiracy charges. \nEarlier this month a judge threw out the criminal case against Ammon Bundy, his father Cliven, brother Ryan and another defendant over their 2014 standoff against federal agents in Nevada over cattle grazing rights, citing prosecutorial misconduct. Reporting by Dan Whitcomb, editing by G Crosse", "external_links": [], "published": "2018-01-27T02:16:00.000+02:00", "crawled": "2018-01-27T02:35:27.014+02:00", "highlightTitle": ""}