{"organizations": [], "uuid": "774f9702221dc6daed9574e6d41df3207f1904ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/untitled.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/consent-app-me-too/", "country": "US", "domain_rank": 1196, "title": "#MeToo: Would You Use a Blockchain App to Consent to Sex? | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.199, "site_type": "news", "published": "2018-01-16T02:00:00.000+02:00", "replies_count": 0, "uuid": "774f9702221dc6daed9574e6d41df3207f1904ef"}, "author": "Valentina Zarya", "url": "http://fortune.com/2018/01/16/consent-app-me-too/", "ord_in_thread": 0, "title": "#MeToo: Would You Use a Blockchain App to Consent to Sex? | Fortune", "locations": [], "entities": {"persons": [{"name": "catherine deneuve", "sentiment": "none"}, {"name": "arnold daniel", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 \nIs the idea of using a mobile app to document consent ridiculous—or revolutionary? \nLast week, a group of French women, among them the storied actress Catherine Deneuve, wrote a letter to proclaim that the #MeToo movement had gone too far (she later apologized ). In addition to asserting that the movement had turned into a witch hunt, the authors described the fallout as an overreaction: \n“Bordering on ridiculous, in Sweden a bill was presented that calls for explicit consent before any sexual relations! Next we’ll have a smartphone app that adults who want to sleep together will have to use to check precisely which sex acts the other does or does not accept.” \nWhile portrayed as a frivolous idea in the letter, a product very similar to the described app actually already exists. A Dutch company called LegalThings, whose primary business is creating digital legal contracts, last week launched beta testing of an app called LegalFling that promises to be “the first blockchain-based app to verify explicit consent before having sex.” \nLegalThings co-founder Arnold Daniels says the app is meant to provide a solution that’s less black-and-white than Sweden’s proposed law, which stipulates that sex without clearly worded or demonstrated consent is rape. \n“Just saying ‘yes’ really isn’t enough,” Daniels says. “You want to set a really clear set of boundaries.” For instance, he says the app would help clarify a situation where, say, one party consents to sex, but not to having nude photos of themselves taken. \nTo address these “gray areas,” users of LegalFling can state their preferences in a number of categories—including photography, condom use, and STD testing, then send Fling requests to their sexual partners via a messaging app. Accepting such a request is, in theory, agreeing to the preferences stated by the partner. That acceptance is then digitally recorded on the blockchain. \nSubscribe to The Broadsheet , Fortune’ s newsletter for and about the world’s most powerful women. \nDax Hansen, a partner at Perkins Coie and chair of the firm’s blockchain and digital currency industry group, is skeptical about LegalFling’s validity in U.S courts. Unless a more traditional contract, complete with offer, acceptance, and considerations, is embedded into the app—and knowingly signed by both users—the interaction isn’t legally binding, he says. \nEven if LegalFling’s use of blockchain wouldn’t hold up in court, does it have value as a record of consent—or lack thereof? That remains an open question. Ken Nguyen, chief of crowdfunding platform Republic, former general counsel at AngelList, and advisor to ICO platform CoinList, isn’t convinced. “Blockchain doesn’t solve the complexity of human dynamics and relationships,” he says. And if someone just wants to record their consent, a simple text message will do. \nHansen, though, sees more record-keeping potential in the technology. The lawyer says the application of distributed ledger technology to scenarios like consent isn’t so much ludicrous as it is premature. \n“One of the blockchain’s wonderful traits is that it enables people to interact in ways that normally require trust, ” he says. But if you’re not yet sure whether you trust the person you’re interacting with, using blockchain can create that level of certainty. Unlike the text message example suggested by Nguyen, a blockchain entry can’t be easily manipulated, erased, or otherwise tampered with. \nWith so many sexual harassment and assault cases relying on “he said, she said” accounts, a technology that allows for nearly ironclad recordkeeping is, at the very least, worth exploring. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-16T02:00:00.000+02:00", "crawled": "2018-01-17T10:05:40.000+02:00", "highlightTitle": ""}