{"organizations": [], "uuid": "75c4156784fce2a55f46cce4a5f5ff553719e3f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-milost-global-changes-management-at-primewaterview.html", "country": "US", "domain_rank": 767, "title": "Milost Global Changes Management at Primewaterview", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T21:13:00.000+02:00", "replies_count": 0, "uuid": "75c4156784fce2a55f46cce4a5f5ff553719e3f3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-milost-global-changes-management-at-primewaterview.html", "ord_in_thread": 0, "title": "Milost Global Changes Management at Primewaterview", "locations": [], "entities": {"persons": [{"name": "adetunji ogunwusi", "sentiment": "none"}, {"name": "mandla j. gwadiso", "sentiment": "none"}, {"name": "harold nzekwe", "sentiment": "none"}, {"name": "ogunwusi", "sentiment": "none"}, {"name": "tiny diswai", "sentiment": "none"}], "locations": [{"name": "primewaterview victoria island", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}], "organizations": [{"name": "milost global changes management", "sentiment": "negative"}, {"name": "milost global inc", "sentiment": "none"}, {"name": "isilo capital partners (pty) ltd", "sentiment": "none"}, {"name": "real estate development & investment", "sentiment": "none"}, {"name": "primewaterview holdings nigeria limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VICTORIA ISLAND, Nigeria, Jan. 17, 2018 (GLOBE NEWSWIRE) -- Primewaterview Limited ( www.primewaterviewng.com ), a Nigerian based Real Estate development & Investment company, announced today that HRH Prince Adetunji Ogunwusi has resigned as Chief Executive Officer and as a member of the Board, effective January 12, 2018. HRH Ogunwusi’s resignation is a result of the recently announced takeover of Primewaterview Holdings Nigeria Limited by Milost Global Inc and Isilo Capital Partners (Pty) Ltd, with his departure from the company expected on January 19, 2018 while he assists in the orderly transition of his duties and responsibilities to the new Chief Executive Officer. Effective January 22, 2018, Harold Nzekwe, Executive Director and Head of Nigeria operations at Isilo Capital Partners (Pty) Ltd, will serve as new Chief Executive Officer. The company also announces the appointment of Ms Tiny Diswai, currently Chief Executive Officer of Isilo Capital Partners (Pty) Ltd as the new Chairman of Primewaterview Holdings Nigeria Limited effective immediately.\nMandla J. Gwadiso, Managing Partner & CEO of Milost Global Inc, commented: “On behalf of the Board of Directors of Milost Global Inc., I thank His Royal Highness for his service to the Company. His Royal Highness’ leadership and knowledge of the business and region have proved exceptionally valuable to the company. The Board is satisfied that all major projects and initiatives are well in hand and proceeding as planned. I believe in the capability of the new leadership team to steer the group to even higher heights. My focus is to get a new Board of Directors before January end so that proper governance is the heart of our Nigerian operations.”\nHRH Prince Adetunji Ogunwusi founded Primewaterview over a decade ago. Under His leadership the company grew to be one of the market changers and contributors in Nigeria. With years of banking experience, HRH Ogunwusi is a visionary and He is not a man of many words and yet His works speak volumes of greatness. A new Board of Directors will be formed and constituted at Primewaterview in the coming weeks.\nTiny Diswai, the Chairman of Primewaterview, stated, “On behalf of the Board of Primewaterview I would like to appeal to my predecessor and his board and management to make this transition as smooth as possible. We plan to ensure that all the current and potential customers and stakeholders will have un-interrupted service. We also look forward to working with the regulatory authorities in ensuring compliance with all the legal transitionary expectations and we look forward to the continued growth of Primewaterview and its contribution to the economy and employment of Nigeria. We are very excited about this venture.”\n“I am thrilled to be taking over the reins at Primewaterview. His Royal Highness has done tremendously well for the company and filling in his shoes is definitely not going to be a walk in the park. The idea is to take Primewaterview Ltd, our real estate division to the forefront of real estate development and investments in West Africa and make it the no 1 largest Real Estate group, while developing our Oil & Gas assets under Primewaterview Oil & Gas Ltd. Primewaterview Healthcare Ltd, our healthcare group will be building the second largest hospital in the world. Filling in the Prince’ shoes is a definite milestone, there is a lot of work to be done,” stated, Harold Nzekwe, the incoming CEO of Primewater Holdings Nigeria Limited.\nAbout Primewaterview Limited\nPrimewaterview Limited is a wholly owned Nigerian Company incorporated in 2005 and a subsidiary of Primewaterview Holdings Nigeria Limited. The Company is a property and infrastructure development company, which uses its local knowledge and skills combined with its global expertise, to design and build residential communities of high international standard. Its passion to provide excellent housing shelter has driven it to the pinnacle of Real Estate in Nigeria and Africa. Its track record includes the development of various residential and commercial properties in highbrow areas in Lagos and other parts of Nigeria. In line with its goal to be one of the top Real Estate and infrastructure Companies in Africa, the Company is planning to construct hotels, office complexes, shopping malls and business parks in Lagos, Abuja, Africa and other parts of the world.\nOur Board of Directors, together with the Management team is a strong, balanced blend of Industry & Professional leaders whose exceptional knowledge and experience guides and supports the delivery of long-term value to the Company.\nFor more information\nTendai Sibanda\nTel: +1-212-709-8206\nFax: +1-212-943-2300\ntendai.sibanda@palewateradvisory.com\nSource:Milost Global Inc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/dac64e60-c6f3-4d97-bf2d-20582f5b1ba0", "https://www.globenewswire.com/Tracker?data=A4B8f8hqGcMSYVPKDn8YLMyzgVETLGWyH8kG4LP22wllA5Td4c2cHaBx4MrweostROgSBxFNK8ZwIlFCxkNScduvD950WHbw3x9JrEYKyvkjdKxPThaJEB5NF1jCAk8iKjSaL-RPVWhxOdu6wjaFBXwUJdeyMan1XnzTS_YyxmNDRgWG0v7Ve99HA-mjAZA3SCsWf9spTuus5kV-1lNB55uoFGanLcEaMtNSCyi5J6abKsFeV4LcS3vxeWT4OW0rDKXQcLrH3RnWisgBISw37goQPZI-oCIEI5MQl7IPNuBnOEzlAXcVJZ7dUxuNUBc1VN-GZvDouXXQrZZ1LDk2AetzafDJ_El6y58XWeDECoN19dQiCmt0q6xle3MCSl-TmFbDK4zfHyqHSZQqGyL52NJ1iGvg918aHVHuDjt1Ch5GsvEAnWEiS22WojEvhVic5-vQEMYXB0vnKoDYw7NIggHfUZhG_1CoxS1Gm8f"], "published": "2018-01-17T21:13:00.000+02:00", "crawled": "2018-01-17T21:11:00.010+02:00", "highlightTitle": ""}