{"organizations": [], "uuid": "9428746421337f526507fa8f938948832cfdcf16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/10/20/104036927-GettyImages-609946080.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/12/us-stock-futures-dow-fed-speeches-earnings-bonds-data-and-politics-on-the-agenda.html", "country": "US", "domain_rank": 767, "title": "US stock futures: Dow, Fed speeches, earnings, bonds, data, and politics on the agenda", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T13:52:00.000+02:00", "replies_count": 0, "uuid": "9428746421337f526507fa8f938948832cfdcf16"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/12/us-stock-futures-dow-fed-speeches-earnings-bonds-data-and-politics-on-the-agenda.html", "ord_in_thread": 0, "title": "US stock futures: Dow, Fed speeches, earnings, bonds, data, and politics on the agenda", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "dow", "sentiment": "negative"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "pnc financial services group", "sentiment": "none"}, {"name": "j.p. morgan chase", "sentiment": "none"}, {"name": "blackrock", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. stock index futures gave back some of their gains on Friday after the release of key inflation data.\nDow Jones industrial average futures traded 72 points higher; they had risen more than 100 points earlier in the session. S&P 500 futurews were down half a point and Nasdaq 100 futures fell 21 points.\nThe Labor Department said its Consumer Price Index excluding the volatile food and energy components rose 0.3 percent last month. That was the biggest advance in the so-called core CPI since January.\nEquity futures had risen after Wells Fargo and J.P. Morgan Chase reported better-than-expected quarterly results. BlackRock also posted results that beat expectations.\nOn Thursday, the Dow hit an all-time high, with the index rising more than 200 points by the close . The state of the U.S. economy and tax reform is set to be of key importance on Friday as major U.S. banks are set to report.\nMarkets have been on the rise as of late, after President Donald Trump signed a bill in December to slash the corporate tax rate from 35 percent to 21 percent.\nMeantime, investors will keep a close eye on bond markets, after investors fretted over the risk of China halting its Treasury bond purchases.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nOn Wednesday, Bloomberg News reported , citing people familiar with the matter, that officials in Beijing had recommended that China's government lowers — or even potentially ceases — its buying of U.S. sovereign debt. However, China's currency regulator has since refuted the report.\nOn the U.S. central bank front, Boston Fed President Eric Rosengren is expected to be in California, where he's set to give a keynote address at the Money, Models, and Digital Innovation conference in San Diego.\nMeantime, Philadelphia Fed President Patrick Harker is expected to be present at the Central Bucks Chamber of Commerce Economic Luncheon in Pennsylvania.\nOverseas, coalition party leaders in Germany have reached a breakthrough in talks to form a new government. German Chancellor Angela Merkel had entered into talks with a rival party in a last-ditch effort to form a coalition government. This comes after months of political uncertainty. —Reuters contributed to this report.", "external_links": [], "published": "2018-01-12T13:52:00.000+02:00", "crawled": "2018-01-12T13:01:20.018+02:00", "highlightTitle": ""}