{"organizations": [], "uuid": "409348dfb3bf1fce4d06c1aa516a638df272ca7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-marc-metrick-president-of-saks-fifth-avenue-adds-gilt-and-saks-off-5th-to-his-leadership-responsibilities.html", "country": "US", "domain_rank": 767, "title": "Marc Metrick, President of Saks Fifth Avenue, Adds Gilt and Saks OFF 5TH to His Leadership Responsibilities", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T19:31:00.000+02:00", "replies_count": 0, "uuid": "409348dfb3bf1fce4d06c1aa516a638df272ca7c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-marc-metrick-president-of-saks-fifth-avenue-adds-gilt-and-saks-off-5th-to-his-leadership-responsibilities.html", "ord_in_thread": 0, "title": "Marc Metrick, President of Saks Fifth Avenue, Adds Gilt and Saks OFF 5TH to His Leadership Responsibilities", "locations": [], "entities": {"persons": [{"name": "marc metrick", "sentiment": "negative"}, {"name": "gilt", "sentiment": "negative"}, {"name": "marc", "sentiment": "none"}, {"name": "metrick", "sentiment": "none"}, {"name": "richard baker", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "gilt", "sentiment": "none"}], "organizations": [{"name": "saks fifth", "sentiment": "negative"}, {"name": "saks", "sentiment": "negative"}, {"name": "saks fifth avenue", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO & NEW YORK--(BUSINESS WIRE)-- HBC today announced that Marc Metrick, President of Saks Fifth Avenue, will expand his leadership role to include Gilt and Saks OFF 5TH. In this capacity, Mr. Metrick will lead distinct teams and work to ensure that each business remains well positioned to execute within their respective operating structures.\n“Since assuming leadership of Saks Fifth Avenue in 2015, Marc has successfully implemented strategies to enhance business performance and elevate the Saks experience to be at the forefront of luxury retailing,” said Richard Baker, Governor, Executive Chairman and Interim CEO. “Marc’s ability to shape and evolve the shopping experience is critical for success in an ever-changing retail environment, and I have great confidence that he will position Gilt and Saks OFF 5TH to drive improved performance.”\nMr. Metrick said, “I’m excited to work closely with the entire team at Gilt and Saks OFF 5TH to drive performance and move the business forward. There is opportunity for growth at both businesses, especially on their respective digital platforms. I look forward to collaborating with the leadership team to position the business for future success.”\nAs a long-tenured retail executive, Mr. Metrick has served in a number of leadership roles for HBC and Saks Fifth Avenue. Since April 2015, he has held the role of President, Saks Fifth Avenue. Prior to this, he served as Chief Marketing Officer and Chief Administrative Officer of HBC, where he was responsible for corporate strategy and administration for all of HBC’s retail businesses. Mr. Metrick spent the first 15 years of his career at Saks Fifth Avenue, ultimately becoming its Chief Strategy Officer before joining the leadership team of HBC in 2012. At HBC, Mr. Metrick played an instrumental role in the acquisition of Saks Fifth Avenue and has since focused on driving growth there.\nWith this change in leadership, Jonathan Greller will leave HBC effective January 12.\nMr. Baker said, “Jonathan has worked with the team to integrate Gilt and Saks OFF 5TH, bring Saks OFF 5TH to Canada and open more than 45 stores across North America. We thank Jonathan for his many contributions to HBC and wish him well in his future endeavors.”\nAbout HBC\nHBC is a diversified global retailer focused on driving the performance of high quality stores and their all-channel offerings, growing through acquisitions, and unlocking the value of real estate holdings. Founded in 1670, HBC is the oldest company in North America. HBC's portfolio today includes formats ranging from luxury to premium department stores to off price fashion shopping destinations, with more than 480 stores and over 66,000 employees around the world.\nHBC's leading banners across North America and Europe include Hudson's Bay, Lord & Taylor, Saks Fifth Avenue, Gilt, Saks OFF 5TH, Galeria Kaufhof, the largest department store group in Germany, and Belgium's only department store group Galeria INNO.\nHBC has significant investments in real estate joint ventures. It has partnered with Simon Property Group Inc. in the HBS Global Properties Joint Venture, which owns properties in the United States and Germany. In Canada, it has partnered with RioCan Real Estate Investment Trust in the RioCan-HBC Joint Venture.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109006199/en/\nHudson’s Bay\nMEDIA:\nAndrew Blecher, (646) 802-4030\nPress@hbc.com\nor\nINVESTOR RELATIONS:\nElliot Grundmanis, (646) 802-2469\nelliot.grundmanis@hbc.com\nSource: Hudson’s Bay", "external_links": ["http://www.businesswire.com/news/home/20180109006199/en/"], "published": "2018-01-09T19:31:00.000+02:00", "crawled": "2018-01-09T21:30:41.000+02:00", "highlightTitle": ""}