{"organizations": [], "uuid": "422ae4576077367133f68dad9deb5f211352f4c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 442, "shares": 442, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF281_0129BA_SOC_20180129145526.jpg", "site_section": "https://www.wsj.com/public/page/archive.html", "section_title": "News Article Archive - Wsj.com", "url": "https://www.wsj.com/articles/goodbye-goofy-hats-extreme-balloon-twisters-inflate-the-art-form-1517327254", "country": "US", "domain_rank": 387, "title": "Goodbye, Goofy Hats: Extreme Balloon Twisters Inflate the Art Form", "performance_score": 4, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-30T18:47:00.000+02:00", "replies_count": 0, "uuid": "422ae4576077367133f68dad9deb5f211352f4c0"}, "author": "Jim Carlton", "url": "https://www.wsj.com/articles/goodbye-goofy-hats-extreme-balloon-twisters-inflate-the-art-form-1517327254", "ord_in_thread": 0, "title": "Goodbye, Goofy Hats: Extreme Balloon Twisters Inflate the Art Form", "locations": [], "entities": {"persons": [{"name": "jas", "sentiment": "negative"}, {"name": "harrah", "sentiment": "none"}, {"name": "secoda", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "newtown", "sentiment": "none"}, {"name": "las vegas hotel", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4 COMMENTS LAS VEGAS—Driven by at least six glasses of ice tea and an urge to express his darkest feelings, Jason Secoda stayed up all night in his room in Harrah’s Las Vegas Hotel & Casino sculpting an 8-foot Grim Reaper. His medium was more than 500 balloons.\nGrim Reaper “I put the hourglass in there to emphasize the fact that our time here is finite,” said the 38-year-old physical therapist from Newtown, Pa. “I wanted to make something that puts people in touch with that feeling—not to scare anyone, but to make us aware of it.”\nMr. Secoda is an extreme balloonist, a small but dedicated cadre that has pushed the art of twisting the latex objects as far as possible from its cheerful roots making dachshunds, giraffes and goofy hats for children’s birthday parties.\n“I know that’s a bit darker than what people expect from balloon art, but it’s what was inside of me, and balloon art is how I express myself,” Mr. Secoda explained.\nAt the annual Twist & Shout Balloon Convention earlier this month, most of the balloon twisters attended sessions about topics such as how to clear a line of children without drama and how best to shape objects including koalas and flowers.\nThey look at their more serious brethren as, well, a little bit twisted. “It takes a lot of work. I couldn’t do it,” said Victor Forja, a balloon artist from Ireland. “I have to do things quick.”\nDonna Egan of Australia puts finishing touches on a balloon evening gown. Photo: Jim Carlton/The Wall Street Journal A balloon version of the droid C-3PO from Star Wars was made by Eric Costello of Pittsburgh. Photo: Jim Carlton/The Wall Street Journal In a corner of the convention hall walled off, not surprisingly, by a curtain of balloons, the extreme balloonists were pursuing the business of competitive ballooning.\nFacing deadlines, some of them work for as long as 48 hours on a single creation. They spend so much time stringing together balloons they can suffer cuts to their fingers and, in the case of balloon-dressmaker Melissa Vinson, the loss of feeling in her thumb.\n“I would say it is like the balloon ultramarathon,” said Todd Neufeld, a 43-year-old balloon artist from New York City.\nGlen LaValley, 56, from Edmonton, Alberta, taped his fingers, drank lots of fluids and nibbled protein snacks as he pumped and tied balloons to make an enormous green and purple dragon with wings.\n“You have to keep your food levels up or you might faint,” he said. “Dance music tends to keep me going.”\nGlen LaValley of Edmonton, Alberta, adjusts the wings of a balloon dragon he built. Photo: Jim Carlton/The Wall Street Journal When he crashed for an hour or so of sleep in the hotel conference room, he made sure he wasn’t in view of others. “I don’t want anyone drawing on me while I sleep,” he explained.\nHe had to wear his balloon dragon to make it work. Inside the creature, he hunched over to operate the wings by maneuvering bicycle hand brakes and cables. “I’m too old for this,” he said.\nAs he maneuvered his dragon onto a stage, its eyes glowed green from LED lights and its wings flapped.\nCarolynn Hayman of Ann Arbor, Mich., said she once built a giant lobster but forgot to include a viewing hole. When she squeezed inside to wear it on stage, she nearly fell off. “The number one thing you have to have is a hole to look out of,” she warned a class she was teaching on wearable balloons.\nTo build his Grim Reaper, Mr. Secoda created an aluminum frame and affixed netting over it. Then he pumped up and twisted hundreds of black and green balloons. His goal, he said, was “the look of having the free ends exposed and flowing, to give the cloak a lifelike feel, almost like the way flames can dance in the wind.”\nThe work, he said, is stressful. “I curse and yell quite a bit,” he said.\nThat was a far cry from what was going on at sessions attended by the ordinary balloon artists elsewhere in the hall, where they learned about balloon designs such as “Holiday Happy” to “Pure Awesomeness.”\nPip “Pippity-Pop” Milford-Hughes, whose convention biography describes her as “one of New Zealand’s leading and most creative Balloonologists,” taught her fellow artists how to jazz up the trucks, pandas and other basics they make for children.\nKatie Brown of Las Vegas models a dress created by Emi Jingu of Japan. Photo: Jim Carlton/The Wall Street Journal Suzanne Haring, a 59-year-old entertainer from Redondo Beach, Calif., uses balloons in her variety act. She said she comes to balloon gatherings to relax and pick up tips and tricks from fellow balloonists.\nThose pushing latex to the edge, she said, “are really exploring the art form.”\n“You’re doing it for the prestige,” said 37-year-old Donna Egan of Australia, as she applied finishing touches to a shimmering blue evening dress fashioned out of tiny balloons that took her more than 24 hours to complete.\nTake a Look at Other Recent A-Heds\nLawyers Faced With Emojis and Emoticons Are All ¯\\_(ツ)_/¯ If You’re a Purist About Scotch Whisky, You Might Find This Hard to Swallow The Internet Is Filling Up Because Indians Are Sending Millions of ‘Good Morning!’ Texts For her life-size, wearable samurai creation, Amber Corbett of St. Paul, Minn., recruited a friend, prison guard Joe Bell, as a model. Mr. Bell, 28, wore the balloon outfit over briefs. He stripped off the balloons as he cavorted on a stage in a balloon fashion show.\n“I couldn’t have had a better model do that,” said Ms. Corbett, 30, who uses the name “Silly Miss Tilly” for her day job as a children’s entertainer.\nA professional clown from Salem, Mass., wasn’t amused.\n“The stripper, I don’t know about,” said Jay Hubbard, a 54-year-old clown, who was judging the balloon creations. “There are kids in the audience.”\nCorrections & Amplifications\nVictor Forja is a balloon artist from Ireland. An earlier version of this article misspelled his surname as Sorja. (Jan. 30, 2018)\nWrite to Jim Carlton at jim.carlton@wsj.com", "external_links": [], "published": "2018-01-30T18:47:00.000+02:00", "crawled": "2018-01-31T01:18:42.036+02:00", "highlightTitle": ""}