{"organizations": [], "uuid": "5191f212db2a28fdbdc3aa7aaa28a45fdca333e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223879489&w=1200&r=LYNXMPEE0K0IO", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-usa-shutdown/senate-should-change-rules-if-shutdown-stalemate-continues-trump-idUKKBN1FA0OA", "country": "US", "domain_rank": 408, "title": "Senate should change rules if shutdown stalemate continues - Trump", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T16:10:00.000+02:00", "replies_count": 0, "uuid": "5191f212db2a28fdbdc3aa7aaa28a45fdca333e5"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-shutdown/senate-should-change-rules-if-shutdown-stalemate-continues-trump-idUKKBN1FA0OA", "ord_in_thread": 0, "title": "Senate should change rules if shutdown stalemate continues - Trump", "locations": [], "entities": {"persons": [{"name": "susan cornwell", "sentiment": "none"}, {"name": "john stonestreet", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "trump reuters", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 2:10 PM / Updated 2 minutes ago In second day of shutdown, Republicans, Democrats dig in for fight Susan Cornwell , Howard Schneider 6 Min Read \nWASHINGTON (Reuters) - Republicans and Democrats appeared to harden their positions on Sunday as both sides hunkered down for what could be a prolonged fight, with a U.S.   its second day. \nDemocrats demanded that U.S.   negotiate on immigration issues as part of any agreement to resume government funding and accused him of reneging on an earlier accord to protect “Dreamers,” illegal immigrants brought to the United States as children, from deportation. \n“I hope it is just a matter of hours or days. But we need to have a substantive answer, and the only person who can lead us to that is President Trump. This is his shutdown,” Dick Durbin, the second ranking Democrat in the Senate, said on the CBS “Face the Nation” program. \nRepublicans were just as adamant, saying they would not negotiate immigration or other issues as long as all but essential government services remain shuttered. \nSpeaking to U.S. troops at a military base in the Middle East, Vice President Mike Pence said, “We’re not going to reopen negotiations on illegal immigration until they reopen the government and give you, our soldiers and your families, the benefits and wages you’ve earned.” \nA bipartisan group of senators met on Sunday in a Senate office building, searching for ways out of the crisis. \nModerate Republican Senator Susan Collins said a group of as many as 22 senators were discussing alternatives, though the details were “in flux.” She added it would be up to Senate Republican and Democratic leaders “as to how to proceed.” \nAfter funding for federal agencies ran out at midnight on Friday, many U.S. government employees were told to stay home or in some cases work without pay until new funding is approved. The shutdown is the first since a 16-day closure in October 2013, with the effects being more visible on Monday, when government offices normally would reopen. \nWith elections set for November for a third of U.S. Senate seats and the entire House of Representatives, both sides are manoeuvring to blame the other for the shutdown. \nTrump said on Sunday that if the stalemate continued, Republicans should change Senate rules so a measure could be passed to fund the government. \nCurrent Senate rules require a super-majority of three-fifths of the chamber, usually 60 out of 100, for legislation to clear procedural hurdles and pass. \n“If stalemate continues, Republicans should go to 51 percent (Nuclear Option) and vote on real, long term budget,” Trump said on Twitter. \nBut Senate Republican Leader Mitch McConnell, from Trump’s own party, rejected the idea. \nRepublicans hold a slim 51-49 majority in the Senate. A traffic light shines red after   and the U.S. Congress failed to reach a deal on funding for federal agencies in Washington, U.S., January 20, 2018. REUTERS/Joshua Roberts \nTrump cancelled a trip to his Mar-a-Lago estate in Florida that included a major fundraiser on the anniversary of his first year as president. The White House said his planned trip to the World Economic Forum in Davos, Switzerland, next week was in flux because of the standoff. \n‘HOSTAGES RIPE FOR THE TAKING’ \n“I’m kind of keeping hope alive here that before 1 a.m. tomorrow morning that we’ll have something that gets us out of this jam,” Senator John Thune, a junior member of the Republican leadership, told reporters. \nThe Senate will vote at 1 a.m. EST (0600 GMT) on Monday on whether to advance a measure to fund the government through Feb. 8, unless Democrats agree to hold it sooner, McConnell said on Saturday. The figures of Grief and History stand on top of the Peace Statue near the U.S. Capitol after   and the U.S. Congress failed to reach a deal on funding for federal agencies in Washington, U.S., January 20, 2018. REUTERS/Joshua Roberts \nThe level of support for the bill was uncertain, but given Democratic leaders’ public statements, it seemed unlikely the measure would receive the 60 votes required to advance. \nIn a Senate floor speech on Sunday, McConnell accused Senate Democratic leader Chuck Schumer of imperiling children’s health care, military training, veterans’ care and other programs. \n“To most Americans, those sound like fundamental responsibilities” of government, McConnell said. “To the Democratic leader, apparently they sound like hostages ripe for the taking.” \nWhite House budget   Trump had instructed him to ease the effects of the shutdown as much as possible. \n“The president has told me, make sure as many people go to work Monday as possibly can. Use every tool legally available to you,” Mulvaney said on “Face the Nation.” Related Coverage", "external_links": [], "published": "2018-01-21T16:10:00.000+02:00", "crawled": "2018-01-21T16:22:03.029+02:00", "highlightTitle": ""}