{"organizations": [], "uuid": "4c82f3fc1a6267c1e61fc56bf82c299500fbb55c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-sprint-names-accomplished-telecom-and-cable-industry-executive-michel-combes-as-president-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Sprint Names Accomplished Telecom and Cable Industry Executive Michel Combes as President & Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T17:00:00.000+02:00", "replies_count": 0, "uuid": "4c82f3fc1a6267c1e61fc56bf82c299500fbb55c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-sprint-names-accomplished-telecom-and-cable-industry-executive-michel-combes-as-president-chief-financial-officer.html", "ord_in_thread": 0, "title": "Sprint Names Accomplished Telecom and Cable Industry Executive Michel Combes as President & Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "michel combes", "sentiment": "none"}, {"name": "marcelo claure", "sentiment": "none"}, {"name": "michel", "sentiment": "none"}, {"name": "claure", "sentiment": "none"}, {"name": "tarek robbiati", "sentiment": "none"}, {"name": "combes", "sentiment": "none"}], "locations": [{"name": "kan.", "sentiment": "none"}, {"name": "overland park", "sentiment": "none"}], "organizations": [{"name": "cable industry executive michel combes", "sentiment": "negative"}, {"name": "sprint", "sentiment": "negative"}, {"name": "sprint names accomplished telecom", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OVERLAND PARK, Kan., Sprint (NYSE: S) appointed telecom and cable industry executive Michel Combes as President & Chief Financial Officer. Combes will assume the role on January 6 and will report to Chief Executive Officer Marcelo Claure. Combes will also be appointed to Sprint's Board of Directors at a later date.\nCombes will support Claure and the senior leadership team as the company enters a new phase of transformation to deliver profitable growth. He will be responsible for leading the company's financial operations, strategy and continued cost transformation.\n\"Michel is an extremely capable and accomplished global telecom and cable industry leader and I know bringing him on board will help to accelerate our progress as Sprint begins the next chapter of our transformation,\" said Claure. \"He is a visionary executive with a proven track record of successfully transforming leading telecom and media companies and will help us to execute our strategic plan and strengthen our team.\"\nSprint Chief Financial Officer Tarek Robbiati will leave the company on January 31 after a seamless transition of responsibilities.\n\"Tarek's contributions to Sprint have been invaluable including his leadership to drive operating cost reductions and execute innovative financial transactions to fund our turnaround and significantly reduce the company's cost of capital,\" said Claure. \"I thank Tarek for his hard work and commitment to Sprint and wish him continued success in the future. Today Sprint is in its best liquidity position in years and that is in large part due to the financial discipline and innovative financing that Tarek implemented.\"\nFor more than 30 years, Combes, 55, has led telecommunications and cable companies including wireless, wireline and equipment manufacturers. He is globally respected as a turnaround strategist who achieves success through a mix of growth and cost management. Most recently, he served as CEO, and previously Chief Operating Officer, of Altice N.V., a convergent global leader in telecom, content, media, entertainment, and advertising, and chairman and CEO of SFR Group, a leading French telecommunications and media company. During his tenure he led the company through the integration of newly acquired U.S. businesses, developed significant partnerships and media rights to bring exciting and in-demand content to its customers.\nCombes delivered two of the most successful turnarounds in the telecommunications industry in recent history. In 2013 he joined Alcatel-Lucent when the company was near bankruptcy. As CEO, he helped strengthen the company and orchestrated its sale to Nokia. From 2003 to 2006, Combes held various senior financial positions with France Telecom, including CFO and Senior Executive Vice President for Financial Rebalancing and Value Creation. When he joined the company it was the second most indebted company worldwide in terms of short-term liabilities. During his tenure, he oversaw the operational transformation of the company and led the financial restructuring of the business which allowed the struggling company to rebrand as Orange, now the largest fixed and wireless telecommunications operator in France.\nCombes has also served as CEO of Vodafone Europe and chairman and CEO of TDF, a French tower company. Combes also served as an advisor to Brightstar, the company founded by Claure, to support its global expansion. He is a graduate of Ecole Polytechnique and Telecom ParisTech.\n\"I have known Marcelo for many years and am delighted to join the Sprint team and build upon the great progress achieved to date,\" said Michel Combes. \"This is an exciting challenge and unique opportunity to help lead a distinguished company through an historic turnaround and its most exciting period yet.\"\nCombes will relocate to the Kansas City area.\nAbout Sprint:\nSprint (NYSE: S) is a communications services company that creates more and better ways to connect its customers to the things they care about most. Sprint served 54 million connections as of Sept. 30, 2017 and is widely recognized for developing, engineering and deploying innovative technologies, including the first wireless 4G service from a national carrier in the United States; leading no-contract brands including Virgin Mobile USA, Boost Mobile, and Assurance Wireless; instant national and international push-to-talk capabilities; and a global Tier 1 Internet backbone. You can learn more and visit Sprint at www.sprint.com or www.facebook.com/sprint and www.twitter.com/sprint .\n with multimedia: releases/sprint-names-accomplished-telecom-and-cable-industry-executive-michel-combes-as-president--chief-financial-officer-300577597.html\nSOURCE Sprint Corp.", "external_links": ["http://www.sprint.com/", "http://www.prnewswire.com/news-releases/sprint-names-accomplished-telecom-and-cable-industry-executive-michel-combes-as-president--chief-financial-officer-300577597.html", "http://www.twitter.com/sprint", "http://www.facebook.com/sprint"], "published": "2018-01-04T17:00:00.000+02:00", "crawled": "2018-01-04T16:43:50.001+02:00", "highlightTitle": ""}