{"organizations": [], "uuid": "2ed0385bf03857359873f2407f9102db9e4affab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/02/reuters-america-update-3-oil-posts-strongest-year-opening-since-2014-as-iran-unrest-pushes-up-crude.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Oil posts strongest year opening since 2014 as Iran unrest pushes up crude", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T09:58:00.000+02:00", "replies_count": 0, "uuid": "2ed0385bf03857359873f2407f9102db9e4affab"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/reuters-america-update-3-oil-posts-strongest-year-opening-since-2014-as-iran-unrest-pushes-up-crude.html", "ord_in_thread": 0, "title": "UPDATE 3-Oil posts strongest year opening since 2014 as Iran unrest pushes up crude", "locations": [], "entities": {"persons": [], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "barclays", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "crude@\n* Anti-government protests have rocked Iran since late December\n* Brent, WTI crude begin year above $60, 1st time since 2014\n* Ongoing OPEC supply cuts have lifted crude prices\n* Rising U.S. output could undermine OPEC's efforts (Adds Barclays comment on shale, updates prices)\nSINGAPORE, Jan 2 (Reuters) - Oil prices posted their strongest opening to a year since 2014 on Tuesday, with crude rising to mid-2015 highs amid large anti-government rallies in Iran and ongoing supply cuts led by OPEC and Russia.\nU.S. West Texas Intermediate (WTI) crude futures were at $60.63 a barrel at 0747 GMT, up 21 cents, or 0.4 percent, after hitting $60.74 earlier in the day, ther highest since June 2015.\nBrent crude futures, the international benchmark, were at $67.18 a barrel, up 31 cents, or 0.5 percent, after hitting a May 2015 high of $67.29 a barrel earlier in the day.\nIt was the first time since January 2014 that the two crude oil benchmarks opened the year above $60 per barrel.\n\"Growing unrest in Iran set the table for a bullish start to 2018,\" the U.S.-based Schork Report said in a note to clients on Tuesday.\nAnti-government protesters demonstrated in Iran on Sunday in defiance of a warning by authorities of a crackdown, extending for a fourth day one of the most audacious challenges to the clerical leadership since pro-reform unrest in 2009.\nEven without the unrest in Iran, which is a major oil exporter, market sentiment was bullish.\n\"Falling inventories globally and strong economic growth offset the restart of the Forties pipeline and the resumption of production following a pipeline outage in Libya,\" said Jeffrey Halley, senior market analyst at futures brokerage Oanda in Singapore.\nThe 450,000 barrels per day (bpd) capacity Forties pipeline system in the North Sea returned to full operations on Dec. 30 after an unplanned shutdown.\nOil markets have been supported by a year of production cuts led by the Middle East-dominated Organization of the Petroleum Exporting Countries (OPEC) and Russia. The cuts started in January 2017 and are scheduled to cover all of 2018.\nU.S. commercial crude oil inventories have fallen by almost 20 percent from their historic highs last March, to 431.9 million barrels.\nStrong demand growth, especially from China, has also been supporting crude.\nOnly rising U.S. production, which is on the verge of breaking through 10 million bpd, is somewhat hampering the outlook into 2018.\n\"We think U.S. tight oil production growth warrants close monitoring as it could spoil OPEC's market-balancing efforts, pushing the market into surplus in 2018,\" Barclays bank said on Tuesday.\nU.S. oil production <C-OUT-T-EIA>, driven largely by onshore tight shale oil fields, has risen by almost 16 percent since mid-2016, to 9.75 million bpd at the end of last year.\nConsultancy Rystad Energy said \"U.S. crude oil production capacity has reached 10 million barrels per day.\"\n(Reporting by Henning Gloystein; editing by Richard Pullin)", "external_links": [], "published": "2018-01-02T09:58:00.000+02:00", "crawled": "2018-01-03T04:33:36.030+02:00", "highlightTitle": ""}