{"organizations": [], "uuid": "40d563f2f6075f31f692a0823461ef2519f0efa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223362120&w=1200&r=LYNXMPEE0I11Z", "site_section": "http://feeds.reuters.com/reuters/technologyNews\r", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-ibm-results-research/ibm-shares-fall-on-soft-profit-outlook-idUSKBN1F81QV", "country": "US", "domain_rank": 408, "title": "IBM shares fall on soft profit outlook", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:44:00.000+02:00", "replies_count": 0, "uuid": "40d563f2f6075f31f692a0823461ef2519f0efa9"}, "author": "", "url": "https://www.reuters.com/article/us-ibm-results-research/ibm-shares-fall-on-soft-profit-outlook-idUSKBN1F81QV", "ord_in_thread": 0, "title": "IBM shares fall on soft profit outlook", "locations": [], "entities": {"persons": [{"name": "sherri scribner", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ibm", "sentiment": "negative"}, {"name": "supantha mukherjee", "sentiment": "negative"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "international business machines", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 2:46 PM / Updated 7 hours ago IBM shares fall on soft profit outlook Supantha Mukherjee 3 Min Read \n(Reuters) - Shares in International Business Machines fell 2.6 percent on Friday as analysts judged a “disappointing” full-year profit forecast showed that the company would take more time to get back on a path of steady growth. \nIBM’s results call after U.S. markets closed on Thursday forecast an operating profit of at least $13.80 per share for 2018, compared with $13.80 in 2017 and market expectations of $13.92, according to Thomson Reuters I/B/E/S. \nThe outlook came on the back of the computing services and hardware firm’s first quarterly revenue growth in six years. \n“While slight growth is a modest positive, we were largely underwhelmed by IBM’s results, and felt the numbers showed IBM has much more work to do to turn the ship around,” Deutsche Bank analyst Sherri Scribner wrote in a client note. \nIBM’s 3.6 percent revenue growth came mostly from a 71 percent jump in sales of its new Z14 mainframe, which was launched in September, and a 27 percent growth in its cloud business. \nSeveral analysts pointed to the traditionally cyclical nature of mainframe revenues, which tend to surge for 2-4 quarters after the launch of a new launch before falling off. \nBut some said the growth since IBM launched its Z14 in September hinted at a different outcome. \nMorgan Stanley analyst Katy Huberty said the new mainframe’s heightened focus on security was attracting more new customers and workloads rather than just upgrades at a time when cyberattacks and chip vulnerability are at the top of buyer’s list of concerns. \nA growth in the mainframe business might also improve IBM’s margins. The company’s fourth-quarter adjusted gross margins of 49.5 percent fell short of market expectations of 50.8 percent. \nIBM has been moving away from its shrinking hardware and software businesses to what it calls “strategic imperatives,” which includes the contribution of cloud computing – where companies use a remote network of data centers instead of their own hardware to cut costs. \nStrategic Imperatives grew 14 percent in the quarter. \n“Looking under the surface, however, it appears that strategic imperatives excluding Systems only grew 6 percent, largely driven by the lack of Cognitive Solutions growth,” Berenberg analyst Josep Bori said. \n“This is clearly not enough to offset the declining core business,” he said. \nIBM said it would continue to “maintain a high level of investment” in 2018 as it boosts its capabilities on cloud, mobile, cybersecurity and data analytics. \n“This quarter was another important step in the right direction with 2018 a major prove me year for IBM to show the turnaround story is viable, which we believe it is, albeit at a snail-like pace,” GBH Insights analyst Daniel Ives said. Reporting by Supantha Mukherjee and Arjun Panchadar in Bengaluru; editing by Patrick Graham", "external_links": [], "published": "2018-01-19T16:44:00.000+02:00", "crawled": "2018-01-19T17:03:28.019+02:00", "highlightTitle": ""}