{"organizations": [], "uuid": "8162bad24082f58635a95ad55418da2e559566dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-national-instruments-reports-record-quarterly-and-annual-revenue-and-operating-income.html", "country": "US", "domain_rank": 767, "title": "National Instruments Reports Record Quarterly and Annual Revenue and Operating Income", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:03:00.000+02:00", "replies_count": 0, "uuid": "8162bad24082f58635a95ad55418da2e559566dc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-national-instruments-reports-record-quarterly-and-annual-revenue-and-operating-income.html", "ord_in_thread": 0, "title": "National Instruments Reports Record Quarterly and Annual Revenue and Operating Income", "locations": [], "entities": {"persons": [], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "gaap", "sentiment": "none"}, {"name": "non-gaap", "sentiment": "none"}, {"name": "nati", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Company Delivered on Operating Leverage Target in 2017 and Declares Increased Dividend in Q1 2018\nQ4 2017 Highlights\nRevenue of $350 million, up 6 percent year over year GAAP and non-GAAP gross margin of 76 percent GAAP net loss of $(24) million which includes a $70 million tax reform charge Non-GAAP net income of $56 million Fully diluted GAAP EPS of $(0.18) and fully diluted non-GAAP EPS of $0.43 EBITDA of $74 million Cash and short-term investments of $412 million as of Dec. 31, 2017\nAUSTIN, Texas--(BUSINESS WIRE)-- National Instruments (Nasdaq: NATI) today announced Q4 2017 revenue of $350 million, up 6 percent year over year.\nGAAP net loss for Q4 was $(24) million, with fully diluted loss per share of $(0.18), and non-GAAP net income was $56 million, with non-GAAP fully diluted earnings per share (\"EPS\") of $0.43. Because of the Tax Cuts and Jobs Act of 2017, NI recognized a one-time charge of $70 million in Q4 from the estimated impact of the inclusion of foreign earnings and revaluation of deferred tax assets and liabilities. This one-time charge is being excluded from NI's non-GAAP results. EBITDA, or Earnings Before Interest, Taxes, Depreciation and Amortization, was $74 million for Q4.\nIn Q4, GAAP and non-GAAP gross margin was 76 percent and total GAAP operating expenses were $207 million, up 5 percent year over year. Total non-GAAP operating expenses were up 2 percent year over year at $193 million. GAAP operating margin was 16 percent in Q4, with GAAP operating income of $57 million, up 16 percent year over year. Non-GAAP operating margin was 21 percent in Q4, the highest quarterly result in 20 years. Non-GAAP operating income was $73 million, up 22 percent year over year.\n“I am proud of what we accomplished in 2017. We set goals to drive revenue and make significant progress toward our operating model, and through focus we met those goals,” said Alex Davern, NI president and CEO. “Our employees did a tremendous job in 2017 executing on key business decisions. I believe we have an opportunity to continue to drive both growth and improved profitability in 2018.”\nKaren Rapp, NI CFO, said, “I am pleased with our record performance in Q4 and for the year. We delivered record revenue and operating income, made significant progress toward our operating model, and reported the highest non-GAAP net income in company history. We plan to continue executing on our disciplined capital allocation strategy.”\nGeographic revenue in U.S. dollar terms for Q4 2017 compared with Q4 2016 was up 3 percent in the Americas, up 9 percent in APAC and up 8 percent in EMEIA. Excluding the impact of foreign currency exchange, revenue was up 3 percent in the Americas, up 8 percent in APAC and up 5 percent in EMEIA. Historical revenue from these three regions can be found on NI’s investor website at www.ni.com/nati .\nIn Q4 2017, the value of the company’s total orders was up 5 percent year over year; orders under $20,000 were up 3 percent year over year; and orders over $20,000 were up 7 percent year over year.\nAs of Dec. 31, 2017, NI had $412 million in cash and short-term investments. During Q4, NI paid $27 million in dividends. The NI Board of Directors approved a dividend of $0.23 per share payable on March 5, 2018, to stockholders of record on Feb. 12, 2018.\nThe company’s non-GAAP results exclude the impact of stock-based compensation, amortization of acquisition-related intangibles, acquisition-related transaction costs, taxes levied on the transfer of acquired intellectual property, foreign exchange loss on acquisitions, restructuring charges, and tax reform charges. Reconciliations of the company’s GAAP and non-GAAP results are included as part of this news release.\nFY 2017 Highlights\nRevenue of $1.29 billion, up 5 percent year over year GAAP and non-GAAP gross margin of 75 percent GAAP net income of $52 million, down 37 percent year over year Non-GAAP net income of $160 million, up 33 percent year over year Fully diluted GAAP EPS of $0.40 Fully diluted non-GAAP EPS of $1.22 EBITDA of $219 million Dividends paid of $110 million, or $0.84 per share\nIn 2017, GAAP operating expenses were $815 million, up 3 percent year over year, and non-GAAP operating expenses were $769 million, flat year over year. GAAP net income in 2017 was $52 million, down 37 percent year over year, and non-GAAP net income in 2017 was $160 million, up 33 percent year over year.\nGuidance\nNI currently expects Q1 revenue to be in the range of $305 million to $335 million, which would be a new Q1 record at the midpoint. The company currently expects that GAAP fully diluted EPS will be in the range of $0.11 to $0.25 for Q1, with non-GAAP fully diluted EPS expected to be in the range of $0.19 to $0.33. For 2018, NI estimates its non-GAAP effective tax rate to be approximately 17 percent.\nNon-GAAP Presentation\nIn addition to disclosing results determined in accordance with GAAP, NI discloses certain non-GAAP operating results and non-GAAP information that exclude certain charges. In this news release, the company has presented its gross profit, gross margin, operating expenses, operating income, operating margin, income before income taxes, provision for income taxes, net income and basic and fully diluted EPS for the three-month and 12-month periods ending Dec. 31, 2017 and 2016, on a GAAP and non-GAAP basis. NI is also providing guidance on its non-GAAP fully diluted EPS and expected effective tax rate. The company is not able to provide guidance on its GAAP tax rate or a related reconciliation without unreasonable efforts since its future GAAP tax rate depends on its future stock price and related information that is not currently available.\nWhen presenting non-GAAP information, the company includes a reconciliation of the non-GAAP results to the GAAP results. Management believes that including the non-GAAP results assists investors in assessing the company’s operational performance and its performance relative to its competitors. The company presents these non-GAAP results as a complement to results provided in accordance with GAAP, and these results should not be regarded as a substitute for GAAP. Management uses these non-GAAP measures to manage and assess the profitability and performance of its business and does not consider stock-based compensation expense, amortization of acquisition-related intangibles, acquisition-related transaction costs, taxes levied on the transfer of acquired intellectual property, foreign exchange loss on acquisitions, restructuring charges, and tax reform charges in managing its operations. Specifically, management uses non-GAAP measures to plan and forecast future periods; to establish operational goals; to compare with its business plan and individual operating budgets; to measure management performance for the purposes of executive compensation, including payments to be made under bonus plans; to assist the public in measuring the company’s performance relative to the company’s long-term public performance goals; to allocate resources; and, relative to the company’s historical financial performance, to enable comparability between periods. Management also considers such non-GAAP results to be an important supplemental measure of its performance.\nThis news release discloses the company’s EBITDA for the three-month and 12-month periods ending Dec. 31, 2017 and 2016. The company believes that including the EBITDA results assists investors in assessing the company’s operational performance relative to its competitors. A reconciliation of EBITDA to GAAP net income is included with this news release.\nConference Call Information and Availability of Presentation Materials\nInterested parties can listen to the Q4 2017 earnings conference call with NI management today, Jan. 30, at 4:00 p.m. CT at www.ni.com/call . Replay information is available by calling (855) 859-2056, confirmation code 9473778, shortly after the call through Feb. 2 at 10:00 p.m. CT or by visiting the company’s website at www.ni.com/call . Presentation materials referred to on the conference call can be found at www.ni.com/nati .\nForward-Looking Statements\nThis release contains “ ” including statements regarding believing we have an opportunity to continue to drive both growth and improved profitability in 2018, our plan to continue executing on our disciplined capital allocation strategy, our Q1 revenue guidance, expecting that GAAP fully diluted EPS will be in the range of $0.11 to $0.25 for Q1, with non-GAAP fully diluted EPS expected to be in the range of $0.19 to $0.33, and estimating its non-GAAP effective tax rate to be approximately 17 percent in 2018. These statements are subject to a number of risks and uncertainties, including the risk of adverse changes or fluctuations in the global economy, foreign exchange fluctuations, fluctuations in demand for NI products including orders from NI’s largest customer, component shortages, delays in the release of new products, the company’s ability to effectively manage its operating expenses, manufacturing inefficiencies and the level of capacity utilization, the impact of any recent or future acquisitions by NI, expense overruns, adverse effects of price changes or effective tax rates. Actual results may differ materially from the expected results.\nThe company directs readers to its Form 10-K for the year ended Dec. 31, 2016, its Form 10-Q for the quarter ended Sept. 30, 2017 and the other documents it files with the SEC for other risks associated with the company’s future performance.\nAbout NI\nNI ( www.ni.com ) empowers engineers and scientists with a software-centric platform that incorporates modular hardware and an expansive ecosystem. This proven approach puts users firmly in control of defining what they need to accelerate their system design within test, measurement and control. NI’s solution helps build high-performance systems that exceed requirements, quickly adapt to change and ultimately improve the world. (NATI-F)\nNational Instruments, NI and ni.com are trademarks of National Instruments. Other product and company names listed are trademarks or trade names of their respective companies.\nNational Instruments Condensed Consolidated Balance Sheets (in thousands) December 31, December 31, 2017 2016 (unaudited) Assets Current assets: Cash and cash equivalents $ 290,164 $ 285,283 Short-term investments 121,888 73,117 Accounts receivable, net 248,825 228,686 Inventories, net 184,592 193,608 Prepaid expenses and other current assets 48,621 53,953 Total current assets 894,090 834,647 Property and equipment, net 249,715 260,456 Goodwill 266,783 253,197 Intangible assets, net 123,293 108,663 Other long-term assets 32,553 39,601 Total assets $ 1,566,434 $ 1,496,564 Liabilities and Stockholders' Equity Current liabilities: Accounts payable and accrued liabilities $ 49,733 $ 48,800 Accrued compensation 43,309 27,743 Deferred revenue - current 120,638 115,577 Other current liabilities 23,782 32,997 Other taxes payable 31,793 34,958 Total current liabilities 269,255 260,075 Long-term debt $ — $ 25,000 Deferred income taxes 33,609 45,386 Liability for uncertain tax positions 10,158 11,719 Income tax payable - long-term 81,515 — Deferred revenue - long-term 33,742 29,752 Other long-term liabilities 10,134 10,413 Total liabilities $ 438,413 $ 382,345 Stockholders' equity: Preferred stock $ — $ — Common stock 1,310 1,292 Additional paid-in capital 829,979 771,346 Retained earnings 313,241 376,202 Accumulated other comprehensive loss (16,509 ) (34,621 ) Total stockholders' equity 1,128,021 1,114,219 Total liabilities and stockholders' equity $ 1,566,434 $ 1,496,564 National Instruments Condensed Consolidated Statements of Income (in thousands, except per share data, unaudited) Three Months Ended Years Ended December 31, December 31, 2017 2016 2017 2016 Net sales: Product $ 320,257 $ 300,218 $ 1,173,476 $ 1,116,703 Software maintenance 29,494 28,314 115,910 111,476 Total net sales 349,751 328,532 1,289,386 1,228,179 Cost of sales: Product 82,874 81,468 318,863 306,730 Software maintenance 2,717 1,264 9,461 6,391 Total cost of sales 85,591 82,732 328,324 313,121 Gross profit 264,160 245,800 961,062 915,058 Operating expenses: Sales and marketing 119,586 115,006 477,921 461,236 Research and development 60,060 57,461 231,761 235,706 General and administrative 27,202 24,082 105,602 98,390 Total operating expenses 206,848 196,549 815,284 795,332 Operating income 57,312 49,251 145,778 119,726 Other income (expense): Interest income 767 335 2,276 1,122 Net foreign exchange (loss) gain (732 ) (3,162 ) 892 (4,632 ) Other (expense) income, net (609 ) 471 (1,566 ) (1,581 ) Income before income taxes 56,738 46,895 147,380 114,635 Provision for income taxes 81,020 17,746 94,969 31,901 Net (loss) income $ (24,282 ) $ 29,149 $ 52,411 $ 82,734 Basic (loss) earnings per share $ (0.19 ) $ 0.23 $ 0.40 $ 0.64 Diluted (loss) earnings per share $ (0.18 ) $ 0.23 $ 0.40 $ 0.64 Weighted average shares outstanding - Basic 130,886 129,108 130,300 128,453 Diluted 132,113 129,503 131,387 129,008 Dividends declared per share $ 0.21 $ 0.20 $ 0.84 $ 0.80 National Instruments Condensed Consolidated Statements of Cash Flows (in thousands, unaudited) Years Ended December 31, 2017 2016 Cash flow from operating activities: Net income $ 52,411 $ 82,734 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation and amortization 72,695 73,390 Stock-based compensation 29,145 25,832 Tax benefit from deferred income taxes (5,774 ) (5,430 ) Purchase price adjustment — 1,585 Net change in operating assets and liabilities 75,965 22,088 Net cash provided by operating activities 224,442 200,199 Cash flow from investing activities: Capital expenditures (30,256 ) (44,425 ) Capitalization of internally developed software (41,662 ) (31,859 ) Additions to other intangibles (2,384 ) (2,342 ) Acquisitions, net of cash received — (549 ) Purchases of short-term investments (87,735 ) (39,097 ) Sales and maturities of short-term investments 39,627 47,769 Net cash used by investing activities (122,410 ) (70,503 ) Cash flow from financing activities: Proceeds from revolving line of credit — 15,000 Principal payments on revolving line of credit (25,000 ) (27,000 ) Proceeds from issuance of common stock 29,094 28,907 Repurchase of common stock — (5,635 ) Dividends paid (109,551 ) (102,897 ) Other (842 ) — Net cash used by financing activities (106,299 ) (91,625 ) Impact of changes in exchange rates on cash 9,148 (3,917 ) Net change in cash and cash equivalents 4,881 34,154 Cash and cash equivalents at beginning of period 285,283 251,129 Cash and cash equivalents at end of period $ 290,164 $ 285,283 The following tables provide details with respect to the amount of GAAP charges related to stock-based compensation, amortization of acquisition-related intangibles, acquisition-related transaction costs, restructuring charges, foreign exchange loss on acquisitions, taxes levied on the transfer of acquired intellectual property and tax reform charges that were recorded in the line items indicated below (unaudited) (in thousands)\nThree Months Ended Years Ended December 31, December 31, 2017 2016 2017 2016 Stock-based compensation Cost of sales $ 714 $ 568 $ 2,628 $ 2,210 Sales and marketing 3,035 2,636 11,559 11,057 Research and development 2,462 2,131 9,014 8,876 General and administrative 1,585 859 5,944 3,623 Provision for income taxes (2,934 ) (1,125 ) (10,322 ) (7,322 ) Total $ 4,862 $ 5,069 $ 18,823 $ 18,444 Amortization of acquisition intangibles Cost of sales $ 1,444 $ 1,725 $ 6,092 $ 9,346 Sales and marketing 529 497 2,009 2,638 Research and development 204 273 1,017 1,088 Other income, net — — — — Provision for income taxes (491 ) 855 (2,148 ) 2,162 Total $ 1,686 $ 3,350 $ 6,970 $ 15,234 Acquisition transaction costs, restructuring charges, and other Cost of sales $ 222 $ 74 $ 1,210 $ 327 Sales and marketing 2,972 42 10,990 183 Research and development 1,693 170 3,509 818 General and administrative 1,097 50 1,900 367 Foreign exchange gain (loss) 1 — — — 94 Other income (loss), net 2 — — — 2,475 Provision for income taxes (1,754 ) (94 ) (5,407 ) (1,452 ) Total $ 4,230 $ 242 $ 12,202 $ 2,812 (1) Foreign exchange losses on acquisitions were $0 and $94 for the years ended December 31, 2017 and 2016, respectively (2) Taxes levied on the transfer of acquired intellectual property were $0 and $2,475 for the years ended December 31, 2017 and 2016, respectively Acquisition-related fair value adjustments 1 Net sales $ — $ 904 $ — $ 904 Cost of sales — 681 — 681 Provision for income taxes — (567 ) — (567 ) Total $ — $ 1,018 $ — $ 1,018 (1) Acquisition-related fair value adjustments includes effects of our finalization of the business combination accounting for our Micropross acquisition including reduction in revenue and increase in cost of sales due to the respective write-down of acquired deferred revenue and step-up of acquired inventory National Instruments Reconciliation of GAAP to Non-GAAP Measures (in thousands, unaudited) Three Months Ended Years Ended December 31, December 31, 2017 2016 2017 2016 Reconciliation of Net Sales to Non-GAAP Net Sales Net sales, as reported $\n349,751 $ 328,532 $ 1,289,386 $ 1,228,179 Acquisition-related fair value adjustments — 904 — 904 Non-GAAP net sales $\n349,751 $ 329,436 $ 1,289,386 $ 1,229,083 Reconciliation of Gross Profit to Non-GAAP Gross Profit Gross profit, as reported $ 264,160 245,800 961,062 915,058 Stock-based compensation 714 568 2,628 2,210 Amortization of acquisition intangibles 1,444 1,725 6,092 9,346 Acquisition transaction costs and restructuring charges 222 74 1,210 327 Acquisition-related fair value adjustments — 1,585 — 1,585 Non-GAAP gross profit $ 266,540 249,752 970,992 928,526 Non-GAAP gross margin 76 % 76 % 75 % 76 % Reconciliation of Operating Expenses to Non-GAAP Operating Expenses Operating expenses, as reported $ 206,848 196,549 815,284 795,332 Stock-based compensation (7,082 ) (5,626 ) (26,517 ) (23,556 ) Amortization of acquisition intangibles (733 ) (770 ) (3,026 ) (3,726 ) Acquisition transaction costs and restructuring charges (5,762 ) (262 ) (16,399 ) (1,368 ) Non-GAAP operating expenses $ 193,271 189,891 769,342 766,682 Reconciliation of Operating Income to Non-GAAP Operating Income Operating income, as reported $ 57,312 49,251 145,778 119,726 Stock-based compensation 7,796 6,194 29,145 25,766 Amortization of acquisition intangibles 2,177 2,495 9,118 13,072 Acquisition transaction costs and restructuring charges 5,984 336 17,609 1,695 Acquisition-related fair value adjustments — 1,585 — 1,585 Non-GAAP operating income $ 73,269 59,861 201,650 161,844 Non-GAAP operating margin 21 % 18 % 16 % 13 % Reconciliation of Income before income taxes to Non-GAAP Income before income taxes Income before income taxes, as reported $ 56,738 46,895 147,380 114,635 Stock-based compensation 7,796 6,194 29,145 25,766 Amortization of acquisition intangibles 2,177 2,495 9,118 13,072 Acquisition transaction costs and restructuring charges 5,984 336 17,609 1,695 Acquisition-related fair value adjustments — 1,585 — 1,585 Foreign exchange loss on acquisitions — — — 94 Taxes levied on transfer of acquired intellectual property — — — 2,475 Non-GAAP income before income taxes $ 72,695 57,505 203,252 159,322 Reconciliation of Provision for income taxes to Non-GAAP Provision for income taxes Provision for income taxes, as reported $ 81,020 17,746 94,969 31,901 Stock-based compensation 2,934 1,125 10,322 7,322 Amortization of acquisition intangibles 491 (855 ) 2,148 (2,162 ) Acquisition transaction costs, restructuring charges, and other 1,754 661 5,407 2,019 Tax reform charge (69,902 ) — (69,902 ) — Non-GAAP provision for income taxes $ 16,297 18,677 42,944 39,080 Reconciliation of GAAP Net Income, Basic EPS and Diluted EPS to Non-GAAP Net Income, Non-GAAP Basic EPS and Non-GAAP Diluted EPS (in thousands, except per share data, unaudited) Three Months Ended Years Ended December 31, December 31, 2017 2016 2017 2016 Net (loss) income, as reported $ (24,282 ) $ 29,149 $ 52,411 $ 82,734 Adjustments to reconcile net income to non-GAAP net income: Stock-based compensation, net of tax effect 4,862 5,069 18,823 18,444 Amortization of acquisition intangibles, net of tax effect 1,686 3,350 6,970 15,234 Acquisition transaction costs, restructuring, and other, net of tax effect 4,230 242 12,202 2,812 Acquisition-related fair value adjustments — 1,018 — 1,018 Tax reform charge 69,902 — 69,902 — Non-GAAP net income $ 56,398 $ 38,828 $ 160,308 $ 120,242 Basic EPS, as reported $ (0.19 ) $ 0.23 $ 0.40 $ 0.64 Adjustment to reconcile basic EPS to non-GAAP basic EPS:\nImpact of stock-based compensation, net of tax effect 0.04 0.03 0.14 0.14 Impact of amortization of acquisition intangibles, net of tax effect 0.01 0.03 0.05 0.12 Impact of acquisition transaction costs, restructuring, and other, net of tax effect 0.03 0.01 0.09 0.03 Impact of tax reform charge 0.53 — 0.54 — Non-GAAP basic EPS $ 0.42 $ 0.30 $ 1.22 $ 0.93 Diluted EPS, as reported $ (0.18 ) 0.23 $ 0.40 $ 0.64 Adjustment to reconcile diluted EPS to non-GAAP diluted EPS:\nImpact of stock-based compensation, net of tax effect 0.04 0.03 0.14 0.14 Impact of amortization of acquisition intangibles, net of tax effect 0.01 0.03 0.05 0.12 Impact of acquisition transaction costs, restructuring, and other, net of tax effect 0.03 0.01 0.09 0.03 Impact of tax reform charge 0.53 — 0.54 — Non-GAAP diluted EPS $ 0.43 $ 0.30 $ 1.22 $ 0.93 Weighted average shares outstanding - Basic 130,886 129,108 130,300 128,453 Diluted 132,113 129,503 131,387 129,008 National Instruments Reconciliation of Net Income to EBITDA (in thousands, unaudited) Three Months Ended Years Ended December 31, December 31, 2017 2016 2017 2016 Net (loss) income, as reported $ (24,282 ) $ 29,149 $ 52,411 $ 82,734 Adjustments to reconcile net income to EBITDA: Interest income, net (628 ) (155 ) (1,491 ) (349 ) Tax expense 81,020 17,746 94,969 31,901 Depreciation and amortization 17,901 18,226 72,695 73,390 EBITDA $ 74,011 $ 64,966 $ 218,584 $ 187,676 Weighted average shares outstanding - Diluted 132,113 129,503 131,387 129,008 Reconciliation of GAAP to Non-GAAP EPS Guidance (unaudited) Three Months Ended March 31, 2018 Low High GAAP Fully Diluted EPS, guidance $ 0.11 $ 0.25 Adjustment to reconcile diluted EPS to non-GAAP diluted EPS:\nImpact of stock-based compensation, net of tax effect 0.05 0.05 Impact of amortization of acquisition intangibles and acquisition accounting adjustments, net of tax effect 0.01 0.01 Impact of acquisition transaction costs, restructuring, and other, net of tax effect 0.02 0.02 Non-GAAP diluted EPS, guidance $ 0.19 $ 0.33\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006290/en/\nNational Instruments\nMarissa Vidaurri, 512-683-6873\nSource: National Instruments", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ni.com%2Fcall&esheet=51751026&newsitemid=20180130006290&lan=en-US&anchor=www.ni.com%2Fcall&index=2&md5=f36e3853f833411ac414f184fac251d5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ni.com%2Fcall&esheet=51751026&newsitemid=20180130006290&lan=en-US&anchor=www.ni.com%2Fcall&index=3&md5=0a97bbdfa754f4ea15b5f04fb52b08fb", "http://www.businesswire.com/news/home/20180130006290/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ni.com%2Fnati&esheet=51751026&newsitemid=20180130006290&lan=en-US&anchor=www.ni.com%2Fnati&index=1&md5=30078d535894ab51db18e8b475c0ef1e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ni.com&esheet=51751026&newsitemid=20180130006290&lan=en-US&anchor=www.ni.com&index=5&md5=8123faee158a00a401d9065a002e31ff", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ni.com%2Fnati&esheet=51751026&newsitemid=20180130006290&lan=en-US&anchor=www.ni.com%2Fnati&index=4&md5=1a46cc7f165ac24e29aa69aa8a6c8a0d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ni.com&esheet=51751026&newsitemid=20180130006290&lan=en-US&anchor=ni.com&index=6&md5=4cd0131a618174c743784db724782f84"], "published": "2018-01-31T00:03:00.000+02:00", "crawled": "2018-01-31T03:08:34.005+02:00", "highlightTitle": ""}