{"organizations": [], "uuid": "ec2665f9c83d9b25558f359d453998deea8d51a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-gamestop-reports-2017-holiday-sales-results.html", "country": "US", "domain_rank": 767, "title": "GameStop Reports 2017 Holiday Sales Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-12T16:00:00.000+02:00", "replies_count": 0, "uuid": "ec2665f9c83d9b25558f359d453998deea8d51a8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-gamestop-reports-2017-holiday-sales-results.html", "ord_in_thread": 0, "title": "GameStop Reports 2017 Holiday Sales Results", "locations": [], "entities": {"persons": [{"name": "dan dematteo", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "nintendo switch", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "collectibles grapevine", "sentiment": "none"}], "organizations": [{"name": "gamestop", "sentiment": "negative"}, {"name": "g amestop corp.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "gme", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Global Same Store Sales Increase 11.8%; 13.7% in the U.S. and 7.9% Internationally\nSales Growth Fueled by Strong Performance in New Hardware, New Software, Accessories and Collectibles\nGRAPEVINE, Texas, Jan. 12, 2018 (GLOBE NEWSWIRE) -- G ameStop Corp. (NYSE:GME) , a global family of specialty retail brands that makes the most popular technologies affordable and simple, today reported sales results for the nine-week holiday period ended December 30, 2017.\nTotal global sales for the holiday period were $2.77 billion, a 10.6% increase compared to the 2016 holiday period. Total comparable store sales increased 11.8%, growing 13.7% in the U.S. and 7.9% internationally. Worldwide omnichannel sales increased 21.5%.\nDan DeMatteo, interim chief executive officer, stated, “We are pleased with our sales performance during the important holiday period, driven by strength in the Nintendo Switch and Xbox One X, and a solid increase in our collectibles business. Our results demonstrate our customers’ enthusiastic response to new products and our ability to execute on strategically targeted promotions.”\nGaming Business Update\nNew hardware sales increased 38.3%, driven by continued strong demand for the Nintendo Switch and the launch of Microsoft’s Xbox One X. Sales of new video game software increased 7.3%, largely attributed to the success of Activision’s Call of Duty: WWII and continued strength in Nintendo Switch titles. Pre-owned sales declined 8.1%, as customers shifted their spend to compelling new video game and collectibles products. Video game accessories sales grew 33.7%, primarily related to demand for Nintendo Switch accessories.\nNon-Physical Gaming Business Update\nCollectibles sales increased 19.4% to $211.3 million, driven by strong performance across apparel and toys. Digital sales and non-GAAP digital receipts increased 36.7% and 6.7%, respectively, excluding the 2016 holiday period revenues from Kongregate which was divested in July 2017. On a reported basis, digital sales increased 4.6%, while non-GAAP digital receipts increased 2.2%. Technology Brands sales, which are not included in comparable store sales, decreased 18.6%, driven by limited availability of the iPhone X and changes made by AT&T to the compensation structure in 2017.\nGuidance Update\nGiven the product category mix of sales in the holiday period, GameStop expects to deliver adjusted earnings per share near the middle of its previously announced full-year 2017 guidance of $3.10 to $3.40. The company also expects full-year fiscal 2017 comparable store sales to increase between four and six percent compared to the comparable fifty-three-week period. The Company continues to anticipate fiscal 2017 adjusted operating earnings for its Technology Brands business to be in the range of $75 million to $90 million. This guidance excludes any year-end impairments and store closing charges, as well as any tax effects related to the recently enacted tax reform legislation.\nIn conjunction with the Company’s annual impairment testing of goodwill and other intangible assets, which is performed in the fourth quarter and is not yet finalized, the Company expects to record non-cash impairment charges in the range of $350 million to $400 million, primarily related to its Technology Brands business. The impairment charges are primarily due to the negative impact of a longer upgrade cycle for new mobile devices and the changes made by AT&T to the compensation structure in 2017. The charges do not affect the Company’s cash flows or liquidity position.\nThe Company anticipates reporting fourth quarter and full fiscal year 2017 results in late March, and will provide fiscal 2018 guidance at that time.\nAbout GameStop\nGameStop Corp. (NYSE:GME), a Fortune 500 company headquartered in Grapevine, Texas, is a global, multichannel video game, consumer electronics and wireless services retailer. GameStop operates more than 7,400 stores across 14 countries. The company's consumer product network also includes www.gamestop.com ; Game Informer® magazine, the world's leading print and digital video game publication; and ThinkGeek, www.thinkgeek.com , the premier retailer for the global geek community featuring exclusive and unique video game and pop culture products. Our Technology Brands segment includes 1,500 Simply Mac, Spring Mobile AT&T and Cricket stores. Spring Mobile, www.springmobile.com , sells all of AT&T’s products and services, including DIRECTV and offers pre-paid wireless services, devices and related accessories through its Cricket branded stores in select markets in the U.S. Simply Mac, www.simplymac.com , sells the full line of Apple products, including laptops, tablets, and smartphones and offers Apple certified warranty and repair services.\nGeneral information about GameStop Corp. can be obtained at the company’s corporate website. Follow @GameStop and @GameStopCorp on Twitter and find GameStop on Facebook at www.facebook.com/GameStop .\nNon-GAAP Measures\nAs a supplement to our financial results presented in accordance with U.S. generally accepted accounting principles (GAAP), GameStop may use certain non-GAAP measures, such as adjusted operating earnings, adjusted net income, digital receipts and constant currency. We believe these non-GAAP financial measures provide useful information to investors in evaluating our core operating performance. Adjusted operating earnings and adjusted net income exclude the effect of items such as asset impairments, store closure costs, severance, as well as acquisition and divestiture costs. GameStop defines digital receipts as the full amount paid by the customer for digital content at the time of sale and/or the value attributed to digital content when physical and digital products are sold combined. Results reported as constant currency exclude the impact of fluctuations in foreign currency exchange rates by converting our local currency financial results using the prior period exchange rates and comparing these adjusted amounts to our current period reported results. Our definition and calculation of non-GAAP measures may differ from that of other companies. Non-GAAP financial measures should be viewed in addition to, and not as an alternative for, the company's reported GAAP financial results.\nSafe Harbor\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are based upon management’s current beliefs, views, estimates and expectations, including as to the Company’s industry, business strategy, goals and expectations concerning its market position, future operations, margins, profitability, capital expenditures, liquidity and capital resources and other financial and operating information. Such statements include without limitation those about the Company’s outlook for fiscal 2017, future financial and operating results, projections, expectations and other statements that are not historical facts. Forward-looking statements are subject to significant risks and uncertainties and actual results may differ material", "external_links": ["https://www.globenewswire.com/Tracker?data=XStr5GdIWqlk2-d2EIx12CnEro9XARfdhWBfCK4GuKIIDO2cwDYBInVjTBXKAMGj4aJN9BoUS9cOQ8--RyZt7hAY4Ifopr44YUNOVWxK0h8=", "https://www.globenewswire.com/Tracker?data=9_NKRdNOuVKCBR_lIiS4Ti4wGGMQFYTRXHsAjVDkHIRQJ4t1OZwVm2j6gv6ub2YBtEE38LTS73FsDB-yugpBbg==", "https://www.globenewswire.com/Tracker?data=CNF-knWv5p4pUOzOosZHIAxQ14FT344I9cXe1Lh9oNqkniGyQta3F560mlj2KMQRyuwcec4wcKXJeWh_qcPm2o4kFIyQX3gw0JJw81cfigA=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/11c1a527-4fed-45c1-8f66-aadabb1b1564", "https://www.globenewswire.com/Tracker?data=_CBNEYGxZ2y5flJL-abDkY0PsuZtuqGsU9S0wpjyLEhuCPPJCIJN639HxmahXodR3-gu39Xbc9Wh2YQkZtu-GnMNu36tMY7WocWJinrhoKw=", "https://www.globenewswire.com/Tracker?data=V8nnq8f3FUFN_ckv3p-BQwt-FZkcBODNKVKIjoXv4CKPhDbDoLhaXI_bKtk_D78xhPMlPXTjvNsxTdwQLfgBKzBckQKMYx97gqT0Q7WYtNs=", "https://www.globenewswire.com/Tracker?data=Ekt9_Tvq5T5J4pkxDOzeJL8J4RIW-J9eC5VTs8sMTBBsYh_L7-J0_aJjl6IeaczWEL6JV06gPE3mY2sq5_kCc8NZlnkCxPq7ej83QaOSHGA="], "published": "2018-01-12T16:00:00.000+02:00", "crawled": "2018-01-12T17:52:38.001+02:00", "highlightTitle": ""}