{"organizations": [], "uuid": "97f7de3a05910c80ff1670a78ee013f1e71475c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/middle-east", "section_title": "Middle East Insight", "url": "https://www.reuters.com/article/us-iran-rallies-un/u-n-meeting-on-iran-protests-called-by-u-s-criticized-at-security-council-idUSKBN1EU27S", "country": "US", "domain_rank": 408, "title": "U.N. meeting on Iran protests called by U.S. criticized at Security Council", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T07:53:00.000+02:00", "replies_count": 0, "uuid": "97f7de3a05910c80ff1670a78ee013f1e71475c1"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-iran-rallies-un/u-n-meeting-on-iran-protests-called-by-u-s-criticized-at-security-council-idUSKBN1EU27S", "ord_in_thread": 0, "title": "U.N. meeting on Iran protests called by U.S. criticized at Security Council", "locations": [], "entities": {"persons": [{"name": "nikki haley", "sentiment": "none"}, {"name": "francois delattre", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "united nations security council", "sentiment": "negative"}, {"name": "security council united nations", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "negative"}, {"name": "un", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UNITED NATIONS (Reuters) - A United Nations Security Council meeting on Friday to discuss recent protests in Iran turned into criticism of the United States for requesting to meet on what some member states said was an internal issue for Tehran.\nFrance’s ambassador to the UN said the protests do not threaten international peace and security, in what may be an implicit criticism of the United States.\n“We must be wary of any attempts to exploit this crisis for personal ends, which would have the diametrically opposed outcome to that which is wished,” Ambassador Francois Delattre said.\n“However worrying the events of the last few days in Iran may be, they do not constitute per se a threat to international peace and security.”\nDemonstrations erupted in Iran over a week ago after the government announced plans to raise fuel prices and cut monthly cash handouts to lower-income Iranians. The unrest spread over 80 cities and towns and has resulted in 22 deaths and more than 1,000 arrests, according to Iranian officials.\nThe U.S. Ambassador to the U.N., Nikki Haley, said Iran is “on notice,” after listing what she referred to as slogans chanted by Iranian protesters.\n“The Iranian regime’s contempt for the rights of its people has been widely documented for many years,” said Haley, adding that the United States stood “unapologetically with those in Iran who seek freedom for themselves, prosperity for their families, and dignity for their nation. We will not be quiet. No dishonest attempt to call the protesters ‘puppets of foreign powers’ will change that.”\nIran’s U.N. Ambassador Gholamali Khoshroo told the Security Council that his government has “hard evidence” that recent protests in Iran were “very clearly directed from abroad.”\nKhoshroo also said the United States had abused its power as a permanent member of the Security Council by calling for a meeting to discuss the protests.\n“It is unfortunate that despite the resistance on the part of some of its members, this council has allowed itself to be abused by the current U.S. administration in holding a meeting on an issue that falls outside the scope of its mandate,” he said.\nRussia’s UN ambassador Vassily Nebenzia said the United States was abusing the Security Council’s platform and the meeting was an attempt to use the current Iranian situation to undermine the Iran nuclear deal, which the U.S. administration opposes.\nDiscussing the domestic situation of Iran at the council “does not help resolve the domestic issue of Iran,” said China’s Deputy U.N. Ambassador Wu Haitao.\nReporting by Rodrigo Campos; Writing by Eric Beech; Editing by James Dalgleish\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-06T07:53:00.000+02:00", "crawled": "2018-01-06T11:46:49.080+02:00", "highlightTitle": ""}