{"organizations": [], "uuid": "2180adce60ca99eac96988a69e4c87bed60333d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219666406&w=1200&r=LYNXMPEE0414K", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-bodies-trial/fbi-agent-describes-grisly-warehouse-in-start-of-body-brokers-trial-idUSKBN1EU1V8", "country": "US", "domain_rank": 408, "title": "FBI agent describes grisly warehouse in start of body broker's trial", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T20:54:00.000+02:00", "replies_count": 0, "uuid": "2180adce60ca99eac96988a69e4c87bed60333d2"}, "author": "", "url": "https://www.reuters.com/article/us-usa-bodies-trial/fbi-agent-describes-grisly-warehouse-in-start-of-body-brokers-trial-idUSKBN1EU1V8", "ord_in_thread": 0, "title": "FBI agent describes grisly warehouse in start of body broker's trial", "locations": [], "entities": {"persons": [{"name": "steve friess", "sentiment": "none"}, {"name": "arthur rathburn", "sentiment": "none"}, {"name": "john shiffman", "sentiment": "none"}, {"name": "rathburn", "sentiment": "none"}, {"name": "john neal", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "fbi", "sentiment": "negative"}, {"name": "min read  detroit", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (Reuters) - The warehouse of a Michigan man who sold donated body parts to researchers was littered with dead flies, dog bowls and human remains “frozen together in flesh-on-flesh chunks,” a federal agent testified Friday.\nThe grisly description came during the opening day in the federal trial of businessman Arthur Rathburn, who sold or leased donated body parts, including human heads, to medical researchers for two decades.\nThe buying and selling of body parts for research and education is legal under U.S. law, which does not govern the industry. Current regulations only cover body parts intended for transplant, such as hearts and livers.\nRathburn, however, is charged with defrauding customers by selling them body parts infected with hepatitis and HIV, and with lying to federal agents about shipments.\nDuring opening statements, Assistant U.S. Attorney John Neal told jurors that human remains were stored so haphazardly that Rathburn needed a crowbar to separate frozen parts. Federal Bureau of Investigation agent Leslie Larson testified that during the 2013 search of Rathburn’s warehouse, officials found a filthy scene, with no running water or heat.\n“Body parts were out in the open, in coolers,” Larson testified. “Some of the freezers had heads and torsos, some had arms and legs. Many were frozen together in flesh-on-flesh chunks.”\nFILE PHOTO: Arthur Rathburn is pictured at the University of Michigan in Ann Arbor, Michigan, U.S. in November 1988. REUTERS/Peter Yates/File Photo Rathburn’s lawyer, James Howarth, urged the jury to focus on the documents in the case, not gruesome photographs. He said that Rathburn’s ex-wife, Elizabeth, is “most responsible” for any wrongdoing. She has pleaded guilty to one count of fraud and is expected to testify for the government.\n“This case is so sensitive because the nature of the evidence is going to make us all cringe, make us all uneasy,” Howarth told the jury. “There’s nothing particularly pretty about a deceased body that has been separated into parts, but I would hope no one would have bad feelings toward Mr. Rathburn because of that.”\nThe government’s failure to stop Rathburn sooner, despite a decade of warning signs, was one in a series of stories Reuters reported last year about the largely unregulated body broker industry.\nAs part of the news agency’s examination of the industry, a Reuters reporter was able to purchase two human heads and a cervical spine from a body broker in Tennessee. The deals were struck after just a few emails, at a cost of $900 plus shipping.\nThe series also profiled two Phoenix brokers - one who earned at least $12 million from the sale or use of donated body parts and another who regularly supplied Rathburn. The broker who sold Rathburn body parts, Steve Gore, pleaded guilty to defrauding customers and is expected to testify against Rathburn.\nLast month, Reuters reported that federal agents discovered four preserved fetuses during the search of Rathburn’s warehouse. According to government photographs obtained by the news agency, the fetuses appear to have been in their second trimester.\nThe fetus photographs are not cited in any court filings and it is unclear if they will be presented at trial.\nFriess reported from Detroit and Shiffman reported from Washington. Edited by Blake Morrison\n ", "external_links": [], "published": "2018-01-05T20:54:00.000+02:00", "crawled": "2018-01-05T21:06:16.010+02:00", "highlightTitle": ""}