{"organizations": [], "uuid": "f9198abe2973e29b0e2caf7d353e2d09c4379cc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-shelf-drilling-holdings-ltd-announces-proposed-notes-offering.html", "country": "US", "domain_rank": 767, "title": "Shelf Drilling Holdings, Ltd. Announces Proposed Notes Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:54:00.000+02:00", "replies_count": 0, "uuid": "f9198abe2973e29b0e2caf7d353e2d09c4379cc1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-shelf-drilling-holdings-ltd-announces-proposed-notes-offering.html", "ord_in_thread": 0, "title": "Shelf Drilling Holdings, Ltd. Announces Proposed Notes Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "united arab emirates", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "shelf drilling holdings, ltd", "sentiment": "neutral"}, {"name": "shelf drilling holdings, ltd.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "shelf drilling, ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBAI, United Arab Emirates, Jan. 29, 2018 /PRNewswire/ -- Shelf Drilling Holdings, Ltd. (the \"Company\"), a wholly owned subsidiary of Shelf Drilling, Ltd. (\"Shelf Drilling\"), announced today that it plans to offer, subject to market conditions, approximately $550 million aggregate principal amount of senior notes due 2025 (the \"notes\"). The notes will be guaranteed by certain of the Company's subsidiaries that guarantee its existing indebtedness. It is intended that the net proceeds from the notes offering be used to refinance, repurchase and/or repay certain of our existing indebtedness, including in connection with the previously announced tender offers for the Company's 8.625% Senior Secured Notes due November 2018 (the \"8.625% Notes\") and 9.500% Senior Secured Notes due November 2020 (the \"9.500% Notes\") and to pay related fees and expenses. Any remaining proceeds will be used for general corporate purposes.\nThe notes have not been and will not be registered under the U.S. Securities Act of 1933 (the \"Securities Act\"), any state securities laws or the securities laws of any other jurisdiction, and may not be offered or sold in the United States absent registration or an applicable exemption from registration. Accordingly, the notes are being offered and sold only to persons reasonably believed to be qualified institutional buyers in accordance with Rule 144A under the Securities Act and outside the United States in reliance on Regulation S under the Securities Act.\nThis press release does not constitute an offer to sell, or the solicitation of an offer to buy, any security and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation or sale would be unlawful.\nAbout Shelf Drilling\nShelf Drilling is a leading international shallow water offshore drilling contractor engaged in the provision of equipment and services for the drilling, completion and workover of offshore oil and natural gas wells. Shelf Drilling was founded in 2012 and has established itself as a leader within its industry through its fit-for-purpose strategy and close working relationship with industry leading clients. Certain of Shelf Drilling's common shares are Quote: d on the Norwegian OTC List.\nContact details\nFor questions or comments, please contact Ian Clark, Shelf Drilling, at +971 4 567 3606.\nForward-Looking Statements\nThis press release contains \"forward-looking statements\" which are subject to certain risks, trends and uncertainties. In particular, statements made that are not historical facts may be forward-looking statements. Words such as \"should,\" \"may,\" \"will,\" \"anticipates,\" \"expects,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" \"contemplates\" and similar expressions identify forward-looking statements. Such statements are not guarantees of future performance and are subject to risks and uncertainties that could cause actual results to differ materially from the results projected, expressed or implied by these forward-looking statements. Such forward-looking statements include statements regarding the intention to issue new senior notes and to use offering proceeds to refinance, repurchase and/or repay certain of our existing indebtedness, including in connection with the previously announced tender offers for the Company's 8.625% Notes and 9.500% Notes, and to pay related fees and expenses. Such forward-looking statements speak only as of the date of this press release and the Company does not undertake any obligation to update any forward-looking statements.\nView original content: http://www.prnewswire.com/news-releases/shelf-drilling-holdings-ltd-announces-proposed-notes-offering-300589413.html\nSOURCE Shelf Drilling Holdings, Ltd.", "external_links": ["http://www.prnewswire.com/news-releases/shelf-drilling-holdings-ltd-announces-proposed-notes-offering-300589413.html"], "published": "2018-01-29T15:54:00.000+02:00", "crawled": "2018-01-29T17:35:17.022+02:00", "highlightTitle": ""}