{"organizations": [], "uuid": "468a77b02266fb6ee38bc3577b090787ed146b27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-playbuzz-names-groupms-rob-norman-to-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Playbuzz Names GroupM's Rob Norman to Its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-31T16:00:00.000+02:00", "replies_count": 0, "uuid": "468a77b02266fb6ee38bc3577b090787ed146b27"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-playbuzz-names-groupms-rob-norman-to-its-board-of-directors.html", "ord_in_thread": 0, "title": "Playbuzz Names GroupM's Rob Norman to Its Board of Directors", "locations": [], "entities": {"persons": [{"name": "playbuzz", "sentiment": "negative"}, {"name": "rob norman", "sentiment": "negative"}, {"name": "rob norm", "sentiment": "negative"}, {"name": "norman", "sentiment": "none"}, {"name": "shaul olmert", "sentiment": "none"}, {"name": "rob", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "playbuzz", "sentiment": "none"}], "organizations": [{"name": "playbuzz names groupm", "sentiment": "negative"}, {"name": "groupm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 31, 2018 /PRNewswire/ -- Storytelling platform Playbuzz announced today that Rob Norman has joined the company's board of directors.\nNorman continues to act as a Senior Advisor to GroupM following his retirement as Global Chief Digital Officer after 31 years in various roles at WPP-held companies. His collaboration with Playbuzz is unaffiliated with GroupM.\n\"Rob is a digital advertising pioneer who we are incredibly excited to welcome to Playbuzz's Board of Directors,\" said Shaul Olmert, co-founder and CEO of Playbuzz. \"He is a true proponent of the evolution of digital content and inherently understands what makes consumers tick. We look forward to tapping into his expertise as we continue to bring the most engaging, interactive branded experiences to leading agencies - and their clients - worldwide.\"\nThe Playbuzz platform is relied upon by top brands who partner with the company to create interactive branded content campaigns that Playbuzz then distributes at scale to its existing network of tens of thousands of publishers. Those publishers create engaging, visually-stunning editorial content with the platform that results in meaningful consumption and improved performance.\n\"I am delighted to join Playbuzz's board of directors,\" said Rob Norman, Senior Advisor at GroupM. \"In the digital world, impressions are cheap and harnessing users' attention spans has never been more important. Playbuzz has developed creative, high-performing products, as well as trusted partnerships with premium publishers, that enable brand owners to achieve engagement at scale.\"\nIn January of 2017, Playbuzz ranked #7 in comScore's Lifestyles Category and #27 in the company's list of Top 100 Video Properties, positioning it as a leader in providing high-quality, broad distribution of its innovative forms of native advertising. Branded content campaigns powered by Playbuzz garner metrics high above industry standards, such as an average of 97%+ in-item viewability confirmed by MOAT and 2-4 minute average session times (as compared to the 15 second industry average). These campaigns attract 99% human, non-fraudulent traffic as confirmed by White Ops, and have resulted in an average 86% brand lift, as reported by Nielsen.\nAbout Playbuzz\nFounded in 2012 by Shaul Olmert and Tom Pachys, Playbuzz is a leading storytelling platform used by the world's premium publishers and brands to author, distribute and monetize interactive stories that drive audience engagement.\nThe company has over 150 employees across its offices in New York, London, Tel Aviv, Hamburg, São Paulo, Moscow, Lviv and Los Angeles. Playbuzz's rapid growth is fueled by the adoption of its platform by partners who use the company's interactive storytelling and real-time analytics tools to engage users, boost their reach, raise brand awareness, improve monetization capabilities, and optimize content for maximum interaction. The Playbuzz network reaches hundreds of millions of users every month through its partners and through its owned and operated website, playbuzz.com .\nIn September 2017, Playbuzz announced a $35M round of strategic funding led by Viola Group with participation from existing investors Saban Ventures, Disney, 83North, Carmel Ventures and firstime.\nFor more information:\nhttp://www.playbuzz.com/\nFacebook: http://www.facebook.com/playbuzz / http://www.facebook.com/playbuzzbusiness\nTwitter: @Playbuzz / @PlaybuzzBiz\nRelated Links\nhttp://www.playbuzz.com/\nhttp://www.facebook.com/playbuzz\nhttp://www.facebook.com/playbuzzbusiness\nContact Information:\nPlaybuzz:\nLauren Gumport\nDirector of Communications\nlauren@playbuzz.com\n+972-58-499-7227\nView original content with multimedia: http://www.prnewswire.com/news-releases/playbuzz-names-groupms-rob-norman-to-its-board-of-directors-300591000.html\nSOURCE Playbuzz", "external_links": ["http://www.prnewswire.com/news-releases/playbuzz-names-groupms-rob-norman-to-its-board-of-directors-300591000.html", "https://twitter.com/Playbuzz", "http://www.playbuzz.com/", "https://www.playbuzz.com/", "http://www.facebook.com/playbuzz", "http://www.facebook.com/playbuzzbusiness", "https://twitter.com/PlaybuzzBiz"], "published": "2018-01-31T16:00:00.000+02:00", "crawled": "2018-01-31T17:17:27.009+02:00", "highlightTitle": ""}