{"organizations": [], "uuid": "1addfd08bc0c538e14368f689d0f4efe7635ead8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-bonanza-creek-energy-provides-operational-update-announces-year-end-2017-proved-reserves-and-2018-guidance.html", "country": "US", "domain_rank": 767, "title": "Bonanza Creek Energy Provides Operational Update, Announces Year-End 2017 Proved Reserves and 2018 Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.996, "site_type": "news", "published": "2018-01-29T15:00:00.000+02:00", "replies_count": 0, "uuid": "1addfd08bc0c538e14368f689d0f4efe7635ead8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-bonanza-creek-energy-provides-operational-update-announces-year-end-2017-proved-reserves-and-2018-guidance.html", "ord_in_thread": 0, "title": "Bonanza Creek Energy Provides Operational Update, Announces Year-End 2017 Proved Reserves and 2018 Guidance", "locations": [], "entities": {"persons": [{"name": "jack vaughn", "sentiment": "none"}], "locations": [{"name": "french lake", "sentiment": "none"}, {"name": "bonanza creek", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}], "organizations": [{"name": "bonanza creek energy", "sentiment": "negative"}, {"name": "bonanza creek energy, inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Accelerating development program in the second half of 2018 Expected Rockies production growth of 20% in 2018 and in excess of 50% in 2019 Fourth quarter 2017 production of 14.8 MBoe per day, exceeds the high end of previous Company guidance Year-end 2017 proved reserves increased 13% to 102.0 MMBoe Enhanced completions continue to outperform expectations\nDENVER, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Bonanza Creek Energy, Inc. (NYSE:BCEI) (“Bonanza Creek” or the “Company”) announces a number of positive developments regarding its preliminary fourth quarter operational results and its 2018 budget.\nJack Vaughn, Chairman of the Board of Directors, commented, “Much has been accomplished since Bonanza Creek exited from bankruptcy last spring. In 2017, the results of our first enhanced completions exceeded our expectations. In 2018, we will accelerate and expand this learning process with additional slick-water tests and by applying enhanced completions to our northern and eastern acreage.\n“In 2017, we secured our strategically important leasehold position in French Lake. In 2018, we will delineate this key acreage position with enhanced completions and lay the ground work for its future development. We will also consider the sale of non-core assets and will focus any potential acquisition activity on expanding our core footprint in the DJ Basin.\n“In 2017, we reduced our annualized G&A and LOE by approximately $20 million. Further efficiency improvements will continue to be a focus for the Company, with our per-unit costs benefitting from production growth in 2018 and beyond. During the year, we also took important steps to improve our access to gas processing in the DJ Basin. We believe these steps will result in improved costs, greater reliability, and greater optionality than available to many other operators in the basin while enhancing the value of our Rocky Mountain Infrastructure system.\n“Finally, in 2017, we began a dual-track process to secure permanent leadership for our Company and to consider strategic transactions. While the transaction with SandRidge Energy was unsuccessful, this process has provided significant insights regarding the quality of our team, our assets, and the desires of our shareholders. We remain dedicated to maximizing shareholder value and are focused on securing permanent leadership in the coming months.\n“As we enter 2018, we are confident about our future, and thankful for the tireless efforts of our team and ongoing support of our shareholders. We look forward to more frequent and more detailed engagement with our shareholders as the year progresses.”\nFourth Quarter 2017 Operational Update\nDuring the fourth quarter of 2017, the Company produced an average of 14.8 MBoe per day, exceeding the high-end of the Company’s previous guidance of 14.2 MBoe per day. This outperformance is primarily attributed to lower line pressures in the Company’s Rocky Mountain Infrastructure (“RMI”) system and better than expected performance from wells utilizing enhanced completion designs.\nMidstream Contracts Provide Lower Line Pressure and Operational Flexibility\nOn November 11, 2017, the Company completed the previously announced connection with third-party gas processor Sterling Energy Investments, LLC (“Sterling”). Since that time, the Company has moved approximately 13% of its total Wattenberg gross gas production to Sterling. This connection, combined with added compression, reduced line pressures in the Company’s RMI system by up to 40%, resulting in improved production from both new and existing wells.\nTo ensure line pressures remain low as Bonanza Creek adds new wells to sales, the Company also recently entered into an agreement with Cureton Front Range LLC (“Cureton”), which will add a third gas processing partner connected directly to the Company’s RMI gathering system. Subject to the Company’s contractual obligations, the three separate processors and eight offtake points from the RMI system will allow flexibility in moving gas to the most advantageous locations, providing additional production flow assurance.\nThe agreement with Cureton is a 15-year gas gathering and processing contract under which Bonanza has dedicated approximately 22,000 net acres, or approximately 33% of its Wattenberg acreage. Based on the timetable in the agreement, the Company expects to commence gathering service with Cureton late in the second quarter of 2018 and to commence processing service at Cureton’s new 60 MMcf per day cryogenic gas plant in the second half of 2018. The agreement contains no minimum volume commitments and provides favorable netbacks compared to the Company’s other processing contracts.\n“DUC” Wells Production Outperforming Type Curve\nThe Company continues to be encouraged by the production from its North Platte 44-13 standard reach lateral (“SRL”) wells, which were completed in July 2017. The performance of these wells continues to exceed type curve projections and they are now forecast to produce an average EUR of 500 MBoe per 4,100 foot SRL well. An updated investor presentation on the Company website compares the performance of these four West SRL wells to (a) an offset pad that utilized a legacy completion design and (b) a legacy West SRL type curve.\nDuring the fourth quarter of 2017, Bonanza Creek completed five additional wells on its legacy acreage, consisting of three extended reach lateral (“XRL”) wells and two SRLs. These wells are located on the Company’s central legacy acreage and, with approximately 75 days of data, the early production, GOR, and tubing pressures are encouraging for wells with an enhanced completion design. One of these SRL wells tested a slick-water completion with 1,500 pounds of proppant per foot. Early production data from this slick-water test is particularly encouraging as its production results are significantly outperforming those from offsetting wells with gel completions and similar proppant loading.\nRecord Drilling and Completion Efficiencies\nBonanza Creek recently finished drilling the last of the eight XRL wells on its French Lake acreage with one well setting a Company record drill time of fewer than 4.5 days from spud to total depth. The first of these eight French Lake wells has been recently turned online. The remaining seven French Lake wells are expected to be completed and turned online in the first half of 2018. In its western legacy acreage, the Company recently drilled and completed its eight-well SRL State North Platte F-26 pad. On this pad, the Company achieved a new SRL drilling record of 3.4 days from spud to total depth. Regarding completions, the Company achieved impressive efficiencies by pumping 336 stages in 24 days, including five days of pumping 18 stages and one day that achieved a Company record of 20 stages. All eight wells were recently turned online.\nYear-End 2017 Proved Reserves\nAs of year-end 2017, the Company reports preliminary proved reserves of 102.0 MMboe, a 13% increase from year-end 2016. The Company's year-end 2017 proved reserves were comprised of 52.9 MMBbls of oil, 22.8 MMBbls of NGLs, and 157.7 Bcf of natural gas and were 53% proved developed. Proved undeveloped reserves accounted for 48.1 MMBoe of the total proved reserves, a 20% increase in equivalent volumes from year-end 2016. The increase in proved undeveloped reserves is a combination of new PUD cases added during the year and improved production performance expectations for previously booked PUD wells due to the utilization of enhanced completion design. The Company reported all-in reserve replacement excluding price revisions of 202%. The PV-10 value using SEC pricing for estimated total proved reserves as of December 31, 2017 was $598 million, of which $470 million was attributable to its proved developed reserves. (1) As of year-end 2017, the Company estimates that its exit-to-exit corporate PDP decline rate will be approximately 30% in 2018, 20% in 2019, and 15% in 2020. The table below summarizes estimated proved reserves for 2017. Year-end 2017 reserves were prepared by Netherland, Sewell & Associates, Inc.\nProved Reserves As of December\n31, 2016 As of December 31, 2017 Reserve Category Equiv.\n(MMBoe) % of\nTotal Oil\n(MMBbls) NGLs\n(MMBbls) Gas\n(Bcf) Equiv.\n(MMBoe) % of\nTotal YoY\nChange Proved Developed 50.6 56 % 25.8 12.7 92.7 53.9 53 % 7 % Proved Undeveloped 40.1 44 % 27.1 10.1 65.0 48.1 47 % 20 % Total Proved Reserves 90.7 100 % 52.9 22.8 157.7 102.0 100 % 13 % Regional Summary Rocky Mountain 78.0 86 % 46.6 21.2 136.2 90.5 89 % 16 % Mid-Continent 12.7 14 % 6.3 1.6 21.5 11.5 11 % (10) % Total Proved Reserves 90.7 100 % 52.9 22.8 157.7 102.0 100 % 13 % Note: Totals may not foot due to rounding\n2018 Capital and Production Guidance\nIn 2018, the Company plans to accelerate development while testing enhanced completion designs on large scale pads throughout the Company’s acreage position. The program contemplates running one rig in the first half of 2018 with a second rig added at mid-year to coincide with additional gas processing capacity from both Cureton and DCP.\nThe first rig is planned to drill large scale pads of up to nine wells throughout the legacy acreage position. Two of the pads drilled in the first half of the year will be completed using slick-water to further test and validate the improved performance from slick-water compared to historic gel completion designs. One of these pads is located in the western legacy acreage with the second pad located in the eastern legacy acreage. Data gathered from these tests will help inform completion design in the back half of the year. The addition of the second rig will provide additional data to inform completion techniques and development assumptions throughout the acreage position going forward.\nDue to the large pads and anticipated third-quarter increase in activity, approximately 55% of the new drills for the year are expected to be turned online in 2019. The 2018 program is expected to grow Wattenberg annual production by approximately 20% in 2018 and annual production from this program is expected to grow by greater than 50% in 2019. Given that production growth is expected to be back-end-weighted in 2018, the Company is expecting unit costs for LOE, Midstream expense, and G&A to show sequential improvement throughout 2018 and into 2019 as greater production volumes are realized.\nAllocated capital associated with this program is expected to be approximately $280 – $320 million, which will support drilling 90 gross wells and turning online 55 gross wells. Of the wells drilled, approximately 43 are planned as XRLs, 7 as medium reach lateral (“MRL”) wells, and 40 as SRLs. Of the 55 turned-online wells, 31 are expected to be XRLs, 2 as MRLs, and 22 as SRLs. XRL, MRL and SRL wells are targeted to cost $5.4 million, $4.2 million, and $3.0 million, respectively.\nThe 2018 program contemplates debt to EBITDAX leverage peaking at approximately 1.0x assuming $50 WTI. (2) Assuming strip pricing as of January 23, 2018, and the continuation of a two-rig program into 2019, the Company expects peak leverage to remain below 1.0x during 2018 and 2019, and to be cash flow positive by year-end 2019.\nThe table below provides production, capital and operating cost guidance for 2018. Production growth in 2018 is expected to be back-end-weighted due to tie-ins from our larger pads.\nGuidance Summary Three Months Ended\nMarch 31, 2018 Twelve Months Ended\nDecember 31, 2018 Production (MBoe/d) 16.0 – 16.6 17.7 – 18.7 LOE ($/Boe) $5.00 – $6.00 Midstream expense ($/Boe) $1.40 – $1.80 Recurring cash G&A ($MM) (3) $32 – $34 Production taxes (% of pre-derivative realization) 7% – 8% Total CAPEX ($MM) $280 – $320 Rockies Oil Differential (4) $5.85 off WTI (3) Recurring cash G&A guidance is a non-GAAP measure that is defined as GAAP G&A expense less stock based compensation and anticipated costs for permanent CEO compensation. The Company does not guide to GAAP G&A expense as it has excessive uncertainty due to the stock based compensation portion of GAAP G&A. Please refer to the Non-GAAP disclosure at the end of this release for information regarding Recurring cash G&A.\n(4) Assumes strip pricing as of January 23, 2018.\nAn investor presentation with additional detail has also been posted to the IR section of the Company’s website at www. Bonanzacrk.com .\nFourth Quarter Earnings Release and Conference Call\nThe Company announces that it is scheduled to release its fourth quarter 2017 operating and financial results after market close on March 14, 2018 and will host a conference call to discuss these results on March 15, 2018 at 9:00 a.m. Mountain Time. A live webcast and replay of this event will be available on the Investor Relations section of the Company’s website at www.bonanzacrk.com . A dial-in replay of the event will be available through March 29, 2018. Dial-in information for the conference call is included below.\nType Phone Number Passcode Live participant 877-793-4362 1899728 Replay 855-859-2056 1899728 Non-GAAP Disclosure\nPV-10\nYear-end pre-tax PV-10 value is a non-GAAP financial measures as defined by the SEC. Bonanza Creek believes that the presentation of pre-tax PV-10 value is relevant and useful to its investors because it presents the discounted future net cash flows attributable to reserves prior to taking into account corporate future income taxes and the Company's current tax structure. The Company further believes investors and creditors use pre-tax PV-10 values as a basis for comparison of the relative size and value of its reserves as compared with other companies.\nThe GAAP financial measure most directly comparable to pre-tax PV-10 is the standardized measure of discounted future net cash flows (\"Standardized Measure\"). Bonanza Creek is not yet able to provide a reconciliation of pre-tax PV–10 to Standardized Measure because the discounted future income taxes associated with the Company's reserves is not yet calculable. The Company expects to include a full reconciliation of pre-tax PV-10 to the GAAP financial measure of Standardized Measure in its Annual Report on Form 10-K for the year ended December 31, 2017, which it intends to file with the SEC on or about March 14, 2018.\nRecurring Cash G&A\nThe Company defines recurring cash G&A as GAAP G&A after adjusting for the impact of non-cash stock compensation expense and non-recurring items. This non-GAAP measure is used by management and investors as additional information as noted above and is subject to the same limitations of analytical tools as noted above and should not be considered as a GAAP substitute for general and administrative expense.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. All statements, other than statements of historical facts, included in this press release that address activities, events or developments that the Company expects, believes or anticipates will or may occur in the future are forward-looking statements. These statements are based on certain assumptions made by the Company based on management’s experience, perception of historical trends and technical analyses, current conditions, anticipated future developments and other factors believed to be appropriate and reasonable by management. When used in this press release, the words “will,” “potential,” “believe,” “estimate,” “intend,” “expect,” “may,” “should,” “anticipate,” “could,” “plan,” “predict,” “project,” “profile,” “model” or their negatives, other similar expressions or the statements that include those words, are intended to identify forward-looking statements, although not all forward-looking statements contain such identifying words. These statements include statements regarding development and completion expectations and strategy; decreasing operating and capital costs; impact of the Company's reorganization; and updated 2017 guidance. Such statements are subject to a number of assumptions, risks and uncertainties, many of which are beyond the control of the Company, that may cause actual results to differ materially from those implied or expressed by the forward-looking statements, including the following: changes in natural gas, oil and NGL prices; general economic conditions, including the performance of financial markets and interest rates; drilling results; shortages of oilfield equipment, services and personnel; operating risks such as unexpected drilling conditions; ability to acquire adequate supplies of water; risks related to derivative instruments; access to adequate gathering systems and pipeline take-away capacity; and pipeline and refining capacity constraints. Further information on such assumptions, risks and uncertainties is available in the Company’s SEC filings. We refer you to the discussion of risk factors in our Annual Report on Form 10-K for the year ended December 31, 2016, filed on March 16, 2017, and other filings submitted by us to the Securities Exchange Commission. The Company’s SEC filings are available on the Company’s website at www.bonanzacrk.com and on the SEC’s website at www.sec.gov . All of the forward-looking statements made in this press release are qualified by these cautionary statements. Any forward-looking statement speaks only as of the date on which such statement is made, including guidance, and the Company undertakes no obligation to correct or update any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by applicable law.\nAbout Bonanza Creek Energy, Inc.\nBonanza Creek Energy, Inc. is an independent oil and natural gas company engaged in the acquisition, exploration, development and production of onshore oil and associated liquids-rich natural gas in the United States. The Company’s assets and operations are concentrated primarily in the Rocky Mountain region in the Wattenberg Field, focused on the Niobrara and Codell formations, and in southern Arkansas, focused on oily Cotton Valley sands. The Company’s common shares are listed for trading on the NYSE under the symbol: “BCEI.” For more information about the Company, please visit www.bonanzacrk.com . Please note that the Company routinely posts important information about the Company under the Investor Relations section of its website.\nFor further information please contact:\nJames R. Edwards\nDirector – Investor Relations\njedwards@bonanzacrk.com\n720-440-6136", "external_links": ["https://www.globenewswire.com/Tracker?data=7LA4a9wSdpjwNwypScCL7VRiK7JEuqo-tHMfEAa_SS25SQX5d3L73U68b90MbyOwGkgA8d34uvU72F-863_vNooTt3F5VBmjgb5QwomozRA=", "https://www.globenewswire.com/Tracker?data=0lAt5lpGCxsQnQhW9k7wK4FygU3RscKCNjX3cWpPv9tXvHOKb1pjoRftdKk1bZ51D8GundEZuQ_Xdv9K35wF-gtnHZQ3LMyW2qe0_g3-dAo="], "published": "2018-01-29T15:00:00.000+02:00", "crawled": "2018-01-29T16:52:49.014+02:00", "highlightTitle": ""}