{"organizations": [], "uuid": "b6664207d4a9f4ed57002df128d3531880be8b2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227002172&w=1200&r=LYNXMPEE0U18E", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/us-britain-china/our-business-is-truth-china-editor-tells-bbc-to-open-up-on-womens-pay-idUKKBN1FK2BZ", "country": "US", "domain_rank": 408, "title": "'Our business is truth' - China editor tells BBC to open up on women's pay", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T18:11:00.000+02:00", "replies_count": 0, "uuid": "b6664207d4a9f4ed57002df128d3531880be8b2b"}, "author": "", "url": "https://uk.reuters.com/article/us-britain-china/our-business-is-truth-china-editor-tells-bbc-to-open-up-on-womens-pay-idUKKBN1FK2BZ", "ord_in_thread": 0, "title": "'Our business is truth' - China editor tells BBC to open up on women's pay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 4:02 PM / Updated 21 minutes ago 'Our business is truth': China editor tells BBC to open up on women's pay Estelle Shirbon 4 Min Read \nLONDON (Reuters) - The BBC is failing to live up to its own editorial mission to report the truth by denying it has a problem with gender discrimination on pay, its former China editor Carrie Gracie told the British parliament’s media committee on Wednesday. \nGracie quit her post earlier this month in protest at the discrepancy between her pay and that of male counterparts, going public with her grievances to try to jolt the public broadcaster into addressing unequal pay. \n“Our business is truth,” an emotional Gracie told the committee of lawmakers, who are conducting an investigation into BBC pay. \n“If we’re not prepared to look at ourselves honestly, how can we be trusted to look at anything else in our reporting honestly?” \nGracie’s revolt laid bare tensions that had been simmering within the BBC since it was forced last July to name its best paid on-air staff and disclose their pay bands, revealing that two-thirds of them were men of whom several were far better paid than female peers. \nReaching 95 percent of British adults every week through its many outlets, the BBC is a pillar of national life but as such is held to high standards by the public and rival media. The pay controversy has been a major news story in Britain. \nBBC managers deny there is systemic gender discrimination on pay at the corporation, which is funded by a licence fee levied on TV viewers in Britain. Director-General Tony Hall and other senior executives are due to appear before the committee later on Wednesday. \nOn Tuesday, the BBC published a review of on-air staff conducted by PwC which found no evidence of gender bias in decision-making on pay. \nBBC Women, a group of 170 staff, said it had no confidence in the PwC review. FILE PHOTO - A man enters BBC New Broadcasting House in London November 11, 2012. REUTERS/Luke MacGregor \n“AS WELL AS ANY MAN” \nGracie, who has reported on China for three decades and speaks fluent Mandarin, said she explicitly demanded equal pay with male peers when she was appointed to the job of China editor in late 2013. She was given assurances that her demand had been met. \n“I knew I would do the job at least as well as any man,” she said. \nGiven that background, it came as a shock to her last July when she discovered that she was paid significantly less than her two direct male counterparts. \nGracie told the lawmakers she had been offered a hefty pay rise but had turned it down because her fight was not about money, it was about ensuring the BBC changed its practices and delivered equal pay for equal work for all men and women. \nShe said that in the five months following the pay disclosures, she had sought redress internally but had run up against obfuscation from management. \nShe said that having spent much of her career standing up to censorship, harassment and intimidation by the Chinese state, she could not live with herself if she did not stand up for the truth within the BBC. \n“The profoundest sense I have of who I am as a BBC journalist is to report the truth as I find it. If they don’t report the truth how can we?” she said. \n“None of these things would stand as a piece of BBC journalism. We have standards, and it really pains me and hurts me that the corporate machine is not living up to our values.” Editing by Stephen Addison", "external_links": [], "published": "2018-01-31T18:11:00.000+02:00", "crawled": "2018-01-31T18:51:17.009+02:00", "highlightTitle": ""}