{"organizations": [], "uuid": "6d39509362e45644fe295512301fde0b8447260c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-broadsoft-obtains-antitrust-clearance-for-pending-acquisition-by-cisco.html", "country": "US", "domain_rank": 767, "title": "BroadSoft Obtains Antitrust Clearance for Pending Acquisition by Cisco", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T01:03:00.000+02:00", "replies_count": 0, "uuid": "6d39509362e45644fe295512301fde0b8447260c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-broadsoft-obtains-antitrust-clearance-for-pending-acquisition-by-cisco.html", "ord_in_thread": 0, "title": "BroadSoft Obtains Antitrust Clearance for Pending Acquisition by Cisco", "locations": [], "entities": {"persons": [{"name": "cisco", "sentiment": "negative"}, {"name": "broadsoft", "sentiment": "none"}], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "gaithersburg", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "broadsoft obtains antitrust clearance for pending acquisition", "sentiment": "negative"}, {"name": "broadsoft", "sentiment": "none"}, {"name": "cisco", "sentiment": "none"}, {"name": "u.s. department of justice", "sentiment": "none"}, {"name": "federal trade commission", "sentiment": "none"}, {"name": "cisco systems, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GAITHERSBURG, Md., Jan. 18, 2018 (GLOBE NEWSWIRE) -- BroadSoft, Inc. (NASDAQ:BSFT) today announced that it received notice from the U.S. Department of Justice and the Federal Trade Commission granting early termination of the waiting period under the U.S. Hart-Scott-Rodino Antitrust Improvements Act of 1976, as amended, in connection with its pending merger with a wholly-owned subsidiary of Cisco Systems, Inc. (Cisco).\nAs previously announced, BroadSoft entered into an agreement to be acquired by Cisco for $55 per share, in cash, in exchange for each share of common stock of BroadSoft, or an aggregate purchase price of approximately $1.9 billion net of cash, assuming fully diluted shares including conversion of debt. The acquisition has been approved by the board of directors of each company. The transaction is expected to close in the first quarter of calendar year 2018, subject to approval by BroadSoft’s stockholders, remaining foreign regulatory approval, and other customary closing conditions.\nBroadSoft has scheduled a Special Meeting of Stockholders for January 25, 2018 at 9:00 a.m. Eastern Time to vote on the proposed transaction. The BroadSoft Board of Directors unanimously recommends that stockholders vote “FOR” the proposal to adopt the merger agreement with Cisco.\nAbout BroadSoft\nBroadSoft is the technology innovator in cloud PBX, unified communications, team collaboration, and contact center solutions for businesses and service providers across 80 countries. We are a cloud unified communications leader with an open, mobile and secure platform trusted by 25 of the world's top 30 service providers by revenue. Our BroadSoft Business application suite empowers users and teams to share ideas and work simply to achieve breakthrough performance. For additional information, visit www.BroadSoft.com .\nForward-Looking Statements\nThe statements in this press release contain forward-looking statements regarding the proposed acquisition of BroadSoft by Cisco Systems, Inc. (“Cisco”). These statements are based on plans, estimates and projections at the time BroadSoft makes the statements, and readers should not place undue reliance on them. In some cases, readers can identify forward-looking statements by the use of forward-looking terms “may” and “will.” Forward-looking statements involve inherent risks and uncertainties, and BroadSoft cautions readers that a number of important factors could cause actual results to differ materially from those contained in any such forward-looking statement. Factors that could cause actual results to differ materially from those described in this press release include, among others: the occurrence of any event, change or other circumstances that could give rise to the termination of the merger agreement and the inability to complete the proposed merger due to the failure to obtain stockholder approval for the proposed merger or the failure to satisfy other conditions to completion of the proposed merger, including that a governmental entity may prohibit, delay or refuse to grant approval for the consummation of the proposed merger. Additional risks are described in BroadSoft’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2017, and its subsequently filed reports with the Securities and Exchange Commission (“SEC”). Readers are cautioned not to place undue reliance on the forward-looking statements included in the statements in this press release , which speak only as of the date hereof. BroadSoft does not undertake to update any of these statements in light of new information or future events.\nAdditional Information and Where to Find It\nIn connection with the proposed transaction, BroadSoft filed a definitive proxy statement relating to the proposed transaction with the SEC on December 13, 2017, as supplemented on January 10, 2018. The definitive proxy statement has been mailed to BroadSoft stockholders in connection with the proposed transaction. BEFORE MAKING ANY VOTING DECISION, INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE DEFINITIVE PROXY STATEMENT AND ANY OTHER DOCUMENTS TO BE FILED WITH THE SEC IN CONNECTION WITH THE PROPOSED MERGER OR INCORPORATED BY REFERENCE IN THE PROXY STATEMENT BECAUSE THEY CONTAIN IMPORTANT INFORMATION ABOUT THE PROPOSED TRANSACTION. Investors and security holders may obtain free copies of the definitive proxy statement and other related documents filed with the SEC at the SEC’s web site at www.sec.gov , on BroadSoft’s Investor Relations website at www.investor.broadsoft.com or by contacting BroadSoft Investor Relations at (561) 404-2130.\nBroadSoft, Cisco and their respective directors and executive officers may be deemed participants in the solicitation of proxies from the stockholders of BroadSoft in connection with the proposed transaction. Information regarding the special interests of BroadSoft’s directors and executive officers in the proposed transaction is included in the proxy statement described above. These documents are available free of charge at the SEC’s web site at www.sec.gov and from BroadSoft’s Investor Relations as described above. Information about Cisco’s directors and executive officers can be found in Cisco’s definitive proxy statement filed with the SEC on October 25, 2017, annual report on Form 10-K filed with the SEC on September 7, 2017, Form 8-K filed with the SEC on December 14, 2017, Form 8-K filed with the SEC on December 12, 2017, Form 8-K filed with the SEC on September 18, 2017 and Form 8-K filed with the SEC on March 13, 2017. You can obtain a free copy of these documents at the SEC’s website at www.sec.gov or by accessing Cisco’s Investor Relations website at http://investor.cisco.com .\nContact Information\nFor further information contact:\nInvestor Relations:\nChris Martin\n+1-561-404-2130\ncmartin@broadsoft.com\nMedia Contact:\nNiaobh Levestam\n+240-720-9643\nnlevestam@broadsoft.com\nSource:BroadSoft, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=udr0pOsix-E3tmkt_SRxDypsz1zcTkp3qHD3XnbPz1L3JrFlHwq_-vDxC-2sgL1cE637LQqK4I8jtOr0embwEutNVA2atSoqmj2QzCTtUMG1hEK_b9gXAiQx_nomWPA_2IqyZmb6QuMDWo8RTYDfcfJgyNuJG-63s8B2vcdQK5sCdt23USrUBpQ6lQjR-NEq", "https://www.globenewswire.com/Tracker?data=EA6S-fJ0Oh9zsY0T1C8kCh2lTrvZviHpkcDX1Au3eacD-Be-No1oj0iXg5-YVRVxBCXIBXGm7mGRKmCDfDHyPynbWCLzXZJ3O1dIits7aXx1ulc37XemeRbGBGeBXXjGy7pFibYEJEtZ4ek2XyOG7A==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/b93263aa-ed60-465c-bcf5-6dd540ceb037", "https://www.globenewswire.com/Tracker?data=EA6S-fJ0Oh9zsY0T1C8kClbPCgmi91N0sKL4aXD1IbJGA_dJmHjExPDKoheikSzQCvJdXkOrL0sTDriLq1VxKwZkNbcGdjJsRmhmE92XM_JQuINRHc2zdwHKdKlCGhdqeEXahLdBktMNAafAMW-i7A==", "https://www.globenewswire.com/Tracker?data=9suh1lwLkRDkiSVXO8rQVlfPd8cSEzz4gCSAcuPsOa3Opaa747Jlkvz3jqx2ECR62mezH1BvEQGmCRmdweEk4fxekGrziLb9U0PsFFmwq7eWW_Mrguyb8MbTLZlaA4GnABrDYfugO6-LNFvcTIubntOYs7qHiq-Wi3wExF-vWPdcS9DYPd7BKsLVaw630Vqe", "https://www.globenewswire.com/Tracker?data=EA6S-fJ0Oh9zsY0T1C8kCiaT0ksB4BXf_fBqgYxTp7EGW-h2O1VV1wk8FICv6L4eu08OdzA5SgnpR_gl5Aj0k5m4kfaNFf-pCgIVqNjzELJ5sPziw2XoqI2aFQ_T7RLaT_SMyCSUvulUlqyGerPPOQ==", "https://www.globenewswire.com/Tracker?data=7QUhiP41XMD4P4HhdXDJQjux3wa0eRndMEy8bq91ieo1Bo3bMJRMUO8lyBdeSEEU4yRcXIUcTb2y5QTowTSbuyDRecc-eVj5VthqxTzYm1U=", "https://www.globenewswire.com/Tracker?data=FPnXXrX4Mq0lfYqrAy3tzQm_DwD4nh01qCYS8liX4q14d5qp06tV4Va8gZNP9EYKPIPzAdqAnmjA5q7An0E_Hg==", "https://www.globenewswire.com/Tracker?data=v3dnrFRjya3zfu64jBNbrsdu3nz4838WMbHOpTvCKaX4JqMkTCb00D7fEJWVS8KXd8RrQeSaNcyJ_NsOXNWATxncEmGR1rfxkQXpQJ6mWIc="], "published": "2018-01-19T01:03:00.000+02:00", "crawled": "2018-01-19T02:36:45.000+02:00", "highlightTitle": ""}