{"organizations": [], "uuid": "24046046531142cebf16c554572b9ff710489152", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224531210&w=1200&r=LYNXMPEE0M1GD", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-soccer-worldcup-2026/north-american-2026-world-cup-bid-yet-to-get-government-guarantees-idUSKBN1FC2D2", "country": "US", "domain_rank": 408, "title": "North American 2026 World Cup bid yet to get government guarantees", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T18:55:00.000+02:00", "replies_count": 0, "uuid": "24046046531142cebf16c554572b9ff710489152"}, "author": "", "url": "https://www.reuters.com/article/us-soccer-worldcup-2026/north-american-2026-world-cup-bid-yet-to-get-government-guarantees-idUSKBN1FC2D2", "ord_in_thread": 0, "title": "North American 2026 World Cup bid yet to get government guarantees", "locations": [], "entities": {"persons": [{"name": "victor montagliani", "sentiment": "none"}, {"name": "sunil gulati", "sentiment": "none"}, {"name": "simon evans", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "central america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "fifa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Less then two months from the deadline for submission of their proposal, the tri-nation North American bid to host the 2026 World Cup has not secured the government guarantees on visa-free travel plus work permit and tax exemptions demanded by FIFA.\nBid officials say, however, that they have the support of all three governments for their joint proposal and expect to have the guarantees, part of over 70,000 pages of contracts, in place by the March 16 deadline.\nThe U.S. wants to host the 2026 tournament in a joint bid with Canada and Mexico, who would also have to commit to the government guarantees for their proposal to be accepted by world soccer’s governing body FIFA.\n“We will have those (guarantees) in place in time, they are not all done yet,” joint bid chairman Sunil Gulati told reporters on Tuesday.\nCanadian Victor Montagliani, president of CONCACAF which governs the game in North and Central America and the Caribbean, said getting the guarantees was not in doubt but was a slow process.\n“You are not dealing with one person who is going to sign off on all the documents, you are dealing with multiple authorities... they are so many layers you have to deal with,” he said.\n“It is not necessarily tricky from a ‘it isn’t going to happen’ it just takes a lot of time and you have to talk to a lot of people and get a lot of people to sign off.”\nMorocco is the only other country to have put forward a bid for the finals, which will be the first to feature an expanded 48-team format.\nFIFA wants a visa-free environment, or at least non-discriminatory visa procedures while the work permit exemptions apply to anyone involved with the World Cup and tax exemptions relate to soccer’s governing body and its subsidiaries.\nSIMILAR EXEMPTIONS Although FIFA has asked for - and received - similar exemptions in the past, their inclusion in a revamped World Cup bid process means the U.S. government of President Donald Trump will need to sign off on them.\nGulati said the administration had been fully supportive of the bid but was not sure if Trump would personally be involved in the final presentation, to FIFA congress, in Moscow in June.\n“I certainly cannot comment on the President’s schedule for June but we have had clear support from the White House on our bid and the government guarantees we need,” he said.\n“We certainly want the support of the government and we will have that in every way. Whether that includes the personal participation at the actual final presentation I can’t comment on that,” Gulati added.\nGulati, who will be replaced as president of the U.S. Soccer Federation in February but will continue his FIFA Council and World Cup bid roles, said the North America bid was low-risk for soccer’s governing body coming after Russia 2018 and Qatar 2022.\n“They are not easy World Cups to organize... part of our appeal is the certainty we provide for the first 48 team tournament,” he said.\n“Being risk-averse is part of our story. We think the certainty and risk-aversion we can provide for the central piece of revenue for FIFA going forward is pretty compelling,” he added.\nFIFA produced new bidding criteria after the organization was heavily criticized over the selection process for the 2018 and 2022 World Cup finals, won by Russia and Qatar respectively.\nFormal submission of the completed bids has to be made by March 16 and FIFA will decide whether to select one of the candidate bids at its congress in June 2019, or to re-open the process to other regions if none of the bids are accepted.\nThe United States hosted the 1994 World Cup and Mexico staged the tournament in 1970 and 1986.\nReporting by Simon Evans, editing ", "external_links": [], "published": "2018-01-23T18:55:00.000+02:00", "crawled": "2018-01-23T19:02:06.038+02:00", "highlightTitle": ""}