{"organizations": [], "uuid": "adfb750b90d75070bcd071e4eb0824ab52dca6a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WY551_CMOPep_SOC_20180111125921.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/cmo-today-super-bowl-memories-google-shopping-still-upsetting-rivals-facebook-bans-crypto-ads-1517404073", "country": "US", "domain_rank": 387, "title": "CMO Today: Super Bowl Memories; Google Shopping Still Upsetting Rivals; Facebook Bans Crypto Ads", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.088, "site_type": "news", "published": "2018-01-31T16:07:00.000+02:00", "replies_count": 0, "uuid": "adfb750b90d75070bcd071e4eb0824ab52dca6a9"}, "author": "Lara O’Reilly", "url": "https://www.wsj.com/articles/cmo-today-super-bowl-memories-google-shopping-still-upsetting-rivals-facebook-bans-crypto-ads-1517404073", "ord_in_thread": 0, "title": "CMO Today: Super Bowl Memories; Google Shopping Still Upsetting Rivals; Facebook Bans Crypto Ads", "locations": [], "entities": {"persons": [{"name": "budweis", "sentiment": "none"}, {"name": "joe namath", "sentiment": "none"}, {"name": "budweiser", "sentiment": "none"}, {"name": "farrah fawcett", "sentiment": "none"}], "locations": [], "organizations": [{"name": "facebook bans crypto", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "coca-cola", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "adweek", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Good morning. Is it just me, or can you hear a faint clip-clopping sound? Is that a familiar fetlock I spy? Neigh! It’s not the Clydesdales actually trotting their way into the Super Bowl ad breaks after Budweiser said they’d be kept off TV this year, is it? Yes, yes it is. Adweek has more .\nYou and Me Got a Whole Lot of History While we’re on the subject of Super Bowl icons, do spare some time today to take a stroll down memory lane with this WSJ video, chronicling how game-night ads have become as much of a feature as the football itself. A 30-second ad slot during the first Super Bowl in 1967 went for around $42,000—now they go for more than that per second. And while you might recall some risk-takers like Coca-Cola’s 1972 “Hilltop,” do you remember the innuendo-filled Noxzema Shave Cream, featuring footballer Joe Namath, who was very excited about letting “Charlie’s Angels” star Farrah Fawcett cream his face? Then Apple’s “1984” sparked a creative revolution among advertisers, who began to make the Super Bowl the centerpiece of their marketing—none more so than Budweiser-owner Anheuser-Busch. The Clydesdales! Spuds MacKenzie! The Bud Bowl! Bud-we s-er! Whassup! Will any of this year’s ads feature in Super Bowl nostalgia videos in ten years time, I wonder? I get the feeling viewers are going to get their freak on for Morgan Freeman and Peter Dinklage’s lip sync battle in the combined spot for PepsiCo’s Doritos and Mountain Dew .\nS-H-O-PP-I-N-G, We’re Shopping Last summer, Europe’s antitrust regulator slapped Google with a record $2.7 billion fine and ordered the search engine to treat competing shopping services “no less favorably” than its own. While Google is appealing the decision, the company took steps to comply with the ruling by creating a bidding system where rivals and Google’s own shopping service compete for the product-ad slots that sit atop its search results. But its competitors still aren’t happy shoppers , WSJ reports. Data from search analytics firm Searchmetrics suggests in the U.K., for example, just 0.4% of product-ad spots go to competitors. Several of Google’s comparison-shopping rivals—including Kelkoo and Compare—are now asking the EU’s competition regulators to put forward a new remedy, not least because it can be so costly to outbid Google they can barely make any money even if they do win the auction. And besides that, some rivals also allege Google is demoting their websites in organic search results since the EU ruling, too. The EU is currently assessing the complaints and Google’s first regular report on the remedy measures, which was submitted Monday.\nPump and Dump The James Altucher “crypto genius” ads were becoming so rampant on the web in recent months that I was going to stick my neck out and say he had become this year’s Trivago lady. But I might have to withdraw that call now, after Facebook announced Tuesday it is banning all ads that promote cryptocurrencies and initial coin offerings. That also includes ads on Instagram and the Facebook Audience Network, affecting other third-party apps and sites. Facebook says the policy is “intentionally broad” while it works out how to weed out the scammers and detect misleading advertising practices. Keep an eye out for how other online advertising platforms react. Your move, Google!\nAll Change at Virtue Vice announced Tuesday that Mike Germano, its chief digital officer and co-founder of Carrot Creative, the digital ad agency the company acquired in 2013, would not be returning , TheWrap first reported. Mr. Germano had been placed on leave after the New York Times reported on sexual harassment allegations made against him. In a statement provided to TheWrap, Mr. Germano said his departure was part of a long-planned merger of Carrot and Vice’s other in-house creative shop, Virtue, which was also announced Tuesday. Earlier, Mr. Germano had told the Times he did not believe the allegations “reflect the company’s culture.” Virtue has reportedly lost two clients since the New York Times published its story last month, according to Digiday. Vice’s president, Andrew Creighton, who took a leave of absence in January after the New York Times story, is still under investigation, the company said.\nBest of the rest 21st Century Fox is nearing a deal for the rights to broadcast the NFL’s “Thursday Night Football.” Fox has indicated that sports will be part of the core programming at the company left behind after it sells the bulk of its entertainment assets to Disney. 21st Century Fox and Wall Street Journal parent News Corp share common ownership. [ Bloomberg ]\nDroga5 has placed its chief creative officer, Ted Royer, on leave and has hired an independent firm to investigate him. The agency did not provide further details on what the investigation is about. [ Adweek ]\nJPMorgan Chase has hired VaynerMedia as its first “agency of record for voice.” [ AdAge ]\nThe impact of Europe’s General Data Protection Regulation on various parts of the advertising value chain, explained using emoji. [ AdExchanger ]\nData from advertising and licensing agency Branded Entertainment Network suggests 100% of original productions on Amazon Prime Video featured branded integrations in 2016. Some 91% of Hulu originals and 74% of Netflix originals included branded content deals, according to the findings. [ MediaPost ]\nMike Cernovich has reportedly offered $500,000 in cash for Gawker’s Assets. [ Vanity Fair ]\nHow reboots solve a marketing problem for networks in an era of peak-TV. [ CNN ]\nAbout Us Follow us on Twitter: @wsjCMO , @larakiara , @VranicaWSJ , @alexbruell , @BenMullin , @srabil , @asharma\nSubscribe to our morning newsletter, delivered straight to your inbox, at http://on.wsj.com/CMOTodaySignup .\nWrite to Lara O’Reilly at lara.o'reilly@wsj.com", "external_links": ["http://adage.com/article/agency-news/jpmorgan-chase-brings-vaynermedia-voice-aor/312150/", "https://www.nytimes.com/2018/01/30/business/media/vice-media-sexual-harassment.html", "https://twitter.com/BenMullin", "https://twitter.com/alexbruell", "https://www.bloomberg.com/news/articles/2018-01-31/fox-is-said-close-to-deal-to-air-nfl-s-thursday-night-football", "http://www.adweek.com/brand-marketing/how-the-budweiser-clydesdales-will-make-an-appearance-during-the-super-bowl/", "http://www.adweek.com/agencies/droga5-has-placed-cco-ted-royer-on-leave-and-hired-a-firm-to-investigate-him/", "https://twitter.com/VranicaWSJ", "https://twitter.com/larakiara", "https://www.mediapost.com/publications/article/313665/no-commercials-no-problem-brand-integrations-thr.html", "http://edition.cnn.com/2018/01/30/entertainment/tv-reboots-column/index.html", "https://adexchanger.com/data-driven-thinking/strategic-impact-gdpr-emoji/", "https://twitter.com/asharma", "https://www.cnbc.com/2018/01/30/facebook-cryptocurrency-ads-banned--including-bitcoin-and-icos.html", "https://twitter.com/wsjCMO", "http://www.nydailynews.com/entertainment/tv/morgan-freeman-peter-dinklage-battle-super-bowl-rap-article-1.3789375", "https://twitter.com/srabil", "https://uk.finance.yahoo.com/news/meet-man-behind-bitcoin-genius-ads-internet-134441715.html", "https://www.thewrap.com/vice-media-fires-chief-digital-officer-mike-germano-sexual-misconduct-accusations-exclusive/", "https://www.vanityfair.com/news/2018/01/mike-cernovich-is-bidding-500000-dollars-to-buy-gawker", "https://digiday.com/marketing/harassment-allegations-carrot-creatives-ceo-vice-will-merge-carrot-vice-house-agency-virtue/"], "published": "2018-01-31T16:07:00.000+02:00", "crawled": "2018-01-31T22:31:13.026+02:00", "highlightTitle": ""}