{"organizations": [], "uuid": "9790201daf43279d525c1c428d320fdb6b703d4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-oneok-announces-2018-financial-guidance.html", "country": "US", "domain_rank": 767, "title": "ONEOK Announces 2018 Financial Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.215, "site_type": "news", "published": "2018-01-23T00:15:00.000+02:00", "replies_count": 0, "uuid": "9790201daf43279d525c1c428d320fdb6b703d4e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-oneok-announces-2018-financial-guidance.html", "ord_in_thread": 0, "title": "ONEOK Announces 2018 Financial Guidance", "locations": [], "entities": {"persons": [{"name": "terry k. spencer", "sentiment": "none"}], "locations": [{"name": "okla.", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}, {"name": "williston", "sentiment": "none"}, {"name": "oneok", "sentiment": "none"}], "organizations": [{"name": "oneok", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "oneok, inc.", "sentiment": "neutral"}, {"name": "inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TULSA, Okla., ONEOK, Inc. (NYSE: OKE) today announced 2018 financial and volume guidance. Earnings and volume growth expectations for the year are driven primarily by anticipated natural gas and natural gas liquids (NGL) volume increases in the STACK and SCOOP areas and Williston and Permian basins, and increased ethane recovery.\n2018 Guidance Range\n(millions of dollars)\nONEOK, Inc.\nNet income\n$\n955\n-\n$\n1,155\nAdjusted EBITDA (a)\n$\n2,215\n-\n$\n2,415\nDistributable cash flow (a)\n$\n1,615\n-\n$\n1,815\nCapital-growth expenditures\n$\n1,270\n-\n$\n1,530\nMaintenance capital expenditures\n$\n140\n-\n$\n180\n(a) Adjusted EBITDA and distributable cash flow are non-GAAP measures. Reconciliations to relevant GAAP measures are included in this news release.\n\"We expect to grow volumes and earnings in 2018 by continuing to provide needed services to our customers as they increase production in the basins where we operate,\" said Terry K. Spencer, ONEOK president and chief executive officer. \"Sustained producer drilling activity and increased drilling efficiencies, combined with increased demand for ethane from petrochemical facilities and exports, are expected to drive volume growth across our systems in 2018.\n\"As we continue to bring new volumes onto our systems, we also expect to announce additional capital investments to address the current and future needs of our customers by continuing to expand our extensive 38,000-mile integrated network of natural gas and NGL pipelines,\" said Spencer.\nFINANCIAL GUIDANCE:\nONEOK's full-year 2018 net income is expected to be in the range of $955 million to $1.155 billion. Adjusted EBITDA for 2018 is expected to be in the range of $2.215 billion to $2.415 billion, a nearly 20 percent increase compared with its previously announced 2017 guidance that was affirmed on Oct. 31, 2017.\nONEOK continues to expect average annual dividend growth of 9 to 11 percent through 2021 and annual dividend coverage greater than 1.2 times. ONEOK expects approximately 85 to 95 percent of its 2018 dividend payments to investors to be a return of capital.\nApproximately $2 billion of potential capital-growth projects are in the late stages of development and are expected to be announced when sufficient supply commitments are secured. ONEOK previously announced the successful completion of approximately $1.6 billion of total equity issued in 2017 and early 2018, which was used to retire indebtedness and to pre-fund capital-growth expenditures. ONEOK does not expect to issue additional equity in 2018 and well into 2019. Additional capital-growth projects are expected to be funded with cash generated from operations and short- and long-term borrowings.\nBUSINESS-SEGMENT GUIDANCE:\nNatural Gas Liquids Segment\nThe natural gas liquids segment expects full-year 2018 adjusted EBITDA between $1.30 billion to $1.43 billion, an approximately 15 percent increase compared with 2017 guidance.\nNGLs gathered are expected to average 850,000 to 1 million barrels per day (bpd) and NGLs fractionated are expected to average 650,000 to 725,000 bpd in 2018, representing increases of approximately 10 percent and 15 percent, respectively, compared with 2017 guidance.\nVolume growth in 2018 is expected to be driven primarily by increased producer activity in the STACK and SCOOP areas and increased ethane recovery in the Mid-Continent. Ethane rejection on ONEOK's system is expected to decrease to approximately 70,000 bpd by the end of 2018, resulting in approximately $100 million of incremental adjusted EBITDA during the year compared with 2017.\nIn 2018, the segment expects to connect between six and nine new third-party natural gas processing plants to its NGL system.\nThe extension of ONEOK's West Texas LPG Pipeline into the Delaware Basin and the expansion of its Sterling III Pipeline from the Mid-Continent to the Gulf Coast are currently under construction and are expected to be complete in the third and fourth quarters of 2018, respectively. Additionally, construction is expected to begin on the recently announced Elk Creek Pipeline project out of the Williston Basin in the second half of 2018 and is expected to be complete by year-end 2019.\nThe natural gas liquids segment's earnings are expected to be approximately 90 percent fee based in 2018.\nNatural Gas Gathering and Processing Segment\nThe natural gas gathering and processing segment expects full-year 2018 adjusted EBITDA between $575 million to $625 million, a 25 percent increase compared with 2017 guidance.\nNatural gas processed is expected to average 1,750 to 1,900 million cubic feet per day (MMcf/d), and natural gas gathered is expected to average 1,840 to 2,050 MMcf/d in 2018, representing increases of approximately 20 percent compared with 2017 guidance.\nThe segment's fee rate is expected to average approximately 80 cents per Million British thermal units (MMBtu) in 2018 compared with approximately 85 cents per MMBtu in 2017, due primarily to increased Mid-Continent volumes.\nIncreased natural gas volumes from the STACK and SCOOP plays in Oklahoma are expected to be the largest driver of the segment's 2018 volume growth. ONEOK added an additional 200 MMcf/d of natural gas processing capacity in the area at the end of 2017 through a long-term third-party processing services agreement and expects to add an additional 200 MMcf/d of capacity by the end of 2018 with the expansion of its Canadian Valley natural gas processing plant.\nWilliston Basin volumes also are expected to increase in 2018 from continued strong producer results in the core of the basin where ONEOK has more than 1 million acres dedicated. Approximately 350 to 400 drilled but uncompleted wells remain on ONEOK's acreage dedications, providing a backlog of high-return well connection inventory.\nThe segment's earnings are expected to be approximately 80 percent fee based in 2018.\nNatural Gas Pipelines Segment\nThe natural gas pipelines segment expects full-year 2018 adjusted EBITDA of $335 million to $355 million.\nEarnings in the segment are expected to remain more than 95 percent fee-based in 2018, with approximately 95 percent of its transportation capacity and 65 percent of its natural gas storage capacity contracted under firm fee-based (take-or-pay) commitments.\nThe 100 MMcf/d westbound expansion of the ONEOK Gas Transmission Pipeline out of the STACK play in Oklahoma is on schedule for an expected completion in the second quarter of 2018.\nFEDERAL INCOME TAXES:\nThe recent Tax Cuts and Jobs Act includes provisions that, beginning in 2018, reduce the U.S. corporate tax rate to 21 percent from 35 percent and introduce a capital investment deduction. ONEOK views the aggregate of these changes as positive to its businesses and continues to expect it will not pay federal cash income taxes through at least 2021. The reduction in the federal corporate tax rate is expected to result in one-time noncash charges to net income in the fourth quarter 2017 to revalue ONEOK's deferred tax assets, but future income tax expense is expected to be lower as reflected in 2018 guidance.\n2018 COMMODITY PRICE ASSUMPTIONS:\nThe average unhedged prices assumed in ONEOK's 2018 guidance are 47 cents per gallon for composite natural gas liquids (32 cents per gallon for ethane and 64 cents per gallon for propane at Mont Belvieu); $2.90 per million British thermal units (MMBtu) for NYMEX natural gas; and $52 per barrel for WTI-NYMEX crude oil.\nLINK TO FINANCIAL TABLES:\nhttp://ir.oneok.com/~/media/Files/O/OneOK-IR/financial-reports/2018/oneok-2018-earnings-guidance.pdf\nNON-GAAP (GENERALLY ACCEPTED ACCOUNTING PRINCIPLES) FINANCIAL MEASURES:\nONEOK has disclosed in this news release adjusted EBITDA, distributable cash flow and dividend coverage ratio, which are non-GAAP financial metrics, used to measure the company's financial performance and are defined as follows:\nAdjusted EBITDA is defined as net income adjusted for interest expense, depreciation and amortization, noncash impairment charges, income taxes, noncash compensation expense, allowance for equity funds used during construction (equity AFUDC), and other noncash items; Distributable cash flow is defined as adjusted EBITDA, computed as described above, less interest expense, maintenance capital expenditures and equity earnings from investments, excluding noncash impairment charges, adjusted for cash distributions received from unconsolidated affiliates and certain other items; and Dividend coverage ratio is defined as ONEOK's distributable cash flow to ONEOK shareholders divided by the dividends paid for the period.\nThese non-GAAP financial measures described above are useful to investors because they, and similar measures, are used by many companies in the industry as a measure of financial performance and are commonly employed by financial analysts and others to evaluate our financial performance and to compare our financial performance with the performance of other companies within our industry. Adjusted EBITDA, ONEOK distributable cash flow and coverage ratio should not be considered in isolation or as a substitute for net income or any other measure of financial performance presented in accordance with GAAP.\nThese non-GAAP financial measures exclude some, but not all, items that affect net income. Additionally, these calculations may not be comparable with similarly titled measures of other companies. Reconciliations of net income to adjusted EBITDA, distributable cash flow and coverage ratio are included in the tables.\nONEOK, Inc. (pronounced ONE-OAK) (NYSE: OKE) is one of the largest energy midstream service providers in the U.S., connecting prolific supply basins with key market centers. It owns and operates one of the nation's premier natural gas liquids (NGL) systems and is a leader in the gathering, processing, storage and transportation of natural gas. ONEOK's operations include a 38,000-mile integrated network of NGL and natural gas pipelines, processing plants, fractionators and storage facilities in the Mid-Continent, Williston, Permian and Rocky Mountain regions.\nONEOK is a FORTUNE 500 company and is included in Standard & Poor's (S&P) 500 index.\nFor information about ONEOK, Inc., visit the website: www.oneok.com .\nFor the latest news about ONEOK, find us on LinkedIn, Facebook or Twitter @ONEOKNews.\nThe foregoing discussion of the tax treatment of dividends is not intended as tax advice. Each shareholder is strongly encouraged to consult a financial and tax advisor regarding the appropriate treatment of dividends and the corresponding tax consequences.\nThis news release contains certain \"forward-looking statements\" within the meaning of federal securities laws. Words such as \"anticipates\", \"believes,\" \"expects\", \"intends\", \"plans\", \"projects\", \"will\", \"would\", \"should\", \"may\", and similar expressions may be used to identify forward-looking statements. Forward-looking statements are not statements of historical fact and reflect our current views about future events. Such forward-looking statements include, but are not limited to, statements about the benefits of the transaction involving us, including future financial and operating results, our plans, objectives, expectations and intentions, and other statements that are not historical facts, including future results of operations, projected cash flow and liquidity, business strategy, expected synergies or cost savings, and other plans and objectives for future operations. No assurances can be given that the forward-looking statements contained in this news release will occur as projected and actual results may differ materially from those projected.\nForward-looking statements are based on current expectations, estimates and assumptions that involve a number of risks and uncertainties, many of which are beyond our control, and are not guarantees of future results. Accordingly, there are or will be important factors that could cause actual results to differ materially from those indicated in such statements and, therefore, you should not place undue reliance on any such statements and caution must be exercised in relying on forward-looking statements. These risks and uncertainties include, without limitation, the following:\nthe risk that cost savings, tax benefits and any other synergies from the ONEOK and ONEOK Partners merger transaction (Merger Transaction) may not be fully realized or may take longer to realize than expected; the impact and outcome of pending and future litigation, including litigation relating to the Merger Transaction; the effects of weather and other natural phenomena, including climate change, on our operations, demand for our services and energy prices; competition from other United States and foreign energy suppliers and transporters, as well as alternative forms of energy, including, but not limited to, solar power, wind power, geothermal energy and biofuels such as ethanol and biodiesel; the capital intensive nature of our businesses; the profitability of assets or businesses acquired or constructed by us; our ability to make cost-saving changes in operations; risks of marketing, trading and hedging activities, including the risks of changes in energy prices or the financial condition of our counterparties; the uncertainty of estimates, including accruals and costs of environmental remediation; the timing and extent of changes in energy commodity prices; the effects of changes in governmental policies and regulatory actions, including changes with respect to income and other taxes, pipeline safety, environmental compliance, climate change initiatives and authorized rates of recovery of natural gas and natural gas transportation costs; the impact on drilling and production by factors beyond our control, including the demand for natural gas and crude oil; producers' desire and ability to obtain necessary permits; reserve performance; and capacity constraints on the pipelines that transport crude oil, natural gas and NGLs from producing areas and our facilities; difficulties or delays experienced by trucks, railroads or pipelines in delivering products to or from our terminals or pipelines; changes in demand for the use of natural gas, NGLs and crude oil because of market conditions caused by concerns about climate change; the impact of unforeseen changes in interest rates, debt and equity markets, inflation rates, economic recession and other external factors over which we have no control, including the effect on pension and postretirement expense and funding resulting from changes in equity and bond market returns; our indebtedness and guarantee obligations could make us vulnerable to general adverse economic and industry conditions, limit our ability to borrow additional funds and/or place us at competitive disadvantages compared with our competitors that have less debt, or have other adverse consequences; actions by rating agencies concerning our credit ratings; the results of administrative proceedings and litigation, regulatory actions, rule changes and receipt of expected clearances involving any local, state or federal regulatory body, including the Federal Energy Regulatory Commission (FERC), the National Transportation Safety Board, the Pipeline and Hazardous Materials Safety Administration (PHMSA), the U.S. Environmental Protection Agency (EPA) and the U.S. Commodity Futures Trading Commission (CFTC); our ability to access capital at competitive rates or on terms acceptable to us; risks associated with adequate supply to our gathering, processing, fractionation and pipeline facilities, including production declines that outpace new drilling or extended periods of ethane rejection; the risk that material weaknesses or significant deficiencies in our internal controls over financial reporting could emerge or that minor problems could become significant; the impact and outcome of pending and future litigation; the ability to market pipeline capacity on favorable terms, including the effects of: future demand for and prices of natural gas, NGLs and crude oil; competitive conditions in the overall energy market; availability of supplies of Canadian and United States natural gas and crude oil; and availability of additional storage capacity; performance of contractual obligations by our customers, service providers, contractors and shippers; the timely receipt of approval by applicable governmental entities for construction and operation of our pipeline and other projects and required regulatory clearances; our ability to acquire all necessary permits, consents or other approvals in a timely manner, to promptly obtain all necessary materials and supplies required for construction, and to construct gathering, processing, storage, fractionation and transportation facilities without labor or contractor problems; the mechanical integrity of facilities operated; demand for our services in the proximity of our facilities; our ability to control operating costs; acts of nature, sabotage, terrorism or other similar acts that cause damage to our facilities or our suppliers' or shippers' facilities; economic climate and growth in the geographic areas in which we do business; the risk of a prolonged slowdown in growth or decline in the United States or international economies, including liquidity risks in United States or foreign credit markets; the impact of recently issued and future accounting updates and other changes in accounting policies; the possibility of future terrorist attacks or the possibility or occurrence of an outbreak of, or changes in, hostilities or changes in the political conditions in the Middle East and elsewhere; the risk of increased costs for insurance premiums, security or other items as a consequence of terrorist attacks; risks associated with pending or possible acquisitions and dispositions, including our ability to finance or integrate any such acquisitions and any regulatory delay or conditions imposed by regulatory bodies in connection with any such acquisitions and dispositions; the impact of uncontracted capacity in our assets being greater or less than expected; the ability to recover operating costs and amounts equivalent to income taxes, costs of property, plant and equipment and regulatory assets in our state and FERC-regulated rates; the composition and quality of the natural gas and NGLs we gather and process in our plants and transport on our pipelines; the efficiency of our plants in processing natural gas and extracting and fractionating NGLs; the impact of potential impairment charges; the risk inherent in the use of information systems in our respective businesses, implementation of new software and hardware, and the impact on the timeliness of information for financial reporting; our ability to control construction costs and completion schedules of our pipelines and other projects; and the risk factors listed in the reports we have filed and may file with the Securities and Exchange Commission (the \"SEC\"), which are incorporated by reference.\nThese reports are also available from the sources described below. Forward-looking statements are based on the estimates and opinions of management at the time the statements are made. ONEOK undertakes no obligation to publicly update any forward-looking statement, whether as a result of new information, future events or changes in circumstances, expectations or otherwise.\nThe foregoing review of important factors should not be construed as exhaustive and should be read in conjunction with the other cautionary statements that are included herein and elsewhere, including the Risk Factors included in the most recent reports on Form 10-K and Form 10-Q and other documents of ONEOK on file with the SEC. ONEOK's SEC filings are available publicly on the SEC's website at www.sec.gov .\nAnalyst Contact:\nMegan Patterson\n918-561-5325\nMedia Contact:\nBrad Borror\n918-588-7582\n releases/oneok-announces-2018-financial-guidance-300586200.html\nSOURCE ONEOK, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/oneok-announces-2018-financial-guidance-300586200.html", "http://www.oneok.com/", "http://ir.oneok.com/~/media/Files/O/OneOK-IR/financial-reports/2018/oneok-2018-earnings-guidance.pdf"], "published": "2018-01-23T00:15:00.000+02:00", "crawled": "2018-01-23T02:17:22.003+02:00", "highlightTitle": ""}