{"organizations": [], "uuid": "051f720af2a4fef1a4db9ca6ba6f9cbe6c2edf18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104926672-jayfear.1910x1000.png", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/legendary-stuntman-travis-pastrana-shows-jay-leno-how-to-overcome-fear.html", "country": "US", "domain_rank": 767, "title": "Legendary stuntman Travis Pastrana shows Jay Leno how to overcome fear", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.029, "site_type": "news", "published": "2018-01-04T18:18:00.000+02:00", "replies_count": 0, "uuid": "051f720af2a4fef1a4db9ca6ba6f9cbe6c2edf18"}, "author": "Jonathan Blumberg", "url": "https://www.cnbc.com/2018/01/04/legendary-stuntman-travis-pastrana-shows-jay-leno-how-to-overcome-fear.html", "ord_in_thread": 0, "title": "Legendary stuntman Travis Pastrana shows Jay Leno how to overcome fear", "locations": [], "entities": {"persons": [{"name": "jay leno", "sentiment": "negative"}, {"name": "travis pastrana", "sentiment": "negative"}, {"name": "pastrana", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Travis Pastrana is one of the few household names from the world of motor sports because the 17-time X Games medalist is good on motorcycles, rally cars and race cars and also because he is a daredevil. In 2011, he jumped out of a plane with no parachute.\nNot all of his death-defying stunts run smoothly. He has dislocated his spine, fractured both ankles, both legs, both arms and torn ligaments in his knees. Overall, he has had 32 surgeries to put his body back together. \nYet he keeps coming back for more.\nFor Pastrana, the thrill is worth the risk, and focusing on the fun helps you overcome the fear. As he tells Jay Leno on Thursday's episode of CNBC's \" Jay Leno's Garage ,\" \"The hardest time, I was 14-years-old, shattered my pelvis, broke my back, and my mom was like, 'Are you sure that this is what you want to do for a living?' Even in all that pain, I was like, 'I can't wait to get back on a motorcycle.'\" \nbounces back from his mistakes .\nWhen the Leno visits the Nitro Circus in San Diego — a touring performance of high-flying action sports that promises, each night, a stunt that has never been done before — Leno asks Pastrana how he can put himself in so much danger knowing that in \"any typical show, it could be over.\"\nPastrana responds, \"At the end of the day, you wake up with that passion, the world just drops out.\"\n\"You can go as high as you want, as far as you want,\" he continues, \"and when you reach the limit, you find a way to build the ramp bigger and go even higher.\"\nepisode , Pastrana surprises him by including the late-night legend in his very own, specially designed stunt. \nHe sets Leno up in front of a live audience in a La-Z-Boy recliner on top of a landing ramp, so that he and his fellow bikers can jump over him. They don't give him any protection, but they do give him a soda. \"Why put a $500 helmet on a 10-cent head?\" Leno jokes.\nThe first round of jumps goes smoothly, and Leno asks the crowd if they want to see another. \"This is the best seat in the house!\" he exclaims.\nPastrana probably disagrees.\nCNBC's \" Jay Leno's Garage \" airs Thursdays at 10 pm ET. \nDon't miss: Jay Leno flips an SUV with an award-winning stuntwoman \nShows \nWatch full episodes | TV schedule", "external_links": [], "published": "2018-01-04T18:18:00.000+02:00", "crawled": "2018-01-04T18:19:09.005+02:00", "highlightTitle": ""}