{"organizations": [], "uuid": "bff7b30f53fa0bf4b97cfe1539d023a8b9f99991", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222720717&w=1200&r=LYNXMPEE0G0TP", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-eu-energy/european-lawmakers-vote-for-more-ambition-on-renewables-targets-idUSKBN1F61HM", "country": "US", "domain_rank": 408, "title": "European lawmakers vote for more ambition on renewables targets", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T14:39:00.000+02:00", "replies_count": 0, "uuid": "bff7b30f53fa0bf4b97cfe1539d023a8b9f99991"}, "author": "", "url": "https://www.reuters.com/article/us-eu-energy/european-lawmakers-vote-for-more-ambition-on-renewables-targets-idUSKBN1F61HM", "ord_in_thread": 0, "title": "European lawmakers vote for more ambition on renewables targets", "locations": [], "entities": {"persons": [], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "strasbourg", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 12:43 PM / Updated 6 hours ago EU lawmakers back more ambitious renewables, energy saving goals Reuters Staff 4 Min Read \nSTRASBOURG, France (Reuters) - European lawmakers approved draft measures on Wednesday to reform the power market and reduce energy consumption that envisage more ambitious climate goals, setting the stage for tough talks with reluctant EU member states. \nUnder the plan backed by the European Parliament, renewable energy would account for at least 35 percent of the EU’s overall energy use by 2030. Last month EU national governments agreed a target of 27 percent, disappointing environmental campaigners who see it as too little to combat climate change. \nThe industry lobby WindEurope welcomed Wednesday’s vote, saying the difference between 27 and 35 percent could mean 92 billion euros less in future investments for the sector. \nThe draft rules also envisage banning the use of palm oil, a major import from southeast Asia, in motor fuels from 2021, drawing an angry response from the Malaysian government. \nThe EP, the executive European Commission and EU national governments must now negotiate together on the final legislation. \nThe draft measures are aimed at helping the European Union meet its overall goal of reducing greenhouse gas emissions by at least 40 percent below 1990 levels by 2030, following the Paris Agreement to limit global warming to no more than 2 degrees. \nSince U.S. President Donald Trump’s decision to exit the Paris climate accord last year, the EU has sought to stay the course. But it faces challenges in implementing its climate goals while reconciling economic disparities between western and eastern Europe, where much industry is still reliant on coal. ENERGY EFFICIENCY \nThe EU lawmakers also agreed on Wednesday a binding overall energy efficiency target of 35 percent after 2021, compared to a 30 percent non-binding target proposed by member states last year. \nThe target requires the promotion of better insulation and energy use in buildings, more efficient consumer goods and smart appliances in homes. \nApart from any environmental benefits, the Commission says a 30 percent target would create 400,000 jobs, increase EU economic output by 70 billion euros ($78.30 billion) and reduce the continent’s reliance on gas imports by 12 percent. \nThe draft measures contain provisions for renewable transport fuels, seeking to promote research in advanced technologies and to limit fuels made from food and feed crops, which are blamed for deforestation and higher food prices. \nThe proposed palm oil ban angered Malaysia. \n“The vote by the EU Parliament to exclude palm oil biofuels from the EU’s renewable energy future is a wholly unjustified blockade against Malaysian farmers, families and communities,” the government said in a statement. \nUnder the draft measures, biofuels made from other food and feed crops cannot exceed 7 percent of all transport fuel. \n“Today’s parliament vote sends a clear message to the biofuels industry that growth can only come from sustainable advanced fuels such as waste-based biofuels, not from food crops,” said Laura Buffet of campaign group Transport and Environment. Reporting by Robert-Jan Bartunek; Editing by Alissa de Carbonnel and Gareth Jones", "external_links": [], "published": "2018-01-17T14:39:00.000+02:00", "crawled": "2018-01-17T15:06:53.032+02:00", "highlightTitle": ""}