{"organizations": [], "uuid": "eafceec844382f52609828ddf58bc8cc0a3a784a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-statement-from-fda-commissioner-scott-gottlieb-m-d-on-new-policy-steps-for-strengthening-public-warning-and-notification-of.html", "country": "US", "domain_rank": 767, "title": "Statement from FDA Commissioner Scott Gottlieb, M.D., on new policy steps for strengthening public warning and notification of recalls", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T00:10:00.000+02:00", "replies_count": 0, "uuid": "eafceec844382f52609828ddf58bc8cc0a3a784a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-statement-from-fda-commissioner-scott-gottlieb-m-d-on-new-policy-steps-for-strengthening-public-warning-and-notification-of.html", "ord_in_thread": 0, "title": "Statement from FDA Commissioner Scott Gottlieb, M.D., on new policy steps for strengthening public warning and notification of recalls", "locations": [], "entities": {"persons": [{"name": "scott gottlieb", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "md.", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SILVER SPRING, Md., Jan. 18, 2018 /PRNewswire-USNewswire/ -- Americans depend on the U.S. Food and Drug Administration to help ensure that the products they buy are safe. Last month , I committed the agency to further improve our recall processes because I believe that consumers should have actionable information for protecting themselves from any FDA-regulated, recalled product.\nRecalls are an important safety tool. The FDA works with companies to get potentially unsafe products out of the marketplace as quickly and efficiently as possible. When we learn about a product in the marketplace that may be unsafe, the FDA must act quickly to keep people from getting sick or being harmed.\nToday we published a draft guidance that better describes the FDA's policy on public warning and notification of recalled products as part of our effort to ensure better, more timely information reaches consumers. Although we often hear the most about recalled food, this guidance also covers other FDA-regulated products including drugs, medical devices and cosmetics.\nSpecifically, the draft guidance outlines circumstances when a company should issue a public warning about a recall, describes the general timeline for companies to issue such a warning, discusses what information should be included in a public warning, and describes situations where the FDA may take action to issue its own public warning should a company's warning be deemed insufficient. The draft guidance also describes the FDA's policy for moving forward with posting recalls to FDA's Enforcement Report before a final health risk determination is made. The FDA's Enforcement Report is a listing of all recalls monitored by the FDA. You can read more about the changes the FDA made to its Enforcement Report in today's blog .\nThe draft guidance is a key step to enhance the recall process. It gives industry clear direction on how to navigate and work with the FDA to make sure that recalls are communicated promptly. Ultimately, it will better empower consumers by providing more timely and more accurate information on recalled products.\nFurthermore, we are also developing a new FDA policy on what information the FDA will make available to help the public to identify a hazardous recalled food. With most products that the FDA regulates, consumers can typically identify a recalled product from the information a company provides about the packaging or brand name information.\nAs part of overseeing thousands of recalls every year, the agency helps provide descriptions, lot codes and photographs to help consumers and others, such as stores identify affected products. The FDA also helps provide some geographic or retail-related information for many recalls. But in some situations, identifying additional information – such as specific stores that may have sold a potentially unsafe, recalled food – may help. As part of these efforts, we're planning to announce a new approach to the release of recall information this year. In the meantime, the FDA can and will publicize this kind of information if it is necessary to effectuate a recall.\nMaking sure the FDA has effective recall practices in place, and that we take immediate action to address unsafe products, are high priorities of mine. Our recall authorities – and how we deploy them – are a cornerstone of our vital, consumer protection mission and I take these obligations very seriously.\nThe draft guidance issued today is just the first in a series of policy steps we'll take this year as part of a broader action plan to further improve our oversight of food safety and how we help implement the recall process.\nWe all know that hazardous recalled products can have a devastating impact on human lives. We're committed to making sure that recalls are initiated, overseen, and completed promptly and effectively to best protect consumers; and we will use all the tools at our disposal to carry through on this commitment.\nThe FDA, an agency within the U.S. Department of Health and Human Services, protects the public health by assuring the safety, effectiveness, and security of human and veterinary drugs, vaccines and other biological products for human use, and medical devices. The agency also is responsible for the safety and security of our nation's food supply, cosmetics, dietary supplements, products that give off electronic radiation, and for regulating tobacco products.\nMedia Inquiries: Peter Cassell, peter.cassell@fda.hhs.gov , 240-402-6537\nConsumer Inquiries: 888-INFO-FDA\nView original content with multimedia: http://www.prnewswire.com/news-releases/statement-from-fda-commissioner-scott-gottlieb-md-on-new-policy-steps-for-strengthening-public-warning-and-notification-of-recalls-300584952.html\nSOURCE U.S. Food and Drug Administration", "external_links": ["https://www.fda.gov/NewsEvents/Newsroom/PressAnnouncements/ucm590423.htm", "https://blogs.fda.gov/fdavoice/index.php/2018/01/fda-to-expedite-release-of-recall-information/", "https://www.fda.gov/ucm/groups/fdagov-public/@fdagov-afda-gen/documents/document/ucm592851.pdf", "http://www.prnewswire.com/news-releases/statement-from-fda-commissioner-scott-gottlieb-md-on-new-policy-steps-for-strengthening-public-warning-and-notification-of-recalls-300584952.html", "https://www.fda.gov/Safety/Recalls/EnforcementReports/default.htm"], "published": "2018-01-19T00:10:00.000+02:00", "crawled": "2018-01-19T00:32:03.024+02:00", "highlightTitle": ""}