{"organizations": [], "uuid": "92092b552e68fccf7207fc3e66dab9bdebed5ea4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219153545&w=1200&r=LYNXMPEE0218T", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-ars-che/bellerin-earns-arsenal-2-2-draw-with-chelsea-idUKKBN1ES208", "country": "US", "domain_rank": 408, "title": "Bellerin earns Arsenal 2-2 draw with Chelsea", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T23:53:00.000+02:00", "replies_count": 0, "uuid": "92092b552e68fccf7207fc3e66dab9bdebed5ea4"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-ars-che/bellerin-earns-arsenal-2-2-draw-with-chelsea-idUKKBN1ES208", "ord_in_thread": 0, "title": "Bellerin earns Arsenal 2-2 draw with Chelsea", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 9:56 PM / Updated an hour ago Bellerin earns Arsenal 2-2 draw in Chelsea derby classic Reuters Staff 4 Min Read ARSENAL 2 CHELSEA 2 Soccer Football - Premier League - Arsenal vs Chelsea - Emirates Stadium, London, Britain - January 3, 2018 Arsenal's Hector Bellerin celebrates scoring their second goal with Alexis Sanchez REUTERS/Dylan Martinez \nJan 3 (Reuters) - Arsenal and Chelsea made a mockery of talk of player fatigue at the end of a festive slog of Premier League action as Hector Bellerin’s stoppage-time stunner earned the hosts a 2-2 draw in a scintillating derby on Wednesday. \nFrom beginning to end at the Emirates Stadium, both sides traded chances with Arsenal keeper Petr Cech and his opposite number Thibaut Courtois responsible for keeping the scoresheet blank until past the hour mark. \nJack Wilshere gave Arsenal a 63rd-minute lead but Bellerin’s trip on Eden Hazard gave the Belgian wizard the chance to level from the penalty spot four minutes later. \nA flowing Chelsea move ended with Marcos Alonso putting the visitors ahead in the 84th minute but they were denied the victory that would have put them above Manchester United into second spot with Bellerin’s sumptuous 92nd minute half-volley. \nThere was still time for Chelsea substitute Davide Zappacosta to hit the crossbar but defeat would have been harsh on Arsenal who had 14 goal attempts to Chelsea’s 19. \nChelsea remained in third place with 46 points, 16 behind leaders Manchester City, who have a 15-point lead over second-placed Manchester United, while Arsenal stayed sixth. \nIt was manager Arsene Wenger’s 60th match against Chelsea in his long Arsenal reign but few could have provided as much goalmouth action as this classic. \n”It was a fantastic football game and overall it could have gone both ways,“ Wenger said. ”Maybe it’s a fair result. \n“The penalty was a farcical decision. When we looked as though maybe mentally we were shot, we had the resources to come back to 2-2.” \nAlvaro Morata, strangely profligate all night, wasted a great chance early on for Chelsea when he took advantage of a yawning chasm in the Arsenal defence to go through on goal but his sidefoot finish was dreadful. Soccer Football - Premier League - Arsenal vs Chelsea - Emirates Stadium, London, Britain - January 3, 2018 Arsenal's Hector Bellerin celebrates scoring their second goal Action Images via Reuters/John Sibley \nAt the other end Alexis Sanchez’s shot struck both uprights after a superb save by Courtois who shortly afterwards did brilliantly to keep out Alexandre Lacazette’s shot. \nTiemoue Bakayoko and Cesc Fabregas both wasted chances for Chelsea while Mesut Ozil drew a fine save from Courtois. \nFormer Chelsea stopper Cech, seeking a 200th Premier League clean sheet, showed his class to deny Hazard as the second half began with another flurry of attacks. Slideshow (2 Images) \nNot to be outdone, Courtois then blocked Sanchez’s powerful close-range effort after the Chilean’s sublime piece of trickery. \nWilshere finally beat Courtois, the midfielder lashing a left-foot shot high into the top corner on the stretch after a deflected pass found him at the far post. \nArsenal were buoyant but were flattened four minutes later when Bellerin dangled a leg and Hazard went down theatrically -- much to the annoyance of Wenger, whose side were denied victory at West Bromwich Albion by a late penalty on Sunday. \nHazard sent Cech the wrong way from the spot. \nA sweeping crossfield move in the 84th minute saw Zappacosta get the better of Arsenal’s inexperienced left back Ainsley Maitland-Niles before rifling in a low cross that Alonso met sweetly to give Cech no chance. \nTo their credit Arsenal refused to accept defeat and when Alonso failed to get proper distance on a clearing header the ball feel for Bellerin to send a half-volley curling away from the helpless Courtois. \nMorata spurned another one-on-one before Zappacosta’s dipper cannoned against the crossbar to leave honours even to the frustration of Chelsea manager Antonio Conte. \n“I think it is a pity because when you have so many chances to score you must win the game,” said Conte. Reporting by Martyn Herman, editing by Ed Osmond and Ian Chadband", "external_links": [], "published": "2018-01-03T23:53:00.000+02:00", "crawled": "2018-01-04T00:11:03.013+02:00", "highlightTitle": ""}