{"organizations": [], "uuid": "fb2ed3840ce964f32742cffedc00101bbfe4019d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221524224&w=1200&r=LYNXMPEE0B1ET", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-alibaba-ustr/alibabas-taobao-again-on-u-s-blacklist-list-for-fakes-idUSKBN1F12DE", "country": "US", "domain_rank": 408, "title": "Alibaba's Taobao again on U.S. blacklist list for fakes", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T02:44:00.000+02:00", "replies_count": 0, "uuid": "fb2ed3840ce964f32742cffedc00101bbfe4019d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-alibaba-ustr/alibabas-taobao-again-on-u-s-blacklist-list-for-fakes-idUSKBN1F12DE", "ord_in_thread": 0, "title": "Alibaba's Taobao again on U.S. blacklist list for fakes", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "taobao", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "alibaba", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "taobao.com", "sentiment": "none"}, {"name": "alibaba group holding ltd", "sentiment": "none"}, {"name": "taobao marketplace", "sentiment": "none"}, {"name": "ustr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 6:44 PM / Updated 23 minutes ago Alibaba's Taobao again on U.S. blacklist list for fakes Reuters Staff 3 Min Read \n(Reuters) - The U.S. Trade Representative put Alibaba’s Taobao on its blacklist for the second year in a row over suspected counterfeits sold on the shopping platform, a move the Chinese e-commerce giant said did not reflect its IP-protection efforts. \nAlibaba Group Holding Ltd’s ( BABA.N ) hugely popular Taobao Marketplace is one of 25 online markets that along with 18 physical markets made the USTR’s annual list of the world’s most “notorious markets” for sales of pirated and counterfeit goods. \nTaobao, China’s largest ecommerce marketplace and its third-most popular website, stayed off the list from 2012 to 2015, but was included in 2016 and now again in 2017. \nWhile Taobao’s inclusion does not carry any direct penalties, it is a blow to Alibaba’s efforts to shed perceptions that its sites are riddled with fakes and that its anti-piracy policies are inadequate. \n“A high volume of infringing products reportedly continue to be offered for sale and sold on Taobao.com and stakeholders continue to report challenges and burdens associated with IP enforcement on the platform,” the USTR said. \nThe agency acknowledged Alibaba's efforts to curb the sale of infringing products on Taobao, but said the prevalence of infringing listings and sales remained a challenge. ( bit.ly/2D4LN1c ) \nAlibaba defended itself saying it had made using its IP protection programs easier, which led to an 11 percent increase in registries, and it also noted a 25 percent drop in takedown requests as it removed infringing listings even before they reached its marketplaces. \n\"In light of all this, it's clear that no matter how much action we take and progress we make, the USTR is not actually interested in seeing tangible results,\" Alibaba Group President Michael Evans said in a statement. ( bit.ly/2qYxPZ9 ) \nThe USTR said Alibaba’s data did not directly reflect the scope and status of the counterfeiting problem on Taobao, but was merely suggestive of progress in its anti-counterfeit efforts. \nIt also noted that those efforts appeared to be more towards addressing the concerns of global brands rather than small and medium businesses. \n“It is incumbent upon Alibaba to develop more effective means to address the concerns of the full range of U.S. businesses that continue to find infringing versions of their products for sale on Taobao.com.” Reporting by Sonam Rai in Bengaluru; Editing by Savio D'Souza", "external_links": ["http://bit.ly/2D4LN1c", "http://thomsonreuters.com/en/about-us/trust-principles.html", "http://bit.ly/2qYxPZ9"], "published": "2018-01-13T02:44:00.000+02:00", "crawled": "2018-01-12T20:48:15.006+02:00", "highlightTitle": ""}