{"organizations": [], "uuid": "c3d9e1bcc880f873d1ea8ec4c9620d209880d1b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/10/11/101106362-184047619.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/18/how-could-a-government-shutdown-affect-you.html", "country": "US", "domain_rank": 767, "title": "How could a government shutdown affect you?", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:54:00.000+02:00", "replies_count": 0, "uuid": "c3d9e1bcc880f873d1ea8ec4c9620d209880d1b3"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/how-could-a-government-shutdown-affect-you.html", "ord_in_thread": 0, "title": "How could a government shutdown affect you?", "locations": [], "entities": {"persons": [], "locations": [{"name": "new california", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "congressional", "sentiment": "none"}, {"name": "office of personnel management", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "children's health insurance program", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It sounds like a catastrophe: a federal government shutdown.\nBut for most Tennesseans, the potential impact would be minimal if Congress doesn't reach an agreement by midnight Friday to keep the bureaucracy running.\nWith hopes diminished for a deal this week on immigration reform, Congressional leaders were negotiating a temporary spending bill that could fund the popular Children's Health Insurance Program.\nOn Wednesday, the bill's passage was not assured, as Democrats weighed the potential political risk of voting against the measure. If the talks collapse, and the government shuts down, thousands of federal government workers throughout the state would be furloughed.\nAs of 2016, there were about 25,000 non-postal, full-time civilian federal government employees in the state, according to the Office of Personnel Management.\nRead more from USA Today:\nGOP pushes a short-term spending bill, but it's not clear they can avoid a shutdown \nNew California? 5 times Californians failed to split the Golden State \nSecond person in less than a week killed by high-speed Brightline train in South Florida \nBut not every part of the government would shutter.\nIf Congress fails to pass a spending bill Friday, federal workers deemed \"essential\" would stay on the job and key government functions — such as national security operations and law enforcement work — would remain up and running. Others could shut down. Based on previous spending stalemates, here's what you can expect:\nWill I still be able to get a passport? \nIf you need a new passport, you might want to put in your request now. The State Department's passport services are funded partly by fees, which means it is not completely dependent on Congress for money and may be able to continue to issue passports for at least a short time. But if the stalemate drags on, your application could be delayed.\nWhat about the National Parks? \nYou'll be out of luck if your upcoming vacation plans include a stop at any National Park or other treasured federal site. Taxpayer-funded sites would be closed during a shutdown.\nMuch of the Great Smoky Mountains National Park, however, still will be accessible. The park's main road is not gated, and would remain open. Visitors centers, trails and campgrounds, though, could be closed.\nWill troops get paid? \nThe military gets paid on the 1st and 15th of every month. So the troops just received a paycheck, and they wouldn't be due for another one until Feb. 1. That means military personnel would not suffer a lapse in pay unless a government shutdown lasted until the end of the month — or longer. Fort Campbell officials said a shutdown would likely involve the furlough of some civilian government service employees.\nWill I still get my Social Security benefits? \nYes. Social Security is a mandatory program that will continue even if Congress fails to pass a spending bill.\nWill mail still be delivered? \nYes, deliveries will continue because the US Postal Service has its own funding through stamps and other fees.\nWill air travel be affected? \nProbably not. Airports would remain open and air traffic controllers and Transportation Security Administration officials would remain on the job. However, there could be some delays as \"non-essential\" employees are furloughed.\nHow did we get to this point? \nSept. 8, 2017 – With the new fiscal year approaching and no budget agreement in sight, Congress votes to keep the government operating at current spending levels for three months.\n\nDec. 7, 2017 – Congress passes another short-term spending bill to keep the government operating, putting off fights over several controversial issues for another day.\n\nDec. 21, 2017 – Just hours before going on Christmas break, Congress again averts a government shutdown by passing another short-term bill to keep the government open through mid-January.\n\nJan. 19, 2018 – Congress has until midnight to pass a budget or risk a government shutdown.", "external_links": [], "published": "2018-01-18T19:54:00.000+02:00", "crawled": "2018-01-18T21:32:11.005+02:00", "highlightTitle": ""}