{"organizations": [], "uuid": "d0ce0be3ef2782fd0217ac62829be182c247e47d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-pakistan-climbers/polish-rescue-team-finds-french-climber-on-pakistans-killer-mountain-idUSKBN1FG0YK", "country": "US", "domain_rank": 408, "title": "Polish rescue team finds French climber on Pakistan's 'Killer Mountain'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T01:51:00.000+02:00", "replies_count": 0, "uuid": "d0ce0be3ef2782fd0217ac62829be182c247e47d"}, "author": "", "url": "https://www.reuters.com/article/us-pakistan-climbers/polish-rescue-team-finds-french-climber-on-pakistans-killer-mountain-idUSKBN1FG0YK", "ord_in_thread": 0, "title": "Polish rescue team finds French climber on Pakistan's 'Killer Mountain'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 11:51 PM / Updated 8 minutes ago Polish team rescues French climber from Pakistan's 'Killer Mountain' Marcin Goettig 3 Min Read \nWARSAW (Reuters) - After an exhausting night ascent, Polish climbers rescued French mountaineer Elisabeth Revol from the treacherous slopes of Pakistan’s “Killer Mountain” but were unable to save her climbing companion, Poland’s winter climbing team said. \nRevol and Polish climber Tomasz Mackiewicz had called for help on Friday from about 7,400 meters up Pakistan’s second-highest peak, the 8,126 meter (26,660 feet) Nanga Parbat. \nA team of Polish climbers preparing for the first winter ascent of the nearby K2 mountain set off to rescue them. \nAscending until the early hours of Sunday, they found Revol exhausted and suffering from frostbite, but an approaching snow storm prevented them from going higher for Tomasz. \n“I salute the courage of the four Polish heroes ... My thoughts are with the family and relatives of Tomek,” French ambassador to Poland Pierre Levy said on Twitter. \nThe rescue team were Russian climber Denis Urubko, who has dual Polish citizenship, together with Polish climbers Adam Bielecki, Jaroslaw Botor and Piotrek Tomala. A helicopter leaves to rescue two climbers, on Nanga Parbat Himalayan Mountain, Pakistan January 27, 2018 in this still image obtained from social media video. Polski Himalaizm Zimowy via REUTERS \nThey were dropped off by helicopters at about 4,900 meters, from where the first two climbers began their ascent. Pakistani helicopters had spotted Revol at about 6,700 meters on Saturday. \n“THANK YOU Denis & Adam - without you... I can’t imagine,” Revol’s partner Ludovic Giambiasi said on Facebook, adding that Revol had been transported to a hospital in Islamabad. Slideshow (3 Images) \nA crowdfunding campaign raised nearly $140,000 to finance the rescue and support the wife and three children of Mackiewicz. \n“The mountains were his own world and his fulfilment,” said Mackiewicz’s wife Anna Solska. \nPakistan rivals Nepal for the number of peaks higher than 7,000 meters. Nanga Parbat has become known as “Killer Mountain” moniker because of the high number of lives it has claimed. \nIn June a Spanish man and an Argentinian perished in an avalanche while trying to scale its peak. The first successful winter ascent of the mountain was made in February 2016. \n($1 = 0.8047 euros) Editing Reporting by Marcin Goettig in WARSAW; Additional reporting by Saad Sayeed and Drazen Jorgic in ISLAMABAD; Editing by Daniel Wallis and David Goodman", "external_links": [], "published": "2018-01-28T01:51:00.000+02:00", "crawled": "2018-01-28T02:07:25.024+02:00", "highlightTitle": ""}