{"organizations": [], "uuid": "68b3b0abbe4ad0c1107986f186d609ff1d4d6524", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/28/104865219-16x9_6.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/south-coast-plaza-billionaires-muscle-car-collection-worth-millions.html", "country": "US", "domain_rank": 767, "title": "South Coast Plaza billionaires' muscle car collection worth millions", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.268, "site_type": "news", "published": "2018-01-04T17:46:00.000+02:00", "replies_count": 0, "uuid": "68b3b0abbe4ad0c1107986f186d609ff1d4d6524"}, "author": "Hannah Kliot", "url": "https://www.cnbc.com/2018/01/04/south-coast-plaza-billionaires-muscle-car-collection-worth-millions.html", "ord_in_thread": 0, "title": "South Coast Plaza billionaires' muscle car collection worth millions", "locations": [], "entities": {"persons": [{"name": "ted", "sentiment": "none"}, {"name": "rae", "sentiment": "none"}, {"name": "rae segerstrom", "sentiment": "none"}, {"name": "segerstrom", "sentiment": "none"}], "locations": [{"name": "costa mesa", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "south coast plaza", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "From a distance, the Segerstrom lima bean farm in Costa Mesa, California looks as unassuming as its owners, Ted and Rae. But the farm's repurposed horse barn was recently filled with the billionaire couple's collection of vintage muscle cars worth millions of dollars.\nCNBC's \" Secret Lives of the Super Rich ,\" got a private tour of the auto stockpile in a recent episode.\nCNBC The Segerstrom Collection The Segerstrom family began amassing their immense fortune in the 1960s, when Ted's father transformed part of their farmland into what is today some of the most expensive real estate in the world: the highest-grossing mall in the U.S., California's South Coast Plaza.\nTed's love of classic cars began when he was a child and has continued throughout his life. Vintage rides even play a role in Ted's retelling of the early days of his relationship with his wife Rae.\n\"When we were dating back in the 70s — our first date in my '72 Mach 1— we got in an accident,\" says Ted.\n\"And I still married him,\" says Rae.\nCNBC Ted and Rae Segerstrom Over the past three decades, Ted has carefully handpicked and cataloged each vintage vehicle in his 85-car collection.\n\"You don't want the ordinary car,\" says Ted. \"I lean towards the specialty ones.\"\nThe collection centers around cars made by racing driver and automotive designer Carroll Shelby.\n\"We grew up with him as a real symbol,\" says Ted. \"He's a legend.\"\nThe Segerstroms now safeguard some of Shelby's most iconic creations, including a pair of 1968 Ford Mustang Shelby GT500KRs worth $800,000.\nCNBC 1968 Ford Mustang Shelby GT500KRs Ted says the jewel of his collection is the first Paxton Shelby ever built: a 1966 Ford Mustang Shelby GT350 Paxton Supercharged, now worth half a million dollars.\n\"We have such a fondness for those cars,\" says Ted. \"It's really hard to say no.\"\nCNBC 1966 Ford Mustang Shelby GT350 Paxton Supercharged After purchasing each vintage vehicle, the Segerstroms oversee a painstaking restoration process in order to preserve them. Ted says some of his cars remain up to 98 percent factory original.\n\"That's the way we like to have them,\" says Ted. \"This is what made them so special, and that's the way we're going to keep them.\"\nCNBC The Segerstrom Collection The Segerstroms hope to one day showcase their collection in a car museum, which they plan to run as a non-profit with all proceeds benefiting the Shriners for Children Medical Center in Pasadena, California.\n\"All profits of the company will go to that hospital every year,\" says Ted. \"That's our life work.\"\n\"Secret Lives of the Super Rich\" is available on demand on CNBC.\nDon't miss: This $2.6 million sports car is one of the fastest on the planet—and Floyd Mayweather once owned it\nshow chapters This rare hyper-car was once owned by boxing champ Floyd Mayweather 12:59 PM ET Wed, 8 Nov 2017 | 01:01 Like this story? Like CNBC Make It on Facebook !", "external_links": [], "published": "2018-01-04T17:46:00.000+02:00", "crawled": "2018-01-04T17:46:32.012+02:00", "highlightTitle": ""}