{"organizations": [], "uuid": "d2230830349c8dd130b60edfa8ecc5012a1cb82d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 20, "shares": 20, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226027320&w=1200&r=LYNXMPEE0R0IL", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-egypt-economy-housing-analysis/egypt-to-pour-new-housing-into-seemingly-sated-market-idUSKBN1FH0BM", "country": "US", "domain_rank": 408, "title": "Egypt to pour new housing into seemingly sated market", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-28T21:46:00.000+02:00", "replies_count": 0, "uuid": "d2230830349c8dd130b60edfa8ecc5012a1cb82d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-egypt-economy-housing-analysis/egypt-to-pour-new-housing-into-seemingly-sated-market-idUSKBN1FH0BM", "ord_in_thread": 0, "title": "Egypt to pour new housing into seemingly sated market", "locations": [], "entities": {"persons": [], "locations": [{"name": "egypt", "sentiment": "none"}, {"name": "gulf of suez", "sentiment": "none"}, {"name": "cairo", "sentiment": "none"}, {"name": "suez canal", "sentiment": "none"}, {"name": "gabal galala", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Egypt’s government plans to pour tens of thousands of new housing units onto the market in each of the next few years, but it’s not clear how easily the country can absorb them.\nThe authorities say they want to reduce crowding in Egypt’s congested cities and provide homes for the poor but many analysts say the new residences are priced way beyond the means of most Egyptians and a good share of them will remain unsold.\nThe government is undeterred, however, and is moving full steam ahead on a new capital city 50 km east of Cairo, a project that will designed to deliver 240,000 new housing units over the next five years.\nIt is also in the second year of a five-year plan to provide a million subsidized homes for the poor. According to press reports, 150,000 low-income units have already been delivered and another 260,000 are under construction.\nDozens of other housing projects, many spearheaded by the army, are underway. Activity is especially strong along the Suez Canal, which has been declared a special economic zone, at Gabal Galala in the mountains along the Gulf of Suez and at al-Alamein on the Mediterranean coast.\nA network of highways and residential streets has been extended into the desert around Cairo to make way for the new developments, especially to the east towards Suez, in anticipation of a flow of buyers seeking to escape the crowded confines of the Nile Valley.\nSome of the demand for new housing is coming from Egyptians working overseas who sent more than $5 billion back to Egypt in the third quarter of 2017 alone.\nWith inflation now running at an annual 22 percent and expected to remain in the double digits for several years at least, Egyptians have been searching for investments that will preserve the value of their assets.\nFEW INVESTMENT OPPORTUNITIES Because of years of restrictions on sending cash abroad, the only place most Egyptians inside the country can invest their cash, apart from the country’s small stock exchange or in interest-bearing bank accounts, is in real estate.\nAs a result, Egyptians have been snapping up apartments and villas in new desert developments, confident that housing prices have nowhere to go but up in an overcrowded country whose population is growing by 2.5 percent a year.\n“The more inflation is on the rise, the more people will run towards real estate, regardless of the real demand and real supply,” property consultant Haitham Khalifa said.\nThis rush to buy real estate has created a vast pool of housing, but it is unclear who will want to buy or rent them when their owners decide they want to cash in on their investments. Row upon row of houses now stand empty.\nFor many Egyptians, these properties are their main investments. Many of wealthy people have bought dozens of villas and apartments, with some rented out and others sitting empty.\nAccording to a census released in October by the state statistics agency CAPMAS, 13 million units are either under construction or finished but unoccupied, compared to 22.5 million units that are inhabited.\nAdded together, this works out to 35.5 million units in a country with a population of 96.4 million, or 2.7 people per unit.\nSlideshow (12 Images) Signs are emerging that the new government housing projects will be entering a market that is already saturated, especially at the higher end.\nFALLING PRICES Measured in U.S. dollars, housing prices in Egypt dropped substantially after the government devalued the currency by half in November 2016.\nWael Ziada, head of investment company Zilla Capital, estimates that prices have fallen to about $800 per square meter from $1,000 before the devaluation.\n“This is something companies will never tell you. They will not go below their headline prices,” said Ziada, who until recently was head of research at EFG Hermes, Egypt’s biggest investment bank. “What they may do is allow for a smaller down payment and a longer period so that the effective price will go down.”\nAly Allouba, the head of Cairo-based Edge Portfolio Management, gives an example. At the end of 2013, he had his eye on a townhouse in a compound built by one of the smaller property developers.\nThe seller at the time was asking two million Egyptian pounds, when the pound was at 6.95 to the dollar, or $288,000. The seller was demanding 15 percent down, with the rest paid in quarterly installments over four years.\nNow, four years later, the seller is asking 4 million pounds ($227,000) for the same townhouse, but with only 10 percent down and quarterly installments over eight years instead of four.\nAdjusting for Egypt’s double-digit inflation, the extended payments have substantially reduced the cost of the unit.\nEconomists and real estate agents say most sales have been in the primary market, partly because property developers are prepared to provide finance in a country where mortgage finance is still rare, while the secondary market is relatively dormant.\nStill, Yasseen Mansour, chairman of Palm Hills Development ( PHDC.CA ), one of Egypt’s biggest private property developers, estimates demand for “high-middle to high-end” housing at up to 90,000 units per year, and that only 24,000 such units were supplied in 2016.\n“You have a million marriages a year and 2.5 million people coming into the market every year,” he told Reuters.\nPalm Hills in October acquired the rights to develop 12.6 million square meters of desert land 15 kilometers west of the pyramids, where it will develop 37,000 housing units. It will begin selling the units in April or May, Mansour said. This is in addition to more than 7,000 units it is developing in other areas in Egypt.\nThe average wage for Egyptians, including government and private sector employees, was about 4,000 pounds a month in 2016, according to CAPMAS, putting most new housing well out of the reach of the bulk of the population.\n“There is nothing at all active in our country these days except for small apartments,” said Hany Osman, who founded and runs El Shams Real Estate, a high-end estate agency.\nHe said the typical high-end buyer has been hurt by an economic slowdown since Egypt’s 2011 popular uprising.\n“No matter how wealthy, you will find him negatively affected economically. If he’s wealthy, the production in his company has weakened and he has been affected negatively.”\nReporting by Patrick Werr; Additional reporting by Seham Eloraby\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-28T21:46:00.000+02:00", "crawled": "2018-01-29T01:39:09.022+02:00", "highlightTitle": ""}