{"organizations": [], "uuid": "e6696ea31090c834248e7765fb81fb3e70cbaffa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955758-GettyImages-906207428.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/24/stocks-already-have-topped-wall-street-predictions-for-the-whole-year.html", "country": "US", "domain_rank": 767, "title": "Stocks already have topped Wall Street predictions for the whole year", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T18:44:00.000+02:00", "replies_count": 0, "uuid": "e6696ea31090c834248e7765fb81fb3e70cbaffa"}, "author": "Jeff Cox", "url": "https://www.cnbc.com/2018/01/24/stocks-already-have-topped-wall-street-predictions-for-the-whole-year.html", "ord_in_thread": 0, "title": "Stocks already have topped Wall Street predictions for the whole year", "locations": [], "entities": {"persons": [{"name": "joe lavorgna", "sentiment": "none"}, {"name": "natixis", "sentiment": "none"}], "locations": [{"name": "americas", "sentiment": "none"}], "organizations": [{"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Barely 16 trading days into the new year, the stock market already has exceeded many expectations for its 2018 performance.\nWith its rise in early trading Wednesday, the S&P 500 has topped no fewer than seven full-year forecasts . That's come as the index has registered a gain of more than 6.5 percent so far and the influx into stocks shows no signs of abating.\nOf course, it's still early in the year. But the trend is impressive .\n\"I don't understand the pessimism. It doesn't make any sense. Old habits die hard,\" said Joe LaVorgna, chief economist for the Americas at Natixis. \"It's not to say we may not end the year where we started, but the momentum for higher stock prices is there because you've got all the excuses lining up for it.\"\nIndeed, the willingness of investors to jump into the market has fooled many top Wall Street experts, who were convinced the year would be positive but with considerably more muted returns than the market has delivered in recent years.\nThe list of firms whose price targets were at least momentarily topped when the S&P 500 rose above 2,850 in mid-morning trade reads like an all-star lineup of prognosticators: Morgan Stanley (2,750), Goldman Sachs (2,850), Deutsche Bank (2,850), Citigroup (2,800), Wells Fargo (2,850), CFRA (2,800 12-month target) and BNY Mellon (2,850).\nMarket watchers have a plethora of theories for the ever-rising market, from the more skeptical view that this is a late-cycle rush from the last of the bears to the more fundamental view that tax cuts and upward revisions for earnings are removing any reason for bearishness.\nWhatever the truth, it's undeniable that the market is defying expectations and making pessimism a losing strategy.\n\"As we have seen in past secular bull markets, stocks can keep rising longer than most think possible, so until we start to see signs of deterioration, we don't think it wise for most investors to get too cautious for no other reason than the appearance of a lack of caution,\" Andrew Adams, a strategist at Raymond James, said in a note. \"What it does mean, though, is that continued vigilance is crucial, and we do recommend staying tuned into what the market is telling us just in case its message begins to change.\"", "external_links": [], "published": "2018-01-24T18:44:00.000+02:00", "crawled": "2018-01-24T18:54:32.026+02:00", "highlightTitle": ""}