{"organizations": [], "uuid": "a066915366f5757a56cb6f112dec09ea842b3693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-gemini-rosemont-adds-meehan-and-frandson-to-leadership-team.html", "country": "US", "domain_rank": 767, "title": "Gemini Rosemont adds Meehan and Frandson to leadership team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T21:37:00.000+02:00", "replies_count": 0, "uuid": "a066915366f5757a56cb6f112dec09ea842b3693"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-gemini-rosemont-adds-meehan-and-frandson-to-leadership-team.html", "ord_in_thread": 0, "title": "Gemini Rosemont adds Meehan and Frandson to leadership team", "locations": [], "entities": {"persons": [{"name": "meehan", "sentiment": "negative"}, {"name": "gemini rosemont", "sentiment": "negative"}, {"name": "john meehan", "sentiment": "none"}, {"name": "nina frandson", "sentiment": "none"}, {"name": "frandson", "sentiment": "none"}], "locations": [{"name": "n.m.", "sentiment": "none"}, {"name": "frandson", "sentiment": "none"}], "organizations": [{"name": "gemini rosemont commercial real estate", "sentiment": "negative"}, {"name": "gemini rosemont", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA FE, N.M., Jan. 30, 2018 /PRNewswire/ -- Gemini Rosemont Commercial Real Estate, a leading commercial real estate investment company with approximately 12.5 million square feet of commercial office space in 20 states, has added two seasoned executives to its leadership team.\nJohn Meehan has been named the company's chief operating officer and Nina Frandson has joined Gemini Rosemont as a senior managing director for capital markets.\nIn his COO role, Meehan will oversee corporate transactions, provide financing and multidisciplinary leadership, and will partner with the company's asset management and acquisition divisions, to support a variety of initiatives. He will also be directly involved with the capital raise team.\nFrandson's efforts will be focused on capital markets, and is a leading member of the capital raise team for Gemini Rosemont.\n\"Gemini Rosemont is in the midst of a multi-year capital raise and acquisition program, and adding these two experienced professionals to our team is part of a long-term strategy to bolster our efforts specifically in those two areas,\" said Ian Brownlow, interim chief executive officer and chief financial officer. \"The combined talent and experience that John and Nina bring to the company will help us achieve both our short- and long-term goals.\"\nPrior to joining Gemini Rosemont, Meehan was the vice president, director of capital markets for Douglas Emmett, Inc., with responsibilities for all transactional activities including acquisitions, financings and dispositions.\nDuring his 16-year tenure with Douglas Emmett, Meehan led the acquisition of 9.4 million square feet of office properties and over 1,500 apartment units totaling $4 billion in investments. He also closed over $12 billion in financing transactions, led the sale of $300 million of assets and was an integral part of the initial public offering process that resulted in, at the time, the largest REIT IPO in history with a $1.59 billion initial offering.\nMeehan received his Master's degree in Business Administration from the University of Southern California after earning his Bachelor of Arts degree in Finance from the Michigan State University.\nFrandson was a managing director and raised capital for Cantor Fitzgerald's proprietary and third party real estate and private equity funds prior to joining Gemini Rosemont. Before her time at Cantor Fitzgerald, Frandson used her significant institutional investor relationships to finance funds represented by Guggenheim Partners and AIG. Previously, Frandson underwrote and sold large commercial real estate portfolios to institutional investors while working in the Cushman & Wakefield Capital Markets Group. Frandson began her career at Merrill Lynch, where she actively gathered capital from and managed portfolios for high net worth clients and institutional investors.\nFrandson received her Bachelor's degree from the University of California, Los Angeles. She also has a Law degree from the University of California, Los Angeles School of Law and a Masters of Business degree from Columbia Business School.\nMeehan is based in Los Angeles, Calif., and Frandson is based in New York City.\nView original content with multimedia: http://www.prnewswire.com/news-releases/gemini-rosemont-adds-meehan-and-frandson-to-leadership-team-300590375.html\nSOURCE Gemini Rosemont Commercial Real Estate", "external_links": ["http://www.prnewswire.com/news-releases/gemini-rosemont-adds-meehan-and-frandson-to-leadership-team-300590375.html"], "published": "2018-01-30T21:37:00.000+02:00", "crawled": "2018-01-31T00:52:02.013+02:00", "highlightTitle": ""}