{"organizations": [], "uuid": "8c0de084cc731c3b8a34e49577b6a7268f6dca66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-livexlive-acquires-slacker-radio.html", "country": "US", "domain_rank": 767, "title": "LiveXLive Acquires Slacker Radio", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-05T19:06:00.000+02:00", "replies_count": 0, "uuid": "8c0de084cc731c3b8a34e49577b6a7268f6dca66"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-livexlive-acquires-slacker-radio.html", "ord_in_thread": 0, "title": "LiveXLive Acquires Slacker Radio", "locations": [], "entities": {"persons": [], "locations": [{"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "livexlive media, inc.", "sentiment": "neutral"}, {"name": "abc news", "sentiment": "none"}, {"name": "slacker radio", "sentiment": "none"}, {"name": "espn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEVERLY HILLS, Calif., Jan. 5, 2018 /PRNewswire/ -- LiveXLive Media, Inc. (OTC: LIVX) (\"LiveXLive\"), one of the only premium networks devoted to live music and music-related video content, announced today that it has closed its acquisition of Slacker Radio (\"Slacker\"), a streaming music and personalized radio subscription service.\nSlacker is a key innovator in the streaming music space. Slacker represents the next-generation of personalized radio, enabling music lovers to choose from the broadest selection of human-curated stations personalized to their independent tastes. Its proven programming and personalization platform boasts a catalog of more than 13 million audio tracks from all three major music companies and many independent labels. Slacker has approximately 1.5 million monthly unique users and more than 400,000 subscribers on its paid and ad-supported platforms. Additionally, Slacker has hundreds of expertly programmed stations, including news, sports, and talk from ABC News, ESPN and others. Slacker also powers the streaming music experiences for global brands including Tesla and Samsung.\n\"LiveXLive is leading the evolution of the music business and we believe Slacker is a perfect complement to our video platform,\" said Robert Ellin, CEO and Chairman of LiveXLive Media. \"We look forward to working with the Slacker team as we combine the best audio and video content across live and recorded music. By combining LiveXLive's leadership in music festival streaming and our massive music video content with Slacker's proven audio platform, we immediately expand our reach and dramatically accelerate our ability to deliver world-class music-related entertainment across platforms – on a global scale,\" continued Mr. Ellin.\nSlacker and LiveXLive are combining content programming teams and building a network of both audio and video channels that stretch across mobile, TV apps, and in-car infotainment systems. Slacker Radio furthers LiveXLive's ability to drive innovation across technology and digital entertainment while providing the company with access to a new base of consumers and music enthusiasts. Slacker's technology team and data-rich platform bring significant advantages to both the audio and video sides of LiveXLive. Similarly, LiveXLive's leadership in live music streaming and access to festivals, clubs, venues, concerts and its influencer network, with more than 85 million combined followers, will open the door for creative new content collaborations and increased exposure.\nNearly 60 percent of millennials use two or more apps for streaming music, according to Nielsen. The market is primed for a service that combines video with the live and recorded music worlds. Bringing Slacker into the LiveXLive fold provides fans with a premium radio experience and a virtual pass to some of music's biggest nights, from festivals and concerts to special performances by some of the world's top artists.\n\"We are thrilled to join the LiveXLive team. We look forward to executing on our mutual commitment to reinvigorate the music business by creating fan-first content and programming. We are leveraging our combined cutting-edge technologies to deliver a superior consumer experience which will accelerate growth in the overall business,\" said Duncan Orrell-Jones, CEO of Slacker.\nAbout LiveXLive Media, Inc.\nLiveXLive Media, Inc. (\"LiveXLive Media\") is a consolidated group of premier media brands and technology assets that create a social media ecosystem for music, including the LiveXLive platform (\"LiveXLive\"). LiveXLive is one of the world's only premium streaming services devoted to live music and music-related video content, delivering live streamed and premium, on demand original content to nearly any internet-connected screen. Since its launch in 2015, LiveXLive has been building an online destination for music fans to enjoy premium live performances from music venues and leading music festivals around the world, such as Rock in Rio, Outside Lands Music and Arts Festival and Hangout Music Festival, as well as premium original content, artist exclusives and industry interviews. The LiveXLive platform has featured performances and content from some of the most popular artists in various music genres, including Rihanna, Katy Perry, Metallica, Duran Duran, Radiohead, Chance The Rapper, Bruce Springsteen, Major Lazer and Maroon 5.\nLiveXLive Media's businesses also include social media influencer venture LiveXLive Influencers. LiveXLive Media is headquartered in Beverly Hills, CA. For more information, visit our website at www.livexlive.com and follow us on Facebook, Instagram and Twitter at @livexlive.\nForward-Looking Statements\nAll statements other than statements of historical facts contained in this press release are \"forward-looking statements.\" These statements involve known and unknown risks, uncertainties and other factors which may cause actual results, performance or achievements to differ materially from those expressed or implied by such statements. These factors include uncertainties as to identifying, acquiring, securing and developing content, ability to attract and retain users, successfully implementing LiveXLive Media's and Slacker's growth strategy, including relating to their technology platforms and applications, management's relationships with industry stakeholders, changes in economic conditions, competition, and other risks including, but not limited to, those described from in LiveXLive Media's Registration Statement on Form S-1, Amendment No. 5, filed with the Securities and Exchange Commission on December 15, 2017 (the \"SEC\") and other filings and submissions with the SEC. These forward-looking statements speak only as of the date hereof and LiveXLive Media disclaims any obligations to update these statements except as may be required by law.\nView original content with multimedia: http://www.prnewswire.com/news-releases/livexlive-acquires-slacker-radio-300578260.html\nSOURCE LiveXLive Media, Inc.", "external_links": ["http://www.livexlive.com/", "http://www.prnewswire.com/news-releases/livexlive-acquires-slacker-radio-300578260.html"], "published": "2018-01-05T19:06:00.000+02:00", "crawled": "2018-01-05T20:12:42.010+02:00", "highlightTitle": ""}