{"organizations": [], "uuid": "f5df4b8046eca35d7332341db6a0bb289674b390", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 88}, "facebook": {"likes": 417, "shares": 417, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/28/104311325-GettyImages-646442094.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/read-excerpts-from-trumps-first-state-of-the-union-address.html", "country": "US", "domain_rank": 767, "title": "Read excerpts from Trump's first State of the Union address", "performance_score": 4, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.175, "site_type": "news", "published": "2018-01-31T01:43:00.000+02:00", "replies_count": 0, "uuid": "f5df4b8046eca35d7332341db6a0bb289674b390"}, "author": "Kevin Breuninger", "url": "https://www.cnbc.com/2018/01/30/read-excerpts-from-trumps-first-state-of-the-union-address.html", "ord_in_thread": 0, "title": "Read excerpts from Trump's first State of the Union address", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jim lo scalzo", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "donald j. trump", "sentiment": "none"}], "locations": [{"name": "washington, dc", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "getty images", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " was slated to deliver his first State of the Union address before a joint session of Congress on Tuesday evening.\nThe speech, likely peppered with calls for unity and reconciliation, is going to be delivered to a Congress plagued by fraying negotiations and partisan divisions on issues such as sanctions on countries like Russia, federal funding and the ongoing investigations into the Trump campaign's ties to Russia.\nThe address will provide a rubric for the Trump administration's policy goals on trade , immigration, infrastructure and national security for the year ahead.\nThe White House made excerpts available more than two hours before the speech. Read them below:\nTogether, we are building a SAFE, STRONG, and PROUD America. We want every American to know the dignity of a hard day's work; we want every child to be safe in their home at night, and we want every citizen to be proud of this land that we love. Just as I promised the American People from this podium 11 months ago, we enacted the biggest tax cuts and reform in American history. Our massive tax cuts provide tremendous relief for the Middle Class and small businesses. Since we passed tax cuts, roughly 3 million workers have already gotten tax cut bonuses – many of them thousands of dollars per worker. This is our New American Moment. There has never been a better time to start living the American dream. Tonight, I want to talk about what kind of future we are going to have, and what kind of nation we are going to be. All of us, together, as one team, one people, and one American family. Americans love their country. And they deserve a government that shows them the same love and loyalty in return. For the last year we have sought to restore the bonds of trust between our citizens and their government. In our drive to make Washington accountable, we have eliminated more regulations in our first year than any administration in history. We have ENDED the war on American Energy – and we have ENDED the War on CLEAN COAL. We are now an exporter of energy to the world. America has also finally turned the page on decades of unfair trade deals that sacrificed our prosperity and shipped away our companies, our jobs and our nation's wealth. America is a nation of builders. We built the Empire State Building in just one year – isn't it a disgrace that it can now take ten years just to get a permit approved for a simple road? I am asking both parties to come together to give us the safe, fast, reliable, and modern infrastructure our economy needs and our people deserve. Struggling communities, especially immigrant communities, will also be helped by immigration policies that focus on the best interests of American Workers and American Families. So tonight I am extending an open hand to work with members of both parties, Democrats and Republicans, to protect our citizens, of every background, color, and creed. As we rebuild America's strength and confidence at home, we are also restoring our strength and standing abroad. Last year I pledged that we would work with our allies to extinguish ISIS from the face of the earth. One year later, I'm proud to report that the coalition to defeat ISIS has liberated almost 100 percent of the territory once held by these killers in Iraq and Syria. But there is much more work to be done. We will continue our fight until ISIS is defeated. Past experience has taught us that complacency and concessions only invite aggression and provocation. I will not repeat the mistakes of the past Administrations that got us into this dangerous position.\nWATCH: Trump will tout economy, stock market show chapters Strategas' Dan Clifton: Trump will tout economy, stock market in speech 15 Hours Ago | 01:35", "external_links": [], "published": "2018-01-31T01:43:00.000+02:00", "crawled": "2018-01-31T01:43:22.000+02:00", "highlightTitle": ""}