{"organizations": [], "uuid": "cfb8c08d006f53fe5768ad8db4d625ac3e52d2d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225297309&w=1200&r=LYNXMPEE0O1QO", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-golf-farmers/golf-woods-starts-slowly-in-pga-tour-comeback-at-torrey-pines-idUKKBN1FE34U", "country": "US", "domain_rank": 408, "title": "Golf - Woods starts slowly in PGA Tour comeback at Torrey Pines", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:50:00.000+02:00", "replies_count": 0, "uuid": "cfb8c08d006f53fe5768ad8db4d625ac3e52d2d9"}, "author": "", "url": "https://uk.reuters.com/article/uk-golf-farmers/golf-woods-starts-slowly-in-pga-tour-comeback-at-torrey-pines-idUKKBN1FE34U", "ord_in_thread": 0, "title": "Golf - Woods starts slowly in PGA Tour comeback at Torrey Pines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 10:43 PM / Updated 14 hours ago Woods shoots even-par 72 in PGA Tour comeback at Torrey Pines Andrew Both 3 Min Read \nLA JOLLA, California (Reuters) - Tiger Woods said he was “fine with that” after making a respectable return to the PGA Tour by shooting even-par 72 in the first round at the Farmers Insurance Open on Thursday. \nIn his first official start since the Dubai Desert Classic last February, Woods took a while to dust off the rust, but the quality of his shotmaking improved as the round progressed on the South Course at Torrey Pines. \nHe trails leader Tony Finau by seven strokes, equal 84th, and to make the cut will need to shoot at least par, if not better, in the second round on the North Course on Friday. \nDespite flashes of brilliance, Woods knows there is plenty of room for improvement. \n“I’ve got to hit my irons a little better than today,” he said. “It’s hard to make a lot of birdies when you’re not giving yourself any looks.” \nA gallery of about 2,000 people lined the first fairway to watch the 14-times major champion tee off at 10.40 AM local time (1840 GMT) on a course where he has won eight times. \nWoods, 42, was excited to compete again in an official event for the first time since having a spinal fusion last April. Never mind that he pulled his opening drive and ran up a bogey. Jan 25, 2018; San Diego, CA, USA; Tiger Woods plays his second shot on the second hole during the first round of the Farmers Insurance Open golf tournament at Torrey Pines Municipal Golf Course. Mandatory Credit: Orlando Ramirez-USA TODAY Sports \n“I care about what I do and it was fun to feel that competitive rush again. I still feel the same excitement, the same nerves, and hopefully one day I’ll be able to play that first hole well,” he said of the par-four hole that he double-bogeyed three times at the 2008 U.S. Open, which he won anyway. \nHe was in a relaxed mood on the fourth tee where he wandered over to the nearby cliff to watch a pod of dolphins playing in the Pacific Ocean below. Slideshow (3 Images) \nThe fourth, which follows the cliff high above the crashing waves, also afforded a perfect opportunity for a couple of hang gliders to gatecrash the event. \nThe hang gliders had gone when Woods showed the first glimpse of his old magic with a perfect drive at the par-five sixth, where he split the fairway, nonchalantly picked up his tee and strode off without even bothering to watch his ball. Related Coverage Tiger Woods' shotmaking in PGA Tour comeback impresses Reed \nFrom there he found the putting surface with a four-iron to set up his first birdie of the day. \nLater, he hit his best shot of the day at the par-three 16th, a six-iron that launched high and landed soft, the sort of shot he used to hit almost at will during his prime. \n“That’s what happens when your back is fused and I‘m not having nerve pain down my leg,” he said of his swing. “Those are good feelings.” Editing by Ed Osmond/Greg Stutchbury/Peter Rutherford", "external_links": [], "published": "2018-01-26T00:50:00.000+02:00", "crawled": "2018-01-26T01:14:21.019+02:00", "highlightTitle": ""}