{"organizations": [], "uuid": "563975d4b8593b3999927dad8f6088ae9a17be8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224057318&w=1200&r=LYNXMPEE0L0CK", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-japan-politics-abe/japans-abe-avoids-timeline-for-amending-pacifist-constitution-idUSKBN1FB0H8", "country": "US", "domain_rank": 408, "title": "Japan's Abe avoids timeline for amending pacifist constitution", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T07:46:00.000+02:00", "replies_count": 0, "uuid": "563975d4b8593b3999927dad8f6088ae9a17be8b"}, "author": "", "url": "https://www.reuters.com/article/us-japan-politics-abe/japans-abe-avoids-timeline-for-amending-pacifist-constitution-idUSKBN1FB0H8", "ord_in_thread": 0, "title": "Japan's Abe avoids timeline for amending pacifist constitution", "locations": [], "entities": {"persons": [{"name": "abe", "sentiment": "negative"}, {"name": "shinzo abe", "sentiment": "none"}, {"name": "linda sieg", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - Japanese Prime Minister Shinzo Abe opened a new session of parliament on Monday with familiar promises for economic reform and stronger defense, but steered clear of setting a timeline for his goal of revising the post-war, pacifist constitution.\nThe push by the conservative Japanese leader to fulfill his long-held ambition coincides with rising concerns about North Korea’s nuclear and missile programs and China’s military assertiveness.\nAbe’s wariness over setting a timeline reflects the delicate task he faces amending the constitution’s Article 9, which if taken literally, bans a standing military.\nSuccessive governments have interpreted Article 9 to allow a military exclusively for self-defense.\nBut Abe, aiming to build a lasting legacy as he enters a sixth year as prime minister, wants to add a clause making clear that the armed forces are constitutional.\n“I hope each party will submit concrete proposals to parliament ... deepen debate and move forward,” Abe said in his speech to parliament. “For the sake of our grandchildren, isn’t now the time to make progress toward building a new country?”\nAmendments require approval by two-thirds of both houses of parliament and a majority of voters in a referendum.\nJapan's Prime Minister Shinzo Abe makes a speech at an opening of a new session of parliament in Tokyo, Japan January 22, 2018. REUTERS/Kim Kyung-Hoon Abe’s ruling bloc has a two-thirds “super majority” in both chambers - at least until an upper house election next year - but the outlook for a referendum remains murky.\nAbe has proposed an amendment that would retain Article 9’s first clause renouncing the right to go to war and a second clause banning a standing military while adding a specific reference to the “Self-Defense Forces” (SDF), as Japan calls its military.\nThose in favor of his proposal say it would just codify the status quo. Opponents argue it would make it easier for Japan’s military to take part in overseas conflicts.\nJapan's Prime Minister Shinzo Abe is seen on a TV camera screen as he makes a speech at an opening of a new session of parliament in Tokyo, Japan January 22, 2018. REUTERS/Kim Kyung-Hoon A Mainichi newspaper survey published on Monday showed 31 percent agreed with Abe’s proposal, while 12 percent supported a more drastic proposal that would delete the second clause while adding a reference to the SDF.\nTwenty-one percent opposed any change and 27 percent said they didn’t know.\nA public vote on the constitution could end up a referendum on Abe, whose support last year fell sharply due to suspected cronyism scandals.\nThe Mainichi poll put support for Abe at 44 percent, though only 37 percent want to see him win a third term as LDP leader in September, a win that would put him on track to become Japan’s longest serving premier.\nAll of which means Abe may decide not to rush and risk rejection. “Abe is flexible. He might aim for an amendment around 2020,” Harukata Takenaka, a professor at the National Graduate Institute for Policy Studies, told reporters recently.\nEditing by Simon Cameron-Moore\n ", "external_links": [], "published": "2018-01-22T07:46:00.000+02:00", "crawled": "2018-01-22T08:03:33.007+02:00", "highlightTitle": ""}