{"organizations": [], "uuid": "b2cd1651005815f8d0b08cf5cf1b4af152ad31dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-europe-migrants-libya/survivors-say-about-50-migrants-may-have-died-off-libya-idUSKBN1EY2LP", "country": "US", "domain_rank": 408, "title": "Survivors say about 50 migrants may have died off Libya", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T23:15:00.000+02:00", "replies_count": 0, "uuid": "b2cd1651005815f8d0b08cf5cf1b4af152ad31dd"}, "author": "", "url": "https://www.reuters.com/article/us-europe-migrants-libya/survivors-say-about-50-migrants-may-have-died-off-libya-idUSKBN1EY2LP", "ord_in_thread": 0, "title": "Survivors say about 50 migrants may have died off Libya", "locations": [], "entities": {"persons": [{"name": "nasr al-qamoud", "sentiment": "none"}, {"name": "zainab abdesalam", "sentiment": "none"}], "locations": [{"name": "libya", "sentiment": "none"}, {"name": "zawiya", "sentiment": "none"}, {"name": "tripoli", "sentiment": "none"}, {"name": "khoms", "sentiment": "none"}], "organizations": [{"name": "min read  tripoli", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TRIPOLI (Reuters) - Survivors from a boat that sank off Libya’s coast on Tuesday said about 50 people who had embarked with them were missing and feared dead.\nLibyan coastguard vessels picked up about 300 migrants from three boats off the coast of the North African country on Tuesday, but one of the boats foundered and the coastguard only found 16 survivors.\n“We found the migrant boat at about 10 o’clock this morning, it had sunk and we found 16 migrants. The rest were all missing and unfortunately we didn’t find any bodies or (other) survivors,” said Nasr al-Qamoud, a coastguard commander.\nSeveral of the survivors, who were brought back to a naval base in Tripoli, said there were originally about 70 people on board the boat when it set off near the town of Khoms, east of the capital. The two other migrant boats were found off Zawiya, west of Tripoli.\nA Nigerian woman who had been on board the boat that sank, Zainab Abdesalam, told Reuters the migrants had waited several hours to be rescued and that the survivors were extremely weak.\n“I feel so disappointed because I could not make it to where I want to go,” she said, sobbing. “I feel so disappointed and I don’t want to go to prison.”\nLibya is the most common departure point for migrants trying to reach Europe from Africa by sea. More than 600,000 have crossed the central Mediterranean in the past four years, generally traveling in flimsy inflatable craft provided by smugglers that often break down or puncture.\nUnder heavy pressure from Italy, some Libyan armed factions have blocked smuggling since last summer. Libya’s Italian-backed coastguard has also stepped up interceptions, returning migrants to Libya where they are detained and often reenter smuggling networks.\nThe International Organization for Migration (IOM) estimated that 2,832 migrants died last year trying to reach Italy from North Africa, down from 4,581 in 2016. Some 119,310 people made it alive to Italy in 2017 against 181,436 the year before.\nReporting by Hani Amara; Writing by Aidan Lewis; Editing by Gareth Jones\n ", "external_links": [], "published": "2018-01-09T23:15:00.000+02:00", "crawled": "2018-01-09T23:28:57.004+02:00", "highlightTitle": ""}