{"organizations": [], "uuid": "5c926e406b24bf47bad30822fa2c3a497f6ade76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226057181&w=1200&r=LYNXMPEE0R0OM", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/us-trade-nafta/canada-pm-opposition-wants-to-give-into-u-s-demands-on-nafta-idINKBN1FH0QZ", "country": "US", "domain_rank": 408, "title": "Canada PM: Opposition wants to give into U.S. demands on NAFTA", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T18:20:00.000+02:00", "replies_count": 0, "uuid": "5c926e406b24bf47bad30822fa2c3a497f6ade76"}, "author": "", "url": "https://in.reuters.com/article/us-trade-nafta/canada-pm-opposition-wants-to-give-into-u-s-demands-on-nafta-idINKBN1FH0QZ", "ord_in_thread": 0, "title": "Canada PM: Opposition wants to give into U.S. demands on NAFTA", "locations": [], "entities": {"persons": [{"name": "david ljun", "sentiment": "negative"}, {"name": "justin trudeau", "sentiment": "none"}, {"name": "trudeau", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "min read  montreal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONTREAL (Reuters) - Canadian Prime Minister Justin Trudeau on Sunday set aside the nation’s nonpartisan efforts to defend NAFTA, accusing his main rivals in Parliament of wanting to give in to hardline U.S. demands for revamping the treaty.\nOfficials from the United States, Canada and Mexico will wrap up the sixth of seven planned rounds of talks on the North American Free Trade Agreement in Montreal on Monday, with little sign of agreement on U.S. proposals to overhaul the $1.2 trillion pact.\nOpinion polls show Trudeau’s Liberals are still in the lead ahead of an October 2019 election, but the right-of-center Conservatives are narrowing the gap.\nTrudeau told Liberal legislators in Ottawa that the government was working hard to get a better NAFTA deal and took a swipe at the Conservatives, who had generally backed his approach but lately have been critical of Trudeau’s demands.\n“If they had their way, we’d give in to American demands on NAFTA,” he said. “We have a different way of doing things. We will always stand up for Canadians.”\nRepresentatives for the Conservatives were not immediately available for comment.\nCanadian politicians and officials have traveled across the United States for 18 months to sell the benefits of free trade.\nDespite the efforts, NAFTA’s future is in doubt. U.S. President Donald Trump, who blames the 1994 treaty for job losses and a big trade deficit with Mexico, has repeatedly threatened to withdraw.\nFILE PHOTO: A Chrysler semi truck heading for Detroit, Michigan, drives on the lane to Ambassador Bridge in Windsor, Ontario, Canada, April 28, 2017. REUTERS/Rebecca Cook/File Photo “I‘m not as optimistic right now as when I got off the plane yesterday or the day before when I got here,” said U.S. Representative Bill Pascrell, the top Democrat on the House Ways and Means Committee’s trade subcommittee.\nPascrell, in Montreal for meetings on the sideline of the talks, told reporters on Sunday he did not feel Mexican negotiators were willing to make labor law changes to allow workers to join unions and earn higher wages.\nA senior source close to the talks told reporters late Saturday that “the United States needs to show flexibility” when it comes to its major proposed reforms to NAFTA.\nSlideshow (3 Images) “Do we feel optimistic? I would say cautiously so,” added the source, who spoke on the condition of anonymity.\nChief negotiators had the day off on Sunday.\nU.S. Trade Representative Robert Lighthizer, Canadian Foreign Minister Chrystia Freeland and Mexican Economy Minister Ildefonso Guajardo will meet in Montreal on Monday to review progress so far.\nSources familiar with the negotiations had initially talked about the three senior officials meeting for dinner on Sunday but Canadian officials said that would not happen.\nOfficials said if the three conclude the process should continue, an additional round of talks will start in Mexico on Feb. 26.\nThe talks are scheduled to finish by the end of March to avoid clashing with Mexico’s presidential election in July. Mexican officials now suggest the deadline could be extended.\nWith additional reporting by Anthony Esposito in Montreal; Editing by Lisa Von Ahn and Jeffrey Benkoe\n ", "external_links": [], "published": "2018-01-28T18:20:00.000+02:00", "crawled": "2018-01-28T18:36:53.000+02:00", "highlightTitle": ""}