{"organizations": [], "uuid": "77fd287120060b44013c25ab481a6bc285305a0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-washington-prime-group-recasts-1-billion-revolving-credit-and-term-loan-facility.html", "country": "US", "domain_rank": 767, "title": "Washington Prime Group Recasts $1 Billion Revolving Credit and Term Loan Facility", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:05:00.000+02:00", "replies_count": 0, "uuid": "77fd287120060b44013c25ab481a6bc285305a0a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-washington-prime-group-recasts-1-billion-revolving-credit-and-term-loan-facility.html", "ord_in_thread": 0, "title": "Washington Prime Group Recasts $1 Billion Revolving Credit and Term Loan Facility", "locations": [], "entities": {"persons": [], "locations": [{"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "washington prime group recasts", "sentiment": "negative"}, {"name": "washington prime group inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "l.p.", "sentiment": "none"}, {"name": "washington prime group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMBUS, Ohio, Jan. 22, 2018 (GLOBE NEWSWIRE) -- Washington Prime Group Inc. (NYSE:WPG) today announced that its operating partnership, Washington Prime Group, L.P., has amended and restated its existing revolving credit and term loan facility that was set to mature with extension options on May 30, 2019. The newly recast $1 billion facility can be increased to $1.5 billion through currently uncommitted facility commitments. Excluding this accordion feature, the newly recast facility includes a $650 million revolver and $350 million term loan. When considering extension options, the facility will mature on December 30, 2022. The current pricing on the facility remains substantially consistent at LIBOR plus 1.25% on the revolver and LIBOR plus 1.45% on the term loan.\nBorrowings of approximately $155 million from the recast facility were used to refinance the outstanding balance on the existing revolving credit facility. The $350 million term loan was fully funded at closing. The Company applied those proceeds to fully satisfy the existing June 2015 term loan with an outstanding balance of $270 million, with the remainder used to reduce the outstanding balance on the revolving credit facility.\nOn January 19, 2018, the Company used the proceeds from its then existing revolving credit facility to repay the $86.5 million mortgage loan secured by The Outlet Collection Seattle.\nLou Conforti, CEO and Director stated: “We continue to execute on our financial objective of the past 18 months to further strengthen our balance sheet. The recast facility enhances our strong financial flexibility and demonstrates the confidence of our bank partners in the stability of our cash flows. In conjunction with our recent issuance of $750M of unsecured notes due August 2024, the recast of our credit facility illustrates our focus to mitigate refinancing risk and optimize our capital structure. Mark Yale, Rob Demchak, Lisa Indest, and WPG’s financial and legal teams should be commended on the execution of both.”\nBank of America, N.A. served as administrative agent; Merrill Lynch, Pierce, Fenner & Smith Incorporated was joint lead arranger and sole bookrunner; PNC Capital Markets LLC, U.S. Bank National Association, Citizens Bank, N.A., The Huntington National Bank and Sumitomo Mitsui Banking Corporation served as joint lead arrangers; PNC Bank, National Association and U.S. Bank National Association were co-syndication agents; Citizens Bank, N.A., The Huntington National Bank and Sumitomo Mitsui Banking Corporation were co-documentation agents; and Morgan Stanley Senior Funding Inc., SunTrust Bank, Regions Bank and Goldman Sachs Bank, USA served as senior managing agents.\nAdditional information regarding the terms of the recast and extension can be found on the Company’s Form 8-K filed with the Securities and Exchange Commission today.\nAbout Washington Prime Group\nWashington Prime Group Inc. is a retail REIT and a recognized leader in the ownership, management, acquisition and development of retail properties. The Company combines a national real estate portfolio with an investment grade balance sheet, leveraging its expertise across the entire shopping center sector to increase cash flow through rigorous management of assets and provide new opportunities to retailers looking for growth throughout the U.S. Washington Prime Group® is a registered trademark of the Company. Learn more at www.washingtonprime.com .\nContacts\nLisa A. Indest, CAO & Senior VP, Finance, 614.887.5844 or lisa.indest@washingtonprime.com\nKimberly A. Green, VP, Investor Relations & Corporate Communications, 614.887.5647 or kim.green@washingtonprime.com\nForward-Looking Statements\nThis news release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995 which represent the current expectations and beliefs of management of Washington Prime Group Inc. (“WPG”) concerning the proposed offering of the notes, the anticipated consequences and benefits of the offering of the notes and the targeted close date for the offering of the notes, and other future events and their potential effects on WPG, including, but not limited to, statements relating to anticipated financial and operating results, WPG’s plans, objectives, expectations and intentions, cost savings and other statements, including words such as “anticipate,” “believe,” “confident,” “plan,” “estimate,” “expect,” “intend,” “will,” “should,” “may,” and other similar expressions. Such statements are based upon the current beliefs and expectations of WPG’s management, and involve known and unknown risks, uncertainties, and other factors which may cause the actual results, performance, or achievements of WPG to be materially different from future results, performance or achievements expressed or implied by such forward-looking statements. Such factors include, without limitation: changes in asset quality and credit risk; ability to sustain revenue and earnings growth; changes in political, economic or market conditions generally and the real estate and capital markets specifically; the impact of increased competition; the availability of capital and financing; tenant or joint venture partner(s) bankruptcies; the failure to increase enclosed retail store occupancy and same-store operating income; risks associated with acquisitions, dispositions, development, expansion, leasing and management of properties; changes in market rental rates; trends in the retail industry; relationships with anchor tenants; risks relating to joint venture properties; costs of common area maintenance; competitive market forces; the level and volatility of interest rates; the rate of revenue increases as compared to expense increases; the financial stability of tenants within the retail industry; the restrictions in current financing arrangements or the failure to comply with such arrangements; the liquidity of real estate investments; the impact of changes to tax legislation and WPG’s tax positions; failure to qualify as a real estate investment trust; the failure to refinance debt at favorable terms and conditions; loss of key personnel; material changes in the dividend rates on securities or the ability to pay dividends on common shares or other securities; possible restrictions on the ability to operate or dispose of any partially-owned properties; the failure to achieve earnings/funds from operations targets or estimates; the failure to achieve projected returns or yields on development and investment properties (including joint ventures); expected gains on debt extinguishment; changes in generally accepted accounting principles or interpretations thereof; terrorist activities and international hostilities; the unfavorable resolution of legal or regulatory proceedings; the impact of future acquisitions and divestitures; assets that may be subject to impairment charges; significant costs related to environmental issues; and other risks and uncertainties, including those detailed from time to time in WPG’s statements and periodic reports filed with the Securities and Exchange Commission, including those described under “Risk Factors”. The forward-looking statements in this communication are qualified by these risk factors. Each statement speaks only as of the date of this press release and WPG undertakes no obligation to update or revise any forward-looking statements to reflect subsequent events or circumstances. Actual results may differ materially from current projections, expectations, and plans, if any. Investors, potential investors and others should give careful consideration to these risks and uncertainties.\nSource: Washington Prime Group", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/4ea0dd4a-297e-483e-a566-11bb61ac6c29", "https://www.globenewswire.com/Tracker?data=w2JA9HqTtbRl3bSHlBwerJ8RX-4LF2VFK0U_Up8C7qQXnQNmUKlEmEkqTQpdoDxos78PF-Ik1s8zO8CcLodv8R_3xIDO7Jflza5kYf5mMkz7O92fn-48BYSqYO6HMwug", "https://www.globenewswire.com/Tracker?data=9kQ2vFWMmWErgT-CyN6s3O04H0CqH7OlllLEn_P-XukkJdUxC1B9ffDPVSO9oAKFQqu-YssC03W0elgcLjn9A2OzS5V7VqpfH57gfB2Tjz0=", "https://www.globenewswire.com/Tracker?data=PMMZJxC8GDbPZkb8p4CNbGU-NwFLKJKAZAhTEkZFxA6TtZ565Rlyvck8mrFGzOS6qoc9mQPFCR_bq9VdCthVMrUAxZeq6PAyVqg-f4ax_typvrpJkAe9ZODfB2qj2vW-"], "published": "2018-01-23T00:05:00.000+02:00", "crawled": "2018-01-23T02:18:18.028+02:00", "highlightTitle": ""}