{"organizations": [], "uuid": "35dc6b87fedce1d848e416e2bea3db8cbc6dedf9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/areva-strategy/update-1-frances-areva-rebrands-to-orano-in-dire-uranium-market-idUSL8N1PI51F", "country": "US", "domain_rank": 408, "title": "UPDATE 1-France's Areva rebrands to Orano in dire uranium market", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:45:00.000+02:00", "replies_count": 0, "uuid": "35dc6b87fedce1d848e416e2bea3db8cbc6dedf9"}, "author": "", "url": "https://www.reuters.com/article/areva-strategy/update-1-frances-areva-rebrands-to-orano-in-dire-uranium-market-idUSL8N1PI51F", "ord_in_thread": 0, "title": "UPDATE 1-France's Areva rebrands to Orano in dire uranium market", "locations": [], "entities": {"persons": [{"name": "orano", "sentiment": "none"}, {"name": "geert de clercq", "sentiment": "none"}, {"name": "philippe knoche", "sentiment": "none"}, {"name": "knoche", "sentiment": "none"}], "locations": [{"name": "orano", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "areva", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Orano makes new start with uranium prices near decade low\n* Uranium prices too low to invest in new mines\n* Sale of reprocessing plant not key to Orano’s survival\n* Areva to leave prestigious HQ as part of cost-cut plan (Adds CEO comments, background)\nBy Geert De Clercq\nPARIS, Jan 23 (Reuters) - French uranium mining and nuclear fuel group Areva rebranded itself as Orano on Tuesday, closing the book on a years-long restructuring but still facing an uncertain future, with uranium prices at decade lows and the nuclear industry in the doldrums.\nChief Executive Philippe Knoche said a new name and logo were necessary to start another chapter in the history of the state-owned company, which was split in two and recapitalised in 2017 after years of losses wiped out its equity.\n“We had to change our name - we are a new company with a different perimeter, focused on the fuel cycle,” Knoche said at a presentation of the new brand.\nOrano refers to uranium, the core of the firm’s business, and its new circular yellow logo references the yellowcake uranium concentrate that it extracts from the ore.\nTo mark the change - and reduce real estate costs by 10 million euros ($12.3 million) a year - Orano will move out of its prestigious Paris headquarters, a distinctive black-slab skyscraper inspired by the monolith in Stanley Kubrick’s “2001: A Space Odyssey”.\nThe move is part of a plan to cut costs by about 250 million euros in the 2018-2020 period.\nWith its nuclear reactor building unit sold to fellow state-owned utility EDF last year, Orano goes back to being a pure nuclear fuel company, similar to its predecessor Cogema, before it was merged into Areva.\nOrano has net debt of close to 3 billion euros and by 2025 plans to invest about 2 billion euros in its plants and a similar amount in its mines, Knoche said.\nThe company aims to be cash-flow positive from this year, but Knoche said nothing about profit targets and admitted that market prices for uranium are too low to invest in new mines.\nHe said long-term contract prices for uranium were about $10 per pound higher than spot prices, but declined to say what price Orano needed to operate profitably in the long run.\nUranium prices are down 80 percent from a decade ago as Japan’s 2011 Fukushima disaster has led to a slowdown in reactor newbuilds and countries such as Germany abandon nuclear.\nKnoche said Orano was banking on nuclear growth in Asia. He expects the firm to earn 30 percent of its turnover there by 2020, up from 20 percent last year.\nTalks about selling a nuclear fuel reprocessing plant to China were “accelerating”, Knoche said, but would not give a deadline. Discussions about the project have been going on for a decade, while the price the firm hopes to get has fallen to around 10 billion euros from 15 billion euros.\nHe said the reprocessing plant deal was not essential for Orano’s survival. This month, Finance Minister Bruno Le Maire said the operation could “save” the French nuclear industry.\nWith an order book worth nearly eight years of turnover and solid business in service and maintenance for a large part of the world’s more than 400 nuclear reactors, Orano faces the prospect of rebuilding a profitable operation.\n“We will do it with humility. That is why the name is written in lower case,” Knoche said. ($1 = 0.8135 euros) (Reporting by Geert De Clercq and Benjamin Mallet; Editing by Sudip Kar-Gupta and Dale Hudson)\n ", "external_links": [], "published": "2018-01-23T17:45:00.000+02:00", "crawled": "2018-01-23T17:57:11.002+02:00", "highlightTitle": ""}