{"organizations": [], "uuid": "08bb5941c34471c19376bfe651d81217a72a3968", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-blackridge-technology-forms-government-advisory-board-and-appoints-four-proven-leaders.html", "country": "US", "domain_rank": 767, "title": "BlackRidge Technology Forms Government Advisory Board and Appoints Four Proven Leaders", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-17T16:31:00.000+02:00", "replies_count": 0, "uuid": "08bb5941c34471c19376bfe651d81217a72a3968"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-blackridge-technology-forms-government-advisory-board-and-appoints-four-proven-leaders.html", "ord_in_thread": 0, "title": "BlackRidge Technology Forms Government Advisory Board and Appoints Four Proven Leaders", "locations": [], "entities": {"persons": [{"name": "kevin carroll", "sentiment": "none"}, {"name": "peed", "sentiment": "none"}, {"name": "rhett a. hernandez", "sentiment": "none"}, {"name": "cindy e. moran", "sentiment": "none"}, {"name": "david l. peed", "sentiment": "none"}], "locations": [{"name": "nev.", "sentiment": "none"}], "organizations": [{"name": "blackridge technology forms government advisory board", "sentiment": "negative"}, {"name": "blackridge technology international, inc", "sentiment": "neutral"}, {"name": "blackridge government advisory board", "sentiment": "none"}, {"name": "cgsi", "sentiment": "none"}, {"name": "equinix government solutions", "sentiment": "none"}, {"name": "vp & gm", "sentiment": "none"}, {"name": "ciena government solutions, inc.", "sentiment": "none"}, {"name": "u.s. department of defense", "sentiment": "none"}, {"name": "government advisory board", "sentiment": "none"}, {"name": "equinix", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RENO, Nev., Jan. 17, 2018 /PRNewswire/ -- BlackRidge Technology International, Inc . (OTCQB: BRTI), a leading provider of next generation cyber defense solutions, has formed a Government Advisory Board and named David L. Peed, Kevin Carroll, Rhett A. Hernandez, and Cindy E. Moran to the board. The BlackRidge Government Advisory Board was created to add expert executive perspective and insights into the specific network and cyber security needs of the U.S. Department of Defense (DoD) IT environment as well as mission-critical federal government networks. BlackRidge products have completed the rigorous testing process required for use in DoD information networks.\nThe BlackRidge Government Advisory Board inaugural appointees are\nDavid L. Peed , who will chair the advisory board. Mr. Peed is currently Vice President and General Manager of Equinix Government Solutions responsible for shaping and executing Equinix's Americas Public Sector strategy. Previously he was the President of ITekFED of which he co-founded. Mr. Peed is the former VP & GM for Ciena Government Solutions, Inc. (CGSI) where he was instrumental in the growth of the organization during his nine-year tenure with Ciena. Under his leadership, CGSI became a major player in critical networks for the U.S. Department of Defense, Internet2, as well as many others in the government community. Mr. Peed has more than 30 years of experience in the telecom industry. T. Kevin Carroll, President of The Kevin Carroll Group from 2007 to the present. Mr. Carroll provides consulting advice to information technology companies on Federal Government acquisitions, with key focus on the Department of Defense, Veteran Administration and Army procurements. Previously he was the Army Program Executive Officer, Enterprise Information Systems (PEO EIS), responsible for the program management of the DOD and Army business and combat service support systems, as well as related Army communication and computer infrastructure. Mr. Carroll has over 30 years in government service, primarily in leading Army information technology procurement and contracting organizations. Rhett A. Hernandez, LTG, Retired, who served nearly 40 years in the United States Army as a Commander, Senior Staff Officer and Strategist, focusing on combat operations and cyber security. His last active duty assignment was as the first Commander of Army Cyber Command, where he was responsible for the daily operations, defense and risk management of all Army networks. Mr. Hernandez also served in numerous command and key staff assignments, including Deputy Chief of Staff for Army Operations, Commander Human Resources Command and Operations Division, and senior military advisor to Ambassador Saudi Arabia. He currently serves as the West Point Cyber Chair to the Army Cyber Institute and as President, CyberLens, LLC, which focuses on leadership, strategic planning, and risk management. Cindy E. Moran, a highly regarded expert within the defense information systems field having spent nearly 30 years working for the DoD with communications networks. Ms. Moran is currently the President and managing partner for Pikes Way LLC, an IT consulting firm specializing in strategic planning and management in the telecommunications sector. Her post government experience has her serving as a director on public and private boards. She previously served as the Director for Network Services, Defense Information Systems Agency (DISA), where her responsibilities included systems management of all DISA terrestrial and satellite communications networks supporting the DoD Information Network (DODIN). Ms. Moran has held multiple positions in support of DoD information technology systems, including hands-on network and system administration roles.\n\"The BlackRidge Government Advisory Board appointees bring extensive experience and strategic insights to BlackRidge, to help us advance the company as a trusted provider of world-class cyber security solutions to public sector customers,\" said Bob Graham, Chairman and CEO of BlackRidge Technology. \"We look forward to working with these outstanding individuals who are proven leaders and have extensive backgrounds in building and securing highly sensitive networks.\"\nAbout BlackRidge Technology\nBlackRidge Technology provides an adaptive cyber defense solution that enables our customers to deliver more secure and resilient business services in today's rapidly evolving technology and cyber threat environments. The BlackRidge Adaptive Trust solution provides end-to-end security that proactively isolates cloud services, protects servers and segments networks. Our patented First Packet Authentication ™ technology authenticates user and device identity and enforces security policy on the first packet of network sessions. This new level of real-time protection blocks or redirects unidentified and unauthorized traffic to stop attacks and unauthorized access. BlackRidge was founded in 2010 to commercialize its military grade and patented network security technology. For more information, visit www.blackridge.us .\nMedia Contact:\nSahl Communications\nKim Plyler\n+1-484-554-5582\nkim@sahlcomm.com\nInvestor Relations Contact:\nMZ North America\nChris Tyson\n+1-949-491-8235\nBRTI@mzgroup.us\nView original content with multimedia: http://www.prnewswire.com/news-releases/blackridge-technology-forms-government-advisory-board-and-appoints-four-proven-leaders-300583563.html\nSOURCE BlackRidge Technology International, Inc.", "external_links": ["http://www.blackridge.us/", "https://www.blackridge.us/", "http://www.prnewswire.com/news-releases/blackridge-technology-forms-government-advisory-board-and-appoints-four-proven-leaders-300583563.html", "https://www.blackridge.us/products/technologies"], "published": "2018-01-17T16:31:00.000+02:00", "crawled": "2018-01-17T16:35:13.025+02:00", "highlightTitle": ""}