{"organizations": [], "uuid": "b25ddd1bb6f10f729f12154d72a29aafbab3c6c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-fs-investments-provides-financing-to-usa-compression-partners-for-strategic-transaction.html", "country": "US", "domain_rank": 767, "title": "FS Investments Provides Financing to USA Compression Partners for Strategic Transaction", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:00:00.000+02:00", "replies_count": 0, "uuid": "b25ddd1bb6f10f729f12154d72a29aafbab3c6c0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-fs-investments-provides-financing-to-usa-compression-partners-for-strategic-transaction.html", "ord_in_thread": 0, "title": "FS Investments Provides Financing to USA Compression Partners for Strategic Transaction", "locations": [], "entities": {"persons": [], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "usa compression partners for strategic transaction", "sentiment": "negative"}, {"name": "fs investments", "sentiment": "negative"}, {"name": "energy transfer partners, l.p. usa compression", "sentiment": "none"}, {"name": "eig global energy partners capital markets llc", "sentiment": "none"}, {"name": "usa compression", "sentiment": "none"}, {"name": "usa compression partners", "sentiment": "none"}, {"name": "eig global energy partners", "sentiment": "none"}, {"name": "fs energy and power fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, Jan. 23, 2018 /PRNewswire/ -- FS Investments, a leading alternative asset manager, today announced FS Energy and Power Fund's (FSEP) participation in a directly originated $500 million perpetual preferred units offering. The financing supports USA Compression Partners, LP, in its recently announced acquisition of compression assets from Energy Transfer Partners, L.P.\nUSA Compression is one of the nation's largest independent providers of compression services, an important component of midstream infrastructure and natural gas transport. For nearly 20 years, USA Compression has partnered with a broad customer base comprised of producers, processors, gatherers and transporters of natural gas.\nFS Energy and Power Fund, a business development company managed by an affiliate of FS Investments, committed to provide approximately $75 million of the perpetual preferred units financing. The transaction was originated by EIG Global Energy Partners Capital Markets LLC, a broker-dealer affiliate of EIG Global Energy Partners.\n\"This transaction is a great example of our commitment to sourcing more directly originated, midstream-focused investment opportunities for the FSEP portfolio,\" said Mike Kelly, President and Chief Investment Officer of FS Investments. \"With the help of our new partner, EIG, to source and originate direct investments, we will continue to transition the FSEP portfolio for investors.\"\nABOUT FS INVESTMENTS\nFS Investments is a leading asset manager dedicated to helping individuals, financial professionals and institutions design better portfolios. The firm provides access to alternative sources of income and growth and focuses on setting industry standards for investor protection, education and transparency.\nFS Investments is headquartered in Philadelphia, PA with offices in New York, NY, Orlando, FL and Washington, DC. Visit fsinvestments.com to learn more.\nForward-Looking Statements and Important Disclosures\nThis press release may contain certain forward-looking statements, including statements with regard to the future performance or operations of FSEP. Words such as \"believes,\" \"expects,\" \"projects\" and \"future\" or similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to the inherent uncertainties in predicting future results and conditions. Certain factors could cause actual results to differ materially from those projected in these forward-looking statements, and some of these factors are enumerated in the filings FSEP makes with the U.S. Securities and Exchange Commission. FSEP undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nContact Information:\nMedia\nMarc Yaklofsky / Kate Beers\nmedia@fsinvestments.com\n215-495-1174\nView original content with multimedia: http://www.prnewswire.com/news-releases/fs-investments-provides-financing-to-usa-compression-partners-for-strategic-transaction-300586318.html\nSOURCE FS Investments", "external_links": ["http://www.prnewswire.com/news-releases/fs-investments-provides-financing-to-usa-compression-partners-for-strategic-transaction-300586318.html"], "published": "2018-01-23T16:00:00.000+02:00", "crawled": "2018-01-23T18:43:25.011+02:00", "highlightTitle": ""}