{"organizations": [], "uuid": "53519d4c02c737c714e97bc51d3c247ba1493795", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-890729738.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/donald-trump-solar-tariffs-blow-renewabales/", "country": "US", "domain_rank": 1196, "title": "Donald Trump's Solar Tariffs Are a Big Blow to Renewables | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.556, "site_type": "news", "published": "2018-01-23T23:24:00.000+02:00", "replies_count": 0, "uuid": "53519d4c02c737c714e97bc51d3c247ba1493795"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/22/donald-trump-solar-tariffs-blow-renewabales/", "ord_in_thread": 0, "title": "Donald Trump's Solar Tariffs Are a Big Blow to Renewables | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "huainan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "solar energy industries association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Trump's Solar Tariffs Are a Big Blow to Renewables A floating solar power plant in Huainan, China, Dec. 11, 2017. AFP/Getty Images 9:24 PM EST \nPresident Donald Trump just dealt his biggest blow to the renewable energy industry yet. \nOn Monday, Trump approved duties of as much as 30% on solar equipment made abroad, a move that threatens to handicap a $28 billion industry that relies on parts made abroad for 80% of its supply. Just the mere threat of tariffs has shaken solar developers in recent months, with some hoarding panels and others stalling projects in anticipation of higher costs. The Solar Energy Industries Association has projected 23,000 job losses this year in a sector that employed 260,000. \nThe tariffs are just the latest action Trump has taken that undermine the economics of renewable energy. The administration has already decided to pull the U.S. out of the international Paris climate agreement, rolled back Obama-era regulations on power plant-emissions and passed sweeping tax reforms that constrained financing for solar and wind. The import taxes, however, will prove to be the most targeted strike on the industry yet and may have larger consequences for the energy world. \n“We are inclined to view it as posing greater trade risk for all types of energy, particularly if other nations establish new trade barriers against U.S. products,” Washington-based research firm ClearView Energy Partners LLC said in a report Monday. Solar Surges \nU.S. panel maker First Solar Inc. jumped 9% to $75.20 in after-hours trading in New York. The Tempe, Arizona-based manufacturer stands to gain as costs for competing, foreign panels rise. \nTrump approved four years of tariffs that start at 30% in the first year and gradually drop to 15%. The first 2.5 gigawatts of imported solar cells are exempt for each year, the president said in an emailed statement. \nThe duties are lower than the 35% rate the U.S. International Trade Commission recommended in October after finding that imported panels were harming American manufacturers. The idea behind the tariffs is to raise the costs of cheap imports, particularly from Asia, and level the playing field for those who manufacture the parts domestically. \nFor more on renewable energy, watch Fortune’s video: \nDespite higher anticipated costs for American solar installers, SunPower Corp., Vivint Solar Inc. and Sunrun Inc. all jumped in after-hours trading. “A 30% tariff in Year One is bad,” said Gordon Johnson, a New York-based analyst at the Vertical Group, but “it’s less than what the consensus was.” \nJigar Shah, co-founder of investor Generate Capital Inc. and an outspoken advocate for the solar industry, went as far as to describe the decision as “good news.” The tariffs are “exactly what the solar industry asked for behind closed doors” to prevent a negative impact on companies, he said. Not Deterred \nThe duties won’t be entirely devastating for the U.S. solar industry, said Hugh Bromley, a New York-based analyst at Bloomberg New Energy Finance. He estimated they’ll increase costs for large solar farms by less than 10%. The expense of a residential system, he said, will rise by about 3%. \nThe decision will “destruct some demand for new projects in the next two years,” Bromley said. “But they will likely prove insufficient in magnitude and duration to attract many new factories.” \nFor Trump, the tariffs represent a step toward making good on a campaign promise to get tough on the country that produces the most panels — China. Trump’s trade issues took a backseat in 2017 while the White House focused on tax reform, but it’s now coming back into the fore: The solar dispute is among several potential trade decisions that also involve washing machines, consumer electronics and steel. \nThe decision comes almost nine months after Suniva Inc., a bankrupt U.S. module manufacturer with a Chinese majority owner, sought import duties on solar cells and panels. It asserted that it had suffered “ serious injury” from a flood of cheap panels produced in Asia. A month later, the U.S. unit of German manufacturer SolarWorld AG signed on as a co-petitioner, adding heft to Suniva’s cause. \nSuniva had sought import duties of 32 cents a watt for solar panels produced outside the U.S. and a floor price of 74 cents a watt. Trump’s tariffs impose a charge of about 10 cents a watt, according to Bromley. \nWhile Trump has broad authority on the size, scope and duration of duties, the dispute may shift to a different venue. China and neighbors including South Korea may opt to challenge the decision at the World Trade Organization — which has rebuffed prior U.S.-imposed tariffs that appeared before it. \nLewis Leibowitz, a Washington-based trade lawyer, expects the matter will wind up with the WTO. “Nothing is very likely to stop the relief in its tracks,” he said before the decision. “It’s going to take a while.” Here’s what people are saying about the tariffs: \nSuniva thanked Trump for “holding China and its proxies accountable” and said it looked forward to global settlement negotiations. \nTrump said in his statement that the U.S. Trade Representative will discuss resolving separate antidumping and countervailing duty measures imposed on Chinese solar products and U.S. polysilicon. \nSolarWorld said it “appreciates the hard work of” Trump, the U.S. Trade Representative and is “hopeful” the tariffs will be enough to rebuild solar manufacturing in the U.S. \nSunrun said that while the decision lifts “a cloud of uncertainty,” it runs counter to “consumers, bipartisan elected officials, many military personnel, and the 99% of American solar workers whom this tariff will harm in the coming years.” It called for the administration to clarify which countries won’t be subject to the tariffs. \nThe U.S. Trade Representative said Mexico and Canada will be subject to the duties, despite previous reports that they may be spared. \nRooftop solar installer Sunnova Energy Corp. said the tariffs will not deter the industry. “The solar industry has been tested before and we have always shown our resiliency,” said John Berger, its chief executive officer. \nRegardless of the tariffs, solar installer Tesla Inc. said it’s “committed to expanding its domestic manufacturing,” citing a “gigafactory” it opened in Buffalo, New York. Clark Packard, a trade policy expert at the R Street Institute in Washington, described Trump’s decision as “regrettable,” warning that more jobs will be jeopardized by the tariffs “than could possibly be saved by bailing out the bankrupt companies.” \nBill Waren, senior trade analyst at Friends of the Earth, called the decision “recklessly irresponsible and a thinly veiled attack on clean energy.” \nClearView Energy Partners LLC estimated a roughly 6% increase in the costs of commercial solar projects and a 4% rise in residential rooftop solar expenses. Large, utility-scale projects may bear the brunt, with a 10% increase. \nThe Solar Energy Industries Association warned the tariffs will delay or kill billions of dollars of solar investments. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-23T23:24:00.000+02:00", "crawled": "2018-01-23T05:06:55.046+02:00", "highlightTitle": ""}