{"organizations": [], "uuid": "72048ee34c1e923c9936eaaa1851d43a3eba898f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224861332&w=1200&r=LYNXMPEE0N1OB", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/italy-election-migrants/italys-homeless-jobless-migrants-shunned-by-politicians-idINKBN1FD2BT", "country": "US", "domain_rank": 408, "title": "Italy's homeless, jobless migrants shunned by politicians", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T18:26:00.000+02:00", "replies_count": 0, "uuid": "72048ee34c1e923c9936eaaa1851d43a3eba898f"}, "author": "", "url": "https://in.reuters.com/article/italy-election-migrants/italys-homeless-jobless-migrants-shunned-by-politicians-idINKBN1FD2BT", "ord_in_thread": 0, "title": "Italy's homeless, jobless migrants shunned by politicians", "locations": [], "entities": {"persons": [{"name": "steve scherer", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "turin", "sentiment": "none"}, {"name": "turin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 4:27 PM / Updated 18 minutes ago Italy's homeless, jobless migrants shunned by politicians Steve Scherer 7 Min Read \nTURIN, Italy (Reuters) - A rainstorm buffets unheated apartment blocks on the outskirts of the northern Italian city of Turin where more than 1,000 impoverished African migrants huddle in rooms built to house 300 competitors at the 2006 Winter Olympics. \nThe plight of the hundreds of thousands of migrants struggling to build a life in Italy is rarely discussed by most political parties, even though immigration is one of the hottest issues ahead of national elections on March 4. \nKeen to harness a growing backlash against more than 600,000 migrants who have landed on Italian shores in the past four years, the parties are instead promising tough measures such as mass deportations or halting immigration altogether. \nWith poor Italians also struggling to find housing and jobs in an anaemic economy, offering support to migrants such as those in the Olympic village is not considered a vote winner. \nThe residents of one of Europe’s largest squats, some sleeping in stairwells and storage closets, hail from 28 African countries. Many are jobless or earn very little with sporadic work. Years after first landing in Italy, some cannot afford food, let alone rent. \n“This place is the epitome of Italy’s failure to integrate,” said Nicolo’ Vasile, a 31-year-old engineer from Sicily who spends an average of 40 hours a week helping residents, including 40 families and 50 children, with maintenance, paperwork and other tasks. \n“There is no institutional path to integration. It simply doesn’t exist, unlike elsewhere in Europe,” said Vasile, one of 20 local volunteers, from students to pensioners to professors, who help those stuck in the Turin complex. \nThe ruling centre-left Democratic Party (PD) tried to take the sting out of the migration debate last year by striking deals with the Tripoli government and coast guard aimed at preventing migrants from boarding boats for Europe. \nAs a result, the number of migrants arriving in Italy by sea fell by a third last year to 119,000, but this has failed to quell the fears of ordinary Italians. \nIn May 2013, only 4 percent of Italians saw immigration as one of the two most important issues affecting their country. By May of last year the figure was 36 percent, according to the European Commission’s Eurobarometer survey. \nThirty percent of the electorate would vote for a party that pledges to put “Italians first”, while 25 percent would back a bloc promising to “stop immigrants”, according to an SWG poll published last week. MASS DEPORTATIONS \nThe opposition centre-right bloc is taking the hardest line against migrants. \nThe coalition, which includes Silvio Berlusconi’s Forza Italia (Go Italy!) and the anti-immigrant Northern League, is leading in the opinion polls though no single bloc appears yet to have enough votes to govern alone. \nFormer prime minister Berlusconi says irregular migrants are driving up crime and should be deported, even though official data shows crime rates fell last year. The far-right Northern League has promised mass deportations. \n“There are half a million irregular migrants in Italy. All of them need to be sent home,” League leader Matteo Salvini told la Repubblica newspaper on Tuesday. \nThe anti-establishment 5-Star Movement, which is polling as the single biggest party at just under 30 percent, says Italians must come first and that it will deport irregular migrants. Light emanates from the windows of three of the four occupied buildings by migrants of the former Olympic village in Turin, Italy January 12, 2018. Picture taken January 12, 2018. REUTERS/Siegfried Modola \nOne of the reasons offering aid to immigrants is unpopular is that some Italians face similar problems with housing and jobs, and likewise receive little or no help from the government. \nGreece, another country on the immigration frontline, offers even less than Italy, but those who reach European Union countries such as Germany and Sweden get more support because refugee status gives them access to robust welfare systems. \nWhile Italy’s migrant budget was 4.3 billion euros ($5.3 billion) last year, Germany’s federal government spent 13.6 billion euros to accommodate and process asylum seekers, two years after more than a million refugees crossed its borders. \nGermany’s 16 state governments spent billions more. In 2016, the states spent about 23 billion euros though exact figures for last year are not yet available. IN LIMBO Slideshow (3 Images) \nIn Italy, almost 200,000 migrants now live in shelters, but they must leave when their asylum request is granted, which usually takes no more than 18 months, with no further housing or unemployment benefits provided. Almost 120,000 people have received some form of asylum in Italy in the past four years. \nRequired by law to seek asylum and work in the European Union country where they first set foot, the migrants are trapped in Italy, forcing many to forage to survive. \nJamal Adam, 31, from the Darfur region of Sudan arrived in Italy in 2011. Unable to find a job he went to Germany, but returned because the EU asylum rules prevented him from getting legal papers in any country other than Italy. \n“In Germany, they give you money and a place to stay and you rest easy,” he said in the Olympic village in Turin as daily prayers from Mecca echoed out of a TV. “Here you get nothing.” \nHe has been squatting in a small room with three others since the four buildings were first occupied in early 2013. \nLike more than 90 percent of those in the Turin complex, Adam can stay and work legally in Italy, but remains unemployed. \n“It’s not normal for people to live like this,” said Sonia Schellino, the social affairs assessor for the Turin City Council, run by the anti-establishment 5-Star Movement. \nShe is working with various local bodies to try to empty the buildings, offering migrants better lodging, guaranteed for six months to a year, plus jobs or training. Migrants, though, fear they will be back on the streets afterwards. \nTrapped in limbo with their dreams of a better future fading, some residents are depressed and mentally fragile. “They just lose it after a while,” volunteer Vasile says. One migrant attempted suicide by leaping from a window this month. \nSamuel Pieta from Cameroon lives on the top floor of one block. He is 33, has been in Italy since 2011 but has never worked in the country. His room is decorated with soccer balls, books, broken fax machines and a refrigerator he uses as a wardrobe, all objects he found in local trash bins. \nWhen asked how he survives, he holds up a box of half-smoked cigarettes he has collected on his daily rounds. \n“This is how I survive. I get what I need from the garbage. I eat what others throw away,” he says, clutching his head between his hands, tears in his eyes.($1 = 0.8142 euros)   Michael Nienaber in Berlin; editing by Crispian Balmer and David Clarke", "external_links": [], "published": "2018-01-24T18:26:00.000+02:00", "crawled": "2018-01-24T18:46:34.004+02:00", "highlightTitle": ""}