{"organizations": [], "uuid": "7b7cda7b9d023547ebd9726953371fc8dd00ecab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-ophthotech-announces-election-of-jane-pritchett-henderson-chief-financial-officer-and-senior-vice-president-of-corporate.html", "country": "US", "domain_rank": 767, "title": "Ophthotech Announces Election of Jane Pritchett Henderson, Chief Financial Officer and Senior Vice President of Corporate Development at Voyager Therapeutics, to Its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:15:00.000+02:00", "replies_count": 0, "uuid": "7b7cda7b9d023547ebd9726953371fc8dd00ecab"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-ophthotech-announces-election-of-jane-pritchett-henderson-chief-financial-officer-and-senior-vice-president-of-corporate.html", "ord_in_thread": 0, "title": "Ophthotech Announces Election of Jane Pritchett Henderson, Chief Financial Officer and Senior Vice President of Corporate Development at Voyager Therapeutics, to Its Board of Directors", "locations": [], "entities": {"persons": [{"name": "ja", "sentiment": "neutral"}, {"name": "jane pritchett henderson", "sentiment": "neutral"}, {"name": "david r. guyer", "sentiment": "none"}, {"name": "zimura", "sentiment": "none"}, {"name": "jane", "sentiment": "none"}, {"name": "henderson", "sentiment": "none"}, {"name": "pritchett henderson", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "ophthotech corporation", "sentiment": "neutral"}, {"name": "ophthotech", "sentiment": "none"}, {"name": "ophthotech audit committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Ophthotech Corporation (NASDAQ: OPHT) announced today the election of Jane Pritchett Henderson, Chief Financial Officer and Senior Vice President of Corporate Development at Voyager Therapeutics, to its Board of Directors, effective immediately. Ms. Henderson has also been elected the Chair of the Ophthotech Audit Committee.\n“We are excited to have someone of Jane’s caliber join our Board of Directors,” stated David R. Guyer, Executive Chairman of Ophthotech. “Jane’s financial background and corporate development experience in life sciences is a valuable addition to the Ophthotech board as we seek to expand our strategic vision for the Company with our complement C5 inhibitor, Zimura ® , and continue our business development effort for both orphan diseases and larger indications in the back of the eye, such as age-related retinal diseases.”\n“The management team at Ophthotech continues to execute on its strategic plan and has made significant progress in restructuring the Company, initiating and modifying multiple clinical trials of Zimura ® and continuing an aggressive business development outreach with the goal of broadening and advancing its ophthalmic pipeline,” stated Ms. Henderson. “I am thrilled to be joining the board at this important time and look forward to working closely with David Guyer, Glenn Sblendorio, other board members and the management team.”\nJane Pritchett Henderson has more than 29 years of experience in the life sciences industry and health care investment banking. She currently serves as Chief Financial Officer and Senior Vice President of Corporate Development at Voyager Therapeutics, a publicly-traded, clinical-stage gene therapy company focused on developing life-changing treatments for severe neurological diseases. Prior to Voyager, Ms. Henderson served as Chief Financial and Business Officer of Kolltan Pharmaceuticals, Inc., having joined the privately held biopharmaceutical company in 2013 and leading the sale of Kolltan to Celldex Pharmaceuticals, Inc. in late 2016. Previously, Ms. Henderson served as Vice President, Business Development of ISTA Pharmaceuticals, Inc., until ISTA Pharmaceuticals was acquired by Bausch + Lomb. Prior to ISTA Pharmaceuticals, Ms. Henderson served as Chief Financial Officer and Head of Business Development at Axerion Pharmaceuticals, Inc., and as Chief Financial Officer and Chief Business Officer of Panacos Pharmaceuticals, Inc. In addition to her industry experience, Ms. Henderson’s extensive healthcare investment banking experience includes the execution of more than 95 mergers and acquisitions, advisory and financing deals as managing director and other senior roles at HSBC Holdings plc, Canadian Imperial Bank of Commerce, Lehman Brothers and Salomon Brothers. Ms. Henderson holds a B.S. in psychology from Duke University and currently serves on the board of directors of Eleven Biotherapeutics, Inc., a publicly-traded biologics oncology company.\n“We welcome Jane to our Board of Directors,” stated Glenn P. Sblendorio, Chief Executive Officer and President of Ophthotech. “We believe Jane’s extensive experience within the biotechnology industry will provide great insight and guidance as we continue to build this new chapter of Ophthotech.”\nAbout Ophthotech Corporation\nOphthotech is a biopharmaceutical company specializing in the development of novel therapeutics for age-related and orphan diseases of the eye. For more information, please visit www.ophthotech.com .\nForward-looking Statements\nAny statements in this press release about Ophthotech’s future expectations, plans and prospects constitute forward-looking statements for purposes of the safe harbor provisions under the Private Securities Litigation Reform Act of 1995. Forward-looking statements include any statements about Ophthotech’s strategy, future operations and future expectations and plans and prospects for Ophthotech, and any other statements containing the words “anticipate,” “believe,” “estimate,” “expect,” “intend”, “goal,” “may”, “might,” “plan,” “predict,” “project,” “target,” “potential,” “will,” “would,” “could,” “should,” “continue,” and similar expressions. In this press release, Ophthotech’s forward looking statements include statements about the implementation of its strategic plan, Ophthotech's projected use of cash and cash balances, the timing, progress and results of clinical trials and other development activities, and the potential for its business development strategy, including any potential in-license or acquisition opportunities. Such forward-looking statements involve substantial risks and uncertainties that could cause Ophthotech’s clinical development programs, future results, performance or achievements to differ significantly from those expressed or implied by the forward-looking statements. Such risks and uncertainties include, among others, those related to the initiation and conduct of clinical trials, availability of data from clinical trials, expectations for regulatory matters, need for additional financing and negotiation and consummation of in-license and/or acquisition transactions and other factors discussed in the “Risk Factors” section contained in the quarterly and annual reports that Ophthotech files with the Securities and Exchange Commission. Any forward-looking statements represent Ophthotech’s views only as of the date of this press release. Ophthotech anticipates that subsequent events and developments will cause its views to change. While Ophthotech may elect to update these forward-looking statements at some point in the future, Ophthotech specifically disclaims any obligation to do so except as required by law.\nOPHT-G\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005404/en/\nInvestors:\nOphthotech Corporation\nKathy Galante, 212-845-8231\nVice President, Investor Relations and Corporate Communications\nkathy.galante@ophthotech.com\nor\nMedia:\nSmithSolve LLC on behalf of Ophthotech Corporation\nAlex Van Rees, 973-442-1555 ext. 111\nalex.vanrees@smithsolve.com\nSource: Ophthotech Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ophthotech.com&esheet=51743209&newsitemid=20180116005404&lan=en-US&anchor=www.ophthotech.com&index=1&md5=7beb03da8c8d506f67dd6780e1d8fb4a", "http://www.businesswire.com/news/home/20180116005404/en/"], "published": "2018-01-16T15:15:00.000+02:00", "crawled": "2018-01-16T16:15:58.008+02:00", "highlightTitle": ""}