{"organizations": [], "uuid": "797c933f6f59ad99c37e91ec8cb69b97acee7756", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-tullow-outlook/tullow-oil-tiptoes-back-into-exploration-idUSKBN1EZ0Y5", "country": "US", "domain_rank": 408, "title": "Tullow Oil tiptoes back into exploration", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T18:16:00.000+02:00", "replies_count": 0, "uuid": "797c933f6f59ad99c37e91ec8cb69b97acee7756"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tullow-outlook/tullow-oil-tiptoes-back-into-exploration-idUSKBN1EZ0Y5", "ord_in_thread": 0, "title": "Tullow Oil tiptoes back into exploration", "locations": [], "entities": {"persons": [{"name": "paul mcdade", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "ghana", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "tullow oil", "sentiment": "negative"}, {"name": "tullow", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Tullow Oil is cautiously reviving its search for new oil and gas resources in Africa and Latin America, its chief executive said, warning that the sector will need to walk a thin line to balance spending discipline with a desire to grow.\nAfrica-focused Tullow, which grew rapidly earlier this decade, has emerged from one of the longest downturns in the sector’s history with a $3.5 billion debt pile.\nHowever, deep spending cuts since 2014, asset disposals, the start-up of a major project in Ghana and a recovery in oil prices to more than $60 a barrel helped it to boost cash generation sharply in 2017.\nStill, uncertainty over how high oil prices can go amid surging U.S. shale production means Tullow and the sector as a whole need to remain disciplined, Chief Executive Paul McDade told Reuters.\n“What will be critical for us and the industry is to ensure we maintain margins as oil prices pick up ... and not to get distracted by the higher oil prices.”\nThe temptation is nevertheless big as some industry executives expect oil supplies to tighten by the end of the decade due to a drop in investment in recent years and as drilling costs remain extremely low.\nTullow plans to start drilling with the Maersk Venturer rig in Ghana in February to search for new oil and gas resources in the vicinity of its Tweneboa, Enyenra, Ntomme (TEN) and Jubilee offshore fields.\n“We are carefully looking at whether we should add some rig capacity and we will only add that if we can maintain the financial strength of the company.”\nThe company has used the weak price environment to acquire exploration license in Ivory Coast, where it will begin seismic studies this year and which would be relatively quick and low-cost to develop if they prove to hold resources, McDade said.\nTullow said on Wednesday it had also acquired six new license offshore Peru and could start some exploration this year or in early 2019 if it obtained government approval.\n“It is high-risk but very high-reward if it works,” he said.\nDespite the strongest start for oil prices in four years, global exploration spending is set to drop in 2018 for a fifth straight year, masking a recovery in drilling activity as costs continue to fall.\n“For a much lower exploration budget we can stretch that money much more because of the lower cost base.”\nIn another sign of the sector’s revival, Tullow expects it and its partners Total and CNOOC will approve the development of a new project in Uganda in the first half of 2018.\nTullow said on Wednesday that it generated around $500 million of free cash flow in 2017, beating expectations, due to higher production and oil prices.\nIts shares were up 1.4 percent by 0923 GMT, compared with a 0.3 percent rise in the broader energy index.\nIt expects its production to average 90,300 barrels of oil and gas equivalent per day (boed) in 2018, down from 94,700 boed in 2017, mainly due to several weeks of repairs planned on the Jubilee field.\nThe company reduced its debt burden by some $1.3 billion throughout 2017 and refinanced a $2.5 billion credit facility in November.\nReporting by Ron Bousso; Editing by Dale Hudson\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T18:16:00.000+02:00", "crawled": "2018-01-11T12:24:25.020+02:00", "highlightTitle": ""}