{"organizations": [], "uuid": "c97b133b0ecf2860f844f8d5f7bc515a73cd5a64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219361125&w=1200&r=LYNXMPEE0312Z", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-cenbank-bonds-breakingviews/breakingviews-debt-markets-will-call-time-on-equity-rally-idUSKBN1ET1VO", "country": "US", "domain_rank": 408, "title": "Debt markets will call time on equity rally", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:26:00.000+02:00", "replies_count": 0, "uuid": "c97b133b0ecf2860f844f8d5f7bc515a73cd5a64"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-cenbank-bonds-breakingviews/breakingviews-debt-markets-will-call-time-on-equity-rally-idUSKBN1ET1VO", "ord_in_thread": 0, "title": "Debt markets will call time on equity rally", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON Stocks are proving they can rally on U.S. markets regardless of whether government bond yields rise or fall. But over the past 30 years, the two have never risen in tandem for more than four consecutive quarters. If that pattern holds, either equities or yields will slide within six months. It’s more likely to be equities.\nThe S&P 500 Index gained 1.5 percent in the first two trading days of this year at the same time as the yield on the benchmark 10-year U.S. government bond climbed four basis points, to just under 2.5 percent. The phenomenon of the two rising together is neither new nor rare. It was the case in both the third and fourth quarters of 2017. And three decades of quarterly data show that U.S. stocks and bond yields rose simultaneously a third of the time.\nThat’s logical. Improving growth prospects strengthen the case for tighter U.S. monetary policy, which is typically associated with rising yields. But a cheerier economic outlook also bolsters companies’ earnings, and therefore stock markets. However, history also shows that equities and yields only march higher in lockstep for a certain amount of time. The longest such run was four quarters, in 2013. The current streak may therefore have less than six months left.\nThere are several reasons why such trends eventually end. For example, if yields are going up because monetary policy tightening is anticipated, equity investors may at some point start worrying that the central bank’s actions will slow economic activity. Also higher yields equate to rising borrowing costs for companies. And if relatively safe U.S. government bonds offer higher yields, there is less reason for investors to invest in riskier equities.\nOf course, bond yields can sometimes fall when stocks are rising. But that looks unlikely when U.S. net issuance is due to outstrip central bank purchases by the most in six years. With U.S. stock markets already richly valued relative to the past decade, there’s a greater chance that equity markets will stumble.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-05T00:26:00.000+02:00", "crawled": "2018-01-04T21:13:34.022+02:00", "highlightTitle": ""}