{"organizations": [], "uuid": "ec09006979ff7b4d1003e3d65ccc146885c961f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219135523&w=1200&r=LYNXMPEE0216W", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews\r", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-trump-russia-manafort/trumps-ex-campaign-manager-manafort-sues-special-counsel-robert-mueller-idUSKBN1ES1VM", "country": "US", "domain_rank": 408, "title": "Trump's ex-campaign manager Manafort sues Special Counsel Robert Mueller", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T23:22:00.000+02:00", "replies_count": 0, "uuid": "ec09006979ff7b4d1003e3d65ccc146885c961f3"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-russia-manafort/trumps-ex-campaign-manager-manafort-sues-special-counsel-robert-mueller-idUSKBN1ES1VM", "ord_in_thread": 0, "title": "Trump's ex-campaign manager Manafort sues Special Counsel Robert Mueller", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 8:26 PM / in 13 hours Trump's ex-campaign manager Manafort sues Special Counsel Robert Mueller Sarah N. Lynch 4 Min Read \nWASHINGTON (Reuters) - President Donald Trump’s former campaign manager Paul Manafort sued Special Counsel Robert Mueller on Wednesday, alleging that his office’s investigation into possible collusion between the Trump campaign and Russia exceeds its legal authority. \nThe lawsuit could be the first legal test of how far Mueller’s mandate extends, a question that is critical to his investigations into Manafort’s and others’ financial, real estate and other dealings. \nUnder the terms of Deputy Attorney General Rod Rosenstein’s order in May appointing Mueller, the special prosecutor not only can probe links or coordination between Trump’s campaign and Russia but also can look into “any matters that arose or may arise directly” from the investigation. \nMueller’s office indicted Manafort and his business partner Rick Gates in October on charges including conspiracy to launder money, conspiracy against the United States and failing to register as foreign agents of Ukraine’s former pro-Russian government. \nManafort’s civil lawsuit, filed in U.S. District Court for the District of Columbia, accuses Rosenstein of exceeding his legal authority to “grant Mr. Mueller carte blanche to investigate and pursue criminal charges in connection with anything he stumbles across.” \n“The investigation has focused on Mr. Manafort’s offshore business dealings that date back to as early as 2005 - about a decade before the Trump presidential campaign launched,” the lawsuit said. \nIt added that Manafort voluntarily disclosed all of the information about his Ukraine work to the Justice Department in July 2014 as part of a since-closed investigation into stolen assets. \nIn addition to the indictments of Manafort and Gates, Mueller’s office has secured guilty pleas for lying to the FBI from Trump’s former National Security Adviser Michael Flynn and former campaign aide George Papadopoulos. \nBoth those cases, unlike the Manafort indictment, relate to Flynn and Papadopoulos’ communications with Russians during their work for the Trump campaign. FILE PHOTO: Paul Manafort, former campaign chairman for U.S. President Donald Trump, departs after a bond hearing as part of Special Counsel Robert Mueller's ongoing Russia investigation, at U.S. District Court in Washington, U.S., December 11, 2017. \nManafort’s indictment made no reference to any activity related to his work on the Trump 2016 presidential campaign, and the lawsuit asked the court to “set aside all actions” taken so far against him. \nA spokeswoman for the Justice Department called the lawsuit “frivolous,” but added that Manafort was “entitled to file whatever he wants.” \nA spokesman for Mueller’s office declined to comment. \nManafort’s lawsuit alleges that Rosenstein’s order tapping Mueller violates the Administrative Procedure Act, which governs the government rulemaking process. \nAt issue is whether the scope of Rosenstein’s order is too broad and runs afoul of the Justice Department’s rules that establish procedures for hiring a special prosecutor. \nStephen Vladek, a law professor at the University of Texas at Austin, said he thinks the lawsuit will fail due to procedural problems as well as on its merits. The case, he said, is a “long shot.” \nManafort’s lawsuit comes as Trump and Republicans in Congress have escalated their attacks on Mueller, the FBI and the Justice Department by accusing them of political bias. \nRosenstein, who appointed Mueller in May shortly after Trump fired former FBI Director James Comey, told Congress last month that he does not think Mueller’s investigation is tainted and sees no reason to have him removed. \nTrump has denied that his campaign colluded with Russia, although he has also said he fired Comey because of “this Russia thing.” Moscow has denied meddling in the 2016 U.S. election campaign. Reporting by Sarah N. Lynch; Editing by Peter Cooney, John Walcott and Cynthia Osterman", "external_links": [], "published": "2018-01-03T23:22:00.000+02:00", "crawled": "2018-01-04T00:12:04.016+02:00", "highlightTitle": ""}