{"organizations": [], "uuid": "5ed787676757fca6bcf9427fc2a0755bc16272bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-context-therapeutics-announces-the-acquisition-of-apristora-onapristone-xr-an-investigational-phase-2-drug-for-metastatic.html", "country": "US", "domain_rank": 767, "title": "Context Therapeutics Announces the Acquisition of Apristor™ (Onapristone XR), an Investigational Phase 2 Drug for Metastatic Breast Cancer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.822, "site_type": "news", "published": "2018-01-16T13:00:00.000+02:00", "replies_count": 0, "uuid": "5ed787676757fca6bcf9427fc2a0755bc16272bb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-context-therapeutics-announces-the-acquisition-of-apristora-onapristone-xr-an-investigational-phase-2-drug-for-metastatic.html", "ord_in_thread": 0, "title": "Context Therapeutics Announces the Acquisition of Apristor™ (Onapristone XR), an Investigational Phase 2 Drug for Metastatic Breast Cancer", "locations": [], "entities": {"persons": [{"name": "martin lehr", "sentiment": "none"}, {"name": "apristor", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Apristor has demonstrated efficacy in 120 patients in two Phase 2 Trials Context will initiate multiple clinical trials evaluating Apristor as a monotherapy or a combination therapy over the next 18 months Metastatic Breast Cancer market is approaching $4B despite unmet patient needs\nPHILADELPHIA--(BUSINESS WIRE)-- Context Therapeutics, a biopharma company dedicated to developing new medicines for patients with hormone responsive cancers, announced that it has acquired worldwide rights to Apristor (Onapristone XR). Onapristone has been extensively studied and has established efficacy in two Phase 2 metastatic breast cancer clinical trials. In these trials, meaningful clinical benefit and response rates were seen in 120 metastatic breast cancer patients, 101 of whom were actively progressing on Tamoxifen before Onapristone treatment initiation. Onapristone has been studied in over 200 patients, and it was well tolerated with no drug- related serious adverse events.\nMartin Lehr, CEO of Context stated: \"We are excited to advance the development of Apristor and to potentially provide a mechanistically novel option for patients diagnosed with metastatic breast cancer. Unfortunately, the median life expectancy of a woman diagnosed with metastatic breast cancer is approximately three years. In the United States alone 40,000 women die each year as a result. These women deserve better, and we are committed to improving their treatment and removing the fear that comes along with this diagnosis.\"\nApristor blocks the binding of progesterone, a carcinogen, to the progesterone receptor (PR). Up to 70% of metastatic breast cancers express PR and are said to be PR+. If approved, Apristor would provide physicians with a novel product that could be used in combination with standard of care agents targeting the estrogen receptor or as a monotherapy.\nContext made a one-time payment to Arno Therapeutics in exchange for the worldwide rights to Apristor. Apristor is a new chemical entity and is protected by a robust patent estate that should provide exclusivity through at least 2034.\nScott Applebaum, President of Context stated: \"Context has taken a big leap forward and is now a clinical-stage company. This transformation is consistent with our mission of discovering, developing, and commercializing treatments for hormone-responsive cancers. We are building a world-class global clinical trial organization to bring Apristor to market as fast as possible. In addition, we have an Apristor fast-follower program for progesterone receptor-mediated diseases and continue to advance our preclinical Sigma1 program.\"\nAbout Context Therapeutics\nContext Therapeutics is a private, Philadelphia, PA-based biopharma company dedicated to creating new medicines to treat hormone-responsive cancers. We are building Context Therapeutics to become a global company that will discover, develop and market groundbreaking cancer treatments to patients around the world, eliminating the fear that comes with a cancer diagnosis. Context’s lead program is Apristor (Onapristone XR), an investigational Phase 2 drug that is being developed for progesterone receptor positive (PR+) metastatic breast cancer. For more information on Context, visit www.contexttherapeutics.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005438/en/\nContext Therapeutics\nMartin Lehr, 484-451-8601\nChief Executive Officer\ninfo@contexttherapeutics.com\nSource: Context Therapeutics", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.contexttherapeutics.com&esheet=51743128&newsitemid=20180116005438&lan=en-US&anchor=www.contexttherapeutics.com&index=1&md5=fc74ab685d6fc7ec3dd4cf3b1f96b733", "http://www.businesswire.com/news/home/20180116005438/en/"], "published": "2018-01-16T13:00:00.000+02:00", "crawled": "2018-01-16T13:51:57.009+02:00", "highlightTitle": ""}