{"organizations": [], "uuid": "b6835212fc7c8c571785c7cc3e9c1299d7e6a95b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219319540&w=1200&r=LYNXMPEE030S6", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-politics-health/may-apologises-as-overwhelmed-hospitals-cancel-non-emergency-operations-idUKKBN1ET1EU", "country": "US", "domain_rank": 408, "title": "May apologises as overwhelmed hospitals cancel non-emergency operations", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T15:20:00.000+02:00", "replies_count": 0, "uuid": "b6835212fc7c8c571785c7cc3e9c1299d7e6a95b"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-politics-health/may-apologises-as-overwhelmed-hospitals-cancel-non-emergency-operations-idUKKBN1ET1EU", "ord_in_thread": 0, "title": "May apologises as overwhelmed hospitals cancel non-emergency operations", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "reuters/toby melville", "sentiment": "none"}], "locations": [{"name": "camberley", "sentiment": "none"}, {"name": "frimley park hospital", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "national health service", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 1:06 PM / Updated 16 minutes ago May apologises as overwhelmed hospitals cancel non-emergency operations Andrew MacAskill 3 Min Read \nLONDON (Reuters) - Britain’s Prime Minister Theresa May apologised on Thursday to tens of thousands of patients whose operations were cancelled to free up staff and beds to deal with emergency patients. FILE PHOTO: Britain's Prime Minister Theresa May visits Frimley Park Hospital near Camberley, Britain, January 4, 2018. REUTERS/Toby Melville \nEarlier this week, officials at the National Health Service (NHS) in England recommended that hospitals cancel all non-urgent appointments and operations until next month. \nMay, during a visit to a hospital outside London, said she recognised it is frustrating for patients who had their operations postponed. \n“I know it is difficult, I know it is frustrating, I know it is disappointing for people and I apologise,” she told Sky News. \nA flu outbreak, colder weather and high levels of respiratory illnesses have put hospitals in England under strain with many operating at or near full capacity. \nThe issue is potentially damaging for May, already weakened after losing a parliamentary majority in last year’s election and struggling to pacify her deeply divided party as she navigates the final year of Brexit negotiations. \nThe NHS, which delivers free care for all and accounts for a third of government spending on public services, is typically one of the most important issues for voters during elections and one which is often regarded as a weakness for May’s Conservative party. \nOpposition parties regularly accuse the government of failing to adequately fund the health service. A patient is pushed down a corridor in Frimley Park Hospital near Camberley, Britain, January 4, 2018. REUTERS/Toby Melville \n“Ministers refused to provide the funding top NHS officials said was necessary and now patients are paying the price,” said Vince Cable, leader of the Liberal Democrats. \nFounded in 1948 by the opposition Labour Party, the NHS is a source of huge pride for many Britons who are able to access free care from cradle to grave. \nBut tight budgets, an ageing population and increasingly complex medical needs have left many hospitals struggling during the winter in recent years. Slideshow (4 Images) \nThe pressure continues to grow, according to new data on Thursday. \nThe number of patients stuck in ambulances for at least an hour almost doubled to more 4,700 cases during the Christmas week compared with the week before. \nDepartment of Health guidelines say ambulance crews should be able to hand patients over to hospital staff within 15 minutes of arrival at hospital. \nThe average bed occupancy for the Christmas week was 91.7 percent. Doctors say that anything above 85 percent is unsafe. \nThe conditions have led some doctors taking to Twitter to vent their frustrations. \nOne London-based doctor wrote that conditions were so bad that he was practising “battlefield medicine”, while another apologised for the “3rd world conditions” caused by overcrowding. Editing by Stephen Addison", "external_links": [], "published": "2018-01-04T15:20:00.000+02:00", "crawled": "2018-01-04T15:38:27.039+02:00", "highlightTitle": ""}