{"organizations": [], "uuid": "708073bc7405222de53013db3a1e1ef763b7549c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/30/reuters-america-sap-pushes-into-sales-tracking-market-with-2-point-4-bln-callidus-buy.html", "country": "US", "domain_rank": 767, "title": "SAP pushes into sales tracking market with $2.4 bln Callidus buy", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T11:49:00.000+02:00", "replies_count": 0, "uuid": "708073bc7405222de53013db3a1e1ef763b7549c"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/reuters-america-sap-pushes-into-sales-tracking-market-with-2-point-4-bln-callidus-buy.html", "ord_in_thread": 0, "title": "SAP pushes into sales tracking market with $2.4 bln Callidus buy", "locations": [], "entities": {"persons": [{"name": "callidus", "sentiment": "none"}, {"name": "bill mcdermott", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "sap", "sentiment": "negative"}, {"name": "gartner", "sentiment": "none"}, {"name": "callidus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALLDORF, Germany Jan 30 (Reuters) - German business software group SAP's $2.4 billion deal to buy sales performance tracking firm Callidus pushes it further into the marketing arena and positions it to better compete with rivals Salesforce and Oracle.\nTechnology research firm Gartner ranks Callidus as the market leader in the emerging category of sales performance management software, an $850 million market that it forecasts to grow around 12 to 13 percent a year to around $1.4 billion by 2022.\nCallidus is cloud-based software which helps corporate sales teams target potential customers by generating leads, configuring products, devising quotes and monitoring sales targets through to completion to track how teams have performed.\n\"We have now climbed deeply into the psyche of the sales professional,\" SAP Chief Executive Bill McDermott told a news conference at the company's headquarters on Tuesday.\nThe deal came as SAP announced 2017 results on the lower side of market expectations.\nSales performance software is a facet of the broader customer relationship management (CRM) category where SAP competes with Salesforce.com, the leading pure-play cloud software firm.\nThis was SAP's first sizeable acquisition in 3-1/2 years, McDermott said, adding that SAP did not plan further major mergers and acquisitions in the near term. In 2014, it paid $8.3 billion to buy travel and expense management software firm Concur, marking the company's largest acquisition ever.\n\"We are in no way looking to be in the M&A business at scale,\" the SAP CEO said. \"This is a tuck-in.\"\nCallidus, which is based outside of San Francisco, competes with software giants Oracle and IBM, as well as more focused start-ups Anaplan, Optymyze and Xactly.\nThe deal is expected to be essentially neutral to SAP's reported earnings per share this year, and should begin to boost earnings starting in 2019, SAP said.\nSAP has agreed to pay $36 per share for Callidus, which is a premium of about 10 percent to the stock's last close of $32.70 but nearly 30 percent higher based on the company's share performance over the last 90 days.\nThe deal was unanimously agreed by Callidus's board, the two companies said in a joint statement. (Reporting by Eric Auchard in Walldorf, Germany and Shubham Kalia and Subrat Patnaik in Bengaluru; Editing by Sunil Nair and Keith Weir)", "external_links": [], "published": "2018-01-30T11:49:00.000+02:00", "crawled": "2018-01-30T16:03:34.001+02:00", "highlightTitle": ""}