{"organizations": [], "uuid": "6cf23f0431208389766c231f850dd42e88a4a398", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219689413&w=1200&r=LYNXMPEE0417H", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-verizon-bloomberg/verizon-removes-bloomberg-tv-refusing-to-pay-carriage-fees-idUSKBN1EU1ZK", "country": "US", "domain_rank": 408, "title": "Verizon removes Bloomberg TV, refusing to pay carriage fees", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T22:55:00.000+02:00", "replies_count": 0, "uuid": "6cf23f0431208389766c231f850dd42e88a4a398"}, "author": "", "url": "https://www.reuters.com/article/us-verizon-bloomberg/verizon-removes-bloomberg-tv-refusing-to-pay-carriage-fees-idUSKBN1EU1ZK", "ord_in_thread": 0, "title": "Verizon removes Bloomberg TV, refusing to pay carriage fees", "locations": [], "entities": {"persons": [{"name": "jessica toonkel", "sentiment": "none"}], "locations": [], "organizations": [{"name": "verizon", "sentiment": "negative"}, {"name": "bloomberg tv", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "bloomberg l.p.", "sentiment": "none"}, {"name": "verizon communications inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Verizon Communications Inc has pulled Bloomberg L.P.’s news network, Bloomberg TV, from 4.6 million of its pay-TV customers after the financial news provider asked the carrier to pay it for its content for the first time ever.\nVerizon said it took down the news network last month because it did not want to pay for it when viewers can access it for free online. It remained unclear whether the companies could come to an agreement allowing the network to return to Verizon’s customers.\n“Bloomberg is proposing that we pay for content that they make available to all consumers for free on their website and mobile app,” the company said in its alert to Verizon’s FIOS TV customers about the removal of Bloomberg TV.\nVerizon is advising customers to go to Bloomberg’s website and app to watch Bloomberg TV, a Verizon spokeswoman said.\nA spokesman for Bloomberg declined to comment.\nCable and satellite companies have been losing more subscribers, making them much less willing to pay up for television programing that is also available online.\nSix U.S. cable providers, including Verizon, lost more than 1.6 million subscribers through the third quarter of 2017.\nVerizon is one of a growing number of distributors that are using a new negotiating tactic with programmers by referring customers to the programmers’ own streaming services. This week, Altice USA Inc, advised customers to sign up for Starz’ online streaming service after it pulled its channels from 3.4 million of its customers.\nMeanwhile, Bloomberg has been focused on expanding its online viewership. In December it launched a 24/7 news service with Twitter to reach the microblogging service’s 330 million active users.\nThe service, called “TicToc by Bloomberg” is primarily new content exclusive to the platform, but there is some overlap with Bloomberg TV, according to sources familiar with the situation.\nReporting By Jessica Toonkel, additional reporting by Anjali Athavaley in New York; Editing by David Gregorio\n ", "external_links": [], "published": "2018-01-05T22:55:00.000+02:00", "crawled": "2018-01-05T23:08:46.041+02:00", "highlightTitle": ""}