{"organizations": [], "uuid": "8255640d762cbdf9bcdfe733d450e939e09fd226", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224249462&w=1200&r=LYNXMPEE0L1Z0", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-ifab/final-decision-on-video-replays-likely-on-march-3-says-ifab-idUKKBN1FB2RQ", "country": "US", "domain_rank": 408, "title": "Final decision on video replays likely on March 3, says IFAB", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:46:00.000+02:00", "replies_count": 0, "uuid": "8255640d762cbdf9bcdfe733d450e939e09fd226"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-ifab/final-decision-on-video-replays-likely-on-march-3-says-ifab-idUKKBN1FB2RQ", "ord_in_thread": 0, "title": "Final decision on video replays likely on March 3, says IFAB", "locations": [], "entities": {"persons": [{"name": "gianni infantino", "sentiment": "none"}, {"name": "simone inzaghi", "sentiment": "none"}, {"name": "seri", "sentiment": "none"}], "locations": [{"name": "zurich", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "ifab reuters", "sentiment": "negative"}, {"name": "ifab", "sentiment": "negative"}, {"name": "lazio", "sentiment": "none"}, {"name": "min read  zurich", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "fifa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 48 PM / Updated 4 minutes ago Final decision on video replays likely on March 3, says IFAB Reuters Staff 3 Min Read \nZURICH (Reuters) - Soccer’s law-making body IFAB said on Monday a final decision on the use of the video replay system (VAR) designed to help referees make key decisions would be made in March. \nVARs have been on trial in various competitions around the world, including Serie A, the Bundesliga and the Confederations Cup, since last year with mixed results. \nAn IFAB spokesman said that a full meeting of IFAB in Zurich on March 3 would give the verdict and, if approved, would then pave the way for global soccer body FIFA to use them at the World Cup in Russia. \nFIFA president Gianni Infantino has said on various occasions that he wants to use VARs at soccer’s flagship tournament. \nHowever, trials involving VARs have not gone entirely smoothly and there are doubts about whether the problems can be ironed out for a major tournament such as the World Cup where many teams, officials and fans will not be familiar with the system. \nLazio coach Simone Inzaghi said after a Serie A match last month that VARs had taken the excitement out of the game. \n”Players don’t hug each other after scoring a goal any more, instead they look straight towards the referee,” he said. \n“For me, it’s removing the adrenaline and my enjoyment of football.” \nDuring last year’s Confederations Cup, referee Wilmer Roldan needed two reviews of an incident to send off the correct Cameroon player amid chaotic scenes in a match against Germany. \nIFAB said on Monday that it was encouraged by a study by Belgium’s Catholic University of Leuven into the VAR trials. \nAccording to the study, VAR has been used in 804 competitive games with an average of just under five checks by the video official per match. “The vast majority were background checks which did not interfere with the game,” said the study. \nThe study said that 533 of those matches had no review, where play is stopped for either the referee or the video assistant to look at the replay. Only 42 matches had more than one review. \nThe study said that the accuracy of decisions involving match-changing incidents -- such as goals, penalties and direct red cards -- was 98.9 percent in matches where VAR is used. \nThe median time for a review was 39 seconds when the decision is based only on communication with the VAR and 79 seconds with the use of a pitchside monitor, the study said. \n(This version of the story corrects next month to March in first paragraph) Writing by Brian Homewood in Berne, Editing by William Maclean", "external_links": [], "published": "2018-01-22T21:46:00.000+02:00", "crawled": "2018-01-22T22:01:36.005+02:00", "highlightTitle": ""}