{"organizations": [], "uuid": "5441080c8309bfe6f1a69eb848c8be2ee9aa6961", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-ci-capital-partners-invests-in-redwood-logistics.html", "country": "US", "domain_rank": 767, "title": "CI Capital Partners Invests in Redwood Logistics", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T20:37:00.000+02:00", "replies_count": 0, "uuid": "5441080c8309bfe6f1a69eb848c8be2ee9aa6961"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-ci-capital-partners-invests-in-redwood-logistics.html", "ord_in_thread": 0, "title": "CI Capital Partners Invests in Redwood Logistics", "locations": [], "entities": {"persons": [{"name": "yeager", "sentiment": "none"}, {"name": "mark yeager", "sentiment": "none"}], "locations": [{"name": "redwood logistics chicago", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "ci capital partners", "sentiment": "negative"}, {"name": "ci capital partners invests", "sentiment": "negative"}, {"name": "coo of hub group", "sentiment": "none"}, {"name": "redwood logistics", "sentiment": "none"}, {"name": "ci capital", "sentiment": "none"}, {"name": "simplified logistics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO and NEW YORK, Jan. 2, 2018 /PRNewswire/ -- CI Capital Partners, a New York-based private equity firm, announced today that it has acquired a majority interest in Redwood Logistics, an industry leading provider of truckload, transportation management and technology services. Redwood Logistics will combine with Simplified Logistics, an Ohio-based less-than-truckload logistics provider acquired by CI Capital in February 2017, to form a unique, full service logistics platform, which will operate as Redwood Logistics.\nThe combination of Redwood Logistics' strength in truckload brokerage, managed transportation services, and transportation technology services and Simplified Logistics' strength in less-than-truckload freight management services creates a full-service provider of third-party logistics that is able to manage all of its customers' freight management needs. Mark Yeager, Simplified Logistics' current CEO, will lead the combined company. Mr. Yeager is an experienced logistics executive who previously was the President and COO of Hub Group, a leading transportation management company offering intermodal, brokerage and logistics services. Todd Berger, Founder and CEO of Redwood Logistics, will be the President and COO of the combined organization, and recently hired senior logistics executives, John Centers and Sheila Taylor, will serve as the EVP of Sales and the CFO and EVP of Strategy of the combined business, respectively. The company's less-than-truckload business, which will use the Simplified Logistics brand, will continue to be led by Sam Avampato.\nMr. Yeager said, \"Todd and the rest of the team at Redwood have built an impressive company whose unique culture and dedicated employees are responsible for its success. The complementary nature of Simplified's and Redwood's legacy businesses makes this a natural combination that creates a differentiated, multi-modal offering, improving the competitive positioning of both companies. This merger provides both businesses with a broader set of capabilities to offer our customers, and an advantageous increase in scale. We are excited about the growth opportunities for the combined company.\"\n\"Through conversations with Mark and CI Capital, it became clear that forming this partnership will help our highly motivated employees achieve our ambitious vision for Redwood,\" said Mr. Berger. \"I look forward to working with the rest of the management team to accomplish our shared goals.\"\n\"When we initially acquired Simplified Logistics earlier this year, it was our goal to build a leading third-party logistics provider,\" said Joost Thesseling, Managing Director at CI Capital. \"We believe the merger with Redwood accomplishes that, and we will continue to look for add-on acquisitions that will complement and enhance the combined company's service offering.\"\nRepublic Partners acted as the exclusive financial advisor to Redwood Logistics. Sidley Austin acted as legal counsel to Redwood Logistics. Paul, Weiss, Rifkind, Wharton & Garrison LLP acted as legal counsel to Simplified Logistics.\nAbout Redwood Logistics\nChicago-based Redwood Logistics is a next generation, strategically integrated logistics provider that believes every company's needs are unique. For more than 15 years, the company has been providing solutions for moving and managing freight, and sharing its knowledge across North America. Redwood Logistics is focused on making its customers more successful in their end markets by applying talented and motivated people, proven processes and cutting-edge technologies to optimize their supply chain management efforts. For more information, please visit us on the web at www.redwoodlogistics.com .\nAbout Simplified Logistics\nSimplified Logistics is a leading North American provider of transportation management services. Simplified's comprehensive service offering includes logistics consulting, transportation management, customer reporting and freight audit and payment services. Simplified was founded in 2003 and is based in Westlake, OH. For more information, please visit www.simplifiedlogistics.com .\nAbout CI Capital Partners\nCI Capital Partners LLC, a leading North American private equity investment firm with approximately $2.4 billion in assets under management, has been investing in middle-market companies since 1993. CI Capital forms partnerships with experienced management teams and entrepreneurs to build substantial businesses through add-on acquisitions, organic growth and operational improvements. Since inception, CI Capital and its portfolio companies have made over 250 acquisitions representing over $8 billion in enterprise value. To learn more about CI Capital Partners, please visit www.cicapllc.com .\nMedia Contact\nDaniel Yunger\nKekst\n212.521.4800\nView original content with multimedia: http://www.prnewswire.com/news-releases/ci-capital-partners-invests-in-redwood-logistics-300576504.html\nSOURCE CI Capital Partners", "external_links": ["http://www.prnewswire.com/news-releases/ci-capital-partners-invests-in-redwood-logistics-300576504.html"], "published": "2018-01-02T20:37:00.000+02:00", "crawled": "2018-01-02T21:34:31.000+02:00", "highlightTitle": ""}