{"organizations": [], "uuid": "a4129f3adc55418d1605a2dc0c87313948a27790", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-albireo-prices-65-point-0-million-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Albireo Prices $65.0 Million Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:45:00.000+02:00", "replies_count": 0, "uuid": "a4129f3adc55418d1605a2dc0c87313948a27790"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-albireo-prices-65-point-0-million-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Albireo Prices $65.0 Million Public Offering of Common Stock", "locations": [], "entities": {"persons": [{"name": "cowen", "sentiment": "none"}, {"name": "william blair", "sentiment": "none"}, {"name": "wedbush pacgrow", "sentiment": "none"}, {"name": "albireo", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "albireo pharma, inc.", "sentiment": "neutral"}, {"name": "needham & company", "sentiment": "none"}, {"name": "roth capital partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Albireo Pharma, Inc. (Nasdaq:ALBO), a clinical-stage orphan pediatric liver disease company developing novel bile acid modulators, announced today the pricing of its previously announced underwritten public offering of 1,970,000 shares of its common stock at a price to the public of $33.00 per share. Albireo’s gross proceeds from this offering are expected to be approximately $65.0 million, before deducting underwriting discounts and commissions and estimated offering expenses. In addition, Albireo has granted the underwriters a 30-day option to purchase up to an additional 295,500 shares of common stock on the same terms and conditions. All of the shares in the offering are being sold by Albireo. The offering is expected to close on or about January 29, 2018, subject to customary closing conditions.\nCowen and William Blair are acting as joint book-running managers and representatives of the underwriters for the offering. Needham & Company, Wedbush PacGrow and Roth Capital Partners are acting as co-managers.\nThe offering will be made only by means of a written prospectus and related prospectus supplement forming part of a shelf registration statement on Form S-3 that was filed with the Securities and Exchange Commission (SEC) on October 13, 2017, amended on November 16, 2017 and declared effective by the SEC on December 5, 2017. The preliminary prospectus supplement and accompanying prospectus relating to and describing the terms of the offering were filed with the SEC on January 24, 2018. The final prospectus supplement and accompanying prospectus will be filed with the SEC and will be available at the SEC’s website located at www.sec.gov , copies of which may be obtained, when available, from Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY 11717, Attn: Prospectus Department, or by telephone at 631-274-2806, and from William Blair & Company, L.L.C., Attention: Prospectus Department, 150 North Riverside Plaza, Chicago, IL 60606, or by telephone at 1-800-621-0687 or email at prospectus@williamblair.com .\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities in any state or other jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or other jurisdiction.\nAbout Albireo\nAlbireo Pharma is a clinical-stage biopharmaceutical company focused through its operating subsidiary on the development of novel bile acid modulators to treat orphan pediatric liver diseases and other liver and gastrointestinal diseases and disorders. Albireo’s clinical pipeline includes a Phase 3 product candidate for the treatment of patients with the orphan pediatric liver disease known as progressive familial intrahepatic cholestasis, as well as a Phase 2 product candidate. In addition, Albireo’s elobixibat, approved in Japan for the treatment of chronic constipation, is the first IBAT inhibitor approved anywhere in the world. Albireo was spun out from AstraZeneca in 2008.\nAlbireo Pharma is located in Boston, Massachusetts, and its key operating subsidiary is located in Gothenburg, Sweden.\nInvestor Contact:\nHans Vitzthum\nLifeSci Advisors, LLC.\n212-915-2568\nMedia Contact:\nHeather Anderson\n6 Degrees\n980-938-0260\nhanderson@6degreespr.com\nSource:Albireo, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8eef1fda-a775-421e-9f49-804f467ece7e", "https://www.globenewswire.com/Tracker?data=ggmAWVkV9nnbRDBrScQR2xuCvrO8jpwjlY_Yexjn78wLwhWVLMN6e71vzzGac_-LGK8lAs2jXmoKZRWgzlkv_w==", "https://www.globenewswire.com/Tracker?data=a6DQ5LsPT7qJ1io1rodwmFJzHOsPrrkGM--_gd_Vn9MZqr2ZosioM7Ousk5XHZ_LExikEb7GnYNZlafq83ZGf1OVC_et0otNbzo9LS7uHg91KTIKWQpcqVisWovU9vrh", "https://www.globenewswire.com/Tracker?data=gYFwdWuyyjjeTFAsoD4CFoI6DPmCpRo6QnvKZH-wnRZ71JibjUtVKsB2pJkBsd_h8ZCiGfId5gNqlvbYnYere5BC0_GQcYBLNbkft_mX2W0="], "published": "2018-01-25T16:45:00.000+02:00", "crawled": "2018-01-25T18:30:09.002+02:00", "highlightTitle": ""}