{"organizations": [], "uuid": "d1797de7b40b1d6e086448ed92f39e07a1481135", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-quotidian-technical-highlights-on-selected-education-and-training-services-stocks--adtalem-global-education-chegg-new-oriental.html", "country": "US", "domain_rank": 767, "title": "Quotidian Technical Highlights on Selected Education and Training Services Stocks -- Adtalem Global Education, Chegg, New Oriental Education and Technology, and TAL Education", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.123, "site_type": "news", "published": "2018-01-08T14:20:00.000+02:00", "replies_count": 0, "uuid": "d1797de7b40b1d6e086448ed92f39e07a1481135"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-quotidian-technical-highlights-on-selected-education-and-training-services-stocks--adtalem-global-education-chegg-new-oriental.html", "ord_in_thread": 0, "title": "Quotidian Technical Highlights on Selected Education and Training Services Stocks -- Adtalem Global Education, Chegg, New Oriental Education and Technology, and TAL Education", "locations": [], "entities": {"persons": [], "locations": [{"name": "chegg", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "new oriental education and technology", "sentiment": "neutral"}, {"name": "adtalem global education", "sentiment": "neutral"}, {"name": "tal education", "sentiment": "neutral"}, {"name": "selected education and training services stocks", "sentiment": "neutral"}, {"name": "adtalem global education illinois", "sentiment": "none"}, {"name": "wallstequities.com", "sentiment": "none"}, {"name": "tal education group", "sentiment": "none"}, {"name": "edu", "sentiment": "none"}, {"name": "adtalem global education inc.", "sentiment": "none"}, {"name": "chegg inc.", "sentiment": "none"}, {"name": "new oriental education & technology group inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "education and training services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 8, 2018 /PRNewswire/ - WallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on ATGE, CHGG, EDU, and TAL which can be accessed for free by signing up to www.wallstequities.com/registration . Research coverage has been initiated by WallStEquities.com on Adtalem Global Education Inc. (NYSE: ATGE), Chegg Inc. (NYSE: CHGG), New Oriental Education & Technology Group Inc. (NYSE: EDU), and TAL Education Group (NYSE: TAL). Companies in the Education and Training Services industry include business and secretarial schools; technical and trade schools; and providers of tutoring, exam preparation, and other instruction. All you have to do is sign up today for this free limited time offer by clicking the link below.\nwww.wallstequities.com/registration\nAdtalem Global Education\nIllinois headquartered Adtalem Global Education Inc.'s shares recorded a trading volume of 355,457 shares last Friday. The stock finished the trading session 0.11% lower at $44.10. The Company's shares have gained 0.46% in the last month, 24.75% over the previous three months, and 39.34% over the past year. The stock is trading above its 50-day and 200-day moving averages by 8.64% and 19.61%, respectively. Furthermore, shares of the Company, which provides educational services worldwide, have a Relative Strength Index (RSI) of 58.19.\nOn December 21 st , 2017, Ross University School of Medicine (RUSM), a member of Adtalem Global Education, announced that the Dominica Medical Board and the US Department of Education recently approved of the University resuming its Fall 2017 semester on a uniquely fitted cruise liner docked off the coast of St. Kitts in the West Indies. \"We are pleased to have retained the important regulatory approvals,\" said RUSM Dean William F. Owen. \"Our students can rest assured knowing we are offering the same high quality educational standards that attracted them to RUSM.\" Get the full research report on ATGE for free by clicking below at:\nwww.wallstequities.com/registration/?symbol=ATGE\nChegg\nOn Friday, California headquartered Chegg Inc.'s stock ended the session 0.78% higher at $16.79. A total volume of 505,126 shares was traded. The Company's shares have gained 15.95% in the last month, 8.96% over the previous three months, and 122.09% over the past year. The stock is trading 9.76% above its 50-day moving average and 26.19% above its 200-day moving average. Moreover, shares of Chegg, which operates student-first connected learning platform that help students transition from high school to college to career, have an RSI of 66.06. The free technical report on CHGG can be accessed at:\nwww.wallstequities.com/registration/?symbol=CHGG\nNew Oriental Education & Technology Group\nChina headquartered New Oriental Education & Technology Group Inc.'s stock ended the day 1.48% higher at $100.86. A total volume of 2.16 million shares was traded, which was above their three months average volume of 1.53 million shares. The Company's shares have gained 19.39% in the last month, 12.22% over the previous three months, and 117.31% over the past year. The stock is trading 14.01% and 27.86% above its 50-day and 200-day moving averages, respectively. Additionally, shares of the Company, which provides private educational services under the New Oriental brand in China, have an RSI of 72.48.\nOn December 20 th , 2017, research firm CLSA upgraded the Company's stock rating from 'Underperform' to 'Outperform'.\nOn December 27 th , 2017, New Oriental Education & Technology announced that it will report its financial results for Q2 2018 ended November 30 th , 2017 before the US market opens on January 23 rd , 2018. Management will host an earnings conference call and live webcast that same day at 8:00 a.m. US ET. The call will be available under the investor page of the Company's website. Sign up for free on Wall St. Equities and claim the latest report on EDU at:\nwww.wallstequities.com/registration/?symbol=EDU\nTAL Education Group\nShares in China headquartered TAL Education Group recorded a trading volume of 3.58 million shares. The stock ended Friday's session 0.15% higher at $32.62. The Company's shares have surged 17.42% in the last month and 156.14% over the past year. The stock is trading above its 50-day and 200-day moving averages by 11.88% and 26.44%, respectively. Furthermore, shares of TAL Education have an RSI of 68.15.\nOn December 28 th , 2017, TAL Education announced that it will release its unaudited financial results for Q3 FY18 ended November 30 th , 2017 before the market opens on January 25 th , 2018. The Company will host a corresponding conference call and live webcast that same day at 8:00 a.m. US ET. The call will be available under the investor page of the Company's website. See the free research coverage on TAL at:\nwww.wallstequities.com/registration/?symbol=TAL\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may b", "external_links": ["http://www.wallstequities.com/registration/?symbol=TAL", "http://www.prnewswire.com/news-releases/quotidian-technical-highlights-on-selected-education-and-training-services-stocks----adtalem-global-education-chegg-new-oriental-education-and-technology-and-tal-education-300578831.html", "https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration/?symbol=ATGE", "http://www.wallstequities.com/registration/?symbol=CHGG", "http://www.wallstequities.com/registration/?symbol=EDU", "http://www.wallstequities.com/registration"], "published": "2018-01-08T14:20:00.000+02:00", "crawled": "2018-01-08T15:32:12.000+02:00", "highlightTitle": ""}