{"organizations": [], "uuid": "3ddaba7483505ea3cb449781f9b02d2f086fd0ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/21/104911822-RTX3JSZZ.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/a-weak-dollar-hurts-more-americans-than-it-helps.html", "country": "US", "domain_rank": 767, "title": "A weak dollar hurts more Americans than it helps", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.191, "site_type": "news", "published": "2018-01-26T14:09:00.000+02:00", "replies_count": 0, "uuid": "3ddaba7483505ea3cb449781f9b02d2f086fd0ea"}, "author": "Rebecca Patterson", "url": "https://www.cnbc.com/2018/01/26/a-weak-dollar-hurts-more-americans-than-it-helps.html", "ord_in_thread": 0, "title": "A weak dollar hurts more Americans than it helps", "locations": [], "entities": {"persons": [{"name": "steven mnuchin", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "andrew kelly", "sentiment": "none"}, {"name": "robert rubin", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "macy's herald square", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "For the first time since 2003, the U.S. appears to be seriously rethinking its policy towards the dollar. This may well do more harm than good.\nBack in the mid-1990s, following a period of extreme dollar weakness, then-U.S. Treasury Secretary Robert Rubin argued that a strong dollar was in America's interest. It was a philosophy that was taken at face value by investors, and adhered to for decades, more or less, for good reasons. A strong currency keeps a lid on inflation, which in turn helps keep interest rates low.\nSuch easy monetary policy helps families and companies through lower borrowing costs, for mortgages and student loans, for example. It also helps reduce the amount of interest expense the U.S. government has to pay on (large and increasing) federal debt.\nA strong dollar usually reflects a world where capital wants to come to the U.S. — foreign investors see U.S. bonds and stocks as attractive, and are willing to forgo their own currency for what they think is a potentially better return from U.S. assets.\nThat said, a strong dollar does not help everyone. U.S. exporters clearly would prefer a weaker dollar that makes their goods more competitive overseas. That seemed to be part of the thinking in 2003 when then-Treasury Secretary John Snow (formerly the Chief Executive Officer of transportation firm CSX Corp.) publicly questioned how to define the country's currency policy.\nThe two weeks following his remarks saw the value of gold and the euro each rise more than 2 percent against the dollar (a relatively large move in the currency world). While Snow retreated back to Rubin's \"strong dollar\" mantra by 2004, the damage was already done in terms of investors' trust in the policy. While only one factor influencing the currency, it seems this rhetorical shift was at least a contributor to the euro's very sharp 17 percent gain between May 2003 and the end of 2004.\nWhile clearly important for firms and their workers, exports only represent about 13 percent of overall U.S. GDP, while the U.S. consumer represents around two-thirds of GDP (the latter group broadly benefitting more from a stable or a stronger dollar). With that in mind, a better strategy might be to not target a weaker dollar but instead find ways of helping those firms through periods when the dollar is exceptionally strong — or encouraging firms to find additional ways of being competitive throughout exchange rate cycles.\nA weaker dollar can result in higher inflation expectations and higher commodity prices — good news at the margin for commodity-related firms, but not so good for Americans frequenting gasoline stations. Further, if the weaker dollar actually translates into higher inflation (often from more expensive commodity and import prices), it could lead the Federal Reserve to react and tighten monetary policy. Higher interest rates are welcomed by savers but frowned upon by anyone holding debt they need to pay back.\nThere is a critical global element to the dollar debate as well. A strong dollar is usually the flip side of weaker overseas' currencies, and vice versa. Today, with the dollar weakening, export-oriented firms across Europe and Japan face a bigger headwind. Meanwhile, countries with stronger currencies and relatively attractive bond yields (including many in emerging markets) are attracting capital (sometimes at an unhealthy pace) from U.S. investors, who see a chance to make money through both currency and fixed-income channels.\nAt the end of the day, no U.S. dollar policy — strong or weak — can make every American happy. So maybe the first should be to avoid doing harm and have a dollar policy that allows for fluctuation and provides a useful monetary tool, while seeking to steer clear of bouts of exceptional strength or weakness through verbal guidance or central bank intervention if necessary.\nIt's the rapid currency moves that hurt companies and policymakers the most. Firms cannot adjust their financial plans quickly enough to avoid currency effects on their bottom lines. Meanwhile, sudden, sharp currency moves that spill over to countries overseas can result in greater multinational tensions, which over time can hurt U.S. interests.\nU.S. Treasury Secretary Steven Mnuchin's comments at the World Economic Forum in Davos, Switzerland, this week, echoing similar \"weak dollar\" mesages by President Trump over the last year, reflect a focus on U.S. exporters, putting that corner of America first. Unfortunately, when it comes to the dollar, weakness risks hurting many more Americans than it helps.\nRebecca Patterson is chief investment officer of Bessemer Trust and has overall responsibility for investments, including asset allocation, strategic portfolio direction, and research. She is chairman of the Investment Policy and Strategy Committee and a member of the Management Committee. Patterson is also a CNBC contributor.", "external_links": [], "published": "2018-01-26T14:09:00.000+02:00", "crawled": "2018-01-26T14:34:02.006+02:00", "highlightTitle": ""}