{"organizations": [], "uuid": "8c10aa71b5bde66f0aead52a824cde47ac18853e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104948646-Dispose_RX1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/walmart-offers-free-opioid-disposal-product.html", "country": "US", "domain_rank": 767, "title": "Walmart offers free opioid disposal product", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.833, "site_type": "news", "published": "2018-01-17T07:02:00.000+02:00", "replies_count": 0, "uuid": "8c10aa71b5bde66f0aead52a824cde47ac18853e"}, "author": "Dan Mangan", "url": "https://www.cnbc.com/2018/01/16/walmart-offers-free-opioid-disposal-product.html", "ord_in_thread": 0, "title": "Walmart offers free opioid disposal product", "locations": [], "entities": {"persons": [{"name": "john holaday", "sentiment": "none"}], "locations": [], "organizations": [{"name": "walmart", "sentiment": "negative"}, {"name": "walmart  walmart", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Walmart will offer a drug disposal product — for free — to pharmacy customers as part of an effort to combat the nation's opioid abuse epidemic, the retail giant said Wednesday.\nThe product, a powder called DisposeRX , is meant to be used by customers who no longer need their prescription painkillers or are concerned that someone else might take their pills.\nWhen mixed with warm water and prescription medication in a pill bottle, DisposeRX creates a solid that can then be thrown out safely in the trash, without the risk of contaminating groundwater, its maker says.\nRepeated tests have been unable to extract opioids from the resultant solid after the powder is mixed with the drugs, DisposeRX's CEO John Holaday said.\nWalmart said a small packet of DisposeRX will now be given free automatically to any pharmacy customers filling new Class II opioid prescriptions at all of the retailer's 4,700 pharmacies.\nPatients with chronic Class II opioid prescriptions will be offered a free packet every six months and existing customers can request a free packet at any time. DisposeRX packets also are being given away free at Sam's Club pharmacies.\n\"The health and safety of our patients is a critical priority,\" said Marybeth Hays, executive vice president of consumables and health at Walmart U.S.\n\"That's why we're taking an active role in fighting our nation's opioid issue, an issue that has affected so many families and communities across America,\" Hays said.\nHays declined to say during a conference call with reporters how many opioid prescriptions Walmart fills annually.\nThe move comes nine months after the Cherokee Nation sued Walmart and two major pharmacies, Walgreens and CVS Health , along with large drug distributors, for allegedly profiting by \"flooding\" Native American areas in Oklahoma with prescription painkillers.\nLast week, a federal judge granted Walmart and the other defendants a preliminary injunction preventing the case from being brought in tribal court. The tribe, which says it is prepared to seek damages against the companies in state court, notes in its suit that from 2003 to 2014, more than 350 deaths related to opioids occurred in the Cherokee Nation.\nAlthough the offer of DisposeRX for free is coming as a result of the opioid epidemic, the product works on any type of prescription drug, according to Holaday.\nMore than 64,000 Americans died from drug overdoses in 2016, with most of those deaths related to prescription opioids or illegal opioids such as heroin. That level of death led President Donald Trump in October to declare the opioid epidemic a public health emergency.\nWalmart's offer of free DisposeRX is just the latest in a series of efforts by pharmacies to reduce the risk that opioids will be diverted from their appropriate use as painkillers and abused by either the original customer or another person.\nWalmart already was among pharmacies that sell another product, a pouch, to neutralize drugs. However, the retailer does not accept the return for disposal of the drugs that it sells.\nSome pharmacies, including CVS and Walgreens, accept returns of drugs for disposal at select locations .\nWalmart's Hays said DisposeRX \"provides a [disposal] solution for customers to manage that at home, and much more conveniently.\"\nWalmart touted an endorsement of its move from Sen. John Boozman , R-Ark., where the company's headquarters is located.\n\"About one-third of medications sold go unused,\" Boozman said. \"Too often, these dangerous narcotics remain unsecured where children, teens or visitors may have access. I commend Walmart for taking this innovative approach to help keep unused prescription drugs out of the wrong hands.\"", "external_links": [], "published": "2018-01-17T07:02:00.000+02:00", "crawled": "2018-01-17T08:13:25.020+02:00", "highlightTitle": ""}