{"organizations": [], "uuid": "9cb74459bc9b52bd36336b6468b1c1c860782f66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-nireland-politics/sinn-fein-mp-resigns-over-tweet-on-northern-ireland-massacre-idUSKBN1F41CB", "country": "US", "domain_rank": 408, "title": "Sinn Fein MP resigns over tweet on Northern Ireland massacre", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T19:30:00.000+02:00", "replies_count": 0, "uuid": "9cb74459bc9b52bd36336b6468b1c1c860782f66"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-nireland-politics/sinn-fein-mp-resigns-over-tweet-on-northern-ireland-massacre-idUSKBN1F41CB", "ord_in_thread": 0, "title": "Sinn Fein MP resigns over tweet on Northern Ireland massacre", "locations": [], "entities": {"persons": [{"name": "alan black", "sentiment": "none"}, {"name": "barry mcelduff", "sentiment": "none"}, {"name": "mcelduff", "sentiment": "none"}], "locations": [{"name": "northern ireland", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}, {"name": "kingsmill", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "west tyrone", "sentiment": "none"}], "organizations": [{"name": "sinn fein", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "ira", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BELFAST (Reuters) - A British MP for the Irish nationalist party Sinn Fein resigned on Monday in an outcry over a tweet he posted on the anniversary of a day in 1976 when 10 Protestant textile workers were shot dead, an act which police blamed on the IRA.\nBarry McElduff said he was resigning because of the “consequences” of a Twitter video, which he posted on Jan.5 - the anniversary of the killings near the village of Kingsmill - and which showed him jokingly balancing a loaf of Kingsmill brand bread on his head.\nProtestant workers were forced from a minibus by Irish nationalist gunmen and shot dead at close range in the 1976 killings. Though police at the time blamed the IRA, the militant organization denied involvement and no one was convicted.\nAlan Black, the only survivor, told the BBC the video was “depraved” and designed to hurt relatives of the victims.\nMcElduff, who was elected to the British parliament in the West Tyrone constituency but never took up his seat as Sinn Fein does not recognize Britain’s jurisdiction over Northern Ireland, later deleted the tweet.\nSinn Fein, which wants to enter government in both Northern Ireland and the Republic of Ireland, has struggled to distance itself from the violent legacy of the Provisional Irish Republican Army (IRA), its ex-military wing.\nBut the party was widely criticized for not asking McElduff to step down sooner. Last week it suspended him for the party for three months on full pay, a move the Democratic Unionist Party said demonstrated a lack of respect and compassion for the victims.\nMcElduff “should have resigned in the immediate aftermath of posting the disgraceful video mocking and insulting the horrific terrorist events at Kingsmill,” DUP leader Arlene Foster said in a statement welcoming his resignation.\nThe Provisional IRA waged an insurgency against British rule in Northern Ireland until 1998 in which more than 3,600 people were killed.\nMcElduff in a statement offered a “profound apology” to the victims of the attack, but said he had not intended to give offense since he did not at the time make the connection between the anniversary and the brand of the bread.\nReporting by Amanda Ferguson and Conor Humphries; Editing by Richard Balmforth\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T19:30:00.000+02:00", "crawled": "2018-01-16T13:24:15.000+02:00", "highlightTitle": ""}