{"organizations": [], "uuid": "c0b0ec4bfe5fe5ba1eb1dd7a848dcd76066af51c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/11/104648016-GettyImages-157437079.1910x1000.jpg", "site_section": "http://feeds.feedburner.com/google/gyiWk", "section_title": "oil news - Google News", "url": "https://www.cnbc.com/2018/01/10/oil-markets-in-2018--what-are-the-wildcards.html", "country": "US", "domain_rank": 767, "title": "Citi's biggest wildcards for oil markets this year – and how likely they are to actually happen - CNBC", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T11:40:00.000+02:00", "replies_count": 0, "uuid": "c0b0ec4bfe5fe5ba1eb1dd7a848dcd76066af51c"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/oil-markets-in-2018--what-are-the-wildcards.html", "ord_in_thread": 0, "title": "Citi's biggest wildcards for oil markets this year – and how likely they are to actually happen - CNBC", "locations": [], "entities": {"persons": [{"name": "edward morse", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "citi", "sentiment": "negative"}, {"name": "united nations security council", "sentiment": "none"}, {"name": "citigroup", "sentiment": "none"}, {"name": "wildcard", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Getty Images \nOil prices hit their highest levels since 2014 on Wednesday, showing that oil production cuts by major producers are working and demand remains robust. \nBut there are plenty of wildcards that oil markets could confront in 2018, according to a Citi global commodities report published late Tuesday. \nLed by Edward Morse, global head of commodities at Citigroup, analysts looked at the possible events that could derail commodities markets in 2018. \nFocusing specifically on oil markets, the team listed a number of possible unexpected \"wildcard\" events, and the probability that they could occur. \nEach wildcard in Citi's report was assigned a likelihood from one to 10, with one being extremely unlikely and 10 being extremely likely. \nHere are Citi's wildcards for oil in 2018: \nWildcard 1: US Exiting the JCPOA Likelihood: 6 \nThe JCPOA refers to the \"Joint Comprehensive Plan of Action\" that was drawn up between Iran and the five permanent members of the United Nations Security Council and Germany in 2015. The plan allowed international sanctions on Iran to be lifted in return for assurances that the oil-exporting country would abide by restrictions over its nuclear program. \nU.S. President Donald Trump has taken exception to the JCPOA , however, and threatened in October 2017 to scrap it, although he has stopped short of that so far. \nAs such, Citi said the wildcard for oil markets could be \"the breakdown of the JCPOA and re-imposition by the U.S. of sanctions on Iran that have been waived, with the potential for the addition of new sanctions.\" \nThe effect of such a move would be the \"dislocation of at least 500,000 barrels a day of Iranian crude oil exports, especially those going to Korea and Japan as well as to some European countries.\" \nCiti said this would initially result in a $5 per barrel rise in crude oil prices \"as customers losing oil under U.S. pressure scramble for replacements at a time when OPEC and other producers have put a lid on their output.\" \nWildcard 2: New US sanctions against Iran and Hezbollah Likelihood: 7.5 (for new administered and legislated US sanctions) \nCiti noted that Trump was not alone in the U.S. in his frustration regarding the design of the nuclear deal with Iran. He \"looks poised both alone and through new legislation to unilaterally adopt new sanctions aimed both at the Iran missile program and the country's activities in the region,\" despite opposition from other signatories of the deal (China, France, Germany, Russia, UK), the report said. \nCiti believed that the U.S.' possible decision to enhance sanctions on Iran would be aimed at the Iranian regime, including — especially — the Islamic Revolutionary Guard Corps (which maintains internal order in Iran) and Hezbollah (a Shia-predominant political party and militant group based in Lebanon and an ally of Shia-majority Iran), the companies they own and operate abroad. \nIf the U.S. were to impose more sanctions it could provide opponents of the nuclear deal in Iran, who believe that the country has not gained economically from the agreement, with an \"excuse to withdraw from the JCPOA, bringing a snapback of all sanctions pre-existing under U.S. law,\" Citi said. \nCiti said the effect of this would be similar to Wildcard 1, the withdrawal of oil from the market, with the added effect of the Revolutionary Guards and Hezbollah seeing their ability to \"influence events in the region.\" \nWildcard 3: OPEC's 'fragile five' supply disruptions increase Likelihood: 4.5 \nAfter hitting a five-year low in September 2017, global oil supply disruptions could materially increase in 2018 and in short order, in particular from OPEC countries, Citi said. \nGlobal supply disruptions ended 2017 at 2 million barrels a day (b/d), Citi said, but disturbances in Iran, Iraq, Libya, Nigeria and/or Venezuela — known as the \"fragile five\" in oil markets due to the economic and societal instability regularly seen in those countries — could see disruptions climb above 3 million b/d. \n\"If this occurs in 2018, and particularly in the first half of 2018, then oil prices would very likely trade in the $70-80 per barrel range,\" Citi said. \nWildcard 4: Revenge or retreat of the 'unconventionals' Likelihood: Mixed likelihoods for shale oil producers and OPEC/non-OPEC producers \nCiti's list of wildcards for oil markets (and other commodities) comes at a time when the markets are performing well and prices are recovering after several years of turbulence due to a massive glut of supply and lagging demand. \nThe decision by major OPEC and non-OPEC producers, including Russia, to curb oil output is credited largely with the recovery in prices, although the specter of rising U.S. oil production is ever present and there is uncertainty over what happens once the deal between OPEC and non-OPEC producers ends later this year. \nBut Citi said that the oil market was facing \"lumpy\" oil supply scenarios (underproduction or overproduction versus expectations) in the U.S. shale industry on the one hand, and OPEC/Russia on the other hand, that \"could lead to four wildly divergent outcomes for oil prices in 2018.\" \nIt said that the likelihood that the base case that U.S. shale industry overproduces or underproduces was mixed, at five in terms of a base case likelihood. \"Shale could outperform by growing 1-1.2 million b/d in 2018 or perhaps well higher than that, or underperform by growing just 0.6-0.8 million b/d, instead of Citi's base case outlook for 0.8-1.0-m b/d,\" the analysts said. \nCiti thought the likelihood of OPEC/non-OPEC producers ending their deal to curb oil output early and/or to bring back output quickly was fairly unlikely, at four on the scale of likelihood, although they thought the prospect of cuts being extended was extremely unlikely. Whether the group could decide to taper cuts when it meets in June 2018 was uncertain, at five on the scale of likelihood, Citi said. \n\"The joint OPEC/non-OPEC oil producer group could decide at its June 2018 review meeting to end their oil production cuts well earlier than end-2018, perhaps begin tapering the cuts at mid-year or earlier, with potential for a messier, quicker return of barrels to market,\" the report said. \"On the other hand, the producer group might decide to hold the full cuts to the end of the year, or even extend beyond December 2018.\" So what for oil prices? \nWhat OPEC and non-OPEC producers decide to do regarding output, and how the shale industry performs this year, will of course determine the direction of prices. But Citi was equivocal about how the wildcard could play out. \n\"The combinations of these (potential activities by OPEC, non-OPEC and shale producers) drive broad oversupply or undersupply in global oil market balances that could mean on one end that inventories start building robustly by mid-2018, with shale growth momentum even as OPEC and Russia bring back cut volumes to market; this could begin moving Brent prices back down to the $50-60 level quickly, and accelerate a return to the $40-50 range,\" the report said. \n\"On the other end, broad undersupply through underperforming shale and a firm commitment to holding the petrostate production cuts could lead to ongoing inventory declines to even tighter levels… meaning front month Brent prices could move firmly into the $70-80 range, even without supply disruptions.\" ", "external_links": [], "published": "2018-01-10T11:40:00.000+02:00", "crawled": "2018-01-10T12:03:02.014+02:00", "highlightTitle": ""}