{"organizations": [], "uuid": "5093b075291c4e9a9161de57d854df7c004abcb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/06/104692611-GettyImages-632084530.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/25/european-markets-set-to-open-lower-investors-look-to-the-ecb.html", "country": "US", "domain_rank": 767, "title": "European markets set to open lower, investors look to the ECB", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T09:16:00.000+02:00", "replies_count": 0, "uuid": "5093b075291c4e9a9161de57d854df7c004abcb4"}, "author": "Justina Crabtree", "url": "https://www.cnbc.com/2018/01/25/european-markets-set-to-open-lower-investors-look-to-the-ecb.html", "ord_in_thread": 0, "title": "European markets set to open lower, investors look to the ECB", "locations": [], "entities": {"persons": [{"name": "mario draghi", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "nordea", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "lvmh", "sentiment": "none"}, {"name": "diageo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "European markets closed lower on Thursday, as investors digested the latest comments from the European Central Bank, after it left interest rates unchanged.\nSymbol Name Price Change %Change Volume FTSE --- DAX --- CAC --- IBEX 35 --- The pan-European STOXX 600 closed provisionally 0.55 percent lower, while major sectors and bourses were mostly lower.\nOn Thursday, the ECB held fire on changing its benchmark interest rate . During the ECB's press conference, Draghi said that the recent volatility in the exchange rate was a \"source of uncertainty\" and would consequently need monitoring. In spite of Draghi's comments, traders remain convinced that easy monetary policy in the euro zone is coming to an end. Consequently, the euro soared against the U.S. dollar , while markets came under pressure.\nOverseas, U.S. stocks opened higher as investors digested the latest in earnings — the positive sentiment however failed to lift European markets.\nEarnings season delivers mixed bag U.K. lender Close Brothers Group issued a trading update Thursday, stating that performance was decent since the start of the financial year, with all three divisions beating expectations. Shares rose 8 percent. Daily Mail & General Trust also rose more than 6 percent after confirming its outlook, adding that it remained in line with market expectations.\nShares in Nordea slipped 4 percent after the group said that it was negatively impacted by a \"very low activity level on capital markets\" at the end of last year, adding that they weren't content with the profit development during 2017-end.\nAryzta slumped almost 20.9 percent in trade, after the food group announced that it was cutting its EBITDA guidance for 2018, stating that while revenue on the whole was relatively stable, earnings before interest, taxes, depreciation and amortization (EBITDA) had weakened near the end of the second quarter in Europe and the U.S.\nMeanwhile, financial technology firm Temenos Group saw its stock price surge to an all-time high in late afternoon trading, becoming the second-best performer of the STOXX 600. The cause of the jump in share price was not immediately clear, but the company is subject to \"regular takeover speculation,\" Reuters reported. Temenos was not immediately available when contacted by CNBC.\nUK in the spotlight at Davos In other news, U.K. Prime Minister Theresa May addressed the World Economic Forum's annual conference in Davos, Switzerland during today's session. In her speech , May urged investors in the technology space to assist social networks, when it comes to fighting against the rise of extremism and child abuse on such platforms.\nPresident Donald Trump touched down in Davos on Thursday, with investors keeping a close eye as to what he says during the conference. Both Trump and May met that same day to discuss U.S.-U.K. trade. The president said he has a \"really great relationship\" with the British leader.\nCheck out the world leaders and celebrities who are at Davos this year Larry Busacca | Getty Images Entertainment | Getty Images —CNBC's Silvia Amaro and Reuters contributed to this report", "external_links": [], "published": "2018-01-25T09:16:00.000+02:00", "crawled": "2018-01-25T09:01:24.009+02:00", "highlightTitle": ""}