{"organizations": [], "uuid": "60391d13394c7260cb58287f620c04913acbd5a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-pitney-bowes-announces-full-year-and-fourth-quarter-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Pitney Bowes Announces Full Year and Fourth Quarter 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:00:00.000+02:00", "replies_count": 0, "uuid": "60391d13394c7260cb58287f620c04913acbd5a1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-pitney-bowes-announces-full-year-and-fourth-quarter-2017-financial-results.html", "ord_in_thread": 0, "title": "Pitney Bowes Announces Full Year and Fourth Quarter 2017 Financial Results", "locations": [], "entities": {"persons": [{"name": "pitney bowes", "sentiment": "negative"}], "locations": [{"name": "conn.", "sentiment": "none"}, {"name": "stamford", "sentiment": "none"}], "organizations": [{"name": "pitney bowes inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "newgistics", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STAMFORD, Conn.--(BUSINESS WIRE)-- Pitney Bowes Inc. (NYSE: PBI), a global technology company providing innovative technology solutions to power commerce, today reported financial results for the full year and the fourth quarter 2017. The Company has also provided annual guidance for 2018.\nFull Year 2017:\nRevenue of $3.5 billion, an increase of 4 percent versus prior year largely driven by the Newgistics acquisition GAAP EPS of $1.39; Adjusted EPS of $1.41 GAAP cash from operations of $496 million; free cash flow of $384 million Total debt increased $465 million versus prior year, which was largely attributable to the Newgistics acquisition\nFourth Quarter 2017:\nRevenue of $1.0 billion, an increase of 18 percent as reported and 17 percent at constant currency versus prior year GAAP EPS of $0.48; Adjusted EPS of $0.40 GAAP cash from operations of $165 million; free cash flow of $145 million Acquired Newgistics for $475 million; transaction closed on October 2, 2017 Redeemed $350 million of debt prior to the scheduled maturity in May 2018\n“For the fourth quarter and full year, we moved our company to growth,” said Marc Lautenbach, President and CEO. “We saw our full year revenue grow in four out of our six segments and our total revenue showed positive growth on both a reported basis and excluding the impact of the Newgistics acquisition.\nLautenbach continued: “Pitney Bowes is a different company today than it was five years ago. Our strategy is working and the investments we have made for the long-term across all of our businesses are paying off. While we are pleased with the progress we are making, there is more to do to transform our Company and unlock shareholder value.”\nFull Year 2017 Results\nRevenue totaled $3.5 billion, an increase of 4 percent versus prior year.\nGAAP earnings per diluted share (GAAP EPS) were $1.39, which included $0.21 for restructuring and asset impairments charges, $0.03 for transaction costs, a $0.01 loss for the extinguishment of debt and a $0.03 gain from the sale of technology.\nGAAP EPS also included an estimated one-time, non-cash net benefit of $39 million, or $0.21 per share, recorded on the provision for income tax line related to the enactment of the Tax Cuts and Jobs Act of 2017 (Tax Legislation). This net benefit is comprised of a $130 million benefit related to the remeasurement of net U.S. deferred tax liabilities arising from a lower U.S. corporate tax rate offset by an estimated one-time tax charge of $91 million related primarily to a U.S. tax on the unremitted earnings of the Company’s foreign subsidiaries.\nAdjusted earnings per diluted share (Adjusted EPS) were $1.41. The Company’s tax rate on adjusted earnings was 24.2 percent for the year.\nGAAP cash from operations was $496 million and free cash flow was $384 million. During the year, the Company used cash to return $139 million in dividends to shareholders and to pay $41 million for restructuring payments.\nFourth Quarter 2017 Results\nRevenue totaled $1.0 billion, which was an increase of 18 percent as reported and 17 percent at constant currency versus prior year.\nDigital Commerce Solutions revenue grew 86 percent as reported and 84 percent at constant currency. Enterprise Business Solutions revenue increased 10 percent as reported and 8 percent at constant currency. Small and Medium Business (SMB) Solutions revenue declined 5 percent as reported and 7 percent at constant currency.\nGAAP EPS were $0.48, which included $0.10 for restructuring charges related to the Company’s additional $200 million gross spend reduction initiatives, which will occur over the next 2 years, $0.01 for transaction costs, a $0.01 loss for the extinguishment of debt and a net benefit of $0.21 due to Tax Legislation.\nAdjusted EPS were $0.40.\nGAAP cash from operations was $165 million and free cash flow was $145 million. Compared to the prior year, free cash flow decreased by $19 million primarily due to lower adjusted net income. During the quarter, the Company used cash to return $35 million in dividends to shareholders and to pay $11 million for restructuring payments.\nThe Company’s earnings per share results for the fourth quarter and full year are summarized in the table below:\nFourth Quarter* Full Year* 2017 2016 2017 2016 GAAP EPS $0.48 ($0.45) $1.39 $0.49 Discontinued operations - loss - - - $0.01 GAAP EPS from continuing operations $0.48 ($0.45) $1.39 $0.51 Tax Legislation ($0.21) - ($0.21) - Restructuring charges and asset impairments, net $0.10 $0.05 $0.21 $0.22 Transaction costs $0.01 - $0.03 - Loss on extinguishment of debt $0.01 - $0.01 - Gain on sale of technology - - ($0.03) - Goodwill impairment charge - $0.90 - $0.89 Preferred stock redemption - $0.01 - $0.03 Impact of divestiture transactions - $0.01 - $0.02 Adjusted EPS $0.40 $0.53 $1.41 $1.68\n* The sum of the earnings per share may not equal the totals above due to rounding.\nFourth Quarter 2017 Business Segment Reporting\nThe Company’s business reporting groups reflect the clients served in each market and the way it manages its business segments. The reporting groups are SMB Solutions; Enterprise Business Solutions; and Digital Commerce Solutions. The results for each segment within the group may not equal the subtotals for the group due to rounding.\nSMB Solutions offers mailing and office shipping solutions, financing, services, and supplies for small and medium businesses to help simplify and save on the sending, tracking and receiving of letters, parcels and flats. This group includes the North America Mailing and International Mailing segments.\nEnterprise Business Solutions includes the Production Mail and Presort Services segments. Production Mail provides mailing and printing equipment and services for large enterprise clients to process mail. Presort Services provides sortation services to qualify large mail and parcel volumes for postal worksharing discounts.\nDigital Commerce Solutions includes the Software Solutions and Global Ecommerce segments. Software Solutions provide customer engagement, customer information and location intelligence software. Global Ecommerce facilitates global cross-border ecommerce transactions and domestic retail and ecommerce shipping solutions, including fulfillment and returns.\nSMB Solutions Group\n($ millions) Fourth Quarter Revenue 2017\n2016\nY/Y\nReported\nY/Y\nEx Currency\nNorth America Mailing $340 $363 (6%) (7%) International Mailing 102\n102\n(1%)\n(7%)\nSMB Solutions $441 $465 (5%) (7%) EBIT North America Mailing $128\n$143 (11%) International Mailing 12\n12\n2%\nSMB Solutions $140 $155 (10%)\nNorth America Mailing\nEquipment sales grew largely due to performance of the new SendPro C-Series product, but was partially offset by lower tabletop inserter sales. Recurring revenue streams declined, largely around financing, rentals and service revenues. EBIT margin was lower than prior year largely due to the decline in recurring revenue streams.\nInternational Mailing\nRevenue declined primarily due to lower equipment sales. Equipment sales declined in the UK and the Nordics and was partially offset by growth in Australia and Japan. EBIT margin increased slightly from prior year due to lower expenses.\nEnterprise Business Solutions Group\n($ millions) Fourth Quarter Revenue 2017\n2016\nY/Y\nReported\nY/Y\nEx Currency\nProduction Mail $128 $115 11% 8% Presort Services 128\n118\n8%\n8%\nEnterprise Business $256 $233 10% 8% EBIT Production Mail $19 $19 2% Presort Services 28\n26\n8%\nEnterprise Business $47 $45 6%\nProduction Mail\nEquipment sales grew double-digits versus prior year largely due to higher print and sorter equipment placements. EBIT margin declined from prior year primarily as a result of the mix of products within equipment sales.\nPresort Services\nRevenue growth was driven by improved revenue per piece along with higher First Class mail, parcel and flats volumes processed, but partly offset by lower Standard Class mail volumes processed. EBIT margin was relatively flat to prior year.\nDigital Commerce Solutions Group\n($ millions) Fourth Quarter Revenue 2017\n2016\nY/Y\nReported\nY/Y\nEx Currency\nSoftware Solutions $88 $91 (3%) (5%) Global Ecommerce 263\n98\n169%\n168%\nDigital Commerce $352 $189 86% 84% EBIT Software Solutions $10 $12 (15%) Global Ecommerce -\n6\n(100%)\nDigital Commerce $10 $18 (42%)\nSoftware Solutions\nRevenue declined driven by lower license and service revenues, but was partially offset by growth in SaaS and data revenues. The decline in license revenue was primarily in Location Intelligence and Customer Information Management and partially offset by growth in Customer Engagement Solutions. The indirect channel continued to show growth. EBIT margin decreased from prior year largely driven by the lower revenue.\nGlobal Ecommerce\nResults included a full quarter of revenue from Newgistics. Newgistics exceeded expectations on volumes processed in the quarter and delivered strong revenue growth over its prior year results.\nExcluding Newgistics, the segment continued to generate double-digit revenue growth, which was driven by strong performance in both cross border retail and marketplace volumes along with domestic shipping. The domestic shipping increase is driven by Complete™ Delivery, which is an end-to-end carrier service enabled by the Company’s shipping API’s. EBIT margin declined from prior year largely due to investments in market growth opportunities as well as the amortization of acquisition-related intangible assets.\n2018 Guidance\nThe Company expects for the full year 2018:\nRevenue, on a constant currency basis, to be in the range of 9 percent to 13 percent growth, when compared to 2017. Adjusted EPS to be in the range of $1.40 to $1.55. Free cash flow to be in the range of $350 million to $400 million.\nAs a result of the Tax Legislation, the Company expects its annual tax rate on adjusted earnings to be in the range of 23 percent to 27 percent, or relatively flat to 2017. In addition to the lower tax rate, the Company also expects to repatriate cash and will use the cash to pay down debt.\nThe impact of Tax Legislation consists of preliminary estimates and is subject to change. Information regarding the impact of Tax Legislation is based on current calculations and interpretations, as well as assumptions and expectations relating to Tax Legislation, which are subject to further guidance and change.\nThis guidance discusses future results, which are inherently subject to unforeseen risks and developments. As such, discussions about the business outlook should be read in the context of an uncertain future, as well as the risk factors identified in the safe harbor language at the end of this release and as more fully outlined in the Company's 2016 Form 10-K Annual Report and other reports filed with the Securities and Exchange Commission.\nThis guidance excludes any unusual items that may occur or additional portfolio or restructuring actions, not specifically identified, as the Company implements plans to further streamline its operations and reduce costs. Revenue guidance is provided on a constant currency basis. The Company cannot reasonably predict the impact that future changes in currency exchange rates will have on revenue and net income. Additionally, the Company cannot provide GAAP EPS and GAAP cash from operations guidance due to the uncertainty of future potential restructurings, goodwill and asset write-downs, unusual tax settlements or payments and contributions to its pension funds, acquisitions, divestitures and other potential adjustments, which could (individually or in the aggregate) have a material impact on the Company’s performance. The Company’s guidance is based on an assumption that the global economy and foreign exchange markets in 2018 will not change significantly.\nReview of Strategic Alternatives\nThe Pitney Bowes Board of Directors, together with management, continues to explore and evaluate strategic alternatives to further enhance shareholder value. The Board has not set a timetable for the process nor has it made any decisions related to any strategic alternatives at this time. There can be no assurance that the exploration of strategic alternatives will result in any particular outcome. The Company does not intend to provide updates unless or until it determines that further disclosure is appropriate or necessary.\nConference Call and Webcast\nManagement of Pitney Bowes will discuss the Company’s results in a broadcast over the Internet today at 8:00 a.m. ET. Instructions for listening to the earnings results via the Web are available on the Investor Relations page of the Company’s web site at www.pitneybowes.com .\nAbout Pitney Bowes\nPitney Bowes (NYSE:PBI) is a global technology company powering billions of transactions – physical and digital – in the connected and borderless world of commerce. Clients around the world, including 90 percent of the Fortune 500, rely on products, solutions, services and data from Pitney Bowes in the areas of customer information management, location intelligence, customer engagement, shipping, mailing, and global ecommerce. And with the innovative Pitney Bowes Commerce Cloud, clients can access the broad range of Pitney Bowes solutions, analytics, and APIs to drive commerce. For additional information visit Pitney Bowes, the Craftsmen of Commerce, at www.pitneybowes.com .\nUse of Non-GAAP Measures\nThe Company's financial results are reported in accordance with generally accepted accounting principles (GAAP); however, in our disclosures we use certain non-GAAP measures, such as adjusted earnings before interest and taxes, Adjusted EPS, revenue growth on a constant currency basis, free cash flow and Segment EBIT.\nThe Company reports measures such as adjusted earnings before interest and taxes (EBIT) and Adjusted EPS and adjusted net income to exclude the impact of special items like restructuring charges, tax adjustments, goodwill and asset write-downs, and costs related to dispositions and acquisitions. While these are actual Company expenses, they can mask underlying trends associated with its business. Such items are often inconsistent in amount and frequency and as such, the adjustments allow an investor greater insight into the current underlying operating trends of the business.\nIn addition, revenue growth is presented on a constant currency basis to exclude the impact of changes in foreign currency exchange rates since the prior period under comparison. Constant currency measures are intended to help investors better understand the underlying operational performance of the business excluding the impacts of shifts in currency exchange rates over the period. Constant currency is calculated by converting our current quarter reported results using the prior year’s exchange rate for the comparable quarter. This comparison allows an investor insight into the underlying revenue performance of the business and true operational performance from a comparable basis to prior period. A reconciliation of reported revenue to constant currency revenue can be found in the Company’s attached financial schedules.\nThe Company reports free cash flow in order to provide investors insight into the amount of cash that management could have available for other discretionary uses. Free cash flow adjusts GAAP cash from operations for capital expenditures, restructuring payments, unusual tax settlements, contributions to the Company’s pension fund and cash used for other special items. A reconciliation of GAAP cash from operations to free cash flow can be found in the Company’s attached financial schedules.\nIn addition, Management uses segment EBIT to measure profitability and performance at the segment level. Segment EBIT is determined by deducting from revenue the related costs and expenses attributable to the segment. Segment EBIT excludes interest, taxes, general corporate expenses not allocated to a particular business segment, restructuring charges and goodwill and asset impairments, which are recognized on a consolidated basis. A reconciliation of Segment EBIT to the Company’s total Net Income can be found in the Company’s attached financial schedules.\nPitney Bowes has provided a quantitative reconciliation to GAAP in supplemental schedules. This information may also be found at the Company's web site www.pb.com/investorrelations\nThis document contains “forward-looking statements” about the Company’s expected or potential future business and financial performance. Forward-looking statements include, but are not limited to, statements about its future revenue and earnings guidance and other statements about future events or conditions, including statements about the potential outcome of the Board’s exploration of strategic alternatives and the impact of Tax Legislation. Forward-looking statements are not guarantees of future performance and involve risks and uncertainties that could cause actual results to differ materially from those projected. These risks and uncertainties include, but are not limited to: declining physical mail volumes; competitive factors, including pricing pressures, technological developments, the introduction of new products and services by competitors, and fuel prices; our success in developing new products and services, including digital-based products and services, obtaining regulatory approvals, if needed, of new products, and the market’s acceptance of these new products and services; our ability to fully utilize the enterprise business platform in North America, and successfully deploy it in major international markets without significant disruptions to existing operations; a breach of security, including a cyberattack or other comparable event; the continued availability and security of key information technology systems and the cost to comply with information security requirements and privacy laws; changes in postal or banking regulations; changes in, or loss of, our contractual relationships with the United States Postal Service; the risk of losing large clients in the Global Ecommerce segment; macroeconomic factors, including global and regional business conditions that adversely impact customer demand, foreign currency exchange rates, interest rates and labor conditions; capital market disruptions or credit rating downgrades that adversely impact our ability to access capital markets at reasonable costs; management of outsourcing arrangements; integrating newly acquired businesses, including operations and product and service offerings; management of customer credit risk; any potential impact from the announcement that the Board is conducting a review of strategic alternatives and other factors beyond its control as more fully outlined in the Company's 2016 Form 10-K Annual Report and other reports filed with the Securities and Exchange Commission. Pitney Bowes assumes no obligation to update any forward-looking statements contained in this document as a result of new information, events or developments.\nNote: Consolidated statements of income; revenue and EBIT by business segment; and reconciliation of GAAP to non-GAAP measures for the three months and twelve months ended December 31, 2017 and 2016, and consolidated balance sheets as of December 31, 2017 and December 31, 2016 are attached.\nPitney Bowes Inc. Consolidated Statements of Income (Unaudited; in thousands, except share and per share amounts) Three months ended December 31, Twelve months ended December 31, 2017 2016 2017 2016 Revenue: Equipment sales $ 200,555 $ 190,306 $ 679,803 $ 675,451 Supplies 64,482 64,051 252,824 262,682 Software 88,464 90,901 352,595 348,661 Rentals 94,578 103,032 386,348 412,738 Financing 80,834 89,632 331,416 366,547 Support services 123,911 129,188 478,536 512,820 Business services 396,293 219,959 1,068,426 827,676 Total revenue 1,049,117 887,069 3,549,948 3,406,575 Costs and expenses: Cost of equipment sales 108,347 96,201 340,745 331,942 Cost of supplies 22,785 20,758 82,992 81,420 Cost of software 26,153 26,345 101,969 105,841 Cost of rentals 21,214 21,089 84,270 76,040 Financing interest expense 12,219 13,866 50,665 55,241 Cost of support services 71,744 70,895 288,976 295,685 Cost of business services 302,162 151,152 773,052 568,509 Selling, general and administrative 329,570 283,882 1,237,739 1,200,327 Research and development 32,896 31,545 129,767 121,306 Goodwill impairment - 171,092 - 171,092 Restructuring charges and asset impairments, net 28,929 13,793 59,431 63,296 Interest expense, net 31,620 26,576 113,497 88,970 Other expense, net 3,856 - 3,856 536 Total costs and expenses 991,495 927,194 3,266,959 3,160,205 Income (loss) before income taxes 57,622 (40,125 ) 282,989 246,370 (Benefit) provision for income taxes (32,326 ) 38,204 21,649 131,819 Income (loss) from continuing operations 89,948 (78,329 ) 261,340 114,551 Loss from discontinued operations, net of tax - (750 ) - (2,701 ) Net income (loss) 89,948 (79,079 ) 261,340 111,850 Less: Preferred stock dividends attributable to noncontrolling interests - 5,264 - 19,045 Net income (loss) - Pitney Bowes Inc. $ 89,948 $ (84,343 ) $ 261,340 $ 92,805 Amounts attributable to common stockholders: Net income (loss) from continuing operations $ 89,948 $ (83,593 ) $ 261,340 $ 95,506 Loss from discontinued operations, net of tax - (750 ) - (2,701 ) Net income (loss) - Pitney Bowes Inc. $ 89,948 $ (84,343 ) $ 261,340 $ 92,805 Basic earnings (loss) per share attributable to common stockholders (1) : Continuing operations $ 0.48 $ (0.45 ) $ 1.40 $ 0.51 Discontinued operations - - - (0.01 ) Net income (loss) - Pitney Bowes Inc. $ 0.48 $ (0.45 ) $ 1.40 $ 0.49 Diluted earnings (loss) per share attributable to common stockholders (1) : Continuing operations $ 0.48 $ (0.45 ) $ 1.39 $ 0.51 Discontinued operations - - - (0.01 ) Net income (loss) - Pitney Bowes Inc. $ 0.48 $ (0.45 ) $ 1.39 $ 0.49 Weighted-average shares used in diluted earnings per share 188,046,578 185,645,814 187,435,080 188,975,198\n(1)\nThe sum of the earnings per share amounts may not equal the totals due to rounding.\nPitney Bowes Inc. Consolidated Balance Sheets (Unaudited; in thousands, except share amounts) Assets\nDecember 31, 2017\nDecember 31, 2016\nCurrent assets: Cash and cash equivalents $ 1,009,021 $ 764,522 Short-term investments 48,988 38,448 Accounts receivable, net 524,424 455,527 Short-term finance receivables, net 828,003 893,950 Inventories 89,679 92,726 Current income taxes 58,439 11,373 Other current assets and prepayments 77,954 68,637 Total current assets 2,636,508 2,325,183 Property, plant and equipment, net 379,044 314,603 Rental property and equipment, net 185,741 188,054 Long-term finance receivables, net 652,087 673,207 Goodwill 1,952,444 1,571,335 Intangible assets, net 272,186 165,172 Noncurrent income taxes 59,909 74,806 Other assets 540,796 524,773 Total assets $ 6,678,715 $ 5,837,133 Liabilities and stockholders' equity (deficit)\nCurrent liabilities: Accounts payable and accrued liabilities $ 1,487,575 $ 1,378,822 Current income taxes 8,823 34,434 Current portion of long-term debt 271,057 614,485 Advance billings 288,372 299,878 Total current liabilities 2,055,827 2,327,619 Deferred taxes on income 236,974 204,289 Tax uncertainties and other income tax liabilities 116,551 61,276 Long-term debt 3,559,278 2,750,405 Other noncurrent liabilities 515,549 597,204 Total liabilities 6,484,179 5,940,793 Stockholders' equity (deficit): Cumulative preferred stock, $50 par value, 4% convertible 1 1 Cumulative preference stock, no par value, $2.12 convertible 441 483 Common stock, $1 par value 323,338 323,338 Additional paid-in-capital 138,367 148,125 Retained earnings 5,229,584 5,107,734 Accumulated other comprehensive loss (786,198 ) (940,133 ) Treasury stock, at cost (4,710,997 ) (4,743,208 ) Total Pitney Bowes Inc. stockholders' equity (deficit) 194,536 (103,660 ) Total liabilities and stockholders' equity (deficit) $ 6,678,715 $ 5,837,133\nPitney Bowes Inc.\nBusiness Segments - Revenue and EBIT\n(Unaudited; in thousands)\nThree months ended December 31,\nTwelve months ended December 31, 2017 2016 (1)\n% Change 2017 2016 (1)\n% Change Revenue\nNorth America Mailing $ 339,921 $ 362,638 (6 %) $ 1,356,561 $ 1,427,094 (5 %) International Mailing 101,520 102,345 (1 %) 383,670 411,642 (7 %) Small & Medium Business Solutions 441,441 464,983 (5 %) 1,740,231 1,838,736 (5 %) Production Mail 128,282 115,054 11 % 407,194 404,703 1 % Presort Services 127,698 118,368 8 % 497,901 475,582 5 % Enterprise Business Solutions 255,980 233,422 10 % 905,095 880,285 3 % Software Solutions 88,293 90,817 (3 %) 352,380 348,234 1 % Global Ecommerce 263,403 97,847 >100%\n552,242 339,320 63 % Digital Commerce Solutions 351,696 188,664 86 % 904,622 687,554 32 % Total revenue $ 1,049,117 $ 887,069 18 % $ 3,549,948 $ 3,406,575 4 % EBIT\nNorth America Mailing $ 128,147 $ 143,282 (11 %) $ 497,809 $ 592,978 (16 %) International Mailing 12,197 11,964 2 % 48,164 44,806 7 % Small & Medium Business Solutions 140,344 155,246 (10 %) 545,973 637,784 (14 %) Production Mail 18,998 18,627 2 % 50,513 54,061 (7 %) Presort Services 28,045 25,953 8 % 97,506 95,258 2 % Enterprise Business Solutions 47,043 44,580 6 % 148,019 149,319 (1 %) Software Solutions 10,419 12,251 (15 %) 41,635 30,159 38 % Global Ecommerce (5 ) 5,651 (100 %) (17,899 ) 3,043 >(100%) Digital Commerce Solutions 10,414 17,902 (42 %) 23,736 33,202 (29 %) Segment EBIT (2) $ 197,801 $ 217,728 (9 %) $ 717,728 $ 820,305 (13 %) Reconciliation of segment EBIT to net income (loss) Segment EBIT $ 197,801 $ 217,728 $ 717,728 $ 820,305 Corporate expenses (60,073 ) (30,679 ) (204,211 ) (189,215 ) Adjusted EBIT 137,728 187,049 513,517 631,090 Interest, net (3) (43,839 ) (40,442 ) (164,162 ) (144,211 ) Goodwill impairment - (171,092 ) - (171,092 ) Restructuring charges and asset impairments, net (28,929 ) (13,793 ) (59,431 ) (63,296 ) Loss on extinguishment of debt (3,856 ) - (3,856 ) - Impact of divestiture transactions - (1,847 ) - (6,121 ) Transaction costs (3,482 ) - (9,164 ) - Gain on sale of technology - - 6,085 - Income (loss) before income taxes 57,622 (40,125 ) 282,989 246,370 Benefit (provision) for income taxes 32,326 (38,204 ) (21,649 ) (131,819 ) Income (loss) from continuing operations 89,948 (78,329 ) 261,340 114,551 Loss from discontinued operations, net of tax - (750 ) - (2,701 ) Net income (loss) $ 89,948 $ (79,079 ) $ 261,340 $ 111,850\n(1) Prior period amounts have been recast to conform to the current year presentation. (2) Segment EBIT excludes interest, taxes, general corporate expenses, restructuring charges, and other items that are not allocated to a particular business segment. (3) Includes financing interest expense and interest expense, net. Pitney Bowes Inc. Reconciliation of Reported Consolidated Results to Adjusted Results (Unaudited; in thousands, except per share amounts) Three months ended December 31, Twelve months ended December 31, 2017 2016 Y/Y Chg. 2017 2016 Y/Y Chg. Reconciliation of reported revenue to revenue excluding currency Revenue, as reported $ 1,049,117 $ 887,069 $ 3,549,948 $ 3,406,575 (Favorable) unfavorable impact on revenue due to currency (14,469 ) 1,222 Revenue, excluding currency $ 1,034,648 $ 887,069 17 % $ 3,551,170 $ 3,406,575 4 % Reconciliation of reported net income (loss) to adjusted earnings Net income (loss) $ 89,948 $ (79,079 ) $ 261,340 $ 111,850 Loss from discontinued operations, net of tax - 750 - 2,701 Restructuring charges and asset impairments, net 19,599 9,945 39,671 42,343 Goodwill impairment - 169,024 - 169,024 Gain on sale of technology - - (5,605 ) - Impact of divestiture transactions - 1,194 - 4,099 Transaction costs 2,178 - 5,762 - Loss on extinguishment of debt 2,375 - 2,375 - Tax legislation (38,774 ) - (38,774 ) - Preferred stock redemption - (2,047 ) - 2,800 Net income, as adjusted 75,326 99,787 264,769 332,817 Provision for income taxes, as adjusted 18,563 46,820 84,586 154,062 Income from continuing operations before income taxes, as adjusted 93,889 146,607 349,355 486,879 Interest, net 43,839 40,442 164,162 144,211 EBIT, as adjusted 137,728 187,049 513,517 631,090 Depreciation and amortization 50,347 38,261 182,336 178,486 EBITDA, as adjusted $ 188,075 $ 225,310 $ 695,853 $ 809,576 Reconciliation of reported diluted earnings per share to adjusted diluted\nearnings (loss) per share\nDiluted earnings (loss) per share $ 0.48 $ (0.45 ) $ 1.39 $ 0.49 Loss from discontinued operations, net of tax - 0.00 - 0.01 Restructuring charges and asset impairments, net 0.10 0.05 0.21 0.22 Goodwill impairment - 0.90 - 0.89 Gain on sale of technology - - (0.03 ) - Impact of divestiture transactions - 0.01 - 0.02 Transaction costs 0.01 - 0.03 - Loss on extinguishment of debt 0.01 - 0.01 - Tax legislation (0.21 ) - (0.21 ) - Preferred stock redemption - 0.01 - 0.03 Diluted earnings per share, as adjusted $ 0.40 $ 0.53 $ 1.41 $ 1.68 Note : The sum of the earnings per share amounts may not equal the totals due to rounding. Reconciliation of reported net cash from operating activities to free cash\nflow\nNet cash provided by operating activities (1) $ 165,236 $ 199,763 $ 495,813 $ 496,122 Capital expenditures (51,428 ) (45,299 ) (170,990 ) (160,831 ) Restructuring payments 10,828 13,769 40,804 64,930 Pension contribution - - - 36,731 Reserve account deposits 13,462 (3,996 ) 10,954 (2,183 ) Other 7,396 - 7,396 335 Free cash flow $ 145,494 $ 164,237 $ 383,977 $ 435,104 (1)\nNet cash provided by operating activities for the three and twelve months ended December 31, 2016 has been revised for a new accounting standard adopted January 1, 2017.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005274/en/\nPitney Bowes Inc.\nEditorial\nBill Hughes, 203-351-6785\nChief Communications Officer\nor\nFinancial\nAdam David, 203-351-7175\nVP, Investor Relations\nSource: Pitney Bowes Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pb.com%2Finvestorrelations&esheet=51750986&newsitemid=20180131005274&lan=en-US&anchor=www.pb.com%2Finvestorrelations&index=3&md5=4670a4a13029b6b13d979e3c16f75cce", "http://www.businesswire.com/news/home/20180131005274/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pitneybowes.com&esheet=51750986&newsitemid=20180131005274&lan=en-US&anchor=www.pitneybowes.com&index=1&md5=b19d1c859e6adc906cc13d05ee148300", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pitneybowes.com&esheet=51750986&newsitemid=20180131005274&lan=en-US&anchor=www.pitneybowes.com&index=2&md5=7454124e9da38e65de5dfa2e6fbf8d1e"], "published": "2018-01-31T15:00:00.000+02:00", "crawled": "2018-01-31T15:49:00.009+02:00", "highlightTitle": ""}