{"organizations": [], "uuid": "258ebd6b2dfbc140c6c74e20aff8ff2931457c3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-cerus-corporation-announces-preliminary-product-revenue-results-for-fourth-quarter-and-full-year-2017.html", "country": "US", "domain_rank": 767, "title": "Cerus Corporation Announces Preliminary Product Revenue Results for Fourth Quarter and Full Year 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.973, "site_type": "news", "published": "2018-01-08T16:30:00.000+02:00", "replies_count": 0, "uuid": "258ebd6b2dfbc140c6c74e20aff8ff2931457c3f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-cerus-corporation-announces-preliminary-product-revenue-results-for-fourth-quarter-and-full-year-2017.html", "ord_in_thread": 0, "title": "Cerus Corporation Announces Preliminary Product Revenue Results for Fourth Quarter and Full Year 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "concord", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "cerus corporation announces preliminary product revenue results", "sentiment": "negative"}, {"name": "cerus", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "cerus corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Record preliminary product revenue reported along with expected strong 2018 growth\nCONCORD, Calif.--(BUSINESS WIRE)-- Cerus Corporation (NASDAQ: CERS) today announced unaudited preliminary product revenue for the fourth quarter and full year 2017 and provided 2018 product revenue guidance.\nCerus’ unaudited preliminary product revenue for the fourth quarter of 2017 was $16.2 million, an increase of 60% compared to fourth quarter of 2016. Driving the growth was an increase in global demand for INTERCEPT platelet kits of more than 100%. Preliminary results in the quarter reflect the initial rollout for broad use of the INTERCEPT Blood Systems for platelets in France. Based on the fourth quarter unaudited preliminary product revenue, the Company expects full year 2017 product revenue to be $43.6 million, representing an increase of 17% compared to prior year product revenue. The preliminary product revenue results reported have not been audited and are subject to change.\n“Preliminary fourth quarter sales results exceeded our expectations and would mark the highest quarterly product revenue ever reported by Cerus. We finished 2017 on a solid note and look forward to building on this success throughout 2018,” said William ‘Obi’ Greenman, Cerus’ president and chief executive officer.\n“As we enter 2018, we are excited to expand patient access to INTERCEPT across the EMEA markets, to continue to drive U.S. product adoption, and to expand our INTERCEPT commercial portfolio with the anticipated CE Mark submission for red cells and the progress on our planned cryoprecipitate PMA supplement submission. We anticipate 2018 product revenue to be in the range of $51 million to $53 million, representing 17 to 22% growth,” continued Greenman.\nCerus will provide complete fourth quarter and full year 2017 financial results and host a call in early March.\nABOUT CERUS\nCerus Corporation is a biomedical products company focused in the field of blood transfusion safety. The INTERCEPT Blood System is designed to reduce the risk of transfusion-transmitted infections by inactivating a broad range of pathogens such as viruses, bacteria and parasites that may be present in donated blood. The nucleic acid targeting mechanism of action of the INTERCEPT treatment is designed to inactivate established transfusion threats, such as hepatitis B and C, HIV, West Nile virus and bacteria, as well as emerging pathogens such as chikungunya, malaria and dengue. Cerus currently markets and sells the INTERCEPT Blood System for both platelets and plasma in the United States, Europe, the Commonwealth of Independent States, the Middle East and selected countries in other regions around the world. The INTERCEPT Red Blood Cell system is in clinical development. See http://www.cerus.com for information about Cerus.\nINTERCEPT and the INTERCEPT Blood System are trademarks of Cerus Corporation.\nForward Looking Statements\nExcept for the historical statements contained herein, this press release contains forward-looking statements concerning Cerus’ products, prospects and expected results, including statements relating to Cerus’ expected product revenue for the fourth quarter and year ended December 31, 2017; Cerus’ expectation of expanding patient access to INTERCEPT across the EMEA markets and continuing to drive U.S. product adoption; Cerus‘ planned INTERCEPT red blood cell CE Mark submission; anticipated progress with Cerus’ planned cryoprecipitate PMA supplement submission; Cerus’ anticipated 2018 annual product revenue; and other statements that are not historical fact. Actual results could differ materially from these forward-looking statements as a result of certain factors, including, without limitation: risks related to preliminary financial results, including the risks (a) that the preliminary financial results reported in this press release only reflect information available to Cerus at this time and may differ from actual results, (b) that the preliminary financial results reported in this press release have not been reviewed or audited by Cerus’ independent registered public accounting firm, which independent registered public accounting firm has not expressed any opinion or any other form of assurance with respect to such preliminary financial results, and (c) that there can be no assurance that Cerus’ actual financial results for the periods presented in this press release will not differ from the preliminary financial results presented in this press release and such differences could be material; risks associated with the commercialization and market acceptance of, and customer demand for, the INTERCEPT Blood System, including the risks that Cerus may not (a) meet its annual revenue guidance for 2018, (b) grow sales in its EMEA and other major international markets, and/or (c) realize meaningful revenue contributions from U.S. customers in the near term or at all, particularly since Cerus cannot guarantee the volume or timing of commercial purchases, if any, that its U.S. customers may make under Cerus’ commercial agreements with these customers; risks associated with Cerus’ lack of commercialization experience in the United States and its ability to develop and maintain an effective and qualified U.S.-based commercial organization, as well as the resulting uncertainty of its ability to achieve market acceptance of and otherwise successfully commercialize the INTERCEPT Blood System for platelets and plasma in the United States, including as a result of licensure requirements that must be satisfied by U.S. customers prior to their engaging in interstate transport of blood components processed using the INTERCEPT Blood System; risks related to Fresenius Kabi’s efforts to assure an uninterrupted supply of platelet additive solution (PAS); risks related to how any future PAS supply disruption could affect INTERCEPT’s acceptance in the marketplace; risks related to how any future PAS supply disruption might affect current commercial contracts; risks related to Cerus’ ability to commercialize the INTERCEPT Blood System in the United States without infringing on the intellectual property rights of others; risks related to Cerus’ ability to demonstrate to the transfusion medicine community and other health care constituencies that pathogen reduction and the INTERCEPT Blood System is safe, effective and economical; the uncertain and time-consuming development and regulatory process, including the risks (a) that Cerus may be unable to comply with the FDA’s post-approval requirements for the INTERCEPT platelet and plasma systems, including by successfully completing required post-approval studies, which could result in a loss of U.S. marketing approval for the INTERCEPT platelet and/or plasma systems, (b) related to Cerus’ ability to expand the label claims and product configurations for the INTERCEPT platelet and plasma systems in the United States, which will require additional regulatory approvals, (c) related to unanticipated difficulties in meeting the planned cryoprec", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cerus.com&esheet=51739081&newsitemid=20180108005478&lan=en-US&anchor=http%3A%2F%2Fwww.cerus.com&index=1&md5=fc395f8dadc455a6c9454e7a8cc213f1", "http://www.businesswire.com/news/home/20180108005478/en/"], "published": "2018-01-08T16:30:00.000+02:00", "crawled": "2018-01-08T19:38:13.000+02:00", "highlightTitle": ""}