{"organizations": [], "uuid": "62048319dcb72680521f8c01e085f8542e484142", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-doug-wenners-joins-privia-health-at-the-helm-as-acting-ceo.html", "country": "US", "domain_rank": 767, "title": "Doug Wenners Joins Privia Health at the Helm as Acting CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.805, "site_type": "news", "published": "2018-01-05T00:30:00.000+02:00", "replies_count": 0, "uuid": "62048319dcb72680521f8c01e085f8542e484142"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-doug-wenners-joins-privia-health-at-the-helm-as-acting-ceo.html", "ord_in_thread": 0, "title": "Doug Wenners Joins Privia Health at the Helm as Acting CEO", "locations": [], "entities": {"persons": [{"name": "doug", "sentiment": "negative"}, {"name": "bill sullivan", "sentiment": "none"}, {"name": "dou", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "arlington", "sentiment": "none"}, {"name": "privia", "sentiment": "none"}], "organizations": [{"name": "privia health", "sentiment": "negative"}, {"name": "doug wenners joins privia health", "sentiment": "negative"}, {"name": "wenners", "sentiment": "none"}, {"name": "anthem", "sentiment": "none"}, {"name": "dartmouth college", "sentiment": "none"}, {"name": "senior executive for anthem, inc.", "sentiment": "none"}, {"name": "dartmouth institute", "sentiment": "none"}, {"name": "brighton health group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ARLINGTON, Va., Jan. 4, 2018 /PRNewswire/ -- Privia Health, LLC (\"Privia\") announced today that Doug Wenners, Executive Vice President of Brighton Health Group and former Senior Executive for Anthem, Inc., has assumed the role of acting Chief Executive Officer for Privia Health. Wenners will lead the company in its next phase of growth partnership with the doctors and patients that they serve, with a focus on optimizing patient outcomes.\nWenners brings a depth of experience from different facets of healthcare and is a nationally recognized leader in value-based payment and payer/provider partnership models. At Anthem, Wenners led the design and implementation of the largest commercial pay-for-value program in the country. He is also a graduate of The Dartmouth Institute at Dartmouth College, making him an internationally recognized leader in health outcomes research and policy.\n\"Doug is the right leader to guide Privia during this transformative period in the company's evolution and during this pivotal moment in healthcare,\" said Bill Sullivan, Chairman of Brighton Health Group. \"Doug's experience, vision, passion and human-centered leadership approach to the culture and mission will strengthen Privia as a driving force in changing healthcare for the better.\"\nAs Privia has just surpassed its four-year milestone, it is in an advantageous position to accelerate its proven model of physician partnership and patient care to more providers across markets, continuing its rapid growth nationwide. In recent months, Privia has launched virtual visit capabilities to improve patient access and has plans to launch several new clinical innovations in 2018.\n\"As a 25-year survivor of Hodgkin's Disease, driving positive change in healthcare is a lifelong passion that is extremely personal to me,\" said Wenners. \"I am honored to lead a company that is a national leader in quality, innovation and thought-leadership within the healthcare industry. I am committed to the success of Privia, its physicians, and the patients we serve, and I believe that our best days as a company are ahead of us.\"\nAbout Privia Health\nPrivia Health LLC, based in Arlington, VA, is a national physician practice management and population health technology company that partners with leading doctors to keep people healthy, better manage disease, and to reward providers for delivering high value care. Through its high-performance physician groups, accountable care organizations (Privia Quality Network), and population health management programs, Privia works in close partnership with forward-thinking health plans, national payers, and employees to better align reimbursements to quality and outcomes. Privia's proprietary technology platform, combined with an innovative approach to patient engagement and physician-driven wellness, focuses on building a better healthcare delivery system and a healthier patient population. For More Information: www.priviahealth.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/doug-wenners-joins-privia-health-at-the-helm-as-acting-ceo-300577909.html\nSOURCE Privia Health, LLC", "external_links": ["http://www.priviahealth.com/", "http://www.prnewswire.com/news-releases/doug-wenners-joins-privia-health-at-the-helm-as-acting-ceo-300577909.html"], "published": "2018-01-05T00:30:00.000+02:00", "crawled": "2018-01-05T01:21:48.018+02:00", "highlightTitle": ""}