{"organizations": [], "uuid": "3d7fa54fbddcd69d07a83fe1fbc53c2a2e552dc3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221742019&w=1200&r=LYNXMPEE0C0I1", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-wrap/hammers-thrash-huddersfield-chelsea-draw-again-idUKKBN1F20RG", "country": "US", "domain_rank": 408, "title": "Hammers thrash Huddersfield; Chelsea draw again", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T20:01:00.000+02:00", "replies_count": 0, "uuid": "3d7fa54fbddcd69d07a83fe1fbc53c2a2e552dc3"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-wrap/hammers-thrash-huddersfield-chelsea-draw-again-idUKKBN1F20RG", "ord_in_thread": 0, "title": "Hammers thrash Huddersfield; Chelsea draw again", "locations": [], "entities": {"persons": [{"name": "chelsea", "sentiment": "negative"}, {"name": "john smith", "sentiment": "none"}, {"name": "scot", "sentiment": "none"}, {"name": "david moyes", "sentiment": "none"}, {"name": "neil robinson", "sentiment": "none"}, {"name": "manuel lanzini", "sentiment": "none"}], "locations": [{"name": "leicester city", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "chelsea", "sentiment": "negative"}, {"name": "huddersfield", "sentiment": "negative"}, {"name": "hammers", "sentiment": "negative"}, {"name": "crystal palace", "sentiment": "none"}, {"name": "huddersfield town vs west ham united", "sentiment": "none"}, {"name": "west ham", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "west ham united", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "burnley", "sentiment": "none"}, {"name": "huddersfield town", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 6:07 PM / Updated 9 minutes ago Kane at the double as Spurs rout Everton; Chelsea only draw Neil Robinson 4 Min Read \nLONDON (Reuters) - Harry Kane continued his rich scoring streak by netting twice in Tottenham Hotspur’s 4-0 win over Everton at Wembley as Mauricio Pochettino’s side made up ground on third-placed Chelsea who shared a goalless draw with 10-man Leicester City. Soccer Football - Premier League - Tottenham Hotspur vs Everton - Wembley Stadium, London, Britain - January 13, 2018 Tottenham's Harry Kane scores their third goal REUTERS/Eddie Keogh \nFor a while, it looked as if Kane might be outshone by his team mate Son Heung-min, who scored in a home game for the fifth successive time. \nThen Kane took over to net in the 47th and 59th minutes to take his season’s league tally to 20, the fourth consecutive campaign he has reached the landmark. \nChristian Eriksen rounded off a cleverly worked team move, again featuring Son, for Spurs’ fourth as Everton crashed to their heaviest defeat under Sam Allardyce, who gave a debut to 27 million pound ($37 million) new signing Cenk Tosun. \nWith three of the top four not playing, fifth-placed Tottenham moved level with Liverpool on 44 points, three behind Chelsea. Antonio Conte’s side missed the chance to go second as Leicester hung on for a draw at Stamford Bridge despite the 68th-minute dismissal of Ben Chilwell. \nIt was the third successive game in all competitions that Chelsea failed to score, with striker Alvaro Morata looking frustrated and short of confidence. \nManager Conte believes they are paying the price for playing seven games in three weeks, with no let-up in prospect as they contest four competitions. “I think I saw a lot of very tired players,” Conte said. \nElsewhere, there were more controversial refereeing decisions as English football continued to debate whether the video assistant referee (VAR) system, which was tested in some cup games last week, would benefit the Premier League. \nThe first flashpoint occurred at Vicarage Road where TV replays revealed Watford’s Abdoulaye Doucoure bundled the ball over the line with his right hand in the 2-2 draw with Southampton. \nA seventh Premier League defeat in eight games had looked likely for Marco Silva’s side after James Ward-Prowse scored twice but Andre Gray set up a thrilling finale before Doucoure’s contribution led to furious Southampton protests. Soccer Football - Premier League - Huddersfield Town vs West Ham United - John Smith’s Stadium, Huddersfield, Britain - January 13, 2018 West Ham United's Manuel Lanzini celebrates scoring their fourth goal Action Images via Reuters/Jason Cairnduff \n“We can do nothing now,” said Southampton manager Mauricio Pellegrino diplomatically. However, Watford striker Troy Deeney admitted that had the VAR system been in operation “we probably wouldn’t have got it”. \nAt Newcastle United, bottom side Swansea City believed they were unlucky not to be awarded a penalty when Mohamed Diame appeared to handle the ball. \nSwansea manager Carlos Carvalhal said: My assistant says that it’s a very clear penalty and a red card also, but what can we do? Nothing, only talk about this. This is one of the situations VAR will in the future say clear penalty – it will be clear.” HAPPY HAMMERS Slideshow (7 Images) \nThere was nothing controversial about West Ham United’s 4-1 destruction of Huddersfield Town, a victory that puts the Hammers 11th in the table. \nWhen David Moyes took over as West Ham manager many observers questioned his ability to get the team scoring again. But the Scot has proved all the doubters wrong with the London side scoring 12 goals from his past five league games in charge. \nA Manuel Lanzini double plus strikes from Mark Noble and the impressive Marko Arnautovic gave the visitors a comfortable victory that took them above Huddersfield, for whom Joe Lolley scored and new 14 million pound ($19.2 million) signing Alex Pritchard came on as a substitute. \nThe win was Moyes’ 200th in the Premier League, a landmark reached by only three other managers. \nAt Selhurst Park, Crystal Palace’s revival under Roy Hodgson continued with a hard-fought 1-0 victory over Burnley which moved them five points above the relegation zone. \nAlan Pardew was another manager breathing easier after West Bromwich Albion beat Brighton & Hove Albion 2-0 to record their first win in 21 league games and his first in nine as their manager. \nBoth Albion goals came via headers from Chris Brunt corners, with Jonny Evans and Craig Dawson rising above Brighton’s defence. Reporting by Neil Robinson; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-13T20:01:00.000+02:00", "crawled": "2018-01-13T20:31:59.001+02:00", "highlightTitle": ""}