{"organizations": [], "uuid": "2b53a8ed10f25afb8f55c4d3148faa5cd067565e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/08/reuters-america-update-2-u-s-plan-to-aid-coal-nuclear-rejected-in-setback-for-trump.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-U.S. plan to aid coal, nuclear rejected in setback for Trump", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T01:19:00.000+02:00", "replies_count": 0, "uuid": "2b53a8ed10f25afb8f55c4d3148faa5cd067565e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/08/reuters-america-update-2-u-s-plan-to-aid-coal-nuclear-rejected-in-setback-for-trump.html", "ord_in_thread": 0, "title": "UPDATE 2-U.S. plan to aid coal, nuclear rejected in setback for Trump", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "perry", "sentiment": "none"}, {"name": "donald tru", "sentiment": "none"}, {"name": "rick perry", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuter", "sentiment": "negative"}, {"name": "federal energy regulatory commission", "sentiment": "none"}, {"name": "ferc", "sentiment": "none"}, {"name": "energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts with reaction from coal and renewable energy groups; adds quotes)\nWASHINGTON, Jan 8 (Reuters) - The U.S. power grid regulator on Monday rejected a directive by Energy Secretary Rick Perry to prop up aging coal and nuclear power plants, in a setback for the Trump administration that disappointed coal miners but pleased drillers, environmentalists and renewable energy advocates.\nPerry had directed the Federal Energy Regulatory Commission in September to consider a plan subsidizing those plants for what he said were their contributions in making the power grid more reliable and resilient.\nFERC said in its ruling that such subsidies may not be fair. \"The record ... does not demonstrate that such an outcome would be just and reasonable,\" the agency said in the filing. FERC said it had embarked on a new process to determine whether the grid can be strengthened.\nThe move was a blow to Perry who wanted FERC to reward certain nuclear and coal-fired power plants that store 90 days of fuel on site by paying for their operating costs through power price adjustments.\nPresident Donald Trump promised to aid the coal and nuclear industries, which have suffered shutdowns resulting from a glut of cheap natural gas.\nFERC's new plan involves asking grid operators to submit within 60 days their concerns about the resiliency of the power system. The commission will then decide whether additional action is warranted, FERC said.\nPerry's directive came under harsh criticism by an unusual combination of natural gas, drilling, and wind and solar power interests who said it could hurt their industries and stifle innovation to improve power plants and the grid. The critics said the vast majority of power outages have been caused by problems with power lines, not at utilities themselves.\nConsumer interests also slammed Perry's plan, saying it would have spiked power bills for homeowners and businesses.\nSPARKED NATIONAL CONVERSATION\nSome coal companies, including Peabody Energy Corp and privately held Murray Energy Corp, have lobbied the Trump administration to make policy changes as low natural gas prices and regulations cut into their profits.\nHal Quinn, president of the National Mining Association, said FERC's decision represented a \"disappointing lack of action,\" especially as it came during a week of severe cold weather across the country. \"That coal-powered electricity came from many plants that will no longer be available if retirements continue at the pace expected,\" Quinn said.\nPerry said in a statement after FERC's ruling that his directive had started a national conversation about the resiliency of the grid, or its ability to withstand severe weather and other conditions.\nRenewable energy advocates cheered FERCs decision to seek feedback from grid operators.\n\"We believe FERC has laid out a sensible approach to gathering the vital information needed to support any changes to electricity markets, and we are confident that, in the end, the record still will not support market intervention,\" Gregory Wetstone, president of the American Council on Renewable Energy, said in a statement.\nThe Energy Department said it is now exploring ways to monitor the long-term resiliency of the grid, potentially with a model led by its electricity office and its national labs.\n(Reporting by Timothy Gardner; Additional reporting by Valerie Volcovici in Washington and Nicola Groom in Los Angeles; Editing by Lisa Shumaker and Leslie Adler)", "external_links": [], "published": "2018-01-09T01:19:00.000+02:00", "crawled": "2018-01-09T20:43:27.037+02:00", "highlightTitle": ""}