{"organizations": [], "uuid": "ace5f46eda748f9868d52ea0d12e2b56b6fff526", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226255296&w=1200&r=LYNXMPEE0S0MJ", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-zimbabwe-election/zimbabwe-election-body-accused-of-tender-impropriety-idUKKBN1FI0Z1", "country": "US", "domain_rank": 408, "title": "Zimbabwe election body accused of tender 'impropriety\"'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T12:02:00.000+02:00", "replies_count": 0, "uuid": "ace5f46eda748f9868d52ea0d12e2b56b6fff526"}, "author": "", "url": "https://uk.reuters.com/article/uk-zimbabwe-election/zimbabwe-election-body-accused-of-tender-impropriety-idUKKBN1FI0Z1", "ord_in_thread": 0, "title": "Zimbabwe election body accused of tender 'impropriety\"'", "locations": [], "entities": {"persons": [{"name": "ed cropley", "sentiment": "negative"}, {"name": "mugabe", "sentiment": "none"}, {"name": "robert mugabe", "sentiment": "none"}, {"name": "emmerson mnangaga", "sentiment": "none"}], "locations": [{"name": "zimbabwe", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "harare", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "laxton group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "administrative court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 03 AM / Updated 25 minutes ago Zimbabwe election body accused of tender 'impropriety\"' Ed Cropley 4 Min Read \nJOHANNESBURG (Reuters) - A company helping to produce a new voter roll for Zimbabwe has accused the election commission of “impropriety” in its handling of tenders, potentially tarnishing the credibility of a poll meant to usher in a new era of transparency post-Mugabe. \nA credible vote is key to the restoration of democratic legitimacy following a de facto coup in November that ousted veteran leader Robert Mugabe after 37 years at the helm. It is also crucial to unlocking badly needed financial aid and repairing relations with Western powers. \nNew President Emmerson Mnangaga, 75, a onetime protege of Mugabe, said last week that transparent elections would be held by July and that he would respect the result if the opposition wins. \nLaxton Group, a South African-run ID systems firm with production headquarters in China, filed papers with Harare’s Administrative Court on Jan. 25 questioning why it had lost out on a contract to “clean up” the list of registered voters. \nThe company, whose directors are mostly South African, has been registering Zimbabwean voters since September in a United Nations-backed attempt to generate a “clean” list of voters as the basis for a credible election. \nBut the Zimbabwe Election Commission (ZEC) held a separate tender for what is known as the ‘de-duplication’ process - which ensures there is no double entry of voters or other aberrations - and awarded it to a rival bidder, Ipsidy. \nIn its legal filing, Laxton accused the ZEC of manipulating costs presented in its bid for the de-duplication contract. It also said the ZEC had given an inexplicably low weighting to Laxton’s favourable rating in a technical test. \n“It is submitted that the impropriety of the (ZEC‘s) conduct in awarding the tender (to Ipsidy)... should be looked at within the context of the whole rationale of regulating public procurement,” Laxton said in the document. \nPrevious elections in the southern African nation have been marred by allegations of vote rigging, with manipulation of the register of voters frequently at the heart of the controversy. \nZEC officials did not respond to Reuters’ repeated requests for comment on the matter. \nLaxton argues it is best-placed to run the deduplication process because the registration data, including fingerprints of every voter, is loaded on its systems. \nIn its legal filing, Laxton also said U.S.-listed Ipsidy was facing financial difficulties that could harm its ability to do the job properly. \nAccording to its 2016 annual report, Ipsidy has consistently run at a loss, has accumulated debt of $49 million and needs additional finance. The firm is also expected to incur net losses for the “foreseeable future”, it added. \n“It is respectfully submitted that this was terribly irresponsible given that a three-year warranty was required,” Laxton said in its filing. \n“If a company is unstable or unable to continue operating, it is likely that it will not be in a position to provide these services in three years’ time.” \nIpsidy did not respond to requests for comment. Reporting by Ed Cropley; Editing by Gareth Jones", "external_links": [], "published": "2018-01-29T12:02:00.000+02:00", "crawled": "2018-01-29T12:33:17.022+02:00", "highlightTitle": ""}