{"organizations": [], "uuid": "027fbd7e5c3df10f28a30a22bcd002467c89d970", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-qstream-appoints-richard-lanchantin-as-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Qstream Appoints Richard Lanchantin as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T17:40:00.000+02:00", "replies_count": 0, "uuid": "027fbd7e5c3df10f28a30a22bcd002467c89d970"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-qstream-appoints-richard-lanchantin-as-chief-executive-officer.html", "ord_in_thread": 0, "title": "Qstream Appoints Richard Lanchantin as Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "richard lanchantin", "sentiment": "negative"}, {"name": "lanchantin", "sentiment": "none"}, {"name": "rich lanchantin", "sentiment": "none"}, {"name": "gary swart", "sentiment": "none"}, {"name": "rich", "sentiment": "none"}, {"name": "duncan lennox", "sentiment": "none"}, {"name": "duncan", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "burlington", "sentiment": "none"}], "organizations": [{"name": "polaris partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BURLINGTON, Mass., Jan. 3, 2018 /PRNewswire/ -- Qstream, makers of software that uses science, data, and mobile technology to ignite sales performance, today announced the appointment of Richard Lanchantin as Chief Executive Officer. Mr. Lanchantin succeeds co-founder and CEO Duncan Lennox, who will transition to a new role as Chairman of the Board.\n\"We're sincerely grateful for Duncan's leadership during the company's crucial early growth phase,\" said Gary Swart of Polaris Partners, \"and we welcome his continued support as Chairman. The sales enablement market is poised to expand even further in 2018 as companies move beyond simple productivity tools in favor of solutions focused on developing sales competency and proficiency. No company is better positioned than Qstream to exploit this opportunity, and Rich's unique blend of education and technology experience make him a natural fit to take this business to the next level.\"\nWith roots in science education, Rich Lanchantin is a senior executive with more than 30 years' experience leading global sales, services, and customer success organizations for life sciences and software firms, including Abbott Diagnostics, Thermo Fisher Scientific, Rational Software and IBM.\n\"The sales enablement technology market grew significantly in 2017 and all signs point to continued expansion in the coming year,\" said Lanchantin, CEO of Qstream. \"Qstream was a pioneer in this category, and continues to be the only solution clinically proven to change behavior and drive proficiency at scale. I'm thrilled to join this passionate team of professionals and look forward to building upon Qstream's marquee customer list and award-winning technology platform in the days ahead.\"\nIn 2017, Qstream's SaaS platform continued its growth trajectory as market leaders such as Mastercard, HubSpot, Nuance Communications, and Olympus Medical Systems committed to new or significantly expanded relationships with the company. Qstream also released new platform features, including the addition of video coaching to its award-winning Coaching Hub, and integration to Veeva CRM.\nAbout Qstream\nQstream is focused on making salespeople great at what they do, in just minutes a day, by combining performance insights, coaching support, and knowledge and skills reinforcement in one convenient mobile app. Our clinically proven approach helps sales leaders align team capabilities to their unique sales process, KPIs, and customer path to purchase, while identifying gaps that put performance goals at risk. The Qstream platform is used by hundreds of leading brands in life sciences, technology, financial services and healthcare, and supported by a network of more than 50 global partners. To learn more, visit Qstream.com , or connect with us on Twitter and LinkedIn .\nMedia Contact:\nDeidre Moore\ndmoore@qstream.com\n+1 781 214 4541\nView original content with multimedia: http://www.prnewswire.com/news-releases/qstream-appoints-richard-lanchantin-as-chief-executive-officer-300576772.html\nSOURCE Qstream", "external_links": ["https://twitter.com/Qstream", "http://www.prnewswire.com/news-releases/qstream-appoints-richard-lanchantin-as-chief-executive-officer-300576772.html", "https://www.linkedin.com/company/1614400/", "http://www.qstream.com/"], "published": "2018-01-03T17:40:00.000+02:00", "crawled": "2018-01-03T21:08:04.006+02:00", "highlightTitle": ""}