{"organizations": [], "uuid": "87fa9dc3af4ae56d112dddaa51e819ecc58a05fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 69, "shares": 69, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221078906&w=1200&r=LYNXMPEE0A0JL", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-squash-technical-exclusive/exclusive-squash-technological-innovation-the-key-for-squashs-olympic-dream-idUKKBN1F00X9", "country": "US", "domain_rank": 408, "title": "Exclusive - Squash-Technological innovation the key for Squash's Olympic dream", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T11:06:00.000+02:00", "replies_count": 0, "uuid": "87fa9dc3af4ae56d112dddaa51e819ecc58a05fa"}, "author": "", "url": "https://uk.reuters.com/article/uk-squash-technical-exclusive/exclusive-squash-technological-innovation-the-key-for-squashs-olympic-dream-idUKKBN1F00X9", "ord_in_thread": 0, "title": "Exclusive - Squash-Technological innovation the key for Squash's Olympic dream", "locations": [], "entities": {"persons": [{"name": "squash-technological", "sentiment": "negative"}, {"name": "rod gilmour", "sentiment": "none"}, {"name": "markos kem/fun", "sentiment": "none"}], "locations": [{"name": "squash-technological", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "linkoping", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters  squash", "sentiment": "none"}, {"name": "professional squash association", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "squash", "sentiment": "none"}, {"name": "psa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 9:08 AM / Updated 7 hours ago Exclusive - Squash-Technological innovation the key for Squash's Olympic dream Rod Gilmour 4 Min Read \nLONDON (Reuters) - Squash chiefs have long held a desire for the sport to be a part of the Olympic Games and thanks to innovations in technology, their dream may be closer to becoming a reality. Players use interactiveSquash's interactiveSquash Area Focus training module in an undated photograph handed out by the manufacturer. Markos Kem/Fun With Balls GmbH/Handout via REUTERS \nSquash has failed on three occasions to be included in the Games, most recently as part of the programme for Tokyo 2020. \nYet the sport hopes that the adoption of new data systems will make it a more appealing product as it seeks inclusion in the Paris 2024 Olympics. \nNext month, squash will pioneer a statistical tracking system for the first time at a world tour event at the Swedish Open in Linkoping between Feb. 8-11, which the Professional Squash Association (PSA) says will allow the elite game to be analysed in greater depth than ever before. \nFour cameras and a series of sensors will be erected around and above the all-glass court, led by a motion tracking system called “MoTrack”, allowing for instant analysis of player and ball behaviour. \n“We feel certain this will add a new dimension to squash’s global appeal,” Alex Gough, the PSA’s chief executive, told Reuters in an interview. \n“Squash is one of the most physically demanding sports in the world and being able to illustrate the supreme fitness of our players with scientific data, that is easy to understand and display, is key to helping improve our sport.” \nPhysical characteristics such as movement, speed and distance covered by players during games will also be shown, alongside tactical elements such as heat maps and ball tracking data. \nGerman developers interactiveSQUASH (iSquash) launched new technology last year that can project interactive training modules on the front wall of the court. \nThe system was conceived by Markos Kern, a Munich-based creative entrepreneur. \n“With our system, squash will in time become the first to achieve a full merger between sport and technology in truly real time - with data instantly available to fans and players,” he said. Players compete in the PSA World Tour Finals in an undated photograph handed out by the tournament organisers, in Dubai, United Arab Emirates. Steve Line/Professional Squash Association/Handout via REUTERS \nTour chiefs hope to incorporate technology for automated calls on the out lines, as well as the tin, if the trial concept proves successful. Plans are also in place to combine iSquash’s front wall technology with the tour system, meaning that statistical data can be projected onto the court wall in between games for spectators. YOUNGER GENERATION \nKern said he will also create an e-squash governing body to harness the growing popularity of e-sports. \n“If squash doesn’t innovate for the digital age then what chance do we have of young people picking up a racket?” added Kern. \n“This is a perfect combination of gaming and a real sport.” \nAttracting a youthful audience is also pivotal for a sport harbouring dreams of Olympic inclusion after failing to convince the International Olympic Committee in its last three bids. \n“The possibilities that this technology offers us are endless, and will allow us to tap into a younger, tech-savvy audience,” added Gough. \nThe Paris Games, however, represent squash’s best chance of Olympic inclusion. \nFrenchman Jacques Fontaine was elected World Squash Federation president in 2016, while former fencer Laura Flessel, now France’s sport minister, used squash as a training tool as she became France’s most decorated female Olympian, before retiring after London 2012. \nFrance’s Gregory Gaultier is currently world number one in the men’s game. \n“This technology will take the sport to another level,” he told Reuters. Editing by Christian Radnedge", "external_links": [], "published": "2018-01-11T11:06:00.000+02:00", "crawled": "2018-01-11T11:30:55.003+02:00", "highlightTitle": ""}