{"organizations": [], "uuid": "157ab5217b5347761fe3a216019f7dfbfd0cb2c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226496632&w=1200&r=LYNXMPEE0T07E", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/us-fiat-chrysler-waymo/fiat-chrysler-waymo-expand-deal-for-self-driving-public-ride-hailing-service-idINKBN1FJ0GN", "country": "US", "domain_rank": 408, "title": "Fiat Chrysler, Waymo expand deal for self-driving public ride-hailing service", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T07:05:00.000+02:00", "replies_count": 0, "uuid": "157ab5217b5347761fe3a216019f7dfbfd0cb2c9"}, "author": "", "url": "https://in.reuters.com/article/us-fiat-chrysler-waymo/fiat-chrysler-waymo-expand-deal-for-self-driving-public-ride-hailing-service-idINKBN1FJ0GN", "ord_in_thread": 0, "title": "Fiat Chrysler, Waymo expand deal for self-driving public ride-hailing service", "locations": [], "entities": {"persons": [{"name": "waymo", "sentiment": "negative"}, {"name": "nick carey", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "waymo", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "pacifica", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "fiat chrysler", "sentiment": "negative"}, {"name": "fiat chrysler automobiles nv", "sentiment": "none"}, {"name": "alphabet inc", "sentiment": "none"}, {"name": "min read  detroit", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "general motors co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "uber technologies inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 5:07 AM / Updated 9 hours ago Fiat Chrysler, Waymo expand deal for self-driving public ride-hailing service Nick Carey 3 Min Read \nDETROIT (Reuters) - Fiat Chrysler Automobiles NV (FCA) will provide Waymo with thousands of Pacifica hybrid minivans as Alphabet Inc’s self-driving unit begins rolling out its first public ride-hailing service later this year, the companies said on Tuesday. \nDepending on its scope and scale, the agreement could put pressure on the likes of Uber Technologies Inc and General Motors Co to speed up their efforts to start self-driving commercial ride-hailing services. \nWaymo is part of a growing number of vehicle manufacturers, technology companies and tech startups looking to develop so-called robo-taxis over the next three years in North America, Europe and Asia. Most of those companies have one or more partners. \nFiat Chrysler provided Waymo with 100 Pacifica minivans refitted for self-driving testing in 2016, then 500 in 2017. \n“Our partnership with Waymo continues to grow and strengthen; this represents the latest sign of our commitment to this technology,” Fiat Chrysler Chief Executive Officer Sergio Marchionne said in a statement. \nThe companies said the automaker would start delivering “thousands” of minivans in late 2018. Waymo is due to begin offering a ride-hailing service to the public in Phoenix later this year. \n“The additional Pacifica Hybrid minivans will be used to support Waymo as it expands its service to more cities across the United States,” the companies said. \nAsked for details on the length of the agreement, a spokeswoman for Fiat Chrysler said the companies would not disclose terms. \nLast week, Waymo said it began testing self-driving vehicles in Atlanta, bringing to 25 the total number of U.S. cities in which it is testing. \n“The Pacifica Hybrid minivans offer a versatile interior and a comfortable ride experience, and these additional vehicles will help us scale,” Waymo CEO John Krafcik said. \nLast November, Uber said it planned to buy up to 24,000 self-driving cars from Volvo as part of a non-exclusive deal from 2019 to 2021, marking the transition of the U.S. company from an app used to summon a taxi to the owner and operator of a fleet of cars. \nEarlier this month, GM said it was seeking U.S. government approval for a fully autonomous car, one without a steering wheel, brake pedal or accelerator pedal, to enter the automaker’s first commercial ride-sharing fleet in 2019. Reporting By Nick Carey", "external_links": [], "published": "2018-01-30T07:05:00.000+02:00", "crawled": "2018-01-30T07:44:07.013+02:00", "highlightTitle": ""}