{"organizations": [], "uuid": "be5ac96169e0400ad9e031bdbf305764b2f22639", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219891278&w=1200&r=LYNXMPEE050JC", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-usa-trump-kushner/sec-probing-kushner-cos-use-of-wealthy-investor-visas-wsj-idUKKBN1EV0PN", "country": "US", "domain_rank": 408, "title": "SEC probing Kushner Cos use of wealthy investor visas - WSJ", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T22:50:00.000+02:00", "replies_count": 0, "uuid": "be5ac96169e0400ad9e031bdbf305764b2f22639"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump-kushner/sec-probing-kushner-cos-use-of-wealthy-investor-visas-wsj-idUKKBN1EV0PN", "ord_in_thread": 0, "title": "SEC probing Kushner Cos use of wealthy investor visas - WSJ", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "jared kushner", "sentiment": "none"}, {"name": "reuters/kevin lamarque  kushner cos", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "kushner cos", "sentiment": "negative"}, {"name": "wsj reuters staff", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 8:51 PM / Updated 17 minutes ago SEC probing Kushner Cos use of wealthy investor visas - WSJ Reuters Staff 3 Min Read \n(Reuters) - The real estate company of Jared Kushner, President Donald Trump’s senior adviser and son-in-law, is being investigated by the U.S. Securities and Exchange Commission for its use of a federal program that grants visas to wealthy foreigners investing in the United States, the Wall Street Journal reported on Saturday. Senior adviser Jared Kushner sits behind U.S. President Donald Trump during a cabinet meeting at the White House in Washington, U.S., November 1, 2017. REUTERS/Kevin Lamarque \nKushner Cos was asked by the SEC for information on its use of the visa program, known as EB-5, in May 2017, according to a person the Journal said was familiar with the matter. \nThe EB-5 visa is a method for eligible immigrants to become lawful permanent residents, or “green card” holders, by investing at least $500,000 (£368,552) into a business in the United States that will employ 10 or more American workers. Most holders are wealthy Chinese individuals. \nThe Journal said the company also received a separate request from New York federal prosecutors in the same month for information on development projects financed in part by the EB-5 program. \nKushner, the White House and New York prosecutors did not reply to requests for comment from Reuters. The SEC could not be reached for comment. \n“As we said months ago, we are cooperating with all government requests for information about our past legal use of the EB-5 program,” a Kushner Cos representative said in a statement to Reuters. \nThe exact subject of the SEC’s inquiry, or whether it identified particular projects, is not clear, the Journal reported. \nThe Kushners’ use of EB-5 visas to raise cash to finance developments came to broad attention in May last year, when Kushner’s sister, Nicole Kushner, spoke at a publicly advertised event in Shanghai to attract Chinese investment into a two-tower luxury apartment complex in New Jersey, called One Journal Square, being developed jointly by Kushner Cos and KABR Group. The company later apologised for mentioning Jared Kushner’s name while wooing investors. \nThe developers were seeking to raise $150 million, or 15.4 percent of funding for the project, from investors through the EB-5 visa program, according to marketing materials posted by the event’s organizer, immigration agency Qiaowai, Reuters reported at the time. \nKushner Cos is not a publicly traded company but the EB-5 is considered a securities offering, the Journal said, hence the SEC’s interest. \nKushner resigned from his role leading Kushner Cos when he was appointed Trump’s senior White House adviser early last year but still owns a stake in parts of the business, according to his most recent personal financial disclosure form, the Journal said. Reporting by Bill Rigby; Editing by Bill Trott", "external_links": [], "published": "2018-01-06T22:50:00.000+02:00", "crawled": "2018-01-06T23:02:09.029+02:00", "highlightTitle": ""}