{"organizations": [], "uuid": "e4f06e71cae0de0bb4ff36923000379dca25a508", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220794353&w=1200&r=LYNXMPEE090K9", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-safrica-politics/zumas-exit-not-discussed-at-south-african-ruling-party-meeting-secretary-general-idUSKBN1EZ12K", "country": "US", "domain_rank": 408, "title": "Zuma's exit not discussed at South African ruling party meeting: secretary-general", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T12:51:00.000+02:00", "replies_count": 0, "uuid": "e4f06e71cae0de0bb4ff36923000379dca25a508"}, "author": "", "url": "https://www.reuters.com/article/us-safrica-politics/zumas-exit-not-discussed-at-south-african-ruling-party-meeting-secretary-general-idUSKBN1EZ12K", "ord_in_thread": 0, "title": "Zuma's exit not discussed at South African ruling party meeting: secretary-general", "locations": [], "entities": {"persons": [{"name": "zuma", "sentiment": "negative"}, {"name": "ramaphosa", "sentiment": "none"}, {"name": "joe brock", "sentiment": "none"}, {"name": "ed stoddard", "sentiment": "none"}, {"name": "cyril ramaphosa", "sentiment": "none"}, {"name": "jacob zuma", "sentiment": "none"}, {"name": "ace magashule", "sentiment": "none"}, {"name": "robin pomeroy", "sentiment": "none"}, {"name": "magashule", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "anc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "african national congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EAST LONDON, South Africa (Reuters) - The new leadership of South Africa’s ruling party did not discuss the future of President Jacob Zuma on Wednesday, its secretary general said, pouring cold water on intense media speculation that it would seek to remove him from power.\nZuma’s replacement as party leader by his deputy, Cyril Ramaphosa, last month prompted widespread expectations of an early end to his time in office, which has been marred by persistent allegations of graft.\nThe rand has risen around 8 percent since Ramaphosa was narrowly elected in December to head up the African National Congress. On Wednesday the currency extended losses against the U.S. dollar in a sign of investors’ disappointment the party did not move to remove him.\n“That matter was not for any discussion or debate,” ANC Secretary General Ace Magashule said in response to a question about whether Zuma’s future was discussed or would be raised.\nThe only item on the agenda was a statement to be read by Ramaphosa on Saturday to mark the 106th birthday of the ANC, Magashule told reporters at a break in the meeting in the seaside city of East London.\nZuma does not have to step down before his second term as president ends with general elections in 2019, but analysts have said he is increasingly seen as a political liability to the party once headed by the iconic Nelson Mandela.\nThe ANC’s public support has declined under Zuma’s leadership as voters have become increasingly disillusioned with a raft of corruption scandals, weak economic growth and an unemployment rate that has risen to nearly 28 percent.\nPOLITICAL LIABILITY FILEPHOTO: ANC members arrive at the 54th National Conference of the ruling African National Congress (ANC) at the Nasrec Expo Centre in Johannesburg, South Africa December 16, 2017. REUTERS/Siphiwe Sibeko/File Photo Zuma’s sacking last year of Finance Minister Pravin Gordhan triggered downgrades of South Africa’s credit rating to junk status, significantly raising borrowing costs for Africa’s most industrialized economy.\nIt also brought tens of thousands of anti-Zuma protesters onto the streets in nationwide marches.\n“The ANC cannot avoid dealing with the future of Jacob Zuma. The leadership know the longer Zuma stays, the more damage it could do at the ballot box,” said Susan Booysen, an author and professor at Johannesburg’s University of the Witwatersrand.\nFILE PHOTO: South African President Jacob Zuma reacts during the closing address at the 54th National Conference of the ruling African National Congress (ANC) in Johannesburg, South Africa December 21, 2017. REUTERS/Rogan Ward/File Photo Two senior committee members told Reuters Ramaphosa’s faction in the ANC did not want to try to openly oust Zuma since the NEC was only elected a month ago and because Ramaphosa’s victory was marginal.\nThere could be a less high-profile meeting of the NEC next week where a more serious discussion about Zuma leaving would be held, one of the senior party members said.\n“Ramaphosa has to chart a very careful course so he can win broad ANC support and negotiate a dignified exit for Zuma,” independent political analyst Daniel Silke said.\nA former trade unionist who was the ANC’s key negotiator in the talks that lead to the end of apartheid, Ramaphosa went on to become a wealthy business tycoon, making him a favorite of both the party’s left wing and the business community.\nA smiling Ramaphosa looked at ease when journalists were briefly allowed into the meeting for a photo opportunity. He had earlier been seen jogging on the city’s waterfront.\n“This is the time for renewal for the ANC,” said Sidney Nkadimeng, 43, a rank-and-file ANC member from Pretoria who is in East London for the party’s birthday celebrations.\nAdditional reporting and writing by Joe Brock; Editing by Philippa Fletcher\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-10T12:51:00.000+02:00", "crawled": "2018-01-10T13:04:26.022+02:00", "highlightTitle": ""}