{"organizations": [], "uuid": "8192c79836671a6fd22d7094fe03212a1e5b612f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/01/104141279-GettyImages-521815364.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/indeed-survey-few-americans-think-they-earn-enough-money.html", "country": "US", "domain_rank": 767, "title": "Indeed survey: Few Americans think they earn enough money", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-26T21:56:00.000+02:00", "replies_count": 0, "uuid": "8192c79836671a6fd22d7094fe03212a1e5b612f"}, "author": "Emmie Martin", "url": "https://www.cnbc.com/2018/01/26/indeed-survey-few-americans-think-they-earn-enough-money.html", "ord_in_thread": 0, "title": "Indeed survey: Few Americans think they earn enough money", "locations": [], "entities": {"persons": [], "locations": [{"name": "midwest", "sentiment": "none"}, {"name": "southwest", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "west", "sentiment": "none"}], "organizations": [{"name": "institute for women's policy research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It's important not to fall into these mental traps, the entrepreneur says. \nAmericans feel underpaid. \nIndeed's recent salary report found that just 19 percent of workers in the U.S. feel comfortable with how much they're making. When Indeed asked how much more it would take for them to feel good about their salaries, 60 percent of participants said they'd need a raise of at least $6,000. \nThe data varies depending on where you live. Those in the pricey Northeast are the most displeased, with only 16 percent of respondents saying they're comfortable with their current salary. In the Midwest and Southeast, that number rises to 18 percent; in the Southwest, it's 20 percent; and in the West it's 21 percent. \nThere's a divide between genders as well. While 21 percent of men say they're comfortable with their salaries, only 16 percent of women do. However, this is unsurprising when you consider that women are typically paid 20 percent less than their male counterparts performing the same job, according to the Institute For Women's Policy Research . show chapters 2:41 PM ET Wed, 27 Dec 2017 | 00:53 \nSo what are Americans doing about their dissatisfaction? \nA little over half would be willing to switch jobs if it meant more money. \"While it's obvious that these issues are important to employees, it is critical that employers should also be invested in these trends,\" the survey reports . \"Organizations can lose their most talented workers to companies that offer better compensation and raises.\" \nNearly half of the survey respondents plan to ask for a raise this year: They're looking for bumps of between 6 and 10 percent on average. \n\"The most common reason behind raise requests?\" the survey posits. \"Simply put: People feel that they've earned it. Three out of five respondents who expect to ask for raises are doing so because they believe their good performance should be rewarded.\" \nIf you're part of the 47 percent of Americans planning to ask for more — or the 89 percent who are dissatisfied with the amount you're making — here are a few tips for negotiating the salary you want:", "external_links": [], "published": "2018-01-26T21:56:00.000+02:00", "crawled": "2018-01-26T22:11:15.007+02:00", "highlightTitle": ""}