{"organizations": [], "uuid": "bbedfad28f0aa83ae327399234a749b12b2c90e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/31/reuters-america-graphic-yellens-swan-song-to-markets.html", "country": "US", "domain_rank": 767, "title": "GRAPHIC-Yellen's swan song to markets", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:47:00.000+02:00", "replies_count": 0, "uuid": "bbedfad28f0aa83ae327399234a749b12b2c90e0"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/31/reuters-america-graphic-yellens-swan-song-to-markets.html", "ord_in_thread": 0, "title": "GRAPHIC-Yellen's swan song to markets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 31 (Reuters) - Janet Yellen soothed markets' anxieties even while unwinding her predecessor's emergency measures to combat the 2007-2009 global financial crisis during her tenure as the first woman to lead the U.S. Federal Reserve.\nYellen chairs her final Federal Open Market Committee meeting on Wednesday, with the group expected to leave interest rates unchanged. She had led the Fed since February 2014.\nAn uneventful reaction to that meeting would be a fitting finale. Her Fed telegraphed its every move to withdraw stimulus, and it trained investors to not see the Fed as a threat to markets' prosperity.\nAs such, the Fed largely avoided a pullback of the sort that attended former chair Ben Bernanke in 2013 when he mentioned possibly reducing the Fed's bond-buying \"quantitative easing\" program.\nYet risk-taking has been rewarded. Equities sold off in late 2015 after the Fed's first hike since 2006, but the pain did not last.\nCautiously timed rate hikes reassured markets. Inflation was tame. Investors flocked to the United States for relatively high yields and stable economic prospects. And the Fed's balance sheet, despite shrinking, remained hefty. So volatility dipped and stocks leapt.\nFinancial conditions eased as stocks gained during Yellen's term, leading some to wonder whether hikes were enough to \"pull away the punchbowl\" and prevent the economy's overheating. The S&P 500 gained 62 percent, or 76 percent on a total return basis, including dividends, during her tenure, and investors talked about a Yellen \"put\" guaranteeing the Fed would stabilize markets.\nWell-received rate hikes nonetheless paved the way for what economist Mohamed El-Erian has called a \"beautiful normalization\" of monetary policy.\nAnother enduring hallmark of Yellen's tenure may be the increasingly settled belief that the Fed's rates and balance sheet may not return to levels considered normal before the crisis.\nAs inflation failed to meet the Fed's 2-percent target, futures markets priced in fewer hikes - and to a lower ending point - than thought possible when Yellen took over.\nTake Eurodollar futures, reflecting yield expectations on three-month loans between banks at a future date, which indicates that markets expect a 3.165 percent yield nearly 10 years from now, in 2027.\nBy contrast, when Yellen became chair, markets saw yields reaching that point by March this year and 4.795 percent in 2023.\n(Reporting by Trevor Hunnicutt Editing by Chizu Nomiyama)", "external_links": [], "published": "2018-01-31T19:47:00.000+02:00", "crawled": "2018-01-31T21:04:54.010+02:00", "highlightTitle": ""}