{"organizations": [], "uuid": "a5aacf83c1199712a796d3cbaa3eff56d0f94d54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224589624&w=1200&r=LYNXMPEE0M1SK", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-bankruptcy-woodbridge/alleged-ponzi-firm-woodbridge-agrees-with-sec-on-new-board-idUSKBN1FC2XH", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Alleged Ponzi firm Woodbridge agrees with U.S. SEC on new board", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T01:46:00.000+02:00", "replies_count": 0, "uuid": "a5aacf83c1199712a796d3cbaa3eff56d0f94d54"}, "author": "", "url": "https://www.reuters.com/article/us-bankruptcy-woodbridge/alleged-ponzi-firm-woodbridge-agrees-with-sec-on-new-board-idUSKBN1FC2XH", "ord_in_thread": 0, "title": "UPDATE 1-Alleged Ponzi firm Woodbridge agrees with U.S. SEC on new board", "locations": [], "entities": {"persons": [{"name": "woodbridge", "sentiment": "negative"}, {"name": "tom hals", "sentiment": "none"}], "locations": [{"name": "del.", "sentiment": "none"}, {"name": "wilmington", "sentiment": "none"}, {"name": "delaware", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "u.s. sec", "sentiment": "negative"}, {"name": "u.s. bankruptcy court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}, {"name": "woodbridge group of companies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WILMINGTON, Del. (Reuters) - Woodbridge Group of Companies, a property company accused by the U.S. Securities and Exchange Commission of being a huge Ponzi scheme, reached a deal with the government on Tuesday to appoint a new board and to pay for legal representation for thousands of alleged victims.\nThe deal announced in U.S. Bankruptcy Court in Delaware resolves weeks of fighting among creditors, the SEC and investors for control of the company.\nWoodbridge filed for bankruptcy in December and days later was sued by the SEC for allegedly running a $1.2 billion fraud by selling unregistered securities to raise funds to repay earlier investors.\nThe company has said it is investigating the allegations and working on behalf of the company’s investors.\nAbout 8,400 individuals bought notes issued by Woodbridge funds that were supposedly loaned at high interest rates to commercial property developers or used to finance the purchase of luxury properties.\nThe company also raised money from investors who bought equity in the same funds.\nThe SEC alleges the property developers were actually entities controlled by Woodbridge’s founder and former CEO, Robert Shapiro. Much of the money was spent on 138 high-end properties in California and Colorado and operating expenses, and $21 million on luxury cars and jet charters for Shapiro, according to the SEC.\nShapiro has denied the allegations and has not been criminally charged. He resigned from the Sherman Oaks, California-based company on Dec. 1.\nHe was replaced by a chief restructuring officer and independent manager. On Friday, they said they were resigning.\nUnder Tuesday’s deal, the SEC dropped its request for a court-ordered trustee and will withdraw a request in federal court in Miami for a receivership over Woodbridge’s assets.\n“The staff truly believes the settlement is in the best interest of investors,” said David Baddley, an SEC staff attorney.\nWoodbridge agreed to appoint Richard Nevins, Freddie Reiss and Michael Goldberg as its new board.\nThe parties also agreed to form two committees - one for noteholders and one for equity investors, with Woodbridge paying for their lawyers and advisers.\nAlready, Woodbridge and its creditor committee are working with five law firms, three consulting firms and an investment bank.\nJeffrey Sonn, a Florida lawyer who represents Woodbridge investors in a class action against Comerica Bank, said the bankruptcy filing prevented a receivership, which would have been cheaper and better for investors.\n“In bankruptcy, the victims get victimized again,” he said.\nReporting by Tom Hals in Wilmington, Delaware; Editing by Phil Berlowitz and Matthew Lewis\n ", "external_links": [], "published": "2018-01-24T01:46:00.000+02:00", "crawled": "2018-01-24T02:26:37.001+02:00", "highlightTitle": ""}