{"organizations": [], "uuid": "8da9167987af1ecd34891bd2aa63ca9227b31657", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220286113&w=1200&r=LYNXMPEE070XC", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-court-deathpenalty/u-s-supreme-court-sides-with-death-row-inmate-over-racist-juror-claim-idUSKBN1EX1GG", "country": "US", "domain_rank": 408, "title": "U.S. Supreme Court sides with death row inmate over racist juror claim", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:40:00.000+02:00", "replies_count": 0, "uuid": "8da9167987af1ecd34891bd2aa63ca9227b31657"}, "author": "", "url": "https://www.reuters.com/article/us-usa-court-deathpenalty/u-s-supreme-court-sides-with-death-row-inmate-over-racist-juror-claim-idUSKBN1EX1GG", "ord_in_thread": 0, "title": "U.S. Supreme Court sides with death row inmate over racist juror claim", "locations": [], "entities": {"persons": [{"name": "keith tharpe", "sentiment": "none"}, {"name": "lawrence hurley", "sentiment": "none"}, {"name": "alistair bell", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "jones county", "sentiment": "none"}], "organizations": [{"name": "u.s. supreme court", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 2:43 PM / in an hour Supreme Court sides with death row inmate over racist juror claim Lawrence Hurley 3 Min Read \nWASHINGTON (Reuters) - The U.S. Supreme Court on Monday paved the way for a black Georgia inmate to challenge his 1991 death sentence for killing his sister-in-law after he argued the case was tainted by a racist white juror who questioned whether black people have souls. \nThe justices, in a 6-3 unsigned decision, threw out a lower court’s decision that had rejected his biased jury assertion. Keith Tharpe was found guilty and sentenced to death by a jury of 10 white people and two black people in Georgia’s Jones County. The allegations of racial bias arose from an interview with one of the jurors years later, not comments made during the trial. \nMonday’s ruling means the case will return to lower courts and gives Tharpe a chance to avoid execution. \nTharpe had been scheduled to be put to death by lethal injection in a Georgia state prison on Sept. 26 but the Supreme Court granted his last-minute stay application so it could have more time to decide whether to hear his appeal. \nTharpe, 59, kidnapped and raped his estranged wife, Migrisus Tharpe, and used a shotgun to kill Jaquelin Freeman, her sister, in September 1990, according to court records. \nThree of the court’s conservatives, Clarence Thomas, Samuel Alito and Neil Gorsuch, dissented from Monday’s decision. \nThomas, the court’s only black justice, is also from Georgia. He pointed out in his dissenting opinion that the court’s decision will “delay justice” for the victim, who was also black. \n“The court’s decision is no profile in moral courage,” Thomas said. \nIn 1998 Tharpe’s lawyers, as they were preparing an appeal in the case, spoke with the trial jurors including a man named Barney Gattie, who has since died. \n“After studying the Bible, I have wondered if black people even have souls,” Gattie told Tharpe’s lawyers in an affidavit, according to court papers. \nGattie also told the defense lawyers that there are two kinds of black people, one who he called “regular black folks” and another group he referred to using a racial slur. \n“Because I knew the victim and her husband’s family and knew them all to be good black folks, I felt Tharpe, who wasn’t in the good black folks category in my book, should get the electric chair for what he did,” Gattie added. \nThe 12-person jury, including its two black members, voted unanimously to sentence Tharpe to death. Reporting by Lawrence Hurley; Editing by Alistair Bell and Grant McCool", "external_links": [], "published": "2018-01-08T16:40:00.000+02:00", "crawled": "2018-01-08T17:04:35.010+02:00", "highlightTitle": ""}