{"organizations": [], "uuid": "4b997555388792c9f2c3dbe9435bee17d9bb5501", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-growgeneration-appoints-navy-capitals-sean-stiefel-to-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "GrowGeneration Appoints Navy Capital's Sean Stiefel to its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.836, "site_type": "news", "published": "2018-01-17T16:00:00.000+02:00", "replies_count": 0, "uuid": "4b997555388792c9f2c3dbe9435bee17d9bb5501"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-growgeneration-appoints-navy-capitals-sean-stiefel-to-its-board-of-directors.html", "ord_in_thread": 0, "title": "GrowGeneration Appoints Navy Capital's Sean Stiefel to its Board of Directors", "locations": [], "entities": {"persons": [{"name": "sean stiefel", "sentiment": "negative"}, {"name": "darren lampert", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "jody kane", "sentiment": "none"}, {"name": "stiefel", "sentiment": "none"}], "locations": [{"name": "co", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "navy capital", "sentiment": "negative"}, {"name": "growgeneration corp.", "sentiment": "negative"}, {"name": "capital markets and investments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER, CO, Jan. 17, 2018 /PRNewswire/ - GrowGeneration Corp. (OTCQB:GRWG), (\"GrowGen\" or the \"Company\") one of the largest specialty retail hydroponic and organic gardening stores in the country, with 14 locations in Colorado, California, Washington and Nevada, selling to both the commercial and home cannabis growers, today announced it has appointed Navy Capital's Sean Stiefel to its Board of Directors. Navy Capital is a global thematic hedge fund that invests in publicly traded companies profiting directly and indirectly from the legalization of adult-use and medicinal cannabis. The appointment of Mr. Stiefel is in accord with our recently completed $9.0 million financing. Mr. Stiefel replaces Jody Kane, who stepped down on January 16, 2018.\nDarren Lampert, Co-Founder and CEO, said, \"Our Company could not be more proud and excited to bring Sean on as a board member. Sean brings a breadth of Capital Markets and Investments experience, along with a deep knowledge of the cannabis sector in the US, Canada and around the world, from consumer products, retail, and the cultivation space. His contributions to GrowGen will be invaluable as we continue to execute our expansion and growth plan.\"\nNavy Capital Managing Partner, Sean Stiefel, commented, \"I am excited to become a Director on the Board of GrowGen and support management's roll-up strategy and strong momentum and leadership position in the retail hydroponics and indoor gardening equipment industry. The Company is well positioned to benefit from the strong trends in the indoor horticulture market, and is expected to grow organically and through consolidation. I am looking forward to working with management to build the Company into the recognized market leader, expand the geographic footprint and create value for the shareholders.\"\nBio\nSean Stiefel\nSean Stiefel founded Navy Capital in 2014, where he is currently a Portfolio Manager and is responsible for all aspects of stock selection, investment due diligence and portfolio construction. Mr. Stiefel launched the Navy Capital Green Fund, LP in 2017 as a Global Public Equity Focused Cannabis dedicated fund. Navy Capital has been involved in Cannabis related investing since early 2016. Prior to founding Navy Capital, Mr. Stiefel was a research analyst and trader for Northwoods Capital Management Partners, a global equity fund with a fundamental value and special situations investment strategy. Mr. Stiefel had previously served as an associate within an equity long/short fund at Millennium Partners, and he began his career as an equities trading analyst for Barclays Capital. He is a graduate of the University of Southern California's Marshall School of Business.\nAbout GrowGeneration Corp.:\nGrowGeneration Corp. (\"GrowGen\") owns and operates specialty retail hydroponic and organic gardening stores. Currently, GrowGen has 14 stores, which includes nine locations in Colorado, two locations in California, two locations in Nevada and one in Washington. GrowGen carries and sells thousands of products, including organic nutrients and soils, advanced lighting technology and state of the art hydroponic equipment to be used indoors and outdoors by commercial and home growers. Our mission is to own and operate GrowGeneration branded stores in all the major legalized cannabis states. Management estimates that roughly 1,000 hydroponic stores are in operation in the U.S. According to New Frontier Data, by 2025 the market is estimated to reach over $24 billion with a compound annual growth rate of 16%.\nAbout Navy Capital:\nNavy Capital is a global thematic hedge fund that invests in publicly traded companies profiting directly and indirectly from the legalization of adult-use and medicinal cannabis.\nForward Looking Statements:\nThis press release may include predictions, estimates or other information that might be considered forward-looking within the meaning of applicable securities laws. While these forward-looking statements represent our current judgments, they are subject to risks and uncertainties that could cause actual results to differ materially. You are cautioned not to place undue reliance on these forward-looking statements, which reflect our opinions only as of the date of this release. Please keep in mind that we are not obligating ourselves to revise or publicly release the results of any revision to these forward-looking statements in light of new information or future events. When used herein, words such as \"look forward,\" \"believe,\" \"continue,\" \"building,\" or variations of such words and similar expressions are intended to identify forward-looking statements. Factors that could cause actual results to differ materially from those contemplated in any forward-looking statements made by us herein are often discussed in filings we make with the United States Securities and Exchange Commission, available at: www.sec.gov , and on our website, at: www.growgeneration.com .\nConnect:\nWebsite: www.GrowGeneration.com\nFacebook: GrowGenerationCorp\nTwitter: @GrowGenOK\nInstagram: Growgeneration_corp\nSOURCE GrowGeneration", "external_links": ["http://www.sec.gov/", "http://www.growgeneration.com/", "http://growgeneration.com/"], "published": "2018-01-17T16:00:00.000+02:00", "crawled": "2018-01-17T16:33:40.012+02:00", "highlightTitle": ""}