{"organizations": [], "uuid": "2365d3ce515a96cb7aabcf29b2bada38917e8e0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 14, "shares": 14, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104924028-GettyImages-879925232.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/02/korean-talks-unlikely-to-end-nuke-threat-say-experts.html", "country": "US", "domain_rank": 767, "title": "Korean talks unlikely to end nuke threat, say experts", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T02:18:00.000+02:00", "replies_count": 0, "uuid": "2365d3ce515a96cb7aabcf29b2bada38917e8e0d"}, "author": "Jeff Daniels", "url": "https://www.cnbc.com/2018/01/02/korean-talks-unlikely-to-end-nuke-threat-say-experts.html", "ord_in_thread": 0, "title": "Korean talks unlikely to end nuke threat, say experts", "locations": [], "entities": {"persons": [{"name": "kim jong un", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "matthew bunn", "sentiment": "none"}], "locations": [{"name": "koreas", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "panmunjom", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "harvard university", "sentiment": "none"}, {"name": "john f. kennedy school of government", "sentiment": "none"}, {"name": "yonhap news agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As the leaders of the U.S. and North Korea sparred on who's \"nuclear button\" is bigger, there was still hope rare talks between the two Koreas could bring a thaw in relations.\nYet, analysts say it's unlikely such talks would end the nuclear threat from North Korea. It could, however, ease tensions during the upcoming PyeongChang Winter Olympics in South Korea and reduce the chance of an escalation that might lead to a larger crisis, analysts said.\nIn a New Year's Day speech, North Korean leader Kim Jong Un said he was \"open to dialogue\" with Seoul and indicated that the North might send a \"delegation\" to the upcoming Winter Olympics, which begin Feb. 9.\nOn Tuesday, the Seoul government proposed talks could be held in the inter-Korean truce village of Panmunjom on Jan. 9, according to the Yonhap News Agency .\n\"We should take it seriously partly because he [Kim] is trying to drive a wedge between the United States and South Korea,\" said Matthew Bunn, a nuclear proliferation expert and professor of practice at Harvard University's John F. Kennedy School of Government.\nSome experts believe the outreach from Pyongyang is ultimately an attempt to cause friction in the Seoul-Washington relationship and undermine sanctions, as well as to disrupt plans for the upcoming Foal Eagle and Key Resolve U.S.-South Korea joint military exercises.\nThe war games, which North Korea has seen over the years as a war rehearsal, involve navy ships, tanks and aircraft as well as live-fire exercises and tens of thousands of troops. They are scheduled to start in March.\nAFP | Getty Images North Korean soldiers stare at South Korean soldiers at the truce village of Panmunjom in the Demilitarized zone (DMZ) dividing the two Koreas on November 27, 2017. \"What he's saying, in essence, is something some of us have been expecting for a while: 'I've got my deterrent now, so now I am prepared to talk,'\" said Bunn, who worked on nuclear issues in the Bill Clinton administration.\nMeantime, analysts say Kim's message to Washington about having the \"nuclear button\" on his desk should be viewed as a sign the regime won't give up its intercontinental ballistic missiles or nuclear weapons. Some believe Kim, who turns 34 years old next week, could have assembly lines going for his new ICBMs this year.\nLate Tuesday, President Donald Trump tweeted he too has the nuclear button and said it happens to be \"much bigger and more powerful\" than one the North Korean leader has on his desk — and Trump boasted \"my Button works!\"\nhttps://twitter.com/realDonaldTrump/status/948355557022420992\n\"Several times in Kim's speech he emphasized the fact that they are a strong nation because of nuclear weapons,\" said Lisa Collins, a fellow with the Korea Chair at the Center for Strategic and International Studies, a defense think tank. She said the North Korean leader's reference to the \"nuclear button\" shouldn't be viewed as a threat, but \"he's making very clear again that he will not be giving up his nuclear weapons.\"\nLast year, North Korea test-launched at least three ICBM missiles, including a Hwasong-15 in late November that some experts believe can reach all of the U.S. mainland. Also, the rogue nation conducted its sixth underground nuclear test in September and threatened to do an atmospheric nuclear blast but so far hasn't done so.\nOn Tuesday, NBC News Pentagon correspondent Hans Nichols reported that another missile launch by Pyongyang \"is possible, if not likely, in the coming days,\" citing several military officials.\nCollins said the data they've collected at CSIS shows that there's \"usually a downtick in missile testing in the winter months — November, December and January — and then usually in the early spring and summer is when there's an increase in North Korean missile tests. So I would anticipate the same pattern happening again this year in 2018 if there is no fundamental strategic change in the environment.\"\nThe Pentagon declined to comment.\nAnalysts say the fact Kim delivered the New Year's message in a Western-style suit rather than his usual Maoist attire may be an attempt to \"humanize him,\" especially to U.S. and Asian audiences. However, one U.S. expert believes that effort was a complete failure.\n\"Unfortunately, he came off looking more like a gangster than he did a sort of normal Westernized businessman or presidential leader,\" said Harry Kazianis, director of defense studies at the Center for the National Interest, a think tank founded by former President Richard Nixon.\nRegardless, Bunn said Kim probably wants to talk first with the South Koreans because \"he sees a more cooperative leader\" in Seoul than in Washington. He also believes \"it's an opportunity to reduce tensions on the peninsula, which were getting to the point where there was a real risk of inadvertently blundering into war.\"\nIn response to Monday's olive branch from Kim, South Korea's president, Moon Jae-in, said he welcomed the news and possibility to turn the \"games into a groundbreaking chance to improve South-North relations and establish peace.\"\nAt the same time, South Korea's prime minister, Lee Nak-yon, was Quote: d as saying North Korea might now demand \"different treatment\" in discussions , Yonhap reported.\n\"Lee didn't elaborate on what 'different treatment' may mean, but it apparently indicates that the communist nation could demand the South treat it as a nuclear weapons-armed state,\" the South Korean news agency reported.\nTalks could involve a North Korean team participating in the upcoming PyeongChang Winter Olympic Games, which will be held about 50 miles from the border that divides the two Koreas.\n\"My question is what do the North Koreans want,\" said Kazianis. \"Every time North Korea comes to the table, they always want something for it.\"\nOne possibility is that North Korea may want the U.S. and South Korea to weaken sanctions, although that's unlikely to get any support from the Trump administration.\nIndeed, Trump on Tuesday morning tweeted: \"Sanctions and 'other' pressures are beginning to have a big impact on North Korea.\"\nhttps://twitter.com/realDonaldTrump/status/948194400114487296\nUnited Nations Security Council sanctions against North Korea are wide-ranging on trade and limit exports on such things as textiles, seafood and coal but also cut back oil and gasoline imports. Even so, Reuters last week reported that there have been at least three cases of Russian tankers in recent months transferring oil at sea for North Korea .\nKazianis said the South Koreans are \"in a bind with the Olympics. The North Koreans have a lot of ways to make the Olympics go very bad.\"\n\"So, I think Kim Jong Un probably realizes this and probably will go to the South Koreans on Jan. 9 and say, 'Look, I'm looking for sanctions relief or food aid or access to oil' or something like that,\" Kazianis said. \"The South Koreans might actually give it to him because they don't want to have billions of dollars in investment in the Winter Games be wrecked by, say, a North Korea nuclear test, an ICBM test or even some cyber-strikes.\"\nEven if Kim may appear to have the short-term leverage, though, experts say there are plenty of reasons to be wary.\n\"There's good reason to have skepticism about this offer by Kim Jong Un because of the timing,\"", "external_links": [], "published": "2018-01-03T02:18:00.000+02:00", "crawled": "2018-01-03T03:04:40.011+02:00", "highlightTitle": ""}