{"organizations": [], "uuid": "ddb8424943219b82cfdfd6f9a3df8ea1e4397df6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/mpw-revised-logo-2-42.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/31/female-founders-melania-trump/", "country": "US", "domain_rank": 1196, "title": "Female Founders, State of the Union, Janet Yellen: Broadsheet | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.297, "site_type": "news", "published": "2018-01-31T10:15:00.000+02:00", "replies_count": 0, "uuid": "ddb8424943219b82cfdfd6f9a3df8ea1e4397df6"}, "author": "Valentina Zarya", "url": "http://fortune.com/2018/01/31/female-founders-melania-trump/", "ord_in_thread": 0, "title": "Female Founders, State of the Union, Janet Yellen: Broadsheet | Fortune", "locations": [], "entities": {"persons": [{"name": "valentina zarya", "sentiment": "negative"}, {"name": "janet yellen", "sentiment": "negative"}, {"name": "melania", "sentiment": "none"}, {"name": "justin caldbeck", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "dave mcclure", "sentiment": "none"}, {"name": "steve jurvetson", "sentiment": "none"}], "locations": [], "organizations": [{"name": "binary capital", "sentiment": "none"}, {"name": "sotu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Valentina Zarya 8:15 AM EST \nGood morning, Broadsheet readers! Female founders are getting just a tiny percentage of VC dollars, working with guys has its advantages, and Melania’s solo appearance at the SOTU has the rumor mill spinning. Have a great Wednesday. EVERYONE'S TALKING \n• The two-percenters . Things are changing for women in the startup and venture capital world. Last year, a handful of them came forward to share their stories of facing sexual harassment and discrimination—and a number of the industry’s powerful men, including Binary Capital co-founder Justin Caldbeck, 500 Startups founder Dave McClure, and former Tesla board member Steve Jurvetson—lost their jobs as a result. \nBut while the #MeToo movement may be altering some aspects of the VC landscape, it hasn’t yet translated into many more dollars for female founders. All-women teams received just $1.9 billion of the $85 billion invested by venture capitalists last year, according to data from M&A, private equity, and VC database PitchBook. That’s equal to about 2.2% of 2017’s total pot. Meanwhile, all-male teams received about $66.9 billion—roughly 79%. (Of the remaining 19%, 12% of funds were raised by mixed-gender teams, while 7% was raised by teams whose gender makeup PitchBook was unable to confirm.) \nThe size of the gap is staggering, but there is a sliver of a silver lining: It’s a smaller gulf than last year. In 2016, female founders raised just $1.4 billion—or 1.9% of total VC funding. In fact, with the exception of 2014, 2017 marks the largest percentage of total venture dollars that has gone to female founders since PitchBook started tracking the data in 2006. \nIn terms of deal count, women-founded companies set a record last year, making up 4.4% of all VC deals—the largest percentage since 2006. Of course, the actual number of deals involving female-led startups is still dismally low (368 compared to 5,588 for all-male teams), and the gap between the percentage of deals and percentage of dollars that go to women hints at VCs writing smaller checks for female founders. The average deal size for a woman-led company in 2017 was just over $5 million. For a man-led company, that number was a little less than $12 million. \nThis is Fortune ‘s second examination of the gender gap in venture capital funding. Last year’s version of the story explores the reasons behind this gap. While there is no single definitive answer, female founders point to the lack of female VCs ( about 8% of partners at top VC firms are women) , the idea that women typically “ask for less” than men do, and the research that suggests that women tend to be judged on performance and men on potential—giving men a leg up when it comes to raising funds. \nTo read the full story, click here: Fortune ALSO IN THE HEADLINES \n• Melania goes rogue . Melania Trump, who hadn’t been seen in public since the Stormy Daniels report emerged (President Trump allegedly paid the porn star to keep quiet about an extramarital affair), reappeared at last night’s State of the Union address. She broke tradition in not arriving at the event with the president, causing speculation that there is a rift between the first couple. The White House, however, refutes the rumors and says she was not traveling with her husband because she was accompanying guests. CNN \n• A trailblazer’s tenure ends. Federal Reserve chair Janet Yellen ends her 14-year tenure this week, leading her last policy meeting yesterday and today. She was the first woman to head the central bank, and the WSJ says that from a policy standpoint, Yellen “will be remembered for reinforcing the Fed’s commitment to boosting employment.” Wall Street Journal \n• I’ll sit with the guys. Think working in a male-dominated workplace is bad for work-life balance? Working with all women might be even worse, concludes sociologist Heejung Chung in a newly-published paper in the European Journal of Industrial Relations. Using data from across 27 European countries, she found that “workers in female-dominated workplaces are paid less, and they are worse off in having access to family-friendly policies that enable them to maintain their careers while meeting demands at home.” Slate \n• They take her word for it . New York City-based Grameen America is a nonprofit microlender for women entrepreneurs. It’s a uniquely low-tech model: To get a Grameen loan, all you need is your reputation—or the support of a small group of Grameen loan recipients who can vouch for you. Since its 2008 launch in Queens, the organization has expanded to seven branches in the city and 12 additional U.S. cities serving more than 97,000 members. Wall Street Journal \nMOVERS AND SHAKERS: Hilary Schneider is the new CEO of dog-walking company Wag. Moody’s Corp. CFO Linda Huber is leaving the company after 12 years. Twilio is announcing the hire of a new CMO, Sara Varni . Vanessa Liu has joined SAP as the VP of the SAP.iO Foundry in New York. Debra Perelman has taken on the role of Revlon COO. IN CASE YOU MISSED IT \n• Millions of missing women . About 63 million women are statistically “missing” across India. Sex-selective abortions and better nutrition and medical care for boys have resulted in a population that is heavily skewed towards men, according to the government’s annual economic survey. Some Indian families dread having daughters, who are given less educational opportunities than men because they are seen as a financial liability (a woman’s parents have to pay a large marriage dowry). Associated Press \n• The beat goes on. The Atlantic’s Spencer Kornhaber writes a smart response to The Recording Academy’s suggestion that female musicians “step up,” enumerating the long list of allegations against music producers and artists (remember the horrifying charges against Russell Simmons and R. Kelly?). At least one group wants to keep #MeToo on the music world’s radar: Voices in Entertainment , founded by music industry insiders, was behind the white roses artists wore to the Grammys and is now “primarily focused on getting more women into positions of power in the music world.” The Atlantic \n• A bad harvest. The proportion of female farmworkers who have been sexually harassed or assaulted is a staggering 80%, according to one survey. One advocate called the problem a “pandemic.” One of the reasons it’s such a serious issue is the fact that so many farmworkers are illegal immigrants, making the balance of power even more uneven than in other industries. One woman describes the typical response as: “He has papers and you don’t, so there’s nothing you can do.” The Atlantic \n• Talking with Tiff. There are plenty of celebrity interviews out there, but this Q&A with comedian Tiffany Haddish is one of my favorite recent reads. Haddish talks about her upbringing in foster care, the period during which she was homeless and lived in her car, and how success is exactly what she thought it would be—except a little more tiring. “I’m so sleepy most of the time but I guess it’s ’cause I’m constantly doing things and trying to move forward and set up for the master plan. The master plan is to be like little baby Oprah, with my own production company, maybe my own channel, inspire millions. So, yeah. A little bit tiring from time to time.” ", "external_links": [], "published": "2018-01-31T10:15:00.000+02:00", "crawled": "2018-01-31T16:45:20.013+02:00", "highlightTitle": ""}