{"organizations": [], "uuid": "3af549ebd1d703da51778df92c94fe9eb116fb86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/bitcoin-price-rebound-2018-bitconnect.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/bitcoin-price-11000-10000-2018/", "country": "US", "domain_rank": 1196, "title": "Bitcoin Rebounds Above $11,000 After Bitconnect, South Korea Drama | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.292, "site_type": "news", "published": "2018-01-18T22:59:00.000+02:00", "replies_count": 0, "uuid": "3af549ebd1d703da51778df92c94fe9eb116fb86"}, "author": "Lucinda Shen", "url": "http://fortune.com/2018/01/17/bitcoin-price-11000-10000-2018/", "ord_in_thread": 0, "title": "Bitcoin Rebounds Above $11,000 After Bitconnect, South Korea Drama | Fortune", "locations": [], "entities": {"persons": [{"name": "lucinda shen", "sentiment": "negative"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Lucinda Shen 8:59 PM EST \nAfter falling to four digits earlier Wednesday, Bitcoin prices rebounded above $11,200 as some investors bought into the dip. \nDemonstrating the continued volatility of the digital asset, the price of Bitcoin added some $1,400 over the course of less than half a day on the biggest U.S.-based exchange, Coinbase. That put it in the green for the day, rising about 1%. \nThe cryptocurrency is still down roughly 19% this year to date with crackdowns in South Korea and China, as well as hacks and scam warnings pushing away investors . \nSouth Korean regulators are said to be considering a ban on cryptocurrency exchanges, while China is reportedly considering shuttering apps with exchange-like services after banning exchanges outright in 2017. Bitconnect, a popular though controversial exchange, meanwhile, spooked investors Wednesday with news that it was closing down—raising concerns of a scam. \nBloomberg reports that the Lunar New Year, which usually falls between late January and early February, may also be leading Asian investors, who are major players in the space, to trade in their cryptocurrency for cash as gifts to friends and relatives. \nFellow cryptocurrency Ethereum also pushed back above $1,000 after succumbing to the dip, while Ripple prices briefly rose above $2 after a tumble —resulting in a 14% net rise on Wednesday. Due to the rebounds, the value of all cryptocurrencies tracked by CoinMarketCap rose by $120 billion dollars in the course of roughly nine hours. \nThe rise comes with the Chicago Board Options Exchange saying that it plans to also look at offering other cryptocurrency futures , after first offering Bitcoin futures in early December. \nBut the question remains: With cryptocurrencies’ sharp rises and falls, will the current prices hold? SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T22:59:00.000+02:00", "crawled": "2018-01-18T08:23:11.024+02:00", "highlightTitle": ""}