{"organizations": [], "uuid": "c83547b587c81011c50a46a98dbe1f4700e5b25d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-hunton-williams-brings-on-virginia-commerce-and-trade-secretary-todd-p-haymore-to-launch-new-global-economic-development.html", "country": "US", "domain_rank": 767, "title": "Hunton & Williams Brings on Virginia Commerce and Trade Secretary Todd P. Haymore to Launch New Global Economic Development Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T22:00:00.000+02:00", "replies_count": 0, "uuid": "c83547b587c81011c50a46a98dbe1f4700e5b25d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-hunton-williams-brings-on-virginia-commerce-and-trade-secretary-todd-p-haymore-to-launch-new-global-economic-development.html", "ord_in_thread": 0, "title": "Hunton & Williams Brings on Virginia Commerce and Trade Secretary Todd P. Haymore to Launch New Global Economic Development Team", "locations": [], "entities": {"persons": [{"name": "todd p. haymore", "sentiment": "negative"}, {"name": "terry mcauliffe", "sentiment": "none"}, {"name": "haymore", "sentiment": "none"}, {"name": "wally martinez", "sentiment": "none"}, {"name": "todd", "sentiment": "none"}], "locations": [{"name": "richmond", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "richmond", "sentiment": "none"}], "organizations": [{"name": "hunton & williams llp", "sentiment": "negative"}, {"name": "launch new global economic development team", "sentiment": "negative"}, {"name": "hunton & williams brings on virginia commerce and trade", "sentiment": "negative"}, {"name": "hunton & williams", "sentiment": "none"}, {"name": "commerce and trade", "sentiment": "none"}, {"name": "government relations group", "sentiment": "none"}, {"name": "global economic development", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RICHMOND, Va.--(BUSINESS WIRE)-- Hunton & Williams LLP is pleased to announce that Todd P. Haymore , Virginia Secretary of Commerce and Trade under Gov. Terry McAuliffe, has joined the firm and will launch and lead its new Global Economic Development, Commerce and Government Relations Group. Haymore, the group’s managing director, will be based in the firm’s Richmond office and will start on March 1.\n“Given Todd’s leading role in facilitating economic development projects and international trade opportunities from positions in the private and public sectors, he has a deep understanding of the interface of business and government. He has worked with hundreds of global companies and knows the challenges they face with local, state and federal government, and also on the international stage,” Hunton & Williams Managing Partner Wally Martinez said. “His leadership of our new Global Economic Development, Commerce and Government Relations Group will help our clients navigate the numerous challenges they face as they execute their economic development and expansion strategies.”\nThe firm’s new group will draw on the experience of 10 of the firm’s key practices and will guide clients through discussions with all levels of government, negotiation of economic incentive packages, and execution of complex development strategies.\n“The intersection of business, commerce and government has been the focus of my entire career in the private and public sectors, and it is exciting to use my knowledge and experience to help companies do business and move products in the global marketplace,” Haymore said. “I’ve also always regarded Hunton & Williams as the gold standard of legal and business counsel, and I’m thrilled to make it my home after serving three governors as a state executive over the last decade.”\nAs Virginia’s chief economic and workforce development officer under McAuliffe, Haymore oversaw the state’s 13 commerce and trade agencies, including the Virginia Economic Development Partnership, and worked with the state’s executive branch, the General Assembly, private companies and other key stakeholders. A veteran of more than 50 national and international gubernatorial trade and marketing missions, Haymore assisted companies looking to grow their business in the global marketplace through new or increased export opportunities. He also served as McAuliffe’s point person for the “new Virginia economy” diversification effort and led the state’s coordinated economic development team. Under his leadership, Virginia saw record-breaking capital investment of nearly $20 billion from more than 1,000 economic development projects from this initiative.\n“Todd is a natural leader for our clients’ economic development efforts,” said Randall S. Parks , co-leader of the firm’s corporate team. “This new group will blend a wide range of practice areas in the United States, Europe and Asia and help our clients and others expand their operations and enter new markets in the United States and abroad.”\nHaymore has spent more than a decade in public service in Virginia in several bipartisan positions, most recently being appointed as the state’s commerce and trade secretary in 2016 by McAuliffe, a Democrat. Prior to that, he served as Secretary of Agriculture and Forestry under McAuliffe and his Republican predecessor, Gov. Bob McDonnell. Haymore was only the second person to hold that post when McDonnell appointed him in 2010. He also served as commissioner of the Virginia Department of Agriculture and Consumer Services under Democratic Gov. Tim Kaine.\nBefore his state government career, Haymore was an executive with Universal Leaf Tobacco Corp. and DIMON Inc., two of the world’s largest global leaf tobacco merchants. He also was legislative assistant and press secretary to former U.S. Rep. L.F. Payne (D-Va.), and deputy campaign manager and communications director for Payne’s bid for lieutenant governor in 1997. He received his undergraduate degree from the University of Richmond and a master’s in business administration from Virginia Commonwealth University.\nAbout Hunton & Williams LLP\nHunton & Williams is a global law firm of more than 725 lawyers serving clients in the United States, Europe, Latin America and Asia. The firm handles transactional, litigation and regulatory matters for a diverse client base, with significant experience in retail and consumer products, energy, financial services, real estate, and privacy and cybersecurity. Visit www.hunton.com and follow us on Twitter , LinkedIn and YouTube .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111005924/en/\nHunton & Williams LLP\nZinie Sampson, 804-381-1272\nzsampson@baretzbrunelle.com\nSource: Hunton & Williams LLP", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FHunton_Williams&esheet=51742100&newsitemid=20180111005924&lan=en-US&anchor=Twitter&index=4&md5=3dea2502aadaca2be98b904af3acfdea", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.hunton.com%2Fen%2Fpeople%2Frandall-parks.html&esheet=51742100&newsitemid=20180111005924&lan=en-US&anchor=Randall+S.+Parks&index=2&md5=9731dacd95f823249a25418f338d084e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.linkedin.com%2Fcompany%2F7494%3Ftrk%3Dtyah&esheet=51742100&newsitemid=20180111005924&lan=en-US&anchor=LinkedIn&index=5&md5=2be716a0dd98cbb66ff82bce860d54f9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.hunton.com%2Fen%2Fpeople%2Fwally-martinez.html&esheet=51742100&newsitemid=20180111005924&lan=en-US&anchor=Wally+Martinez&index=1&md5=d71cf85d4a7a0ed05ead74620f86d90d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.youtube.com%2Fuser%2Fhuntonandwilliams%3Ffeature%3Dwatch&esheet=51742100&newsitemid=20180111005924&lan=en-US&anchor=YouTube&index=6&md5=e699dffd1b972faed853ea3a056a388a", "http://www.businesswire.com/news/home/20180111005924/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.hunton.com&esheet=51742100&newsitemid=20180111005924&lan=en-US&anchor=www.hunton.com&index=3&md5=40dc51a08186788c7d1490585f8eee95"], "published": "2018-01-11T22:00:00.000+02:00", "crawled": "2018-01-11T23:46:51.000+02:00", "highlightTitle": ""}