{"organizations": [], "uuid": "8fd65f15bae72df55adad052750357136a702537", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225478589&w=1200&r=LYNXMPEE0P0S5", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-russia-sanctions-explainer/moscow-markets-ready-for-possible-fresh-u-s-sanctions-idUKKBN1FF1L6", "country": "US", "domain_rank": 408, "title": "Moscow, markets ready for possible fresh U.S. sanctions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T14:46:00.000+02:00", "replies_count": 0, "uuid": "8fd65f15bae72df55adad052750357136a702537"}, "author": "", "url": "https://uk.reuters.com/article/uk-russia-sanctions-explainer/moscow-markets-ready-for-possible-fresh-u-s-sanctions-idUKKBN1FF1L6", "ord_in_thread": 0, "title": "Moscow, markets ready for possible fresh U.S. sanctions", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "jack stubbs", "sentiment": "none"}, {"name": "simon jessop", "sentiment": "none"}, {"name": "sujata rao", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "crimea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "kremlin", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 12:47 PM / Updated 22 minutes ago Moscow, markets ready for possible fresh U.S. sanctions Jack Stubbs , Simon Jessop , Sujata Rao 6 Min Read \nMOSCOW/LONDON (Reuters) - The United States could release reports as early as Monday detailing the possibilities for expanding sanctions against Russia, including a list of prominent oligarchs and potential restrictions on the holding of Russian government debt. \nThe reports are part of a sanctions bill passed overwhelmingly by Congress soon after U.S. President Donald Trump took office and signed by him in August last year, despite campaign pledges to improve ties with Russia. WHAT ARE THE SANCTIONS? \nThe Aug. 2 sanctions bill expands and toughens those already in force against Russia in response to its annexation of Crimea from Ukraine in 2014, and support for separatist rebels fighting in the east of the country. \nIt is intended to further punish Moscow for its alleged meddling in the 2016 U.S. presidential election, an accusation the Kremlin has repeatedly denied. \nThe bill requires the U.S. Treasury Department to prepare a list of the most significant Russian oligarchs “as determined by their closeness to the Russian regime and their net worth”. \nThis will be accompanied by a report “describing in detail the potential effects of expanding sanctions ... to include sovereign debt and the full range of derivative products.” \nBoth reports are due to be sent to Congress by the end of January, weeks before Russia is due to vote in a presidential election which Vladimir Putin is widely expected to win. WHAT ARE THE POSSIBLE CONSEQUENCES? \nWhile inclusion on the new list of individuals would not automatically lead to immediate sanctions, some members of Russia’s business elite have said being named is a major concern because the criteria and consequences are unclear. \nIf sanctions are tightened later, based on the list due next week, this could prevent some of the Kremlin’s closest allies from travelling abroad or accessing foreign bank accounts. It may also trigger a freeze of foreign assets and make foreign politicians, banks and officials reluctant to have dealings with them. \nSuch risks have already prompted some of Russia’s wealthiest people to distance themselves from Putin. \nExpanding sanctions to cover debt and derivative products issued by the Russian government could impose restrictions on buying Russian treasury bonds, known as OFZs. \nRouble-denominated OFZ bonds are popular with international investors because of their lucrative yields. Foreign investors held 2.2 trillion roubles ($39 billion) of OFZs as of Dec. 1 last year. \nRussian officials have played down the possible consequences of sanctioning OFZs and other debt instruments, but doing so could make it harder for the government to cover its budget deficit at a time when the economy is still fragile as a result of a two-year economic downturn. HOW ARE MARKETS REACTING? The sun sets over the main building of the Lomonosov Moscow State University (C) and Kremlin towers in Moscow, Russia January 9, 2018. REUTERS/Maxim Shemetov \nThe country’s economic malaise, multiple bank bail-outs and concerns about fresh sanctions weighed on the relative performance of Russia’s main stock market last year, although a recovering oil price has helped cushion the impact. \nWith key export crude oil hitting 3-year highs in recent weeks both the rouble and Russian stocks have risen - the main MOEX index is at a record high - although some say sanctions worries have still hampered gains. \nDemand for its high-yielding sovereign debt has remained consistently strong. At the end of December, foreigners held 32.1 percent of issued debt, just off the record high of 33.2 percent hit in October. \nAnalysts at Bank of America say U.S. curbs on bond buying would lead to “material” pressure, although they - like most investors - consider it unlikely. \nIn defensive mode since the first round of sanctions, many Russian firms are sitting on healthier cash piles this time or have gone into the market to raise more, suggesting the broad-market impact of further sanctions could be more muted. \nRussian companies raised around $8 billion via share sales in 2017, more than double the amount raised in the prior year. \nThey have also been active on the debt markets, raising as much as $2 billion through Eurobond issues in the first weeks of 2018 already, while others have looked to firm up lines of credit with their banks. \nOn Thursday, Norilsk Nickel ( GMKN.MM ) said it had agreed fresh credit lines with several Russian banks in case sanctions contribute to any worsening of its business outlook. WHAT ARE INVESTORS SAYING? \nA number of international investors said their working assumption is that the reports provide fresh information on already sanctioned individuals and suggest others to be included. \nAs such, few expect a sustained market-wide sell-off of Russian assets. The bigger risk is seen as stock-specific and depends on the names added and their corporate connections. \nEven if fresh sanctions are not imposed, some are concerned the names form a ‘grey list’ to be avoided in case they are sanctioned later, potentially crimping business anyway. \n“A lot of companies are either state-run or owned by private individuals that’s why we have deliberately reduced exposure and only invest in companies that don’t face these risks,” said Richard Farrell, Portfolio Manager of Emerging Market Equities at Royal Bank of Canada Global Asset Management. \nWhile some have trimmed exposure to Russian assets, others are waiting to see exactly what form the sanctions take - and how the Kremlin responds - before acting. \n“Without knowing ... it is very difficult to take any measures or speculate about a potential impact on the investment risk,” Swedbank Robur Russia Fund, Elena Lovén said. \n($1 = 55.8120 roubles) Additional reporting by Karin Strohecker in London, Olga Popova and Katya Golubkova in Moscow; Editing by Giles Elgood", "external_links": [], "published": "2018-01-26T14:46:00.000+02:00", "crawled": "2018-01-26T14:58:10.008+02:00", "highlightTitle": ""}