{"organizations": [], "uuid": "561bafd77cac46bffc703c1872c4ef70fc948460", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/06/104264438-IMG_7938.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/20/trump-tech-and-immigration-h-1b-issue-maybe-common-ground.html", "country": "US", "domain_rank": 767, "title": "Trump, tech, and immigration: H-1B issue maybe common ground", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T20:08:00.000+02:00", "replies_count": 0, "uuid": "561bafd77cac46bffc703c1872c4ef70fc948460"}, "author": "Aditi Roy", "url": "https://www.cnbc.com/2018/01/20/trump-tech-and-immigration-h-1b-issue-maybe-common-ground.html", "ord_in_thread": 0, "title": "Trump, tech, and immigration: H-1B issue maybe common ground", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}, {"name": "satya nadella", "sentiment": "none"}, {"name": "sundar pichai", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "sudan", "sentiment": "none"}, {"name": "somalia", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "national foundation for american policy", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration has been the biggest flash point between President Trump and the tech community during the president's first year in office.\nThe issue is somewhat personal: More than half of the privately held tech companies with $1 billion valuations have at least one immigrant founder, according to the National Foundation for American Policy.\nTech leaders have used social media, internal memos, and most consequentially, legal briefs to voice their opposition to the administration's policies.\nThe clashes began early in the administration, starting when President Donald Trump issued his original travel ban in January 2017, preventing citizens of Iraq, Syria, Iran, Libya, Somalia, Sudan and Yemen from entering the country. Trump's travel ban was blocked by multiple federal judges. The Supreme Court allowed it to go into effect in December 2017 while legal challenges continue in lower courts .\nTech leaders, including Google CEO Sundar Pichai , Microsoft CEO Satya Nadella and Facebook CEO Mark Zuckerberg sent memos to their staff and posted criticisms on social media.\nDays later, Google employees staged a protest at the company's Mountain View headquarters, where both Google co-founder Sergey Brin and Pichai spoke to employees. And 160 tech companies signed a brief against the President's travel ban.\nTech leaders have been similarly vocal on DACA, which allows undocumented immigrants who came to the U.S. as children to stay in the country. After the Trump administration announced plans to end DACA in September, executives from Jeff Bezos to Marc Benioff signed a letter to the President and just last week , another one to Congress, asking lawmakers to preserve the program.\nhttps://twitter.com/tim_cook/status/904322640654897152 \nHowever, tech has been relatively silent on one issue: H-1B visas. With pending legislation, the topic might be an area where the two sides come together this spring.\nCongressman Darrell Issa, a Republican from California who announced his retirement last week, is sponsoring a bill that would reform the H-1B system, which provides work visas for foreign workers in \"specialty\" occupations, including technical positions that are in demand at many tech companies.\nCritics argue the current system favors Indian outsourcing firms, which keep wages for workers low. Companies then replace American workers with H-1B visa holders, critics say.\nIssa's bill would raise the salary requirements and close loopholes to prevent companies from replacing American workers with H-1B visa holders.\nCurrently, the U.S. issues 85,000 new H-1B visas per year, and the number of applications per year is roughly triple that. About 65 percent of all H-1B visas go to \"computer-related\" tech jobs, according to a report from Goldman Sachs . \nThe bill has bipartisan support: Democratic Representative Zoe Lofgren, whose district includes San Jose, in the heart of Silicon Valley, is co-sponsoring the legislation. It is also endorsed by the San Jose Mercury News.\nTech companies have not yet endorsed the bill. But it could be an opportunity for President Trump and tech leaders to find common ground on one immigration issue.", "external_links": [], "published": "2018-01-20T20:08:00.000+02:00", "crawled": "2018-01-20T20:53:37.007+02:00", "highlightTitle": ""}