{"organizations": [], "uuid": "31b3f252fca0e69c296b36c10d85e866c78e0dd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/12/reuters-america-global-markets-dollar-hits-three-year-low-vs-euro-wall-st-hits-new-highs.html", "country": "US", "domain_rank": 767, "title": "GLOBAL MARKETS-Dollar hits three-year low vs euro; Wall St hits new highs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T00:41:00.000+02:00", "replies_count": 0, "uuid": "31b3f252fca0e69c296b36c10d85e866c78e0dd4"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/12/reuters-america-global-markets-dollar-hits-three-year-low-vs-euro-wall-st-hits-new-highs.html", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Dollar hits three-year low vs euro; Wall St hits new highs", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "jpmorgan chase & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro surges on ECB tapering hopes; sterling up\n* Wall St hits record highs on earnings optimism, data\n* U.S. yields up on inflation, 2-year highest since 2008 crisis\n* Oil prices rise for a sixth day (Updates with U.S. markets' closing levels)\nNEW YORK, Jan 12 (Reuters) - The U.S. dollar fell to a more than three-year low against the euro on Friday, extending recent losses on expectations European Central Bank policymakers are preparing to reduce stimulus, while U.S. stocks continued to rally and marked record closing highs.\nOptimism about fourth-quarter earnings boosted stocks. Bank shares climbed following quarterly results from JPMorgan Chase & Co and Wells Fargo. A global stock index registered an eighth straight week of gains.\nThe euro's rise weighed on the dollar index, which measures the greenback against six rival currencies. The index was down 1 percent, after slipping to a four-month low of 90.954.\nFor the year, the dollar index was down 1.28 percent, its worst performance over a year's first nine trading days since 2010, according to Reuters data. \"The latest ECB comments were a bit on the hawkish side, so that's giving more life to the euro,\" said Minh Trang, senior currency trader at Silicon Valley Bank in Santa Clara, California.\nSterling rocketed to its highest level against the dollar since the Brexit vote to leave the European Union after a report that the Netherlands and Spain were open to a deal for Britain to remain as close as possible to the trading bloc. Sterling was last trading at $1.3731, up 0.03 percent.\nThe S&P 500 and Nasdaq both registered an eighth record closing high out of the first nine trading days of 2018, while the Dow boasted its sixth closing high of the year.\nData showing robust U.S. retail sales drove investor optimism about economic growth, also boosting sentiment in the stock market.\n\"It seems like the economy is going OK, inflation is kind of nonexistent right now, wage growth is not an issue for most income statements, so what's not to like here?\" said Stephen Massocca, senior vice president at Wedbush Securities in San Francisco.\nThe Dow Jones Industrial Average rose 228.46 points, or 0.89 percent, to 25,803.19, the S&P 500 gained 18.68 points, or 0.67 percent, to 2,786.24, and the Nasdaq Composite added 49.29 points, or 0.68 percent, to 7,261.06.\nThe pan-European FTSEurofirst 300 index rose 0.23 percent, and MSCI's gauge of stocks across the globe gained 0.66 percent.\nA robust U.S. inflation report boosted Treasury yields.\nThe two-year yield, sensitive to traders' views on interest rates, rose to more than 2 percent for the first time since the financial crisis.\nIn commodities, oil prices rose for a sixth day after Russia's oil minister said global crude supplies were \"not balanced yet,\" alleviating market concerns about a wind-down of the OPEC-led deal to reduce production.\nU.S crude oil rose 50 cents to settle at $64.30 a barrel, while Brent rose 61 cents to settle at $69.87.\n(Additional reporting by Marc Jones in Helen Reid in London and Kate Duguid and Saqib Aqbal Ahmed in New York; Editing by Nick Zieminski and Leslie Adler)", "external_links": [], "published": "2018-01-13T00:41:00.000+02:00", "crawled": "2018-01-13T06:15:26.015+02:00", "highlightTitle": ""}