{"organizations": [], "uuid": "55fcc9e9239638bbbf635c317a730d6b307127a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223388677&w=1200&r=LYNXMPEE0I18X", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-global-economy/at-a-three-year-high-euro-faces-ecb-scrutiny-idUSKBN1F822X", "country": "US", "domain_rank": 408, "title": "At a three-year high, euro faces ECB scrutiny", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:50:00.000+02:00", "replies_count": 0, "uuid": "55fcc9e9239638bbbf635c317a730d6b307127a7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-economy/at-a-three-year-high-euro-faces-ecb-scrutiny-idUSKBN1F822X", "ord_in_thread": 0, "title": "At a three-year high, euro faces ECB scrutiny", "locations": [], "entities": {"persons": [], "locations": [{"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "governing council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - After hitting a three-year high against the dollar, the strong euro is likely to preoccupy global markets and European Central Bank policymakers in particular in the coming week.\nThe ECB, whose Governing Council meets on Thursday, last expressed concern over the single currency in September, when it said exchange rate volatility was an uncertainty that required “monitoring”.\nThen the euro had only briefly nudged beyond $1.20.\nIn the last week it has surpassed $1.23, and is now some 4 percent higher than when ECB policymakers met in December, although on a trade-weighted basis the euro’s rise is not as steep.\nIts January surge followed the release of minutes from the December ECB meeting showing the bank intended to revisit its policy message in early 2018, prompting markets to price in a 70 percent chance of a rise in interest rates by the end of the year. The ECB last hiked rates in 2011.\nReuters reported on Wednesday that the ECB was unlikely to ditch its pledge to keep buying bonds at its January meeting.\nPublic comments in the past week show its policymakers are growing more alert to the euro’s strength. Vice-President Vitor Constancio said that, while the ECB did not have an exchange rate target, he was concerned by sudden movements that did not reflect changes in fundamentals.\nAustrian central bank chief Ewald Nowotny called the euro’s gains against the dollar “not helpful”.\nPAIN THRESHOLD European firms used to express more concern about the euro crossing what they called the pain threshold, curbing exports and so overall growth. The euro zone economy is currently motoring along at a decade-high pace of 2.5 percent per year.\nCarsten Brzeski, Frankfurt-based economist for ING, says the impact of a strong euro on growth has steadily faded as an increasing number of invoices are denominated in euros and companies are more active hedging their currency exposure.\n“This time it matters more for inflation than for growth,” he said.\nSustained euro strength, he said, would reduce the ECB’s inflation assumptions this year and next - 1.4 and 1.5 percent respectively - by 0.2 percentage points. This would move them further from the ECB target of close to but below 2 percent and reduce the prospects of an early and sudden end to quantitative easing.\nIndeed, the most recent euro zone inflation figures vindicate the ECB’s easy policy stance. The rate in December fell to 1.4 percent from 1.5 percent in November and underlying inflation, excluding volatile energy, food, alcohol and tobacco, was a mere 0.9 percent for the third month in a row.\nThe euro might not have hit a pain threshold yet, but ECB policymakers will not want to encourage any further rise.\nJan von Gerich, economist at Nordea Markets, suggests ECB President Mario Draghi will sound a shade less optimistic than in December to convince markets that the next rate hike is not coming sooner and to stop the euro from rising further.\n“We expect to see some downside pressure on the euro and bond yields in response to the ECB’s immediate message next week,” he said in a note on Thursday.\nAMERICA FIRST The Bank of Japan, with a two-day meeting ending on Tuesday, is also seen keeping policy on hold, including a pledge to keep short-term interest rates at minus 0.1 percent, while painting a slightly better picture of the economy.\nIn the United States, whose Federal Reserve meets at the very end of January, data should show an economy racing on, with annualized growth forecast to be at least 3 percent for the third consecutive quarter in the Oct-Dec period.\nConsumer spending has been strong and business investment solid.\nU.S. President Donald Trump may see such a rate as confirmation that he is making America great again.\nHarm Bandholz, chief U.S. economist of UniCredit, tempers the optimism, saying a range of factors, including inventories, trade, oil and the savings rate, are providing temporary boosts and will fade.\nWithout a planned tax cut, another temporary boost, Bandholz says growth would fall back to 2-2.5 percent by mid-2018, towards what he sees as potential U.S. growth of 1.5-2 percent.\nOn the trade front, the coming week may also see more signals about Trump’s “America First” stance.\nU.S., Canadian and Mexican negotiators will convene in Montreal from Tuesday in talks to update the North American Free Trade Agreement.\nProspects for the talks are unclear. Trump told Reuters on Wednesday that terminating NAFTA would result in the “best deal” to revamp the pact, which he blames for Mexico’s large trade surplus with the United States. Economists polled by Reuters, however, broadly expect NAFTA to be renegotiated with only minor changes.\nThe week will close with the president himself delivering a highly anticipated speech on last day of the World Economic Forum at Davos in the Swiss Alps.\nAdditional reporting by Balazs Koranyi in Frankfurt; Editing by Hugh Lawson\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T00:50:00.000+02:00", "crawled": "2018-01-20T17:27:02.023+02:00", "highlightTitle": ""}