{"organizations": [], "uuid": "8879879f1dea85a4869ffac997871d1cdf36116c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224423776&w=1200&r=LYNXMPEE0M0KE", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-turkey/turkey-seeks-no-clash-with-russia-syria-u-s-but-will-pursue-syria-goals-minister-idUKKBN1FC11H", "country": "US", "domain_rank": 408, "title": "Turkey seeks no clash with Russia, Syria, U.S., but will pursue Syria goals - minister", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T11:54:00.000+02:00", "replies_count": 0, "uuid": "8879879f1dea85a4869ffac997871d1cdf36116c"}, "author": "", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-turkey/turkey-seeks-no-clash-with-russia-syria-u-s-but-will-pursue-syria-goals-minister-idUKKBN1FC11H", "ord_in_thread": 0, "title": "Turkey seeks no clash with Russia, Syria, U.S., but will pursue Syria goals - minister", "locations": [], "entities": {"persons": [{"name": "tayyip erdogan", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "afrin", "sentiment": "none"}, {"name": "manbij", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "operation olive branch", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "free syrian army", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 9:59 AM / Updated 6 minutes ago Turkey kills at least 260 Kurdish, Islamic State fighters in Syria offensive - military Ece Toksabay , Ellen Francis , Tuvan Gumrukcu 7 Min Read \nANKARA/BEIRUT (Reuters) - Turkey has killed at least 260 Syrian Kurdish fighters and Islamic State militants in its four-day-old offensive into the Kurdish-dominated Afrin region of northwest Syria, the Turkish military said on Tuesday. \nU.S. President Donald Trump plans to raise concerns with Turkish President Tayyip Erdogan in a phone call expected on Wednesday about Ankara’s offensive against U.S.-backed Kurdish YPG forces in Afrin, a senior U.S. official said. \nFrench President Emmanuel Macron also voiced disquiet, a few hours after Turkey’s foreign minister said it wanted to avoid any clash with U.S., Russian or Syrian government forces during its offensive but would do whatever necessary for its security. \nThe air and ground operation has opened a new front in Syria’s multi-sided civil war and could threaten U.S. plans to stabilise and rebuild a large area of northeast Syria - beyond President Bashar al-Assad’s control - where Washington helped a force dominated by the YPG to drive out Islamic State militants. \nThe United States and Russia both have military forces in Syria backing opposing sides and have called for restraint on the part of Ankara’s “Operation Olive Branch” to crush the YPG in the Afrin region near Turkey’s southern border. \nA senior Trump administration official, who briefed reporters on condition of anonymity, said Ankara had sent “conflicting signals” about the scope of the offensive. \n“We’re going to have to see how this develops on the ground. But our message has been unified. We would appreciate it and we would urge them to limit the incursion as much as possible.” \nThe official said the phone call would happen soon. Another official - as well as Turkey’s foreign minister - said Erdogan and Trump planned to speak on Wednesday. \nA statement by Macron’s office said: “Taking into account Turkey’s security imperatives, the president expressed to his Turkish counterpart his concerns following the military intervention launched on Saturday in Afrin.” \nErdogan told Macron on Tuesday Turkey was taking all measures to prevent civilian casualties in the Afrin operation, sources at the presidential palace said. The two leaders agreed to stay in close contact on the issue. \nThe Kremlin said President Vladimir Putin had also discussed Turkey’s military operation Erdogan by phone and that Syria’s territorial integrity and sovereignty had to be respected. \nA Kremlin statement said both men stressed the importance of continuing their two countries’ joint work to try to find a peaceful resolution to Syria’s crisis. Russia has been Assad’s most powerful ally against rebels and militants in Syria. \nTurkish Foreign Minister Mevlut Cavusoglu reiterated Ankara’s demand that Washington stop supporting the YPG. \nAnkara has said the operation will be swift, but Erdogan’s spokesman signalled an open-ended cross-border campaign, saying it would end only when some 3.5 million Syrian refugees now living in Turkey could safely return home. \nThe United States hopes to use the YPG’s control in northern Syria to give it the diplomatic muscle it needs to revive U.N.-led talks in Geneva on a deal that would end Syria’s civil war. NEAR BREAKING POINT Turkish army tanks and armoured personnel carriers (APC) are seen near the Turkish-Syrian border in Hatay province, Turkey January 23, 2018. REUTERS/Umit Bektas \nAnkara has been infuriated by the U.S. support for the YPG, which is one of several issues that have brought ties between Washington and its Muslim NATO ally close to breaking point. \n“The future of our relations depends on the step the United States will take next,” Cavusoglu said. \nTurkey’s military, the second largest in NATO, has conducted air strikes and artillery barrages against targets in Afrin, and its soldiers and allied Syrian rebels tried to thrust into the Kurdish-held district from west, north and eastern flanks. \nWith heavy cloud hindering air support in the last 24 hours, advances have been limited and Kurdish militia have retaken some territory. Turkish troops and the Syrian fighters have been trying to take the summit of Bursaya Hill, overlooking the eastern approach to Afrin town. \nThe Syrian Observatory for Human Rights, a Britain-based war monitor, said 23 civilians had been killed in Turkish shelling and air strikes, and thousands were fleeing the fighting. \nHowever, Syrian government forces were preventing people from crossing government-held checkpoints to reach the Kurdish-held districts of nearby Aleppo city, it said. Slideshow (3 Images) YPG THREAT \nU.S. Defense Secretary Jim Mattis said Turkey’s offensive was distracting from efforts to defeat Islamic State. \nAnkara says the jihadist group is largely finished in Syria and that the greater threat comes from the YPG, which it sees as an extension of a Kurdish group that has waged a decades-long separatist insurgency inside Turkey. \nErdogan has said Turkey aims to destroy YPG control not just in the Afrin enclave but also in the mainly Arab town of Manbij to the east. “Terrorists in Manbij are constantly firing provocation shots. If the United States doesn’t stop this, we will stop it,” Cavusoglu was reported as saying on Tuesday. \n“Our goal is not to clash with Russians, the Syrian regime or the United States, it is to battle the terrorist organisation,” broadcaster Haberturk quoted him as saying. Related Coverage", "external_links": [], "published": "2018-01-23T11:54:00.000+02:00", "crawled": "2018-01-23T12:21:58.009+02:00", "highlightTitle": ""}