{"organizations": [], "uuid": "2bc102a2b5281ba1f24098cb1468ddfddb7c659d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-stroke-clot-guidelines/updated-stroke-guidelines-expand-window-for-clot-removal-clot-busting-drugs-idUSKBN1FE361", "country": "US", "domain_rank": 408, "title": "Updated stroke guidelines expand window for clot removal, clot-busting drugs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:26:00.000+02:00", "replies_count": 0, "uuid": "2bc102a2b5281ba1f24098cb1468ddfddb7c659d"}, "author": "", "url": "https://www.reuters.com/article/us-health-stroke-clot-guidelines/updated-stroke-guidelines-expand-window-for-clot-removal-clot-busting-drugs-idUSKBN1FE361", "ord_in_thread": 0, "title": "Updated stroke guidelines expand window for clot removal, clot-busting drugs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "gene emery", "sentiment": "negative"}, {"name": "heart association", "sentiment": "none"}, {"name": "american stroke association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - Many people who wake up with stroke symptoms may find doctors reluctant to provide some treatments because guidelines put a time limit on when they can be given effectively, and sleepers don’t know when their symptoms appeared.\nThat’s going to change.\nThe American Heart Association (AHA) and the American Stroke Association (ASA) have issued updated guidelines expanding the time frame for giving state-of-the-art treatments in the wake of new evidence that some patients can recover even if a large blood clot lodged in their brain 24 hours earlier.\nOne change is expected to dramatically expand the number of patients eligible for an aggressive stroke therapy - a clot-remove procedure known as thrombectomy. It involves threading a tube through an artery to the site of the clot so the blockage can be physically gripped and pulled out through the tube.\nAnother change clears the way for people with mild strokes to receive a clot-busting drug known as alteplase. That treatment is supposed to be done within four and a half hours. The updated guidelines leave the decision on alteplase use up to the doctor based on evidence that the drugs can reduce disability if given quickly to some patients.\n“A lot of patients come into smaller community settings where they may be treated by clot-busting medications. In the past they were never sent on to centers where we could do mechanical thrombectomy and re-establish flow,” said Dr. Howard Riina, director of the New York University Langone Health Center for Stroke and Neuromuscular Disease, who was not involved in writing the new guidelines.\n“Now, because of these guidelines, a lot of these centers will be able to send many more patients to that next level of care, a lot of additional tissue can be saved, patients will have increased survival and, hopefully, better recovery,” he told Reuters Health by phone.\nThe new guidelines, which conform to what many stroke centers have already been doing, according to Riina, are not a license to roll back the urgency of rapid treatment for stroke patients.\nIn fact, one new guideline urges hospitals that don’t have immediate access to stroke specialists to use real-time videoconferencing to quickly get expert guidance. Research shows that the strategy can dramatically improve care, according to the AHA.\n\"Every stroke patient is unique in the way stroke progresses,\" said Dr. Gregory Albers, director of the Stanford Stroke Center in Palo Alto, California, and coauthor of the DEFUSE 3 study, which was released earlier this week and helped spark a change in the guidelines. ( reut.rs/2GgKudx )\nUntil you do a brain scan, “You don’t know who is losing 2 million neurons a minute and who is lucky enough to have good collateral circulation so the stroke is not growing for many hours,” he told Reuters Health.\nUntil now, the usual time limit for clot removal was six hours.\nThe guidelines say that if the clot is in a large blood vessel feeding the brain, doctors should, in most cases, try to remove it even if 16 hours have passed since the onset of symptoms.\n“That’s a big deal,” said Dr. William Powers of the University of North Carolina in Chapel Hill, chairman of the guideline-writing group. “That’s potentially a lot more people who could benefit, and it has completely changed the landscape of acute stroke treatment.”\n“The expanded time window for mechanical thrombectomy for appropriate patients will allow us to help more patients lower their risk of disability from stroke,” he said in a statement.\nEven the 16-hour time limit might be too restrictive. Another study, released in November and known as DAWN, found that patients could benefit even after 24 hours had passed. But that study was more selective in the patients it treated.\nIn both DAWN and DEFUSE 3, doctors used special software to determine how much of the brain had actually died from lack of blood flow, and how much was damaged but still viable.\nWhen giving a clot-busting drug, according to the new guidelines, doctors need to weigh the risk and benefits in individual patients because clot-dissolvers can cause dangerous bleeding.\nLike the last major update to the guidelines in 2013, the emphasis in the new guidance is on getting stroke victims to a hospital quickly.\n“It’s better to call 911 than to have somebody drive a stroke patient to the hospital. Hospitals are set up to immediately treat acute stroke patients arriving by ambulance,” Powers said in his statement. “In many patients, getting to the hospital quickly is the difference between living a life of disability or one free of disability from stroke.”\nThe guidelines only cover strokes caused by a blood clot, which account for 87 percent of strokes. The other major cause of stroke is bleeding in the brain.\nThe updated guidelines were released at the American Stroke Association’s International Stroke Conference in Los Angeles.\nSOURCE: bit.ly/2Bq5Bqc Stroke, online January 24, 2018.\n ", "external_links": [], "published": "2018-01-26T00:26:00.000+02:00", "crawled": "2018-01-26T00:43:05.007+02:00", "highlightTitle": ""}