{"organizations": [], "uuid": "f5fb7d3337178728c05367e24e8cb4ba7112d56a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 30}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226761231&w=1200&r=LYNXMPEE0U00Y", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-xeroxcorp-m-a-fujifilmholdingscorp/fujifilm-nears-deal-with-xerox-wsj-idUKKBN1FK02D", "country": "US", "domain_rank": 408, "title": "Fujifilm nears deal with Xerox - WSJ", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T02:24:00.000+02:00", "replies_count": 0, "uuid": "f5fb7d3337178728c05367e24e8cb4ba7112d56a"}, "author": "", "url": "https://uk.reuters.com/article/uk-xeroxcorp-m-a-fujifilmholdingscorp/fujifilm-nears-deal-with-xerox-wsj-idUKKBN1FK02D", "ord_in_thread": 0, "title": "Fujifilm nears deal with Xerox - WSJ", "locations": [], "entities": {"persons": [{"name": "diptendu lahiri", "sentiment": "none"}, {"name": "sandra maler", "sentiment": "none"}], "locations": [{"name": "bengaluru", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "xerox - wsj reuters", "sentiment": "negative"}, {"name": "xerox - wsj", "sentiment": "negative"}, {"name": "fujifilm", "sentiment": "negative"}, {"name": "fujifilm holdings corp", "sentiment": "none"}, {"name": "xerox", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "xerox corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 12:25 AM / Updated 30 minutes ago Fujifilm says to slash 10,000 jobs at Xerox joint venture, after report on new deal Reuters Staff 3 Min Read \n(Reuters) - Japan’s Fujifilm Holdings ( 4901.T ) said it is cutting 10,000 jobs globally at its joint venture with Xerox Corp ( XRX.N ) to cope with a decline in the photocopying business, amid speculation of a new deal between the two companies. \nFujifilm owns 75 percent of the joint venture, called Fuji Xerox, which accounts for nearly half of the Japanese company’s sales and operating profit. Fuji Xerox had over 47,000 employees as of March 2017, according to its website, meaning the job cuts would likely slash its workforce by more than a fifth. \nXerox Corp owns the remaining 25 percent of Fuji Xerox and has faced pressure from investors to explore strategic options and negotiate better terms on the venture with Fujifilm. \nThe Japanese company’s job cuts announcement comes after the Wall Street Journal, citing people familiar with the matter, reported that Xerox Corp is nearing a deal with Fujifilm that would cede control of the U.S. photocopier pioneer to Fujifilm. \n“The market environment surrounding the company’s subsidiary Fuji Xerox has grown increasingly severe,” Fujifilm said in a statement on Wednesday. \nFujifilm said it would book restructuring costs of 49 billion yen ($450.95 million) in the second half of the fiscal year through March, lowering its operating profit forecast for the year to 130 billion yen from a previous 185 billion yen. \nIt said the planned restructuring measures involve job cuts and closing or integrating manufacturing bases, and would lower annual costs by 50 billion yen from the year ending March 2020. \nThe Journal report said a deal would be announced as soon as Wednesday, and would include plans to combine Xerox with the five-decades-old Fuji Xerox. Xerox shareholders would own just under half of the resulting entity and would get an implied premium for their stock and cash, it said. \nThe talks could still fall apart or the terms could change, the paper said, adding that Xerox shares would continue to trade following any deal. \nFujifilm and Xerox declined to comment on the report. Fujifilm is due to hold a news conference at 5 p.m. (0800 GMT). \nXerox has been under pressure to find new growth sources as it struggles to reinvent its legacy business amid waning demand for office printing. Fujifilm is also trying to streamline its copier business with a larger focus on document solutions services. \nXerox has been targeted by activist investor Carl Icahn and shareholder Darwin Deason, who joined forces last week to push Xerox to explore strategic options, oust its “old guard”, including its CEO, and negotiate better terms for its decades-long deal with Fujifilm. Icahn is Xerox’s biggest shareholder, with a 9.72 percent stake. \nFujifilm shares fell 8.3 percent on Wednesday ahead of its announcement of job cuts but after the Journal report about a deal with Xerox. Xerox shares ended down 0.5 percent on Tuesday. Related Coverage", "external_links": [], "published": "2018-01-31T02:24:00.000+02:00", "crawled": "2018-01-31T02:45:39.029+02:00", "highlightTitle": ""}