{"organizations": [], "uuid": "119cf2d8ddff781f4fbcbf3a03f59de318f28d63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223346448&w=1200&r=LYNXMPEE0I0VV", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-iceh-babcock/babcock-back-behind-bench-but-not-at-the-games-idUSKBN1F81JO", "country": "US", "domain_rank": 408, "title": "Babcock back behind bench but not at the Games", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:39:00.000+02:00", "replies_count": 0, "uuid": "119cf2d8ddff781f4fbcbf3a03f59de318f28d63"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-iceh-babcock/babcock-back-behind-bench-but-not-at-the-games-idUSKBN1F81JO", "ord_in_thread": 0, "title": "Babcock back behind bench but not at the Games", "locations": [], "entities": {"persons": [{"name": "babcock", "sentiment": "negative"}, {"name": "mike babcock", "sentiment": "none"}, {"name": "keating", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "nhl", "sentiment": "none"}, {"name": "min read  toronto", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "toronto maple leafs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Toronto (Reuters) - Mike Babcock coached Canada to men’s ice hockey gold at both the 2010 Vancouver and 2014 Sochi Winter Games and he will be back behind the bench again during the Pyeongchang Olympics.\nBut it will be 14 time zones away and Babcock’s focus will be on team not country as his Toronto Maple Leafs slog through February’s NHL games dreaming of a Stanley Cup instead of plotting a path to an Olympic gold medal hat-trick.\nAlthough the NHL wanted no part of the Pyeongchang Games, cutting ties after participating in five Olympics, Babcock makes no apologies for saying there is no place he would rather be than in South Korea on Feb. 9 when the Olympic flame is lit.\n”I’ve got to tell you, I‘m jealous,“ Babcock told Reuters. ”Going to the Olympics is one of the greatest things you can ever do, I wish we were going but we’re not going and so someone else gets an opportunity.\n“That’s a great opportunity for the people that get to go so for them I think it is fantastic.”\nFor these Olympics that opportunity falls to former Vancouver Canucks head coach Willie Desjardins and a collection of NHL castoffs.\nThe names and Hall of Fame pedigrees may be vastly different from the Crosbys and Gretzkys who have donned the Maple Leaf since 1998 but the Canadian goal and mindset remain the same - Olympic gold.\n“It’s different but the competition is going to be at the level they’re at so if you were putting a team together like this and you were playing against the competition we played it would be different,” Babcock said.\n”But what you are doing is playing against teams that were put together similar to you, so to me you are going to have an opportunity.\n“You’ve got Burkey (general manager Sean Burke) and his staff, Scott Salmond, Dave King, you’ve got Willie Desjardins, these are real good hockey people and they are going to do a real good job for Canada and they are going to give us every opportunity to have success.”\nOne of Canada’s most accomplished coaches and a brilliant hockey mind, for Babcock the disappointment over the Pyeongchang Games was as much about losing a earning opportunity as winning another gold medal.\nIf international hockey is the sport’s hall of higher education than Babcock might well qualify as the sport’s smartest man.\nBefore the 2002 Salt Lake City Games, Babcock, then coaching Cincinnati in one of hockey’s minor leagues, approached Hockey Canada asking if he could look in on a men’s Olympic hockey camp.\nHe has since gone on to steer Canada to back-to-back Olympic gold, a World Cup of Hockey crown, a world championship and a world junior championship.\nSTANLEY CUP Those experience have also shaped Babcock’s success as an NHL coach, hoisting the Stanley Cup with the Detroit Red Wings.\n”You learn a ton (from international hockey),“ said Babcock, who has degrees in physical education and sports psychology from McGill University. ”You learn from the best players, the best coaches.\n”I got to be around great, great NHL coaches, international coaches and great players.\n“You get better, the preparation you put into it makes you better so to me it was a real valuable growing experience and energizer.”\nHaving signed a reported eight-year $50 million deal in 2015 to coach the Maple Leafs Babcock is unlikely to be spotted in the unemployment line anytime soon.\nIf, however, you want to find Babcock during the Olympics you might well start in the TV room.\nOlympics are made up of individual moments and for Babcock his enduring memory came not in the hockey arena but the curling rink.\n“In Vancouver one of the things that stands out and I will never forget as long as I live,” Babcock said.\n“I went to watch Kevin Martin in the gold medal game in curling and to watch the ice water run through his veins and watch him deliver like that and then he went by me going to the podium and gave me the nod like, ‘it’s your turn tomorrow’. That experience in itself was unbelievable.”\nDescribed as direct and thoughtful Babcock did not need much time to consider the question of whether NHL players will be back on Olympic ice.\n”Yep, I see a way back and I am hopeful,“ said Babcock without a hint of hesitation. ”The reality is, it is an unbelievable event and you would like to be involved in it, I just feel totally blessed that when it was my turn that opportunity was made available.\n”To me that’s what makes it so spectacular, you get a chance to go and share these events with other athletes is something you never ever forget.\n“It’s bigger than yourself, it’s bigger than hockey, I think it is the greatest sporting event in the world.”\nEditing by Ed Osmond\n ", "external_links": [], "published": "2018-01-19T15:39:00.000+02:00", "crawled": "2018-01-19T16:14:45.000+02:00", "highlightTitle": ""}