{"organizations": [], "uuid": "b89f002316cf67da537061d36fc7855ff58c4441", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-gulfport-energy-corporation-announces-2018-total-capital-budget-within-cash-flow-and-100-million-stock-repurchase-program.html", "country": "US", "domain_rank": 767, "title": "Gulfport Energy Corporation Announces 2018 Total Capital Budget Within Cash Flow and $100 Million Stock Repurchase Program", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.187, "site_type": "news", "published": "2018-01-30T00:46:00.000+02:00", "replies_count": 0, "uuid": "b89f002316cf67da537061d36fc7855ff58c4441"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-gulfport-energy-corporation-announces-2018-total-capital-budget-within-cash-flow-and-100-million-stock-repurchase-program.html", "ord_in_thread": 0, "title": "Gulfport Energy Corporation Announces 2018 Total Capital Budget Within Cash Flow and $100 Million Stock Repurchase Program", "locations": [], "entities": {"persons": [{"name": "michael g. moore", "sentiment": "none"}], "locations": [{"name": "oklahoma city", "sentiment": "none"}, {"name": "gulfport", "sentiment": "none"}], "organizations": [{"name": "gulfport energy corporation announces 2018 total capital budget within cash flow", "sentiment": "neutral"}, {"name": "gulfport energy corporation", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OKLAHOMA CITY, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Gulfport Energy Corporation (NASDAQ:GPOR) (“Gulfport” or the “Company”) today announced its 2018 capital budget, its 2018 operation outlook and that its board of directors has approved a stock repurchase program to acquire up to $100 million of its outstanding common stock during 2018. Key information includes the following:\nBudgeted 2018 total capital expenditures of $770 million to $835 million to be funded within cash flow. Forecasted 2018 full year net production is estimated to average 1,250 MMcfe to 1,300 MMcfe per day, an increase of approximately 15% to 19% over 2017. Stock repurchase program to acquire up to $100 million of outstanding common stock.\nMichael G. Moore, Chief Executive Officer and President, commented, “In the current environment, we are dedicated to strict capital discipline and are in the position to be able to generate free cash flow for our shareholders while also providing strong production growth. Based on current strip pricing, Gulfport forecasts our full-year 2018 total capital program to be funded entirely within cash flow while growing production approximately 15% to 19% over 2017. Furthermore, our robust hedge portfolio underpins our 2018 capital program with approximately 80% of our expected 2018 natural gas production priced at over $3.05 per MMBtu, providing a high degree of certainty surrounding the cash flow profile of our 2018 program.\nIn addition to our planned operational activity for 2018, we are pleased to announce our board has recently approved a stock repurchase program. The repurchase program underscores the confidence we have in our business model, financial performance and top-tier asset base and further demonstrates our commitment to creating value for our shareholders. We intend to opportunistically repurchase our stock during 2018 and will utilize our available liquidity, which will include forecasted free cash flow generated and, potentially, proceeds from the sale of certain investments. The plan authorizes up to $100 million of share repurchases, which at today’s share price represents approximately 5% of the Company’s outstanding shares.”\n2018 Capital Budget and Production Guidance\nFor 2018, Gulfport estimates its total capital expenditures will be approximately $770 million to $835 million, which will be funded within cash flow at current strip pricing. The 2018 budget includes approximately $630 million to $685 million for D&C activities and approximately $140 million to $150 million for non-D&C activities, including midstream capital expenditures associated with its investment in Strike Force Midstream LLC and leasehold activities during 2018. With this level of capital spend, Gulfport forecasts its 2018 average daily net production will be in the range of 1,250 MMcfe to 1,300 MMcfe per day, an increase of approximately 15% to 19% over 2017.\nUtilizing current strip pricing at the various regional pricing points at which the Company sells its natural gas, Gulfport forecasts its realized natural gas price differential, before the effect of hedges and inclusive of the Company’s firm transportation expense, will average in the range of $0.58 to $0.72 per Mcf below NYMEX settlement prices in 2018. Gulfport expects its 2018 realized NGL price, before the effect of hedges and including transportation expense, will be approximately 45% to 50% of WTI and its 2018 realized oil price will be in the range of $3.00 to $3.50 per barrel below WTI.\nThe table below summarizes the Company’s full year 2018 guidance:\nGULFPORT ENERGY CORPORATION COMPANY GUIDANCE Year Ending 12/31/2018 Low High Forecasted Production Average Daily Gas Equivalent (MMcfepd) 1,250 1,300 % Gas ~ 89% % Natural Gas Liquids ~ 7% % Oil ~ 4% Forecasted Realizations (before the effects of hedges) Natural Gas (Differential to NYMEX Settled Price) - $/Mcf $ (0.58) $ (0.72) NGL (% of WTI) 45% 50% Oil (Differential to NYMEX WTI) $/Bbl $ (3.00) $ (3.50) Projected Operating Costs Lease Operating Expense - $/Mcfe $ 0.17 $ 0.19 Production Taxes - $/Mcfe $ 0.06 $ 0.08 Midstream Gathering and Processing - $/Mcfe $ 0.57 $ 0.63 General and Administrative - $/Mcfe $ 0.12 $ 0.14 Depreciation, Depletion and Amortization - $/Mcfe $ 0.95 $ 1.05 Total Budgeted D&C Expenditures - In Millions: Operated $ 490 $ 525 Non-Operated $ 140 $ 160 Total Budgeted D&C Capital Expenditures $ 630 $ 685 Budgeted Non-D&C Expenditures - In Millions: $ 140 $ 150 Total Capital Expenditures - In Millions: $ 770 $ 835 Net Wells Drilled Utica - Operated 26 29 Utica - Non-Operated 7 8 Total 33 37 SCOOP - Operated 10 11 SCOOP - Non-Operated 4 5 Total 14 16 Net Wells Turned-to-Sales Utica - Operated 33 37 Utica - Non-Operated 9 10 Total 42 47 SCOOP - Operated 16 18 SCOOP - Non-Operated 2 3 Total 18 21 2018 Operational Outlook\nUtica Shale\nDuring 2018, Gulfport plans to run on average approximately 2.5 operated horizontal rigs in the Utica Shale. Gulfport has budgeted to drill approximately 36 to 40 gross (26 to 29 net) horizontal Utica wells with an average lateral length of 11,200 feet. In addition, Gulfport plans to turn-to-sales 33 to 37 gross and net horizontal Utica wells with an average lateral length of 8,000 feet.\nGulfport intends to participate in non-operated activities taking place on its acreage by other operators that plan to drill approximately 7 to 8 horizontal wells and turn-to-sales 9 to 10 horizontal wells, in each case net to Gulfport’s interest.\nSCOOP\nDuring 2018, Gulfport plans to run on average approximately 3 operated horizontal rigs in the SCOOP. Gulfport has budgeted to drill approximately 15 to 16 gross (10 to 11 net) horizontal SCOOP wells with an average lateral length of 8,900 feet. In addition, Gulfport plans to turn-to-sales 20 to 22 gross (16 to 18 net) horizontal SCOOP wells with an average lateral length of 8,600 feet.\nGulfport intends to participate in non-operated activities taking place on its acreage by other operators that plan to drill approximately 4 to 5 horizontal wells and turn-to-sales 2 to 3 horizontal wells, in each case net to Gulfport’s interest.\nSouthern Louisiana\nDuring 2018, Gulfport plans to run one recompletion rig at its West Cote Blanche Bay and Hackberry fields.\nStock Repurchase Program\nGulfport announced today that its board of directors has approved a stock repurchase program to acquire up to $100 million of its outstanding common stock during 2018. Purchases under the repurchase program may be made from time to time in open market or privately negotiated transactions, and will be subject to market conditions, applicable legal requirements, contractual obligations and other factors. The repurchase program does not require the Company to acquire any specific number of shares. The Company intends to purchase shares under the repurchase program opportunistically with available funds while maintaining sufficient liquidity to fund its 2018 capital development program. This repurchase program is authorized to extend through December 31, 2018 and may be suspended from time to time, modified, extended or discontinued by the board of directors at any time.\nAbout Gulfport\nGulfport Energy is an independent natural gas and oil company focused on the exploration and development of natural gas and oil properties in North America and is one of the largest producers of natural gas in the contiguous United States. Headquartered in Oklahoma City, Gulfport holds significant acreage positions in the Utica Shale of Eastern Ohio and the SCOOP Woodford and SCOOP Springer plays in Oklahoma. In addition, Gulfport holds an acreage position along the Louisiana Gulf Coast, has an approximately 25% equity interest in Mammoth Energy Services, Inc. (NASDAQ:TUSK) and has a position in the Alberta Oil Sands in Canada through its 25% interest in Grizzly Oil Sands ULC. For more information, please visit www.gulfportenergy.com .\nForward Looking Statements\nThis press release includes “forward-looking statements” for purposes of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Exchange Act. All statements, other than statements of historical facts, included in this press release that address activities, events or developments that Gulfport expects or anticipates will or may occur in the future, future capital expenditures (including the amount and nature thereof), business strategy and measures to implement strategy, competitive strength, goals, expansion and growth of Gulfport's business and operations, plans, market conditions, references to future success, reference to intentions as to future matters and other such matters are forward-looking statements. These statements are based on certain assumptions and analyses made by Gulfport in light of its experience and its perception of historical trends, current conditions and expected future developments as well as other factors it believes are appropriate in the circumstances. However, whether actual results and developments will conform with Gulfport's expectations and predictions is subject to a number of risks and uncertainties, general economic, market, credit or business conditions that might affect the timing and amount of the repurchase program; the opportunities (or lack thereof) that may be presented to and pursued by Gulfport; Gulfport’s ability to identify, complete and integrate acquisitions of properties and businesses; competitive actions by other oil and gas companies; changes in laws or regulations; and other factors, many of which are beyond the control of Gulfport. Information concerning these and other factors can be found in the Company's filings with the Securities and Exchange Commission, including its Forms 10-K, 10-Q and 8-K. Consequently, all of the forward-looking statements made in this press release are qualified by these cautionary statements and there can be no assurances that the actual results or developments anticipated by Gulfport will be realized, or even if realized, that they will have the expected consequences to or effects on Gulfport, its business or operations. Gulfport has no intention, and disclaims any obligation, to update or revise any forward-looking statements, whether as a result of new information, future results or otherwise.\nInvestor & Media Contact:\nJessica Wills – Director, Investor Relations\njwills@gulfportenergy.com\n405-252-4550\nSource:Gulfport Energy Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/c165241d-7c75-4352-9571-95245cd8c682", "https://www.globenewswire.com/Tracker?data=lz13x9IxdBHveT3K_tcQqkr5bQLaUsDb9B1B586r5tUXa4t5GFfwwGeUYDBxYqdSZ_6qbyqB50AxyJr3vwbm8kiGxh0877Kb8FUkD25a1FU="], "published": "2018-01-30T00:46:00.000+02:00", "crawled": "2018-01-30T03:58:21.000+02:00", "highlightTitle": ""}