{"organizations": [], "uuid": "e5e848ad44c0751968d9a4e3c111f503eb9d27eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-falls-set-for-biggest-monthly-drop-in-nearly-2-years-idUSL4N1PL3YS", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar falls, set for biggest monthly drop in nearly 2 years", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T20:26:00.000+02:00", "replies_count": 0, "uuid": "e5e848ad44c0751968d9a4e3c111f503eb9d27eb"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-falls-set-for-biggest-monthly-drop-in-nearly-2-years-idUSL4N1PL3YS", "ord_in_thread": 0, "title": "FOREX-Dollar falls, set for biggest monthly drop in nearly 2 years", "locations": [], "entities": {"persons": [{"name": "richard falkenhall", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "saikat chatterjee", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "stockholm", "sentiment": "none"}], "organizations": [{"name": "ubs wealth management", "sentiment": "negative"}, {"name": "seb", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* UBS Wealth Management upgrades 6-month forecasts\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Saikat Chatterjee\nLONDON, Jan 26 (Reuters) - The dollar fell more than half a percent against a basket of currencies on Friday as comments by senior U.S. officials this week backing a weak dollar reverberated through currency markets.\nAfter U.S. President Donald Trump said on Thursday he ultimately wanted the dollar to be strong, the dollar pared some losses against major currencies, but it was on track for its biggest monthly drop since March 2016.\n“The broader dollar decline story remains in place and, unless we see a substantial shift in expectations on future policy tightening in the U.S, the dollar will likely remain on the back foot,” said Richard Falkenhall, a senior currency strategist at SEB in Stockholm.\nAgainst a basket of six major currencies, the dollar last traded on Friday at 88.92, after hitting a three-year low of roughly around 88.43.\nThough comments on Thursday that he wanted a “strong dollar” contradicted earlier comments by Treasury Secretary Steven Mnuchin, investors suspect a protracted decline in the greenback may be likely.\n“While President Trump has since said that he expects the dollar to get ‘stronger and stronger’, it will be hard for Washington to put the ‘weak dollar’ genie back in the bottle,” Viraj Patel, an FX strategist at ING in London said in a note.\nIn keeping with the rising theme of expecting more dollar weakness, UBS Wealth Management upgraded its six-month forecasts for the euro and sterling on Friday to $1.28, from $1.22, and $1.45 from $1.36 respectively.\nSome market participants are also concerned that Trump may encourage more protectionist policies at a speech in Davos around 1300 GMT and at his State of the Union speech next week, policies that may ultimately end up pushing the dollar lower.\nAgainst the euro, the dollar’s weakness was the most apparent, with the single currency up half a percent at $1.2493 and not far away from a December 2014 high of above $1.2538 hit on Thursday.\nWith European Central Bank President Mario Draghi declining to lean against the recent euro rally and instead signaling that economic data pointed to “solid and broad” growth, investors were encouraged to push the currency higher.\nDraghi also said that the surge in the euro was a source of uncertainty and that the ECB might have to review strategy if U.S. comments on the benefits of a weak dollar lead to a change in monetary conditions.\n“Draghi’s reluctance to offer any resistance to the euro means that euro/dollar is only set to rise more in the coming months,” said Manuel Oliveri, an FX strategist at Credit Agricole in London.\nSterling briefly rose more than one percent to $1.4289 , but remained below its peak on Thursday of $1.4346, which was the pound’s highest level since the Brexit vote in June 2016 as some investors turned bullish on the currency’s outlook.\nGross domestic product grew by 0.5 percent in the three months to end of December, faster than analyst expectations of 0.4 percent, official data showed.\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets (Reporting by Saikat Chatterjee; editing by Ralph Boulton)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T20:26:00.000+02:00", "crawled": "2018-01-27T00:16:37.003+02:00", "highlightTitle": ""}