{"organizations": [], "uuid": "8c912c7d6569c5090c1297c0af7f12933dfb7687", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/britain-stocks/high-flying-easyjet-drives-up-britains-ftse-sky-in-focus-idUSL8N1PI273", "country": "US", "domain_rank": 408, "title": "High-flying easyJet drives up Britain's FTSE; Sky in focus", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:26:00.000+02:00", "replies_count": 0, "uuid": "8c912c7d6569c5090c1297c0af7f12933dfb7687"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/britain-stocks/high-flying-easyjet-drives-up-britains-ftse-sky-in-focus-idUSL8N1PI273", "ord_in_thread": 0, "title": "High-flying easyJet drives up Britain's FTSE; Sky in focus", "locations": [], "entities": {"persons": [{"name": "sky", "sentiment": "none"}, {"name": "johan lundgren", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}], "organizations": [{"name": "ryanair", "sentiment": "none"}, {"name": "retailer brown group", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* FTSE 100 up 0.2 pct\n* easyJet leads gainers after trading update\n* Sky gains as regulator suggest remedies for Fox takeover\n* Retailer Brown Group after cut to margin forecast\nMILAN, Jan 23 (Reuters) - A rally of more than 6 percent in airline easyJet following a trading update drove Britain’s top share index higher on Tuesday, while Sky was in focus after the competition watchdog suggested ways that could make a Fox takeover acceptable.\nThe FTSE rose 0.2 percent by 0913 GMT, slightly underperforming the broader European market as strength in the pound penalised the internationally exposed British index. The mid cap index was flat as investors assessed mixed earning updates.\nEasyJet shares were the biggest gainers on the FTSE and were set for their biggest one-day gain in three years.\nThe company said a reduction in capacity by competitors was contributing to a positive trading environment and helping revenues, in the first trading update under new boss Johan Lundgren.\n“EasyJet benefitted from a combination of Ryanair cancellations and the demise of a trio of peers removing some capacity from the market,” said ETX Capital analyst Neil Wilson.\nWilson however said that the problems of overcapacity in European short haul combined with pricing pressures meant it will remain “tough going” for carriers.\n“EasyJet needs to maintain focus on cost control, which it is achieving at present,” he added.\nSky rose 2.9 percent. Britain’s competition regulator CMA told Rupert Murdoch his $15 billion takeover of Sky was not in the public interest and would be blocked unless there was a way to prevent the tycoon from influencing the network’s news output.\n“For us, a structural remedy such as the spinning off or divesting of Sky News would present the easiest path to deal completion,” said Neil Campling at Mirabaud Securities.\n“It is only on plurality grounds that the CMA has concerns, and that is a fixable situation as per the olive branches being offered through a range of potential remedies,” he added.\nElsewhere, gains among heavyweight oil companies provided support to the FTSE, as crude oil prices rose, while broker upgraded boosted shares in Croda International and Ashtead Group.\nMiners were a weak spot with Fresnillo, Anglo American and Glencore leading losers with declines of more than 2 percent.\nAmong mid caps, Brown Group plummeted 14 percent after the clothing retailer trimmed its product gross margin forecast for the fiscal year as it spends heavily on promotions to drive sales.\nBrown’s outlook downgrade follows other disappointing updates among retailers, which are being hit by a slowdown in consumer spending.\nPets at Home however rose 8 percent after the UK’s largest pet shop chain reported a jump in third-quarter revenue on strong demand for its products during Christmas. (Reporting by Danilo Masoni; Editing by Robin Pomeroy)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T17:26:00.000+02:00", "crawled": "2018-01-24T15:24:42.023+02:00", "highlightTitle": ""}