{"organizations": [], "uuid": "664ca4d9f0653ba62fb4ef265ae02e92461960b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-kazuki-kusaka-joins-mts-health-partners-as-partner.html", "country": "US", "domain_rank": 767, "title": "Kazuki Kusaka Joins MTS Health Partners as Partner", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-05T18:00:00.000+02:00", "replies_count": 0, "uuid": "664ca4d9f0653ba62fb4ef265ae02e92461960b0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-kazuki-kusaka-joins-mts-health-partners-as-partner.html", "ord_in_thread": 0, "title": "Kazuki Kusaka Joins MTS Health Partners as Partner", "locations": [], "entities": {"persons": [{"name": "kazuki kusaka", "sentiment": "negative"}, {"name": "andrew weisenfeld", "sentiment": "none"}, {"name": "kazuki", "sentiment": "none"}, {"name": "kusaka", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "mts health partners", "sentiment": "negative"}, {"name": "mts", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 5, 2018 /PRNewswire/ -- MTS Health Partners, L.P. (MTS), a solely healthcare focused, independent, New York-based investment bank, is announcing that Kazuki Kusaka has joined the firm as a partner.\nMr. Kusaka joins the MTS leadership team of eleven partners and will build and lead MTS' practice on the ground in Japan. He has more than three decades of industry experience while spending the latter two focusing on the healthcare space. Mr. Kusaka has broad relationships across many healthcare subsectors including pharmaceutical, biotech, medical device and healthcare services companies.\n\"We have been eyeing the growing prominence of Japanese pharma and emerging biotech companies on both the global stage as well as intra-Japan for quite some time, and knew we needed to find the right leader to develop our presence. With Kazuki's experience, knowledge and relationships, we are confident we've found our person,\" said Andrew Weisenfeld, managing partner of MTS. \"We are excited to have Kazuki as a partner and look forward to the meaningful value he will bring to both our existing clients and new clients to the firm. With his addition, we have firmly \"broken ground\" in Japan.\"\nPrior to joining MTS, Mr. Kusaka led the healthcare practice for Lazard in Japan for 10 years, providing M&A advisory services to Japanese healthcare companies with a major focus on cross-border M&A transactions. Prior to Lazard, Mr. Kusaka was a managing director and the head of Asia Healthcare Group at Lehman Brothers for 7 years. Mr. Kusaka founded the group in 2000 and provided M&A advisory and equity/debt financing services to healthcare companies in major countries in Asia including Japan, Korea, China and Singapore. Mr. Kusaka also worked for UBS in Japan as the head of the Japan Healthcare Group. Selected transactions include the merger of Fujisawa and Yamanouchi to create Astellas, Sumitomo Dainippon Pharma's acquisition of Tolero, Miraca's acquisition of Caris and Hisamitsu's acquisition of Noven. Mr. Kusaka started his banking career as an investment banking analyst at Kidder, Peabody in 1990.\nMr. Kusaka graduated from Tokyo University with a BA in Psychology.\nAbout MTS\nMTS Health Partners is a leading boutique investment bank that provides strategic and financial advice to the global healthcare industry. Since 1999, MTS has continued to foster trusted client partnerships, creating alignment to achieve their goals. We provide our clients with creative thinking, candid advice, and commitment to results, advising them in pursuing the right strategic pathways rather than simply focusing on transactions. Through close client partnerships based on trust and shared commitment, we are at your side and on your side, every step of the way.\nSECURITIES RELATED TRANSACTIONS ARE PROVIDED EXCLUSIVELY BY OUR AFFILIATE, MTS SECURITIES, LLC, A BROKER-DEALER REGISTERED WITH THE SEC AND A MEMBER OF FINRA AND SIPC. OUR AFFILIATE, MTS HEALTH INVESTORS, LLC, AN SEC REGISTERED INVESTMENT ADVISER, PROVIDES INVESTMENT ADVISORY SERVICES TO PRIVATE EQUITY INVESTORS.\nView original content with multimedia: http://www.prnewswire.com/news-releases/kazuki-kusaka-joins-mts-health-partners-as-partner-300578191.html\nSOURCE MTS Health Partners, L.P.", "external_links": ["http://www.prnewswire.com/news-releases/kazuki-kusaka-joins-mts-health-partners-as-partner-300578191.html"], "published": "2018-01-05T18:00:00.000+02:00", "crawled": "2018-01-05T20:24:40.031+02:00", "highlightTitle": ""}