{"organizations": [], "uuid": "c8ee7caa4dd12f8cf473f9d909b9b39965e5c60b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-pakistan-sexcrimes-children/celebrities-call-for-justiceforzainab-to-end-girls-rape-and-murder-in-pakistan-idUSKBN1F02EC", "country": "US", "domain_rank": 408, "title": "Celebrities call for #JusticeforZainab to end girls' rape and murder in Pakistan", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T01:38:00.000+02:00", "replies_count": 0, "uuid": "c8ee7caa4dd12f8cf473f9d909b9b39965e5c60b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-pakistan-sexcrimes-children/celebrities-call-for-justiceforzainab-to-end-girls-rape-and-murder-in-pakistan-idUSKBN1F02EC", "ord_in_thread": 0, "title": "Celebrities call for #JusticeforZainab to end girls' rape and murder in Pakistan", "locations": [], "entities": {"persons": [{"name": "yousafzai", "sentiment": "none"}, {"name": "zainab ansari", "sentiment": "none"}, {"name": "khan", "sentiment": "none"}, {"name": "malala yousafzai", "sentiment": "none"}, {"name": "ansari", "sentiment": "none"}, {"name": "imran khan", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "pakistan karachi", "sentiment": "none"}, {"name": "kasur", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KARACHI (Thomson Reuters Foundation) - The rape and murder of a young girl in Pakistan has sparked calls for #JusticeforZainab around the world, amid anger over a spate of unresolved child sex crimes in the conservative nation.\nPolice recovered the body of Zainab Ansari, aged about 7, on Tuesday from a garbage dumpster in the town of Kasur in eastern Pakistan, four days after she was reported missing.\nPakistani Nobel Prize laureate Malala Yousafzai and cricketer-turned-politician Imran Khan were among the celebrities using the hashtag, which is trending on Twitter.\n“This has to stop,” tweeted a “heartbroken” Yousafzai, an outspoken campaigner for girls’ rights in her homeland.\n“Authorities must take action.”\nA 2011 Thomson Reuters Foundation poll found Pakistan to be the world’s third most dangerous country for women, due to acid attacks, child marriage and punishment by stoning.\nAnsari was the twelfth girl to be abducted, raped and killed in the past year in Kasur district, police said.\n“This is not the first time such horrific acts have happened,” said Khan. “We have to act swiftly to punish the guilty and ensure that our children are better protected.”\nTwo civilians were killed on Wednesday when officers fired to disperse crowds that attacked a police station in Kasur. The police deny they have been lax in investigating child abductions in the town.\nActresses Mahira Khan and Sanam Saeed were among those who demonstrated in Karachi, Pakistan’s largest city, on Thursday.\n“We need to start talking about sexual abuse openly,” said Khan, one of Pakistan’s most popular actresses.\n“We need to include that in our school curriculums. Awareness is key. Associating abuse and rape with shame is why countless (attacks) go unheard of. Stop with the shame.”\nSexual abuse is on the rise in Pakistan, with more than 4,000 cases reported in 2016, up 10 percent on the previous year, the Human Rights Commission of Pakistan says.\nPakistan tightened its legislation to protect children in 2016 - criminalizing sexual assault, child pornography and trafficking for the first time - after a pedophile ring, circulating pornographic videos, was exposed in Kasur.\nPreviously, only rape was criminalized.\nSeveral police officials were transferred following the 2015 scandal, where a prominent family allegedly used guns and knives to force young children to perform sex acts on video.\nMamtaz Gohar, a spokesman for Sahil, which campaigns against child sexual abuse, said not enough has been done to secure justice for an estimated 280 children abused in the case.\n“Almost all of the criminals have been released on bail. The justice system and the police investigation is really skewed in our country,” he told the Thomson Reuters Foundation.\nMany villagers in Pakistan prefer to use local elders to dispense justice, rather than the often-cumbersome and corrupt formal legal system.\n“Ask one institution, they blame the other. The police will blame the judges, the judges will point fingers at the public prosecutor,” said Maliha Zia Lari, a human rights lawyer, calling for better training of investigators.\nReporting by Zofeen Ebrahim. Editing by Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T01:38:00.000+02:00", "crawled": "2018-01-12T18:51:53.022+02:00", "highlightTitle": ""}