{"organizations": [], "uuid": "a55536c04608ecc911d64b796179f99632d16176", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220755422&w=1200&r=LYNXMPEE090D3", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/india-economy-fdi/india-allows-100-percent-fdi-in-single-brand-retail-via-automatic-route-idINKBN1EZ0LM", "country": "US", "domain_rank": 408, "title": "India allows 100 percent FDI in single-brand retail via automatic route", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T09:31:00.000+02:00", "replies_count": 0, "uuid": "a55536c04608ecc911d64b796179f99632d16176"}, "author": "", "url": "https://in.reuters.com/article/india-economy-fdi/india-allows-100-percent-fdi-in-single-brand-retail-via-automatic-route-idINKBN1EZ0LM", "ord_in_thread": 0, "title": "India allows 100 percent FDI in single-brand retail via automatic route", "locations": [], "entities": {"persons": [{"name": "malini menon", "sentiment": "none"}, {"name": "frank noronha", "sentiment": "none"}, {"name": "nigam prusty", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 7:33 AM / Updated 11 hours ago India allows foreign investors to own up to 49 percent of Air India Reuters Staff 2 Min Read \nNEW DELHI (Reuters) - India cleared a proposal on Wednesday to allow foreign investors to own up to a 49 percent stake in state-run carrier Air India, paving the way for global airlines to bid for the loss-making flagship carrier. An Air India Airbus A320neo plane takes off in Colomiers near Toulouse, France, December 13, 2017. REUTERS/Regis Duvignau/File Photo \nIt brings Air India, which previously had to be fully locally owned, in line with the country’s other local airlines in which foreign investment is allowed. \nIndia allows 100 percent foreign investment in its other local airlines, but caps foreign airlines’ stake at 49 percent. \nIn Air India, it will now allow a maximum of 49 percent foreign ownership including that by airlines. But substantial ownership and effective control of Air India must remain with an Indian national, the government said in a statement. \nPrime Minister Narendra Modi’s cabinet gave the go-ahead last year to sell Air India, after successive governments spent billions of dollars in recent years to keep it going. However, it has yet to decide what to do with the carrier’s debt burden of $8.5 billion. \nLeslie Thng, chief executive of Vistara, a carrier owned by salt-to-steel conglomerate Tata Group and Singapore Airlines Ltd, last week said the companies were “open to evaluating” a potential bid for Air India. \nAnd companies, including low-cost Indian carrier IndiGo, owned by InterGlobe Aviation, Tata Group and Turkey’s Celebi Aviation Holdings, have expressed an interest in buying some of Air India’s various businesses. \nThe government also allowed 100 percent foreign direct investment (FDI) in single-brand retail via automatic route and eased a rule on 30 percent mandatory local sourcing of products for five fiscal years after the opening of the first Indian store. Reporting by Nigam Prusty; Editing by Muralikumar Anantharaman", "external_links": [], "published": "2018-01-10T09:31:00.000+02:00", "crawled": "2018-01-10T09:44:20.032+02:00", "highlightTitle": ""}