{"organizations": [], "uuid": "5d1b021a36237d867da58289d4e422aac80220bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221474255&w=1200&r=LYNXMPEE0B149", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/us-eu-poland-outlook/eu-executive-chair-bulgaria-eye-deal-with-poland-to-avert-clash-idUKKBN1F11UT", "country": "US", "domain_rank": 408, "title": "EU executive, chair Bulgaria eye deal with Poland to avert clash", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T17:03:00.000+02:00", "replies_count": 0, "uuid": "5d1b021a36237d867da58289d4e422aac80220bc"}, "author": "", "url": "https://uk.reuters.com/article/us-eu-poland-outlook/eu-executive-chair-bulgaria-eye-deal-with-poland-to-avert-clash-idUKKBN1F11UT", "ord_in_thread": 0, "title": "EU executive, chair Bulgaria eye deal with Poland to avert clash", "locations": [], "entities": {"persons": [{"name": "ekaterina zaharieva", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "mateusz morawiecki", "sentiment": "none"}, {"name": "alastair macdonald", "sentiment": "none"}], "locations": [{"name": "poland", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "sofia", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters tv united", "sentiment": "negative"}, {"name": "commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "eu commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reuters TV United States January 12, 2018 / 3:11 PM / a few seconds ago EU executive, chair Bulgaria eye deal with Poland to avert clash Alastair Macdonald 3 Min Read \nSOFIA (Reuters) - The European Commission and Bulgaria, the incoming EU chair, believe a showdown on suspending Poland from the bloc over democracy concerns can be averted in the coming months, officials said on Friday. European Commission President Jean-Claude Juncker poses with Poland's Prime Minister Mateusz Morawiecki ahead of talks at the EU Commission headquarters in Brussels, Belgium, January 9, 2018. REUTERS/Francois Lenoir \nLast month, the Commission gave Warsaw three months to amend judiciary reforms which critics say risk undermining democracy and on Tuesday the new Polish Prime Minister Mateusz Morawiecki met the EU executive’s President Jean-Claude Juncker for their first talks in Brussels to try and resolve the issue. \nNoting that EU member states would hold a first discussion with Poland at a ministerial meeting on Feb. 27 under Bulgarian chairmanship, Bulgarian Foreign Minister Ekaterina Zaharieva told reporters that Sofia was hoping for a compromise. \n“Poland should be listened to,” she said, noting she would meet her new Polish counterpart in Sofia on Monday. \n“We hope during this period that in the negotiations with the Commission Poland will do some reform of their reform and agree with the Commission and the situation will calm down.” \nBulgarian Prime Minister Boyko Borissov had said on Thursday that the EU should avoid pushing matters to the point where the other 27 member states had to vote on whether to sanction Warsaw -- a decision he said would give governments “sleepless nights”. \nAfter Juncker met Borissov on Friday in Sofia at the start of Bulgaria’s six-month EU presidency, an EU official dismissed suggestions Bulgaria was trying to put a brake on moves to penalize its fellow ex-communist member state. \nWarsaw and some other eastern countries complain Brussels and wealthy Western governments fail to understand them. \nThe Commission itself saw developments in Warsaw that it hoped bode well. \n“The Commission is working to make it work within three months,” an official said, adding that it was still early days to judge following Tuesday’s first meeting. \nHowever, the replacement of some of the most eurosceptic ministers and other indications from Warsaw were positive. \n“There are things in the works,” the official added, saying next month’s ministerial meeting would be a chance to hear Poland’s case. “In an ideal world, we will sort this out and there will be no vote ... There is ample time to make it work.” \nTwo years of bitter feud between the eurosceptic, nationalist government in Warsaw and the EU have isolated Poland - once praised as the posterchild of post-communist transition - and weakend the EU’s unity as it enters key negotiations over its next, long-term budget and grappes with Brexit. Reporting by Alastair Macdonald; Editing by Toby Chopra; @macdonaldrtr", "external_links": [], "published": "2018-01-12T17:03:00.000+02:00", "crawled": "2018-01-12T17:23:50.017+02:00", "highlightTitle": ""}