{"organizations": [], "uuid": "71b1b0eef6ad321b4ec4eae2cc9d1770479ad312", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/01/104874129-RTX3KQ7W.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/morgan-stanley-stocks-wont-be-hurt-by-rising-10-year-treasury-yields.html", "country": "US", "domain_rank": 767, "title": "Morgan Stanley: Stocks won’t be hurt by rising 10-year Treasury yields", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-30T16:12:00.000+02:00", "replies_count": 0, "uuid": "71b1b0eef6ad321b4ec4eae2cc9d1770479ad312"}, "author": "David Reid", "url": "https://www.cnbc.com/2018/01/30/morgan-stanley-stocks-wont-be-hurt-by-rising-10-year-treasury-yields.html", "ord_in_thread": 0, "title": "Morgan Stanley: Stocks won’t be hurt by rising 10-year Treasury yields", "locations": [], "entities": {"persons": [{"name": "gold bond", "sentiment": "negative"}, {"name": "jim caron", "sentiment": "none"}, {"name": "caron", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "morgan stanl", "sentiment": "negative"}, {"name": "morgan stanley", "sentiment": "negative"}, {"name": "treasurys", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "societe generale", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stock markets will only be seriously affected by a sell-off in bond markets if the yield on the U.S. 10-year Treasury sees a sustained move above 3 percent, a senior analyst at Morgan Stanley told CNBC.\nAnd Jim Caron, a senior fixed income manager for asset management at the bank, believes that move isn't going to happen any time soon.\n\"There will be a wall of (Treasury) buying in the 2.90/3.00 percent area, which will mark a great support for the bond market,\" Caron told CNBC via email. The yield, which moves inversely to the price, currently sits at around 2.7128 for the U.S. 10-year note.\nGlobal equities have exhibited some nervousness in the past few days after yields on the benchmark U.S. Treasury reached levels not seen in almost four years. This comes as the Federal Reserve continues its tightening following years of accommodative policy and investors anticipate a pickup in inflation. Rising bond yields are traditionally seen as bad for stocks as it means large companies will have to spend more to finance their debts as interest rates increase.\nOn Tuesday, yields settled back as bond prices recovered slightly, but the S&P 500 and the Dow Jones industrial average both closed 0.7 percent lower Monday while overnight Asia-Pacific markets also struggled.\nCaron said while he expected to see the 10-year yield reach 3 percent at some point this year, it would take \"something extraordinary\" for it to sustain those levels for any meaningful length of time.\n'Significant scope' to rise further\nIn a research note Monday, U.S. economists at Deutsche Bank agreed that Treasury yields had \"significant scope\" to rise further before they would properly roil equity markets or weigh on the U.S. economy.\nDeutsche Bank stated that the neutral 10-year yield or \"10y-star\" is where a bond yield switches from being supportive to being destructive. The analysts' present estimate sits at 3.5 percent, some 80 basis points higher than current levels.\nMeanwhile, Global Head of Foreign Exchange Strategy at Societe Generale, Kit Juckes, said in a blogpost Monday that \"a slow-motion rise in bond yields is not, yet, threatening risk sentiment in equities, credit or EM (emerging markets).\"\nJuckes added that as long as asset prices continue to feel no threat, yields will continue to rise on the back of decent data and expectations of higher inflation. But he warned that the \"boiling frog\" syndrome was likely to become the bond investor theme of the year.\nJuckes explained this in his research note as the situation where rising yields would grind so slowly higher that no investors would feel threatened by them right up until it was too late to escape any negative effect.", "external_links": [], "published": "2018-01-30T16:12:00.000+02:00", "crawled": "2018-01-30T16:12:45.003+02:00", "highlightTitle": ""}