{"organizations": [], "uuid": "b058f51597ecfecc3739a3dd2c1b0df30984cac8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-bounce-short-lived-as-euro-nears-3-year-high-idUSL8N1OZ28K", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar bounce short-lived as euro nears 3-year high", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-04T20:24:00.000+02:00", "replies_count": 0, "uuid": "b058f51597ecfecc3739a3dd2c1b0df30984cac8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-bounce-short-lived-as-euro-nears-3-year-high-idUSL8N1OZ28K", "ord_in_thread": 0, "title": "FOREX-Dollar bounce short-lived as euro nears 3-year high", "locations": [], "entities": {"persons": [{"name": "jemima kelly", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar drops against basket after modest recovery\n* Strong US data and hawkish Fed minutes provide some support\n* Greenback gains against yen as risk assets rally\n* Bitcoin down 5 percent\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Jemima Kelly\nLONDON, Jan 4 (Reuters) - The dollar dipped on Thursday, unable to hold onto gains made the previous day on the back of upbeat U.S. data and minutes from the Federal Reserve, as the euro resumed a rally that has taken it close to its highest levels in three years.\nThe dollar index, which measures the currency against a basket of six major rivals, had slipped to its lowest since Sept. 20 on Tuesday, as optimism about the euro zone economy drove the single currency above $1.20 for the first time in 3-1/2 months.\nThe dollar was given some reprieve on Wednesday, bouncing after strong manufacturing and construction data. It gained further support from the Fed’s latest minutes, which indicated the central bank is still poised to raise interest rates several times this year.\nBut on Thursday it was back in negative territory, with its index down 0.3 percent on the day, close to Tuesday’s lows.\n“This is just a continuation of the trend we saw into year-end, which was a weaker dollar,” said BMO Capital Markets currency strategist Stephen Gallo, in London.\n“We have decent expectations for global growth and global risk assets and, when you have above-potential global growth, the dollar tends to weaken because people don’t need to hold safe-haven dollars.”\nPOSITIVE EURO SENTIMENT The U.S. currency was slightly higher against the yen, trading up 0.1 percent at 112.61 yen on strong risk appetite across markets. It touched a 2-1/2-week low of 112.055 on Tuesday after declining steadily from a high above 113.750 scaled in December.\nAfter dipping in early trade in Asia, reaching as low as $1.2005, the euro then bounced back to trade as high as $1.2066 , up 0.4 percent on the day and less than half a cent away from highs of $1.2092 seen in December - the strongest since the start of 2015.\n“We see some very positive euro sentiment in the market right now, and if it goes down too much against the U.S. dollar that’s going to begin again ... The market is not confident enough right now that levels below $1.20 are justified,” said Commerzbank currency strategist Esther Reichelt in Frankfurt.\n“That might change with the U.S. employment data coming in strong,” she said, adding that U.S. wages numbers due on Friday could be key in determining the dollar’s direction.\nIn the minutes from their Dec. 12-13 meeting, Fed policymakers acknowledged the U.S. labour market’s solid gains and the expansion in economic activity, even as they affirmed worries about persistently low inflation.\nThat suggested the central bank will continue to pursue a gradual approach to raising rates but could hasten the pace if inflation accelerates.\nBitcoin was down about 4 percent on the Bitstamp exchange at around $14,500, having lost more than a quarter of its value since hitting record highs in mid-December. (Reporting by Jemima Kelly; Additional reporting by Shinichi Saoshiro in Tokyo; editing by John Stonestreet and Kevin Liffey)\n ", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T20:24:00.000+02:00", "crawled": "2018-01-04T21:18:07.009+02:00", "highlightTitle": ""}