{"organizations": [], "uuid": "67850c6c7d828333bab379b2b65ca58a872fa06a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/01/104874471-RTS1HVLH-r-Khosrowshahi-uber.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/23/uber-moral-compass-under-co-founder-kalanick-was-off-new-ceo-says.html", "country": "US", "domain_rank": 767, "title": "Uber's 'moral compass' under Travis Kalanick was off: CEO Khosrowshahi", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-23T14:36:00.000+02:00", "replies_count": 0, "uuid": "67850c6c7d828333bab379b2b65ca58a872fa06a"}, "author": "Matthew J. Belvedere", "url": "https://www.cnbc.com/2018/01/23/uber-moral-compass-under-co-founder-kalanick-was-off-new-ceo-says.html", "ord_in_thread": 0, "title": "Uber's 'moral compass' under Travis Kalanick was off: CEO Khosrowshahi", "locations": [], "entities": {"persons": [{"name": "travis kalanick", "sentiment": "negative"}, {"name": "khosrowshahi dara khosrowshahi", "sentiment": "negative"}, {"name": "kalanick", "sentiment": "none"}, {"name": "khosrowshahi", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "expedia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Uber CEO Dara Khosrowshahi took predecessor and co-founder Travis Kalanick to task on Tuesday for leading the ride-hailing giant astray.\nThe \"moral compass of the company\" was not pointing in the right direction under Kalanick , Khosrowshahi told CNBC from the World Economic Forum in Davos, Switzerland.\nKalanick's hard-driving vision turned Uber into one of the world's most valuable private companies. But he was ousted last year after a series of scandals. He remains a board member.\n\"The relationship with Travis is fine, but it's strained because obviously there was a lot that happened in the past that wasn't right,\" Khosrowshahi said.\nUnder Kalanick's leadership, the company faced accusations of a culture of sexism and sexual harassment. The accusations include a memo in which Kalanick detailed ground rules for consensual employee sex practices. After an internal investigation, Kalanick was pushed out by the board.\nKalanick also faced contentious personnel departures, high-profile lawsuits, revelations about a fake app designed to fool government regulators, a profanity-laced argument with an Uber driver caught on video, and social media uproar over his joining President Donald Trump advisory council.\nAdam Galica | CNBC Dara Khosrowshahi, CEO of Uber speaking at the 2018 WEF in Davos, Switzerland on Jan. 23rd, 2018. Khosrowshahi, formerly CEO at online travel company Expedia , replaced Kalanick as CEO in August.\n\"In the end, the CEO of the company has to take responsibility. I think a lot of the press coverage is difficult for him. And that's totally understandable,\" Khosrowshahi said. \"Travis has been there for me when I've needed advice as a board member. It's a difficult time him. It's a difficult time for the company. But we have to look past that. ... My job is to move the company forward.\"\nLast week, SoftBank completed its long-awaited investment in Uber, giving Kalanick a $1.4 billion payday. The investment also ushered in rules that limit Kalanick's influence, which is seen as a victory for Khosrowshahi, who has worked to consolidate power at a private company that was rife with infighting when he arrived. Kalanick's fortune on paper is estimated at $4.8 billion, according to Forbes' billionaire list .\n\"The SoftBank investment also came with certain governance changes that we needed to make as a company, such as getting rid of the high-vote shares — really going to one-share, one-vote for everybody at Uber so everyone has an equal voice,\" Khosrowshahi told CNBC Tuesday. \"We think those kinds of governance reforms are incredibly important as we drive the company forward to be a public company, hopefully in 2019.\"\nEarlier Tuesday, Khosrowshahi spoke at a Davos panel discussion, saying Uber is working on delivering better service for users around the world.\nKalanick did not immediately respond to a CNBC request for comment.\nWATCH: Uber CEO Khosrowshahi: We are thrilled to have SoftBank as an investor show chapters Uber CEO: We are thrilled to have SoftBank as an investor 7 Hours Ago | 08:46 Morning Squawk: CNBC's before the bell news roundup Sign up to get Morning Squawk each weekday\nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Submit Please enter a valid email address", "external_links": ["https://www.forbes.com/profile/travis-kalanick/"], "published": "2018-01-23T14:36:00.000+02:00", "crawled": "2018-01-23T14:06:17.010+02:00", "highlightTitle": ""}