{"organizations": [], "uuid": "98a91fe132a13f06e5dbb41e86df76a39a93bfd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/11", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-mopec-announces-addition-of-new-board-members.html", "country": "US", "domain_rank": 767, "title": "Mopec Announces Addition of New Board Members", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.535, "site_type": "news", "published": "2018-01-31T14:00:00.000+02:00", "replies_count": 0, "uuid": "98a91fe132a13f06e5dbb41e86df76a39a93bfd2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-mopec-announces-addition-of-new-board-members.html", "ord_in_thread": 0, "title": "Mopec Announces Addition of New Board Members", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OAK PARK, Mich., Jan. 31, 2018 /PRNewswire/ -- Mopec, an industry leading manufacturer and distributor of high quality pathology, anatomy, mortuary, and necropsy equipment and products, is pleased to announce the addition of Sally Brandtneris and Dr. Joyce deJong to the Company's Board of Directors.\nMopec has a storied history and industry leading reputation of providing American-made, innovative and high-quality equipment and laboratory solutions to a variety of healthcare institutions, medical schools, and research laboratories around the globe. Having served eighty-three countries worldwide, Mopec's twenty-five plus years of success is based on its dedication to unmatched customer service and an internal team of highly knowledgeable industry experts. The addition of Brandtneris and deJong is just the most recent example of Mopec's continual commitment to excellence.\n\"We are delighted to have Sally and Joyce join Mopec's Board of Directors,\" said Jay Troger, CEO of Mopec. \"They both have unique professional backgrounds and will bring tremendous knowledge and insight to the entire Mopec organization. As we look to develop new and innovative products, and serve more institutions around the world, Joyce and Sally will be invaluable additions to the team as they embody the spirit of Mopec's culture of innovation and excellence. We are fortunate to have their sage guidance at the Company for years to come.\"\n\"With the addition of Sally and Joyce, we believe we have rounded out the Company's Board of Directors in a fashion that provides the Company with a diversified set of independent advisors capable of providing financial advice, business expertise, and deep industry knowledge,\" said Jeff Johnson, Managing Director at Blackford Capital. \"Both Sally and Joyce have extensive experience and bring with them a network of professional relationships that can immediately impact Mopec, generating value for the Company, customers, and shareholders.\"\nDr. Joyce deJong\nDr. Joyce deJong has over 20 years of experience practicing forensic pathology and servicing as a medical examiner. She is currently the medical examiner for ten counties in Michigan: Allegan, Barry, Calhoun, Grand Traverse, Kalamazoo, Leelanau, Mason, Muskegon, St. Joseph, and Van Buren. Additionally, she is the founding chair of the Pathology Department at Western Michigan University, Homer Stryker M.D. School of Medicine in Kalamazoo.\nDeJong has a special expertise in mass fatality management and has been deployed more than ten times by the federal government to various mass fatality events. She is a Fellow in the American Academy of Forensic Sciences and of the National Association of Medical Examiners. DeJong obtained her medical degree at Michigan State University College of Osteopathic Medicine and completed residency through Michigan State University at institutions currently known as Spectrum Health Butterworth and Spectrum Health Blodgett, St. Mary's Hospital, and Metropolitan Hospital. DeJong completed her training with a Fellowship at Emory University in forensic pathology.\nSally Brandtneris\nSally Brandtneris is a senior financial executive with more than 30 years of experience working in global technology, manufacturing, renewable energy and consulting industries. She currently holds the position of Chief Financial Officer at Logicalis, Inc., a global provider of integrated IT solutions and services. Prior to her current role, Brandtneris held positions with IBM, Sun Microsystems, Eaton Corporation, Ingersoll Rand, Thermo King, and LafargeHolcim. In 2015, Brandtneris received the Crain's Detroit CFO of the Year Finalist Award for her accomplishments with Brazilian-owned, global IT service company Stefanini.\nBrandtneris is also an Advisory Board Member and Diversity Leader of the Detroit Chapter of Financial Executives International (FEI) and Executive Sponsor of the Logicalis Diversity and Inclusion Committee. She earned her MBA from Cornell University and holds a BA from the University of Michigan in French and Economics. Sally is also a Certified Management Accountant (CMA) and will chair the Audit Committee at Mopec.\nAbout Mopec\nMopec, based in Oak Park, Michigan, is a manufacturer and distributor of high quality pathology, anatomy, mortuary, and necropsy equipment and products. Founded in 1992, Mopec differentiates itself through its extensive engineering process, superior design, and market-leading quality. Mopec is Better By Design and specializes in solutions for hospitals, universities, morgues, and a variety of other markets. Mopec is committed to the production innovative products and providing high quality customer service. For more information, visit www.mopec.com .\nAbout Blackford Capital\nBlackford Capital is a private equity firm based in Grand Rapids, Michigan, that acquires, manages and builds family-owned, lower middle-market manufacturing, distribution, and service companies. Blackford currently has 11 portfolio companies located across the United States and has been recognized as one of America's fastest growing private companies by Inc. 5000 in 2016 and 2017. For more information, visit www.blackfordcapital.com .\nContact:\nEric Kamstra\nBlackford Capital\n616.233.3160\nekamstra@blackfordcapital.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/mopec-announces-addition-of-new-board-members-300590701.html\nSOURCE Mopec", "external_links": ["http://www.prnewswire.com/news-releases/mopec-announces-addition-of-new-board-members-300590701.html", "http://www.mopec.com/", "http://www.blackfordcapital.com/"], "published": "2018-01-31T14:00:00.000+02:00", "crawled": "2018-01-31T19:01:16.000+02:00", "highlightTitle": ""}