{"organizations": [], "uuid": "5e246db3949b4f33845e3ae730a151da9328c6e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-vystar-signs-loi-to-acquire-nhs-holdings.html", "country": "US", "domain_rank": 767, "title": "Vystar Signs LOI to Acquire NHS Holdings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:30:00.000+02:00", "replies_count": 0, "uuid": "5e246db3949b4f33845e3ae730a151da9328c6e2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-vystar-signs-loi-to-acquire-nhs-holdings.html", "ord_in_thread": 0, "title": "Vystar Signs LOI to Acquire NHS Holdings", "locations": [], "entities": {"persons": [{"name": "lien", "sentiment": "none"}, {"name": "vystar", "sentiment": "none"}, {"name": "steve rotman", "sentiment": "none"}, {"name": "rotman", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "vystar", "sentiment": "none"}, {"name": "worcester", "sentiment": "none"}], "organizations": [{"name": "nhs holdings", "sentiment": "negative"}, {"name": "nhs", "sentiment": "negative"}, {"name": "vystar signs loi", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "vystar corporation", "sentiment": "none"}, {"name": "nrl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Proposed purchase for $1.5 million an 85% discount from $5 million valuation NHS Introduced Vytex® into the Bedding Industry\nWORCESTER, Mass., Jan. 09, 2018 (GLOBE NEWSWIRE) -- Vystar Corporation (OTCPink:VYST) has signed a Letter of Intent (LOI) to acquire assets of NHS Holdings, LLC. (NHS), the exclusive U.S. distributor of Vystar’s Vytex ® virtually allergen-, VOC- and odor-free natural rubber latex (NRL) foam. NHS was founded in January 2015 by Steve Rotman, now CEO of Vystar, and CEO of Rotman ’s Furniture and Carpet, one of the U.S.’s largest independent furniture retailers. NHS identifies and brings to market innovative, sustainably sourced, eco-friendly materials and components for use in the home furnishings, apparel, and other markets. NHS was instrumental to introducing Vytex foam to manufacturers for use in mattresses, and pillows.\nVytex latex bed topper, manufactured by Lien A\nNHS is valued at $5 million based on the last round of funding of $750,000 for 15% equity in NHS. Vystar proposes to acquire NHS for $1.2 million in restricted stock, a discount of 85% from the valuation. NHS’s largest shareholders are major investors and registered insiders of Vystar Corp, thus subject to insider trading restrictions. The proposed acquisition is contingent upon finalization of definitive transaction agreements and approvals, which are expected to proceed quickly given the makeup of NHS and Vystar’s shareholders. NHS major shareholders include Joseph Alegra, MD, owner of Lincoln Lee Investments; Keith Osborne, MD; Lam Ngoc Minh, CEO of Lien ‘A (one of the world’s largest latex manufacturers); Bryan Stone, MD, Vystar Board member; Steve Rotman; and Greg Rotman, consultant to NHS. The Rotmans are collectively forfeiting 75% of their equity in NHS to facilitate the transaction on favorable terms for Vystar.\n“One of our key strategies for Vystar growth that we recently announced was to augment product offerings, profit margins, and revenue through acquisition,” stated Steve Rotman. “NHS is the logical first acquisition, as any NHS revenues will add to Vystar’s bottom line, and it is more cost effective and operationally efficient to have Vystar’s distribution in-house, particularly since the two organizations share many of the same resources.”\nRotman continued, “We anticipate increased revenue in 2018, as Vystar expects to partner with additional manufacturers in sales of multiple products, such as solid latex mattresses, toppers and pillows; gloves; and other products, which we believe will achieve higher margins in comparison to solely licensing Vytex to manufacturers. Consumers are seeking ecofriendly, durable, and biodegradable natural products that provide a healthy experience for their loved ones in place of petroleum-based plastics and memory foams. Vytex is an ideal and cost effective material to use for products to fill this demand.”\nVytex is currently used in multiple mattress lines, including Natura ™, Gold Bond ®, King Koil® and Spring Air; Jeffco-manufactured components for toppers and mattresses sold to multiple manufacturers, and private label toppers and mattresses sold online. Vytex is also used in industrial adhesives, apparel padding and threads, shoes, sports equipment and electrical gloves. Vystar continues development of new Vytex formulations and is seeking additional manufacturing and development partners for numerous products including condoms, clothing, medical supplies, household products, sports equipment, shoes/sneakers, and industrial products. Contact Steve Rotman at 508-791-9114 or srotman@vytex.com .\nVideos on Vystar and products made with Vytex are available at: https://www.vytex.com/blog/category/videos/\nAbout Vystar Corporation :\nBased in Worcester, Mass., Vystar® Corp. (OTC Pink:VYST) is the exclusive creator of Vytex Natural Rubber Latex (NRL), a multi-patented, all-natural, raw material that contains significantly reduced levels of the proteins found in natural rubber latex and can be used in over 40,000 products. Vytex NRL is a 100% renewable resource, environmentally safe, \"green\" and fully biodegradable. Vystar is working with manufacturers across a broad range of consumer and medical products bringing Vytex NRL to market in adhesives, gloves, balloons, condoms, other medical devices and natural rubber latex foam mattresses, toppers, and pillows. For more information, visit www.vytex.com .\nForward-looking Statements: Investors are cautioned that certain statements contained in this document as well as some statements in periodic press releases and some oral statements of VYST officials are \"Forward-Looking Statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 (the \"Act\"). Forward-looking statements include statements which are predictive in nature, which depend upon or refer to future events or conditions, which include words such as \"believes,\" \"anticipates,\" \"intends,\" \"plans,\" \"expects,\" and similar expressions. In addition, any statements concerning future financial performance (including future revenues, earnings or growth rates), ongoing business strategies or prospects, and possible future VYST actions, which may be provided by management, are also forward-looking statements as defined by the Act. Forward-looking statements involve known and unknown risks, uncertainties, and other factors which may cause the actual results, performance or achievements of the Company to materially differ from any future results, performance, or achievements expressed or implied by such forward-looking statements and to vary significantly from reporting period to reporting period. Although management believes that the assumptions made and expectations reflected in the forward-looking statements are reasonable, there is no assurance that the underlying assumptions will, in fact, prove to be correct or that actual future results will not be different from the expectations expressed in this report. These statements are not guarantees of future performance and VYST has no specific intention to update these statements.\nContacts:\nMedia: Julie Shepherd, Accentuate PR, 847 275 3643, Julie@accentuatepr.com\nInvestors: Steven Rotman, Vystar CEO, 508-791-9114, srotman@vytex.com\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/d2e39614-f9fb-40b1-bf9c-b6f93fc03a88\nSource:Vystar Corp", "external_links": ["https://www.vytex.com/blog/category/videos/", "https://www.globenewswire.com/NewsRoom/AttachmentNg/d2e39614-f9fb-40b1-bf9c-b6f93fc03a88/en", "https://www.globenewswire.com/Tracker?data=cY3arKrJvdzL6jL6jBjuAWmZixraAyhwlwzs7DZgwR_cr7Gnqz5WqcpcVqqD5iB1EsYC52xr86uGsT4CtgPjs6ZV9HYt2Yux6UUfyIfYvvCQXFswJZ23fez1UuR6UfZwUAXz-aTCxvM1cWVAHJdd8dTVVILIZ68aoBmQD33hd0c_A5y-6TZ68c_7DM0H2C0M1n14cxQV6Mc4KB7anJSJiumSoCFyQr03iKTUOLxMtrugl9n5d4HcC5UEYUWm29BebYysQGdpFGcyXDDB3HoGzg==", "https://www.globenewswire.com/Tracker?data=bOhklMD3l5poYSI4gcAh2m6TLWD4q7Qok9HY_snC6PHowwFU29G6sOdRewMltem1PVpzBRDsscib2A3fx038MA==", "https://www.globenewswire.com/Tracker?data=IkRZq8WGlHHKjyKJq3Rla0F_1_uifNXBLje-z64J2-bOujRmC2geghIS2QuATtyAFTUfw9ID-jxKDH1Q2N4uxv1-k1ZjIz4QYuG5iC76nEyBAfZ2FnLy-CuPhEE-mbYZ", "http://www.globenewswire.com/NewsRoom/AttachmentNg/d2e39614-f9fb-40b1-bf9c-b6f93fc03a88", "https://www.globenewswire.com/Tracker?data=fsFgK0tYgHXdYWwAoG-kDH_IogNZRHv9BesPyrLB0e1egra6lk8143y1zfH8sVxHqQfm86XTphoieua_1oSTkdNjrf-6Qd5Mv1X02Pes2aQ=", "https://www.globenewswire.com/Tracker?data=kfEUB7dryuCo04jzHu3gHWqR3vAwDfFkgloSob_K-LAN0MGXIM-EGg5m9Rfl4-4T39aja6IPYdV5nyMD3kdqD8EIarsKK-403sbLDopSErM=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/327f4dc1-a354-4540-a896-ef60d87d793c", "https://www.globenewswire.com/Tracker?data=suli4ZBNW_FxfZg4jmcBFUCwd2c2lQavvqA4Cn1unl2ZnH9zGY85E4fznCHIJrtpILrTOswc-yb-c1rmHT7U3ayrHaNnDfO4V4_X8OBWJaDDdPZOPmn18Tu-gwJ_nqXLRaMemLTcl9366MVD3LSjEPIrTYmBg9Eki5ZY9CBqdv6ETPXciIe19tuFugI8y6Mi", "https://www.globenewswire.com/Tracker?data=a6ErUW4U19hZIWSvFqpw4o5qf-i3-qVM92y89fq-Hr4pfiZdLkpfb4rr3_FifTusuKN6IFCNcjXB7B0RTehIPg==", "https://www.globenewswire.com/Tracker?data=EzA8Dcbb_Z1dUzIIGJB3VTlWjUVpdVkEG7Bj15ZnQmTOwzIdDTcvMCXAcZPGSpHwQhPPLXqXH_4x8v9915GWQA==", "https://www.globenewswire.com/Tracker?data=K-ksfQfnoAnZTcHU9-30Jir6Qf0aM0wZBaEgROW07NoLC5BfURvkgo4b-LuDLMrUDWvbDGz6cfu0fY8Qf7hD-A=="], "published": "2018-01-09T16:30:00.000+02:00", "crawled": "2018-01-09T17:38:30.006+02:00", "highlightTitle": ""}