{"organizations": [], "uuid": "7aaef167f90e434d761420e7104db6d154bd4112", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/egypt-politics/egypts-sisi-announces-intention-to-run-for-second-term-idINKBN1F82J9", "country": "US", "domain_rank": 408, "title": "Egypt's Sisi announces intention to run for second term", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:05:00.000+02:00", "replies_count": 0, "uuid": "7aaef167f90e434d761420e7104db6d154bd4112"}, "author": "", "url": "https://in.reuters.com/article/egypt-politics/egypts-sisi-announces-intention-to-run-for-second-term-idINKBN1F82J9", "ord_in_thread": 0, "title": "Egypt's Sisi announces intention to run for second term", "locations": [], "entities": {"persons": [{"name": "sisi", "sentiment": "negative"}, {"name": "omar fahmy", "sentiment": "none"}, {"name": "ralph boulton", "sentiment": "none"}, {"name": "abdel fattah al-sisi", "sentiment": "none"}, {"name": "mohamed mursi", "sentiment": "none"}, {"name": "amina ismail", "sentiment": "none"}], "locations": [{"name": "egypt", "sentiment": "none"}, {"name": "cairo", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "muslim brotherhood", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAIRO (Reuters) - Egypt’s President Abdel Fattah al-Sisi said on Friday he will run for a second term in office in an election in March, which the former military commander is widely expected to win.\nSisi’s rule has brought some stability to the country, but critics say his popularity has been eroded by tough economic reforms that have hit people’s livelihood’s hard and by a crackdown on dissidents.\nHis supporters on the other hand say measures are needed to keep the country stable as it faces security challenges including attacks by Islamic State militants in the North Sinai region.\n“Today ... I tell you frankly and transparently that I hope you would allow and accept my candidacy for the president’s post,” Sisi told a cheering crowd.\nThe vote will be held on March 26-28, with a run-off vote on April 24-26 if no candidate wins more than 50 percent in the first round. Candidates will register from Jan. 20 to 29.\nIn the televised announcement, Sisi listed Egypt’s achievements during his first term, including a nascent financial recovery after years of political turmoil and economic instability.\n“I pledge that the upcoming presidential election will be free and transparent .. and be characterized by equal opportunities between candidates,” Sisi said.\nSisi came to prominence when he led the army’s ouster of President Mohamed Mursi of the Muslim Brotherhood in 2013 - the country’s first freely elected leader - two years after the downfall of longtime ruler President Hosni Mubarak in the “Arab Spring” uprisings that swept the Middle East.\nThe former general became president himself in 2014, winning 96.91 percent of the vote, although turnout was only about 47 percent of the country’s 54 million voters.\nRights groups say he has led an unprecedented crackdown on political opponents, activists and critical media.\nThose challenging Sisi describe a sweeping effort to kill off their campaigns before they have begun, with media attacks on candidates, intimidation of supporters, and a nomination process stacked in favour of the former general.\nHis most high-profile challengers are former army chief of staff Sami Anan and human rights lawyer Khaled Ali, but neither is expected to garner enough votes to oust him.\nReporting by Omar Fahmy and Amina Ismail; Writing by John Davison; Editing by Ralph Boulton and Hugh Lawson\n ", "external_links": [], "published": "2018-01-19T22:05:00.000+02:00", "crawled": "2018-01-19T22:22:23.025+02:00", "highlightTitle": ""}