{"organizations": [], "uuid": "e482098547db8240987b7de7782e77622f4c6c49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-acclaimed-greenberg-gross-llp-partner-becky-s-james-joins-criminal-defense-team-in-bill-cosby-trial.html", "country": "US", "domain_rank": 767, "title": "Acclaimed Greenberg Gross LLP Partner Becky S. James Joins Criminal Defense Team in Bill Cosby Trial", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:00:00.000+02:00", "replies_count": 0, "uuid": "e482098547db8240987b7de7782e77622f4c6c49"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-acclaimed-greenberg-gross-llp-partner-becky-s-james-joins-criminal-defense-team-in-bill-cosby-trial.html", "ord_in_thread": 0, "title": "Acclaimed Greenberg Gross LLP Partner Becky S. James Joins Criminal Defense Team in Bill Cosby Trial", "locations": [], "entities": {"persons": [{"name": "becky s. james", "sentiment": "negative"}, {"name": "becky james", "sentiment": "none"}, {"name": "mesereau", "sentiment": "none"}, {"name": "michael jackson", "sentiment": "none"}, {"name": "bill cosby", "sentiment": "none"}, {"name": "kevin steele", "sentiment": "none"}, {"name": "tom mesereau", "sentiment": "none"}, {"name": "cosby", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "greenberg gross llp", "sentiment": "negative"}, {"name": "joins criminal defense team", "sentiment": "negative"}, {"name": "commonwealth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES--(BUSINESS WIRE)-- Greenberg Gross LLP , a high-stakes trial and appellate law firm, announces that partner Becky S. James will join the high-powered defense team representing entertainer Bill Cosby in his fight against criminal sexual assault charges in Commonwealth v. Cosby, pending in Pennsylvania state court. The first trial in that case ended in a hung jury. District Attorney Kevin Steele, who vowed during his 2015 campaign to secure a conviction of Mr. Cosby, has chosen to retry the case, and the retrial is scheduled to begin on April 2, 2018. Mr. Cosby replaced his criminal defense team from the first trial with a new team that will be led by Tom Mesereau, whose many trial victories in a storied career include a complete acquittal for Michael Jackson in the 2005 trial involving alleged sexual offenses.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180124006026/en/\nBecky S. James (Photo: Business Wire)\n“We are thrilled to have Becky James join the team,” said Mr. Mesereau. “Her expertise as one of the country’s best appellate advocates will be of great value as we contend with prosecutors who, as they did in the first trial, will seek to obtain every tactical advantage. Becky’s expert handling of such legal issues will enable the other members of the defense team to focus on establishing Mr. Cosby’s innocence.”\nMs. James joined Greenberg Gross LLP in September 2017 as head of its Appellate Practice Group. Previously in her career, Ms. James was the Chief of Criminal Appeals at the U.S. Attorney’s Office in Los Angeles, where she oversaw the approximately 500 criminal appeals handled by that office each year. Since leaving the U.S. Attorney’s Office, Ms. James has focused her practice on appeals and white collar criminal defense.\nIn January 2018, not long after she joined Greenberg Gross LLP, Ms. James was named Managing Partner of the firm’s Los Angeles office. “Becky’s legal prowess, strong leadership and stellar track record made her an obvious choice to lead our Los Angeles office, and those same qualities will make her an invaluable addition to Mr. Cosby’s criminal defense team,” said Greenberg Gross LLP co-founding partner Wayne R. Gross .\nGreenberg Gross LLP already represents Mr. Cosby in several civil actions. Ms. James recently filed a petition for review in the California Supreme Court on behalf of Mr. Cosby, arguing that permitting defamation liability based on an attorney’s denial of public accusations of criminal conduct violates the First Amendment and California’s litigation privilege. Two federal courts of appeals have dismissed similar lawsuits on First Amendment grounds, including McKee v. Cosby, a First Circuit decision in a case argued by Greenberg Gross LLP partner Alan Greenberg.\n“I am excited to work with such a talented team of lawyers in the extremely important criminal matter against Mr. Cosby,” Ms. James said. “We are confident that a fair trial will result in an acquittal and that justice will finally be served.”\nAbout Becky S. James\nAs chair of Greenberg Gross LLP’s Appellate Practice Group and Managing Partner of the Los Angeles office, Ms. James’ practice focuses on representing businesses, executives and individuals in matters involving complex criminal and civil appeals. Following her 12-year tenure at the U.S. Attorney’s Office, Ms. James joined Manatt, Phelps & Phillips LLP as a partner, where she served as co-chair of the firm’s national appellate practice group. Prior to joining the firm, she founded the successful appellate boutique James & Associates.\nMs. James’ many professional successes include securing a significant appellate victory in a published 9th Circuit opinion, United States v. Pocklington, 792 F.3d 1036 (9 th Cir. 2015), which vacated a judgment against her client Peter Pocklington, former owner of the Edmonton Oilers hockey team.\nIn addition to her leadership roles at Greenberg Gross LLP and the U.S. Attorney’s Office, Ms. James serves on the American Bar Association Criminal Justice Section, White Collar Crime Subcommittee and the Women’s White Collar Defense Association. She has also served on the board of the Women Lawyers Association of Los Angeles and was selected to serve as a lawyer representative to the 9th Circuit Judicial Conference, where she served as Co-Chair of the Central District Lawyer Representatives and served on the 9th Circuit Conference Executive Committee.\nMs. James graduated from Stanford Law School and served as a law clerk for the Honorable Pamela Ann Rymer on the 9th Circuit Court of Appeals.\nGreenberg Gross LLP is an elite business litigation firm that specializes in high-stakes business cases and white collar defense matters across the country. The firm represents public and private companies, prominent law firms, non-profit organizations and high-level executives in their most significant cases. U.S. News – Best Lawyers® named the firm among its “Best Law Firms” for commercial litigation and white collar defense for five consecutive years. Greenberg Gross LLP has offices in Los Angeles and Orange County.\nLos Angeles\n601 S. Figueroa Street, 30 th Floor\nLos Angeles, CA 90017\nMain (213) 334-7000\nOrange County\n650 Town Center Drive, Suite 1700\nCosta Mesa, CA 92626\nMain (949) 383-2800\nFax (949) 383-2801\nwww.ggtriallaw.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006026/en/\nSara Gardner\nBerbay Marketing & PR\n(310) 405-7330\nSara@berbay.com\nSource: Greenberg Gross LLP", "external_links": ["http://www.businesswire.com/news/home/20180124006026/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fggtriallaw.com%2Fattorneys%2Fbecky-james%2F&esheet=51748421&newsitemid=20180124006026&lan=en-US&anchor=Becky+S.+James&index=2&md5=f4ff09b3d4c200ff073ef3b0ef827543", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ggtriallaw.com&esheet=51748421&newsitemid=20180124006026&lan=en-US&anchor=www.ggtriallaw.com&index=5&md5=0b219d8417ee3a285c6563ee89e36c83", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fggtriallaw.com%2FArticles%2FDickinson_v_Cosby_Petition_for_Review.pdf&esheet=51748421&newsitemid=20180124006026&lan=en-US&anchor=petition+for+review&index=4&md5=82ea9e7464afe3b13be6553e70c3bf33", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fggtriallaw.com%2Fattorneys%2Fwayne-gross%2F&esheet=51748421&newsitemid=20180124006026&lan=en-US&anchor=Wayne+R.+Gross&index=3&md5=da1fb91d1f0a5ec8e448238633a7b23d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fggtriallaw.com%2F&esheet=51748421&newsitemid=20180124006026&lan=en-US&anchor=Greenberg+Gross+LLP&index=1&md5=e8698084d7645e506aa2f82d5b288932"], "published": "2018-01-25T00:00:00.000+02:00", "crawled": "2018-01-25T02:04:10.021+02:00", "highlightTitle": ""}