{"organizations": [], "uuid": "4abc9f627cb9cb3913ec12e33857cc2184f06f46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/13/104897058-GettyImages-891748952-1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/bombshell-wolff-book-on-trump-poses-threat-for-republicans-in-midterms.html", "country": "US", "domain_rank": 767, "title": "Bombshell Wolff book on Trump poses threat for Republicans in midterms", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.184, "site_type": "news", "published": "2018-01-04T15:32:00.000+02:00", "replies_count": 0, "uuid": "4abc9f627cb9cb3913ec12e33857cc2184f06f46"}, "author": "John Harwood", "url": "https://www.cnbc.com/2018/01/04/bombshell-wolff-book-on-trump-poses-threat-for-republicans-in-midterms.html", "ord_in_thread": 0, "title": "Bombshell Wolff book on Trump poses threat for Republicans in midterms", "locations": [], "entities": {"persons": [{"name": "saul loeb", "sentiment": "negative"}, {"name": "wolff", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "oval office", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "fox news", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In the first month of Barack Obama's second year in the White House, Fox News highlighted a controversy: a photograph showed his feet on the historic Resolute Desk.\n\"Is President Obama disrespecting the Oval Office?\" the Fox website asked.\nIn the first month of Donald Trump's second year, he has called for the imprisonment of political opponents and taunted North Korea's nuclear-armed leader with threats of annihilation. In a new book informed by extensive White House access, top officials described the president with words like \"crazy\" and \"stupid,\" depicting Trump as an immature 71-year-old incapable of maintaining attention long enough to process new information or even conduct a serious conversation.\nThe contrast underscores two things at once: the triviality of attacks on how Obama handled his presidential duties and the gravity of questions about Trump's fitness to handle them now. The latter poses a growing threat for Republicans who seek to maintain their majority in Congress in the 2018 elections while shielding an unpopular president from accountability.\nThroughout 2017, Trump's behavior as president was the dominant national story, not much of which has flattered him or his party.\nMost Americans disapprove of his job performance, and the tax cut that provided his sole major legislative accomplishment. Trump's alienation of big chunks of the electorate — notably college-educated whites, women and young voters — fueled striking Democratic victories last fall in Virginia and Alabama.\nJonathan Ernst | Reuters President Trump ponders the answer to a question from a reporter en route to Hanoi, Vietnam, aboard Air Force One. Nor do a growing economy and rising stock values offer Republicans much comfort in 2018. Early polling shows Democrats strongly positioned for midterm gains in November.\nIn recent days, Republicans have found more cause for alarm. Trump's year-end interview with The New York Times featured a series of rambling, unfocused assertions at odds with reality.\nHis tweeted demand of \"Jail!\" for former Hillary Clinton aide Huma Abedin evoked images of autocratic leaders elsewhere. His belligerent boast of having \"a much bigger and more powerful…nuclear button\" than North Korea's Kim Jong Un's amplified doubts about the capacity for handling the presidency's power over war and peace.\n\"It raises the question about whether the president has the judgment and discipline that are commensurate with that power,\" said Richard Haass, a national security aide under both Presidents Bush and now head of the Council on Foreign Relations. \"That ought to concern people.\"\nSo does the harsh depiction in Michael Wolff's expose of Trump's first year in office. In the book \"Fire and Fury,\" those deriding the president's capabilities, judgment and stability include his senior-most aides and family members.\n\"He couldn't really converse, not in the sense of sharing information or of a balanced back-and-forth conversation,\" Wolff wrote in characterizing the view of Ivanka Trump and her husband, Jared Kushner .\nAt another point, Wolff described the president as \"a figure of sputtering and dangerous insecurities.\" Determining his wishes, Wolff Quote: s ex-White House aide Katie Walsh as saying, was \"like trying to figure out what a child wants.\"\nThe damaging assessments extend beyond the personal. Steve Bannon , who served as chief executive of Trump's campaign and chief strategist in his White House, called it \"treasonous\" for top Trump advisers to meet with Russians offering dirt on Hillary Clinton at Trump Tower in June 2016. Contradicting the president's assertions that he knew nothing of that meeting until much later, Bannon said there was \"zero\" chance that Donald Trump Jr. did not take those Russians to his father's office that day.\nAlbin Lohr-Jones | Pool via Bloomberg | Getty Images Donald Trump Jr. The pattern of Republican reaction to such disclosures has been to ignore or downplay them. GOP lawmakers generally cast the president as an unconventional, deliberately provocative figure and say they await results from investigations by Congress and Justice Department special counsel Robert Mueller .\nThat partly reflects their desire to achieve priorities they share with the White House, especially the tax cut. It partly reflects their fear of zealous Trump supporters within the GOP rank-and-file, who might oust them in party primaries.\nYet the more damaged Trump becomes — legally or politically or both — the more vulnerable House and Senate Republicans become among the broader November electorate. History shows that voters angry or uneasy about an incumbent president turn against his party in midterm elections.\nDemocrats won't capture the Senate seat in Utah opened up by the retirement of veteran Republican Orrin Hatch . But the favorite to win it, former GOP presidential nominee Mitt Romney , foreshadowed today's concerns with his March 2016 speech excoriating Trump's \"temperament, his stability, and his suitability to be president.\"\n\"This is a time for choosing,\" Romney declared in urging Republicans to nominate someone else. The party's House and Senate candidates have the most to fear from voter choices now.\nWATCH: Wien says GOP will lose House & Senate because of Trump show chapters GOP will lose House and Senate because of negative view of Trump, says Wall Street legend Byron Wien 8:44 AM ET Wed, 3 Jan 2018 | 01:26", "external_links": [], "published": "2018-01-04T15:32:00.000+02:00", "crawled": "2018-01-04T15:46:22.007+02:00", "highlightTitle": ""}