{"organizations": [], "uuid": "4b89f1d045513ffbe49193883cb4a08fb431dfa4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-clearblade-inc-joins-ui-labs-to-advance-digital-manufacturing.html", "country": "US", "domain_rank": 767, "title": "ClearBlade Inc. Joins UI LABS to Advance Digital Manufacturing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:00:00.000+02:00", "replies_count": 0, "uuid": "4b89f1d045513ffbe49193883cb4a08fb431dfa4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-clearblade-inc-joins-ui-labs-to-advance-digital-manufacturing.html", "ord_in_thread": 0, "title": "ClearBlade Inc. Joins UI LABS to Advance Digital Manufacturing", "locations": [], "entities": {"persons": [{"name": "lizabeth", "sentiment": "none"}, {"name": "clearblade", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "advance digital manufacturing", "sentiment": "negative"}, {"name": "inc.", "sentiment": "negative"}, {"name": "clearblade inc", "sentiment": "neutral"}, {"name": "digital manufacturing and design innovation institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Jan. 16, 2018 /PRNewswire/ -- ClearBlade, Inc., the high-growth Internet of Things (IoT) software company, has announced joining the Digital Manufacturing and Design Innovation Institute (DMDII) located within UI LABS. UI LABS was established to bring together top talent from universities + industry (the \"UI\" in the name), harnessing the power of collaboration of its partners by leveraging their collective resources to pursue innovation and drive tech-based economic development.\nClearBlade has made a multi-year commitment to DMDII and is joining a network of over 300 organizations who recognize that collaboration is key to addressing the world's most pressing problems.\nDMDII is where innovative manufacturers plan their future. As a public-private partnership, DMDII has the capabilities, innovative spirit, and collaborative expertise to help American manufacturers tackle problems far too big for any one company to solve in its own.\n\"We're thrilled to have ClearBlade as a partner and greatly value their experiential insights into the digital conversation,\" said Lizabeth Stuck, Director of Membership Engagement, UI LABS. \"ClearBlade is experienced in providing complete IoT solutions to connect machines and people to operations and business systems while maintaining a secure and flexible deployment architecture.\"\nThe mission of DMDII is to transform American manufacturing by getting new technology into the hands of its partners, so they can build things more quickly, less expensively and at a higher quality. Using software and sensors, DMDII helps embed the Internet into production lines, enabling them to send and receive data securely.\nOther key members of DMDII include: Boeing, Caterpillar, Dow, Lockheed Martin Corp., Northrop Grumman, and Stanley Black & Decker.\nThe ClearBlade Cloud, On-Premise, and Edge IoT Platforms are specifically engineered to ensure a solid foundation for building complete IoT solutions for the enterprise, with unprecedented architecture flexibility and security. It is designed to allow businesses to rapidly implement and run their unique IoT solution where it's required, which automatically syncs across on-premise, cloud, and edge deployments. The ClearBlade IoT Platforms eliminate costly delays and the risk of building an ineffective or obsolete solution.\n\"ClearBlade strongly believes in pushing the envelope when it comes to revolutionizing IoT technology, transforming industries and enterprises to create a secure and seamlessly connected world. We actively pursue sharing our innovations with our peers across industries, leveraging collaborative efforts to create complete solutions on a much grander scale,\" says Eric Simone, CEO of ClearBlade. He adds, \"Joining a consortium such as UI Labs and DMDII and its partners provides the opportunity to extend the digital thread to the entire supply chain ecosystem, achieving many transformational benefits evidenced by reducing operational costs and increasing profitability.\"\nAbout ClearBlade, Inc. ClearBlade is the enterprise Internet of Things software company to rapidly engineer and run secure, real-time, scalable IoT applications. ClearBlade enables companies to build IoT solutions that make streaming data actionable by combining business rules and machine learning with powerful visualizations and integrations to existing business systems. Built from an enterprise-first perspective, the ClearBlade Platform runs securely in any cloud, on-premise, and at the edge.\nThe ClearBlade Edge Platform brings the full power of the ClearBlade IoT Cloud Platform to gateways and industrial servers on the plant floor, job site or building facility. Safely behind the firewall, the ClearBlade Edge Platform intelligently syncs with the ClearBlade IoT Cloud Platform guaranteeing security, connectivity, execution and speed.\nClearBlade is developer focused with an extensive library of proven and tested pre-built components and integrations. ClearBlade accelerates the time-to-market while significantly reducing the cost and risk of delivering IoT solutions, creating new business models and revenue streams.\nClearBlade is headquartered in Austin, TX. For more information about the company and our software, please visit https://clearblade.com/\nClearBlade, Inc.\n103 E. 5th Street\nAustin, Texas 78701\n512-686-3037\ninfo@clearblade.com\nHeadquarters: Austin, Texas - Website https://www.clearblade.com\n© ClearBlade Inc. All rights reserved\nTwitter\nLinkedIn\nEmail\nAbout DMDII\nThe Digital Manufacturing and Design Innovation Institute (DMDII) is where innovative manufacturers plan their future. In partnership with UI Labs and the Department of Defense, DMDII provides factories with the digital tools and expertise they need to build things more quickly, less expensively and at a higher quality. As a result, our more than 300 partners increase their productivity and win more business. To learn more about DMDII visit http://www.uilabs.org/innovation-platforms/manufacturing/\nAbout UI LABS\nUI LABS is a tech organization driving the digital future of manufacturing and cities. We help our more than 300 partners across universities + industry solve problems far too big for them to solve on their own. By guiding these partners through complex projects, we help them deliver cutting-edge solutions to their customers, improve their financial performance and transform industries. To learn more about UI LABS visit http://www.uilabs.org\nView original content with multimedia: http://www.prnewswire.com/news-releases/clearblade-inc-joins-ui-labs-to-advance-digital-manufacturing-300582774.html\nSOURCE ClearBlade Inc.", "external_links": ["https://www.clearblade.com/", "https://twitter.com/ClearBlade", "https://www.linkedin.com/company/534253?trk=tyah&trkInfo=clickedVertical:company,entityType:entityHistoryName,clickedEntityId:company_company_company_company_company_company_company_company_company_company_company_company_company_company", "https://clearblade.com/", "http://www.prnewswire.com/news-releases/clearblade-inc-joins-ui-labs-to-advance-digital-manufacturing-300582774.html", "http://www.uilabs.org/innovation-platforms/manufacturing/", "http://www.uilabs.org/"], "published": "2018-01-16T17:00:00.000+02:00", "crawled": "2018-01-16T19:13:11.000+02:00", "highlightTitle": ""}