{"organizations": [], "uuid": "8286077a250613785d0b21be05532666ec2b6875", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220131392&w=1200&r=LYNXMPEE0700J", "site_section": "http://feeds.reuters.com/reuters/UKEntertainment/", "section_title": "Reuters: Entertainment News", "url": "https://uk.reuters.com/article/us-awards-goldenglobes-fashion/stars-say-times-up-wearing-black-on-the-golden-globes-red-carpet-idUKKBN1EX00W", "country": "US", "domain_rank": 408, "title": "Stars say 'Time's Up' wearing black on the Golden Globes red carpet", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T06:14:00.000+02:00", "replies_count": 0, "uuid": "8286077a250613785d0b21be05532666ec2b6875"}, "author": "", "url": "https://uk.reuters.com/article/us-awards-goldenglobes-fashion/stars-say-times-up-wearing-black-on-the-golden-globes-red-carpet-idUKKBN1EX00W", "ord_in_thread": 0, "title": "Stars say 'Time's Up' wearing black on the Golden Globes red carpet", "locations": [], "entities": {"persons": [{"name": "reuters/mario anzuoni  jessica chastain", "sentiment": "none"}, {"name": "kit harington", "sentiment": "none"}, {"name": "piya sinha-roy", "sentiment": "none"}, {"name": "natalie portman", "sentiment": "none"}, {"name": "laura dern", "sentiment": "none"}, {"name": "chastain", "sentiment": "none"}], "locations": [{"name": "beverly hills", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "spencer", "sentiment": "none"}], "organizations": [{"name": "hollywood", "sentiment": "none"}, {"name": "min read  los angeles", "sentiment": "none"}, {"name": "time", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 1:08 AM / Updated 5 hours ago Stars say 'Time's Up' wearing black on the Golden Globes red carpet Piya Sinha-Roy 3 Min Read \nLOS ANGELES (Reuters) - From flowing gowns to tailored tuxedos, Hollywood’s film and television stars dressed in their finest black on the Golden Globes red carpet on Sunday in solidarity with the Time’s Up campaign to fight sexual harassment in the workplace. \nJessica Chastain, Laura Dern and Natalie Portman led female and male nominees as well as attendees dressed in black at the awards show where the sexual harassment scandal roiling Hollywood is expected to dominate the conversation. \n“We’re here for the Time’s Up movement. Octavia (Spencer) is my date -- girl power! We stand in solidarity against any abuse of power,” Chastain, nominated for “Molly’s Game” and wearing a black velvet gown with a silver sequined back, said in a televised interview with NBC on the red carpet. \n“It’s about people who are voiceless, and it’s about empowerment,” added Spencer, who is nominated for “Shape of Water.” \nIn the week leading up to the awards ceremony, more than 300 Hollywood industry figures including actors, directors and writers, launched the Time’s Up campaign to address workplace sexual harassment misconduct. \nPortman, who joined Instagram in the past week to promote awareness of Time’s Up, opted for a black velvet dress and accompanied a pregnant America Ferrera, wearing a black sequined dress with a tuxedo jacket, on the carpet. 75th Golden Globe Awards – Arrivals – Beverly Hills, California, U.S., 07/01/2018 – Actor Kit Harington. REUTERS/Mario Anzuoni \n“It’s an incredible opportunity to get to go with a friend, an activist, someone who can have our voices together because we’ve been separated for so long ... and how much louder and stronger our voices can be when we come together,” Portman said. \nDern, in a strapless black gown, was accompanied by Monica Ramirez, the co-founder and president of the National Farmworker Women’s Alliance (Alianza Nacional De Campesinas), which represents more than 700,000 women working in the agricultural industry, fighting workplace sexual misconduct. Slideshow (16 Images) \n“It’s time for us to make a difference,” Dern said. \nWhile black was the palette of choice on Sunday, stars spun their own twist with an array of textures and silhouettes. \n“Black-ish” star Tracee Ellis Ross donned a black headwrap with her black satin Marc Jacobs halterneck dress, “The Crown” star Claire Foy opted for a black tuxedo suit, twinning with her co-star Matt Smith, and “Will and Grace” actress Debra Messing wore a black sequined Christian Siriano dress with trousers. \n“Get Out” actress Allison Williams wore a strapless sequined Armani Prive black gown with a bold orange and silver bodice, while Mandy Moore opted for a black sleeveless halterneck Rosie Assoulin gown with a red sash. \nAngelina Jolie, accompanied by her son Pax and nominated for her film “First They Killed My Father,” wore a black gown with sheer sleeves embellished with black feathers. Additional reporting by Nichola Groom; Editing by Sandra Maler", "external_links": [], "published": "2018-01-08T06:14:00.000+02:00", "crawled": "2018-01-08T08:13:28.035+02:00", "highlightTitle": ""}