{"organizations": [], "uuid": "eb80e6b8422b5b2ea835e798e7abccb7b73a5410", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/autoliv-results/update-1-autoliv-sees-faster-sales-growth-as-order-boom-kicks-in-idUSL8N1PP3K8", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Autoliv sees faster sales growth as order boom kicks in", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T20:39:00.000+02:00", "replies_count": 0, "uuid": "eb80e6b8422b5b2ea835e798e7abccb7b73a5410"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/autoliv-results/update-1-autoliv-sees-faster-sales-growth-as-order-boom-kicks-in-idUSL8N1PP3K8", "ord_in_thread": 0, "title": "UPDATE 1-Autoliv sees faster sales growth as order boom kicks in", "locations": [], "entities": {"persons": [{"name": "takata", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "stockholm", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "autoliv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds shares, background, detail, CEO comments)\nSTOCKHOLM, Jan 30 (Reuters) - Sweden’s Autoliv, the world’s biggest maker of airbags and seatbelts, forecast underlying sales would grow faster than analysts’ expect in 2018 as years of booming orders finally kick in, boosting its shares on Tuesday.\nThe auto safety gear maker has been winning a string of new contracts in recent years from Japanese rival Takata, which has been at the centre of the auto industry’s biggest-ever recall and filed for bankruptcy last year.\nAutoliv, has spent heavily in recent years to ensure it can deliver on the orders, weighing on profitability, while the anticipated sales boost has taken time to arrive.\nLong lead times in the industry between orders and sales have meant the full benefit of the bulging order book has only now begun to materialise for the manufacturer.\nAutoliv forecast like-for-like sales - excluding acquisitions, divestments and currency moves - would grow more than 7 percent this year, compared with analysts’ average forecast of 5.6 percent in a Reuters poll.\n“We look forward with great expectations, as order intake in 2017 reached new historic highs for each of our Passive Safety and Electronics segments,” Chief Executive Jan Carlson said in a statement.\nAutoliv said its quarterly adjusted operating profit rose to $263 million from $243 million in the year-ago quarter, beating a mean forecast for $247 million in a Reuters poll.\nThe company makes radar products, vision systems and advanced driver assistance software in its Electronics business, while Passive safety includes airbags and seatbelts and generates the bulk of company earnings.\nAutoliv said last year it was planning to split into two listed companies, with one focused on high-tech safety gear to capture the rapid growth related to advances towards self-driving vehicles.\nMoves to split sprawling companies have become a trend among automakers and their suppliers, with Delphi’s spin-off of Aptiv last year a case in point.\nAutoliv shares were up 5 percent at 1153 GMT. They have risen more than 20 percent since the company announced its planned split in September. (Reporting by Johannes Hellstrom and Helena Soderpalm; Editing by Niklas Pollard and Mark Potter)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T20:39:00.000+02:00", "crawled": "2018-01-31T16:21:13.004+02:00", "highlightTitle": ""}