{"organizations": [], "uuid": "a40f6089abfea222ad687b71df31b05bf95a942f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/23/104668331-GettyImages-837591040.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/trumps-market-cheerleading-tweets-could-end-up-fueling-a-bubble.html", "country": "US", "domain_rank": 767, "title": "Trump's market cheerleading tweets could end up fueling a bubble", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:32:00.000+02:00", "replies_count": 0, "uuid": "a40f6089abfea222ad687b71df31b05bf95a942f"}, "author": "Jeff Cox", "url": "https://www.cnbc.com/2018/01/19/trumps-market-cheerleading-tweets-could-end-up-fueling-a-bubble.html", "ord_in_thread": 0, "title": "Trump's market cheerleading tweets could end up fueling a bubble", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "quincy krosby", "sentiment": "none"}], "locations": [{"name": "oval office", "sentiment": "none"}], "organizations": [{"name": "prudential financial", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Financial markets have endured many bubbles over the centuries, from tulip mania in the 17th century to the dot-com bubble and, most famously, the real estate bubble that nearly capsized the global economy a decade ago.\nBut the presidential Twitter bubble?\nNo one in his position has ever talked up the stock market as much as Donald Trump , and it's worth considering, with the president nearing the anniversary of his first year in office, whether the Oval Office cheerleading is contributing to a historically relentless boom on Wall Street .\n\"A president can create an environment that is business friendly and talk about it. What we saw was he talked about it and it did come to fruition,\" said Quincy Krosby, chief market strategist at Prudential Financial. \"The president has been explicitly clear about what he wanted to achieve: deregulation, tax cuts and an environment that is friendly to business. That is a key ingredient for markets.\"\nThe question for investors is when it goes too far.\nStocks have been on a relentless tear since Trump won the presidency in November 2016. The Dow Jones industrial average , a popular if narrow measure of market performance, is up about 42 percent and has continued to knock down records on a regular basis.\nGetty Images President Donald Trump gives a thumbs up to supporters at the Phoenix Convention Center during a rally on August 22, 2017 in Phoenix, Arizona. The problem with such rallies — Wall Streeters are cautious about using the term \"bubble\" until, of course, the bubble pops — is that they're lots of fun when on the way up and terrifying when they head in the other direction.\n\"The higher a market goes without a meaningful pullback, the deeper the fall when it finally does happen. Something will come along to pierce this market's enthusiasm,\" Krosby said. \"If you're going to live by the stock market moving higher, you also have to be prepared to suffer the wrath when the market does pull back.\"\nDespite the hazards that betting on a constantly rising market inherently entail, Trump has continued to pump up the market as a key measure of economic performance during his administration.\nThe president last tweeted about stocks on Jan. 13, boasting of a \"big day\" as the market hit yet another new high.\nYesterday was a big day for the stock market. Jobs are coming back to America.\nMaking the gains all the more stunning is that they come amid ever escalating tensions on Capitol Hill that could yet lead to a government shutdown . That's aside from worries about nuclear war with North Korea, a hot-again battle over immigration, and as Trump faces a moribund approval rating that has been inversely correlated to economic growth and the stock rally.\n\"We've never seen a market that has been so divorced from the chaos and ongoing circus in Washington, so laser-focused on what's fundamentally better,\" said Art Hogan, chief market strategist at B. Riley FBR. \"A strong fundamental backdrop seems to have taken the front burner and everything that in another place and time would have adversely affected us gets pushed to the back burner.\"\nSo if it's true that fundamentals are behind the market's willingness to discard headline risk, the argument that Trump is adding hot air to a bubble loses some steam. Unless ...\n\"At some point in time that won't be the case,\" Hogan said. \"When that does happen, it's something that's not fundamental and can't be modeled, like leaving NAFTA or tweeting our way into a trade war.\"\nShort of that, the market's willing to ride out the political warfare in Washington and watch Trump's tweets with an amusement foreign to much of the outside world, where pitched battles over the president's indelicate speech flood the airwaves on a daily basis.\nIn fact, investors have shown considerable willingness to tolerate and even thrive under political chaos over the years. The Philadelphia Fed even tracks partisan conflict on an index. The chart below shows an overlay of the index — spikes represent heightened tension — with the performance of the S&P 500.\n\"Gridlock-is-good at times helps to explain why partisan conflict has not been a negative for the market,\" said Liz Ann Sonders, chief investment strategist at Charles Schwab. \"There's just such a momentum force in the markets now that participants are willing to look past all the concerns that are out there.\"\nThose who worry the market is in a bubble cite a number of factors, in particular elevated valuation, generational highs in sentiment and the flood of money pouring into stock-based funds.\nOne of those concerns as well is that the president himself, despite being the market's biggest cheerleader, could also be its downfall should one of his rants go awry.\n\"We would never attempt to say what we think ultimately will be the catalyst. Fill in the blank: A tweet that goes beyond the bizarre bounds we already have experienced? Who knows?\" Sonders said. \"It's hard to judge which one of these things, or a collection of things, becomes a trigger.\"\n\"What always happens is at some point we do get some trigger or catalyst for a sell-off in the market,\" she added. \"You look back and say, 'How did we not figure out that was coming?'\"\nWATCH: Tax reform and one other thing gave Trump a first year market rally\nshow chapters Tax reform and one other thing gave Trump a first year market rally 19 Mins Ago | 01:11", "external_links": [], "published": "2018-01-19T17:32:00.000+02:00", "crawled": "2018-01-19T17:45:37.004+02:00", "highlightTitle": ""}