{"organizations": [], "uuid": "d46248bcbbf7039bf9c4b8bc9e26aefe92eadf36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-wellforce-hires-tufts-medical-center-ceo-to-lead-clinical-innovation-transform-healthcare.html", "country": "US", "domain_rank": 767, "title": "Wellforce Hires Tufts Medical Center CEO To Lead Clinical Innovation, Transform Healthcare", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T20:30:00.000+02:00", "replies_count": 0, "uuid": "d46248bcbbf7039bf9c4b8bc9e26aefe92eadf36"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-wellforce-hires-tufts-medical-center-ceo-to-lead-clinical-innovation-transform-healthcare.html", "ord_in_thread": 0, "title": "Wellforce Hires Tufts Medical Center CEO To Lead Clinical Innovation, Transform Healthcare", "locations": [], "entities": {"persons": [{"name": "michael wagner", "sentiment": "none"}, {"name": "mike", "sentiment": "none"}, {"name": "wagner", "sentiment": "none"}, {"name": "norm deschene", "sentiment": "none"}, {"name": "wellforce", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "burlington", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "wellforce", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "wellforce hires tufts medical center", "sentiment": "negative"}, {"name": "tufts medical center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BURLINGTON, Mass., Jan. 18, 2018 /PRNewswire-USNewswire/ -- Resolute in its mission to set a new standard in healthcare, Wellforce today announced that Michael Wagner, MD, President and Chief Executive Officer of Tufts Medical Center and Floating Hospital for Children in Boston, will become its new Chief Physician Executive. In this role, Dr. Wagner will bring together the nearly 3,000 physicians of Wellforce to develop a bold, innovative strategy that improves the health of patients and communities and creates an environment where clinicians can thrive. Dr. Wagner was chosen for the senior leadership position after a national search.\n\"In every article you read, every conference you attend, every conversation you have, it is clear our healthcare system is broken and change is needed now,\" said Norm Deschene, CEO of Wellforce . \"Wellforce is going to be at the forefront of the innovative thinking that redefines healthcare and no one is better suited to lead this effort with our physicians than Mike, who has worked tirelessly to improve care in community settings, in Massachusetts and across the country and as a leader of a physician's organization and major academic medical center.\"\n\"I have cherished my time at Tufts Medical Center. It is where I began my career as a primary care physician and where I have had the pleasure of serving as CEO for an incredibly dedicated workforce,\" said Dr. Wagner , who has served as the organization's CEO since September of 2013. \"Collaborating with the best physicians in the state, and their hospital partners, we'll be able to imagine new ways to provide greater access to convenient, high quality care while creating an environment where doctors can spend less time with paperwork and process and more time with their patients.\"\nDr. Wagner will begin his tenure as Chief Physician Executive by listening to physicians throughout the system to hear the challenges they face and the opportunities they see for the future.\n\"There is a seismic shift happening in health care. We have the opportunity to provide care in more places, through new technologies, with diverse partners and in ways that are more convenient and affordable for communities. We need to connect our services and ensure patients are supported at every level of their healthcare journey. To achieve these goals, physicians need time to focus on patients. The Wellforce system can support them by providing the infrastructure they need to have thriving, patient-centered practices without the burnout pervasive in the profession nationally,\" said Dr. Wagner .\nThe Wellforce physician network has the largest geographic reach in Eastern Massachusetts, with doctors from Cape Cod to the New Hampshire border.\nDr. Wagner is expected to transition to the Wellforce role in May 2018. The Tufts MC Board of Trustees has convened a search committee to find the next leader of Tufts MC and Floating Hospital for Children and has retained a prominent recruitment firm for the national search.\n\"Over the four plus years that Mike has been at the helm, the Medical Center has flourished. He has stabilized our financial picture, grown our key clinical services lines and created opportunities to expand services into the community, while providing the very best quality of care to more patients – the sickest patients in the city,\" said Joseph Campanelli, Chairman of the Tufts Medical Center Board of Trustees . \"We will miss Mike's daily leadership at Tufts MC but agree he is the right person to advance all of the Wellforce members, navigating change in a challenging healthcare climate.\"\nA nationally respected physician executive and healthcare thought leader, Dr. Wagner began his career as a primary care physician at Tufts MC in 1990 and later served as Chief of General Medicine. Dr. Wagner left Tufts MC to serve as CEO of EmCare Inpatient Services, a hospital inpatient physician management company, where he traveled the country helping hospitals, including some community hospitals in Massachusetts, improve patient care, patient satisfaction and efficiency. Wagner returned to Tufts Medical Center in 2008 as Chief of Internal Medicine and Adult Primary Care and was elevated to the position of Chief Medical Officer in 2011 and President and CEO of the Tufts Medical Center Physicians Organization in 2012.\nAs Dr. Wagner prepares to transition from the CEO role, the Medical Center is in strong position. Between June 2016 and June 2017, the organization's bottom line increased by $16.8 million and today the enterprise totals nearly $1 billion in revenue annually. During his tenure, Dr. Wagner strategically strengthened service lines including surgery, primary care, pediatrics and cardiology. For the second straight year, in 2017 Tufts MC performed the most heart transplants in New England and has received the highest score for its outcomes from the Scientific Registry of Transplant Recipients. The Medical Center also has a deep commitment to bringing advanced care and specialists out of Boston and into the communities of its Wellforce partners. In January of 2018, Tufts MC's nurses voted to ratify a new three-year, nine-month contract. Dr. Wagner's relentless focus on patient experience has resulted in strong inpatient satisfaction scores, with Tufts MC repeatedly receiving high marks from the Centers for Medicare and Medicaid.\nView original content with multimedia: http://www.prnewswire.com/news-releases/wellforce-hires-tufts-medical-center-ceo-to-lead-clinical-innovation-transform-healthcare-300584723.html\nSOURCE Wellforce", "external_links": ["http://www.prnewswire.com/news-releases/wellforce-hires-tufts-medical-center-ceo-to-lead-clinical-innovation-transform-healthcare-300584723.html"], "published": "2018-01-18T20:30:00.000+02:00", "crawled": "2018-01-18T21:48:48.005+02:00", "highlightTitle": ""}