{"organizations": [], "uuid": "c66c3d862f714204d6b51e705f719c21fb8ec056", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104961365-9I9B0254.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/20910258/device/rss/rss.html", "section_title": "Economy", "url": "https://www.cnbc.com/2018/01/24/bank-of-america-ceo-brian-moynihan-the-skill-you-need-to-succeed-in-the-future.html", "country": "US", "domain_rank": 767, "title": "Bank of America CEO: People with this skill will be successful in the future job market", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T18:58:00.000+02:00", "replies_count": 0, "uuid": "c66c3d862f714204d6b51e705f719c21fb8ec056"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/bank-of-america-ceo-brian-moynihan-the-skill-you-need-to-succeed-in-the-future.html", "ord_in_thread": 0, "title": "Bank of America CEO: People with this skill will be successful in the future job market", "locations": [], "entities": {"persons": [{"name": "brian moynihan", "sentiment": "positive"}, {"name": "adam galica", "sentiment": "positive"}, {"name": "moynihan", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "positive"}, {"name": "bank of america", "sentiment": "positive"}, {"name": "wef", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In a world and market where the only constant is change, there's one skill that you will need to get an edge in the coming decades, says Bank of America CEO Brian Moynihan .\n\"The ability of people to be successful in the future job market is going to come down to the ability to absorb tremendous amounts of information,\" Moynihan tells CNBC Make It at the World Economic Forum in Davos, Switzerland, this week.\nYou'll not only need to take in massive amounts of data, you'll need \"to be able to process it and think through it and intellectually assess it\" to determine what's important, he says.\nOf course, finding the signal in the noise is only half the battle. To be truly successful, you'll have to then incite your teammates and customers to take action on it, says Moynihan.\n\"It's that last piece that a lot people often miss,\" he adds. \"The smartest answer doesn't do you any good unless you get your teammates to actually do it or you get your customers to respond to it.\"\nThis is a lesson Moynihan takes to heart as a leader of more than 200,000 employees and a company with a market cap of over $300 billion.\n\"I think the habit of being a voracious reader and absorber of information is what I attribute to helping me every day,\" he says. \"And learning from smart people, who are much smarter and more capable than I am.\"\nOn his reading list are lots of newspapers, some historical books to learn mistakes of the past, and once in awhile novels for fun.\n\"I just read one called ' Exit West ' [by Mohsin Hamid] on migration,\" he says. \"It gives you a sense of what it would feel like to do that. And those are important to read.\"\nBusiness books can be a good resource, though \"by the time things get written in business books, sometimes they're a little bit stale,\" he notes. The important thing is just to take in as much knowledge as you can and work to decipher it and apply it.\n\"Always keep learning, keep reading, keep researching, keep trying things out. Never stop learning,\" Moynihan says. \"When you go through college you learn so much. After that you'll start to deteriorate if you don't keep current. So read and absorb information.\"\nshow chapters Bank of America CEO: We project economy to grow at 2.7 percent this year 7:00 AM ET Tue, 23 Jan 2018 | 08:56", "external_links": [], "published": "2018-01-24T18:58:00.000+02:00", "crawled": "2018-01-24T19:08:07.003+02:00", "highlightTitle": ""}