{"organizations": [], "uuid": "545b1634990af377a621832cfc33792a569578ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-autonation-to-benefit-from-tax-reform-bill.html", "country": "US", "domain_rank": 767, "title": "AutoNation to Benefit from Tax Reform Bill", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:15:00.000+02:00", "replies_count": 0, "uuid": "545b1634990af377a621832cfc33792a569578ed"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-autonation-to-benefit-from-tax-reform-bill.html", "ord_in_thread": 0, "title": "AutoNation to Benefit from Tax Reform Bill", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "fort lauderdale", "sentiment": "none"}], "organizations": [{"name": "autonation", "sentiment": "negative"}, {"name": "autonation, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT LAUDERDALE, Fla., Jan. 16, 2018 /PRNewswire/ -- AutoNation, Inc. (NYSE: AN), America's largest automotive retailer, today announced that it expects a benefit of approximately $41 million in the fourth quarter of 2017, or approximately $0.45 per share, due to the recent tax reform bill and the one-time impact on its deferred tax liability. AutoNation also anticipates a benefit of approximately $75 million to $100 million, or approximately $0.80 to $1.10 per share, for the full year 2018, resulting from the decrease in the corporate federal tax rate.\nAutoNation will use the savings from tax reform to invest in its future and its employees, through enhancing its benefits programs, including launching an innovative cancer program to assist employees and family members who were recently diagnosed with cancer, and investing in progressive training programs that will allow its associates to better serve its customers and drive their career advancement. The Company also plans to accelerate its brand extension strategy as well as further expand its Drive Pink initiatives.\nAutoNation's Chairman, CEO and President, Mike Jackson, said, \"We are excited about the pro-growth environment for business in the U.S., which includes the recently signed tax reform bill. As a U.S.-based company, our employees, customers and shareholders will benefit greatly from a reduction in our corporate tax rates.\"\nAbout AutoNation, Inc.\nAutoNation, America's largest automotive retailer, through its bold leadership, innovation and its comprehensive brand extensions, is transforming the automotive industry. As of December 31, 2017, AutoNation owned and operated 360 new vehicle franchises from coast to coast. AutoNation has sold over 11 million vehicles, the first automotive retailer to reach this milestone. AutoNation's success is driven by a commitment to delivering a peerless experience through customer-focused sales and service processes. Through its Drive Pink initiative, AutoNation is committed to drive out cancer, create awareness and support critical research. AutoNation continues to be a proud supporter of the Breast Cancer Research Foundation and other cancer-related charities.\nPlease visit investors.autonation.com , www.autonation.com , www.autonationdrive.com , www.twitter.com/autonation , www.twitter.com/CEOMikeJackson , www.facebook.com/autonation , and www.facebook.com/CEOMikeJackson , where AutoNation discloses additional information about the Company, its business, and its results of operations.\nFINANCIAL ESTIMATES\nThe financial estimates presented in this release are preliminary and may change. These estimates include calculations or figures that have been prepared internally by management and have not been reviewed or audited by our independent registered public accounting firm. There can be no assurance that AutoNation's actual results will not differ from the estimates presented herein and such changes could be material. These estimates should not be viewed as a substitute for full financial statements prepared in accordance with GAAP and are not necessarily indicative of the results to be achieved for any future periods. Per share estimates are based on internal estimates for the weighted average number of shares outstanding, on a diluted basis, as of December 31, 2017.\nFORWARD-LOOKING STATEMENTS\nThis news release contains within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements other than statements of historical fact are, or may be deemed to be, . Words such as \"anticipates,\" \"expects,\" \"intends,\" \"goals,\" \"plans,\" \"believes,\" \"continues,\" \"may,\" \"will,\" \"could,\" and variations of such words and similar expressions are intended to identify such . Statements regarding the impact of tax reform in the United States and our expectations for future results, as well as other statements that describe our objectives, goals, or plans, are . Our reflect our current expectations concerning future results and events, and they involve known and unknown risks, uncertainties, and other factors that are difficult to predict and may cause our actual results, performance or achievements to be materially different from any future results, performance, and achievements expressed or implied by these statements. These risks, uncertainties and other factors include, among others: economic conditions, including conditions in the credit markets and changes in interest rates; new and used vehicle margins; the success and financial viability and the incentive and marketing programs of vehicle manufacturers and distributors with which we hold franchises; our ability to successfully implement, and customer adoption of, our brand extension strategies; our ability to identify, acquire, and build out suitable locations in a timely manner; our ability to maintain and enhance our retail brands and reputation and to attract consumers to our own digital channels; new or increased taxes or tariffs; changes in rules affecting deferred tax assets or liabilities; the preliminary nature of the Company's forecasts; our ability to integrate successfully acquired and awarded franchises and to attain planned sales volumes within our expected time frames; restrictions imposed by vehicle manufacturers and our ability to obtain manufacturer approval for acquisitions; natural disasters and other adverse weather events; the resolution of legal and administrative proceedings; regulatory factors affecting our business, including fuel economy requirements; the announcement of safety recalls; factors affecting our goodwill and other intangible asset impairment testing; and other factors described in our news releases and filings made under the securities laws, including, among others, our Annual Reports on Form 10-K, our Quarterly Reports on Form 10-Q and our Current Reports on Form 8-K. contained in this news release speak only as of the date of this news release, and we undertake no obligation to update these to reflect subsequent events or circumstances.\nView original content with multimedia: http://www.prnewswire.com/news-releases/autonation-to-benefit-from-tax-reform-bill-300582491.html\nSOURCE AutoNation, Inc.", "external_links": ["http://www.twitter.com/autonation", "http://investors.autonation.com/", "http://www.autonationdrive.com/", "http://www.autonation.com/", "http://www.prnewswire.com/news-releases/autonation-to-benefit-from-tax-reform-bill-300582491.html", "http://www.facebook.com/autonation", "http://www.facebook.com/CEOMikeJackson", "http://www.twitter.com/CEOMikeJackson"], "published": "2018-01-16T14:15:00.000+02:00", "crawled": "2018-01-16T17:06:39.029+02:00", "highlightTitle": ""}