{"organizations": [], "uuid": "a0693af52adb9f64d0f9697f7fca54eb49b24c79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221498183&w=1200&r=LYNXMPEE0B1AH", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-germany-politics-merkel/coalition-deal-leaves-merkels-fate-in-hands-of-social-democrats-idUSKBN1F1242", "country": "US", "domain_rank": 408, "title": "Coalition deal leaves Merkel's fate in hands of Social Democrats", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:54:00.000+02:00", "replies_count": 0, "uuid": "a0693af52adb9f64d0f9697f7fca54eb49b24c79"}, "author": "", "url": "https://www.reuters.com/article/us-germany-politics-merkel/coalition-deal-leaves-merkels-fate-in-hands-of-social-democrats-idUSKBN1F1242", "ord_in_thread": 0, "title": "Coalition deal leaves Merkel's fate in hands of Social Democrats", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "paul carrel", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "coalition", "sentiment": "negative"}, {"name": "christian democrats", "sentiment": "none"}, {"name": "christian social union", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 55 PM / Updated 2 minutes ago Coalition deal leaves Merkel's fate in hands of Social Democrats Paul Carrel 6 Min Read \nBERLIN (Reuters) - Angela Merkel has survived as German chancellor but the coalition deal she clinched on Friday puts her fate in the hands of her Social Democrat (SPD) partners and risks eroding support from her close allies before the end of her fourth term. \nEurope’s pre-eminent leader for more than 12 years, Merkel’s star is waning as she pays for her 2015 decision to leave German borders open to over a million refugees, a move that cost her Christian Democrats votes and fueled the rise of the far-right. \nAfter the collapse of talks in November to form a three-way coalition with the liberal Free Democrats and Greens, Merkel and her conservative Bavarian Christian Social Union (CSU) allies were forced to turn again to the left-leaning SPD. \nMerkel’s immediate destiny now lies in the hands of rank-and-file Social Democrats whose party leaders will ask them on Jan. 21 to back Friday’s deal, a repeat of the grand coalition that governed from 2013 to 2017. \nThe chancellor, who still commands wide respect abroad, needed the talks to succeed to avoid further erosion of her authority, after losing ground in September elections, and the weakening of German influence, not least in the European Union. \nAn Infratest Dimap poll for broadcaster ARD published last week showed Merkel’s personal approval had dropped 2 percentage points from a month earlier to 52 percent. \nTo win over the SPD, Merkel agreed to 5.95 billion euros ($7.2 billion) of investment in education, research and digitalization by 2021, expanded child care rights, and a pledge to strengthen Europe’s cohesion with increased German contributions to the EU budget. \nThe investment is a small proportion of the extra 45 billion euros the government will have at its disposal for the next four years and for many in the SPD, the deal did not go far enough on cherished social justice issues. \nThe leader of the SPD’s more radical Berlin branch, Michael Mueller, said commitments on affordable housing were inadequate. \n“Living cannot be allowed to be a luxury,” he said. \nFriday’s 28-page coalition blueprint also failed to convince Marcel Fratzscher, head of the DIW economic research institute and an advocate of stronger investment in Germany, who said “a clear vision and courageous reforms are lacking”. EUROPEAN LEGACY \nEven if SPD delegates do back the coalition agreement, negotiations on forming a government could still fail. \nDescribing the deal clinched after a 25-hour meeting as a “give and take” agreement, Merkel said much hard work remained before a full coalition could be formed. Acting German Chancellor Angela Merkel and Social Democratic Party (SPD) leader Martin Schulz attend a news conference after exploratory talks about forming a new coalition government at the SPD headquarters in Berlin, Germany, January 12, 2018. REUTERS/Hannibal Hanschke \n“The coalition negotiations probably won’t be easier than the exploratory talks,” she told a joint news conference with CSU leader Horst Seehofer and SPD leader Martin Schulz. \nMujtaba Rahman of political consultancy Eurasia assigned a 35 percent probability to coalition negotiations failing and leading to an early election or a minority government. \n“There are still multiple risks to an overall agreement,” he said. “There is still a risk, even in a scenario where Merkel is able to form a government, that she will not be able to fulfil her complete term.” \nConservatives, though, were pleased Friday’s coalition blueprint omitted a call from the SPD’s Schulz for a “United States of Europe” by 2025. \n“It is welcome that the goal of a United States of Europe, which sounds great and which perhaps sometime in the future can be a long-term objective, is not included in this coalition agreement,” said Detlef Seif, the deputy EU spokesman for Merkel’s conservative parliamentary bloc. \nA commitment to “sustainably strengthen and reform the euro zone” in close partnership with France does give Merkel scope to secure her legacy as a guardian of the European project. \nHowever, beyond boosting Germany’s EU budget contribution and transforming the European Stability Mechanism that can bailout member states into a European Monetary Fund, the blueprint is short of specifics on Europe. \nFiscally conservative members of Merkel’s Christian Democrats are wary of France pushing Berlin into European reforms at increased cost to the German taxpayer. BEYOND MERKEL \nCarsten Nickel, deputy research director at advisory firm Teneo Intelligence, said of Merkel’s centrist strategy: “The real challenge has always been to sell this logic internally.” \nThat Merkel has been able to survive as chancellor is partly due to the absence of a natural successor. \nThough a challenger has yet to come forward, impatience is growing in Christian Democrat ranks about Merkel’s tendency to manage crises as they arise rather than presenting a vision the party can rally behind and sell to voters. \nHer message during campaigning for September’s election was simply “don’t experiment” with a shift to the political left - a narrative that failed to resonate with voters, who handed her conservatives their worst result since 1949. \n“The conversation has now moved on,” said Eurasia’s Rahman. “There is a lot of active consideration being given to the post-Merkel era.” \n($1 = 0.8247 euros)", "external_links": [], "published": "2018-01-12T18:54:00.000+02:00", "crawled": "2018-01-12T19:10:14.001+02:00", "highlightTitle": ""}