{"organizations": [], "uuid": "ffef03b869a3fcce4c8b1c5c4df8b0fbf075c42e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/16/104774807-Huawei_Mate_10_shadowy.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/09/huawei-att-deal-falls-through-will-launch-mate-10-pro-in-the-us-at-ces-2018.html", "country": "US", "domain_rank": 767, "title": "Huawei and AT&T deal falls through, Mate 10 Pro will still launch in US", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:00:00.000+02:00", "replies_count": 0, "uuid": "ffef03b869a3fcce4c8b1c5c4df8b0fbf075c42e"}, "author": "Arjun Kharpal", "url": "https://www.cnbc.com/2018/01/09/huawei-att-deal-falls-through-will-launch-mate-10-pro-in-the-us-at-ces-2018.html", "ord_in_thread": 0, "title": "Huawei and AT&T deal falls through, Mate 10 Pro will still launch in US", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "huawei", "sentiment": "negative"}, {"name": "at&t", "sentiment": "negative"}, {"name": "t&t", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Huawei confirmed Tuesday that it will not sell its flagship Mate 10 Pro smartphone in the U.S. via AT&T , but told CNBC that it would still release \"new products\" in America.\nIn a statement to Reuters on Tuesday, Huawei said that the U.S. market presents \"unique challenges\" and that the Mate 10 Pro will not be sold directly by U.S. carriers.\nHuawei told CNBC in a separate statement that it will launch new products for the U.S. market on Tuesday.\n\"On Tuesday, Huawei will introduce new products to the U.S. market, including availability. We look forward to sharing more information with you then,\" a spokesperson told CNBC by email.\nThe Consumer Electronics Show (CES) is currently taking place in Las Vegas. Huawei is present and the electronic giant's official Twitter account tweeted that it is holding a press conference on Tuesday at 5 p.m. ET. It has the hashtag Mate 10 Pro, suggesting that Huawei will be unveiling its device for the U.S. market, just not via individual mobile carriers.\nInstead, Huawei may have to sell the Mate 10 Pro via online channels that could restrict the uptake of the device.\nTWEET \nThe failure of the deal with AT&T could be a big blow for the world's third-largest smartphone maker by market share. It has been pushing heavily to expand out of China and the U.S. is seen as a key market . Carriers can be crucial in helping smartphone makers promote their device and offer consumers deals that subsidize the handset.\n\"We have been harmed again,\" Richard Yu, CEO of Huawei's consumer business, told the South China Morning Post via text message.\nHuawei launched the Mate 10 Pro , its answer to the high-end offerings from Apple and Samsung, in October last year. It has a six-inch display and Huawei's own artificial intelligence (AI) chip called the Kirin 970, the first of the company's handsets to contain it. \nshow chapters Huawei could overtake Apple in smartphone business by 2018: Pro      4:20 AM ET Fri, 13 Oct 2017 | 01:31 It was widely expected that Huawei would sell the device through AT&T. But the Wall Street Journal reported Monday that the talks had fallen through .\nReuters reported Tuesday that the deal had unraveled at the 11th hour, saying that security concerns had arisen, citing a person familiar with the matter. Another news site, The Information, reported that AT&T was urged to drop the deal following a letter sent by the U.S. Senate and House Intelligence committees to the Federal Communications Commission raising concerns about Huawei's plan to launch a product through a U.S. carrier.\nA Huawei spokesperson declined to comment on these claims.\nHuawei has previously released phones in the U.S. but these have been sold online rather than through carriers.\nU.S. government relations with Chinese firms have been in focus recently, particularly after Alibaba affiliate Ant Financial was blocked from buying MoneyGram .\nHuawei has also had a run in with the U.S. government. Citing a risk to national security, Washington in 2012 claimed that Huawei and its competitor ZTE could build back doors in their network equipment to leak sensitive information from America to China, a claim both companies denied.", "external_links": ["https://twitter.com/HuaweiMobile/status/948968406845480960", "http://www.scmp.com/tech/enterprises/article/2127418/huawei-ceo-says-company-has-been-harmed-again-after-att-pulls-out"], "published": "2018-01-09T15:00:00.000+02:00", "crawled": "2018-01-09T15:18:58.029+02:00", "highlightTitle": ""}