{"organizations": [], "uuid": "230e599763c6ee4bc38408e43e6afae91bda4782", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/verbund-ceo/update-1-verbund-ceo-has-no-plan-to-sell-power-grid-despite-interest-idUSL8N1PK2UP", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Verbund CEO has no plan to sell power grid despite interest", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T19:20:00.000+02:00", "replies_count": 0, "uuid": "230e599763c6ee4bc38408e43e6afae91bda4782"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/verbund-ceo/update-1-verbund-ceo-has-no-plan-to-sell-power-grid-despite-interest-idUSL8N1PK2UP", "ord_in_thread": 0, "title": "UPDATE 1-Verbund CEO has no plan to sell power grid despite interest", "locations": [], "entities": {"persons": [{"name": "wolfgang anzengruber", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "austrian power grid", "sentiment": "negative"}, {"name": "snam", "sentiment": "none"}, {"name": "allianz", "sentiment": "none"}, {"name": "verbund", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "austrian power grid ag", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Austrian Power Grid operates 6,971-km network\n* Remarks confirm strong interest in infrastructure\n* Also scanning German market for opportunities (Adds comments from CEO, context)\nBERLIN, Jan 25 (Reuters) - Verbund, Austria’s largest energy group, has no plans to sell its high-voltage power grid, although it is seeing plenty of buying interest in the regulated infrastructure asset, its chief executive said.\nPower and gas networks are keenly sought after by pension funds and infrastructure investors, guaranteeing mid-single-digit investment returns in times of ultra-low interest rates.\n“(A sale) only makes sense if I can achieve higher margins with the proceeds in a different market,” Wolfgang Anzengruber told Reuters, adding that Verbund could in theory sell up to 49 percent of Austrian Power Grid AG.\nThe grid operator says it runs a 6,971-kilometre network and generated 2016 sales of 620 million euros ($769.54 million).\nOverseas companies have already bought into Austria’s networks. Germany’s Allianz and Italian gas grid company Snam purchased 49 percent of Gas Connect Austria from OMV for 601 million euros in 2016.\nAnd other companies are expecting such businesses to perform well in future. Germany’s largest energy group E.ON said on Wednesday that it expects networks, the core of its business, to offset a loss of profit from nuclear.\nVerbund, whose shares are trading at their highest levels since September 2011, last week raised its 2017 core profit guidance thanks to an improvement in water supply and better results in its power grid unit.\nAnzengruber said water supply, which determines its hydroelectric power output, had also been good in the first few weeks of 2018, but added it was still too early to make predictions for the year as a whole. The group will publish its full-year results on March 14.\nThe CEO also highlighted the growing relevance of flexibility products needed in the European power grid system mainly because Austria’s neighbour Germany failed to build up networks in time to keep pace with the expansion of renewable energy.\nThey include measures to offset undersupply or excess load on the network as power cannot be stored in large volumes or over a long time. This is a challenge for a new era of volatile green power from variable wind and sunshine supplies.\nAnzengruber said Verbund was scanning the market for “reasonable” opportunities in hydro and onshore wind in Germany, but was under no pressure to buy. ($1 = 0.8057 euros) (Reporting by Christoph Steitz, Vera Eckert and Tom Kaeckenhoff; Editing by Maria Sheahan and Alexander Smith)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T19:20:00.000+02:00", "crawled": "2018-01-26T21:39:06.047+02:00", "highlightTitle": ""}