{"organizations": [], "uuid": "2da0acb09a9d1228d6acb4c6c6ba74ebb7cc022e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-hanmi-reports-strong-fourth-quarter-and-full-year-results-driven-by-loan-growth-and-expanding-net-interest-income.html", "country": "US", "domain_rank": 767, "title": "Hanmi Reports Strong Fourth Quarter and Full Year Results Driven by Loan Growth and Expanding Net Interest Income", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:01:00.000+02:00", "replies_count": 0, "uuid": "2da0acb09a9d1228d6acb4c6c6ba74ebb7cc022e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-hanmi-reports-strong-fourth-quarter-and-full-year-results-driven-by-loan-growth-and-expanding-net-interest-income.html", "ord_in_thread": 0, "title": "Hanmi Reports Strong Fourth Quarter and Full Year Results Driven by Loan Growth and Expanding Net Interest Income", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "hanmi", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2017 Fourth Quarter and Full Year Highlights:\nFourth quarter net income of $11.5 million, or $0.36 per diluted share Income tax expense for the quarter and year reflects a charge of $3.9 million, or $0.12 per diluted share, from the re-measurement of deferred tax assets due to the change in the Federal corporate tax rate signed into law on December 22, 2017. Fourth quarter net interest income increased to $46.3 million, up 3.2% from the prior quarter; Net interest income for the year was $176.8 million, up 10.4%. Fourth quarter net interest margin, on a taxable equivalent basis, was 3.79%, unchanged from prior quarter and compares to 3.96% from a year ago Loans and leases receivable of $4.3 billion, up 10.4% in the fourth quarter on an annualized basis driven by new loan and lease production of $262.4 million; Loans and leases receivable up 12.0% year-over-year. Deposits of $4.3 billion, up 4.8% in the fourth quarter on an annualized basis; Total deposits were up 14.1% year-over-year. Efficiency ratio for the fourth quarter and 2017 full year was 54.2% and 54.3%, respectively.\nLOS ANGELES, Jan. 23, 2018 (GLOBE NEWSWIRE) -- Hanmi Financial Corporation (NASDAQ:HAFC) (or “Hanmi”), the parent company of Hanmi Bank (the “Bank”) today reported net income for the 2017 fourth quarter of $11.5 million or $0.36 per diluted share, compared with $14.9 million, or $0.46 per diluted share for the 2017 third quarter and $14.4 million, or $0.45 per diluted share for the 2016 fourth quarter.\nFor the 2017 year, net income was $54.7 million, or $1.69 per diluted share, compared with $56.5 million, or $1.75 per diluted share, for 2016.\nOn December 22, 2017, the Tax Cuts and Jobs Act (the “Tax Reform Act”) was enacted into law. Beginning in 2018, the Tax Reform Act reduces the Federal tax rate for corporations from 35% to 21% and changes or limits certain tax deductions. As a result of the lower corporate tax rate, during the fourth quarter of 2017, Hanmi recorded a one-time revaluation adjustment of $3.9 million to reduce its deferred tax assets, which increased income tax expense and reduced fourth quarter and full year earnings by approximately $0.12 per diluted share.\nMr. C. G. Kum, President and Chief Executive Officer, said, “Hanmi’s excellent fourth quarter results concluded another year of safe and profitable growth for the Bank. I am pleased to report that the strong growth of the Loan and lease portfolio in 2017, continuing our trend of double-digit growth, was the primary driver of our top line revenue expansion. Our ability to sustain this growth trajectory in 2018 and beyond has strengthened with the fourth quarter opening of a de novo branch in the vibrant New York/New Jersey market. Importantly, the mix of our earning assets continue to improve as we ended 2017 with Commercial Real Estate loans constituting 71.2% of the total loan portfolio as compared to 76.3% at year-end 2016.”\nMr. Kum continued, “Cost effective deposit gathering was challenging in the Asian American market in 2017. We, however, were able to increase deposits 14% and, at the same time, maintain a stable net interest margin in 2017. Finally, even after accounting for the additional income tax provision stemming from the revaluation of our deferred tax assets, Hanmi’s 2017 net income represented an attractive full year return on average assets of 1.10%.”\nQuarterly Highlights (in thousands, except per share data) As of or For the Three Months Ended Amount Change Dec 31, Sep 30, Jun 30, Mar 31, Dec 31, Q4-17 Q4-17 2017\n2017\n2017\n2017\n2016\nvs. Q3-17 vs. Q4-16 Net income $ 11,500 $ 14,923 $ 14,457 $ 13,783 $ 14,416 $ (3,423 ) $ (2,916 ) Net income per diluted common share $ 0.36 $ 0.46 $ 0.45 $ 0.43 $ 0.45 $ (0.10 ) $ (0.09 ) Assets $ 5,210,485 $ 5,111,396 $ 4,973,346 $ 4,811,821 $ 4,701,346 $ 99,089 $ 509,139 Loans and leases receivable $ 4,304,458 $ 4,195,355 $ 4,073,062 $ 3,943,951 $ 3,844,769 $ 109,103 $ 459,689 Deposits $ 4,348,654 $ 4,299,010 $ 4,259,173 $ 4,083,165 $ 3,809,737 $ 49,644 $ 538,917 Return on average assets 0.88 % 1.18 % 1.19 % 1.18 % 1.26 % -0.29 -0.38 Return on average stockholders' equity 8.12 % 10.73 % 10.65 % 10.46 % 10.84 % -2.61 -2.72 Net interest margin (1) 3.79 % 3.79 % 3.81 % 3.89 % 3.96 % 0.00 -0.17 Net interest margin excluding acquisition accounting (2) 3.76 % 3.76 % 3.76 % 3.84 % 3.86 % 0.00 -0.10 Efficiency ratio (3) 54.16 % 53.33 % 54.74 % 54.95 % 51.77 % 0.83 2.38 Efficiency ratio excluding merger and integration costs 54.16 % 53.33 % 54.75 % 55.01 % 51.15 % 0.83 3.01 Tangible common equity to tangible assets (2) 10.58 % 10.72 % 10.83 % 10.98 % 11.05 % -0.14 -0.47 Tangible common equity per common share (2) $ 16.96 $ 16.86 $ 16.59 $ 16.26 $ 16.03 $ 0.09 $ 0.93 (1) Amounts calculated on a fully taxable equivalent basis using the statutory federal tax rate of 35%. (2) Refer to \"Non-GAAP Financial Measures\" for further details. (3) Noninterest expense divided by net interest income plus noninterest income Results of Operations\nFourth quarter 2017 net interest income increased 3.2% to $46.3 million from $44.9 million in the third quarter reflecting the solid expansion of loans and leases receivables. Average loans and leases grew 3.3% quarter-over-quarter. On a year-over-year basis, fourth quarter net interest income was up 10.2% from $42.1 million last year.\nNet interest income of $176.8 million for the full year in 2017 increased 10.4% compared with $160.2 million for the full year in 2016. The year-over-year improvement in net interest income reflects the 18.0% growth in average loans and leases.\nFor the Three Months Ended (in thousands) Percentage Change Dec 31, Sep 30, Jun 30, Mar 31, Dec 31, Q4-17 Q4-17 Net Interest Income 2017 2017 2017 2017 2016 vs. Q3-17 vs. Q4-16 Interest and fees on loans and leases (1) $ 52,176 $ 50,265 $ 47,971 $ 45,378 $ 43,780 3.8 % 19.2 % Interest on securities 3,194 3,188 2,949 2,520 2,550 0.2 % 25.3 % Dividends on FHLB stock 289 286 283 374 927 1.0 % -68.8 % Interest on deposits in other banks 125 123 123 77 55 1.6 % 127.3 % Total interest and dividend income 55,784 53,862 51,326 48,349 47,312 3.6 % 17.9 % Interest on deposits 7,402 7,071 6,463 5,154 4,799 4.7 % 54.2 % Interest on borrowings 363 198 49 468 207 83.3 % 75.4 % Interest on subordinated debentures 1,676 1,667 1,636 373 241 0.5 % 595.4 % Total interest expense 9,441 8,936 8,148 5,995 5,247 5.7 % 79.9 % Net interest income $ 46,343 $ 44,926 $ 43,178 $ 42,354 $ 42,065 3.2 % 10.2 % (1) Includes loans held for sale. Net interest margin (on a taxable equivalent basis) for the fourth quarter of 2017 was 3.79%, unchanged from the prior quarter as loan yields increased by 3 basis points and cost of deposits increased by 2 basis points. Compared to the fourth quarter a year ago, net interest margin declined by 17 basis points, principally reflecting the subordinated debt issuance in the first quarter of 2017.\nFor the full year of 2017, net interest margin was 3.82% compared with 3.95% a year ago. Excluding acquisition accounting, the net interest margin was little-changed year-over-year at 3.78% and 3.79% respectively.\nFor the Three Months Ended (in thousands) Percentage Change Dec 31, Sep 30, Jun 30, Mar 31, Dec 31, Q4-17 Q4-17 Average Earning Assets and Interest-bearing Liabilities 2017\n2017\n2017\n2017\n2016\nvs. Q3-17 vs. Q4-16 Loans and lease receivables (1) $ 4,227,259 $ 4,092,131 $ 3,951,934 $ 3,881,686 $ 3,690,955 3.3 % 14.5 % Securities 611,181 611,538 585,384 526,549 530,241 -0.1 % 15.3 % FHLB stock 16,385 16,385 16,385 16,385 16,385 0.0 % 0.0 % Interest-bearing deposits in other banks 36,386 38,981 47,402 38,600 40,548 -6.7 % -10.3 % Average interest-earning assets $ 4,891,211 $ 4,759,035 $ 4,601,105 $ 4,463,220 $ 4,278,129 2.8 % 14.3 % Demand: interest-bearing $ 90,646 $ 90,720 $ 93,873 $ 97,602 $ 95,399 -0.1 % -5.0 % Money market and savings 1,513,408 1,526,951 1,532,733 1,406,903 1,305,565 -0.9 % 15.9 % Time deposits 1,408,227 1,384,724 1,320,005 1,173,184 1,165,828 1.7 % 20.8 % Average interest-bearing deposits 3,012,281 3,002,395 2,946,611 2,677,689 2,566,792 0.3 % 17.4 % Borrowings 119,946 67,935 20,000 270,500 174,674 76.6 % -31.3 % Subordinated debentures 117,198 117,065 116,850 30,950 18,919 0.1 % 519.5 % Average interest-bearing liabilities $ 3,249,425 $ 3,187,395 $ 3,083,461 $ 2,979,139 $ 2,760,385 1.9 % 17.7 % For the Three Months Ended\nAmount Change Dec 31, Sep 30, Jun 31, Mar 31, Dec 31, Q4-17 Q4-17 Average Yields and Rates 2017\n2017\n2017\n2016\n2016\nvs. Q3-17 vs. Q4-16 Loans and lease receivables (1) 4.90 % 4.87 % 4.87 % 4.74 % 4.72 % 0.03 0.18 Securities (2) 2.37 % 2.41 % 2.35 % 2.30 % 2.31 % -0.04 0.06 FHLB stock 7.00 % 6.93 % 6.93 % 9.26 % 22.63 % 0.07 -15.63 Interest-bearing deposits in other banks 1.36 % 1.25 % 1.04 % 0.81 % 0.54 % 0.11 0.82 Interest-earning assets 4.56 % 4.53 % 4.52 % 4.44 % 4.45 % 0.03 0.11 Interest-bearing deposits 0.97 % 0.93 % 0.88 % 0.78 % 0.74 % 0.04 0.23 Borrowings 1.20 % 1.16 % 0.98 % 0.70 % 0.47 % 0.04 0.73 Subordinated debentures 5.70 % 5.68 % 5.59 % 4.82 % 5.07 % 0.02 0.63 Interest-bearing liabilities 1.15 % 1.11 % 1.06 % 0.82 % 0.76 % 0.04 0.39 Net interest margin (taxable equivalent basis) 3.79 % 3.79 % 3.81 % 3.89 % 3.96 % 0.00 -0.17 Cost of deposits 0.68 % 0.66 % 0.62 % 0.54 % 0.50 % 0.02 0.18 (1) Includes loans held for sale. (2) Amounts calculated on a fully taxable equivalent basis using the statutory federal tax rate of 35%. For the fourth quarter of 2017, Hanmi recorded a provision for loan losses of $0.2 million compared with $0.3 million for the preceding quarter.\nFor the full year of 2017, Hanmi recorded a provision for loan losses of $0.8 million, compared with a negative loan loss provision of $4.3 million for the full year of 2016.\nFourth quarter noninterest income decreased 12.9% to $7.7 million from $8.8 million for the third quarter of 2017 primarily due to a $0.9 million decrease in disposition gains on PCI loans and a $0.5 million decrease in gains on sales of SBA loans. Gains on sales of SBA loans were $2.1 million for the fourth quarter 2017, down from $2.5 million from the third quarter of 2017 as the volume of SBA loans sold decreased to $27.5 million from $32.5 million for the preceding quarter. Disposition gains on PCI loans were $0.1 million for the fourth quarter of 2017, compared with $1.0 million for the prior quarter. PCI loans from the 2014 acquisition were $7.7 million at the end of the fourth quarter of 2017, down 11.0% from the prior quarter.\nFor the year ended 2017, noninterest income increased $0.3 million, or 1.0%, to $33.4 million from $33.1 million for the same period last year primarily due to a $2.7 million increase in gains on sales of SBA loans and a $1.7 million increase in gains on sales of securities, partially offset by a $3.2 million reduction in disposition gains on PCI loans. Disposition gains on PCI loans were $1.8 million for the year ended 2017, compared with $5.0 million for the year ended 2016. Gains on sales of SBA loans were $8.7 million for the year ended 2017, compared with $6.0 million for the year ended 2016 as the volume of SBA loans sold increased to $112.0 million from $84.9 million for the same period last year.\nFor the Three Months Ended (in thousands) Percentage Change Dec 31, Sep 30, Jun 30, Mar 31, Dec 31, Q4-17 Q4-17 Noninterest Income 2017 2017 2017 2017 2016 vs. Q3-17 vs. Q4-16 Service charges on deposit accounts $ 2,729 $ 2,678 $ 2,461 $ 2,528 $ 2,599 1.9 % 5.0 % Trade finance and other service charges and fees 1,047 1,133 1,269 1,047 1,132 -7.6 % -7.5 % Other operating income 1,485 1,213 1,826 1,726 991 22.4 % 49.8 % Service charges, fees & other 5,261 5,024 5,556 5,301 4,722 4.7 % 11.4 % Gain on sale of SBA loans 2,056 2,546 2,668 1,464 1,787 -19.2 % 15.1 % Disposition gain on PCI loans 91 979 540 183 1,559 -90.7 % -94.2 % Net gain on sales of securities 275 267 938 269 - 3.0 % 0.0 % Total noninterest income $ 7,683 $ 8,816 $ 9,702 $ 7,217 $ 8,068 -12.9 % -4.8 % Noninterest expense for the fourth quarter increased 2.1% to $29.3 million from $28.7 million for the third quarter primarily due to a $0.3 million increase in professional fees and a $0.3 million increase in salaries and employee benefits expense. As a result of the increase in noninterest expense, as well as lower noninterest income, the efficiency ratio increased to 54.2% in the fourth quarter from 53.3% in the prior quarter.\nFor the year ended 2017, noninterest expense increased $5.9 million, or 5.4%, to $114.1 million from $108.2 million for the same period last year primarily due to increased salaries and employee benefits expense, higher data processing fees, and increased occupancy and equipment expense. As a result of the increase in noninterest expense, coupled with the improvements in revenue from the growth in earning assets, the efficiency ratio improved to 54.3% for the year ended 2017 from 56.0% for the year ended 2016.\nFor the Three Months Ended (in thousands) Percentage Change Dec 31, Sep 30, Jun 30, Mar 31, Dec 31, Q4-17 Q4-17 2017\n2017\n2017\n2017\n2016\nvs. Q3-17 vs. Q4-16 Noninterest Expense Salaries and benefits $ 17,270 $ 16,947 $ 16,623 $ 17,104 $ 16,246 1.9 % 6.3 % Occupancy and equipment 3,997 3,883 3,878 3,982 3,641 2.9 % 9.8 % Data processing 1,812 1,779 1,738 1,631 1,455 1.9 % 24.5 % Professional fees 1,552 1,210 1,554 1,148 1,311 28.3 % 18.4 % Supplies and communication 778 755 745 635 683 3.0 % 13.9 % Advertising and promotion 988 1,147 1,015 802 1,140 -13.9 % -13.3 % Other operating expenses 2,961 2,955 2,881 2,070 1,825 0.2 % 62.2 % subtotal 29,358 28,676 28,434 27,372 26,301 2.4 % 11.6 % OREO expense (income) (100 ) (16 ) 519 (101 ) (658 ) 525.0 % -84.8 % Merger and integration costs - - (9 ) (31 ) 312 0.0 % -100.0 % Total noninterest expense $ 29,258 $ 28,660 $ 28,944 $ 27,240 $ 25,955 2.1 % 12.7 % Hanmi recorded a provision for income taxes of $13.0 million for the fourth quarter of 2017, representing an effective tax rate of 53.2%, compared with $9.9 million, representing an effective tax rate of 39.9%, for the preceding quarter. For the full year ended December 31, 2017 and 2016, Hanmi recorded a provision for income taxes of $40.6 million and $32.9 million, respectively, representing effective tax rates of 42.6% and 36.8%, respectively. As noted previously, included in the provision for the quarter and year was the additional income tax expense of $3.9 million resulting from a one-time revaluation adjustment to reduce Hanmi’s deferred tax assets due to the change in the Federal corporate tax rate to 21% from 35%. The effective tax rate, before the additional income tax expense, was 37.5% and 38.6% for the 2017 fourth quarter and year, respectively.\nFinancial Position\nTotal assets were $5.21 billion at December 31, 2017, a 2.0% increase from $5.11 billion at September 30, 2017. The increase in total assets was primarily due to an increase in loans and leases receivable.\nLoans and leases receivable, before the allowance for loan and lease losses, were $4.30 billion at December 31, 2017, up 2.6% from $4.20 billion at September 30, 2017. The increase in loans and leases from the prior quarter reflects Hanmi’s continued strong loan production. Loans held for sale, representing the guaranteed portion of SBA loans, were $6.4 million at December 31, 2017 compared with $6.5 million at the end of the 2017 third quarter.\nLoans and leases receivable, before the allowance for loan and lease losses, increased 12.0% from $3.84 billion for the fourth quarter last year, primarily due to strong loan production over the last twelve months, as well as last year’s fourth quarter acquisition and commencement of the Commercial Equipment Leasing division.\nAs of (in thousands) Percentage Change Dec 31, Sep 30, Jun 30, Mar 31, Dec 31, Q4-17 Q4-17 2017 2017 2017 2017 2016 vs. Q3-17 vs. Q4-16 Loan and Lease Portfolio Commercial real estate loans $ 3,069,063 $ 3,108,931 $ 3,068,069 $ 2,991,123 $ 2,939,608 -1.3 % 4.4 % Residential real estate loans 521,852 430,627 384,044 359,152 338,767 21.2 % 54.0 % Commercial and industrial loans 399,197 364,456 346,150 316,284 300,220 9.5 % 33.0 % Lease receivable 297,286 272,271 257,525 259,591 243,294 9.2 % 22.2 % Consumer loans 17,060 19,070 17,274 17,801 22,880 -10.5 % -25.4 % Loans and leases receivable 4,304,458 4,195,355 4,073,062 3,943,951 3,844,769 2.6 % 12.0 % Loans held for sale 6,394 6,469 10,949 8,849 9,316 -1.2 % -31.4 % Total loans $ 4,310,852 $ 4,201,824 $ 4,084,011 $ 3,952,800 $ 3,854,085 2.6 % 11.9 % Acquired Loans (1) PCI loans, net of discounts $ 7,748 $ 8,704 $ 8,784 $ 8,960 $ 9,863 -11.0 % -21.4 % Non-PCI loans, net of discounts 83,456 91,013 96,600 101,062 104,733 -8.3 % -20.3 % Total acquired loans $ 91,204 $ 99,717 $ 105,384 $ 110,022 $ 114,596 -8.5 % -20.4 % (1) Includes UCB acquired only. New loan production for the 2017 fourth quarter was $262.4 million while payoffs and amortization was $222.2 million compared with $220.4 million and $145.4 million for the third quarter of 2017. Fourth quarter 2017 new loan production was comprised of $117.0 million of commercial real estate loans, $47.7 million of commercial and industrial loans, $43.5 million of SBA loans, $52.4 million of commercial leases and $1.8 million of consumer loans. Loan purchases for the 2017 fourth quarter were $105.0 million, compared with $88.2 million in the third quarter of 2017. For the fourth quarter of 2017, commercial real estate loans as a percentage of total loans and leases decreased to 71.3% compared with 76.5% for the same period last year.\nDeposits increased to $4.35 billion at the end of the 2017 fourth quarter from $4.30 billion at the end of the preceding quarter. Time deposits and noninterest-bearing demand deposits led this growth. The loans to deposits ratio at December 31, 2017 increased to 99.0% from 97.6% at September 30, 2017.\nDeposits increased 14.1% from $3.81 billion in the fourth quarter last year, primarily due to the strength of Hanmi’s retail branch network as time deposits increased 20.0% and money market and savings deposits increased 14.9% from a year ago.\nAs of (in thousands) Percentage Change Dec 31, Sep 30, Jun 30, Mar 31, Dec 31, Q4-17 Q4-17 2017 2017 2017 2017 2016 vs. Q3-17 vs. Q4-16 Deposit Portfolio Demand: noninterest-bearing $ 1,312,274 $ 1,293,538 $ 1,260,929 $ 1,241,272 $ 1,203,240 1.4 % 9.1 % Demand: interest-bearing 92,948 90,734 93,390 99,433 96,856 2.4 % -4.0 % Money market and savings 1,527,100 1,534,457 1,528,127 1,534,578 1,329,324 -0.5 % 14.9 % Time deposits of $250,000 or less 954,104 949,826 916,197 731,445 734,383 0.5 % 29.9 % Time deposits of more than $250,000 462,228 430,455 460,530 476,437 445,934 7.4 % 3.7 % Total deposits $ 4,348,654 $ 4,299,010 $ 4,259,173 $ 4,083,165 $ 3,809,737 1.2 % 14.1 % At December 31, 2017, stockholders’ equity was $562.5 million, compared with $559.2 million at September 30, 2017. Tangible common stockholders’ equity was $549.9 million, or 10.58% of tangible assets, compared with $546.6 million, or 10.72% of tangible assets at September 30, 2017. Tangible book value per share was $16.96, compared to $16.86 in the third quarter.\nHanmi continues to be well capitalized, with a preliminary Tier 1 risk-based capital ratio of 12.41% and a Total risk-based capital ratio of 15.32% at December 31, 2017, versus 12.56% and 15.58%, respectively, at September 30, 2017.\nAs of Amount Change Dec 31, Sep 30, Jun 30, Mar 31, Dec 31, Q4-17 Q4-17 2017\n2017\n2017\n2017\n2016\nvs. Q3-17 vs. Q4-16 Regulatory Capital ratios (1) Hanmi Financial Total risk-based capital 15.32 % 15.58 % 15.69 % 16.16 % 13.86 % -0.26 1.46 Tier 1 risk-based capital 12.41 % 12.56 % 12.58 % 12.93 % 13.02 % -0.15 -0.61 Common equity tier 1 capital 12.05 % 12.20 % 12.22 % 12.56 % 12.73 % -0.15 -0.68 Tier 1 leverage capital ratio 10.79 % 10.92 % 11.08 % 11.21 % 11.53 % -0.13 -0.74 Hanmi Bank Total risk-based capital 15.16 % 15.32 % 15.44 % 15.91 % 13.64 % -0.16 1.52 Tier 1 risk-based capital 14.44 % 14.55 % 14.62 % 15.07 % 12.80 % -0.11 1.64 Common equity tier 1 capital 14.44 % 14.55 % 14.62 % 15.07 % 12.80 % -0.11 1.64 Tier 1 leverage capital ratio 12.56 % 12.66 % 12.89 % 13.08 % 11.33 % -0.10 1.23 (1) Preliminary ratios for December 31, 2017 During the quarter, Hanmi declared a cash dividend on its common stock for the 2017 fourth quarter of $0.21 per common share, in line from the prior quarter. The dividend was paid on November 20, 2017, to stockholders of record as of the close of business on October 30, 2017.\nAsset Quality\nNonperforming loans, excluding PCI loans, were $15.8 million at the end of the fourth quarter of 2017, or 0.37% of loans, compared with $14.6 million at the end of the third quarter of 2017, or 0.35% of loans. Loans past due 30 to 89 days and still accruing was 0.20% of loans at the end of the fourth quarter of 2017, compared with 0.12% of loans at the end of the third quarter.\nOREO was $1.9 million at the end of the fourth quarter of 2017, unchanged from the prior quarter. Nonperforming assets were $17.8 million at the end of the fourth quarter of 2017, or 0.34% of assets, compared with 0.32% of assets at the end of the prior quarter.\nGross charge-offs for the fourth quarter of 2017 were $2.6 million compared with $2.4 million for the preceding quarter. Gross-charge-offs included a $1.3 million charge-off of a fully-reserved SBA loan originated in 2012. Recoveries of previously charged-off loans for the fourth quarter of 2017 were $973,000 compared with $871,000 for the preceding quarter. As a result, there were net charge-offs of $1.7 million for the fourth quarter of 2017, or 0.16% of average loans and leases, compared to net charge-offs of $1.5 million, or 0.15%, for the preceding quarter.\nThe allowance for loan and lease losses was $31.0 million as of December 31, 2017, generating an allowance to receivable ratio of 0.72% compared with 0.77% as of September 30, 2017.\nAs of or for the Three Months Ended (in thousands) Amount Change Dec 31, Sep 30, Jun 30, Mar 31, Dec 31, Q4-17 Q4-17 2017\n2017\n2017\n2017\n2016\nvs. Q3-17 vs. Q4-16 Asset Quality Nonperforming assets (1) : Nonaccrual loans $ 15,805 $ 14,558 $ 16,464 $ 12,774 $ 11,406 $ 1,247 $ 4,399 Loans 90 days or more past due and still accruing - - - - - - - Nonperforming loans 15,805 14,558 16,464 12,774 11,406 1,247 4,399 OREO, net 1,946 1,946 4,321 4,636 7,484 - (5,538 ) Nonperforming assets $ 17,751 $ 16,504 $ 20,785 $ 17,410 $ 18,890 $ 1,247 $ (1,139 ) Delinquent loans: Loans, 30 to 89 days past due and still accruing $ 8,498 $ 4,993 $ 9,431 $ 6,273 $ 5,718 $ 3,505 $ 2,780 Delinquent loans to loans 0.20 % 0.12 % 0.23 % 0.16 % 0.15 % 0.08 0.05 Allowance for loan and lease losses: Balance at beginning of period $ 32,492 $ 33,758 $ 33,152 $ 32,429 $ 38,972 Loan and lease loss provision (income) 220 269 422 (80 ) 151 Net loan charge-offs (recoveries) 1,669 1,535 (184 ) (803 ) 6,694 Balance at end of period $ 31,043 $ 32,492 $ 33,758 $ 33,152 $ 32,429 Asset quality ratios: Nonperforming loans to loans (1) 0.37 % 0.35 % 0.41 % 0.32 % 0.30 % Nonperforming assets to assets (1) 0.34 % 0.32 % 0.42 % 0.36 % 0.40 % Net loan charge-offs (recoveries) to average loans (3) 0.16 % 0.15 % -0.02 % -0.08 % 0.73 % Allowance for loan losses to loans 0.72 % 0.77 % 0.83 % 0.84 % 0.84 % Allowance for loan losses to nonperforming loans (1) (2) 194.39 % 217.74 % 200.67 % 252.54 % 275.80 % Allowance for off-balance sheet items: Balance at beginning of period $ 915 $ 1,135 $ 1,184 $ 1,184 $ 1,491 Provision (income) for off-balance sheet items 381 (220 ) (49 ) - (307 ) Balance at end of period $ 1,296 $ 915 $ 1,135 $ 1,184 $ 1,184 (1) Excludes PCI loans (2) Excludes allowance for loan losses allocated to PCI loans (3) Annualized Conference Call\nManagement will host a conference call today, January 23, 2018 at 2:00 p.m. PT (5:00 p.m. ET) to discuss these results. This call will also be broadcast live via the internet. Investment professionals and all current and prospective stockholders are invited to access the live call by dialing 1-877-407-9039 before 2:00 p.m. PT, using access code HANMI. To listen to the call online, either live or archived, visit the Investor Relations page of Hanmi’s website at www.hanmi.com .\nAbout Hanmi Financial Corporation\nHeadquartered in Los Angeles, California, Hanmi Financial Corporation owns Hanmi Bank, which serves multi-ethnic communities through its network of 40 full-service branches and 8 loan production offices in California, Texas, Illinois, Virginia, New Jersey, New York, Colorado, Washington and Georgia. Hanmi Bank specializes in real estate, commercial, SBA and trade finance lending to small and middle market businesses. Additional information is available at www.hanmi.com .\nForward-Looking Statements\nThis press release contains , which are included in accordance with the “safe harbor” provisions of the Private 1995. In some cases, you can identify by terminology such as “may,” “will,” “should,” “could,” “expects,” “plans,” “intends,” “anticipates,” “believes,” “estimates,” “predicts,” “potential,” or “continue,” or the negative of such terms and other comparable terminology. Although we believe that the expectations reflected in the are reasonable, we cannot guarantee future results, levels of activity, performance or achievements. All statements other than statements of historical fact are “forward–looking statements” for purposes of federal and state securities laws, including, but not limited to, statements about anticipated future operating and financial performance, financial position and liquidity, business strategies, regulatory and competitive outlook, investment and expenditure plans, capital and financing needs and availability, plans and objectives of management for future operations, developments regarding our capital plans, strategic alternatives for a possible business combination, merger or sale transaction, and other similar forecasts and statements of expectation and statements of assumption underlying any of the foregoing. These statements involve known and unknown risks, uncertainties and other factors that may cause our actual results, levels of activity, performance or achievements to differ from those expressed or implied by the forward-looking statement. These factors include the following: failure to maintain adequate levels of capital and liquidity to support our operations; the effect of potential future supervisory action against us or Hanmi Bank; general economic and business conditions internationally, nationally and in those areas in which we operate; volatility and deterioration in the credit and equity markets; changes in consumer spending, borrowing and savings habits; availability of capital from private and government sources; demographic changes; competition for loans and deposits and failure to attract or retain loans and deposits; fluctuations in interest rates and a decline in the level of our interest rate spread; risks of natural disasters related to our real estate portfolio; risks associated with Small Business Administration loans; failure to attract or retain key employees; changes in governmental regulation, including, but not limited to, any increase in FDIC insurance premiums; ability of Hanmi Bank to make distributions to Hanmi Financial Corporation, which is restricted by certain factors, including Hanmi Bank’s retained earnings, net income, prior distributions made, and certain other financial tests; ability to identify a suitable strategic partner or to consummate a strategic transaction; adequacy of our allowance for loan and lease losses; credit quality and the effect of credit quality on our provision for loan and lease losses and allowance for loan and lease losses; changes in the financial performance and/or condition of our borrowers and the ability of our borrowers to perform under the terms of their loans and other terms of credit agreements; our ability to control expenses; and changes in securities markets. In addition, we set forth certain risks in our reports filed with the U.S. Securities and Exchange Commission, including, Item 1A of our Annual Report on Form 10-K for the year ended December 31, 2016, our Quarterly Reports on Form 10-Q, and Current Reports on Form 8-K that we will file hereafter, which could cause actual results to differ from those projected. We undertake no such except as required by law.\nInvestor Contacts:\nRomolo (Ron) Santarosa\nSenior Executive Vice President & Chief Financial Officer\n213-427-5636\nRichard Pimentel\nSenior Vice President & Corporate Finance Officer\n213-427-3191\nLasse Glassen\nInvestor Relations\nAddo Investor Relations\n310-829-5400\nHanmi Financial Corporation and Subsidiaries Consolidated Balance Sheets (Unaudited) (In thousands) December 31, September 30, Percentage December 31, Percentage 2017\n2017\nChange 2016\nChange Assets Cash and due from banks $ 153,826 $ 138,139 11.4 % $ 147,235 4.5 % Securities available for sale, at fair value 578,804 598,440 -3.3 % 516,964 12.0 % Loans held for sale, at the lower of cost or fair value 6,394 6,469 -1.2 % 9,316 -31.4 % Loans and leases receivable, net of allowance for loan and lease losses 4,273,415 4,162,863 2.7 % 3,812,340 12.1 % Accrued interest receivable 12,770 12,098 5.6 % 10,987 16.2 % Customers' liability on acceptances 803 647 24.1 % 978 -17.9 % Servicing assets 10,218 10,428 -2.0 % 10,564 -3.3 % Premises and equipment, net 26,655 26,648 0.0 % 28,698 -7.1 % Goodwill and other intangible assets, net 12,544 12,628 -0.7 % 12,889 -2.7 % Federal Home Loan Bank (\"FHLB\") stock, at cost 16,385 16,385 0.0 % 16,385 0.0 % Other real estate owned (\"OREO\"), net 1,946 1,946 0.0 % 7,484 -74.0 % Income tax asset 38,279 46,210 -17.2 % 48,047 -20.3 % Bank-owned life insurance 50,554 50,268 0.6 % 49,440 2.3 % Prepaid expenses and other assets 27,892 28,227 -1.2 % 30,019 -7.1 % Total assets $ 5,210,485 $ 5,111,396 1.9 % $ 4,701,346 10.8 % Liabilities and Stockholders' Equity Liabilities: Deposits: Noninterest-bearing $ 1,312,274 $ 1,293,538 1.4 % $ 1,203,240 9.1 % Interest-bearing 3,036,380 3,005,472 1.0 % 2,606,497 16.5 % Total deposits 4,348,654 4,299,010 1.2 % 3,809,737 14.1 % Accrued interest payable 5,309 4,071 30.4 % 2,567 106.8 % Bank's liability on acceptances 803 657 22.2 % 978 -17.9 % Borrowings 150,000 110,000 36.4 % 315,000 -52.4 % Subordinated debentures 117,270 117,140 0.1 % 18,978 517.9 % Accrued expenses and other liabilities 25,972 21,271 22.1 % 23,061 12.6 % Total liabilities 4,648,008 4,552,149 2.1 % 4,170,321 11.5 % Stockholders' equity: Common stock 33 33 0.0 % 33 0.0 % Additional paid-in capital 565,627 564,787 0.1 % 562,446 0.6 % Accumulated other comprehensive income (loss) (1,869 ) 290 -744.5 % (2,394 ) -21.9 % Retained earnings 70,575 65,858 7.2 % 41,726 69.1 % Less treasury stock (71,889 ) (71,721 ) 0.2 % (70,786 ) 1.6 % Total stockholders' equity 562,477 559,247 0.6 % 531,025 5.9 % Total liabilities and stockholders' equity $ 5,210,485 $ 5,111,396 1.9 % $ 4,701,346 10.8 %\nHanmi Financial Corporation and Subsidiaries Consolidated Statements of Income (Unaudited) (In thousands, except share and per share data) Three Months Ended December 31, September 30, Percentage December 31, Percentage 2017 2017\nChange 2016\nChange Interest and dividend income: Interest and fees on loans and leases $ 52,176 $ 50,265 3.8 % $ 43,780 19.2 % Interest on securities 3,194 3,188 0.2 % 2,550 25.3 % Dividends on FHLB stock 289 286 1.0 % 927 -68.8 % Interest on deposits in other banks 125 123 1.6 % 55 127.3 % Total interest and dividend income 55,784 53,862 3.6 % 47,312 17.9 % Interest expense: Interest on deposits 7,402 7,071 4.7 % 4,799 54.2 % Interest on FHLB borrowings 363 198 83.3 % 207 75.4\n% Interest on subordinated debentures 1,676 1,667 0.5 % 241 595.4\n% Total interest expense 9,441 8,936 5.7 % 5,247 79.9 % Net interest income before provision for loan and lease losses 46,343 44,926 3.2 % 42,065 10.2 % Loan and lease loss provision 220 269 -18.2 % 151 45.7 % Net interest income after provision for loan and lease losses 46,123 44,657 3.3 % 41,914 10.0 % Noninterest income: Service charges on deposit accounts 2,729 2,678 1.9 % 2,599 5.0 % Trade finance and other service charges and fees 1,047 1,133 -7.6 % 1,132 -7.5 % Gain on sale of Small Business Administration (\"SBA\") loans 2,056 2,546 -19.2 % 1,787 15.1 % Disposition gains on Purchased Credit Impaired (\"PCI\") loans 91 979 -90.7 % 1,559 -94.2 % Net gain on sales of securities 275 267 3.0 % - - Other operating income 1,485 1,213 22.4 % 991 49.8 % Total noninterest income 7,683 8,816 -12.9 % 8,068 -4.8 % Noninterest expense: Salaries and employee benefits 17,270 16,947 1.9 % 16,246 6.3 % Occupancy and equipment 3,997 3,883 2.9 % 3,641 9.8 % Data processing 1,812 1,779 1.9 % 1,455 24.5 % Professional fees 1,552 1,210 28.3 % 1,311 18.4 % Supplies and communications 778 755 3.0 % 683 13.9 % Advertising and promotion 988 1,147 -13.9 % 1,140 -13.3 % OREO (income) (100 ) (16 ) 525.0 % (658 ) -84.8 % Other operating expenses 2,961 2,955 0.2 % 1,825 62.2 % Merger and integration costs - - - 312 -100.0 % Total noninterest expense 29,258 28,660 2.1 % 25,955 12.7 % Income before provision for income taxes 24,548 24,813 -1.1 % 24,027 2.2 % Income tax expense 13,048 9,890 31.9 % 9,611 35.8 % Net income $ 11,500 $ 14,923 -22.9 % $ 14,416 -20.2 % - Basic earnings per share: $ 0.36 $ 0.46 $ 0.45 Diluted earnings per share: $ 0.36 $ 0.46 $ 0.45 Weighted-average shares outstanding: Basic 32,109,792 32,095,286 31,956,822 Diluted 32,299,838 32,255,814 32,149,625 Common shares outstanding 32,431,630 32,413,082 32,330,747 Hanmi Financial Corporation and Subsidiaries Consolidated Statements of Income (Unaudited) (In thousands, except share and per share data) Twelve Months Ended December 31, December 31, Percentage 2017 2016 Change Interest and dividend income: Interest and fees on loans and leases $ 195,790 $ 164,642 18.9 % Interest on securities 11,850 11,154 6.2 % Dividends on FRB and FHLB stock 1,232 2,467 -50.1 % Interest on deposits in other banks 449 208 115.9 % Total interest and dividend income 209,321 178,471 17.3 % Interest expense: Interest on deposits 26,089 16,570 57.4 % Interest on FHLB borrowings 1,077 879 22.5 % Interest on subordinated debentures 5,353 825 548.8 % Total interest expense 32,519 18,274 78.0 % Net interest income before provision for loan and lease losses 176,802 160,197 10.4 % Loan and lease loss provision (income) 831 (4,339 ) -119.2 % Net interest income after provision for loan losses 175,971 164,536 6.9 % Noninterest income: Service charges on deposit accounts 10,396 11,380 -8.6 % Trade finance and other service charges and fees 4,495 4,232 6.2 % Gain on sale of Small Business Administration (\"SBA\") loans 8,734 6,034 44.7 % Net gain on sales of securities 1,748 46 3700.0 % Disposition gains on Purchased Credit Impaired (\"PCI\") loans 1,792 4,970 -63.9 % Other operating income 6,250 6,413 -2.5 % Total noninterest income 33,415 33,075 1.0 % Noninterest expense: Salaries and employee benefits 67,944 63,956 6.2 % Occupancy and equipment 15,740 14,992 5.0 % Data processing 6,960 5,674 22.7 % Professional fees 5,464 5,374 1.7 % Supplies and communications 2,912 2,949 -1.3 % Advertising and promotion 3,952 3,910 1.1 % OREO expense 302 63 379.4 % Other operating expenses 10,868 10,993 -1.1 % Merger and integration costs (income) (40 ) 312 -112.8 % Total noninterest expense 114,102 108,223 5.4 % Income before provision for income taxes 95,284 89,388 6.6 % Income tax expense 40,624 32,899 23.5 % Net income $ 54,660 $ 56,489 -3.2 % - Basic earnings per share: $ 1.70 $ 1.76 Diluted earnings per share: $ 1.69 $ 1.75 Weighted-average shares outstanding: Basic 32,071,585 31,899,582 Diluted 32,249,918 32,048,704 Common shares outstanding 32,431,630 32,330,747\nHanmi Financial Corporation and Subsidiaries Average Balance, Average Yield Earned, and Average Rate Paid (Unaudited) ﻿ (In thousands, except ratios) ﻿\nThree Months Ended December 31, 2017 September 30, 2017 December 31, 2016 Interest Average Interest Average Interest Average Average Income / Yield / Average Income / Yield / Average Income / Yield / Balance Expense Rate Balance Expense Rate Balance Expense Rate Assets Interest-earning assets: Loans and leases receivable (1) $ 4,227,259 $ 52,176 4.90 % $ 4,092,131 $ 50,265 4.87 % $ 3,690,955 $ 43,780 4.72 % Securities (2) 611,181 3,619 2.37 % 611,538 3,683 2.41 % 530,241 3,057 2.31 % FHLB stock 16,385 289 7.00 % 16,385 286 6.93 % 16,385 927 22.63 % Interest-bearing deposits in other banks 36,386 125 1.36 % 38,981 123 1.25 % 40,548 55 0.54 % Total interest-earning assets 4,891,211 56,209 4.56 % 4,759,035 54,357 4.53 % 4,278,129 47,819 4.45 % Noninterest-earning assets: Cash and due from banks 118,230 114,108 115,211 Allowance for loan losses (32,469 ) (34,252 ) (39,235 ) Other assets 185,994 188,813 192,001 Total assets $ 5,162,966 $ 5,027,704 $ 4,546,106 Liabilities and Stockholders' Equity Interest-bearing liabilities: Deposits: Demand: interest-bearing $ 90,646 $ 18 0.08 % $ 90,720 $ 18 0.08 % $ 95,399 $ 19 0.08 % Money market and savings 1,513,408 3,315 0.87 % 1,526,951 3,311 0.86 % 1,305,565 2,340 0.71 % Time deposits 1,408,227 4,069 1.15 % 1,384,724 3,742 1.07 % 1,165,828 2,440 0.83 % Total interest-bearing Deposits 3,012,281 7,402 0.97 % 3,002,395 7,071 0.93 % 2,566,792 4,799 0.74 % Borrowings 119,946 363 1.20 % 67,935 198 1.16 % 174,674 207 0.47 % Subordinated debentures 117,198 1,676 5.70 % 117,065 1,667 5.68 % 18,919 241 5.07 % Total interest-bearing liabilities 3,249,425 9,441 1.15 % 3,187,395 8,936 1.11 % 2,760,385 5,247 0.76 % Noninterest-bearing liabilities and equity: Demand deposits: noninterest-bearing 1,321,182 1,257,954 1,229,042 Other liabilities 30,482 30,592 27,497 Stockholders' equity 561,877 551,763 529,182 Total liabilities and stockholders' equity $ 5,162,966 $ 5,027,704 $ 4,546,106 Net interest income $ 46,768 $ 45,421 $ 42,572 Cost of deposits 0.68 % 0.66 % 0.50 % Net interest spread 3.41 % 3.42 % 3.69 % Net interest margin 3.79 % 3.79 % 3.96 % (1) Includes loans held for sale (2) Amounts calculated on a fully taxable equivalent basis using the statutory federal tax rate of 35%. Hanmi Financial Corporation and Subsidiaries Average Balance, Average Yield Earned, and Average Rate Paid (Unaudited) (In thousands, except ratios) Twelve Months Ended December 31, 2017 December 31, 2016 Interest Average Interest Average Average Income / Yield / Average Income / Yield / Balance Expense Rate Balance Expense Rate Assets Interest-earning assets: Loans and leases receivable (1) $ 4,039,346 $ 195,790 4.85 % $ 3,423,292 $ 164,642 4.81 % Securities (2) 583,971 13,771 2.36 % 614,749 13,194 2.15 % FRB and FHLB stock 16,385 1,232 7.52 % 24,189 2,467 10.20 % Interest-bearing deposits in other banks 40,333 449 1.11 % 41,730 208 0.50 % Total interest-earning assets 4,680,035 211,242 4.51 % 4,103,960 180,511 4.40 % Noninterest-earning assets: Cash and due from banks 116,716 115,229 Allowance for loan losses (33,277 ) (40,856 ) Other assets 188,992 194,365 Total assets $ 4,952,466 $ 4,372,698 Liabilities and Stockholders' Equity Interest-bearing liabilities: Deposits: Demand: interest-bearing $ 93,184 $ 74 0.08 % $ 95,298 $ 75 0.08 % Money market and savings 1,495,378 12,515 0.84 % 1,074,247 6,470 0.60 % Time deposits 1,322,352 13,500 1.02 % 1,255,883 10,025 0.80 % Total interest-bearing deposits 2,910,914 26,089 0.90 % 2,425,428 16,570 0.68 % Borrowings 119,041 1,077 0.90 % 196,708 879 0.45 % Subordinated debentures 95,811 5,353 5.57 % 18,817 825 4.38 % Total interest-bearing liabilities 3,125,766 32,519 1.04 % 2,640,953 18,274 0.69 % Noninterest-bearing liabilities and equity: Demand deposits: noninterest-bearing 1,249,158 1,182,157 Other liabilities 29,407 30,721 Stockholders' equity 548,135 518,867 Total liabilities and stockholders' equity $ 4,952,466 $ 4,372,698 Net interest income $ 178,723 $ 162,237 Cost of deposits 0.63 % 0.46 % Net interest spread 3.47 % 3.71 % Net interest margin 3.82 % 3.95 % (1) Includes loans held for sale (2) Amounts calculated on a fully taxable equivalent basis using the statutory federal tax rate of 35%. Non-GAAP Financial Measures\nAcquisition Accounting\nCore loan yield, core deposit costs, net interest income and net interest margin excluding acquisition accounting are supplemental financial information determined by a method other than in accordance with U.S. generally accepted accounting principles (“GAAP”). These non-GAAP measures are used by management in the analysis of Hanmi’s results of operations. The calculation of these measures is illustrated below. Management believes the presentation of these financial measures excluding the impact of these items provides useful supplemental information that is essential to a proper understanding of the results of Hanmi. This disclosure should not be viewed as a substitution for results determined in accordance with GAAP, nor is it necessarily comparable to non-GAAP performance measures that may be presented by other companies.\nThe following table reconciles these non-GAAP performance measures to the GAAP performance measures for the periods indicated:\nFor the Three Months Ended December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2016 2016 Core loan yield 4.87 % 4.84 % 4.82 % 4.68 % 4.63 % Accretion of discount on purchased loans 0.03 % 0.03 % 0.05 % 0.06 % 0.09 % As reported 4.90 % 4.87 % 4.87 % 4.74 % 4.72 % Core deposit cost 0.69 % 0.67 % 0.63 % 0.55 % 0.54 % Accretion of time deposits premium 0.01 % 0.01 % 0.01 % 0.01 % 0.04 % As reported 0.68 % 0.66 % 0.62 % 0.54 % 0.50 % For the Three Months Ended December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Amount Rate Amount Rate Amount Rate Amount Rate Amount Rate Net interest income and net interest margin excluding acquisition accounting (1) $ 46,405 3.76 % $ 45,049 3.76 % $ 43,129 3.76 % $ 42,230 3.84 % $ 41,489 3.86 % Accretion of discount on Non-PCI loans 343 0.03 % 303 0.03 % 457 0.04 % 527 0.05 % 781 0.07 % Accretion of discount on PCI loans (9 ) 0.00 % 38 0.00 % 52 0.00 % 54 0.00 % 78 0.01 % Accretion of time deposits premium 115 0.01 % 116 0.01 % 116 0.01 % 126 0.01 % 314 0.03 % Amortization of subordinated debentures discount (86 ) -0.01 % (85 ) -0.01 % (81 ) -0.01 % (77 ) -0.01 % (90 ) -0.01 % Net impact 363 0.03 % 372 0.03 % 544 0.05 % 630 0.05 % 1,083 0.10 % As reported, on a fully taxable equivalent basis (1) $ 46,768 3.79 % $ 45,421 3.79 % $ 43,673 3.81 % $ 42,860 3.89 % $ 42,572 3.96 % (1) Amounts calculated on a fully taxable equivalent basis using the statutory federal tax rate of 35%: rates may not sum due to rounding. Tangible Common Equity to Tangible Assets Ratio\nTangible common equity to tangible assets ratio is supplemental financial information determined by a method other than in accordance with U.S. generally accepted accounting principles (“GAAP”). This non-GAAP measure is used by management in the analysis of Hanmi’s capital strength. Tangible equity is calculated by subtracting goodwill and other intangible assets from stockholders’ equity. Banking and financial institution regulators also exclude goodwill and other intangible assets from stockholders’ equity when assessing the capital adequacy of a financial institution. Management believes the presentation of this financial measure excluding the impact of these items provides useful supplemental information that is essential to a proper understanding of the capital strength of Hanmi. This disclosure should not be viewed as a substitution for results determined in accordance with GAAP, nor is it necessarily comparable to non-GAAP performance measures that may be presented by other companies.\nThe following table reconciles this non-GAAP performance measure to the GAAP performance measure for the periods indicated:\nTangible Common Equity to Tangible Assets Ratio (Unaudited) (In thousands, except share, per share data and ratios) December 31, September 30, June 30, March 31, December 31, Hanmi Financial Corporation 2017 2017 2017 2017 2016 Assets $ 5,210,485 $ 5,111,396 $ 4,973,346 $ 4,811,821 $ 4,701,346 Less goodwill (11,031 ) (11,031 ) (11,031 ) (11,031 ) (11,031 ) Less other intangible assets (1,513 ) (1,597 ) (1,681 ) (1,766 ) (1,858 ) Tangible assets $ 5,197,941 $ 5,098,768 $ 4,960,634 $ 4,799,024 $ 4,688,457 Stockholders' equity $ 562,477 $ 559,247 $ 550,140 $ 539,542 $ 531,025 Less goodwill (11,031 ) (11,031 ) (11,031 ) (11,031 ) (11,031 ) Less other intangible assets (1,513 ) (1,597 ) (1,681 ) (1,766 ) (1,858 ) Tangible stockholders' equity $ 549,933 $ 546,619 $ 537,428 $ 526,745 $ 518,136 Stockholders' equity to assets 10.80 % 10.94 % 11.06 % 11.21 % 11.30 % Tangible common equity to tangible assets 10.58 % 10.72 % 10.83 % 10.98 % 11.05 % Common shares outstanding 32,431,630 32,413,082 32,393,856 32,392,580 32,330,747 Tangible common equity per common share $ 16.96 $ 16.86 $ 16.59 $ 16.26 $ 16.03\nSource:Hanmi Bank", "external_links": ["https://www.globenewswire.com/Tracker?data=Awpq0vjDzQ5taOmhq6w18x0gPAuTVSkZjxX7xL_v6508qcxsc7qKULJaHvW6aHQVYPzMLpBW9laH1qGsoevNXLibfdOa2sxn6AH08Oxr9zCUDTVedk3lsYB4AuW1fWETktBWglLae2hQQYzzlTDuY2_USjyDX5alFC_H1rRuARv-cNkFilZ_Koj2otdKFclV", "https://www.globenewswire.com/Tracker?data=Awpq0vjDzQ5taOmhq6w18wwRZc5wC7HgoVsWP0lVaOGbG6c1qXxlAj1rDiZZfJhKkUzoMSHUbXFiCCgDApiTURzqFyl5BFgdmBWDNuVavU3ldFhMvJ4l5DgPnYRYoPc3yB-2P9yallOdQ4qh0nxyNfYlKQvupbBe_mgZ3GHRRqvwK33mIJ5Y-m0Spja_Qe2I", "https://www.globenewswire.com/NewsRoom/AttachmentNg/fd788159-17a0-4bee-87f9-bbac8cb2cf0d"], "published": "2018-01-24T00:01:00.000+02:00", "crawled": "2018-01-24T00:54:39.002+02:00", "highlightTitle": ""}