{"organizations": [], "uuid": "37378ad6fda4537f5a70caa696f303755a28c993", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-czech-ukraine-workers/czech-government-raises-quota-for-fast-lane-work-permits-for-ukrainians-idUSKBN1FK2G6", "country": "US", "domain_rank": 408, "title": "Czech government raises quota for fast-lane work permits for Ukrainians", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T18:46:00.000+02:00", "replies_count": 0, "uuid": "37378ad6fda4537f5a70caa696f303755a28c993"}, "author": "", "url": "https://www.reuters.com/article/us-czech-ukraine-workers/czech-government-raises-quota-for-fast-lane-work-permits-for-ukrainians-idUSKBN1FK2G6", "ord_in_thread": 0, "title": "Czech government raises quota for fast-lane work permits for Ukrainians", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 4:48 PM / in 19 minutes Czech government raises quota for fast-lane work permits for Ukrainians Reuters Staff 3 Min Read \nPRAGUE (Reuters) - The Czech government agreed on Wednesday to double the number of Ukrainians it was allowing in as fast-track migrant workers to 19,600 per year, aiming to help firms struggling to find workers and facing pressure from the workforce for wage hikes. \nThe decision, raising the quota for easy access to the Czech market from 9,600 last year and 3,800 before, is in contrast to a hostility to would-be asylum seekers from predominantly Muslim countries whom many Czechs see as security risks. \nThe Czech Republic has the lowest unemployment rate in the European Union, 2.3 percent under Eurostat methodology, and companies see labor shortage as the biggest business obstacle. \n“We are reacting to employers’ problems with finding labor force,” Foreign Minister Martin Stropnicky said on Twitter. \nHe said the plan would also apply in smaller extent to workers for Mongolia and the Philippines. \nThe Czechs are facing an EU legal suit for refusing to accept asylum-seekers under the union’s system meant to relieve countries hit most by immigration. \nThe Czech Republic already has 117,000 legally residing Ukrainians, the largest foreign community in the country, followed by Slovaks and Vietnamese. Ukrainians are also the most frequent nationality among foreigners found to be in the country illegally. \nUkraine, which is not in the EU, has been a favored source of migrant workers for the Czech Republic due to its geographical proximity and cultural and linguistic links. \nUkraine’s own economy has suffered since the fall of the Soviet Union from mismanagement and corruption, and has been badly damaged by a nearly four-year conflict in the east of the country with separatists backed by Russia. \nThe Czech annual quota for easy access was already raised last year from previous 3,800. \nThe country of 10.6 million people had 216,629 job vacancies in December, the highest on record, versus 259,929 available unemployed workers. \nManufacturing is a key driver of economic growth in the Czech Republic, with foreign-owned firms feeding into multinational supply chains in the auto, machinery and electronics industries. Reporting by Jan Lopatka; Editing by Richard Balmforth", "external_links": [], "published": "2018-01-31T18:46:00.000+02:00", "crawled": "2018-01-31T19:00:15.001+02:00", "highlightTitle": ""}