{"organizations": [], "uuid": "c08cc2f1b241132b7e68f69a9ba940c1b84f19d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-microsemi-reports-first-quarter-2018-results.html", "country": "US", "domain_rank": 767, "title": "Microsemi Reports First Quarter 2018 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:02:00.000+02:00", "replies_count": 0, "uuid": "c08cc2f1b241132b7e68f69a9ba940c1b84f19d4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-microsemi-reports-first-quarter-2018-results.html", "ord_in_thread": 0, "title": "Microsemi Reports First Quarter 2018 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "aliso viejo", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "microsemi corporation", "sentiment": "negative"}, {"name": "microsemi reports first", "sentiment": "negative"}, {"name": "microsemi", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}, {"name": "vectron international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALISO VIEJO, Calif., Jan. 25, 2018 /PRNewswire/ -- Microsemi Corporation (Nasdaq: MSCC), a leading provider of semiconductor solutions differentiated by power, security, reliability and performance, today reported unaudited results for its first quarter of fiscal year 2018 ended Dec. 31, 2017.\nNet sales for Microsemi's first quarter of fiscal year 2018 were $468.7 million, up 7.6 percent from the $435.5 million reported in the first quarter of 2017.\nGAAP gross margin for the first quarter of 2018 was 61.6 percent, inclusive of the effect of non-cash purchase accounting charges related to profit from acquired inventory of $5.2 million and $2.4 million in inventory charges related to the closure of a non-strategic operation. GAAP gross margin was 63.5 percent in the first quarter of 2017 and 64.0 percent in the fourth quarter of 2017.\nNon-GAAP gross margin for the first quarter of 2018 was 63.2 percent, inclusive of the high-performance timing business of Vectron International, which Microsemi acquired in November 2017. Non-GAAP gross margin was 63.5 percent in the first quarter of 2017 and 64.4 percent in the fourth quarter of 2017.\nGAAP operating income and net income for the first quarter of 2018 were $59.5 million and $47.9 million, respectively, and included restructuring, facility closure and other related charges of $6.4 million and acquisition-related costs of $1.4 million. Also included in net income were amortization of intangible assets of $50.3 million, stock-based compensation of $25.6 million, and debt extinguishment and other non-cash financing charges of $4.3 million. GAAP operating margin for the first quarter of 2018 was 12.7 percent compared to 12.8 percent for the first quarter of 2017 and 15.9 percent in the fourth quarter of 2017. GAAP net income was $47.9 million or $0.40 per diluted share for the first quarter of 2018 compared to $19.5 million or $0.17 per diluted share for the first quarter of 2017.\nNon-GAAP operating income for the first quarter of 2018 was $150.8 million, up 13.6 percent from the $132.7 million reported in the first quarter of 2017. Non-GAAP operating margin for the first quarter of 2018 was 32.2 percent, up 170 basis points from 30.5 percent in the first quarter of 2017. Non-GAAP net income for the first quarter of 2018 was $120.1 million or $1.01 per diluted share compared to $99.8 million or $0.86 per diluted share for the first quarter of 2017.\nOperating and free cash flows for the first quarter of 2018 were at $65.3 million and $55.4 million, respectively. Cash and cash equivalents at the end of the first quarter of 2018 were $166.6 million.\n\"We kicked off the first quarter of fiscal 2018 with 8 percent year-over-year sales growth and 17 percent EPS growth,\" said James J. Peterson, Microsemi's chairman and CEO. \"We are on a clear path to exceed our long-term 35 percent operating margin target as we leverage customer engagements, share gains and revenue growth into industry-leading profitability.\"\nBusiness Outlook\nMicrosemi currently expects net sales in the second quarter of fiscal year 2018 of between $477 million and $502 million, and expects non-GAAP diluted earnings per share of between $0.93 and $1.07.\nGuidance on diluted earnings per share is provided only on a non-GAAP basis due to the inherent difficulty of forecasting the timing or amount of certain items that have been excluded from the forward-looking non-GAAP measures, and a reconciliation to the comparable GAAP guidance has not been provided because certain factors that are materially significant to Microsemi's ability to estimate the excluded items are not accessible or estimable on a forward-looking basis without unreasonable effort.\nMicrosemi regularly announces a quarterly outlook in the form of issuing a news release and does not undertake to update any of this information between such public announcements to reflect subsequent events or circumstances. Please refer to the \"SAFE HARBOR\" STATEMENT below for risks that may affect future actual results.\nNon-GAAP Financial Measures\nFor further information regarding Microsemi's non-GAAP financial measures, please refer to \"Notes on Non-GAAP Financial Measures\" below. Non-GAAP financial measures are reconciled to comparable GAAP financial measures in the accompanying financial tables and notes.\nInformation for First Quarter 2018 Earnings Conference Call and Webcast\nDate:\nThursday, Jan. 25, 2018\nTime:\n4:45 p.m. EST (1:45 p.m. PST)\nTo access the webcast, log on to www.microsemi.com, go to the Investors section, and then to IR Events and Presentations. To listen to the live webcast, visit this website approximately 15 minutes prior to the start of the call to register, download and install any necessary audio software. For those unable to participate during the live webcast, a replay will be available shortly after the call on the Microsemi website for 90 days.\nTo participate in the conference call by telephone, call 877-264-1110 at approximately 4:30 p.m. EST (1:30 p.m. PST). International callers can call 706-634-1357. Please provide the following ID number: 5678358.\nAbout Microsemi\nMicrosemi Corporation (Nasdaq: MSCC) offers a comprehensive portfolio of semiconductor and system solutions for aerospace & defense, communications, data center and industrial markets. Products include high-performance and radiation-hardened analog mixed-signal integrated circuits, FPGAs, SoCs and ASICs; power management products; timing and synchronization devices and precise time solutions, setting the world's standard for time; voice processing devices; RF solutions; discrete components; enterprise storage and communication solutions; security technologies and scalable anti-tamper products; Ethernet solutions; Power-over-Ethernet ICs and midspans; as well as custom design capabilities and services. Microsemi is headquartered in Aliso Viejo, California, and has approximately 4,800 employees globally. Learn more at www.microsemi.com .\nPLEASE READ THE FOLLOWING FACTORS THAT CAN MATERIALLY AFFECT MICROSEMI'S FUTURE RESULTS.\n\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995: Any statements set forth in the news release that are not entirely historical and factual in nature are forward-looking statements, including without limitation statements concerning Microsemi's net sales and earnings guidance, the expectations of rising customer engagements, market share gains, revenue growth, achieving margin targets, increasing cash flow and any other statements or beliefs regarding Microsemi's plans or expectations. These forward-looking statements are based on Microsemi's current expectations and are inherently subject to risks and uncertainties that could cause actual results to differ materially from those expressed in the forward-looking statements. The potential risks and uncertainties include, but are not limited to, such factors as continued negative or worsening worldwide economic conditions or market instability; risks related to Microsemi's international operations and sales, including divergent laws and regulations, political instability, trade restrictions and sanctions, restrictions in the transfer or repatriation of funds, currency fluctuations and availability of transportation services; downturns in the highly cyclical semiconductor industry that may cause us to trigger financial covenants in our debt agreements, increase the cost of borrowing, and decrease the amount available under our credit facilities; our ability to successfully implement our acquisitions and divestitures strategy or integrate acquired companies; uncertainty as to the future profitability of acquired businesses, and delays in the realization of, or the failure to realize, any accretion from acquisition transactions; acquiring, managing and integrating new operations, businesses or assets, and the associated diversion of management attention or other related costs or difficulties; difficulties and costs of protecting patents and other proprietary rights; Microsemi's reliance on government contracts for a significant portion of its sales, including impacts of any termination or renegotiation of such contracts, uncertainties of governmental appropriations and national defense policies and priorities and effects of any past or future government shutdowns; potential non-realization of expected orders or non-realization of backlog; failure to make sales indicated by the Microsemi's book-to-bill ratio; intense competition in the semiconductor industry and resultant downward price pressure; the effect of events such as natural disasters and related disruptions on our operations; the concentration of the facilities that service the semiconductor industry; delays in beginning production, implementing production techniques, resolving problems associated with technical equipment malfunctions, or issues related to government or customer qualification of facilities; our dependence on third parties for key functions; utilization of channel partners over which we have limited control for product distribution; increases in the costs of credit and the availability of credit or additional capital only under more restrictive conditions or not at all; changes to laws or regulations, including tax laws or regulations; unanticipated changes in Microsemi's tax obligations, results of tax examinations or exposure to additional income tax liabilities; changes in generally accepted accounting principles; principal, liquidity and counterparty risks related to Microsemi's holdings in securities; inability to develop new technologies and products to satisfy changes in customer demand or the development by our competitors of products that decrease the demand for Microsemi's products; unfavorable or declining conditions in end markets; inability of Microsemi's compound semiconductor products to compete successfully with silicon-based products; production delays related to new compound semiconductors; variability of our manufacturing yields; potential effects of system outages or data security breaches; inability by Microsemi to fulfill customer demand and resulting loss of customers; variations in customer order preferences; difficulties foreseeing future demand; rises in inventory levels and inventory obsolescence; environmental or other regulatory matters or litigation, or any matters involving contingent liabilities or other claims; the uncertainty of litigation, the costs and expenses of litigation, the potential material adverse effect litigation could have on Microsemi's business and results of operations if an adverse determination in litigation is made, and the time and attention required of management to attend to litigation; difficulties in determining the scope of, and procuring and maintaining, adequate insurance coverage; difficulties in the hiring and retention of qualified personnel in a competitive labor market; any circumstances that adversely impact the end markets of acquired businesses; and difficulties in closing or disposing of operations or assets or transferring work, assets or inventory from one plant to another. In addition to these factors and any other factors mentioned elsewhere in this news release, the reader should refer as well to the factors, uncertainties or risks identified in Microsemi's most recent Annual Report on Form 10-K and any subsequent Quarterly Reports on Form 10-Q reports filed by Microsemi with the SEC. Additional risk factors may be identified from time to time in Microsemi's future filings. The forward-looking statements included in this release speak only as of the date hereof, and Microsemi does not undertake any obligation to update these forward-looking statements to reflect subsequent events or circumstances. Amounts reported in this release are preliminary and subject to finalization prior to the filing of our next Quarterly Report on Form 10-Q.\n(Financial Tables Follow)\nSelected GAAP & Non-GAAP Financial Measures\n(unaudited, in millions, except for percentages and per share amounts)\nQuarter Ended\nDec 31,\n2017\nOct 1,\n2017\nJan 1,\n2017\nNet sales\n$\n468.7\n$\n475.3\n$\n435.5\nSelected GAAP Financial Measures\nGross profit\n$\n288.7\n$\n304.1\n$\n276.5\nGross margin\n61.6\n%\n64.0\n%\n63.5\n%\nOperating income\n$\n59.5\n$\n75.4\n$\n55.8\nOperating margin\n12.7\n%\n15.9\n%\n12.8\n%\nNet income\n$\n47.9\n$\n102.0\n$\n19.5\nDiluted earnings per share\n$\n0.40\n$\n0.87\n$\n0.17\nSelected Non-GAAP Financial Measures\nGross profit\n$\n296.3\n$\n306.2\n$\n276.5\nGross margin\n63.2\n%\n64.4\n%\n63.5\n%\nOperating income\n$\n150.8\n$\n160.0\n$\n132.7\nOperating margin\n32.2\n%\n33.7\n%\n30.5\n%\nNet income\n$\n120.1\n$\n128.2\n$\n99.8\nDiluted earnings per share\n$\n1.01\n$\n1.09\n$\n0.86\nAdditional details reconciling the selected GAAP financial measure to the selected non-GAAP financial measure may be found in the \"Schedule Reconciling Selected Non-GAAP Financial Measures\" and \"Notes on Non-GAAP Financial Measures.\"\nSchedule Reconciling Selected Non-GAAP Financial Measures\n(unaudited, in millions, except for per share amounts)\nQuarter Ended\nDec 31,\n2017\nOct 1,\n2017\nJan 1,\n2017\nGAAP gross profit\n$\n288.7\n$\n304.1\n$\n276.5\nManufacturing profit in acquired inventory (1)\n5.2\n2.1\n—\nInventory charges related to closure of manufacturing facility (1)\n2.4\n—\n—\nNon-GAAP gross profit\n$\n296.3\n$\n306.2\n$\n276.5\nGAAP operating income\n$\n59.5\n$\n75.4\n$\n55.8\nAdjustments to GAAP gross profit\n7.6\n2.1\n—\nRestructuring, severance, facilities and other special charges (1)\n6.4\n4.0\n2.4\nAmortization of intangible assets (2)\n50.3\n50.1\n45.5\nStock-based compensation (3)\n25.6\n28.4\n28.3\nAcquisition and divestiture related costs (4)\n1.4\n—\n0.7\nNon-GAAP operating income\n$\n150.8\n$\n160.0\n$\n132.7\nGAAP net income\n$\n47.9\n$\n102.0\n$\n19.5\nAdjustments to GAAP gross profit and operating income\n91.3\n84.6\n76.9\nAdjustment to previously recognized gain on divestiture (4)\n—\n—\n1.2\nCredit facility issuance and debt extinguishment costs (5)\n4.3\n1.9\n2.1\nGain from facility sale (1)\n—\n(3.1)\n—\nFair value change in foreign tax liabilities (6)\n(0.1)\n1.9\n(1.0)\nIncome tax effect on non-GAAP adjustments (7)\n(23.3)\n(59.1)\n1.1\nNon-GAAP net income\n$\n120.1\n$\n128.2\n$\n99.8\nGAAP diluted earnings per share\n$\n0.40\n$\n0.87\n$\n0.17\nEffect of non-GAAP adjustments on diluted earnings per share\n$\n0.61\n$\n0.22\n$\n0.69\nNon-GAAP diluted earnings per share\n$\n1.01\n$\n1.09\n$\n0.86\nWeighted-average diluted shares used in calculating non-GAAP diluted earnings per share\n118.9\n117.7\n116.3\nOperating cash flow\n$\n65.3\n$\n156.9\n$\n77.6\nPayments for capital expenditures\n(9.9)\n(17.6)\n(10.5)\nFree cash flow (8)\n$\n55.4\n$\n139.3\n$\n67.1\nAdditional details reconciling the selected non-GAAP financial measure to the selected GAAP financial measure may be found in \"Notes on Non-GAAP Financial Measures.\"\nSummary of Schedule Reconciling Selected Non-GAAP Financial Measures\n(unaudited, in millions, except for per share amounts)\nQuarter Ended December 31, 2017\nGAAP\nNon-GAAP\nAdjustments\nNon-GAAP\nNet sales\n$\n468.7\n$\n—\n$\n468.7\nGross profit\n$\n288.7\n$\n7.6\n$\n296.3\nOperating income\n$\n59.5\n$\n91.3\n$\n150.8\nNet income\n$\n47.9\n$\n72.2\n$\n120.1\nDiluted earnings per share\n$\n0.40\n$\n0.61\n$\n1.01\nAdditional details reconciling the selected non-GAAP financial measure to the selected GAAP financial measure may be found in the \"Schedule Reconciling Selected Non-GAAP Financial Measures\" and \"Notes on Non-GAAP Financial Measures.\"\nConsolidated Condensed Statements of Income\n(unaudited, in millions, except for per share amounts)\nQuarter Ended\nDec 31,\n2017\nOct 1,\n2017\nJan 1,\n2017\nNet sales\n$\n468.7\n$\n475.3\n$\n435.5\nCost of sales\n180.0\n171.2\n159.0\nGross profit\n$\n288.7\n$\n304.1\n$\n276.5\nOperating expenses\nSelling, general and administrative\n$\n83.0\n$\n87.3\n$\n89.8\nResearch and development\n89.0\n87.3\n82.3\nAmortization of intangible assets\n50.3\n50.1\n45.5\nRestructuring, severance and facilities charges\n5.5\n4.0\n2.4\nAcquisition and divestiture related costs\n1.4\n—\n0.7\nTotal operating expenses\n$\n229.2\n$\n228.7\n$\n220.7\nOperating income\n$\n59.5\n$\n75.4\n$\n55.8\nInterest and other expense, net\n(25.2)\n(22.1)\n(27.2)\nIncome before income taxes\n$\n34.3\n$\n53.3\n$\n28.6\nProvision for (benefit from) income taxes\n(13.6)\n(48.7)\n9.1\nNet income\n$\n47.9\n$\n102.0\n$\n19.5\nEarnings per share\nBasic\n$\n0.41\n$\n0.88\n$\n0.17\nDiluted\n$\n0.40\n$\n0.87\n$\n0.17\nWeighted-average common shares outstanding\nBasic\n116.9\n115.3\n114.0\nDiluted\n118.9\n117.7\n116.3\nConsolidated Condensed Balance Sheets\n(unaudited, in millions)\nDec 31,\n2017\nOct 1,\n2017\nAssets\nCurrent assets\nCash and cash equivalents\n$\n166.6\n$\n144.9\nAccounts receivable, net\n276.0\n267.9\nInventories\n270.7\n239.1\nOther current assets\n76.1\n75.0\nTotal current assets\n$\n789.4\n$\n726.9\nProperty and equipment, net\n209.6\n197.6\nGoodwill\n2,542.9\n2,497.3\nIntangible assets, net\n737.8\n752.3\nDeferred income taxes\n68.6\n67.2\nOther assets\n85.2\n81.8\nTotal assets\n$\n4,433.5\n$\n4,323.1\nLiabilities and stockholders' equity\nCurrent liabilities\nAccounts payable\n$\n139.7\n$\n164.9\nAccrued liabilities\n123.0\n153.4\nCurrent maturity of credit facility\n71.3\n61.1\nTotal current liabilities\n$\n334.0\n$\n379.4\nCredit facility\n1,839.0\n1,735.6\nDeferred income taxes\n81.7\n103.8\nOther long-term liabilities\n116.7\n110.0\nStockholders' equity\n2,062.1\n1,994.3\nTotal liabilities and stockholders' equity\n$\n4,433.5\n$\n4,323.1\nNotes on Non-GAAP Financial Measures\nTo supplement the consolidated financial results prepared in accordance with Generally Accepted Accounting Principles (\"GAAP\"), this press release and its attachments include non-GAAP financial measures which are adjusted for the items listed in the footnotes below. Management reports the following non-GAAP financial measures:\nnon-GAAP gross profit and gross margin; non-GAAP operating income and operating margin; non-GAAP net income and diluted earnings per share; and free cash flow.\nNon-GAAP financial measures are not prepared in accordance with GAAP; therefore, the information is not necessarily comparable to other companies' financial information and should be considered as a supplement to, not a substitute for, or superior to, the corresponding measures calculated in accordance with GAAP.\nManagement believes it is useful to provide these non-GAAP financial measures and a reconciliation to comparable GAAP financial measures as we believe they enhance an investor's overall understanding of our financial performance and future prospects by being more reflective of our core operational activities and more comparable with our results over various periods. By disclosing non-GAAP financial measures, management intends to provide investors with an alternate measure to evaluate and compare Microsemi's operating results and trends for the periods presented. Management uses non-GAAP financial measures internally for strategic decision making, forecasting future results and evaluating current performance. The items reconciling non-GAAP financial measures to GAAP financial measures and additional comments and the usefulness of each item are set forth below:\n(1)\nManufacturing profit in acquired inventory results from purchase accounting entries to increase the value of inventory acquired to its fair value. As the acquired inventory is sold, the associated manufacturing profit in acquired inventory increases cost of goods sold and reduces gross profit. Management believes it is useful to exclude manufacturing profit in acquired inventory as it does not reflect continuing operations of acquired entities and to facilitate comparability of gross profit between periods. In addition, management excludes the impact of manufacturing profit in acquired inventory in internal measurements of gross profit.\nIn Microsemi's effort to streamline our product lines and strategic focus, as well as integrate product lines from acquisitions, we have periodically exited or deemphasized several areas which has improved operating expense from various cost reductions. We periodically evaluate the profitability of our various offerings. Should the actual or expected profitability fall below an acceptable threshold, we may decide to stop offering a product, in part to reallocate manufacturing, operations, engineering, sales and support resources to products we expect to generate greater returns. We believe that for many of these products, market dynamics dictate that price is the primary differentiator rather than our value-added core competencies of power, reliability, security and performance.\nRestructuring, severance, facilities and other special charges consist of severance and other costs related to the consolidation of operations, strategic discontinuation of products and closure of facilities.\nRelated to the streamlining of our operations, we have recorded both charges and gains related to facility consolidation and equipment on both leased and owned properties and engineering equipment for development projects we are no longer pursuing. Facilities consisted of manufacturing sites, as well as sales, engineering and administrative space.\nAs the operations and products referred to above are not expected to have a continuing contribution to operations or they are expected to have a diminishing contribution during the transition phase, management believes excluding such items from Microsemi's operations is useful to investors as it provides a means of evaluating Microsemi's on-going operations. Management believes that utilizing non-GAAP financial measures that exclude these items is useful in providing an alternate measure to evaluate core operating activities and management excludes these items in its evaluation of operations and for strategic decision making, forecasting future results and evaluating current performance.\n(2)\nAmortization of acquisition related intangible assets is excluded from internal analysis of Microsemi's operations and management does not view this non-cash expense as reflective of the business' current performance. Management believes that utilizing non-GAAP financial measures that exclude this non-cash item is useful in providing an alternate measure that excludes the variability caused by purchase accounting factors.\n(3)\nStock based compensation is excluded by management when evaluating operating activities and for strategic decision making, forecasting future results and evaluating current performance. Management believes that utilizing non-GAAP financial measures that exclude this non-cash item is useful in providing an alternate measure that excludes the variability caused by different methodologies and subjective assumptions used in the valuation of equity awards across different companies.\n(4)\nIn accordance with business combination and other relevant accounting guidance, we expense acquisition and divestiture costs as incurred and recognize gains on divestitures upon consummation of the transaction. During the first quarter of 2017, we reduced the $125.5 million gain recognized from our third quarter 2016 divestitures by $1.2 million. Management excludes these expenses and gains when evaluating operating activities and for strategic decision making, forecasting future results and evaluating current performance. Management believes that utilizing non-GAAP financial measures that exclude this item is useful in providing an alternate measure that excludes the variability caused by purchase accounting factors.\n(5)\nCredit facility issuance and debt extinguishment costs have been excluded as they are discrete charges we incurred to issue our credit facility. Management excludes these expenses from internal measurements of credit facility interest rates and in evaluating current performance. Management believes that utilizing non-GAAP financial measures that exclude these items is useful in providing an alternate measure that is reflective of the ongoing characteristics of the amended credit facility.\n(6)\nThese amounts represent the foreign exchange effect on non-current foreign tax liabilities recorded for possible assessments by tax authorities. Changes in foreign exchange rates are a non-cash impact to these liabilities that management excludes from internal measurements and from forecasting future results and are not viewed by management as being reflective of the business' ongoing tax position.\n(7)\nThe tax effect of non-GAAP adjustments represents the difference in the provision for income taxes that resulted from non-GAAP adjustments to pretax income and also certain acquisition related and nondeductible stock based compensation items, and non-cash valuation allowance charges and releases related to deferred tax assets. These amounts are excluded as non-GAAP adjustments as the restructuring activities and acquisitions are not viewed by management as being reflective of the business' ongoing tax position.\n(8)\nFree cash flow is a non-GAAP financial measure defined as operating cash flow less cash paid for capital expenditures. We consider free cash flow to be a liquidity measure which provides useful information to management and investors about the amount of cash generated by the business after our capital expenditures, which can then be used for strategic opportunities including, among others, investing in Microsemi's business, making strategic acquisitions, reducing debt principal and strengthening the balance sheet. Management uses free cash flow as a supplemental measure to the net change in cash and cash equivalents as presented in Microsemi's consolidated statements of cash flows prepared in accordance with GAAP which incorporates all cash movements during the period.\nView original content with multimedia: http://www.prnewswire.com/news-releases/microsemi-reports-first-quarter-2018-results-300588515.html\nSOURCE Microsemi Corporation", "external_links": ["http://www.prnewswire.com/news-releases/microsemi-reports-first-quarter-2018-results-300588515.html"], "published": "2018-01-26T00:02:00.000+02:00", "crawled": "2018-01-26T02:06:51.000+02:00", "highlightTitle": ""}