{"organizations": [], "uuid": "f1c2fa7a82b8615a91348e1444d81fa7da5ec049", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224754595&w=1200&r=LYNXMPEE0N0P1", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-britain-unemployment/uk-employment-surges-to-unexpected-record-high-wages-edge-up-idUSKBN1FD10J", "country": "US", "domain_rank": 408, "title": "UK employment surges to unexpected record high, wages edge up", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T17:35:00.000+02:00", "replies_count": 0, "uuid": "f1c2fa7a82b8615a91348e1444d81fa7da5ec049"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-unemployment/uk-employment-surges-to-unexpected-record-high-wages-edge-up-idUSKBN1FD10J", "ord_in_thread": 0, "title": "UK employment surges to unexpected record high, wages edge up", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "positive"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 24 (Reuters) - The number of people in work in Britain surged unexpectedly in the three months to November and regular wages rose at their fastest rate in almost a year, official data showed on Wednesday.\nBritain’s economy slowed in 2017 as higher inflation - caused by the post-Brexit referendum fall in the pound - hurt the spending power of consumers, although forecasts of a bigger hit to growth were confounded and job creation was strong.\nThe Office for National Statistics (ONS) said the number of people in work rose by 102,000 in the three months to November, the biggest increase since the period to July and taking total employment to a record 32.2 million. A Reuters poll of economists had pointed to a fall of 13,000.\nThe ONS said workers’ earnings, excluding bonuses, rose by an annual 2.4 percent in the three months to November, the biggest increase since December 2016 and compared with 2.3 percent in the three months to October.\nTotal pay growth, including bonuses, was unchanged at 2.5 percent, as expected.\nThe Bank of England increased interest rates for the first time since 2007 in November as most of its policymakers thought the steep fall in unemployment would soon start to push up wages.\n“With the employment rate returning to a joint-record high and the number of vacancies setting a new record, demand for workers clearly remained strong,” ONS statistician David Freeman said.\n“Nevertheless inflation remains higher than pay growth and so the real value of earnings continues to decline.”\nConsumer price inflation for November hit it highest in almost six years at 3.1 percent. That left regular pay in real-terms down 0.5 percent on a year earlier in the three months to November.\nThe data also showed the unemployment rate held at its four-decade low of 4.3 percent, as expected in the Reuters poll.\nThe number of unemployment benefit claimants rose by 8,600 to 832,500 in December, lifting the proportion of the workforce claiming jobless benefits to 2.4 percent, the highest rate since February 2015.\nEconomists taking part in the Reuters poll had expected the number of benefit claimants - which is considered to be a potential early warning sign of an economic downturn - to rise by 5,400.\nThe ONS said this measure was potentially misleading as it had been affected by changes in benefit eligibility.\n(Reporting by Andy Bruce and David Milliken)\nwilliam.schomberg@thomsonreuters.com; +44 207 542 7778\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T17:35:00.000+02:00", "crawled": "2018-01-25T13:14:49.000+02:00", "highlightTitle": ""}