{"organizations": [], "uuid": "bbfcdbba0ba4b1113a4806f1ef048d6ebb9289d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/07/pr-newswire-luminex-announces-preliminary-revenue-for-the-fourth-quarter-and-full-year-2017-company-to-present-at-36th-annual-j-p-morgan.html", "country": "US", "domain_rank": 767, "title": "Luminex Announces Preliminary Revenue for the Fourth Quarter and Full Year 2017; Company to Present at 36th Annual J.P. Morgan Healthcare Conference", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T00:00:00.000+02:00", "replies_count": 0, "uuid": "bbfcdbba0ba4b1113a4806f1ef048d6ebb9289d9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/07/pr-newswire-luminex-announces-preliminary-revenue-for-the-fourth-quarter-and-full-year-2017-company-to-present-at-36th-annual-j-p-morgan.html", "ord_in_thread": 0, "title": "Luminex Announces Preliminary Revenue for the Fourth Quarter and Full Year 2017; Company to Present at 36th Annual J.P. Morgan Healthcare Conference", "locations": [], "entities": {"persons": [], "locations": [{"name": "fourth quarter", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "luminex", "sentiment": "neutral"}, {"name": "j.p. morgan healthcare conference austin", "sentiment": "neutral"}, {"name": "luminex corporation", "sentiment": "neutral"}, {"name": "total licensed technologies group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Jan. 7, 2018 /PRNewswire/ -- Luminex Corporation (Nasdaq: LMNX) today announced that it expects its revenues in the fourth quarter of 2017 to be approximately $78 million and to exceed $306 million for the full- year ended 2017. These expected results reflect increases of 8% and 13% compared to the respective periods in 2016.\nSelect fourth quarter highlights include:\nTotal MDx revenue of approximately $44 million, grew 12% over the fourth quarter of 2016 The MDx sample to answer portfolio generated $13 million in the quarter, a 33% increase over the fourth quarter of 2016 85 VERIGENE® and ARIES® sample to answer molecular systems placed under contract, up over 30% from the third quarter of 2017 Total Licensed Technologies Group revenue of over $33 million, grew 4% over the fourth quarter of 2016\nFourth Quarter and Full Year 2017 Earnings Release Scheduled for February 12, 2018\nThe company plans to report results for the fourth quarter and full year ended December 31, 2017 and announce 2018 revenue guidance on Monday, February 12, 2018. Management will hold a conference call to discuss the operating highlights and financial results on that date, at 4:30 p.m. Eastern time.\nLuminex to Present at 36 th Annual J.P. Morgan Healthcare Conference on January 11, 2018\nLuminex President and CEO, Homi Shamir, will present at the 36th Annual J.P. Morgan Healthcare Conference to be held at The Westin St. Francis hotel in San Francisco, CA on Thursday, January 11 at 10:00 a.m. Pacific time.\nThe corporate presentation will be filed with the Securities and Exchange Commission and will be webcast live and may be accessed at Luminex Corporation's website at http://www.luminexcorp.com . Simply log on to the web at the address above, go to the Company section and access the Investor Relations link. Please go to the website at least 15 minutes prior to the event to register, download and install any necessary audio/video software. If you are unable to participate during the live webcast, the presentation will be archived for six months on the website using the 'replay' link.\nUse of Forward Looking Statements\nStatements made in this release that express Luminex's or management's intentions, plans, beliefs, expectations or predictions of future events are . Forward-looking statements in this release include statements regarding expected results. The words \"believe,\" \"expect,\" \"intend,\" \"estimate,\" \"anticipate,\" \"will,\" \"could,\" \"should\" and similar expressions are intended to further identify such for purposes of the Private Securities Litigation Reform Act of 1995. It is important to note that the Company's actual results or performance could differ materially from those anticipated or projected in such . Factors that could cause Luminex's actual results or performance include risks and uncertainties relating to the final close and revenue recognition accounting process and other internal control mechanisms designed to tie out accounting estimates to final reported results. The , , contained herein represent the judgment of Luminex as of the date of this press release, and Luminex expressly disclaims any intent, obligation or undertaking to release publicly any updates or revisions to any to reflect any change in Luminex's expectations with regard thereto or any change in events, conditions or circumstances on which any such statements are based.\nAbout Luminex Corporation\nAt Luminex, our mission is to empower labs to obtain reliable, timely, and actionable answers, ultimately advancing health. We offer a wide range of solutions applicable in diverse markets including clinical diagnostics, pharmaceutical drug discovery, biomedical research, genomic and proteomic research, biodefense research, and food safety. We accelerate reliable answers while simplifying complexity and deliver certainty with a seamless experience. To learn more about Luminex, please visit us at luminexcorp.com .\nContacts\nLuminex Investor Contacts\nHarriss Currie\nSr. Vice President of Finance and CFO\n512.219.8020\nhcurrie@luminexcorp.com\nMatthew Scalo\nSr. Director, Investor Relations\n512.219.8020\nmscalo@luminexcorp.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/luminex-announces-preliminary-revenue-for-the-fourth-quarter-and-full-year-2017-company-to-present-at-36th-annual-jp-morgan-healthcare-conference-300578434.html\nSOURCE Luminex Corporation", "external_links": ["http://www.prnewswire.com/news-releases/luminex-announces-preliminary-revenue-for-the-fourth-quarter-and-full-year-2017-company-to-present-at-36th-annual-jp-morgan-healthcare-conference-300578434.html"], "published": "2018-01-08T00:00:00.000+02:00", "crawled": "2018-01-08T03:06:31.001+02:00", "highlightTitle": ""}