{"organizations": [], "uuid": "3f9e9f355c161768383e8e496264d5da0f97067f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/10/103458480-GettyImages-480568848.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19794221/device/rss", "section_title": "Europe News", "url": "https://www.cnbc.com/2018/01/30/europe-markets-investors-monitor-earnings-and-economic-data.html", "country": "US", "domain_rank": 767, "title": "Europe markets: Investors monitor earnings and economic data", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T08:41:00.000+02:00", "replies_count": 0, "uuid": "3f9e9f355c161768383e8e496264d5da0f97067f"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/30/europe-markets-investors-monitor-earnings-and-economic-data.html", "ord_in_thread": 0, "title": "Europe markets: Investors monitor earnings and economic data", "locations": [], "entities": {"persons": [], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "philips", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "European stocks tumbled throughout Tuesday's trade.\nThe pan-European Stoxx 600 closed 0.78 percent lower with all major bourses and most sectors in negative territory.\nSymbol Name Price Change %Change Volume FTSE --- DAX --- CAC --- IBEX 35 --- Basic resources stocks led the losses, down more than 1.5 percent amid a potential power crisis in China. The country's second-largest province has asked coal miners to shorten or cancel staff holidays during upcoming Spring Festival celebrations in order to ease growing concerns of higher-than-usual heating demand, Reuters reported. Anglo American , Tullow Oil and BHP Billiton were all trading lower on the news .\nAutos, banks, oil and gas and telecoms also ended the day over 1 percent in the red. Just the food and beverages and household goods sectors managed a positive close although they still remained close to the flat line, both up 0.07 percent.\nLooking at individual stocks, Loomis slipped to near the bottom of the European benchmark on Tuesday after weaker-than-anticipated earnings. The Swedish cash handler reported organic growth was below expectations in the final three months of 2017. Its shares dropped throughout the day, ending trading over 7.5 percent lower.\nSwiss watchmaker Swatch topped the Stoxx 600, closing up over 5 percent. The company posted a 28 percent rise in its 2017 profit and forecast positive growth for the coming year.\nMeanwhile, Siemens Gamesa said Tuesday it had posted a first-quarter net loss of 35 million euros ($43.4 million) as a result of integration and restructuring costs. The wind-turbine maker forecast sales would stabilize in the Indian market in 2018, sending its stock to near the top of the benchmark. Some gains pared back in afternoon trade, with the company closing up 3.8 percent.\nFellow turbine-maker Vestas Wind also performed well, closing near the top of Stoxx 600 at just over 4 percent to the upside.\nApple sell-off Mirroring stocks in Europe, U.S. markets traded sharply lower on Tuesday. They had fallen for a second day as the first major sell-off of 2018 rumbled on. The Dow Jones industrial average briefly dropped 352 points, while the S&P 500 declined 0.8 percent.\nApple shares also impacted the slide. Ahead of an earnings update on Thursday, the tech giant is reportedly expected to halve its iPhone X production target for the first three months of the year to around 20 million units.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.", "external_links": [], "published": "2018-01-30T08:41:00.000+02:00", "crawled": "2018-01-30T09:22:56.020+02:00", "highlightTitle": ""}