{"organizations": [], "uuid": "ec60129b1986324230f38f7b9bbd28cf5709dc05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/24/reuters-america-update-6-brent-crude-dips-after-surprise-rise-in-u-s-inventories.html", "country": "US", "domain_rank": 767, "title": "UPDATE 6-Brent crude dips after surprise rise in U.S. inventories", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T15:45:00.000+02:00", "replies_count": 0, "uuid": "ec60129b1986324230f38f7b9bbd28cf5709dc05"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/24/reuters-america-update-6-brent-crude-dips-after-surprise-rise-in-u-s-inventories.html", "ord_in_thread": 0, "title": "UPDATE 6-Brent crude dips after surprise rise in U.S. inventories", "locations": [], "entities": {"persons": [{"name": "ole hansen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "american petroleum institute", "sentiment": "none"}, {"name": "saxo bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* U.S. crude, gasoline inventories climb -API\n* Traders take put options to sell crude\n* Production cuts and world growth offer support (Updates with comment, refreshes prices)\nLONDON, Jan 24 (Reuters) - Benchmark Brent crude oil prices eased on Wednesday, pressured by a rise in U.S. crude and gasoline inventories, but remained close to three-year highs.\nBrent futures fell 10 cents to $69.86 a barrel by 1330 GMT, having climbed above $70 this month for first time since 2014. U.S. West Texas Intermediate (WTI) futures were up 17 cents at $64.64.\nThe American Petroleum Institute said on Tuesday that crude inventories rose by 4.8 million barrels in the latest week, compared with expectations for a decline of 1.6 million barrels. Gasoline inventories also rose.\nOfficial U.S. government inventory data is due out later on Wednesday.\n\"The market has rallied by 50 percent and a lot of investors have been involved for a long time,\" said Saxo Bank senior manager Ole Hansen.\n\"At what level would we start to attract some nervousness on the downside? We probably need to break below $60 on WTI to put the cat among the pigeons ... It's going to take more than just a stock-build today to change that equation.\"\nMoney managers hold more bullish positions in crude futures and options than at any time on record, which has been encouraged by falling global inventories after production cuts by the Organization of the Petroleum Exporting Countries, Russia and others.\nSome traders, however, are showing signs of seeking protection against a fall in prices. Trading data shows open interest for Brent put options for selling at $70, $69 and $68 a barrel has climbed since the middle of last week.\nSukrit Vijayakar, of energy consultancy Trifecta, said the rising sell options are a result of huge amounts of long positions built up in previous months.\n\"We still have ... nine long barrels for every short barrel, so a reversal should be interesting to watch,\" he said.\nHowever, traders said oil prices are unlikely to fall far because markets are being supported by strong global economic growth pushing up oil demand and output restraint by the OPEC-led supply pact.\nThe deal to withhold output started in January last year and is currently set to last through 2018.\nAdding a layer of support to U.S. oil prices was a 0.7 percent drop in the U.S. dollar after Treasury Secretary Steven Mnuchin's comments that a weaker currency was positive for American trade.\nTypically, a weaker U.S. currency will encourage non-U.S. investors to buy oil and other dollar-denominated commodities.\n\"Cross-asset correlations have increased and that means a return to watching the intra-day movements in the dollar and the stock market - a trading practice that had mostly disappeared over the last two years,\" Petromatrix strategist Olivier Jakob said in a note.\n(Additional reporting by Henning Gloystein; Editing by Edmund Blair and David Goodman)", "external_links": [], "published": "2018-01-24T15:45:00.000+02:00", "crawled": "2018-01-24T17:58:23.006+02:00", "highlightTitle": ""}