{"organizations": [], "uuid": "3c8f2458411c17212e7c5a7c64a271e805fabbd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-summit-financial-group-reports-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Summit Financial Group Reports Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.86, "site_type": "news", "published": "2018-01-26T14:00:00.000+02:00", "replies_count": 0, "uuid": "3c8f2458411c17212e7c5a7c64a271e805fabbd4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-summit-financial-group-reports-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Summit Financial Group Reports Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "w. va.", "sentiment": "none"}], "organizations": [{"name": "summit financial group", "sentiment": "negative"}, {"name": "summit financial group, inc.", "sentiment": "neutral"}, {"name": "tcja", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOOREFIELD, W. Va., Jan. 26, 2018 (GLOBE NEWSWIRE) -- Summit Financial Group, Inc. (“Company” or “Summit”) (NASDAQ:SMMF) today reported fourth quarter 2017 net income of $2.32 million, or $0.19 per diluted share. In comparison, earnings for third quarter 2017 were $5.93 million, or $0.48 per diluted share, and for fourth quarter 2016 were $4.71 million, or $0.44 per diluted share. Earnings per diluted share for fourth quarter 2017 were negatively impacted (on an after-tax basis) by the one-time charge of $0.28 to re-measure the Company’s net deferred tax assets as result of enactment of the Tax Cuts and Jobs Act (“TCJA”).\nFor the full year, Summit recorded net income of $11.92 million, or $1.00 per diluted share, for 2017 compared with $17.30 million, or $1.61 per diluted share, for 2016. Earnings per diluted share for the full year of 2017 were negatively impacted (on an after-tax basis) by the following non-core or one-time items: $0.52 as result of a litigation settlement, $0.29 due to the enactment of the TCJA, and $0.08 as result of merger-related expenses.\nHighlights for Q4 2017 include:\nRecorded a $3.5 million charge to income tax expense to re-measure net deferred tax assets at the lower corporate federal income tax rate due to enactment of the TCJA;\nLoans, excluding mortgage warehouse lines of credit, grew $37.3 million during the quarter, or 9.7 percent (on an annualized basis); excluding mortgage warehouse lines of credit and First Century Bankshares, Inc.’s (“FCB”) purchased loan portfolio, loans grew $113.0 million, or 9.2 percent, since year-end 2016;\nTotal revenues increased 0.6 percent compared to the linked-quarter and increased 29.9 percent compared to the year ago quarter, principally as result of the acquisitions of FCB and Highland County Bankshares, Inc. (“HCB”);\nNet interest margin was unchanged compared to Q3 2017, but increased 31 basis points compared to Q4 2016, reflecting FCB’s higher yielding loan portfolio and lower cost of funds as well as the positive impact from FOMC rate increases during 2017;\nEfficiency ratio improved to 51.47 percent compared to 53.73 percent for Q3 2017 and 56.67 percent for Q4 2016, as result of the improved net interest margin and well-controlled overhead;\nProvision for loan losses remained unchanged from the linked quarter at $375,000, compared to no provision for the year-ago quarter;\nRealized securities losses of $71,000 in Q4 2017 compared to realized securities gains of $291,000 in the year-ago quarter;\nWrite-downs of foreclosed properties were $347,000 in Q4 2017 compared to $165,000 in Q4 2016, while gains on sales of foreclosed properties declined from $465,000 in Q4 2016 to $46,000 in Q4 2017;\nNonperforming assets as a percentage of total assets declined to 1.73 percent compared to 1.84 percent for the linked quarter and to 2.22 percent a year-ago, reaching its lowest level since Q2 2008.\nH. Charles Maddy, III, President and Chief Executive Officer of Summit, commented, “Despite the noise in this past quarter’s earnings as result of enactment of Tax Reform legislation, I was very pleased by our Q4 2017 core operating performance – the net interest margin remained stable, loan growth was strong and the efficiency ratio improved markedly. Furthermore, these results combined with our proven ability in 2017 to successfully execute on a disciplined M&A growth strategy gives us optimism as we look forward to 2018 and beyond.”\nAcquisitions\nOn April 1, 2017, Summit completed its acquisition of FCB and its subsidiary, First Century Bank, headquartered in Bluefield, West Virginia. Accordingly, FCB’s results of operations are included in Summit’s consolidated results of operation from the date of acquisition, and therefore Summit’s results for the three months and year ended December 31, 2017 reflect increased levels of average balances, income and expense compared to its same periods of 2016 results. At consummation, FCB had total assets of $404.8 million, loans of $229.0 million, and deposits of $350.0 million. In addition, our merger-related expenses totaled $1.59 million during 2017, with $1.46 million of those expenses incurred during second quarter 2017.\nOn October 1, 2016, Summit completed its acquisition of HCB and its subsidiary, First & Citizens Bank, headquartered in Monterey, Virginia. Accordingly, HCB’s results of operations are included in Summit’s consolidated results of operation from the date of acquisition, and therefore Summit’s results for the year ended December 31, 2017 reflect increased levels of average balances, income and expense as compared to 2016 results. At consummation, HCB had total assets of $122.8 million, loans of $60.8 million, and deposits of $106.9 million.\nIn conjunction with these acquisitions, Summit recognized net accretion income related to loan and time deposit fair value acquisition accounting adjustments totaling $113,000 and $70,000 in Q4 2017 and $825,000 and $237,000 for the year ended December 31, 2017, respectively.\nResults of Operations\nTotal revenue for fourth quarter 2017, consisting of net interest income and noninterest income, grew 29.9 percent to $21.4 million, principally as result of the FCB acquisition, compared to $16.5 million for the fourth quarter 2016. For the year-to-date period ended December 31, 2017, total revenue was $80.6 million compared to $60.6 million for the same period of 2016, representing a 32.9 percent increase.\nFor the fourth quarter of 2017, net interest income was $17.4 million, an increase of 29.6 percent from the $13.5 million reported in the prior-year fourth quarter and increased $206,000 compared to the linked-quarter. The net interest margin for fourth quarter 2017 was 3.65 percent compared to 3.34 percent for the year-ago quarter, and 3.65 percent for Q3 2017. Excluding the impact of accretion and amortization of fair value acquisition accounting adjustments related to the interest earning assets and interest bearing liabilities acquired from FCB and HCB, Summit’s net interest margin was 3.60 percent for Q4 2017 and 3.61 percent for full year 2017.\nNoninterest income, consisting primarily of insurance commissions from Summit's insurance agency subsidiary, trust and wealth management fees and service fee income from community banking activities, for fourth quarter 2017 was $3.93 million compared to $3.00 million for the comparable period of 2016. Excluding realized securities gains and losses, noninterest income was $4.00 million for fourth quarter 2017, compared to $2.71 million reported for fourth quarter 2016.\nWe recorded a $375,000 provision for loan losses during fourth quarter 2017 and none during fourth quarter 2016.\nQ4 2017 total noninterest expense increased 31.5 percent to $12.35 million compared to $9.39 million for the prior-year fourth quarter principally due to the acquisition of FCB. Noninterest expense for full-year 2017 increased 65.9 percent compared to 2016. Summit recorded a $9.9 million charge to resolve fully all litigation with Residential Funding Company, LLC and ResCap Liquidating Trust (collectively “ResCap”) during Q1 2017. Excluding the impact of the ResCap litigation settlement charge, noninterest expense for 2017 increased 37.5 percent to $47.8 million compared to $34.8 million for 2016, principally as result of the acquisitions of HCB and FCB.\nBalance Sheet\nAt December 31, 2017, total assets were $2.13 billion, an increase of $375.6 million, or 21.4 percent since December 31, 2016. Total loans, net of unearned fees and allowance for loan losses, were $1.59 billion at December 31, 2017, up $285.9 million, or 21.9 percent, from the $1.31 billion reported at year-end 2016. Loans, excluding mortgage warehouse lines of credit, grew $37.3 million during the quarter, or 9.7 percent (on an annualized basis), and loans, excluding mortgage warehouse lines of credit and FCB’s purchased loan portfolio, have grown $113.0 million, or 9.2 percent year-to-date.\nAt December 31, 2017, deposits were $1.60 billion, an increase of $305.1 million, or 23.5 percent, since year end 2016. During 2017, checking deposits increased $215.8 million or 52.3 percent, time deposits grew by $68.5 million or 12.5 percent and savings deposits increased $20.8 million or 6.2 percent.\nShareholders’ equity was $201.5 million as of December 31, 2017 compared to $155.4 million at December 31, 2016. In conjunction with the acquisition of FCB on April 1, 2017, Summit issued 1,537,912 shares of common stock valued at $33.1 million to the former FCB shareholders.\nTangible book value per common share increased to $14.08 at December 31, 2017 compared to $13.20 at December 31, 2016. Summit had 12,358,562 outstanding common shares at year end 2017 compared to 10,736,970 at year end 2016.\nAsset Quality\nAs of December 31, 2017, nonperforming assets (“NPAs”), consisting of nonperforming loans, foreclosed properties, and repossessed assets, were $36.9 million, or 1.73 percent of assets. This compares to $38.7 million, or 1.84 percent of assets at the linked quarter-end, and $39.1 million, or 2.22 percent of assets, at year end 2016.\nFourth quarter 2017 net loan charge-offs were $274,000, or 0.07 percent of average loans annualized; while we added $375,000 to the allowance for loan losses through the provision for loan losses. The allowance for loan losses stood at 0.78 percent of total loans at December 31, 2017, compared to 0.88 percent at year-end 2016. If the acquired FCB and HCB loans which were recorded at fair value on the acquisition dates are excluded, the allowance for loan losses to total loans ratio at December 31, 2017 and December 31, 2016 would have been 0.91 percent and 0.92 percent, respectively.\nAbout the Company\nSummit Financial Group, Inc. is a $2.13 billion financial holding company headquartered in Moorefield, West Virginia. Summit provides community banking services primarily in the Eastern Panhandle and Southern regions of West Virginia and the Northern, Shenandoah Valley and Southwestern regions of Virginia, through its bank subsidiary, Summit Community Bank, Inc., which operates thirty banking locations. Summit also operates Summit Insurance Services, LLC in Moorefield, West Virginia and Leesburg, Virginia.\nFORWARD-LOOKING STATEMENTS\nThis press release contains comments or information that constitute forward-looking statements (within the meaning of the Private Securities Litigation Act of 1995) that are based on current expectations that involve a number of risks and uncertainties. Words such as “expects”, “anticipates”, “believes”, “estimates” and other similar expressions or future or conditional verbs such as “will”, “should”, “would” and “could” are intended to identify such forward-looking statements.\nAlthough we believe the expectations reflected in such forward-looking statements are reasonable, actual results may differ materially. Factors that might cause such a difference include changes in interest rates and interest rate relationships; demand for products and services; the degree of competition by traditional and non-traditional competitors; changes in banking laws and regulations; changes in tax laws; the impact of technological advances; the outcomes of contingencies; trends in customer behavior as well as their ability to repay loans; and changes in the national and local economies. We undertake no obligation to revise these statements following the date of this press release.\nSUMMIT FINANCIAL GROUP, INC. (NASDAQ: SMMF) Quarterly Performance Summary -- Q4 2017 vs Q4 2016 For the Quarter Ended Percent Dollars in thousands 12/31/2017 12/31/2016 Change Condensed Statements of Income Interest income Loans, including fees $ 20,031 $ 15,780 26.9 % Securities 2,412 1,796 34.3 % Other 144 161 -10.6 % Total interest income 22,587 17,737 27.3 % Interest expense Deposits 3,224 2,430 32.7 % Borrowings 1,925 1,850 4.1 % Total interest expense 5,149 4,280 20.3 % Net interest income 17,438 13,457 29.6 % Provision for loan losses 375 - n/a Net interest income after provision for loan losses 17,063 13,457 26.8 % Noninterest income Insurance commissions 1,005 992 1.3 % Trust and wealth management fees 578 91 535.2 % Service fees related to deposit accounts 1,906 1,194 59.6 % Realized securities (losses) gains (71 ) 291 -124.4 % Other income 513 430 19.3 % Total noninterest income 3,931 2,998 31.1 % Noninterest expense Salaries and employee benefits 6,520 5,308 22.8 % Net occupancy expense 772 522 47.9 % Equipment expense 1,095 700 56.4 % Professional fees 355 344 3.2 % Amortization of intangibles 435 97 348.5 % FDIC premiums 250 75 233.3 % Merger-related expense 14 588 -97.6 % Foreclosed properties expense 215 97 121.6 % Gain on sales of foreclosed properties (46 ) (465 ) -90.1 % Write-downs of foreclosed properties 347 165 110.3 % Other expenses 2,389 1,961 21.8 % Total noninterest expense 12,346 9,392 31.5 % Income before income taxes 8,648 7,063 22.4 % Income taxes 6,325 2,353 168.8 % Net income $ 2,323 $ 4,710 -50.7 %\nSUMMIT FINANCIAL GROUP, INC. (NASDAQ: SMMF) Quarterly Performance Summary -- Q4 2017 vs Q4 2016 For the Quarter Ended Percent 12/31/2017 12/31/2016 Change Per Share Data Earnings per common share Basic $ 0.19 $ 0.44 -56.8 % Diluted $ 0.19 $ 0.44 -56.8 % Cash dividends $ 0.11 $ 0.10 10.0 % Average common shares outstanding Basic 12,325,067 10,710,164 15.1 % Diluted 12,371,507 10,762,445 15.0 % Common shares outstanding at period end 12,358,562 10,736,970 15.1 % Performance Ratios Return on average equity 4.62 % 12.22 % -62.2 % Return on average tangible equity 5.36 % 13.42 % -60.1 % Return on average assets 0.44 % 1.07 % -58.9 % Net interest margin 3.65 % 3.34 % 9.3 % Efficiency ratio (A) 51.47 % 56.67 % -9.2 %\nNOTE (A) – Computed on a tax equivalent basis excluding non-core or nonrecurring income and expense items and amortization of intangibles.\nSUMMIT FINANCIAL GROUP, INC. (NASDAQ: SMMF) Annual Performance Summary -- 2017 vs 2016 For the Year Ended Percent Dollars in thousands 12/31/2017 12/31/2016 Change Condensed Statements of Income Interest income Loans, including fees $ 74,908 $ 56,980 31.5 % Securities 9,010 6,938 29.9 % Other 609 173 252.0 % Total interest income 84,527 64,091 31.9 % Interest expense Deposits 11,210 8,964 25.1 % Borrowings 7,170 6,120 17.2 % Total interest expense 18,380 15,084 21.9 % Net interest income 66,147 49,007 35.0 % Provision for loan losses 1,250 500 150.0 % Net interest income after provision for loan losses 64,897 48,507 33.8 % Noninterest income Insurance commissions 4,005 4,022 -0.4 % Trust and wealth management fees 1,863 449 314.9 % Service fees related to deposit accounts 6,643 4,370 52.0 % Realized securities (losses) gains (14 ) 1,127 -101.2 % Other income 1,930 1,632 18.3 % Total noninterest income 14,427 11,600 24.4 % Noninterest expense Salaries and employee benefits 25,075 19,573 28.1 % Net occupancy expense 3,011 2,098 43.5 % Equipment expense 3,954 2,759 43.3 % Professional fees 1,367 1,515 -9.8 % Amortization of intangibles 1,410 247 470.9 % FDIC premiums 1,065 875 21.7 % Merger-related expense 1,589 933 70.3 % Foreclosed properties expense 611 414 47.6 % Gain on sales of foreclosed properties (157 ) (916 ) -82.9 % Write-downs of foreclosed properties 885 668 32.5 % Litigation settlement 9,900 - n/a Other expenses 9,035 6,636 36.2 % Total noninterest expense 57,745 34,802 65.9 % Income before income taxes 21,579 25,305 -14.7 % Income taxes 9,664 8,008 20.7 % Net income $ 11,915 $ 17,297 -31.1 %\nSUMMIT FINANCIAL GROUP, INC. (NASDAQ: SMMF) Annual Performance Summary -- 2017 vs 2016 For the Year Ended Percent 12/31/2017 12/31/2016 Change Per Share Data Earnings per common share Basic $ 1.00 $ 1.62 -38.3 % Diluted $ 1.00 $ 1.61 -37.9 % Cash dividends $ 0.44 $ 0.40 10.0 % Average common shares outstanding Basic 11,918,390 10,689,224 11.5 % Diluted 11,949,245 10,716,871 11.5 % Common shares outstanding at period end 12,358,562 10,736,970 15.1 % Performance Ratios Return on average equity 6.40 % 11.53 % -44.5 % Return on average tangible equity 7.35 % 12.27 % -40.1 % Return on average assets 0.59 % 1.08 % -45.4 % Net interest margin 3.67 % 3.39 % 8.3 % Efficiency ratio (A) 52.41 % 55.34 % -5.3 %\nNOTE (A) – Computed on a tax equivalent basis excluding non-core or nonrecurring income and expense items and amortization of intangibles.\nSUMMIT FINANCIAL GROUP, INC. (NASDAQ: SMMF) Five Quarter Performance Summary For the Quarter Ended Dollars in thousands 12/31/2017 9/30/2017 6/30/2017 3/31/2017 12/31/2016 Condensed Statements of Income (unaudited) Interest income Loans, including fees $ 20,031 $ 19,490 $ 19,717 $ 15,671 $ 15,780 Securities 2,412 2,397 2,349 1,851 1,796 Other 144 149 165 152 161 Total interest income 22,587 22,036 22,231 17,674 17,737 Interest expense Deposits 3,224 2,963 2,634 2,390 2,430 Borrowings 1,925 1,841 1,749 1,654 1,850 Total interest expense 5,149 4,804 4,383 4,044 4,280 Net interest income 17,438 17,232 17,848 13,630 13,457 Provision for loan losses 375 375 250 250 - Net interest income after provision for loan losses 17,063 16,857 17,598 13,380 13,457 Noninterest income Insurance commissions 1,005 1,043 988 968 992 Trust and wealth management fees 578 589 595 100 91 Service fees related to deposit accounts 1,906 1,863 1,706 1,168 1,194 Realized securities gains (losses) (71 ) 26 90 (58 ) 291 Other income 513 479 537 401 430 Total noninterest income 3,931 4,000 3,916 2,579 2,998 Noninterest expense Salaries and employee benefits 6,520 6,610 6,758 5,187 5,308 Net occupancy expense 772 847 826 567 522 Equipment expense 1,095 1,093 1,031 735 700 Professional fees 355 373 354 285 344 Amortization of intangibles 435 448 429 97 97 FDIC premiums 250 310 295 210 75 Merger-related expense 14 11 1,455 109 588 Foreclosed properties expense 215 171 122 104 97 (Gain) loss on sales of foreclosed properties (46 ) (29 ) 73 (156 ) (465 ) Write-downs of foreclosed properties 347 91 29 418 165 Litigation settlement - - - 9,900 - Other expenses 2,389 2,522 2,564 1,560 1,961 Total noninterest expense 12,346 12,447 13,936 19,016 9,392 Income (loss) before income taxes 8,648 8,410 7,578 (3,057 ) 7,063 Income tax expense (benefit) 6,325 2,480 2,300 (1,441 ) 2,353 Net income (loss) $ 2,323 $ 5,930 $ 5,278 $ (1,616 ) $ 4,710\nSUMMIT FINANCIAL GROUP, INC. (NASDAQ: SMMF) Five Quarter Performance Summary For the Quarter Ended 12/31/2017 9/30/2017 6/30/2017 3/31/2017 12/31/2016 Per Share Data Earnings per common share Basic $ 0.19 $ 0.48 $ 0.43 $ (0.15 ) $ 0.44 Diluted $ 0.19 $ 0.48 $ 0.43 $ (0.15 ) $ 0.44 Cash dividends $ 0.11 $ 0.11 $ 0.11 $ 0.11 $ 0.10 Average common shares outstanding Basic 12,325,067 12,299,987 12,288,514 10,738,365 10,710,164 Diluted 12,371,507 12,318,959 12,299,187 10,738,365 10,762,445 Common shares outstanding at period end 12,358,562 12,311,723 12,299,726 10,750,477 10,736,970 Performance Ratios Return on average equity 4.62 % 12.10 % 11.10 % -4.11 % 12.22 % Return on average tangible equity 5.36 % 14.12 % 12.95 % -4.51 % 13.42 % Return on average assets 0.44 % 1.14 % 1.01 % -0.37 % 1.07 % Net interest margin 3.65 % 3.65 % 3.81 % 3.54 % 3.34 % Efficiency ratio (A) 51.47 % 53.73 % 53.00 % 51.16 % 56.67 %\nNOTE (A) – Computed on a tax equivalent basis excluding non-core or nonrecurring income and expense items and amortization of intangibles.\nSUMMIT FINANCIAL GROUP, INC. (NASDAQ: SMMF) Selected Balance Sheet Data (unaudited) Dollars in thousands, except per share amounts 12/31/2017 9/30/2017 6/30/2017 3/31/2017 12/31/2016 Assets Cash and due from banks $ 9,641 $ 9,220 $ 9,294 $ 19,326 $ 4,262 Interest bearing deposits other banks 42,990 41,994 44,242 38,895 42,354 Securities 328,723 328,726 336,811 282,028 266,542 Loans, net 1,593,744 1,559,328 1,538,083 1,292,915 1,307,862 Property held for sale 21,470 22,622 23,592 23,491 24,504 Premises and equipment, net 34,209 34,220 33,234 26,377 23,737 Goodwill and other intangible assets 27,513 27,879 28,214 13,587 13,652 Cash surrender value of life insurance policies 41,358 41,076 41,189 39,412 39,143 Other assets 34,592 36,071 40,641 40,411 36,591 Total assets $ 2,134,240 $ 2,101,136 $ 2,095,300 $ 1,776,442 $ 1,758,647 Liabilities and Shareholders' Equity Deposits $ 1,600,601 $ 1,616,768 $ 1,613,919 $ 1,301,241 $ 1,295,519 Short-term borrowings 250,499 202,988 205,728 228,868 224,461 Long-term borrowings and subordinated debentures 65,340 65,344 65,348 65,804 66,259 Other liabilities 16,295 17,254 17,173 26,910 17,048 Shareholders' equity 201,505 198,782 193,132 153,619 155,360 Total liabilities and shareholders' equity $ 2,134,240 $ 2,101,136 $ 2,095,300 $ 1,776,442 $ 1,758,647 Book value per common share $ 16.30 $ 16.15 $ 15.70 $ 14.29 $ 14.47 Tangible book value per common share $ 14.08 $ 13.88 $ 13.41 $ 13.03 $ 13.20 Tangible common equity to tangible assets 8.3 % 8.2 % 8.0 % 7.9 % 8.1 %\nSUMMIT FINANCIAL GROUP INC. (NASDAQ: SMMF) Regulatory Capital Ratios 12/31/2017 9/30/2017 6/30/2017 3/31/2017 12/31/2016 Summit Financial Group, Inc. CET1 Risk-based Capital 10.6 % 10.8 % 10.5 % 10.3 % 10.5 % Tier 1 Risk-based Capital 11.8 % 11.9 % 11.7 % 11.5 % 11.8 % Total Risk-based Capital 12.5 % 12.7 % 12.4 % 12.3 % 12.6 % Tier 1 Leverage Ratio 9.4 % 9.5 % 9.2 % 9.4 % 9.4 % Summit Community Bank, Inc. CET1 Risk-based Capital 11.7 % 11.8 % 11.6 % 11.6 % 11.9 % Tier 1 Risk-based Capital 11.7 % 11.8 % 11.6 % 11.6 % 11.9 % Total Risk-based Capital 12.5 % 12.6 % 12.4 % 12.4 % 12.7 % Tier 1 Leverage Ratio 9.4 % 9.4 % 9.2 % 9.4 % 9.5 %\nSUMMIT FINANCIAL GROUP INC. (NASDAQ: SMMF) Loan Composition Dollars in thousands 12/31/2017 9/30/2017 6/30/2017 3/31/2017 12/31/2016 Commercial $ 189,981 $ 187,193 $ 176,362 $ 134,808 $ 119,088 Mortgage warehouse lines 30,757 33,525 35,068 30,217 85,966 Commercial real estate Owner occupied 250,202 239,840 239,108 217,733 203,047 Non-owner occupied 484,902 464,543 455,439 401,795 381,921 Construction and development Land and development 67,219 71,412 74,155 68,079 72,042 Construction 33,412 28,756 22,967 16,511 16,584 Residential real estate Non-jumbo 354,101 355,642 355,546 266,140 265,641 Jumbo 62,267 61,253 63,899 60,780 65,628 Home equity 84,028 82,720 81,192 75,299 74,596 Consumer 36,202 36,915 37,630 24,440 25,534 Other 13,238 9,994 9,049 8,831 9,489 Total loans, net of unearned fees 1,606,309 1,571,793 1,550,415 1,304,633 1,319,536 Less allowance for loan losses 12,565 12,465 12,332 11,718 11,674 Loans, net $ 1,593,744 $ 1,559,328 $ 1,538,083 $ 1,292,915 $ 1,307,862\nSUMMIT FINANCIAL GROUP INC. (NASDAQ: SMMF) Deposit Composition Dollars in thousands 12/31/2017 9/30/2017 6/30/2017 3/31/2017 12/31/2016 Non-interest bearing checking $ 217,493 $ 215,910 $ 234,173 $ 152,086 $ 149,737 Interest bearing checking 410,606 397,843 372,327 275,678 262,591 Savings 358,168 362,653 373,439 342,548 337,348 Time deposits 614,334 640,362 633,980 530,929 545,843 Total deposits $ 1,600,601 $ 1,616,768 $ 1,613,919 $ 1,301,241 $ 1,295,519\nSUMMIT FINANCIAL GROUP, INC. (NASDAQ: SMMF) Asset Quality Information For the Quarter Ended Dollars in thousands 12/31/2017 9/30/2017 6/30/2017 3/31/2017 12/31/2016 Gross loan charge-offs $ 550 $ 309 $ 114 $ 315 $ 400 Gross loan recoveries (276 ) (67 ) (478 ) (108 ) (456 ) Net loan charge-offs (recoveries) $ 274 $ 242 $ (364 ) $ 207 $ (56 ) Net loan charge-offs to average loans (annualized) 0.07 % 0.06 % -0.09 % 0.06 % -0.02 % Allowance for loan losses $ 12,565 $ 12,465 $ 12,332 $ 11,718 $ 11,674 Allowance for loan losses as a percentage of period end loans 0.78 % 0.79 % 0.79 % 0.90 % 0.88 % Nonperforming assets: Nonperforming loans Commercial $ 696 $ 757 $ 786 $ 226 $ 298 Commercial real estate 3,164 2,773 2,051 4,734 4,844 Residential construction and development 3,569 3,931 3,613 3,936 4,465 Residential real estate 7,656 8,082 6,860 5,886 4,815 Consumer 238 529 391 162 152 Total nonperforming loans 15,323 16,072 13,701 14,944 14,574 Foreclosed properties Commercial real estate 1,789 1,988 2,126 1,749 1,749 Commercial construction and development 7,392 7,392 7,527 8,276 8,610 Residential construction and development 11,182 11,852 12,402 12,635 13,265 Residential real estate 1,107 1,390 1,537 831 880 Total foreclosed properties 21,470 22,622 23,592 23,491 24,504 Other repossessed assets 68 12 57 12 12 Total nonperforming assets $ 36,861 $ 38,706 $ 37,350 $ 38,447 $ 39,090 Nonperforming loans to period end loans 0.95 % 1.02 % 0.88 % 1.15 % 1.10 % Nonperforming assets to period end assets 1.73 % 1.84 % 1.78 % 2.16 % 2.22 % Troubled debt restructurings Performing $ 28,347 $ 28,304 $ 26,472 $ 28,183 $ 28,066 Nonperforming 26 760 464 719 564 Total troubled debt restructurings $ 28,373 $ 29,064 $ 26,936 $ 28,902 $ 28,630\nLoans Past Due 30-89 Days For the Quarter Ended Dollars in thousands 12/31/2017 9/30/2017 6/30/2017 3/31/2017 12/31/2016 Commercial $ 586 $ 378 $ 470 $ 162 $ 175 Commercial real estate 1,082 944 976 2,758 434 Construction and development 1,127 238 308 291 552 Residential real estate 7,236 6,260 6,943 2,924 5,517 Consumer 504 419 548 155 375 Other 38 92 49 17 14 Total $ 10,573 $ 8,331 $ 9,294 $ 6,307 $ 7,067\nSUMMIT FINANCIAL GROUP, INC. (NASDAQ: SMMF) Average Balance Sheet, Interest Earnings & Expenses and Average Rates Q4 2017 vs Q4 2016 Q4 2017 Q4 2016 Average Earnings / Yield / Average Earnings / Yield / Dollars in thousands Balances Expense Rate Balances Expense Rate ASSETS Interest earning assets Loans, net of unearned interest Taxable $ 1,562,978 $ 19,879 5.05 % $ 1,308,418 $ 15,650 4.76 % Tax-exempt 16,902 234 5.49 % 13,845 195 5.60 % Securities Taxable 202,377 1,328 2.60 % 191,951 1,111 2.30 % Tax-exempt 142,641 1,668 4.64 % 89,745 1,039 4.61 % Interest bearing deposits other banks and Federal funds sold 42,021 144 1.36 % 49,341 161 1.30 % Total interest earning assets 1,966,919 23,253 4.69 % 1,653,300 18,156 4.37 % Noninterest earning assets Cash & due from banks 9,753 4,650 Premises & equipment 34,263 23,616 Other assets 111,596 96,165 Allowance for loan losses (12,628 ) (11,905 ) Total assets $ 2,109,903 $ 1,765,826 LIABILITIES AND SHAREHOLDERS' EQUITY Liabilities Interest bearing liabilities Interest bearing demand deposits $ 405,307 $ 447 0.44 % $ 256,307 $ 128 0.20 % Savings deposits 360,630 684 0.75 % 335,658 633 0.75 % Time deposits 629,871 2,093 1.32 % 542,602 1,669 1.22 % Short-term borrowings 220,027 1,240 2.24 % 221,200 954 1.72 % Long-term borrowings and subordinated debentures 65,342 685 4.16 % 85,699 896 4.16 % Total interest bearing liabilities 1,681,177 5,149 1.22 % 1,441,466 4,280 1.18 % Noninterest bearing liabilities Demand deposits 214,624 150,318 Other liabilities 12,886 19,902 Total liabilities 1,908,687 1,611,686 Shareholders' equity 201,216 154,140 Total liabilities and shareholders' equity $ 2,109,903 $ 1,765,826 NET INTEREST EARNINGS $ 18,104 $ 13,876 NET INTEREST MARGIN 3.65 % 3.34 %\nSUMMIT FINANCIAL GROUP, INC. (NASDAQ: SMMF) Average Balance Sheet, Interest Earnings & Expenses and Average Rates Q4 2017 vs Q3 2017 Q4 2017 Q3 2017 Average Earnings / Yield / Average Earnings / Yield / Dollars in thousands Balances Expense Rate Balances Expense Rate ASSETS Interest earning assets Loans, net of unearned interest Taxable $ 1,562,978 $ 19,879 5.05 % $ 1,539,945 $ 19,387 4.99 % Tax-exempt 16,902 234 5.49 % 16,314 158 3.84 % Securities Taxable 202,377 1,328 2.60 % 198,913 1,283 2.56 % Tax-exempt 142,641 1,668 4.64 % 145,599 1,714 4.67 % Interest bearing deposits other banks and Federal funds sold 42,021 144 1.36 % 42,926 149 1.38 % Total interest earning assets 1,966,919 23,253 4.69 % 1,943,697 22,691 4.63 % Noninterest earning assets Cash & due from banks 9,753 9,591 Premises & equipment 34,263 33,667 Other assets 111,596 113,723 Allowance for loan losses (12,628 ) (12,418 ) Total assets $ 2,109,903 $ 2,088,260 LIABILITIES AND SHAREHOLDERS' EQUITY Liabilities Interest bearing liabilities Interest bearing demand deposits $ 405,307 $ 447 0.44 % $ 384,539 $ 323 0.33 % Savings deposits 360,630 684 0.75 % 365,150 637 0.69 % Time deposits 629,871 2,093 1.32 % 636,424 2,003 1.25 % Short-term borrowings 220,027 1,240 2.24 % 205,536 1,160 2.24 % Long-term borrowings and subordinated debentures 65,342 685 4.16 % 65,346 681 4.13 % Total interest bearing liabilities 1,681,177 5,149 1.22 % 1,656,995 4,804 1.15 % Noninterest bearing liabilities Demand deposits 214,624 217,760 Other liabilities 12,886 17,414 Total liabilities 1,908,687 1,892,169 Shareholders' equity 201,216 196,091 Total liabilities and shareholders' equity $ 2,109,903 $ 2,088,260 NET INTEREST EARNINGS $ 18,104 $ 17,887 NET INTEREST MARGIN 3.65 % 3.65 %\nSUMMIT FINANCIAL GROUP, INC. (NASDAQ: SMMF) Average Balance Sheet, Interest Earnings & Expenses and Average Rates YTD 2017 vs YTD 2016 YTD 2017 YTD 2016 Average Earnings / Yield / Average Earnings / Yield / Dollars in thousands Balances Expense Rate Balances Expense Rate ASSETS Interest earning assets Loans, net of unearned interest Taxable $ 1,480,601 $ 74,365 5.02 % $ 1,177,445 $ 56,439 4.79 % Tax-exempt 14,899 835 5.60 % 14,628 820 5.61 % Securities Taxable 200,596 5,071 2.53 % 202,795 4,395 2.17 % Tax-exempt 129,342 6,060 4.69 % 79,571 3,853 4.84 % Interest bearing deposits other banks and Federal funds sold 43,400 609 1.40 % 19,211 173 0.90 % Total interest earning assets 1,868,838 86,940 4.65 % 1,493,650 65,680 4.40 % Noninterest earning assets Cash & due from banks 8,492 3,968 Premises & equipment 31,750 21,858 Other assets 109,456 90,957 Allowance for loan losses (12,196 ) (10,836 ) Total assets $ 2,006,340 $ 1,599,597 LIABILITIES AND SHAREHOLDERS' EQUITY Liabilities Interest bearing liabilities Interest bearing demand deposits $ 358,225 $ 1,169 0.33 % $ 220,708 $ 376 0.17 % Savings deposits 363,949 2,563 0.70 % 306,312 2,296 0.75 % Time deposits 609,156 7,478 1.23 % 491,652 6,292 1.28 % Short-term borrowings 205,743 4,473 2.17 % 190,876 2,288 1.20 % Long-term borrowings and subordinated debentures 65,629 2,697 4.11 % 92,343 3,832 4.15 % 1,602,702 18,380 1.15 % 1,301,891 15,084 1.16 % Noninterest bearing liabilities Demand deposits 200,707 128,894 Other liabilities 16,669 18,795 Total liabilities 1,820,078 1,449,580 Shareholders' equity 186,262 150,017 Total liabilities and shareholders' equity $ 2,006,340 $ 1,599,597 NET INTEREST EARNINGS $ 68,560 $ 50,596 NET INTEREST MARGIN 3.67 % 3.39 %\nContact: Robert S. Tissue, Sr. Vice President & CFO Telephone: (304) 530-0552 Email: rtissue@summitfgi.com\nSource:Summit Financial Group, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/f3ea6281-909a-46d0-9950-ad210cd2162d"], "published": "2018-01-26T14:00:00.000+02:00", "crawled": "2018-01-26T16:55:58.099+02:00", "highlightTitle": ""}