{"organizations": [], "uuid": "cdbbd99b0f6556eb3b97af5d740a47d65e91566a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/eu-tax-vat/eu-expected-to-give-states-more-leeway-to-cut-sales-tax-rates-idUSL8N1PB627", "country": "US", "domain_rank": 408, "title": "EU expected to give states more leeway to cut sales tax rates", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T13:13:00.000+02:00", "replies_count": 0, "uuid": "cdbbd99b0f6556eb3b97af5d740a47d65e91566a"}, "author": "", "url": "https://www.reuters.com/article/eu-tax-vat/eu-expected-to-give-states-more-leeway-to-cut-sales-tax-rates-idUSL8N1PB627", "ord_in_thread": 0, "title": "EU expected to give states more leeway to cut sales tax rates", "locations": [], "entities": {"persons": [{"name": "francesco guarascio", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 11:14 AM / Updated 12 minutes ago EU expected to give states more leeway to cut sales tax rates Reuters Staff \n* EU countries could scrap VAT on several consumer products \n* Would end ban on new VAT-free goods that caused UK uproar \n* Proposal to be published on Thursday \nBy Francesco Guarascio \nBRUSSELS, Jan 17 (Reuters) - European Union states will get more leeway to set lower sales tax rates or even scrap them on some goods, under a draft law seen by Reuters that would reform the EU’s centralised rate-setting mechanism for value-added tax (VAT). \nThe proposal by the European Commission would allow EU states to charge no VAT on a wide variety of items, lifting an existing ban on new VAT-free products that several states have long opposed. \nReduced or zero rates could be applied to all items, except those explicitly excluded. Those excluded range from oil and gas fuel to weapons and from financial services to alcohol and tobacco. \nBut EU states would need to maintain a “weighted average VAT rate” of at least 12 percent and to apply only “a limited number” of reduced rates. \nThe 28 EU countries currently must choose between two VAT rates: at least 5 or 15 percent for goods on sale. Countries that had lower rates before those rules were adopted in the 1990s were allowed to maintain them. \nAs part of a broader overhaul of sales tax rules, the Commission is now proposing that states may use an additional rate “between five and zero percent” - effectively allowing to scrap VAT on some goods. \nBefore the 2016 Brexit referendum, the EU ban on expanding the list of VAT-free goods caused an uproar in Britain for the so-called “tampon tax,” as VAT on female hygiene products could not be cut from its existing 5 percent rate. \nUnder the new proposal, tampons could be exempted from VAT. But if the proposed rules are adopted, they probably won’t be applied before 2022, and Britain is set to leave the EU next year anyway. \nThe requirement for a weighted average of 12 percent is meant to prevent EU states from rushing to set low VAT rates to attract foreign consumers or please voters that could excessively lower public revenues. \nThe Commission also stressed in its proposal that reduced rates should be applied only to goods sold to consumers, not to intermediate products that companies trade between themselves to put together in final consumers goods. \nThe 12 percent threshold should be “flexible” to take into account lower revenues in periods of recession, said Chas Roy-Chowdhury, head of tax at ACCA, a global accounting body. \nThe Commission will publish the proposal on Thursday. It is still subject to change and would need the approval of EU states and lawmakers to become law. (Reporting by Francesco Guarascio, editing by Larry King)", "external_links": [], "published": "2018-01-17T13:13:00.000+02:00", "crawled": "2018-01-17T13:33:42.010+02:00", "highlightTitle": ""}