{"organizations": [], "uuid": "6f2450c79aa225be55119569442bf85e3254c82d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/politics", "section_title": "Politics &amp; Political News | Reuters", "url": "https://www.reuters.com/article/us-usa-congress-shutdown-factbox/factbox-a-look-at-past-u-s-government-shutdowns-idUSKBN1F62PQ", "country": "US", "domain_rank": 408, "title": "Factbox: A look at past U.S. government shutdowns", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T03:54:00.000+02:00", "replies_count": 0, "uuid": "6f2450c79aa225be55119569442bf85e3254c82d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-congress-shutdown-factbox/factbox-a-look-at-past-u-s-government-shutdowns-idUSKBN1F62PQ", "ord_in_thread": 0, "title": "Factbox: A look at past U.S. government shutdowns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Congress was struggling this week to pass another temporary spending bill to avoid a partial U.S. government shutdown, with a Friday night deadline fast approaching. If approved, it would be the fourth since Oct. 1.\nWhile temporary spending bills are common, shutdowns are rare. Previous ones have done little lasting economic damage, although they have hurt federal workers, rattled markets and shaken confidence around the world in the United States.\nSince Congress implemented the modern budget process in the mid-1970s, there have been 18 gaps in government funding, according to the Congressional Research Service (CRS).\nNot all of these resulted in government shutdowns. In fact, only three of them had a significant impact.\nDuring six funding gaps before 1980, the government continued normal operations. There were nine funding gaps between 1981 and 1994, but they occurred over weekends with minimal government disruption, according to the Committee for a Responsible Federal Budget, a Washington think tank.\nHere are the three occasions when funding lapsed and significant shutdowns occurred.\n*Nov. 14 to 18, 1995: This was the first of two shutdowns after Democratic President Bill Clinton vetoed spending legislation passed by the Republican-controlled Congress. About 800,000 workers were furloughed from Nov. 15 to 19 during the first lapse in government funding, according to a CRS report.\n*Dec. 16, 1995 to Jan. 5, 1996: This one resulted from Clinton’s clash with congressional Republicans over funding the Medicare health insurance program for the elderly. About 280,000 workers were furloughed for 27 days beginning on Dec. 16, 1995.\n*Oct. 1 to 16, 2013: About 800,000 federal workers were furloughed, and more than 1 million more reported to work without knowing when they would be paid, according to media reports.\nThe shutdown occurred after conservative House of Representatives Republicans attempted to use the budget process to delay or defund implementation of Democratic President Barack Obama’s Affordable Care Act, known as Obamacare.\nThe impasse between the House and the Democratic-controlled Senate, along with Obama, ended after both chambers passed a Senate-brokered bill to impose stricter income verification requirements on people getting Obamacare health insurance.\nThe deal to end the shutdown coincided with a deadline to raise the U.S. debt ceiling, the country’s borrowing limit.\nCompiled by Amanda Becker; Additional reporting by Blake Brittain; Editing by Will Dunham, Kevin Drawbaugh and Cynthia Osterman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T03:54:00.000+02:00", "crawled": "2018-01-18T01:05:34.007+02:00", "highlightTitle": ""}