{"organizations": [], "uuid": "a7988783fe5c7b7c9c61de0c906475b8bdf37eb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/09/16/102006707-IMG_3096.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/02/there-is-a-high-probability-for-a-dow-fall-in-2018--commentary.html", "country": "US", "domain_rank": 767, "title": "There is a high probability for a Dow fall in 2018 - commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T08:07:00.000+02:00", "replies_count": 0, "uuid": "a7988783fe5c7b7c9c61de0c906475b8bdf37eb7"}, "author": "Daryl Guppy", "url": "https://www.cnbc.com/2018/01/02/there-is-a-high-probability-for-a-dow-fall-in-2018--commentary.html", "ord_in_thread": 0, "title": "There is a high probability for a Dow fall in 2018 - commentary", "locations": [], "entities": {"persons": [{"name": "scott mlyn", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Throughout 2017, many observers were terrified the Dow was going to collapse. There was nothing in chart behavior that suggested this was going to happen and those who applied sound technical analysis were rewarded with an 24 percent return for 2017.\nMichael Nagle | Bloomberg | Getty Images A year on and investors want to know if this apparently unstoppable trend is at risk for 2018. Chart analysis assists with developing an answer.\nThe first observation is that a retracement in the Dow is a high probability. A retracement is when the market diverges significantly from the underlying trend and then falls, or retraces, to the underlying trend line. If the divergence between the current high and the underlying trend is very large then it could lead to a bubble collapse. The Dow is not in a bubble. But without, a retracement, a bubble could develop.\nThe value of the underlying trend line which started in 2016, February is currently near 22,900. A retracement to this level would be uncomfortable for investors, but a rebound from the trend-line support level is a buying signal for a continuation of the long-term uptrend.\nA retracement is a drop of less than 10 percent from the index high. A fall of more than 10 percent is a signal for a trend change.\nThis is a problem for the Dow trading near 24,800. A 10 percent fall takes the Dow to 22,320 and this is well below the current trend-line support value near 22,900. Additionally the 22,320 level is not associated with any historical support level. A fall below 22,900 finds the next strong historical support level near 20,400.\nInvestors will be alert for a market retracement dip to the value of the long-term uptrend line. A strong rebound from the trend line is a buying signal. U.S. tax payments for 2017 are due by April 15 and with the new lower tax rates passed in the U.S. last year, April may see a retracement dip.\nInvestors remain alert for the redevelopment of end of uptrend patterns. These include a rounding top, or a head-and-shoulder pattern. Currently there are no signs that either of these patterns is developing. The rally behavior of the market following a retracement rebound may develop an early signal of a head-and-shoulder trend reversal pattern.\nshow chapters Dow drops 100 points after a record year for the markets 5:20 PM ET Fri, 29 Dec 2017 | 06:19 Often it is possible to analyze the index chart and use this analysis to set upside targets for the index. The Dow chart shows momentum characteristics, but it does not provide a good method to set upside targets. In the short term, the next upside target is near 26,200.\nDaryl Guppy is a trader and author of Trend Trading, The 36 Strategies of the Chinese for Financial Traders, which can be found at www.guppytraders.com . He is a regular guest on CNBC Asia Squawk Box. He is a speaker at trading conferences in China, Asia, Australia and Europe. He is a special consultant to AxiCorp.\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": ["https://sc.cnbcfm.com/applications/cnbc.com/resources/files/2018/01/01/GUPPY", "http://www.twitter.com/CNBCopinion", "http://www.guppytraders.com/"], "published": "2018-01-02T08:07:00.000+02:00", "crawled": "2018-01-02T10:45:32.009+02:00", "highlightTitle": ""}