{"organizations": [], "uuid": "6264d480f1814092619ebfddb65c5eea76a15e98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226766592&w=1200&r=LYNXMPEE0U01Q", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-japan-economy-boj-opinions/some-boj-members-signal-future-dial-back-of-stimulus-january-meeting-summary-idUSKBN1FK04I", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Some BOJ members signal future dial-back of stimulus - Jan meeting summary", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T02:46:00.000+02:00", "replies_count": 0, "uuid": "6264d480f1814092619ebfddb65c5eea76a15e98"}, "author": "", "url": "https://www.reuters.com/article/us-japan-economy-boj-opinions/some-boj-members-signal-future-dial-back-of-stimulus-january-meeting-summary-idUSKBN1FK04I", "ord_in_thread": 0, "title": "UPDATE 1-Some BOJ members signal future dial-back of stimulus - Jan meeting summary", "locations": [], "entities": {"persons": [{"name": "leika kihara", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "boj", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - Several Bank of Japan policymakers said the bank may need to consider raising interest rates or slow its risky asset purchases if economic and price conditions continue to improve, a summary of opinions of the BOJ’s board members at its last rate review showed on Wednesday.\nBut other BOJ board members said the central bank must keep up its “powerful” monetary easing with inflation still distant from the bank’s 2 percent target, the summary showed.\n“When there’s still some distance to hitting our price target, it’s undesirable to see market expectations of an early shift from monetary easing to heighten,” one board member was Quote: d as saying.\n“If cuts in the BOJ’s purchases of super-long government bonds gave markets unintended signals on monetary policy, the BOJ must correct that,” the member said, without elaborating.\nThe BOJ releases a bullet-point summary of the opinions voiced by the board members at its policy meetings roughly a week after they are held. The views do not identify whose opinions they are. A more thorough minutes of the debate will be issued several weeks later.\nThe remarks from the last meeting underscore the communication challenge the BOJ faces, as subdued inflation forces the bank to maintain its massive stimulus despite its rising costs such as the hit of near-zero interest rates on bank profits.\nBOJ Governor Haruhiko Kuroda has struggled to dispel lingering market speculation the Japanese central bank will follow the footsteps of its U.S. and European peers in dialing back stimulus.\nComplicating the task is the fact that some in the BOJ’s nine-member board see room to dial back stimulus in the future, the summary showed.\n“If the economy and prices continue to improve, the BOJ may need to consider adjusting its yield targets to make its policy framework more sustainable,” one board member said, signaling the chance of raising rates in the future.\nAnother board member said the BOJ must look not just at the benefits but the costs of its purchases of risky assets, such as exchange-traded funds (ETF), the summary showed.\nAt the January policy meeting, the BOJ kept monetary settings unchanged and its chief hosed down market speculation of a shift away from ultra-easy policy later this year as inflation remained stubbornly shy of its target.\nReporting by Leika Kihara; Editing by Chang-Ran Kim and Sam Holmes\n ", "external_links": [], "published": "2018-01-31T02:46:00.000+02:00", "crawled": "2018-01-31T03:27:42.001+02:00", "highlightTitle": ""}