{"organizations": [], "uuid": "a491aafa1b32f4fe4fb9d3bd8a909acf26172a40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-scientific-games-shortlisted-for-a-total-of-five-global-gaming-awards-london-2018.html", "country": "US", "domain_rank": 767, "title": "Scientific Games Shortlisted For A Total Of Five Global Gaming Awards London 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T11:00:00.000+02:00", "replies_count": 0, "uuid": "a491aafa1b32f4fe4fb9d3bd8a909acf26172a40"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-scientific-games-shortlisted-for-a-total-of-five-global-gaming-awards-london-2018.html", "ord_in_thread": 0, "title": "Scientific Games Shortlisted For A Total Of Five Global Gaming Awards London 2018", "locations": [], "entities": {"persons": [{"name": "davey", "sentiment": "none"}, {"name": "matt davey", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "scientific games corporation", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}, {"name": "nyx gaming group limited", "sentiment": "none"}, {"name": "nyx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 29, 2018 /PRNewswire/ -- Scientific Games Corporation (NASDAQ: SGMS) (\"Scientific Games\" or the \"Company\") today announced the Company is shortlisted in a total of five award categories for the Global Gaming Awards London 2018 to be held February 5, leading into the ICE Totally Gaming and the London Affiliate Conference.\nMatt Davey, Scientific Games' new Group Chief Executive, Digital, formerly CEO and founder of NYX Gaming Group Limited, is nominated for the 2018 \"Chief Executive of the Year\" Award, which recognizes CEOs for their business leadership. Davey recently became a part of the Scientific Games' leadership team through the Company's acquisition of NYX, the industry's leading digital technology provider.\nScientific Games is also nominated for the \"Casino Supplier of the Year,\" which honors the best casino supplier for product and services innovation; \"Retail Supplier of the Year,\" which recognizes gaming suppliers worldwide; \"Online Casino Supplier of the Year,\" honoring innovation and invention in the online casino sector; and OpenBet (now part of Scientific Games through the NYX acquisition) is up for \"Online Sports Betting Supplier of the Year,\" which recognizes online sports betting suppliers.\n\"It is a great honor to have Matt Davey on our leadership team, and to be recognized among the world's top gaming companies for our commitment to excellence in four 'Supplier of the Year' categories at the Global Gaming Awards London 2018,\" said Kevin Sheehan, President and Chief Executive Officer of Scientific Games. \"We are extremely proud that our innovation continues to be recognized for being on the leading edge for the gaming and online gaming industry.\"\nThe ultimate winners in each category will be selected by a panel of 50 industry- leading judges and announced during an exclusive ceremony Monday, February 5 at London's iconic Hippodrome Casino.\nScientific Games has received more than 95 innovation awards in the last five years. The Company offers a fully integrated portfolio of technology platforms, advanced systems, engaging content and unrivaled professional services for gaming, lottery, digital and sports betting.\n© 2018 Scientific Games Corporation. All Rights Reserved.\nAbout Scientific Games\nScientific Games Corporation (NASDAQ: SGMS) is a world leader in gaming entertainment offering the industry's broadest and most integrated portfolio of game content, advanced systems, cutting-edge platforms and professional services. The company is #1 in technology-based gaming systems, digital real-money gaming and sports betting platforms, casino table games and utility products and lottery instant games, and a leading provider of games, systems and services for casino, lottery and social gaming. Committed to responsible gaming, Scientific Games delivers what customers and players value most: trusted security, engaging entertainment content, operating efficiencies and innovative technology. For more information, please visit www.scientificgames.com .\nCompany Contacts\nCorporate Communications:\nSusan Cartwright (702) 532-7981\nForward-Looking Statements\nIn this press release, Scientific Games makes \"forward-looking statements\" within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by words such as \"will,\" \"may,\" and \"should.\" These statements are based upon management's current expectations, assumptions and estimates and are not guarantees of timing, future results or performance. Therefore, you should not rely on any of these forward-looking statements as predictions of future events. Actual results may differ materially from those contemplated in these statements due to a variety of risks and uncertainties and other factors, including those factors described in our filings with the SEC, including the Company's current reports on Form 8-K, quarterly reports on Form 10-Q and its latest annual report on Form 10-K filed with the SEC on March 3, 2017 (including under the headings \"Forward Looking Statements\" and \"Risk Factors\"). Forward-looking statements speak only as of the date they are made and, except for Scientific Games' ongoing obligations under the U.S. federal securities laws, Scientific Games undertakes no obligation to publicly update any forward-looking statements whether as a result of new information, future events or otherwise.\nView original content with multimedia: http://www.prnewswire.com/news-releases/scientific-games-shortlisted-for-a-total-of-five-global-gaming-awards-london-2018-300589206.html\nSOURCE Scientific Games Corporation", "external_links": ["http://www.prnewswire.com/news-releases/scientific-games-shortlisted-for-a-total-of-five-global-gaming-awards-london-2018-300589206.html", "http://www.scientificgames.com/"], "published": "2018-01-29T11:00:00.000+02:00", "crawled": "2018-01-29T13:07:16.020+02:00", "highlightTitle": ""}