{"organizations": [], "uuid": "df7fe38a1403bdc871d7c1f14a1f51baa2a840e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-investor-engagement-and-scottrade-drive-strong-first-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Investor Engagement and Scottrade Drive Strong First Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:16:00.000+02:00", "replies_count": 0, "uuid": "df7fe38a1403bdc871d7c1f14a1f51baa2a840e6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-investor-engagement-and-scottrade-drive-strong-first-quarter-results.html", "ord_in_thread": 0, "title": "Investor Engagement and Scottrade Drive Strong First Quarter Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "omaha", "sentiment": "none"}, {"name": "neb.", "sentiment": "none"}, {"name": "scottrade", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}, {"name": "ameritrade holding corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Record Average Client Trades per Day of 726,000\nRecord Net New Client Assets of $26.5B\nGAAP Diluted EPS $0.52; Non-GAAP Diluted EPS $0.80 (1)\nOMAHA, Neb.--(BUSINESS WIRE)-- TD Ameritrade Holding Corporation (Nasdaq: AMTD) has released results for the first quarter of fiscal 2018. The Company reported record client trading activity of approximately 726,000 client trades per day, on average, and gathered a record $26.5 billion in net new client assets for the quarter. These results further benefited from continued strong investor engagement and the Company’s acquisition of Scottrade. Clearing conversion is expected to be completed in the March quarter.\nFinancial results for the quarter ended Dec. 31, 2017 include the following: (2)\nRecord net new client assets of approximately $26.5 billion, a growth rate of 9 percent Record average client trades per day of approximately 726,000, up 49 percent year over year Net revenues of $1.3 billion, 63 percent of which were asset-based Client assets of approximately $1.2 trillion, up 48 percent year over year $0.52 in GAAP earnings per diluted share, up 27 percent year over year, on net income of $297 million $0.80 in Non-GAAP earnings per diluted share (1) , up 86 percent year over year Pre-tax income of $303 million, or 24 percent of net revenues Interest rate-sensitive assets (3) of $156 billion, up 25 percent year over year\n“We’re off to an outstanding start in 2018, with powerful momentum and financial strength continuing across all core metrics. Our enhanced competitive position and increased scale, thanks to our recent acquisition of Scottrade, is further accelerating our earnings power, which we expect to continue following the final clearing conversion,” said Tim Hockey, TD Ameritrade president and chief executive officer. “Trading was at record levels, and investor engagement has continued across all client segments as the market reached new highs. Enhanced consumer interest in blockchain and cannabis-related securities drove a further surge in engagement in the final weeks of the quarter, particularly among first-time investors. New account growth is at record levels, interest in our digital guidance solutions remains high, and use of our multiple mobile offerings continues to rise. Our fully-staffed service centers are busy, providing education to clients and arming them with the information they need to make informed investment decisions.”\n“While we remain focused on the experience we deliver to these clients, much more work lies ahead, starting with delivering a successful Scottrade integration – not just operationally, but culturally as well,” Hockey continued. \"We are a company that wants to transform lives and investing for the better, and that purpose will shape our growth strategy for years to come, inspiring the actions we take to deliver long-term value for our clients, employees and shareholders. How we earn revenue, how we grow more agile and efficient, how we invest in employee development and innovation – it all ladders back to our shared commitment to drive transformational change, and we are motivated by the opportunities and potential that lies ahead.”\n“It was an eventful quarter as major indices hit all-time highs, the Fed raised interest rates, and a sweeping tax overhaul was approved,” said Steve Boyle, executive vice president and chief financial officer. “These factors – paired with our first full quarter of Scottrade earnings – further boosted our growth, driving strong GAAP and Non-GAAP results for the quarter. Furthermore, with the new tax bill being signed into law before the end of the calendar year, we were able to realize additional significant benefits in the quarter, primarily due to a re-measurement of our deferred tax liability. There are a number of options before us in putting this incremental revenue to good use, and we plan to look at each of them, as well as our capital deployment plans, in greater detail once we’ve successfully completed the Scottrade clearing conversion.”\nCapital Management\nThe Company paid $119 million in its first fiscal quarter, or $0.21 per share, in cash dividends.\nThe Company has declared a $0.21 per share quarterly cash dividend, payable on Feb. 20, 2018 to all holders of record of common stock as of Feb. 6, 2018.\nFiscal 2018 Outlook\nThe Company has also updated its outlook for the 2018 fiscal year to reflect the new U.S. tax legislation. Using updated tax rates, the company expects GAAP earnings of $1.85 to $2.45 per diluted share, and Non-GAAP earnings of $2.55 to $3.05 per diluted share (1) for its 2018 fiscal year.\nMore information on the fiscal 2018 forecast is available through the Company’s Outlook Statement, located in the “Financial Reports” section of its corporate website, www.amtd.com .\nCompany Hosts Conference Call\nTD Ameritrade will host its December Quarter conference call tomorrow morning, Jan. 23, 2018, at 8:30 a.m. EST (7:30 a.m. CST) to discuss results and take questions from analysts. Participants may listen to the conference call by dialing 833-235-7646. Prepared remarks and an enhanced financial fact sheet containing associated details are now available on the “ Financial Reports ” page of www.amtd.com under the header “Investor Relations’ Highlights.” Conference call participants are encouraged to reference these materials prior to the call.\nA replay of the phone call will be available by dialing 800-585-8367 and entering the Conference ID 4094307 beginning at 11:30 a.m. EST (10:30 a.m. CST) on Jan. 23, 2018. The replay will be available until 11:59 p.m. EST (10:59 p.m. CST) on Jan. 30, 2018. A transcript of the call, including management remarks and Q&A, will be available on the Company’s corporate web site, www.amtd.com , via the “ Financial Reports ” page beginning Wednesday, Jan. 24, 2018.\nMore information about TD Ameritrade’s upcoming corporate events and management speaking engagements, such as quarterly earnings conference calls, are available on the Company’s Corporate Event Calendar . Look for the link “Where are we?” on the “ Investor Relations ” page of www.amtd.com .\nInterested parties should visit or subscribe to newsfeeds at www.amtd.com for the most up-to-date information on corporate financial reports, press releases, SEC filings and events. The Company also communicates this information via Twitter, @TDAmeritradePR . Website links, corporate titles and telephone numbers provided in this release, although correct when published, may change in the future.\nSource: TD Ameritrade Holding Corporation\nAbout TD Ameritrade Holding Corporation\nTD Ameritrade provides investing services and education to more than 11 million client accounts totaling more than $1 trillion in assets, and custodial services to more than 6,000 registered investment advisors. We are a leader in U.S. retail trading, executing more than 700,000 trades per day for our clients, nearly a quarter of which come from mobile devices. We have a proud history of innovation , dating back to our start in 1975, and today our team of 10,000-strong is committed to carrying it forward. Together, we are leveraging the latest in cutting edge technologies and one-on-one client care to transform lives, and investing, for the better. Learn more by visiting TD Ameritrade’s newsroom at www.amtd.com , or read our stories at Fresh Accounts .\nSafe Harbor\nThis document contains forward-looking statements within the meaning of the federal securities laws. We intend these forward-looking statements to be covered by the safe harbor provisions of the federal securities laws. In particular, any projections regarding our future revenues, expenses, earnings, capital expenditures, effective tax rates, client trading activity, accounts, stock price or any projections or expectations regarding the acquisition of Scottrade Financial Services, Inc., as well as the assumptions on which such expectations are based, are forward-looking statements. These statements reflect only our current expectations and are not guarantees of future performance or results. These statements involve risks, uncertainties and assumptions that could cause actual results or performance to differ materially from those contained in the forward-looking statements. These risks, uncertainties and assumptions include, but are not limited to: general economic and political conditions and other securities industry risks, fluctuations in interest rates, stock market fluctuations and changes in client trading activity, credit risk with clients and counterparties, increased competition, systems failures, delays and capacity constraints, network security risks, liquidity risks, new laws and regulations affecting our business, regulatory and legal matters, difficulties and delays in integrating the Scottrade business or fully realizing cost savings and other benefits from the acquisition; business disruption following the Scottrade acquisition, changes in asset quality and credit risk, the inability to sustain revenue and earnings growth, changes in interest rates and capital markets, inflation, customer borrowing, repayment, investment and deposit practices, customer disintermediation, the introduction, withdrawal, success and timing of business initiatives, competitive conditions, disruptions due to Scottrade integration-related uncertainty or other factors making it more difficult to maintain relationships with employees, customers, other business partners or governmental entities, the inability to realize synergies or to implement integration plans and other consequences associated with mergers, acquisitions and uncertainties and other risk factors described in our latest Annual Report on Form 10-K, filed with the SEC on Nov. 17, 2017, and in other filings with the SEC. These forward-looking statements speak only as of the date on which the statements were made. We undertake no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise, except to the extent required by the federal securities laws.\n1 See attached reconciliation of non-GAAP financial measures\n2 Please see the Glossary of Terms, located in “Investor” section of www.amtd.com for more information on how these metrics are calculated.\n3 Interest rate-sensitive assets consist of spread-based assets and money market mutual funds. Ending balances as of December 31, 2017.\nBrokerage services provided by TD Ameritrade, Inc., member FINRA ( www.FINRA.org ) /SIPC ( www.SIPC.org ).\nTD AMERITRADE HOLDING CORPORATION CONSOLIDATED STATEMENTS OF INCOME In millions, except per share amounts (Unaudited) Quarter Ended Dec. 31, 2017 Sept. 30, 2017 Dec. 31, 2016 Revenues: Transaction-based revenues: Commissions and transaction fees $ 440 $ 330 $ 355 Asset-based revenues: Bank deposit account fees 381 307 245 Net interest revenue 276 210 151 Investment product fees 133 115 94 Total asset-based revenues 790 632 490 Other revenues 27 21 14 Net revenues 1,257 983 859 Operating expenses: Employee compensation and benefits 415 285 214 Clearing and execution costs 47 37 36 Communications 53 33 35 Occupancy and equipment costs 80 49 44 Depreciation and amortization 34 28 24 Amortization of acquired intangible assets 38 22 19 Professional services 74 82 53 Advertising 64 59 57 Other 116 27 24 Total operating expenses 921 622 506 Operating income 336 361 353 Other expense: Interest on borrowings 20 23 14 Loss on sale of investments 11 - - Loss on early extinguishment of debt 2 - - Total other expense 33 23 14 Pre-tax income 303 338 339 Provision for income taxes (1) 6 127 123 Net income $ 297 $ 211 $ 216 Earnings per share - basic $ 0.52 $ 0.40 $ 0.41 Earnings per share - diluted $ 0.52 $ 0.39 $ 0.41 Weighted average shares outstanding - basic 567 534 527 Weighted average shares outstanding - diluted 569 536 530 Dividends declared per share $ 0.21 $ 0.18 $ 0.18 (1) The provision for income taxes was lower during the December 2017 quarter due to the realization of approximately $78 million of after-tax benefits, primarily as a result of the enactment of the Tax Cuts and Jobs Act for which we recorded a provisional estimate for the remeasurement of our deferred income tax balances. TD AMERITRADE HOLDING CORPORATION CONDENSED CONSOLIDATED BALANCE SHEETS In millions (Unaudited) Dec. 31, 2017 Sept. 30, 2017 Assets: Cash and cash equivalents $ 1,644 $ 1,472 Segregated cash and investments 10,136 10,446 Broker/dealer receivables 1,291 1,334 Client receivables, net 18,578 17,151 Investments available-for-sale, at fair value 99 746 Goodwill and intangible assets 5,629 5,683 Other 2,035 1,795 Total assets $ 39,412 $ 38,627 Liabilities and stockholders' equity: Liabilities: Broker/dealer payables $ 3,064 $ 2,504 Client payables 25,286 25,107 Long-term debt 2,531 2,555 Other 1,098 1,214 Total liabilities 31,979 31,380 Stockholders' equity 7,433 7,247 Total liabilities and stockholders' equity $ 39,412 $ 38,627 NOTE: The Condensed Consolidated Balance Sheets include provisional estimates related to the assets acquired and liabilities assumed in the Scottrade acquisition. These provisional estimates may be prospectively adjusted in the event new information becomes available regarding facts and circumstances which existed at the date of acquisition. TD AMERITRADE HOLDING CORPORATION SELECTED OPERATING DATA (Unaudited) Quarter Ended Dec. 31, 2017 Sept. 30, 2017 Dec. 31, 2016 Key Metrics:\nNet new assets (in billions) $26.5 $19.9 $18.7 Net new asset growth rate (annualized) 9 % 9 % 10 % Average client trades per day 726,438 528,741 486,801 Profitability Metrics:\nOperating margin 26.7 % 36.7 % 41.1 % Pre-tax margin\n24.1 % 34.4 % 39.5 % Return on average stockholders' equity (annualized) 16.2 % 14.2 % 16.9 % Net profit margin 23.6 % 21.5 % 25.1 % EBITDA (1) as a percentage of net revenues\n31.4 % 41.8 % 46.1 % Liquidity Metrics:\nInterest on borrowings (in millions) $20 $23 $14 Interest coverage ratio (EBITDA (1) /interest on borrowings) 19.8 17.9 28.3 Cash and cash equivalents (in billions) $1.6 $1.5 $1.7 Liquid assets available for corporate investing and financing activities (1)(2) (in billions)\n$0.1\n$0.2\n$0.8 Transaction-Based Revenue Metrics:\nTotal trades (in millions) 45.4 33.0 30.4 Average commissions per trade (3) $7.54 $7.72 $9.06 Trading days 62.5 62.5 62.5 Order routing revenue (in millions) $98 $75 $79 Spread-Based Asset Metrics:\nAverage bank deposit account balances (in billions) $119.1 $95.0 $93.3 Average interest-earning assets (in billions) 31.6 26.7 24.4 Average spread-based balances (in billions) $150.7 $121.7 $117.7 Bank deposit account fee revenue (in millions) $381 $307 $245 Net interest revenue (in millions) 276 210 151 Spread-based revenue (in millions) $657 $517 $396 Avg. annualized yield - bank deposit account fees 1.25 % 1.26 % 1.03 % Avg. annualized yield - interest-earning assets 3.42 % 3.08 % 2.42 % Net interest margin (NIM) 1.71 % 1.66 % 1.32 % Fee-Based Investment Metrics:\nMoney market mutual fund fees:\nAverage balance (in billions) $3.8 $3.6 $3.7 Average annualized yield 0.43 % 0.43 % 0.38 % Fee revenue (in millions) $4 $4 $3 Market fee-based investment balances:\nAverage balance (in billions) $226.2 $196.2 $166.7 Average annualized yield 0.22 % 0.22 % 0.21 % Fee revenue (in millions) $129 $111 $91 Average fee-based investment balances (in billions) $230.0 $199.8 $170.4 Average annualized yield 0.23 % 0.22 % 0.22 % Investment product fee revenue (in millions) $133 $115 $94 (1) See attached reconciliation of non-GAAP financial measures. (2) Effective in March 2017, the liquid assets available for corporate investing and financing activities metric was revised. Prior periods have been updated to conform to the current presentation. (3) Effective in September 2017, the average commissions per trade metric was revised to exclude order routing revenue. Prior periods have been updated to conform to the current presentation. NOTE: See Glossary of Terms on the Company's website at www.amtd.com for definitions of the above metrics.\nTD AMERITRADE HOLDING CORPORATION SELECTED OPERATING DATA (Unaudited) Quarter Ended Dec. 31, 2017 Sept. 30, 2017 Dec. 31, 2016 Client Account and Client Asset Metrics:\nFunded accounts (beginning of period) 11,004,000 7,279,000 6,950,000 Funded accounts (end of period) 11,129,000 11,004,000 7,046,000 Percentage change during period 1 % 51 % 1 % Client assets (beginning of period, in billions) $1,118.5 $882.4 $773.8 Client assets (end of period, in billions) $1,178.8 $1,118.5 $797.0 Percentage change during period 5 % 27 % 3 % Net Interest Revenue:\nSegregated cash:\nAverage balance (in billions) $9.9 $7.7 $8.7 Average annualized yield 1.09 % 0.93 % 0.30 % Interest revenue (in millions) $28 $18 $7 Client margin balances:\nAverage balance (in billions) $17.6 $13.8 $11.9 Average annualized yield 4.25 % 4.08 % 3.56 % Interest revenue (in millions) $191 $144 $108 Securities borrowing/lending:\nAverage securities borrowing balance (in billions) $1.1 $1.1 $0.9 Average securities lending balance (in billions) $2.6 $2.4 $1.9 Net interest revenue - securities borrowing/lending (in millions) $53 $41 $33 Other cash and interest-earning investments:\nAverage balance (in billions) $3.0 $4.1 $2.9 Average annualized yield 0.82 % 0.79 % 0.44 % Interest revenue - net (in millions) $6 $8 $3 Client credit balances:\nAverage balance (in billions) $21.4 $16.6 $16.1 Average annualized cost 0.03 % 0.02 % 0.01 % Interest expense (in millions) ($2 ) ($1 ) ($0 ) Average interest-earning assets (in billions) $31.6 $26.7 $24.4 Average annualized yield 3.42 % 3.08 % 2.42 % Net interest revenue (in millions) $276 $210 $151 NOTE: See Glossary of Terms on the Company's website at www.amtd.com for definitions of the above metrics.\nTD AMERITRADE HOLDING CORPORATION RECONCILIATION OF NON-GAAP FINANCIAL MEASURES Dollars in millions, except per share amounts (Unaudited) Quarter Ended Fiscal Year Ending Dec. 31, 2017 Sept. 30, 2017 Dec. 31, 2016 Sept. 30, 2018* Non-GAAP Net Income and Non-GAAP Diluted EPS (1)\nAmount Diluted EPS Amount Diluted EPS Amount Diluted EPS Diluted EPS Range Net income and diluted EPS - GAAP $ 297 $ 0.52 $ 211 $ 0.39 $ 216 $ 0.41 $ 1.85 $ 2.45 Non-GAAP adjustments: Amortization of acquired intangible assets 38 0.07 22 0.04 19 0.03 0.25 0.25 Acquisition-related expenses 179 0.31 61 0.11 3 0.01 0.72 0.56 Income tax effect of above adjustments (59 ) (0.10 ) (31 ) (0.05 ) (8 ) (0.02 ) (0.27 ) (0.21 ) Non-GAAP net income and non-GAAP diluted EPS $ 455 $ 0.80 $ 263 $ 0.49 $ 230 $ 0.43 $ 2.55 $ 3.05 Quarter Ended Dec. 31, 2017 Sept. 30, 2017 Dec. 31, 2016 $ % of Net Rev. $ % of Net Rev. $ % of Net Rev. EBITDA (2)\nNet income - GAAP $ 297 23.6 % $ 211 21.5 % $ 216 25.1 % Add: Depreciation and amortization 34 2.7 % 28 2.8 % 24 2.8 % Amortization of acquired intangible assets 38 3.0 % 22 2.2 % 19 2.2 % Interest on borrowings 20 1.6 % 23 2.3 % 14 1.6 % Provision for income taxes 6 0.5 % 127 12.9 % 123 14.3 % EBITDA - non-GAAP $ 395 31.4 % $ 411 41.8 % $ 396 46.1 % As of Dec. 31, Sept. 30, June 30, Mar. 31, Dec. 31, 2017 2017 2017 2017 2016 Liquid Assets Available for Corporate Investing and Financing Activities (3)\nCash and cash equivalents - GAAP $ 1,644 $ 1,472 $ 2,880 $ 2,231 $ 1,662 Less:\nNon-corporate cash and cash equivalents (844 ) (1,174 ) (973 ) (1,286 ) (1,203 ) Corporate cash and cash equivalents 800 298 1,907 945 459 Corporate investments - 714 747 747 747 Less:\nCorporate liquidity maintained for operational contingencies (723 ) (723 ) (723 ) (723 ) (773 ) Amounts maintained for corporate working capital (65 ) (87 ) (87 ) (87 ) (87 ) Amounts held as collateral for derivative contracts, net (8 ) (40 ) (34 ) (40 ) (32 ) Excess corporate cash and cash equivalents and investments 4 162 1,810 842 314 Excess regulatory net capital over management targets 85 46 8 122 478 Liquid assets available for corporate investing and financing activities - non-GAAP $ 89 $ 208 $ 1,818 $ 964 $ 792 Note: The term \"GAAP\" in the following explanation refers to generally accepted accounting principles in the United States. * Represents the range of the Non-GAAP Diluted EPS included within the January 22, 2018 Outlook Statement. (1) Non-GAAP net income and non-GAAP diluted earnings per share (EPS) are non-GAAP financial measures as defined by SEC Regulation G. We define non-GAAP net income as net income adjusted to remove the after-tax effect of amortization of acquired intangible assets and acquisition-related expenses. We consider non-GAAP net income and non-GAAP diluted EPS as important measures of our financial performance because they exclude certain items that may not be indicative of our core operating results and business outlook and will allow for a better evaluation of the operating performance of the business and facilitate a meaningful comparison of our results in the current period to those in prior and future periods. Amortization of acquired intangible assets is excluded because management does not believe it is indicative of our underlying business performance. Acquisition-related expenses are excluded as these costs are directly related to our acquisition of Scottrade Financial Services, Inc. and are not representative of the costs of running the Company’s on-going business. Non-GAAP net income and non-GAAP diluted EPS should be considered in addition to, rather than as a substitute for, GAAP net income and diluted EPS. (2) EBITDA (earnings before interest, taxes, depreciation and amortization) is considered a non-GAAP financial measure as defined by SEC Regulation G. We consider EBITDA an important measure of our financial performance and of our ability to generate cash flows to service debt, fund capital expenditures and fund other corporate investing and financing activities. EBITDA is used as the denominator in the consolidated leverage ratio calculation for covenant purposes under our senior revolving credit facility. EBITDA eliminates the non-cash effect of tangible asset depreciation and amortization and intangible asset amortization. EBITDA should be considered in addition to, rather than as a substitute for, GAAP pre-tax income, net income and cash flows from operating activities. (3) Liquid assets available for corporate investing and financing activities is considered a non-GAAP financial measure as defined by SEC Regulation G. We consider \"liquid assets available for corporate investing and financing activities\" to be an important measure of our liquidity. We include the excess capital of our regulated subsidiaries in the calculation of liquid assets available for corporate investing and financing activities, rather than simply including the regulated subsidiaries' cash and cash equivalents, because capital requirements may limit the amount of cash available for dividend from the regulated subsidiaries to the parent company. Excess capital, as defined below, is generally available for dividend from the regulated subsidiaries to the parent company. Liquid assets available for corporate investing and financing activities should be considered as a supplemental measure of liquidity, rather than as a substitute for GAAP cash and cash equivalents. We define liquid assets available for corporate investing and financing activities as the sum of (a) excess corporate cash and cash equivalents and investments, less securities sold under agreements to repurchase and (b) our regulated subsidiaries' net capital in excess of minimum operational targets established by management. Excess corporate cash and cash equivalents and investments includes cash and cash equivalents from our investment advisory subsidiaries and excludes (i) amounts being maintained to provide liquidity for operational contingencies, including lending to our broker-dealer and FCM/FDM subsidiaries under intercompany credit agreements, (ii) amounts maintained for corporate working capital and (iii) the net amounts held as collateral for derivative contracts. Liquid assets available for corporate investing and financing activities is based on more conservative measures of net capital than regulatory requirements because we generally manage to higher levels of net capital at our regulated subsidiaries than the regulatory thresholds require.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006548/en/\nTD Ameritrade Holding Corporation\nKim Hillyer, 402-574-6523\nDirector, Communications\nkim.hillyer@tdameritrade.com\nor\nJeff Goeser, 402-597-8464\nDirector, Investor Relations\njeffrey.goeser@tdameritrade.com\nSource: TD Ameritrade Holding Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amtd.com&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=www.amtd.com&index=10&md5=3826fdaae8d81be164bb5381ba5547b1", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.FINRA.org&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=www.FINRA.org&index=20&md5=798ad85b8c3ac52f0c872547cad8f6af", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amtd.com&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=www.amtd.com&index=8&md5=7d0de6d19f08cb0fd23e50c36218d3d2", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.amtd.com%2Fnewsroom%2Femail-alerts%2Fdefault.aspx&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=subscribe&index=9&md5=e94da0682547fbfb5f12885998a6ce52", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.tdameritrade.com%2Feducation.page&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=education&index=13&md5=59c2b7f3f822027cbdfa1e4b34ac463e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.amtd.com%2Finvestor-relations%2Ffinancials-and-reports%2Fdefault.aspx&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=Financial+Reports&index=5&md5=34418f07b19da56e85b31ae663333847", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ffreshaccounts.amtd.com%2Fhome%2Fdefault.aspx&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=Fresh+Accounts&index=18&md5=6f9bf18facbec717057048d96e515f8c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.amtd.com%2Finvestor-relations%2Ffinancials-and-reports%2Fdefault.aspx&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=Financial+Reports&index=2&md5=9536a4c36f549348d508ac0a6bdcdd5c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.amtd.com%2Fnewsroom%2Fdefault.aspx&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=newsroom&index=16&md5=c4ff17516afcda1bc6ef446564d16e18", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amtd.com&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=www.amtd.com&index=3&md5=e15fd748dce98d43bb27696f465c99cc", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.SIPC.org&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=www.SIPC.org&index=21&md5=c2bf0c6213c99801ea752fc628a72954", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Ftdameritradepr&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=%40TDAmeritradePR&index=11&md5=013825a5b07bc9d36c1bb02f6db9e07a", "http://www.businesswire.com/news/home/20180122006548/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amtd.com&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=www.amtd.com&index=4&md5=a3a74355c1d66993db369df4cb5f63af", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amtd.com&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=www.amtd.com&index=1&md5=c97ce3d5f7d7bd963de41b21a5139098", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amtd.com&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=www.amtd.com&index=22&md5=68d9c219862f0e6e6e0c759edf582c32", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.tdameritrade.com%2Fwhy-td-ameritrade.page&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=investing+services&index=12&md5=a523bea3cb2952266cb3efc4013cfc3d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.amtd.com%2Finside-td-ameritrade%2Four-history%2Fdefault.aspx&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=history+of+innovation&index=15&md5=40734c8f72004f4fe54ade22e78b6165", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amtd.com%2Finvestor-relations%2Fdefault.aspx&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=Investor+Relations&index=7&md5=1acf87c8a84204b2508180b10ea37544", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.amtd.com%2Finvestor-relations%2Fpresentations-and-events%2Fdefault.aspx&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=Corporate+Event+Calendar&index=6&md5=ea08a249a9069855633512d8e955d8eb", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amtd.com&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=www.amtd.com&index=19&md5=e4a7659aabd0ce7d47a312fe461252ce", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amtd.com&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=www.amtd.com&index=23&md5=b7c3eaacf230aa7a1b9d8d4e4c3c82a9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amtd.com&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=www.amtd.com&index=17&md5=b33944316aafd025e5ed7494723a2e15", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tdainstitutional.com%2F&esheet=51747060&newsitemid=20180122006548&lan=en-US&anchor=custodial+services&index=14&md5=8de2cded2bc79cb8128ed32cf334a15d"], "published": "2018-01-23T00:16:00.000+02:00", "crawled": "2018-01-23T02:15:17.016+02:00", "highlightTitle": ""}