{"organizations": [], "uuid": "4464867f9e3940eb52ac59483fa3a56979bdd2a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-tinnitus/sound-therapy-may-train-the-brain-to-ignore-tinnitus-idUSKBN1F82MG", "country": "US", "domain_rank": 408, "title": "Sound therapy may train the brain to ignore tinnitus", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T23:08:00.000+02:00", "replies_count": 0, "uuid": "4464867f9e3940eb52ac59483fa3a56979bdd2a2"}, "author": "", "url": "https://www.reuters.com/article/us-health-tinnitus/sound-therapy-may-train-the-brain-to-ignore-tinnitus-idUSKBN1F82MG", "ord_in_thread": 0, "title": "Sound therapy may train the brain to ignore tinnitus", "locations": [], "entities": {"persons": [{"name": "lisa", "sentiment": "neutral"}, {"name": "rapaport", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 9:12 PM / in 5 minutes Sound therapy may train the brain to ignore tinnitus Lisa Rapaport 5 Min Read \n(Reuters Health) - A sound-emitting device worn in the ear during sleep may train the brain to ignore an annoying chronic ringing in the ears, a new study suggests. \nPeople with the disorder, known as tinnitus, who slept with the in-ear devices felt less bothered than patients who used bedside noise machines, researchers found in a study funded by the device manufacturer. \nTinnitus is the perception of sound that has no source outside the head, and it’s often caused by exposure to loud noise. While sound therapy is one of the treatments doctors recommend, research to date has offered a mixed picture of how well this works at reducing how much people notice ringing in their ears. \nFor the current study, researchers randomly assigned 60 patients with tinnitus to sleep with one of three sound therapy devices: a customized in-ear device that played sounds matched to the ringing sounds patients typically heard; an in-ear device that let patients select a pre-set sound; or a bedside noise machine. \nAfter three months of treatment, patients with all three types of sound therapy reported being less bothered by ringing in their ears. However, people with the customized in-ear device reported a greater reduction in the perceived loudness of tinnitus than other participants. \n“By listening to this sound while sleeping, the idea is the brain will learn to ignore the tinnitus,” said lead study author Sarah Theodoroff, a researcher at the VA Portland Health Care System and Oregon Health and Science University. \n“This study lends additional support that sound-based therapy helps reduce tinnitus distress,” Theodoroff said by email. \nWith the customized in-ear device, participants created a tinnitus “sound print” by using software to identify the sounds that most closely matched the ringing they heard in their ears. These patients were asked to listen to the sound print each night and adjust the volume to match the loudness of tinnitus. \nPeople who got the other in-ear device could choose settings with white noise, band noise or a combination of the two. They were asked to select the noise option and volume level that felt most comfortable. \nSimilarly, patients who received the bedside noise machine were asked to choose a comfortable sound and volume. If they shared a bedroom, they were told it was fine to include their partner in their selection. \nBoth in-ear devices in the study were Levo System products. The study was funded by Baker Group LLP, which manufactures Levo System devices. \nOne drawback of the study is that it lacked a control group of patients who didn’t receive sound therapy. It also didn’t directly compare sound therapy to other interventions for tinnitus like cognitive behavioral therapy or hearing aids. \nThere’s also no way to objectively measure whether the loudness of tinnitus is reduced by sound therapy, Theodoroff noted. That’s why researchers focused instead on reducing reactions to tinnitus, she said. \nThe best option for patients with tinnitus is to see a doctor, advised Dr. Jennifer Derebery, a partner at the House Ear Clinic and a professor at the University of California, Los Angeles David Geffen School of Medicine. \n“They should get their hearing checked if they have tinnitus and see if there is an underlying reason that can be identified,” Derebery, who wasn’t involved in the study, said by email. \nCauses might include grinding the teeth at night or taking certain medications like aspirin or certain anti-inflammatory drugs, she said. \nWith time, most patients can adjust to the ringing in their ears to the point where it’s no longer an issue or they only think about it some of the time, Derebery added. If sleep is an issue, some sound in the room at night, even if it’s just ambient noise, may help people with mild or moderate tinnitus. \nIn-ear devices might help when symptoms are more persistent or severe, Derebery advised. \nSOURCE: bit.ly/2EY2BDn American Journal of Audiology, online December 12, 2017.", "external_links": [], "published": "2018-01-19T23:08:00.000+02:00", "crawled": "2018-01-19T23:24:33.015+02:00", "highlightTitle": ""}