{"organizations": [], "uuid": "d1d8f813671c9e31cc430bd10fd8f1bc59890cb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-ladenburg-launches-enterprise-due-diligence-platform-names-thayer-gallison-head-of-due-diligence.html", "country": "US", "domain_rank": 767, "title": "Ladenburg Launches Enterprise Due Diligence Platform; Names Thayer Gallison Head of Due Diligence", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.052, "site_type": "news", "published": "2018-01-04T17:00:00.000+02:00", "replies_count": 0, "uuid": "d1d8f813671c9e31cc430bd10fd8f1bc59890cb8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-ladenburg-launches-enterprise-due-diligence-platform-names-thayer-gallison-head-of-due-diligence.html", "ord_in_thread": 0, "title": "Ladenburg Launches Enterprise Due Diligence Platform; Names Thayer Gallison Head of Due Diligence", "locations": [], "entities": {"persons": [{"name": "hom", "sentiment": "negative"}, {"name": "craig timm", "sentiment": "none"}, {"name": "ladenburg", "sentiment": "none"}, {"name": "thayer gallison", "sentiment": "none"}, {"name": "gallison", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "investacorp", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}], "organizations": [{"name": "ladenburg", "sentiment": "negative"}, {"name": "ladenburg launches enterprise due diligence platform", "sentiment": "negative"}, {"name": "ladenburg thalmann financial services inc.", "sentiment": "none"}, {"name": "triad advisors", "sentiment": "none"}, {"name": "office teams to intensify focus on advisor service", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "securities america", "sentiment": "none"}, {"name": "iab", "sentiment": "none"}, {"name": "kms financial services and securities service network", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New Platform Supports Ladenburg’s Subsidiary Firms by Augmenting Existing Resources and Enabling Home Office Teams to Intensify Focus on Advisor Service\nMIAMI--(BUSINESS WIRE)-- Ladenburg Thalmann Financial Services Inc. (NYSE American: LTS, LTS PrA) (“Ladenburg”), a publicly-traded diversified financial services company, today announced the launch of its new enterprise-wide due diligence platform, and the appointment of veteran industry due diligence leader, Thayer Gallison, as the head of this platform.\nThe newly created platform will provide key functions such as product analysis, due diligence and ongoing performance monitoring to the five subsidiaries that comprise Ladenburg’s network of independent advisory and brokerage (IAB) firms: Securities America, Triad Advisors, Investacorp, KMS Financial Services and Securities Service Network. In his newly created position as Ladenburg’s head of due diligence, Mr. Gallison, who will have the title of Vice President – Due Diligence Officer, will be based in Atlanta, Georgia, and report directly to Craig Timm, Ladenburg’s Chief Risk Officer.\nRichard Lampen, President and Chief Executive Officer of Ladenburg, said, “The formation of our new enterprise due diligence platform is consistent with our approach as the industry’s foremost innovator of the network model, supporting successful independent advisory and brokerage firms that operate under autonomous brands, cultures and leadership teams. Our new platform substantially augments the existing capabilities of each of our subsidiaries in product due diligence and oversight, crucial areas that would otherwise consume considerable bandwidth among each firm’s home office staff. As such, this move reinforces the autonomy of our subsidiaries by enabling them to direct newly liberated resources to areas of the business where they believe their firms can offer the most distinctive strategic advantages to the financial advisors they serve.”\nIn his new position, Mr. Gallison will work closely with Ladenburg’s executive management team to further build out and structure the new due diligence platform, which will spearhead product due diligence processes across the firm’s five IAB subsidiaries. Mr. Gallison will manage all existing due diligence team members across Ladenburg’s IAB subsidiaries, and will also be responsible for developing, implementing and monitoring procedures to support due diligence policy and management.\nMr. Gallison said, “I’m excited to join Ladenburg to build out an enterprise-wide due diligence platform that enables each Ladenburg IAB subsidiary to offer industry-leading due diligence, product analysis and monitoring capabilities to its advisors without having to build the full sweep of such resources on its own. In this new fiduciary environment, comprehensive due diligence will be critical in empowering advisors to make confident investment recommendations that serve their clients’ best interests. As a professional who believes in the power of Ladenburg’s network model approach, I look forward to working closely with each of the company’s IAB firms to drive the delivery of superior due diligence solutions in ways that reinforce the autonomy of each subsidiary firm and its unique value proposition to advisors.”\nAdam Malamed, Ladenburg’s Executive Vice President and Chief Operating Officer, stated, “We’re very pleased about Thayer Gallison’s decision to join Ladenburg as our new head of due diligence, as his reputation as a leader in the product and due diligence arena more than speaks for itself. Now that our industry enjoys a greater level of regulatory clarity, we are actively deploying Ladenburg’s substantial resources to roll out targeted new platforms and solutions that directly support our subsidiary firms and the work they do for financial advisors and their clients in this new environment. Competing effectively in winning top talent for the new enterprise level platforms we’re launching will be pivotal to our success going forward, and we’re thrilled to be off to a strong start in this regard with the hiring of Thayer Gallison.”\nPrior to joining Ladenburg, Mr. Gallison held a series of leadership positions of escalating responsibility over nearly seven years at Advisor Group. Most recently, he served as Advisor Group’s Vice President for Investment Research and Product Due Diligence, where he led development, implementation and execution of all investment research, due diligence and product strategy. Prior to his time at Advisor Group, Mr. Gallison served as a Senior Investment Analyst at MV Capital Management in Atlanta, GA.\nAbout Ladenburg Thalmann:\nLadenburg Thalmann Financial Services Inc. (NYSE American: LTS, LTS PrA) is a publicly-traded diversified financial services company based in Miami, Florida. Ladenburg’s subsidiaries include industry-leading independent broker-dealer firms Securities America, Inc., Triad Advisors, LLC, Securities Service Network, LLC, Investacorp, Inc. and KMS Financial Services, Inc., as well as Premier Trust, Inc., Ladenburg Thalmann Asset Management Inc., Highland Capital Brokerage, Inc., a leading independent life insurance brokerage company, Ladenburg Thalmann Annuity Insurance Services LLC, a full-service annuity processing and marketing company, and Ladenburg Thalmann & Co. Inc., an investment bank which has been a member of the New York Stock Exchange for over 135 years. The company is committed to investing in the growth of its subsidiaries while respecting and maintaining their individual business identities, cultures, and leadership. For more information, please visit www.ladenburg.com .\nThis press release includes certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding the Company’s due diligence platform and initiatives and other platforms and initiatives that may be introduced in the future. These statements are based on management’s current expectations or beliefs and are subject to uncertainty and changes in circumstances. Actual results may vary materially from those expressed or implied by the statements herein due to changes in economic, business, competitive and/or regulatory factors, including the United States Department of Labor’s rule and exemptions pertaining to the fiduciary status of investment advice providers to 401(k) plans, plan sponsors, plan participants and the holders of individual retirement or health savings accounts, future cash flows, a change in the Company’s dividend policy by the Company’s Board of Directors (which has the ability in its sole discretion to increase, decrease or eliminate entirely the Company’s dividend at any time) and other risks and uncertainties affecting the operation of the Company’s business. These risks, uncertainties and contingencies include those set forth in the Company’s annual report on Form 10-K for the fiscal year ended December 31, 2016 and other factors detailed from time to time in its other filings with the SEC. The information set forth herein should be read in light of such risks. Further, investors should keep in mind that the Company’s quarterly revenue and profits can fluctuate materially depending on many factors, including the number, size and timing of completed offerings and other transactions. Accordingly, the Company’s revenue and profits in any particular quarter may not be indicative of future results. The Company is under no o", "external_links": ["http://www.businesswire.com/news/home/20180104005098/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ladenburg.com&esheet=51737392&newsitemid=20180104005098&lan=en-US&anchor=www.ladenburg.com&index=1&md5=f81b866b226481b2060d699031ff98b0"], "published": "2018-01-04T17:00:00.000+02:00", "crawled": "2018-01-04T16:43:20.015+02:00", "highlightTitle": ""}