{"organizations": [], "uuid": "7b512e2578734aa952182baffcbbac8dcb99b794", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 65, "shares": 65, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/21/104723179-GettyImages-114918637.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/09/microsoft-halts-some-amd-chip-meltdown-patches-after-pcs-freeze.html", "country": "US", "domain_rank": 767, "title": "Microsoft halts some AMD chip Meltdown patches after PCs freeze", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:37:00.000+02:00", "replies_count": 0, "uuid": "7b512e2578734aa952182baffcbbac8dcb99b794"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/microsoft-halts-some-amd-chip-meltdown-patches-after-pcs-freeze.html", "ord_in_thread": 0, "title": "Microsoft halts some AMD chip Meltdown patches after PCs freeze", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "amd", "sentiment": "negative"}, {"name": "microsoft", "sentiment": "negative"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Microsoft said on Tuesday it had suspended patches to guard against Meltdown and Spectre security threats for computers running AMD chipsets after complaints by AMD customers that the software updates froze their machines.\nMicrosoft said in a support blog that it was working with AMD to resolve the issues and would resume Windows operating system software updates to affected AMD devices via its Windows Update process as soon as possible.\nAMD shares dipped 1.3 percent in pre-market U.S. trading. Last week the stock rose nearly 20 percent as investors speculated AMD could wrest market share from Intel , whose chips are exposed to risks from possible Meltdown and Spectre attacks.\n\"To prevent AMD customers from getting into an unbootable state, Microsoft will temporarily pause sending the following Windows operating system updates to devices with impacted AMD processors at this time,\" Microsoft said in its statement.\nMicrosoft said it had received complaints from AMD customers that their machines stopped loading the Start menu or taskbar after installing Windows operating system security updates.\nUpon investigation, Microsoft said some AMD chipsets did not conform to technical documentation the chipmaker had provided, preventing Microsoft from successfully patching affected machines.\nIn its blog post, the software giant said the patches had caused computer screens to freeze up, or have so-called \"blue screen errors\" on Windows 10, Windows 8.1 and Windows 7.\nMeltdown and Spectre are two memory corruption flaws which could allow hackers bypass operating systems and other security software to steal passwords or encryption keys, on most types of computers, phones, and cloud-based servers.\nAMD said last week that differences in its chip designs from rival Intel meant its products were at \"zero risk\" from Meltdown flaw but that one variant of the Spectre bug could be resolved by software updates from vendors such as Microsoft.\nAMD told CNBC that the Microsoft patches were for Spectre and the issue \"has been addressed and patches will start rolling out again shortly.\"\n--CNBC.com contributed to this report.", "external_links": [], "published": "2018-01-09T14:37:00.000+02:00", "crawled": "2018-01-09T15:20:56.026+02:00", "highlightTitle": ""}