{"organizations": [], "uuid": "28b1792e3ca49e329a1481db28bbf3ca722a5ae3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-association-of-gaming-equipment-manufacturers-agem-announces-results-of-officer-elections.html", "country": "US", "domain_rank": 767, "title": "Association of Gaming Equipment Manufacturers (AGEM) Announces Results of Officer Elections", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T19:00:00.000+02:00", "replies_count": 0, "uuid": "28b1792e3ca49e329a1481db28bbf3ca722a5ae3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-association-of-gaming-equipment-manufacturers-agem-announces-results-of-officer-elections.html", "ord_in_thread": 0, "title": "Association of Gaming Equipment Manufacturers (AGEM) Announces Results of Officer Elections", "locations": [], "entities": {"persons": [{"name": "daron dorsey", "sentiment": "none"}, {"name": "tom nieman", "sentiment": "none"}, {"name": "mark dunn", "sentiment": "none"}, {"name": "david lucchese", "sentiment": "none"}, {"name": "robert “bob” parente", "sentiment": "none"}, {"name": "luke orchard", "sentiment": "none"}, {"name": "thomas jingoli", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "everi", "sentiment": "none"}], "organizations": [{"name": "association of gaming equipment manufacturers", "sentiment": "negative"}, {"name": "globe newswire", "sentiment": "negative"}, {"name": "the association of gaming equipment manufacturers", "sentiment": "negative"}, {"name": "north american operations", "sentiment": "none"}, {"name": "ainsworth game technology", "sentiment": "none"}, {"name": "agem", "sentiment": "none"}, {"name": "konami gaming", "sentiment": "none"}, {"name": "igt", "sentiment": "none"}, {"name": "aristocrat leisure limited", "sentiment": "none"}, {"name": "svp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 10, 2018 (GLOBE NEWSWIRE) -- The Association of Gaming Equipment Manufacturers (AGEM) announced today that its Board of the Directors has elected a new slate of officers under the leadership of Tom Nieman, Vice President of Global Marketing for JCM Global, as the organization’s President.\nNieman’s position as President was not up for election as he transitions into the second year of a 2-year term, but 1-year terms were approved for:\nVice President David Lucchese (EVP, Digital & Interactive Business Leader, Everi) Vice President Luke Orchard (SVP, Chief Compliance & Risk Management Officer, IGT) Vice President Robert “Bob” Parente (SVP, Chief Revenue Officer, Gaming, Scientific Games) Secretary Mark Dunn (EVP & General Counsel, Aristocrat Leisure Limited) Treasurer Thomas Jingoli (EVP, Chief Commercial Officer, Konami Gaming) General Counsel Daron Dorsey (General Counsel, North American Operations, Ainsworth Game Technology)\nAGEM is a non-profit international trade association representing manufacturers and suppliers of electronic gaming devices, lotteries, systems, table games, online technology, key components and support products and services for the gaming industry. AGEM works to further the interests of gaming equipment suppliers throughout the world. Through political action, regulatory influence, trade show partnerships, educational alliances, information dissemination and good corporate citizenship, the members of AGEM work together to create benefits for every company within the organization. Together, AGEM has assisted regulatory agencies and participated in the legislative process to solve problems and create a business environment where AGEM members can prosper while providing a strong level of support to education and responsible gaming initiatives. For more information, visit www.AGEM.org .\nThe current AGEM membership roster, 164 companies strong based in 23 countries, is a who’s who of the supplier segment of the global gaming industry: AGEM Gold Members: AGS, Ainsworth Game Technology, Aristocrat Technologies, Everi, International Game Technology (IGT), Konami Gaming, Merkur Gaming, NOVOMATIC Group, Scientific Games and Sega Sammy Creation. AGEM Silver Members: Action Gaming, Aruze Gaming America, Betson Enterprises, Casino Technology, Crane Payment Innovations (CPI), Gaming Partners International (GPI), JCM Global, NYX Gaming Group, Ortiz Gaming, Quixant PLC, Suzo-Happ Group, TCSJohnHuxley, William Hill US and Zitro. AGEM Bronze Members: Abbiati Casino Equipment, Alfastreet, Amatic Industries, APEX gaming, Astro Corp., BetConstruct, Bingotimes Digital Technology, Boss Gaming, Cammegh Limited, Century Gaming Technologies, CG Technology (CGT), Cole Kepro International, DR Gaming Technology (DRGT), Euro Games Technology (EGT), Exacta Systems, FBM, Galaxy Gaming, Gamblit Gaming, GameCo, Gaming Arts, Gaming Support, Glory Global Solutions, Grand Vision Gaming, Incredible Technologies, Inspired Gaming, Interblock USA, Intervision Gaming, ISMS, Jackpot Digital, Jumbo Technology, Matsui Gaming Machine Co., Metronia, PariMAX, Patriot Gaming & Electronics, Spintec, Table Trac, Vantiv Entertainment Solutions, Wells-Gardner Technologies and Win Systems. AGEM Associate Members: 3M Touch Systems, Adlink Technology, Advantech-Innocore, Agilysys, AMD, ArdentSky, Arrow International, Asimex Global, Atrient, Automated Cashless Systems, Automated Systems America, Inc. (ASAI), Axiomtek, British Group Interactive (BGI), Camryn Industries, CardConnect, Carmanah Signs, Casino Connection International, Casino Screens, Catapult Global, CDC Gaming Reports, CMC Trading Engineering, Comtrade Gaming, Cooper Levenson, Digital Gaming Corporation, Digital Instinct, DiTronics Financial Services, Dominode, Duane Morris LLP, EFCOtec Corporation, Eilers & Krejcik Gaming, Elite Gaming Technology, Esterline Interface Technologies, Fantini Research, Finnegan, Henderson, Farabow, Garrett & Dunner, Fox Rothschild, G2 Game Design, Gambling Compliance, Gaming and Entertainment Touch Technology, Gaming Capital Group, GAN, Ganlot, Gary Platt Manufacturing, Gasser Chair Company, Genesis Interactive Technologies, GeoComply USA, GET IN Global, Global Gaming Group (G3), Greenberg Traurig, House Advantage, Howard & Howard, Impact Display Solutions, Intel, IPS, James Industries, James Industry Research Group, JCS Technologies, Jones Walker, JP Morgan Chase, KEY-BAK, Kiron Interactive, Kontron, Lazcano Sámano, Lewis Roca Rothgerber Christie, Lightstone Solutions, Majestic Realty, Media Resources, NanoLumens, Olsen Gaming / Spectronix, Outpost Creative, Passport Technology, Patir Casino Seating, Portilla Ruy-Díaz y Aguilar, Proforma GPS, Regulatory Management Counselors (RMC), Rising Digital, RMMC, RSM US LLP, SAP, SCA Gaming, Shenzhen General Lottery Technology Co., Sightline Payments, Skilled Game Development, Slot Constructor, Southco, Southwest Manufacturing Services, Spin Games, StylGame USA, Taft Stettinius & Hollister, Talent Associates, The Bright Group, Touch Dynamic, Touch Embedded Solutions, Tournament One, TOVIS, TraffGen USA, TransAct Technologies, Veridocs, Visualplanet, Wells Fargo, Young Electric Sign Company (YESCO) and Zebra Technologies.\nMedia contacts: Tom Nieman AGEM President (702) 651-0000 Tom.Nieman@JCMGlobal.com Marcus Prater AGEM Executive Director (702) 812-6932 AGEM.org@cox.net\nSource:Association of Gaming Equipment Manufacturers", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/2f35db69-6eba-4b2c-b048-6e21af8191c4"], "published": "2018-01-10T19:00:00.000+02:00", "crawled": "2018-01-10T20:19:10.010+02:00", "highlightTitle": ""}