{"organizations": [], "uuid": "62b67472f239a163138ed62500ab60e5bf7929dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/donald-trump-robert-mueller.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/27/if-donald-trump-fires-robert-mueller/", "country": "US", "domain_rank": 1196, "title": "If Donald Trump Orders Robert Mueller Fired, Here's What Might Happen | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.54, "site_type": "news", "published": "2018-01-27T16:02:00.000+02:00", "replies_count": 0, "uuid": "62b67472f239a163138ed62500ab60e5bf7929dc"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/27/if-donald-trump-fires-robert-mueller/", "ord_in_thread": 0, "title": "If Donald Trump Orders Robert Mueller Fired, Here's What Might Happen | Fortune", "locations": [], "entities": {"persons": [{"name": "robert mueller", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "rod ro", "sentiment": "none"}, {"name": "mueller", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "justice department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 2:02 PM EST \nPresident Donald Trump says he doesn’t intend to fire Special Counsel Robert Mueller, who is overseeing the investigation of Russian meddling in the 2016 campaign that has spilled over to Trump’s associates and perhaps to the president himself. But it now appears Trump tried to do exactly that, last year. A special counsel is granted a level of independence and autonomy to lead investigations of politically sensitive, nationally important matters. But the position isn’t untouchable. 1. What’s a special counsel? \nIt’s a lawyer from outside of government named by the attorney general to take over an investigation that poses a conflict of interest for the Justice Department. The 1999 rule establishing the position says a special counsel should have “a reputation for integrity and impartial decision making” and is supposed to “not be subject to the day-to-day supervision of any official of the department.” 2. Does the special counsel report to anybody? \nYes, usually to the attorney general. But in this case, Mueller answers to the deputy attorney general, Rod Rosenstein, who made the decision to give the case to a special counsel. He also appointed Mueller, a former FBI director. Rosenstein’s boss, Attorney General Jeff Sessions, recused himself from overseeing the inquiry. 3. So only Rosenstein can fire Mueller? \nTechnically correct, and only upon finding “misconduct, dereliction of duty, incapacity, conflict of interest” or “other good cause.” Rosenstein has said, as recently as Dec. 13, that he sees no such reason to dismiss Mueller. Short of firing the special counsel, Rosenstein could reel in the investigation by finding one of more of its strategies or techniques “so inappropriate or unwarranted under established departmental practices that it should not be pursued.” But Rosenstein has given no indication that he’s contemplating this step, either. 4. Does that leave Trump any options? \nYes, since a president’s power over the executive branch is vast. Last June, Trump wanted to fire Mueller, according to three people familiar with the matter. The New York Times reported that White House counsel Donald McGahn refused to pass that order to the Justice Department and threatened to resign. Another option — which Trump also considered, according to the Times — would be to fire Rosenstein and pressure his successor to dismiss Mueller, repeating the steps as needed until finding someone willing to carry out his wishes. (A firing and a pair of resignations touched off by President Richard Nixon during the late stages of the Watergate investigation went down in history as the “Saturday Night Massacre.”) Or Trump could fire Sessions, with the expectation that Sessions’ successor would seize control of the case from Rosenstein — and fire Mueller. Under yet another scenario, offered by the author of the special-counsel regulations, Trump could order their repeal, then fire Mueller by himself. 5. Would firing Mueller end the Russia investigation? \nNot necessarily. The investigation predated Mueller’s appointment as special counsel and already has some prosecutions underway. If Mueller were to be dismissed, much would depend on his successor — who would, presumably, be appointed by Rosenstein. 6. Is anyone trying to protect Mueller? \nYes, but without much legislative progress. Senators Thom Tillis, a Republican, and Chris Coons, a Democrat, proposed a bill establishing that a fired special counsel would be reinstated if a panel of judges finds no good cause for the removal. Two other senators, Republican Lindsey Graham and Democrat Cory Booker, offered a bill that would require the attorney general or acting attorney general to get approval from a three-judge panel before firing a special counsel. Both bills have raised constitutional questions, and both face an uphill battle just to get to the Senate floor for a vote. 7. What would happen if Mueller were fired? \nHe could sue to challenge the grounds for his dismissal. Beyond that, much of the fallout would depend on Trump’s fellow Republicans in Congress, who hold majorities in the House and the Senate. Democrats could be expected to express their outrage by offering proposals to reinstate Mueller and to remove Trump as president, on grounds that he had obstructed justice. But Democrats couldn’t accomplish that on their own, and at the moment, many Republicans are far more critical of Mueller than protective. 8. Could Trump be impeached for firing Mueller? \nSince removing a president is a political process, not a legal one, anything can be grounds for impeachment if enough members of Congress say it is. The Constitution says the president (and vice president and judges and members of the cabinet) “shall be removed from office on impeachment for, and conviction of, treason, bribery, or other high crimes and misdemeanors.” The key phrase “high crimes and misdemeanors” has been defined by Congress through the years to include exceeding or abusing the powers of the presidency or misusing the office for improper purpose or gain. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-27T16:02:00.000+02:00", "crawled": "2018-01-27T21:05:11.051+02:00", "highlightTitle": ""}