{"organizations": [], "uuid": "7c9934fc588c499e06e4a478b47638957c3462cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 46}, "facebook": {"likes": 311, "shares": 311, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/26/104916620-GettyImages-894537956.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/taking-on-debt-to-buy-bitcoin-is-a-bad-idea.html", "country": "US", "domain_rank": 767, "title": "Taking on debt to buy bitcoin is a bad idea", "performance_score": 3, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.152, "site_type": "news", "published": "2018-01-11T15:16:00.000+02:00", "replies_count": 0, "uuid": "7c9934fc588c499e06e4a478b47638957c3462cb"}, "author": "Annie Nova", "url": "https://www.cnbc.com/2018/01/11/taking-on-debt-to-buy-bitcoin-is-a-bad-idea.html", "ord_in_thread": 0, "title": "Taking on debt to buy bitcoin is a bad idea", "locations": [], "entities": {"persons": [{"name": "anthony wallace", "sentiment": "negative"}, {"name": "joseph borg", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "north american securities administrators association", "sentiment": "none"}, {"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Some investors are taking dangerous risks to get into cryptocurrencies.\nRoughly 18 percent of people who buy bitcoin use a credit card to do so, according to a new survey by loan marketplace LendEDU . Of those, 20 percent have not paid off their balance. The phrase \" buy bitcoin with credit \" has been trending on Google for weeks.\nJoseph Borg, president of the North American Securities Administrators Association, a voluntary organization devoted to investor protection, said he often hears of people who've made financial sacrifices to own cryptocurrencies.\nSome are relatively benign: People who have transferred a portion of their money from stocks or mutual funds. But he also hears from people who have gone into credit card debt or taken out home equity loans on their house.\nThat impulse is somewhat understandable in today's economic setting, he said.\n\"We've inundated everyone with the idea that most Americans don't have enough in savings — that they don't have enough to retire,\" Borg said. \"People want to make it up with anything they can. What else is being as hyped as cryptocurrency?\"\nshow chapters Credit card debt 10:33 AM ET Wed, 10 Jan 2018 | 01:24 But the risky investment can leave people in even deeper arrears, said Joshua Fairfield, a bitcoin specialist at the Washington and Lee School of Law.\n\"People are maxing out their credit cards because they think it's going to make them a lot of money,\" said Fairfield. \"They've been right enough that people are now making ever more risky investments in cryptocurrencies.\"\nHowever, bitcoin should be treated like any other uncertain investment, Fairfield said.\n\"I'd trust it less than Apple stock and probably more than some other members on the New York Stock Exchange,\" he said, laughing.\nPeople should never jeopardize an asset as safe as their house for volatile cryptocurrencies , Fairfield said. Instead, holding on to safer investments can leave room for some risks with other assets.\n\"If next month everyone decides bitcoin is passe and everyone moves to ripple, bitcoin goes to zero. Now you have more credit card debt, and what are you going to do with it?\" -Joseph Borg, president, North American Securities Administrators Association Another problem with going into debt for cryptocurrencies is that people will have to pay back their debt before they see sufficient returns, said Erika Safran, founder of Safran Wealth Advisors. That may require tapping other resources, potentially creating further financial trouble.\n\"If you can stay on for long enough, I believe you will be rewarded,\" Safran said about cryptocurrencies. \"But in the short-term, you may not realize those funds you need to pay your credit card.\"\nPlus, there's no promise of profit. At least some cryptocurrencies may soon be worth nothing — leaving people in a pickle, Borg said.\n\"Bitcoin has no underlying value,\" he said. \"If next month everyone decides bitcoin is passe and everyone moves to ripple, bitcoin goes to zero. Now you have more credit card debt, and what are you going to do with it?\"\nshow chapters Warren Buffett thinks cryptocurrencies will end badly 21 Hours Ago | 00:59 The misuse of debt with cryptocurrencies has some frightening parallels to the 2008 housing crisis, said Angela Walch, an associate professor at St. Mary's University School of Law who studies cryptocurrences.\n\"People took on debt — mortgages — with the expectation that house prices were only going to go up,\" Walch said. \"When the bubble popped, housing prices actually fell, and people's assets weren't enough to cover the debt they owed.\"\n\"We've seen how using debt to buy speculative investments can be problematic,\" she said. \"The consequences were dire.\"\nMore from Personal Finance:\nBitcoin, once 'sketchy,' becomes more mainstream\nSome cryptocurrency-backed debit cards dropped from Visa network, leaving users scrambling\nBitcoin is too risky to treat as a 'serious' investment, financial advisers say", "external_links": [], "published": "2018-01-11T15:16:00.000+02:00", "crawled": "2018-01-11T15:38:42.020+02:00", "highlightTitle": ""}