{"organizations": [], "uuid": "45b1c33ff415c73a38de97ca7ad570eb19331732", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-airgain-appoints-farrukh-usmani-as-vice-president-of-engineering.html", "country": "US", "domain_rank": 767, "title": "Airgain Appoints Farrukh Usmani as Vice President of Engineering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:00:00.000+02:00", "replies_count": 0, "uuid": "45b1c33ff415c73a38de97ca7ad570eb19331732"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-airgain-appoints-farrukh-usmani-as-vice-president-of-engineering.html", "ord_in_thread": 0, "title": "Airgain Appoints Farrukh Usmani as Vice President of Engineering", "locations": [], "entities": {"persons": [{"name": "farrukh usmani", "sentiment": "negative"}, {"name": "usmani", "sentiment": "none"}], "locations": [{"name": "airgain", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "airgain", "sentiment": "negative"}, {"name": "qualcomm", "sentiment": "negative"}, {"name": "asic", "sentiment": "none"}, {"name": "atheros", "sentiment": "none"}, {"name": "business wire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Appointment of former Qualcomm executive reflects Airgain’s rapid growth and transition into new markets and technology sectors\nSAN DIEGO--(BUSINESS WIRE)-- Airgain, Inc. ( NASDAQ: AIRG ), a global leader in wireless connectivity platforms, today announced the appointment of Farrukh Usmani as Vice President of Engineering. With over 20 years of executive management experience, Mr. Usmani will be responsible for the company’s global engineering team.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180125005554/en/\nFarrukh Usmani, Vice President of Engineering at Airgain (Photo: Business Wire)\nPrior to joining Airgain, Usmani held several high profile engineering positions at Qualcomm, where he most recently served as a vice president in the consumer technologies, ASIC system test, reference design and Atheros divisions, and spearheaded new technologies and product development processes. In addition to heading engineering, Usmani will oversee all research and development initiatives across the organization, driving the company’s technology roadmap and development of next-generation wireless technologies.\n“I am excited to welcome Farrukh to Airgain at such a pivotal time in our company’s growth,” said Chuck Myers, President and CEO of Airgain. “He has built teams from scratch to several hundred engineers, and his strong management and broad technology background are a perfect fit for Airgain as we expand our product and technology footprint across the home, enterprise, automotive, and IoT markets.”\n“Airgain’s growth and reputation as a world-class wireless technology company is hugely impressive,” said Usmani. “The company’s wireless connectivity solutions have become a critical success factor for many global businesses, and I am excited to join the company as it accelerates its growth into new and innovative areas.”\nAbout Airgain\nAirgain Inc. (NASDAQ: AIRG) is a global provider of high-performance wireless communications platforms. Combining design-led thinking with testing and development, Airgain works in partnership with the entire ecosystem, including carriers, chipset suppliers, OEMs, and ODMs. Airgain’s key markets include home, automotive, Internet of Things (IoT), and enterprise, and its antenna technologies can be found in set-top boxes, access points, routers, gateways, media adapters, smart TVs, vehicles, and IoT devices. Airgain is headquartered in San Diego, California, and maintains design and test centers in the US, UK, and China. For more information, visit airgain.com , or follow us on LinkedIn and Twitter .\nAirgain and the Airgain logo are registered trademarks of Airgain, Inc.\nForward-Looking Statements\nAirgain cautions you that statements in this press release that are not a description of historical facts are forward-looking statements. These statements are based on the company's current beliefs and expectations. These forward-looking statements include statements regarding the ability of Airgain to accelerate growth into new and innovative areas and the expansion of its product and technology footprint across the home, enterprise, automotive, and IoT markets. The inclusion of forward-looking statements should not be regarded as a representation by Airgain that any of our plans will be achieved. Actual results may differ from those set forth in this press release due to the risk and uncertainties inherent in our business, including, without limitation: the market for our antenna products is developing and may not develop as we expect; our products are subject to intense competition, including competition from the customers to whom we sell, and competitive pressures from existing and new companies may harm our business, sales, growth rates and market share; risks associated with the performance of our technology; our future success depends on our ability to develop and successfully introduce new and enhanced products for the wireless market that meet the needs of our customers; and other risks described in our prior press releases and in our filings with the Securities and Exchange Commission (SEC), including under the heading \"Risk Factors\" in our Annual Report on Form 10-K and any subsequent filings with the SEC. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof, and we undertake no obligation to revise or update this press release to reflect events or circumstances after the date hereof. All forward-looking statements are qualified in their entirety by this cautionary statement, which is made under the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005554/en/\nCompany Contact\nAirgain, Inc.\nAlexis Waadt\nDirector of Investor Relations\ninvestors@airgain.com\nor\nPress Office Contact\nHarvard\nWill Cook\n+44 (0) 20 7861 2504\nAirgain@harvard.co.uk\nSource: Airgain, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fairgain&esheet=51748792&newsitemid=20180125005554&lan=en-US&anchor=Twitter&index=5&md5=3a72e33e3ae92e560618d765fa6879cf", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.airgain.com%2F&esheet=51748792&newsitemid=20180125005554&lan=en-US&anchor=airgain.com&index=3&md5=15e1be278960a7fc5acd5df7936d6e43", "http://www.businesswire.com/news/home/20180125005554/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fairgain.com%2F&esheet=51748792&newsitemid=20180125005554&lan=en-US&anchor=Airgain%2C+Inc.&index=1&md5=d82b065a9ee945fe4553c3214bdec84c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.airgain.com%2F&esheet=51748792&newsitemid=20180125005554&lan=en-US&anchor=NASDAQ%3A+AIRG&index=2&md5=975a4e1ea7b736f4d45d9f641e42b119", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2F98027%2F&esheet=51748792&newsitemid=20180125005554&lan=en-US&anchor=LinkedIn&index=4&md5=e51558b135a640f7c29c0da523ad48e0"], "published": "2018-01-25T17:00:00.000+02:00", "crawled": "2018-01-25T18:28:23.010+02:00", "highlightTitle": ""}