{"organizations": [], "uuid": "759ae26fa426d019bf5e26c1016690787a10769c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-ascensus-announces-agreement-to-acquire-polycomp-trust-company-and-completion-of-provident-trust-group-acquisition.html", "country": "US", "domain_rank": 767, "title": "Ascensus Announces Agreement to Acquire Polycomp Trust Company and Completion of Provident Trust Group Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.437, "site_type": "news", "published": "2018-01-22T22:00:00.000+02:00", "replies_count": 0, "uuid": "759ae26fa426d019bf5e26c1016690787a10769c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-ascensus-announces-agreement-to-acquire-polycomp-trust-company-and-completion-of-provident-trust-group-acquisition.html", "ord_in_thread": 0, "title": "Ascensus Announces Agreement to Acquire Polycomp Trust Company and Completion of Provident Trust Group Acquisition", "locations": [], "entities": {"persons": [{"name": "ascensus", "sentiment": "none"}], "locations": [{"name": "dresher", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "south dakota-chartered", "sentiment": "none"}, {"name": "south dakota", "sentiment": "none"}, {"name": "sioux falls", "sentiment": "none"}], "organizations": [{"name": "polycomp administrative services", "sentiment": "none"}, {"name": "provident trust group", "sentiment": "none"}, {"name": "polycomp trust company", "sentiment": "none"}, {"name": "ira", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DRESHER, Pa., Jan. 22, 2018 /PRNewswire/ -- Ascensus, a technology-enabled solutions provider that helps more than 7 million Americans save for the future, has entered into an agreement to acquire Polycomp Trust Company, a South Dakota-chartered, non-depository trust company. Completion of the acquisition is subject to customary closing conditions including regulatory approval. Ascensus has also completed the previously announced acquisition of Provident Trust Group, a non-discretionary administrator and custodian of IRA assets. Both entities will become part of Ascensus' retirement division.\nPolycomp Trust Company, located in Sioux Falls, South Dakota, serves as a non-traditional asset custodian for self-directed IRAs. Its trust services are typically used by individuals who want to invest IRA assets in unique non-traditional assets like real property, notes secured by deeds of trust, and limited liability company interests. The administration services for these self-directed IRA accounts are performed by Polycomp Administrative Services, which was acquired by Ascensus on November 1, 2017.\nProvident Trust Group, located in Las Vegas, Nevada, is one of the top independent providers of trust, custody, administration, and escrow services to the self-directed IRA markets. The firm's clients range in size from small family trusts to multi-million dollar accounts and include individuals, multi-generational families, and family offices, as well as retirement accounts. Ascensus' agreement to acquire Provident Trust Group was announced on October 23, 2017.\n\"In looking at Provident Trust Group and Polycomp Trust Company, we saw an opportunity to offer clients maximum flexibility in the selection of their IRA investments through the use of traditional and alternative asset classes,\" states David Musto, Ascensus' president. \"We're looking forward to participating in the growing self-directed IRA markets with trust and custody service providers that are known for excellent quality and personalized customer assistance.\"\n\"Acquiring Polycomp Trust Company right after the Provident Trust Group acquisition gives additional scale to our market presence, solutions, and services,\" adds Raghav Nandagopal, Ascensus' executive vice president of corporate development and mergers & acquisition. \"We continue to look for high quality companies that can help us grow this segment.\"\nAbout Ascensus\nAscensus helps more than 7 million Americans save for the future—retirement, college, and healthcare—through technology-enabled solutions. With more than 35 years of experience, the firm offers tailored solutions that meet the needs of asset managers, banks, credit unions, state governments, financial professionals, employers, and individuals. Ascensus supports approximately 50,000 retirement plans, more than 4 million 529 college savings accounts, and a growing number of ABLE savings accounts. It also administers more than 1.7 million IRAs and health savings accounts. As of September 30, 2017, Ascensus had over $158 billion in total assets under administration. For more information about Ascensus, visit ascensus.com .\nView career opportunities at careers.ascensus.com or on LinkedIn at linkedin.com/company/ascensus . For the latest company news, follow @AscensusInc on Twitter.\nView original content with multimedia: http://www.prnewswire.com/news-releases/ascensus-announces-agreement-to-acquire-polycomp-trust-company-and-completion-of-provident-trust-group-acquisition-300586064.html\nSOURCE Ascensus", "external_links": ["http://careers.ascensus.com/", "http://www.prnewswire.com/news-releases/ascensus-announces-agreement-to-acquire-polycomp-trust-company-and-completion-of-provident-trust-group-acquisition-300586064.html", "https://twitter.com/AscensusInc", "http://www.ascensus.com/", "https://www.linkedin.com/company/ascensus"], "published": "2018-01-22T22:00:00.000+02:00", "crawled": "2018-01-22T23:22:34.009+02:00", "highlightTitle": ""}