{"organizations": [], "uuid": "dd631ef5199044113ad3d0feb12b91c1920ff5ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928567-snow_falls_in_Brooklyn.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/8-productivity-hacks-for-working-from-home.html", "country": "US", "domain_rank": 767, "title": "8 productivity hacks for working from home", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.168, "site_type": "news", "published": "2018-01-04T22:00:00.000+02:00", "replies_count": 0, "uuid": "dd631ef5199044113ad3d0feb12b91c1920ff5ed"}, "author": "Abigail Hess", "url": "https://www.cnbc.com/2018/01/04/8-productivity-hacks-for-working-from-home.html", "ord_in_thread": 0, "title": "8 productivity hacks for working from home", "locations": [], "entities": {"persons": [{"name": "mark challender", "sentiment": "negative"}, {"name": "lisa zaslow", "sentiment": "none"}, {"name": "mason donovan", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "barcroft media | getty images", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "fast company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mark Challender/ Barcroft Media | Getty Images A New York commuter SHARES \nWith bomb cyclones, blizzards and polar vortexes attacking cities across the country, many professionals will be working from home this week. \nIt may seem like working from home is the ideal excuse for breakfast in bed, but it can also mean losing precious work hours. \n\"The home office is the worst of both worlds,\" productivity and organization expert Lisa Zaslow tells CNBC Make It . \"You're not at home just watching TV, and you don't have the really good office resources and environment of being in the office.\" \nCheck out these eight tricks to make sure you optimize your work from home hours so you can pursue more pleasurable winter activities: show chapters 1:22 PM ET Wed, 16 March 2016 1. Get dressed \nGetting dressed for the day can make you feel more determined to get your work done says workplace expert Mason Donovan. \n\"Although a dress code may seem silly when you think about working from home, work clothes impact you on a business and personal level and can affect your career,\" he tells Fast Company . \nNot only can a professional outfit make you feel more productive, but it can also boost how you feel about the work you are doing. Researchers Joy V. Peluchette and Katherine Karl found, \"Respondents felt most authoritative, trustworthy and competent when wearing formal business attire, but friendliest when wearing casual or business casual attire.\" 2. Ditch your phone \n\"Put your phone away,\" says Zaslow. \"You get a little dopamine hit from sending your friend an email or seeing a kitten video, so you do have to work hard not to be tempted.\" \nResearch confirms what we already know: Frequent Snapchat or Facebook messaging isn't helpful while trying to work. Several studies show that the human brain isn't very good at multitasking and it's even better at tricking itself into thinking it can. \n\"People can't multitask very well, and when people say they can, they're deluding themselves,\" neuroscientist Earl Miller tells NPR . \"The brain is very good at deluding itself.\" 3. Find the perfect workspace \nFinding the perfect spot to work is one of the most important parts of productively working from home. \nThe first step is to get out of bed says Lauren Holliday , founder of Freelanship . She explains that working in bed can confuse your brain. \n\"After repeatedly using something for a certain purpose, our brains begin to associate an object with a purpose,\" she says. \"When you work from bed one of two negative things will happen: You'll tend to fall asleep while working or at least get sleepy while working and your brain will begin to disassociate your bed with sleep, making it difficult for you to actually fall asleep.\" \nOnce you have left your bed, try to find a place that has limited noise and lots of sunlight . show chapters 11:59 AM ET Sat, 6 May 2017 | 00:50 4. Sit smart \nWhen working at home, you may realize that you miss your chair at work. In order to find the perfect chair to work from at home, Holliday says professionals should look for five factors: a comfortable cushion, armrests, an adjustable backrest, lumbar support and wheels. \nFortunately, you don't need to spend a fortune to find a chair that fits these specifications. \"There's no need to spend $900 on an ergonomic chair when there's Amazon,\" says Holliday. 5. Grab some gadgets \nA few simple gadgets can help you turn your home office into a palace of productivity. \n\"A laptop stand will keep you from slouching and is good for your posture and health,\" says Holliday. \"A good rule of thumb is to get a stand that puts your eyes at two to three inches below your screen.\" \nHeadsets and noise machines can also help you get to work and avoid distractions. show chapters 5:31 PM ET Mon, 11 Sept 2017 | 01:19 6. Stay in contact \nWhen you are out of the office, it is even more important to stay in contact with your co-workers. \"Understanding good communication best practices may just be the most vital part of working remotely,\" says Holliday. \nYou can up your communication game by using messaging tools like Slack, online meeting tools like Zoom and document sharing services like Google Drive. 7. Keep a schedule \n\"Create your schedule around when the majority of your team is online and when you're most productive,\" says Holliday. \"Try to be as active and responsive as possible in chats during that team overlap window. Then schedule your deep work for when you're feeling most productive.\" \nKeeping a schedule like this can help you maximize your time while you are working at home. 8. Stay flexible \nBillionaire Richard Branson, who works from home six months of the year , says staying flexible is a crucial part of maintaining productivity. \n\"Too many companies don't realize the monotony of a lot of people's day-to-day life at work,\" he says. \"I try to encourage chief executives worldwide to make sure that there's as much flexibility in the workplace as possible.\" \nEmployees he says, work more effectively \"when they are given the freedom to make their own decisions.\" \nLike this story? Like CNBC Make It on Facebook \nDon't miss:", "external_links": [], "published": "2018-01-04T22:00:00.000+02:00", "crawled": "2018-01-04T22:03:34.006+02:00", "highlightTitle": ""}