{"organizations": [], "uuid": "33d40e04ac439fc2b0a94f328c13e379e44b9c61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-congress-surveillance/u-s-house-to-vote-to-renew-nsas-internet-surveillance-program-idUSL1N1P51W7", "country": "US", "domain_rank": 408, "title": "U.S. House to vote to renew NSA's internet surveillance program", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T22:11:00.000+02:00", "replies_count": 0, "uuid": "33d40e04ac439fc2b0a94f328c13e379e44b9c61"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-congress-surveillance/u-s-house-to-vote-to-renew-nsas-internet-surveillance-program-idUSL1N1P51W7", "ord_in_thread": 0, "title": "U.S. House to vote to renew NSA's internet surveillance program", "locations": [], "entities": {"persons": [{"name": "barack obama", "sentiment": "none"}, {"name": "edward snowden", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "house", "sentiment": "negative"}, {"name": "nsa", "sentiment": "negative"}, {"name": "house of representatives", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "national security agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 11 (Reuters) - The U.S. House of Representatives plans to vote on Thursday on whether to renew the National Security Agency’s warrantless internet surveillance program, as privacy advocates have mounted a last-ditch effort to limit its impact on Americans.\nThe vote is the culmination of a yearslong debate in Congress over the proper scope of U.S. intelligence collection, one fueled by the 2013 disclosures of classified surveillance secrets by former NSA contractor Edward Snowden.\nThe bill would extend the NSA’s spying program for six years with minimal changes. Most lawmakers expect it to become law if it prevails in the House, although it would still require Senate approval and must be signed into law by President Donald Trump.\nBut Trump appeared on Thursday to question the merits of the program, contradicting the official White House position and renewing unsubstantiated allegations that the previous administration of Barack Obama improperly surveilled his campaign during the 2016 election.\n“This is the act that may have been used, with the help of the discredited and phony Dossier, to so badly surveil and abuse the Trump Campaign by the previous administration and others?” the president tweeted. The White House did not immediately respond to a request to clarify Trump’s tweet.\nSome conservative, libertarian-leaning Republicans and liberal Democrats were attempting to persuade colleagues to support an amendment to the bill to include more privacy protections, such as requiring a warrant before the NSA or other intelligence agencies could search for and read digital communications belonging to Americans whose data is incidentally collected under the program.\nThe White House, U.S. intelligence agencies and Republican leaders in Congress have said they consider the tool indispensable and in need of little or no revision.\nWithout congressional action, legal support for Section 702 of the Foreign Intelligence Surveillance Act, which authorizes the program, will expire next week, although intelligence officials say it could continue to operate until April.\nSection 702 allows the NSA to eavesdrop on vast amounts of digital communications from foreigners living outside the United States via U.S. companies like Facebook Inc, Verizon Communications Inc and Alphabet Inc’s Google.\nBut the spying program also incidentally scoops up communications of Americans, including if they communicate with a foreign target living overseas, and can search those messages without a warrant. (Reporting by Dustin Volz; Additional reporting by Doina Chiacu; Editing by Lisa Von Ahn)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T22:11:00.000+02:00", "crawled": "2018-01-12T18:38:56.002+02:00", "highlightTitle": ""}