{"organizations": [], "uuid": "6a1f2ddf54141226c76621e298b3b149ac2a317d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219020877&w=1200&r=LYNXMPEE020GX", "site_section": "http://feeds.reuters.com/reuters/entertainment", "section_title": "Reuters: Entertainment News", "url": "https://www.reuters.com/article/us-britain-royals-economy/prince-harrys-wedding-to-meghan-markle-set-to-boost-uk-economy-idUSKBN1ES0PN", "country": "US", "domain_rank": 408, "title": "Prince Harry's wedding to Meghan Markle 'set to boost UK economy'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T12:50:00.000+02:00", "replies_count": 0, "uuid": "6a1f2ddf54141226c76621e298b3b149ac2a317d"}, "author": "", "url": "https://www.reuters.com/article/us-britain-royals-economy/prince-harrys-wedding-to-meghan-markle-set-to-boost-uk-economy-idUSKBN1ES0PN", "ord_in_thread": 0, "title": "Prince Harry's wedding to Meghan Markle 'set to boost UK economy'", "locations": [], "entities": {"persons": [{"name": "harry", "sentiment": "negative"}, {"name": "meghan markle", "sentiment": "negative"}, {"name": "elizabeth", "sentiment": "none"}, {"name": "kate", "sentiment": "none"}, {"name": "markle", "sentiment": "none"}, {"name": "william", "sentiment": "none"}, {"name": "david haigh", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "windsor castle", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "brand finance", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Prince Harry’s wedding to American actress Meghan Markle could provide a 500 million pound boost to Britain’s economy as tourists flock to the country and Britons celebrate, according to an estimate.\nHarry, Queen Elizabeth’s grandson and fifth-in-line to the throne, will tie the knot with Markle on May 19 at Windsor Castle, the royal palace home of British kings and queens for almost 1,000 years.\nThere were an extra 350,000 visitors to the UK in April 2011 when Harry’s elder brother William married his wife Kate compared to the same month the previous year, according to the Office for National Statistics.\nBusiness valuation consultancy Brand Finance predicted a similar surge in May and in total, it estimates the nuptials will generate some 500 million pounds ($680 million).\n“We think approximately 200 million pounds will come from tourism, travel, hotels,” the company’s chief executive David Haigh told Reuters.\nAbout 150 million pounds would be spent on people having parties and celebrating with 50 million coming from people buying T-shirts, hats and other commemorative items, he said.\nFILE PHOTO: Britain's Prince Harry poses with Meghan Markle in the Sunken Garden of Kensington Palace in London, Britain, November 27, 2017. REUTERS/Toby Melville/File Photo The wedding would also be worth about 100 million pounds in free advertising for Britain around the world, he added.\nBusinesses in Windsor are already gearing up to take advantage of the worldwide interest in the couple, with Harry, 33, one of the most popular members of the British royal family and Markle, 36, best known for her starring role in the TV legal drama “Suits”, providing some Hollywood sparkle.\nSlideshow (2 Images) “It’s going to be a massive boost for the economy, it’s going to be great to see so many people here for the wedding and actually to host the wedding itself,” said Andrew Lee, manager of the Harte and Garter hotel opposite Windsor Castle.\nSince their engagement was announced in November, Harry and Meghan merchandise has adorned the displays of Windsor’s tourist shops and mayor John Lenton said the town had been caught up in the excitement.\n“We are looking forward to it and we hope it will help to improve our tourist trades,” he said.\nBritish tourism bosses are already predicting 2018 to be a bumper year for the industry, aided by a fall in the value of the pound since the 2016 vote to leave the European Union which has attracted visitors and deterred Britons from vacationing abroad.\nVisitBritain, the national tourism agency, estimates that 41.7 million visits from overseas will be made to the United Kingdom in 2018, generating 26.9 billion pounds in the process.\nReporting by Jess Omari; writing by Michael Holden; editing by Stephen Addison\n ", "external_links": [], "published": "2018-01-03T12:50:00.000+02:00", "crawled": "2018-01-03T13:04:10.000+02:00", "highlightTitle": ""}