{"organizations": [], "uuid": "129d0d3ba96a76f98d24a082551be1932ce10561", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 18, "shares": 18, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220540618&w=1200&r=LYNXMPEE080WG", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-myanmar-journalists/bill-clinton-joins-calls-for-release-of-reuters-journalists-in-myanmar-idUSKBN1EY1HS", "country": "US", "domain_rank": 408, "title": "Bill Clinton joins calls for release of Reuters journalists in Myanmar", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:18:00.000+02:00", "replies_count": 0, "uuid": "129d0d3ba96a76f98d24a082551be1932ce10561"}, "author": "", "url": "https://www.reuters.com/article/us-myanmar-journalists/bill-clinton-joins-calls-for-release-of-reuters-journalists-in-myanmar-idUSKBN1EY1HS", "ord_in_thread": 0, "title": "Bill Clinton joins calls for release of Reuters journalists in Myanmar", "locations": [], "entities": {"persons": [{"name": "bill clinton", "sentiment": "negative"}, {"name": "robert birsel", "sentiment": "none"}, {"name": "kyaw soe oo", "sentiment": "none"}, {"name": "wa lone", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "min read  yangon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YANGON (Reuters) - Calls grew on Tuesday for the release of two Reuters journalists in Myanmar who are facing accusations of breaching the country’s Official Secrets Act, with former U.S. President Bill Clinton urging that they be freed immediately.\nThe reporters, Wa Lone, 31, and Kyaw Soe Oo, 27, were detained on Dec. 12. They are due to make their second appearance in court in the main city of Yangon on Wednesday.\nThe two had worked on Reuters coverage of a crisis in the western state of Rakhine, where an estimated 655,000 Rohingya Muslims have fled from a military crackdown that followed militant attacks on security forces.\n“A free press is critical to a free society - the detention of journalists anywhere is unacceptable. The Reuters journalists being held in Myanmar should be released immediately,” Clinton said in a Twitter post.\nClinton was U.S. president for much of the 1990s when the United States pressed Myanmar’s then military rulers to release democracy champion Aung San Suu Kyi from years of house arrest.\nSuu Kyi won a 2015 election and formed a government in early 2016, although she is barred by the constitution from becoming president. She has made no public comment on the case of the two Reuters reporters. Her spokesman has said the case would be handled according to the law.\nThe Ministry of Information has cited the police as saying the two reporters were “arrested for possessing important and secret government documents related to Rakhine State and security forces.”\nIt said they had “illegally acquired information with the intention to share it with foreign media”.\nThe Official Secrets Act dates back to 1923, when Myanmar, then known as Burma, was a province of British India. It carries a maximum prison sentence of 14 years.\nFormer U.S. ambassador to the United Nations Samantha Power referred in a post on Twitter to the detention of the two reporters as “an outrage & symptom of a world without credible US leadership”.\nFILE PHOTO: Reuters journalist Wa Lone, who is based in Myanmar, poses for a picture while attending a hostile environment course in Kanchanaburi Province, near Bangkok, Thailand, February 14, 2017. REUTERS/Andrew Marshall/File Photo Government officials from nations such as the United States, Britain and Canada, as well as top U.N. officials, have called for the release of the reporters.\nA spokeswoman for the U.S. State Department, Katina Adams, reiterated Washington’s deep concern about the prosecution of the journalists.\n“We call for their immediate and unconditional release, and for the charges against them to be dropped,” she said. “A free press is vital to Burma’s transition and to becoming a viable democracy, and we want Burma’s democracy to succeed.”\n‘INNOCENT OF WRONGDOING’\nSlideshow (3 Images) Reuters President and Editor-In-Chief Stephen J. Adler has called for the immediate release of the reporters.\n“As they near their hearing date, it remains entirely clear that they are innocent of any wrongdoing,” Adler said in a statement on Monday.\nA group of Myanmar reporters asked the government on Monday for details about the arrest of the two, arguing that the case could have implications for the ability of journalists to do their jobs.\nAuthorities have blocked most media access to the north of Rakhine State, where Rohingya militant attacks on the security forces on Aug. 25 sparked the military crackdown.\nThe United Nations has condemned the Myanmar military campaign as ethnic cleansing. Buddhist-majority Myanmar has rejected the accusation.\nThe Committee to Protect Journalists also called on Myanmar to release the two reporters.\nAn independent Myanmar media outlet, the Development Media Group, which is based in and focuses on coverage of events in Rakhine State, also called for the release of the pair.\nWriting by Robert Birsel; additional reporting by David Brunnstrom in Washington; Editing by Alex Richardson and Alistair Bell\n ", "external_links": [], "published": "2018-01-09T15:18:00.000+02:00", "crawled": "2018-01-09T15:30:31.000+02:00", "highlightTitle": ""}