{"organizations": [], "uuid": "7fdfef8d4f37b2d7ace0dc2b9815ede46591a637", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222692283&w=1200&r=LYNXMPEE0G0LE", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-carillion-restructuring/britain-needs-to-give-companies-more-time-to-save-carillion-linked-jobs-union-idUSKBN1F615C", "country": "US", "domain_rank": 408, "title": "Britain needs to give companies more time to save Carillion-linked jobs: union", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T12:28:00.000+02:00", "replies_count": 0, "uuid": "7fdfef8d4f37b2d7ace0dc2b9815ede46591a637"}, "author": "", "url": "https://www.reuters.com/article/us-carillion-restructuring/britain-needs-to-give-companies-more-time-to-save-carillion-linked-jobs-union-idUSKBN1F615C", "ord_in_thread": 0, "title": "Britain needs to give companies more time to save Carillion-linked jobs: union", "locations": [], "entities": {"persons": [{"name": "carilli", "sentiment": "negative"}, {"name": "greg clark", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}, {"name": "wolverhampton", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "carillion", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "gmb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wed Jan 17, 2018 / 9:05 AM EST UK PM May pressured to safeguard jobs after Carillion's collapse Costas Pitas FILE PHOTO: A logo is seen in front of cranes standing on a Carillion construction site in central London, Britain, January 16, 2018. Reuters/Simon Dawson FILE PHOTO: Workers at Carillion look out of a window after the company went into liquidation, in Wolverhampton, Britain. Reuters/Darren Staples \nLONDON (Reuters) - Britain needs to allow more time for firms to take on 8,500 workers whose jobs are threatened by the demise of Carillion, unions said on Wednesday, as Prime Minister Theresa May faced criticism for the way the government outsources public services. \nInfrastructure company Carillion ( CLLN.L ) collapsed on Monday when its banks pulled the plug, forcing the government to step in to guarantee services ranging from school meals to roadworks that the company had previously provided. \nBritain has said it will only pay Carillion workers on private sector contracts for 48 hours after the infrastructure firm’s fall and not offer them the same protection as those in the public sector. \nThe head of Britain's GMB union, who met business minister Greg Clark on Tuesday, said the government needed to allow more time for the 8,500 workers it estimates are now vulnerable. ADVERTISEMENT \n\"We want those other private sector companies to take on those workers ... That takes time,\" GMB General Secretary Tim Roache told BBC radio. \nOver 90 percent of Carillion's private sector service customers have said they will provide funding for now to allow the company's official receiver to retain employees on those contracts, Britain's Insolvency Service said on Wednesday. Related Coverage Keep going to work, Britain's May tells public service employees at Carillion \nThe demise of Carillion, the biggest British corporate failure in a decade, has left its 43,000 employees in limbo, banks with losses of over $1.3 billion and hundreds of suppliers likely to receive almost none of the money owed to them. \nJust as May grapples with Brexit, Carillion's fate has pulled her into a debate about whether the legacy of late former prime minister Margaret Thatcher, of the state paying private companies to provide essential public services, is right. \nMay, whose government had employed Carillion to work on 450 projects including the building and maintenance of hospitals and high-speed rail, came under fire from the opposition Labour leader. \n\"This isn't one isolated case of government negligence and corporate failure. It's a broken system,\" Jeremy Corbyn said during a weekly question session with the prime minister. \n\"These corporations ... need to be shown the door. We need our public services provided by public employees with a public service ethos and a strong public oversight,\" Corbyn, a socialist who has long opposed outsourcing, said. ADVERTISEMENT \nMay said the government had discussed the issue of credit lines to small and medium businesses and was liaising with those affected by Carillion's demise \"to make sure that we're on top of the potential effects on the wider supply chain\". \n\"We were a customer of Carillion, not the manager of Carillion and that's a very important difference and it is also important that we've protected taxpayers from an unacceptable bailout of a private company,\" she said. \n(Editing by Guy Faulconbridge and Alison Williams) ", "external_links": [], "published": "2018-01-17T12:28:00.000+02:00", "crawled": "2018-01-17T12:41:59.000+02:00", "highlightTitle": ""}