{"organizations": [], "uuid": "3c140810cb301faf329dc7f8dffa3b76a69d0fa8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/22/the-associated-press-milestone-for-port-of-savannah-4m-cargo-containers-in-2017.html", "country": "US", "domain_rank": 767, "title": "Milestone for Port of Savannah: 4M cargo containers in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T16:59:00.000+02:00", "replies_count": 0, "uuid": "3c140810cb301faf329dc7f8dffa3b76a69d0fa8"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/22/the-associated-press-milestone-for-port-of-savannah-4m-cargo-containers-in-2017.html", "ord_in_thread": 0, "title": "Milestone for Port of Savannah: 4M cargo containers in 2017", "locations": [], "entities": {"persons": [{"name": "griff lynch", "sentiment": "none"}], "locations": [{"name": "savannah", "sentiment": "none"}, {"name": "ga.", "sentiment": "none"}, {"name": "savannah", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "panama canal", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "georgia ports authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAVANNAH, Ga. (AP) — The Port of Savannah loaded and unloaded a milestone 4 million shipping container units for the first time in 2017 as larger cargo ships fueled double-digit growth at its docks, the Georgia Ports Authority announced Monday.\nThat makes Savannah only the fourth U.S. seaport to handle that many container units — each equal to one-half a standard 40-foot (12 meter) shipping container — of combined imports and exports in a single 12-month period.\nSavannah's busy seaport surpassed the 4 million mark in a calendar year marked by an 11 percent increase in containers, giant metal boxes used to ship goods ranging from consumer electronics to frozen chickens. Port officials largely attributed the growth to giant ships that began transiting an expanded Panama Canal in the summer of 2016.\n\"We fully expected to see increases, but we did not expect to see this,\" said Griff Lynch, executive director of Georgia's state-operated seaports. \"Every time we expect it to slow down a little, it doesn't.\"\nLess than four years have passed since the Savannah port first exceeded 3 million container units in 2014. And reaching that prior milestone from 2 million containers took eight years.\nGeorgia Ports officials hope the rapid growth will spur Washington to increase funding to deepen the Savannah River shipping channel that stretches 39 miles (63 kilometers) from the port to the Atlantic Ocean.\nLike other East Coast ports, Savannah needs deeper water to make room for larger ships that otherwise need to carry lighter loads or arrive at high tides.\nThe $973 million Savannah harbor expansion has been underway for more than two years, with dredging funded mostly by $260 million from Georgia taxpayers. Both President Donald Trump and Barack Obama before him have requested far less than the roughly $100 million in annual federal funding that state officials say the harbor deepening needs to avoid delays.\n\"We don't care where the money comes from, we've got to find the money to finish,\" said Jimmy Allgood, board chairman of the Georgia Ports Authority. \"We will lose business if the river is not deepened.\"\nGov. Nathan Deal has asked Georgia lawmakers this year to approve an additional $35 million in state funds for the harbor deepening. Allgood said that money should help fund dredging without interruption for another two years.\nExceeding 4 million container units puts the Port of Savannah far ahead of its nearest Southeast competitor, Charleston, South Carolina, which reported moving 2.2 million container units in calendar 2017.\nThree other U.S. ports still handle much heavier container traffic than Savannah. The Port of Los Angeles moved 9.3 million container units last year. The Port of Long Beach, California, handled 6.8 million through November, while the Port of New York and New Jersey reported more than 6.1 million container units during the same 11-month period.\nAnd it remains to be seen whether the Savannah port, which operates on a fiscal-year calendar, will remain above 4 million units for the fiscal 2018 period that began in July and ends June 30.\n\"That's a really good question,\" said Lynch, who expects growth to slow in the coming months. \"I think we will. But it's not a lock for sure.\"", "external_links": [], "published": "2018-01-22T16:59:00.000+02:00", "crawled": "2018-01-23T08:19:17.016+02:00", "highlightTitle": ""}