{"organizations": [], "uuid": "cba284884e3248505f9a45b80566f517d34fb961", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-fiat-chrysler-corruption-labor/former-fiat-chrysler-exec-expected-to-plead-guilty-in-payments-probe-source-idUSKBN1F524D", "country": "US", "domain_rank": 408, "title": "Former Fiat Chrysler exec expected to plead guilty in payments probe: source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T18:49:00.000+02:00", "replies_count": 0, "uuid": "cba284884e3248505f9a45b80566f517d34fb961"}, "author": "", "url": "https://www.reuters.com/article/us-fiat-chrysler-corruption-labor/former-fiat-chrysler-exec-expected-to-plead-guilty-in-payments-probe-source-idUSKBN1F524D", "ord_in_thread": 0, "title": "Former Fiat Chrysler exec expected to plead guilty in payments probe: source", "locations": [], "entities": {"persons": [{"name": "david shep", "sentiment": "none"}, {"name": "alphons iacobelli", "sentiment": "none"}, {"name": "iacobelli", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "fiat chrysler", "sentiment": "negative"}, {"name": "office", "sentiment": "none"}, {"name": "fiat chrysler automobiles nv", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "united auto workers", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "district court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (Reuters) - Former Fiat Chrysler Automobiles NV vice president Alphons Iacobelli is expected to plead guilty in connection with a U.S. Justice Department investigation into allegations he made at least $1.2 million in improper payments to a former union vice president and his wife, two people briefed on the matter said on Tuesday.\nIacobelli, a former Fiat Chrysler vice president of employee relations, was charged in July in U.S. District Court in Detroit with taking part in a conspiracy to pay prohibited money and gifts to United Auto Workers union officials. A not guilty plea was initially entered on his behalf in August but he did not comment when asked by reporters about the case.\nA court notice made public on Tuesday said Iacobelli is scheduled to enter a new plea on Jan. 22, but the details of the plea agreement are not known. A lawyer for Iacobelli declined to comment. The U.S. Attorney’s Office in Detroit did not immediately comment.\nMonica Morgan, the wife of former UAW Vice President General Holiefield who died in March 2015, is also expected to plead guilty, a person briefed on the matter said.\nMorgan was charged with conspiring with Iacobelli to violate federal labor law. A Jan. 24 hearing for Morgan to enter a new plea was disclosed on Monday. Morgan’s lawyer, Steve Fishman, declined comment.\nThe Justice Department has a wide-ranging investigation underway. In November, General Motors Co and Ford Motor Co confirmed they are cooperating with the investigation into alleged misspending at UAW union training centers funded by U.S. automakers.\nThe Detroit News reported that prosecutors had issued subpoenas about the UAW automaker training centers and investigators were looking at charities operated by senior union officials at the companies.\nGeneral Motors is conducting an internal investigation into the matter.\nThe government previously charged Jerome Durden, a former Fiat Chrysler official, with conspiring to divert over $4.5 million in UAW training center funds. Durden pleaded guilty on Aug. 8.\nThe head of the Detroit FBI, David Gelios, has said “years of fraud and corruption within a select group of the FCA and UAW hierarchy continue to be eroded through the diligence and collaboration of law enforcement.”\nFiat Chrysler Chief Executive Sergio Marchionne has said the “deplorable” conduct “had nothing whatsoever to do with the collective bargaining process” and the “egregious acts were neither known to nor sanctioned by (Fiat Chrysler).”\nUAW President Dennis Williams said last month the union will “never tolerate this type of misconduct.” The union believes “several former UAW officials acted in a clear violation of union policy,” he added.\nReporting by David Shepardson; Editing by Frances Kerry and Susan Thomas\n ", "external_links": [], "published": "2018-01-16T18:49:00.000+02:00", "crawled": "2018-01-16T19:04:08.043+02:00", "highlightTitle": ""}