{"organizations": [], "uuid": "041477bd7fbad3b483c3069d86fe442c02ed8062", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-spar-group-acquires-resource-plus-expands-u-s-installation-and-merchandising-services-businesses.html", "country": "US", "domain_rank": 767, "title": "SPAR Group Acquires Resource Plus, Expands U.S. Installation and Merchandising Services Businesses", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.246, "site_type": "news", "published": "2018-01-12T00:05:00.000+02:00", "replies_count": 0, "uuid": "041477bd7fbad3b483c3069d86fe442c02ed8062"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-spar-group-acquires-resource-plus-expands-u-s-installation-and-merchandising-services-businesses.html", "ord_in_thread": 0, "title": "SPAR Group Acquires Resource Plus, Expands U.S. Installation and Merchandising Services Businesses", "locations": [], "entities": {"persons": [{"name": "richard justus", "sentiment": "none"}], "locations": [{"name": "white plains", "sentiment": "none"}, {"name": "n.y.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "spar group acquires resource plus", "sentiment": "negative"}, {"name": "u.s. installation and merchandising services businesses", "sentiment": "negative"}, {"name": "spar group, inc.", "sentiment": "neutral"}, {"name": "mobex", "sentiment": "none"}, {"name": "resource plus, inc.", "sentiment": "none"}, {"name": "mobex of north florida, inc.", "sentiment": "none"}, {"name": "leasex, llc", "sentiment": "none"}, {"name": "spar group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHITE PLAINS, N.Y., Jan. 11, 2018 (GLOBE NEWSWIRE) -- SPAR Group, Inc. (Nasdaq:SGRP), a leading supplier of retail merchandising, business technology and other marketing services in ten countries throughout North America, Latin America, Asia Pacific and Africa, today announced that it is expanding its domestic business by acquiring a 51% interest in Resource Plus, Inc., a supplier of professional fixture installation and product merchandising services; a 51% interest in Mobex of North Florida, Inc., a proprietary retail fixture mobilization system manufacturer; and a 51% interest in Leasex, LLC, a company formed to lease Mobex’s proprietary equipment (collectively, \"Resource Plus\").\nHeadquartered in Jacksonville, Florida, Resource Plus provides a wide variety of services to U.S. retailers and product manufacturers including customized weekly merchandising and complex new store and retail fixture buildouts. With the close of the acquisition, Resource Plus will run as a subsidiary of SPAR Group. Richard Justus, will remain as CEO of Resource Plus and continue to run the operations, as he has for the past 18 years.\nRichard Justus, CEO of Resource Plus, said, ‘’Gaining SPAR as a partner will deliver new value-added enhancements for our customers. SPAR’s proprietary retail operating system SPARview, enables tighter operational controls to provide faster, more efficient store execution along with enhanced insight into retail conditions. Additionally, SPAR’s network of more than 8,500 merchandising specialists expands our ability to potentially accept more projects and accelerate program execution.”\nChris Olivier, CEO of SPAR Group, said, ‘’The skills, expertise and services added by Resource Plus align well with the evolving needs of the retail landscape, particularly those retailers that are adding new concepts and formats to revitalize the overall shopper experience. Furthermore, Resource Plus offers access to complementary channels and retail customers. Richard and the Resource Plus team have exceptional expertise and operational knowledge which will not only bring value to SPAR domestically, but also to SPAR’s international operations.”\nAbout Resource Plus\nResource Plus is a professional fixture installation and product merchandising company. The Company’s Professional Installation and Merchandising Services divisions execute programs for a variety of retail clientele and all classes of trade encompassing grocery, drug, department, furniture, hardware, computer/office supply, electronic, specialty, hotels and home improvement outlets. The Resource Plus Merchandising Services Branch maintains a 30,000 square foot office, plan-o-gram and warehouse facility located in Mooresville, North Carolina. The home office facility in Jacksonville, Florida supports all divisions of the company and also serves as the Installation Division headquarters. Resource Plus also owns a 70% interest in BDA Resource, LLC, a joint venture focused on installation of store-within-a-store fixtures in domestic retail outlets.\nAbout SPAR Group\nSPAR Group, Inc. is a diversified international merchandising and marketing services Company and provides a broad array of services worldwide to help companies improve their sales, operating efficiency and profits at retail locations. The Company provides merchandising and other marketing services to manufacturers, distributors and retailers worldwide, and coordinates the operations through the use of multi-lingual proprietary technology which drives the logistics, communication and reporting for global operations and customers. SPAR works primarily in mass merchandiser, office supply, grocery, drug, dollar, independent, convenience, toy, home improvement and electronics stores, as well as providing furniture and other product assembly services, audit services, in-store events, technology services and marketing research. The Company has supplied these product services in the United States since certain of its predecessors were formed in 1979 and internationally since the Company acquired its first international subsidiary in Japan in May 2001. Product services include restocking and adding new products, removing spoiled or outdated products, resetting categories \"on the shelf\" in accordance with client or store schematics, confirming and replacing shelf tags, setting new sale or promotional product displays and advertising, replenishing kiosks, demonstrating or promoting a product, providing in-store event staffing services and providing assembly services in stores, homes and offices. Audit services include price audits, point of sale audits, out of stock audits, intercept surveys and planogram audits. Other merchandising services include whole store or departmental product sets or resets (including new store openings), new product launches, in-store demonstrations, special seasonal or promotional merchandising, focused product support and product recalls. The Company currently does business in 10 countries that encompass approximately 50% of the total world population through its operations in the United States, Australia, Brazil, Canada, China, India, Japan, Mexico, South Africa and Turkey. For more information, please visit the SPAR Group's website at http://www.sparinc.com .\nCompany Contact:\nJames R. Segreto\nChief Financial Officer\nSPAR Group, Inc.\n(914) 332-4100\nInvestor Contact:\nDave Mossberg\nThree Part Advisors\n(817) 310-0051\nSource: SPAR Group", "external_links": ["https://www.globenewswire.com/Tracker?data=ArjiOYgBEpES219QiykFdbuzJ4sPvEd-ANl5TvMxHwB1KCur9YRuIiM1duLmhAXZNv8XiMn8ix-EnicF-194YRKn-QAlTmSooboSLXPt_vkTr1BvqDG8s4QAmBOCoTTcV6yXlrFvjCQitqExrYJ-R0ZHIZ20Z1DW7EETmX4jAjiNrtYsoWayFRgx9Rb0aUB_Thjr8byniMNU6MvabK9Eizb_5hPuyRk5ECauSHOfua4=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/38c6f76c-035d-40ad-9178-793af88f56c3"], "published": "2018-01-12T00:05:00.000+02:00", "crawled": "2018-01-12T02:40:13.000+02:00", "highlightTitle": ""}