{"organizations": [], "uuid": "1b44341766244f1adaef854902b5420a4e42f8bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-lendingclub-continues-to-caution-investors-against-unsolicited-exchange-offer-from-ieg-holdings.html", "country": "US", "domain_rank": 767, "title": "LendingClub Continues to Caution Investors Against Unsolicited Exchange Offer from IEG Holdings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T00:10:00.000+02:00", "replies_count": 0, "uuid": "1b44341766244f1adaef854902b5420a4e42f8bd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-lendingclub-continues-to-caution-investors-against-unsolicited-exchange-offer-from-ieg-holdings.html", "ord_in_thread": 0, "title": "LendingClub Continues to Caution Investors Against Unsolicited Exchange Offer from IEG Holdings", "locations": [], "entities": {"persons": [], "locations": [{"name": "america", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "lendingclub continues to caution investors against unsolicited exchange", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "lendingclub", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "ieg", "sentiment": "none"}, {"name": "ieg holdings corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 9, 2018 /PRNewswire/ -- LendingClub (NYSE: LC), America's largest online marketplace connecting borrowers and investors, today announced that on January 2, 2018, its Board of Directors (the \"Board\") received another letter from IEG Holdings Corporation (\"IEG\"), which had previously commenced an unsolicited tender offer for LendingClub's stock in July 2017 and withdrew the tender offer less than a month later. IEG's letter states its intention to acquire up to 4.99% of the outstanding common stock of LendingClub on the basis of 13 shares of IEG common stock for each share of LendingClub common stock. On January 5, 2018, IEG announced the commencement of its proposed exchange offer. The Board believes there is no rational economic basis upon which LendingClub stockholders should accept IEG's proposed exchange offer, which appears intended to mislead investors into mistakenly tendering into a discounted offer. The Board has unanimously concluded the offer is grossly inadequate, is not in the best interests of LendingClub and its stockholders and urges stockholders not to be misled into tendering into the offer.\nThere is ample evidence indicating that IEG is attempting to profit at the expense of LendingClub investors for its own personal gain. As detailed in LendingClub's July 7, 2017 press release , IEG has attempted similar manipulative offers on multiple occasions. IEG Holdings has a history of these deceptive practices and set up operations in the US after the Australian Securities & Investments Commission issued a stop order relating to the sale of securities by IEG's predecessor in Australia.\nThe Board unanimously recommends that stockholders ignore IEG's proposed exchange offer. In making its determination, the Board considered many of the same reasons that were listed in the July 7, 2017 press release. The Board also considered that, if the proposed exchange offer were successful, IEG would need to issue approximately 269 million additional shares of IEG common stock, which would result in severe dilution for those holders. As IEG currently has only approximately 17 million shares of common stock outstanding, the issuance of over 15 times the current amount of outstanding common stock would result in severe dilution of the IEG common stock and likely a steep decrease in stock price. If the exchange offer were successful, current IEG holders would hold about 5% of IEG common stock and current LendingClub stockholders would hold about 95% of IEG, meaning IEG would effectively have undergone a sale of itself to LendingClub by way of this offer.\nSkadden, Arps, Slate, Meagher & Flom LLP is acting as legal advisor to LendingClub.\nAbout LendingClub\nLendingClub was founded to transform the banking system to make credit more affordable and investing more rewarding. Today, LendingClub's online credit marketplace connects borrowers and investors to deliver more efficient and affordable access to credit. Through its technology platform, LendingClub is able to create cost efficiencies and passes those savings onto borrowers in the form of lower rates and to investors in the form of solid returns. LendingClub is based in San Francisco, California.\nForward-Looking Statements\nThis press release contains forward-looking statements. Forward-looking statements are not statements of historical fact but instead represent only management's current beliefs regarding future events. Forward-looking statements include, without limitation, statements concerning future plans, objectives, goals, projections, strategies, events or performance, and underlying assumptions and other statements related thereto. The words \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"outlook,\" \"plan,\" \"predict,\" \"project,\" \"will,\" \"would\" and similar expressions may identify forward-looking statements, although not all forward-looking statements contain these identifying words. Factors that could cause actual results to differ materially from those contemplated by these forward statements include: the outcomes of pending governmental investigations and pending or threatened litigation, which are inherently uncertain; the impact of management changes and the ability to continue to retain key personnel; the ability to achieve cost savings from recent restructurings; LendingClub's ability to continue to attract and retain new and existing retail and institutional investors; competition; overall economic conditions; demand for the types of loans facilitated by LendingClub; default rates and those factors set forth in the section titled \"Risk Factors\" in LendingClub's most recent Quarterly Report on Form 10-Q and Annual Report on Form 10-K, each filed with the SEC. LendingClub may not actually achieve the plans, intentions or expectations disclosed in forward-looking statements, and you should not place undue reliance on forward-looking statements. Actual results or events could differ materially from the plans, intentions and expectations disclosed in forward-looking statements. LendingClub does not assume any obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\nView original content with multimedia: http://www.prnewswire.com/news-releases/lendingclub-continues-to-caution-investors-against-unsolicited-exchange-offer-from-ieg-holdings-300580267.html\nSOURCE LendingClub", "external_links": ["http://ir.lendingclub.com/file.aspx?IID=4213397&FID=389384009", "http://www.prnewswire.com/news-releases/lendingclub-continues-to-caution-investors-against-unsolicited-exchange-offer-from-ieg-holdings-300580267.html", "http://www.lendingclub.com/"], "published": "2018-01-10T00:10:00.000+02:00", "crawled": "2018-01-10T02:21:40.000+02:00", "highlightTitle": ""}