{"organizations": [], "uuid": "6e1715c24e6807f462fcfdcb76c8e9fe574a9b67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/brainstorm-health-daily-01-22-18/", "country": "US", "domain_rank": 1196, "title": "Brainstorm Health: A Dispatch from Davos, Celgene Juno Deal, Sanofi Bioverativ Acquisition | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.583, "site_type": "news", "published": "2018-01-23T14:53:00.000+02:00", "replies_count": 0, "uuid": "6e1715c24e6807f462fcfdcb76c8e9fe574a9b67"}, "author": "Clifton Leaf", "url": "http://fortune.com/2018/01/22/brainstorm-health-daily-01-22-18/", "ord_in_thread": 0, "title": "Brainstorm Health: A Dispatch from Davos, Celgene Juno Deal, Sanofi Bioverativ Acquisition | Fortune", "locations": [], "entities": {"persons": [{"name": "clifton leaf", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}, {"name": "klaus schwab", "sentiment": "none"}, {"name": "adam lashinsky", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "sanofi bioverativ acquisition", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Clifton Leaf 12:53 PM EST \nGood morning from Davos, Switzerland, where corporate and country muckety-mucks are gathered under a deep canopy of fresh snow for the annual World Economic Forum meeting. My colleague Adam Lashinsky has a really nice stage-setter in his must-read Data Sheet newsletter ( here’s a link ), to which I refer you all. \nThe overarching theme this year is on “creating a shared future in a fractured world,” and the subthemes are ones that Davos types have been homing in on for ages: sustainable development, inclusive growth, global collaboration and integration on an ever-divided planet, and making sure that millions (or even billions) of people aren’t left behind in the massive economic reorientation brought on by the “Fourth Industrial Revolution,” as Davos founder Klaus Schwab calls it. \nThe fact that the world’s business and government leaders keep coming back to these lofty notions doesn’t make them less important. It’s easy, perhaps even too easy, to be snarky about such high-minded agendas—especially when so many of the world’s rich and powerful go back to ignoring such bullet items on the remaining 362 days of the year. But the big idea of finding common ground is indeed a worthy big idea—and it’s no less worthy being discussed in an alpine skiing village than it is anywhere else, I suppose. (Well…maybe a little.) \nAs for me, I’m here to moderate two panels that I’m truly excited about—the first (tomorrow morning) will dive into how we can switch our healthcare paradigm to one centered on outcomes and patient-centered value rather than on individual services (doctor’s visits, X-ray scans, blood tests, etc.), each of which is billed separately. (Faithful readers will remember I wrote about this concept here , in an essay offering a couple of healthcare predictions for the year .) Tomorrow’s group of panelists is a terrific one and I hope and suspect we’ll get pretty deep into the challenges and opportunities of this model. \nThe second discussion (on Wednesday) is on integrating mental healthcare into a care system that’s almost wholly focused on blood, guts, and bones, so to speak. We’ve got another fantastic group of experts for this one as well—and, yes, I think there’s a fair amount of crossover with Tuesday’s topic: a value-based healthcare system that focuses on the whole of the human condition and not just on its moving parts. \nI’ll have some more Davos downloads for you tomorrow and Wednesday. Below, the news. Clifton Leaf, Editor in Chief, FORTUNE @CliftonLeaf DIGITAL HEALTH \nShould gene-edited products be regulated like GMOs? A formal opinion issued by an advocate general in the European Court of Justice argues that drugs and foodstuffs developed via gene-editing technology like CRISPR-Cas9 shouldn’t necessarily be subject to the same rigorous scrutiny as other genetically modified organisms are in Europe. This has been an important regulatory issue in the EU given the stringent nature of the laws regarding genetically modified organisms. ( Nature ) INDICATIONS \nA duo of big biopharma deals gets 2018 off to a strong M&A start. 2017 represented an M&A rut for biopharma; but on Monday, both Celgene and Sanofi announced some significant acquisitions. Celgene is scooping up cancer drug maker Juno Therapeutics for $9 billion while Sanofi is buying the Biogen spinout Bioverativ for $11.6 billion. Analysts lauded the Celgene deal in particular—check out why here . ( Fortune ) THE BIG PICTURE \nFDA reviews Philip Morris’ heat-not-burn tobacco device. The Food and Drug Administration (FDA) has issued a preliminary review of tobacco giant Philip Morris’ iQOS device, a product which “heats” tobacco rather than burning it. Philip Morris has asserted that such a system is less damaging to health than conventional cigarettes. The FDA’s finding? The aerosol from iQOS can damage cells affect tissue, but these effects “are generally less severe and observed at much higher concentrations” than with cigarette smoke. Philip Morris has recently stated that it wants to move away from traditional tobacco and more broadly into the vaping and electronic tobacco device market. ( Reuters ) REQUIRED READING ", "external_links": [], "published": "2018-01-23T14:53:00.000+02:00", "crawled": "2018-01-23T00:53:04.000+02:00", "highlightTitle": ""}