{"organizations": [], "uuid": "4b70fde5187b3a3f7ed6e7d6004cd0d071e25781", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-settlement-dtcc/post-trade-group-working-to-further-shorten-u-s-settlement-cycle-idUSKBN1F12BX", "country": "US", "domain_rank": 408, "title": "Post-trade group working to further shorten U.S. settlement cycle", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T02:39:00.000+02:00", "replies_count": 0, "uuid": "4b70fde5187b3a3f7ed6e7d6004cd0d071e25781"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-settlement-dtcc/post-trade-group-working-to-further-shorten-u-s-settlement-cycle-idUSKBN1F12BX", "ord_in_thread": 0, "title": "Post-trade group working to further shorten U.S. settlement cycle", "locations": [], "entities": {"persons": [{"name": "mike mcclain", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "dtcc", "sentiment": "none"}, {"name": "depository trust and clearing corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 6:39 PM / Updated 15 minutes ago Post-trade group working to further shorten U.S. settlement cycle John McCrank 3 Min Read \nNEW YORK (Reuters) - The post-trade processor for U.S. stocks, as well as corporate and municipal bonds, said it is taking steps to further cut the time it takes to settle trades in a bid to reduce risk in the financial system and free up more capital. \nThe U.S. financial services industry moved to a two-day settlement cycle, which refers to the time an investor’s order is executed to when cash and ownership of the security must be exchanged, from three days in September. Three-day settlement had been in place since 1995. \nThe move reduced capital requirements for financial firms by 25 percent, or $1.36 billion, in part because it meant trading margins did not need to be held as long, according to the Depository Trust and Clearing Corporation. \nNow the DTCC, an industry-owned organization that processes nearly all U.S. securities transactions, plans to cut another full market day of risk from the settlement cycle by settling trades in the morning, pre-market open, instead of later in the afternoon, said Mike McClain, head of equity clearing at the DTCC. \nThe move, planned for early next year, will not require any changes by industry participants and will again reduce capital requirements for trading firms, McClain said in an interview. He said the DTCC is working on a study to determine the exact amount of savings to the industry. \nThe idea of shortening the settlement cycle gained steam during the 2007-09 global financial crisis as a way for firms to limit the risk associated with the person or firm on the other side of a trade defaulting. \nCurrently, traders can choose to have their orders settled in a single day, but it can be difficult to find the other side of a trade that is also seeking faster settlement. Such trades make up less than one percent of the 56 million trades the DTCC processes on an average day. \nIn an effort to make it easier to match buyers and sellers who want expedited settlement, the DTCC is also in talks with two alternative trading system (ATS) operators about helping to create exchange-like trading venues that would only accept orders for single day settlement, McClain said. \nHe declined to name the ATS operators because the talks are ongoing, but said at least one of the trading venues could have the changes in place this year. Reporting by John McCrank; Editing by Susan Thomas", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T02:39:00.000+02:00", "crawled": "2018-01-12T20:46:39.008+02:00", "highlightTitle": ""}