{"organizations": [], "uuid": "af59e0c38b9207a2df8ce51a17747d1597a9ffa2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-congo-violence/scores-convicted-in-congos-beni-massacre-trial-idUSKBN1FD2OV", "country": "US", "domain_rank": 408, "title": "Scores convicted in Congo's Beni massacre trial", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T20:36:00.000+02:00", "replies_count": 0, "uuid": "af59e0c38b9207a2df8ce51a17747d1597a9ffa2"}, "author": "", "url": "https://www.reuters.com/article/us-congo-violence/scores-convicted-in-congos-beni-massacre-trial-idUSKBN1FD2OV", "ord_in_thread": 0, "title": "Scores convicted in Congo's Beni massacre trial", "locations": [], "entities": {"persons": [{"name": "beni", "sentiment": "neutral"}, {"name": "joseph kabila", "sentiment": "none"}], "locations": [{"name": "congo", "sentiment": "none"}, {"name": "democratic republic of congo", "sentiment": "none"}, {"name": "uganda", "sentiment": "none"}, {"name": "goma", "sentiment": "none"}], "organizations": [{"name": "fiston mahamba", "sentiment": "neutral"}, {"name": "adf", "sentiment": "none"}, {"name": "allied democratic forces", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GOMA, Democratic Republic of Congo (Reuters) - A military tribunal investigating a wave of massacres in eastern Congo blamed on Ugandan rebels has convicted 134 people, a senior army prosecutor and a human rights group said on Wednesday.\nMore than 800 people were killed -- often hacked to death with machetes during the night -- around the town of Beni, near Democratic Republic of Congo’s border with Uganda, between 2014 and 2016.\nCongolese authorities say the Allied Democratic Forces (ADF), a Ugandan Islamist group active in the area, were behind the killings, but Congolese army officers have also been accused of involvement.\nRebel and militia attacks are on the rise again in central and eastern Congo and the latest violence coincides with a political crisis brought on by President Joseph Kabila’s decision to overstay his mandate, which expired in December 2016.\nCongolese troops are currently battling the ADF in the eastern border zones in coordination with the Ugandan military.\nGeneral Timothee Mukutu, the Congolese army’s First Advocate-General, said a portion of the earlier massacres were committed by ADF fighters during supply raids or in reprisal attacks.\n“Others were carried out by proxy on the orders of certain local figures,” he said in an interview broadcast by U.N.-supported Radio Okapi. “We came to understand that there were poorly managed land conflicts that could be an explanation.”\nCEPADHO, a human rights group that observed the trials, said that of those convicted - a mix of ADF rebels, militia fighters, civilians and local chiefs - 42 were sentenced to death, several of them in absentia.\nCongo does not apply the death penalty and, in practice, those who receive it serve prison sentences instead. Other defendants received lighter sentences and 45 were acquitted.\nARMY INVOLVEMENT? A report by New York University’s Congo Research Group published last year found that senior army officers, including the former top general in the zone, supported and in some cases organized the killings.\nBased on 249 interviews with perpetrators, witnesses and victims as well as internal U.N. reports and arrest records, it found they collaborated with local fighters and, in some cases, soldiers secured the perimeter so that victims could not escape.\nHowever, during the 17 months of trials, the mobile military tribunal, only convicted one army officer, a colonel. He was sentenced to a four-year jail term.\nThree men were convicted of “demoralizing the army in the aim of harming national defense” for publicly accusing government and military authorities of organizing the massacres.\nWriting by Joe Bavier\n ", "external_links": [], "published": "2018-01-24T20:36:00.000+02:00", "crawled": "2018-01-24T20:48:38.012+02:00", "highlightTitle": ""}