{"organizations": [], "uuid": "2e12a01f4d84579f6f1845a50d136d5718a96dc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/30/104499435-Case-Shiller_home_price_index.1910x1000.jpg", "site_section": "http://feeds.feedburner.com/DrudgeReportFeed", "section_title": "Drudge Report Feed", "url": "https://www.cnbc.com/2018/01/30/home-prices-surge-to-new-high-up-6-point-2-percent-in-november.html", "country": "US", "domain_rank": 767, "title": "Home prices surge to new high...", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:07:00.000+02:00", "replies_count": 0, "uuid": "2e12a01f4d84579f6f1845a50d136d5718a96dc8"}, "author": "", "url": "https://www.cnbc.com/2018/01/30/home-prices-surge-to-new-high-up-6-point-2-percent-in-november.html", "ord_in_thread": 0, "title": "Home prices surge to new high...", "locations": [], "entities": {"persons": [{"name": "david m. blitzer", "sentiment": "none"}, {"name": "joe raedle", "sentiment": "none"}], "locations": [{"name": "miami", "sentiment": "none"}], "organizations": [{"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "REITs Home prices surge to new high, up 6.2% in November The supply crisis in the housing market is not letting up, and neither are the home price gains. National home prices rose 6.2 percent annually on S&P CoreLogic Case-Shiller's most broad survey. Another S&P index of the nation's 20 largest housing markets showed a 6.4 percent gain, higher than analysts had expected. 1 Hour Ago | 01:28 \nThe supply crisis in the housing market is not letting up, and consequently neither are the gains in home values. \nNational home prices continued their run higher in November, rising 6.2 percent annually on S&P CoreLogic Case-Shiller's most broad survey, up from 6.1 percent in October. Another S&P index of the nation's 20 largest housing markets showed a 6.4 percent gain, higher than analysts had expected. \nPrices nationally are now 6 percent higher than their 2006 peak, while those in the top 20 markets are still 1.1 percent lower. \n\"Home prices continue to rise three times faster than the rate of inflation ,\" says David M. Blitzer, Managing Director and Chairman of the Index Committee at S&P Dow Jones Indices. \nBlitzer blames the continued lack of supply for the price gains, citing a very slow recovery in the home construction market. Home builders are ramping up production but are still not at even historically normal levels, never mind the huge pent-up demand in the market. \n\"Without more supply, home prices may continue to substantially outpace inflation,\" added Blitzer \nLocal metropolitan markets seeing the highest gains are those that were rising fastest before the financial crisis. San Diego, Los Angeles, and Las Vegas continue to see strong gains. Seattle and San Francisco are seeing the highest gains of all, due to strong employment and very tight supply in both those markets. \nHome prices in November were still benefiting from very low mortgage interest rates, but that is no longer the case. Mortgage rates are up dramatically since the start of this year , making housing less affordable. That could put downward pressure on home prices during the spring market, especially compounded by new tax laws that limit the deductions for property taxes and mortgage interest. \nPrices are unlikely to ease by much, however, given the still very short supply of homes for sale. The simple rules of low supply and high demand will serve as a strong contender against higher rates, as bidding wars will likely be less the exception and more the rule in the upcoming spring market. WATCH: The hidden costs of buying a home show chapters", "external_links": [], "published": "2018-01-30T16:07:00.000+02:00", "crawled": "2018-01-30T16:09:58.034+02:00", "highlightTitle": ""}