{"organizations": [], "uuid": "7d0aa32f15c59f70a712e9e38bb7c4ac8ce8875c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/cyber-gdpr-consultants/rpt-business-booms-for-privacy-experts-as-landmark-data-law-looms-idUSL8N1PG128", "country": "US", "domain_rank": 408, "title": "RPT-Business booms for privacy experts as landmark data law looms", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T17:00:00.000+02:00", "replies_count": 0, "uuid": "7d0aa32f15c59f70a712e9e38bb7c4ac8ce8875c"}, "author": "", "url": "https://www.reuters.com/article/cyber-gdpr-consultants/rpt-business-booms-for-privacy-experts-as-landmark-data-law-looms-idUSL8N1PG128", "ord_in_thread": 0, "title": "RPT-Business booms for privacy experts as landmark data law looms", "locations": [], "entities": {"persons": [{"name": "salvador rodriguez", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "general data protection regulation", "sentiment": "none"}, {"name": "gdpr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 3:00 PM / Updated 43 minutes ago RPT-Business booms for privacy experts as landmark data law looms Reuters Staff \n(Repeats story with no changes) \n* Companies globally race to comply with GDPR by May deadline \n* Has created flood of work for privacy lawyers, software experts \n* Axiom for example has 200 lawyers working on GDPR, hiring staff \n* New EU rules give Europeans more control over their online data \n* GDPR GRAPHIC-How new regulation works: tmsnrt.rs/2DhT0XL \nBy Salvador Rodriguez \nSAN FRANCISCO, Jan 22 (Reuters) - Business is booming for software and privacy experts as companies across the globe spend millions of dollars to comply with a landmark European data protection law, even as many uncertainties remain about how the rules will be enforced. \nThe General Data Protection Regulation (GDPR), which goes into effect in May, is the biggest shake-up of personal data privacy rules since the birth of the internet. It is intended to give European citizens more control over their online information and applies to all companies that do business with Europeans. \nThe industries most deeply affected will be those that collect large amounts of customer data and include technology companies, retailers, healthcare providers, insurers and banks. \nThe law has a slew of technically complex requirements, and threatens fines of as much as 4 percent of a company’s annual revenue for those who fail to comply. Companies must be able to provide European customers with a copy of their personal data and under some circumstances delete it at their behest. They will also be required to report data breaches within 72 hours. \nThe cottage industry that’s developed around GDPR includes lawyers who advise on compliance, cyber security consultants, and software developers that help firms conduct painstaking inventories of vast amounts of data to identify and index information so it can be made available to Europeans at their request. \nNew York legal services firm Axiom, for example, told Reuters it had more than 200 data privacy lawyers working on GDPR projects - about a sixth of all its lawyers. \nIt said it would hire over 100 more staff this year to deal with GDPR and also create training programs so that more of its lawyers would be qualified to work on those types of projects. \nWim Remes, a cyber security consultant in Brussels, said he was fielding about a dozen GDPR-related calls per week. His clients are based in Europe and the Americas and include retailers and technology firms. \nHe said American companies had been slower off the mark to respond to GDPR than their European counterparts and were now scrambling to catch up. “In the last two or three months, the demand has mostly been from U.S. organizations,” he added. COMPANIES SPEND MILLIONS \nThe costs are substantial: among 300 big companies in the process of becoming GDPR compliant, 40 percent said they had spent more than $10 million, and 88 percent said they had spent more than $1 million, according to a PwC survey of American, British and Japanese executives published in September. \n“People really aren’t picking up the phone for less than $1.5 million to $2 million,” Gant Redmon, program director of cyber security and privacy at IBM Resilient, said of legal and software consultancy firms advising on GDPR. \nThe work will not end on May 25, when GDPR kicks in, as companies will be required to provide regular data audits for EU authorities to prove they are compliant. Companies that handle especially sensitive information will have to hire a data protection officer. \nLingesh Palaniappan, CEO of Grit Software Systems, described the work he’s doing on GDPR compliance for a mid-sized software company as a grueling manual process. \nHis staff has to go through every software application and database and record details such as the exact type of data they contain - whether it be names and addresses, or more personal information like medical records - and who has access to it. The team builds charts to keep top management informed on how far along the company is in its GDPR compliance process. \n“Currently, we are literally taking an Excel sheet, going to the (clients’) teams, filling out the data and then consolidating the data into another Excel sheet,” said Palaniappan, who left Microsoft Corp last year. \nThe aim is to make personally identifiable data easily available, so these companies can provide copies of the information to customers who request them, or to erase the data when required. \nThe big worry is that, due to the manual nature of the work, errors that could make companies non-compliant could creep in, added Palaniappan. \n“We’re always worried - did we miss anything? Are there any datasets that no one is aware of that we’re still using? That’s a concern.” \n‘EVERYONE IS SCRAMBLING’ \nStill, it’s unclear just how strictly GDPR, which EU nations adopted in 2016, will be enforced at the start. \nMany observers expect regulators to take a forgiving approach and give companies time to get their systems in order, reserving harsh penalties for large firms that egregiously fail to comply. \nSome also warn that companies need to be careful in their rush to comply with the new rules. \n“Everyone is claiming now to be a GDPR expert because they can see that there is very strong demand and everyone is scrambling,” said Paul Lanois, an attorney with a large publicly traded international bank in Europe, adding that he checks consultants’ resumes for experience dealing with European regulators before bringing them on board. \n“You have to vet them otherwise you get any Tom, Dick or Harry saying they’re a GDPR expert,” Lanois said. \nOnce data is properly classified, there is then a great deal of interpretation involved in how the company is required to handle it. The text of the law is replete with words like “reasonable”; one requirement, for example, says that companies take “every reasonable step ... to ensure that personal data which are inaccurate are rectified”. \nThose steps, however, are not defined. That’s where the lawyers come in. \nThere is little consensus on whether most companies will be ready by May. Among firms that have begun preparing for GDPR, 78 percent say they are confident they will be fully compliant by the deadline, according to a survey by Microsoft late last year. \nBut Gartner, the research firm, has a less optimistic forecast, predicting less than half of all companies affected by GDPR will not be in full compliance by the end of 2018. \nLanois said there was an “overwhelming amount” of companies that were completely unprepared for the new regulations. \n”They’ve just noticed GDPR and are now freaking out,“ he added. ”Those who are already fully compliant, and there’s a few of them, those are the lucky few.” Reporting by Salvador Rodriguez; Editing by Jonathan Weber and Pravin Char", "external_links": [], "published": "2018-01-22T17:00:00.000+02:00", "crawled": "2018-01-22T17:14:45.001+02:00", "highlightTitle": ""}