{"organizations": [], "uuid": "2f1ebd632a7e2173bf9329e15453d09e1aaa6ccb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/23/104486816-GettyImages-76741184.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/trump-climate-change-claims-off-the-mark.html", "country": "US", "domain_rank": 767, "title": "Trump climate change claims off the mark", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.173, "site_type": "news", "published": "2018-01-29T17:11:00.000+02:00", "replies_count": 0, "uuid": "2f1ebd632a7e2173bf9329e15453d09e1aaa6ccb"}, "author": "Uriel Sinai", "url": "https://www.cnbc.com/2018/01/29/trump-climate-change-claims-off-the-mark.html", "ord_in_thread": 0, "title": "Trump climate change claims off the mark", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "morgan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "earth", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "itv news", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "piers morgan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump 's description of the climate on planet Earth doesn't quite match what data show and scientists say.\nIn an interview with Piers Morgan airing Sunday on Britain's ITV News, the president said the world was cooling and warming at the same time and that claims of melting ice caps haven't come true.\nTRUMP: \"There is a cooling, and there's a heating. I mean, look, it used to not be climate change, it used to be global warming. That wasn't working too well because it was getting too cold all over the place.\"\nTen different climate scientists contacted by The Associated Press said the president was not accurate about climate change. Rutgers University climate scientist Jennifer Francis responded in an email: \"Clearly President Trump is relying on alternative facts to inform his views on climate change. Ice on the ocean and on land are both disappearing rapidly, and we know why: increasing greenhouse gases from burning fossil fuels that trap more heat and melt the ice. \"\nTHE FACTS: The world hasn't had a cooler than average year since 1976 and hasn't had a cooler than normal month since the end of 1985, according to more than 135 years of temperature records kept by NASA and the National Oceanic and Atmospheric Administration.\nThe last four years have been the four hottest years on record globally, with 2010 the fifth hottest year, according to NOAA. Every year in the 21st century has been at least three quarters of a degree (0.4 degrees Celsius) warmer than the 20th century average and in the top 25 hottest years on record, NOAA records show.\nAnd while a good chunk of the United States had a frigid snap recently, most of the rest of the world was far warmer than normal, according to temperature records.\nZeke Hausfather of the Berkeley Earth temperature monitoring program — initially funded by non-scientists who doubt that the world is warming — said in an email: \"The world has been warming steadily over the past 50 years, with 17 of the past 18 years being the warmest since records began in the 1850s. It is not accurate to say that the climate has been 'cooling as well as warming'.\"\nTRUMP: \"The ice caps were going to melt, they were going to be gone by now, but now they're setting records. They're at a record level.\"\nTHE FACTS: It is a bit more nuanced, but not quite right.\nWhile a small number of experts a decade ago had predicted that Arctic would be free of summer sea ice by now, most mainstream scientists and the United Nations' Intergovernmental Panel on Climate Change did not, instead they said Arctic sea ice would shrink, which it has, said Pennsylvania State University ice scientist Richard Alley. Most scientists, including the director of the National Snow and Ice Data Center, are predicting that the Arctic will be free of summer sea ice sometime around the 2040s.\nThe Arctic set a record for the lowest amount of sea ice in the winter, when sea ice usually grows to its maximum levels, in March 2017. In 2012, the Arctic set a record for lowest sea ice levels. Sea ice recovered slightly from that record and in 2017 in September, the annual low was only the eighth lowest on record, according to the National Snow and Ice Data Center. But the 10 lowest years of sea ice have been all in the last 11 years. Arctic sea ice is declining at a rate of 13.2 percent per decade, according to NASA.\nPrinceton University climate scientist Michael Oppenheimer said the Antarctic sea ice pack, less directly influenced by global climate change, varies from year to year. Antarctica hit a record low for sea ice in March 2017, the same month the Arctic hit a record winter low. Antarctic sea ice also reached a record high in 2014.\n\"Both of the large ice sheets of Greenland and Antarctica are losing hundreds of billions of tons of ice per year. Sea ice continues to decline significantly in the Arctic decade by decade, and the thickness of Arctic ice is now less than 50 percent of what it was 40 years ago,\" National Snow and Ice Data Center scientist Ted Scambos said in an email.", "external_links": [], "published": "2018-01-29T17:11:00.000+02:00", "crawled": "2018-01-29T17:11:31.016+02:00", "highlightTitle": ""}