{"organizations": [], "uuid": "22226ee01c6eb66d0f90e274c02ff1c66113e2cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-spi-energy-co-ltd-appoints-scott-sullivan-as-chief-marketing-officer-and-president-of-spi-us-region.html", "country": "US", "domain_rank": 767, "title": "SPI Energy Co., Ltd. Appoints Scott Sullivan as Chief Marketing Officer and President of SPI US Region", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-08T15:00:00.000+02:00", "replies_count": 0, "uuid": "22226ee01c6eb66d0f90e274c02ff1c66113e2cd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-spi-energy-co-ltd-appoints-scott-sullivan-as-chief-marketing-officer-and-president-of-spi-us-region.html", "ord_in_thread": 0, "title": "SPI Energy Co., Ltd. Appoints Scott Sullivan as Chief Marketing Officer and President of SPI US Region", "locations": [], "entities": {"persons": [{"name": "scott sullivan", "sentiment": "negative"}, {"name": "sullivan", "sentiment": "none"}], "locations": [{"name": "us region hong kong", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "spi energy co., ltd", "sentiment": "neutral"}, {"name": "spi energy co., ltd.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "scott sullivan & associates", "sentiment": "none"}, {"name": "synergenic sales group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG, Jan. 08, 2018 (GLOBE NEWSWIRE) -- SPI Energy Co., Ltd. (“SPI Energy” or the “Company”) (Nasdaq:SPI), a global clean energy market place for business, residential, government and utility customers and investors, today announced that Scott Sullivan has joined the Company as Chief Marketing Officer (“CMO”) and President of SPI US Region, effective immediately. Mr. Sullivan will focus on strengthening the Company’s current solar and storage business, expanding the potential opportunities of smart home projects in the United States and help to guide the product and marketing strategy to further improve the profitability as the Company continues its evolution in the cleantech industry.\nAs the Founder of the Synergenic Sales Group (Scott Sullivan & Associates), Mr. Sullivan brings 30 years of professional sales and marketing experience in the energy sector, both domestic and international. Mr. Sullivan has worked with global renewable energy companies on both utility and commercial projects on the demand side, the supply side, and energy efficiency projects.\nMr. Sullivan was based in California on the front lines of deregulation with both the gas and electricity industries, working with PV panel manufacturers, power electronic manufacturers (inverters) including fuel cell manufacturers and renewable project developers.\n“Scott is an industry-recognized expert in the cleantech industry, he has the combination of an outstanding work history in the cleantech strategy and has well-connected resources in the space, providing him with in-depth insights into how the evolution needs to across the Company and expand into potential opportunities,” said Xiaofeng Peng, Chairman and Chief Executive Office of SPI Energy. “We are confident that in his new role, Scott will help us build on our success as the Company continues to execute our strategies to deliver enhanced shareholder value.\"\nAbout SPI Energy Co., Ltd.\nSPI Energy Co., Ltd. is a global provider of photovoltaic (PV) solutions for business, residential, government and utility customers and investors. SPI Energy focuses on the EPC/BT, storage and O2O PV market including the development, financing, installation, operation and sale of utility-scale and residential PV projects in China, Japan, Europe and North America. The Company operates an online energy e-commerce and investment platform in China, as well as B2B e-commerce platform offering a range of PV and storage products in Australia. The Company has its operating headquarters in Hong Kong and maintains global operations in Asia, Europe, North America and Australia.\nFor additional information, please visit: http://investors.spisolar.com\nFor investors and media inquiries please contact:\nSPI Energy Co., Ltd.\nIR Department\nEmail: ir@spisolar.com\nSource:SPI Energy Co., Ltd.", "external_links": [], "published": "2018-01-08T15:00:00.000+02:00", "crawled": "2018-01-08T15:18:58.002+02:00", "highlightTitle": ""}