{"organizations": [], "uuid": "56a2188f0c4877653b3f28336b124b4c4c0de11c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-nevsun-adds-depth-and-capacity-to-its-leadership-team.html", "country": "US", "domain_rank": 767, "title": "Nevsun Adds Depth and Capacity to its Leadership Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T15:50:00.000+02:00", "replies_count": 0, "uuid": "56a2188f0c4877653b3f28336b124b4c4c0de11c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-nevsun-adds-depth-and-capacity-to-its-leadership-team.html", "ord_in_thread": 0, "title": "Nevsun Adds Depth and Capacity to its Leadership Team", "locations": [], "entities": {"persons": [{"name": "timok", "sentiment": "none"}, {"name": "bisha", "sentiment": "none"}, {"name": "orzechowski", "sentiment": "none"}, {"name": "jerzy orzechowski", "sentiment": "none"}], "locations": [{"name": "leadership team vancouver", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "warsaw polytechnic", "sentiment": "none"}], "organizations": [{"name": "nsu", "sentiment": "negative"}, {"name": "prnewswire/ - nevsun resources ltd", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, Jan. 24, 2018 /PRNewswire/ - Nevsun Resources Ltd . (TSX:NSU) (NYSE AMERICAN: NSU) (\"Nevsun\" or the \"Company\") today announces additions to its operational leadership team. The Company has made the decision to eliminate the Chief Operating Officer and the Vice President, Project Development positions. In their place, two distinct, focused roles have been created – a Vice President and Project Director focused on Timok, and a Head of Operations focused on Bisha, both reporting to Nevsun's Chief Executive Officer. In addition, to further support long-term growth, the Company has created a new technical role – Vice President, Corporate Development who will report to the Chief Development Officer.\nEffective immediately, the Company is pleased to announce the appointment of Jerzy Orzechowski as Vice President and Project Director, Timok. Mr. Orzechowski holds a Master's Degree in Science, Electrical Engineering from Warsaw Polytechnic in Poland. He possesses extensive experience in all phases of project development and implementation in many industries including mining, pulp and paper, and power generation. Jerzy played a key role in restructuring Kinross Gold's Tasiast project to optimize investment value and lower the initial capex. He also took over the EPCM Project Director role for a UAE $6B smelter and power generation complex, and reduced the estimates and delivered the project under budget and ahead of schedule.\nAdam Wright will join the Company on March 1, 2018 as Head of Operations. Mr. Wright holds a Master's Degree of Engineering, Mineral Processing, from the Royal School of Mines, Imperial College in London, UK. Most recently Adam was Vice-President, Papua New Guinea Operations for Nautilus Minerals. Prior to Nautilus, he held senior positions, including General Manager and Chief Operating Officer, at Equinox Minerals, Placer Dome and Lighthouse Minerals.\nEffective immediately, Marc Blythe joins the Company as Vice President, Corporate Development. He will assist the Head of Operations with planning and optimization initiatives being undertaken at Bisha and support long-term corporate growth activities. Mr. Blythe received his Bachelor's Degree in Mining Engineering from the Western Australian School of Mines and is a registered Professional Engineer in British Columbia, Canada. He holds an MBA from La Trobe University in Melbourne, Australia. Alongside other roles, Marc has spent the past 10 years assisting clients with project/company evaluation for potential acquisitions, and debt and equity financing. Prior to consulting, Marc held various roles as a mine manager and mining engineer for companies including Placer Dome, WMC Resources and Newcrest.\nPeter Kukielski, CEO comments, \"I am pleased that Nevsun has been able to attract such high-quality talent in Jerzy, Adam and Marc. The experience these individuals bring adds depth and capacity to the Nevsun team putting the Company in a strong position to execute at Bisha and Timok. Over time, we will continue to work to optimize the organization to ensure we have the best people in house to maximize the potential of Nevsun's world-class asset base and create value for our shareholders.\"\nAbout Nevsun Resources Ltd.\nNevsun Resources Ltd. is the 100% owner of the high-grade copper-gold Timok Upper Zone and 60.4% owner of the Timok Lower Zone in Serbia. The Timok Lower Zone is a partnership with Freeport-McMoRan Exploration Corporation (\"Freeport\"), which currently owns 39.6% and upon completion of any feasibility study, Nevsun Resources Ltd. will own 46% and Freeport will own 54%. Nevsun generates cash flow from its 60% owned copper-zinc Bisha Mine in Eritrea. Nevsun is well positioned with a strong debt-free balance sheet to grow shareholder value through advancing Timok to production.\nNEVSUN RESOURCES LTD.\n\"Peter Kukielski\"\nPeter Kukielski\nPresident & Chief Executive Officer\nSOURCE Nevsun Resources Ltd.", "external_links": ["http://www.nevsun.com/investors/"], "published": "2018-01-24T15:50:00.000+02:00", "crawled": "2018-01-24T17:51:49.008+02:00", "highlightTitle": ""}