{"organizations": [], "uuid": "8db5aa5b8735a832c31cd654bb3569423f2fbdb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227027645&w=1200&r=LYNXMPEE0U1F9", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-dr-horton-express/d-r-hortons-affordable-homes-unit-to-get-boost-from-first-time-buyers-idUSKBN1FK2QB", "country": "US", "domain_rank": 408, "title": "D.R. Horton's affordable homes unit to get boost from first-time buyers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T20:17:00.000+02:00", "replies_count": 0, "uuid": "8db5aa5b8735a832c31cd654bb3569423f2fbdb3"}, "author": "", "url": "https://www.reuters.com/article/us-dr-horton-express/d-r-hortons-affordable-homes-unit-to-get-boost-from-first-time-buyers-idUSKBN1FK2QB", "ord_in_thread": 0, "title": "D.R. Horton's affordable homes unit to get boost from first-time buyers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 6:22 PM / in an hour D.R. Horton's affordable homes unit to get boost from first-time buyers Arunima Banerjee 4 Min Read \n(Reuters) - D.R. Horton Inc’s ( DHI.N ) creation four years ago of a separate affordable homes business is yielding results as robust economic growth returns confidence to the U.S. housing market, and other homebuilders are now increasingly focusing on the segment. \nD.R. Horton, the biggest U.S. homebuilder, introduced Express brand - a lower-margin business which mainly caters to first-time buyers - at a time when rising land prices made homebuilders wary of building cheaper homes and strict lending standards were limiting buyers’ ability to raise credit. \nExpress accounted for more than one-third of homes sold and over one-fourth of home sales in the latest quarter, the Texas-based company reported on Wednesday. \nD.R. Horton said the unit is expected to grow at least 10 percent to 15 percent over the next three years. \n“While the new tax laws may affect the upper-end home buyers and owners, there is enough demand strength for less-expensive homes, particularly in first-time homes, to keep the industry growing in 2018,” Moody’s Investors Service Vice President Joseph Snider wrote in a note published earlier this month. \nDemand for starter homes has become the “sweet spot” of the homebuilding industry, Snider told Reuters. \nThe Express brand has kept Horton’s margins lower than its peers, but has also helped it turn over inventory faster as those homes are quicker to build and sell in larger volumes. \nIn the recent quarter, Horton generated margins of 20.8 percent, while Lennar Corp ( LEN.N ) reported 22.4 percent and PulteGroup Inc ( PHM.N ) 23.8 percent. \nAccording to Moody’s calculations, Horton’s inventory turnover was 1.2x for fiscal 2016 and 2017, while Lennar’s was 0.8x and Pulte’s 0.9x. \n“Lennar and Pulte tend to try to generate the best margins they can, Horton is willing to sacrifice a little on margins in order to improve their turnover and returns,” Snider said. \nWhen Horton launched the Express brand in 2014, majority of homebuilders were focused on buying land in city centers to respond to higher demand for owners upgrading to more expensive homes in trendier neighborhoods. Horton instead bought land in less fashionable and less developed areas to build cheaper and smaller homes. \n“... more homebuilders are looking at this, at moving their mixes towards more entry-level homes,” BTIG analyst Carl Reichardt said, adding that other homebuilders feel more confident as the cycle has continued to improve slowly and as Horton has proved out the concept. \nBut, it was unclear whether other homebuilders would be as successful as Horton, Reichardt said. \nLennar is focusing on expanding its first-time home buyer offering, Chief Executive Officer Stuart Miller said in June, adding that the segment was showing some optimism. Pulte Chief Executive Officer Ryan Marshall said on Tuesday that it would start to shift some of its investment in the move-up segment to the entry-level. Reporting by Arunima Banerjee in Bengaluru; Editing by Bernard Orr", "external_links": [], "published": "2018-01-31T20:17:00.000+02:00", "crawled": "2018-01-31T20:33:34.002+02:00", "highlightTitle": ""}