{"organizations": [], "uuid": "75d477ce7c3e9da26b2839a49cd9bc2e69b85e67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-las-vegas-railway-express-inc-announces-its-acquisition-of-united-rail-and-the-rms-rail-management-services-system.html", "country": "US", "domain_rank": 767, "title": "Las Vegas Railway Express, Inc. Announces Its Acquisition of United Rail and the RMS Rail Management Services System", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T16:30:00.000+02:00", "replies_count": 0, "uuid": "75d477ce7c3e9da26b2839a49cd9bc2e69b85e67"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-las-vegas-railway-express-inc-announces-its-acquisition-of-united-rail-and-the-rms-rail-management-services-system.html", "ord_in_thread": 0, "title": "Las Vegas Railway Express, Inc. Announces Its Acquisition of United Rail and the RMS Rail Management Services System", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "rms rail management services system las vegas", "sentiment": "negative"}, {"name": "nv", "sentiment": "negative"}, {"name": "acquisition of united rail", "sentiment": "negative"}, {"name": "las vegas railway express, inc", "sentiment": "neutral"}, {"name": "las vegas railway express, inc.", "sentiment": "neutral"}, {"name": "united rail rms", "sentiment": "none"}, {"name": "united rail", "sentiment": "none"}, {"name": "rail management services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, NV, The Las Vegas Railway Express, Inc. (OTCPK: XTRN), owner of the X Train brand and brand licensor, today announced the acquisition of United Rail, a private company and owner of the Rail Management Services (RMS) short line management package. RMS is an integrated management services bundle which allows short line companies in both freight and passenger excursion businesses to contract for services such as marketing and sales, accounting, logistics, compliance and other functions by outsourcing these expensive functions for a fraction of current costs. RMS will become the primary business of XTRN as it now will seek to have short line companies use RMS for their business management backbone. Affiliate short lines using RMS will only pay for the services they use and those seasonal businesses in the passenger rail business won’t need to carry expensive staff costs when not running.\n\"The United Rail RMS system was developed by short line rail operators in both the freight and passenger excursion environments. By outsourcing back office functions to RMS, short line companies can save money on operating costs,” stated Wayne Bailey, CEO of XTRN. “By affiliating under our United Rail brand and deploying the RMS system, we can offer access to capital, discounts on insurance products, and much more via our larger purchasing footprint, to our X Train Affiliates,” Bailey said.\nThe system is currently in use by X Rail Entertainment, Inc. (OTCPK:XREE) on its X Wine Railroad service and for use on its LA to Las Vegas service planned for June of 2018.\nAbout Las Vegas Railway Express\nLas Vegas railway Express, Inc. is in the business of acquiring short line railroads in both the passenger operations sector as well as freight operations. The company has been active in this space for five years. It has operated the Santa Fe Southern Railway and plans to develop rail infrastructure projects and terminal operations. It also has licensed X Rail Entertainment, Inc. to use the X Train brand on X Rail's new X Wine Railroad service and its planned LA to Vegas X Train service. Revenues from the licensing are calculated at 5% of the operating revenue of X Rail's revenue derived from the deployment of the X Train brand on X Rail's operating trains.\nForward-looking Statements:\nThis press release may contain forward-looking statements regarding Las Vegas Railway Express, Inc. (the “Company”) within the meaning of the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995. All statements, other than statements of historical fact included herein are “forward-looking statements”, including statements regarding: the financial outlook of the Company, the general ability of the Company to achieve its commercial objectives; the business strategy, plans and objectives of the Company and its subsidiaries; and any other statements of non-historical information. These forward-looking statements are often identified by the use of forward-looking terminology such as “believes,” “expects,” “anticipates,” “seeks,” “should,” “could,” “intends,” or “projects” or similar expressions, and involve known and unknown risks and uncertainties. The Company’s actual results may differ materially and adversely from those expressed in any forward-looking statements as a result of various factors and uncertainties, and may be beyond the Company’s ability to foresee or control. The Company does not undertake an obligation to update or revise any forward-looking statements, and all forward-looking statements are expressly qualified by all such risk factors and other cautionary statements. The information set forth herein speaks only as of the date hereof.\nCompany website at http://www.vegasxtrain.com .\nContact: XTRN CEO Wayne Bailey (801) 558-9646 Media Contact: Success City Online Ms. Maria Bailey Maria@successcityonline.com (702) 271-0591\nSource:X Rail Entertainment, Inc", "external_links": ["https://www.globenewswire.com/Tracker?data=8uYg7Ea3NxldUaUS7EIO3ymQME3rWK-NURZK85Dhsuc1vI1irpASY_Qb9nuyHl4bfo8xmgc-wVEqM1nV9NZLXwTZyk0ccY9uBsk2iHiLGpAxXe-x1dnntb-v7-tevWCKuZ8NrF0niAWfvqh6PMDYnSU3z_tBwW71Lx-hJ8o29mfQ9VeQ6Rl2VGeYb8d7zblzi4DuOw4LY-qaCzqdksnQcQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/eb2ac5a7-db2f-4dfb-a081-deac9d5d4824"], "published": "2018-01-25T16:30:00.000+02:00", "crawled": "2018-01-25T18:15:43.001+02:00", "highlightTitle": ""}