{"organizations": [], "uuid": "cc0ae2caa668dfc59d4e6a0d6d1f9fcf4dfadc98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221168853&w=1200&r=LYNXMPEE0A1AS", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-vietnam-wto/u-s-says-vietnam-should-have-notified-eight-state-firms-to-wto-idUSKBN1F022Y", "country": "US", "domain_rank": 408, "title": "U.S. says Vietnam should have notified eight state firms to WTO", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:36:00.000+02:00", "replies_count": 0, "uuid": "cc0ae2caa668dfc59d4e6a0d6d1f9fcf4dfadc98"}, "author": "", "url": "https://www.reuters.com/article/us-usa-vietnam-wto/u-s-says-vietnam-should-have-notified-eight-state-firms-to-wto-idUSKBN1F022Y", "ord_in_thread": 0, "title": "U.S. says Vietnam should have notified eight state firms to WTO", "locations": [], "entities": {"persons": [{"name": "robert lighthizer", "sentiment": "none"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "wto", "sentiment": "negative"}, {"name": "wto reuters staff", "sentiment": "none"}, {"name": "petrovietnam", "sentiment": "none"}, {"name": "pv oil", "sentiment": "none"}, {"name": "petrolimex", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "world trade organization", "sentiment": "none"}, {"name": "vietnam air petrol company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 3:37 PM / Updated 25 minutes ago U.S. says Vietnam should have notified eight state firms to WTO Reuters Staff 3 Min Read \nGENEVA (Reuters) - The United States has notified the World Trade Organization of eight Vietnamese firms it says should have been registered as state trading enterprises under the global trading rules, a U.S. filing published by the WTO showed on Thursday. \nThe United States said it was notifying the WTO on Vietnam’s behalf, a so-called “counter-notification”, because Vietnam had failed to do so. \nWashington has previously taken similar steps to flag Chinese companies that it suspects are competing unfairly because of their government connections. U.S. Trade Representative Robert Lighthizer has vowed to toughen up on transparency at the WTO. \nThe U.S. filing named oil firm PetroVietnam and its subsidiary PV Oil, as well as fuel importer Petrolimex ( PVX.HN ) and jet fuel supplier Vietnam Air Petrol Company (Vinapco/SKYPEC) as firms that should be declared under the WTO rules on state trading enterprises. \nThe list also included the Northern Food Corporation and Southern Food Corporation, known as Vinafood I and Vinafood II, Saigon Jewelry Company Limited and the mining group Vietnam National Coal and Mineral Industries Group (Vinacomin). \nVietnam joined the WTO exactly 11 years ago, on Jan 11, 2007, and followed in China’s footsteps by transforming its economy on the back of cheap labor and export-led growth. \nIt notified the WTO of two state trading enterprises in April 2016, prompting the United States to ask about other companies. \nLast October, Vietnam replied that most of its former state enterprises had been equitised and operated under market economy conditions, without their previous preferential privileges. \n“Shortly after Vietnam’s response, the United States independently-researched Vietnam’s claims and, based on publicly-available information, has determined that there appear to be a number of entities that Vietnam failed to identify as STEs,” the U.S. filing said. \nVietnam is divesting hundreds of state-owned enterprises, partly because of the need to fund a budget deficit and amid growing public debt, but progress has been slow. \nIt has accelerated its plans, and began this year by announcing that it would privatize almost half of Vinafood II, Vietnam’s main rice exporter, raising about $100 million, within three months. Reporting by Tom Miles Editing by Jeremy Gaunt", "external_links": [], "published": "2018-01-11T17:36:00.000+02:00", "crawled": "2018-01-11T17:54:57.002+02:00", "highlightTitle": ""}