{"organizations": [], "uuid": "f503f89ffdc5e736be7c6d856508f05b37c38667", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-nigeria-trafficking-italy/nigerian-actress-seeks-to-prevent-sex-trafficking-to-italy-idUSKBN1FD2CZ", "country": "US", "domain_rank": 408, "title": "Nigerian actress seeks to prevent sex trafficking to Italy", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-25T00:35:00.000+02:00", "replies_count": 0, "uuid": "f503f89ffdc5e736be7c6d856508f05b37c38667"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-nigeria-trafficking-italy/nigerian-actress-seeks-to-prevent-sex-trafficking-to-italy-idUSKBN1FD2CZ", "ord_in_thread": 0, "title": "Nigerian actress seeks to prevent sex trafficking to Italy", "locations": [], "entities": {"persons": [{"name": "stephanie linus", "sentiment": "negative"}, {"name": "linus", "sentiment": "none"}], "locations": [{"name": "italy abuja", "sentiment": "none"}, {"name": "sicily", "sentiment": "none"}, {"name": "mediterranean", "sentiment": "none"}, {"name": "sub-saharan africa", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "nollywood", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ABUJA (Thomson Reuters Foundation) - Nigerian actress Stephanie Linus says celebrities like her can mobilize their fanbase and help stem the flood of women who swap Africa for a better life in Italy only to end up selling sex.\nThe Lagos-based Nollywood star said she hopes to raise awareness and so prevent more women and girls becoming victims of the global sex trafficking trade.\nShe spoke after visiting reception centers for victims of trafficking in Sicily, where she met Nigerian women who detailed their journeys to Europe and the dangers they faced.\n“Because of the large network of fans we often have ... we can ... educate people in our networks about the dangers of trafficking and do our best to provide hope and inspiration to those who have already fallen victim,” Linus wrote in an email to the Thomson Reuters Foundation.\nShe emailed during a visit to Italy organized by the medical charity, Medecins Sans Frontieres (Doctors Without Borders), which runs health centers that help migrants who come to Europe via the Mediterranean, most from sub-Saharan Africa.\nThe number of female Nigerians arriving in Italy by boat surged to more than 11,000 in 2016 from 1,500 in 2014, with at least four in five of them forced into prostitution, according to the International Organization for Migration (IOM).\nIn 2017, the MSF’s search and rescue ship, Aquarius, rescued 15,078 people, of whom 86 percent were male and 14 percent were female. According to the ship’s communications manager, Carolina Montenegro, more than six in 10 of the women rescued were single female travelers, and most of them were from Nigeria.\n“Many patients told MSF they did not know about the risk and the abuse they would face, that they wished they had known,” said Hassiba Hadj Sahraoui, an MSF humanitarian affairs adviser.\n“For women and girls to make informed decisions, they need information and Stephanie (Linus) ... is making sure their message is reaching home, that a girl in a remote area of Nigeria does not easily fall prey to predators and traffickers.”\nMore Nigerians will heed warnings about trafficking if celebrities are involved, according to Arinze Orakwue, who works at Nigeria’s anti-trafficking agency, NAPTIP.\n“It builds the conversation, makes it more engaging and takes it beyond the frontiers that NAPTIP can,” said Orakwue, who urged other Nigerian celebrities to get involved.\n“When they see an icon, an individual who has nothing to lose, saying that it is wrong, there are more people who will believe her more than believing the agency,” he said.\nLinus is one of Nigeria’s most recognizable stars, with a strong fan base among young people. She directed the 2014 film, Dry, which highlights the horrors of child marriage.\nReporting By Adaobi Tricia Nwaubani, Editing by Lyndsay Griffiths.; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T00:35:00.000+02:00", "crawled": "2018-01-24T21:25:37.012+02:00", "highlightTitle": ""}