{"organizations": [], "uuid": "9fe9553de966064f2f0045e286b5cee892886220", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218808748&w=1200&r=LYNXMPEE010JQ", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-alps-level/alpine-skiing-snow-chance-outsiders-compete-against-the-odds-idUSKBN1ER10E", "country": "US", "domain_rank": 408, "title": "Alpine skiing: Snow chance? Outsiders compete against the odds", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T15:07:00.000+02:00", "replies_count": 0, "uuid": "9fe9553de966064f2f0045e286b5cee892886220"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-alps-level/alpine-skiing-snow-chance-outsiders-compete-against-the-odds-idUSKBN1ER10E", "ord_in_thread": 0, "title": "Alpine skiing: Snow chance? Outsiders compete against the odds", "locations": [], "entities": {"persons": [{"name": "alan baldwin", "sentiment": "neutral"}, {"name": "ryding", "sentiment": "none"}, {"name": "dave ryding", "sentiment": "none"}], "locations": [{"name": "kitzbuehel", "sentiment": "none"}, {"name": "oslo", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "finland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "levi", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "madonna di campiglio", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Most of the top Alpine skiers have grown up on snow, which is something of a disadvantage for those whose countries see little of the stuff.\nBut that does not mean all of those ‘outsiders’ have no chance of success.\n“We’re always going to be behind the Austrians, French or whatever because they were on these mountains when they were four years old,” says Britain’s leading Alpine skier Dave Ryding.\n“We don’t learn the terrain, the snow, and you have to refine the skill of skiing on snow,” the 31-year-old, who learnt to ski on dry slopes around England and Wales, told Reuters in an interview.\nAnd yet Ryding finished second in the Kitzbuehel World Cup slalom last January, the best finish by a Briton in 35 years, and led the first leg of the season opener in Levi, Finland, in November before missing a gate in the second run.\nHe was sixth in the Madonna di Campiglio slalom in December and fourth in a parallel slalom city event in Oslo on New Year’s Day.\n“I always believed I can catch them up, eventually,” said the veteran of two Olympics.\nTalk of a level playing field, even metaphorically, sits ill with a sport whose stars race down steep and icy pistes, over bumps and jumps and through the tight twists and turns of a rutted slalom slope.\nThe Austrians, Swiss and other ‘snow powers’ receive an avalanche of funding for the national sport, along with world class training facilities, while those without mountains on their doorstep look on enviously.\nThe Olympic men’s downhill, the sport’s blue riband event, has only ever been won by skiers from Alpine nations or the United States.\nThe World Cup has been hosted in 25 countries, from Australia to Argentina, but the only ones from outside that group to have won an Olympic Alpine medal are Luxembourg and Liechtenstein.\nLuxembourg features on the list only because Austrian Marc Girardelli, who went on to become a five times overall World Cup champion, fell out with his national federation as a teenager and found another.\nHARD WORK Ryding first trained on snow at 12, after starting on dry slopes, and moved to Austria at 18 to improve his technique. It has not been easy but his determination is paying off.\nFILE PHOTO: Alpine Skiing - FIS Alpine Skiing World Cup - Men's Slalom - Kitzbuehel, Austria - 22/01/17 - Dave Ryding of Britain celebrate with the trophy on the podium. REUTERS/Dominic Ebenbichler/File Photo “They have it cushy,” said the Briton of some of his Austrian rivals.\nHe recognized, however, that they were also more likely to suffer burnout from the pressure of competing from a much younger age.\nRyding is now well-funded, compared to previous British athletes, and has shown he can compete with the best. He has his own coach, service man, physio and assistant but it was not always thus.\n“In the past, say three years ago, it was literally me and my coach and I was doing my own skis, I was doing everything myself so that was also very hard,” he said.\n”Back then it was costing me personally 15-20,000 (euros) ($23,719.78) a year... but my whole team budget back then was less than 100,000.\n“The Austrian slalom team, their budget will be around six million. That’s just for their season.”\nMarcel Hirscher, the Austrian who has been overall World Cup champion for the past six seasons and who beat Ryding in that Kitzbuehel slalom, can count on far greater support and resources.\nSki maker Atomic, who employ Hirscher’s brother, will have a team of their own experts working with team coaches to ensure the equipment meets his every requirement.\nThe same goes for other top medal contenders on the World Cup circuit.\nTeam GB’s Pyeongchang Chef de Mission Mike Hay pointed to Norway, also an Alpine force to be reckoned with, as another country making sure their athletes have every possible advantage.\n“They’re like a Formula One team,” he said of their Nordic skiing investment. “They pull up to World Cup events with massive double-decker buses all fitted out for their wax techs below.”\nYet Ryding’s results have brought new respect from the established powers, more used to non-Alpine no-hopers turning up as colorful also-rans, as well as more than a few questions.\n“When I‘m sitting down at the chef de missions seminar a year out before the Games, the Swiss and Austrian guys around the table are going ‘What are you guys doing there to have somebody coming up and taking a podium?',” said Hay.\n“We’re a lot more professional than we used to be, when we turned up in a battered old car having driven 250km or more from the last race overnight.”\n($1 = 0.8438 euros)\nReporting by Alan Baldwin, editing by Sudipto Ganguly\n ", "external_links": [], "published": "2018-01-02T15:07:00.000+02:00", "crawled": "2018-01-02T15:25:12.000+02:00", "highlightTitle": ""}