{"organizations": [], "uuid": "288f3a647962999ece7a3301fbf6087dc83f761f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-metrospaces-issues-january-2018-shareholder-letter.html", "country": "US", "domain_rank": 767, "title": "Metrospaces Issues January 2018 Shareholder Letter", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.718, "site_type": "news", "published": "2018-01-29T17:15:00.000+02:00", "replies_count": 0, "uuid": "288f3a647962999ece7a3301fbf6087dc83f761f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-metrospaces-issues-january-2018-shareholder-letter.html", "ord_in_thread": 0, "title": "Metrospaces Issues January 2018 Shareholder Letter", "locations": [], "entities": {"persons": [{"name": "etelix", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "ny", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "metrospaces, inc.", "sentiment": "neutral"}, {"name": "metrospaces", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "ebtida", "sentiment": "none"}, {"name": "metrospaces inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, NY, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Metrospaces, Inc. (OTC PINK: MSPC) today issued a letter to shareholders explaining the current state of our current projects as well New Projects in consideration.\nLETTER TO OUR SHAREHOLDERS\nTo Metrospaces Inc. Shareholders:\n2017 was a turn-around and revenue record-setting year for Metrospaces. The Etelix acquisition was a complete success, seeing its revenue grow 95% from approximately $4M in 2016 to over $7.8M in 2017. EBTIDA also grew from $145,000 to approximately $160,000 even though the company invested heavily in setting up operations in Spain and new hires in the US to service new clients and growth. We are very confident that 2018 will continue to show record revenue and EBITDA numbers for Etelix and additionally, will be a year where Metrospaces will continue to grow by way of new acquisitions and investments in specialized real estate industry that will continue to create outsized revenue and per-share earnings growth, as Etelix did. As a matter in point, the company is currently actively in negotiations for the acquisition of new construction sites in New York, as well as cannabis-related commercial real estate projects in California and Washington State. As we always have done, we’ll continue to keep our shareholders well informed about our activities. Last Thursday, January 25th the company filed its 8K report with audited financials for Etelix and 2016 and 2017 consolidated pro-forma financials.\nLastly, we want to finish our first 2018 Letter to Shareholders by thanking our shareholders for their support in 2017 and to wish us all a very prosperous 2018! Let’s have a great year!\nEtelix USA.com: Our majority-owned Etelix finished 2017 with $7.8M in revenue, beating our long-held expectation of $7.5M by an ample margin. EBITDA grew to $160,000 even though we invested heavily in the opening of our Coruna office in Spain, where a new sales team expands operations in African and Asia. Our net income however, was affected by newly acquired 3rd party debt that was used to fuel revenue and EBITDA growth, as at least 6 major international carriers were acquired as new clients. Year-over-year revenue however, was 95% from 2016\nReal Estate Projects in the US : The Company is currently in final due-diligence stage to acquire in partnership 2 sites in the city of Brooklyn for new construction residential condo developments. We expect at least 1 or perhaps both acquisitions to close before year-end 2017, although nothing is certain. One of the projects is located in the high-end neighborhood of Williamsburg in Brooklyn and consists of a new construction residential building of 7 units with a total projected sell out of $12M. The other site is located near Prospect Park and consists of a luxury 22-unit residential project with total potential sell out of $38M. Both projects have operating margins of over 40%, potentially. Brooklyn is currently considered to be one of the nation’s strongest housing markets and is expected to continue its growth through the coming years.\nCannabis Commercial Real Estate Projects: The explosive growth in the cannabis-commercial real estate sector has not gone unnoticed by Metrospaces. We realize that this industry is still completely un-invested and that very little institutional money has been deployed. We are actively looking at several real estate projects in the cannabis industry in California and Washington. We are also welcoming new opportunities to look at. We will be making this industry a top priority for us in 2018 and will likely execute an investment or acquisition in the first quarter of 2016. Our plan would be to co-invest with experienced management teams in the cannabis commercial real estate sector.\nIkal Lodge and Winery : Our Ikal Lodge and Wine business continues to be a stable source of cash flow. Even though final revenue is determined at year-end, due to final pricing agreement with buyers, we expect final revenue to be at approximately $330,000 for 2017, while generating approximately $110,000 in EBITDA. This year we launched our premium wine brand, Premium Ikal. Premium Ikal will start selling in the US first quarter of 2018, as have already begun shipments to Houston. We bottled 20,000 units of this this new premium wine in the middle of 2017. Ikal Lodge and Winery is a 75-hectare wine based hotel and vacation home project, located in Mendoza, Argentina. The amazing project consists of a 25-master suite luxury hotel, a world-class winery and 29 luxury villas that will be sold under fractional ownership. March began the annual wine grape harvesting season; as we have done in the past 3 years, we sold our entire wine harvest to our long-lasting clients Pernod Ricard and Los Haroldos. This year, our focus has been on turning around our business plan away from the Venezuelan operation to US-based businesses and real estate projects. However, we expect 1Q of 2018 to refocus a good part of our effort in launching this amazing business. Once the real estate project is complete, total revenue from the sale of the villas is expected to be at approximately $70-90 million, with and EBITDA of about 45%. For more information, please see: www.ikal1150.com .\nOther investment highlights :\nJV Agreement with Proideas ( http://proideas.com.ar/ ): This JV agreement will allow Metrospaces a partnership with a very prominent private equity group in Argentina, just as the country begins a new economic shift to a more pro-market environment. This partnership will bring not just new deal flow to the company, but more importantly will also bring in fresh financing for the company’s current projects.\nJV Agreement with Prohotels of Argentina : In its refocusing of the company's business plan to hotel development, Metrospaces has executed a JV Agreement with Prohotels ( http://www.prohotels.com/ ). This partnership gears itself perfectly with the company's development and financing skills. This agreement calls for the development of 4 new hotels in the coming 3 years. It is a testament to our business plan execution.\nAgain, we want to thank all our new shareholders for taking an interest in our story and have given us the chance to be where we are at! We will continue to work very hard to make your investment in our company a success, and have very high expectations for 2018 and beyond!\nAbout Metrospaces:\nMetrospaces www.metrospaces.net is a publicly traded real estate investment and Development Company which acquires land, designs builds, and develops then resells condominiums and Luxury High-End Hotels, principally in urban areas of Latin America. The company's current projects are located in Argentina, and the U.S.A.\nSix years ago Metrospaces shareholders saw a unique opportunity to participate in several exciting property markets around the world. Through their worldwide network of highly recognized real estate entrepreneurs, the company was able to capitalize on unique real estate development opportunities. Since inception, the company has leveraged those relationships along with extensive financial expertise and transformed excellence by results.\nMetrospaces is a boutique real estate development company, a product of the alliance of Metrospace shareholders, along with an elite group of real estate professionals and entrepreneurs located around the world. Company shareholders have extensive careers in real estate financing worldwide, and have funded projects both in the Americas and across Europe valued in excess of US $450 Million.\nMetrospaces' majority shareholders have partnered with Investors on Elite properties including The London BLVGARI 5 Star Hotel, and are currently involved in negotiations for the development of several Elite luxury properties in South America.\nAmong Metrospace partners are Architects, Real Estate Developers, Agents and Attorneys of the highest standing, with extensive experience in the global property market.\nMetrospaces was originally founded by company President Oscar Brito.\nRelevant Links: http://metrospaces.net/\nhttp://www.prohotels.com/\nhttp://www.ikal1150.com\nSafe Harbor Statement: Statements in this news release may be \"forward-looking statements\". Forward-looking statements include, but are not limited to, statements that express our intentions, beliefs, expectations, strategies, predictions or any other statements relating to our future activities or other future events or conditions. These statements are based on current expectations, estimates and projections about our business based, in part, on assumptions made by management. These statements are not guarantees of future performance and involve risks, uncertainties and assumptions that are difficult to predict. Therefore, actual outcomes and results may, and are likely to, differ materially from what is expressed or forecasted in forward-looking statements due to numerous factors. Any forward-looking statements speak only as of the date of this news release and Metrospaces Inc. undertakes no obligation to update any forward-looking statement to reflect events or circumstances after the date of this news release.\nMetrospaces Inc. 305-600-0407 Investor Relations: investors@metrospaces.net www.metrospaces.net\nSource:Metrospaces, Inc.", "external_links": ["http://metrospaces.net/", "https://www.globenewswire.com/Tracker?data=OtTDT2sgWm2_McH7cUQcuVwxDYiwQ9_rllFF5TtwoqEQ2mCnlI9UteVPe4MGR1-g2Ji8wFlb9llzbx6oZPLXuUy2WblvNaJko38p1KlKcQk=", "https://www.globenewswire.com/Tracker?data=OtTDT2sgWm2_McH7cUQcuYAMiEV5XV0_DCQw7LRpBS__HnNUPpF8B8dhWnqXeeCLpE5cdYJDnB595ZV0Ck2oxJ8LihV8VOA1GH5V3z5IsIg=", "http://proideas.com.ar/", "https://www.globenewswire.com/Tracker?data=qy0LCSIsT9DQr23OofuOfvKdD31mywJpJDUNt8Stx9xViulYVzLswAuKwz658qScs2YGyrKTfFiZzl6_8dbr8YVQJbnIWfPGhwSt8xDaAcM=", "http://www.prohotels.com/", "https://www.globenewswire.com/Tracker?data=ZgFBpxEZtHL5vyBPVzbz4iZJJElpiLewvBKvX118qR_Didou9pI9howDm-7q3UhgBgpTuNx1QCassFx1Gdjn1Q==", "https://www.globenewswire.com/Tracker?data=OtTDT2sgWm2_McH7cUQcuVjX5i9zqbyn2KH4fUSovSwyHhzday0ony7XUS6hrXrNotD67AtpakTAZYp0K5fz8DizZhe0twXpasmviYgTHtU=", "https://www.globenewswire.com/Tracker?data=OtTDT2sgWm2_McH7cUQcuVjX5i9zqbyn2KH4fUSovSwE1txBdsY0UHb4kUpwcUytx6zz1x3XTWKc2_L-wHcBErcNFVBr0mMc-55-7NCcOcY=", "https://www.globenewswire.com/Tracker?data=OtTDT2sgWm2_McH7cUQcuUdp3my4QRT7Fx2BvUYe47PSE73u-eAq8rwlmi4P1ZkL-t-cK700V2aJtbuqR6iOVgYTfyOZySstlXlIRNZ9WSk=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/ac4fee78-7fdf-45e4-9763-221f54000f10"], "published": "2018-01-29T17:15:00.000+02:00", "crawled": "2018-01-29T19:36:47.008+02:00", "highlightTitle": ""}