{"organizations": [], "uuid": "95647f2badd6a029c46f3f0478a91c5ebfe85be1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-blackstone-hires-former-new-york-life-investments-group-president-chris-blunt-to-lead-new-blackstone-insurance-solutions.html", "country": "US", "domain_rank": 767, "title": "Blackstone Hires Former New York Life Investments Group President Chris Blunt to Lead New Blackstone Insurance Solutions Business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:45:00.000+02:00", "replies_count": 0, "uuid": "95647f2badd6a029c46f3f0478a91c5ebfe85be1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-blackstone-hires-former-new-york-life-investments-group-president-chris-blunt-to-lead-new-blackstone-insurance-solutions.html", "ord_in_thread": 0, "title": "Blackstone Hires Former New York Life Investments Group President Chris Blunt to Lead New Blackstone Insurance Solutions Business", "locations": [], "entities": {"persons": [{"name": "chris blunt", "sentiment": "neutral"}, {"name": "tony james", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "blackstone", "sentiment": "neutral"}, {"name": "blackstone insurance solutions", "sentiment": "none"}, {"name": "new york life’s investments group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Blackstone (NYSE:BX) today announced that Chris Blunt, former President of New York Life’s Investments Group, will join the firm as a Senior Managing Director and Chief Executive Officer of Blackstone Insurance Solutions – a newly formed business that delivers Blackstone’s investment management expertise and products to insurance companies, helping those firms meet long-term policyholder obligations and drive shareholder value.\nBlackstone Insurance Solutions partners with insurers to deliver customizable and diversified portfolios of Blackstone products across asset classes, as well as the option for full management of insurance companies’ investment portfolios.\nTony James, Blackstone President and COO, said: “Many insurers face a perfect storm of significant policyholder obligations and declining investment returns in the public markets. Blackstone’s investment management expertise and high-quality, high-performing products can be an important part of the solution. Chris Blunt has extensive experience in the insurance industry and we look forward to welcoming him to the firm as we continue growing this business.”\nChris Blunt said: “I am excited to join Blackstone and continue expanding the firm’s partnerships with the insurance industry. Blackstone is well positioned to provide a range of offerings – from high-grade private credit to traditional alternatives – that deliver compelling risk-adjusted performance, which is especially vital in this long-term, low-interest-rate environment. The firm’s leading platforms across a wide array of asset classes allow us to create bespoke products that help insurers better manage their long-term liabilities to policyholders.”\nAffiliates of Blackstone recently entered into an investment agreement with Fidelity & Guaranty Life, where Blackstone Insurance Solutions currently oversees $22 billion in assets under management. In addition, Blackstone in partnership with AXIS Capital established Harrington Reinsurance, a property & casualty reinsurance company, in July 2016 and currently manages all general account assets.\nMr. Blunt joins Blackstone after 13 years at New York Life, where he most recently served as President of the Investments Group. In that role, he was responsible for five businesses – NYL Investors, New York Life Investment Management (NYLIM), Retail Annuities, Institutional Annuities and Seguros Monterrey New York Life – with combined assets under management of more than $500 billion. He was previously Co-President of New York Life’s Insurance & Agency group, the company’s largest operating division, and held senior roles within the Retirement Income Security, Life & Annuity and MainStay Investments divisions. Before joining New York Life, Mr. Blunt worked at Merrill Lynch Investment Managers, Goldman Sachs Asset Management, and a number of other financial institutions. He holds an M.B.A. in Finance from The Wharton School, University of Pennsylvania, and a B.A. from the University of Michigan.\nAbout Blackstone\nBlackstone is one of the world’s leading investment firms. We seek to create positive economic impact and long-term value for our investors, the companies we invest in, and the communities in which we work. We do this by using extraordinary people and flexible capital to help companies solve problems. Our asset management businesses, with over $385 billion in assets under management, include investment vehicles focused on private equity, real estate, public debt and equity, non-investment grade credit, real assets and secondary funds, all on a global basis. Further information is available at www.blackstone.com . Follow Blackstone on Twitter @Blackstone.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006029/en/\nBlackstone\nMatt Anderson, +1-212-390-2472\nmatthew.anderson@blackstone.com\nSource: Blackstone", "external_links": ["http://www.businesswire.com/news/home/20180108006029/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.blackstone.com&esheet=51739230&newsitemid=20180108006029&lan=en-US&anchor=www.blackstone.com&index=1&md5=26f7352771dae87808a1a8c9b4d9ccf5"], "published": "2018-01-08T15:45:00.000+02:00", "crawled": "2018-01-08T19:21:47.002+02:00", "highlightTitle": ""}