{"organizations": [], "uuid": "90b63a177d5a43eb39bf98d8d2988da6b4ca2fbd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 211, "shares": 211, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2015/12/gettyimages-496171520.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/marvel-stan-lee-sexual-harassment-claims/", "country": "US", "domain_rank": 1196, "title": "Marvel's Stan Lee Denies Nurses' Sexual Misconduct Claims | Fortune", "performance_score": 2, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.96, "site_type": "news", "published": "2018-01-11T14:04:00.000+02:00", "replies_count": 0, "uuid": "90b63a177d5a43eb39bf98d8d2988da6b4ca2fbd"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/10/marvel-stan-lee-sexual-harassment-claims/", "ord_in_thread": 0, "title": "Marvel's Stan Lee Denies Nurses' Sexual Misconduct Claims | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. 12:04 PM EST \nStan Lee, the former editor-in-chief of Marvel Comics who co-created iconic comic book characters like Spider-Man and Iron Man, is the latest high profile entertainment figure to be accused of sexual misconduct. \nAccording to a report from the Daily Mail , which cites anonymous sources, the 95-year-old Lee is currently in a legal dispute with a nursing company over claims that he sexually harassed and groped multiple female nurses who were employed to care for him at his home in West Hollywood, Calif. The sources told the Daily Mail that Lee walks around naked and has “lost his filter,” sometimes asking his female nurses “for oral sex in the shower and wants to be pleasured in his bedroom.” \nLawyers for Lee, who became Chairman Emeritus of Marvel Entertainment after its 2009 sale to Walt Disney , “categorically” denied the claims in a statement to the Daily Mail that calls them “false and despicable allegations.” \n“We are not aware of anyone filing a civil action, or reporting these issues to the police, which for any genuine claim would be the more appropriate way for it to be handled,” Tom Lallas, Lee’s lawyer, said in a statement to the site. “Instead, Mr. Lee has received demands to pay money and threats that if he does not do so, the accuser will go to the media. Mr. Lee will not be extorted or blackmailed, and will pay no money to anyone because he has done absolutely nothing wrong.” \nMeanwhile, the Daily Mail also noted that a spokesperson for Vitale Nursing, the new nursing company working with Lee, said the comics legend has been “polite, kind, and respectful” with his new nurses. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-11T14:04:00.000+02:00", "crawled": "2018-01-11T00:10:20.015+02:00", "highlightTitle": ""}