{"organizations": [], "uuid": "b07d31dd7eb6dd262f0126f4986b262a2616079b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-arcelormittal-reports-fourth-quarter-2017-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "ArcelorMittal reports fourth quarter 2017 and full year 2017 results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T09:01:00.000+02:00", "replies_count": 0, "uuid": "b07d31dd7eb6dd262f0126f4986b262a2616079b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-arcelormittal-reports-fourth-quarter-2017-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "ArcelorMittal reports fourth quarter 2017 and full year 2017 results", "locations": [], "entities": {"persons": [], "locations": [{"name": "luxembourg", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "arcelormittal", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}, {"name": "mts", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Luxembourg, January 31, 2018 - ArcelorMittal (referred to as \"ArcelorMittal\" or the \"Company\") (MT (New York, Amsterdam, Paris, Luxembourg), MTS (Madrid)), the world's leading integrated steel and mining company, today announced results [1] for the three month and twelve month periods ended December 31, 2017.\nHighlights:\nHealth and safety performance improved in FY 2017 with annual LTIF rate of 0.78x vs. 0.82x in FY 2016 FY 2017 operating income of $5.4 billion (+30.6% YoY); operating income of $1.2 billion in 4Q 2017 (+52.7% YoY) FY 2017 EBITDA of $8.4 billion (+34.4% YoY); EBITDA of $2.1 billion in 4Q 2017 (+28.9% YoY) FY 2017 net income of $4.6 billion, higher as compared to $1.8 billion for FY 2016 FY 2017 steel shipments of 85.2Mt (+1.6% YoY); 4Q 2017 steel shipments of 21.0Mt (+4.7% YoY) FY 2017 iron ore shipments of 57.9Mt (+3.5% YoY), of which 35.7Mt shipped at market prices (+6.1% YoY); 4Q 2017 iron ore shipments of 14.3Mt (+5.4% YoY), of which 8.4Mt shipped at market prices (+3.8% YoY) Gross debt of $12.9 billion as of December 31, 2017. Net debt decreased to $10.1 billion as of December 31, 2017, lower as compared to $12.0 billion as of September 30, 2017 and $11.1 billion as of December 31, 2016\nStrategic progress in 2017:\nAction 2020 delivered a further $0.6 billion contribution to 2017 operating results Investing in high return opportunities: Anticipated ILVA (Italy), Mexico hot strip mill (HSM) and Brazil long business Cash flow from operating activities less capex (FCF) [2] of $1.7 billion despite working capital investment of $1.9 billion and $0.4 billion premium to repay bonds Cash requirements of the business limited to $4.4 billion, slightly below target (interest of $0.8 billion; capex of $2.8 billion slightly below guidance of $2.9 billion; cash taxes, pensions and other cash costs totalling $0.8 billion) Improvement on leverage ratio: Net debt/EBITDA reduced to 1.2x in FY 2017 versus 1.8x in FY 2016\nCapital allocation framework priorities:\nThe Company will continue to prioritize deleveraging and believes that $6 billion is an appropriate net debt target that will sustain investment grade metrics even at the low point of the cycle The Company will continue to invest in opportunities that will enhance future returns. By investing in these opportunities with focus and discipline, the cash flow generation potential of the Company is expected to increase The Board has agreed on a new dividend policy which will be proposed to the shareholders at the AGM in May 2018. Given the current deleveraging bias, dividends will begin at $0.10/share in 2018 (paid from 2017 results). Once it achieves net debt at or below its target, the Company is committed to returning a portion of annual FCF to shareholders\nOutlook and guidance:\nMarket conditions are favorable. The demand environment remains positive (as evidenced by the continued high readings from the ArcelorMittal weighted PMI) and steel spreads remain healthy. The Company expects cash needs of the business (capex, interest, cash taxes, pensions and other cash costs) excluding working capital investment to increase in 2018 to approximately $5.6 billion. The expected increase in capex to $3.8 billion in 2018 from $2.8 billion in 2017 largely reflects the Mexico HSM project, anticipated ILVA capex, as well as other projects.\nFinancial highlights (on the basis of IFRS 1 ):\n(USDm) unless otherwise shown 4Q 17 3Q 17 4Q 16 12M 17 12M 16 Sales 17,710 17,639 14,126 68,679 56,791 Operating income 1,234 1,234 809 5,434 4,161 Net income attributable to equity holders of the parent 1,039 1,205 403 4,568 1,779 Basic earnings per share (US$) [3] 1.02 1.18 0.40 4.48 1.87 Operating income/ tonne (US$/t) 59 57 40 64 50 EBITDA 2,141 1,924 1,661 8,408 6,255 EBITDA/ tonne (US$/t) 102 89 83 99 75 Steel-only EBITDA/ tonne (US$/t) 89 73 68 82 65 Crude steel production (Mt) 22.7 23.6 21.8 93.1 90.8 Steel shipments (Mt) 21.0 21.7 20.0 85.2 83.9 Own iron ore production (Mt) 14.4 14.2 13.9 57.4 55.2 Iron ore shipped at market price (Mt) 8.4 9.1 8.1 35.7 33.6 Commenting, Mr. Lakshmi N. Mittal, ArcelorMittal Chairman and CEO, said:\n\"The combination of improving market fundamentals and delivery against our strategic objectives contributed to a successful year for the Company. Action 2020 has delivered half of its targeted EBITDA gains and we have succeeded in transforming the Company's balance sheet. While we will retain a deleveraging bias, we are also investing selectively in opportunities that will strengthen the foundations of sustainable value creation. The market environment remains supportive but the industry must continue to address the twin challenges of overcapacity and unfair trade.\"\nCorporate responsibility and safety performance\nHealth and safety - Own personnel and contractors lost time injury frequency rate\nHealth and safety performance based on own personnel figures and contractors lost time injury frequency (LTIF) rate, improved to 0.78x for the twelve months of 2017 (\"12M 2017\") as compared to 0.82x for the twelve months of 2016 (\"12M 2016\").\nLTIF deteriorated to 0.87x in the fourth quarter of 2017 (\"4Q 2017\") as compared to 0.67x in the third quarter of 2017 (\"3Q 2017\"), and 0.84x for the fourth quarter of 2016 (\"4Q 2016\").\nThe Company's efforts to improve its Health and Safety record remains focused on both further reducing the rate of severe injuries and preventing fatalities.\nOwn personnel and contractors - Frequency rate\nLost time injury frequency rate 4Q 17 3Q 17 4Q 16 12M 17 12M 16 Mining 0.86 1.05 1.39 0.77 1.07 NAFTA 0.76 0.57 0.87 0.73 0.95 Brazil 0.46 0.45 0.42 0.43 0.37 Europe 1.00 0.79 0.92 1.03 1.01 ACIS 0.97 0.42 0.61 0.61 0.58 Total Steel 0.88 0.60 0.75 0.78 0.78 Total (Steel and Mining) 0.87 0.67 0.84 0.78 0.82 Key corporate responsibility highlights for 4Q 2017:\nThe designs for ArcelorMittal new Luxembourg headquarters, announced in December 2017, represent a leading demonstration of steel's role in the circular economy (in which industrial strategies shift away from the linear use of materials and carbon, to a more closed-loop cycle). The design - by architects Wilmotte & Associés, who worked closely with our Global R&D team - ensures that the building can be dismantled, and nearly all the steel products re-used in a new building without the need for recycling. The world's most prestigious award programme for the circular economy, The Circulars, has highly commended ArcelorMittal for demonstrating circular economy principles in its business, including innovation in the utilisation of waste gases and by-products, scrap recovery, and new business models in collaboration with internal experts, academics, partner companies and its customers. We successfully piloted the ResponsibleSteel standards at several sites in 2017.\nAnalysis of results for the twelve months ended December 31, 2017 versus results for the twelve months ended December 31, 2016\nTotal steel shipments for 12M 2017 increased +1.6% to 85.2Mt as compared to 83.9Mt for 12M 2016. On a comparable basis, excluding shipments from assets sold during the comparable period i.e. sale of long steel producing subsidiaries in the US (LaPlace and Vinton) and Zaragoza in Spain, and excluding the impact of the optimization at Zumarraga in Spain (Europe segment) total steel shipments in 12M 2017 increased by +2.3% as compared to 12M 2016.\nSales for 12M 2017 increased by 20.9% to $68.7 billion as compared with $56.8 billion for 12M 2016, primarily due to higher average steel selling prices (+20.4%), higher steel volumes (+1.6%), higher seaborne iron ore reference prices (+22.3%) and higher marketable iron ore shipments (+6.1%).\nDepreciation of $2.8 billion for 12M 2017 was higher as compared to $2.7 billion for 12M 2016. FY 2018 depreciation is expected to increase to approximately $2.9 billion primarily due to anticipated foreign exchange impacts.\nImpairment charges for 12M 2017 were $206 million related to a downward revision of cash flow projections across all steel facilities in ArcelorMittal South Africa as compared to impairment charges for 12M 2016 of $205 million of which $49 million related to the sale of ArcelorMittal Zaragoza in Spain [4] and $156 million related to the Vanderbijlpark and Saldanha plants in South Africa.\nExceptional income for 12M 2017 was nil. Exceptional income for 12M 2016 was $832 million relating to a one-time gain on employee benefits following the signing of the new US labour contract [5] .\nOperating income for 12M 2017 was $5.4 billion as compared to $4.2 billion for 12M 2016. Operating income for 12M 2016 was positively impacted by exceptional income as discussed above.\nIncome from associates, joint ventures and other investments in 12M 2017 was $448 million as compared to $615 million in 12M 2016. Income in 12M 2017 includes a gain from disposal of ArcelorMittal USA's 21% stake in the Empire Iron Mining Partnership [6] ($133 million) and improved performance of Calvert and Chinese investees, offset in part by a loss on dilution of the Company's stake in China Oriental [7] and the recycling of cumulative foreign exchange translation losses incurred following disposal of the 50% stake in Kalagadi ($187 million) [8] . The income in 12M 2016 was primarily due to the gain on disposal of stakes in Gestamp [9] ($329 million) and Hunan Valin [10] ($74 million) as well as positive contribution of the Calvert joint venture, Chinese and Spanish investees, offset in part by impairments of the primary steel making assets at China Oriental.\nNet interest expense was lower at $823 million in 12M 2017, as compared to $1,114 million in 12M 2016, driven by debt reduction including early bond repayments. The Company expects full year 2018 net interest expense of approximately $0.6 billion.\nForeign exchange and other net financing losses were $52 million for 12M 2017 as compared to losses of $942 million for 12M 2016. Foreign exchange and other net financing losses for 12M 2017 include foreign exchange gains of $546 million as compared to foreign exchange loss of $3 million in 12M 2016, mainly on account of USD depreciation of 13.8% against the Euro (versus USD appreciation against the Euro of 3.2% in prior period). These foreign exchange gains and losses are largely non-cash and primarily relate to the change of the USD exchange rate on the Euro denominated deferred tax assets, partially offset by the impact on Euro denominated debt. 12M 2017 includes non-cash mark-to-market gains on derivatives (primarily mandatory convertible bonds call options following the market price increase in the underlying shares) totalling $0.8 billion as compared to $0.2 billion in 12M 2016. In addition, 12M 2017 includes mark-to-market losses on a derivative relating to a pellet purchase agreement in the US of $0.3 billion [11] . Foreign exchange and other net financing losses for 12M 2017 and 12M 2016 also include $389 million and $399 million, respectively, for premium expense on the early redemption of bonds. In addition, 12M 2016 includes $0.1 billion non-cash expense in connection with the issuance of shares in the context of the B-BBEE transaction in South Africa [12] .\nArcelorMittal recorded an income tax expense of $0.4 billion for 12M 2017 as compared to $1.0 billion for 12M 2016. The tax expense in 12M 2016 includes derecognition of deferred tax assets (DTA) amounting to $0.7 billion in Luxembourg (related to revised expectations of DTA recoverability in US dollar terms).\nArcelorMittal's net income for 12M 2017 was $4.6 billion, or $4.48 earnings per share, as compared to net income in 12M 2016 of $1.8 billion, or $1.87 earnings per share.\nAnalysis of results for 4Q 2017 versus 3Q 2017 and 4Q 2016\nTotal steel shipments in 4Q 2017 were 3.3% lower at 21.0Mt as compared with 21.7Mt for 3Q 2017 primarily due to lower steel shipments in NAFTA (-8.9%) and ACIS (-3.2%), offset in part by improvements in Brazil (+3.8%).\nSales for 4Q 2017 were $17.7 billion as compared to $17.6 billion for 3Q 2017 and $14.1 billion for 4Q 2016. Sales in 4Q 2017 were 0.4% higher as compared to 3Q 2017, primarily due to higher average steel selling prices (+2.7%), offset in part by lower steel shipments (-3.3%), lower seaborne iron ore reference prices (-8.1%) and lower market-priced iron ore shipments (-7.2%). Sales in 4Q 2017 were 25.4% higher as compared to 4Q 2016 primarily due to higher steel shipments (+4.7%), higher average steel selling prices (+20.4%) and higher market-priced iron ore shipments (+3.8%), offset in part by lower seaborne iron ore reference prices (-7.1%).\nDepreciation for 4Q 2017 was higher at $747 million as compared to $690 million for 3Q 2017 and $696 million in 4Q 2016.\nImpairment charges for 4Q 2017 were $160 million related to a downward revision of cash flow projections across all steel facilities in ArcelorMittal South Africa. Impairment charges for 3Q 2017 were nil. Impairment charges for 4Q 2016 were $156 million related to the Vanderbijlpark and Saldanha plants in South Africa.\nOperating income for 4Q 2017 was stable at $1.2 billion as compared to 3Q 2017 and higher as compared to $0.8 billion in 4Q 2016.\nIncome from associates, joint ventures and other investments for 4Q 2017 was higher at $125 million as compared to $117 million for 3Q 2017 and $14 million in 4Q 2016. Income from associates, joint ventures and other investments for 4Q 2017 includes positive contribution from Calvert and Chinese investees. Income from associates, joint ventures and other investments for 3Q 2017 includes a gain on disposal of ArcelorMittal USA's 21% stake in the Empire Iron Mining Partnership ($133 million) and positive contribution from Calvert and Chinese investees offset in part by the recycling of the cumulative foreign exchange translation losses following the disposal of the 50% stake in Kalagadi ($187 million).\nNet interest expense in 4Q 2017 was $188 million as compared to $205 million in 3Q 2017 and $221 million in 4Q 2016. Net interest expense was lower in 4Q 2017 as compared to 3Q 2017 and 4Q 2016, primarily due to early bond repayment via debt tenders and bond repaid at maturity.\nForeign exchange and other net financing losses in 4Q 2017 were $261 million as compared to gains of $132 million for 3Q 2017 and losses of $278 million in 4Q 2016. For 4Q 2017, a foreign exchange gain of $83 million was recorded (as compared to a gain of $181 million for 3Q 2017) mainly on account of a 1.6% depreciation of the USD against the Euro (versus 3.5% depreciation in 3Q 2017). Both 4Q 2017 and 3Q 2017 include non-cash mark-to-market gains on derivatives (primarily mandatory convertible bonds call options following the market price increase in the underlying shares) of $174 million and $327 million, respectively. In addition, 4Q 2017 includes mark-to-market losses on a derivative relating to a pellet purchase agreement in the US of $0.3 billion. Foreign exchange and other net financing losses for 3Q 2017 include $218 million for premium expense on the early redemption of bonds. Foreign exchange and other net financing losses in 4Q 2016 were $278 million and include a foreign exchange loss of $128 million mainly as a result of a 5.6% appreciation of the USD against the Euro and include $0.1 billion non-cash expense in connection with the issuance of shares in the context of the B-BBEE transaction in South Africa.\nArcelorMittal recorded an income tax benefit of $119 million for 4Q 2017 as compared to an income tax expense of $71 million for 3Q 2017 and an income tax benefit of $13 million in 4Q 2016. The tax benefit of 4Q 2017 is the result of recording a deferred tax asset of $275 million in Luxembourg following expectation of higher future taxable profits.\nArcelorMittal recorded a net income for 4Q 2017 of $1,039 million, or $1.02 earnings per share, as compared to a net income for 3Q 2017 of $1,205 million, or $1.18 earnings per share, and a net income for 4Q 2016 of $403 million, or $0.40 earnings per share.\nAnalysis of segment operations\nNAFTA\n(USDm) unless otherwise shown 4Q 17 3Q 17 4Q 16 12M 17 12M 16 Sales 4,296 4,636 3,795 17,997 15,806 Operating income 155 256 164 1,185 2,002 Depreciation (137) (125) (137) (518) (549) Exceptional income 5 - - - - 832 EBITDA 292 381 301 1,703 1,719 Crude steel production (kt) 5,598 5,904 5,197 23,480 22,208 Steel shipments (kt) 5,150 5,655 5,011 21,834 21,281 Average steel selling price (US$/t) 748 741 681 742 672 NAFTA segment crude steel production decreased by 5.2% to 5.6Mt in 4Q 2017 as compared to 5.9Mt for 3Q 2017 primarily due to an operational issue in Mexico, a planned maintenance in Dofasco and a market slowdown in the US.\nSteel shipments in 4Q 2017 decreased by 8.9% to 5.2Mt as compared to 5.7Mt in 3Q 2017, driven primarily by decrease in volumes in flat and long products on account of a weak market.\nSales in 4Q 2017 declined by 7.3% to $4.3 billion as compared to $4.6 billion in 3Q 2017, primarily due to lower steel shipment volumes as discussed above, offset in part by higher average steel selling prices +0.8% (primarily in long products +1.5%).\nOperating income in 4Q 2017 decreased to $155 million as compared to $256 million in 3Q 2017 and $164 million in 4Q 2016.\nEBITDA in 4Q 2017 decreased by 23.3% to $292 million as compared to $381 million in 3Q 2017 primarily due to lower steel shipment volumes (-8.9%) offset in part by positive price-cost effect. EBITDA in 4Q 2017 declined by 2.9% as compared to $301 million in 4Q 2016.\nBrazil\n(USDm) unless otherwise shown 4Q 17 3Q 17 4Q 16 12M 17 12M 16 Sales 2,252 2,059 1,751 7,755 6,223 Operating income 266 128 143 697 614 Depreciation (75) (74) (70) (293) (258) EBITDA 341 202 213 990 872 Crude steel production (kt) 2,989 2,797 2,778 11,210 11,133 Steel shipments (kt) 3,052 2,940 2,841 10,840 10,753 Average steel selling price (US$/t) 685 651 565 667 536 Brazil segment crude steel production increased by 6.9% to 3.0Mt in 4Q 2017 as compared to 3Q 2017, following planned maintenance at Monlevade, Brazil, during the prior quarter.\nSteel shipments in 4Q 2017 increased by 3.8% to 3.1Mt as compared to 2.9Mt in 3Q 2017, due to a 10.4% increase in flat product steel shipments (primarily export) offset in part by a 6.1% seasonal decrease in long product steel shipments.\nSales in 4Q 2017 increased by 9.4% to $2.3 billion as compared to $2.1 billion in 3Q 2017, due to higher average steel selling prices 5.3% (with both domestic and export prices increasing) and higher steel shipments (+3.8%).\nOperating income in 4Q 2017 was higher at $266 million as compared to $128 million in 3Q 2017, and $143 million in 4Q 2016.\nEBITDA in 4Q 2017 increased to $341 million as compared to $202 million in 3Q 2017 due to higher steel shipment volumes and positive price-cost effect. EBITDA in 4Q 2017 was 59.9% higher as compared to $213 million in 4Q 2016 due to higher steel shipment volumes and positive price-cost effect.\nEurope\n(USDm) unless otherwise shown 4Q 17 3Q 17 4Q 16 12M 17 12M 16 Sales 9,610 9,196 7,139 36,208 29,272 Operating income 525 546 387 2,359 1,270 Depreciation (336) (302) (311) (1,201) (1,184) Impairment - - - - (49) EBITDA 861 848 698 3,560 2,503 Crude steel production (kt) 10,311 11,248 10,173 43,768 42,635 Steel shipments (kt) 10,151 10,116 9,535 40,941 40,247 Average steel selling price (US$/t) 736 723 590 702 568 Europe segment crude steel production decreased by 8.3% to 10.3Mt in 4Q 2017, as compared to 11.2Mt in 3Q 2017 primarily due to a reline in ArcelorMittal Bremen and a blast furnace maintenance in ArcelorMittal Galati.\nSteel shipments in 4Q 2017 increased marginally to 10.2Mt as compared to 10.1Mt in 3Q 2017, primarily due to a 2.8% increase in flat product shipments offset in part by a 4.5% decline in long product shipments.\nSales in 4Q 2017 were $9.6 billion, higher as compared to $9.2 billion in 3Q 2017, with higher average steel selling prices (+1.8%) predominantly in the long product business and higher steel shipments.\nOperating income in 4Q 2017 was $525 million as compared to $546 million in 3Q 2017 and $387 million in 4Q 2016.\nEBITDA in 4Q 2017 increased by 1.6% to $861 million as compared to $848 million in 3Q 2017 primarily due to marginally higher volumes. EBITDA in 4Q 2017 improved by 23.5% as compared to 4Q 2016 due to higher steel shipments (+6.5%), positive price-cost effect and translation impact.\nACIS\n(USDm) unless otherwise shown 4Q 17 3Q 17 4Q 16 12M 17 12M 16 Sales 2,039 1,941 1,526 7,621 5,885 Operating income / (loss) 182 159 (92) 508 211 Depreciation (81) (80) (78) (313) (311) Impairment (160) - (156) (206) (156) EBITDA 423 239 142 1,027 678 Crude steel production (kt) 3,832 3,669 3,646 14,678 14,792 Steel shipments (kt) 3,254 3,362 3,095 13,094 13,271 Average steel selling price (US$/t) 546 515 432 515 395 ACIS segment crude steel production in 4Q 2017 increased by 4.5% to 3.8Mt as compared to 3.7Mt in 3Q 2017.\nSteel shipments in 4Q 2017 decreased by 3.2% to 3.3Mt as compared to 3.4Mt in 3Q 2017 primarily due to lower steel shipments in CIS.\nSales in 4Q 2017 increased by 5.1% to $2.0 billion as compared to $1.9 billion in 3Q 2017, primarily due to higher average steel selling prices (+6.0%) primarily in CIS, offset in part by lower steel shipments (-3.2%).\nOperating income in 4Q 2017 was $182 million as compared to $159 million in 3Q 2017 and an operating loss of $92 million in 4Q 2016. Operating income in 4Q 2017 was impacted by impairments of $160 million related to a downward revision of cash flow projections across all steel facilities in ArcelorMittal South Africa. Operating loss in 4Q 2016 was impacted by impairments of $156 million related to the Vanderbijlpark and Saldanha plants in South Africa.\nEBITDA in 4Q 2017 increased by 77% to $423 million as compared to $239 million in 3Q 2017, primarily due to improved performance in both CIS and South Africa (positive price-cost effect) partly offset by lower shipment volumes. EBITDA in 4Q 2017 was significantly higher as compared to $142 million in 4Q 2016, primarily due to a positive price-cost effect in CIS and South Africa as well as higher steel shipments (+5.1%).\nMining\n(USDm) unless otherwise shown 4Q 17 3Q 17 4Q 16 12M 17 12M 16 Sales 959 1,029 896 4,033 3,114 Operating income 159 238 203 991 366 Depreciation (108) (103) (94) (416) (396) EBITDA 267 341 297 1,407 762 Own iron ore production (a) (Mt) 14.4 14.2 13.9 57.4 55.2 Iron ore shipped externally and internally at market price (b) (Mt) 8.4 9.1 8.1 35.7 33.6 Iron ore shipment - cost plus basis (Mt) 5.8 5.9 5.4 22.2 22.3 Own coal production (a) (Mt) 1.5 1.5 1.8 6.3 6.3 Coal shipped externally and internally at market price (b) (Mt) 0.6 0.6 0.9 2.8 3.4 Coal shipment - cost plus basis (Mt) 0.9 0.9 0.9 3.5 3.4 (a) Own iron ore and coal production not including strategic long-term contracts.\n(b) Iron ore and coal shipments of market-priced based materials include the Company's own mines, and share of production at other mines, and exclude supplies under strategic long-term contracts.\nOwn iron ore production in 4Q 2017 increased by 1.4% to 14.4Mt as compared to 14.2Mt in 3Q 2017. During 4Q 2017, iron ore production in ArcelorMittal Mines Canada [13] (AMMC) was negatively impacted by mine pit wall instability issues. Despite weather related delays at the start of the quarter, Liberia production increased and achieved its full 5Mt run-rate in December 2017. Own iron ore production in 4Q 2017 increased by 3.7% as compared to 4Q 2016 primarily due to increased production in Mexico (following the restart of the Volcan mine in February 2017) and Liberia offset by lower production in AMMC.\nMarket-priced iron ore shipments in 4Q 2017 decreased by 7.2% to 8.4Mt as compared to 9.1Mt in 3Q 2017, primarily driven by lower shipments in AMMC impacted by poor weather conditions. Market-priced iron ore shipments in 4Q 2017 increased by 3.8% as compared to 4Q 2016 driven by increased shipments in Mexico (following restart of Volcan mine in February 2017) and Liberia.\n12M 2017 market-priced iron ore shipments grew by 6.1% versus 12M 2016. Market-priced iron ore shipments are expected to grow by approximately 10% in FY 2018 versus 12M 2017, primarily due to the ramp up of the Liberia mines (expected to grow by approximately 3Mt on a full year basis to 5Mt in 12M 2018).\nOwn coal production in 4Q 2017 decreased by 1.4% to 1.5Mt as compared to 3Q 2017 primarily due to lower production in Kazakhstan. Own coal production in 4Q 2017 decreased by 16.1% as compared to 4Q 2016 primarily due to lower production in Kazakhstan and at Princeton (US) mines.\nMarket-priced coal shipments in 4Q 2017 was stable at 0.6Mt as compared to 3Q 2017. Market-priced coal shipments in 4Q 2017 decreased by 34.5% as compared to 4Q 2016 primarily due to decreased shipments at Kazakhstan driven mainly by geological issues and lower yield.\nOperating income in 4Q 2017 decreased to $159 million as compared to $238 million in 3Q 2017, and $203 million in 4Q 2016, primarily for the reasons discussed.\nEBITDA in 4Q 2017 decreased by 21.8% to $267 million as compared to $341 million in 3Q 2017, primarily due to decreased seaborne iron ore reference prices (-8.1%) and lower market-priced iron ore shipments (-7.2%). EBITDA in 4Q 2017 was lower as compared to $297 million in 4Q 2016, primarily due to lower seaborne iron ore reference prices (-7.1%) and lower coal shipments, offset in part by higher market-priced iron ore shipment volumes (+3.8%).\nLiquidity and Capital Resources\nFor 4Q 2017, net cash provided by operating activities was $2,885 million as compared to $763 million in 3Q 2017 and $1,653 million in 4Q 2016. The higher net cash provided by operating activities during 4Q 2017 reflects in part a working capital release of $1,657 million, as compared to an investment of $801 million in 3Q 2017 and a release of $495 million in 4Q 2016.\nNet cash used in investing activities during 4Q 2017 was $931 million as compared to $563 million during 3Q 2017 and to $809 million in 4Q 2016. Capital expenditure increased to $1,036 million in 4Q 2017 as compared to $637 million in 3Q 2017 and to $802 million in 4Q 2016. FY 2018 capital expenditure is expected to be $3.8 billion.\nCash provided by other investing activities in 4Q 2017 of $105 million primarily includes tangible asset disposals and disposal proceeds of US long products (Georgetown). Cash provided by other investing activities in 3Q 2017 of $74 million primarily includes the first installment proceeds from disposal of ArcelorMittal USA's 21% stake in the Empire Iron Mining Partnership ($44 million).\nNet cash used by financing activities in 4Q 2017 includes $1.2 billion of bonds repurchased in October pursuant to cash tender offers, $0.6 billion (€540 million) repayment at maturity of the euro 4.625% Notes due November 17, 2017, $644 million used to early redeem in December the 6.125% Notes due June 1, 2018 and partial repayment of borrowings offset in part by a new $0.4 billion (€300 million) Schuldschein loan in October and $0.6 billion (€500 million) euro 0.95% bond due January 17, 2023 issued in December. Net cash provided by financing activities in 3Q 2017 includes borrowings and commercial paper, offset in part by a $0.5 billion repayment of the asset-based revolving credit facility at ArcelorMittal USA. Net cash used in financing activities for 4Q 2016 primarily includes repayments of a $0.3 billion loan and $0.5 billion of short term facilities, offset in part by a $0.3 billion increase in commercial paper issuances.\nDuring 4Q 2017, the Company paid dividends of $21 million primarily to minority shareholders in Bekaert (Brazil) as compared to $80 million in 3Q 2017 and $7 million in 4Q 2016.\nAs of December 31, 2017, the Company's cash and cash equivalents amounted to $2.8 billion as compared to $3.0 billion at September 30, 2017 and $2.6 billion at December 31, 2016. Gross debt decreased to $12.9 billion as of December 31, 2017, as compared to $14.9 billion at September 30, 2017 and $13.7 billion at December 31, 2016.\nAs of December 31, 2017, net debt decreased to $10.1 billion as compared with $12.0 billion at September 30, 2017 primarily due to positive free cash flow ($1.8 billion), and lower as compared to $11.1 billion as of December 31, 2016 due to positive free cash flow ($1.7 billion) offset in part by negative foreign exchange impacts on Euro-denominated debt ($0.7 billion).\nAs of December 31, 2017, the Company had liquidity of $8.3 billion, consisting of cash and cash equivalents of $2.8 billion and $5.5 billion of available credit lines [14] . The $5.5 billion credit facility contains a financial covenant of 4.25x Net debt / EBITDA (as defined in the facility). On December 31, 2017, the average debt maturity was 4.6 years.\nArcelorMittal's employee benefit net liabilities decreased from $8.1 billion at December 31, 2016 to $7.5 billion at December 31, 2017 following the increase of the return on plan assets as well as impact of other actuarial assumptions partially offset by the increase of the defined benefit obligation due to decreased discount rates.\nAction 2020 progress\nThe Company has made measurable progress on its strategic Action 2020 plan resulting in $0.6 billion of contribution to 2017 operating results, bringing the cumulative benefit to $1.5 billion.\nWe are approximately one-half of the way along the Action 2020 journey with all segments contributing to the progress. The savings achieved in 2017 include volume contribution ($0.3 billion) as well as a combination of cost and product mix improvements ($0.3 billion). Volume is a key component of Action 2020 (5Mt volume improvement) and we expect to see more progress in this area in 2018 and beyond, assuming market conditions remain favorable.\nEurope: The transformation program has progressed well. Savings at the cluster-leading plants continue to be made, with changes to the operating model to restructure and modernise the organisation now well embedded. The organisation is benefiting from a more integrated, centrally co-ordinated approach, further reducing costs. Additional gains are being made with enhanced use of and investment in digitalisation in the manufacturing process, supply chain and commercial teams. Overall, net volume gains and improved mix contributed with higher hot strip mill production offset in part by lower volumes caused by operational issues primarily in the long business. NAFTA: Indiana Harbor footprint optimization has been completed: Savings achieved came from headcount rationalization and efficiencies following closure of its 84\" hot strip mill (HSM), idling of the No.2 steel shop, ongoing benefits from a new caster at No.3 steel shop. Restoration of the 80\" HSM and Indiana Harbor finishing will continue in 2018. Volume gains have been offset in part by lower automotive sales. NAFTA: Calvert ramp up is advancing with automotive qualifications proceeding and increased capacity utilization (up 10% YoY). Brazil: Structural cost reductions are being implemented; improved HAV mix from flat business. ACIS: Ukraine benefited from the construction of a new coke oven battery #6 and other PCI/energy saving initiatives. Improving operational performance in Kazakhstan with production records during the year was offset by lower shipment volumes in Ukraine. Mining: The business remains focussed on service, quality and asset reliability. Cost focus maintained: FCF breakeven remains at $40/t China CFR 62% Fe.\nKey recent developments\nOn December 15, 2017, ArcelorMittal announced the extension of the conversion date for the $1.0 billion privately placed mandatory convertible bond (MCB) issued on December 28, 2009 by one of its wholly-owned Luxembourg subsidiaries. This amendment to the MCB, which is mandatorily convertible into preferred shares of such subsidiary, was executed on December 14, 2017. The mandatory conversion date of the bond has been extended to January 29, 2021. The other main features of the MCB remain unchanged. The bond was placed privately with Credit Agricole Corporate and Investment Bank and is not listed. The subsidiary has simultaneously executed amendments providing for the extension of the outstanding Notes into which it invested the proceeds of the bond issuance, which are linked to shares of the listed companies Eregli Demir Va Celik Fab. T. AS of Turkey and China Oriental Group Company Limited, both of which are held by ArcelorMittal subsidiaries.\nOn December 13, 2017, ArcelorMittal and the \"Fonds d'Urbanisation et d'Aménagement du Plateau de Kirchberg,\" (\"the Fonds Kirchberg\") announced that the architectural firm Wilmotte & Associés (\"W&A\") was the winner of the architectural consultation to design ArcelorMittal's new global headquarters building in Luxembourg. W&A was selected by a nine-person jury chaired by Aditya Mittal, CFO of ArcelorMittal and CEO of ArcelorMittal Europe, following a highly competitive process with designs proposed by many of the world's leading architects. The ambitious winning design is primarily steel, and will showcase the diverse benefits of steel over other building materials in addition to highlighting the use of steel in 'green', sustainable construction. As well as being ArcelorMittal's headquarters, housing around 800 employees, some of the space will be leased for other uses. There will also be a restaurant, sports facility and a 200-seat auditorium available to the public.\nOn December 4, 2017, ArcelorMittal announced the issuance of €500 million 0.95%. Notes due January 17, 2023. The Notes were issued under ArcelorMittal's €10 billion wholesale Euro Medium Term Notes Programme. The proceeds of the issuance were used for general corporate purposes, including the refinancing of existing debt (such as the 6.125% Notes due June 1, 2018 being early redeemed on December 28, 2017).\nOn November 28, 2017, ArcelorMittal confirmed that it had given notice that it would redeem all of the then outstanding U.S. $643.5 million of its U.S. $1.5 billion 6.125% Notes due June 1, 2018. The settlement occurred on December 28, 2017, with total cash spent of $658 million including accrued interest and premium on early repayment.\nFinancial calendar for 2018:\nMay 9, 2018: ArcelorMittal Annual General Meeting May 11, 2018: 1Q 2018 earnings release, conference call with Heads of Finance and Investor Relations August 1, 2018: 2Q 2018 earnings release, and half year 2018 conference call with CEO and CFO (CEO office), Heads of Finance and Investor Relations November 1, 2018: 3Q 2018 earnings release, conference call with Heads of Finance and Investor Relations\nOutlook and guidance\nMarket conditions are favorable. The demand environment remains positive (as evidenced by the continued high readings from the ArcelorMittal weighted PMI) and steel spreads remain healthy.\nGlobal apparent steel consumption (\"ASC\") is estimated to have expanded by +3.2% in 2017. Based on the current economic outlook, ArcelorMittal expects global ASC to grow further in 2018 by between +1.5% to +2.5%. By region: ASC in US is expected to grow +1.5% to +2.5% in 2018 (including pipes and tubes) (versus +1.3% in 2017) driven by demand in machinery and construction. In Europe, we expect underlying demand to continue to grow, supported by the strength of machinery and construction end markets, and overall demand is expected to be +1.0% to +2.0% in 2018 (versus growth of 1.5% in 2017). In Brazil, ASC is expected to grow by +6.5% to +7.5% in 2018 (an acceleration of growth versus +4.6% in 2017), as the economy starts to turnaround with improved consumer confidence and pick up in longs as construction recovers. In the CIS, ASC is estimated to grow +2.0% to +3.0% in 2018 (a moderation of growth versus +5.4% in 2017). In China, ASC grew by +3.5% in 2017, higher than our initial expectations. Overall demand is expected to remain close to this level in 2018 (between -0.5% to +0.5%), as the anticipated weakness in the real estate sector is expected to be offset in part by robust infrastructure and automotive end markets. Nevertheless, ex-China ASC is expected to grow by approximately +3.0% to +4.0% in 2018 (versus +2.8% in 2017), which supports global ASC growth of +1.5% to +2.5% in 2018 (as compared to growth of ~3.2% in 2017).\nThe Company expects cash needs of the business (excluding working capital investment) to increase in 2018 to approximately $5.6 billion from $4.4 billion in 2017. The expected increase in capex to $3.8 billion in 2018 from $2.8 billion in 2017 largely reflects the Mexico HSM project and anticipated ILVA capex as well as additional strategic projects (including further investment to enhance downstream optimization in Europe). Net interest is expected to decline to $0.6 billion from $0.8 billion in 2017 reflecting the benefits of liability management exercises completed in 2017. Other cash needs are expected to increase to $1.2 billion from $0.8 billion in 2017, primarily on account of higher expected cash taxes due to timing impacts.\nArcelorMittal Condensed Consolidated Statement of Financial Position 1\nDec 31, Sept 30, Dec 31, In millions of U.S. dollars 2017 2017 2016 ASSETS Cash and cash equivalents (C) 2,786 2,978 2,615 Trade accounts receivable and other 3,863 4,443 2,974 Inventories 17,986 17,780 14,734 Prepaid expenses and other current assets 1,931 2,719 1,665 Assets held for sale [15] 179 127 259 Total Current Assets 26,745 28,047 22,247 Goodwill and intangible assets 5,737 5,856 5,651 Property, plant and equipment 36,971 36,471 34,831 Investments in associates and joint ventures 5,084 4,943 4,297 Deferred tax assets 7,055 6,697 5,837 Other assets 3,705 2,498 2,279 Total Assets 85,297 84,512 75,142 LIABILITIES AND SHAREHOLDERS' EQUITY Short-term debt and current portion of long-term debt (B) 2,785 5,764 1,885 Trade accounts payable and other 13,428 12,074 11,633 Accrued expenses and other current liabilities 5,147 5,229 4,502 Liabilities held for sale 15 50 40 95 Total Current Liabilities 21,410 23,107 18,115 Long-term debt, net of current portion (A) 10,143 9,185 11,789 Deferred tax liabilities 2,684 2,713 2,529 Other long-term liabilities 10,205 10,966 10,384 Total Liabilities 44,442 45,971 42,817 Equity attributable to the equity holders of the parent 38,789 36,374 30,135 Non-controlling interests 2,066 2,167 2,190 Total Equity 40,855 38,541 32,325 Total Liabilities and Shareholders' Equity 85,297 84,512 75,142 Net Debt (D=A+B-C) 10,142 11,971 11,059\nArcelorMittal Condensed Consolidated Statement of Operations 1\nThree months ended Twelve months ended In millions of U.S. dollars unless otherwise shown Dec 31,\n2017 Sep 30,\n2017 Dec 31,\n2016 Dec 31,\n2017 Dec 31,\n2016 Sales 17,710 17,639 14,126 68,679 56,791 Depreciation (B) (747) (690) (696) (2,768) (2,721) Impairment (B) (160) - (156) (206) (205) Exceptional income 5 (B) - - - - 832 Operating income (A) 1,234 1,234 809 5,434 4,161 Operating margin % 7.0% 7.0% 5.7% 7.9% 7.3% Income from associates, joint ventures and other investments 125 117 14 448 615 Net interest expense (188) (205) (221) (823) (1,114) Foreign exchange and other net financing gain/(loss) (261) 132 (278) (52) (942) Income before taxes and non-controlling interests 910 1,278 324 5,007 2,720 Current tax expense (134) (116) (80) (583) (254) Deferred tax benefit / (expense) 253 45 93 151 (732) Income tax benefit / (expense) 119 (71) 13 (432) (986) Income including non-controlling interests 1,029 1,207 337 4,575 1,734 Non-controlling interests (income) / loss 10 (2) 66 (7) 45 Net income attributable to equity holders of the parent 1,039 1,205 403 4,568 1,779 Basic earnings per common share ($) 3 1.02 1.18 0.40 4.48 1.87 Diluted earnings per common share ($) 3 1.01 1.18 0.39 4.46 1.86 Weighted average common shares outstanding (in millions) 3 1,020 1,020 1,020 1,020 953 Diluted weighted average common shares outstanding (in millions) 3 1,024 1,023 1,021 1,024 955 OTHER INFORMATION EBITDA (C = A-B) 2,141 1,924 1,661 8,408 6,255 EBITDA Margin % 12.1% 10.9% 11.8% 12.2% 11.0% Own iron ore production (Mt) 14.4 14.2 13.9 57.4 55.2 Crude steel production (Mt) 22.7 23.6 21.8 93.1 90.8 Total shipments of steel products (Mt) 21.0 21.7 20.0 85.2 83.9\nArcelorMittal Condensed Consolidated Statement of Cash flows 1\nThree months ended Twelve months ended In millions of U.S. dollars Dec 31,\n2017 Sept 30,\n2017 Dec 31,\n2016 Dec 31,\n2017 Dec 31,\n2016 Operating activities: Income attributable to equity holders of the parent 1,039 1,205 403 4,568 1,779 Adjustments to reconcile net income to net cash (used in) / provided by operations: Non-controlling interest's income / (loss) (10) 2 (66) 7 (45) Depreciation and impairment 907 690 852 2,974 2,926 Exceptional income 5 - - - - (832) Income from associates, joint ventures and other investments (125) (117) (14) (448) (615) Deferred tax (benefit)/ expense (253) (45) (93) (151) 732 Change in working capital 1,657 (801) 495 (1,873) (1,023) Other operating activities (net) (330) (171) 76 (514) (214) Net cash provided by operating activities (A) 2,885 763 1,653 4,563 2,708 Investing activities: Purchase of property, plant and equipment and intangibles (B) (1,036) (637) (802) (2,819) (2,444) Other investing activities (net) 105 74 (7) (11) 1,301 Net cash used in investing activities (931) (563) (809) (2,830) (1,143) Financing activities: Net (payments) / proceeds relating to payable to banks and long-term debt (2,131) 587 (450) (1,527) (6,007) Dividends paid (21) (80) (7) (141) (61) Equity offering - - - - 3,115 Other financing activities (net) (15) 7 (11) (63) 27 Net cash (used in) / provided by financing activities (2,167) 514 (468) (1,731) (2,926) Net (decrease) / increase in cash and cash equivalents (213) 714 376 2 (1,361) Cash and cash equivalents transferred from assets held for sale - - (13) 13 (13) Effect of exchange rate changes on cash 16 9 (15) 58 (127) Change in cash and cash equivalents (197) 723 348 73 (1,501) Free cash flow (C=A+B) 1,849 126 851 1,744 264 Appendix 1: Product shipments by region\n(000'kt) 4Q 17 3Q 17 4Q 16 12M 17 12M 16 Flat 4,414 4,820 4,301 18,926 18,207 Long 872 984 817 3,530 3,647 NAFTA 5,150 5,655 5,011 21,834 21,281 Flat 1,950 1,766 1,877 6,762 6,689 Long 1,108 1,181 964 4,100 4,064 Brazil 3,052 2,940 2,841 10,840 10,753 Flat 7,298 7,098 6,541 29,255 27,971 Long 2,821 2,954 2,967 11,494 12,114 Europe 10,151 10,116 9,535 40,941 40,247 CIS 2,209 2,297 2,198 8,837 9,181 Africa 1,044 1,065 895 4,256 4,087 ACIS 3,254 3,362 3,095 13,094 13,271 Note: \"Others and eliminations\" lines are not presented in the table\nAppendix 2a: Capital expenditures\n(USDm) 4Q 17 3Q 17 4Q 16 12M 17 12M 16 NAFTA 184 95 138 466 445 Brazil 72 79 81 263 237 Europe 430 213 313 1,143 951 ACIS 165 114 128 427 397 Mining 179 132 137 495 392 Total 1,036 637 802 2,819 2,444 Note: \"Others and eliminations\" are not presented in the table\nAppendix 2b: Capital expenditure projects\nThe following tables summarize the Company's principal growth and optimization projects involving significant capital expenditures.\nCompleted projects in most recent quarters\nSegment Site / unit Project Capacity / details Actual completion NAFTA AM/NS Calvert Phase 2: Slab yard expansion (Bay 5) Increase coil production level from 4.6Mt/year to 5.3Mt/year coils 2Q 2017 NAFTA ArcelorMittal Dofasco (Canada) Phase 2: Convert the current galvanizing line #4 to a Galvalume line Allow the galvaline #4 to produce 160kt galvalume and 128kt galvanize and closure of galvanize line #1 (capacity 170kt of galvalume) 2Q 2017\nEurope ArcelorMittal Krakow (Poland) Hot strip mill (HSM) extension Increase hot rolled coil (HRC) capacity by 0.9Mt/year 2Q 2017 Europe ArcelorMittal Krakow (Poland) Hot dipped galvanizing (HDG) increase Increasing HDG capacity by 0.4Mt/year 2Q 2017\nOngoing projects\nSegment Site / unit Project Capacity / details Forecast completion Europe Gent & Liège (Europe Flat Automotive UHSS Program)\nGent: Upgrade HSM and new furnace\nLiège: Annealing line transformation Increase ~400kt in Ultra High Strength Steel capabilities 1Q 2018 Europe ArcelorMittal Differdange Modernisation of finishing of \"Grey rolling mill\" Revamp finishing to achieve full capacity of Grey mill at 850kt/y 1Q 2018 ACIS ArcelorMittal Kryvyi Rih New LF&CC 2&3 Facilities upgrade to switch from ingot to continuous caster route. Additional billets of 290kt over ingot route through yield increase 4Q 2018 NAFTA Indiana Harbor Indiana Harbor \"footprint optimization project\" Restoration of 80\" HSM and upgrades at Indiana Harbor finishing 2018 (a) Europe Sosnowiec (Poland) Modernization of Wire Rod Mill Upgrade rolling technology improving the mix of HAV products and increase volume by 90kt 2019 NAFTA Mexico Build new HSM Production capacity of 2.5Mt/year 2020 (b) NAFTA Burns Harbor New Walking Beam Furnaces Two new walking beam reheat furnaces bringing benefits on productivity, quality and operational cost 2021 Brazil ArcelorMittal Vega Do Sul Expansion project Increase hot dipped galvanizing (HDG) capacity by 0.6Mt/year and cold rolling (CR) capacity by 0.7Mt/year On hold Brazil Juiz de Fora Meltshop expansion Increase in meltshop capacity by 0.2Mt/year On hold (c)\nBrazil Monlevade Sinter plant, blast furnace and meltshop Increase in liquid steel capacity by 1.2Mt/year;\nSinter feed capacity of 2.3Mt/year On hold Mining Liberia Phase 2 expansion project Increase production capacity to 15Mt/year Under review (d) In support of the Company's Action 2020 program that was launched at its fourth quarter and full-year 2015 earnings announcement, the footprint optimization project at ArcelorMittal Indiana Harbor is now complete, which has resulted in structural changes required to improve asset and cost optimization. The plan involved idling redundant operations including the #1 aluminize line, 84\" hot strip mill (HSM), and #5 continuous galvanizing line (CGL) and No.2 steel shop (idled in 2Q 2017) whilst making further planned investments totalling ~$200 million including a new caster at No.3 steelshop (completed in 4Q 2016), restoration of the 80\" hot strip mill and Indiana Harbor finishing are ongoing. The full project scope is expected to be completed in 2018.\nOn September 28, 2017, ArcelorMittal announced a major US$1 billion, three-year investment programme at its Mexican operations, which is focussed on building ArcelorMittal Mexico's downstream capabilities, sustaining the competitiveness of its mining operations and modernising its existing asset base. The programme is designed to enable ArcelorMittal Mexico to meet the anticipated increased demand requirements from domestic customers, realise in full ArcelorMittal Mexico's production capacity of 5.3 million tonnes and significantly enhance the proportion of higher-value added products in its product mix, in-line with the Company's Action 2020 strategic plan. The main investment will be the construction of a new hot strip mill. Construction will take approximately three years and, upon completion, will enable ArcelorMittal Mexico to produce c. 2.5 million tonnes of flat rolled steel, long steel c. 1.8 million tonnes and the remainder made up of semi-finished slabs. Coils from the new hot strip mill will be supplied to domestic, non-auto, general industry customers. The project commenced late 4Q 2017 and is expected to be completed in the second quarter of 2020. The Company expects capital expenditures of approximately $350 million with respect to this programme in 2018.\nAlthough the Monlevade wire rod expansion project and Juiz de Fora rebar expansion were completed in 2015, the Juiz de Fora melt shop project is currently on hold and is expected to be completed upon Brazil domestic market recovery, and the Company does not expect to increase shipments until domestic demand improves.\nArcelorMittal Liberia is moving ore extraction from its depleting DSO (direct shipping ore) deposit at Tokadeh to the nearby, low strip ratio and higher-grade DSO Gangra deposit where planned ramp up has progressed, reaching a 5Mt run rate at the end of December 2017. Following a period of exploration cessation caused by the onset of Ebola, ArcelorMittal Liberia recommenced drilling for DSO resource extensions in late 2015. During 2016, the operation at Tokadeh was right-sized to focus on its \"natural\" Atlantic markets. The nearby Gangra deposit has now been developed as part of the staged approach as opposed to the originally planned phase 2 step up to 15Mtpa of concentrate sinter fine ore product that was delayed in August 2014 due to the declaration of force majeure by contractors following the Ebola virus outbreak, and then reassessed following rapid iron ore price declines over the period since. The Gangra mine, haul road and related existing plant and equipment upgrades are nearing completion. ArcelorMittal remains committed to Liberia where it operates a full value chain of mine, rail and port and where it has been operating the mine on a DSO basis since 2011. The Company believes that ArcelorMittal Liberia presents a strong, competitive source of product ore for the international market based on continuing DSO mining and then moving to a long-term sinter feed concentration phase.\nAppendix 3: Debt repayment schedule as of December 31, 2017\nDebt repayment schedule (USD billion) 2018 2019 2020 2021 2022 >2023 Total Bonds 0.9 0.9 1.9 1.4 1.5 2.8 9.4 Commercial paper 1.1 - - - - - 1.1 Other loans 0.8 0.3 0.2 0.4 0.2 0.5 2.4 Total gross debt 2.8 1.2 2.1 1.8 1.7 3.3 12.9 Appendix 4: Terms and definitions\nUnless indicated otherwise, or the context otherwise requires, references in this earnings release report to the following terms have the meanings set out next to them below:\nAverage steel selling prices: calculated as steel sales divided by steel shipments.\nCash and cash equivalents: represents cash and cash equivalents, restricted cash and short-term investments.\nCapex: includes the acquisition of tangible and intangible assets.\nEBITDA: operating income plus depreciation, impairment expenses and exceptional income/(charges).\nEBITDA/tonne: calculated as EBITDA divided by total steel shipments.\nExceptional income / (charges): relate to transactions that are significant, infrequent or unusual and are not representative of the normal course of business such as restructuring costs or asset disposals.\nForeign exchange and other net financing (loss) / gain: include foreign currency exchange impact, bank fees, interest on pensions, impairments of financial instruments, revaluation of derivative instruments and other charges that cannot be directly linked to operating results.\nFree cash flow (FCF) : Refers to net cash provided by (used in) operating activities less capex.\nGross debt : long-term debt, plus short-term debt (including those held as part of liabilities held for sale).\nIron ore unit cash cost: includes weighted average pellet and concentrate cost of goods sold across all mines.\nLiquidity: Cash and cash equivalents plus available credit lines excluding back-up lines for the commercial paper program.\nLTIF: lost time injury frequency rate equals lost time injuries per 1,000,000 worked hours, based on own personnel and contractors.\nMT: Refers to million metric tonnes\nMarket-priced tonnes: represent amounts of iron ore and coal from ArcelorMittal mines that could be sold to third parties on the open market. Market-priced tonnes that are not sold to third parties are transferred from the Mining segment to the Company's steel producing segments and reported at the prevailing market price. Shipments of raw materials that do not constitute market-priced tonnes are transferred internally and reported on a cost-plus basis.\nMining segment sales: i) \"External sales\": mined product sold to third parties at market price; ii) \"Market-priced tonnes\": internal sales of mined product to ArcelorMittal facilities and reported at prevailing market prices; iii) \"Cost-plus tonnes\" - internal sales of mined product to ArcelorMittal facilities on a cost-plus basis. The determinant of whether internal sales are reported at market price or cost-plus is whether the raw material could practically be sold to third parties (i.e. there is a potential market for the product and logistics exist to access that market).\nNet debt: long-term debt, plus short-term debt less cash and cash equivalents (including those held as part of liabilities held for sale).\nNet debt/EBITDA: Refers to Net debt divided by last twelve months EBITDA calculation.\nNet interest: includes interest expense and interest income\nOn-going projects: Refer to projects for which construction has begun (excluding various projects that are under development), even if such projects have been placed on hold pending improved operating conditions.\nOperating results: Refers to operating income/(loss).\nOperating segments: The NAFTA segment includes the Flat, Long and Tubular operations of USA, Canada and Mexico. The Brazil segment includes the Flat operations of Brazil, and the Long and Tubular operations of Brazil and its neighboring countries including Argentina, Costa Rica and Venezuela. The Europe segment comprises the Flat, Long and Tubular operations of the European business, as well as Downstream Solutions. The ACIS segment includes the Flat, Long and Tubular operations of Kazakhstan, Ukraine and South Africa. Mining segment includes iron ore and coal operations.\nOwn iron ore production: Includes total of all finished production of fines, concentrate, pellets and lumps (excludes share of production and strategic long-term contracts).\nPMI: Refers to purchasing managers index (based on ArcelorMittal estimates)\nS eaborne iron ore reference prices: refers to iron ore prices for 62% Fe CFR China.\nShipments: information at segment and group level eliminates intra-segment shipments (which are primarily between Flat/Long plants and Tubular plants) and inter-segment shipments respectively. Shipments of Downstream Solutions are excluded.\nSteel-only EBITDA: calculated as EBITDA less Mining segment EBITDA.\nSteel-only EBITDA/tonne: calculated as steel-only EBITDA divided by total steel shipments.\nWorking capital: trade accounts receivable plus inventories less trade and other accounts payable.\nYoY : Refers to year-on-year.\n[1] The financial information in this press release has been prepared consistently with International Financial Reporting Standards (\"IFRS\") as issued by the International Accounting Standards Board (\"IASB\") and as adopted by the European Union. The interim financial information included in this announcement has been also prepared in accordance with IFRS applicable to interim periods, however this announcement does not contain sufficient information to constitute an interim financial report as defined in International Accounting Standard 34, \"Interim Financial Reporting\". The numbers in this press release have not been audited. The financial information and certain other information presented in a number of tables in this press release have been rounded to the nearest whole number or the nearest decimal. Therefore, the sum of the numbers in a column may not conform exactly to the total figure given for that column. In addition, certain percentages presented in the tables in this press release reflect calculations based upon the underlying information prior to rounding and, accordingly, may not conform exactly to the percentages that would be derived if the relevant calculations were based upon the rounded numbers. This press release also includes certain non-GAAP financial measures. ArcelorMittal presents EBITDA, and EBITDA/tonne, which are non-GAAP financial measures and defined in the Condensed Consolidated Statement of Operations, as additional measurements to enhance the understanding of operating performance. ArcelorMittal believes such indicators are relevant to describe trends relating to cash generating activity and provides management and investors with additional information for comparison of the Company's operating results to the operating results of other companies. ArcelorMittal also presents net debt as an additional measurement to enhance the understanding of its financial position, changes to its capital structure and its credit assessment. ArcelorMittal also presents free cash flow, which is a non-GAAP financial measure defined in the Condensed Consolidated Statement of Cash flows, because it believes it is a useful supplemental measure for evaluating the strength of its cash generating capacity. Non-GAAP financial measures should be read in conjunction with and not as an alternative for, ArcelorMittal's financial information prepared in accordance with IFRS. Such non-GAAP measures may not be comparable to similarly titled measures applied by other companies.\n[2] Free cash flow for the full year 2017 totalled $1.7 billion including cash flow from operations of $4.6 billion less capex of $2.8 billion\n[3] At the Extraordinary General Meeting held on May 10, 2017, the ArcelorMittal Shareholders approved a share consolidation based on a ratio 1:3, whereby every three shares were consolidated into one share (with a change in the number of shares outstanding and the accounting par value per share). The figures presented for the basic and diluted earnings per share reflect this change.\n[4] On July 28, 2016, ArcelorMittal and Megasa Siderúgica S.L. (\"Megasa\") signed a shares sale and purchase agreement in respect of ArcelorMittal's 100% interest in ArcelorMittal Zaragoza (\"AM Zaragoza\"). The closing conditions were completed on September 30, 2016. As a result, ArcelorMittal transferred its shareholding in AM Zaragoza to Megasa and simultaneously received the total cash consideration of €80 million ($89 million). The cash consideration was calculated on a cash and debt free basis.\n[5] On June 23, 2016, following the ratification by the United Steelworkers of a new labor agreement which is valid until September 1, 2018, ArcelorMittal made changes mainly to healthcare post-retirement benefits in its subsidiary ArcelorMittal USA (NAFTA). The changes resulted in a gain of $832 million recorded in 2Q 2016.\n[6] On August 7, 2017, ArcelorMittal USA and Cliffs Natural Resources (\"Cliffs\") agreed that Cliffs would acquire ArcelorMittal USA's 21% ownership interest in the Empire Iron Mining Partnership for $133 million plus assumptions of all partnership liabilities. The payment of $133 million will be made in 3 equal installments with the first payment of $44 million received in August 2017, and two subsequent payments to be received in August 2018 and 2019.\n[7] On January 27, 2017 China Oriental completed a share placement to restore the minimum 25% free float as per HKEx listing requirements. Following the share placement, ArcelorMittal's interest in China Oriental decreased from 47% to 39%, as a result of which ArcelorMittal recorded a net dilution loss of $44 million.\n[8] On August 25, 2017, following a sales agreement signed on October 21, 2016, ArcelorMittal completed the sale of its 50% shareholding in Kalagadi Manganese (Proprietary) Limited to Kgalagadi Alloys (Proprietary) Limited for consideration to be paid during the life of the mine, which is contingent on the financial performance of the mine and cash flow availability. The investment classified as held for sale as of December 31, 2016 had a nil carrying amount as it was fully impaired in 2015 but the Company recycled upon disposal accumulated foreign exchange translation losses of $187 million in income from associates, joint ventures and other investments.\n[9] On February 5, 2016 ArcelorMittal announced it had sold its 35% stake in Gestamp Automoción (\"Gestamp\") to the majority shareholder, the Riberas family, for a total cash consideration of €875 million ($971 million). In addition to the cash consideration, ArcelorMittal received in 2Q 2016 a payment of $11 million as a 2015 dividend.\n[10] On August 2, 2016, the Company signed an agreement for the sale of its 10.08% interest in Hunan Valin to a private equity fund. On September 14, 2016, the Company transferred the Hunan Valin shares and simultaneously received the full proceeds of $165 million (RMB1,103 million) from the buyer and recorded a gain of $74 million.\n[11] Effective October 31, 2016, the Company entered into a pellet purchase agreement in the US including a special payment component that varies according to the price of steel in the US domestic market. This feature corresponds to a derivative instrument recognized at fair value. The charge relates to outstanding minimum volumes to be purchased over the remaining life of the contract (9 years).\n[12] On September 28, 2016, ArcelorMittal South Africa (\"AMSA\") announced that it had entered into agreements to implement a Broad-Based Black Economic Empowerment (B-BBEE) transaction which includes: the issuance of a 17% shareholding in AMSA using a new class of notionally funded shares to a special purpose vehicle owned by Likamva Resources Proprietary Limited (Likamva). Likamva has undertaken to introduce broad-based social and community development organisations as shareholders to hold an effective 5% interest (of the 17%, leaving Likamva with a 12% shareholding) within 24 months; and a 5.1% shareholding in AMSA using another new class of notionally funded shares to the ArcelorMittal South Africa Employee Empowerment Share Trust for the benefit of AMSA employees and AMSA management. All the shares have certain restrictions on disposal for a period of 10 years (\"Lock-in Period\"), thereby promoting long-term sustainable B-BBEE in AMSA.\n[13] ArcelorMittal Mines Canada, otherwise known as ArcelorMittal Mines and Infrastructure Canada.\n[14] On December 21, 2016, ArcelorMittal signed an agreement for a $5.5 billion revolving credit facility (the \"Facility\"). This Facility amends and restates the $6 billion revolving credit facility dated April 30, 2015. The amended agreement incorporates a first tranche of $2.3 billion maturing on December 21, 2019, and a second tranche of $3.2 billion maturing on December 21, 2021. The Facility may be used for general corporate purposes. As of December 31, 2017, the $5.5 billion revolving credit facility remains fully available.\n[15] Assets and liabilities held for sale, as of December 31, 2017, primarily include the carrying value of the USA long product facilities at Steelton (\"Steelton\") and Frydek Mistek assets in Ostrava. Assets and liabilities held for sale, as of September 30, 2017, primarily include the carrying value of the USA long product facilities at Steelton (\"Steelton\"). Assets and liabilities held for sale as of December 31, 2016, include the carrying value of Steelton and some activities of ArcelorMittal Downstream Solutions in the Europe segment and America's Tailored Blanks.\nFourth quarter 2017 and full year 2017 earnings analyst conference call\nArcelorMittal management (Mr. Mittal, Chairman and CEO & Aditya Mittal, CFO and CEO Europe) will host a conference call for members of the investment community to discuss the three-month and twelve-month periods ended December 31, 2017 on: Wednesday January 31, 2018 at 9.30am US Eastern time; 2.30pm London time and 3.30pm CET.\nThe dial in numbers are: Location Toll free dial in numbers Local dial in numbers Participant UK local: 0800 0515 931 +44 (0)203 364 5807 63663485# US local: 1 86 6719 2729 +1 24 0645 0345 63663485# US (New York): 1 86 6719 2729 + 1 64 6663 7901 63663485# France: 0800 914780 +33 1 7071 2916 63663485# Germany: 0800 965 6288 +49 692 7134 0801 63663485# Spain: 90 099 4930 +34 911 143436 63663485# Luxembourg: 800 26908 +352 27 86 05 07 63663485# A replay of the conference call will be available for one week by dialing: +49 (0) 1805 2047 088; Access code 518172#\nForward-Looking Statements\nThis document may contain forward-looking information and statements about ArcelorMittal and its subsidiaries. These statements include financial projections and estimates and their underlying assumptions, statements regarding plans, objectives and expectations with respect to future operations, products and services, and statements regarding future performance. Forward-looking statements may be identified by the words \"believe\", \"expect\", \"anticipate\", \"target\" or similar expressions. Although ArcelorMittal's management believes that the expectations reflected in such forward-looking statements are reasonable, investors and holders of ArcelorMittal's securities are cautioned that forward-looking information and statements are subject to numerous risks and uncertainties, many of which are difficult to predict and generally beyond the control of ArcelorMittal, that could cause actual results and developments to differ materially and adversely from those expressed in, or implied or projected by, the forward-looking information and statements. These risks and uncertainties include those discussed or identified in the filings with the Luxembourg Stock Market Authority for the Financial Markets (Commission de Surveillance du Secteur Financier) and the United States Securities and Exchange Commission (the \"SEC\") made or to be made by ArcelorMittal, including ArcelorMittal's latest Annual Report on Form 20-F on file with the SEC. ArcelorMittal undertakes no obligation to publicly update its forward-looking statements, whether as a result of new information, future events, or otherwise.\nAbout ArcelorMittal\nArcelorMittal is the world's leading steel and mining company, with a presence in 60 countries and an industrial footprint in 18 countries. Guided by a philosophy to produce safe, sustainable steel, we are the leading supplier of quality steel in the major global steel markets including automotive, construction, household appliances and packaging, with world-class research and development and outstanding distribution networks.\nThrough our core values of sustainability, quality and leadership, we operate responsibly with respect to the health, safety and wellbeing of our employees, contractors and the communities in which we operate. For us, steel is the fabric of life, as it is at the heart of the modern world from railways to cars and washing machines. We are actively researching and producing steel-based technologies and solutions that make many of the products and components people use in their everyday lives more energy efficient.\nWe are one of the world's five largest producers of iron ore and metallurgical coal. With a geographically diversified portfolio of iron ore and coal assets, we are strategically positioned to serve our network of steel plants and the external global market. While our steel operations are important customers, our supply to the external market is increasing as we grow. In 2017, ArcelorMittal had revenues of $68.7 billion and crude steel production of 93.1 million metric tonnes, while own iron ore production reached 57.4 million metric tonnes.\nArcelorMittal is listed on the stock exchanges of New York (MT), Amsterdam (MT), Paris (MT), Luxembourg (MT) and on the Spanish stock exchanges of Barcelona, Bilbao, Madrid and Valencia (MTS). For more information about ArcelorMittal please visit: http://corporate.arcelormittal.com/\nEnquiries\nArcelorMittal investor relations: Europe: +44 207 543 1128; Americas: +1 312 899 3985; Retail: +44 207 543 1156; SRI: +44 207 543 1156 and Bonds/credit: +33 1 71 92 10 26.\nArcelorMittal corporate communications (E-mail: press@arcelormittal.com ) +44 0207 629 7988. Contact: Paul Weigh +44 203 214 2419; France (Image 7) Tel: +33 153 70 94 17\nAttachments:\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/b345b478-c88a-4ca0-8e2d-9afd3fdc560b\nSource:Arcelor Mittal S.A.", "external_links": ["http://www.globenewswire.com/NewsRoom/AttachmentNg/b345b478-c88a-4ca0-8e2d-9afd3fdc560b", "http://corporate.arcelormittal.com/", "https://www.globenewswire.com/Tracker?data=fUPOjdWGVgTDA72xOMMQqEBn5WgDRM7Omrd_WsgnGeDNg45QHU94F6KNDG9MGtoh-AQEZZxJTwpihBQnTWEs9u0ZgEwun-B_AYUqr9merIOzmk3kiBYMcRPFrTSAhPcOh1xQzf5EctRFikBC6NzF4mDCCB1C8-f8ULR0SAO6LYl2K283_nPZ8f_UqTTC3ZfQpiWLuj8YQs1XPPzCd5GHK2vHk4ex7t1q7JIjVWUR17SKV6lHiDUBehbmYBiuEP-Bw74S_UUAPtcRX-9Tml462g==", "https://www.globenewswire.com/Tracker?data=NHmSHMHUMzSm4hnnu33HpAjEwKbzhUVTGoQ-xnH38LIB8wY6qoGiFNoQU_L2N0JEXZFS8LntP4E6jmdMODhmaX8MJwzB9qlDFLJsvLna5ic=", "https://www.globenewswire.com/Tracker?data=fUPOjdWGVgTDA72xOMMQqIt2laUHGffAX7qV1AwytLLxBkX4hIbqluAJbQ9QQk5lpuZe_6Sed8sHVBQMI1tA7RewhEKd48LfJUHthRDwtUP3glMBZE_zRo5fjKuDbQgo"], "published": "2018-01-31T09:01:00.000+02:00", "crawled": "2018-01-31T11:09:47.024+02:00", "highlightTitle": ""}