{"organizations": [], "uuid": "1603d052d94e07ebea2dfe77fddeea643f1fabf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/pakistan-media-kidnapping/anti-establishment-pakistani-journalist-escapes-kidnap-attempt-idINKBN1EZ0TO", "country": "US", "domain_rank": 408, "title": "Anti-establishment Pakistani journalist escapes kidnap attempt", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T11:11:00.000+02:00", "replies_count": 0, "uuid": "1603d052d94e07ebea2dfe77fddeea643f1fabf1"}, "author": "", "url": "https://in.reuters.com/article/pakistan-media-kidnapping/anti-establishment-pakistani-journalist-escapes-kidnap-attempt-idINKBN1EZ0TO", "ord_in_thread": 0, "title": "Anti-establishment Pakistani journalist escapes kidnap attempt", "locations": [], "entities": {"persons": [{"name": "taha siddiqui", "sentiment": "none"}, {"name": "drazen jorgic", "sentiment": "none"}, {"name": "siddiqui", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "rawalpindi", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISLAMABAD (Reuters) - A Pakistani journalist, known for criticising his country’s military establishment, said on Wednesday he had narrowly escaped being kidnapped by armed men, in an incident that came months after he complained of being harassed by security services.\nA friend comforts Pakistani journalist Taha Siddiqui, who escaped a kidnapping attempt, after he made a statement to police in Rawalpindi, Pakistan January 10, 2018. REUTERS/Caren Firouz Taha Siddiqui, who reports for France 24 and is the Pakistan bureau chief of Indian television channel WION, said the attempted abduction took place while he was being driven by taxi to the airport serving the capital Islamabad and the neighbouring, larger garrison city of Rawalpindi.\n“I was on my way to airport today at 8:20 am when 10-12 armed men stopped my cab & forcibly tried to abduct me. I managed to escape. Safe and with police now,” Siddiqui tweeted from a friend’s Twitter account early in the morning.\n“Looking for support in any way possible #StopEnforcedDisappearances,” he added in the same tweet.\nRights groups have denounced the kidnappings of several social media activists over the past year as attempts to intimidate and silence critics of the Pakistan’s security establishment.\nLast year, five Pakistani bloggers went missing for several weeks before four of them were released. All four fled abroad and two afterwards told media that they were tortured by a state intelligence agency during their disappearance.\nThe military has staunchly denied playing a role in any enforced disappearances, as has the civilian government. In the past, militants have also targeted journalists.\nSiddiqui spoke to Reuters from a police station where he was filing a report on the incident, and described how his taxi was stopped on the highway when another vehicle swerved, and braked suddenly in front of it.\nPakistani journalist Taha Siddiqui, who escaped a kidnapping attempt, waits to be taken to the hospital after he made a statement to police in Rawalpindi, Pakistan January 10, 2018. REUTERS/Caren Firouz About a dozen men armed with rifles and revolvers pulled him out of the cab, beat him and “threatened to kill” him.\n“They threw me in the back of the vehicle in which I had been travelling, but the door on the other side was open,” Siddiqui said.\n“I jumped out and ran and was able to get into a taxi that was nearby, whose driver then floored it.”\nPakistani journalist Taha Siddiqui, who escaped a kidnapping attempt, waits to be taken to the hospital after he made a statement to police in Rawalpindi, Pakistan January 10, 2018. REUTERS/Caren Firouz In a police statement, seen by Reuters, Siddiqui said during the kidnap attempt he appealed for help from a military vehicle that was passing by.\n“I saw a military vehicle and shouted for help but one of the abductors gestured (the vehicle) to move on and they did,” Siddiqui said in the police statement, adding he had previously been “intimidated” by civilian and military security officials.\nSiddiqui pleaded with police to help him recover his personal belongings - laptop computer, phone, hard drives, passport and suitcase - and provide him and his family with “police protection”.\n“My life is under threat,” he said in the statement.\nLast year, the Committee to Protect Journalists said “Pakistan’s Federal Investigation Agency should stop harassing Taha Siddiqui”, referring to the civilian agency that last year began a crackdown on online criticism of the powerful military.\nSiddiqui last year filed a court petition to stop the agency from harassing him.\n Saad Sayeed; Writing by Drazen Jorgic; Editing by Simon Cameron-Moore\n ", "external_links": [], "published": "2018-01-10T11:11:00.000+02:00", "crawled": "2018-01-10T11:29:43.005+02:00", "highlightTitle": ""}