{"organizations": [], "uuid": "9249d5cf592953f05bacb42ce706cbfbd2e9b839", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-hongkong-maids-prison/hong-kong-set-to-jail-dishonest-maid-recruiters-in-slavery-fight-idUSKBN1FJ1WV", "country": "US", "domain_rank": 408, "title": "Hong Kong set to jail 'dishonest' maid recruiters in slavery fight", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.098, "site_type": "news", "published": "2018-01-30T21:59:00.000+02:00", "replies_count": 0, "uuid": "9249d5cf592953f05bacb42ce706cbfbd2e9b839"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-hongkong-maids-prison/hong-kong-set-to-jail-dishonest-maid-recruiters-in-slavery-fight-idUSKBN1FJ1WV", "ord_in_thread": 0, "title": "Hong Kong set to jail 'dishonest' maid recruiters in slavery fight", "locations": [], "entities": {"persons": [{"name": "eman villanueva", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "kuala lumpur", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Thomson Reuters Foundation) - Unscrupulous recruiters of domestic helpers in Hong Kong could soon be jailed under proposed reforms aimed at fighting modern slavery, but campaigners warned the changes would be futile unless properly enforced.\nThe financial hub has over 300,000 foreign domestic helpers and their treatment has come under scrutiny in recent years, particularly after a high-profile 2014 case of an Indonesian maid who was badly beaten by her employer.\nHong Kong’s government is seeking to increase fines against recruitment agencies found guilty of overcharging helpers to HK$350,000 ($45,000) from HK$50,000, as well as introducing jail terms of up to three years.\nThe proposal, first tabled to the city’s legislature last year, is due for final debate this week and expected to be passed.\nHong Kong-based Asian Migrants’ Coordinating Body spokesman Eman Villanueva said the changes were “very positive”.\n“But for these to be effective, the complaint system and mechanism should be improved, to enable and encourage victims to file complaints. The existing one is inadequate,” he told the Thomson Reuters Foundation by phone from Hong Kong.\nEvery year thousands of women from impoverished families in countries like the Philippines and Indonesia pay recruiters to secure jobs as domestic workers abroad.\nHong Kong’s rules stipulate recruiters cannot charge over 10 percent of a helper’s first monthly salary for this service but activists say this is often violated, with a 2016 study showing sometimes they are charged 25 times the legally permitted amount.\nThis practice means in many cases domestic helpers cannot not leave their jobs due to massive debt - even in cases where they are abused.\nRobert Godden from consultancy Rights Exposure, which conducted the 2016 study, said many domestic workers ended up victims of forced labor.\n“Contemporary form of slavery really is about using coercion to keep you in a job otherwise you would not agree to, and there are different methods of coercion, one is financial,” he said.\nGodden said Hong Kong needed to improve its poor record in prosecuting dishonest recruiters.\n“Unless they are caught breaking the law and they feel it is likely they would be caught breaking the law, then not much would change,” he told the Thomson Reuters Foundation.\nOne in six migrant domestic workers in Hong Kong is a victim of forced labor, according to another study in 2016 by campaign group Justice Centre Hong Kong.\nReporting by Beh Lih Yi @behlihyi, Editing by Belinda Goldsmith; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T21:59:00.000+02:00", "crawled": "2018-01-31T16:25:13.007+02:00", "highlightTitle": ""}