{"organizations": [], "uuid": "ce9a6b562a1d016dd699dc92240ab4fd9fccf550", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-sanmina-announces-preliminary-first-quarter-fiscal-2018-results.html", "country": "US", "domain_rank": 767, "title": "Sanmina Announces Preliminary First Quarter Fiscal 2018 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:05:00.000+02:00", "replies_count": 0, "uuid": "ce9a6b562a1d016dd699dc92240ab4fd9fccf550"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-sanmina-announces-preliminary-first-quarter-fiscal-2018-results.html", "ord_in_thread": 0, "title": "Sanmina Announces Preliminary First Quarter Fiscal 2018 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "sanmina corporation", "sentiment": "negative"}, {"name": "sanmina", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif., Jan. 19, 2018 /PRNewswire/ -- Sanmina Corporation (\"Sanmina\" or the \"Company\") (NASDAQ: SANM) today announced preliminary financial results for the first quarter ended December 30, 2017 and the outlook for the second quarter ending March 31, 2018.\nThe Company expects first quarter revenue of approximately $1.74 billion versus the prior outlook of $1.75 billion to $1.80 billion. The Company expects a first quarter GAAP loss per share of $1.85 to $2.27, including non-cash adjustments for deferred tax and discrete tax items of $2.03 to $2.31, restructuring costs of $0.19 to $0.33, stock-based compensation expense of $0.12, and amortization of intangible assets of $0.03. The Company expects non-GAAP (1) diluted earnings per share of $0.48, versus previously provided outlook of $0.68 to $0.74. (These preliminary financial results are subject to change in preparation of the unaudited financial statements for the quarter ended December 30, 2017.)\n\"Our disappointing financial results are driven by slower than expected new program ramps and an unfavorable program mix,\" stated Bob Eulau, Chief Executive Officer of Sanmina Corporation. \"Our GAAP financial results were mainly impacted by the non-cash charge to our deferred tax assets that resulted from the enactment of the Tax Cuts and Jobs Act. We are right-sizing our fixed cost structure and we remain confident that our pipeline is strong and our second half of fiscal 2018 will be stronger than our first half as we continue to execute on our strategy.\"\nSecond Quarter Fiscal 2018 Outlook\nThe following outlook is for the second fiscal quarter ending March 31, 2018. These statements are forward-looking and actual results may differ materially.\nRevenue between $1.60 billion to $1.70 billion GAAP diluted earnings per share between $0.20 to $0.30, including stock-based compensation expense of $0.17 and amortization of intangible assets and restructuring costs of $0.03 Non-GAAP diluted earnings per share between $0.40 to $0.50\nImpact of Tax Reform Act\nAs a result of the enactment of the Tax Cuts and Jobs Act (the \"Act\"), the Company expects GAAP income tax expense for the first quarter to include a non-cash charge of $150 million to $170 million relating to the reduction in carrying value of its net deferred tax assets. The Company does not expect to incur any additional material cash income tax expense in the first quarter as a result of the deemed repatriation tax provisions of the Act. The Company is in the process of finalizing these provisional amounts and will provide further information about its GAAP income tax expense associated with the Act in its earnings conference call for the first quarter on January 29, 2018.\nCompany Initiates Restructuring Plan\nOn January 12, 2018, the Company adopted a consolidated restructuring plan impacting three of its manufacturing facilities. As a result of this plan, the Company expects to incur restructuring charges of approximately $25 million to $35 million over the period of the consolidated restructuring plan, all of which is expected to be cash. In connection with this plan, the Company expects to record charges in its first quarter of fiscal 2018 of approximately $15 million to $25 million, consisting of severance and retention pay for affected employees to be paid over the period of the consolidated restructuring plan. The Company expects to complete the actions taken under this plan through the first quarter of fiscal 2020. The Company will continue to evaluate the consolidated restructuring plan, and any further actions that may be required under it, which could cause the Company to incur additional restructuring charges related to this plan in the future.\nCompany Conference Call Information\nSanmina will hold an update conference call on Monday, January 22, 2018 at 8:30 a.m. ET (5:30 a.m. PT). The access numbers are: domestic 877-273-6760 and international 706-634-6605. The conference will also be webcast live over the Internet. You can log on to the live webcast at www.sanmina.com . A replay of the conference call will be available for 48-hours. The access numbers are: domestic 855-859-2056 and international 404-537-3406, access code is 4347487.\nThe Company will announce full financial results for the first quarter fiscal 2018 on Monday, January 29, 2018 at 5:00 p.m. ET (2:00 p.m. PT). The access numbers are: domestic 877-273-6760 and international 706-634-6605. The conference will also be webcast live over the Internet. You can log on to the live webcast at www.sanmina.com . A replay of the conference call will be available for 48-hours. The access numbers are: domestic 855-859-2056 and international 404-537-3406, access code is 5278659.\n(1) The non-GAAP earnings per share estimates contained herein exclude charges or gains relating to: stock-based compensation expenses, restructuring costs (including employee severance and benefits costs and charges related to excess facilities and assets), acquisition and integration costs (consisting of costs associated with the acquisition and integration of acquired businesses into our operations), impairment charges for goodwill and other assets, amortization expense and charges associated with distressed customers, litigation settlements, gains and losses on sales of assets and redemptions of debt, deferred tax and discrete tax items to the extent material in the applicable period.\nAbout Sanmina\nSanmina Corporation is a leading integrated manufacturing solutions provider serving the fastest growing segments of the global Electronics Manufacturing Services (EMS) market. Recognized as a technology leader, Sanmina provides end-to-end manufacturing solutions, delivering superior quality and support to Original Equipment Manufacturers (OEMs) primarily in the communications networks, storage, industrial, defense, medical, energy, and industries that include embedded computing technologies, such as point of sale devices, casino gaming and automotive. Sanmina has facilities strategically located in key regions throughout the world. More information about the Company is available at www.sanmina.com .\nSanmina Safe Harbor Statement\nThe Company's preliminary results for first fiscal quarter revenue and earnings per share and outlook for the second fiscal quarter, expectations for the second half of fiscal 2018, expected restructuring charges and estimated GAAP income tax expense for the first quarter relating to the Act are all forward-looking statements within the meaning of the safe harbor provisions of Section 21E of the Securities Exchange Act of 1934. Final results could differ materially from those projected in these statements as a result of a number of factors, including changes to the estimates given herein as a result of completion of quarter-end closing activities, including finalization of all entries, adverse changes to the key markets we target, operational and other inefficiencies, risks arising from our international operations, competition that could cause us to lose sales, reliance on a relatively small number of customers for a substantial portion of our sales and the other factors set forth in the Company's annual and quarterly reports filed with the Securities Exchange Commission.\nThe Company is under no obligation to (and expressly disclaims any such", "external_links": ["http://photos.prnewswire.com/prnh/20110707/SF30965LOGO", "http://www.sanmina.com/", "http://www.prnewswire.com/news-releases/sanmina-announces-preliminary-first-quarter-fiscal-2018-results-300585436.html"], "published": "2018-01-20T00:05:00.000+02:00", "crawled": "2018-01-20T00:54:27.023+02:00", "highlightTitle": ""}