{"organizations": [], "uuid": "84977fadf07d4b5fe199bce2b4d03d952bc79768", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-gm-forecasts-strong-earnings-in-2018.html", "country": "US", "domain_rank": 767, "title": "GM Forecasts Strong Earnings in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2018-01-16T16:00:00.000+02:00", "replies_count": 0, "uuid": "84977fadf07d4b5fe199bce2b4d03d952bc79768"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-gm-forecasts-strong-earnings-in-2018.html", "ord_in_thread": 0, "title": "GM Forecasts Strong Earnings in 2018", "locations": [], "entities": {"persons": [{"name": "mary barra", "sentiment": "none"}, {"name": "dan ammann", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "gm", "sentiment": "negative"}, {"name": "general motors co.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "gm financial", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT, Jan. 16, 2018 /PRNewswire/ -- General Motors Co. (NYSE: GM) today said it projects strong earnings in 2018, building on expected record 2017 EPS diluted-adjusted and previous record earnings in 2016 and 2015.\nGM forecasts its 2018 results to be largely in line with expected 2017 results, benefiting from continued strength in North America and China, improvement in South America, additional growth in its adjacent businesses including GM Financial, and continued cost efficiencies.\n\"GM had a very good 2017 as we continued to transform our company to be more focused, resilient and profitable,\" GM Chairman and CEO Mary Barra said. \"We are positioned for another strong year in 2018 and an even better one in 2019.\"\nIn 2018, GM will continue its product momentum with the introduction of its next-generation full-size trucks later in the year.\n\"Reshaping the company over the last few years has allowed us to deploy resources and capital to higher-return opportunities including our next-generation trucks and establishing leadership in the future of mobility,\" GM President Dan Ammann said. \"The all-new full-size truck family that launches this year will generate very strong returns for years to come.\"\nThe 2019 Chevrolet Silverado full-size pickup truck will feature eight distinct models with a variety of trim levels and six engine and transmission combinations to meet the needs of every truck customer. It will be larger, yet lighter due to the extensive use of mixed materials and advanced and flexible manufacturing processes. The next-generation Silverado will also offer the most capable beds of any full-size truck in the industry to go along with larger, more functional and connected interiors.\nThe all-new GMC Sierra will be revealed soon with more differentiation than ever before to appeal to premium truck buyers. These important vehicles will round out the widest-ranging truck portfolio in the industry, continuing the industry's only three-truck strategy.\nAccording to GM Executive Vice President and CFO Chuck Stevens, the company's ongoing focus on its most compelling business opportunities continues to deliver results.\n\"Our core business is anchored by very strong profit franchises. With inventories right-sized and strong product momentum, we expect to generate another strong performance in 2018,\" Stevens said.\nAmong key accomplishments for 2017, the company:\nReshaped its business portfolio:\nCompleted the sales of its Opel/Vauxhall and GM Financial European businesses to PSA. Exited franchises in South and East Africa and discontinued retail sales operations in India to focus on export manufacturing.\nCapitalized on strong product momentum:\nFor the fourth consecutive year, GM sold more pickup trucks in the U.S. than any other automaker – a record 948,909 units. Completed the refresh of GM's crossover portfolio and became the fastest-growing crossover company in the U.S., with retail market share up 1.6 percentage points to 13.1 percent, according to J.D. Power PIN estimates.\nDemonstrated clear leadership in the future of mobility:\nDebuted Super Cruise, the world's first hands-free highway driving technology, on the Cadillac CT6. Shared its vision for zero crashes, zero emissions and zero congestion and outlined an all-electric future with plans to launch at least 20 electric vehicle models by 2023. Introduced the third of three generations of autonomous test vehicles that were developed within a span of 14 months. Announced plans to deploy self-driving vehicles in a ride-sharing environment in early 2019. Acquired Strobe, Inc. to help develop next-generation LIDAR solutions for self-driving vehicles and reduce LIDAR costs by 99 percent over time. Became the first company to use mass-production methods to build autonomous electric test vehicles.\nGeneral Motors Co. (NYSE:GM) has leadership positions in the world's largest and fastest-growing automotive markets. GM, its subsidiaries and joint venture entities sell vehicles under the Chevrolet, Cadillac, Baojun, Buick, GMC, Holden, Jiefang, and Wuling brands. More information on the company and its subsidiaries, including OnStar, a global leader in vehicle safety, security and information services, can be found at http://www.gm.com\nCautionary Note on Forward-Looking Statements: This press release and related comments by management may include forward-looking statements. These statements are based on current expectations about possible future events and thus are inherently uncertain. Our actual results may differ materially from forward-looking statements due to a variety of factors, including: (1) our ability to deliver new products, services and experiences that attract new, and are desired by existing, customers and to effectively compete in autonomous, ride-sharing and transportation as a service; (2) sales of full-size pick-up trucks and SUVs, which may be affected by increases in the price of oil; (3) the volatility of global sales and operations; (4) aggressive competition, including the impact of new market entrants; (5) changes in, or the introduction of novel interpretations of, laws, regulations or policies particularly those relating to free trade agreements, tax rates and vehicle safety and any government actions that may affect the production, licensing, distribution, pricing, or selling of our products; (6) our joint ventures, which we cannot operate solely for our benefit and over which we may have limited control; (7) compliance with laws and regulations applicable to our industry, including those regarding fuel economy and emissions; (8) costs and risks associated with litigation and government investigations; (9) compliance with the terms of the Deferred Prosecution Agreement; (10) our ability to maintain quality control over our vehicles and avoid recalls and the cost and effect on our reputation and products; (11) the ability of suppliers to deliver parts, systems and components without disruption and on schedule; (12) our dependence on our manufacturing facilities; (13) our ability to realize production efficiencies and cost reductions; (14) our ability to successfully and cost-efficiently restructure operations in various countries with minimal disruption;\n(15) our ability to manage risks related to security breaches and other disruptions to vehicles, information technology networks and systems; (16) our ability to develop captive financing capability through GM Financial; (17) significant increases in pension expense or projected pension contributions; and (18) significant changes in the economic, political, and regulatory environment, market conditions, and foreign currency exchange rates. A further list and description of these risks, uncertainties and other factors can be found in our Annual Report on Form 10-K for the fiscal year ended December 31, 2016, and our subsequent filings with the Securities and Exchange Commission. GM cautions readers not to place undue reliance on forward-looking statements. GM undertakes no obligation to update publicly or otherwise revise any forward-looking statements.\nNote on Non-GAAP Financial Measure. EPS-diluted-adjusted", "external_links": ["http://www.gm.com/", "http://www.prnewswire.com/news-releases/gm-forecasts-strong-earnings-in-2018-300583060.html", "http://www.gm.com/investors"], "published": "2018-01-16T16:00:00.000+02:00", "crawled": "2018-01-16T16:29:45.002+02:00", "highlightTitle": ""}