{"organizations": [], "uuid": "fab3ea766364c67a8d116f1de5e6b2d0a441a524", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/18/104716840-GettyImages-849101490-military-afghanistan.1910x1000.jpg", "site_section": "http://feeds.feedburner.com/dcradar", "section_title": "Defined Contribution Radar", "url": "https://www.cnbc.com/2018/01/05/us-service-members-face-big-changes-to-retirement-plan.html", "country": "US", "domain_rank": 767, "title": "Military personnel face a critical choice for their retirement plan - CNBC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T20:01:00.000+02:00", "replies_count": 0, "uuid": "fab3ea766364c67a8d116f1de5e6b2d0a441a524"}, "author": "Your (optional) podcast author email address (Your (optional) podcast author name)", "url": "https://www.cnbc.com/2018/01/05/us-service-members-face-big-changes-to-retirement-plan.html", "ord_in_thread": 0, "title": "Military personnel face a critical choice for their retirement plan - CNBC", "locations": [], "entities": {"persons": [{"name": "jeri busch", "sentiment": "none"}, {"name": "busch", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "navy", "sentiment": "none"}, {"name": "pentagon", "sentiment": "none"}, {"name": "u.s. department of defense", "sentiment": "none"}, {"name": "u.s. navy", "sentiment": "none"}, {"name": "u.s. army", "sentiment": "none"}, {"name": "air force", "sentiment": "none"}, {"name": "coast guard", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "show chapters Big decision: Military members face critical choice on retirement 6:55 PM ET Thu, 4 Jan 2018 | 03:13 The U.S. military is a launching a new mission this year, one that aims to ensure more of those who serve are also saving for their financial future.\nPentagon officials are calling the move the biggest update to the military's pension and benefits since World War II. The dramatic changes to its retirement system will impact millions of current and future service members.\nMilitary service has long brought with it a highly valued pension for members of the armed forces, who have made their careers in the U.S. Army, Air Force, Marines, Navy and Coast Guard.\nUntil this year, all military members could potentially receive a guaranteed pension of at least 50 percent of their base pay for life. But to earn it, they must serve for at least 20 years. Most never stay that long.\n\"Today people move from job to job and they need a retirement benefit that they can take with them,\" said Jeri Busch, director of military compensation policy for the U.S. Department of Defense.\nModernizing the system Busch, who served for 22 years in the U.S. Navy, said the new retirement program will help jump start many members' long-term savings. She said it is also \"a key step in recruiting and maintaining the talent we need to ensure military readiness.\"\nThe new retirement program — called the \"Blended Retirement System\" or \"BRS\" — combines a traditional pension with a defined contribution plan, similar to a private sector 401(k) plan . As of Jan. 1, service members entering the military will automatically be enrolled in the new BRS program.\nThose who have served 12 years or more as of Dec. 31, 2017 will remain in the old legacy retirement plan, earning that guaranteed pension.\nFacing a big decision Meanwhile, about 1.6 million current active duty, Reserve and National Guard members have a big decision to make. By the end of this year, those who have served in the military less than 12 years must choose whether to opt into the BRS program, or remain in the legacy plan.\n\"I know the value of a dollar and see it is important to save up for the future.\" -Zachary Beckman, Marine Corps reservist Those who opt in will select how much money they'll contribute to the defined contribution plan, the f ederal government's Thrift Savings Plan (TSP ), which has been offered to civilian government employees for decades.\nDepending on how much they contribute to the TSP, they can begin receiving matching contributions of up to 5 percent of their pay right away. They'll also still be eligible for a pension under the new system, as long as they reach 20 years of service .\nHowever, under the new system, the amount of the payout will be reduced by 20 percent. Pentagon officials say members are encouraged to make up the difference by making contributions to the TSP.\nFor members who join the military on or after Jan. 1, they will get an automatic 1 percent government contribution that will begin 60 days after enrollment. Government matching contributions to the TSP won't begin until after two years of service. That delay of TSP matching contributions doesn't impact those who joined the military before Jan. 1, 2018 and opt in.\nShifting responsibility While \"opting in\" requires making a choice that will put more of the responsibility for long-term savings on the members' shoulders, \"it starts to cause them to learn how to contribute to their future, their own retirement,\" said John Bird, senior vice president of military affairs at USAA, a financial services firm that works with about 12 million current and former members of the U.S. military and their families.\nFor some, it may be a tough decision.\n\"If you know for a fact you are going to serve for 20 years then you should stay with the legacy system,\" said Bird, a retired vice admiral with the U.S. Navy. However, more than 80 percent of military members leave the service before reaching that milestone.\nGetty Images U.S. service members walk off a helicopter on the runway at Camp Bost on September 11, 2017 in Helmand Province, Afghanistan. Contributing regularly to a long-term savings account that they can take with them if they go to a new job is a valuable perk, even if their paycheck is a little less.\n\"My strong belief is if they get education and start right away contributing, they won't miss the money,\" Bird said.\nFinancial education is key The military is requiring mandatory financial education training on bases and online. More than 80 percent of those who must make a decision have taken the class, according to Pentagon officials.\nYet some financial advisors worry one course may not be enough. A recent USAA survey of enlisted members found 41 percent admit to living paycheck-to-paycheck. That number was slightly higher for millennials.\nFinancial education \"has to start in the boot camps,\" said Rene Bruer, a former Marine, who is now a financial advisor and co-CEO of Smith Bruer Advisors in Tallahassee, Florida.\n\"This has to be fully integrated into training,\" Bruer said. \"Just as much as they teach you how to shoot a gun, they need to teach you how to manage your paycheck.\"\nCpl. Zachary Beckman, a 23-year-old government contractor who is also in the Marine Corps Reserves, has taken the required financial education training. He says opting into the new program is the right move for his financial future.\n\"Given my civilian job and having my Marine Corps experience, I know the value of a dollar and see it is important to save up for the future,\" Beckman said. \"It's what is needed nowadays...It gives younger people who might not stay in the military the opportunity to get a retirement plan.\"\nMore from Retire Well:\nWhen working into retirement can cost you\nHow to start thinking about an estate plan\nDon't let surprise medical bills drain your retirement", "external_links": [], "published": "2018-01-07T20:01:00.000+02:00", "crawled": "2018-01-07T20:54:17.001+02:00", "highlightTitle": ""}