{"organizations": [], "uuid": "474588e73b2fc6c0ef3caa0e2079166462e68fa4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225206462&w=1200&r=LYNXMPEE0O1BW", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-eu-brexitcampaign-rees-mogg/rees-mogg-urges-may-to-change-tone-idUKKBN1FE2FW", "country": "US", "domain_rank": 408, "title": "Rees-Mogg urges May to change tone", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:40:00.000+02:00", "replies_count": 0, "uuid": "474588e73b2fc6c0ef3caa0e2079166462e68fa4"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-brexitcampaign-rees-mogg/rees-mogg-urges-may-to-change-tone-idUKKBN1FE2FW", "ord_in_thread": 0, "title": "Rees-Mogg urges May to change tone", "locations": [], "entities": {"persons": [{"name": "rees-mogg", "sentiment": "negative"}, {"name": "may", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jacob rees-mogg", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european research group", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 4:41 PM / Updated 4 hours ago Rees-Mogg urges May to change tone Reuters Staff 3 Min Read \nLONDON (Reuters) - Britain’s government must start promoting the opportunities from leaving the European Union and its negotiators should stop being “cowed by the EU,” the leader of an influential parliamentary group in Prime Minister Theresa May’s Conservative Party said. \nThe European Research Group, led by hardline Brexit campaigner Jacob Rees-Mogg after both his predecessors were brought into the government’s Brexit department, has influence over several dozen Conservative lawmakers and ministers. \nThe direct appeal to May and her government breaks with tradition, and follows criticism by Rees-Mogg on Wednesday that Brexit minister David Davis was helping make Britain a “vassal state” of the EU by agreeing to a status quo transition. \n“If (Brexit’s opportunities are) taken off the table then Brexit becomes only a damage limitation exercise. The British people did not vote for that ... They voted for hope and opportunity and politicians must now deliver it,” Rees-Mogg said in a speech he will deliver at an English independent school. \n“There is a great Brexit opportunity and some really obvious benefits that we can get that improve the condition of the people. This is currently at risk.” \nA spokesman for May told reporters the prime minister had set out a “positive vision for the UK post-Brexit” and was confident of securing that. \nRees-Mogg is one of many in the Brexit campaign voicing concern that the referendum result may be betrayed. Some supporters have started to get ready for a fightback against what they call “ultra-Remainers” who they accuse of trying to stop the divorce. \nAfter the EU agreed its negotiating directives on Wednesday, the Conservative lawmaker listed his red lines for the Brexit talks which will enter a crucial phase later this year when the two sides start negotiating their future relationship. \nHe said Britain could not stay in the EU’s customs union or hold closely to the bloc’s rules and regulations. \nMay has repeatedly said Britain will leave the bloc’s single market and customs union, but Brexit campaigners fear that after negotiating a transition deal that changes little, she may opt for a future relationship along those lines. \nRees-Mogg urged British negotiators to stop being “cowed by the EU”. “Their approach seems to be that we must accept what the EU will allow us to do and build from there. This is no way to negotiate and it is no way for this country to behave.” Reporting by Elizabeth Piper; editing by Stephen Addison", "external_links": [], "published": "2018-01-25T18:40:00.000+02:00", "crawled": "2018-01-25T18:51:24.001+02:00", "highlightTitle": ""}