{"organizations": [], "uuid": "db84176da7f9f235dfc9a6a58703ff8fec60b36c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224644344&w=1200&r=LYNXMPEE0N01A", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-global-markets/asia-shares-surf-global-growth-wave-dollar-sinks-idUKKBN1FD03M", "country": "US", "domain_rank": 408, "title": "Asia shares surf global growth wave, dollar sinks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T02:52:00.000+02:00", "replies_count": 0, "uuid": "db84176da7f9f235dfc9a6a58703ff8fec60b36c"}, "author": "", "url": "https://uk.reuters.com/article/us-global-markets/asia-shares-surf-global-growth-wave-dollar-sinks-idUKKBN1FD03M", "ord_in_thread": 0, "title": "Asia shares surf global growth wave, dollar sinks", "locations": [], "entities": {"persons": [{"name": "chris weston", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "min read  sydney", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 1:00 AM / Updated an hour ago Asia shares surf global growth wave, dollar sinks Wayne Cole 5 Min Read \nSYDNEY (Reuters) - Asian shares scaled record peaks on Wednesday as strong corporate earnings and optimism on global growth outweighed concerns over trade tensions, while a fresh burst of speculative selling took the U.S. dollar to three-year lows. \nA 10 percent surge in Netflix ( NFLX.O ) led gains across the tech sector as it became just the latest to top forecasts. So far, 82 percent of reporting companies having beaten estimates. \nMost Asian stock indices are up anywhere from 5 to 10 percent since the start of the year with many at all-time highs. \n“These markets are absolutely flying and have had seemingly one-way moves since late December,” noted Chris Weston, chief market strategist at broker IG. \n“There has clearly been a wall of capital hitting these markets, as is the case with many Asian currencies,” he added. “One simply can’t rule further upside here, even if there is growing risks of buyers fatigue kicking in.” \nEarly Wednesday, MSCI’s broadest index of Asia-Pacific shares outside Japan .MIAPJ0000PUS had inched up 0.1 percent, having jumped 1.2 percent on Tuesday. \nJapan's Nikkei .N225 edged down 0.4 percent as the yen strengthened, but that was from a 26-year top. \nInvestors seemed to have shaken off worries about a trade war, sparked when U.S. President Donald Trump’s slapped steep import tariffs on washing machines and solar panels in a move condemned by China and South Korea. \nChina's blue-chip CSI300 index .CSI300 had ended Tuesday at its highest since mid-2015 having climbed almost 9 percent for the year so far. \nOn Wall Street, the beat by Netflix helped lift tech shares, though the Dow was hemmed in by declines in Johnson & Johnson and Procter & Gamble. The Nasdaq .IXIC gained 0.71 percent and the S&P 500 .SPX 0.22 percent, while the Dow .DJI edged down a slim 0.01 percent. EUROPE ON A ROLL \nIn currency markets, the dollar remained under fire as investors wagered the Federal Reserve would be far from the only central bank to tighten this year as growth spread more widely. \nThe sea change has been greatest in Europe where a survey of consumers overnight showed confidence jumped to a 17-year high in January. \n“Both investors and consumers in Europe have started 2018 in a cheery mood, as the rotation away from the U.S. as the epicenter of global growth continues,” said ANZ analyst Richard Yetsenga in a note to clients. \nThe upbeat data only reinforced speculation the European Central Bank might take a step toward an eventual tightening at its policy meeting on Thursday. \nThat helped lift to euro to $1.2312 EUR= and back toward the three-year top of $1.2322 touched last week. The dollar was already at a fresh three-year trough against a basket of major currencies at 90.003 .DXY. \nIt also ran into selling against the yen even though the Bank of Japan tried hard on Tuesday to quash talk it might curb its massive asset buying campaign anytime soon. \nThe dollar was last down 0.1 percent at 110.16 JPY= , having hit its lowest since September at 110.06. \nThe British pound GBP= also powered past $1.4000 to its highest since the vote to leave the European Union in June 2016, aided by optimism around Britain's chances of securing a favorable Brexit deal. [GBP/] \nThe dollar’s decline has been a boon to commodities priced in the currency, with gold edging up to $1,341.56 an ounce XAU=. \nOil prices were consolidating after jumping more than 1 percent on Tuesday, with benchmark Brent crude hitting $70 a barrel for the first time in a week. \nBrent futures LCOc1 were yet to trade at $69.96, not far off the three-year high of $70.37 reached on Jan. 15, while U.S. crude CLc1 added another cent to $64.48 a barrel. Editing by Sam Holmes", "external_links": [], "published": "2018-01-24T02:52:00.000+02:00", "crawled": "2018-01-24T03:02:55.015+02:00", "highlightTitle": ""}