{"organizations": [], "uuid": "155a2554d038490203c55eaec21f1e8297211f6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-safrica-platinum/amplats-reaches-deal-with-south-african-tribal-leader-in-community-fund-row-idUSKBN1EY114", "country": "US", "domain_rank": 408, "title": "Amplats reaches deal with South African tribal leader in community fund row", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T12:28:00.000+02:00", "replies_count": 0, "uuid": "155a2554d038490203c55eaec21f1e8297211f6d"}, "author": "", "url": "https://www.reuters.com/article/us-safrica-platinum/amplats-reaches-deal-with-south-african-tribal-leader-in-community-fund-row-idUSKBN1EY114", "ord_in_thread": 0, "title": "Amplats reaches deal with South African tribal leader in community fund row", "locations": [], "entities": {"persons": [{"name": "ed stoddard", "sentiment": "none"}], "locations": [{"name": "johannesburg", "sentiment": "none"}, {"name": "mogalakwena", "sentiment": "none"}, {"name": "kgoshi", "sentiment": "none"}], "organizations": [{"name": "amplats", "sentiment": "negative"}, {"name": "anglo american platinum", "sentiment": "none"}, {"name": "mapela trust", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG (Reuters) - A South African tribal leader has agreed to a more transparent structure for a 175 million rand ($14 million) community trust funded by Anglo American Platinum (Amplats), a move that aims to curb unrest around the firm’s most profitable mine.\nThe changes relate to the Mapela Trust, which was set up to fund development projects in communities around Amplats’ Mogalakwena operation, the world’s largest open-pit platinum mine and the Anglo American unit’s main cash spinner.\nThe structure of the fund has proved a flashpoint, with local communities saying the way cash was spent has not transparent and too much authority was given to the local chief, known as Kgoshi, to determine where money was invested.\nProtests over two years ago temporarily closed the mine and community leaders had threatened more action to demand changes.\nLawyers representing local communities told Reuters a deal between Amplats and the tribal chief had been reached. “There is a significant dilution of the chief’s power across the board,” Johan Lorenzen, one of the lawyers, said.\nAmplats confirmed this. “We have signed the agreement. The issues have been resolved,” spokeswoman Mpumi Sithole said.\nUnder the new structure, four of the Mapela Trust’s nine trustees will be elected directly by local communities instead of just two that were picked by the chief to represent them.\nThe other trustees include an independent chairperson, the Kgoshi, a member of a traditional council, a member elected by village chiefs and a senior Amplats representative.\nAmplats’ Sithole said the community would elect their representatives before any cash was allocated to local projects.\nProtests over the fund that erupted more than two years ago prompted the temporary closure of the Mogalakwena mine, leading to the loss of 8,600 ounces of its annual 200,000-plus ounces of production.\nLocal communities had hired prominent South African human rights lawyer Richard Spoor to spearhead their case.\nOther South African mining companies have also been cutting deals with tribal leaders who have royal titles and feudal-style control over their former homelands, often islands of rural poverty where most blacks were confined under apartheid.\nThe bulk of the platinum reserves in South Africa, the world’s top producer of the precious metal, lie in or near these tribal areas.\nImpala Platinum and Lonmin have also had operations disrupted by community protests linked to deals with tribal chiefs.\nSocial and labor violence, alongside soaring costs and depressed world platinum prices, have made two-thirds of South Africa’s platinum operations unprofitable at current prices, according to the country’s Chamber of Mines.\nEditing by Edmund Blair\n ", "external_links": [], "published": "2018-01-09T12:28:00.000+02:00", "crawled": "2018-01-09T12:40:10.000+02:00", "highlightTitle": ""}