{"organizations": [], "uuid": "f972c74f14cad3703b8635269a07e547acb3b58b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/finland-power/finland-faces-potential-power-crunch-as-imports-hit-record-high-idUSL8N1PJ4QK", "country": "US", "domain_rank": 408, "title": "REFILE-Finland faces potential power crunch as imports hit record high", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.151, "site_type": "news", "published": "2018-01-24T23:54:00.000+02:00", "replies_count": 0, "uuid": "f972c74f14cad3703b8635269a07e547acb3b58b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/finland-power/finland-faces-potential-power-crunch-as-imports-hit-record-high-idUSL8N1PJ4QK", "ord_in_thread": 0, "title": "REFILE-Finland faces potential power crunch as imports hit record high", "locations": [], "entities": {"persons": [{"name": "lefteris karagiannopoulos oslo", "sentiment": "none"}], "locations": [{"name": "finland", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "upm", "sentiment": "none"}, {"name": "finnish energy", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "stora enso", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds dropped word “industry” in paragraph 2)\n* Finland imported 23.9 pct of power use in 2017\n* Finnish electricity consumption continues to rise\n* Finland in dispute with neighbours on power balancing\nBy Lefteris Karagiannopoulos\nOSLO, Jan 24 (Reuters) - Finnish firms risk having to cut their power usage as the country’s growing energy demands outstrip supply, industry lobby group Finnish Energy (ET) told Reuters on Wednesday.\nThe Nordic country, which is dependent on Swedish and Russian power imports, saw its industry’s energy needs grow by 1.7 percent last year, while net power imports hit a record high.\nReliability of power supply is crucial to Finnish industry, which includes large power consumers such as pulp and paper makers UPM and Stora Enso.\nAnd Finland is now home to a growing, power-hungry data centre industry, and hopes to convince more Silicon Valley giants to build facilities in the country.\n“It’s a concern for us... The balance is so tight that practically any major technical issue can cause a lack of power. There is a higher risk that we might need to reduce consumption for some consumers,” ET director Jukka Leskela said.\nFinland’s net power imports rose by 7.4 percent to 20.4 terawatt hours (TWh) from 19 TWh in 2016, the previous record year, corresponding to almost a quarter of consumption and threatening security of supply, ET’s preliminary data showed.\nNet imports corresponded to 23.9 percent of consumption, up from 22.2 percent in 2016, the data showed, with top suppliers Sweden and Russia exporting 15 TWh and 6 TWh respectively.\nET attributed the shortfall to its neighbours’ increasingly competitive prices, closure of some peak load power units, known as condensing plants, and to TVO’s much-delayed Olkiluoto 3 nuclear reactor, which has yet to begin production.\n“There has been a lot of cheap electricity available... Part of the Finnish production has not been competitive enough in the market,” Leskela said.\nET’s data showed that in 2017, Finland’s generation of condensing power plummeted to just below 3 TWh, its lowest level in 10 years, as production capacity fell.\nFinland may see a further decline in its power generation, as around one third of the country’s electricity comes from combined heat and power plants, with several due to reach their end-of-life date in the coming years.\nA dispute with its Nordic neighbours over a new system to balance the region’s electricity supply and demand, is causing additional uncertainty for Finland.\nThe Danish, Norwegian and Swedish grid operators decided to push ahead with plans for a new power balancing system without Finland in December after talks broke down. (Reporting by Lefteris Karagiannopoulos; Editing by Terje Solsvik and Alexander Smith)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T23:54:00.000+02:00", "crawled": "2018-01-25T13:10:07.005+02:00", "highlightTitle": ""}