{"organizations": [], "uuid": "3f48502cc8bccbe3753d2320a12e13a7ad658ea4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-ystrategies-corp-appoints-enterprise-innovation-expert-andrea-kates-as-chief-innovation-officer.html", "country": "US", "domain_rank": 767, "title": "Ystrategies Corp. Appoints Enterprise Innovation Expert Andrea Kates as Chief Innovation Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:00:00.000+02:00", "replies_count": 0, "uuid": "3f48502cc8bccbe3753d2320a12e13a7ad658ea4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-ystrategies-corp-appoints-enterprise-innovation-expert-andrea-kates-as-chief-innovation-officer.html", "ord_in_thread": 0, "title": "Ystrategies Corp. Appoints Enterprise Innovation Expert Andrea Kates as Chief Innovation Officer", "locations": [], "entities": {"persons": [{"name": "ystrategi", "sentiment": "negative"}, {"name": "andrea kates", "sentiment": "negative"}, {"name": "kates", "sentiment": "none"}, {"name": "ystrategies", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "ystrategies corp", "sentiment": "neutral"}, {"name": "es corp.", "sentiment": "none"}, {"name": "abb", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "shell", "sentiment": "none"}, {"name": "gm", "sentiment": "none"}, {"name": "copano energy", "sentiment": "none"}, {"name": "launchpad central", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Will lead rapid commercialization of new clean technology\nSAN FRANCISCO--(BUSINESS WIRE)-- Ystrategies Corp. (“Ystrategies” or the “Company”) (OTC: YSTR), a publicly-traded venture capital firm focused on technology startups with disruptive intellectual property in the software and cleantech sectors, today announced the appointment of Andrea Kates as the Company’s Chief Innovation Officer. In this newly created position, she will lead Ystrategies’ initiatives in innovative portfolio acceleration and development through strategic partnerships.\nA globally recognized thought leader in enterprise innovation and disruption, Ms. Kates is an expert at uncovering untapped opportunities and galvanizing strategic vision for enterprises and startups providing her expertise for companies like Copano Energy, ABB, Shell and GM. Her original research in cross-industry growth was published in her book, Find Your Next. She is an early pioneer in lean innovation, recently serving as CEO of LaunchPad Central, a San Francisco SaaS software company.\n“Andrea Kates has few, if any, peers with the depth of expertise in bridging the gap to commercialization and strategic partnerships for exciting new technologies,” said Jim Kiles, Ystrategies’ CEO. “We are already working together on the acceleration of our efforts to increase power from wind farms with low-cost cloud computing and other opportunities across our portfolio.”\n“I welcome the challenge of transforming promising new technologies into real, powerful growth engines for the cleantech sector,” said Ms. Kates.\nSeparately, Ystrategies announced that Paul Overby will transition into a new role as Vice President of Global Strategy. \"I look forward to continue working with the Ystrategies team on the global opportunities that lie ahead,\" said Mr. Overby, who will remain as a Director to the Company.\nAbout Ystrategies Corp.\nYstrategies is a publicly-traded venture capital firm concentrated on building disruptive businesses focused on critical issues such as renewable energy and clean technology. Ystrategies invests in science and technology emerging from the US National Laboratory System, incubators, businesses and academic institutions. The Company looks for market-ready technology with large addressable markets and intellectual property ready to engage identified customer segment partners in important commercial agreements. Investments are premised on closing strategic partner agreements as pathways to valuable exits. Ystrategies was founded by former Intel Capital Managing Director, Jim Kiles, who is supported by industry veterans Ashish Badjatia, Andrea Kates, Paul Overby, Jon Sigerman, Neil Cohen and Shirley Gee. Ystrategies has offices in Pittsburgh and San Francisco. For more information, visit Ystrategies’ website at: http://www.ystrategies.com .\nForward Looking Statements.\nCertain statements contained herein may be considered “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, and it is our intent that any such statements be protected by the safe harbor created thereby. Except for historical information, the matters set forth herein including, but not limited to, any statements concerning our plans, strategies, investments, and objectives are forward-looking statements. These forward-looking statements are based on our current expectations, estimates and assumptions and are subject to certain risks and uncertainties. Although we believe that the expectations, estimates and assumptions reflected in our forward-looking statements are reasonable, actual results could differ materially from those projected or assumed in any of our forward-looking statements. Important factors that could cause our actual results to differ materially from estimates or projections contained in our forward-looking statements are set forth in the Risk Factors section and elsewhere in the reports we have filed with the Securities and Exchange Commission. We do not intend, and undertake no obligation, to update any forward-looking statement.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005419/en/\nYstrategies Corp.\nNeil Cohen, 415-652-5544\nVice President, Marketing and Business Development\nneil@ystrategies.com\nor\nThe Equity Group\nKalle Ahl, 212-836-9614, CFA\nkahl@equityny.com\nor\nDevin Sullivan, 212-836-9608\ndsullivan@equityny.com\nSource: Ystrategies Corp.", "external_links": ["http://www.businesswire.com/news/home/20180125005419/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ystrategies.com&esheet=51748735&newsitemid=20180125005419&lan=en-US&anchor=http%3A%2F%2Fwww.ystrategies.com&index=1&md5=e6e0b292e8379bdd413085a0b6e30455"], "published": "2018-01-25T17:00:00.000+02:00", "crawled": "2018-01-25T18:29:31.002+02:00", "highlightTitle": ""}