{"organizations": [], "uuid": "bf75a0866dcbbf0506c76460da048f7cc7bffc26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/southkorea-economy-rates-statement/text-bank-of-korea-statement-on-its-policy-decision-idUSS6N1NG00K", "country": "US", "domain_rank": 408, "title": "TEXT-Bank of Korea statement on its policy decision", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T03:57:00.000+02:00", "replies_count": 0, "uuid": "bf75a0866dcbbf0506c76460da048f7cc7bffc26"}, "author": "", "url": "https://www.reuters.com/article/southkorea-economy-rates-statement/text-bank-of-korea-statement-on-its-policy-decision-idUSS6N1NG00K", "ord_in_thread": 0, "title": "TEXT-Bank of Korea statement on its policy decision", "locations": [], "entities": {"persons": [], "locations": [{"name": "korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "board", "sentiment": "none"}, {"name": "monetary policy board of the bank of korea", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bank of korea", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL, Jan 18 (Reuters) - Following is the full text of the statements released by the Bank of Korea in English after the central bank held its key interest rate steady on Thursday, as expected, as it monitors the effects of its November hike.\nFor story, see\nMONETARY POLICY DECISION “The Monetary Policy Board of the Bank of Korea decided today to leave the Base Rate unchanged at 1.50 percent for the intermeeting period.”\n“Based on currently available information the Board considers that the pace of global economic growth has accelerated. The global financial markets have shown generally stable movements, with the trend of rising stock prices continuing for example, although government bond rates have risen in line mainly with expectations of monetary policy normalization in major countries. Looking ahead, the Board sees global economic growth as likely to be affected by factors such as the pace of monetary policy normalization in major countries, the direction of the U.S. government’s economic policies, and the movements toward spreading trade protectionism. ”The Board judges that the solid trend of domestic economic growth has continued, as exports have sustained their buoyancy and consumption has improved moderately, although investment has slowed somewhat. The trend of improvement in employment conditions has slowed, with the increase in the number of persons employed in the service sector having declined for example. The Board sees the domestic economy as likely to show a pace of GDP growth at the 3 percent level this year as well. It expects that investment will slow, but that the trend of steady increase in consumption will continue due in large part to improvements in household income conditions, and that exports will also sustain their favorable movements thanks to the buoyancy of the global economy.\n“Consumer price inflation has slowed to the mid-1 percent level, a consequence mainly of declines in the extents of increase in the prices of agricultural, livestock and fisheries products and of a reduction in gas fees. Core inflation (with food and energy product prices excluded from the CPI) has stayed in the mid-1 percent range, and the rate of inflation expected by the general public has remained at the mid-2 percent level. Looking ahead it is forecast that consumer price inflation, after being in the low- to mid-1 percent range for some time, will pick up and gradually approach the target level from the second half of this year, and for the year as a whole be in the upper-1 percent range. Core inflation will also gradually rise.”\n“Although long-term market interest rates have shown a trend of rising, affected by increases in interest rates in major countries, the domestic financial markets have displayed generally stable movements, with stock prices having risen for example, on expectations of improvements in corporate performances. The Korean won-U.S. dollar exchange rate has continued its downtrend, in line chiefly with the weakening of the U.S. dollar. The amount of increase in household lending has lessened. Housing sales prices have shown low rates of increase overall, but have risen faster in some parts of Seoul and its surrounding areas.”\n“Looking ahead, the Board will conduct monetary policy so as to ensure that the recovery of economic growth continues and consumer price inflation can be stabilized at the target level over a medium-term horizon, while paying attention to financial stability. As it is forecast that inflationary pressures on the demand side will not be high for the time being, while the domestic economy is expected to continue its solid growth, the Board will maintain its accommodative monetary policy stance. In this process it will judge carefully whether it is necessary to adjust its accommodative monetary policy stance further, while closely checking future economic growth and inflation trends. It will also carefully monitor any changes in the monetary policies of major countries, conditions related to trade with major countries, the trend of increase in household debt, and geopolitical risks.” (Reporting by Cynthia Kim and Christine Kim; Editing by Sam Holmes)\n ", "external_links": [], "published": "2018-01-18T03:57:00.000+02:00", "crawled": "2018-01-18T05:02:17.004+02:00", "highlightTitle": ""}