{"organizations": [], "uuid": "5c70b22727aa544629a04c711d78d86e522a7f96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221746714&w=1200&r=LYNXMPEE0C0J9", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-hdd-whu-arnautovic/moyes-says-arnautovic-responding-to-his-demands-idUKKBN1F20TE", "country": "US", "domain_rank": 408, "title": "Moyes says Arnautovic responding to his demands", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T20:36:00.000+02:00", "replies_count": 0, "uuid": "5c70b22727aa544629a04c711d78d86e522a7f96"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-hdd-whu-arnautovic/moyes-says-arnautovic-responding-to-his-demands-idUKKBN1F20TE", "ord_in_thread": 0, "title": "Moyes says Arnautovic responding to his demands", "locations": [], "entities": {"persons": [{"name": "moyes", "sentiment": "negative"}, {"name": "arnautovic", "sentiment": "negative"}, {"name": "marko arnautovic", "sentiment": "none"}, {"name": "john smith", "sentiment": "none"}, {"name": "slaven bilic", "sentiment": "none"}, {"name": "marko", "sentiment": "none"}, {"name": "simon evans", "sentiment": "none"}, {"name": "david moyes", "sentiment": "none"}, {"name": "mathias jorgensen", "sentiment": "none"}], "locations": [{"name": "huddersfield", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "huddersfield town", "sentiment": "none"}], "organizations": [{"name": "huddersfield", "sentiment": "none"}, {"name": "huddersfield town vs west ham united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "west ham united", "sentiment": "none"}, {"name": "reuters/jason cairnduff", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "huddersfield town", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 6:37 PM / Updated 42 minutes ago Moyes says Arnautovic responding to his demands Simon Evans 3 Min Read \nHUDDERSFIELD, England (Reuters) - No player symbolises West Ham United’s transformation under David Moyes more than Marko Arnautovic with the Austrian international inspiring a scintillating 4-1 win at Huddersfield Town on Saturday. Soccer Football - Premier League - Huddersfield Town vs West Ham United - John Smith’s Stadium, Huddersfield, Britain - January 13, 2018 West Ham United's Marko Arnautovic in action with Huddersfield Town’s Mathias Jorgensen Action Images via Reuters/Jason Cairnduff \nHis manager said the former Stoke forward had responded to a very simple demand: “I think Marko knows if you want to run, you will play, if you don’t you won’t,” said the Scot. \n“Every week he is producing almost the highest sprinting stats in the Premier League. He is embracing it as well. He likes a boast,” he said. \nCertainly, there was plenty to brag about on Saturday. \nThe Hammers, who were in the relegation zone when Slaven Bilic was sacked as manager in November, are up to 11th in the Premier League and judging by their performance at the John Smith’s Stadium they should be able to put aside any concerns about the drop. \nArnautovic showed his fine control allied with his strength to score just seconds in to the second half and then set up two quick goals for strike partner Manuel Lanzini as the visitors ran away with the game after the break. \nSigned from Stoke City in July for a club record fee, reported to be around 25 million pounds ($34 million), Arnautovic struggled to make an impact in his early games and highlighted Bilic’s inability to get the best out of his squad. Soccer Football - Premier League - Huddersfield Town vs West Ham United - John Smith’s Stadium, Huddersfield, Britain - January 13, 2018 West Ham United's Marko Arnautovic celebrates scoring their second goal with Cheikhou Kouyate REUTERS/Andrew Yates \nBut under former Everton and Manchester United manager Moyes, the 28-year-old Arnautovic has rediscovered his best form. \nIn December, he scored five goals and added an assist as the team turned the corner and while he missed the opening two games in January, his form has clearly remained. \n“I‘m really pleased with Marko. Everybody told me he hadn’t performed before I came, but everybody knew how good he was at Stoke City, and that’s why we paid a big fee for him,” said Moyes. \n“Giving him a freer role up front has given him a chance to show other sides to his game as well, with the effort and the way he has worked.” \nArnautovic has gained a reputation as being a temperamental player who hasn’t always been focused closely on his task but Moyes seems to have found the key to bringing out his best. \n“He needs managing. There are times he needs a strong hand but his attitude has been excellent,” said Moyes who was also delighted with the two goals from Manuel Lanzini, who he paired with alongside Arnautovic in a front-two. \n“The two centre forwards were a threat all day. Every time it went to them, it looked like they were causing problems. It was a real, terrific team effort. Everyone worked hard and did their jobs and I have to praise them all,” said Moyes. Reporting by Simon Evans, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-13T20:36:00.000+02:00", "crawled": "2018-01-13T21:10:55.014+02:00", "highlightTitle": ""}