{"organizations": [], "uuid": "8ae3da9869a6e9a78848a21380e91dac5983fa5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/china-economy-output-oil/update-1-china-gas-output-at-4-year-high-in-push-to-plug-winter-supply-gap-idUSL3N1PD2WG", "country": "US", "domain_rank": 408, "title": "UPDATE 2-China gas output at 4-year high in push to plug winter supply gap", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:23:00.000+02:00", "replies_count": 0, "uuid": "8ae3da9869a6e9a78848a21380e91dac5983fa5d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-economy-output-oil/update-1-china-gas-output-at-4-year-high-in-push-to-plug-winter-supply-gap-idUSL3N1PD2WG", "ord_in_thread": 0, "title": "UPDATE 2-China gas output at 4-year high in push to plug winter supply gap", "locations": [], "entities": {"persons": [{"name": "chen aizhu", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "national statistics bureau", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nsb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dec gas output highest since at least Jan 2014\n* 2017 gas output up 8.5 pct over 2016\n* Refinery throughput up 540,000 bpd vs 2016 -calculations\n* Throughput growth fastest in 4 years -analyst\n* 2017 crude output down 4 pct at 3.83 mln bpd (Adds industry source/analyst comment; crude output)\nBy Chen Aizhu\nBEIJING, Jan 18 (Reuters) - China’s natural gas output rose in December to the highest monthly rate since at least 2014 as state energy firms rushed to fill a supply gap sparked by surging winter demand from a drive to switch millions of households to gas from coal for heating.\nCompanies produced 13.6 billion cubic metres (bcm) of gas in December, up from 12.6 bcm in November, pushing up output for the whole of 2017 by 8.5 percent to 147.4 bcm, data from the National Statistics Bureau (NSB) showed on Thursday.\nBeijing last year ordered millions of households and industrial plants in 28 northern Chinese cities to change to gas heating from coal as part of its war against pollution.\nBut the jump in demand and inadequate storage and pipeline networks led to a severe supply crunch.\nState energy majors maximized December production at key gas fields such as Changqing in the country’s west and Fuling in southwestern Sichuan, while scaling back internal gas use and curbing fuel supply to industrial users.\nSinopec said this month its 2017 gas output had risen 19 percent over 2016, and that it had recently started up 13 new gas wells.\nDomestic wholesale prices for liquefied natural gas (LNG), which are not regulated by the government, hit an all-time high in December near 10,000 yuan ($1,554) a tonne in northern China.\nPrices have since dropped more than 40 percent thanks to stronger domestic production, as well as record imports of both pipeline gas and LNG.\n“With supplies catching up and industries set to slow down activities as the Lunar New Year break nears, the market shall be more balanced,” said a senior official with PetroChina.\nCRUDE RUNS INCREASE BIGGEST IN 4 YEARS The NSB also said China’s oil refinery throughput rose 3.3 percent in December from a year earlier to 49.11 million tonnes, or 11.56 million bpd, off a record of 12.03 million bpd in November.\nRefinery output for the full year gained 5 percent to 567.77 million tonnes, or 11.36 million bpd. That would mean an average increases in runs this year of around 540,000 bpd, according to Reuters calculations based on the data.\nHarry Liu, an analyst with consultancy IHS Markit said the annual growth figure marked the biggest gain in four years, and pointed to an acceleration in throughput in the last four months of the year.\n“Runs expanded much faster since September compared to earlier in the year to an extent that could barely be supported by market fundamentals,” said Liu.\nNSB said crude oil output fell 4.4 percent in December to 15.98 million tonnes, or 3.76 million bpd, and output for the full year was down 4 percent at 191.51 million tonnes, or 3.83 million bpd.\nState energy group CNPC on Tuesday forecast China’s crude oil output would rise 0.2 percent in 2018, on the prospect of higher global oil prices, which have clawed their way back to near $70 a barrel.\n(tonne=7.3 barrels for crude oil)\n$1 = 6.4355 Chinese yuan Reporting by Chen Aizhu; Editing by Richard Pullin and Tom Hogue\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T15:23:00.000+02:00", "crawled": "2018-01-19T12:21:38.000+02:00", "highlightTitle": ""}