{"organizations": [], "uuid": "301a21a9e09feedf7964bd88cf3ffd841e3e8500", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-scientific-games-completes-acquisition-of-nyx-gaming-group.html", "country": "US", "domain_rank": 767, "title": "Scientific Games Completes Acquisition of NYX Gaming Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:26:00.000+02:00", "replies_count": 0, "uuid": "301a21a9e09feedf7964bd88cf3ffd841e3e8500"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-scientific-games-completes-acquisition-of-nyx-gaming-group.html", "ord_in_thread": 0, "title": "Scientific Games Completes Acquisition of NYX Gaming Group", "locations": [], "entities": {"persons": [{"name": "kevin sheehan", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "nyx gaming group combination creates leading b2b provider of digital gaming", "sentiment": "negative"}, {"name": "nyx gaming group limited", "sentiment": "none"}, {"name": "scientific games corporation", "sentiment": "none"}, {"name": "nyx", "sentiment": "none"}, {"name": "tsx venture exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Combination Creates Leading B2B Provider of Digital Gaming and Sports Betting Technology, Platforms, Products and Content\nLAS VEGAS, Jan. 5, 2018 /PRNewswire/ -- Scientific Games Corporation (NASDAQ: SGMS) (\"Scientific Games\" or the \"Company\") announced today that it has completed the previously announced acquisition of NYX Gaming Group Limited (TSXV: NYX) (\"NYX\").\nIn connection with the completion of the acquisition, the NYX ordinary shares are expected to be delisted from the TSX Venture Exchange on or before the close of business on January 10, 2018.\n\"Today, Scientific Games moves forward as a leading digital provider of sports betting, iGaming and iLottery technologies, platforms, content, products and services,\" said Kevin Sheehan, Scientific Games Chief Executive Officer and President. \"As we look to 2018, we are truly excited by the opportunities that this acquisition presents to us.\"\nTogether, Scientific Games, a world leader offering customers a fully integrated portfolio of technology platforms, robust systems, engaging content and services, and NYX, one of the fastest growing B2B real-money digital gaming and sports betting platforms in the world, form an industry-leading force across iGaming, iLottery and Sports. Scientific Games will now be perfectly positioned to capitalize on future regulatory developments in real-money wagering and sports betting by adding NYX's industry-leading OpenBet Sportsbook. NYX's digital Sportsbook can be seamlessly delivered throughout Scientific Games' global gaming and lottery networks in existing and future regulated U.S. and global markets.\nIn addition, NYX's worldwide channels, markets and customer base offer new growth opportunities to build on the significant momentum of Scientific Games' existing interactive gaming business. The transaction will be accretive to earnings and cash flow this year.\nCompany Contacts\nInvestor Relations:\nScientific Games: Michael Quartieri +1 702-532-7658\nExecutive Vice President and Chief Financial Officer\nMedia Relations:\nScientific Games: Susan Cartwright +1 702-532-7981\nVice President, Corporate Communications\nsusan.cartwright@scientificgames.com\nAbout Scientific Games\nScientific Games Corporation (NASDAQ: SGMS) is a global leader in technology-based gaming systems, table games, table products and instant games and a leader in products, services and content for gaming, lottery and interactive gaming markets. Scientific Games delivers what customers and players value most: trusted security, creative content, operating efficiencies and innovative technology. Today, Scientific Games offers customers a fully integrated portfolio of technology platforms, robust systems, engaging content and unrivaled professional services. For more information, please visit www.scientificgames.com .\n© 2017 Scientific Games Corporation. All Rights Reserved.\nForward-Looking Statements\nThis press release includes \"forward-looking statements\" and \"forward-looking information\" (collectively \"forward-looking statements\") within the meaning of the U.S. Private Securities Litigation Reform Act of 1995 and Canadian securities laws. Forward-looking statements describe future expectations, plans, results or strategies and can often be identified by the use of terminology such as \"may,\" \"will,\" \"estimate,\" \"intend,\" \"plan,\" \"continue,\" \"believe,\" \"expect,\" \"anticipate,\" \"estimate,\" \"should,\" \"could,\" \"potential,\" \"opportunity,\" or similar terminology. These statements are based upon management's current expectations, beliefs, assumptions and estimates and are not guarantees of timing, future results or performance. Similarly, statements herein that describe the transaction, including its financial impact, the expected delisting of the NYX Ordinary Shares from the TSX Venture Exchange and other statements of management's expectations, beliefs, assumptions, estimates and goals regarding the transaction are forward-looking statements. It is uncertain whether any of the events or results anticipated by the forward-looking statements will transpire or occur, or if any of them do, what impact they will have on the results of operations and financial condition of the combined company or the price of Scientific Games' stock. These forward-looking statements involve certain risks and uncertainties and other factors that could cause actual results to differ materially from those indicated in such forward-looking statements, including but not limited to: potential litigation related to the transaction; disruption of NYX's or Scientific Games' current plans and operations as a result of the transaction; the ability of NYX or Scientific Games to retain and hire key personnel; competitive responses to the transaction; unexpected costs, charges or expenses resulting from the transaction; the ability of Scientific Games to successfully integrate NYX's operations, product lines and technology; the diversion of management's attention from Scientific Games' and NYX's ongoing business operations; the ability of Scientific Games to implement its plans, forecasts and other expectations with respect to NYX's business and realize additional opportunities for growth and innovation; the ability of Scientific Games to realize the anticipated synergies from the transaction in the anticipated amounts or within the anticipated timeframes or costs expectations or at all; the ability to maintain relationships with Scientific Games' and NYX's respective employees, customers, other business partners and governmental authorities; and the other risks, uncertainties and important factors contained and identified (including under the heading \"Risk Factors\") in Scientific Games' filings with the SEC, such as its Quarterly Reports on Form 10-Q, Annual Reports on Form 10-K and Current Reports on Form 8-K, and NYX's filings with Canadian securities regulators, any of which could cause actual results to differ materially from the forward-looking statements. The forward-looking statements included in this press release are made only as of the date hereof and Scientific Games does not undertake any obligation to update any forward-looking statements whether as a result of new information, future events or otherwise, except as may be required by applicable law. To the maximum extent permitted by law, none of Scientific Games, its directors, employees or agents accepts any liability for any loss arising from the use of NYX information contained in this press release. Readers are cautioned not to place undue reliance on any of these forward-looking statements.\nView original content with multimedia: http://www.prnewswire.com/news-releases/scientific-games-completes-acquisition-of-nyx-gaming-group-300578178.html\nSOURCE Scientific Games Corporation", "external_links": ["http://www.prnewswire.com/news-releases/scientific-games-completes-acquisition-of-nyx-gaming-group-300578178.html", "http://www.scientificgames.com/"], "published": "2018-01-05T16:26:00.000+02:00", "crawled": "2018-01-05T18:04:22.003+02:00", "highlightTitle": ""}