{"organizations": [], "uuid": "0c191a923ed6d446a9eee20414088b35c233c143", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226289359&w=1200&r=LYNXMPEE0S0VE", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-germany-banks-executive-pay/germany-flags-image-impact-of-loss-making-deutsche-bank-bonuses-idUKKBN1FI1FN", "country": "US", "domain_rank": 408, "title": "Berlin cautions Deutsche Bank over big bonus payout", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:10:00.000+02:00", "replies_count": 0, "uuid": "0c191a923ed6d446a9eee20414088b35c233c143"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-banks-executive-pay/germany-flags-image-impact-of-loss-making-deutsche-bank-bonuses-idUKKBN1FI1FN", "ord_in_thread": 0, "title": "Berlin cautions Deutsche Bank over big bonus payout", "locations": [], "entities": {"persons": [{"name": "tom sims", "sentiment": "none"}, {"name": "joerg eigendorf", "sentiment": "none"}, {"name": "steffen seibert", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "deutsche bank", "sentiment": "negative"}, {"name": "frankfurter allgemeine sonntagszeitung", "sentiment": "none"}, {"name": "deutsche", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 12:30 PM / Updated 13 minutes ago Berlin cautions Deutsche Bank over big bonus payout Tom Sims 4 Min Read \nFRANKFURT/BERLIN (Reuters) - Berlin took aim at Deutsche Bank ( DBKGn.DE ) on Monday over a report it plans to pay out more than 1 billion euros ($1.24 billion) in bonuses, telling the loss-making German lender to consider the impact on its image. \nWhile Deutsche is a private sector bank, “the company management must of course ask what impression it leaves in public,” government spokesman Steffen Seibert told reporters. \nBerlin’s rare warning underscores the bind Germany’s biggest bank is in. While it wants to pay annual bonuses to stave off staff defections and remain competitive globally, it also wants to make good on its commitment to Germans, who are wary after Deutsche Bank’s chequered history on Wall Street. \nGerman weekly Frankfurter Allgemeine Sonntagszeitung, citing unidentified sources, reported at the weekend that Deutsche would raise annual bonus payments to more than 1 billion euros. \nDeutsche’s head of communications Joerg Eigendorf, responding to the bonus criticism, told CNBC on Monday in response to the report that the bank had been doing well until it became clear that a U.S. tax reform would hit its earnings. \n“We decided we shouldn’t punish our employees for the fact that there is a tax reform in the United States, which is an accounting affect,” Eigendorf said. \nWhile bigger bonuses would be a relief for Deutsche bankers, it would likely be politically unpopular in Germany. \nTotal bonus payments dropped from 2.4 billion euros in 2015 to around 500 million euros in 2016 as the bank sharply curtailed them following speculation that it would need a state bailout to stay afloat. \n“Bank branches are closing everywhere, customers are losing their advisers, and advisers are losing their jobs,” Martin Schulz, chairman of the left-of-centre SPD party and last year’s candidate for chancellor, said in Monday’s Bild newspaper. \n“When 1 billion euros in bonuses are being paid out in such a situation, then this doesn’t just hurt a company’s reputation,” he said. “This harms our community of solidarity, which thrives on credibility and justice.” \nLast October, a source told Reuters that Deutsche would pay higher bonuses in 2017 but that the exact level would depend on how its investment bank fared and what rivals paid. \nIngo Speich, a fund manager Union Investment, one of Deutsche Bank’s larger shareholders, said the decision to pay bonuses was basically right. \n“But it needs to be ensured that bonuses aren’t just evenly distributed across the board. Instead, they must reward real performers. This must also be made transparent to shareholders.” \nDeutsche Bank is expected to post its third consecutive annual loss for 2017 on Friday after a profit warning this month prompted some investors to question whether CEO John Cryan should be given more time to turn around the bank, after less than three years as chief executive. \nAlthough Cryan has stabilised Deutsche after a $7.2 billion settlement with the United States over the sale and pooling of toxic mortgage securities in the run-up to the financial crisis, the bank continues to be plagued by scandal. \nU.S. authorities were set to arrest several people on Monday in connection with a federal investigation into so-called spoofing and manipulation in the U.S. futures market by three European banks including Deutsche Bank, three people with direct knowledge of the matter told Reuters. Reporting by Tom Sims and Paul Carrell; Additional reporting by Andreas Framke and Sabine Siebold; Editing by Alexander Smith", "external_links": [], "published": "2018-01-29T18:10:00.000+02:00", "crawled": "2018-01-29T18:41:48.013+02:00", "highlightTitle": ""}