{"organizations": [], "uuid": "b37d4a81b4ef6ccd564bf7cf41d33295b6dc6178", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-mertens/tennis-belgiums-mertens-keeps-calm-collected-in-australian-open-bid-idUKL4N1PJ2XA", "country": "US", "domain_rank": 408, "title": "Tennis-Belgium's Mertens keeps calm, collected in Australian Open bid", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T12:47:00.000+02:00", "replies_count": 0, "uuid": "b37d4a81b4ef6ccd564bf7cf41d33295b6dc6178"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-mertens/tennis-belgiums-mertens-keeps-calm-collected-in-australian-open-bid-idUKL4N1PJ2XA", "ord_in_thread": 0, "title": "Tennis-Belgium's Mertens keeps calm, collected in Australian Open bid", "locations": [], "entities": {"persons": [{"name": "mertens", "sentiment": "negative"}, {"name": "elina svitolina", "sentiment": "none"}, {"name": "kirsten flipkens", "sentiment": "none"}, {"name": "robbe ceyssens", "sentiment": "none"}, {"name": "dane caroline wozniacki", "sentiment": "none"}, {"name": "elise mertens", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}], "organizations": [{"name": "mertens", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 10:50 AM / Updated 21 minutes ago Tennis-Belgium's Mertens keeps calm, collected in Australian Open bid Reuters Staff 3 Min Read \nMELBOURNE, Jan 24 (Reuters) - Unseeded Elise Mertens has extended a breakout year to storm into the semi-finals of her Australian Open debut by keeping a cool head and honing her technical skills. \nThe 22-year-old will become the first Belgian to reach a grand slam semi since Kirsten Flipkens’ 2013 Wimbledon foray on Thursday, after thrashing fourth seed Elina Svitolina of Ukraine in two sets. \nIn the youngster’s biggest ticket to date, she faces a goliath in Dane Caroline Wozniacki, who will be thirsty for a first grand slam title and who already sent her packing once, in Sweden last July. \nBut Mertens is unlikely to melt under pressure, coach Robbe Ceyssens who is also her boyfriend, told Reuters. \n“I think she can handle her stress really well. She just plays every point at a time and she plays every point like it’s her last and she gives it everything. She’s not crazy with the score. She is just focusing, that’s how it should be.” \nIn Mertens’ stellar break through 2017 season, she soared to 35 from a rank of 120, working hard to develop her physical and technical game. And if she sticks to form, a win could vault her into the top 20. Her last five opponents she has coolly dismissed in two sets. \nAs well as her grit and aggression, her very personalised training has helped as the couple travel the world together. \n“He’s by my side all the time. Since we have been together my game has only gone upward. All credit to him,” Mertens said, looking fondly at her beau on court in a post-match interview. VIDEO REPLAY \nPart of her success comes as the pair have dissected her matches post play to develop new strategies. \n“We watch a lot of videos of her and her opponents so that’s where we get our information,” he said. \n“It’s good that we played her (Caroline). It was on clay so that was a little bit different. But she’s (Mertens) not going to change her game plan so we try to find solutions together.” \nThe self-described “quiet girl” has also the advantage of being an unknown quantity. \n“If you’re seeded, then people expect something. If you’re unseeded then you can just play without stress and show who you are,” added Ceyssens. \nMertens has also looked to her compatriots for inspiration. Her first tennis memory is seeing grand slam champion Kim Clijsters on television. Now the two sometimes hit together when she trains at Clijsters’ academy, where Ceyssens is a coach. \nClijsters, who took home the Australian Open title in 2011, and Flipkens have been texting and tweeting their support. \n“Great fighter, mover, all rounder. Aggressive when she can, defensive when she has to. Right decisions on the right balls. And above all that, with her feet on the ground,” Flipkens wrote on Twitter. “That’s @elise_mertens.” \n“I‘m ready for it. I mean, I have a lot of energy left. Mentally, physically, good. I‘m just going to give it all and see where it ends,” Mertens said. (Reporting by Melanie Burton; Editing by Christian Radnedge)", "external_links": [], "published": "2018-01-24T12:47:00.000+02:00", "crawled": "2018-01-24T13:21:15.059+02:00", "highlightTitle": ""}