{"organizations": [], "uuid": "2225443efe9e7b829285e6e6e6d6c49b043e83fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-prospex-digital-acquires-universities-com.html", "country": "US", "domain_rank": 767, "title": "ProspeX Digital Acquires Universities.com", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-25T00:09:00.000+02:00", "replies_count": 0, "uuid": "2225443efe9e7b829285e6e6e6d6c49b043e83fb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-prospex-digital-acquires-universities-com.html", "ord_in_thread": 0, "title": "ProspeX Digital Acquires Universities.com", "locations": [], "entities": {"persons": [{"name": "mario lupia", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "red bank", "sentiment": "none"}], "organizations": [{"name": "prospex digital", "sentiment": "negative"}, {"name": "prospex digital acquires universities.com", "sentiment": "negative"}, {"name": "universities.com", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RED BANK, N.J., Jan. 24, 2018 /PRNewswire/ -- ProspeX Digital , a customer acquisition lead generation company, today announced the acquisition of Universities.com , which has served as a trusted source for researching colleges and universities since 1996.\nUniversities.com is a premier brand for prospective higher education students of all kinds from graduating seniors and adult learners seeking degree granting institutions to those pursuing a trade. Hundreds of colleges, universities, and trade schools nationwide trust this industry-leading website as an effective and reliable source for student prospect development. In tandem, Universities.com helps match prospective students to their ideal educational options through university rankings, tuition costs, and in-depth information on more than 8,000 campus-based and online institutions of higher education.\n\"We are pleased to welcome Universities.com to the ProspeX Digital family,\" said Mario Lupia, ProspeX Digital CEO and Managing Partner, who will also serve as CEO of Universities.com . \"Hundreds of schools nationwide trust Universities.com for performance-driven student prospect development, and now the popular site will have access to all of the cutting-edge digital marketing expertise and resources that ProspeX Digita l has to offer.\"\nFor colleges and universities seeking a reliable, turnkey source of student referrals, Universities.com sources and generates qualified inquiries in real time—targeting those seeking campus based or online higher education that is affordable, flexible and military-friendly. Our service is also perfect for adult learners who work full-time and are busy raising a family.\nWhat separates Universities.com from other college search websites is its focus on the \"U Factor\"—those distinguishing features that make each college or university unique. The website showcases financial aid opportunities, online learning options and more from the perspectives of college admission officers, professors and students.\n\"We are excited to acquire a great brand backed by result proven marketing channels and bring it to the many clients that my team and I have long term relationships with,\" said Joseph Mannino, ProspeX Digital CRO and Managing Partner who will also serve as CRO of Universities.com . Joseph will manage all national sales and account management from ProspeX Digital's Red Bank, N.J. office. Universities.com account management will continue to operate from its offices in San Diego, CA.\nAbout Universities.com\nUniversities.com was established in 1996 to help millions of prospective students and adult learners find colleges and universities that fit their needs and match their career goals. The website, features university rankings, tuition costs, and more in-depth information about more than 8,000 campus-based and online institutions of higher education. For more information on Universities.com 's expertise in higher education lead generation offerings, call 732-704-4368 or email Joseph@universities.com .\nTo learn more about Universities.com , visit www.universities.com\nOn Twitter: @Universitiescom\nOn Facebook: Facebook.com/Universitiescom\nOn Instagram: Instagram.com/universitiesdotcom\nAbout ProspeX Digital:\nProspeX Digital is a performance-driven digital marketing firm that specializes in prospect and data development with a focus on education recruitment marketing. ProspeX Digital sets itself apart from other digital marketing firms with a cost-effective, performance-driven model that is fueled by proprietary multi-channel ad targeting products that result in precise delivery of high-intent, qualified prospects to clients.\nTo learn more about ProspeX Digital , visit ProspeXDigital.com\nOn Twitter: @ProspexDigital\nOn Facebook: Facebook.com/ProspexDigital\nPress Contact:\nGina LaGuardia\n732-784-3558\ninfo@prospexdigital.com\nRelated Images\nimage1.jpg\nProspeX Logo\nimage2.png\nUniversities.com Logo\nView original content with multimedia: http://www.prnewswire.com/news-releases/prospex-digital-acquires-universitiescom-300587708.html\nSOURCE ProspeX Digital", "external_links": ["http://www.universities.com/", "http://www.prospexdigital.com/", "http://Facebook.com/ProspexDigital", "http://Instagram.com/universitiesdotcom", "http://Facebook.com/Universitiescom", "http://www.prnewswire.com/news-releases/prospex-digital-acquires-universitiescom-300587708.html"], "published": "2018-01-25T00:09:00.000+02:00", "crawled": "2018-01-25T02:35:37.005+02:00", "highlightTitle": ""}