{"organizations": [], "uuid": "c92d852a2ef4540d82e2dcdf68718e9ef0e97f68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-albertsons-companies-announces-contract-to-sell-49-percent-interest-in-casa-ley.html", "country": "US", "domain_rank": 767, "title": "Albertsons Companies Announces Contract to Sell 49% Interest in Casa Ley", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.034, "site_type": "news", "published": "2018-01-17T00:14:00.000+02:00", "replies_count": 0, "uuid": "c92d852a2ef4540d82e2dcdf68718e9ef0e97f68"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-albertsons-companies-announces-contract-to-sell-49-percent-interest-in-casa-ley.html", "ord_in_thread": 0, "title": "Albertsons Companies Announces Contract to Sell 49% Interest in Casa Ley", "locations": [], "entities": {"persons": [{"name": "tenedora", "sentiment": "none"}], "locations": [{"name": "casa ley boise", "sentiment": "none"}, {"name": "idaho", "sentiment": "none"}, {"name": "casa ley", "sentiment": "none"}], "organizations": [{"name": "albertsons companies", "sentiment": "negative"}, {"name": "albertsons companies announces contract", "sentiment": "negative"}, {"name": "safeway inc", "sentiment": "negative"}, {"name": "casa ley", "sentiment": "none"}, {"name": "albertsons cos.", "sentiment": "none"}, {"name": "safeway inc.", "sentiment": "none"}, {"name": "tenedora cl del noroeste", "sentiment": "none"}, {"name": "safeway", "sentiment": "none"}, {"name": "casa ley cvrs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOISE, Idaho,Jan. 16, 2018(GLOBE NEWSWIRE) --\nAlbertsons Companies announced today that Safeway Inc. has entered into a definitive agreement with Tenedora CL del Noroeste, S.A. de C.V. (\"Tenedora\") to sell its 49% interest in Mexico-based food and general merchandise retailer Casa Ley, S.A. de C. V. (Casa Ley) to Tenedora for a purchase price of MEX$6,500,000,000 (approximately US$345 million at today’s exchange rate). The sale is subject to Mexican antitrust approval and other customary closing conditions and is expected to close by February 28, 2018.\nIn connection with the merger of Safeway into a wholly owned subsidiary of Albertsons Cos. on January 30, 2015, former holders of common stock of Safeway Inc. received Contingent Value Rights, or CVRs. The Casa Ley CVRs represent the right to receive certain net proceeds from the sale of Safeway’s interest in Casa Ley. Based on a CVR Agreement entered into at the time of the merger, the amount of net proceeds to be distributed will be based on the gross proceeds from the sale of the Casa Ley interest less expenses less taxes (calculated at a tax rate of 39.25% agreed in the CVR Agreement). The net proceeds per CVR to be distributed to Casa Ley Holders at today’s exchange rate is estimated to be approximately 87 to 90 cents per Casa Ley CVR.\nAlbertsons Cos. anticipates that the net proceeds will be distributed approximately six weeks after the closing of the sale. Albertsons Cos. will announce the final amount of the distribution at that time. The distribution will be the final distribution that will be made with respect to the Casa Ley CVRs.\nThere can be no assurance that the sale will close or that the net proceeds will be the same as estimated.\nHolders of CVRs should consult their tax advisors as to the tax treatment of the Casa Ley CVRs and any distribution thereon. For tax reporting purposes, Safeway reported at the time of the merger that the fair market value of each Casa Ley CVR was $1.0149, based on a third-party valuation. This amount was reflected on Forms 1099-B issued by the paying agent with respect to the merger consideration.\nOver the past three years, since the date on which the Casa Ley CVRs were issued, the Mexican peso to U.S. dollar exchange rate has deteriorated more than 20%.\nToday’s announcement has no effect on the CVRs issued in connection with the merger with respect to the sale of Safeway’s former real estate development subsidiary, Property Development Centers (PDC). Albertsons Cos. will provide more information on the PDC CVRs when it has more clarity on the amount and timing of distributions with respect to the PDC CVRs.\nAbout Albertsons Companies\nAlbertsons Companies is one of the largest food and drug retailers in the United States, with both a strong local presence and national scale. We operate stores across 35 states and the District of Columbia under 20 well-known banners including Albertsons, Safeway, Vons, Jewel-Osco, Shaw's, Acme, Tom Thumb, Randalls, United Supermarkets, Pavilions, Star Market, Haggen and Carrs, as well as meal kit company Plated based in New York City. Albertsons Companies is committed to helping people across the country live better lives by making a meaningful difference, neighborhood by neighborhood. In 2016 alone, along with the Albertsons Companies Foundation, the company gave nearly $300 million in food and financial support. These efforts helped millions of people in the areas of hunger relief, education, cancer research and treatment, programs for people with disabilities and veterans outreach.\nImportant Notice Regarding Forward-Looking Statements\nThis press release contains certain forward-looking statements. Statements that are not historical facts, including statements about our perspectives and expectations, are forward looking statements. The words “expect,” “believe,” “estimate,” “intend,” “plan” and similar expressions, when related to the Company and its subsidiaries, indicate forward-looking statements. These statements reflect the current view of management and are subject to various risks and uncertainties. These statements are based on various assumptions and factors, including general economic, market, industry and operational factors. Any changes to these assumptions or factors may lead to practical results different from current expectations. Excessive reliance should not be placed on those statements. Forward-looking statements relate only to the date they were made, and the Company and its subsidiaries undertake no obligation to update forward-looking statements to reflect events or circumstances after the date they were made.\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/44f65d0f-793e-4918-bbfa-35e6d77ef6b0\nMelissa Plaisance Albertsons Companies 925-226-5115 melissa.plaisance@albertsons.com\nSource: Albertsons Companies", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/44f65d0f-793e-4918-bbfa-35e6d77ef6b0/en", "https://www.globenewswire.com/Tracker?data=uqeLhiOrij_5cs9EZWgQpO52hx2ffTlypDtqXJdbT8vrK_3yw6PLCpTapKK81wmnQ0cwhG3pAJ8OXILrndX9XMYEhYOineI2su0YnHW8n_B2BACbqE8Vx5kwEZY_FDOnttBHL6BmoW_3oDDBdrfW1EGApQhWXA90TtFfHKfA6XGfcprp4yEoFgAV0CIBQtHPZ8EDF7n8q6ZQ3RcY8Cp1tDwVwBUw6KWpj1NFdYgG_-5YVJgAdPemCU9oqhBdHnHtClkKxdufJLHeShwDN2f_VQ==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/44f65d0f-793e-4918-bbfa-35e6d77ef6b0"], "published": "2018-01-17T00:14:00.000+02:00", "crawled": "2018-01-17T00:00:17.010+02:00", "highlightTitle": ""}