{"organizations": [], "uuid": "5f779fbcabf00ff0ed5cc3fd325246d8a38fb41e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-woodbridge-group-of-companies-announces-appointment-of-three-additional-independent-managers.html", "country": "US", "domain_rank": 767, "title": "Woodbridge Group of Companies Announces Appointment of Three Additional Independent Managers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T06:23:00.000+02:00", "replies_count": 0, "uuid": "5f779fbcabf00ff0ed5cc3fd325246d8a38fb41e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-woodbridge-group-of-companies-announces-appointment-of-three-additional-independent-managers.html", "ord_in_thread": 0, "title": "Woodbridge Group of Companies Announces Appointment of Three Additional Independent Managers", "locations": [], "entities": {"persons": [{"name": "james m. peck", "sentiment": "none"}, {"name": "sym", "sentiment": "none"}, {"name": "peck", "sentiment": "none"}], "locations": [{"name": "sherman oaks", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "woodbridge group of companies announces appointment of three additional independent managers", "sentiment": "negative"}, {"name": "llc", "sentiment": "negative"}, {"name": "woodbridge group of companies", "sentiment": "negative"}, {"name": "sipa", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "quebecor", "sentiment": "none"}, {"name": "board of managers", "sentiment": "none"}, {"name": "united states bankruptcy judge for the southern district of new york", "sentiment": "none"}, {"name": "american airlines", "sentiment": "none"}, {"name": "iridium", "sentiment": "none"}, {"name": "japan airlines", "sentiment": "none"}, {"name": "morrison & foerster’s business restructuring & insolvency group", "sentiment": "none"}, {"name": "charter communications", "sentiment": "none"}, {"name": "lehman brothers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHERMAN OAKS, Calif.--(BUSINESS WIRE)-- Woodbridge Group of Companies, LLC and certain of its affiliates and subsidiaries (together “the Company” or “Woodbridge”), announced today that the Company has added three new members to its Board of Managers (the “Board”) to direct the business and affairs of the Company and the Debtors’ chapter 11 restructuring efforts.\nThis Board will be composed of the following additional people:\nHon. James M. Peck, global co-chair of Morrison & Foerster’s Business Restructuring & Insolvency Group. Judge Peck served as a United States Bankruptcy Judge for the Southern District of New York from 2006 to 2014 and presided over the chapter 11 and SIPA cases of Lehman Brothers and its affiliates, constituting the largest bankruptcy filing in U.S. history. Other notable matters over which Judge Peck presided include the chapter 11 cases of Iridium, Quebecor, Charter Communications, Extended Stay Hotels, and ION Media and the chapter 15 case of Japan Airlines. Judge Peck also brokered settlements in a number of high-profile cases including American Airlines, Syms/Filenes, MF Global, General Motors, Residential Capital, and Excel Maritime. Hon. Robert E. Gerber, former United States Bankruptcy Judge in the Southern District of New York, serving for 15 years. During his tenure as a federal bankruptcy judge, he presided over a broad array of chapter 11, chapter 7, chapter 15, section 304 and SIPA cases—including PSINet, Ames Department Stores, Global Crossing, Adelphia, ABIZ, Basis Yield Alpha Fund, Lyondell Chemical, BearingPoint, DBSD North America, Chemtura, Pinnacle Airlines, Houghton-Mifflin Harcourt and General Motors. He was named as one of the nation’s outstanding bankruptcy judges six times. David J. (Jan) Baker, retired partner of Latham & Watkins and former global co-chair of the firm’s Restructuring, Insolvency & Workouts Practice. During his career as a lawyer, Mr. Baker represented companies, lenders, committees, acquirers and other parties in connection with restructuring matters, and advised boards of directors on matters related to corporate governance and fiduciary duty. He is a Fellow of the American College of Bankruptcy and previously served as its president and then its Chair, a member of the International Insolvency Institute and recently served as a member of the ABI Commission to Study the Reform of Chapter 11. Mr. Baker frequently lectures and writes on issues involving corporate reorganization and restructuring. Since retiring from the practice of law, he has concentrated on board-related work for public and private companies going through restructurings.\n“Acting in consultation with stakeholders, including the Ad Hoc committees, the Debtors are delighted that such highly regarded and esteemed individuals have joined the Board of Managers,” said Marc Beilinson of Beilinson Advisory Group, formerly the sole independent manager of the Debtors. “These additions further the Debtors’ commitment to independent decision-making and transparency in these cases. The Board looks forward to working with all constituents in an effort to maximize value of the estates and their distribution to stakeholders,” said Mr. Beilinson.\nCourt filings and other information related to the restructuring are available at www.gardencitygroup.com/cases/WGC .\nGibson Dunn & Crutcher LLP and Young, Conaway, Stargatt & Taylor, LLP are serving as legal advisors. SierraConstellation Partners LLC is serving as chief restructuring officer and financial advisor, and Beilinson Advisory Group is serving as independent management to the debtors.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117006582/en/\nfor Woodbridge Group of Companies, LLC\nJennifer E. Mercer, 310-712-6215\njmercer@epiqsystems.com\nor\nMickey Mandelbaum or Kris Cole\n212-279-3115\nmmandelbaum@prosek.com\nkcole@prosek.com\nSource: Woodbridge Group of Companies, LLC", "external_links": ["http://www.businesswire.com/news/home/20180117006582/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.gardencitygroup.com%2Fcases%2FWGC&esheet=51745194&newsitemid=20180117006582&lan=en-US&anchor=www.gardencitygroup.com%2Fcases%2FWGC&index=1&md5=c6285950e989676d1d7080fe4ed27bbc"], "published": "2018-01-18T06:23:00.000+02:00", "crawled": "2018-01-18T08:20:01.005+02:00", "highlightTitle": ""}