{"organizations": [], "uuid": "00cf008d13ed52760af1da41b3f267956fcfddb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/22/104914185-RTX3WHWE.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/bitcoin-tanks-more-than-10-percent-to-start-week-to-below-11000-again.html", "country": "US", "domain_rank": 767, "title": "Bitcoin tanks more than 10% to start week to below $11,000 again", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.149, "site_type": "news", "published": "2018-01-22T16:43:00.000+02:00", "replies_count": 0, "uuid": "00cf008d13ed52760af1da41b3f267956fcfddb6"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/22/bitcoin-tanks-more-than-10-percent-to-start-week-to-below-11000-again.html", "ord_in_thread": 0, "title": "Bitcoin tanks more than 10% to start week to below $11,000 again", "locations": [], "entities": {"persons": [{"name": "coinbase", "sentiment": "none"}, {"name": "dado ruvic", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "coinmarketcap", "sentiment": "none"}, {"name": "coinbase  ripple", "sentiment": "none"}, {"name": "reuters  bitcoin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bitcoin and other major digital currencies dropped sharply Monday morning. \nBitcoin briefly tumbled to a low near $10,050 on Coinbase Monday afternoon ET, marking a loss of about 11 percent over the last 24 hours. Bitcoin traded near $10,192 as of 4:28 p.m. on Coinbase, the leading U.S. marketplace for buying and selling major digital currencies.\nEthereum fell below the psychologically key $1,000 level again and traded about 10 percent lower near $943, according to CoinMarketCap. \nBitcoin in the last hour \n\nSource: Coinbase \nRipple , the third-largest digital currency by market capitalization, fell about 14.5 percent to $1.18, according to CoinMarketCap.\nshow chapters Bitcoin’s origin story remains shrouded in mystery. Here's why it matters      6:30 PM ET Fri, 27 Oct 2017 | 06:23 The price decline came as some details emerged on cryptocurrency regulation in South Korea, where the government has been trying to limit excessive speculation. \nThe South Korean government said Monday it will collect up to 24.2 percent of corporate and local income taxes from the country's digital currency exchanges this year, according to an English-language report from the local Yonhap News Agency. In a potential move towards taxing cryptocurrency transactions, the news agency also said the government plans to require digital currency exchanges to share users' transaction data with banks.\nBitcoin trading in South Korean won accounted for 4 percent of trading volume, according to CryptoCompare. The Japanese Yen had the largest share, accounting for about 37 percent, while the U.S. dollar had about 33 percent of bitcoin trading volume, the website showed.\nNearly all digital currencies plunged in the middle of last week following concerns over increased cryptocurrency regulation in South Korea and China. Bitcoin even fell below the $10,000 level that it first topped in late November.\nLast Tuesday, Yonhap News reported that South Korean Finance Minister Kim Dong-yeon also said in a radio program interview that \"the shutdown of virtual currency exchanges is still one of the options\" the government has. The news followed an announcement in late December the South Korean government is banning new trading accounts , and requiring users to use their real names.\nHowever, prices had stabilized by the end of last week.\nBitcoin in the last week \n\nSource: Coinbase \nFundstrat's Tom Lee, a noted Wall Street strategist, raised his price target on bitcoin Thursday and now sees the digital currency hitting $25,000 by the end of this year. Lee also said that $9,000 is low for bitcoin and offers a buying opportunity.\nResearch from accounting giant Ernst & Young released Monday found that more than 10 percent of funds raised through \"initial coin offerings\" are lost or stolen in hacker attacks. \nDisclaimer \nWATCH: Bitcoin could be the biggest bubble in history – here's how show chapters Bitcoin could be the biggest bubble in history – here's how      7:26 AM ET Wed, 17 Jan 2018 | 02:00", "external_links": [], "published": "2018-01-22T16:43:00.000+02:00", "crawled": "2018-01-22T16:56:21.001+02:00", "highlightTitle": ""}