{"organizations": [], "uuid": "e567259c51338bb1931ec59e1956648d585b1a7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/cyber-atms-usa/atm-maker-warns-of-possible-jackpotting-hacks-on-u-s-machines-idUSL2N1PM0CR", "country": "US", "domain_rank": 408, "title": "ATM maker warns of possible 'jackpotting' hacks on U.S. machines", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T05:09:00.000+02:00", "replies_count": 0, "uuid": "e567259c51338bb1931ec59e1956648d585b1a7f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/cyber-atms-usa/atm-maker-warns-of-possible-jackpotting-hacks-on-u-s-machines-idUSL2N1PM0CR", "ord_in_thread": 0, "title": "ATM maker warns of possible 'jackpotting' hacks on U.S. machines", "locations": [], "entities": {"persons": [{"name": "mike jacobsen", "sentiment": "none"}, {"name": "krebs", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "diebold nixdorf inc", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "u.s. secret service", "sentiment": "none"}, {"name": "diebold nixdorf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 27 (Reuters) - ATM maker Diebold Nixdorf Inc warned banks that hackers may be targeting U.S. cash machines with tools that force them to spit out cash, the latest development to highlight the increasing threat hackers pose to financial firms.\nThe company said on Friday that U.S. authorities had warned it that so-called “jackpotting” attacks could move from Mexico to the United States within the next few days.\nIf any attacks are confirmed in the United States, they would be first cases of “jackpotting” in the country, according to security news website Krebs on Security, which reported on the attacks earlier on Saturday.\nDiebold Nixdorf spokesman Mike Jacobsen confirmed the Krebs report that his company had issued the warning, but declined to say how many banks in Mexico and the United States had been targeted or comment on the size of any losses.\nATM “jackpotting” has been on the rise in recent years, though it is unclear how much money has been stolen because banks and law enforcement agencies often keep such details secret.\nA confidential U.S. Secret Service alert sent to banks said that the hackers targeted stand-alone ATMs typically located in pharmacies, big box retailers and drive-thru ATMs, Krebs on Security reported.\n“During previous attacks, fraudsters dressed as ATM technicians and attached a laptop computer with a mirror image of the ATMs operating system along with a mobile device to the targeted ATM,” Krebs cited the Secret Service as saying.\nReuters was unable to obtain a copy of the Secret Service report and an agency representative declined comment. Officials with the Federal Bureau of Investigation could not immediately be reached.\nRussian cyber security firm Group IB has reported that cyber criminals remotely attacked cash machines in more than a dozen countries across Europe in 2016 using malicious software that forces machines to spit out cash. Similar attacks were also reported that year in Thailand and Taiwan.\nDiebold Nixdorf’s alert said that the hackers were targeting a model in its line of ATMs, known as the Opteva, which the company stopped making several years ago but is still used by some banks.\nThe company believes that the same approach would not work on other models, Jacobsen said.\nThe alert described steps that banks can take to prevent against such attacks. (Reporting by Jim Finkle in Toronto; Additional reporting by Dustin Volz in Washington; Editing by Susan Thomas)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-28T05:09:00.000+02:00", "crawled": "2018-01-28T03:05:12.005+02:00", "highlightTitle": ""}