{"organizations": [], "uuid": "29674edc5e0b2b9bf6269ca77faf1b91f85ba4b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-arotech-hires-new-cfo.html", "country": "US", "domain_rank": 767, "title": "Arotech Hires New CFO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.399, "site_type": "news", "published": "2018-01-09T00:05:00.000+02:00", "replies_count": 0, "uuid": "29674edc5e0b2b9bf6269ca77faf1b91f85ba4b5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-arotech-hires-new-cfo.html", "ord_in_thread": 0, "title": "Arotech Hires New CFO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ANN ARBOR, Mich., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Arotech Corporation (Nasdaq:ARTX) today announced that it has hired Kelli L. Kellar as Vice President – Finance. Ms. Keller begins her employment with Arotech today, and starting April 1, 2018, Ms. Kellar will take over the role of chief financial officer from current Senior Vice President – Finance and CFO Tom Paup, who will be retiring at the end of March.\nMs. Kellar joins Arotech with strong experience in the field of finance. From November 2013 until accepting this position with Arotech, she was Senior Manager of External Reporting, PP&E Reporting and IFRS Accounting with Fiat Chrysler Automobiles. From May 2009 until November 2013, Ms. Kellar was Vice President and controller of Silverpop Systems, Inc., a privately-held, international software development company. Since 1995 Ms. Kellar has held accounting and finance positions with both public and private companies, including serving from 2007 to 2009 as Chief Accounting Officer with Premier Exhibitions, Inc., a Nasdaq-listed provider of global museum-quality touring exhibitions. Ms. Kellar holds a bachelor’s of accounting and a master’s of science in taxation from Florida International University.\n“I am delighted to announce this new appointment,” said Dean M. Krutty, acting CEO of Arotech. “I wish Kelli a long and successful career with us and look forward to working with her,” continued Mr. Krutty.\n“I also would like to take this opportunity to thank our current Senior Vice President – Finance and CFO, Tom Paup, for his dedicated effort and his many and significant contributions to the Company, and to wish him an enjoyable and satisfying retirement. It’s been an honor and a pleasure to work with someone so professional and with the outstanding business acumen that Tom brought to Arotech. Tom will stay with us through March 31, 2018 in order to assist with a smooth transition and to help in the process of our annual audit and preparation of our annual report to the SEC. I look forward to working with Kelli and Tom during the three-month transition period to ensure a smooth handoff of the CFO responsibilities,” concluded Mr. Krutty.\nAbout Arotech Corporation\nArotech Corporation is a defense and security products and services company, engaged in two business areas: interactive simulation for military, law enforcement and commercial markets; and mobile power systems for the military, commercial and medical markets.\nArotech is incorporated in Delaware, with corporate offices in Ann Arbor, Michigan, and research, development and production subsidiaries in Michigan, South Carolina, and Israel. For more information on Arotech, please visit Arotech’s website at www.arotech.com .\nInvestor Relations Contact:\nScott Schmidt\nArotech Corporation\n1-800-281-0356\nScott.Schmidt@arotechusa.com\nExcept for the historical information herein, the matters discussed in this news release include forward-looking statements, as defined in the Private Securities Litigation Reform Act of 1995. Forward-looking statements reflect management’s current knowledge, assumptions, judgment and expectations regarding future performance or events. Although management believes that the expectations reflected in such statements are reasonable, readers are cautioned not to place undue reliance on these forward-looking statements, as they are subject to various risks and uncertainties that may cause actual results to vary materially. These risks and uncertainties include, but are not limited to, risks relating to: product and technology development; the uncertainty of the market for Arotech’s products; changing economic conditions; delay, cancellation or non-renewal, in whole or in part, of contracts or of purchase orders (including as a result of budgetary cuts resulting from automatic sequestration under the Budget Control Act of 2011); and other risk factors detailed in Arotech’s most recent Annual Report on Form 10-K for the fiscal year ended December 31, 2016, and other filings with the Securities and Exchange Commission. Arotech assumes no obligation to update the information in this release. Reference to the Company’s website above does not constitute incorporation of any of the information thereon into this press release.\nSource:Arotech Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/6ca46dd3-7bb7-48da-aa94-ef15a4f11ed8", "https://www.globenewswire.com/Tracker?data=cDJTOPQJNlKy-BFGYDLYu6-3FNpFB00wx04ZKZ6YM4ruSoXn6Fs_hqirWwttYo6wRsuC7wu0BL_wHIp4Sg7VhA==", "https://www.globenewswire.com/Tracker?data=w7vFSR8PpuEl5TIOJByYalJOhMrYPdBAkbUAaBlCUmlehxSt5RMJk47N-V6GZj2deoegW_g4WZ2Jf7yKbdgJg_d95Odje_xasW_NJq69nOh8KVwK3rpGC0Ivc2sW16K2"], "published": "2018-01-09T00:05:00.000+02:00", "crawled": "2018-01-09T09:40:25.907+02:00", "highlightTitle": ""}