{"organizations": [], "uuid": "e902d40883e459e212cf963271117fce8fb0ae11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/10/104763899-RTX23G65-oil.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/brent-crude-rockets-to-3-year-high-above-70.html", "country": "US", "domain_rank": 767, "title": "Brent crude rockets to 3-year high above $70", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.03, "site_type": "news", "published": "2018-01-11T18:32:00.000+02:00", "replies_count": 0, "uuid": "e902d40883e459e212cf963271117fce8fb0ae11"}, "author": "Tom Dichristopher", "url": "https://www.cnbc.com/2018/01/11/brent-crude-rockets-to-3-year-high-above-70.html", "ord_in_thread": 0, "title": "Brent crude rockets to 3-year high above $70", "locations": [], "entities": {"persons": [{"name": "essam al-sudani", "sentiment": "negative"}, {"name": "amara", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "baghdad", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brent crude oil hit a more than three-year high on Thursday, breaking through the psychologically important $70 a barrel level for the first time since December 2014.\nOil futures failed to hold the gains, selling off as the close of trading approached, with analysts warning that the market might have little room left to run.\nBrent, the international benchmark for oil prices, was last up 6 cents at $69.26 a barrel. It earlier spiked to $70.05 in morning trade, touching its highest level since Dec. 4, 2014, when the contract hit $70.60.\nU.S. West Texas Intermediate crude finished the session up 23 cents at $63.80, after breaking through $64 a barrel for the first time since December 2014. The contract topped out at $64.77, a high going back to Dec. 8, 2014.\nOil prices have been supported by stronger-than-expected demand fueled by worldwide economic growth, ongoing output limits by OPEC and Russia and a series of global events that have stoked geopolitical tension.\nA rally that began in June accelerated in December, with prices rising about 15 percent over roughly the last month.\n\"I think it starts to get difficult for us to get much higher from here,\" said John Kilduff, founding partner at energy hedge fund Again Capital. \"I think we're probably in the process of topping out as we speak.\"\nKilduff forecast last week that Brent would take aim at $70 a barrel and U.S. crude could break into the $65-$67 range. But high prices will tempt OPEC members and other producers to start pumping, he said.\nAbout two dozen oil producing nations are keeping 1.8 million barrels a day off the market to drive down global inventories to their five-year average.\nshow chapters Uncertainty surrounding OPEC member Iran, analyst says 7 Hours Ago | 01:56 A bullish U.S. crude inventories report that showed oil in storage fell by nearly 5 million barrels in the latest week was underpinning prices on Thursday.\nStill, there are a number of factors that could push oil prices higher, Kilduff said. Those include supply disruptions from Iran, which faces the threat of renewed U.S. sanctions, and Venezuela, where economic crisis is whittling away its ability to pump oil.\nThe demand side of the market also remains strong.\n\"Part of the global synchronous economic recovery that we're seeing has translated into more demand than was previously thought could happen,\" Kilduff said.\nRefiners continue to pump out refined fuel, taking advantage of a wide price differential between U.S. crude and Brent. The difference in the two benchmarks remains above $5 a barrel.\nHowever, refiners around the world are heading into seasonal maintenance season, when they switch from winter to spring fuel blends. Demand typically drops off during this period.\nshow chapters Jefferies: China demand, OPEC action to keep oil market undersupplied 13 Hours Ago | 02:03 The recent cold snap also appears to have created some operational problems for oil drillers. U.S. production unexpectedly dropped by about 290,000 barrels a day in the latest week, according to the U.S. Energy Information Administration.\nCash prices for oil deliveries in the Permian Basin in Texas have recently topped WTI futures, a signal that some producers may be having trouble delivering the barrels they promised, said Tom Kloza, global head of energy analysis at Oil Price Information Service.\nThese are short-term factors that shouldn't impact oil prices for long, he said, and the market moves are starting to loo overdone.\n\"I think this is a runaway train and it's going to get derailed,\" Kloza told CNBC.\n\"I think it's pure momentum and I think that when the Commodity Futures Trading Commission numbers come out ... I think we'll see an awful lot of money — financial money — is behind this rally.\"\nThe weekly numbers from the CFTC, out on Friday, have recently shown a run-up in bets that oil prices will keep rising, while wagers that crude futures will dip have plunged. This financial positioning among hedge funds sometimes indicates speculation is mounting and a correction is around the corner.", "external_links": [], "published": "2018-01-11T18:32:00.000+02:00", "crawled": "2018-01-11T18:32:44.007+02:00", "highlightTitle": ""}