{"organizations": [], "uuid": "4eed148825f04f9de65bbfe7a803c26c50eebadd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-economy-trade/update-1-chinas-dec-imports-growth-weakest-in-a-year-exports-beat-fcast-idUSL4N1P7203", "country": "US", "domain_rank": 408, "title": "UPDATE 1-China's Dec imports growth weakest in a year, exports beat f'cast", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T05:59:00.000+02:00", "replies_count": 0, "uuid": "4eed148825f04f9de65bbfe7a803c26c50eebadd"}, "author": "", "url": "https://www.reuters.com/article/china-economy-trade/update-1-chinas-dec-imports-growth-weakest-in-a-year-exports-beat-fcast-idUSL4N1P7203", "ord_in_thread": 0, "title": "UPDATE 1-China's Dec imports growth weakest in a year, exports beat f'cast", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "general administration of customs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 01 AM / Updated 34 minutes ago UPDATE 1-China's Dec imports growth weakest in a year, exports beat f'cast Reuters Staff \n* China Dec imports +4.5 pct y/y \n* China Dec exports +10.9 pct y/y \n* China trade surplus with U.S. at record high last year (Adds detail, analyst comment & economic context) \nBEIJING, Jan 12 (Reuters) - China’s exports and imports growth slowed in December after unexpectedly surging in the previous month, adding to signs of ebbing economic growth as the government extends a crackdown on financial risks and factory pollution. \nDecember exports rose 10.9 percent from a year earlier, beating analysts’ forecast of a 9.1 percent increase, but cooling from a robust 12.3 percent gain in November, official data showed on Friday. \nImports grew an even slower pace of 4.5   December, the General Administration of Customs said, which was the weakest since they rose 3.1 percent in December 2016. Imports missed analysts’ forecast of 13.0 percent growth and were a sharp decrease from the 17.7 percent rise in the previous month. \nThat left the country with a trade surplus of $54 billion for the month, the highest since January 2016. \nEconomists had expected China’s trade surplus to have narrowed to $37 billion in December from November’s $40.21 billion. \nChina and many trade-dependent countries have benefited from a year-long global exports boom that many economists expect will extend well into this year. \nChina’s exports for the full year rose 7.9 percent, the fastest rate since 2013, while imports gained 15.9 percent, the best since 2011. \nBut weaker growth in December reinforced evidence of slowing momentum in the world’s second-biggest economy, as the government’s intensified war on pollution and a crackdown on debt risks weigh on activity. \n“Although the trade data are often volatile, this latest decline (in import volumes)...is a sign that domestic demand may have weakened at the end of last year,” Capital Economics Senior China Economist Julian Evans-Pritchard wrote in a note. \nThe trade data also showed China’s goods surplus with the U.S., a sore spot in relations between the two nations, hit a record high last year. \nChina’s 2017 surplus with the United States was $275.81 billion, topping the previous record in 2015 of $260.8 billion. China’s December trade surplus with the U.S. was $25.55 billion, compared to $27.87 billion in November. \nChina’s excess production capacity has emerged as a major trade irritant for the world’s leading economic powers, prompting them to consider new steps to protect domestic industries and jobs from a flood of Chinese imports. \nThe Trump administration is also considering several unilateral tariff actions on steel, aluminium and China’s intellectual property practices likely to draw disputes from WTO members. Reporting by Yawen Chen and Elias Glenn; additional reporting by Lusha Zhang; Editing by Shri Navaratnam", "external_links": [], "published": "2018-01-12T05:59:00.000+02:00", "crawled": "2018-01-12T06:41:25.009+02:00", "highlightTitle": ""}