{"organizations": [], "uuid": "eee37cfeed104a25c3f7c986027e4e99cc0138fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938339-_Y2A0145.1910x1000.JPG", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/25/secrets-and-mistakes-of-investors-like-bill-gates-and-warren-buffett.html", "country": "US", "domain_rank": 767, "title": "Secrets and mistakes of investors like Bill Gates and Warren Buffett", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-25T21:37:00.000+02:00", "replies_count": 0, "uuid": "eee37cfeed104a25c3f7c986027e4e99cc0138fc"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/secrets-and-mistakes-of-investors-like-bill-gates-and-warren-buffett.html", "ord_in_thread": 0, "title": "Secrets and mistakes of investors like Bill Gates and Warren Buffett", "locations": [], "entities": {"persons": [{"name": "warren buffett", "sentiment": "negative"}, {"name": "bill gates", "sentiment": "negative"}, {"name": "melinda", "sentiment": "none"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The richest investors have their own particular approach to making billions. Yet, sometimes they go against their own advice, or otherwise take a big risk — and the results aren't always good. Click through to see investment mistakes made by some of the wealthiest people .\nBill Gates: Helping out a rival company Bill Gates, the iconic founder of Microsoft and a major philanthropist who runs a foundation with wife Melinda, has a reported $90.2 billion net worth. In fact, he's one of the richest billionaires in the world . And his dirty secret involves helping a company known to be a Microsoft rival, though — Apple.\nIn spite of the tech darling's popularity today, the early 1990s were tough on Apple. The company's profits fell, and it experienced a period of net losses. During that same time period, Microsoft was soaring, with $1.18 billion of revenue growth in 1990 and approximately $23 billion in 2000.\nMore from GOBankingRates:\nTake advantage of these 16 commonly missed tax deductions\nThe ABCs of a happy retirement\nTop 10 penny stocks of 2017\nDesperate for cash, in 1997 Apple created a partnership with Microsoft by selling $150 million of Apple stock to the firm. An added part of the deal was Gates' big mistake: Microsoft provided software to the beleaguered company, thus guaranteeing the longevity of Apple's products.\nWas it really a mistake?\nThis boost to Apple created a tremendous competitive force for Microsoft. It also raises the question of whether the Microsoft-Apple partnership disproportionately hurt Microsoft in the long run.\nshow chapters 9 career secrets a 25-year-old CEO thinks everyone should know 3:54 PM ET Thu, 6 Oct 2016 | 01:19 Warren Buffett: Breaking his own rule Arguably the most famous investor of our time, Warren Buffett readily admits his mistakes. In fact, although he's the third-richest person in America, according to Forbes, he remains humble. He amassed his $78 billion fortune by investing in companies that he understands and holding on to his investments for the long haul.\nHowever, Buffett's dirty investment secret is that he broke his own rule. For many years, he avoided any technology investments. Nevertheless, he made a large investment in the iconic technology firm, IBM, in 2011.\nWas it really a mistake?\nTime will tell whether the IBM pick was a mistake or not. The stock price for IBM was around $153 as of Dec. 20, 2017 — still below the average range of his prior stock buy prices between $167 and $197.\nGeorge Soros: Not using his own expertise Self-made investing billionaire George Soros clocked in at No. 20 on the 2017 Forbes 400 list, with a reported $23 billion net worth. Yet, Soros' $500 million investing mistake might have resulted from an inability to follow his own advice.\nWhen long-time fund guru Bill Gross moved from Pimco to Janus Capital, Soros invested $500 million in a special institutional account patterned on Gross' Janus Global Unconstrained Bond fund. This new fund gave Soros the opportunity to buy, sell or short any type of bond in any world market.\nThe big mistake: Bond funds with the lowest expenses prevail, not those with active trading, wrote Alexander Green, chief investment strategist with The Oxford Club. As an insider, Soros should have known that, Green wrote on Investment U.\nWas it really a mistake?\nUnfortunately, the fund performed poorly and ranked in the bottom quartile of similar funds, when Soros reportedly pulled his money in 2015, according to Investment U.\nshow chapters Real estate mogul says this is a big mistake amateurs can't afford to make 8:59 AM ET Wed, 19 April 2017 | 01:20 Carl Icahn: Investing in Blockbuster Carl Icahn holds the No. 27 slot on the Forbes 400, with a reported $16.7 billion net worth. The founder of Icahn Capital Management is another self-made billionaire investor. He considers himself a contrarian investor, buying out-of-favor assets with financial problems and then demanding changes. Unfortunately, this trend sometimes leads to investing errors.\nJust as video enthusiasm was waning, Icahn took a large position in Blockbuster. After joining Blockbuster's board of directors, he lobbied against online distribution as well as the company's desire to discontinue late fees. As the company perished, Icahn lost approximately $200 million.\nWas it really a mistake?\nThis dirty investing secret led to a rosy outcome, however. He turned his Blockbuster failure into a success by investing $321 million in Netflix and turning it into about $2 billion, according to Forbes.\nAbigail Johnson: Passive investing One of the most powerful female CEOs , Abigail Johnson replaced her father, Edward Johnson, III, to become the third Johnson to lead Fidelity Investments, the company that her grandfather founded in 1946.\nHer current net worth is $16 billion, and she's at No. 29 on the 2017 Forbes 400. Fidelity , a top fund company with $2 trillion in assets under management, has built its reputation as an active fund manager.\nJohnson's dirty investment secret, however, is that Fidelity has jumped on the passive-investing index-fund bandwagon.\nWas it really a mistake?\nAccording to ETF.com, an authority on exchange-traded funds, experts disagree about what the future holds for active and passive investments. In fact, Johnson herself has suggested that passive investments are a temporary trend.\nStill, Fidelity has added a stable of Fidelity Spartan index funds and even partnered with BlackRock to offer low-fee exchange-traded funds. This switch is allowing Fidelity to remain competitive in the ever-evolving investing environment.\nshow chapters How Barry Manilow's biggest money mistake left him with just $11,000 in the bank 6:12 PM ET Thu, 1 June 2017 | 01:20 Ronald Perelman: Buying out Revlon Investment manager Ronald Perelman reportedly has a $12.1 billion net worth and was No. 33 on the 2016 Forbes 400, though he didn't make the cut in 2017. He's the founder and owner of MacAndrews & Forbes, Inc., which runs and grows businesses. According to Forbes, he's coping with Revlon, his dirty investing secret.\nThe wealthy investor is considered part of the takeover clan of the 1980s, including billionaires Icahn and Soros. His 1985 leveraged buyout of the well-known cosmetics company continues to be a thorn in his side and a major investing mistake.\nWas it really a mistake?\nRevlon's shares plummeted 30 percent in the six months through Jan. 14, 2016, according to Bloomberg. As its shares continue to drop, recent SEC filings suggest the billionaire is looking for an out.\nSteve Cohen: Insider trading scandal Hedge-fund billionaire Steve Cohen is ranked No. 34 on the 2017 Forbes 400, with a reported $13 billion net worth. As the overseer of Point72 Asset Management, Cohen is considered one of the top hedge-fund managers. Due to his big investor mistake, however, his SAC Capital hedge fund was closed.\nCohen's dirty investing secret is a serious legal indictment. SAC Capital pleaded guilty to the crime of insider trading in 2013.\nWas it really a mistake?\nThe firm was forced to return money to its clients, and Cohen paid $1.8 billion of his personal funds to reconcile the penalties. He accepted a two-year ban on managing outside money and is in the process of settling all additional issues. The takeaway for this big investor mistake is not to trade on insider information.\nStephen Schwarzman: Helping launch BlackRock Stephen Schwarzman's current net worth is $12.6 billion, and he's ranked No. 35 on the 2017 Forbes 400 list. In 1985, he and Pete Peterson left Lehman Brothers and started Blackstone Group. Today, the investment firm is the largest buyout firm in the world, with $333 billion in assets under management.\nOf all the wealthy investor secrets, this one involves a personnel decision. Schwarzman actually encouraged former fixed-income trader Laurence Fink to try asset management, according to The Wall Street Journal.\nshow chapters Suze Orman explains how much money you'll need to have when an emergency happens 12:46 PM ET Thu, 15 June 2017 | 01:01 Was it really a mistake?\nFink then founded BlackRock, which is now the largest asset management firm, managing $4.6 trillion. While people often assume that Schwarzman would've preferred that Fink lend his financial expertise to Blackstone Group instead, a 2017 CNBC article revealed that Schwarzman was fully on board with the transition.\nThe similar company names have caused a bit of confusion among clients, though.\nJohn Paulson: Betting on Greece and Puerto Rico John Paulson, founder of hedge fund Paulson & Company, Inc., has a current net worth of $7.8 billion and was No. 52 on the 2016 Forbes 400 list. He was considered a genius when he bet against subprime mortgages at the height of the 2007 credit bubble.\nHis net worth is less in 2018 than in 2016 — a drop in value that exemplifies Paulson's dirty investing secret. He bet on the Greek debt crisis recovery and invested in Puerto Rico gold shares.\nWas it really a mistake?\nThis remains to be seen. Although these investments aren't paying off right now, time will tell whether they prove profitable in the future.\nJohn Bogle: Avoiding international investing Although he's not listed on the Forbes 400, this super-investor and founder of Vanguard funds is too important to the investing community to leave off the list. John Bogle, the retired CEO of The Vanguard Group, is estimated to have a net worth of $80 million, according to TheRichest.\nBogle founded The Vanguard Group in 1974 and has grown the firm to become the second-largest mutual fund company in the world. He founded the first index mutual fund available to the public, the Vanguard 500 Index Fund.\nDespite being the champion of a diversified passive index fund approach to investing, Bogle's investing secret is that he deviates from this approach with his personal investing. Bogle even contradicts Vanguard's own research — that international diversification is crucial for a good investment strategy. Bogle revealed in a 2015 CNBC interview that he eschews international investing in his own portfolio, in spite of its diversification benefits.\nWas it really a mistake?\nNeglecting international investing could be putting Bogle's portfolio at risk. According to U.S. News & World Report, portfolios that don't include international investments aren't sufficiently diversified. Not only can foreign market investments help create more robust returns, but they can also protect a portfolio when U.S. stocks plummet.\nLike this story? Like CNBC Make It on Facebook !\nDon't miss: The 29-year-old whose company makes millions buying from Walmart and selling on Amazon reveals his biggest money mistake\nThis article originally appeared on GOBankingRates.\nshow chapters Suzy Welch: This is the biggest mistake people make when negotiating salary 8:56 AM ET Wed, 19 July 2017 | 01:44", "external_links": ["https://www.gobankingrates.com/investing/abcs-happy-retirement/", "https://www.gobankingrates.com/investing/7-investing-mistakes-warren-buffett-regrets/", "https://www.gobankingrates.com/taxes/commonly-missed-tax-deductions/", "https://www.facebook.com/CNBCMakeIt/", "https://www.gobankingrates.com/investing/dirtiest-secrets-wealthy-investors/", "https://www.gobankingrates.com/mortgage/", "https://www.gobankingrates.com/net-worth/powerful-female-ceos-net-worths/", "https://www.gobankingrates.com/ira-brokerage/", "https://www.gobankingrates.com/net-worth/worlds-richest-billionaires/", "https://www.gobankingrates.com/investing/warren-buffetts-top-investing-secret-simpler-think/", "https://www.gobankingrates.com/investing/what-hedge-funds/", "https://www.gobankingrates.com/debt/", "https://www.gobankingrates.com/investing/top-penny-stocks-2017/", "https://www.gobankingrates.com/banking/financial-institutions/fidelity-bank/"], "published": "2018-01-25T21:37:00.000+02:00", "crawled": "2018-01-25T23:54:15.002+02:00", "highlightTitle": ""}