{"organizations": [], "uuid": "99fdc7f3c65e3007108620b12b09db5704efcb3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-bond-yields-head-back-towards-multi-month-highs-idUSL8N1PD34V", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Euro zone bond yields head back towards multi-month highs", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T21:10:00.000+02:00", "replies_count": 0, "uuid": "99fdc7f3c65e3007108620b12b09db5704efcb3b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-bond-yields-head-back-towards-multi-month-highs-idUSL8N1PD34V", "ord_in_thread": 0, "title": "UPDATE 2-Euro zone bond yields head back towards multi-month highs", "locations": [], "entities": {"persons": [{"name": "fanny potkin", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "u.s. treasury", "sentiment": "negative"}, {"name": "apple", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "rabobank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro zone bonds higher on US sell-off, supply\n* 10-year U.S. Treasury yield hits high of 2.61 pct\n* France and Spain to hold auctions\n* Austria seen launching 10-year bond syndication (Adds Austria syndication details)\nBy Fanny Potkin\nLONDON, Jan 18 (Reuters) - Borrowing costs in the euro area edged towards recent multi-month highs on Thursday, as a sell-off in U.S. Treasuries and new supply from France, Spain and Austria put bond markets on the back foot once again.\nThe 10-year U.S. Treasury yield hit its highest since March 2017 at 2.61 percent in European trade, pushing euro zone counterparts higher.\nTwo-year Treasury yields hit a 10-year high on Thursday on expectations the Federal Reserve will continue to tighten monetary policy this year.\nAnalysts at Rabobank said speculation that Apple might offload U.S. Treasuries to pay for the $38 billion in taxes on the profits it intends to repatriate could also have weighed on U.S. bonds.\nGermany’s 10-year bond yield, the benchmark for the region, was 2 bps higher on the day at 0.51 percent, near 5-1/2 month highs of 0.54 percent hit on Friday.\nMost 10-year bond yields in the euro area were up 1-2 basis points on the day.\n“It’s been Treasury driven ... though there was some relief in that the risk of a government (in the United States) shutdown has been pushed back to late February,” said ING senior rates strategist Martin van Vliet.\nGovernment bond yields across the world have been rising in recent times on signs of an uptick in the global economy and on signals that major central banks will tighten monetary policy.\nOn Thursday, there was further news on this front, China’s economy growing faster than expected in the fourth quarter from a year earlier.\nBorrowing costs across the euro zone had also been facing upward pressure from new supply.\nAustria was set to sell 4 billion euros of 10-year bonds through a syndication, while France sold 7.5 billion euros in short-dated bonds and Spain raised 4.1 billion euros in a bond auction.\nSoon after that auction, the gap between Spanish and German 10-year government bond yields narrowed to 96 basis points, its tightest level since August.\nAnalysts attributed the move to speculation over a potential upgrade for Spain by Fitch Ratings.\nLater on Thursday, European Central Bank rate-setter Benoît Coeuré and Bundesbank President Jens Weidmann were expected to speak in Frankfurt.\n“Coeuré ... has not been heard year-to-date and could use the chance to stifle any remaining hawkish expectations ahead of next week’s ECB meeting,” van Vliet of ING said in a note.\nBond markets have taken comfort over the past week in signs that ECB rate-setters are in no hurry to commence an immediate change in the bank’s policy stance.\nOn Wednesday, the ECB’s Vitor Constancio said in an interview he did not rule out that monetary policy would remain “very accommodating for a long time”.\nThat followed a Reuters source-based story on Tuesday that the ECB is unlikely to ditch a pledge to keep buying bonds at next week’s meeting.\nReporting by Fanny Potkin; Graphic by Dhara Ranasinghe; Editing by Jon Boyle\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T21:10:00.000+02:00", "crawled": "2018-01-19T12:10:31.023+02:00", "highlightTitle": ""}