{"organizations": [], "uuid": "6f2e5718bf47682794ccb1356bebe05ed70032a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 189, "shares": 189, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/27/104735543-GettyImages-854760366.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/27/a-bomb-hidden-in-an-ambulance-explodes-in-kabul-kills-dozens.html", "country": "US", "domain_rank": 767, "title": "A bomb hidden in an ambulance explodes in Kabul, kills dozens", "performance_score": 1, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.219, "site_type": "news", "published": "2018-01-27T17:30:00.000+02:00", "replies_count": 0, "uuid": "6f2e5718bf47682794ccb1356bebe05ed70032a4"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/27/a-bomb-hidden-in-an-ambulance-explodes-in-kabul-kills-dozens.html", "ord_in_thread": 0, "title": "A bomb hidden in an ambulance explodes in Kabul, kills dozens", "locations": [], "entities": {"persons": [{"name": "haqqani", "sentiment": "none"}, {"name": "dejan panic", "sentiment": "none"}], "locations": [{"name": "kabul", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}], "organizations": [{"name": "taliban", "sentiment": "none"}, {"name": "interior ministry", "sentiment": "none"}, {"name": "intercontinental hotel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A bomb hidden in an ambulance explodes in Kabul, kills nearly 100 people Published 7 Hours Ago Reuters Shah Marai | AFP | Getty Images Afghan policemen arrive at the site of a suicide blast near Iraq's embassy in Kabul on July 31, 2017. \nA bomb hidden in an ambulance killed at least 95 people and wounded about 158 in the Afghan capital, Kabul, on Saturday when it blew up at a police checkpoint. \nIt came just days after a deadly attack on one of the most prominent hotels in the city. \nThe Taliban claimed responsibility for Saturday's suicide blast. They also claimed the attack on the Intercontinental Hotel a week earlier in which more than 20 people were killed. \nAn interior ministry spokesman blamed the Haqqani network, a militant group affiliated with the Taliban which Afghan and Western officials consider to be behind many of the biggest attacks on urban targets in Afghanistan. \nHours after the blast, a health ministry spokesman said the casualty toll had risen to at least 95 killed and 158 wounded. \nAs medical teams struggled to handle the casualties pouring in, some of the wounded were laid out in the open, with intravenous drips set up next to them in hospital gardens. \n\"It's a massacre,\" said Dejan Panic, coordinator in Afghanistan for the Italian aid group Emergency, which runs a nearby trauma hospital that treated dozens of wounded. \nThe latest attack will add pressure on President Ashraf Ghani and his U.S. allies, who have expressed growing confidence that a new more aggressive military strategy has succeeded in driving Taliban insurgents back from major provincial centers. \nThe United States has stepped up its assistance to Afghan security forces and increased its air strikes against the Taliban and other militant groups, aiming to break a stalemate and force the insurgents to the negotiating table. \nHowever, the Taliban have dismissed suggestions they have been weakened by the new strategy, and the past week has shown their capacity to mount deadly, high-profile attacks is undiminished, even in the heavily protected center of Kabul. \nThe U.S.-led international force in Afghanistan vowed its support for the Afghan government and armed forces in their \"difficult and dangerous work\", adding that none of its members had been killed or wounded in the blast. Ambulance at checkpoint \nMirwais Yasini, a member of parliament who was nearby when the explosion occurred, said an ambulance approached the checkpoint and blew up. The target was apparently an interior ministry building nearby. \nBuildings hundreds of meters away were shaken by the force of the blast, which left torn bodies strewn on the street amid piles of rubble, debris and wrecked cars. \nSaturday is a working day in Afghanistan and the streets were full when the blast went off at around lunchtime in a busy part of the city near a number of foreign embassies and government buildings. \nThe casualty toll is the worst since 150 people were killed in a truck bomb explosion last May near the German embassy, not far from Saturday's blast, an attack that prompted a major reinforcement of security in the city. \nWith much of central Kabul now a heavily fortified zone of high concrete blast walls and police checkpoints, there were angry questions about how the bomber had been able to get through and set off the blast. \nPeople helped walking-wounded away as ambulances with sirens wailing inched their way through the traffic-clogged streets of the city center. \n\"I was sitting in the office when the explosion went off,\" said Alam, an office worker whose head was badly cut in the blast. \n\"All the windows shattered, the building collapsed and everything came down.\" \nThe Swedish and Dutch embassies as well as the European Union mission and an Indian consular office are also nearby but there were no reports that any of their staff had been hurt in the attack.", "external_links": [], "published": "2018-01-27T17:30:00.000+02:00", "crawled": "2018-01-27T16:32:47.000+02:00", "highlightTitle": ""}