{"organizations": [], "uuid": "c2aa56d23d3a0b853e0dc30a643d377109302e82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-apollo-commercial-real-estate-finance-inc-announces-dates-for-fourth-quarter-and-full-year-2017-earnings-release-and.html", "country": "US", "domain_rank": 767, "title": "Apollo Commercial Real Estate Finance, Inc. Announces Dates for Fourth Quarter and Full Year 2017 Earnings Release and Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-17T17:00:00.000+02:00", "replies_count": 0, "uuid": "c2aa56d23d3a0b853e0dc30a643d377109302e82"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-apollo-commercial-real-estate-finance-inc-announces-dates-for-fourth-quarter-and-full-year-2017-earnings-release-and.html", "ord_in_thread": 0, "title": "Apollo Commercial Real Estate Finance, Inc. Announces Dates for Fourth Quarter and Full Year 2017 Earnings Release and Conference Call", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "apollo commercial real estate finance, inc.", "sentiment": "neutral"}, {"name": "apollo commercial real estate finance, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Apollo Commercial Real Estate Finance, Inc. (the “Company” or “ARI”) (NYSE:ARI), today announced the Company will hold a conference call to review its fourth quarter and full year 2017 financial results on Thursday, February 15, 2018 at 10:00 a.m. Eastern Time. The Company’s fourth quarter and full year 2017 financial results will be released after the market closes on Wednesday, February 14, 2018. During the conference call, Company officers will review fourth quarter and full year 2017 performance, discuss recent events and conduct a question-and-answer period.\nTeleconference Details:\nMembers of the public who are interested in participating in the Company’s fourth quarter and full year 2017 earnings teleconference call should dial from the U.S., (877) 331-6553, or from outside the U.S., (760) 666-3769, shortly before 10:00 a.m. and reference the Apollo Commercial Real Estate Finance, Inc. Teleconference Call (number 1280376). Please note the teleconference call will be available for replay beginning at 1:00 p.m. on Thursday, February 15, 2018 and ending at midnight on Thursday, February 22, 2018. To access the replay, callers from the U.S. should dial (855) 859-2056 and callers from outside the U.S. should dial (404) 537-3406, and enter conference identification number 1280376.\nWebcast:\nThe conference call will also be available on the Company's website at www.apolloreit.com . To listen to a live broadcast, please go to the site at least 15 minutes prior to the scheduled start time in order to register, download and install any necessary audio software. A replay of the call will also be available for 30 days on the Company's website.\nAbout Apollo Commercial Real Estate Finance, Inc.\nApollo Commercial Real Estate Finance, Inc. (NYSE: ARI) is a real estate investment trust that primarily originates, invests in, acquires and manages performing commercial real estate first mortgage loans, subordinate financings, and other commercial real estate-related debt investments. The Company is externally managed and advised by ACREFI Management, LLC, a Delaware limited liability company and an indirect subsidiary of Apollo Global Management, LLC, a leading global alternative investment manager with approximately $242 billion of assets under management as of September 30, 2017.\nAdditional information can be found on the Company's website at www.apolloreit.com .\nForward-Looking Statements\nCertain statements contained in this press release constitute forward-looking statements as such term is defined in Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and such statements are intended to be covered by the safe harbor provided by the same. Forward-looking statements are subject to substantial risks and uncertainties, many of which are difficult to predict and are generally beyond the Company's control. These forward-looking statements include information about possible or assumed future results of the Company's business, financial condition, liquidity, results of operations, plans and objectives. When used in this release, the words \"believe,\" \"expect,\" \"anticipate,\" \"estimate,\" \"plan,\" \"continue,\" \"intend,\" \"should,\" \"may\" or similar expressions are intended to identify forward-looking statements. Statements regarding the following subjects, among others, may be forward-looking: the return on equity; the yield on investments; the ability to borrow to finance assets; and risks associated with investing in real estate assets, including changes in business conditions and the general economy. For a further list and description of such risks and uncertainties, see the reports filed by the Company with the Securities and Exchange Commission. The forward-looking statements, and other risks, uncertainties and factors are based on the Company's beliefs, assumptions and expectations of its future performance, taking into account all information currently available to the Company. Forward-looking statements are not predictions of future events. The Company disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005148/en/\nApollo Commercial Real Estate Finance, Inc.\nHilary Ginsberg, 212-822-0767\nSource: Apollo Commercial Real Estate Finance, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.apolloreit.com&esheet=51744033&newsitemid=20180117005148&lan=en-US&anchor=www.apolloreit.com&index=2&md5=1f1324d5dc22d3349c5f36d38862686d", "http://www.businesswire.com/news/home/20180117005148/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.apolloreit.com&esheet=51744033&newsitemid=20180117005148&lan=en-US&anchor=www.apolloreit.com&index=1&md5=82613b96e4fdd9cf5fa3a2501bf56310"], "published": "2018-01-17T17:00:00.000+02:00", "crawled": "2018-01-17T19:01:39.004+02:00", "highlightTitle": ""}