{"organizations": [], "uuid": "4e93f026985089ec840eb9130d33f7b7d633300e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224108738&w=1200&r=LYNXMPEE0L0PO", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/us-britain-eu-oneill/uk-economy-will-cope-with-brexit-hit-as-global-economy-grows-oneill-idUKKBN1FB11T", "country": "US", "domain_rank": 408, "title": "UK economy will cope with Brexit hit as global economy grows - O'Neill", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T11:42:00.000+02:00", "replies_count": 0, "uuid": "4e93f026985089ec840eb9130d33f7b7d633300e"}, "author": "", "url": "https://uk.reuters.com/article/us-britain-eu-oneill/uk-economy-will-cope-with-brexit-hit-as-global-economy-grows-oneill-idUKKBN1FB11T", "ord_in_thread": 0, "title": "UK economy will cope with Brexit hit as global economy grows - O'Neill", "locations": [], "entities": {"persons": [{"name": "o'neill", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "jim o‘neill", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "o'neill reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 9:57 AM / Updated 7 hours ago UK economy will cope with Brexit hit as global economy grows: O'Neill Reuters Staff 3   Britain’s economy is likely to do better in 2018 than many forecasts suggest and the benefits of global growth in the coming years will “easily dwarf” any hit from leaving the European Union, former Goldman Sachs economist Jim O‘Neill said. \nO‘Neill, a former Treasury minister who backed staying in the EU before the 2016 referendum, told BBC radio that Brexit was a “weird thing for the UK to impose on itself” but it was not the country’s biggest issue. \n“I certainly wouldn’t have thought the UK economy would be as robust as it currently seems,” O‘Neill, who also previously worked for Goldman Sachs, told the BBC. \n”That is because it looks to me some parts of the country, led by the northwest (of England), are actually doing way better than people seem to realise or appreciate. \n“As well as this crucial fact, the rest of the world is doing way better than many people would have thought a year ago, so it makes it easier for the UK.” \nBritain’s economy, the world’s sixth-biggest, looks set to have slowed only slightly in 2017 when it probably grew around 1.8 percent, according to economists. \nHigher inflation caused by the pound’s fall after the Brexit vote has pinched consumer spending power and many firms are wary about what Brexit means for them. \nWhile growth has been less impacted by Brexit than many economists forecast, Britain has grown more slowly than other rich nations. \nThe Bank of England has forecast growth for the UK of 1.6 percent in 2018, but O‘Neill predicted stronger expansion as he expected global GDP growth of at least 4 percent. \nA report this month by Cambridge Econometrics, an economics consultancy, suggested Britain’s economy could be as much as 3 percent smaller by 2030 than it would be if Britain left the EU with no transition or trade deal. \n“If that’s the worst that Brexit will deliver, then I wouldn’t worry about it,” O‘Neill told the BBC in an interview aired on Monday. \n”Now, my own view is if we go for a really hard Brexit or a no-deal Brexit, we’ll probably suffer more than that 3 percent. \n“But if it is only 3 percent, what’s going on with the rest of the world - helping us - and with productivity improving, that will easily dwarf a 3 percent hit over 13 years, easily.” \nHe said key sectors such as car production and pharmaceuticals still faced threats because of the government’s plan to leave the customs union and the single market. Reporting by Michael Holden; Editing by William Schomberg", "external_links": [], "published": "2018-01-22T11:42:00.000+02:00", "crawled": "2018-01-22T12:00:33.004+02:00", "highlightTitle": ""}