{"organizations": [], "uuid": "0c36c33b0beaeb8f8284ef12d9927a559450f86e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-cambodia-crime/cambodia-charges-10-foreigners-for-producing-porn-over-dance-party-idUSKBN1FJ0QV", "country": "US", "domain_rank": 408, "title": "Cambodia charges 10 foreigners for producing porn over dance party", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T09:10:00.000+02:00", "replies_count": 0, "uuid": "0c36c33b0beaeb8f8284ef12d9927a559450f86e"}, "author": "", "url": "https://www.reuters.com/article/us-cambodia-crime/cambodia-charges-10-foreigners-for-producing-porn-over-dance-party-idUSKBN1FJ0QV", "ord_in_thread": 0, "title": "Cambodia charges 10 foreigners for producing porn over dance party", "locations": [], "entities": {"persons": [{"name": "chan thul", "sentiment": "none"}, {"name": "sourng sophea", "sentiment": "none"}, {"name": "keut vannareth", "sentiment": "none"}], "locations": [{"name": "cambodia", "sentiment": "none"}, {"name": "siem reap province", "sentiment": "none"}], "organizations": [{"name": "siem reap provincial court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 12 AM / Updated 2 minutes ago Cambodia charges 10 foreigners for producing porn over dance party Prak Chan Thul 3 Min Read \nPHNOM PENH (Reuters) - A Cambodian judge is investigating whether to pursue pornography charges against 10 foreigners arrested after organizing a party which featured indecent dancing, a prosecutor said on Tuesday. \nThe 10 were arrested on Jan. 25 along with 77 other foreigners in a raid on the “Pub Crawl or Let’s Get Wet” event in Siem Reap province, home to the ancient Angkor Wat ruins. \nSiem Reap Provincial Court Prosecutor Keut Vannareth told Reuters the 10 had been charged provisionally on Monday with producing pornography for their role in organizing the party and the case had been sent to the investigating judge on Tuesday. \nThe other 77 foreigners arrested were freed after being educated about their unacceptable behavior. \nThose charged are five Britons, one Dutch citizen, two Canadians, a New Zealander and a Norwegian, according to Sourng Sophea, an attorney for the group. In his three-page submission to the court, the lawyer said the partygoers had not been naked. \n“When police arrived, they were wearing underwear and bras as they drank,” Sourng Sophea told Reuters, adding that they could face between one month and one year in prison if convicted. \n“The charge of producing pornography is a little too harsh,” he said. “Now, they are in prison and this is too much.” \nHe said the accused had not published any pictures of the event and had committed no crime. \nProsecutor Keut Vannareth declined further comment. \nCambodia has been become a favorite with backpackers and budget travelers over the past decade, but has more recently begun to establish itself as more of a luxury destination. \nAngkor Wat is Cambodia’s top tourist attraction. The ancient temple complex holds a special place in the country’s history as the former capital of the Khmer Empire and visitors are told to behave with respect at the site. \nTourism Minister Thong Khon said he supported the arrests of the tourists. \n“The law bans this kind of thing and maybe they were warned in advance,” he said. “Siem Reap is a heritage site.” Reporting by Prak Chan Thul; Editing by Simon Cameron-Moore", "external_links": [], "published": "2018-01-30T09:10:00.000+02:00", "crawled": "2018-01-30T09:19:04.001+02:00", "highlightTitle": ""}