{"organizations": [], "uuid": "faa7932f90f3452bd771625343dca5a30f9f3a45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/07/104696458-GettyImages-520721578-patrick-harker.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/05/feds-harker-pushes-for-only-two-rate-hikes-in-2018.html", "country": "US", "domain_rank": 767, "title": "Fed's Harker pushes for only two rate hikes in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T18:16:00.000+02:00", "replies_count": 0, "uuid": "faa7932f90f3452bd771625343dca5a30f9f3a45"}, "author": "Jeff Cox", "url": "https://www.cnbc.com/2018/01/05/feds-harker-pushes-for-only-two-rate-hikes-in-2018.html", "ord_in_thread": 0, "title": "Fed's Harker pushes for only two rate hikes in 2018", "locations": [], "entities": {"persons": [{"name": "harker", "sentiment": "negative"}, {"name": "patrick harker", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "philadelphia fed", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "negative"}, {"name": "federal open market committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Federal Reserve officials should ease up on expectations for rate hikes this year, Philadelphia Fed President Patrick Harker said in a speech Friday.\nWith the central bank poised to raise its interest rate target three times in 2018, Harker instead suggested that with inflation running low, the Fed ought to consider a slower pace until prices catch up.\n\"Domestically, I expect inflation will run a bit above target in 2019 and come down to target the following year, but I am more hesitant in this view than I am on economic activity. If soft inflation persists, it may pose a significant problem,\" Harker told an audience in Philadelphia, according to prepared remarks. \"For that reason, my own view is that two rate increases are likely to be appropriate for 2018.\"\nHarker moves to the sidelines this year and will not be a voting member on the policymaking Federal Open Market Committee. He will, however, continue to have input at committee meetings.\nHarker most recently voted to hike the Fed's benchmark funds rate a quarter point at the December meeting, the third move in 2017 and the fifth since the central bank began a normalization process in December 2015. The Fed held its rate at near zero for seven years after the financial crisis.\nIn addition to re-evaluating the pace of rate increases, Harker also revealed that he is one of the committee members who favors the Fed examining the methods it is using to achieve its dual mandate of full employment and price stability.\nThe Fed has been vexed by the economy's inability to generate significant inflation pressures, particularly when it comes to wages. Policymakers consider 2 percent to be a healthy inflation level that indicates a growing economy.\nHarker said it's time to consider whether the sub-2 percent readings are part of a longer-term pattern in which the Fed fails to meet its goals.\n\"In that scenario, inflation expectations could trend down, making it even more difficult to meet our target. It may, therefore, be time to re-evaluate the way we conduct policy,\" he said. \"I should be clear that I'm not pushing for any changes, nor do I have any particular change I would prefer.\nBut it is a question for the profession itself, and we do need people thinking about this.\"\nAmong the alternatives he cited are targeting either inflation or price levels or using \"asymmetric loss functions,\" a statistical term that would allow the Fed to overshoot its goals.\nWATCH: Why the Fed remains vexed by the lack of inflation .\nshow chapters Fed still not sure what's going on with inflation: Janus Henderson 2:52 AM ET Thu, 4 Jan 2018 | 03:14", "external_links": [], "published": "2018-01-05T18:16:00.000+02:00", "crawled": "2018-01-05T17:33:03.008+02:00", "highlightTitle": ""}