{"organizations": [], "uuid": "caf4d70a48386a8e1b33f1e2b4d39aa1bbec8681", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/01/11/100373324-GettyImages-115727478.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/delta-air-lines-stock-could-soar-in-2018-says-millertabak-analyst.html", "country": "US", "domain_rank": 767, "title": "Delta Air Lines stock could soar in 2018, says MillerTabak analyst", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.958, "site_type": "news", "published": "2018-01-11T20:14:00.000+02:00", "replies_count": 0, "uuid": "caf4d70a48386a8e1b33f1e2b4d39aa1bbec8681"}, "author": "Keris Lahiff", "url": "https://www.cnbc.com/2018/01/11/delta-air-lines-stock-could-soar-in-2018-says-millertabak-analyst.html", "ord_in_thread": 0, "title": "Delta Air Lines stock could soar in 2018, says MillerTabak analyst", "locations": [], "entities": {"persons": [{"name": "matt maley", "sentiment": "none"}, {"name": "maley", "sentiment": "none"}], "locations": [], "organizations": [{"name": "delta air lines", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "miller tabak", "sentiment": "none"}, {"name": "delta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "22 Hours Ago | 01:35 \nAirline stocks are taking off, and there's one name in the space poised to reach new highs, according to Miller Tabak equity strategist Matt Maley . \nThe rally among airline stocks stretched into day two on Thursday after Delta beat earnings estimates and upped its forecasts , a good sign for the rest of the group. \nFor Maley, the best bet in the group is star of the day Delta, the nation's second-largest airline company by sales. Maley reiterated confidence in his assessment following Thursday's fourth-quarter earnings report. \n\"Today's announce is taking [it] back above those December highs. ... This is the type of action that should confirm that DAL is finally going to break away from that $51 resistance level in a meaningful way,\" Maley wrote in an email to CNBC's \"Trading Nation\" team on Thursday. \nAccording to Maley, the break above $51 is a strong positive for what he's calling \"the best in breed\" in the airlines group. Early-year gains show positive momentum after Delta underperformed the market last year. The airline posted a 14 percent increase in 2017, trailing the S&P 500 's 20 percent gain. \nDelta's quarterly performance and an update on traffic numbers from American Airlines and United Continental on Wednesday have lifted the group mostly higher for the year. Delta has risen nearly 3 percent, American 5 percent and United 10 percent in 2018. \nDelta should see healthy gains even in the face of higher oil prices, a factor often seen by traders as a weight on airline earnings. Crude has surged so far this year, reaching its highest level on Thursday since December 2014. \n\"Investors need to ignore the age-old theory on Wall Street that higher oil prices are negative for airlines,\" said Maley. \"Almost all airlines hedge their fuel costs in the commodities markets. … Also, when oil prices are moving higher, it usually means that the economy is improving and an improving economy is good for airlines.\" \nBeyond the fourth quarter, airlines stocks should see sharp year-over-year earnings growth in 2018 that should continue through to 2020, likely tied to higher domestic supply and increased capacity. This year's return to gains marks a rebound from a steep decline in profits from 2015 to 2017.", "external_links": [], "published": "2018-01-11T20:14:00.000+02:00", "crawled": "2018-01-11T20:14:31.040+02:00", "highlightTitle": ""}