{"organizations": [], "uuid": "9e95a0c75a56b119bf9a8553a83041b6e66af50a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-microsoft-chairman-former-ceo-and-chairman-of-motorola-and-original-oracle-technologist-join-storone-advisory-board.html", "country": "US", "domain_rank": 767, "title": "Microsoft Chairman, Former CEO and Chairman of Motorola and Original Oracle Technologist Join StorONE Advisory Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T16:00:00.000+02:00", "replies_count": 0, "uuid": "9e95a0c75a56b119bf9a8553a83041b6e66af50a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-microsoft-chairman-former-ceo-and-chairman-of-motorola-and-original-oracle-technologist-join-storone-advisory-board.html", "ord_in_thread": 0, "title": "Microsoft Chairman, Former CEO and Chairman of Motorola and Original Oracle Technologist Join StorONE Advisory Board", "locations": [], "entities": {"persons": [{"name": "kirk bradley", "sentiment": "none"}, {"name": "ed zander", "sentiment": "none"}, {"name": "john thompson", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "motorola", "sentiment": "negative"}, {"name": "microsoft", "sentiment": "negative"}, {"name": "storone advisory board", "sentiment": "negative"}, {"name": "oracle executive technical advisor", "sentiment": "none"}, {"name": "advisory board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 30, 2018 /PRNewswire/ -- StorONE, which recently launched its market disruptive TRU (Total Resource Utilization) storage, today announced its Advisory Board. Comprised of technologists and industry heavyweights, the board has been selected to guide and accelerate the growth of the company.\nAmong the advisory board members are Microsoft Chairman John Thompson; former CEO and Chairman of Motorola, Ed Zander; and Oracle Executive Technical Advisor, Kirk Bradley, with others to be announced soon.\nStorONE was developed to provide a software solution that achieves the most cost effective results for customers, while significantly reducing the amount of hardware needed to achieve the performance and capacity results critical in the storage market. StorONE is set to disrupt the storage industry by bringing enterprise class storage to the market with what other vendors only promise – a complete storage solution for less than $.01/GB.\n\"We have been working diligently developing and perfecting the industry's most efficient storage software with the insight and knowledge procured from all the members of our Advisory Board,\" said CEO and co-founder Gal Naor. \"Ed, John and Kirk have been instrumental in helping define our business focus and our holistic approach centered on software algorithms rather than hardware engineering. Their expertise in building large and successful companies for the long term is in line with our plans for StorONE and we are pleased to have them on our board.\"\nJohn Thompson took over as Chairman of Microsoft from Bill Gates in 2014 after having served as an independent member of the board for two years. He also holds board memberships with Seagate Technology, Teach for America, Illumio and Liquid Robotics, among others. He previously served as CEO for Symantec after a 28-year career with IBM Corporation. Thompson is also among the individual stakeholders making a personal investment in StorONE.\n\"When investing in and guiding technology companies, what intrigues me the most are companies that have a revolutionary approach to overcoming common problems faced by organizations rather than those with solutions that only fix problems current solutions have failed to address,\" said Thompson. \"StorONE is just such a company with an algorithmic take on efficiency that renders problems of high capacity and high performance yesterday's concerns.\"\nWith nearly four decades of experience in the technology market, Ed Zander has been at the forefront of several major paradigm shifts in the industry. As CEO and Chairman of the Board of Motorola, he helped make the Motorola RAZR one of the best-selling cell phones in history while delivering 12 straight quarters of revenue growth. During his 15 years as President and COO at Sun Microsystems, Zander established the company as the premiere supplier of network software infrastructure. Zander is also an individual stakeholder in StorONE.\n\"The tech industry has seen many companies come out of stealth with a kernel of an idea and a general roadmap of where to go, but too many fail to properly develop and implement their vision,\" said Zander. \"With a management team experienced in launching revolutionary technology the StorONE software will solve industry issues today and well into the future. I look forward to working as part of the board in bringing this revolutionary approach to the mass market.\"\nKirk Bradley is one of the original technologists and among the longest serving employees of Oracle. In 1981, he joined Oracle Corporation as a Member of the technical staff and for most of his tenure has and serves as an internal consultant for the On Demand (Cloud Services) offering. He has extensive knowledge of systems architecture and strategies.\n\"The StorONE team is out to solve a set of modern data center storage problems. They have a great take on what it takes to handle large workloads and large data stores and do it all at extremely low cost,\" said Bradley.\nFollow us in Twitter: https://twitter.com/storone_inc\nFollow us on LinkedIn: https://www.linkedin.com/company/storone/\nAbout StorONE\nFounded by proven disruptive serial entrepreneurs and backed by top-tier industry luminaries and strategic investors, StorONE is a different kind of storage company. StorONE is the first to offer enterprise-class storage at less than $0.01 per GB. With more than 50 patents awarded in its first six years of deep technical development, StorONE has reimagined the fundamental nature of traditional storage software to deliver a solution that not only meets the standard requirements of capacity and performance but provides superior results across other factors as well, such as cost, convenience, control and completeness. StorONE is headquartered in New York, with offices in Dallas, Tel Aviv and Singapore. Additional information about StorONE is available at https://www.storone.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/microsoft-chairman-former-ceo-and-chairman-of-motorola-and-original-oracle-technologist-join-storone-advisory-board-300590038.html\nSOURCE StorONE", "external_links": ["http://www.prnewswire.com/news-releases/microsoft-chairman-former-ceo-and-chairman-of-motorola-and-original-oracle-technologist-join-storone-advisory-board-300590038.html", "https://twitter.com/storone_inc", "http://www.storone.com/", "https://www.storone.com/", "https://www.linkedin.com/company/storone/"], "published": "2018-01-30T16:00:00.000+02:00", "crawled": "2018-01-30T17:48:28.006+02:00", "highlightTitle": ""}