{"organizations": [], "uuid": "72a3408ce0306575dadd56a91917305fde587c5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-green-generation-solutions-adds-senior-advisors-to-public-sector-team-former-iowa-governor-chet-culver-and-lighting.html", "country": "US", "domain_rank": 767, "title": "Green Generation Solutions Adds Senior Advisors to Public Sector Team: Former Iowa Governor Chet Culver and Lighting Executive John Pouland", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T22:53:00.000+02:00", "replies_count": 0, "uuid": "72a3408ce0306575dadd56a91917305fde587c5c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-green-generation-solutions-adds-senior-advisors-to-public-sector-team-former-iowa-governor-chet-culver-and-lighting.html", "ord_in_thread": 0, "title": "Green Generation Solutions Adds Senior Advisors to Public Sector Team: Former Iowa Governor Chet Culver and Lighting Executive John Pouland", "locations": [], "entities": {"persons": [{"name": "green genera", "sentiment": "neutral"}, {"name": "john pouland", "sentiment": "neutral"}, {"name": "chet culver", "sentiment": "neutral"}, {"name": "brad dockser", "sentiment": "none"}, {"name": "chet", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "greengen", "sentiment": "none"}], "locations": [{"name": "iowa", "sentiment": "none"}, {"name": "md.", "sentiment": "none"}, {"name": "bethesda", "sentiment": "none"}], "organizations": [{"name": "green generation solutions", "sentiment": "neutral"}, {"name": "iowa power fund", "sentiment": "none"}, {"name": "iowa office of energy independence", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BETHESDA, Md.--(BUSINESS WIRE)-- The Honorable Chet Culver and John Pouland have joined Green Generation Solutions, LLC (GreenGen), a DC region-based company experienced in engineering and implementing energy efficiency solutions, as senior advisors to enhance and augment the firm’s work in the public sector.\n“Chet and John are outstanding additions to our team and will depth of experience—both industry and government—that will help GreenGen continue to grow in the public-sector space,” explained Brad Dockser, CEO, GreenGen. “We look forward to helping more government agencies realize savings from energy efficiency solutions.”\nChet Culver served as the 41st governor of Iowa from 2007 to 2011 and was instrumental in implementing the state's initiatives in sustainability and renewable energy. His signature initiatives were the creation of the Iowa Office of Energy Independence and the Iowa Power Fund, a $100 million investment by the state in public – private partnerships for renewable energy projects and job growth. The Power Fund helped turn Iowa's wind market into the nation's second largest, making Iowa a model for the country. He also served as chairman of the bipartisan Governors’ Wind Energy and Biofuels Coalitions. In 2011, Culver founded The Chet Culver Group, a renewable energy and infrastructure consultancy, where he serves as president and CEO.\n\"With his immense knowledge of the renewable energy market, Chet will have an immediate impact on our business, offering expert oversight on our expansion into states and municipalities,\" said Dockser.\nJohn Pouland works with GreenGen to develop, shape, and close ESPC and public-sector business using GSA Schedule 84 and other contract vehicles, focusing primarily on public sector facilities. Previously, Pouland was vice president of Government Affairs and Solutions, Philips Lighting where he focused on energy efficiency, including LED lighting with controls. Adoption of this technology has produced significant savings to federal agencies and reduced energy consumption in the United States. Prior to Philips, Pouland was at Siemens for eight years where he was instrumental in the development of the Schedule 84 contract vehicle and the ESPC ENABLE program based on his five years’ experience as regional administrator, Region 7, US General Services Administration and three years at Texas General Services Commission.\n“John’s formidable background in helping develop the Schedule 84 contract vehicle and his experience in both the public and private sectors will be of great benefit to us as more government agencies are seeking energy saving solutions under ESPC ENABLE as well as other state and local programs. This will allow us to scale quickly our work on the GSA Schedule,\" said Dockser.\nGreenGen has grown its business with government agencies seeking energy saving solutions under the GSA Schedule 84 ESPC ENABLE program since 2014. In the past two years, GreenGen has worked with GSA, US Forest Service, Customs and Border Protection, and the US Air Force under the ESPC ENABLE program.\nABOUT GREEN GENERATION SOLUTIONS, LLC\nFounded in 2011, GreenGen is a global energy solutions provider that engineers and implements energy efficiency solutions to lower buildings’ operating costs while improving sustainability. From offices in Washington, DC, London, and Tokyo, GreenGen helps clients improve cash flow and asset values by reducing energy-related costs via technology and operational improvements. GreenGen believes that every business can be more profitable by making energy decisions backed by comprehensive analysis, collaborative planning, and ongoing measurement of results. GreenGen offers a wide array of services, including: high efficiency lighting retrofits, HVAC optimization, building commissioning, CHP system development, “smart building” systems, and data analytics. GreenGen holds Contract # GS-07F-143BA under the GSA Schedule 84. www.greengenerationsolutions.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117006359/en/\nGreen Generation Solutions, LLC\nShawn Flaherty, 703-554-3609\nSource: Green Generation Solutions, LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fenergy.gov%2Feere%2Ffemp%2Fenergy-savings-performance-contract-enable-process-federal-projects&esheet=51744818&newsitemid=20180117006359&lan=en-US&anchor=GSA+Schedule+84+ESPC+ENABLE+program&index=2&md5=4fff66e49716b86665456b79eea70b37", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.greengenerationsolutions.com%2F&esheet=51744818&newsitemid=20180117006359&lan=en-US&anchor=www.greengenerationsolutions.com&index=4&md5=1fb590a3a4351f4fab919dbbb2773e58", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.greengenerationsolutions.com%2F&esheet=51744818&newsitemid=20180117006359&lan=en-US&anchor=Green+Generation+Solutions%2C+LLC&index=1&md5=3f2f1c63132a9d6f737467b3f8a6146d", "http://www.businesswire.com/news/home/20180117006359/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.gsaelibrary.gsa.gov%2FElibMain%2FcontractorInfo.do%3FcontractNumber%3DGS-07F-143BA%26contractorName%3DGREEN%2BGENERATION%2BSOLUTIONS%252C%2BLLC%26executeQuery%3DNO&esheet=51744818&newsitemid=20180117006359&lan=en-US&anchor=Contract+%23+GS-07F-143BA&index=3&md5=3326f51e8a47f38bf6bc2db6d8dbfc5b"], "published": "2018-01-17T22:53:00.000+02:00", "crawled": "2018-01-17T23:51:01.000+02:00", "highlightTitle": ""}