{"organizations": [], "uuid": "3a628569ee467e011c359bb8222d44156bcf31ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INformulaOne\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/myanmar-rohingya/myanmar-admission-soldiers-killed-rohingya-an-important-step-u-s-envoy-idINKBN1F01X3", "country": "US", "domain_rank": 408, "title": "Myanmar admission soldiers killed Rohingya 'an important step': U.S. envoy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:24:00.000+02:00", "replies_count": 0, "uuid": "3a628569ee467e011c359bb8222d44156bcf31ad"}, "author": "", "url": "https://in.reuters.com/article/myanmar-rohingya/myanmar-admission-soldiers-killed-rohingya-an-important-step-u-s-envoy-idINKBN1F01X3", "ord_in_thread": 0, "title": "Myanmar admission soldiers killed Rohingya 'an important step': U.S. envoy", "locations": [], "entities": {"persons": [{"name": "scot marciel", "sentiment": "none"}, {"name": "simon lewis", "sentiment": "none"}, {"name": "rohingya muslim", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "rohingya", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}], "organizations": [{"name": "min read  yangon", "sentiment": "none"}, {"name": "buddhist", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 2:25 PM / Updated 5 hours ago Myanmar admission soldiers killed Rohingya 'an important step': U.S. envoy Simon Lewis 5 Min Read \nYANGON (Reuters) - Myanmar’s admission that soldiers were involved in the murder of 10 Muslims in September was an important step and the United States hoped it would be followed by more transparency and accountability, the U.S. ambassador said on Thursday. \nThe European Union and representatives of Muslim nations renewed calls for a broader international investigation into violence in the western state of Rakhine, after the military said on Wednesday its soldiers had killed 10 captured Rohingya Muslim “terrorists” at the beginning of September. \nIt was a rare acknowledgment of wrongdoing by the Myanmar military during the operation it launched in northern Rakhine in response to Rohingya militant attacks on Aug. 25. Since then, more than 650,000 Muslim villagers have fled to Bangladesh. \n“The military’s acknowledgment that the security forces were involved in the killing of these 10 individuals is an important step,” Ambassador Scot Marciel said in a forum on media freedom with journalism students and reporters in the main city Yangon. \n“We hope it is followed up by more transparency and by holding those responsible accountable. I would stress this should be done, not as a favour to the international community, but because it’s good for the health of Myanmar’s democracy.” \nThe United States has previously said the sweeping military counteroffensive amounted to “ethnic cleansing”. Myanmar denies that, saying its forces were carrying out legitimate “clearance operations” against insurgents. MASS GRAVE \nThe military announced on Dec. 18 that a mass grave containing 10 bodies had been found at the coastal village of Inn Din, about 50 km (30 miles) north of the state capital Sittwe. The army appointed a senior officer to investigate. \nA statement from the office of the commander-in-chief on Wednesday said the military’s investigation had found that members of the security forces had killed the 10. \nThe military said legal action would be taken against members of the security forces who violated their rules of engagement in killing the 10 suspected insurgents, and against ethnic Rakhine Buddhist villagers who were also involved. \nIt said the 10 had been captured after security forces had come under attack from around 200 insurgents. \nThe captives should have been handed over to police, the army statement said, but with militants mounting continuous attacks and destroying two military vehicles, “there were no conditions to transfer the 10 Bengali terrorists to the police station and so it was decided to kill them”. \nMyanmar’s civilian leader, Aung San Suu Kyi, has no control over the military, but has faced fierce international criticism for failing to do more to protect the Rohingya. \nAsked about Wednesday’s statement from the military, her spokesman Zaw Htay said Myanmar was committed to following the rule of law and took allegations of abuses seriously. \n“The government is not issuing blanket denials of accusations of human rights violations issued by the international community,” he said. “We need to get strong and reliable evidence so that we can investigate and take action according to the law.” CALLS FOR INDEPENDENT INVESTIGATION \nThe Independent Permanent Human Rights Commission of the Organisation of Islamic Cooperation said the admission substantiated allegations made by human rights groups and the United Nations of ethnic cleansing against “the most persecuted Rohingya people”. \nThe EU and Norway said in a statement issued in Yangon that the killings at Inn Din “confirm the urgent need for a thorough and credible investigation into all violent incidents in northern Rakhine State to ensure the accountability of those found responsible for committing atrocities”. \nMyanmar’s armed forces have for decades been accused by human rights groups and Western governments of abuses in the country’s myriad ethnic conflicts, but it has been rare for soldiers to be held accountable. \nAn admission by a top general in July 2016 that soldiers had killed five villagers during an interrogation in northern Shan State was seen at the time as unprecedented. Seven soldiers were subsequently jailed for five years with hard labour. Reporting by Simon Lewis in Yangon; Additional reporting by Noah Browning in Dubai; Writing by Robert Birsel; Editing by Alex Richardson", "external_links": [], "published": "2018-01-11T16:24:00.000+02:00", "crawled": "2018-01-11T17:05:43.026+02:00", "highlightTitle": ""}