{"organizations": [], "uuid": "ccb81736af96378b9fc70f6b6fe7ca6a741366d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/08/25/102945585-GettyImages-484768968r.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/pending-home-sales-eke-out-gain-in-december-as-supply-hits-record-low.html", "country": "US", "domain_rank": 767, "title": "Pending home sales eke out gain in December as supply hits record low", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.194, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "ccb81736af96378b9fc70f6b6fe7ca6a741366d0"}, "author": "Diana Olick", "url": "https://www.cnbc.com/2018/01/31/pending-home-sales-eke-out-gain-in-december-as-supply-hits-record-low.html", "ord_in_thread": 0, "title": "Pending home sales eke out gain in December as supply hits record low", "locations": [], "entities": {"persons": [{"name": "lawrence yun", "sentiment": "none"}], "locations": [{"name": "miami", "sentiment": "none"}], "organizations": [{"name": "national association of realtors", "sentiment": "none"}, {"name": "nar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The supply crisis is hitting housing hard, as strong demand quickly eats up what few listings there are.\nHome shoppers signed 0.5 percent more contracts to buy existing homes in December compared with November, according to a monthly pending home sales index from the National Association of Realtors. This was right in line with expectations. The index was also 0.5 percent higher compared with December 2016.\n\"Jobs are plentiful, wages are finally climbing and the prospect of higher mortgage rates are perhaps encouraging more aspiring buyers to begin their search now,\" said Lawrence Yun, chief economist of the NAR. \"Sadly, these positive indicators may not lead to a stronger sales pace. Buyers throughout the country continue to be hamstrung by record low supply levels that are pushing up prices – especially at the lower end of the market.\"\nThe supply of homes for sale at the end of December fell to the lowest level since the Realtors began tracking it in 1999. While new listings are already coming on ahead of the usually busy spring market, they will not come close to meeting the pent-up demand.\nA separate survey of December's housing activity showed stronger demand from buyers but weaker contracts. The number of buyers requesting house tours from real estate brokerage Redfin was up nearly 17 percent annually, according to its monthly demand report. The number of potential buyers making offers, however, dropped about 6 percent.\n\"Buyer demand is still strong, but wilted a bit in the face of low inventory,\" said Redfin's chief economist, Nela Richardson. \"The housing market ended 2017 with 170,000 fewer listings than it had a year earlier. For the fourth consecutive year, inventory will be the major factor shaping the housing market in 2018.\"\nLow inventory is the primary driver of rising home prices, which continue to accelerate. Prices are rising fastest on the lower end of the market, where demand is strongest. Millennial demand is also increasing. This age cohort saw the biggest jump in homeownership last year, and demand from them will only increase as they age into larger salaries and bigger families.\nWhile new tax laws could put more money in their pockets, home values are now rising at three times the pace of wage growth, and mortgage interest rates are increasing as well. The best hope for housing this year is new supply.\n\"You may get some benefit from the tax bill if builders expand on the corporate side, but it is going to be offset by an increase in incomes for entry-level folks that will touch the demand side of the curve,\" said Doug Duncan, chief economist at Fannie Mae. \"We are not seeing a lot of shift in the supply-demand balance for next year making it tougher for entry-level borrowers.\"\nRegionally, pending home sales in the Northeast fell 5.1 percent monthly and were 2.7 lower annually, according to the NAR. In the Midwest, sales fell 0.3 percent monthly and were 0.3 percent higher than December 2016. Sales in the South grew 2.6 percent monthly and 4 percent annually, while sales in the West rose 1.5 percent monthly and were 3.1 percent lower annually.\nWATCH: The hidden costs of buying a home show chapters The hidden costs of buying a home 10:01 AM ET Wed, 14 Dec 2016 | 00:51", "external_links": [], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T17:01:21.009+02:00", "highlightTitle": ""}