{"organizations": [], "uuid": "788c939d86fa14755a5c5fc4be4eb4b296228388", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-changyou-reports-fourth-quarter-2017-and-fiscal-year-2017-unaudited-financial-results.html", "country": "US", "domain_rank": 767, "title": "Changyou Reports Fourth Quarter 2017 and Fiscal Year 2017 Unaudited Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-29T09:15:00.000+02:00", "replies_count": 0, "uuid": "788c939d86fa14755a5c5fc4be4eb4b296228388"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-changyou-reports-fourth-quarter-2017-and-fiscal-year-2017-unaudited-financial-results.html", "ord_in_thread": 0, "title": "Changyou Reports Fourth Quarter 2017 and Fiscal Year 2017 Unaudited Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING, Jan. 29, 2018 /PRNewswire/ -- Changyou.com Limited (\"Changyou\" or the \"Company\") (NASDAQ: CYOU), a leading online game developer and operator in China, today announced its unaudited financial results for the fourth quarter and fiscal year ended December 31, 2017.\nFourth Quarter 2017 Highlights\nTotal revenue was US$144 million, representing an increase of 11% year-over-year and a decrease of 13% quarter-over-quarter, slightly below the Company's guidance. Online game revenue was US$109 million, representing an increase of 15% year-over-year and a decrease of 17% quarter-over-quarter, slightly below the Company's guidance. GAAP net income attributable to Changyou.com Limited was US$34 million, in line with the Company's guidance. This compares with net income of US$41 million in the fourth quarter of 2016 and a net loss of US$7 million in the third quarter of 2017. Non-GAAP 1 net income attributable to Changyou.com Limited was US$34 million, slightly below the Company's guidance. This compares with net income of US$40 million in the fourth quarter of 2016 and a net loss of US$5 million in the third quarter of 2017.\nFiscal Year 2017 Highlights\nTotal revenue was US$580 million, compared with US$525 million in 2016. Online game revenue was US$450 million, compared with US$396 million in 2016. GAAP net income attributable to Changyou.com Limited was US$109 million, compared with US$145 million in 2016. Non-GAAP net income attributable to Changyou.com Limited was US$126 million, compared with US$153 million in 2016.\nMr. Dewen Chen, CEO, commented, \"After two years of continued experimentation, development and adjustments, our strategy of 'Top games, Big IP and Mass marketing' began to bear fruit in 2017. In May we launched Legacy TLBB Mobile, which set a new record for MMORPG games in its first month in terms of monthly gross billings. In 2018, we will remain focused on game quality and further invest in visual graphics, technologies and talent development. While we continue to focus on MMORPG development, we also aim to improve our R&D and product innovation capabilities in advanced casual and SLG games.\"\nMr. Qing Wei, Chief Games Development Officer added, \"Since the launch of Legacy TLBB mobile, we have issued several new expansion packs, offering users brand new content each time to maintain engagement. At the same time, we have adjusted our payment structure to suit different types of users within the game, and further enhanced social functionality to improve user experience.\"\nMr. Yaobin Wang, CFO of Changyou added, \"Total revenue and non-GAAP net income for the fourth quarter of 2017 were both slightly lower than our expectations, This was mainly because Legacy TLBB Mobile underperformed slightly in the fourth quarter and we experienced a small delay in the launch of our new mobile game 'Dao Jian Dou Shen Zhuan'. For the first quarter of 2018, we expect a seasonal downturn for TLBB PC game due to the Chinese New Year holidays. We also expect revenue from Legacy TLBB Mobile to decline, but at a slower rate than occurred during the fourth quarter of 2017.\"\n1 Non-GAAP results exclude share-based compensation expense. Explanation of the Company's non-GAAP financial measures and related reconciliations to GAAP financial measures are included in the accompanying \"Non-GAAP Disclosure\" and \"Reconciliations of Non-GAAP Results of Operations Measures to the Nearest Comparable GAAP Measures\".\nFourth Quarter 2017 Operational Results\nTotal average monthly active accounts 2 of the Company's PC games were 2.4 million, representing a decrease of 4% year-over-year and an increase of 4% quarter-over-quarter. The year-over-year decrease reflected the natural declining life cycles of the Company's older games, including TLBB PC, which was partially offset by the launch of the new PC game \"Man Huang Sou Shen Ji\" in the fourth quarter of 2017. Total average monthly active accounts of the Company's mobile games were 3.1 million, representing an increase of 94% year-over-year and a decrease of 40% quarter-over-quarter. The year-over-year increase was largely due to Legacy TLBB Mobile, which was launched in the second quarter of 2017. The quarter-over-quarter decrease reflected the natural declining life cycles of the Company's older games, including Legacy TLBB Mobile. Total quarterly aggregate active paying accounts 3 of the Company's PC games were 0.8 million, representing a decrease of 20% year-over-year and flat quarter-over-quarter. The year-over-year decrease reflected the natural declining life cycles of the Company's older games, including TLBB PC. Total quarterly aggregate active paying accounts of the Company's mobile games were 1.2 million, representing an increase of 200% year-over-year and a decrease of 14% quarter-over-quarter. The year-over-year increase was largely due to Legacy TLBB Mobile, which was launched in the second quarter of 2017. The quarter-over-quarter decrease for the Company's mobile games reflected the natural declining life cycles of the Company's older games, including Legacy TLBB Mobile.\n2 Average Monthly Active Accounts for a given period refers to the number of registered accounts that were logged in to these games at least once during the period.\n3 Quarterly Aggregate Active Paying Accounts for a given period refers to the number of accounts from which game points are utilized at least once during the quarter.\nFourth Quarter 2017 Unaudited Financial Results\nRevenue\nTotal revenue was US$144 million, representing an increase of 11% year-over-year and a decrease of 13% quarter-over-quarter.\nOnline game revenue was US$109 million, representing an increase of 15% year-over-year and a decrease of 17% quarter-over-quarter. The year-over-year increase was due to the revenue contribution of Legacy TLBB Mobile, which was launched in the second quarter of 2017. The quarter-over-quarter decrease was due to the natural decline in revenue of the Company's older games, including Legacy TLBB Mobile.\nOnline advertising revenue was US$6 million, representing a decrease of 26% year-over-year and an increase of 1% quarter-over-quarter. The year-over-year decrease was mainly due to fewer PC games being launched in China and our new mobile initiatives being at an early stage.\nCinema advertising revenue was US$25 million, representing an increase of 25% year-over-year and 6% quarter-over-quarter. The year-over-year increase reflected strong growth of China's movie and cinema industry in general, as well as increased customer orders that resulted from the Company's having increased advertising resources. The quarter-over-quarter increase was due to an increase in publicity in the fourth quarter of 2017.\nInternet value-added services (\"IVAS\") revenue was US$3 million, representing a decrease of 46% year-over-year and an increase of 11% quarter-over-quarter. The year-over-year decrease and the quarter-over-quarter increase reflect changes in revenue from PC internet products.\nGross profit/ (loss)\nGAAP and non-GAAP gross profit were both US$99 million, representing an increase of 10% year-over-year and a decrease of 19% quarter-over-quarter. GAAP and non-GAAP gross margin were both 68%, compared with 69% in the fourth quarter of 2016, and 73% in the third quarter of 2017.\nGAAP and non-GAAP gross profit of the online games business were both US$92 million, representing an increase of 24% year-over-year and a decrease of 20% quarter-over-quarter. GAAP and non-GAAP gross margin of the online games business were both 84%, compared with 78% in the fourth quarter of 2016 and 87% in the third quarter of 2017. The year-over-year increase in gross margin was due to Legacy TLBB Mobile, which was launched in the second quarter of 2017 and has a high gross margin, as revenue is recognized on a net basis after revenue-sharing with the third-party licensee operator.\nGAAP and non-GAAP gross profit of the online advertising business were both US$4 million, representing a decrease of 19% year-over-year and an increase of 1% quarter-over-quarter. GAAP and non-GAAP gross margin of the online advertising business were both 73%, compared with 66% in the fourth quarter of 2016 and 73% in the third quarter of 2017. The year-over-year increase in gross margin was mainly due to a decrease in salary and benefits expense as a result of a reduction in workforce.\nGAAP and non-GAAP gross profit of the cinema advertising business were both US$1 million, compared with gross profit of US$7 million in the fourth quarter of 2016 and gross profit of US$1 million in the third quarter of 2017. GAAP and non-GAAP gross margin of the cinema advertising business were both 4%, compared with 34% in the fourth quarter of 2016 and 6% in the third quarter of 2017. The year-over-year decrease in gross margin was mainly due to an increase in costs related to acquisition of more advertising resources in 2017.\nGAAP and non-GAAP gross profit of the IVAS business were both US$1 million, compared with gross profit of US$3 million in the fourth quarter of 2016 and gross profit of US$1 million in the third quarter of 2017.\nOperating expense\nTotal operating expense was US$63 million, representing an increase of 23% year-over-year and a decrease of 58% quarter-over-quarter.\nProduct development expense was US$33 million, representing an increase of 8% year-over-year and a decrease of 8% quarter-over-quarter. The year-over-year increase and quarter-over-quarter decrease reflect changes in expenses associated with the development of Legacy TLBB Mobile.\nSales and marketing expense was US$20 million, representing an increase of 66% year-over-year and 14% quarter-over-quarter. The year-over-year and quarter-over-quarter increases reflect increases in marketing and promotional spending for new games launched during the quarter.\nGeneral and administrative expense was US$11 million, representing an increase of 14% year-over-year and a decrease of 6% quarter-over-quarter. The year-over-year increase was mainly due to an increase in salary and benefits expense as a result of an increase in bonus expense. The quarter-over-quarter decrease was mainly due to a decrease in share-based compensation expense resulting from changes in the market price for the Company's ADSs in the fourth quarter of 2017 compared with the third quarter of 2017.\nOperating profit/ (loss)\nOperating profit was US$35 million, compared with operating profit of US$38 million in the fourth quarter of 2016 and an operating loss of US$30 million in the third quarter of 2017.\nNon-GAAP operating profit was US$35 million, compared with non-GAAP operating profit of US$37 million in the fourth quarter of 2016 and a non-GAAP operating loss of US$28 million in the third quarter of 2017.\nThe quarter-over-quarter change in operating profit was mainly due to impairment charges related to the MoboTap business that were recognized during the third quarter of 2017.\nOther Income, net\nOther income was US$4 million, compared with US$5 million in the fourth quarter of 2016 and US$1 million in the third quarter of 2017.\nIncome tax expense\nIncome tax expense was US$11 million, compared with income tax expense of US$9 million in the fourth quarter of 2016 and income tax expense of US$11 million in the third quarter of 2017.\nNet income/ (loss)\nNet income was US$34 million, compared with net income of US$42 million in the fourth quarter of 2016 and a net loss of US$34 million in the third quarter of 2017.\nNon-GAAP net income was US$34 million, compared with net income of US$41 million in the fourth quarter of 2016 and a net loss of US$32 million in the third quarter of 2017.\nNet income/ (loss) attributable to non-controlling interests\nGAAP and non-GAAP net loss attributable to non-controlling interests were both US$0.1 million. This compares with GAAP and non-GAAP net income of US$0.9 million in the fourth quarter of 2016, and GAAP and a non-GAAP net loss of US$27 million in the third quarter of 2017. Non-controlling interests include the non-controlling interests in RaidCall, which provides online music and entertainment services primarily in Taiwan, and in MoboTap, the developer of the Dolphin Browser. The quarter-over-quarter change was mainly due to impairment charges related to the MoboTap business that were recognized during the third quarter of 2017.\nNet income/ (loss) attributable to Changyou.com Limited\nNet income attributable to Changyou.com Limited was US$34 million, compared with net income of US$41 million in the fourth quarter of 2016 and a net loss of US$7 million in the third quarter of 2017. Fully-diluted net income attributable to Changyou.com Limited per ADS 4 was US$0.64, compared with net income of US$0.77 in the fourth quarter of 2016 and a net loss of US$0.13 in the third quarter of 2017.\nNon-GAAP net income attributable to Changyou.com Limited was US$34 million, compared with net income of US$40 million in the fourth quarter of 2016 and a net loss of US$5 million in the third quarter of 2017. Non-GAAP fully-diluted net income attributable to Changyou.com Limited per ADS was US$0.64, compared with net income of US$0.75 in the fourth quarter of 2016 and a net loss of US$0.09 in the third quarter of 2017.\n4 Each ADS represents two Class A ordinary shares.\nLiquidity\nAs of December 31, 2017, Changyou had cash and cash equivalents and short-term investments of US$978 million, compared with US$831 million as of December 31, 2016.\nOperating cash flow for the fourth quarter of 2017 was a net inflow of US$78 million.\nFiscal Year 2017 Unaudited Financial Results\nRevenue\nTotal revenue in 2017 was US$580 million, representing an increase of 10% year-over-year.\nOnline game revenue increased 14% year-over-year to US$450 million. The year-over-year increase was mainly due to the revenue contribution of Legacy TLBB Mobile, which was launched in the second quarter of 2017.\nOnline advertising revenue decreased 36% year-over-year to US$25 million. The year-over-year decrease was mainly due to fewer Web games and PC games being marketed on the 17173 Website.\nCinema advertising revenue increased 33% year-over-year to US$91 million. The year-over-year increase reflected strong growth of China's movie and cinema industry in general, as well as increased customer orders that resulted from the Company's having increased advertising resources.\nIVAS revenue decreased 35% year-over-year to US$14 million. The decrease was largely due to lower revenue from PC internet products.\nGross profit\nGAAP and non-GAAP gross profit were both US$416 million, representing an increase of 16% year-over-year. GAAP and non-GAAP gross margin were both 72%, compared with 68% in 2016.\nGAAP and non-GAAP gross profit of the online games business were both US$387 million, representing an increase of 29% year-over-year. GAAP and non-GAAP gross margin of the online games business were both 86%, compared with 76% in 2016. The increase in gross margin was due to Legacy TLBB Mobile, which was launched in the second quarter of 2017 and has a high gross margin as revenue is recognized on a net basis after revenue-sharing with the third-party licensee operator.\nGAAP and non-GAAP gross profit of the online advertising business were both US$18 million, representing a decrease of 37% year-over-year. GAAP and non-GAAP gross margin of the online advertising business were both 73%, compared with 74% in 2016.\nGAAP and non-GAAP gross profit of the cinema advertising business were both US$6 million, representing a decrease of 71% year-over-year. GAAP and non-GAAP gross margin of the cinema advertising business were both 7%, compared with 33% in 2016. The decrease in gross margin was mainly due to an increase in costs related to acquisition of more advertising resources.\nGAAP and non-GAAP gross profit of IVAS were both US$5 million, compared with a gross profit of US$8 million in 2016.\nOperating expenses\nTotal operating expenses were US$326 million, representing an increase of 43% year-over-year.\nProduct development expenses were US$131 million, representing an increase of 8% year-over-year. The increase was mainly due to an increase in expenses associated with the development of Legacy TLBB Mobile.\nSales and marketing expenses were US$61 million, representing an increase of 8% year-over-year. The increase was due to an increase in sales and marketing expense for the online game and cinema advertising business in 2017.\nGeneral and administrative expenses were US$47 million, representing a decrease of 7% year-over-year. The decrease was due to a decrease in salary and benefit expenses as a result of reduction in workforce in 2017, which was partially offset by an increase in share-based compensation expense resulting from increase in the market prices for the Company's ADSs in 2017.\nGoodwill impairment and impairment of intangible assets acquired as part of acquisition of a business was US$87 million. The impairments were mainly related to the MoboTap business, which was acquired in 2014. In the third quarter of 2015, the Company recognized an impairment charge related to the MoboTap business due to a change in the Company's strategic direction. Since then, MoboTap has focused on the development and operation of card and board games, which have been MoboTap's main source of revenue. Due to reinforced restrictions the Chinese regulatory authorities imposed on card and board games, some of the Company's key distribution partners informed the Company that they had decided to stop the distribution and promotion of card and board games in the third quarter of 2017. As a result, the Company determined that it was unlikely that MoboTap would gain users and grow its revenue in China, and accordingly further impairment charges of US$87 million were recognized to reflect the fair value of the MoboTap business in the third quarter of 2017.\nOperating profit\nOperating profit was US$90 million, compared with an operating profit of US$131 million in 2016.\nNon-GAAP operating profit was US$108 million, compared with an operating profit of US$139 million in 2016.\nThe year-over-year change in operating profit was mainly due to impairment charges related to the MoboTap business that were recognized during the third quarter of 2017.\nOther Income, net\nOther income was US$9 million, compared with US$16 million in 2016.\nIncome tax expense\nIncome tax expense was US$41 million in 2017, compared with US$22 million in 2016.\nNet income\nNet income was US$82 million, compared with net income of US$147 million in 2016.\nNon-GAAP income was US$99 million, compared with non-GAAP net income of US$155 million in 2016.\nNet income/ (loss) attributable to non-controlling interests\nBoth GAAP and non-GAAP net loss attributable to non-controlling interests were US$27 million, compared with net income of US$2 million in 2016. Non-controlling interests include the non-controlling interests in RaidCall, which provides online music and entertainment services primarily in Taiwan, and in MoboTap, the developer of the Dolphin Browser. The year-over-year change was mainly due to impairment charges related to the MoboTap business that were recognized during the third quarter of 2017.\nNet income attributable to Changyou.com Limited\nNet income attributable to Changyou.com Limited was US$109 million, compared with US$145 million in 2016. Fully-diluted net income attributable to Changyou.com Limited per ADS was US$2.04, compared with US$2.72 in 2016.\nNon-GAAP net income attributable to Changyou.com Limited was US$126 million, compared with US$153 million in 2016. Non-GAAP fully-diluted net income attributable to Changyou.com Limited per ADS was US$2.36, compared with US$2.85 in 2016.\nBusiness Outlook\nFor the first quarter of 2018, Changyou expects:\nTotal revenue to be between US$120 million and US$130 million, including online game revenue of US$90 million to US$100 million; Non-GAAP net income attributable to Chanyou.com Limited to be between US$25 million and US$30 million, and non-GAAP income per fully-diluted ADS to be between US$0.47 and US$0.56. Share based compensation to be around US$2 million, assuming no new grants of share-based awards and that the market price of Changyou's ADSs is unchanged. Taking into account the elimination of the impact of these share-based awards, GAAP net income attributable to Changyou.com to be between US $ 23 million and US $ 28 million, and GAAP income per fully-diluted ADS to be between US $ 0.43 and US $0. 52 .\nFor the first quarter 2018 guidance, the Company has adopted a presumed exchange rate of RMB6.60 = US$1.00, as compared with the actual exchange rate of approximately RMB6.88 = US$1.00 for the first quarter 2017, and RMB6.61=US$1.00 for the fourth quarter 2017.\nLoan Agreement and Share Pledge Agreement with Sohu.com Inc. (\"Sohu\")\nOn October 24, 2016, Changyou entered into a loan agreement with a PRC subsidiary of Sohu, Changyou's parent company, pursuant to which the PRC subsidiary is entitled to borrow up to RMB1 billion (or approximately US$148.64 million) from a PRC subsidiary of Changyou from time to time, with the first advance request to occur prior to December 31, 2016 and Sohu's right to request advances continuing for one year after the first advance, subject to extension for an additional year with Changyou's consent. Principal amounts outstanding under the loan agreement bear interest at an annual rate of 6%, accruing and payable on each one-year anniversary of each advance. The outstanding principal of each advance is due one year from the date of the advance, subject to extension for an additional year with Changyou's consent. Advances under the loan agreement are secured by a pledge to Changyou under a share pledge agreement of an agreed-upon number of Class B ordinary shares of Changyou held by Sohu. The share pledge agreement gives Changyou the right to apply the outstanding principal and accrued interest on the loan to the repurchase of Changyou Class B ordinary shares from Sohu in the event such principal and interest are not paid when due. Sohu has used amounts drawn down under the loan agreement to finance Sohu's operations, excluding the operations of Changyou and of Sohu's subsidiary Sogou.\nAs of December 31, 2017, Sohu had borrowed from Changyou the full RMB1 billion available under the loan agreement. Changyou has agreed to extend the agreement by another year, and all other conditions related to the borrowing are unchanged.\nNon-GAAP Disclosure\nTo supplement the unaudited consolidated financial information prepared in accordance with generally accepted accounting principles in the United States of America (\"GAAP\"), Changyou's management uses non-GAAP measures of gross profit, operating profit, net income, net income attributable to Changyou.com Limited and diluted net income attributable to Changyou.com Limited per ADS, which are adjusted from results based on GAAP to exclude the compensation cost of share-based awards granted, non-cash tax benefits from excess tax deductions related to share-based awards and income/expense from the adjustment of contingent consideration previously recorded for acquisitions. These measures should be considered in addition to results prepared in accordance with GAAP, but should not be considered a substitute for, or superior to, GAAP results.\nChangyou's management believes that excluding share-based compensation expense, non-cash tax benefits from excess tax deductions related to share-based awards and income/expense from the adjustment of contingent consideration previously recorded for acquisitions from its non-GAAP financial measures is useful for itself and investors. Further, the amount of share-based compensation expense, non-cash tax benefits from excess tax deductions related to share-based awards and income/expense from the adjustment of contingent consideration previously recorded for acquisitions cannot be anticipated by management, and these expenses are not built into the Company's annual budgets and quarterly forecasts, which generally will be the basis for information Changyou provides to analysts and investors as guidance for future operating performance. As share-based compensation expense, non-cash tax benefits from excess tax deductions related to share-based awards and income/expense from the adjustment of contingent consideration previously recorded for acquisitions do not involve subsequent cash outflow, Changyou does not factor these in when evaluating and approving expenditures or when determining the allocation of its resources to its business operations. As a result, in general, the monthly financial results for internal reporting and any performance measure for commissions and bonuses are based on non-GAAP financial measures that exclude share-based compensation expense, non-cash tax benefits from excess tax deductions related to share-based awards and income/expense from the adjustment of contingent consideration previously recorded for acquisitions.\nThe non-GAAP financial measures are provided to enhance investors' overall understanding of Changyou's current financial performance and prospects for the future. A limitation of using non-GAAP gross profit, operating profit, net income, net income attributable to Changyou.com Limited and diluted net income attributable to Changyou.com Limited per ADS, excluding share-based compensation expense, non-cash tax benefits from excess tax deductions related to share-based awards and income/expense from the adjustment of contingent consideration previously recorded for acquisitions, is that the share-based compensation charge has been and will continue to be a significant recurring expense in the Company's business for the foreseeable future, non-cash tax benefits from excess tax deductions related to share-based awards and income/expense from the adjustment of contingent consideration previously recorded for acquisitions may recur in the future. In order to mitigate these limitations the Company has provided specific information regarding the GAAP amounts excluded from each non-GAAP measure. The accompanying tables include details on the reconciliation between GAAP financial measures that are most directly comparable to the non-GAAP financial measures the Company has presented.\nNotes to Financial Information\nFinancial information in this press release other than the information indicated as being non-GAAP is derived from Changyou's unaudited financial statements prepared in accordance with GAAP.\nSafe Harbor Statement\nIt is currently expected that the Business Outlook will not be updated until the release of Changyou's next quarterly earnings announcement; however, Changyou reserves the right to update its Business Outlook at any time for any reason.\nThis announcement contains forward-looking statements. Statements that are not historical facts, including statements about the Company's beliefs and expectations, are forward-looking statements. These statements are based on current plans, estimates and projections, and therefore you should not place undue reliance on them. Forward-looking statements involve inherent risks and uncertainties. The Company cautions that a number of important factors could cause actual results to differ materially from those contained in any forward-looking statement. Potential risks and uncertainties include, but are not limited to, continuing volatility in global financial and credit markets and its potential impact on the Chinese economy; exchange rate fluctuations in general and possible continued valuation of the RMB in particular, including their potential impact on the Chinese economy and on the Company's reported U.S. dollar results; slowing growth in the Chinese economy; the uncertain regulatory landscape in the People's Republic of China; fluctuations in Changyou's quarterly operating results; the possibility that Changyou will be unable to develop a series of successful games for mobile platforms or successfully monetize mobile games it develops or acquires; the possibility that the Company's margins will decline as a result of the need for revenue-sharing with mobile game platform operators; and the Company's reliance on TLBB as its major revenue source. Further information regarding these and other risks is included in Changyou's Annual Report on Form 20-F filed on February 27, 2017, and other filings with the Securities and Exchange Commission.\nConference Call Information\nChangyou's management team will host an earnings conference call today at 6:30 a.m. U.S. Eastern Time, January 29, 2018 (7:30 p.m. Beijing/Hong Kong, January 29, 2018).\nThe dial-in details for the live conference call are:\nUS:\n1-866-519-4004\nHong Kong:\n800-906-601\nChina Mainland:\n400-620-8038\nInternational:\n+1-845-675-0437\nPasscode:\nCYOU\nPlease dial in 10 minutes before the call is scheduled to begin and provide the passcode to join the call.\nA telephone replay of the call will be available after the conclusion of the conference call at 09: 30 a.m. Eastern Time on January 29, 2018 through February 5, 2018. The dial-in details for the telephone replay are:\nInternational:\n+61-2-8199-0299\nPasscode:\n3671479\nThe live Webcast and archive of the conference call will be available on the Investor Relations section of Changyou's Website at http://ir.changyou.com/ .\nAbout Changyou\nChangyou.com Limited (NASDAQ: CYOU) is a leading developer and operator of online games in China with a diverse portfolio of popular online games , such as Tian Long Ba Bu (\"TLBB\"), one of the most popular PC games in China, as well as a number of mobile games. Changyou also owns and operates the 17173.com Website, a leading game information portal in China. Changyou began operations as a business unit within Sohu.com Inc. (NASDAQ: SOHU) in 2003, and was carved out as a separate, stand-alone company in December 2007. It completed an initial public offering on April 7, 2009. Changyou has an advanced technology platform that includes advanced 2.5D and 3D graphics engines, a uniform game development platform, effective anti-cheating and anti-hacking technologies, proprietary cross-networking technology and advanced data protection technology. For more information, please visit http://ir.changyou.com .\nFor investor and media inquiries, please contact:\nIn China:\nChangyou.com Limited\nInvestor Relations Department\nTel: +86 (10) 6192-0800\nE-mail: ir@cyou-inc.com\nIn the United States:\nMs. Linda Bergkamp\nChristensen\nPhone: +1-480-614-3004\nEmail: lbergkamp@ChristensenIR.com\nCHANGYOU.COM LIMITED\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(UNAUDITED, IN THOUSANDS EXCEPT PER ADS AMOUNTS)\nThree Months Ended\nTwelve Months Ended\nDec. 31, 2017\nSep. 30, 2017\nDec. 31, 2016\nDec. 31, 2017\nDec. 31, 2016\nRevenue:\nOnline game\n$\n109,383\n$\n132,427\n$\n95,400\n$\n449,533\n$\n395,708\nOnline advertising\n6,131\n6,068\n8,332\n25,129\n39,409\nCinema advertising\n25,492\n23,967\n20,371\n91,419\n68,542\nIVAS\n3,452\n3,110\n6,420\n14,180\n21,726\nTotal revenue\n144,458\n165,572\n130,523\n580,261\n525,385\nCost of revenue:\nOnline game(includes share-based compensation expense\nof $1, $4, $(5), $73 and $31 respectively)\n17,097\n17,560\n20,936\n62,774\n96,171\nOnline advertising\n1,674\n1,661\n2,799\n6,660\n10,104\nCinema advertising\n24,509\n22,605\n13,452\n84,944\n45,959\nIVAS\n2,407\n2,139\n3,792\n9,408\n13,576\nTotal cost of revenue\n45,687\n43,965\n40,979\n163,786\n165,810\nGross profit\n98,771\n121,607\n89,544\n416,475\n359,575\nOperating expenses:\nProduct development (includes share-based\ncompensation expense of $69, $590, $(437),\n$6,163 and $2,881, respectively)\n33,027\n35,871\n30,516\n131,032\n121,619\nSales and marketing (includes share-based\ncompensation expense of $29, $63, $(61),\n$1,212 and$572 respectively)\n19,949\n17,530\n11,989\n60,917\n56,543\nGeneral and administrative (includes share-based\ncompensation expense of $71, $1,551, $(435),\n$9,945 and $4,918 respectively)\n10,520\n11,142\n9,222\n47,163\n50,560\nGoodwill impairment and impairment of intangible\nassets acquired as part of acquisition of a\nbusiness 5\n-\n86,882\n-\n86,882\n-\nTotal operating expenses\n63,496\n151,425\n51,727\n325,994\n228,722\nOperating profit/ (loss)\n35,275\n(29,818)\n37,817\n90,481\n130,853\nInterest income, net\n7,687\n7,811\n5,217\n27,947\n17,169\nForeign currency exchange gain/ (loss)\n(1,312)\n(1,584)\n2,747\n(5,196)\n5,108\nOther income, net\n3,940\n581\n5,463\n9,374\n15,523\nIncome/ (loss) before income tax expense\n45,590\n(23,010)\n51,244\n122,606\n168,653\nIncome tax expense\n11,489\n10,793\n9,356\n40,767\n21,583\nNet income/ (loss)\n34,101\n(33,803)\n41,888\n81,839\n147,070\nLess: Net income/(loss) attributable to non-controlling\ninterests\n(105)\n(27,029)\n869\n(26,995)\n2,123\nNet income/ (loss) attributable to Changyou.com Limited\n$\n34,206\n$\n(6,774)\n$\n41,019\n$\n108,834\n$\n144,947\nBasic net income/ (loss) attributable to Changyou.com Limited per\nADS\n$\n0.65\n$\n(0.13)\n$\n0.78\n$\n2.07\n$\n2.78\nADSs used in computing basic net income attributable to\nChangyou.com Limited per ADS\n52,709\n52,682\n52,331\n52,594\n52,280\nDiluted net income/ (loss) attributable to Changyou.com Limited\nper ADS\n$\n0.64\n$\n(0.13)\n$\n0.77\n$\n2.04\n$\n2.72\nADSs used in computing diluted net income attributable to\nChangyou.com Limited per ADS\n53,544\n52,682\n53,346\n53,285\n53,139\n5 The impairments were mainly related to the MoboTap business, which was acquired in 2014. In the third quarter of 2015, the Company recognized an impairment charge related to the MoboTap business due to a change in the Company's strategic direction. Since then, MoboTap has focused on the development and operation of card and board games, which have been MoboTap's main source of revenue. Due to reinforced restrictions the Chinese regulatory authorities imposed on card and board games, some of the Company's key distribution partners informed the Company that they had decided to stop the distribution and promotion of card and board games in the third quarter of 2017. As a result, the Company determined that it was unlikely that MoboTap would gain users and grow its revenue in China, and accordingly further impairment charges of US$87 million were recognized to reflect the fair value of the MoboTap business. The impairment charges attributable to the Changyou.com Limited were US$60 million, and the impairment charges attributable to non-controlling interests were US$27 million.\nCHANGYOU.COM LIMITED\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(UNAUDITED, IN THOUSANDS)\nAs of Dec. 31, 2017\nAs of Dec. 31, 2016\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n573,159\n$\n597,188\nAccounts receivable, net\n91,636\n47,150\nShort-term investments\n404,584\n233,491\nPrepaid and other current assets\n528,085\n484,995\nAssets held for sale 6\n-\n103,079\nTotal current assets\n1,597,464\n1,465,903\nNon-current assets:\nFixed assets, net\n189,947\n189,770\nGoodwill 6\n27,504\n26,502\nIntangible assets, net\n8,460\n12,335\nDeferred tax assets\n10,100\n7,952\nOther assets, net\n88,548\n5,575\nTotal non-current assets\n324,559\n242,134\nTOTAL ASSETS\n$\n1,922,023\n$\n1,708,037\nLIABILITIES\nCurrent liabilities:\nReceipts in advance and deferred revenue\n$\n42,917\n$\n43,541\nAccounts payable and accrued liabilities\n494,934\n460,674\nTax payables\n19,468\n8,381\nLiabilities held for sale 6\n-\n3,902\nTotal current Liabilities\n557,319\n516,498\nLong-term liabilities:\nDeferred tax liabilities\n34,443\n29,336\nLong-term tax payable\n14,114\n13,295\nOther long-term liabilities\n790\n744\nTotal long-term liabilities\n49,347\n43,375\nTotal liabilities\n606,666\n559,873\nSHAREHOLDERS' EQUITY\nChangyou.com Limited shareholders' equity\n1,312,005\n1,117,767\nNon-controlling interests\n3,352\n30,397\nTotal shareholders' equity\n1,315,357\n1,148,164\nTOTAL LIABILITIES AND SHAREHOLDERS' EQUITY\n$\n1,922,023\n$\n1,708,037\n6 In the third quarter of 2016, the Company's management had an intention to divest the Company's interest in MoboTap. Therefore, the assets and liabilities of MoboTap were recognized as assets-held-for-sale and liabilities-held-for-sale, respectively, in the Company's financial statements for the third and fourth quarters of 2016. In the first quarter of 2017, due to the suspension of negotiations with the potential buyers of MoboTap, the Company's management determined that the disposal was unlikely to be completed within one year. As a result, the assets-held-for-sale and liabilities-held-for-sale related to MoboTap have been reclassified as assets and liabilities in the Company's balance sheet since March 31, 2017. In the third quarter of 2017, the Company recognized impairment charges related to the MoboTap business.\nCHANGYOU.COM LIMITED\nRECONCILIATIONS OF NON-GAAP RESULTS OF OPERATIONS MEASURES TO THE NEAREST COMPARABLE GAAP MEASURES\n(UNAUDITED, IN THOUSANDS, EXCEPT PER ADS AMOUNTS)\nThree Months Ended Dec. 31, 2017\nNon-GAAP adjustments\nGAAP\nShare-based\ncompensation expense\nNon-GAAP\nOnline game gross profit\n$\n92,286\n1\n92,287\nOnline advertising gross profit\n4,457\n-\n4,457\nCinema advertising gross profit\n983\n-\n983\nIVAS gross profit\n1,045\n-\n1,045\nGross profit\n$\n98,771\n1\n98,772\nGross margin\n68%\n68%\nOperating expense\n63,496\n(169)\n63,327\nOperating profit\n$\n35,275\n170\n35,445\nOperating margin\n24%\n25%\nIncome tax expense\n11,489\n11,489\nNet income\n$\n34,101\n170\n34,271\nLess: Net loss attributable to non-controlling interests\n(105)\n3\n(102)\nNet income attributable to Changyou.com Limited\n$\n34,206\n167\n34,373\nNet margin attributable to Changyou.com Limited\n24%\n24%\nDiluted net income attributable to Changyou.com Limited per ADS\n$\n0.64\n0.64\nADSs used in computing diluted net income attributable to\nChangyou.com Limited per ADS\n53,544\n53,701\nCHANGYOU.COM LIMITED\nRECONCILIATIONS OF NON-GAAP RESULTS OF OPERATIONS MEASURES TO THE NEAREST COMPARABLE GAAP MEASURES\n(UNAUDITED, IN THOUSANDS, EXCEPT PER ADS AMOUNTS)\nThree Months Ended Sep. 30, 2017\nNon-GAAP adjustments\nGAAP\nShare-based\ncompensation expense\nNon-GAAP\nOnline game gross profit\n$\n114,867\n4\n114,871\nOnline advertising gross profit\n4,407\n-\n4,407\nCinema advertising gross profit\n1,362\n-\n1,362\nIVAS gross profit\n971\n-\n971\nGross profit\n$\n121,607\n4\n121,611\nGross margin\n73%\n73%\nOperating expense\n151,425\n(2,204)\n149,221\nOperating loss\n$\n(29,818)\n2,208\n(27,610)\nOperating margin\n(18%)\n(17%)\nIncome tax expense\n10,793\n-\n10,793\nNet loss\n$\n(33,803)\n2,208\n(31,595)\nLess: Net loss attributable to non-controlling interests\n(27,029)\n3\n(27,026)\nNet loss attributable to Changyou.com Limited\n$\n(6,774)\n2,205\n(4,569)\nNet margin attributable to Changyou.com Limited\n(4%)\n(3%)\nDiluted net loss attributable to Changyou.com Limited per ADS\n$\n(0.13)\n(0.09)\nADSs used in computing diluted net loss attributable to Changyou.com\nLimited per ADS\n52,682\n52,682\nCHANGYOU.COM LIMITED\nRECONCILIATIONS OF NON-GAAP RESULTS OF OPERATIONS MEASURES TO THE NEAREST COMPARABLE GAAP MEASURES\n(UNAUDITED, IN THOUSANDS, EXCEPT PER ADS AMOUNTS)\nThree Months Ended Dec. 31, 2016\nNon-GAAP adjustments\nGAAP\nShare-based\ncompensation expense (a)\nNon-GAAP\nOnline game gross profit\n$\n74,464\n(5)\n74,459\nOnline advertising gross profit\n5,533\n-\n5,533\nCinema advertising gross profit\n6,919\n-\n6,919\nIVAS gross profit\n2,628\n-\n2,628\nGross profit\n$\n89,544\n(5)\n89,539\nGross margin\n69%\n69%\nOperating expenses\n51,727\n933\n52,660\nOperating profit\n$\n37,817\n(938)\n36,879\nOperating margin\n29%\n28%\nIncome tax expense\n9,356\n-\n9,356\nNet income\n$\n41,888\n(938)\n40,950\nLess: Net income attributable to non-controlling interests\n869\n8\n877\nNet income attributable to Changyou.com Limited\n$\n41,019\n(946)\n40,073\nNet margin attributable to Changyou.com Limited\n31%\n31%\nDiluted net income attributable to Changyou.com Limited per ADS\n$\n0.77\n0.75\nADSs used in computing diluted net income attributable to\nChangyou.com Limited per ADS\n53,346\n53,785\nNote:\n(a) To eliminate share-based compensation expense measured using the fair value method. The downward adjustment of share-based compensation expense\nin the current period was a result of fluctuations in the market price for the Company's ADS.\nCHANGYOU.COM LIMITED\nRECONCILIATIONS OF NON-GAAP RESULTS OF OPERATIONS MEASURES TO THE NEAREST COMPARABLE GAAP MEASURES\n(UNAUDITED, IN THOUSANDS, EXCEPT PER ADS AMOUNTS)\nTwelve Months Ended Dec. 31, 2017\nNon-GAAP adjustments\nGAAP\nShare-based\ncompensation expense\nNon-GAAP\nOnline game gross profit\n$\n386,759\n73\n386,832\nOnline advertising gross profit\n18,469\n-\n18,469\nCinema advertising gross profit\n6,475\n-\n6,475\nIVAS gross profit\n4,772\n-\n4,772\nGross profit\n$\n416,475\n73\n416,548\nGross margin\n72%\n72%\nOperating expenses\n325,994\n(17,320)\n308,674\nOperating profit\n$\n90,481\n17,393\n107,874\nOperating margin\n16%\n19%\nIncome tax expense\n40,767\n-\n40,767\nNet income\n$\n81,839\n17,393\n99,232\nLess: Net loss attributable to non-controlling interests\n(26,995)\n12\n(26,983)\nNet income attributable to Changyou.com Limited\n$\n108,834\n17,381\n126,215\nNet margin attributable to Changyou.com Limited\n19%\n22%\nDiluted net income per ADS attributable to Changyou.com Limited\n$\n2.04\n2.36\nADSs used in computing diluted net income per ADS attributable to\nChangyou.com Limited\n53,285\n53,476\nCHANGYOU.COM LIMITED\nRECONCILIATIONS OF NON-GAAP RESULTS OF OPERATIONS MEASURES TO THE NEAREST COMPARABLE GAAP MEASURES\n(UNAUDITED, IN THOUSANDS, EXCEPT PER ADS AMOUNTS)\nTwelve Months Ended Dec. 31, 2016\nNon-GAAP adjustments\nGAAP\nShare-based compensation\nexpense\nNon-GAAP\nOnline game gross profit\n$\n299,537\n31\n299,568\nOnline advertising gross profit\n29,305\n-\n29,305\nCinema advertising gross profit\n22,583\n-\n22,583\nIVAS gross profit\n8,150\n-\n8,150\nGross profit\n$\n359,575\n31\n359,606\nGross margin\n68%\n68%\nOperating expenses\n228,722\n(8,371)\n220,351\nOperating profit\n$\n130,853\n8,402\n139,255\nOperating margin\n25%\n27%\nIncome tax expense\n21,583\n-\n21,583\nNet income\n$\n147,070\n8,402\n155,472\nLess: Net income attributable to non-controlling interests\n2,123\n33\n2,156\nNet income attributable to Changyou.com Limited\n$\n144,947\n8,369\n153,316\nNet margin attributable to Changyou.com Limited\n28%\n29%\nDiluted net income per ADS attributable to Changyou.com Limited\n$\n2.72\n2.85\nADSs used in computing diluted net income per ADS attributable to\nChangyou.com Limited\n53,139\n53,803\nView original content: http://www.prnewswire.com/news-releases/changyou-reports-fourth-quarter-2017-and-fiscal-year-2017-unaudited-financial-results-300589319.html\nSOURCE Changyou.com Limited", "external_links": ["http://www.prnewswire.com/news-releases/changyou-reports-fourth-quarter-2017-and-fiscal-year-2017-unaudited-financial-results-300589319.html", "http://ir.changyou.com/"], "published": "2018-01-29T09:15:00.000+02:00", "crawled": "2018-01-29T10:27:20.023+02:00", "highlightTitle": ""}