{"organizations": [], "uuid": "cc2778b1b553f0458164c3ff0be07ceee83b66d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-franklin-financial-network-announces-dates-for-fourth-quarter-and-year-end-2017-earnings-release-and-call.html", "country": "US", "domain_rank": 767, "title": "Franklin Financial Network Announces Dates For Fourth Quarter And Year-End 2017 Earnings Release And Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T19:00:00.000+02:00", "replies_count": 0, "uuid": "cc2778b1b553f0458164c3ff0be07ceee83b66d1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-franklin-financial-network-announces-dates-for-fourth-quarter-and-year-end-2017-earnings-release-and-call.html", "ord_in_thread": 0, "title": "Franklin Financial Network Announces Dates For Fourth Quarter And Year-End 2017 Earnings Release And Call", "locations": [], "entities": {"persons": [], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "franklin", "sentiment": "none"}], "organizations": [{"name": "fsb", "sentiment": "negative"}, {"name": "franklin financial network", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "franklin financial network, inc.", "sentiment": "neutral"}, {"name": "franklin synergy bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKLIN, Tenn., Jan. 10, 2018 /PRNewswire/ -- Franklin Financial Network, Inc. (NYSE: FSB), the parent company of Franklin Synergy Bank, today announced that it will release its fourth quarter and year-end 2017 financial results on Wednesday, January 24, 2018, after the stock market closes. It will also host a live webcast on Thursday, January 25, 2018, at 8:00 a.m. CT to review its financial results, business outlook for the firm and other matters. The fourth quarter and year-end 2017 earnings release will be available on the Investor Relations page of Franklin Synergy Bank's website at www.FranklinSynergyBank.com .\nTo access the call for audio only, please call 1-844-378-6480. For the presentation materials and streaming audio, please access the webcast on the Investor Relations page of Franklin Synergy Bank's website at www.FranklinSynergyBank.com . For those unable to participate in the webcast, it will be archived for one calendar year following the presentation.\nFranklin Synergy Bank provides a full range of banking, investment, trust and mortgage products and services designed for businesses and their owners and individuals interested in a comprehensive relationship with their financial institution.\nSafe Harbor for Forward-Looking Statements\nThis media release contains forward-looking statements. Such statements include, but are not limited to, expected operating results, including market share and shareholder value, strategy for growth and profitability, projected sales, gross margin and net income figures, the availability of capital resources, and plans concerning products and market acceptance. Words such as \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" \"strategies\" and variations of such words and similar expressions are intended to identify such forward-looking statements. Forward-looking statements are inherently subject to risks and uncertainties, many of which cannot be predicted with accuracy and some of which might not even be anticipated. Risks and uncertainties that could cause the corporation's actual results to materially differ from those described in forward-looking statements include those discussed in Item 1A of the corporation's Annual Report on Form 10-K for the year ended December 31, 2016, filed with the Securities and Exchange Commission on March 16, 2017. Future events and actual results, financial and otherwise, could differ materially from those set forth in or contemplated by the forward-looking statements herein. Future operating results of the corporation are impossible to predict, and no representation or warranty of any kind can be made respecting the present or future accuracy of such forward-looking statements or the ability of the corporation to meet its obligations, and no such representation or warranty is to be inferred.\nAbout the Company\nFranklin Financial Network, Inc. is a financial holding company headquartered in Franklin, Tennessee. The Company's wholly owned bank subsidiary, Franklin Synergy Bank, a Tennessee-chartered commercial bank founded in November 2007 and a member of the Federal Reserve System, provides a full range of banking and related financial services with a focus on service to small businesses, corporate entities, local governments and individuals. With consolidated total assets of $3.57 billion at September 30, 2017, the Bank currently operates through 12 branches and one loan production office in the growing Williamson, Rutherford and Davidson Counties, all within the Nashville metropolitan statistical area. Additional information about the Company, which is included in the NYSE Financial-100 Index and the FTSE Russell 2000 Index, is available at www.FranklinSynergyBank.com .\nContact:\nSarah Meyerrose\nEVP, Chief Financial Officer\n(615) 236-8344\nsarah.meyerrose@franklinsynergy.com\nView original content: http://www.prnewswire.com/news-releases/franklin-financial-network-announces-dates-for-fourth-quarter-and-year-end-2017-earnings-release-and-call-300580405.html\nSOURCE Franklin Financial Network, Inc.", "external_links": ["http://www.franklinsynergybank.com/", "http://www.prnewswire.com/news-releases/franklin-financial-network-announces-dates-for-fourth-quarter-and-year-end-2017-earnings-release-and-call-300580405.html"], "published": "2018-01-10T19:00:00.000+02:00", "crawled": "2018-01-10T20:18:50.006+02:00", "highlightTitle": ""}