{"organizations": [], "uuid": "f2ce0d4051d420c93bc920171c190323eebf56a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220237457&w=1200&r=LYNXMPEE070LQ", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/usa-trump-weapons/exclusive-trump-to-call-on-pentagon-diplomats-to-play-bigger-role-on-arms-sales-sources-idINKBN1EX0X1", "country": "US", "domain_rank": 408, "title": "Exclusive - Trump to call on Pentagon, diplomats to play bigger role on arms sales: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T13:05:00.000+02:00", "replies_count": 0, "uuid": "f2ce0d4051d420c93bc920171c190323eebf56a2"}, "author": "", "url": "https://in.reuters.com/article/usa-trump-weapons/exclusive-trump-to-call-on-pentagon-diplomats-to-play-bigger-role-on-arms-sales-sources-idINKBN1EX0X1", "ord_in_thread": 0, "title": "Exclusive - Trump to call on Pentagon, diplomats to play bigger role on arms sales: sources", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "f. calvert", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mike stone", "sentiment": "none"}, {"name": "matt spetalnick", "sentiment": "none"}], "locations": [{"name": "camp david", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "pentagon", "sentiment": "negative"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The Trump administration is nearing completion of a new “Buy American” plan that calls for U.S. military attaches and diplomats to help drum up billions of dollars more in business overseas for the U.S. weapons industry, going beyond the limited assistance they currently provide, officials said.\nU.S. President Donald Trump returns to the White House from Camp David, in Washington, U.S., January 7, 2018. REUTERS/Mary F. Calvert President Donald Trump is expected to announce a “whole of government” approach that will also ease export rules on U.S. military exports and give greater weight to the economic benefits for American manufacturers in a decision-making process that has long focused heavily on human rights considerations, according to people familiar with the plan.\nThe initiative, which will encompass everything from fighter jets and drones to warships and artillery, is expected to be launched as early as February, senior officials said, speaking on condition of anonymity.\nA key policy change would call for embassy staffers around the world to act essentially as a sales force for defense contractors, actively advocating on their behalf. It was unclear, however, what specific guidelines would be established.\nBut under this more proactive approach, embassy staffers would engage more aggressively with foreign counterparts to push for U.S. arms sales and brief visiting senior U.S. officials so they can help advance pending deals, according to a person familiar with the matter. One senior administration official described the proposal as a “180-degree shift” in the current arms-length approach to foreign weapons sales.\nTrump is seeking to fulfill a 2016 election campaign promise to create jobs in the United States by selling more goods and services abroad to bring down the U.S. trade deficit from a six-year high of $50 billion.\nThe administration is also under pressure from U.S. defense contractors facing growing competition from foreign rivals such as China and Russia. But any loosening of the restrictions on weapons sales would be in defiance of human rights and arms control advocates who said there was too great a risk of fueling violence in regions such as the Middle East and South Asia or arms being diverted to be used in terrorist attacks.\nARMS REGULATIONS Besides greater use of a network of military and commercial attaches already stationed at U.S. embassies in foreign capitals, senior officials who spoke on condition of anonymity said another thrust of the plan will be to set in motion a realignment of the International Trafficking in Arms Regulations (ITAR). It is a central policy governing arms exports since 1976 and has not been fully revamped in more than three decades.\nThis expanded government effort on behalf of American arms makers, together with looser restrictions on weapons exports and more favorable treatment of sales to non-NATO allies and partners, could bring additional billions of dollars in deals and more jobs, the senior U.S. official said, without providing specifics.\nThe strategy of having the Pentagon and the U.S. State Department take a more active role in securing foreign arms deals could especially benefit major defense contractors such as Lockheed Martin ( LMT.N ) and Boeing Co ( BA.N ).\n“We want to see those guys, the commercial and military attaches, unfettered to be salesmen for this stuff, to be promoters,” said the senior administration official, who is close to the internal deliberations and spoke on condition of anonymity.\nA State Department official, asked to confirm details of the coming new policy, said the revamped approach “gives our partners a greater capacity to help share the burden of international security, benefits the defense industrial base and will provide more good jobs for American workers.”\nThe White House and Pentagon declined official comment.\nDefense industry officials and lobbyists have privately welcomed what they expect will be a more sales-friendly approach.\nTrump, a Republican, has the legal authority to direct government embassy “security assistance officers,” both military personnel and civilians, to do more to help drive arms sales.\nAdministration officials see this group, which until now has had more limited duties such as helping to manage U.S. military aid overseas and providing some information to foreign governments for buying U.S. arms, as underutilized by previous presidents.\nGraphic on U.S. arms sales: tmsnrt.rs/2CZkZMB\n‘BACK SEAT’ FOR HUMAN RIGHTS?\nOne national security analyst said that easing export restrictions to allow defense contractors to reap greater profits internationally would increase the danger of top-of-the-line U.S. weapons going to governments with poor human rights records or being used by militants.\n“This administration has demonstrated from the very beginning that human rights have taken a back seat to economic concerns,” said Rachel Stohl, director of the conventional defense program at the Stimson Center in Washington. “And the short-sightedness of a new arms export policy could have serious long-term implications.” The administration officials said human rights and regional security concerns would remain part of the formula for arms sales decisions. But they said such reviews would now afford greater weight than before to whether a deal would be good for the U.S. economy and strengthen America’s defense industrial base, in which case red tape would be cut accordingly. Rules to make it easier to sell U.S.-made military drones overseas and compete against fast-growing Chinese and Israeli rivals are also expected to be in the Trump plan, officials said.\nTrump’s Democratic predecessor, Barack Obama, also sought to make it easier to sell to America’s most trusted allies but in a more cautious approach that his administration billed as a way to boost American business while keeping strict controls against more dangerous arms proliferation. Foreign weapons sales soared during his tenure, with the United States retaining its position as the world’s top arms supplier.\nShares of the five biggest U.S. defense contractors, including Lockheed, Boeing, Raytheon Co ( RTN.N ), General Dynamics Corp ( GD.N ) and Northrop Grumman ( NOC.N ) have more than tripled over the last five years and currently trade at or near all-time highs. Foreign military sales in fiscal 2017, comprising much of Trump’s first year in office and the final months of Obama’s term, climbed to $42 billion, compared to $31 billion in the prior year, according to the U.S. Defense Security Cooperation Agency. The Trump administration has already moved forward on several controversial sales. Those include a push for $7 billion in precision-guided munitions to Saudi Arabia despite concerns they have contributed to civilian deaths in the Saudi campaign in Yemen’s civil war and the unblocking of $3 billion in arms to Bahrain, which was also held up by human rights concerns under Obama.\nSimilar concerns have been raised over the administration’s preparations to make it easier for American gun makers to sell small arms, including assault rifles and ammunition, to foreign buyers.\nA draft of the overall policy recently finished by teams of State, Defense and Commerce Department officials coordinated by Trump’s National Security Council must now be approved by a senior cabinet members before being sent to his desk, the government", "external_links": [], "published": "2018-01-08T13:05:00.000+02:00", "crawled": "2018-01-08T13:27:43.006+02:00", "highlightTitle": ""}