{"organizations": [], "uuid": "49c4124cbc6021c36e48b7f831ab24ed2f0cd9be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-usda-hog-regulations/usda-proposes-new-rule-modernizing-hog-plant-inspections-idUSKBN1F82UY", "country": "US", "domain_rank": 408, "title": "USDA proposes new rule 'modernizing' hog plant inspections", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.997, "site_type": "news", "published": "2018-01-20T07:36:00.000+02:00", "replies_count": 0, "uuid": "49c4124cbc6021c36e48b7f831ab24ed2f0cd9be"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usda-hog-regulations/usda-proposes-new-rule-modernizing-hog-plant-inspections-idUSKBN1F82UY", "ord_in_thread": 0, "title": "USDA proposes new rule 'modernizing' hog plant inspections", "locations": [], "entities": {"persons": [{"name": "carmen rottenberg", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. department of agriculture", "sentiment": "negative"}, {"name": "usda", "sentiment": "negative"}, {"name": "fsis", "sentiment": "none"}, {"name": "food safety and inspection service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO (Reuters) - The U.S. Department of Agriculture (USDA) on Friday announced new guidelines that could change how packers process hogs into pork.\nUSDA’s Food Safety and Inspection Service (FSIS) New Swine Slaughter Inspection System (NSIS), in part will allow some companies under the volunteer program to conduct meat inspections. FSIS inspectors will be on hand but largely focus on crucial food safety oversight.\nAnd the cap on chain speeds - the rate that packing plants process animals - will be removed with packers still responsible for maintaining already strict animal welfare and employee safety rules, the USDA said.\nBased on a pilot study since the late 1990s involving five pork plants, USDA determined that the new system can provide public health protection at least equivalent to the existing inspection system, the agency said.\n“FSIS is excited to continue modernizing inspection practices, while allowing opportunities for industry to innovate and streamline food production,” said Acting Deputy Under Secretary for Food Safety Carmen Rottenberg.\nProponents of USDA’s plan touts it as forward progress in food safety and innovation.\nThe pilot program proved that the process is a strong inspection model, said North American Meat Institute president Barry Carpenter in a statement.\n“We look forward to working with the agency as it develops a final rule that maintains a strong level of food safety in the most efficient manner,” said Carpenter.\nDr. Dan Kovich, a veterinarian with the National Pork Producers Council told Reuters that worries about increased chain speeds are unfounded.\n“The plants don’t have free will to run as fast as they want. They have to make sure they can still meet the letter of the law when it comes to animal welfare, food safety and employee safety as they did before,” said Kovich.\nStill, those opposed to the proposition argue that the new rule puts too much power in the hands of packers at the detriment of animals and employees.\n“It’s (rule) moving in the wrong direction. A lot of the big companies want to get USDA inspectors off the line so that they can run it faster,” Center for Food Safety Senior Policy Advisor Jaydee Hanson said to Reuters.\nIn a statement Debbie Berkowitz, senior fellow for worker safety and health with the National Employment Law Project, said removing chain speed limits is “another example of the Trump administration rigging the rules against workers and being perfectly willing to sacrifice their health to benefit corporate interests.”\nThe proposed rule has a 60-day comment period after it is published in the Federal Register.\nAdditional reporting by Tom Polansek in Chicago; editing by Diane Craft\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T07:36:00.000+02:00", "crawled": "2018-01-20T02:53:09.018+02:00", "highlightTitle": ""}