{"organizations": [], "uuid": "3e710420cd19986bbb5e83254d5e269e7eeaa580", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/23/the-associated-press-out-of-character-trump-keeps-his-distance-as-shutdown-ends.html", "country": "US", "domain_rank": 767, "title": "Out of character, Trump keeps his distance as shutdown ends", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T07:25:00.000+02:00", "replies_count": 0, "uuid": "3e710420cd19986bbb5e83254d5e269e7eeaa580"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/the-associated-press-out-of-character-trump-keeps-his-distance-as-shutdown-ends.html", "ord_in_thread": 0, "title": "Out of character, Trump keeps his distance as shutdown ends", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "sarah huckabee sanders", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — As the shutdown of the federal government lumbered toward an end, President Donald Trump remained out of sight, suppressing his instincts to become part of the story by making a deal or picking a fight.\nTrump told allies over the weekend that he hated being on the sidelines, but he followed the recommendations of his staff and key congressional Republicans and removed himself from the negotiations. The president limited his public pronouncements to a few Twitter bursts that bashed Democrats.\nHe did not reach out to Senate Minority Leader Chuck Schumer or any other Democrat, instead calling fellow Republicans and Cabinet members to check on the response to the shutdown.\nThe White House defended Trump's hands-off approach to the negotiations, one out of character for a president who made his reputation as the master of \"The Art of the Deal,\" as he titled one of his books.\n\"Look, what the president did clearly worked,\" said White House press secretary Sarah Huckabee Sanders. She told reporters that Trump's focus was on minimizing the impact of the shutdown on Americans.\n\"That's been a big priority for the president,\" she said. \"I think that it certainly went much smoother than it has in the past, but also the president was putting pressure and standing firm on exactly what he was willing to do and what he wasn't.\"\nTrump's shifting positions, particularly on protections for young immigrants, twice scuttled deals that could have avoided the shutdown, frustrating Republicans and Democrats alike. Schumer, who believed he was close to a deal on Friday after meeting the president at the White House over cheeseburgers, blasted Trump's refusal to re-engage.\n\"The White House refused to engage in negotiations over the weekend,\" Schumer said Monday. \"The great deal-making president sat on the sidelines.\"\nTrump initially chafed at remaining out of the fray, grousing to aides and outside advisers that he feared taking the blame. He watched hours of coverage of the shutdown on cable TV over the weekend — including clips of him blasting President Barack Obama for being passive during the 2013 shutdown — and made a series of calls to allies in which he expressed fear he was looking weak, according to a person familiar with the conversations but not authorized to speak about them publicly.\nBut Trump was pleased with the work of his staff defending him on air and urged them to \"hold the line\" during a visit to Sanders' office, which had become a de facto war room in the West Wing, according to a White House official, who was not authorized to speak publicly about internal discussions. The president warmed to playing hardball with the Democrats, and urged Senate Majority Leader Mitch McConnell and House Speaker Paul Ryan to keep winning the debate.\nTrump was also warned by allies, including chief of staff John Kelly and budget director Mick Mulvaney, not to reopen negotiations with Schumer, whom White House staffers believed would have to fold. And while Trump did not make any appearances where he could have been subjected to reporters' questions, the White House released a series of staged photos of the president, including one in which he wears a \"Make America Great Again\" hat and holds a phone to his ear while sitting at his Oval Office desk.\nThe White House may take a more leading role on the revived immigration debate, according to the official, and hosted senators for a discussion on the topic Monday. The president also finally broke his silence on the shutdown after the Senate vote to temporarily fund the government but only via a statement in which he said he was \"pleased Democrats in Congress have come to their senses.\"\nLemire reported from New York. Associated Press writer Zeke Miller contributed reporting.\nFollow Lemire on Twitter at http://twitter.com/@JonLemire and Superville at http://twitter.com/@dsupervilleap", "external_links": [], "published": "2018-01-23T07:25:00.000+02:00", "crawled": "2018-01-23T08:19:12.017+02:00", "highlightTitle": ""}