{"organizations": [], "uuid": "76b7d3d867ec91c57c838c98c394d7c9f0773a92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218772341&w=1200&r=LYNXMPEE010AN", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-economy-pmi/uk-factory-growth-cools-in-december-from-four-year-highs-pmi-idUKKBN1ER0KS", "country": "US", "domain_rank": 408, "title": "UK factory growth cools in December from four-year highs - PMI", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T11:37:00.000+02:00", "replies_count": 0, "uuid": "76b7d3d867ec91c57c838c98c394d7c9f0773a92"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-economy-pmi/uk-factory-growth-cools-in-december-from-four-year-highs-pmi-idUKKBN1ER0KS", "ord_in_thread": 0, "title": "UK factory growth cools in December from four-year highs - PMI", "locations": [], "entities": {"persons": [{"name": "andy bruce", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "derby", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "toyota", "sentiment": "none"}, {"name": "ihs", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 9:33 AM / Updated 6 hours ago UK factory growth cools in December from four-year highs - PMI Reuters Staff 3 Min Read \nLONDON (Reuters) - Growth in British manufacturing cooled last month from four-year highs struck in November, but the sector remained a bright spot in Britain’s economy heading into 2018, a survey showed on Tuesday. FILE PHOTO: A man works on the production line at the Toyota factory in Derby, central England, March 7, 2011. REUTERS/Darren Staples/File Photo \nIn contrast to accelerating growth in the euro zone, the IHS Markit/CIPS UK Manufacturing Purchasing Managers’ Index (PMI) dropped to 56.3 from 58.2 in November. \nThat was at the bottom end of forecasts in a Reuters poll of economists that had pointed to a reading of 58.0. \nWhile growth in new business, output, export orders and employment slowed in December, the PMI stayed above its average for 2017 as a whole. \nAlan Clarke, a fixed income strategist with Scotiabank, said the disappointing figures for the month probably represented only a temporary setback for the sector which accounts for 10 percent of the country’s overall economic output. \n“I would only start to worry if we see further declines of this magnitude in the coming months,” Clarke said. \nSterling and British government bond prices were unchanged by the survey. \nOverall, it added to signs that British manufacturers will prosper next year, when a slowdown in the overall economy is likely to deepen as Britain approaches its departure from the European Union in March 2019. \nBritish factories have been boosted by a resurgent European economy above all else. \nLast month, euro zone manufacturers enjoyed their strongest growth since PMI records began more than 20 years ago, easily outpacing their British peers. \nSamuel Tombs, an economist with consultancy Pantheon Macroeconomics, said the gap between British and euro zone manufacturers in December was the widest since June 2008. \n“We expect the recovery in the manufacturing sector to lose its current vitality soon,” he said, citing growing backlogs of work caused by recruitment problems and cuts to investment since the Brexit vote. \nCost pressures faced by British factories cooled to a four- month low -- good news for Bank of England policymakers who think consumer price inflation is already around its peak. \nBut the PMI also showed manufacturers added staff at the slowest pace in six months, adding to signs that job creation, a highlight of Britain’s economy in recent years, is now slowing. \nPMIs for the construction industry and the much larger services sector are due on Wednesday and Thursday. Additional reporting by William Schomberg; Editing by Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-02T11:37:00.000+02:00", "crawled": "2018-01-02T12:08:34.009+02:00", "highlightTitle": ""}