{"organizations": [], "uuid": "e0e6e9c41d31170299defcec538d7a693986c8b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/canada-forex/canada-fx-debt-c-strengthens-ahead-of-nafta-talks-as-wholesale-trade-rises-idUSL2N1PH0NY", "country": "US", "domain_rank": 408, "title": "CANADA FX DEBT-C$ strengthens ahead of NAFTA talks as wholesale trade rises", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.049, "site_type": "news", "published": "2018-01-22T22:35:00.000+02:00", "replies_count": 0, "uuid": "e0e6e9c41d31170299defcec538d7a693986c8b8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/canada-forex/canada-fx-debt-c-strengthens-ahead-of-nafta-talks-as-wholesale-trade-rises-idUSL2N1PH0NY", "ord_in_thread": 0, "title": "CANADA FX DEBT-C$ strengthens ahead of NAFTA talks as wholesale trade rises", "locations": [], "entities": {"persons": [], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "bank of canada", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Canadian dollar at C$1.2459, or 80.26 U.S. cents * Canadian wholesale trade rises 0.7 percent in November * Bond prices little changed across the yield curve TORONTO, Jan 22 (Reuters) - The Canadian dollar strengthened against its U.S. counterpart on Monday, gravitating toward the middle of this year's range ahead of the resumption of talks to renegotiate NAFTA and as investors weighed domestic data showing an increase in wholesale trade. The value of Canadian wholesale trade rose for the second month in a row in November on broad gains across sectors, data from Statistics Canada showed. The 0.7 percent increase was shy of economists' forecasts for a 1 percent gain, while volumes rose 0.5 percent. The sixth and penultimate round of talks on renegotiating the North American Free Trade Agreement is due to take place in Montreal from Jan. 23-29. The future of NAFTA was the most significant downside risk the economy faced, the Bank of Canada said last week as it raised its benchmark interest rate, as expected, but tempered expectations for additional increases over the coming months. Separately, the member countries of the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTTP), also known as TPP 11, gathered in Japan for two days of talks to try to forge a trade pact. Canada is holding out to secure protection of its cultural industries, like movies, TV, and music, and has said it will not be rushed into signing a deal that other members hope to conclude by March. At 9:20 a.m. EST (1420 GMT), the Canadian dollar was trading 0.3 percent higher at C$1.2459 to the greenback, or 80.26 U.S. cents. The currency traded in a range of C$1.2457 to C$1.252. Since the start of the year, the range has been C$1.2355 to C$1.2590. Speculators have raised bullish bets on the Canadian dollar for the second straight week, data from the U.S. Commodity Futures Trading Commission and Reuters calculations showed on Friday. As of Jan. 16, net long positions had edged up to 17,556 contracts from 17,461 a week earlier. The U.S. dollar dipped against a basket of major currencies, pressured by a U.S. government shutdown and strengthening economic growth in Europe that encouraged large investors to boost their expectations on the euro. Canadian government bond prices little changed across the yield curve, with 10-year rising 5 Canadian cents to yield 2.237 percent. The 10-year yield touched its highest intraday since September 2014 at 2.246 percent. U.S. crude prices were up 0.1 percent at $63.44 a barrel. Oil is one of Canada's major exports. (Reporting by Fergal Smith; Editing by Frances Kerry)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T22:35:00.000+02:00", "crawled": "2018-01-23T17:52:37.001+02:00", "highlightTitle": ""}