{"organizations": [], "uuid": "71495759e490ee281e810758d4ee07f55a79a04b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/04/reuters-america-update-4-intel-shares-fall-as-investors-worry-about-costs-of-chip-flaw.html", "country": "US", "domain_rank": 767, "title": "UPDATE 4-Intel shares fall as investors worry about costs of chip flaw", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:25:00.000+02:00", "replies_count": 0, "uuid": "71495759e490ee281e810758d4ee07f55a79a04b"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/reuters-america-update-4-intel-shares-fall-as-investors-worry-about-costs-of-chip-flaw.html", "ord_in_thread": 0, "title": "UPDATE 4-Intel shares fall as investors worry about costs of chip flaw", "locations": [], "entities": {"persons": [{"name": "eric johnson", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "jan", "sentiment": "negative"}, {"name": "intel corp", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}, {"name": "vanderbilt university's owen graduate school of management", "sentiment": "none"}, {"name": "microsoft corp", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds comments from financial services group, investor)\nJan 4 (Reuters. - Intel Corp shares fell nearly 2 percent on Thursday as investors worried about the potential financial liability and reputational hit from recently disclosed security flaws in its widely used microprocessors.\nThe largest chipmaker had confirmed on Wednesday that flaws reported by researchers could allow hackers to steal sensitive information from computers, phones and other devices. Apple Inc , Microsoft Corp and other software makers have issued patches to protect against the vulnerabilities.\nIntel may be on the hook for costs stemming from lawsuits claiming that the patches would slow computers and effectively force consumers to buy new hardware, and big customers will likely seek compensation from Intel for any software or hardware fixes they make, security experts said.\n\"The potential liability is big for Intel,\" said Eric Johnson, dean of Vanderbilt University's Owen Graduate School of Management. \"Everybody will be scrambling over the next few days to figure out just how big it is.\"\nIntel has said that the patches for the bugs would slow its chips down somewhat but that most users will not notice.\nAmazon Web Services (AWS), the largest seller of cloud computing services, said in a statement it does not expect meaningful performance impact for most customer workloads.\nMicrosoft and Alphabet Inc's Google both said in statements on their websites that they expect few performance problems for most of their cloud computing customers.\nBut the incident is likely to spur cloud companies to press Intel for lower prices on chips in future talks, said Kim Forrest, senior equity research analyst at Fort Pitt Capital Group in Pittsburgh, which owns shares in Intel.\nWhat (Intels cloud customers) are going to say is, You wronged us, we hate you, but if we can get a discount, well still buy from you, Forrest said.\nForrest also expects Intel will have to increase its chip development spending to focus on security.\nGovernment agencies and security experts said they knew of no cyber attacks that had exploited the vulnerabilities.\nFinancial services firms were studying information on the vulnerabilities to determine how to best respond, said the Financial Services Information Sharing and Analysis Center, a global industry group known as FS-ISAC that shares data on cyber threats.\nBanks and other firms are trying to understand what it will cost to respond to the issue, FS-ISAC said in an emailed statement.\n\"In addition to the security considerations raised by this design flaw, performance degradation is expected, which could require more processing power for affected systems to compensate and maintain current baseline performance, FS-ISAC said. There will need to be consideration and balance between fixing the potential security threat vs the performance and other possible impact to systems.\nLawyers filed a lawsuit in San Jose, California, federal court on Wednesday that sought class action status and compensation for people who had bought vulnerable Intel chips or computers that came with them already installed.\nIntel did not immediately respond to a request for comment on Thursday about the lawsuit.\nWhile more lawsuits are expected, Intel's biggest customers are likely to quietly seek compensation for any harm caused by the vulnerabilities, including costs to patch machines or replace microprocessors, Johnson said.\nLegal experts said that consumers would have to prove concrete damages and harm to proceed with claims.\nIntel shares fell 1.8 percent, following a 3.4 percent decline Wednesday.\nShares in rival Advanced Micro Devices Inc climbed 4.9 percent as investors speculated the No. 2 maker of microprocessors would woo customers away from Intel.\nStill, researchers had said some of AMD's chips had one of the two vulnerabilities disclosed on Wednesday, as do processors from ARM Holdings. (Reporting by Jim Finkle in Toronto and Stephen Nellis in San Francisco.; Additional reporting by Tina Bellon in New York, Siddharth Cavale in Bengaluru, Doug Busvine in Frankfurt, Stephen Nellis in San Francisco, Elizabeth Dilts in New York, Mathieu Rosemain in Paris; Editing by Meredith Mazzilli)", "external_links": [], "published": "2018-01-05T00:25:00.000+02:00", "crawled": "2018-01-05T06:34:09.001+02:00", "highlightTitle": ""}