{"organizations": [], "uuid": "9b440795afe4cc19a4f974330d549cbb2931dc10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219825936&w=1200&r=LYNXMPEE050AJ", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-bobs-langton/langton-looks-for-glory-after-holcomb-death-idUKKBN1EV0EQ", "country": "US", "domain_rank": 408, "title": "Langton looks for glory after Holcomb death", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T15:14:00.000+02:00", "replies_count": 0, "uuid": "9b440795afe4cc19a4f974330d549cbb2931dc10"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-bobs-langton/langton-looks-for-glory-after-holcomb-death-idUKKBN1EV0EQ", "ord_in_thread": 0, "title": "Langton looks for glory after Holcomb death", "locations": [], "entities": {"persons": [{"name": "langton", "sentiment": "negative"}, {"name": "holcomb", "sentiment": "negative"}, {"name": "simon evans", "sentiment": "negative"}, {"name": "steve langton", "sentiment": "none"}, {"name": "steven holcomb", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "park city", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "lake placid", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. olympic committee media summit", "sentiment": "none"}, {"name": "team usa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 1:16 PM / Updated 9 minutes ago Langton looks for glory after Holcomb death Simon Evans 3 Min Read \n(Reuters) - United States bobsledder Steve Langton, a double Olympic bronze medalist in Sochi four years ago, thought his success in Russia was the perfect way to bow out of the sport. FILE PHOTO: Bobsled athlete Steve Langton poses for a portrait at the U.S. Olympic Committee Media Summit in Park City, Utah, U.S. September 26, 2017.ÊREUTERS/Mike Blake/File Photo \nBut now he has more glory on his mind. \nThe Sochi medal in the two-man event with pilot Steven Holcomb was the first for the United States in that competition in 62 years. \nLangton, who had also won gold along with Holcomb in the 2012 World Championships in Lake Placid, felt that was the sign that it was time to say goodbye to the sport. \n“My heart was full, as I had been competing seven years in the sport and had a lot of success,” Langton told the Team USA website (teamusa.org). \nThe Bostonian began working in a marketing job, finally putting his degree in business management to use. \nHe was calm with his decision until last February when he suddenly felt the need to compete again after three years away. \n“When February rolled around, I literally woke up one day and said I want to get back in the sled and bring home gold,” Langton said. \n“I don’t know if I dreamt something or if I had a good night’s sleep. Maybe it was something in the water,” he said. \nThe expectation of many in the sport was that Langton would re-unite with Holcomb but in May, the pilot was found dead in his room at the Olympic Training Centre in Lake Placid. \nLangton was left without the man who had done so much for his career and for the sport in the U.S. \n”We shared a lot of meaningful, pivotal times together,“ he said. ”Most people don’t know the sport without Steven Holcomb. \n“Not just what he did in the sport, but what he contributed all around.” \nThe bronze medals won by Holcomb and Langton will be re-designated silvers when they are re-allocated after Russian Aleksandr Zubkov was stripped of his golds following the Sochi doping scandal. \nBut Langton, who posts his workouts and his impressive back squat online, has his eye on going one better. \n“Gold is the goal,” he says. \n”For us it really it ties to how fast and strong you are, and I’ve put in enough hours. \n“I will always miss my friend and teammate but he wants us to go to the Olympics, and he would want us to win medals, and we’re going to do everything we possibly can to make that happen.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-06T15:14:00.000+02:00", "crawled": "2018-01-06T15:26:50.009+02:00", "highlightTitle": ""}