{"organizations": [], "uuid": "15fd8643ce1f6438b0c0bf5f2f94e51413190cac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223414115&w=1200&r=LYNXMPEE0I1HF", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-pesticides-arkansas/arkansas-restricts-controversial-monsanto-basf-farm-chemical-idUSKBN1F82D9", "country": "US", "domain_rank": 408, "title": "Arkansas restricts controversial Monsanto, BASF farm chemical", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T20:39:00.000+02:00", "replies_count": 0, "uuid": "15fd8643ce1f6438b0c0bf5f2f94e51413190cac"}, "author": "", "url": "https://www.reuters.com/article/us-usa-pesticides-arkansas/arkansas-restricts-controversial-monsanto-basf-farm-chemical-idUSKBN1F82D9", "ord_in_thread": 0, "title": "Arkansas restricts controversial Monsanto, BASF farm chemical", "locations": [], "entities": {"persons": [{"name": "tom polansek", "sentiment": "negative"}], "locations": [{"name": "arkansas", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "monsanto", "sentiment": "negative"}, {"name": "basf", "sentiment": "negative"}, {"name": "xtend", "sentiment": "none"}, {"name": "monsanto co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO (Reuters) - In a blow to manufacturers Monsanto Co and BASF SE, Arkansas state lawmakers voted on Friday to bar sprayings of a controversial weed killer after mid-April to protect farmers from potential crop damage.\nArkansas will prohibit the use of herbicides based on a chemical known as dicamba from April 16 to Oct. 31, the strictest state limits imposed on the product after it was linked to millions of acres of U.S. crop damage last year.\nThe ban makes it less attractive for farmers to buy soybean and cotton seeds that Monsanto engineered to resist dicamba because the crops are designed to be sprayed with the chemical during the summer growing season.\nMonsanto is banking on its dicamba-based herbicide and soybean seeds engineered to tolerate it, called Xtend, to dominate soybean production in the United States, the world’s second-largest exporter.\nThe United States faced an agricultural crisis last year caused by new formulations of dicamba herbicides. Farmers and weed experts said the products evaporated and drifted away from where they were applied, hurting crops that could not resist them.\nArkansas farmer Reed Storey, who said his soybeans were among those damaged, wants the agrichemical companies to develop dicamba products that drift less.\n“Until they can find a newer formulation, then I‘m completely tickled pink with the decision,” he said.\nMonsanto and BASF say their dicamba-based herbicides are safe when used properly. They opposed the ban in Arkansas and have said it will hurt growers there by removing a tool to fight stubborn weeds.\nMonsanto, which is being acquired by Bayer AG for $63.5 billion, has also sued Arkansas to stop the ban.\nArkansas blocked sales of Monsanto’s product, called XtendiMax with VaporGrip, in 2017 because the company did not provide testing data that state officials wanted.\n“It is distressing that we’re in an environment in Arkansas where bringing the most modern tools to farmers is difficult,” said Scott Partridge, Monsanto vice president of global strategy.\nOther farm states, including Minnesota, Missouri and North Dakota, have imposed limits on dicamba sprayings for 2018 in an attempt to prevent a repeat of the crop damage last year.\nStill, Monsanto projected before Friday’s move by lawmakers in Arkansas that farmers would grow Xtend soybeans on 40 million acres this year, which would be double from 2017 and account for 44 percent of all U.S. soybean plantings.\nReporting by Tom Polansek; Editing by Tom Brown\n ", "external_links": [], "published": "2018-01-19T20:39:00.000+02:00", "crawled": "2018-01-19T20:59:34.027+02:00", "highlightTitle": ""}