{"organizations": [], "uuid": "3b34297690d2a915c663813d7b48165033c252a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/05/20/100750682-20130519-1427-148.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/all-the-cards-are-in-chuck-schumers-hands-new-hampshire-republican.html", "country": "US", "domain_rank": 767, "title": "All the cards are in Chuck Schumer's hands: New Hampshire Republican", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.122, "site_type": "news", "published": "2018-01-02T17:46:00.000+02:00", "replies_count": 0, "uuid": "3b34297690d2a915c663813d7b48165033c252a3"}, "author": "Kevin Breuninger", "url": "https://www.cnbc.com/2018/01/02/all-the-cards-are-in-chuck-schumers-hands-new-hampshire-republican.html", "ord_in_thread": 0, "title": "All the cards are in Chuck Schumer's hands: New Hampshire Republican", "locations": [], "entities": {"persons": [{"name": "chuck schumer", "sentiment": "neutral"}, {"name": "gregg", "sentiment": "none"}, {"name": "schumer", "sentiment": "none"}, {"name": "judd gregg", "sentiment": "none"}, {"name": "doug jones", "sentiment": "none"}], "locations": [{"name": "new hampshire", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Republicans hold a razor-thin majority in the Senate as the body moves into the 2018 session. But a Republican former senator says one Democrat holds nearly all the legislative power: Minority Leader Chuck Schumer .\n\"Chuck really controls the play of the field now,\" former Sen. Judd Gregg, R-N.H., said Tuesday on CNBC's \" Squawk Box .\" \"What issues he's willing to be bipartisan on will determine whether there is legislation.\"\nThe Senate's top Democrat already held significant influence in a chamber with such a narrow majority — one that will shrink by one when Alabama Democrat Doug Jones is sworn in on Wednesday .\nGregg said the Senate's voting rules for the 2018 fiscal year give Schumer even more sway over the legislative process.\nIn passing sweeping tax reform at the end of 2017, Senate Republicans used a process known as reconciliation, shrinking the number of required votes to a simple majority.\nRepublicans can't use this move again until the 2019 budget is passed — a circumstance that weakens the power of the slim Senate majority and necessitates cooperation.\n\"It changes everything,\" Gregg said. \"This means that everything that involves policy is going to have to be bipartisan. That puts all the cards in Chuck Schumer's hands.\"\nBoth parties' legislative strategies will be affected by the lack of reconciliation, Gregg said. The New York Democrat, who represents a large constituency of staunch opponents of President Donald Trump and the Republican Party, may be empowered to undermine Republican bills at every turn. Republicans may be forced to abandon the sweeping legislative packages they introduced in 2017 in lieu of a more piecemeal approach.\nAnd this dynamic will play out as both parties look ahead to the midterm elections of 2018, which many analysts and statisticians claim will favor the Democrats.\n\"The bottom line is that Chuck Schumer basically controls the state of play in the Senate and therefore legislatively,\" Gregg said.\n\"Everything now is in the context of the next election.\"", "external_links": [], "published": "2018-01-02T17:46:00.000+02:00", "crawled": "2018-01-02T17:50:15.033+02:00", "highlightTitle": ""}