{"organizations": [], "uuid": "035df59ebf3fa524931879ce511bc683171768bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/politicsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-netherlands-usa-hoekstra/u-s-envoy-erred-in-comments-about-muslims-in-netherlands-state-department-idUSKBN1F037F", "country": "US", "domain_rank": 408, "title": "U.S. envoy erred in comments about Muslims in Netherlands: State Department", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T01:58:00.000+02:00", "replies_count": 0, "uuid": "035df59ebf3fa524931879ce511bc683171768bb"}, "author": "", "url": "https://www.reuters.com/article/us-netherlands-usa-hoekstra/u-s-envoy-erred-in-comments-about-muslims-in-netherlands-state-department-idUSKBN1F037F", "ord_in_thread": 0, "title": "U.S. envoy erred in comments about Muslims in Netherlands: State Department", "locations": [], "entities": {"persons": [{"name": "steve goldstein", "sentiment": "none"}, {"name": "goldstein", "sentiment": "none"}, {"name": "hoekstra", "sentiment": "none"}, {"name": "pete hoekstra", "sentiment": "none"}], "locations": [{"name": "netherlands", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}], "organizations": [{"name": "state department", "sentiment": "negative"}, {"name": "state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "state department reuters", "sentiment": "none"}, {"name": "muslim", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The new U.S. ambassador to the Netherlands made mistakes and feels great remorse for falsely saying two years ago that Muslim migrants had “burned” politicians and created “no-go zones” in Holland, a State Department official said on Thursday.\nHoekstra angered Dutch media on Wednesday when he met with reporters for the first time since taking over as ambassador but declined to answer questions asking him to clarify his remarks from two years ago.\nUnder Secretary of State Steve Goldstein told a briefing on Thursday the State Department “does not agree” with Hoekstra’s 2015 remarks about Muslim migrants in the Netherlands.\nGoldstein said Hoekstra would be interviewed by a Dutch media outlet on Friday and was expected to address the issue. He said Hoekstra also was expected to visit various Dutch communities over the weekend, including Muslim communities.\nHe told reporters that Ambassador Pete Hoekstra had apologized for the 2015 remarks in a statement on Twitter in December and also said he regretted telling a Dutch television reporter he never made the comments.\n“The ambassador made mistakes in 2015, made comments that should not have been made. He recognizes that,” Goldstein said. “He apologized in December. He is doing an interview tomorrow. ... We have made clear to the ambassador that he must move to get this behind him. And he definitely understands that. He feels great remorse.”\nHoekstra told reporters he regretted the exchange with Dutch television denying the remarks but declined to comment further. U.S. press officers prevented some reporters from asking more questions about the issue.\nHoekstra, who was born in the Netherlands, said during a recorded panel discussion sponsored by the right-wing David Horowitz Freedom Center in 2015 that “the Islamic movement is now gotten to a point where they have put Europe into chaos.”\n“Chaos in the Netherlands - there are cars being burned. There are politicians that are being burned and, yes, there are no-go zones in the Netherlands,” he added.\nIn December, Hoekstra denied making the 2015 remarks, telling the Dutch television program Nieuwsuur it was “an incorrect statement ... fake news.” Later, after being played a recording of his comment, he denied calling it fake news.\nIn a Dec. 23 note on Twitter Hoekstra acknowledged having made the comments in 2015 and said he regretted his exchange with the Dutch news organization: “I made certain remarks in 2015 and regret the exchange during the Nieuwsuur interview. Please accept my apology.”\nReporting by David Alexander and Arshad Mohammed\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-12T01:58:00.000+02:00", "crawled": "2018-01-12T02:17:46.033+02:00", "highlightTitle": ""}