{"organizations": [], "uuid": "4bc8d217ecedbc787d194cd2d7f2b7d6660198ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221478019&w=1200&r=LYNXMPEE0B156", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-spain-politics-catalonia/fugitive-former-leader-cannot-rule-catalonia-from-abroad-says-madrid-idUKKBN1F11WH", "country": "US", "domain_rank": 408, "title": "Fugitive former leader cannot rule Catalonia from abroad says Madrid", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T17:27:00.000+02:00", "replies_count": 0, "uuid": "4bc8d217ecedbc787d194cd2d7f2b7d6660198ff"}, "author": "", "url": "https://uk.reuters.com/article/uk-spain-politics-catalonia/fugitive-former-leader-cannot-rule-catalonia-from-abroad-says-madrid-idUKKBN1F11WH", "ord_in_thread": 0, "title": "Fugitive former leader cannot rule Catalonia from abroad says Madrid", "locations": [], "entities": {"persons": [{"name": "carles puigdemont", "sentiment": "none"}, {"name": "puigdemont", "sentiment": "none"}, {"name": "inigo mendez de vigo", "sentiment": "none"}, {"name": "catalunya", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "madrid reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 35 PM / Updated 25 minutes ago Fugitive former leader cannot rule Catalonia from abroad says Madrid Sonya Dowsett 3 Min Read \nMADRID (Reuters) - The Spanish government dismissed outright on Friday the possibility of former Catalan leader Carles Puigdemont ruling the region from self-imposed exile in Brussels, and said Madrid would contest any attempt to do so in the courts. Former Catalan leader Carles Puigdemont poses with members of his party 'Junts per Catalunya' parliament group in Brussels, Belgium January 12, 2018. REUTERS/Francois Lenoir \nCatalan separatists agreed on Wednesday to try to re-elect Puigdemont as regional leader, raising the scenario of the fugitive former leader governing by video link from Belgium. He faces arrest in Spain for sedition and rebellion. \n“Parliamentary rules are very clear,” said Spanish government spokesman Inigo Mendez de Vigo at a weekly press conference. “They do not contemplate the possibility of a (parliamentary) presence that is not in person.” \n“This aspiration is a fallacy, it’s totally unrealistic and it goes against the rule books and common sense,” he added. \nPuigdemont spearheaded a movement last year for the wealthy northeastern region of Catalonia to split from Spain, culminating in Madrid sacking his administration and imposing direct rule. He moved to Brussels shortly afterwards. \nSpanish Prime Minister Mariano Rajoy held local elections in December to resolve the crisis, which has led to thousands of companies to move their registered headquarters to outside the region. FILE PHOTO - Spain's Government spokesman, Inigo Mendez de Vigo, speaks during an interview with Reuters at Education Ministry in Madrid, Spain, October 28, 2017. REUTERS/Sergio Perez \nBut the results of the vote delivered a slim majority to separatists, heightening the possibility of a renewed push for secession from Spain this year. \nGovernment lawyers have analysed Catalan parliamentary law and have concluded that any regional presidential candidate must appear in person in order to be voted in, Cadena Ser radio said on Thursday, citing a government legal report. Slideshow (4 Images) \nThe regional parliament will sit for the first time on Wednesday to choose the parliamentary speaker. A new regional leader could be elected by parliament as soon as Jan. 31. \nHowever, five members of the Catalan parliament, including Puigdemont, are in self-imposed exile in Brussels and three are serving custodial sentences in Madrid for their role in organising an illegal referendum on independence from Spain. \nAnother possible candidate for regional president is Puigdemont’s former deputy Oriol Junqueras, one of those in custody. However, a judge on Friday rejected his request to be transferred to a Catalan jail to be able to attend parliamentary sessions. \nUnder Spanish law, both Puigdemont and Junqueras could resign and pass their seat to another politician who could attend parliament or stand for president in their place. Editing by Julien Toyer and Jon Boyle", "external_links": [], "published": "2018-01-12T17:27:00.000+02:00", "crawled": "2018-01-12T17:52:13.014+02:00", "highlightTitle": ""}