{"organizations": [], "uuid": "e09700856fac505b8333aa19627695f1939a6340", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/olympics-2018-nors-siblings/cross-country-skiing-niskanens-eye-finnish-family-affair-in-pyeongchang-idUSL8N1P10BP", "country": "US", "domain_rank": 408, "title": "Cross country skiing-Niskanens eye Finnish family affair in Pyeongchang", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T21:22:00.000+02:00", "replies_count": 0, "uuid": "e09700856fac505b8333aa19627695f1939a6340"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/olympics-2018-nors-siblings/cross-country-skiing-niskanens-eye-finnish-family-affair-in-pyeongchang-idUSL8N1P10BP", "ord_in_thread": 0, "title": "Cross country skiing-Niskanens eye Finnish family affair in Pyeongchang", "locations": [], "entities": {"persons": [{"name": "kerttu niskanen", "sentiment": "negative"}, {"name": "iivo", "sentiment": "negative"}, {"name": "lahti", "sentiment": "none"}], "locations": [{"name": "sochi", "sentiment": "none"}, {"name": "pyeongchang stockholm", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "oulu", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "helsinki", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STOCKHOLM, Jan 8 (Reuters) - Finnish siblings Iivo and Kerttu Niskanen both medalled at the Sochi Olympics and will be hoping to make it a family affair again in Pyeongchang next month.\nThe brother and sister, from the town of Oulu about 600km north of Helsinki, have experienced mixed fortunes this season, but in the cauldron of Olympic competition, the sanguine nature of the Finns could be to their advantage once again.\nIivo, who at 25 is the younger of the two, claimed gold in the team sprint at Sochi and won the 15km classic style event at the 2017 world championships in Lahti. He has been mulling over his options at the Games.\nHe skipped a World Cup event in Italy due to illness and quit a rainy January Tour de Ski event after a disappointing seventh place in his trademark 15km classic race to reduce travelling and the risk of getting sick ahead of the Olympics.\nQuieter and more reserved then his sister, Iivo has previously focused on training for the 15km freestyle discipline for the Olympics.\n“I‘m interested in both skiathlon and the sprint (classic), competing in both of them should not be a threat to success in 50km (team classic),” he said. “I‘m more weighing on whether I’d race 15km free.”\nIn a highly competitive field dominated by the Norwegian team and Swede Charlotte Kalla, Kerttu’s World Cup season has been short on podium finishes, and she is behind team mate Krista Parmakoski in the standings.\nThe 29-year-old told Finland’s Iltalehti newspaper her new coach has recently put her through a tough training programme to build up her strength.\n“I‘m sure it’s done good. One must have power in skiing nowadays,” she said.\nKerttu’s best chance of making the podium is likely to be in the team events in a repeat of the performances that earned her two silver medals in Sochi.\nShe teamed up with Aino-Kaisa Saarinen to come second in the team sprint, nine seconds behind Norway, but second place in the 4x5km relay must have felt more like a gold medal agonisingly lost than a silver won.\nNiskanen skied superbly to hand over a 25-second lead to Krista Lahteenmaki for the final leg, but Kalla’s super-human effort dashed Finland’s dreams of gold as Sweden snatched victory in a thrilling sprint finish.\nDespite her modest results this season Kerttu will, barring injury, undoubtedly be a key part of the Finnish team events in Pyeongchang.\n“My form is OK, everything is going well, but results have not been very good ... I can only wait to clinch better results,” she said. (Reporting by Philip O‘Connor, editing by Ed Osmond)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T21:22:00.000+02:00", "crawled": "2018-01-09T17:01:22.056+02:00", "highlightTitle": ""}