{"organizations": [], "uuid": "5f99514dfbd13c31a3ac44c6fc70dacfcacfc3cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-golden-entertainment-announces-pricing-of-secondary-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Golden Entertainment Announces Pricing of Secondary Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-19T05:20:00.000+02:00", "replies_count": 0, "uuid": "5f99514dfbd13c31a3ac44c6fc70dacfcacfc3cc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-golden-entertainment-announces-pricing-of-secondary-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Golden Entertainment Announces Pricing of Secondary Public Offering of Common Stock", "locations": [], "entities": {"persons": [{"name": "macquarie c", "sentiment": "none"}, {"name": "golden", "sentiment": "none"}], "locations": [], "organizations": [{"name": "golden entertainment announces pricing of secondary public offering of common stock las vegas", "sentiment": "negative"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS--(BUSINESS WIRE)-- Golden Entertainment, Inc. (Nasdaq: GDEN) (“Golden”) announced today the pricing of its underwritten secondary public offering of 6,500,000 shares of common stock to be sold by certain of its shareholders at a public offering price of $28.00 per share. In addition, Golden has granted the underwriters a 30-day option to purchase up to an additional 975,000 shares directly from Golden at the public offering price, less the underwriting discounts and commissions.\nGolden will not receive any proceeds from the sale of any shares by the selling shareholders. Golden expects to use the net proceeds (if any) from the exercise of the underwriters’ option to purchase additional shares for general corporate purposes, which may include, among other things, capital expenditures, opportunistic acquisitions or working capital. The offering is expected to close on January 23, 2018, subject to the satisfaction of customary closing conditions.\nJ.P. Morgan and Morgan Stanley are joint book-running managers and representatives of the underwriters for the offering. Macquarie Capital is also acting as a joint book-running manager. Union Gaming is acting as co-manager for the offering.\nThe offering is being made pursuant to an effective shelf registration statement filed with the Securities and Exchange Commission. The offering of these shares may be made only by means of a prospectus supplement and the accompanying prospectus, copies of which, when available, may be obtained by contacting: J.P. Morgan Securities LLC, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, telephone: (866) 803-9204 and Morgan Stanley & Co. LLC, Attn: Prospectus Department, 180 Varick Street, 2nd Floor, New York, New York 10014. Electronic copies of the final prospectus supplement and accompanying prospectus are also available on the website of the SEC at http://www.sec.gov .\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy any of the offered shares, nor shall there be any sale of such shares in any state or other jurisdiction in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of such state or other jurisdiction.\nAbout Golden Entertainment, Inc.\nGolden Entertainment, Inc. owns and operates gaming properties across two divisions – resort casino operations and distributed gaming. Golden operates approximately 16,000 slots, 114 table games, and 5,164 hotel rooms, and provides jobs for approximately 7,000 team members. Golden owns eight casino resorts – seven in Southern Nevada and one in Maryland. Through its distributed gaming business in Nevada and Montana, Golden Entertainment operates video gaming devices at nearly 1,000 locations and owns nearly 60 traditional taverns in Nevada. Golden Entertainment is licensed in Illinois to operate video gaming terminals.\nForward Looking Statements\nThis press release contains forward-looking statements regarding future events, including statements regarding the proposed public offering, that are subject to the safe harbors created under the Securities Act of 1933 and the Securities Exchange Act of 1934. Forward-looking statements can generally be identified by the use of words such as “anticipate,” “believe,” “continue,” “could,” “estimate,” “expect,” “forecast,” “intend,” “may,” “plan,” “project,” “potential,” “seek,” “should,” “think,” “will,” “would” and similar expressions, or they may use future dates. Forward-looking statements in this press release include, without limitation, statements regarding Golden’s expectations as to the completion, timing and size of the public offering and the anticipated use of proceeds (if any) therefrom. These forward-looking statements are subject to assumptions, risks and uncertainties that may change at any time, and readers are therefore cautioned that actual results could differ materially from those expressed in any forward-looking statements. Factors that could cause actual results to differ include, among other things: risks and uncertainties associated with market conditions and the satisfaction of customary closing conditions related to the proposed offering, and other risks and uncertainties discussed in Golden’s filings with the SEC, including the “Risk Factors” section of Golden’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2017. Golden undertakes no obligation to update any forward-looking statements as a result of new information, future developments or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118006534/en/\nInvestor Relations\nJCIR\nJoseph Jaffoni, Richard Land, James Leahy, 212-835-8500\ngden@jcir.com\nor\nMedia Relations\nGolden Entertainment, Inc.\nHoward Stutz, 702-495-4490\nDirector Corporate Communications\nhstutz@goldenent.com\nSource: Golden Entertainment, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51745764&newsitemid=20180118006534&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=1&md5=3b840be9c59cba567c833f6d9f2d119a", "http://www.businesswire.com/news/home/20180118006534/en/"], "published": "2018-01-19T05:20:00.000+02:00", "crawled": "2018-01-19T05:18:07.019+02:00", "highlightTitle": ""}