{"organizations": [], "uuid": "f7579452b1d224c6e79b9498465e9d289c959294", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/16/104172515-GettyImages-607010764.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/estonia-has-no-doubts-on-trumps-nato-commitment-prime-minister.html", "country": "US", "domain_rank": 767, "title": "Estonia has no doubts on Trump's NATO commitment: Prime Minister", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.661, "site_type": "news", "published": "2018-01-26T12:47:00.000+02:00", "replies_count": 0, "uuid": "f7579452b1d224c6e79b9498465e9d289c959294"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/26/estonia-has-no-doubts-on-trumps-nato-commitment-prime-minister.html", "ord_in_thread": 0, "title": "Estonia has no doubts on Trump's NATO commitment: Prime Minister", "locations": [], "entities": {"persons": [{"name": "dmitri beliakov", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "juri ratas", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "estonia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "washington post", "sentiment": "negative"}, {"name": "nato", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The relationship between Estonia and the President Donald Trump administration is solid, Estonian Prime Minister Juri Ratas told CNBC at the World Economic Forum on Friday, countering doubts over the current U.S. government's commitment to its NATO ally.\nAsked if Trump has been a dedicated friend so far, the prime minister replied, \"We have a very strong relationship between the U.S. and the president of the U.S. For example last year the speaker (of the House of Representative) of the U.S. visited Estonia, the vice president visited Estonia. I think this is a really concrete and strong sign for the rest of the world.\"\nTrump has regularly chided fellow NATO members, questioning the nearly 70-year-old alliance's relevance and demanding that member countries increase their military spending as part of the pact.\nThe value of NATO military partnerships is increasingly in focus as Russia, Estonia's neighbor to the east, ups its military exercises and engages in expansionary activity — military and politically — in border countries like Ukraine and Georgia. Putin's government has been accused of carrying out hybrid warfare in the Baltic states to turn political opinion against the EU and toward the Russian Federation.\nRatas denied there was any concern about NATO's ability to defend the small Baltic country.\n\"Our bilateral relations between the U.S. and Estonia are very strong. Especially in security and defense, because today under NATO we have the Enhanced Forward Presence, (which) means we have troops in Estonia from the U.K. France, and Denmark.\"\n\"It is important to have a very strong cornerstone between the EU and U.S. and NATO, and I think this is the most important thing today,\" he stressed.\nDmitri Beliakov | Washington Post | Getty Images Estonian Special Forces soldiers seen reading a map after raiding the woods during a NATO troop exercise in Estonia. The current NATO mission in Estonia numbers more than 1,000 troops, 300 of whom are American and the majority from the U.K. The U.S. has also provided Estonia with 12 F16 jets, four M1A2 Abrams battle tanks and 15 Bradley Fighting Vehicles, according to the Estonian government.\n2017 saw a significant boost in troops and military hardware from U.S. and European allies to the country and its Baltic neighbors, with more than 4,000 NATO troops deployed in total.\nDozens of U.S. special operations forces are also posted near the Russian border in Estonia, Latvia and Lithuania. Last year was the first in which U.S. tanks rolled down the streets of Estonian capital Tallinn.\nDuring House Speaker Paul Ryan's visit in April of 2017, Ryan gave a speech during which he emphasized the American commitment to NATO was \"resolute.\" Vice President Mike Pence, during his June visit last year, pledged the Trump administration's support for NATO's Article 5 principle of mutual defense.", "external_links": [], "published": "2018-01-26T12:47:00.000+02:00", "crawled": "2018-01-26T12:48:48.037+02:00", "highlightTitle": ""}