{"organizations": [], "uuid": "915c75a35ea333e4ff60dbf63233864be5f49b2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-northsight-capital-inc-to-acquire-uptick-newswire.html", "country": "US", "domain_rank": 767, "title": "Northsight Capital, Inc. to Acquire Uptick Newswire", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-31T16:00:00.000+02:00", "replies_count": 0, "uuid": "915c75a35ea333e4ff60dbf63233864be5f49b2f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-northsight-capital-inc-to-acquire-uptick-newswire.html", "ord_in_thread": 0, "title": "Northsight Capital, Inc. to Acquire Uptick Newswire", "locations": [], "entities": {"persons": [{"name": "podcas", "sentiment": "none"}], "locations": [{"name": "scottsdale", "sentiment": "none"}, {"name": "ariz.", "sentiment": "none"}], "organizations": [{"name": "northsight capital inc.", "sentiment": "negative"}, {"name": "ncap", "sentiment": "negative"}, {"name": "northsight capital, inc.", "sentiment": "neutral"}, {"name": "google", "sentiment": "none"}, {"name": "uptick newswire, inc.", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SCOTTSDALE, Ariz., Jan. 31, 2018 (GLOBE NEWSWIRE) -- Northsight Capital Inc. (\"NCAP\") (OTC PINK:NCAP) announced today that it has signed a non-binding LOI to acquire Uptick Newswire, Inc., a leading newswire company for public Microcap companies. The latest statistics show that there are over 11,000 micro-cap companies with a combined market cap of over $500 billion.\nUptick Newswire is one of the leading outlets for micro-cap companies to display their company’s current and future potential, giving CEOs the opportunity to tell their story directly to qualified investors, brokerage houses, journalists, bloggers, and influencers. Uptick currently interviews approximately 50 CEOs a month on its Radio broadcast and via video segments, featuring those interviews on its website and allowing the shareholders of the individual companies to watch and/or listen to the interview. To date, Uptick has interviewed approximately 1000 Microcap CEOs on the air. Uptick’s content can be found on Audio Boom, iTunes, iHeart Radio, Investors Hangout, Google Play, YouTube, Stitcher, aCast, Spreaker, Podcast Directory, Player FM, BluBrry, TuneIn and Biz Talk Radio.\nThe radio show and podcast generate revenue from fees paid by participants, while also driving traffic to UPTICK Newswire’s website. The show increases brand awareness by virtue of reaching hundreds of thousands of listeners and improves brand legitimacy by increasing transparency of the Micro and Nano-cap stock markets and providing education about these markets to investors worldwide.\nTerms of the proposed acquisition were not released. Completion of the transaction is subject to funding, board approval and negotiation and execution of definitive agreements.\nEverett Jolly, President of Uptick stated: “We look forward to becoming part of Northsight Capital, Inc., and are pleased the result of this transaction will allow us to better serve our customer base. Northsight has a dedicated management team who, through organic growth and strategic acquisitions, has created a nation leading marketing and advertising platform. The combination of our complementary businesses will be a catalyst to develop reach and accelerate growth.”\nAbout Northsight Capital, Inc.\nNorthsight Capital, Inc. (\" NCAP \") is comprised of a portfolio of online marijuana-related websites developed and operated by the company. These sites incorporate many aspects of the marijuana industry. The company provides its audience with a means to stay informed on the industry's most cutting-edge marijuana-related innovations and legislation. The company's most dynamic concept, Weed Depot, provides consumers with a geo-targeted map directory of medical and recreational dispensaries, head shops, doctors, attorneys and more within the marijuana industry. The Weed Depot app can be downloaded for free at the iTunes Store and Google Play. Weed Depot has an entire platform of content suited for every aspect of advertising and marketing to consumers from all businesses in the cannabis industry.\nThe company's 420 careers is a leading job site in the Cannabis space with 2,000 to 3,000 visitors a day and approximately 1 million-page views per month.\nNorthsight's current websites include:\nwww.Weeddepot.com\nwww.420careers.com\nwww.MJBizwire.com\nwww.MarijuanaRecipes.com\nRateMyStrain.com\nWikiweed.com\nMarijuanaMD.com\nForward-Looking Statements:\nVarious statements in this release, including those that express a belief, expectation or intention, may be considered \" \" that involve risks and uncertainties that could cause actual results to differ materially from projected results. Accordingly, investors should not place undue reliance on as a prediction of actual results. The may include projections and estimates concerning the timing and success of specific projects or transactions. Forward-looking statements may also include projections and estimates concerning our future operating results and financial condition. When we use the words \"will,\" \"believe,\" \"intend,\" \"expect,\" \"may,\" \"should,\" \"anticipate,\" \"could,\" \"estimate,\" \"plan,\" \"predict,\" \"project,\" or their negatives, or other similar expressions, the statements which include those words are usually . When we describe strategy that involves risks or uncertainties, we are making . The in this press release speak only as of the date of this press release; we disclaim any obligation to update these statements. We have based these on our current expectations and assumptions about future events. While our management considers these expectations and assumptions to be reasonable, they are inherently subject to significant business, economic, competitive, regulatory and other risks, contingencies and uncertainties, most of which are difficult to predict and many of which are beyond our control.\nJohn Venners, 480-385-3800\nInfo@NorthsightCapital.com\nSource: Uptick Newswire\nSource:Northsight Capital, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=6KaByRxt6QJqosr9_OiXK37WjH40uWVAJL5l6IitnqBSfwsTbx8W_prsZpp98lFxIW7vtUNzTUwGGw_WP_HRav1y3Ql9mji0IjZ8mpmdZ1s=", "https://www.globenewswire.com/Tracker?data=8KAIrHEzeAeTfSpHR4vp7S_Ctcr8K4IAf0yNVaSwuHuNs972sqFZRnW3UdjtsnceFZcnec7APc1-hK4oJ6LLMZ7Ly8RsuVvCSj-KCBZh7FY=", "https://www.globenewswire.com/Tracker?data=_NbDfe0ksH5k2eFRjs9mHd6WL-l7x_bXu5L_ijktBbd39BNOmHke-jsrPqP3y6Ah8f7Xtbg6PM5effD0x2shz9P1PkDhckrh6zJmZhY-iVA=", "https://www.globenewswire.com/Tracker?data=xL827o3sZXCuBgvl470WPoK6HrrfzJYh6GubOzZDSnL0XDJotXa7CR3W2A_VWRwhoPVjgVIsbiLYWOvz0dLcImFSJdfC4YmvXu95cJKbFRg=", "https://www.globenewswire.com/Tracker?data=osG2G7k7G1xGeQwgnXjWYP20N5cOyN-6k2WkbfiXMqGASfoj55k_x-I-GJ-OYeca6xC3j5xwRadZULf9FVN0yg==", "https://www.globenewswire.com/Tracker?data=iZIweqv9VsPgsolo3Sr6jLoI_I-mmiyN46XjMuTXXc72DhNNurli6yJBbnlLFCfVvhNw4eusfnUoO7kIJN2ALBVIlKjgOicqZv5mSztk9NPSAjG-edfqd94SvKGFcqMT", "https://www.globenewswire.com/Tracker?data=9RZ1wF5irmyJ6pQWqWMfB6w5tc1JYOEG_Sqf2va57kBVzBnKoLtVXxOFIusVTZBlLJ3pRZDsfn2wVYKrIMZbSg==", "https://www.globenewswire.com/Tracker?data=r6nRK1t4w1cC3BY8aoVokJSSuunH2YnxFl6AMJ1yvdK4IZX5SH8BiJZ1QHw2yHQzErT5z544sK6Erkq2Ml9LxA==", "https://www.globenewswire.com/Tracker?data=LIZk_knivkfO18rovZWp47xb3JOKBDei40xjMJMQQDnaSFM-Nzj1U6UEUc0Dx0sZg6LRbFWWm5VG4Ld7PtPZRzBuolsvEsQ27KjNFp_hpN8=", "https://www.globenewswire.com/Tracker?data=BN3TQf-zYAmzQE0pfmknuxqBmgIC-kqdK-D8PLPB6lJxWgHwPVLuePYSKMpreYQ3u8jxDWsimGc6CCWWNrwSU5Rdip-ah5ZnvSe_c8YPUER78PjqMshlonfk9H1Ue11klu8y3_0W-4S8l4KrQBKCjQ=="], "published": "2018-01-31T16:00:00.000+02:00", "crawled": "2018-01-31T15:54:05.000+02:00", "highlightTitle": ""}