{"organizations": [], "uuid": "ba3638a5130031886b737c8ef76fdf1a3e1a99c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225289791&w=1200&r=LYNXMPEE0O1PT", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-northkorea-missiles-coal-russia/exclusive-despite-sanctions-north-korea-exported-coal-to-south-and-japan-via-russia-intelligence-sources-idUSKBN1FE35N", "country": "US", "domain_rank": 408, "title": "Exclusive: Despite sanctions, North Korea exported coal to South and Japan via Russia - intelligence sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:23:00.000+02:00", "replies_count": 0, "uuid": "ba3638a5130031886b737c8ef76fdf1a3e1a99c4"}, "author": "", "url": "https://www.reuters.com/article/us-northkorea-missiles-coal-russia/exclusive-despite-sanctions-north-korea-exported-coal-to-south-and-japan-via-russia-intelligence-sources-idUSKBN1FE35N", "ord_in_thread": 0, "title": "Exclusive: Despite sanctions, North Korea exported coal to South and Japan via Russia - intelligence sources", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 10:24 PM / in 42 minutes Exclusive: Despite sanctions, North Korea exported coal to South, Japan via Russia - intelligence sources Guy Faulconbridge , Jonathan Saul , Polina Nikolskaya 10 Min Read \nPARIS/LONDON/MOSCOW (Reuters) - North Korea shipped coal to Russia last year which was then delivered to South Korea and Japan in a likely violation of U.N. sanctions, three Western European intelligence sources said. \nThe U.N. Security Council banned North Korean exports of coal last Aug. 5 under sanctions intended to cut off an important source of the foreign currency Pyongyang needs to fund its nuclear weapon and missile programs. \nBut the secretive Communist state has at least three times since then shipped coal to the Russian ports of Nakhodka and Kholmsk, where it was unloaded at docks and reloaded onto ships that took it to South Korea or Japan, the sources said. \nA Western shipping source said separately that some of the cargoes reached Japan and South Korea in October last year. A U.S. security source also confirmed the coal trade via Russia and said it was continuing. \n“Russia’s port of Nakhodka is becoming a transhipping hub for North Korean coal,” said one of the European security sources, who requested anonymity because of the sensitivity of international diplomacy around North Korea. \nAsked to respond to the report, Kremlin spokesman Dmitry Peskov said on Friday that Russia abided by international law. \n“Russia is a responsible member of the international community,” he told reporters on a conference call. \nInterfax news agency quoted an unidentified official at Russia’s embassy to North Korea on Friday as saying Russia did not buy coal from North Korea and was “not a transit point for coal deliveries to third countries.” \nRussia’s mission to the United Nations told the Security Council sanctions committee on Nov. 3 that Moscow was complying with the sanctions. \nTwo lawyers who specialize in sanctions law told Reuters it appeared the transactions violated U.N. sanctions. \nReuters could not independently verify whether the coal unloaded at the Russian docks was the same coal that was then shipped to South Korea and Japan. Reuters also was unable to ascertain whether the owners of the vessels that sailed from Russia to South Korea and Japan knew the origin of the coal. \nThe U.S. Treasury on Wednesday put the owner of one of the ships, the UAL Ji Bong 6, under sanctions for delivering North Korean coal to Kholmsk on Sept. 5. \nIt was unclear which companies profited from the coal shipments. \nRUSSIA URGED “DO MORE” ON SANCTIONS \nNorth Korean coal exports were initially capped under a 2016 Security Council resolution that required countries to report monthly imports of coal from North Korea to the council’s sanctions committee within 30 days of the end of each month. \nDiplomats, speaking on condition of anonymity, said Russia had not reported any imports of North Korea coal to the committee last year. \nThe sanctions committee told U.N. member states in November that a violation occurs when “activities or transactions proscribed by Security Council resolutions are undertaken or attempts are made to engage in proscribed transactions, whether or not the transaction has been completed.” \nAsked about the shipments identified by Reuters, Matthew Oresman, a partner with law firm Pillsbury Winthrop Shaw Pittman who advises companies on sanctions, said: “Based on these facts, there appears to be a violation of the U.N. Security Council resolution by the parties involved.” \n“Also those involved in arranging, financing, and carrying out the shipments could likely face U.S. sanctions,” he said. \nThe United States has led efforts to toughen U.N. sanctions to force North Korea to give up development of nuclear missiles capable of hitting America. \nAsked about the shipments, a U.S. State Department spokesman said: “It’s clear that Russia needs to do more. All U.N. member states, including Russia, are required to implement sanctions resolutions in good faith and we expect them all to do so.” \nEarlier this month, U.S. Secretary of State Rex Tillerson accused Russia of not implementing all the U.N sanctions and said Moscow “may be frustrating” some of the steps. \nTillerson said the Russian failure to comply with the U.N. measures “primarily” concerned fuel “but some other areas potentially as well.” \nA State Department official said it was time for Russia to act. \n“There is no more time for excuses,” the official said. “The world is watching Russia’s actions closely.” \n“Russia says it wants better relations with the United States, so Moscow should prove that by cooperating with us, not working against us, on this urgent threat to all nations.” FILE PHOTO - An employee walks between front-end loaders which are used to move coal imported from North Korea at Dandong port in the Chinese border city of Dandong, Liaoning province December 7, 2010. REUTERS/Stringer/File Photo \nThe independent panel of experts that reports to the Security Council on violations of sanctions was not available for comment. \nNorth Korea has refused to give up the development of nuclear missiles capable of hitting the United States. It has said the sanctions infringe its sovereignty and accused the United States of wanting to isolate and stifle North Korea. \nAn independent panel of experts reported to the Security Council on Sept. 5 that North Korea had been “deliberately using indirect channels to export prohibited commodities, evading sanctions.” \nReuters reported last month that Russian tankers had supplied fuel to North Korea at sea and U.S. President Donald Trump told Reuters in an interview on Jan. 17 that Russia was helping Pyongyang get supplies in violation of the sanctions. \nThe U.S. Treasury on Wednesday imposed sanctions on nine entities, 16 people and six North Korean ships it accused of helping the weapons programs. \nGRAPHIC: North Korean coal shipments via Russia - tmsnrt.rs/2DRokNW TWO ROUTES \nTwo separate routes for the coal were identified by the Western security sources. \nThe first used vessels from North Korea via Nakhodka, about 85 km (53 miles) east of the Russian city of Vladivostok. FILE PHOTO - A cargo ship is loaded with coal during the opening ceremony of a new dock at the North Korean port of Rajin July 18, 2014. REUTERS/Yuri Maltsev/File Photo \nOne vessel that used this route was the Palau-flagged Jian Fu which Russian port control documents show delivered 17,415 tonnes of coal after sailing from Nampo in North Korea on Aug. 3 and docking at berth No. 4 run by LLC Port Livadiya in Nakhodka. It left the port on Aug. 18. \nThe vessel had turned off its tracking transmitter from July 24 to Aug. 2, when it was in open seas, according to publicly available ship tracking data. Under maritime conventions, this is acceptable practice at the discretion of the ship’s captain, but means the vessel could not be tracked publicly. \nAnother ship arrived at the same berth -- No. 4 -- on Aug. 16, loaded 20,500 tonnes of coal and headed to the South Korean port of Ulsan in Aug. 24, according to Russian port control documents. \nReuters was unable to reach the operator of the Jian Fu, which was listed in shipping directories as the China-based Sunrise Ship Management. The Nakhodka-based transport agent of the Jian Fu did not respond to written and telephone requests for comment. LLC Port Livadiya did not respond to a written request for comment. \nThe second route took coal via Kholmsk on the Russian Pacific island of Sakhalin, north of Japan. \nAt least two North Korean vessels unloaded coal at a dock in Kholmsk port in August and September after arriving from the ports of Wonsan and Taean in North Korea, Russian port control data and ship tracking data showed. \nThe Rung Ra 2 docked in Kholmsk three times between Aug. 1 and Sept. 12, unloading a total of 15,542 tonnes of coal, while the Ul Ji Bong 6 unloaded a total of 10,068 tonnes of coal on two separate port calls -- on Aug. 3 and between Sept. 1 and Sept. 8, according to the official Russian Information System for State Port Control. \nThe coal did not pass Russian customs because of the UN sanctions taking effect, but was then loaded at the same dock onto Chinese-operated vessels. Those vessels stated their destination in Russian port control documents as North Korea, according to a source in Sakhalin port administration who spoke on condition of anonymity. \nReuters has seen the port control documents which state the destination of the coal as North Korea. But the vessels that loaded the North Korean coal sailed instead for the ports of Pohang and Incheon in South Korea, ship tracking data showed. Related Coverage Russia says no obligation to comply with U.S. sanction on North Korea \nIn Beijing on Friday, foreign ministry spokeswoman Hua Chunying told reporters she did not know anything about the situation but China was clear in its hope that the UN resolutions are followed fully. \nChina will not allow any Chinese company or individual to do anything that goes against the resolutions and if there is cast-iron proof this is happening, China will handle it seriously and in accordance with the law, she added. \nThe U.S. Treasury on Wednesday included the owner of the Ul Ji Bong 6 under sanctions for delivering North Korean coal to Kholmsk after the sanctions took effect. \nIt was unclear which companies profited from the coal shipments. \nAsked about the shipments, a South Korean foreign ministry official said: “Our government is monitoring any sanctions-evading activities by North Korea. We’re working closely with the international community for the implementation of the sanctions.” \nThe official declined to say whether the ministry was aware of the shipments reported by Reuters. \nThe Japanese foreign ministry did not immediately respond to a request for comment. \nThe European security sources said the route via Russia had developed as China, North Korea’s neighbor and lone major ally, cracked down on exports from the secretive Communist state. \n“The Chinese have cracked down on coal exports from North Korea so the smuggling route has developed and Russia is the transit point for coal,” one of the European security sources said. Writing by Guy Faulconbridge and Jonathan Saul; Additional reporting by Michele Nichols in New York, Oksana Kobzeva and Gleb Stolyarov in Moscow, Hyonhee Shin in Seoul, William James in London, Muyu Xu, Ben Blanchard and Josephine Mason in Beijing, Aaron Sheldrick and Linda Sieg in Tokyo, and David Brunnstrom, Mark Hosenball and Matt Spetalnick in Washington; Editing by Timothy Heritage, Clarence Fernandez, Sonya Hepinstall and Lisa Shumaker", "external_links": [], "published": "2018-01-26T00:23:00.000+02:00", "crawled": "2018-01-26T00:32:31.014+02:00", "highlightTitle": ""}