{"organizations": [], "uuid": "c96f743855e5d34d0e22527119bcce96a608da69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/hastings-grp-chairman/update-1-british-insurer-hastings-says-ceo-hoffman-to-become-chairman-idUSL4N1P42QP", "country": "US", "domain_rank": 408, "title": "UPDATE 1-British insurer Hastings says CEO Hoffman to become chairman", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T10:20:00.000+02:00", "replies_count": 0, "uuid": "c96f743855e5d34d0e22527119bcce96a608da69"}, "author": "", "url": "https://www.reuters.com/article/hastings-grp-chairman/update-1-british-insurer-hastings-says-ceo-hoffman-to-become-chairman-idUSL4N1P42QP", "ord_in_thread": 0, "title": "UPDATE 1-British insurer Hastings says CEO Hoffman to become chairman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 8:21 AM / Updated 38 minutes ago UPDATE 1-British insurer Hastings says CEO Hoffman to become chairman Reuters Staff 2 Min Read \n(Adds details, analyst comments) \nJan 9 (Reuters) - British insurer Hastings Group Holdings Plc said its Chief Executive Gary Hoffman would take over as non-executive chairman in May and promoted Toby van der Meer, managing director of its UK trading subsidiary, as its next CEO. \nHoffman will assume the role from Mike Fairey, who will retire in May. The new CEO will take charge on March 1, Hastings, which operates mainly in the British motor market, said. \n“Mike Fairey was appointed as chairman to guide the company through its IPO in October 2015 ... Mike believes that, having successfully achieved those objectives ... it is now the right time for him to step down,” Hastings said. \nThe insurer said Hoffman had previously indicated that there would “come a time in the not too distant future when he would look to step down from his role as CEO”. \nUnder Hoffman, who has been CEO for over five years, Hastings’ share price has surged 83 percent since its October 2015 IPO, compared with a 30 percent rise in the UK non-life insurance index, said Barclays analyst Alan Devlin, who rates Hastings at “equal weight”. \nThe only surprise is that Hoffman would not be leaving Hastings, the analyst said. \n“Given Gary’s experience and performance as CEO, we view it as a positive that he remains involved in the company going forward, so long as the new CEO is given a free hand to be his own CEO,” Devlin said. \nAnalysts at Keefe, Bruyette & Woods Europe called the appointment of van der Meer, who previously worked at Moneysupermarket.com as broadly neutral, adding the operating experience of the current CEO would not be lost. \nHastings, which sells most of its policies via price comparison websites, has reaped gains as more customers use such websites to get competitive prices. (Reporting by Noor Zainab Hussain in Bengaluru; Editing by Amrutha Gayathri and Gopakumar Warrier)", "external_links": [], "published": "2018-01-09T10:20:00.000+02:00", "crawled": "2018-01-09T10:51:41.024+02:00", "highlightTitle": ""}