{"organizations": [], "uuid": "3770b1338284575978b7562af80b74be38452f84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/688744616.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/05/restaurants-butcher-shops/", "country": "US", "domain_rank": 1196, "title": "The Most Exciting Butcher Shops in America Are Restaurants | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-06T02:00:00.000+02:00", "replies_count": 0, "uuid": "3770b1338284575978b7562af80b74be38452f84"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/05/restaurants-butcher-shops/", "ord_in_thread": 0, "title": "The Most Exciting Butcher Shops in America Are Restaurants | Fortune", "locations": [], "entities": {"persons": [{"name": "james weiner", "sentiment": "none"}, {"name": "daniel meiser", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "mystic", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}, {"name": "upper west side", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "conn", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 12:49 PM EST \nIf you’re following the latest food forecasts, you’ll know that plant-based diets will be huge in 2018. \nAmericans, however, will consume a record amount of meat in 2018: an average of 222.2 pounds of red meat and poultry per person, according to Bloomberg. Meat is cheap (especially because producers are raising more animals), and high-protein diets remain popular. \nAlso at a new high are the number of superior butcher shops that double as restaurants. Across the country, meat-oriented chefs are fronting places that cater to the demand for aged cuts, expertly made sausages, and cured meats. These spots offer pasture-raised, humanely treated beef, pork, lamb, and chicken, as well as less common choices such as goat, venison, and game birds. \nRib roasts in Connecticut, all-natural beef on the Upper West Side, a whole-animal butchery in Austin—these are among the places to go for meat in 2018. \nGrass & Bone, Mystic, Conn. \nYou’d expect the coastal town of Mystic to be all about fish—and perhaps pizza. Yet last summer, Daniel Meiser and James Weiner transformed a Tim Horton’s doughnut outpost into a cafe with offerings such as the Grandpa Reuben (made with house-made pastrami) and bronzed rotisserie chicken with garlic mayo. The focal point of the space is a refrigerated case filled with cuts of meat dry-aged up to 90 days and sometimes more. “We didn’t want to do a fake butcher program,” Meiser says. “We want people to come here and say, ‘I want a 2-inch-thick aged rib-eye to make for dinner.’” \nWhite Gold Butchers, New York City \nOn Manhattan’s Upper West Side, this white-tiled space evokes an old-school butcher shop. There are dozens of all-natural, pasture-raised offerings including top sirloin, bone-in New York strip steaks, marrow bones, house-made hot dogs, and smoked kielbasa from butcher-owners Erika Nakamura, Jocelyn Guest, and April Bloomfield. Diners can add sausage, ham, bacon, pastrami, or all of them, to the breakfast egg sandwich. For dinner, there’s crispy pig head. \nPublican Quality Meats, Chicago A post shared by Publican Quality Meats (@publicanquality) on Dec 13, 2017 at 10:11am PST \nChicago’s legendary meatpacking district is the setting for this outpost of the popular pork and oysters restaurant, Publican. Headed by chef Paul Kahan, PQM includes a cafe that specializes in charcuterie: salumi, pâtés, terrines, confit, and rillettes. Tom’s Silver Medal sandwich is piled high with spicy capicola, lonza cotto, ham, provolone, and pickled peppers on a hoagie. (It’s Chicago.) The shop also sells bone-in cuts—rib-eye, porterhouse, strip—each dry-aged for an average of 60 days. \nGwen Butcher Shop and Restaurant, Los Angeles \nChef Curtis Stone has created a premium destination for carnivores. There’s a wide selection of ingredients to cook in the wood-burning asador, such as short ribs, lamb shanks, and dry-aged short loin. The priciest cuts are the Australian Blackmore Wagyu; the 42-ounce bone-in rib-eye goes for $390. “Blackmore Wagyu is probably the best beef raised outside Japan, and only a handful of other butcher shops carry it,” says butcher Andrew Sutton. \nBelcampo, California \nBelcampo founder Anya Fernald, a leader in the humanely raised animal movement, raises her 2,500 cows in Northern California. She then sources them to Belcampo locations around the state, from downtown Los Angeles to Palo Alto. The hybrid butcher shop carries beef alongside free-range poultry and pork. The restaurants specialize in burgers, including 100-day dry-aged patties. The newest location, opening in March, will be Belcampo Oakland, where the bar will feature the BBQ Manhattan, with barbecue bitters and beef jerky garnish. For inspired do-it-yourselfers, Belcampo’s meat camp is a two-day experience that teaches the craft of butchery and beef cooking near the base of Mt. Shasta. \nMarin Sun Farms, Point Reyes Station, Calif. \nThis farm off the coast in Marin County is known for its primo ingredients and outstanding selection of grass-fed, locally raised pork, chicken, lamb, goat, and beef. The Point Reyes restaurant offers a variety of steak frites (filet mignon, goat loin, and pork loin chop) and terrific burgers (beef, lamb, or goat). There’s also a list of local wines and beers. Marin Sun Farms has a butcher shop in Oakland, too. \nDai Due, Austin A post shared by Dai Due (@daidue) on Dec 5, 2017 at 2:49pm PST \nFounder Jesse Griffiths is a hero in the world of butchery. Since he opened Dai Due in 2006, Griffiths has been butchering whole animals from ranches around Texas. At the front of the restaurant is a butcher case that might include smoked venison sausages, pork loin, and kielbasa. The grocery section carries salsa, olive oil, and other locally made products. The restaurant has an affinity for game with dishes such as wild boar burgers, but there’s also grilled giant beef rib with chile honey. Another unlikely specialty is tallow coffee, made with rendered beef fat. \nSalt & Time, Austin \nAustin is lucky enough to have two destination butcher shops where you can also eat exceedingly well. The tag line for this spot is “Good things come to those who add salt and wait.” Every place wants to evoke traditional butcher shops: Salt & Time’s meat counter truly feels as if it’s decades-old, with rich red cuts of local meat, such as chuck roast, brisket, and flat iron steaks, and a vast selection of sausages, including fresh chorizo, bratwurst, and lamb merguez. At the rustic wooden tables, you can snack on a butcher’s salad stocked with deli meats, a meatloaf sandwich, or a bologna club sandwich. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-06T02:00:00.000+02:00", "crawled": "2018-01-05T21:24:03.031+02:00", "highlightTitle": ""}