{"organizations": [], "uuid": "9ad600071e143d2b91acac054e0ddbaa1cb134a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/16/104847422-High_School_students.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/high-price-of-college-applications.html", "country": "US", "domain_rank": 767, "title": "High price of college applications", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2018-01-02T20:28:00.000+02:00", "replies_count": 0, "uuid": "9ad600071e143d2b91acac054e0ddbaa1cb134a4"}, "author": "Sarah Berger", "url": "https://www.cnbc.com/2018/01/02/high-price-of-college-applications.html", "ord_in_thread": 0, "title": "High price of college applications", "locations": [], "entities": {"persons": [{"name": "parasa", "sentiment": "none"}, {"name": "ash parasa", "sentiment": "none"}], "locations": [{"name": "new jersey", "sentiment": "none"}, {"name": "denville", "sentiment": "none"}], "organizations": [{"name": "morris county school of technology", "sentiment": "none"}, {"name": "css", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES \nOne high school senior says he is forking over $1,700 for college, even before being admitted. \nAsh Parasa, a high school senior at Morris County School of Technology in Denville, New Jersey, reveals to Money that he will be paying more than a grand for the flurry of fees that come with applying for college. \nAfter adding up the costs associated with submitting 20 college applications, ACT and SAT subject test reports and a supplemental financial aid application — called the CSS — the total comes to $1,700, the high school student says. His parents \"willingly\" spent the money, according to Money , but he acknowledges that the price is pretty steep. \n\"It's a lot of money that I think we shouldn't have to pay just to apply to college,\" Parasa tells Money . The cost of applying \nCollege can be costly long before students even set foot on campus, but some application fees are significantly pricer than others. \nU.S. News and World Report recently ranked the application fees of 967 colleges for the fall of 2016 and found that the average cost was $43, with the most common fee being $50. \nThe survey found, though, 50 colleges with steep application fees of $75 or more. Schools with standout application fees included Stanford University ($90), Columbia University ($85), Duke University ($85) and North Carolina State University ($85). \nParasa's decision to apply to 20 schools is ambitious, and The College Board recommends five to eight applications is typically enough to ensure acceptance into a school. \nStill, once the fees start stacking up, applications can end up taking a major bite out of your budget. Students with limited financial resources, however, have options, and might qualify for an application fee waiver . Colleges are making a lot of money off rejected applications \nTurns out, all those application fees are providing colleges with a steady stream of revenue, CNBC Make It previously reported. \nLendEdu recently calculated how much colleges and universities are making off application fees by using 2015-2016 college admissions data. The schools that topped the list were making millions from ambitious applicants. \nThe University of California-Los Angeles was the top money-maker, and with its application fee of $70 and an enrolled-to-admitted ratio of 35 percent, raked in $5,367,180 off declined applications and $6,488,300 off total applications. show chapters 2:27 PM ET Fri, 1 Dec 2017 | 01:51 \nThe University of California-Berkeley, which has an application fee of $70 and an enrolled-to-admitted ratio of 42 percent, ranked second, making $4,590,110 in revenue off declined applications and $5,522,510 from total applications. \n\"It is important to remember,\" the study notes, \"this money is revenue for the colleges, not profit. To ensure standards and reputations are upheld, colleges must ensure each application is thoroughly reviewed by a university employee — and rightfully so. The colleges transfer this cost onto the prospective student through application fees.\" Make it count \nBefore you start shelling out some serious cash for all those applications, make sure you really maximize your chance of being admitted. \nBen Kaplan, CEO of PR Hacker, recently shared with CNBC Make It his secrets for a perfect application. Kaplan attended Harvard for free after winning a whopping 24 scholarships. \nKeep your message simple, Kaplan recommends, but also highlight something that makes you stand-out from the crowd. You'll also want to hash out how your activities, achievements and extracurriculars will help you achieve your future goals. \n\"Being simple helps you resonate. Being surprising helps you be memorable. And showing significance embodies your application with a deeper purpose,\" Kaplan told CNBC Make It . \nDon't miss:", "external_links": [], "published": "2018-01-02T20:28:00.000+02:00", "crawled": "2018-01-02T20:58:36.003+02:00", "highlightTitle": ""}