{"organizations": [], "uuid": "6dfd6815d35495c87c1399bdb46e108b8d69285b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-semgroup-corporation-to-sell-mexican-asphalt-business-for-70-million.html", "country": "US", "domain_rank": 767, "title": "SemGroup Corporation to Sell Mexican Asphalt Business for $70 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-08T15:00:00.000+02:00", "replies_count": 0, "uuid": "6dfd6815d35495c87c1399bdb46e108b8d69285b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-semgroup-corporation-to-sell-mexican-asphalt-business-for-70-million.html", "ord_in_thread": 0, "title": "SemGroup Corporation to Sell Mexican Asphalt Business for $70 Million", "locations": [], "entities": {"persons": [{"name": "carlin conner", "sentiment": "none"}], "locations": [{"name": "okla.", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}, {"name": "gulf coast", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "semgroup corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "semgroup", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "semmaterials méxico", "sentiment": "none"}, {"name": "houston fuel oil terminal company", "sentiment": "none"}, {"name": "ergon asfaltos méxico hc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TULSA, Okla., Jan. 08, 2018 (GLOBE NEWSWIRE) -- SemGroup ® Corporation (NYSE:SEMG) today announced that it has reached an agreement to sell its asphalt business, SemMaterials México, to Ergon Asfaltos México HC, LLC, for an estimated $70 million including a reimbursement of approximately $15 million of net working capital, subject to customary post-closing adjustments. SemGroup intends to use proceeds from the sale toward its capital raise plan associated with the acquisition of Houston Fuel Oil Terminal Company (HFOTCO) and to pre-fund capital growth projects.\n“Divesting these non-core legacy assets is an important step as we raise capital and clearly define our portfolio of uniquely-advantaged midstream services on the Gulf Coast, Mid-Continent and in Canada,” said SemGroup President and Chief Executive Officer Carlin Conner. “As we enter 2018, we remain focused on executing our strategic plan, enhancing our balance sheet and paying the second HFOTCO payment.”\nSemMaterials México provides asphalt products, technology and pavement services to the Mexico paving market. The business includes 14 in-country terminals and two national laboratories. It is the largest supplier of liquid asphalt cement products and product application services in the country and has a presence in every Mexican territory.\n“I would like to thank the employees of SemMaterials for the many years they’ve committed to safety, sound operations and fiscal excellence,” said Conner. “They’ve built an impressive business that should be an excellent addition to Ergon’s portfolio.”\nThe SemMaterials México sale is expected to close early in the second quarter of 2018, subject to the receipt of certain governmental approvals and the satisfaction of other customary closing conditions.\n“As Ergon has expanded our footprint from coast to coast in the U.S. over the past 36 years, we have been interested in moving into Mexico,” said Baxter Burns, President of Ergon Asphalt & Emulsions, Inc. “The similarities between Ergon and SemMaterials México, from company culture and focus on employees, technology, quality products and safety, made this a perfect fit. We look forward to working with their existing management team and current staff to take Ergon Asfaltos México to the next level.”\nAbout Ergon Asphalt & Emulsions, Inc.\nErgon Asphalt & Emulsions, Inc., is a subsidiary of Ergon, Inc., a group of privately held companies that operate under six primary business segments: Refining & Marketing, Asphalt & Emulsions, Transportation & Terminaling, Oil & Gas, Real Estate and Corporate & Other. Ergon is based in Jackson, Miss.\nAbout SemGroup\nBased in Tulsa, Okla., SemGroup ® Corporation (NYSE:SEMG) is a publicly traded midstream service company providing the energy industry the means to move products from the wellhead to the wholesale marketplace. SemGroup provides diversified services for end-users and consumers of crude oil, natural gas, natural gas liquids, refined products, residual fuel oil and asphalt. Services include purchasing, selling, processing, transporting, terminalling and storing energy.\nSemGroup uses its Investor Relations website and social media outlets as channels of distribution of material company information. Such information is routinely posted and accessible on our Investor Relations website at www.semgroupcorp.com , our Twitter account and LinkedIn account.\nCertain matters contained in this Press Release include “ ” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. We make these in reliance on the safe harbor protections provided under the Private Securities Litigation Reform Act of 1995.\nAll statements, other than statements of historical fact, included in this Press Release may constitute . Although we believe that the expectations reflected in these are reasonable, we cannot assure you that these expectations will prove to be correct. These are subject to certain known and unknown risks and uncertainties, as well as assumptions that could cause actual results to differ materially from those reflected in these . Factors that might cause actual results to differ include the risk factors discussed from time to time in each of our documents and reports filed with the SEC.\nReaders are cautioned not to place undue reliance on any contained in this Press Release, which reflect management’s opinions only as of the date hereof. Except as required by law, we undertake no obligation to revise or publicly release the results of any revision to any .\nInvestor Relations:\nAlisa Perkins\n918-524-8081\ninvestor.relations@semgroupcorp.com\nMedia:\nTom Droege\n918-524-8560\ntdroege@semgroupcorp.com\nSource:SemGroup Corp.", "external_links": ["https://www.globenewswire.com/Tracker?data=YaBtc3xF-5XahFO8tVkbMgZ1K85Zj-ff08pIkH9jHFi2gw4ytxsSrhtRXoM-uUz3iReLDNuK9yevDej44AjXhJkvrW_IGn7UD_eDC8b5C9I=", "https://www.globenewswire.com/Tracker?data=-N_5vVeKFaS2Iq6ZYquVuD0M_MOxKp34eVGCfjT1H73A840gULT0QmMmqVAdYrHrB5fNE4VYNRzwluiTjSgrJG2aUhH0VjdOe5bq2RPglBZl4udMU5y4XXO8b8W091dDqE_kdP-zTvdZqw3Fb1HVNQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f281747a-0daa-4659-a12c-8200bab24f23", "https://www.globenewswire.com/Tracker?data=jKft6Xt3W7ediMhnP-TMTli2cZ4jZXUOiBy9u87QGoAsEwpfz7b5E_d454lvOZ7yCkHV_BPDBiDE7s3oI6ztRhf7qKY2VorqJ1XI4juYdcI="], "published": "2018-01-08T15:00:00.000+02:00", "crawled": "2018-01-08T15:21:13.000+02:00", "highlightTitle": ""}