{"organizations": [], "uuid": "64b3833464399016968de283e89f0185d0d4e2ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/26/104494887-daniel-yergin2.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/23/any-venezuelan-economic-collapse-will-send-oil-markets-down-ihs-yergin.html", "country": "US", "domain_rank": 767, "title": "Any Venezuelan economic collapse will send oil markets down: IHS' Yergin", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:12:00.000+02:00", "replies_count": 0, "uuid": "64b3833464399016968de283e89f0185d0d4e2ef"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/23/any-venezuelan-economic-collapse-will-send-oil-markets-down-ihs-yergin.html", "ord_in_thread": 0, "title": "Any Venezuelan economic collapse will send oil markets down: IHS' Yergin", "locations": [], "entities": {"persons": [{"name": "yergin dan yergin", "sentiment": "negative"}, {"name": "yergin", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "ihs", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "non-opec", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Davos - World Economic Forum Any Venezuelan economic collapse will send oil markets down: IHS' Yergin Dan Yergin, vice chairman of IHS, told CNBC that any upset in the fragile balance within oil market supply and demand could cause prices to tank again The global energy expert said there was \"optimism literally embedded in the snow\" at Davos. 3 Hours Ago | 04:14 \nDan Yergin, energy expert and vice chairman of IHS, said Tuesday that despite optimism helping to support global oil prices, any upset in the fragile balance within oil market supply and demand could cause prices to tank again. \nSpeaking to CNBC at the World Economic Forum (WEF) in Davos, Switzerland, Yergin said there was \"optimism literally embedded in the snow.\" \n\"This is the most optimistic, from an economic point of view, that we've seen in 10 or 12 years, and it reflects the strength of the world economy,\" he said. \nSuch optimism was, he added, \"one of the key factors that's taken oil prices to the level they're at now.\" \nOil prices are currently near three-year highs , bolstered by optimistic growth forecasts from the International Monetary Fund and supply cuts by OPEC and non-OPEC producers, including Russia. \nYergin said that oil prices were also being driven by optimism in financial markets and some geopolitical risk — and the prospect that some oil production could be taken out of the market. \n\"Things can turn around on that and any shock to the global economy would do that (dent prices),\" he said. Hinging on Venezuela \nYergin said that major oil producer and OPEC member Venezuela's production was likely to have fallen 50 percent between 2014, when global oil prices fell dramatically, and 2019. \n\"That's a country just teetering on crisis and teetering on falling apart, and the economy is a disaster. The oil industry is now run by a general who knows nothing about the oil industry,\" he said. \nYergin said IHS predicted that U.S. shale oil production was likely to rise by 1 million barrels per day (bpd) in 2018 but that any Venezuela supply taken out of the market would affect prices. \n\"If you had a real shutdown there it would be a shock to the market and could send it in the other direction,\" he said. \nOil prices have only just started recovering thanks to supply cuts by OPEC and non-OPEC producers. Prices fell from around $114 a barrel in June 2014 to around $25 a barrel in early 2016 on a global glut in supply and lackluster demand. ", "external_links": [], "published": "2018-01-23T17:12:00.000+02:00", "crawled": "2018-01-23T19:58:10.000+02:00", "highlightTitle": ""}