{"organizations": [], "uuid": "972b5716b348989117ff597ed60c521812d2c206", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-boys-girls-clubs-of-america-adds-business-leader-to-its-board.html", "country": "US", "domain_rank": 767, "title": "Boys & Girls Clubs of America Adds Business Leader to Its Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.816, "site_type": "news", "published": "2018-01-09T17:00:00.000+02:00", "replies_count": 0, "uuid": "972b5716b348989117ff597ed60c521812d2c206"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-boys-girls-clubs-of-america-adds-business-leader-to-its-board.html", "ord_in_thread": 0, "title": "Boys & Girls Clubs of America Adds Business Leader to Its Board", "locations": [], "entities": {"persons": [{"name": "sonia s", "sentiment": "negative"}, {"name": "jim clark", "sentiment": "none"}, {"name": "sonia", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "boys & girls clubs of america", "sentiment": "negative"}, {"name": "clubs and boys & girls clubs of america-affiliated youth centers", "sentiment": "none"}, {"name": "navy", "sentiment": "none"}, {"name": "old navy", "sentiment": "none"}, {"name": "club", "sentiment": "none"}, {"name": "boys & girls clubs", "sentiment": "none"}, {"name": "board of governors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 9, 2017 /PRNewswire-USNewswire/ -- Boys & Girls Clubs of America has appointed Sonia Syngal, President and CEO of Old Navy, to the organization's esteemed Board of Governors.\nThe board offers strategic leadership for the organization, guiding the work of more than 4,300 Clubs and Boys & Girls Clubs of America-affiliated Youth Centers on U.S. military installations worldwide. Each year Clubs impact 4 million kids and teens. A leader in youth development, Boys & Girls Clubs of America's vision calls for all Club members to graduate from high school with a plan for the future, demonstrating good character and citizenship, and leading a healthy lifestyle. To achieve this vision, Boys & Girls Clubs work to inspire success through life-changing programs and opportunities to ensure great futures for kids.\n\"We are very happy to add Sonia to the list of influential leaders on our board,\" said Jim Clark, President and CEO of Boys & Girls Clubs of America. \"Old Navy has been a valued partner for us for many years, championing great futures for all kids and teens. We look forward to Sonia's leadership and engagement as we work together to create a brighter tomorrow for America's kids.\"\nSyngal joins a board comprising many other prominent leaders from the business, civic, academic and entertainment fields, including: Thomas J. Falk, Chairman/CEO, Kimberly-Clark; Ronald L. Sargent, Chairman/CEO, Staples; Carrie Schwab-Pomerantz, President, Charles Schwab Foundation; Jeff Fettig, Chairman and CEO Whirlpool; Rick Goings, Chairman/CEO, Tupperware Brands Corporation; Condoleezza Rice, former U.S. Secretary of State and Senior Fellow, Stanford University; and Denzel Washington, Oscar-winning actor and BGCA national spokesperson.\nSonia Syngal\nSonia Syngal is President and CEO of Old Navy leading the $7 billion business across all geographies and channels with a team of 56,000 employees.\nA design driven, innovative leader, Sonia has delivered growth and unlocked revenue potential across multiple functions and industries.\nIn her 12 years with Gap Inc. Sonia has held leadership roles across Gap, Banana Republic, Old Navy, Athleta and Intermix, most recently leading the company's global supply chain and product to market model, and before that as Managing Director of Europe.\nPrior to Gap Inc., Sonia had a successful career in Fortune 500 product companies, including 10 years at Sun Microsystems and six years at Ford Motor Co.\nSonia holds a Master's degree in Manufacturing Systems Engineering from Stanford University and a Bachelor's degree in Mechanical Engineering from Kettering University. She serves on the Gap Foundation Board of Trustees.\nAbout Boys & Girls Clubs of America\nFor more than 150 years, Boys & Girls Clubs of America ( bgca.org ) has enabled young people most in need to achieve great futures as productive, caring, responsible citizens. Today, 4,300 Clubs serve 4 million young people annually through Club membership and community outreach. Clubs are located in cities, towns, public housing and on Native lands throughout the country, and serve military families in BGCA-affiliated Youth Centers on U.S. military installations worldwide. They provide a safe place, caring adult mentors, fun, friendship, and high-impact youth development programs on a daily basis during critical non-school hours. Priority programs emphasize academic success, good character and citizenship, and healthy lifestyles. In a Harris Survey of alumni, 57 percent said the Club saved their lives. National headquarters are located in Atlanta. Learn more at http://www.bgca.org/facebook and http://bgca.org/twitter .\nView original content with multimedia: http://www.prnewswire.com/news-releases/boys--girls-clubs-of-america-adds-business-leader-to-its-board-300579358.html\nSOURCE Boys & Girls Clubs of America", "external_links": ["http://www.prnewswire.com/news-releases/boys--girls-clubs-of-america-adds-business-leader-to-its-board-300579358.html", "https://www.bgca.org/", "http://bgca.org/twitter", "http://www.bgca.org/facebook"], "published": "2018-01-09T17:00:00.000+02:00", "crawled": "2018-01-09T19:04:01.024+02:00", "highlightTitle": ""}