{"organizations": [], "uuid": "c3ce2854db632c936df8c624947e4360a00f4f61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/cnbc-exclusive-transcript-dallas-fed-president-robert-kaplan-speaks-with-cnbcs-steve-liesman-today-on-squawk-box.html", "country": "US", "domain_rank": 767, "title": "CNBC EXCLUSIVE: TRANSCRIPT: DALLAS FED PRESIDENT ROBERT KAPLAN SPEAKS WITH CNBC’S STEVE LIESMAN TODAY ON “SQUAWK BOX”", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-12T19:23:00.000+02:00", "replies_count": 0, "uuid": "c3ce2854db632c936df8c624947e4360a00f4f61"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/cnbc-exclusive-transcript-dallas-fed-president-robert-kaplan-speaks-with-cnbcs-steve-liesman-today-on-squawk-box.html", "ord_in_thread": 0, "title": "CNBC EXCLUSIVE: TRANSCRIPT: DALLAS FED PRESIDENT ROBERT KAPLAN SPEAKS WITH CNBC’S STEVE LIESMAN TODAY ON “SQUAWK BOX”", "locations": [], "entities": {"persons": [{"name": "steve liesman", "sentiment": "negative"}, {"name": "robert kaplan", "sentiment": "negative"}, {"name": "rob", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "kaplan", "sentiment": "none"}, {"name": "becky", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "cnbc exclusive", "sentiment": "none"}, {"name": "dallas fed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHEN: Today, Friday, January 12th\nWHERE: CNBC's \"Squawk Box\"\nFollowing is the unofficial transcript of a CNBC EXCLUSIVE interview with Dallas Fed President Robert Kaplan on CNBC's \"Squawk Box\" (M-F 6AM-9AM) today, Friday, January 12, 2018. Following is a link to the video on CNBC.com: https://www.cnbc.com/video/2018/01/12/feds-robert-kaplan-weve-marked-up-our-gdp-forecast-to-2-point-5--2-point-75-percent-in-2018.html .\nAll references must be sourced to CNBC.\nSTEVE LIESMAN: BECKY, GOOD MORNING. I'M HERE ACROSS TOWN WITH DALLAS FED PRESIDENT ROBERT KAPLAN. THANKS FOR JOINING US, ROB.\nROBERT KAPLAN: GOOD TO BE HERE, STEVE.\nLIESMAN: PRESIDENT KAPLAN, EXCUSE ME.\nKAPLAN: THANK YOU.\nLIESMAN: LET'S GET RIGHT TO IT. LAST TIME WE TALKED, YOU HAD NOT RAISED OR ALTERED YOUR ECONOMIC FORECAST BECAUSE OF THE TAX CUTS.\nKAPLAN: RIGHT.\nLIESMAN: I THINK IT WAS EARLY DAYS. YOU HADN'T QUITE PASSED YET. HAVE YOU DONE SO NOW?\nKAPLAN: YES.\nLIESMAN: BY HOW MUCH?\nKAPLAN: FOR 2018 WE'VE MARKED UP OUR GDP FORECAST BY A FEW TENTHS OF A PERCENTAGE POINT. SO WE'RE NOW EXPECTING 2.5%, 2.75% GDP GROWTH FOR 2018. A LITTLE LESS OF A POSITIVE EFFECT FOR '19 AND EVEN A LITTLE LESS FOR '20, SO WE THINK THE EFFECT OF THE TAX LAW WILL BE FRONT-END LOADED AND WILL TAIL OFF IN THE OUT YEARS.\nLIESMAN: WHY DOES IT TAIL OFF?\nKAPLAN: WELL, THE FIRST – THERE'S A CORPORATE TAX REFORM ELEMENT WE HOPE THAT PART WILL BE SUSTAINABLE. WHICH ENCOURAGES PEOPLE TO DOMICILE HERE, INVEST HERE, ALL THAT. THERE'S A PART OF THIS WHICH IS A TAX CUT FINANCED BY INCREASE IN THE DEBT. THAT PART IS THE PART WHERE I WAS MORE CONCERNED ABOUT WHICH GIVES YOU A SHORT-TERM BUMP WHICH THEN TAILS OFF IN THE OUT YEARS. AND SO THATS THE REASON FOR THIS.\nLIESMAN: OKAY. SO YOU CAN WRITE THE NEXT QUESTION I'M GOING TO ASK YOU. IF YOU BUMPED YOUR GDP FORECAST, HAVE YOU CHANGED YOUR RATE OUTLOOK?\nKAPLAN: MY BASE CASE IS STILL THAT WE SHOULD INCREASE RATES THREE TIMES THIS YEAR. I PROBABLY HAVE A LITTLE MORE STRONGER CONVICTION, THE THREE TIMES, NOT LESS THAN THREE TIMES IS APPROPRIATE. IT'S POSSIBLE THAT IT COULD BE MORE THAN THREE TIMES BUT THAT'S STILL THE BASE CASE. AND I HAVE MORE CONVICTION THAT WE'RE GOING TO GET DOWN INTO THE THREES IN TERMS OF HEADLINE UNEMPLOYMENT – IE: WE'RE GOING TO OVERSHOOT FULL EMPLOYMENT AND HAVE A MORE TIGHTER JOB MARKET THAN EVEN WE WOULD HAVE HAD.\nLIESMAN: DOES THAT MAKE YOU NERVOUS ABOUT THE SUSTAINABILITY OF THE EXPANSION? ARE YOU GOING TO HAVE TO, AS A CENTRAL BANKER, LEAN AGAINST THAT KIND OF LOW UNEMPLOYMENT RATE?\nKAPLAN: THE HISTORY OF OVERSHOOTING FULL EMPLOYMENT IN THIS COUNTRY HAS NOT BEEN A HAPPY ONE. NORMALLY WHAT HAPPENS IS YOU GET AN OVERHEATING. THE FED THEN HAS TO THEN PLAY CATCHUP AND WHAT HAPPENS THEN IS YOU TEND TO HAVE -- OFTEN HAVE A RECESSION OR AN INVERTED YIELD CURVE AND A RECESSION. SO IT'S MY VIEW THE BEST WAY TO PROLONG THIS EXPANSION IS FOR US TO MOVE NOW – IN A GRADUAL WAY – BUT TO CONTINUE TO REMOVE ACCOMMODATION. AND I THINK THAT THAT GIVES US A BEST CHANCE TO EXTEND THIS EXPANSION.\nLIESMAN: SO MAYBE IT IS WORTH TELLING PEOPLE. THE REASON WE DO THIS, THAT YOU COME ON AND WE TALK IS WE'RE TRYING TO UNDERSTAND THE REACTION FUNCTION.\nKAPLAN: RIGHT.\nLIESMAN: WHAT INPUT OF DATA CAUSES WHAT REACTION BY YOUR CENTRAL BANKERS. TELL ME WHAT A SCENARIO OF FOUR RATE HIKES LOOK LIKE. IS THAT A 3.5% UNEMPLOYMENT RATE? DOES THAT LEAD TO YOU A FOUR-RATE HIKE SCENARIO?\nKAPLAN: I WOULD RATHER NOT SPECULATE BECAUSE THE ECONOMY IS GOING TO UNFOLD AND VIEWS ARE GOING TO CHANGE AND SO I WOULD RATHER JUST STICK WITH BASE CASE IS THREE. I'M STILL FOCUSED ON, THOUGH, THE BIG DRIVERS OF ECONOMIC GROWTH. NOT JUST IN '18, BUT IN THE OUT YEARS. AGING POPULATION, SLOWING WORK FORCE GROWTH, SLUGGISH PRODUCTIVITY – NOT AT COMPANIES. COMPANIES ARE GOING TO BE FAR MORE PRODUCTIVE, AND THEY ARE BECOMING FAR MORE PRODUCTIVE. I'M WORRIED ABOUT WHAT HAPPENS TO WORKERS, PARTICULARLY HIGH SCHOOL EDUCATED AND LESS WHO GET SQUEEZED OUT, DON'T GET RETRAINED AND FIND THEIR INCOMES GOING DOWN. THOSE ARE STILL THE DRIVERS THAT I WOULD RATHER FOCUS ON.\nLIESMAN: BUT WE HAVE SITUATIONS LIKE WALMART YESTERDAY RAISING THE MINIMUM WAGE. SO IT LOOKS LIKE ON THE LOW END, SKILLS AREA OF THE JOB MARKET, THOSE WAGES ARE GOING UP.\nKAPLAN: YES. THAT'S RIGHT. SO HERE'S WHAT WE'RE SAYING AND WHAT I'M SAYING WHEN I TALK TO BUSINESSES AND ON OUR SURVEYS. IF YOU HAVE A SKILL SKILLED WORKERS – I.T. SPECIALISTS, REGISTERED NURSES, CONSTRUCTION WORKERS, OIL FIELD WORKERS, WIDENING SHORTAGES. HALF OF ALL SMALL BUSINESSES SAY THEY CANT FIND SKILLED WORKERS. THEN IF YOU MAKE LESS THAN $15 AN HOUR, $10, $11, $12 AN HOUR WORKER, THERE'S NO QUESTION THERE IS WAGE PRESSURE THERE, WHICH IS WHY YOU'RE SEEING COMPANIES REACT. IF YOU'RE MAKING $20 AN HOUR, THOUGH, OR MORE, THE SUPPLY/DEMAND IN THE WORKFORCE IS STILL PRETTY GOOD.\nLIESMAN: ONE THING OF A LOT OF IMPORTANCE TO YOU IS THE OIL PRICE. IT'S GONE UP NEAR $70. WHAT'S YOUR EXPECTATION FOR SUPPLY WHEN IT COMES TO OIL AND WHAT DOES THAT MEAN FOR PRICES?\nKAPLAN: 2017 WAS A BIG YEAR FOR INCREASE IN SUPPLY IN THE UNITED STATES. YOU'RE GOING TO HAVE ANOTHER BIG YEAR IN '18. WHAT DO I MEAN BY THAT? OUR BEST JUDGMENT JUST IN THE PERMIAN BASIN, BUT THAT'S ABOUT 70, 75% OF U.S. PRODUCTION, WE THINK THE PERMIAN BASIN RIGHT NOW, OUR BEST ESTIMATE, WILL BE UP 700,000 IN NEW PRODUCTION NET.\nLIESMAN: WOW.\nKAPLAN: SO U.S. PRODUCTION RIGHT NOW LET'S SAY ENDED LAST YEAR AT 9.6, 9.7. WE THINK U.S. PRODUCTION COULD BE UP INTO THE LOW TO MID-10s. SO 10.25, 10.5 MILLION. BUT CERTAINLY 10.25 MILLION U.S. PRODUCTION AND BY THE END OF '19, THAT COULD BE 11 MILLION U.S. PRODUCTION. SO U.S. DRILLING IS GOING UP. NOW WHAT WILL HAPPEN IS –\nLIESMAN: I'VE GOT TO DO ONE MORE HERE REAL QUICKLY. CHINA RECENTLY, THERE WAS A CONCERN ABOUT IT BUYING BONDS. HOW MUCH CONCERN DOES THAT CAUSE YOU FOR RATES AND WE ARE OUT OF TIME SO I HAVE TO ASK YOU TO GIVE ME A QUICK ANSWER.\nKAPLAN: THE QUICK ANSWER IS I STILL BELIEVE THERES OVER 20 TRILLION OF CENTRAL BANK LIQUIDITY IN THE WORLD. AND SO CHINA'S REBALANCING I THINK OUGHT TO BE MANAGEABLE. WE'LL HAVE TO BE VIGILANT ABOUT IT, BUT I THINK IT WILL BE MANAGEABLE.\nLIESMAN: ROBERT KAPLAN, DALLAS FED PRESIDENT, THANKS FOR JOINING US. AND THANKS FOR THE SHORT ANSWER ON THE BACK END THERE.\nAbout CNBC:\nWith CNBC in the U.S., CNBC in Asia Pacific, CNBC in Europe, Middle East and Africa, and CNBC World, CNBC is the recognized world leader in business news and provides real-time financial market coverage and business information to more than 409 million homes worldwide, including more than 91 million households in the United States and Canada. CNBC also provides daily business updates to 400 million households across China. The network's 15 live hours a day of business programming in North America (weekdays from 4:00 a.m. - 7:00 p.m. ET) is produced at CNBC's global headquarters in Englewood Cliffs, N.J., and includes reports from CNBC News bureaus worldwide. CNBC at night features a mix of new reality programming, CNBC's highly successful series produced exclusively for CNBC and a number of distinctive in-house documentaries.\nCNBC also has a vast portfolio of digital products which deliver real-time financial market news and information across a variety of platforms including: CNBC.com; CNBC PRO, the premium, integrated desktop/mobile service that provides live access to CNB", "external_links": ["http://www.nbcumv.com/programming/cnbc"], "published": "2018-01-12T19:23:00.000+02:00", "crawled": "2018-01-12T21:00:45.019+02:00", "highlightTitle": ""}