{"organizations": [], "uuid": "67378f7b6a0f0b0280679109ee69bb4c08d9b96a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221402799&w=1200&r=LYNXMPEE0B0JM", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-kering-puma-de-stocks/puma-shares-slump-as-luxury-group-kering-plans-spin-off-idUKKBN1F10Z4", "country": "US", "domain_rank": 408, "title": "Puma shares slump as luxury group Kering plans spin-off", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T12:06:00.000+02:00", "replies_count": 0, "uuid": "67378f7b6a0f0b0280679109ee69bb4c08d9b96a"}, "author": "", "url": "https://uk.reuters.com/article/uk-kering-puma-de-stocks/puma-shares-slump-as-luxury-group-kering-plans-spin-off-idUKKBN1F10Z4", "ord_in_thread": 0, "title": "Puma shares slump as luxury group Kering plans spin-off", "locations": [], "entities": {"persons": [{"name": "emma thomasson", "sentiment": "none"}, {"name": "sarah white", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}], "organizations": [{"name": "kering", "sentiment": "negative"}, {"name": "puma", "sentiment": "negative"}, {"name": "gucci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "yves saint laurent", "sentiment": "none"}, {"name": "bank of", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 10:07 AM / Updated 10 minutes ago Puma shares slump as luxury group Kering plans spin-off Sarah White , Emma Thomasson 4 Min Read \nPARIS/BERLIN (Reuters) - Puma ( PUMG.DE ) shares tumbled on Friday after French parent Kering ( PRTP.PA ) said it would spin-off the German sportswear group to its shareholders and focus solely on its luxury fashion and jewellery labels. FILE PHOTO: The logo of German sports goods firm Puma is seen at the entrance of one of its stores in Vienna, Austria, March 18, 2016. REUTERS/Leonhard Foeger/File Photo \nKering, whose brands range from Gucci to Yves Saint Laurent, plans to distribute 70 percent of Puma to its own investors, retaining only a 16 percent stake in a business which is finally making strides after 10 years under its ownership. \nInvestors initially welcomed Kering’s long-awaited move to shed its remaining non-luxury brands, sending its shares to record highs. They later retreated to trade down 0.5 percent. \nPuma shares fared worse, slumping at one stage by 15 percent to nine-month lows. They were down 5.5 percent in mid-day trading, and analysts at Bank of America Merrill Lynch downgraded their rating to “underperform” from “buy”. \nSome investors had hoped Puma - with a 5 billion euro ($6 billion) market value, just below the price tag Kering bought it at in 2007 - might be sold at a premium and acquire another strong backer. \n“The market is disappointed as it wanted an outright Puma sale,” a trader said. \nKering - controlled by France’s Pinault family, which would end up with 29 percent of Puma after the spin-off through its Artemis holding - had been expected to shed the German label this year now that it is in recovery mode. \nA distant third in the global sportswear market behind Nike and local rival Adidas, Puma has refocused on popular sports such as soccer, running and motorsport after struggling for years. \nIt named singer Rihanna as creative director in 2014, seeking to tap into booming sales of women’s sportswear, and recent footwear collections have done well, helping Puma increase its profit guidance three times last year. \nAn upturn in the luxury goods industry, meanwhile, underpinned by a revival of Chinese demand, has boosted Kering’s fashion brands, and analysts said many of these, including Balenciaga, had strong potential. NO SALE \nKering managers said the group had preferred to avoid a drawn-out disposal of Puma to a third party, though the German firm said there had been interest from buyers. \n“There were a load of interested parties,” Puma CEO Bjoern Gulden told reporters on a call on Friday. \n“But for us this is the best option.” \nRothschild and boutique d‘Angelin advised Kering on the deal, while JP Morgan advised Puma, sources familiar with the matter said. \n“A spin-off was the only way Pinault could participate in the further potential upside of Puma,” a person close to the situation said, adding no formal sales process had gotten underway. \nGulden said Puma could make faster decisions as an independent company than as a subsidiary of another firm. \nThe deal will increase Puma’s free-float to around 55 percent from 14 percent now, which some analysts also deemed a positive, as it makes it easier to buy and sell the shares. \n“We welcome this development, which if approved by shareholders, will increase Puma’s free-float making it investable again for the first time in around 10 years. At the same time, Kering will be now able to focus purely on its luxury goods business, where we continue to see value,” analysts at brokerage Berenberg wrote in a note. \nKering rivals larger groups such as France’s LVMH ( LVMH.PA ), owner of Louis Vuitton, though until recently it traded at a discount to luxury peers in terms of forward earnings (see graphic). A stellar performance at Gucci has helped it catch up. \nKering had already rid itself of retail assets such as CD and book business Fnac and online retailer La Redoute. \nIts skatewear label Volcom, acquired in 2011 for $608 million, will now also likely be on the block. \n(Graphic for Jan 12 Kering versus competitors valuations, click reut.rs/2Dp5Kgf ) Reporting by Sudip Kar-Gupta and Sarah White in Paris, Emma Thomasson in Berlin, Helen Reid in London and Arno Schuetze in Frankfurt; Additional reporting by Thyagaraju Adinarayan; Editing by Keith Weir and Mark Potter", "external_links": [], "published": "2018-01-12T12:06:00.000+02:00", "crawled": "2018-01-12T12:29:15.015+02:00", "highlightTitle": ""}