{"organizations": [], "uuid": "d1fba9b95bceeb24383577ed113707c7d26b0ebf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-alorica-names-its-first-ever-chief-employee-experience-officer.html", "country": "US", "domain_rank": 767, "title": "Alorica Names Its First-Ever Chief Employee Experience Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-23T16:05:00.000+02:00", "replies_count": 0, "uuid": "d1fba9b95bceeb24383577ed113707c7d26b0ebf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-alorica-names-its-first-ever-chief-employee-experience-officer.html", "ord_in_thread": 0, "title": "Alorica Names Its First-Ever Chief Employee Experience Officer", "locations": [], "entities": {"persons": [{"name": "drive gre", "sentiment": "negative"}, {"name": "king", "sentiment": "none"}, {"name": "tania", "sentiment": "none"}, {"name": "andy lee", "sentiment": "none"}, {"name": "alorica", "sentiment": "none"}, {"name": "tania king", "sentiment": "none"}], "locations": [{"name": "alorica", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "world", "sentiment": "negative"}, {"name": "compliance and global security", "sentiment": "none"}, {"name": "human resources", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tania King Steps into Larger Role at World’s Third Largest Customer Engagement Provider to Drive Greater Client Value by Enhancing Employee Experience Globally\nIRVINE, Calif.--(BUSINESS WIRE)-- Alorica, the world’s leading platform for all customer interactions, today announced the appointment of Tania King as Chief Legal and Employee Experience Officer. Since January 2017, King has served as Chief Legal and Compliance Officer for Alorica, while also overseeing the company’s Human Resources team as interim Chief Human Resources Officer for the past six months. In her new role, King will continue to report directly to Andy Lee, CEO and Chairman of Alorica, to lead Alorica’s Employee Experience initiatives. She will also continue her stewardship of the company’s Legal, Compliance and Global Security functions.\n“Tania’s outstanding leadership in the development of our end-to-end people interactions makes her the perfect fit for this role,” said Andy Lee, CEO and Chairman of Alorica. “Tania embraces Alorica’s philosophy of building an internal culture of engagement and satisfaction that ultimately impacts customer interactions. She understands our unique way of attracting and retaining talented employees around the world who then provide insanely great experiences to our clients’ customers every day.”\nAs a member of the executive leadership team, King will partner with leaders throughout the company to ensure Employee Experience initiatives remain aligned with the company’s business strategy. She will also work with Alorica leaders across the globe to assess employee programs, identifying strengths and opportunities for improvement.\n“A world-class employee experience begins with creating an emotional connection between our employees and our brand,” said Tania King, Chief Legal and Employee Experience Officer for Alorica. “An important part of that connection is our culture, which centers around engaging and supporting our employees in a collaborative, family atmosphere. Other factors include utilizing technology and enhancing digital tools specifically for our employees as an investment in their development.”\nSince King joined the organization in early 2017, she has expertly transformed the Legal department into strategic partners, aligned by industry verticals, and has also served as interim Chief Human Resources Officer for the past six months.\nAbout Alorica\nAt Alorica, we only do one thing -- we make lives better. How? As the world’s leading platform for all customer interactions, we create insanely great experience for customers fueled by innovative technology, advanced data analytics, and CX intelligence. Utilizing insights from more than 600 million consumer interactions curated annually, Alorica is a systems integrator of choice to 25 of the Fortune 50 healthcare companies, six of the 10 largest financial institutions, four of the five largest telecommunications companies, and five of the largest retail companies. We call the OC home, headquartered in Irvine, Calif., with more than 100,000 employees in approximately 150 locations across 17 countries and 11 time zones around the globe.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005403/en/\nAlorica\nErica McCarthy, 949.527.4761\nErica.McCarthy@Alorica.com\nor\nSunny Yu, 949.527.5548\nSunny.Yu@Alorica.com\nSource: Alorica", "external_links": ["http://www.businesswire.com/news/home/20180123005403/en/"], "published": "2018-01-23T16:05:00.000+02:00", "crawled": "2018-01-23T18:24:37.001+02:00", "highlightTitle": ""}