{"organizations": [], "uuid": "f20b13197737f7c58f94c7cf7e06df7c50787b35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-aurinia-pharmaceuticals-files-new-preliminary-base-shelf-prospectus-to-replace-expired-base-shelf-prospectus.html", "country": "US", "domain_rank": 767, "title": "Aurinia Pharmaceuticals Files New Preliminary Base Shelf Prospectus to Replace Expired Base Shelf Prospectus", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-05T00:37:00.000+02:00", "replies_count": 0, "uuid": "f20b13197737f7c58f94c7cf7e06df7c50787b35"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-aurinia-pharmaceuticals-files-new-preliminary-base-shelf-prospectus-to-replace-expired-base-shelf-prospectus.html", "ord_in_thread": 0, "title": "Aurinia Pharmaceuticals Files New Preliminary Base Shelf Prospectus to Replace Expired Base Shelf Prospectus", "locations": [], "entities": {"persons": [], "locations": [{"name": "british columbia", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "alberta", "sentiment": "none"}, {"name": "aurinia", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}], "organizations": [{"name": "aurinia pharmaceuticals inc.", "sentiment": "negative"}, {"name": "sec", "sentiment": "none"}, {"name": "canada multijurisdictional disclosure system", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VICTORIA, British Columbia--(BUSINESS WIRE)-- Aurinia Pharmaceuticals Inc. (NASDAQ: AUPH / TSX: AUP) (“ Aurinia ” or the “ Company ”) today announced that in order to replace its prior expired base shelf prospectus and corresponding shelf registration statement it has filed a preliminary short form base shelf prospectus (the “ Preliminary Shelf Prospectus ”) with the securities commissions in each of the provinces of Ontario, Alberta and British Columbia in Canada, and a corresponding shelf registration statement on Form F-10 with the U.S. Securities and Exchange Commission (the “ SEC ”) under the U.S./Canada Multijurisdictional Disclosure System.\nThe Preliminary Shelf Prospectus and corresponding shelf registration statement, when made final or effective, will allow Aurinia to offer up to US$250,000,000 of common shares, warrants, subscription receipts, debt securities or any combination thereof during the 25-month period that the Preliminary Shelf Prospectus is effective. The Company has no immediate intention to undertake an offering. However, the Preliminary Shelf Prospectus will enable Aurinia to potentially access new capital if and when needed. The amount and timing of any future offerings will be based on the Company’s financial requirements and market conditions at the time. In addition, the Preliminary Shelf Prospectus and corresponding shelf registration statement allows Aurinia to meet its contractual obligation to maintain a valid registration statement to certain holders of warrants issued under a private placement that took place in June 2016.\nThe specific terms of any future offering under the Preliminary Shelf Prospectus will be established at the time of such offering. At the time any of the securities covered by the Preliminary Shelf Prospectus are offered for sale, a prospectus supplement containing specific information about the terms of such offering will be filed with applicable Canadian securities regulatory authorities and the SEC.\nThe shelf registration statement filed today with the SEC has not yet become effective. No securities may be sold, nor may offers to buy be accepted, prior to the time the registration statement becomes effective. This news release shall not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities in any jurisdiction in which an offer, solicitation or sale would be unlawful prior to registration or qualifications under the securities laws of any such jurisdiction.\nA copy of the Preliminary Shelf Prospectus can be found on SEDAR at www.sedar.com and a copy of the corresponding shelf registration statement can be found on EDGAR at www.sec.gov or may be obtained upon request to Aurinia’s Investor Relations Department using the contact information set out below.\nAbout Aurinia\nAurinia is a clinical stage biopharmaceutical company focused on developing and commercializing therapies to treat targeted patient populations that are suffering from serious diseases with a high unmet medical need. The company is currently developing voclosporin, an investigational drug, for the treatment of lupus nephritis, focal segmental glomerulosclerosis, minimal change disease and dry eye syndrome. The company is headquartered in Victoria, BC and focuses its development efforts globally.\nForward-Looking Statement Disclaimer\nCertain of the statements made in this news release may contain forward-looking information within the meaning of applicable Canadian securities law and forward-looking statements within the meaning of applicable United States securities law. Forward-looking information or statements may not be based on historical fact, and may include without limitation statements containing the words “believe”, “may”, “plan”, “will”, “estimate”, “continue”, “anticipate”, “intend”, “expect” and similar expressions. Forward-looking statements in this news release include statements regarding the Preliminary Shelf Prospectus and corresponding shelf registration statement being cleared by the applicable securities regulatory authorities and Aurinia’s ability to take advantage of financing opportunities in favourable market conditions or at all. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause the actual results, events or developments to be materially different from any future results, events or developments expressed or implied by such forward-looking statements. Many such known risks, uncertainties and other factors are taken into account as part of the Company’s assumptions underlying these forward-looking statements and include, among others, the following: general economic and business conditions in the United States, Canada, Europe, and the other regions in which Aurinia operates; not receiving the regulatory approvals, including the further approvals that may be sought from securities regulatory authorities or the SEC, on the timelines required or at all, that the prevailing market price of the Company’s securities may make a prospectus offering in respect of such securities unattractive to Aurinia as well as those factors discussed in or referred to under the heading “Risk Factors” in Aurinia’s Annual Report on Form 40-F for the year ended December 31, 2016 which is available under Aurinia’s profile on SEDAR at www.sedar.com and on EDGAR at www.sec.gov . Given these risks, uncertainties and factors, you are cautioned not to place undue reliance on such forward-looking statements and information, which are qualified in their entirety by this cautionary statement. All forward-looking statements and information made herein are based on our current expectations and we undertake no obligation to revise or update such forward-looking statements and information to reflect subsequent events or circumstances, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104006404/en/\nAurinia Pharmaceuticals Inc.\nInvestors & Media:\nCelia Economides\nVice-President, Public Affairs\nceconomides@auriniapharma.com\nor\nDennis Bourgeault\nChief Financial Officer\ndbourgeault@auriniapharma.com\nSource: Aurinia Pharmaceuticals Inc.", "external_links": ["http://www.businesswire.com/news/home/20180104006404/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51738214&newsitemid=20180104006404&lan=en-US&anchor=www.sec.gov&index=4&md5=e8521833c8e1f044e5fc22681ed6735c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sedar.com&esheet=51738214&newsitemid=20180104006404&lan=en-US&anchor=www.sedar.com&index=1&md5=5edf38af50092fb7af3c598470fdab62", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sedar.com&esheet=51738214&newsitemid=20180104006404&lan=en-US&anchor=www.sedar.com&index=3&md5=ce375938caabc0e579a36edb30f7b0f5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51738214&newsitemid=20180104006404&lan=en-US&anchor=www.sec.gov&index=2&md5=cfda4f797418d116e799e6ed1a531e09"], "published": "2018-01-05T00:37:00.000+02:00", "crawled": "2018-01-05T01:23:42.052+02:00", "highlightTitle": ""}