{"organizations": [], "uuid": "12800bd1e675f14270187b46aa788343710382ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-cardiamp-cell-therapy-receives-fda-approval-for-pivotal-trial-in-chronic-myocardial-ischemia.html", "country": "US", "domain_rank": 767, "title": "CardiAMP Cell Therapy Receives FDA Approval for Pivotal Trial in Chronic Myocardial Ischemia", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.993, "site_type": "news", "published": "2018-01-30T03:51:00.000+02:00", "replies_count": 0, "uuid": "12800bd1e675f14270187b46aa788343710382ef"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-cardiamp-cell-therapy-receives-fda-approval-for-pivotal-trial-in-chronic-myocardial-ischemia.html", "ord_in_thread": 0, "title": "CardiAMP Cell Therapy Receives FDA Approval for Pivotal Trial in Chronic Myocardial Ischemia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN CARLOS, Calif.--(BUSINESS WIRE)-- BioCardia®, Inc. [OTC: BCDA], a leader in the development of comprehensive solutions for cardiovascular regenerative therapies, today announced that the U.S. Food and Drug Administration (FDA) has approved an Investigational Device Exemption for the CardiAMP Chronic Myocardial Ischemia (CMI) Trial to treat patients with refractory angina (RA).\nThe CardiAMP Chronic Myocardial Ischemia Trial will be a prospective, multi-center, randomized, sham-controlled, patient- and evaluator-blinded pivotal trial to validate the safety and efficacy of CardiAMP investigational cell therapy in the treatment of patients having CMI with RA. The trial has been approved to enroll up to 343 subjects at up to 40 U.S. centers. This trial has the potential to support functional benefit claims sufficient for product registration without a second confirmatory trial.\nThis second clinical indication of CMI with RA for the CardiAMP investigational cell therapy follows the company’s FDA-approved pivotal clinical trial of CardiAMP cell therapy in ischemic heart failure , which is currently enrolling patients.\nThe CardiAMP investigational cell therapy takes a personalized and minimally-invasive approach to the use of a patient’s own cells (autologous cells) in the treatment of cardiovascular disease. The investigational therapy is designed to stimulate the body’s natural healing response.\nIn the U.S., it is estimated that between 600,000 and 1.8 million patients suffer from RA, with approximately 75,000 new cases diagnosed each year. Despite improvements in revascularization techniques, there is a growing population of patients with chronic refractory angina not amenable to further revascularization that suffer with severely limiting symptoms. These patients suffer from poor perceived health status and psychological distress, have significant impairments in quality of life, and represent a burden to the healthcare system due to significant use of resources. Current therapies have limitations or are associated with minimal reduction in angina.\n“FDA approval of the CardiAMP CMI Trial is another important milestone for the company,” said BioCardia CEO Peter Altman. “It is a step towards developing a new treatment strategy that could have tremendous benefit for patients with refractory angina. Approval of this second pivotal trial further demonstrates BioCardia’s leadership in the treatment of heart disease.”\nAbout BioCardia®\nBioCardia, Inc., headquartered in San Carlos, CA, is developing regenerative biologic therapies to treat cardiovascular disease. CardiAMP® and CardiALLO® cell therapies are the Company’s biotherapeutic product candidates in clinical development. The Company's current products include the Helix™ transendocardial delivery system and the Morph® steerable guide and sheath catheter portfolio. BioCardia also partners with other biotherapeutic companies to provide its Helix systems and clinical support to their programs studying therapies for the treatment of heart failure, chronic myocardial ischemia and acute myocardial infarction.\nThe CardiAMP cell therapy system is investigational and limited by Federal Law to investigational use.\nForward Looking Statements\nThis press release contains forward-looking statements that are subject to many risks and uncertainties. Forward-looking statements include, among other things, references to the enrollment of our CardiAMP HF Trial, the efficacy and safety of our products and therapies, statements regarding our intentions, beliefs, projections, outlook, analyses or current expectations. Such factors include, among others, the inherent uncertainties associated with developing new products or technologies, regulatory approvals, unexpected expenditures, the ability to raise the additional funding needed to continue to pursue BioCardia’s business and product development plans and overall market conditions. We may find it difficult to enroll patients in our clinical trials, which could delay or prevent development of our therapeutic candidates. The rate of enrollment will depend upon the number of clinical sites and their ability to recruit patients that fit our trial profiles, and there could be delays beyond our control. These forward-looking statements are made as of the date of this press release, and BioCardia assumes no obligation to update the forward-looking statements.\nWe may use terms such as “believes,” “estimates,” “anticipates,” “expects,” “plans,” “intends,” “may,” “could,” “might,” “will,” “should,” “approximately” or other words that convey the uncertainty of future events or outcomes to identify these forward-looking statements. Although we believe that we have a reasonable basis for each forward-looking statement contained herein, we caution you that forward-looking statements are not guarantees of future performance and that our actual results, and the development of the industry in which we operate may differ materially from the forward-looking statements contained in this presentation. As a result of these factors, we cannot assure you that the forward-looking statements in this presentation will prove to be accurate. Additional factors that could materially affect actual results can be found in BioCardia’s Form 10-K filed with the Securities and Exchange Commission on March 30, 2017, including under the caption titled “Risk Factors.” BioCardia expressly disclaims any intent or obligation to update these forward-looking statements, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129006263/en/\nInvestor Contact:\nBioCardia, Inc.\nDavid McClung, 650-226-0120\nChief Financial Officer\ninvestors@BioCardia.com\nor\nMedia Contact:\nChronic Communications, Inc.\nMichelle McAdam,949-545-6654\nmichelle@chronic-comm.com\nSource: BioCardia, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cardiamp.com%2F&esheet=51750658&newsitemid=20180129006263&lan=en-US&anchor=pivotal+clinical+trial+of+CardiAMP+cell+therapy+in+ischemic+heart+failure&index=3&md5=380b6311855f60d6c485404da8582c92", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.biocardia.com%2F&esheet=51750658&newsitemid=20180129006263&lan=en-US&anchor=BioCardia%C2%AE%2C+Inc.&index=1&md5=581e751e209525be0ec3e9cc4888fe2b", "http://www.businesswire.com/news/home/20180129006263/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.biocardia.com%2Fproduct_pipeline%2Fbiotherapeutics_cardiAMP_therapy.shtml&esheet=51750658&newsitemid=20180129006263&lan=en-US&anchor=CardiAMP+investigational+cell+therapy&index=2&md5=2fb3fb721faa38254dd9f94ad41c9a13"], "published": "2018-01-30T03:51:00.000+02:00", "crawled": "2018-01-30T07:09:48.787+02:00", "highlightTitle": ""}