{"organizations": [], "uuid": "4d17dcd211d9700bc1750f2a2ab2e68e704851a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-whats-happening-with-these-specialty-chemicals-stocks--albemarle-chemours-w-r-grace-and-kronos-worldwide.html", "country": "US", "domain_rank": 767, "title": "What's Happening With These Specialty Chemicals Stocks? -- Albemarle, Chemours, W.R. Grace, and Kronos Worldwide", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.368, "site_type": "news", "published": "2018-01-25T14:20:00.000+02:00", "replies_count": 0, "uuid": "4d17dcd211d9700bc1750f2a2ab2e68e704851a9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-whats-happening-with-these-specialty-chemicals-stocks--albemarle-chemours-w-r-grace-and-kronos-worldwide.html", "ord_in_thread": 0, "title": "What's Happening With These Specialty Chemicals Stocks? -- Albemarle, Chemours, W.R. Grace, and Kronos Worldwide", "locations": [], "entities": {"persons": [{"name": "-- albemarle", "sentiment": "negative"}, {"name": "al", "sentiment": "none"}], "locations": [{"name": "chemours", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}], "organizations": [{"name": "kronos worldwide new york", "sentiment": "negative"}, {"name": "wallstequities.com", "sentiment": "none"}, {"name": "w.r. grace & co.", "sentiment": "none"}, {"name": "gra", "sentiment": "none"}, {"name": "kro", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "albemarle corp.", "sentiment": "none"}, {"name": "chemours co.", "sentiment": "none"}, {"name": "kronos worldwide inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, January 25, 2018 /PRNewswire/ --\nWallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on ALB, CC, GRA, and KRO which can be accessed for free by signing up to www.wallstequities.com/registration . The global Specialty Chemicals market size was estimated at USD 1.16 trillion in 2016 and is projected to grow at a CAGR of 5.6% from 2017 to 2025, according to a report published in June 2017 by Grand View Research. High demand for function-specific chemicals owing to transitioning consumer and industrial product life cycles has fostered industry growth in recent years, the report further noted. Pre-market today, WallStEquities.com covers the recent performance of the following stocks: Albemarle Corp. (NYSE: ALB), The Chemours Co. (NYSE: CC), W.R. Grace & Co. (NYSE: GRA), and Kronos Worldwide Inc. (NYSE: KRO). All you have to do is sign up today for this free limited time offer by clicking the link below.\nwww.wallstequities.com/registration\nAlbemarle\nOn Wednesday, shares in Charlotte, North Carolina headquartered Albemarle Corp. saw a slight decline of 0.53%, ending the day at $112.40. The stock recorded a trading volume of 2.73 million shares, which was above its three months average volume of 1.49 million shares. The Company's shares have advanced 17.63% over the past year. The stock is trading below its 200-day moving average by 7.79%. Moreover, shares of Albemarle, which develops, manufactures, and markets engineered specialty chemicals worldwide, have a Relative Strength Index (RSI) of 24.77.\nOn January 18 th , 2018, Albemarle announced that Matt Juneau, Executive Vice President, Corporate Strategy & Investor Relations, is retiring in March 2018, and that the Company has named Eric W. Norris as Chief Strategy Officer, effective immediately. In his new role, Norris will be responsible for both Corporate Strategy and Investor Relations. Get the full research report on ALB for free by clicking below at:\nwww.wallstequities.com/registration/?symbol=ALB\nChemours\nShares in Wilmington, Delaware headquartered The Chemours Co. ended the day 1.45% lower at $52.99 with a total trading volume of 1.89 million shares. In the last month and over the past year, the stock has gained 8.10% and 107.89%, respectively. The Company's shares are trading above their 50-day and 200-day moving averages by 4.41% and 12.91%, respectively. Furthermore, shares of Chemours, which provides performance chemicals in North America, Asia/Pacific, Europe, Middle-East, Africa, and Latin America, have an RSI of 54.74.\nOn January 18 th , 2018, Chemours announced that it will release Q4 and full-year 2017 financial results after market close on February 14 th , 2018. The Company will conduct its webcast conference call on February 15 th , 2018, at 8:30 a.m. EST. The live webcast of the call will be available under the investor page of the Company's website. Today's complimentary research report on CC is accessible at:\nwww.wallstequities.com/registration/?symbol=CC\nW.R. Grace\nAt the close of trading on Wednesday, shares in Columbia, Maryland headquartered W.R. Grace & Co. finished 0.31% higher at $74.35 with a total trading volume of 519,714 shares. The stock has advanced 5.76% in the last month, 5.55% over the previous three months, and 5.52% over the past year. The Company's shares are trading above their 50-day and 200-day moving averages by 3.30% and 4.37%, respectively. Additionally, shares of W.R. Grace, which produces and sells specialty chemicals and materials worldwide, have an RSI of 60.95.\nOn January 18 th , 2018, W.R. Grace announced that it will release its Q4 and full-year 2017 financial results on February 08 th , 2018, at 6:00 a.m. ET. A Company-hosted conference call and webcast will follow at 9:00 a.m. ET that day. The live webcast and accompanying slides will be available under the Investor section of the Company's website. Register now for your free research document on GRA at:\nwww.wallstequities.com/registration/?symbol=GRA\nKronos Worldwide\nDallas, Texas headquartered Kronos Worldwide Inc.'s shares recorded a trading volume of 279,172 shares at the end of yesterday's session. The stock closed the day 1.38% lower at $27.81. The Company's shares have advanced 5.94% in the past month and 111.16% over the past year. The stock is trading above its 50-day and 200-day moving averages by 3.37% and 26.19%, respectively. Additionally, shares of Kronos Worldwide, which produces and markets titanium dioxide pigments in Europe, North America, Asia/Pacific, and internationally, have an RSI of 53.51. Click on the link below and see our free report KRO at:\nwww.wallstequities.com/registration/?symbol=KRO\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither WSE nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit\nhttps://wallstequities.com/legal-disclaimer/\nCONTACT\nFor any questions, inquiries, or comments reach out to us directly. If you ' re a company, we are covering and wish to no longer feature on our coverage list contact us via email and/or phone between 09:30 EDT to 16:00 EDT from Monday to Friday at:\nEmail: info@wallstequities.com\nPhone number: +21-32-044-483\nOffice Address: 1 Scotts Road #24-10, Shaw Center Singapore 228\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\nSOURCE Wall St. Equities", "external_links": ["https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration/?symbol=ALB", "http://www.wallstequities.com/registration/?symbol=GRA", "http://www.wallstequities.com/registration/?symbol=KRO", "http://www.wallstequities.com/registration/?symbol=CC", "http://www.wallstequities.com/registration"], "published": "2018-01-25T14:20:00.000+02:00", "crawled": "2018-01-25T14:17:57.017+02:00", "highlightTitle": ""}