{"organizations": [], "uuid": "016c0c1a283bf21d4fa5ee28abf5944e59425a5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222400377&w=1200&r=LYNXMPEE0F0P4", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-autoshow-detroit-continental-m-a/continental-has-6-billion-to-spend-but-no-major-deal-seen-in-2018-ceo-idUSKBN1F519L", "country": "US", "domain_rank": 408, "title": "Continental has $6 billion to spend but no major deal in view: CEO", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T19:37:00.000+02:00", "replies_count": 0, "uuid": "016c0c1a283bf21d4fa5ee28abf5944e59425a5a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-autoshow-detroit-continental-m-a/continental-has-6-billion-to-spend-but-no-major-deal-seen-in-2018-ceo-idUSKBN1F519L", "ord_in_thread": 0, "title": "Continental has $6 billion to spend but no major deal in view: CEO", "locations": [], "entities": {"persons": [{"name": "elmar degenhart", "sentiment": "none"}, {"name": "degenhart", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}], "organizations": [{"name": "continental", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "veyance technologies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (Reuters) - German automotive supplier Continental ( CONG.DE ) has scope to spend around 4 billion to 5 billion euros (up to $6 bln) on acquisitions but has no big takeover deals in sight this year, its chief executive said.\nThe company has been seeking to beef up its non-automotive operations, in part through takeovers of firms such as industrial hose and belt maker Veyance Technologies in 2014, to curb reliance on the volatile cyclical business of carmakers.\n“We have leeway in the ballpark of up to 4 to 5 billion euros,” Chief Executive Elmar Degenhart said in an interview at the Detroit auto show, but added that a larger deal comparable to the 1.4 billion-euro Veyance purchase was not on the cards this year.\n“We still have ideas also for larger takeovers,” he said, adding that none of the possible bigger deals Continental was pondering could be realized in the next 12 months.\n“The timing is always very important and (company) valuations must be in a sensible range,” Degenhart said. “We will not pay unacceptable prices only because we may have cash on hand.”\nContinental reported 5.2 billion euros of liquidity at the end of September and 3.3 billion euros of net debt. It is due to disclose full financial results for 2017 on March 8.\nDegenhart said a jump in the company’s share price to record levels last week on reports about a possible overhaul of Continental’s diversified two-group structure showed “potential for optimizing” how the company is organized.\n“With the mixture of rubber, plastics and electronics businesses we have of course potential in that respect,” he said.\nAs part of the self-driving vehicle platform developed by BMW ( BMWG.DE ), Intel ( INTC.O ) and Mobileye MBLY.N which Continental joined last year, the German supplier has started working on concrete projects related to developing the software for data-based services and automated driving, Degenhart said, declining to be more specific.\nSeparately, the CEO said Continental’s profitability could decline somewhat this year amid spending on two overseas greenfield tyre plants and because of potential rises in raw material prices in the second half of 2018.\nHanover-based Continental last week said its adjusted earnings before interest and taxation (EBIT) margin could drop to 10.5 percent this year from 10.8 percent in 2017, citing preliminary financial results.\nHigher prices for raw materials such as steel, aluminum and plastics last year shaved 450 million euros off sales and further “uncertainties” are looming in the second half.\n“This is not peanuts, we are not talking about 50 million euros,” Degenhart said, without being more specific.\nReporting by Andreas Cremer, editing by Emma Thomasson and Susan Fenton\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T19:37:00.000+02:00", "crawled": "2018-01-16T23:01:46.000+02:00", "highlightTitle": ""}