{"organizations": [], "uuid": "f6e0a855e286e279b0b1eedf7dd4d35f97de9c04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-trade-tariffs/wrapup-1-trump-signs-solar-panel-tariff-angering-u-s-installers-idUSL2N1PI1OJ", "country": "US", "domain_rank": 408, "title": "WRAPUP 1-Trump signs solar panel tariff, angering U.S. installers", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T04:34:00.000+02:00", "replies_count": 0, "uuid": "f6e0a855e286e279b0b1eedf7dd4d35f97de9c04"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-trade-tariffs/wrapup-1-trump-signs-solar-panel-tariff-angering-u-s-installers-idUSL2N1PI1OJ", "ord_in_thread": 0, "title": "WRAPUP 1-Trump signs solar panel tariff, angering U.S. installers", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON/LOS ANGELES Jan 23 (Reuters) - U.S. President Donald Trump signed into law a steep tariff on imported solar panels on Tuesday, a move billed as a way to protect American jobs but which the solar industry said would lead to thousands of layoffs and raise consumer prices.\nChina, the world’s biggest solar panel producer, complained the decision would undermine global trade.\nThe 30 percent tariff on solar panels is among the first unilateral trade restrictions imposed by the administration as part of a broader protectionist agenda intended to help U.S. businesses struggling to compete with companies producing lower-priced goods overseas. The administration also introduced a tariff on imported washing machines.\n“You’re going to have people getting jobs again and we’re going to make our own product again. It’s been a long time,” Trump said as he signed the order.\nBut the solar industry countered that the move will raise the cost of installing panels, quash billions of dollars of investment, and kill tens of thousands of jobs, raising questions about whether Trump’s move will backfire by triggering mass layoffs.\n“We are not happy with this decision,” said Abigail Ross Hopper, president of the U.S. Solar Energy Industries Association, on a conference call with reporters on Tuesday. “It’s just basic economics - if you raise the price of a product it’s going to decrease demand for that product.”\nSEIA predicted that the tariffs could decrease the projected 11 gigawatt of solar forecasted to be installed in the United States this year by 2 GW and lead to the loss of 23,000 jobs this year.\nThe U.S. solar industry employs more than 260,000 workers - about five times more than the coal industry. About 14 percent of those 260,000 jobs are in manufacturing, with installers making up most of the rest of the industry.\nOver the next five years, the tariffs are projected to reduce U.S. solar installation growth by 10 to 15 percent, research firm Wood Mackenzie reckons.\nU.S. Republican Senator John McCain of Arizona, a big solar power producing state, said in a Twitter post that the tariffs amount to “nothing more than a tax on consumers.”\nThe petitioners who sought trade relief, U.S.-based solar manufacturers Suniva and SolarWorld, had asked the Trump administration for the equivalent of a 50 percent tariff, arguing they cannot compete with the cheap imports that have caused panel prices to fall more than 30 percent since 2016.\nBankrupt Suniva is majority-owned by Hong Kong-based Shunfeng International Clean Energy, and SolarWorld is the U.S. arm of Germany’s SolarWorld AG. Shunfeng was up 2.6 percent after the announcement while SolarWorld was up 21 percent.\nOther U.S. solar stocks were mixed, with SunPower Corp , which manufactures panels in Asia, down more than 6 percent and residential installer SunRun Inc. up about 6 percent. The tariffs were broadly in line with investor expectations, creating some relief in the market, analysts said.\nCHINA COMPLAINS The decision was a blow for overseas solar manufacturers, with industry experts anticipating fewer sales in the United States, the world’s fourth-largest solar market after China, Japan and Germany.\nGlobally, solar capacity soared to almost 400 GW last year from under 10 GW in 2007, according to the International Renewable Energy Administration.\nChina branded the move an “overreaction” that would harm the global trade environment for affected products.\n“The U.S.’s decision ... is an abuse of trade remedy measures, and China expresses strong dissatisfaction regarding this,” Wang Hejun, the head of the commerce ministry’s Trade Remedy and Investigation Bureau, said in a statement on its microblog.\n“China will work with other (World Trade Organization) WTO members to resolutely defend its legitimate interests in response to the erroneous U.S. decision.”\nReporting by Nichola Groom; Editing by Susan Thomas\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T04:34:00.000+02:00", "crawled": "2018-01-24T15:22:45.000+02:00", "highlightTitle": ""}