{"organizations": [], "uuid": "e109ee59c3a724280617bbc483c23836649f5c37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225202367&w=1200&r=LYNXMPEE0O1AU", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/mideast-crisis-syria-turkey/turkey-to-u-s-end-support-for-syrian-kurdish-ypg-or-risk-confrontation-idINKBN1FE28R", "country": "US", "domain_rank": 408, "title": "Turkey to U.S.: end support for Syrian Kurdish YPG or risk confrontation", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:18:00.000+02:00", "replies_count": 0, "uuid": "e109ee59c3a724280617bbc483c23836649f5c37"}, "author": "", "url": "https://in.reuters.com/article/mideast-crisis-syria-turkey/turkey-to-u-s-end-support-for-syrian-kurdish-ypg-or-risk-confrontation-idINKBN1FE28R", "ord_in_thread": 0, "title": "Turkey to U.S.: end support for Syrian Kurdish YPG or risk confrontation", "locations": [], "entities": {"persons": [{"name": "tuvan gumrukcu", "sentiment": "none"}, {"name": "manbij", "sentiment": "none"}, {"name": "tayyip erdogan", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "afrin", "sentiment": "none"}, {"name": "dahlia nehme", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ANKARA/BEIRUT (Reuters) - Turkey urged the United States on Thursday to halt its support for Kurdish YPG fighters or risk confronting Turkish forces on the ground in Syria, some of Ankara’s strongest comments yet about a potential clash with its NATO ally.\nThe remarks, from the spokesman for President Tayyip Erdogan’s government, underscored the growing bilateral tensions, six days after Turkey launched its air and ground operation, “Olive Branch”, in Syria’s northwestern Afrin region.\nIn Washington, the Pentagon said that it carefully tracked weapons provided to the YPG and would continue discussions with Turkey.\n“We carefully track those weapons that are provided to them, we ensure that they, to the maximum extent possible, don’t fall into the wrong hands and we’re continuing discussions with the Turks on this issue,” Lieutenant General Kenneth McKenzie, joint staff director, told reporters.\nMcKenzie said Turkey’s operation into Afrin was not helpful and was taking focus away from fighting Islamic State.\nTurkey’s targeting of the YPG, which it views as a security threat, has opened a new front in Syria’s multi-sided civil war. The Syrian Kurdish group is a main part of a U.S.-backed rebel alliance that has inflicted recent defeats on Islamic State militants.\nAny push by Turkish forces towards Manbij, part of a Kurdish-held territory some 100 km (60 miles) east of Afrin, could threaten U.S. efforts in northeast Syria and bring them into direct confrontation with U.S. troops deployed there.\n“Those who support the terrorist organisation will become a target in this battle,” Deputy Prime Minister Bekir Bozdag said.\n“The United States needs to review its solders and elements giving support to terrorists on the ground in such a way as to avoid a confrontation with Turkey,” Bozdag, who also acts as the government’s spokesman, told broadcaster A Haber.\nThe United States has around 2,000 troops in Syria, officially as part of an international, U.S.-led coalition against Islamic State. Washington has angered Ankara by providing arms, training and air support to Syrian Kurdish forces that Turkey views as terrorists.\nThe Kurdish-led autonomous administration that runs Afrin on Thursday called on the Syrian government to defend its border with Turkey in Afrin despite Damascus’ stance against Kurdish autonomy.\n“We call on the Syrian state to carry out its sovereign obligations towards Afrin and protect its borders with Turkey from attacks of the Turkish occupier,” it said in a statement on its website.\nThe Syrian government has said it is ready to target Turkish jets in its airspace, but has not intervened so far. It suspects the Kurds of wanting independence in the long-run and does not recognise the autonomous cantons they have set up in northern Syria.\nU.S. forces were deployed in and around Manbij to deter Turkish and U.S.-backed rebels from attacking each other and have also carried out training missions in the area.\nU.S. President Donald Trump urged Erdogan on Wednesday to curtail the military operation in Syria, the White House said.\nHowever Turkey has disputed that characterisation of the conversation.\nTurkey-backed Free Syrian Army fighters are pictured at a check point in Azaz, Syria January 24, 2018. REUTERS/Osman Orsal Turkey’s foreign minister said Erdogan told Trump that U.S. troops should withdraw from Manbij.\nPentagon spokeswoman Dana White said she had seen media reports about the comments, but was not aware of any change in U.S. posture.\nMcKenzie added the United States and Turkey closely coordinated in the region but the United States would also ensure the safety of its troops.\nLIMITED GAINS Six days into the campaign, Turkish soldiers and their Free Syrian Army rebel fighter allies have been battling to gain footholds on the western, northern and eastern flanks of Afrin.\nThey appear to have made only limited gains, hampered by rain and clouds, which have limited the air support.\nSlideshow (2 Images) Turkish warplanes struck the northern borders of Afrin, in tandem with heavy artillery shelling, and one civilian was killed, according to the Syrian Observatory for Human Rights, a Britain-based monitoring group.\nDozens of combatants and more than two dozen civilians have been killed so far in the offensive, the Observatory has said.\nThe Turkish military said in a statement it had killed 303 militants in northern Syria since the operation started.\nThe Syrian Democratic Forces (SDF), a YPG-dominated umbrella group backed by the United States in the fight against Islamic State, has previously said that Turkey was exaggerating the number of the dead.\nRelations between Ankara and Washington have neared breaking point recently over U.S. support for the YPG and other issues.\nRelated Coverage Explainer: Turkey's military operation against Kurdish YPG in Afrin U.S. in talks with Turkey about creating security zone in Syria - Pentagon Ankara considers the YPG to be an extension of the outlawed Kurdistan Workers Party (PKK), which has waged a three-decade-long insurgency in Turkey’s largely Kurdish southeast. Washington sees the YPG as an effective partner in the fight against Islamic State in Syria.\nTurkey said the United States had proposed a 30 km (19 mile) “safe zone” along the border.\n“(But) in order for us to discuss the security zone or any other issue with the U.S., we have to reestablish trust,” Foreign Minister Mevlut Cavusoglu told reporters.\nIn Washington, McKenzie said the U.S. and Turkey were continuing talks about a “secure zone” but there had been no final decision.\nMcKenzie said that he had not yet seen a movement of SDF fighters moving from the Euphrates River Valley to reinforce Afrin or Manbij, but was watching closely.\nThe Afrin operation has also triggered concern in Germany, another NATO ally, where the caretaker government said it would put on hold any decision on upgrading Turkey’s German-made tanks.\nAdditional reporting by Ece Toksabay in Ankara; Ezgi Erkoyun in Istanbul; Tom Perry in Beirut; Michael Nienaber Andreas Rinke in Berlin and Idrees Ali in Washington; Writing by David Dolan; Editing by Richard Balmforth and Alistair Bell\n ", "external_links": [], "published": "2018-01-25T18:18:00.000+02:00", "crawled": "2018-01-25T19:01:35.005+02:00", "highlightTitle": ""}