{"organizations": [], "uuid": "de09d9abdf5264d275914cd70918c4d23ca477bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/indonesia-freeport-papua/indonesia-lays-groundwork-for-transfer-of-grasberg-mine-to-local-control-idUSL4N1P71QH", "country": "US", "domain_rank": 408, "title": "Indonesia lays groundwork for transfer of Grasberg mine to local control", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:16:00.000+02:00", "replies_count": 0, "uuid": "de09d9abdf5264d275914cd70918c4d23ca477bc"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/indonesia-freeport-papua/indonesia-lays-groundwork-for-transfer-of-grasberg-mine-to-local-control-idUSL4N1P71QH", "ord_in_thread": 0, "title": "Indonesia lays groundwork for transfer of Grasberg mine to local control", "locations": [], "entities": {"persons": [], "locations": [{"name": "jakarta", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "pt freeport indonesia", "sentiment": "none"}, {"name": "papua", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "grasberg", "sentiment": "none"}, {"name": "freeport", "sentiment": "none"}, {"name": "finance ministry", "sentiment": "none"}, {"name": "freeport-mcmoran inc", "sentiment": "none"}, {"name": "papua provincial government", "sentiment": "none"}, {"name": "mimika regency", "sentiment": "none"}, {"name": "pt inalum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JAKARTA, Jan 12 (Reuters) - Indonesian regional and central government officials on Friday signed an agreement with state holding company PT Inalum that lays the foundation for the transfer of Freeport-McMoRan Inc’s giant Grasberg copper mine to local control.\nIndonesia and Papua have long pushed for greater control over Grasberg and the new ownership structure may ease tensions over spoils from the world’s second-biggest copper mine, which has been a focal point for local separatists.\nIndonesia and Freeport agreed in principle in August to set up the U.S. company’s rights to Grasberg under a new mine license system from an existing contract of work, and the American miner said it would divest up to 51 percent of its local unit to “Indonesia interests”.\nUnder the agreement signed on Friday, Papua Provincial Government and the Mimika Regency will jointly own rights to a 10 percent share in PT Freeport Indonesia (PTFI) once they have been divested, the Finance Ministry said in a statement.\n“This portion of share ownership rights is for the interests for the indigenous land owners and members of the community facing permanent impacts,” the statement said.\n“The agreement signed today is a strategic step forward in efforts to acquire shares divested by PTFI,” it said.\nA Jakarta-based spokesman for Freeport Indonesia declined to comment on the matter.\nInalum, which holds ownership of all state-owned mining companies, has been nominated to acquire an additional 41.64 percent in Freeport Indonesia, which would take Indonesia’s share of PTFI to 51 percent, up from 9.36 percent now.\nThe 10 percent to be held by Papua and Mimika would be part of this Inalum holding, government officials have said previously.\nA government source with knowledge of the matter said the memorandum of understanding signed on Friday was an initial step in the acquisition process and would allow the transaction involving the Indonesian parties to be carried out through a “single window”.\n“The next step that still needs to be worked on is the completion of rights and obligations between shareholders and Freeport, as well as the valuation,” the source said.\nCoal and Minerals Director General Bambang Gatot said on Thursday the government is targeting to complete contract discussions with Freeport by June, noting that divestment issues had not been resolved yet.\nFreeport’s divestment may involve liquidation of a joint venture that Freeport Indonesia, operator of Grasberg, formed with Rio Tinto in 1996.\nUnder that venture, Rio has a 40 percent interest in PTFI’s Grasberg contract, which entitles them to a 40 percent share of all production after 2022. Rio has held talks with Indonesia about a possible exit to the venture.\nIndonesia’s proposal could see Rio’s interest in Grasberg output being converted to shares in PTFI to make up the lion’s portion of the government purchase, provided all parties can agree to the structure and price of the deal, Mining Minister Ignasius Jonan said in December.\nA Melbourne-based spokesman for Rio declined to comment.\nReporting by Cindy Silviana and Wilda Asmarini in JAKARTA; Additional reporting by Jim Regan in SYDNEY; Writing by Fergus Jensen; Editing by Tom Hogue\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T15:16:00.000+02:00", "crawled": "2018-01-13T14:33:47.005+02:00", "highlightTitle": ""}