{"organizations": [], "uuid": "0e42e5e3c40e7b62789dc3e39c68d14a766baec0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-metals/metals-base-metals-advance-ahead-of-trump-address-idUSL4N1PP1HM", "country": "US", "domain_rank": 408, "title": "METALS-Base metals advance ahead of Trump address", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T04:27:00.000+02:00", "replies_count": 0, "uuid": "0e42e5e3c40e7b62789dc3e39c68d14a766baec0"}, "author": "", "url": "https://www.reuters.com/article/global-metals/metals-base-metals-advance-ahead-of-trump-address-idUSL4N1PP1HM", "ord_in_thread": 0, "title": "METALS-Base metals advance ahead of Trump address", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING, Jan 30 (Reuters) - Most base metals gained ground in early trade on Tuesday, with zinc hovering around a decade peak, as investors hoped for positive signals about infrastructure building in U.S. President Donald Trump's State of the Union address later in the day. FUNDAMENTALS * LME COPPER: Three-month copper on the London Metal Exchange was up 0.4 percent at $7,114 a tonne, as of 0216 GMT, after ending flat in the previous session. * SHFE COPPER: The most-traded March copper contract on the Shanghai Futures Exchange gained 0.1 percent to 53,500 yuan ($8,449.15) a tonne. * ZINC: LME zinc edged 0.1 percent down to $3,547 a tonne, after hitting $3,584 a tonne on Monday, the highest since July 2007. * TIN: Tin prices in London slipped 0.3 percent to $21,870 a tonne, easing from a 14-month high of $21,940 a tonne in the previous session. * CHINA: The former head of China's Anshan Iron and Steel Group (Ansteel) has been named the new chairman of metals group China Minmetals Corp , the State-Owned Assets Supervision and Administration Commission (SASAC) said on Monday. * CHILE: Chile is open to negotiating an additional quota of lithium for local miner SQM, to meet potential demand from U.S. electric car-maker Tesla, Eduardo Bitran, head of Chilean development agency Corfo, told Reuters on Monday. * ALASKA: Shares of mine developer Northern Dynasty Minerals Ltd fell more than 20 percent on Monday, the first trading day after a U.S. regulator's surprise move to keep restrictions on the company's big copper and gold mine project in Alaska. * NORWAY: Norwegian aluminium maker Norsk Hydro plans to transfer energy-saving technology from a pilot project to primary smelters in the next five to six years, boosting output and cutting costs, the company's head of technology told Reuters. * For the top stories in metals and other news, click or MARKETS NEWS * Asian stocks retreated from record peaks on Tuesday after a selloff in Apple shares knocked Wall Street, while the dollar found support as U.S. bond yields climbed to near four-year highs. DATA/EVENT AHEAD (GMT) 0630 France Preliminary GDP Q4 0745 France Consumer spending Dec 1000 Euro zone GDP flash Q4 1000 Euro zone Business climate Jan 1000 Euro zone Consumer confidence final Jan 1300 Germany Consumer prices Jan 1400 U.S. Case-Shiller housing index Nov 1500 U.S. Consumer confidence Jan U.S. Federal Reserve starts two-day policy meeting PRICES BASE METALS PRICES 0216 GMT Three month LME copper 7114 Most active ShFE copper 53490 Three month LME aluminium 2233 Most active ShFE aluminium 14580 Three month LME zinc 3550.5 Most active ShFE zinc 26955 Three month LME lead 2618 Most active ShFE lead 19640 Three month LME nickel 13865 Most active ShFE nickel 105730 Three month LME tin 21870 Most active ShFE tin 150690 BASE METALS ARBITRAGE LME/SHFE COPPER LMESHFCUc3 954.74 LME/SHFE ALUMINIUM LMESHFALc3 -1823.33 LME/SHFE ZINC LMESHFZNc3 310.6 LME/SHFE LEAD LMESHFPBc3 -345.81 LME/SHFE NICKEL LMESHFNIc3 1835.01 ($1 = 6.3320 Chinese yuan) (Reporting by Tom Daly; Editing by Sherry Jacob-Phillips)\n ", "external_links": [], "published": "2018-01-30T04:27:00.000+02:00", "crawled": "2018-01-30T04:49:15.011+02:00", "highlightTitle": ""}