{"organizations": [], "uuid": "9c6b289628b7bd5ccc6dd6b5876bd5bc35f0b180", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 14}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WV859_3m98G_TOP_20180104152819.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7031.xml", "section_title": "WSJ.com: Markets", "url": "https://www.wsj.com/articles/the-dow-has-what-investors-want-1515098581", "country": "US", "domain_rank": 387, "title": "The Dow Has What Investors Want", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T22:43:00.000+02:00", "replies_count": 0, "uuid": "9c6b289628b7bd5ccc6dd6b5876bd5bc35f0b180"}, "author": "Justin Lahart", "url": "https://www.wsj.com/articles/the-dow-has-what-investors-want-1515098581", "ord_in_thread": 0, "title": "The Dow Has What Investors Want", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "boeing", "sentiment": "none"}, {"name": "pfizer inc.", "sentiment": "none"}, {"name": "pfizer", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "boeing co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS Say what you will about the Dow Jones Industrial Average passing another round number, it has been the place to put your money.\nMore on Dow 25000 Dow Crosses 25000 for First Time Individual Investors Sit It Out Fewer Companies: Good or Bad? Heard: Dow Has What Investors Want Streetwise: Economic Cycle Is Broken Here’s Why Dow 25000 Matters Dow Record in Record Time Boeing Behind Dow’s Rise Dow Ghost Gets Last Laugh Long-Time Stock Bear Gives In GE Is No Help in Recent Surge The Dow crossed 25000 on Thursday, a bit more than a month after it breached 24000. Photo: Mark Lennihan/Associated Press The Dow reached yet another milestone Thursday, crossing 25000 a bit more than a month after it breached 24000 . Numbers with lots of zeros aside, the Dow has done very well lately, with a total return of 27% since the end of 2016, versus 24% for the S&P 500. And that has less to do with the quirk of how the Dow is constructed than what is in it.\nThe Dow is an odd bird, weighted by share prices rather than the stock-market values of the companies in it. So moves in Boeing Co. count about eight times as much as moves in Pfizer Inc., PFE -0.24% even though Pfizer is worth more. Boeing has been the Dow’s best performer lately, nearly doubling over the past year, so that matters.\nBut the median stock in the Dow has also done well, matching the index’s overall return of 27% since the end of 2016, while the median stock in the S&P 500 returned 20%. One reason for that is that companies in the Dow are bigger than most S&P 500 stocks, and far more exposed to the strong global economy. Another reason is that the Dow is tilted toward growth and growth has been in favor.\nThese advantages are a function of design. Among the factors considered by the committee that picks stocks for the Dow is whether a company has demonstrated sustained growth. For the moment, at least, the Dow is exactly what investors want.\nWrite to Justin Lahart at justin.lahart@wsj.com", "external_links": [], "published": "2018-01-04T22:43:00.000+02:00", "crawled": "2018-01-05T00:28:47.012+02:00", "highlightTitle": ""}