{"organizations": [], "uuid": "7eb2ef37e379c3edd7bb0adb2bce0bd3097ed62e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-banro-announces-commencement-of-court-approved-sale-and-investment-solicitation-process.html", "country": "US", "domain_rank": 767, "title": "Banro Announces Commencement of Court-Approved Sale and Investment Solicitation Process", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.683, "site_type": "news", "published": "2018-01-23T00:42:00.000+02:00", "replies_count": 0, "uuid": "7eb2ef37e379c3edd7bb0adb2bce0bd3097ed62e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-banro-announces-commencement-of-court-approved-sale-and-investment-solicitation-process.html", "ord_in_thread": 0, "title": "Banro Announces Commencement of Court-Approved Sale and Investment Solicitation Process", "locations": [], "entities": {"persons": [{"name": "barb", "sentiment": "negative"}], "locations": [{"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "banro", "sentiment": "negative"}, {"name": "banro corporation", "sentiment": "negative"}, {"name": "fti capital advisors ulc", "sentiment": "none"}, {"name": "fti consulting canada inc.", "sentiment": "none"}, {"name": "ccaa", "sentiment": "none"}, {"name": "ontario superior court of justice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan. 22, 2018 /PRNewswire/ - On December 22, 2017, Banro Corporation (\"Banro\") and its Barbados based subsidiaries (collectively, the \"Companies\") commenced restructuring proceedings under the Companies' Creditors Arrangement Act (\"CCAA\") pursuant to an initial order granted by the Ontario Superior Court of Justice (Commercial List) (the \"Court\"). FTI Consulting Canada Inc. has been appointed Monitor (the \"Monitor\") of the Companies for the CCAA proceedings.\nPursuant to an order of the Court dated January 18, 2018, the Companies have today initiated a sale and investment solicitation process (\"SISP\") to be conducted in conjunction with the CCAA proceedings. The Initial Order provides that the Monitor will assist the Companies in conducting the SISP. Banro and the Monitor, through its affiliate, FTI Capital Advisors ULC (\"FTICA\"), are seeking parties interested in acquiring or investing in the business or the assets of the Companies in a manner that is determined to be a superior offer to the Recapitalization Plan under the CCAA process.\nInterested parties will be given an opportunity to submit offers for the acquisition of the business and assets of some or all of the business and assets of the Company and its subsidiaries (i) for cash proceeds equal to the outstanding amount of the DIP Facility, the priority debt, 75% of the affected parity lien debt of Banro, and cash consideration sufficient to repay all amounts due under the stream agreements or treatment of the stream agreements on the same terms as the Recapitalization Plan, or (ii) on other terms determined to be superior to the Recapitalization Plan, in accordance with the terms of the SISP (capitalized terms as defined in the SISP). The operating assets of the Companies include the Namoya Mine and the Twangiza Mine located in the Democratic Republic of the Congo.\nUnder the SISP, potential buyers will be provided a confidential information memorandum and access to a virtual data room on execution of a non-disclosure agreement acceptable to Banro and the Monitor. The deadline for submission of non-binding letters of intent is 12pm (Eastern Standard Time) on March 2, 2018, and the deadline for submission of binding bids is 12pm (Eastern Standard Time) on April 9, 2018.\nA copy of the SISP and all related CCAA materials can be found on the Monitor's website at: http://cfcanada.fticonsulting.com/banro/ . Any potential buyer interested in participating in the SISP should contact FTICA at banro@fticonsulting.com . Similarly, any questions in respect of the SISP should be directed to the Monitor at banro@fticonsulting.com\nCautionary Note Concerning Forward-Looking Statements\nThis press release contains forward-looking statements. All statements, other than statements of historical fact, that address activities, events or developments that the Company believes, expects or anticipates will or may occur in the future (including, without limitation, statements regarding the CCAA proceedings, the restructuring process, including the sale and investment solicitation process, and the ability of the Company to meet its obligations, the Company's liquidity and ability to meet payment obligations and the timing of meeting such payment obligations, the Company's intentions for the future of its business operations and long-term strategy, and the Company's commitment to its employees and suppliers) are forward-looking statements. These forward-looking statements reflect the current expectations or beliefs of the Company based on information currently available to the Company. Forward-looking statements are subject to a number of risks and uncertainties that may cause the actual results of the Company to differ materially from those discussed in the forward-looking statements, and even if such actual results are realized or substantially realized, there can be no assurance that they will have the expected consequences to, or effects on the Company. Factors that could cause actual results or events to differ materially from current expectations include, among other things the possibility that the Company will be unable to implement the restructuring or obtain advances under the interim financing due to the failure of one or more of the conditions precedent to be satisfied, or that the SISP will be unsuccessful. In addition, actual results or events could differ materially from current expectations due to instability in the eastern DRC where the Company's mines are located; political developments in the DRC; uncertainties relating to the availability and costs of financing or other appropriate strategic transactions; uncertainty of estimates of capital and operating costs, production estimates and estimated economic return of the Company's projects; the possibility that actual circumstances will differ from the estimates and assumptions used in the economic studies of the Company's projects; failure to establish estimated mineral resources and mineral reserves (the Company's mineral resource and mineral reserve figures are estimates and no assurance can be given that the intended levels of gold will be produced); fluctuations in gold prices and currency exchange rates; inflation; gold recoveries being less than expected; changes in capital markets; lack of infrastructure; failure to procure or maintain, or delays in procuring or maintaining, permits and approvals; lack of availability at a reasonable cost or at all, of plants, equipment or labour; inability to attract and retain key management and personnel; changes to regulations affecting the Company's activities; the uncertainties involved in interpreting drilling results and other geological data; and the other risks disclosed under the heading \"Risk Factors\" and elsewhere in the Company's annual report on Form 20-F dated April 2, 2017 filed on SEDAR at www.sedar.com and EDGAR at www.sec.gov . Any forward-looking statement speaks only as of the date on which it is made and, except as may be required by applicable securities laws, the Company disclaims any intent or obligation to update any forward-looking statement, whether as a result of new information, future events or results or otherwise. Although the Company believes that the assumptions inherent in the forward-looking statements are reasonable, forward-looking statements are not guarantees of future performance and accordingly undue reliance should not be put on such statements due to the inherent uncertainty therein. The forward-looking statements contained in this press release are expressly qualified by this cautionary note.\nSOURCE Banro Corporation", "external_links": ["http://cfcanada.fticonsulting.com/banro/", "http://www.sec.gov/", "http://www.sedar.com/"], "published": "2018-01-23T00:42:00.000+02:00", "crawled": "2018-01-23T02:17:01.035+02:00", "highlightTitle": ""}