{"organizations": [], "uuid": "805529191cafc874cc64337aa2c8faa3b0e9f4ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gucci-store.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/11/gucci-garden-restaurant-florence/", "country": "US", "domain_rank": 1196, "title": "Gucci Courts the Food World With Luxe Restaurant | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.996, "site_type": "news", "published": "2018-01-11T14:55:00.000+02:00", "replies_count": 0, "uuid": "805529191cafc874cc64337aa2c8faa3b0e9f4ae"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/11/gucci-garden-restaurant-florence/", "ord_in_thread": 0, "title": "Gucci Courts the Food World With Luxe Restaurant | Fortune", "locations": [], "entities": {"persons": [{"name": "osteria francescana", "sentiment": "none"}, {"name": "bottura", "sentiment": "none"}, {"name": "massimo bottura", "sentiment": "none"}], "locations": [{"name": "gucci garden", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "bottura", "sentiment": "none"}], "organizations": [{"name": "gucci courts the food world with luxe restaurant", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "gucci", "sentiment": "negative"}, {"name": "netflix", "sentiment": "none"}, {"name": "gucci osteria", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 12:55 PM EST \nOn Tuesday, fashion house Gucci dipped into the culinary scene with the luxe Gucci Osteria, a green-walled, 50-seat restaurant nestled inside the new Gucci Garden, an experiential museum-retail concept in the historic heart of Florence, Italy. The chef is Massimo Bottura, the Modena-based proprietor of three-Michelin-starred Osteria Francescana, in 2016 named the best restaurant in the world. \nNow fully open to the public, the menu, glimpsed here, includes the parade of pasta one expects from Bottura considering Osteria Francescana’s carbo-loaded cameo on the Netflix show Master of None. \nVisitors can scarf down decadent plates of golden Parmigiano-Reggiano-enriched tortellini, buttery cacio e pepe, and creamy mushroom risotto. But the menu evidently has a sense of humor, too, offering high-end interpretations of a hot dog, a burger (fun fact: Bottura loves Shake Shack), and for dessert, a piña colada. There are also a fair number of dishes inspired by Bottura’s world travels, including Peruvian tostadas and Asian-tinged buns stuffed with fatty pork belly. \nMain dishes are priced from 20 to 30 euros ($24-$36) each—this is Gucci, after all. “Haute couture and haute cuisine are a recipe made in heaven,” Bottura told reporters. Not for nothing, Gucci Chief Executive Officer Marco Bizzarri and Bottura are childhood friends as well. \nGucci isn’t the first fashion brand to court the food world by a long shot. Prada owns the Milan patisserie Marchesi. LVMH will soon open the second location of La Grande Epicerie, its high-end grocery. This year, Tiffany & Co. opened the robin egg-hued Blue Box Cafe on the fourth floor of its New York flagship store. Dolce & Gabbana’s Spring 2018 collection, peppered with cannoli-print dresses and dangling carrot earrings, looks like something out of your kitchen pantry—indeed, it even had a limited-edition D&G pasta line for home cooks. And as far back as 2014, Chanel had food on the brain: That year, the brand turned its runway into a giant supermarket for Paris Fashion Week. \nGucci Garden is located inside the 14th-century Palazzo della Mercanzia, which overlooks Florence’s most famous square, Piazza della Signoria. The Gucci space spans an exhibition area, boutique selling items exclusive to the location, 30-seat cinema, and, of course, the restaurant. Entry to the upper floors—which include rooms dedicated to vintage and modern renderings of the Gucci logo, items emblazoned with Gucci’s recurring motifs (like the horsebit and the red-and-green stripes), and Gucci’s exploration of the iconography of animals and gardens—costs 8 euros, with half of that donated to restoration projects around Florence. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-11T14:55:00.000+02:00", "crawled": "2018-01-11T20:10:08.034+02:00", "highlightTitle": ""}