{"organizations": [], "uuid": "b376906667bf83dba57e29a28c84f6bd3bc170a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-l-e-k-consulting-expands-oil-gas-practice-opens-houston-office.html", "country": "US", "domain_rank": 767, "title": "L.E.K. Consulting Expands Oil & Gas Practice, Opens Houston Office", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.699, "site_type": "news", "published": "2018-01-03T18:00:00.000+02:00", "replies_count": 0, "uuid": "b376906667bf83dba57e29a28c84f6bd3bc170a1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-l-e-k-consulting-expands-oil-gas-practice-opens-houston-office.html", "ord_in_thread": 0, "title": "L.E.K. Consulting Expands Oil & Gas Practice, Opens Houston Office", "locations": [], "entities": {"persons": [{"name": "senjit sarkar", "sentiment": "none"}, {"name": "nilesh dayal", "sentiment": "none"}], "locations": [{"name": "houston office boston", "sentiment": "none"}, {"name": "l.e.k. l.e.k.", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "l.e.k. consulting expands oil & gas practice", "sentiment": "negative"}, {"name": "l.e.k. consulting", "sentiment": "negative"}, {"name": "l.e.k.", "sentiment": "none"}, {"name": "l.e.k. partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 3, 2018 /PRNewswire/ -- L.E.K. Consulting , a global management consulting firm, is expanding its work in the oil & gas sector with the opening of an office in Houston that will be led by two new L.E.K. Partners. Nilesh Dayal and Senjit Sarkar have focused on the energy sector throughout their careers and bring over 20 years' experience to L.E.K.\nL.E.K. advises a range of clients in the oil & gas area, including exploration and production firms, oilfield equipment manufacturers, oilfield services firms, refineries and petrochemical firms and private equity investors in the space, on their most pressing strategic business needs.\nThe demand for L.E.K.'s oil & gas strategic expertise is increasing, as the rise of unconventional oil and gas and extreme cyclicality of recent years upends the supply-demand balance; as consolidation pressures margins and forces equipment suppliers to seek differentiated positions in the market; and as rapidly evolving technology, like the Internet of Things, both disrupts the value chain and presents opportunities.\n\"We are excited to continue to meet and anticipate the needs of the energy industry by adding two highly experienced experts and building up our presence in Houston,\" said Carol Wingard , Managing Director and Head of L.E.K.'s Americas Industrials practice . \"We are delighted to welcome Nilesh Dayal and Senjit Sarkar as partners. Their deep industry experience and expertise will further enhance our ability to deliver high-impact results to help our clients grow their businesses.\"\nDayal has over 20 years of experience in international consulting and business management focused on the energy, utility and chemical sectors, and was most recently a vice president at IHS Markit. Prior to IHS Markit, he was founder and Managing Partner of PacWest Consulting Partners, a leading unconventional oil and gas market research and consulting firm, which was acquired by IHS Markit. He has deep expertise in providing strategy, consulting and market research services to onshore and offshore oil & gas operators and oilfield services and equipment companies. He holds a BS and an MBA from the University of Michigan.\nSarkar has over 15 years of experience working with corporations and financial sponsors on corporate strategy development, investment analysis, post-transaction support, digital strategy and implementation, scenario planning, and new market entry – and was most recently a managing director at IHS Markit. He holds an A.B. from Cornell University and an M.P.H. from Dartmouth College.\n\"Our clients and prospective clients are facing dramatic and rapid changes in their markets. Our Houston office will help us better serve our growing cluster of clients in the industrials, oil & gas, and utilities sectors and anticipate their future needs,\" said Peter McKelvey , President of the Americas at L.E.K.\nL.E.K.'s new Houston office will also serve clients in the utilities and chemical sectors.\nAbout L.E.K. Consulting\nL.E.K. Consulting is a global management consulting firm that uses deep industry expertise and rigorous analysis to help business leaders achieve practical results with real impact. We are uncompromising in our approach to helping clients consistently make better decisions, deliver improved business performance and create greater shareholder returns. The firm advises and supports global companies that are leaders in their industries — including the largest private and public sector organizations, private equity firms and emerging entrepreneurial businesses. Founded in 1983, L.E.K. employs more than 1,200 professionals across the Americas, Asia-Pacific and Europe. For more information, go to www.lek.com .\nContact:\nKatarina Wenk-Bodenmiller\nSommerfield Communications\n(212) 255-8386\nkatarina@sommerfield.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/lek-consulting-expands-oil--gas-practice-opens-houston-office-300577008.html\nSOURCE L.E.K. Consulting", "external_links": ["https://www.lek.com/industries/industrials", "https://www.lek.com/leadership/peter-mckelvey", "https://www.lek.com/leadership/nilesh-dayal", "http://www.prnewswire.com/news-releases/lek-consulting-expands-oil--gas-practice-opens-houston-office-300577008.html", "https://www.lek.com/global-offices/houston", "http://www.lek.com/", "https://www.lek.com/leadership/carol-wingard", "https://www.lek.com/leadership/senjit-sarkar", "https://www.lek.com/", "https://www.lek.com/industries/energy-environment/oil-gas"], "published": "2018-01-03T18:00:00.000+02:00", "crawled": "2018-01-03T21:09:17.023+02:00", "highlightTitle": ""}