{"organizations": [], "uuid": "5df3e05ab2b366efabafc024a9bf752a6f1c7a19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-521728364.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/12/spotify-non-ipo-nyse/", "country": "US", "domain_rank": 1196, "title": "Commentary: Spotify IPO Came at Perfect Time | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.14, "site_type": "news", "published": "2018-01-12T02:00:00.000+02:00", "replies_count": 0, "uuid": "5df3e05ab2b366efabafc024a9bf752a6f1c7a19"}, "author": "Kyle Jensen", "url": "http://fortune.com/2018/01/12/spotify-non-ipo-nyse/", "ord_in_thread": 0, "title": "Commentary: Spotify IPO Came at Perfect Time | Fortune", "locations": [], "entities": {"persons": [{"name": "spotify", "sentiment": "negative"}, {"name": "kyle jensen", "sentiment": "negative"}], "locations": [{"name": "spotify", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kyle Jensen January 12, 2018 \nIf Spotify’s non-IPO goes forward this spring, it will be unusual in that it will be a “direct listing,” wherein the current shareholders will sell their shares directly to the retail-investing public on the NYSE, vs. to institutional investors. Spotify is the first company of its size to propose such a listing. If the listing yields a lucrative exit for existing shareholders, it will encourage other nascent high-growth firms to follow in Spotify’s footsteps. \nMost startups that file for an IPO use underwriters. The underwriters round up institutional investors to buy the newly listed stock, creating demand and helping to establish a fair price; they lead the company on a “roadshow” to promote its stock; and they commit to covering the stock in their analyses. In doing so, the bankers receive a considerable bounty—4% to 5% for IPOs that are north of a billion dollars. (For example, in its recent IPO, Alibaba (BABA) paid over $300 million to its bankers.) \nBy choosing a direct listing, Spotify is cutting out the underwriters and institutional investors. It will save itself the associated fees and the hassle of the roadshow, and likely free its shareholders from “lockup” periods, allowing them instead to sell their shares immediately after the listing. That means they’ll get liquid, which is particularly meaningful for early-stage employees who take the risk of working for a startup and receive stock options in lieu of the higher pay and greater security available at more mature companies. \nAlso, without institutional investors and bankers to set a rational, pre-IPO price, it is possible that Spotify’s shares could soar irrationally in early trading, particularly because of the brand’s household recognition. This would help existing shareholders reap a premium price that they would be hard-pressed to find in a traditional IPO, wherein shares are typically sold to institutional investors at a slight discount, then rise in early trading. \nFurther, the timing is fortuitous for Spotify, which has competed well to-date against behemoths like Apple (AAPL) and Amazon (AMZN) . Indeed, it is wise for Spotify to list now rather than wait. For one thing, the company faces rising pressure from artists, many of whom accuse the company of miserly revenue-sharing for their streamed content. Indeed, the company is currently being sued by representatives of musicians including Tom Petty and The Doors. Other artists are choosing to release their music exclusively on Tidal, an artist-owned streaming service founded by Jay-Z. In short, Spotify’s competitive pressures are growing, and it is wise for the company to list now when both the perception and reality of its achievements are rosy in the eyes of retail investors. \nYoung, high-growth companies are responsible for a disproportionate fraction of net economic growth. And yet these companies increasingly do not see IPOs as a viable exit option due to the costs—both real and regulatory—and the relative surfeit of late-stage financing available on the private markets. In the U.S. today, the number of publicly listed companies is less than half of what it was 20 years ago. And rates of new firm creation—potential high-growth startups like Spotify—are at historic lows. \nNot only is Spotify’s direct listing an astute move, but it is likely to benefit other startups by decoupling fundraising from getting liquid, and thereby decreasing the barriers to accessing public markets. \nKyle Jensen is associate dean and Shanna and Eric Bass ’05 Director of Entrepreneurship & Senior Lecturer at Yale School of Management . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-12T02:00:00.000+02:00", "crawled": "2018-01-15T14:45:16.039+02:00", "highlightTitle": ""}