{"organizations": [], "uuid": "c6d9673665968a87c4f9d6c728c1e947644304af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 94, "shares": 94, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222777154&w=1200&r=LYNXMPEE0G1AG", "site_section": "https://www.reuters.com/commentary", "section_title": "Columns | Reuters.com", "url": "https://www.reuters.com/article/us-hazlett-5g-commentary/commentary-the-best-way-for-the-fcc-to-enable-a-5g-future-idUSKBN1F6253", "country": "US", "domain_rank": 408, "title": "The best way for the FCC to enable a 5G future", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:46:00.000+02:00", "replies_count": 0, "uuid": "c6d9673665968a87c4f9d6c728c1e947644304af"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-hazlett-5g-commentary/commentary-the-best-way-for-the-fcc-to-enable-a-5g-future-idUSKBN1F6253", "ord_in_thread": 0, "title": "The best way for the FCC to enable a 5G future", "locations": [], "entities": {"persons": [{"name": "herbert hoover", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "fcc", "sentiment": "neutral"}, {"name": "economist", "sentiment": "none"}, {"name": "u.s. federal communications commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fifth-generation (5G) wireless networks promise to blow away existing 4G connections. According to the U.S. government, the new systems will deliver 1,000 times more traffic, with far superior reliability and faster response times. Movies will glisten in ultra-high definition, while cities become smart, autonomous cars safe, and the Internet of Things ubiquitous. Mobile broadband may out-perform fiber optics, as The Economist notes, putting “your phone on steroids.”\nThe Wow Factor obscures the obstacles. Rollout for 5G depends on access to bandwidth. And here the ghost of Herbert Hoover stands tall. His legislative brainchild, the Radio Act of 1927, sandbags innovation by defining spectrum uses upfront, prior to authorization.\nThat we are even talking about 5G – let alone 1G, 2G, 3G or 4G – reveals that Hooverian public policy is possible to overcome. But it takes a while. First generation cellular was touted by the U.S. Federal Communications Commission in 1945, but licenses were not issued until 1984-89. Under the Radio Act , each slice of the airwaves must be allocated according to “public interest, convenience or necessity,” a bureaucracy-enforcing meme that is a devil’s playground for insiders. Key players include incumbents opposed to competing inventions as well as corporate counsel billing for slow rolls by the hour.\nTelevision licenses, for instance, specify transmission format, channel size, station location, antenna height, emission power, and business model (ads okay, but not subscriptions). As new technologies have been discovered, and video has shifted to cable, satellite, or broadband networks, frequencies set aside beginning in the 1930s have been frozen in time. The TV Band continues as a phantom allocation, serving a market gone bye-bye.\nSome 49 TV channels today consume more spectrum than Verizon and AT&T, the two largest U.S. mobile carriers, jointly utilize. Even after, as currently planned, one quarter of the TV band has been shifted to mobile markets by 2020, some 35 channels will remain walled off for the delivery of I Love Lucy and The Honeymooners. Try explaining that resource distribution decision to your teenager as she scrolls through episodes of Netflix’s Gilmore Girls transmitted over the air to her iPhone, entirely bypassing broadcast TV frequencies. The new apps demonstrate huge progress. But the fact that legacy “set asides” continue to endure is a sad waste.\nThe government is not oblivious to the problem. The FCC has officially sworn off micro-managing wireless markets, instead endowing licensees with spectrum rights that “can be quickly repurposed for new flexible uses,” as it wrote in 2016. The “ready availability of the spectrum,” the FCC continues, will “drive the development of a robust ecosystem” hosting new services, devices, and applications.\nWhile fifth-generation networks are unlikely to be widely deployed before 2020, spectrum regulators are now asking for public input. But policymakers must ask the right questions.\nWhen officials inquire about the precise nature of evolving services they raise issues that cannot be settled up front, squandering time and computer memory. Even after taking decades to craft cellular telephone rules, the FCC had no idea that mobile would become a mass market (not a luxury niche), that handsets would become pocket (not car) phones, that texting and data (not just voice) would become standard, or that digital was superior to the analog standard it mandated. And that was after vast input from scientists, management consultants, broadcasters, Motorola, and AT&T.\nThe way to proceed is to auction broad, liberal spectrum rights to competitors. Restrictions on services, devices or business models should be eliminated.\nThe wrong way is to ask, as in an August 2017 FCC notice about permitting 5G use in lightly utilized 3.7 GHz to 4.2 GHz frequencies: “Are there recent technological advancements that could facilitate the deployment of mobile services? … Commenters should address the costs and benefits of mobile use in the band and provide detailed technical and economic data to support their suggestions.”\nAs an economist, of course, I appreciate the regulators’ attempt to boost the demand for new studies. But the “detailed technical and economic data” of greatest interest will be observed only after spectrum is opened, innovation is unleashed, and networks compete. With flexible rights in the marketplace, this will happen. Until then, it’s all academic.\nLicenses to use this band are already being auctioned in Australia, Germany, Ireland, the United Kingdom, and elsewhere. Policymakers overseas and in the United States need only relax their restrictions to see what amazing innovations might spring forth.\nIn the same 2017 notice, the FCC asks a better question: “Are there opportunities to incentivize relocation or repacking of incumbent licensees to make spectrum available for flexible broadband use?” And, “We seek comment on whether auctions… could be used to increase the availability of flexible use spectrum?”\nBingo. By focusing on how rights – not markets -- should be designed, the FCC may be able to avoid useless food fights. The virtue of the rights-based approach was demonstrated when liberalized TV band licenses (no longer limited to broadcasting) were used by competitors to blast “mobile TV” – hyped as the Killer App of 2005 – to handsets. The service was a flop but, not to worry: by 2010, licensees had exited that business and flipped the licenses to 4G networks. Today that bandwidth whisks video to smartphones – the same app, more efficiently delivered.\nAuctioning spectrum rights and eliminating needless restrictions is the better way to discover our 5G future.\nAbout the Author Thomas Hazlett is H.H. Macaulay Endowed Professor of Economics at Clemson University. He formerly served as Chief Economist of the FCC. His latest book is “THE POLITICAL SPECTRUM: The Tumultuous Liberation of Wireless Technology, from Herbert Hoover to the Smartphone Yale, 2017. @InfoEconProject\nThe views expressed in this article are not those of Reuters News.", "external_links": ["https://www.economist.com/news/science-and-technology/21646962-5g-mobile-wireless-will-be-faster-fibre-your-phone-steroids?fsrc=scn/tw/te/bl/ed/yourphoneonsteroids", "http://heinonline.org/HOL/Page?handle=hein.journals/scal54&div=30&g_sent=1&casa_token=FrPo784xUzAAAAAA:CVnXudFW6tqoVgICRSKePDWWvCEHMC28jvyiTRtqVzFoP0_Gr_hWuWXGw1s1g4VSaHmCqD3Tig&collection=journals", "http://www.zdnet.com/article/5g-takes-center-stage-at-ces-2018-with-actual-deployments-later/", "https://www.brookings.edu/research/revisiting-the-broadcast-public-interest-standard-in-communications-law-and-regulation/", "http://www.zdnet.com/article/acma-announces-5g-spectrum-plan/", "https://www.fiercewireless.com/wireless/gsma-backs-t-mobile-ctia-s-proposed-rule-changes-for-3-5-ghz", "https://www.wired.com/2017/02/what-is-5g-and-when-do-i-get-it/"], "published": "2018-01-18T00:46:00.000+02:00", "crawled": "2018-01-18T01:05:31.005+02:00", "highlightTitle": ""}