{"organizations": [], "uuid": "a608a6098c72c707632420f08907c3994ff91336", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225193918&w=1200&r=LYNXMPEE0O196", "site_section": "http://feeds.reuters.com/reuters/entertainment", "section_title": "Reuters: Entertainment News", "url": "https://www.reuters.com/article/us-russia-film-stalin/russian-cinema-defies-official-ban-to-screen-stalin-satire-movie-idUSKBN1FE2BE", "country": "US", "domain_rank": 408, "title": "Russian cinema defies official ban to screen Stalin satire movie", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:50:00.000+02:00", "replies_count": 0, "uuid": "a608a6098c72c707632420f08907c3994ff91336"}, "author": "", "url": "https://www.reuters.com/article/us-russia-film-stalin/russian-cinema-defies-official-ban-to-screen-stalin-satire-movie-idUSKBN1FE2BE", "ord_in_thread": 0, "title": "Russian cinema defies official ban to screen Stalin satire movie", "locations": [], "entities": {"persons": [{"name": "denis pinchuk", "sentiment": "none"}, {"name": "josef stalin", "sentiment": "none"}, {"name": "stalin", "sentiment": "none"}, {"name": "armando iannucci", "sentiment": "none"}], "locations": [{"name": "pioneer", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - A Russian art house cinema defied a government ban on Thursday to screen satirical film ‘The Death of Stalin’ to a packed audience that included at least two people who said they witnessed the Soviet dictator’s funeral six decades ago.\nThe Russian government said the movie mocks the country’s past, but Dina Voronova and Ella Katz — schoolgirls when Josef Stalin died in 1953 — said they applauded when the credits rolled at the end of the screening in Moscow.\n“I liked the film. I never expected to see our former government leaders depicted like that,” said Voronova, 80, a former pre-school head teacher who remembers seeing Stalin’s body in an open casket at the funeral.\nThe film, the work of Scottish director Armando Iannucci, portrays back-stabbing and infighting among the dictator’s closest allies, as they vie for power immediately after his death. In the backdrop, ordinary Russians suffer the many repressions of that era.\n“I didn’t laugh. There were some funny moments in the film, but I couldn’t laugh, because that was my life,” Voronova said, adding that she was not offended by the film.\n“Why should I be? I have my own opinion. The fact that I didn’t have a childhood, that I didn’t have a youth at all, that’s Stalin’s fault.”\nElla Katz said she attended the funeral when she was in third grade.\n“[The film] is not offensive. How could it be? How? ... The reality was much more terrifying than in this film,” she said.\nA general view shows the Pioner (Pioneer) cinema in Moscow, Russia January 25, 2018. REUTERS/Tatyana Makeyeva Earlier this week, the culture ministry withdrew a license for the movie’s general release.\nAsked about the screening at Moscow’s Pioneer cinema, the ministry said in a statement that anyone defying its ban would be held legally accountable for their actions. Staff at the cinema declined to comment on the legality of the screening.\n“Many people of the older generation, and not only, will regard it as an insulting mockery of all the Soviet past, of the country that defeated fascism and of ordinary people, and what’s even worse, even of the victims of Stalinism,” Culture Minister Vladimir Medinsky said in a statement.\nSlideshow (7 Images) One of the audience members, 40-year-old businessman Denis Aksyonov, said he liked U.S. television satire Veep, which Iannucci created, and expected ‘The Death of Stalin’ to be similarly entertaining.\n“I think it’s healthy to laugh about difficult issues, I think that makes it easier and less difficult for society to deal with them,” Aksyonov said before the screening.\nHe said it was regrettable that a political storm had been whipped up around the film, but that he tried to ignore such things. “Well done to Pioneer for putting on the screening, they are demonstrating their civic stance,” he said.\nStalin was repudiated by the Soviet Union after his death. He is recognized as responsible for the deaths of millions, from policies that included the forced collectivization of farms that caused famine, and from a succession of purges that saw mass executions and imprisonment at an archipelago of camps.\nBut Stalin’s leadership during World War Two, when the Red Army beat back a German occupation, is still associated by many Russians with the country’s greatest achievements.\nRussian President Vladimir Putin, running for re-election in March, has called Stalin “a complex figure” and said attempts to demonize him were a ploy to attack Russia.\nWriting by Christian Lowe and Polina Ivanova; Editing by Peter Graff\n ", "external_links": [], "published": "2018-01-25T17:50:00.000+02:00", "crawled": "2018-01-25T18:05:50.011+02:00", "highlightTitle": ""}