{"organizations": [], "uuid": "28459a49c5f1c1ca53a1e091e2c20331e54c79dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/aviation-finance-airlease/update-1-airbus-plots-response-as-boeing-warms-to-new-jet-air-lease-ceo-idUSL8N1PH5OX", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Airbus plots response as Boeing warms to new jet -Air Lease CEO", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T19:31:00.000+02:00", "replies_count": 0, "uuid": "28459a49c5f1c1ca53a1e091e2c20331e54c79dd"}, "author": "", "url": "https://www.reuters.com/article/aviation-finance-airlease/update-1-airbus-plots-response-as-boeing-warms-to-new-jet-air-lease-ceo-idUSL8N1PH5OX", "ord_in_thread": 0, "title": "UPDATE 1-Airbus plots response as Boeing warms to new jet -Air Lease CEO", "locations": [], "entities": {"persons": [{"name": "plueger", "sentiment": "none"}, {"name": "john plueger", "sentiment": "none"}, {"name": "tim hepher", "sentiment": "none"}, {"name": "conor humphries", "sentiment": "none"}], "locations": [{"name": "dublin", "sentiment": "none"}], "organizations": [{"name": "boeing", "sentiment": "negative"}, {"name": "airbus", "sentiment": "none"}, {"name": "nma", "sentiment": "none"}, {"name": "airline economics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "air lease ceo reuters staff", "sentiment": "none"}, {"name": "air lease corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 5:31 PM / in 13 minutes UPDATE 1-Airbus plots response as Boeing warms to new jet -Air Lease CEO Reuters Staff \n(Adds AerCap comment, source on Airbus options, background) \nBy Tim Hepher and Conor Humphries \nDUBLIN, Jan 22 (Reuters) - Plans for a potential new Boeing mid-sized jet are gaining momentum, prompting Airbus to respond by beefing up its strong-selling A321neo model, Air Lease Corp Chief Executive John Plueger said on Monday. \n“I think they (Boeing) feel they have momentum from the customers and that they are building momentum internally for the business case,” Plueger told Reuters on the sidelines of the annual Airline Economics conference, referring to a project for a 220-260-seat jet known as New Mid-Sized Airplane (‘NMA’). \n“I think that they ... are feeling better about the NMA, so I wouldn’t be surprised if some time this year we saw a decision about a launch or not a launch,” he said in an interview. \nBoeing’s plans call for a mid-market plane with an estimated 220-260 seats - larger than the single-aisle workhorses of short-haul travel but smaller than traditional dual-aisle long-haul aircraft. \nBut airlines and leasing companies have set Boeing stringent goals on the price at which they would be prepared to buy, insisting on only a narrow premium to single-aisle models. \nPlueger said Air Lease would be interested in the new Boeing jet at the right price. \nSpeaking separately, Aengus Kelly, chief executive of lessor AerCap, said failing to set a competitive price would make it a “tougher sell to get a big user base behind it.” \nThe new plane should probably trade at some premium to the Airbus 321neo, but at a “very big discount” to small widebody jets like the Airbus 330neo and Boeing 787-8, he told delegates. AIRBUS OPTIONS \nPlueger also added texture to Airbus’s plans to respond to the NMA by fine-tuning its biggest single-aisle jet. Officially, Airbus says its 185-240-seat A321neo dominates the “middle of the market” just above 200 jets, something Boeing denies. \nBut it is also studying a new version capable of lifting more weight, Plueger told Reuters. Extra carrying capacity typically allows airlines to carry more payload or fly further. \nA person familiar with Airbus’s plans said it was studying two main options to respond to the new Boeing mid-jet, but was pausing decisions to try to force Boeing to show its hand first. \nThe first would involve raising the maximum take-off weight to about 100 tonnes from the 97 tonnes on the already enhanced A321LR version, now being prepared for its maiden flight. \nThat calls for changes to the existing wing and a stronger landing gear but could need more engine thrust, the person said. \nA costlier option would include a lighter new wing with a larger area: something that helps reduce thrust requirements by allowing the jet to take off or deal with an engine problem with help from the wings without extra thrust or a longer runway. \nBoth options would involve stretching the aircraft slightly to accommodate one or two extra rows of seats, the person said. \nAirbus declined comment. (Reporting by Tim Hepher; Editing by Sudip Kar-Gupta and Conor Humphries)", "external_links": [], "published": "2018-01-22T19:31:00.000+02:00", "crawled": "2018-01-22T19:49:54.003+02:00", "highlightTitle": ""}