{"organizations": [], "uuid": "004dcf5e9305ee32fa9821a2d2c84658746bd83b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-alexander-baldwin-announces-two-financial-leadership-appointments.html", "country": "US", "domain_rank": 767, "title": "Alexander & Baldwin announces two financial leadership appointments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:38:00.000+02:00", "replies_count": 0, "uuid": "004dcf5e9305ee32fa9821a2d2c84658746bd83b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-alexander-baldwin-announces-two-financial-leadership-appointments.html", "ord_in_thread": 0, "title": "Alexander & Baldwin announces two financial leadership appointments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HONOLULU, Jan. 30, 2018 /PRNewswire/ -- Alexander & Baldwin, Inc. (NYSE:ALEX) (\"A&B\" or \"Company\") announced Clayton Chun has been appointed as chief accounting officer and Kenneth Kan has been named as the company's treasurer. Both Chun and Kan will continue to report to Jim Mead, A&B's chief financial officer.\nChun also will continue to serve as A&B's corporate controller, a position he assumed in 2015, and will be responsible for overseeing the company's accounting operations, internal controls and financial reporting functions.\n\"We are excited to recognize Clayton for his increased responsibilities as he has taken over full management of the finance and accounting department, and guided improvements in process and additions to our technology platform. As a senior member of our team, his contributions will enable us to build and maintain a platform that will support our continued growth,\" Mead said.\nPrior to joining A&B, Chun was an audit senior manager at Deloitte & Touche, LLP in Los Angeles where he worked for 15 years. At Deloitte, Chun was responsible for managing complex integrated audit engagements, ranging from start-ups to multinational Fortune 500 companies, as well as other service functions which increased profitability, supported growth, and managed risk.\nChun is a certified public accountant (CPA). Raised in Hawaii, he earned a master's degree in accounting from the University of Southern California and a bachelor's degree in economics from Washington University in St. Louis, Missouri.\nAs treasurer, Kan has a senior role in managing corporate financing activities that include responsibilities in managing banking and capital market activities, corporate development and traditional treasury functions such as cash management.\n\"Kenny's deep knowledge and experience add to our breadth of capabilities to develop financial options and manage our various investment activities. His appointment as treasurer recognizes his valuable continuing contributions,\" Mead said.\nKan has extensive experience in finance, real estate and strategic planning. Prior to joining A&B, he most recently served with Outrigger Enterprises Group as corporate director, business planning and analysis working on the acquisitions, dispositions and financings for the company. Prior to that, he was chief financial officer for The Resort Group and also has served as vice president at Grove International Partners in New York and as a portfolio manager at Goldman Sachs Realty Japan Division in Tokyo.\nKan earned a bachelor's degree in business administration, specializing in finance, from the University of Hawaii – Manoa and a master's of business administration from the University of Chicago Booth School of Business.\nContact:\nDarren Pai\n808-525-6659\ndpai@abhi.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/alexander--baldwin-announces-two-financial-leadership-appointments-300590718.html\nSOURCE Alexander & Baldwin", "external_links": ["http://www.prnewswire.com/news-releases/alexander--baldwin-announces-two-financial-leadership-appointments-300590718.html"], "published": "2018-01-31T01:38:00.000+02:00", "crawled": "2018-01-31T02:08:16.009+02:00", "highlightTitle": ""}