{"organizations": [], "uuid": "7159d8a8cd593f0a131859701baf692424dec716", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/indices", "section_title": "Market Indices | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-slips-further-from-3-1-2-month-high-after-u-s-data-idUSL8N1P02XX", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold dips as dollar climbs despite lackluster U.S. payrolls data", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-05T22:35:00.000+02:00", "replies_count": 0, "uuid": "7159d8a8cd593f0a131859701baf692424dec716"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-slips-further-from-3-1-2-month-high-after-u-s-data-idUSL8N1P02XX", "ord_in_thread": 0, "title": "PRECIOUS-Gold dips as dollar climbs despite lackluster U.S. payrolls data", "locations": [], "entities": {"persons": [{"name": "jan harvey", "sentiment": "none"}, {"name": "renita d. young", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Gold still on track for fourth week of gains * U.S. non-farm payrolls data miss forecasts * GRAPHIC-2018 asset returns: tmsnrt.rs/2jvdmXl (New throughout, updates prices, market activity and comments, adds second byline and NEW YORK dateline)) By Renita D. Young and Jan Harvey NEW YORK/LONDON, Jan 5 (Reuters) - Gold dipped in choppy trading on Friday as traders cashed in gains from the metal's rally to 3-1/2-month highs this week and as the dollar rose even after weaker-than-expected U.S. payrolls data for December. Spot gold was down 0.2 percent at $1,319.70 an ounce by 1:45 p.m. EST (1845 GMT), off Thursday's high of $1,325.86. It was still up 1.3 percent from last week's close. U.S. gold futures for February delivery settled up 70 cents, or 0.05 percent, at $1,322.30 per ounce. The metal remained on track for a fourth straight weekly gain, something it has not done since April although it posted an annual increase of 13 percent in 2017. The U.S. December non-farm payrolls report was weaker than expected. The dollar dipped briefly, then rose as investors reckoned the data would not deter U.S. Federal Reserve from raising interest rates multiple times this year though at a gradual pace. \"The disappointing jobs report is giving gold a boost, but the hourly earnings being in line with expectations is holding it down a bit,\" said Ryan McKay, commodity strategist at TD Securities in Toronto. Traders overall stuck to their conviction that the Federal Reserve will raise rates at least twice this year, a Reuters analysis of fed funds futures contracts traded at CME Group suggested. Gold is highly sensitive to rising U.S. interest rates, as these increase the opportunity cost of holding non-yielding bullion, while boosting the dollar, in which it is priced. Investment rotation between different asset classes, including digital currencies, may also be distracting investors from gold, said Phillip Streible, senior commodities strategist at RJO Futures in Chicago. Among other precious metals, silver was down 0.1 percent at $17.22 an ounce earlier touching its highest point in more than six weeks at $17.29, and 1.6 percent higher for the week. Platinum was up 0.8 percent at $967 an ounce, earlier hitting a 3-1/2 month peak at $969.90, 4.6 percent higher than last week. Palladium was down 0.8 percent at $1,087.30 per ounce, also retreating after hitting a record high of $1,105.70 on Thursday. It was 2.5 percent higher on the week. It was the best performer among major precious metals last year, rising 56 percent on fears that rising demand for the autocatalyst metal would further tighten the market after years of deficit. (Additional reporting by Nallur Sethuraman in Bengaluru; Editing by Davidv Gregorio and David Goodman)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://tmsnrt.rs/2jvdmXl"], "published": "2018-01-05T22:35:00.000+02:00", "crawled": "2018-01-05T22:38:56.014+02:00", "highlightTitle": ""}