{"organizations": [], "uuid": "a492fababaa3d83fb838445474f20326e01dbd70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/02/reuters-america-global-markets-sp-nasdaq-hit-record-closing-highs-in-new-year-dollar-drops.html", "country": "US", "domain_rank": 767, "title": "GLOBAL MARKETS-S&P, Nasdaq hit record closing highs in new year; dollar drops", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T23:47:00.000+02:00", "replies_count": 0, "uuid": "a492fababaa3d83fb838445474f20326e01dbd70"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/reuters-america-global-markets-sp-nasdaq-hit-record-closing-highs-in-new-year-dollar-drops.html", "ord_in_thread": 0, "title": "GLOBAL MARKETS-S&P, Nasdaq hit record closing highs in new year; dollar drops", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* U.S. stocks close higher, boosting global shares\n* European equities close lower\n* Euro and sterling gain while dollar drops (Updates to U.S. market close; adds commentary)\nNEW YORK, Jan 2 (Reuters) - The S&P 500 and the Nasdaq Composite notched record closing highs on Tuesday, the first trading day of 2018, while European equities finished lower and the U.S. dollar fell to its weakest level in over three months against key currencies.\nMSCI's gauge of stocks across the globe gained 0.74 percent. In 2017 the index set scores of record highs and rose by one-fifth in value.\nMajor stock indexes closed 2017 with their best performance since 2013. In the U.S. market, the advance came amid strong economic growth and corporate earnings, low interest rates and hopes, now realized, of U.S. corporate tax cuts.\nU.S. equity indexes closed higher on Tuesday, buoyed by gains in technology and consumer discretionary stocks.\nThe Dow Jones Industrial Average rose 104.79 points, or 0.42 percent, to 24,824.01, the S&P 500 gained 22.18 points, or 0.83 percent, to 2,695.79, and the Nasdaq Composite added 103.51 points, or 1.5 percent, to 7,006.90.\n\"We're off to the races once again,\" said Stephen Massocca, senior vice president at Wedbush Securities in San Francisco.\n\"I don't expect the kind of moves we saw last year,\" he said. \"But as long as monetary policy stays the way it is ... my view is stocks are going to have a decent year. And fiscal policy has become stimulative as well given the tax bill.\"\nIn Europe, equities closed lower, weighed by a decline in autos stocks following weaker car registrations data. Trading was also cautious ahead of the launch of a major reform of European financial markets.\nThe pan-European STOXX 600 index fell 0.21 percent, and euro zone stocks shed 0.19 percent.\nShares rose in Asia. Shanghai blue chips climbed 1.41 percent and MSCI's 24-country emerging market stock index jumped to a multi-year high after the Caixin index of Chinese industry rose to a four-month high of 51.5 in December, confounding forecasts for a decline. The 50-mark divides expansion from contraction.\nFALLING DOLLAR\nThe dollar index, which tracks the greenback against a basket of major currencies, fell 0.29 percent, hampered by expectations of a slower pace of interest rate increases by the Federal Reserve amid a tepid U.S. inflation picture.\nThe dollar hit a three-month low on Friday, bringing its losses for 2017 to 9.8 percent, its worst performance since 2003.\nOther currencies gained. The euro rose 0.39 percent to $1.2055 and hit a four-month high on Tuesday after data showed that euro zone manufacturers ramped up activity last month at the fastest pace in more than two decades.\nThe Japanese yen strengthened 0.32 percent at 112.29 per dollar, while sterling was last trading at $1.3594, up 0.69 percent.\nU.S. Treasury yields rose in line with European government yields. A European Central Bank official said the ECB's massive bond purchase program might not continue later this year.\nA reversal of year-end buying has also driven U.S. Treasury yields higher, said Brian Rehling, co-head of global fixed income strategy for Wells Fargo Investment Institute in St. Louis.\n\"Lots of institutions buy Treasuries to hold over year-end for liquidity. To see that reversal early in the year is not a surprise,\" Rehling said.\nBenchmark U.S. 10-year notes last fell 14/32 in price to yield 2.4597 percent, from 2.411 percent late on Friday.\nThe 30-year bond last fell 43/32 in price to yield 2.8073 percent, from 2.741 percent late on Friday.\nOil prices earlier enjoyed their strongest start to a year since 2014 but fell lower as major pipelines in Libya and Britain's North Sea restarted and U.S. production soared to the highest level in more than four decades.\nU.S. crude last fell 0.1 percent to $60.36 per barrel and Brent was at $66.53, down 0.51 percent.\nCopper lost 0.42 percent to $7,216.50 a tonne, following a rise of 31 percent in 2017 to a four-year top.\nSpot gold added 1.2 percent to $1,317.69 an ounce, after advancing by 13 percent in 2017 for its best performance in seven years.\n(Additional reporting by Marc Jones, Dmitry Zhdannikov and Helen Reid in London, Henning Gloystein in Singapore, Sruthi Shankar in Bengaluru, and Caroline Valetkevitch, Richard Leong, Gertrude Chavez-Dreyfuss in New York; Editing by Nick Zieminski and Leslie Adler)", "external_links": [], "published": "2018-01-02T23:47:00.000+02:00", "crawled": "2018-01-03T08:48:54.092+02:00", "highlightTitle": ""}