{"organizations": [], "uuid": "9fdbf180672e299daf8aa0bcd33598ffe83ea461", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223363936&w=1200&r=LYNXMPEE0I12K", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-france-business-versailles/en-route-to-davos-macron-makes-versailles-the-place-to-be-idUSKBN1F81RS", "country": "US", "domain_rank": 408, "title": "En route to Davos, Macron makes Versailles the place to be", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:54:00.000+02:00", "replies_count": 0, "uuid": "9fdbf180672e299daf8aa0bcd33598ffe83ea461"}, "author": "", "url": "https://www.reuters.com/article/us-france-business-versailles/en-route-to-davos-macron-makes-versailles-the-place-to-be-idUSKBN1F81RS", "ord_in_thread": 0, "title": "En route to Davos, Macron makes Versailles the place to be", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "negative"}, {"name": "michel rose", "sentiment": "none"}, {"name": "jamie dimon", "sentiment": "none"}, {"name": "sheryl sandberg", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "lloyd blankfein", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "versailles", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "france inc", "sentiment": "none"}, {"name": "min read  paris", "sentiment": "none"}, {"name": "jp morgan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 2:55 PM / Updated 6 hours ago En route to Davos, Macron makes Versailles the place to be Michel Rose 3 Min Read \nPARIS (Reuters) - French President Emmanuel Macron will host dozens of the world’s most powerful business executives at the gilded Palace of Versailles to pitch France Inc before the global elite’s annual gathering at Davos. \nGoldman Sachs’s Lloyd Blankfein, JP Morgan’s Jamie Dimon and Facebook’s Sheryl Sandberg will be among the chief executives at the summit that the presidency is dubbing “Choose France”. \nElysee sources said “concrete” investment decisions would be announced. \n“Monday, in the global business world, France will be the place to be,” one presidential adviser quipped. \n“Many investors will be in Europe for the Davos summit, so we’ve suggested a stopover in Paris,” another Macron aide said. \nMacron, a former investment banker, and his government are pushing through social and economic reforms to re-shape the French economy and restore France’s image among investors. \nInvestors frequently complain of the country’s high labor costs and rigid labor regulations, and remember his socialist predecessor’s now-defunct 75 percent tax on millionaires. FILE PHOTO: French President Emmanuel Macron walks through the Galerie des Bustes (Busts Gallery) to access the Versailles Palace in July 2017. REUTERS/Etienne Laurent/Pool/File Photo \nFrench officials have also seized on Britain’s decision to exit the European Union, Germany’s complex coalition talks and Spain’s Catalonia crisis to promote France as a haven of stability at the heart of the European single market. \nHalf of the companies represented at the grand palace of Versailles will be European, a quarter American, and another quarter from Asia and the Middle East, Elysee officials said. \nThe list of attendees reads like a Who’s Who of international business and is a sign of the 40-year-old French leader’s continued pulling power eight months into his presidency. \nThe include top executives from HSBC, Bank of America, Google, Rolls Royce, SAP, UPS, Bosch, Alibaba, JD.com, GlaxoSmithKline, Novartis and Cisco. \nOne of the aides said executives would “speed date” with French ministers in the afternoon before Macron joins them. \nDozens of investment projects will be discussed, and Elysee insiders expect four to five “significant and emblematic” announcements to be made, including one for a job-creating bricks-and-mortar factory in the industrial sector. \nTwo announcements in the digital sector and artificial intelligence will also be made, they said. \nMacron, 40, then travels to Davos where in a speech on Wednesday he will set out his vision for the future of globalization, the Elysee officials said. Widening inequalities, global warming and the rise of nationalism will feature in the 45-minute speech. Reporting by Michel Rose; Editing by Richard Lough", "external_links": [], "published": "2018-01-19T16:54:00.000+02:00", "crawled": "2018-01-19T17:03:40.018+02:00", "highlightTitle": ""}