{"organizations": [], "uuid": "0f7be3b4f4908568fa231395f12b34cecf56472e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/eurozone-bonds-safeasset/bond-issuing-robot-may-help-europe-avoid-next-crisis-idUSL8N1PH2WN", "country": "US", "domain_rank": 408, "title": "Bond-issuing \"robot\" may help Europe avoid next crisis", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T17:23:00.000+02:00", "replies_count": 0, "uuid": "0f7be3b4f4908568fa231395f12b34cecf56472e"}, "author": "", "url": "https://www.reuters.com/article/eurozone-bonds-safeasset/bond-issuing-robot-may-help-europe-avoid-next-crisis-idUSL8N1PH2WN", "ord_in_thread": 0, "title": "Bond-issuing \"robot\" may help Europe avoid next crisis", "locations": [], "entities": {"persons": [{"name": "philip lane", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "helsinki", "sentiment": "none"}, {"name": "helsinki", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "forsell", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 3:26 PM / in 10 minutes Bond-issuing \"robot\" may help Europe avoid next crisis Tuomas Forsell 3 Min Read \nHELSINKI, Jan 22 (Reuters) - Europe’s next financial crisis may be averted with the help of a new “safe asset” aimed at breaking a vicious circle of lending by banks to their national governments, the man in charge of creating it said on Monday. \nPhilip Lane, the head of a taskforce working on a synthetic bond backed by the sovereign debt of all EU countries, said Safe Bond-Backed Securities (SBBS) would give banks in the region an alternative form of collateral to national government bonds. \nSeeking to assuage fears in Germany that it could end up paying for other governments’ debt or bailing out the SBBS issuer in case of market stress, he said the issuing entity must follow strict guidelines and be shielded from political interference. \n“These sovereign bond-backed securities are issued by a robot,” the Irish central bank governor said in Helsinki. \n“There is no possibility for anyone to interfere with the robot.” \nThe new “safe asset” for banks across the European Union is intended to address a problem that exacerbated the financial crisis, whereby banks buy “risk free” sovereign debt to meet a requirement that they must hold top-rated liquid assets. \nBut if a sovereign runs into trouble, its banks will automatically suffer as investors sell off government debt, forcing banks to curb lending and exacerbating economic pain. \nLane, who is due to publish a report on the matter next week, stressed that each government would still have to pay back its own debt even after SBBS are introduced. \nUnder current plans, a special purpose entity -- either public or private -- would issue debt backed by government bonds of the 19 euro zone countries, but without any element of sovereign risk-pooling or mutualisation of liabilities. \nLane said these bonds would be divided into three tranches of increasing riskiness -- senior, mezzanine and junior. \nTo lure buyers, Lane said the senior tranches should enjoy the same regulatory status as government bonds. This means banks wouldn’t have to hold any capital against them. \n“One necessary condition for market creation is to treat SBBS in line with their unique design and risk properties,” Lane said. “Senior SBBS ... should be treated no more severely than sovereign bonds.” \nHe added that it was part of the Commission’s work programme for the year. (Reporting by Tuomas Forsell, Writing by Balazs Koranyi and Francesco Canepa; Editing by Catherine Evans)", "external_links": [], "published": "2018-01-22T17:23:00.000+02:00", "crawled": "2018-01-22T17:46:28.021+02:00", "highlightTitle": ""}