{"organizations": [], "uuid": "7f5c69b1df2a683bf61dbc0017f144b1937d7fd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-franklin-covey-reports-fiscal-2018-first-quarter-financial-results.html", "country": "US", "domain_rank": 767, "title": "Franklin Covey Reports Fiscal 2018 First Quarter Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.263, "site_type": "news", "published": "2018-01-05T00:10:00.000+02:00", "replies_count": 0, "uuid": "7f5c69b1df2a683bf61dbc0017f144b1937d7fd8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-franklin-covey-reports-fiscal-2018-first-quarter-financial-results.html", "ord_in_thread": 0, "title": "Franklin Covey Reports Fiscal 2018 First Quarter Financial Results", "locations": [], "entities": {"persons": [{"name": "franklin covey", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "company", "sentiment": "none"}, {"name": "provide foundation for accelerated growth", "sentiment": "none"}, {"name": "franklin covey co.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "fc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Year-Over-Year Sales Increase 20% to $47.9 Million with Sales Growth in Both the Enterprise Division and Education Division\nGross Margin for the First Quarter Increases to 68.6% from 63.6% in Prior Year First Quarter\nStrong Growth and Momentum of Subscription Business Expected to Provide Foundation for Accelerated Growth in Fiscal 2018 and Beyond\nCompany Reaffirms Guidance for Fiscal 2018\nSALT LAKE CITY--(BUSINESS WIRE)-- Franklin Covey Co. (NYSE: FC), a global performance improvement company that creates and distributes world-class content, training, processes, and tools that organizations and individuals use to transform their results, today announced financial results for its fiscal 2018 first quarter, which ended on November 30, 2017.\nIntroduction\nWith the fiscal 2016 launch of the All Access Pass (AAP), the Company began a major transition in its business model. Previously, the Company sold content and solutions one course, or one solution at a time, and often to only one team at a time. However, two years ago the Company determined the it could substantially expand the breadth and depth of its client impact, and the lifetime value of its clients, by offering its world-class content and offerings through a Subscription as a Service (SaaS) model featuring the All Access Pass in its Enterprise Division and The Leader in Me subscription service in its Education Division. The SaaS model provides the Company’s clients with a compelling value proposition in which they receive: (1) unlimited access to the Company’s content and solutions; (2) the ability to assemble, integrate and deliver this content through an almost limitless combination of delivery modalities, and soon in 16 languages worldwide; (3) the services of an implementation specialist to help curate and organize the content and solutions in the AAP to exactly meet their needs; (4) a cost per population trained which is less than or equal to that offered by other providers for just a single course through a single delivery modality; and (5) an array of affordable add-on implementation services to help them accomplish their key “jobs-to-be-done.”\nAs expected, the transition to the SaaS business model has been disruptive, especially to the Company’s reported financial results, since subscription revenues are generally deferred and recognized over the contract period. But the Company believes that the transition to a SaaS business model is working and some of the benefits of this business model became evident in the first quarter of fiscal 2018 as sales increased 20% over the prior year to $47.9 million. Increased sales and improved gross margin were partially offset by increased operating expenses as the Company continues to work through the transition to a SaaS model and seeks to reorganize and optimize its operations in order to improve profitability. The Company believes that the first quarter of fiscal 2018 represents a key inflection point that will begin a pattern of improved financial performance compared with prior periods. However, the ongoing transition to the SaaS business model may continue to present challenges to the Company’s quarterly financial results during certain periods of fiscal 2018 when compared with the prior year.\nFinancial Overview\nThe following is a summary of key financial results for the quarter ended November 30, 2017:\nRevenue: Consolidated revenue for the first quarter of fiscal 2018 increased 20% and totaled $47.9 million compared with $39.8 million in the first quarter of fiscal 2017. As mentioned above, the improvement in sales was primarily driven by the recognition of previously deferred high-margin subscription revenues. In addition, the Company’s sales were also favorably impacted by the acquisition of businesses in the second half of fiscal 2017, a large intellectual property contract that was obtained in the first quarter of fiscal 2018, increased onsite presentation revenue, and increased Education Division revenues. All Access Pass Contracts and Unbilled Deferred Revenue: For the quarter ended November 30, 2017, the Company invoiced $12.3 million of All Access Pass contracts and $5.1 million of related materials, compared with $7.1 million of AAP contracts and $6.4 million of related products in the first quarter of fiscal 2017. At November 30, 2017, the Company had $15.9 million of unbilled deferred revenue, which represents business that is contracted but unbilled, and excluded from its balance sheet. Gross profit: First quarter 2018 gross profit was $32.9 million compared with $25.3 million in the prior year. The Company’s gross margin for the quarter ended November 30, 2017 increased to 68.6 percent of sales compared with 63.6 percent in the first quarter of fiscal 2017. The increase in gross profit and gross margin was primarily due to the recognition of previously deferred revenue and the other factors described above. Operating Expenses: The Company’s operating expenses in the first quarter of fiscal 2018 increased by $5.4 million compared with the prior year, which was primarily due to a $4.7 million increase in selling, general, and administrative (SG&A) expenses, and a $0.7 million increase in amortization expense. Increased SG&A expenses were primarily due to increased associate costs resulting from new sales and sales related personnel, especially in the Education Division, and increased commission expense on higher sales; and $1.2 million of increased expense associated with the change in fair value of contingent consideration liabilities from previous business acquisitions. Increased amortization expense was due to the amortization of intangible assets acquired in business combinations which occurred in the second half of fiscal 2017. Operating Income (Loss): The Company reported a loss from operations for the first quarter of $(3.3) million compared with a loss from operations of $(5.4) million in the first quarter of the prior year. Adjusted EBITDA: Adjusted EBITDA for the first quarter was $0.6 million, compared with a loss of $(2.8) million in the first quarter of fiscal 2017. Net Income (Loss): The Company reported a first quarter 2018 net loss of $(2.4) million compared with a net loss of $(4.0) million in the first quarter of fiscal 2017, reflecting the above-noted factors. Cash and Liquidity Remain Strong: The Company’s balance sheet and liquidity position remained healthy through the first quarter of fiscal 2018. The Company had $8.1 million of cash at November 30, 2017, compared with $8.9 million at August 31, 2017. At November 30, 2017, the Company had $21.0 million of available borrowing on its revolving line of credit facility. Fiscal 2018 Outlook: Based on anticipated increases in its SaaS business, the Company reaffirms its previously announced Adjusted EBITDA guidance for fiscal 2018, which is expected to be in the range of $10 million to $15 million.\nBob Whitman, Chairman and Chief Executive Officer, commented, “We were pleased that, as expected, the first quarter of fiscal 2018 represented an inflection point where the strong growth of our SaaS business more than offsets declines in our traditional facilitat", "external_links": ["http://www.businesswire.com/news/home/20180104006305/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fedge.media-server.com%2Fm6%2Fp%2Fhizopo4j&esheet=51738222&newsitemid=20180104006305&lan=en-US&anchor=http%3A%2F%2Fedge.media-server.com%2Fm6%2Fp%2Fhizopo4j&index=1&md5=302c3167c249ab9f408dd79a5b5ed0a9", "http://edge.media-server.com/m6/p/hizopo4j", "http://investor.franklincovey.com/phoenix.zhtml?c=102601&p=irol-IRHome", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.franklincovey.com&esheet=51738222&newsitemid=20180104006305&lan=en-US&anchor=www.franklincovey.com&index=3&md5=7304c74aef3e35acacbbb0020eaf29ca", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.franklincovey.com%2Fphoenix.zhtml%3Fc%3D102601%26p%3Dirol-IRHome&esheet=51738222&newsitemid=20180104006305&lan=en-US&anchor=http%3A%2F%2Finvestor.franklincovey.com%2Fphoenix.zhtml%3Fc%3D102601%26p%3Dirol-IRHome&index=2&md5=d687d76baf6d219d44dfc53e9e4bcbf2"], "published": "2018-01-05T00:10:00.000+02:00", "crawled": "2018-01-05T01:34:02.000+02:00", "highlightTitle": ""}