{"organizations": [], "uuid": "e2ce11d4502d3343db7015850765df56b876b59f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/04/the-associated-press-hyundai-vw-ink-deals-with-all-star-autonomous-vehicle-firm.html", "country": "US", "domain_rank": 767, "title": "Hyundai, VW, ink deals with all-star autonomous vehicle firm", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:11:00.000+02:00", "replies_count": 0, "uuid": "e2ce11d4502d3343db7015850765df56b876b59f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/the-associated-press-hyundai-vw-ink-deals-with-all-star-autonomous-vehicle-firm.html", "ord_in_thread": 0, "title": "Hyundai, VW, ink deals with all-star autonomous vehicle firm", "locations": [], "entities": {"persons": [{"name": "urmson", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "drew bagnell", "sentiment": "none"}, {"name": "chris urmson", "sentiment": "none"}, {"name": "anderson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "aurora", "sentiment": "none"}, {"name": "palo alto", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "vw", "sentiment": "negative"}, {"name": "hyundai", "sentiment": "negative"}, {"name": "volkswagen", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "aurora innovation", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (AP) — Hyundai and Volkswagen each say they're partnering with a U.S. autonomous vehicle tech firm led by former executives from Google, Tesla and Uber.\nThe companies on Thursday announced partnerships with Aurora Innovation, started last year by ex-Google autonomous car chief Chris Urmson and others.\nVW says its collaboration will help bring self-driving cars quickly to roads worldwide, while autonomous Hyundais are expected to be in the market by 2021.\nThe partnerships are the latest in a string of tie-ups between traditional auto companies and tech firms as they race to be first with self-driving vehicles.\nAurora is based in Pittsburgh and Palo Alto, California. It was started last year by Urmson, former Tesla executive Sterling Anderson, and ex-Uber autonomous vehicle leader Drew Bagnell.\nTerms of each partnership were not released, but Urmson, who is Aurora's CEO, said the startup will make a profit by helping Hyundai and VW develop safe autonomous vehicles. In an interview with The Associated Press, Urmson said he isn't sure exactly where money will be made in autonomous vehicles. It could be from developing sophisticated sensing and guidance systems, manufacturing vehicles or providing transportation as a service.\n\"The way the economics play out over time is still far from foregone,\" he said. \"We still don't know which of these pieces will be dominant or if they will find a happy equilibrium.\"\nUrmson left Alphabet Inc.'s Google in 2016 after more than seven years of work on its autonomous vehicles. At Tesla Inc., Anderson led development of the company's semi-autonomous Autopilot system after its initial release, and he led development of the Model X SUV, according to Aurora's website. Bagnell was a founding member of Uber Technologies Inc.'s Advanced Technology Center that's working on autonomous cars in Pittsburgh.\nGermany-based Volkswagen AG, which produces about 10 million vehicles annually, hopes the tie-up will bring autonomous vehicle technology to all of its brands. The company says it has been working with Aurora for the past six months, integrating its sensors, hardware and software into VW vehicles.\nHyundai Motor Co. said the partnership with Aurora will bring autonomous vehicles to market that can operate without human input in most conditions.\nThe partnership has yet to say how its first batch of self-driving vehicles will be used, but analysts expect they will likely be for commercial use, such as self-driving taxis or ride-hailing services, rather than for sales to individual consumers. General Motors said in November that its self-driving vehicles will carry passengers and deliver goods in big cities by 2019.\nHyundai earlier joined with Cisco Systems Inc. and Baidu Inc. to collaborate on internet-connected cars. It has also set up a $45 million fund with South Korea's SK Telecom and Hanwha Asset Management to invest in artificial intelligence startups worldwide.\nThe South Korean automaker plans to share more details of its project with Aurora during the Consumer Electronics Show in Las Vegas next week, where it will also unveil the brand name of a new fuel-cell SUV that will be tested for self-driving technology.\nThe company plans to show off some of its autonomous driving cars during the Winter Olympics Game next month in Pyeongchang, South Korea.\nYoukyung Lee contributed to this report from Seoul.", "external_links": [], "published": "2018-01-04T16:11:00.000+02:00", "crawled": "2018-01-05T00:03:52.001+02:00", "highlightTitle": ""}