{"organizations": [], "uuid": "9157c682a9a0a8efbfc9b72385d0d37b74c742f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-mb-financial-inc-to-redeem-series-a-preferred-stock.html", "country": "US", "domain_rank": 767, "title": "MB Financial, Inc. to Redeem Series A Preferred Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T01:00:00.000+02:00", "replies_count": 0, "uuid": "9157c682a9a0a8efbfc9b72385d0d37b74c742f3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-mb-financial-inc-to-redeem-series-a-preferred-stock.html", "ord_in_thread": 0, "title": "MB Financial, Inc. to Redeem Series A Preferred Stock", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "mb financial, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 10, 2018 (GLOBE NEWSWIRE) -- MB Financial, Inc. (the “Company”) (NASDAQ:MBFI) announced today it will redeem all of the outstanding shares of its Perpetual Non-Cumulative Preferred Stock, Series A (the “Series A Preferred Stock”) (NASDAQ:MBFIP) (CUSIP No. 55264U207). There are currently 4,000,000 outstanding shares of the Series A Preferred Stock.\nThe Series A Preferred Stock will be redeemed on February 15, 2018 (the “Redemption Date”) at a redemption price (the “Redemption Price”) of $25.00 per share ($100,000,000 in the aggregate). Since the Redemption Date is also a dividend payment date, the Redemption Price does not include any declared and unpaid dividends. A declared dividend of $0.50 per share, for the current quarterly dividend period from and including November 15, 2017 to but excluding February 15, 2018 will be paid separately in the customary manner on February 15, 2018 to holders of record of the Series A Preferred Stock as of January 31, 2018.\nUpon redemption, the Series A Preferred Stock will no longer be deemed outstanding, no further dividends will accrue on the Series A Preferred Stock and the only remaining right of the holders of the Series A Preferred Stock will be to receive payment of the Redemption Price, without interest. Trading of the Series A Preferred Stock on the NASDAQ Stock Market also will cease.\nThe redemption will be funded with a portion of the net proceeds of the Company’s public offering of depositary shares, each representing a 1/40 th interest in a share of the Company’s 6.00% Non-Cumulative Perpetual Preferred Stock, Series C, which was completed on November 22, 2017.\nAll shares of the Series A Preferred Stock are held in book-entry form through The Depository Trust Company (“DTC”). Accordingly, the Series A Preferred Stock will be redeemed in accordance with the applicable procedures of DTC. Notice of the redemption and payment of the aggregate Redemption Price will be made to DTC on the Company’s behalf by Computershare, as redemption agent (the “Redemption Agent”). The address of the Redemption Agent is Attention: Corporate Actions, 250 Royall Street, Canton, MA 02021, and its telephone number is 1-866-241-9990 (1-201-680-6578 outside the United States and Canada). Questions regarding the redemption of the Series A Preferred Stock may be directed to the Redemption Agent.\nMB Financial, Inc. is the Chicago-based holding company for MB Financial Bank, N.A. (“MB”) which has approximately $20 billion in assets and a more than one hundred year history of building deep and lasting relationships with middle-market companies and individuals. MB offers a full range of powerful financial solutions and the expertise and experience of bankers who are focused on their clients’ success. Learn more about MB by visiting www.mbfinancial.com .\nSafe Harbor Statement: Statements in this press release that are not historical facts are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. By their nature, such statements are subject to numerous factors that could cause actual results to differ materially from those anticipated in the statements, as discussed in MB Financial’s filings with the Securities and Exchange Commission. You should not place undue reliance on any forward-looking statements and MB Financial undertakes no obligation to update any such statements to reflect circumstances or events that occur after the date on which the forward-looking statement is made.\nFor Information at MB Financial, Inc. contact:\nBerry Allen - Investor Relations\nE-Mail: beallen@mbfinancial.com\nSource:MB Financial Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=DCnLSppaqj3u_QnqzEJJJFD7P5GfWfYs6BwzFcWrCZLwWKadoWaA9eDdKu3ZOuWMmkMNuvd0ksQ4vjypisobV9nAhUVhVvOPuEbVob7dhnI=", "https://www.globenewswire.com/Tracker?data=SO-guoD14q_R5_lLiwzFHJAoi4E3UxporHpdGDoZRdRCdWyxS942oKs0ZiLZ_6oSoLx0-lnDxW8d_I_NVVDXFvkfzraklGAukAc8Q00PHtA=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/b2850089-c6da-42ed-bd4a-d32aa0dc2da7"], "published": "2018-01-11T01:00:00.000+02:00", "crawled": "2018-01-11T03:23:09.004+02:00", "highlightTitle": ""}