{"organizations": [], "uuid": "a1a206b526c317092e541def402f387aa9a0b811", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-balbix-adds-veteran-cmo-mark-weiner-to-accelerate-growth-as-it-addresses-the-challenge-of-predicting-and-preventing-breach.html", "country": "US", "domain_rank": 767, "title": "Balbix Adds Veteran CMO Mark Weiner to Accelerate Growth as It Addresses the Challenge of Predicting and Preventing Breach Risk Across Enterprises", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T19:00:00.000+02:00", "replies_count": 0, "uuid": "a1a206b526c317092e541def402f387aa9a0b811"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-balbix-adds-veteran-cmo-mark-weiner-to-accelerate-growth-as-it-addresses-the-challenge-of-predicting-and-preventing-breach.html", "ord_in_thread": 0, "title": "Balbix Adds Veteran CMO Mark Weiner to Accelerate Growth as It Addresses the Challenge of Predicting and Preventing Breach Risk Across Enterprises", "locations": [], "entities": {"persons": [{"name": "mark weiner", "sentiment": "neutral"}, {"name": "mark", "sentiment": "none"}, {"name": "balbix", "sentiment": "none"}], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "globe newswire", "sentiment": "neutral"}, {"name": "balbix, inc.", "sentiment": "neutral"}, {"name": "cmo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif., Jan. 24, 2018 (GLOBE NEWSWIRE) -- Balbix, Inc. , provider of the security industry's first predictive breach risk management platform, today announced the appointment of Mark Weiner as its inaugural chief marketing officer (CMO). Mark comes from the white-hot SD-WAN space where he served as the CMO of industry innovator Versa Networks. He brings over 25 years of leadership and market creation experience in the security, networking, cloud and datacenter sectors and has proven himself multiple times in building startups from the ground up and taking disruptive technology vendors to the next-level of market awareness and product adoption.\nMark joins Balbix as the need for an integrated approach to security and risk management sweeps across every enterprise today, with the massive increase in the incidence of data breaches. Per the Gartner Magic Quadrant for IT Risk Management 1 , “A heightened focus on cybersecurity initiatives has led to a spurt of interest in the capabilities of IT Risk Management (ITRM) solutions. These solutions support management of IT-related risk, and facilitate reporting on cybersecurity-related initiatives; specifically of recent interest are IT risk assessment, security incident response and Security Orchestration, Automation and Reporting (SOAR) capabilities.” John Wheeler, author of Gartner’s Hype Cycle for Risk Management, 2017 2 writes, “Because digital business initiatives span the entire enterprise and cross industry lines, the business impact of digital risk management (DRM) will be significant.”\nBefore joining Balbix, Mark expanded the already white-hot SD-WAN category for Versa, and helped the company become quickly recognized by analysts as one of the leading vendors in the space. Earlier, Mark served as CMO/vice president of marketing at Centrify, StorSimple (acquired by Microsoft), Virtela (acquired by NTT), NetScaler (acquired by Citrix), and Redback Networks (#5 IPO of 1999), as well as led marketing for multiple business units at Cisco. He is also an adjunct professor at Santa Clara University. Mark holds an MBA from Santa Clara University and a Bachelors from the Haas Business School, UC Berkeley.\n“I made the decision to move from SD-WAN, one of the hottest markets in IT, to Balbix because I saw the same level of buzz, trajectory, and tremendous market opportunity in the breach risk management space,” said Mark Weiner, CMO, Balbix. “As enterprises continue to transform their business to become increasingly digital, they’re finding that their clutter of security and risk management solutions are not capable of proactively discovering and mitigating risk across their organization. Balbix’s unique approach to predicting and identifying risk across the enterprise, and ability to prioritize and clearly prescribe fixes, stood out to me as an opportunity to make a real impact in the ever-critical security market.”\nBalbix’s main differentiator is its ability to predict breaches, prioritize them by business risk, and prescribe the needed fixes – with simple and comprehensive visualization. Balbix is powered by an artificial intelligence (AI) engine that non-stop monitors and analyzes the enterprise network across 100+ attack vectors to provide a real-time, searchable breach risk assessment. By automating predictive risk calculations and prioritizing fixes based on business criticality, Balbix enables companies and security teams to maximize their effectiveness by channeling time into remediation vs. exploration efforts. The platform delivers an interactive color-coded map of assets at risk in the enterprise, giving security practitioners a simple way to assess the true risk posture of an enterprise and communicate that information to senior leadership.\n\"The enterprise attack surface is constantly evolving and growing as new IoT devices, cloud applications, and mobile devices are added to networks at massive scale and frequency. The landscape is changing so quickly through digitalization that humans can no longer keep up without AI-aided predictive analysis and prioritized action items. Mark’s battle scars and lessons learned over the years will be critical as we bring to market a holistic solution to address the growing challenges of breaches and digital risk,\" said Gaurav Banga, CEO and founder of Balbix.\nConnect with us on LinkedIn and follow us on Twitter .\nTo schedule a demo with the Balbix team, please visit: https://www.balbix.com/risk-assessment\n1 Gartner, “Magic Quadrant for IT Risk Management Solutions”; Khushbu Pratap, Jeffrey Wheatman, Matthew T. Stamper; 29 June 2017\n2 Gartner, “Hype Cycle for Risk Management, 2017”; John A. Wheeler; 19 July 2017\nAbout Balbix\nThe Balbix predictive breach-risk platform is the industry’s first system to leverage advanced AI to provide enterprises with a comprehensive and continuous predictive risk calculation visualized via a searchable and clickable risk heat-map. Balbix’s solution is designed for CIOs, CISOs and IT security teams who wish to proactively understand their breach risk and cyber-resilience, delivering contextually relevant information per viewer. The Balbix system can predict critical breach scenarios, help users prioritize security operations and projects, and improve cyber-resilience.\nMedia Contact Info:\nTravis Anderson\n10Fold for Balbix\n925.271.8227\ntanderson@10fold.com\nSource: Balbix", "external_links": ["https://www.globenewswire.com/Tracker?data=h-CrVLyI1FJBYXsSepEK04XUN98TPDWKPIcYtQB3p2E-yTU4vTsiFO398VAnBYVLmp0KZEiuAorIUwyVO4FLc-Z07arjpzx5D6vpmbFS-eo=", "https://www.globenewswire.com/Tracker?data=22-pFGAnmybqwqTCi_JWgBn5Iuw84iUOLR8JMbAZPpVMfdHMOsdrIhO454ARYplNB2NEjrYHUFGMux_GaCyHHw==", "https://www.globenewswire.com/Tracker?data=N5F_LR7u8HQ18ic1PCyhSu9H7zUIoEam-0dzVZ714aE1d9hC12Nml_5Kk2rplz1vEWCItbMfe2c8XM-Pon40dVnPsuvDRleDgsSG9aYYnscXx6zMoxxU4g7prQ9nLpJKU6A9YnvehpB3pfnOH5RpYg==", "https://www.globenewswire.com/Tracker?data=uPC2gqzF8RZ-Go00yF1PkNaGlYNht2wPcujJJSuOWUS7BaxAwarkSo6uXJB4ufIPkVqzgOxIcrxolB_vYggnTnXFlTqs3FH659qnbMY1yyk=", "https://www.balbix.com/risk-assessment", "https://www.globenewswire.com/Tracker?data=8SZ4kwAit9RIrRL3tj0uMXvOOeeOwKnFCmfs5iEKbx6oQQJY4g0baeSZSyJFKsZat8LOMbpzJoY9-I7gK9qppQ==", "https://www.globenewswire.com/Tracker?data=LRyeQCbL8fRIMjTxTrqnSoIhywvKc6I_rXBrhULb2Kh5IY0EwDDzhXzHfZDQ6tgRhFxRLm1Y8ZWUwPT_lQ52g52x9U8fDxsWLJU4MFZ7msg="], "published": "2018-01-24T19:00:00.000+02:00", "crawled": "2018-01-24T19:30:55.023+02:00", "highlightTitle": ""}