{"organizations": [], "uuid": "b8e1e9d2d7e6e07aa9ef0c6a851147bbed651988", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.topix.com/rss/wire/world/europe", "section_title": "", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-spanish-bonds-shine-after-fitch-ratings-upgrade-idUSL8N1PH1F1", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Spanish bonds shine after Fitch Ratings upgrade", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T12:33:00.000+02:00", "replies_count": 0, "uuid": "b8e1e9d2d7e6e07aa9ef0c6a851147bbed651988"}, "author": "", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-spanish-bonds-shine-after-fitch-ratings-upgrade-idUSL8N1PH1F1", "ord_in_thread": 0, "title": "UPDATE 1-Spanish bonds shine after Fitch Ratings upgrade", "locations": [], "entities": {"persons": [{"name": "dhara ranasinghe", "sentiment": "none"}, {"name": "fitch", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "none"}, {"name": "fitch ratings", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 9:05 AM / in 3 hours UPDATE 3-Spanish, Greek bonds shine after ratings upgrades Reuters Staff \n* Fitch upgrades Spain by one notch to ‘A-’ \n* Spain/German 10-yr yield gap tightest since 2015 \n* S&P lifts Greek long-term ratings for 1st time in 2 yrs \n* Thursday’s ECB meeting awaited \n* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Updates prices, adds U.S shutdown, Catalonia) \nBy Dhara Ranasinghe \nLONDON, Jan 22 (Reuters) - Spain’s borrowing costs fell to six-week lows and short-dated bond yields in Greece tumbled on Monday, after ratings upgrades for the two southern euro zone states provided further evidence of a turnaround for the bloc’s peripheral economies. \nFitch upgraded Spain’s credit rating to “A-” with a stable outlook late on Friday, citing a broad-based economic recovery and limited impact on the economy from Catalonia’s independence bid. It was Spain’s first “A” rating from one of the top three ratings agencies since the euro zone debt crisis. \nS&P Global Ratings, releasing its review on Greece after Friday’s market close, lifted Greek long-term, foreign currency ratings for the first time in two years on improvements in the finances and fiscal outlook for the debt-laden nation . \n“The fact that it is the first ratings upgrade in two years is a political win for government and the euro zone,” said Patrick O‘Donnell, an investment manager at Aberdeen Asset Management in London, referring to the Greek upgrade. \nOn a day when most euro zone government bond yields headed higher, alongside U.S. peers as a U.S. government shutdown entered a third day, Spanish and Greek bonds outperformed . \nSpain’s 10-year bond yield fell 4 basis points to 1.39 percent, its lowest level in six weeks. \nThe premium investors demand for holding Spanish bonds over top-rated German government debt fell to around 89 bps, its lowest since March 2015. \nOne cloud on Spain’s horizon, however, is the rekindling of the Catalan crisis, which may have tempered investors’ enthusiasm. \nOn Monday, Catalonia’s parliament nominated former leader Carles Puigdemont, sacked by Spain for unilaterally declaring independence, as candidate to rule the region again in a sign of defiance to Madrid. \nShort-dated Greek bond yields were down almost 8 bps at 1.31 percent. Five-year Greek bond yields were slightly lower at 2.81 percent; longer-dated bond yields were a touch higher. \nGreek yields have fallen sharply in recent weeks on expectations that Greece will exit its bailout programme this year and analysts said this was likely to remain the key driver of Greek debt. \n“It’s about how Greece manages the exit for the bailout programme, and if there’s any tentative funding scheme still in place or anything that leaves the door open for Greece to receive European help, that would be much appreciated by the market,” said Peter Schaffrik, head of European rates strategy at RBC. \nSentiment towards peripheral bonds was also supported by hopes for a deal to create a coalition government in Germany, the euro zone’s biggest economy. \nThe leader of Germany’s Social Democrats (SPD) said on Monday he wanted to renegotiate key issues agreed in a coalition blueprint with Chancellor Angela Merkel’s conservatives after his party narrowly agreed to pursue formal coalition talks. \nIn the U.S, Treasuries hovered around multi-month highs on the third day of a government shutdown, as a bipartisan group of senators tried to negotiate a deal just hours before the full Senate planned another vote to restore funding. Reporting by Dhara Ranasinghe, additional reporting by Fanny Potkin and Abhinav Ramnarayan, editing by Larry King and Jane Merriman", "external_links": [], "published": "2018-01-22T12:33:00.000+02:00", "crawled": "2018-01-22T13:39:31.052+02:00", "highlightTitle": ""}