{"organizations": [], "uuid": "325a50326c35ed5cd9546a09abe4ee0e2000c655", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223157081&w=1200&r=LYNXMPEE0H22S", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-holidays-sex-culture/one-surprising-reason-for-more-positive-pregnancy-tests-this-month-idUKKBN1F737L", "country": "US", "domain_rank": 408, "title": "One surprising reason for more positive pregnancy tests this month", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T00:19:00.000+02:00", "replies_count": 0, "uuid": "325a50326c35ed5cd9546a09abe4ee0e2000c655"}, "author": "", "url": "https://uk.reuters.com/article/us-health-holidays-sex-culture/one-surprising-reason-for-more-positive-pregnancy-tests-this-month-idUKKBN1F737L", "ord_in_thread": 0, "title": "One surprising reason for more positive pregnancy tests this month", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 10:19 PM / Updated 7 hours ago One surprising reason for more positive pregnancy tests this month Lisa Rapaport 5 Min Read \n(Reuters Health) - - Lots of couples in predominantly Christian countries may be looking at positive pregnancy tests this month at least in part because of cultural forces that encourage mating around major holidays like Christmas, suggests a recent study. \nCertain surges in baby deliveries - like the September baby boom nine months after December 25 - have long been documented. But previous research hasn’t offered a clear picture of whether this is explained by the cultural effects of the holidays or by biological adaptations to the shifting seasons and changes in daylight, temperature or food availability. \nTo investigate this question, researchers examined data from 130 countries, including records of sex-related Google searches from 2004 to 2014 and an analysis of collective moods revealed in public Twitter posts from 2010 to 2014. The study included data from both the southern and northern hemispheres and from majority Muslim nations as well as predominantly Christian countries that celebrate a December 25 Christmas. \nAnalysis of the Google searches found that online interest in sex peaks in both hemispheres during major cultural and religious celebrations: Christmas in predominantly Christian countries and Eid al-Fitr, the celebration that marks the end of Ramadan, in Muslim majority nations. The collective mood during these periods is relaxed and loving, an analysis of Twitter posts found. \nBirths peak nine months after Christmas or Eid al-Fitr, regardless of what hemisphere people lived in or how close their country was to the equator, which researchers believe means biological responses to changing seasons are not what’s driving reproductive urges. \n“The findings suggest that cultural events can induce collective moods with biological repercussions at the individual level,” said senior study author Luis Rocha of Indiana University in Bloomington. \n“The observed ‘relaxed and loving’ collective mood is universally correlated with greater interest in sex,” Rocha said by email. \nAdding to the evidence for a cultural explanation, the dates of Ramadan and Eid al-Fitr shift each year, and the mini baby boom associated with the holiday appeared nine months afterwards, regardless of when the holiday occurred that year, the researchers note in Scientific Reports. \nMost of the Google searches related to sex were associated with either a direct interest in sexual activity or pornography, the study found. \nTwitter posts revealed the collective mood based on sentiments expressed in word choices used in public posts that researchers scored as indicating feelings like happiness, sadness, calm and excitement. \nWhen collective moods of happiness and relaxation appeared throughout the year, there also tended to be an increase in online interest in sex, the study found. \nThanksgiving and Easter didn’t appear to spark this happy, relaxed collective mood or an increased interest in sex online. And there also wasn’t a spike in births nine months after these holidays. \nThe study wasn’t a controlled experiment designed to prove whether or how people’s activities online or on social media might directly influence the urge to procreate. \nIt’s also possible that online searches for sex aren’t a reliable measure of the human reproductive cycle, said Christian Joyal, a psychology researcher at the University of Quebec at Trois-Rivieres who wasn’t involved in the study. \n“Not only the word ‘sex’ is rarely used as a keyword in internet searches for porn, but these searches are mostly done by men,” Joyal said by email. “So the link between say, a single man having the time to search for porn during his Christmas vacations and the human reproductive cycle is very loose in my opinion.” \nThe peaks in sexual interest and birth rates might reflect when people in different cultures have more time to think about sex and have intercourse, Joyal said. Previous research suggests that Sunday is the day people are most likely to watch porn, he added. \n“Does that mean that our culture or religion allows us to watch porn on Sundays, or simply that we have more time to do so,” Joyal said. “In my opinion these peaks are simply due to the fact that we have more time.” \nSOURCE: go.nature.com/2DpTPSE Scientific Reports, online December 21, 2017.", "external_links": [], "published": "2018-01-19T00:19:00.000+02:00", "crawled": "2018-01-19T00:52:46.013+02:00", "highlightTitle": ""}