{"organizations": [], "uuid": "b33fe67e2ef33f405adf3bb84fa62784c8b684cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-citizens-pursues-board-diversity-as-steve-shelton-announces-intention-not-to-stand-for-board-re-election.html", "country": "US", "domain_rank": 767, "title": "Citizens Pursues Board Diversity As Steve Shelton Announces Intention Not To Stand For Board Re-Election", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T20:41:00.000+02:00", "replies_count": 0, "uuid": "b33fe67e2ef33f405adf3bb84fa62784c8b684cc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-citizens-pursues-board-diversity-as-steve-shelton-announces-intention-not-to-stand-for-board-re-election.html", "ord_in_thread": 0, "title": "Citizens Pursues Board Diversity As Steve Shelton Announces Intention Not To Stand For Board Re-Election", "locations": [], "entities": {"persons": [{"name": "steve shelton", "sentiment": "negative"}, {"name": "shelton", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "citizens pursues board diversity", "sentiment": "negative"}, {"name": "cia", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "citizens, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "nominating and corporate governance committee", "sentiment": "none"}, {"name": "citizens' board", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}, {"name": "corporate governance committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Jan. 26, 2018 /PRNewswire/ -- Citizens, Inc. (NYSE: CIA) today announced its intention to pursue Board diversity. It further announced that Steve Shelton, age 62, independent director and member of the Nominating and Corporate Governance Committee, notified the Company of his intention not to stand for re-election as a director at the completion of his current one-year term, which will expire at the Company's 2018 Annual Meeting of Shareholders. Mr. Shelton will continue to serve on the Company's Board of Directors and the Nominating and Corporate Governance Committee until that time.\nMr. Shelton's service with the Citizens' Board began in 1987, making him the Board's longest serving director with 31 years of service. As a member of the Nominating and Corporate Governance Committee, Mr. Shelton has played an active role in the Committee's best practices review for continued Board service that has focused on areas such as Board expertise, diversity and tenure. In light of his long standing tenure, Mr. Shelton indicated his intention not to stand for re-election.\n\"We, as a Board and Company, have made great progress, especially over the last two years,\" Shelton said. \"It has certainly been an honor and privilege to serve with the Board and executive team, and I value the professional relationships we have developed. For that, I will forever be grateful.\"\n\"On behalf of the Board of Directors and the Company, I want to express our sincere appreciation to Steve for his strength of character and wisdom, exercised over a 30-year tenure as a director of Citizens,\" said Dr. Robert Sloan, Chairman of Citizens. \"You've been with the company through much change, and all of us express our heartfelt gratitude to you.\"\n\"Steve has been a reliable and selfless Board member, and I appreciate his many contributions to Citizens,\" said Geoff Kolander, chief executive officer of Citizens. \"I look forward to working with the Board to address diversity, identify a new director candidate and continue advancing the Company's strategic objectives,\" concluded Kolander.\nThe Company expects to hold its 2018 Annual Meeting of Shareholders on June 4, 2018.\nAbout Citizens Inc.\nCitizens, Inc. is a financial services company listed on the New York Stock Exchange under the symbol CIA. The Company utilizes a three-pronged strategy for growth based upon worldwide sales of U.S. Dollar-denominated whole life cash value insurance policies, life insurance product sales in the U.S. and the acquisition of other U.S.-based life insurance companies.\nInformation herein contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, which can be identified by words such as \"may,\" \"will,\" \"expect,\" \"anticipate\", \"intends,\" \"continue\" or comparable words. In addition, all statements other than statements of historical facts that address activities that the Company expects or anticipates will or may occur in the future are forward-looking statements. Examples of forward-looking statements may include, without limitation, statements regarding Mr. Shelton's intention not to stand for re-election at the end of his current term and the Board's intention to identify a qualified, diverse independent director to join the Board. Readers are encouraged to read the SEC reports of the Company, particularly its Annual Report on Form 10-K for the fiscal year ended December 31, 2016, its quarterly reports on Form 10-Q and its current reports on Form 8-K, for \"Risk Factors\" and other meaningful cautionary language disclosing why actual results may vary materially from those expected or implied by the forward-looking statements. The Company undertakes no duty or obligation to update any forward-looking statements contained in this release as a result of new information, future events or changes in the Company's expectations. Accordingly, you should not unduly rely on these forward-looking statements. The Company also disclaims any duty to comment upon or correct information that may be contained in reports published by the investment community.\nFor further information contact:\nInvestor Relations\nPR@citizensinc.com\nView original content: http://www.prnewswire.com/news-releases/citizens-pursues-board-diversity-as-steve-shelton-announces-intention-not-to-stand-for-board-re-election-300588892.html\nSOURCE Citizens, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/citizens-pursues-board-diversity-as-steve-shelton-announces-intention-not-to-stand-for-board-re-election-300588892.html"], "published": "2018-01-26T20:41:00.000+02:00", "crawled": "2018-01-26T23:45:29.020+02:00", "highlightTitle": ""}