{"organizations": [], "uuid": "1d8f9c430bcdbb1dca9fb714eb26e634641b019e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-agaci-announces-chapter-11-restructuring-update.html", "country": "US", "domain_rank": 767, "title": "A'GACI Announces Chapter 11 Restructuring Update", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T00:35:00.000+02:00", "replies_count": 0, "uuid": "1d8f9c430bcdbb1dca9fb714eb26e634641b019e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-agaci-announces-chapter-11-restructuring-update.html", "ord_in_thread": 0, "title": "A'GACI Announces Chapter 11 Restructuring Update", "locations": [], "entities": {"persons": [{"name": "david won", "sentiment": "none"}], "locations": [{"name": "san antonio", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN ANTONIO, Jan. 11, 2018 /PRNewswire/ -- A'GACI, LLC, a leading fashion retailer in Texas, which filed for Chapter 11 relief on Tuesday, January 9 th , will shortly begin discussions with landlords regarding 49 of its locations.\nIn a court filing on Tuesday, A'GACI sought court approval to close up to 49 of its 76 operating stores, but noted the Company's management team and its advisors continue to evaluate whether certain of these stores should remain open.\n\"The actual number of store closings will depend on our ability to work with landlords for many of our locations to negotiate more favorable lease terms and rent reductions,\" said David Won, A'GACI's Chief Merchandising Officer.\nStore evaluation and landlord negotiations are an important step forward in the Company's plan to restructure its costs. The Company and its advisors estimate that lease costs at approximately 2/3 of its locations are unfavorably high.\n\"Although we are operating – like many retailers – in a challenging environment, we have excellent employee teams in our stores, a loyal customer base and very strong relationships with our vendors. We are especially excited about next season's fashion which we have begun to roll out at a number of stores. If we can meaningfully improve our rent costs, it is possible that we will keep a large number of stores open,\" said Mr. Won.\nA'GACI has been an innovator in the fast fashion apparel industry for a number of years. \"By filing for Chapter 11 and entering into negotiations with landlords, we believe we will be able to address our overall cost structure which is not sustainable given the current retail environment. The results of this action, combined with our strong store base and online presence, will allow A'GACI to emerge as a more competitive player in the fashion industry,\" noted John Won, the Company's Chief Executive Officer.\n\"We greatly appreciate our customers, our vendors and, especially, our employee family, who have shown overwhelming support for our reorganization.\"\nAbout A'GACI: founded in San Antonio, TX, A'GACI is a lifestyle brand catering to young fashion lovers who are sexy, feminine and confident in their style. A'GACI owns and operates 78 stores in the U.S including 37 in Texas, and also represents a large online presence known within the fashion blogger community as the place for value-priced, trend-right fashions. To find out more about A'GACI, please visit www.agacistore.com .\nView original content: http://www.prnewswire.com/news-releases/agaci-announces-chapter-11-restructuring-update-300581733.html\nSOURCE A’GACI, LLC", "external_links": ["http://www.prnewswire.com/news-releases/agaci-announces-chapter-11-restructuring-update-300581733.html"], "published": "2018-01-12T00:35:00.000+02:00", "crawled": "2018-01-12T02:10:51.012+02:00", "highlightTitle": ""}