{"organizations": [], "uuid": "4edab72fd610ffa7aee7834ef2e8e1eea547030b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC480_AIG012_SOC_20180122070139.jpg", "site_section": "https://www.wsj.com/news/markets", "section_title": "Stock Market &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/aig-strikes-5-56b-deal-to-acquire-a-bermuda-insurer-1516622329", "country": "US", "domain_rank": 387, "title": "AIG Strikes $5.56 Billion Deal to Acquire a Bermuda Insurer", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.187, "site_type": "news", "published": "2018-01-22T15:07:00.000+02:00", "replies_count": 0, "uuid": "4edab72fd610ffa7aee7834ef2e8e1eea547030b"}, "author": "Leslie Scism", "url": "https://www.wsj.com/articles/aig-strikes-5-56b-deal-to-acquire-a-bermuda-insurer-1516622329", "ord_in_thread": 0, "title": "AIG Strikes $5.56 Billion Deal to Acquire a Bermuda Insurer", "locations": [], "entities": {"persons": [{"name": "validus", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "comments american international group inc", "sentiment": "negative"}, {"name": "aig", "sentiment": "negative"}, {"name": "bermuda insurer", "sentiment": "negative"}, {"name": "validus holdings ltd", "sentiment": "none"}, {"name": "lloyd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9 COMMENTS American International Group Inc. AIG -1.04% is acquiring a Bermuda-based insurer and reinsurer for $5.56 billion, as its new chief executive makes good on a promise to reverse nearly a decade of shrinkage stemming from its near collapse in 2008 .\nThe global insurance conglomerate said Monday it signed a definitive agreement to acquire Validus Holdings Ltd. VR 44.17% in an all-cash deal. AIG said the acquisition would immediately add to its earnings .\nReinsurance is an arrangement in which insurers take on the risk of policies that primary insurers sell to businesses and individuals. A big product line for Validus is property-catastrophe reinsurance for hurricanes and other disasters.\nRelated The Rise of AIG’s New CEO (July 21) AIG Posts Wider-Than-Expected Loss (Nov. 2) U.S. Rescinds Federal Oversight of AIG (Sept. 29) AIG Retools Operating Structure (Sept. 25) The company also has other operations, including a Lloyd’s syndicate, crop insurance, and a unit that insures small U.S. companies. They overlap minimally with existing businesses at AIG, a leader in insuring multinational corporations and other large businesses and a large U.S. life insurer.\nAt $68 a share, the deal represents a 46% premium to Validus’s closing share price Friday, and a 16% premium to its 52-week high. Validus’s shares soared in early Monday trading, while AIG’s were down modestly.\nBefore the global financial crisis of 2008, AIG was one of the world’s biggest financial-services companies with about $1 trillion in assets. It is about half that size now after divesting many businesses and assets to repay a U.S. government bailout that reached nearly $185 billion.\nTaxpayers got their money in full by the end of 2012, but AIG’s shrinkage continued as management then sought to improve weak profit margins by offloading poorly performing parts. Last September U.S. officials rescinded AIG’s status as a “systemically important financial institution,” giving AIG flexibility to do large acqusitions.\nBrian Duperreault, who became the company’s CEO in May , made clear from the start that he would look for deals to once again expand AIG , probably by sharply reducing a stock-buyback program that has helped the company boost its earnings per share. He turned to an island he knows well. He was born in Bermuda, and two of his previous CEO roles were there.\nBermuda is a well-established hub for property-catastrophe reinsurance. The deal Mr. Duperreault has struck is the latest example of consolidation of this corner of the industry. In recent years, many reinsurers have suffered erosion of profit margins, making mergers and acquisitions easier to strike. Some analysts have had Validus on a list of potential acquirers.\nA big factor in the erosion has been an influx of capital from pension plans and other big investors into so-called catastrophe bonds and other reinsurance vehicles that serve as alternatives to conventional reinsurance.\nAs hurricanes Harvey, Irma and Maria unfolded last year, Bermuda reinsurers looked poised to benefit from sharply rising premium rates . But, in general, rates renewing as of Jan. 1 have fallen short of those expectations and are up more modestly, according to industry brokers and analysts.\nAnother factor in favor of deal making, said Cathy Seifert of CFRA Research, is a recent change to U.S. tax law that reduces tax advantages long held by Bermuda-based insurers.\nMr. Duperreault told analysts in a call that an important reason for the Validus deal is that “the depth of their talent stands out among the Bermuda insurance companies.” Of the potential deal, he said: “I initiated it.”\nWhile reinsurance premium rates have gone up less than people initially speculated, he believes they are at a reasonable level. He also noted that Validus has been adept at innovating. He praised its $3.4 billion asset-management arm called AlphaCat, which specializes in insurance-linked securities such as cat bonds. Mr. Duperreault said the unit has “great growth potential.”\nEd Noonan, Validus’s chairman and chief executive officer, said in a news release that the deal makes sense for Validus because “becoming part of a larger, more diversified organization immediately opens new opportunities for our people and our franchise.”\nValidus was launched in 2005 in the wake of Hurricane Katrina, when property-catastrophe reinsurance premiums jumped considerably. Its initial public offering of stock was in 2007.\nIn Monday’s call, numerous analysts asked about other possible transactions. Mr. Duperreault said his team would “continue to see what’s out there.” He said AIG “had a lot of white space” in thinking about this initial deal, and one appealing aspect was Validus’s minimal overlap with AIG’s existing operations. That means that AIG’s managers in the core business-insurance unit will be able to continue their focus on improving results, rather than diverting to integration matters.\nMr. Duperreault has previously said areas of interest would be expansion of AIG’s life-insurance and retirement-services business, especially overseas; its auto- and homeowners-insurance business, which is known for insuring the well to do, and the core business-insurance unit, by adding a focus on small and midsize companies.\nAIG’s market capitalization was $55 billion as of Friday, far off a peak of more than $200 billion in 2000.\nWrite to Leslie Scism at leslie.scism@wsj.com", "external_links": [], "published": "2018-01-22T15:07:00.000+02:00", "crawled": "2018-01-22T16:02:25.001+02:00", "highlightTitle": ""}