{"organizations": [], "uuid": "344ea7ed9d5b7300ccfeceb47e5fd30f2dc0eeaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222981126&w=1200&r=LYNXMPEE0H0NT", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-germany/soccer-aubameyang-future-at-dortmund-in-doubt-as-hertha-await-idUKKBN1F711X", "country": "US", "domain_rank": 408, "title": "Soccer - Aubameyang future at Dortmund in doubt as Hertha await", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T11:30:00.000+02:00", "replies_count": 0, "uuid": "344ea7ed9d5b7300ccfeceb47e5fd30f2dc0eeaa"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-germany/soccer-aubameyang-future-at-dortmund-in-doubt-as-hertha-await-idUKKBN1F711X", "ord_in_thread": 0, "title": "Soccer - Aubameyang future at Dortmund in doubt as Hertha await", "locations": [], "entities": {"persons": [{"name": "aubameyang", "sentiment": "none"}, {"name": "pierre-emerick aubameyang", "sentiment": "none"}, {"name": "peter stoeger", "sentiment": "none"}], "locations": [{"name": "hertha", "sentiment": "none"}, {"name": "hertha berlin", "sentiment": "none"}, {"name": "gabon", "sentiment": "none"}, {"name": "leipzig", "sentiment": "none"}, {"name": "dortmund", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "hertha", "sentiment": "negative"}, {"name": "dortmund", "sentiment": "negative"}, {"name": "vfl wolfsburg", "sentiment": "none"}, {"name": "borussia dortmund", "sentiment": "none"}, {"name": "arsenal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 34 AM / Updated 11 minutes ago Soccer - Aubameyang future at Dortmund in doubt as Hertha await Reuters Staff 3 Min Read \nBERLIN (Reuters) - The future of the 2017 Bundesliga top striker Pierre-Emerick Aubameyang at Borussia Dortmund is in doubt as the Ruhr valley club tries to turn its season around. \nThe Gabon international, who has scored 13 league goals this season, was suspended for last week’s goalless draw against VfL Wolfsburg after missing a team meeting the day before. \nIt is still unclear if he will play against Hertha Berlin on Friday or if he will even stay at Dortmund past the winter transfer period. \nSeveral English clubs, including Arsenal, are reportedly interested in signing the 28-year-old, who has repeatedly hinted of a possible move but signed a contract extension last year to 2021. \nHis latest disciplinary offence and transfer saga comes at the worst possible time for Dortmund, who had won their last two matches under coach Peter Stoeger before last week’s draw. \nThey are in fourth place on 29 points, two behind second-placed RB Leipzig. \nAubameyang had recently caused headlines again after being the only player allowed to bring his family to the team’s winter break training camp, irritating some team mates. \nStoeger, who said he could not understand his player’s decision to skip the meeting, said he expected the forward to stay at Dortmund because it would be “difficult to replace him with someone with the same scoring rate.” \nBut Dortmund CEO Hans-Joachim Watzke was less clear about Aubameyang’s future at the Bundesliga club he joined in 2013. \n“First of all it is about the important game in Berlin,” Watzke said. “Auba must now make it clear to the coach if he is ready or not to give it all for Dortmund.” \n“We will see about everything else.” \nHertha would be happy to see the forward miss another game as the Berliners battle to stay in the hunt for the European spots. \nHertha are 11th on 24 points but victory over Dortmund could move them into the top seven. \n“I hope he will not play against us. I would not mind if he transferred before the game,” said Hertha’s Salomon Kalou jokingly. “That would be better for us.” \n“He is an outstanding striker so it would be really hard to play against him.” \nBundesliga leaders Bayern Munich are 13 points clear at the top on 44 and host Werder Bremen on Sunday, while Leipzig travel to Freiburg a day earlier. \nSchalke 04, who saw their 11-game unbeaten run snap last week to drop to third on 30, face Hanover 96. Reporting by Karolos Grohmann; Editing  ", "external_links": [], "published": "2018-01-18T11:30:00.000+02:00", "crawled": "2018-01-18T11:49:33.009+02:00", "highlightTitle": ""}