{"organizations": [], "uuid": "f9d7fe36dc2b3bc6e984cc9ad60b6bd0a24e6bf7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/home", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-cfpb-court/d-c-appeals-court-upholds-structure-of-u-s-consumer-bureau-idUSKBN1FK29S", "country": "US", "domain_rank": 408, "title": "D.C. appeals court upholds structure of U.S. consumer bureau", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-31T23:44:00.000+02:00", "replies_count": 0, "uuid": "f9d7fe36dc2b3bc6e984cc9ad60b6bd0a24e6bf7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-cfpb-court/d-c-appeals-court-upholds-structure-of-u-s-consumer-bureau-idUSKBN1FK29S", "ord_in_thread": 0, "title": "D.C. appeals court upholds structure of U.S. consumer bureau", "locations": [], "entities": {"persons": [{"name": "chizu nomiyama", "sentiment": "none"}, {"name": "pete schroederediting", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "positive"}, {"name": "phh corp", "sentiment": "none"}, {"name": "cfpb", "sentiment": "none"}, {"name": "bureau", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 3:44 PM / in 20 minutes Appeals court upholds structure of U.S. consumer bureau Pete Schroeder 3 Min Read \nWASHINGTON (Reuters) - A U.S. appeals court on Wednesday upheld the structure of the U.S. Consumer Financial Protection Bureau, determining it is constitutional to bar the president from firing its director at will, even as the Trump administration works to weaken the regulator. \nWednesday’s ruling overturns a November 2016 decision that had given presidents the power of dismissal over a CFPB director and marks the latest development in a complicated fight over leadership of the agency, which was established to crack down on predatory financial practices after the 2007-2009 financial crisis. \nThe ruling from the Court of Appeals for the District of Columbia is part of a broader fight over the agency’s structure, and comes amid a separate, more immediate controversy that emerged after President Donald Trump appointed Mick Mulvaney, an agency critic who also is director of the Office of Management and Budget, as its temporary head in November. \nThe CFPB had appealed the 2016 court decision that gave the president the power to fire the agency’s director without proof of serious misconduct. The fight over the agency’s structure is part of a continuing lawsuit between the agency and a mortgage servicer, PHH Corp. \n“Congress’s decision to provide the CFPB director a degree of insulation reflects its permissible judgment that civil regulation of consumer financial protection should be kept one step removed from political winds and presidential will,” the court wrote. \nRepublican critics of the CFPB, arguing it is too powerful, were quick to call for the case to head to the Supreme Court. PHH was noncommittal in a statement and a company spokesman said the firm is evaluating its next steps. \nA CFPB representative said the agency also was analyzing the decision. \nWednesday’s ruling is separate from a pending case on the leadership of the agency in which the CFPB’s deputy director, Leandra English, is suing to bar Mulvaney from heading the agency. \nThe original ruling by a three-judge panel on the D.C. Circuit Court threatened to upend the CFPB, which was created as part of the 2010 Dodd-Frank financial reform law. There, judges ruled that it was unconstitutional to grant a single director, serving a five-year term, protection from presidential removal. \nWednesday’s decision did have good news for PHH with the court reinstating an earlier ruling throwing out the $109 million fine the CFPB levied against PHH, which was the catalyst for the lawsuit. Judges previously determined the CFPB overstepped its bounds in assessing that fine. \nIn its statement, PHH said that decision was “an important and gratifying outcome.” \nMulvaney’s appointment to the job set off a controversy when English, chosen by outgoing CFPB director Richard Cordray as his replacement, filed suit to bar Mulvaney from taking the job. A federal judge ruled against English in November, leading to her appeal. Reporting by Pete Schroeder; Editing by Chizu Nomiyama and Bill Trott", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T23:44:00.000+02:00", "crawled": "2018-01-31T17:57:52.012+02:00", "highlightTitle": ""}