{"organizations": [], "uuid": "54143435e6b950335d9c08d353da582682ede2b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222728724&w=1200&r=LYNXMPEE0G0W4", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-venezuela-looting/wave-of-looting-shutters-stores-spreads-fear-in-venezuela-idUSKBN1F61LI", "country": "US", "domain_rank": 408, "title": "Wave of looting shutters stores, spreads fear in Venezuela", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T15:13:00.000+02:00", "replies_count": 0, "uuid": "54143435e6b950335d9c08d353da582682ede2b9"}, "author": "", "url": "https://www.reuters.com/article/us-venezuela-looting/wave-of-looting-shutters-stores-spreads-fear-in-venezuela-idUSKBN1F61LI", "ord_in_thread": 0, "title": "Wave of looting shutters stores, spreads fear in Venezuela", "locations": [], "entities": {"persons": [{"name": "alexandra ulmer", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "caracas", "sentiment": "none"}], "organizations": [{"name": "anggy polanco", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 1:14 PM / Updated 6 hours ago Wave of looting shutters stores, spreads fear in Venezuela Alexandra Ulmer , Anggy Polanco 6 Min Read \nCARACAS/SAN CRISTOBAL, Venezuela (Reuters) - A wave of looting by hungry mobs across Venezuela has left streets of shuttered shops in provincial towns and pushed some store owners to arm themselves with guns and machetes, stirring fear that the turmoil could spread to the capital Caracas. \nWorsening food shortages and runaway inflation have unleashed the spate of pillaging since Christmas in the South American country, in which seven people have reportedly died. \nThe unrest was sparked by shortages of pork for traditional holiday meals, despite socialist President Nicolas Maduro’s promise of subsidized meat to alleviate shortages. \nLooters have ransacked trucks, supermarkets and liquor stores across the nation of 30 million people, which ranks as one of the most violent in the world. \nThe plunder is heaping more pain on battered businesses, raising questions about how much longer they can survive. Venezuela, once one of Latin America’s richest countries, is suffering a fifth straight year of recession and the world’s highest inflation rate, which the opposition-run Congress says topped 2,600 percent last year. \nIn the first 11 days of January alone, some 107 lootings or attempted lootings have taken place, according to the Venezuelan Observatory for Social Conflict, a rights group. \nIn one of the most dramatic incidents, a mob slaughtered cattle grazing in a field in the mountainous western state of Merida. \nSkeptical that authorities can protect them, shopkeepers in the Andean town of Garcia de Hevia in the neighboring state of Tachira have taken matters into their own hands. \n“We’re arming ourselves with sticks, knives, machetes, and firearms to defend our assets,” recounted William Roa, the president of the local shopkeepers’ association. \nRoa, who owns a restaurant and liquor store, estimated that more than two-thirds of stores in the small town near the Colombian border were shut. \n“A person spends the night in each store and we communicate using WhatsApp groups, coordinating by block 24 hours a day,” he said. \nIn Ciudad Guayana, a former industrial powerhouse on the Orinoco river in eastern Venezuela, many stores remain closed after a wave of nighttime lootings. \nGarbage fills the streets and few cars circulate, though buses crammed with people crisscross town looking for places to buy food. \nBusinessmen in Caracas now fear the lootings, so far concentrated in the poorer and more lawless provinces, will spread to the sprawling capital, with its teeming hillside slums. People line up outside a supermarket with its security shutters partially closed as a precaution against riots or lootings, in San Cristobal, Venezuela January 16, 2018. REUTERS/Carlos Eduardo Ramirez \nThe owners of patisserie Arte Paris, in the city’s gritty downtown, reinforced the storefront with metal shutters last month. They now only stock ingredients like sugar for a handful of days and have considered hiring a costly nighttime guard. \n“The fear is real,” said Sebastian Fallone, one of the owners, as men and children begged patrons for food. “I leave at night without knowing what I will find the next morning.” \n‘NO HOPE’ \nGovernment critics say Maduro’s refusal to reform the OPEC nation’s floundering economy is to blame for the chaotic fight for survival in the country home to the world’s largest crude reserves. \nWith a presidential election looming this year, Maduro retorts that Venezuela’s oil-reliant economy is under attack by U.S.-backed saboteurs seeking to stoke conflict and discredit socialism in Latin America. Slideshow (3 Images) \nWhile videos of ransacking have gone viral, Maduro’s government has stayed largely mum. The Information Ministry did not respond to a request for information on the scale and impact of the looting. \nThe unrest has also stoked fears Venezuelan society could unravel as chaos sets in, fuelling mass emigration to nearby South American countries or a full-blown social explosion at home. \n“Small-scale protests will be numerous and increasingly violent; any of these protests could contain the spark to serious unrest,” said consultancy Teneo Intelligence in a note to clients about the year ahead in Venezuela. \nIn an effort to curb voter anger over inflation, the government agency tasked with ensuring “fair prices” ordered some 200 supermarkets to slash their rates this month, triggering frenetic buying. \nRoadside lootings have also scared truck drivers, disrupting the food distribution chain that is traditionally slower anyway in January because of holidays. \nFor Mery Cacua, manager of La Gran Parada, a supermarket chain in Tachira’s state capital San Cristobal, it has become too much to handle. \n“We’re closing in two weeks. There’s no hope anymore,” said Cacua, adding she and her siblings had not yet mustered the strength to break the news to their 87-year-old father, who founded the business 60 years ago. \nThe family does not know what to do but is considering starting from scratch in Colombia. \nVenezuelan supermarkets that remain open are often a shadow of what they once were. Many shelves are barren and poor Venezuelans increasingly mass outside stores, imploring entering shoppers to buy them goods. \n“What are they going to loot here? There’s nothing. The warehouse is empty,” said an employee at a big supermarket in Caracas, as a colleague behind him filled empty shelves with water bottles to make them look stocked. Additional reporting by Maria Ramirez in Ciudad Guayana, Mircely Guanipa in Maracay, Andreina Aponte and Leon Wietfeld in Caracas; Writing by Alexandra Ulmer; Editing by Daniel Flynn and Sandra Maler", "external_links": [], "published": "2018-01-17T15:13:00.000+02:00", "crawled": "2018-01-17T15:26:16.014+02:00", "highlightTitle": ""}