{"organizations": [], "uuid": "c4f5ecc527942a5f5ca63d21e0dbc429c548bb1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/noble-debt-restructuring/rpt-update-2-creditors-to-take-70-pct-of-noble-group-in-3-5-bln-debt-restructuring-idUSL4N1PP16V", "country": "US", "domain_rank": 408, "title": "RPT-UPDATE 2-Creditors to take 70 pct of Noble Group in $3.5 bln debt restructuring", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T03:13:00.000+02:00", "replies_count": 0, "uuid": "c4f5ecc527942a5f5ca63d21e0dbc429c548bb1e"}, "author": "", "url": "https://www.reuters.com/article/noble-debt-restructuring/rpt-update-2-creditors-to-take-70-pct-of-noble-group-in-3-5-bln-debt-restructuring-idUSL4N1PP16V", "ord_in_thread": 0, "title": "RPT-UPDATE 2-Creditors to take 70 pct of Noble Group in $3.5 bln debt restructuring", "locations": [], "entities": {"persons": [{"name": "anshuman daga", "sentiment": "none"}, {"name": "aradhana aravindan", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "noble group", "sentiment": "negative"}, {"name": "vitol", "sentiment": "none"}, {"name": "glencore", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Debt-for-equity swap agreed in principle\n* Will dilute existing equity holders’ stake to 10 pct\n* Deal subject to shareholder approval\n* Noble says deal will reduce debt to sustainable level (Repeats to fix technical glitch, no changes to text)\nBy Anshuman Daga and Aradhana Aravindan\nSINGAPORE, Jan 30 (Reuters) - Struggling Noble Group has struck a deal with creditors to restructure $3.5 billion of its debt in exchange for 70 percent of the company, with existing equity holders’ combined stake diluted to only 10 percent.\nSingapore-listed Noble, once a global commodities merchant with ambitions to rival the likes of Glencore and Vitol, has shrunk to its Asian roots as a hard commodities player along with freight and LNG businesses.\nThe company, which has made heavy job cuts, sold key assets, taken writedowns and raised funds after a crisis-wracked three years, said on Monday that the debt-for-equity swap was backed by 30 percent of holders of its existing senior debt.\n“This agreement marks the beginning of the final phase of our restructuring and the creation of a new Noble as a focused and appropriately financed group set to capitalise on the high-growth Asian commodities sector,” Paul Brough, a restructuring specialist who was appointed Noble’s chairman this year, said in a statement.\nNoble did not name the creditors with which it struck a deal.\nBrough said the in-principle agreement will reduce Noble’s indebtedness to sustainable levels and in line with the company’s size and range of activities.\nThe trader’s market value has collapsed to only $263 million from $6 billion in February 2015.\nHong Kong-headquartered Noble’s senior debt will halve to $1.7 billion from $3.4 billion under the restructuring proposal, which is subject to approval from shareholders and regulators and will be implemented through a court-led statutory procedure.\nNoble was founded in 1986 by Richard Elman, who rode a commodities bull run to build the company into one of the world’s biggest traders, but it was plunged into crisis in 2015 when Iceberg Research started questioning its accounts. Noble has stood by its accounts.\nElman is Noble’s biggest shareholder with a stake of a little more than 18 percent. Other large investors include sovereign wealth fund China Investment Corp and Orbis Investment Management.\nNoble said the restructuring proposes a debt-to-equity swap that, along with the issuance of equity to retain and incentivise the management team, is expected to result in dilution of existing shareholders’ interest in the company.\nIt said that senior debt holders would end up owning 70 percent of the company after the restructuring, with 20 percent owned by management and the rest by existing shareholders.\nNoble also plans to exchange $400 million of perpetual securities for an aggregate payment of up to $15 million, subject to approval from holders of its perpetual bonds.\nThe restructuring includes a three-year committed trade finance and hedging facility of up to $700 million for the company’s commodities trading businesses. ($1 = 1.3107 Singapore dollars) (Reporting by Anshuman Daga and Aradhana Aravindan; Editing by Tom Hogue and David Goodman)\n ", "external_links": [], "published": "2018-01-30T03:13:00.000+02:00", "crawled": "2018-01-30T03:49:44.015+02:00", "highlightTitle": ""}