{"organizations": [], "uuid": "2c5604dc173c83c0dc915b468f021f21eafc6225", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-epa-official-government-must-plan-for-climate-change.html", "country": "US", "domain_rank": 767, "title": "EPA official: government must plan for climate change", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T07:33:00.000+02:00", "replies_count": 0, "uuid": "2c5604dc173c83c0dc915b468f021f21eafc6225"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-epa-official-government-must-plan-for-climate-change.html", "ord_in_thread": 0, "title": "EPA official: government must plan for climate change", "locations": [], "entities": {"persons": [{"name": "scott pruitt", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "barry breen", "sentiment": "none"}, {"name": "jerry mcnerney", "sentiment": "none"}, {"name": "breen", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "epa", "sentiment": "negative"}, {"name": "environmental protection agency", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "office of land and emergency management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — A top manager who supervises the Environmental Protection Agency program responsible for cleaning up the nation's most contaminated properties and waterways told Congress on Thursday that the government needs to plan for the ongoing threat posed to Superfund sites from climate change.\nThe testimony by EPA Principal Deputy Assistant Administrator Barry Breen before a House oversight subcommittee conflicts with the agency's policy positions under President Donald Trump, who has called climate change a hoax. Breen's boss, EPA Administrator Scott Pruitt, is an ardent fossil fuel promoter who questions the validity of mainstream climate science.\nDuring a hearing Thursday, Rep. Jerry McNerney, a California Democrat, asked Breen whether extreme weather events like hurricanes and wildfires could damage the highly toxic sites and cause contamination to spread.\n\"We have to respond to climate change, that's just part of our mission set,\" replied Breen, a career official who leads EPA's Office of Land and Emergency Management. \"So we need to design remedies that account for that. We don't get to pick where Superfund sites are. We deal with the waste where it is.\"\nThere are more than 1,300 Superfund sites in the U.S.\nUnder the Obama administration, EPA issued a robust plan for prioritizing cleanup and protection of toxic sites located in flood zones and areas vulnerable to sea level rise. However, a Superfund Task Force appointed by Pruitt last year issued a 34-page list of recommendations that makes no mention of climate change, flooding risks from stronger storms or rising seas.\nEPA spokesman Jahan Wilcox did not respond to questions Thursday about whether Pruitt agreed with Breen's testimony or precisely what the agency is currently doing to address to risks posed to Superfund sites by climate change.\nThe Associated Press first reported in September that more than a dozen Superfund sites in the Houston area were flooded by heavy rains from Hurricane Harvey. Spills of potentially hazardous waste were reported at two of those sites, including a release of cancer-causing dioxin into the San Jacinto River.\nA subsequent AP review of EPA records and census data revealed that more than 2 million Americans live within a mile of 327 Superfund sites located in flood-prone areas or those at risk from rising sea levels.\nThe Government Accountability Office told Congress earlier this month it was assigning investigators to study the risks to human health and the environment posed to Superfund sites by natural disasters.\nEPA's 2014 Climate Adaptation Plan noted that prolonged flooding at low-lying Superfund sites could cause extensive erosion, carrying away contaminants as waters recede.\nPruitt says he has made faster Superfund site cleanups a high priority for the agency. Pruitt's task force on the issue is led by Albert \"Kell\" Kelly, a former Oklahoma banker with no experience as an environmental regulator.\nKelly had been expected to testify at Thursday's hearing, but was replaced by Breen due to what EPA told the House committee was a scheduling conflict.\nAP reported in August that Pruitt hired Kelly as a senior adviser at EPA after federal financial regulators cited Kelly for unspecified violations while serving as the top executive at a community bank in Oklahoma. Kelly previously served as chairman of Tulsa-based SpiritBank, which provided a $6.8 million financing when Pruitt and his business partners purchased Oklahoma City's minor league baseball team in 2003.\nAsked by Democrats for details about why Kelly was barred by the Federal Deposit Insurance Corporation from working for any U.S. financial institution, Breen said Thursday that Kelly had elected to settle the case against him and \"is fully willing to discuss this matter.\"\nAn email and voicemail to Kelly seeking comment on Thursday received no response. Wilcox also did not respond to a request seeking details about why the FDIC barred Kelly from the banking industry.\nFollow AP environmental writer Michael Biesecker at www.twitter.com/mbieseck", "external_links": [], "published": "2018-01-19T07:33:00.000+02:00", "crawled": "2018-01-20T19:02:06.004+02:00", "highlightTitle": ""}