{"organizations": [], "uuid": "a12b9a6f6d00d1e691aadcd577d65dbff0379719", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/06/23/102782107-145572664.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/05/apple-alphabet-amazon-may-get-bigger-and-pressure-others-to-do-so.html", "country": "US", "domain_rank": 767, "title": "Apple, Alphabet, Amazon may get bigger and pressure others to do so", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T23:18:00.000+02:00", "replies_count": 0, "uuid": "a12b9a6f6d00d1e691aadcd577d65dbff0379719"}, "author": "Alex Sherman", "url": "https://www.cnbc.com/2018/01/05/apple-alphabet-amazon-may-get-bigger-and-pressure-others-to-do-so.html", "ord_in_thread": 0, "title": "Apple, Alphabet, Amazon may get bigger and pressure others to do so", "locations": [], "entities": {"persons": [{"name": "robert townsend", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "positive"}, {"name": "google", "sentiment": "none"}, {"name": "tencent", "sentiment": "none"}, {"name": "morrison & foerster", "sentiment": "none"}, {"name": "qualcomm", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}, {"name": "broadcom", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Last year was the year of the tech mega-cap, with the six most valuable companies in the world now coming from that industry. Yet, even with the consolidation of money and power, 2017 featured a notable dearth of large tech deals. \nDon't expect 2018 to be so quiet.\nAs Alphabet , Amazon and Apple expand their product portfolios and their market share, boards and CEOs of technology companies with less reach are being forced to consider if they can still thrive independently, said Robert Townsend, co-chair of global mergers and acquisitions at law firm Morrison & Foerster.\nOn top of that, the tech giants are staring at a drop in corporate taxes starting in 2018, and they can bring some of the many billions of dollars they have stashed overseas back to the U.S. at a dramatically reduced tax rate. \nshow chapters Faber Report: Qualcomm board rejects Broadcom's director nominees      10:32 AM ET Fri, 22 Dec 2017 | 04:17 \"There's truly getting to be a few companies at such a scale, like Amazon , Google, Apple, Microsoft and Alibaba and Tencent that the world is going to be like a barbell, with a large gap in between with humongous tech and IT service providers on one side and everyone else on the other,'' Townsend said. \"That's an uncomfortable place to be if you're not at the very top.\"\nThere were only three technology deals of more than $5 billion announced last year involving a U.S. buyer or seller -- Toshiba's memory chip sale to a consortium led by Bain Capital, Intel's purchase of Mobileye , and Marvell's takeover of Cavium, according to FactSet. A fourth hostile offer -- Broadcom's $103 billion bid for Qualcomm -- was rejected late in the year.\nThat marked a big dip from 2016, when 12 tech deals over $5 billion were announced. Among them was Microsoft's $26 billion purchase of LinkedIn and Tencent's $8.6 billion acquisition of game developer Supercell. \nThe prior year, there were eight big deals, including Avago's $37 billion purchase of Broadcom, which at the time was the largest tech deal ever, until it was surpassed later in the year by Dell's $67 billion acquisition of EMC . \nTownsend, who represented VMware in connection with the Dell-EMC deal, said transactions of that size or larger may become much more commonplace. They could also come in unexpected places, as Google pushes into cloud services and automation, Apple shows its willingness to spend on original content and Amazon moves into the physical world through the acquisition of Whole Foods . \nThe dominance of big tech has had a cooling effect on the IPO market. The past two years have been the slowest for technology offerings since 2009.\nIn addition to start-ups' concerns about taking on the big platforms, they have at their disposal a flood of capital from new funding sources, such as Softbank's $100 billion Vision Fund, allowing them to stay private for longer periods of time.\nLarry Sonsini, founding partner of law firm Wilson Sonsini Goodrich & Rosati, said he expects IPOs to be near a historic low in 2018.\nSonsini, who has represented Apple, Alphabet and Netflix , said there's \"a paradigm shift taking place\" with more value accruing to start-ups than to companies that go public, and with big companies looking to the private markets as the place where they'll open their wallets. Facebook has taken that approach for several years, snapping up venture-backed companies Instagram, WhatsApp and Oculus. \n\"That will lead to more power by some of the giants, who will start consolidating more and taking companies off their IPO track,\" he said. \nApple, Microsoft and Alphabet are best positioned to take advantage of the Republican-backed tax bill, as they're sitting on overseas cash and marketable securities totaling more than $500 billion , which can be repatriated at a lower tax rate. Also, the corporate federal income tax rate will drop to 21 percent effective this year from 35 percent.\n\"If you're looking to deploy cash, U.S. targets just got a lot cheaper,\" said Jamie Wickett, a partner at Hogan Lovells. \"You're effectively on sale to anyone looking to buy a U.S. company.\"\n'Much harder to scale' But while U.S. firms will have more incentives to keep their income at home, the new corporate tax rate is higher than in some European countries, including the U.K. and Ireland. Technology companies that have saved on taxes by successfully pushing money overseas may have little reason to bring that money back, Wickett said.\n\"If you had good tax planning, your taxes may go up, and technology companies certainly apply to that,\" Wickett said.\nStill, there's plenty of impetus to put money to work in the U.S. In particular, there's a growing category of companies that once had clear paths to growth but have seen their market share taken by the tech behemoths. Semiconductor makers already came to that conclusion. It's what drove Avago's deal for Broadcom and its offer for Qualcomm, as well as Qualcomm's pending $45 billion deal for NXP .\n\"The ability to compete today has gotten much more difficult,\" Sonsini said. \"It's much harder to scale. Consequently, it's hard to put together a business model for a public enterprise that really will drive growth and investor interest.\"", "external_links": ["https://www.bloomberg.com/graphics/2017-overseas-profits-tax/"], "published": "2018-01-05T23:18:00.000+02:00", "crawled": "2018-01-05T22:30:31.001+02:00", "highlightTitle": ""}