{"organizations": [], "uuid": "7caccae1138c4a635afee073963e4defb9b38422", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930456-GettyImages-675025896.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/bill-gates-favorite-ways-to-relax.html", "country": "US", "domain_rank": 767, "title": "Bill Gates' favorite ways to relax", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.11, "site_type": "news", "published": "2018-01-05T18:12:00.000+02:00", "replies_count": 0, "uuid": "7caccae1138c4a635afee073963e4defb9b38422"}, "author": "Ali Montag", "url": "https://www.cnbc.com/2018/01/05/bill-gates-favorite-ways-to-relax.html", "ord_in_thread": 0, "title": "Bill Gates' favorite ways to relax", "locations": [], "entities": {"persons": [{"name": "roger federer", "sentiment": "positive"}, {"name": "bill gates", "sentiment": "positive"}, {"name": "warren buffett", "sentiment": "none"}, {"name": "buffett", "sentiment": "none"}, {"name": "gates", "sentiment": "none"}, {"name": "catan", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "While Bill Gates is no longer at the helm of Microsoft, the entrepreneur turned billionaire philanthropist still has a few things on his to-do list: eradicating polio , researching treatments for Alzheimer's and improving public education systems . \nAlthough tackling the world's most complex problems must seem overwhelming, Gates writes in an article for Time that he's recently begun to take more time for himself.\n\"When I was in my 20s and early 30s, my whole life was focused on work,\" he writes. \"These days, I'm better at balancing the work that I love to do with my foundation and taking time off to spend with family and friends.\"\nHere are his top ways to unwind.\n1. Playing games Gates plays the card game Bridge and the board game Settlers of Catan.\n\"My parents first taught me bridge, but I really started to enjoy it after playing with Warren Buffett,\" Gates writes in Time of his billionaire bestie. \"It takes a mix of strategy and teamwork to do well. We always find time to play a few games when we're together.\"\nBuffett himself spends eight hours per week playing bridge, and tells the Washington Post , \"It's the best exercise there is for the brain.\" Buffett even sees lessons in business mirrored in bridge, telling CBS News , \"You have to look at all the facts. You have to draw inferences from what you've seen, what you've heard. You have to discard improper theories about what the hand had as more evidence comes in sometimes.\"\n\nAs for Settlers of Catan , \"This civilization-building board game is a favorite in my family,\" Gates writes. \"Melinda, our kids, and I have spent many hours sitting around the table trading resources, building roads, and strategizing to be the first to reach 10 victory points.\"\nGates and Buffett may be on to something: 2014 research by the University of Wisconsin-Madison found that embracing cognitive activities like playing card games is beneficial to brain health, according to The New York Times .\n2. Exercising  A trip to the tennis court is a way Gates relaxes. \"I have played tennis my whole life,\" he writes.\nFellow billionaire Richard Branson is also a tennis fanatic , and says lessons he's learned on the court also translate to success in business. \n\"One key lesson I've learned, which applies far beyond the court, is to treat each point separately,\" Branson writes in a post on LinkedIn. \"Forget the last mistake and move onto the next challenge. Tennis, like business, moves so quickly that if you dwell on the past for even a few minutes, an opportunity will have passed and the moment will be lost.\"\nGates and Branson are in good company: other business leaders like Mark Zuckerberg, Oprah Winfrey and Mark Cuban prioritize staying active. \n\"Staying in shape is very important,\" Zuckerberg says in a Q&A on Facebook . \"Doing anything well requires energy, and you just have a lot more energy when you're fit.\"\n3. Reading books Gates is well known to be a voracious reader . \n\"On average, I try to read a book a week, and I always bring a whole tote bag of them on vacation,\" Gates writes for Time. \nWhile Gates may find it relaxing, he's also enjoying the science backed benefits of reading . For example, research published by Stanford found that close reading of a novel increased blood flow to underused areas of the brain. \nDedicating time to reading can also be critical for success in your career, according to Warren Buffett and Mark Cuban . While \"most people won't put in the time to get a knowledge advantage,\" Cuban writes on his blog , he tries to spend three hours a day reading to stay sharp. \nFor Buffett, that means spending \"five or six hours a day reading,\" he says in HBO's documentary, \" Becoming Warren Buffett .\"\n4. Exploring the globe Lastly, Gates makes time to travel. One trip in particular had a life changing impact, he tells Time.\n\"In 1993, Melinda and I visited Tanzania, Kenya, and Zaire (now the Democratic Republic of Congo),\" he writes. \"That trip changed our lives and inspired us to start our foundation and get involved in philanthropy sooner than we planned.\"\nSamantha Reinders | Gates Foundation Sue Desmond-Hellmann in Tanzania with Bill Gates. Desmond-Hellmann is an Advisory Board member for Healthy Returns. Traveling abroad can have numerous benefits , like increasing your creativity and relieving stress. \nDon't miss: Bill Gates and Richard Branson agree on why it's important to have 'long-shot' goals \nLike this story? Like CNBC Make It on Facebook . \nshow chapters Feeling stressed? Try these science-backed ways to battle anxiety      8:43 AM ET Mon, 8 May 2017 | 00:56", "external_links": [], "published": "2018-01-05T18:12:00.000+02:00", "crawled": "2018-01-05T18:33:17.034+02:00", "highlightTitle": ""}