{"organizations": [], "uuid": "c5cb8f87dedc4160bdc01cc8ef9cf02f7f8de0ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-poxel-announces-fourth-quarter-2017-financial-update.html", "country": "US", "domain_rank": 767, "title": "Poxel Announces Fourth Quarter 2017 Financial Update", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T19:45:00.000+02:00", "replies_count": 0, "uuid": "c5cb8f87dedc4160bdc01cc8ef9cf02f7f8de0ac"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-poxel-announces-fourth-quarter-2017-financial-update.html", "ord_in_thread": 0, "title": "Poxel Announces Fourth Quarter 2017 Financial Update", "locations": [], "entities": {"persons": [{"name": "poxel", "sentiment": "none"}], "locations": [{"name": "financial update lyon", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "euronext", "sentiment": "negative"}, {"name": "sumitomo dainippon pharma", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LYON, France--(BUSINESS WIRE)-- POXEL SA (Euronext – POXEL - FR0012432516), a biopharmaceutical company focused on the development of innovative treatments for metabolic disorders, including type 2 diabetes, announced today its cash position and revenues for the fourth quarter of 2017.\nAs of December 31, 2017, cash and cash equivalents were €53.4 million ($64.1 million).\nDuring the fourth quarter, Poxel generated revenues of €5.2 million ($5.9 million). The revenues reflect 1) a portion of the €36 million ($42 million) upfront payment received from Sumitomo Dainippon Pharma relating to the strategic corporate partnership announced on October 30, 2017 and 2) the Imeglimin Phase 3 program costs in Japan incurred during the fourth quarter that were re-invoiced to Sumitomo Dainippon Pharma and recognized by Poxel as revenue. Both the upfront payment and re-invoiced costs are recognized according to the percentage of completion of the Phase 3 T rials of IM eglimin for E fficacy and S afety (TIMES) program.\nRe-invoiced costs incurred during the fourth quarter will be paid in the first quarter of 2018. In addition, during the quarter, there was a low double-digit percent one-time payment made to Merck Serono relating to the upfront payment that Poxel received from Sumitomo Dainippon Pharma. The cash burn rate during the fourth quarter was in line with the Company’s expectations.\nDuring 2017, the Company made significant clinical progress with respect to Imeglimin and PXL770 and announced a substantial corporate milestone with the execution of the strategic partnership with Sumitomo Dainippon Pharma for the development and commercialization of Imeglimin in Japan, China and 11 other countries* during the fourth quarter. This agreement included an upfront payment plus future potential development milestone payments and sales-based payments of up to approximately €219 million ($257 million) and escalating double-digit royalties on net sales. Poxel and Sumitomo Dainippon Pharma are jointly developing Imeglimin for the treatment of type 2 diabetes in Japan, and Sumitomo Dainippon Pharma is assuming the Phase 3 and commercialization costs. For China and 11 other countries, Sumitomo Dainippon Pharma will be solely responsible for Imeglimin development and commercialization.\n“Following the signing of the strategic corporate partnership with Sumitomo Dainippon Pharma at the end of October 2017, we executed against our plan and met our goal to initiate the Phase 3 TIMES program for Imeglimin in Japan by the end of the year. Our near-term focus in Japan is the successful execution of the TIMES program and to work closely with our colleagues at Sumitomo Dainippon Pharma to support the Japanese New Drug Application submission targeted for 2020,” said Thomas Kuhn, CEO of Poxel. “We believe our corporate partnership with Sumitomo Dainippon Pharma is a very important validation of Imeglimin’s strong clinical profile and data results as well as of our internal capabilities to advance a program to a critical value inflection point. Another important corporate priority is to continue to seek a partnership for Imeglimin that includes the U.S., Europe and other countries worldwide.”\n“For our second program, PXL770, we continued to advance the Phase 1b multiple ascending dose trial during the fourth quarter. Through its unique mechanism of action that directly activates adenosine monophosphate-activated protein kinase (AMPK), PXL770 acts on a very important biological target, which has the potential to treat numerous chronic metabolic diseases, 1 including diseases that affect the liver, such as non-alcoholic steatohepatitis (NASH),” continued Thomas Kuhn. “Pending successful completion of the Phase 1b program, we are planning to initiate a Phase 2a proof-of-concept study in NASH during the second half of 2018, and we are also exploring other metabolic diseases for proof-of-concept studies. In addition, we are assessing further opportunities to strengthen our pipeline.”\nPlanned Presentations at the Following Upcoming Events\nCowen 38 th Annual Health Care Conference, March 12-14, 2018, Boston, Massachusetts Oppenheimer 28 th Annual Healthcare Conference, March 20-21, 2018, New York City, New York\nNext financial press release: 2017 full year results on March 22, 2018\nAbout Imeglimin\nImeglimin is the first clinical candidate in a new chemical class of oral agents called the Glimins by the World Health Organization. Imeglimin has a unique mechanism of action (MOA) that targets mitochondrial bioenergetics. Imeglimin acts on all three key organs which play an important role in the treatment of type 2 diabetes: the liver, muscles, and the pancreas, and it has demonstrated glucose lowering benefits by increasing insulin secretion in response to glucose, improving insulin sensitivity and suppressing gluconeogenesis. This MOA has the potential to prevent endothelial and diastolic dysfunction, which can provide protective effects on micro- and macro-vascular defects induced by diabetes. It also has the potential for protective effect on beta-cell survival and function. This unique MOA offers the potential opportunity for Imeglimin to be a candidate for the treatment of type 2 diabetes in almost all stages of the current anti-diabetic treatment paradigm, including monotherapy or as an add-on to other glucose lowering therapies.\nAbout PXL770\nPXL770 is a first-in-class direct adenosine monophosphate-activated protein kinase (AMPK) activator. AMPK is a central regulator of multiple metabolic pathways leading to the control of lipid metabolism, glucose homeostasis and inflammation. Based on this central role, targeting AMPK offers the opportunity to pursue a wide range of indications to treat chronic metabolic diseases, including diseases that affect the liver, such as non-alcoholic steatohepatitis (NASH).\nAbout Poxel SA\nPoxel uses its development expertise in metabolism to advance a pipeline of drug candidates focused on the treatment of metabolic disorders, including type 2 diabetes. We have successfully completed our Phase 2 clinical program for our first-in-class lead product, Imeglimin, which targets mitochondrial dysfunction, in the U.S., Europe and Japan, and the Phase 3 T rials of IM eglimin for E fficacy and S afety (TIMES) program in Japan is underway. Our second program, PXL770, a direct AMPK activator, is completing Phase 1 development. We intend to generate further growth through strategic partnerships and pipeline development. (Euronext: POXEL, www.poxelpharma.com )\n*Including: The Republic of Korea, Taiwan, Indonesia, Vietnam, Thailand, Malaysia, The Philippines, Singapore, Republic of the Union of Myanmar, Kingdom of Cambodia, and Lao People's Democratic Republic.\n1 Source: Srivastava, R. A et al., (2012) Journal of Lipids Research 53, 2490- 2514\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122005407/en/\nPoxel SA\nJonae R. Barnes, +1 617-818-2985\nSenior Vice President, Investor Relations and Public Relations\njonae.barnes@poxelpharma.com\nor\nInvestor relations / Media - EU/US\nTrophic Communications\nGretchen Schweitzer or Stephanie May\n+49 89 238 877 34 or +49 171 185 56 82\nmay@trophic.eu\nor\nInvestor relations / Media - France\nNewCap\nFlorent Alba/Nicolas Merigeau, +33 1 44 71 98 55\npoxel@newcap.fr\nSource: POXEL SA", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.poxelpharma.com&esheet=51746461&newsitemid=20180122005407&lan=en-US&anchor=www.poxelpharma.com&index=1&md5=bc382096a41c773ea92bccc5c37164ab", "http://www.businesswire.com/news/home/20180122005407/en/"], "published": "2018-01-22T19:45:00.000+02:00", "crawled": "2018-01-22T20:13:41.009+02:00", "highlightTitle": ""}