{"organizations": [], "uuid": "30b976923b7f44b8ce95a9c9cd3f5a35e8532b85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-freedom-leaf-inc-completes-100-percent-acquisition-of-spanish-hemp-producer-green-market-europe-s-l-further-driving-revenue.html", "country": "US", "domain_rank": 767, "title": "Freedom Leaf, Inc. Completes 100% Acquisition of Spanish Hemp Producer, Green Market Europe S.L., Further Driving Revenue and Building Shareholder Value for (OTCQB: FRLF)", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:00:00.000+02:00", "replies_count": 0, "uuid": "30b976923b7f44b8ce95a9c9cd3f5a35e8532b85"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-freedom-leaf-inc-completes-100-percent-acquisition-of-spanish-hemp-producer-green-market-europe-s-l-further-driving-revenue.html", "ord_in_thread": 0, "title": "Freedom Leaf, Inc. Completes 100% Acquisition of Spanish Hemp Producer, Green Market Europe S.L., Further Driving Revenue and Building Shareholder Value for (OTCQB: FRLF)", "locations": [], "entities": {"persons": [{"name": "clifford j. perry", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "freedom leaf, inc", "sentiment": "neutral"}, {"name": "green market europe s.l.", "sentiment": "neutral"}, {"name": "shareholder value to freedom leaf inc.", "sentiment": "none"}, {"name": "marijuana legalization company", "sentiment": "none"}, {"name": "freedom leaf inc", "sentiment": "none"}, {"name": "freedom leaf inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Our philosophy is to only acquire companies that will add significant Gross Revenue, Net Profit and Shareholder Value to FRLF\nLAS VEGAS, NV, Jan. 09, 2018 (GLOBE NEWSWIRE) -- Freedom Leaf Inc. ® ( OTCQB:FRLF ), The Marijuana Legalization Company ®, is pleased to report that it has fully acquired 100% of Green Market Europe S.L. (GME), a Spanish producer of hemp products. Since the announcement of the acquisition, June 28th 2017 , Freedom Leaf Inc. Officers have been diligently working to finalize the international acquisition, and as of today all relevant documentation has been submitted, signed, and finalized.\nClifford J. Perry, Co-founder and CEO of Freedom Leaf Inc., said, “We are very pleased to have completed this transaction, the deal is now final. Our philosophy is to only acquire companies that will add significant Gross Revenue, Net Profit and Shareholder Value to Freedom Leaf Inc. financials, and this is no exception. Green Market Europe S.L. is projected to add €2.000.000 ($2,393,060USD) in its first full year of operation at approximately a 15% net profit.”\nGreen Market Europe S.L. facilities include a 21,000 sq. ft. light deprivation greenhouse, a 43,000 sq. ft. indoor growing research facility, and over 200 acres of outdoor production space. The light deprivation allows the increase of the number of yearly crops from 3 to 4 crops a year, and the 43,000 sq. ft. indoor grow facility is used for genetic research and cultivating additional hemp crops. Green Market Europe S.L. is strategically located in Elche, Alicante, an important Spanish business hub, with great year-round weather conditions for agricultural growing and a long tradition of growing hemp.\nGME marks the second completed acquisition for Freedom Leaf Inc. in Spain and Europe. The first acquisition was in May 2017 of LaMarihuana.com , the Spanish-speaking community’s leading cannabis portal, and Marihuana-Medicinal.com , an influential Spanish medical cannabis information website. LaMarihuana.com was founded in 2001 and currently has more than 1.7 million page visits monthly, making it the among the most visited online portals worldwide for the Spanish-speaking community. LaMarihuana.com also has more than 1.3 million Facebook fans.\nFreedom Leaf, Inc. is currently collaborating with Spanish scientists isolating other rare cannabinoids. Some of the ongoing research includes strains with Tetrahydrocannabivarin (THCV), which suppresses appetite, and Cannabichromene (CBC), which has been shown to aid with depression.\nPerry has hailed Freedom Leaf Iberia B. V. licensee’s Managing Director, Federico Pando, for his work in bringing this and other Spanish projects to fruition for Freedom Leaf Inc.\n¨GME will be an essential tool of FL to expand in the Medical Cannabis and cannabinoid based therapy. The know-how of mass Cannabinoid production, research and IP gives us a priceless competitive advantage towards cooperating with Governments and Institutions to bring Cannabinoid based therapy to medical patients,” stated by Federico Pando.\nPaul F. Pelosi, Jr. , Freedom Leaf Inc Chairman of the Board, added, “Freedom Leaf is staking its claim to foreign markets. Starting with Europe and planning for Central and South America expansion as well as other countries around the world. The market for Industrial Hemp is expanding in many countries even faster than the United States, and in many cases even faster than marijuana. Major legal revenue streams are available from exploring these different markets around the world.”\nGreen Market Europe S.L. has a current collaboration agreement with Elche-based University of Miguel Hernandez to grow and develop EU certified Hemp strains with high cannabidiol (CBD) content that can easily grow in the local climate, and for researching better methods for growing hemp.\nThe company is also collaborating with two privately owned European companies for product development and global marketing to provide a variety of Freedom Leaf branded products with Rare Cannabinoids, CBG, (Cannabigerol) in addition to its popular CBD, Cannabidiol. Other rare cannabinoids are also being developed\nAlthough NO MEDICAL CLAIMS ARE BEING MADE FOR ANY OF THE PRODUCTS , in various studies there are indications that Cannabigerol may relieve pain, reduce seizures and convulsions, slow bacterial growth in certain species, reduce inflammation systemically, induce sleep, inhibit cancer cell growth, stimulate the growth of new brain cells and promote bone growth. Some of the other conditions under study include glaucoma, inflammatory bowel diseases, anti-inflammatory disorders, epilepsy and chronic pain.\nAbout Freedom Leaf\nFreedom Leaf, Inc., The Marijuana Legalization Company®, is a fully reporting and audited, publicly traded company trading under the symbol ( OTCQB: FRLF ). Freedom Leaf, Inc. is a leading go-to resource in the cannabis, medical marijuana, and industrial hemp industry. It is involved in mergers and acquisitions and business consulting in the marijuana industry, including incubation/acceleration and spin offs of new marijuana/hemp related companies.\nFreedom Leaf, Inc.’s flagship publication is Freedom Leaf Magazine , “The Good News in Marijuana Reform.” The company produces a portfolio of news, print and digital multi-media verticals, websites, blogs and web advertising, for the ever-changing emerging cannabis, medical marijuana and industrial hemp industry.\nFreedom Leaf, Inc. does not handle, grow, sell, or dispense marijuana.\nAll of our European activities are in full compliance with relevant EU laws.\nCorporate Website and Investor Relations www.FreedomLeafInc.com .\nSafe Harbor Statement\nStatements in this press release that are not strictly historical are “forward-looking” statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements, including any financial projections above, generally can be identified by phrases such as Freedom Leaf, Inc. or its management “believes,” “expects,” “anticipates,” “foresees,” “forecasts,” “estimates” “projections” or other words or phrases of similar import. Similarly, statements herein that describe the Company’s business strategy, outlook, objectives, plans, intentions or goals also are forward-looking statements. All such forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from those in forward-looking statements. Factors that could cause or contribute to differences include the uncertainty regarding viability and market acceptance of the Company’s products and services, changes in relationships with third parties, and other factors described in the Company’s most recent periodic filings with the Securities and Exchange Commission, including its Annual Report on Form 10-K dated June 30, 2017 and quarterly reports on Form 10-Q.\nCONTACT INFORMATION Raymond Medeiros PR and Business Development Director Phone: 415-601-1974 Ray@FreedomLeaf.com Freedom Leaf, Inc. 3571 East Sunset Road Las Vegas, Nevada 89120\nSource:Freedom Leaf, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=5IjtrWO9_EAWfqHN2mvPyXjWpzlLhVcjblvxBc5a3jGzQKTxjGYi9FHHX2NMqtaRr2tCCLOcxJAa4fjiIbUoPXXTlUwOu58kAZSVfRHhAv7UmSy4HAyHQonpXo01hoaEG7nuz2ajuuV0NlQBUXL7nA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/9268d736-c00c-4292-b6f8-f8b7e1fc1cea", "https://www.globenewswire.com/Tracker?data=FZU3HZZanfqV8A93VYZDJgZm4i9pIRt-i0IjlB4eZmLG9yCz8hCKXvtWN0U41x4zbK4DgwmncfO0i0REZ6sj4g==", "https://www.globenewswire.com/Tracker?data=ffxV6uQjVD4282tO70WcMtzPnpqhY18-yxaYfne996H36fXXFAEpdKj-PdrHzhUNrtL-6o0MkPGXbEQAUnEEnKpMtsJS-mHXqc2QM-QLjKE=", "https://www.globenewswire.com/Tracker?data=INA5Veu1nMcGK3Rx7gTi-eKVCc6gJ0MUWslj8MF0qTX0gSWBMoKVrVPLKgX3-NY5rrInKZK63mWuZaGPbA_j2K2AqgBl3byELd0iLl_1vpQ=", "https://www.globenewswire.com/Tracker?data=doCGxy7f29s2hHvnnxUR99OWdlfnPlHy6xjxoKUHVWvtKNenukxDOHqn7N1ZkygxQCWGCaCqYxC2DR1xLVUkP4Kg9Dz_a6BwibTj9KeaQKc=", "https://www.globenewswire.com/Tracker?data=XwHe8XGrwRLIDgZHrLsnCeu5FI5YmDlc-GX1UZFY7dJwAn9YQnR1RrpK6GcFbWM7sihLa1twZXoYj-yEXxFK53Q6CsxORO51bUH2fHwoUYk=", "https://www.globenewswire.com/Tracker?data=KTs8-01jxcef5akrSdsbBl77C1ibt2lF3vDxaUSuVFkbz7AJ-v0vo1eNGVUCTbM8D4XSflDlYPevsgp5c4RGRyddl6IpwBdeYx9-C5jHN7M="], "published": "2018-01-09T14:00:00.000+02:00", "crawled": "2018-01-09T15:40:42.000+02:00", "highlightTitle": ""}