{"organizations": [], "uuid": "0af6861bd77eaeda26e1135d1f1f5a4ecd30e89c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-willis-towers-watsonas-asset-management-exchange-appoints-kimberley-west-to-lead-expansion-in-u-s.html", "country": "US", "domain_rank": 767, "title": "Willis Towers Watson’s Asset Management Exchange appoints Kimberley West to lead expansion in U.S.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-25T17:05:00.000+02:00", "replies_count": 0, "uuid": "0af6861bd77eaeda26e1135d1f1f5a4ecd30e89c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-willis-towers-watsonas-asset-management-exchange-appoints-kimberley-west-to-lead-expansion-in-u-s.html", "ord_in_thread": 0, "title": "Willis Towers Watson’s Asset Management Exchange appoints Kimberley West to lead expansion in U.S.", "locations": [], "entities": {"persons": [{"name": "willis towers watson", "sentiment": "negative"}, {"name": "jaegemann", "sentiment": "none"}, {"name": "oliver jaegemann", "sentiment": "none"}, {"name": "kimberley", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "u.s. arlington", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "kimberley west", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "nas", "sentiment": "negative"}, {"name": "kimberley west", "sentiment": "negative"}, {"name": "asset management exchange", "sentiment": "negative"}, {"name": "willis towers watson’s asset management exchange", "sentiment": "neutral"}, {"name": "wltw", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "amx", "sentiment": "none"}, {"name": "blackrock", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ARLINGTON, Va., The Asset Management Exchange (AMX), launched last year by Willis Towers Watson (NASDAQ:WLTW), announced today the appointment of Kimberley West as U.S. head. In this newly created position, West will have overall responsibility for leading the expansion of the exchange in the U.S.\nBased in New York, West will report directly to Oliver Jaegemann, global head of AMX. West has over 25 years of asset and investment management experience. Prior to joining AMX, she spent two years at Blackrock as a managing director and lead product strategist for its active equity division. She also worked at J.P. Morgan for 12 years where she held various senior-level management positions across asset classes.\n“Kimberley brings a wealth of asset management experience to this role and is well positioned to lead our efforts to deliver the AMX value proposition to U.S. investors,” said Jaegemann. “Since its launch in the U.K. last year, AMX has more than quadrupled assets under management, to more than $3 billion today. We have been working with a range of U.S.-based managers, and following the success of these relationships we are now expanding into this market. We believe that U.S. investors are ready for the digital revolution in asset management, which will create a more efficient market for all participants.\n“AMX is transforming the institutional investment market, and I am confident that Kimberley’s experience and proven track record will help ensure the exchange is tailored to the unique needs of U.S. investors. We look forward to engaging with both asset owners and managers alike across the U.S. and, in the future, across a wider global reach.”\nNotes to editors\nAMX is designed to centralize the investment process making implementation and monitoring more efficient through:\nReduced duplication of cost, resource and time Economies of scale in relationships with other service providers, such as market counterparties, clearers and prime brokers Standardized legal documentation Timelier and more accurate reporting through centralized data Reduced complexity via standardized infrastructure and a centralized back office\nAMX secures better pricing because of the buying power of the exchange by:\nLeveraging scale to negotiate lower fees with investment managers Centralizing operating costs, such as custody and administration at the exchange, thereby lowering operating expenses\nAMX offers enhanced investor control via an independent risk oversight function and single portfolio interface to:\nCentralize and standardize compliance, minimizing distractions from the core investment function while providing greater investor confidence\nAbout The Asset Management Exchange\nThe Asset Management Exchange (AMX) is an institutional asset management marketplace designed to bring greater efficiency to the institutional asset management industry globally and was established by Willis Towers Watson in 2017. AMX is a global marketplace where asset owners can invest in external asset managers and where asset managers can access significant capital, while cutting value leakage. The exchange is open architecture, meaning that it is designed to be available to all asset owners and asset managers, regardless of their relationship with Willis Towers Watson. AMX provides centralized back office and standardized fund infrastructure reducing cost and resource duplication, delivering scale benefits to both sides of the market while increasing transparency and asset owner control. visit www.theamx.com or @TheAMXchange .\nMedia contact\nEd Emerman: +1 609 275 5162\neemerman@eaglepr.com\nSource:Willis Towers Watson Public Limited Company", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/756cc45a-a0a2-41ef-bec3-0a22956c359c", "https://www.globenewswire.com/Tracker?data=RgbwgnAX1N6T8BgslWAtT3umPUIyuPyfEFJaZbvCxULIefqYQLLU_-tXSkD8RP2q2iMRAsMTr3tuJK2hRnqUNvWlLYefwoUThYZAJQV2qKQ=", "https://www.globenewswire.com/Tracker?data=qlw-YpPy1HidswUIxLOCi8rXsXf8-9lWtM-ZabZ-70GeqRGk9MJGipToa4ecUrfBbdFgvZMJgcFEjF7Ar-z5nQ==", "https://www.globenewswire.com/Tracker?data=bsSVZrBeRJNpxfIMkH9inX2uDYsZF5Itt4GXUP5_9qW7zNO9B7WCJm51rW2vVvZ51_w_-LJgCFiJi8vll8OZbknf5zearns74YeJxiVGO8s="], "published": "2018-01-25T17:05:00.000+02:00", "crawled": "2018-01-25T18:32:36.070+02:00", "highlightTitle": ""}