{"organizations": [], "uuid": "ccd6722e2ef06932282a07b3d0c69f2b55ed3809", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/legal", "section_title": "Legal News | Reuters", "url": "https://www.reuters.com/article/us-otc-fdic/at-heart-of-fdics-win-v-pwc-an-unsettled-theory-idUSKBN1ER1U1", "country": "US", "domain_rank": 408, "title": "At heart of FDIC’s win v. PwC, an unsettled theory", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-03T06:28:00.000+02:00", "replies_count": 0, "uuid": "ccd6722e2ef06932282a07b3d0c69f2b55ed3809"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-otc-fdic/at-heart-of-fdics-win-v-pwc-an-unsettled-theory-idUSKBN1ER1U1", "ord_in_thread": 0, "title": "At heart of FDIC’s win v. PwC, an unsettled theory", "locations": [], "entities": {"persons": [{"name": "lee farkas", "sentiment": "none"}, {"name": "taylor bean", "sentiment": "none"}, {"name": "rothstein", "sentiment": "none"}, {"name": "barbara rothstein", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "montgomery", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fdic", "sentiment": "negative"}, {"name": "colonial bank", "sentiment": "none"}, {"name": "federal deposit insurance corporation", "sentiment": "none"}, {"name": "taylor bean", "sentiment": "none"}, {"name": "taylor, bean & whitaker", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The accounting giant PricewaterhouseCoopers is facing hundreds of millions of dollars in exposure to the Federal Deposit Insurance Corporation after U.S. District Judge Barbara Rothstein ruled last week that PwC negligently failed to uncover a $2.3 billion fraud scheme between PwC audit client Colonial Bank, now in FDIC receivership, and the now bankrupt mortgage lender Taylor, Bean & Whitaker. PwC already paid an undisclosed amount in 2016 to settle related claims by Taylor Bean's trustee.\nJudge Rothstein, who is based in Seattle but oversaw a 2017 bench trial in Montgomery, Alabama, of the FDIC’s claims, concluded that PwC – by its own admission in the Taylor Bean bankruptcy trustee’s case – failed to design and perform its Colonial Bank audits to detect fraud. Her decision marks the first time a federal district judge has found an audit firm liable under the Sarbanes-Oxley act for failing to detect a fraud.\nAmong PwC’s shortcomings, according to Judge Rothstein: The auditor relied on the chief architect of the fraud, Taylor Bean chair Lee Farkas, to verify key information about the collateral underlying a Colonial credit facility for Taylor Bean. PwC also signed off on Colonial’s audit without ever understanding the third and most complex iteration of the fraud, which involved a credit facility based on phantom mortgage securitizations. After an auditor who was supposed to make sense of the transactions gave up, saying they were “above his pay grade,” PwC assigned a college-aged intern to evaluate the nearly $600 million asset.\nJudge Rothstein was distinctly harsh about PwC’s failings. Basing Colonial’s certification on Farkas’ account of Taylor Bean’s collateral was “quintessentially the same as asking the fox to report on the condition of the hen house,” she wrote. And charging an intern to decipher a loan facility beyond the expertise of a senior auditor was a “truly astonishing” departure from PwC’s mandate, the judge wrote.\nBut Judge Rothstein let PwC off the hook for several other claims based on the same allegations that it failed to detect fraud machinations between Colonial and Taylor Bean, which began in 2002. PwC’s auditing, she found, was actively undermined by executives at Colonial, two of whom have pleaded guilty in connection with the scheme.\nTaylor Bean was one of Colonial’s most important customers, Judge Rothstein said, and the bank was at first eager to help the mortgage lender survive overdrafts. Later, as the fraud ballooned, Colonial execs frantically tried to recoup Colonial’s money from Taylor Bean. According to the judge’s decision, over the course of several years, to keep the scheme secret, Colonial execs lied to PwC auditors, circumvented internal controls by “recycling” mortgage data and even created wire transfers to trick PwC into believing Taylor Bean collateral mortgages had been paid off.\nBecause the Colonial employees were acting as agents of the bank and its holding company, Colonial BancGroup, neither the FDIC nor the holding company, CBG, is entitled to breach of contract damages against PwC, the judge held. CBG didn’t keep up its end of the deal, according to Judge Rothstein. It should have, or at least could have, known something fishy was going on, yet it didn’t alert PwC.\nThe judge also said CBG can’t hold PwC liable for negligence even though PwC breached its professional duties to the holding company. CBG’s negligence claim, Rothstein held, is barred under the doctrine of in pari delicto, which precludes a wrongdoer from sharing in the proceeds of its misdeeds, and under the “audit interference rule,” which holds that an audit client can’t recover if its own negligent or wrongful actions contributed to the auditor’s failures.\nYou may be thinking, as I was when I read Judge Rothstein’s decision, that it seems contradictory. Colonial participated in the fraud so it can’t get damages from PwC for breaching the audit contract and its holding company can’t claim PwC was negligent. So why don’t in pari delicto and auditor interference bar the FDIC, as Colonial’s receiver, from obtaining damages for PwC’s negligence?\nIt turns out there’s no consensus across the country on that question. Last August, Judge Rothstein ruled PwC and a second Colonial auditor, Crowe Horwath, could not evade liability to the FDIC by citing Colonial’s own involvement in the fraud. She said the scope of the auditors’ in pari delicto offense is a matter of state law that has never been addressed by Alabama’s Supreme Court. But as she interpreted Alabama precedent on the power of receivers, Judge Rothstein said, she believed the state high court would allow the FDIC to pursue negligence claims against PwC despite the misdeeds of Colonial employees.\n“PWC and Crowe contend that even if they failed to comply with their professional duties when they audited Colonial, they cannot be held liable because the conduct of Colonial employees—the very conduct that PWC and Crowe were hired to examine and verify—was fraudulent and/or negligent,” the judge wrote in the August ruling. “This court does not believe the Supreme Court of Alabama would reach such a conclusion. Imputation is a flexible, equitable doctrine, the primary purpose of which is to preclude suits that would benefit wrongdoers…. To hold otherwise would be to elevate form over substance-something courts sitting in equity traditionally will not do.”\nJudge Rothstein cited precedent from the 9th U.S. Circuit Court of Appeals in 1995’s FDIC v. O’Melveny & Myers and the 4th Circuit’s Grant Thornton v. FDIC to back her holding. But she also acknowledged contrary holdings by the 7th Circuit, federal trial courts in Colorado and Maryland and Chancery Court in Delaware. “Courts in other jurisdictions have not been universal in refusing to impute a failed institution's misconduct and/or negligence to the receiver,” Judge Rothstein wrote.\nPwC asked the judge for a stay to bring an interlocutory appeal of her August ruling. She denied it, which means the audit firm will now have to wait until she enters a judgment for the FDIC. She plans to hold a bench trial on damages on the negligence claims for which she held PwC liable but has not yet scheduled it. Judge Rothstein is also hearing a bench trial on Crowe Horwath’s liability.\nPwC certainly plans to keep the issue alive. In its statement on Judge Rothstein’s liability ruling, the auditor noted her finding that several Colonial employees “actively and substantially interfered with PricewaterhouseCooper’s audit,” the auditor said. “The FDIC was only able to prevail on the claims that it did based on an earlier novel ruling by the court that immunized the FDIC from imputation defenses. PricewaterhouseCoopers intends to appeals that novel ruling at the earliest possible opportunity.” PwC was represented by Bartlit Beck Herman Palenchar & Scott.\nThe FDIC had lawyers from Thomas, Alexander, Forrester & Sorensen ; Schiff Hardin ; and Mullin Hoard & Brown . CBG was represented by Parker Hudson Rainer & Dobbs and DiCarlo Caserta & McKeighan .\nThe views expressed in this article are not those of Reuters News.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-03T06:28:00.000+02:00", "crawled": "2018-01-03T06:45:31.011+02:00", "highlightTitle": ""}