{"organizations": [], "uuid": "4969faf1438fed17426ac8981434270fa4d6eb98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-rubrik-appoints-bertrand-yansouni-as-vp-of-worldwide-channel.html", "country": "US", "domain_rank": 767, "title": "Rubrik Appoints Bertrand Yansouni as VP of Worldwide Channel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:00:00.000+02:00", "replies_count": 0, "uuid": "4969faf1438fed17426ac8981434270fa4d6eb98"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-rubrik-appoints-bertrand-yansouni-as-vp-of-worldwide-channel.html", "ord_in_thread": 0, "title": "Rubrik Appoints Bertrand Yansouni as VP of Worldwide Channel", "locations": [], "entities": {"persons": [{"name": "rubrik", "sentiment": "negative"}, {"name": "bertrand yansouni", "sentiment": "negative"}, {"name": "mark smith", "sentiment": "none"}, {"name": "bertrand", "sentiment": "none"}, {"name": "randy schirman", "sentiment": "none"}, {"name": "yansouni", "sentiment": "none"}, {"name": "bipul sinha", "sentiment": "none"}], "locations": [{"name": "worldwide channel palo alto", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "cloud data management company", "sentiment": "negative"}, {"name": "vp of worldwide channel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALO ALTO, Calif., Jan. 11, 2018 /PRNewswire/ -- Rubrik, the Cloud Data Management Company, today announced the appointment of Bertrand Yansouni as the company's VP of Worldwide Channel. In this role, Yansouni will develop and lead the global vision and strategy for Rubrik channel partners, including value added resellers, distributors and solution providers. Yansouni will report to Mark Smith, EVP of Global Sales and Business Development.\nYansouni has helped design and execute highly leveraged go-to-market strategies at market-defining enterprise technology companies for over 25 years. In his most recent role as Google Cloud's VP of Global Partner Sales and Strategic Partnerships, he was responsible for a go-to-market partner ecosystem of 13,000 partners and led a business unit that achieved 300% YoY growth.\n\"From day one, Rubrik has pursued a 100% channel driven go-to-market strategy. We're excited to broaden our capabilities with Bertrand taking leadership of Channel and Randy Schirman focusing exclusively on our rapidly growing Managed Service Provider business,\" said Bipul Sinha, Co-founder and CEO, Rubrik. \"Bertrand's 25 years of experience building high-performing channel organizations is a big win for Rubrik, our partners and customers.\"\nPrior to joining Google, Yansouni was VP of Global Partner Sales at Cloudera, the leading provider of Apache Hadoop-based software, services and training. He has also held channel leadership roles at Riverbed and VMware. Yansouni holds a BSIE from Stanford University and an MBA from the Stanford Graduate School of Business.\n\"Today's enterprises must provide instant application availability to weather data corruption, disasters and cyber threats like ransomware. Rubrik's game-changing Cloud Data Management Platform answers these fundamental challenges while simplifying the path for cloud adoption and automation at scale,\" said Yansouni. \"I've witnessed the rapid uptake of Rubrik's technology, and this is a huge opportunity for the channel. I'm thrilled to join the company at this exciting time.\"\nPartner Comments on the News:\n\"Our customers have been extremely receptive to Rubrik's cloud data management platform,\" said Steve Rogers, VP of Solutions & Alliances, Groupware Technology. \"Bertrand has a great track record when it comes to listening to partners and working with his teams to develop solutions that meet partners' needs. We look forward to working with him as Rubrik develops new solutions and offerings that will prove to be beneficial to all parties.\"\n\"Now more than ever, federal organizations need always-on data protection and management -- there's no room for downtime. Our reseller and integrator partners and government users believe that Rubrik's technology fits the bill in that regard,\" said Craig P. Abod, President, Carahsoft. \"We've always appreciated Rubrik's dedication to us as a partner and look forward to growing our relationship with Bertrand at the helm.\"\n\"As an early adopter of Rubrik technology, I am encouraged to see Rubrik aggressively invest in the channel as their singular go to market strategy,\" said Mike Carter, Co-founder and CEO, eGroup. \"Their longview focus on top personnel, coupled with a brilliantly simple product that delivers immediate customer outcomes, makes Rubrik the obvious long-term partner for eGroup and the data management needs of our clients. We look forward to working with Bertrand, and the entire Rubrik team, to further deliver eGroup's brand of 'speed and certainty' on the Rubrik platform.\"\n\"Rubrik has developed incredible technology that is clearly resonating with the marketplace and our own customers,\" said George M. Sabbagha, CEO, SCASICOMP. \"Given Rubrik's dedication to the channel and the success of its partners, we're excited that Rubrik has added Bertrand to the team. He has deep channel expertise that will elevate Rubrik's channel program and create even more fruitful relationships for partners.\"\n\"Today's enterprises are looking to simplify how they keep and use their data and Rubrik has a fresh take on this challenge,\" said Brent Collins, Global Practice Director, Data Center Infrastructure, World Wide Technology, Inc. \"We look forward to working with Bertrand to expand our Rubrik business and continue to deliver success for our mutual customers.\"\nAbout Rubrik\nRubrik delivers instant application availability with data protection, search, analytics, archival and copy data management. Hybrid Cloud enterprises benefit from Rubrik's market-leading Cloud Data Management platform with simplicity, instant data access, app-mobility, policy-driven automation, Ransomware protection, and analytics at scale. Rubrik has been positioned as a Visionary in Gartner's 2017 Magic Quadrant for Data Center Backup and Recovery Solutions. The company has been named to the Forbes Cloud 100 , LinkedIn's Top Companies: Startups and recognized with a CRN 2017 Tech Innovator Award . For more information, visit http://www.rubrik.com and follow @rubrikInc on Twitter.\nView original content: http://www.prnewswire.com/news-releases/rubrik-appoints-bertrand-yansouni-as-vp-of-worldwide-channel-300581174.html\nSOURCE Rubrik", "external_links": ["http://www.crn.com/rankings-and-lists/ti2017.htm", "http://t.sidekickopen04.com/e1t/c/5/f18dQhb0S7lC8dDMPbW2n0x6l2B9nMJW7t5XYg1qwl5MW7dSslF63RR_MW64JdXC56dFMzf3QNf_q02?t=https%3A%2F%2Fwww.linkedin.com%2Fpulse%2Flinkedin-top-companies-startups-50-industry-disruptors-daniel-roth&si=6436138275438592&pi=dacf98c5-5e9b-4c05-99fd-d7c62edd2461", "http://www.rubrik.com/", "http://t.sidekickopen04.com/e1t/c/5/f18dQhb0S7lC8dDMPbW2n0x6l2B9nMJW7t5XYg1qwl5MW7dSslF63RR_MW64JdXC56dFMzf3QNf_q02?t=https%3A%2F%2Ftwitter.com%2FrubrikInc&si=6436138275438592&pi=dacf98c5-5e9b-4c05-99fd-d7c62edd2461", "https://www.forbes.com/companies/rubrik/", "http://www.prnewswire.com/news-releases/rubrik-appoints-bertrand-yansouni-as-vp-of-worldwide-channel-300581174.html"], "published": "2018-01-11T17:00:00.000+02:00", "crawled": "2018-01-11T19:03:12.021+02:00", "highlightTitle": ""}