{"organizations": [], "uuid": "a04faa2c264890eedb8faac8e296ed5bf1c7ae07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/metso-results/update-1-mining-gear-maker-metso-warns-on-profit-shares-drop-idUSL8N1PA16Z", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Mining gear maker Metso warns on profit, shares drop", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:34:00.000+02:00", "replies_count": 0, "uuid": "a04faa2c264890eedb8faac8e296ed5bf1c7ae07"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/metso-results/update-1-mining-gear-maker-metso-warns-on-profit-shares-drop-idUSL8N1PA16Z", "ord_in_thread": 0, "title": "UPDATE 2-Mining gear maker Metso warns on profit, shares drop", "locations": [], "entities": {"persons": [{"name": "jussi rosendahl", "sentiment": "none"}], "locations": [{"name": "helsinki", "sentiment": "none"}], "organizations": [{"name": "metso", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "vara research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Finnish company warns on weak Q4 profit, orders\n* Analysts see possible project execution problems\n* Shares drop 10 pct (Adds comments, background, updates shares)\nBy Jussi Rosendahl\nHELSINKI, Jan 15 (Reuters) - Mining equipment maker Metso said its quarterly sales, earnings and new orders came in lower than expected, sending its shares more than 10 percent lower as the company missed out on recovering industry demand.\nThe preliminary figures in an unscheduled statement gave little explanation for the weaker than expected performance, adding to investors’ concerns over the company whose CEO said last month he would leave for another role after less than year in the job.\nMetso said its fourth-quarter adjusted earnings before interest, taxes and amortization (EBITA) were roughly flat from a year earlier at around 64 million euros ($79 million). That was well below a market consensus of 87 million euros, according to Vara Research.\n“Profitability of the Minerals segment came in weaker than expected, due to a higher than estimated share of equipment sales compared to services sales and a weak margin of the services business,” Metso said in a statement.\nIn recent years, Metso has been through a period of falling profits and restructuring as a response to spending cuts by miners.\nBut with the demand for Metso’s grinding mills, crushers and industry services gradually picking up, investors hoped the company had turned the corner.\n“This was a surprisingly big miss and raises a lot of questions,” said Pekka Spolander, analyst at OP Equities, with an “accumulate” rating on the stock.\nHe said he believed Metso’s problems were most likely internal rather than market-related, for example cost overruns at some projects.\n“There are probably several things behind this disappointment... All in all, recovery in their profits looks to happen slower than expected.”\nShares in the company dropped more than 10 percent in early trade and were down 9.3 percent by 1111 GMT. Shares in Finnish peer Outotec also fell 3 percent.\nThe company replaced its CEO last year, recruiting Nico Delvaux from Swedish rival Atlas Copco in the role. But last month Delvaux said he was leaving the company to become the CEO at lock maker Assa Abloy.\n“It was really unfortunate for Metso ... There’s a lack of momentum in the business now because of the top management leaving,” said Kepler Cheuvreux analyst Marcus Almerud, adding that a successor should be recruited soon to address the situation.\nMetso’s quarterly order intake was 684 million euros and sales 710 million euros, compared with analysts’ average forecasts of 757 million and 737 million respectively. Metso also makes valves and pumps for the oil and gas industry, a segment which the analysts said fared better compared to the mining segment.\n$1 = 0.8190 euros Reporting by Jussi Rosendahl; Editing by Mark Potter and Keith Weir\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T16:34:00.000+02:00", "crawled": "2018-01-16T13:14:06.005+02:00", "highlightTitle": ""}