{"organizations": [], "uuid": "7ae384d57562b5b1df0fbea64cebf1ebb887112a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225997439&w=1200&r=LYNXMPEE0R0AT", "site_section": "http://feeds.reuters.com/reuters/peopleNews", "section_title": "Reuters: People News", "url": "https://www.reuters.com/article/us-sweden-ikea-ab-kamprad/ikea-founder-ingvar-kamprad-dead-at-91-idUSKBN1FH0DI", "country": "US", "domain_rank": 408, "title": "IKEA founder Ingvar Kamprad dead at 91", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T12:49:00.000+02:00", "replies_count": 0, "uuid": "7ae384d57562b5b1df0fbea64cebf1ebb887112a"}, "author": "", "url": "https://www.reuters.com/article/us-sweden-ikea-ab-kamprad/ikea-founder-ingvar-kamprad-dead-at-91-idUSKBN1FH0DI", "ord_in_thread": 0, "title": "IKEA founder Ingvar Kamprad dead at 91", "locations": [], "entities": {"persons": [{"name": "ingvar kamprad", "sentiment": "negative"}, {"name": "kamprad", "sentiment": "none"}, {"name": "ikano", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "stockholm", "sentiment": "none"}, {"name": "smaland", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ikea", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 10:49 AM / in 4 hours Swedish IKEA founder Kamprad dies at 91 Simon Johnson 3 Min Read \nSTOCKHOLM (Reuters) - Billionaire IKEA founder Ingvar Kamprad, who turned a business he launched as a teenager into one of the world’s best known furniture brands, has died at the age of 91, the Swedish company said on Sunday. \nIKEA’s simple but sturdy designs and self-assembly products are now familiar in homes around the globe and the retailer is aiming to generate 50 billion euros ($62 billion) in annual revenues by 2020. \nKamprad started IKEA in 1943 when he was just 17, but his big break came in 1956, when the company pioneered flat-pack furniture. \nHe got the idea when he watched an employee taking the legs off a table to fit it into a customer’s car and realized that it could be developed to save money on transport, storage and sales space. \nThe business now has around 400 stores, many of them cavernous warehouses in out-of-town malls and roughly 1 billion people visited them last year. \n“One of the greatest entrepreneurs of the 20th century, Ingvar Kamprad, has peacefully passed away, at his home in Smaland, Sweden, on the 27th of January,” the company said. \nSweden’s Prime Minister Stefan Lofven praised Kamprad as an inspirational figure whose influence had reached far beyond his native land. \n“Ingvar Kamprad was a unique entrepreneur who had a big impact on Swedish business and who made home design a possibility for the many not just the few,” national news agency TT quoted Lofven saying. \nBorn on March 30, 1926, in southern Sweden, Kamprad started off selling matches to neighbors at the age of five and soon diversified his inventory to include seeds, Christmas tree decorations, pencils and ball-point pens. FILE PHOTO: Ingvar Kamprad, founder of Swedish multinational furniture retailer IKEA, is seen at company's head office in Almhult, Sweden August 6, 2002. TT News Agency/Claudio Bresciani via REUTERS/File photo \nDespite his wealth, Kamprad prided himself on being frugal, driving an old car and encouraging staff to write on both sides of a sheet of paper to avoid waste. \nKamprad was also controversial figure. \nHe was forced to apologize for his time as a member of the New Swedish Movement, a nationalist, far-right group that supported fascist parties around Europe, in the 1940s. Slideshow (7 Images) \nHis decision to live abroad, mainly in Switzerland, to avoid Sweden’s high income taxes was also widely criticized. \nIn recent years, Kamprad had stepped away from the day-to-say running of the empire he created, though he remained an advisor. \nHis sons -- Peter, Jonas and Mathias -- still sit on the boards of various IKEA entities, but the family is no longer at the helm. Related Coverage Flat-pack pioneer Kamprad built Sweden's IKEA into global brand \n“Ingvar Kamprad was a great entrepreneur of the typical southern Swedish kind - hardworking and stubborn, with a lot of warmth and a playful twinkle in his eye,” the company said. \n“He worked until the very end of his life, staying true to his own motto that most things remain to be done.” \n($1 = 0.8052 euros)", "external_links": [], "published": "2018-01-28T12:49:00.000+02:00", "crawled": "2018-01-28T13:04:21.036+02:00", "highlightTitle": ""}