{"organizations": [], "uuid": "569aff9d91d1fa3a04fa117b78beceab68c7d467", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/london-embassy.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/12/trump-london-obama-embassy/", "country": "US", "domain_rank": 1196, "title": "Trump Cancels London Trip to Inaugurate New U.S. Embassy | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.027, "site_type": "news", "published": "2018-01-12T07:46:00.000+02:00", "replies_count": 0, "uuid": "569aff9d91d1fa3a04fa117b78beceab68c7d467"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/12/trump-london-obama-embassy/", "ord_in_thread": 0, "title": "Trump Cancels London Trip to Inaugurate New U.S. Embassy | Fortune", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "— donald j. trump", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "trump cancels london trip to inaugurate new u.s. embassy", "sentiment": "negative"}, {"name": "daily mail", "sentiment": "none"}, {"name": "obama administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 5:46 AM EST \nPresident Donald Trump has ditched plans to visit London next month to open a new U.S. embassy, in a decision that poses a new test for the so-called “special relationship” with the U.K. \n“Reason I canceled my trip to London is that I am not a big fan of the Obama administration having sold perhaps the best located and finest embassy in London for ‘peanuts,’ only to build a new one in an off location for $1.2 billion,” Trump said on Twitter. “Bad deal. Wanted me to cut ribbon — NO!” Reason I canceled my trip to London is that I am not a big fan of the Obama Administration having sold perhaps the best located and finest embassy in London for “peanuts,” only to build a new one in an off location for 1.2 billion dollars. Bad deal. Wanted me to cut ribbon-NO! \n— Donald J. Trump (@realDonaldTrump) January 12, 2018 \nWhile the sale was made under Obama’s watch, the decision to relocate the embassy was made under George W. Bush in 2008. \nTrump’s decision was reported late Thursday by the U.K.’s Daily Mail newspaper. It said some officials believed he decided not to come because he felt the arrangements for the visit were too low key, and would instead send Secretary of State Rex Tillerson to open the embassy. \nRead: Trump Touts Sale of Fighter Jets That Only Exist in ‘Call of Duty’ Video Game \nSpeaking on condition of anonymity on Friday, a British official said the U.K. government had been working on the basis that Trump would arrive in late February, though no firm date had been set. The U.K.’s official invitation to Trump for a full “state visit” still stands. Strained Relationship \nTrump’s friend and Brexit campaigner Nigel Farage said the president may have been put off by the prospect of his visit being overshadowed by street demonstrations from people protesting about his views. \nRelations between the U.S. and its closest ally have been repeatedly strained since Trump took office a year ago and U.K. Prime Minister Theresa May became the first foreign leader to meet him at the White House. May’s invitation for Trump to visit the Queen has faced growing opposition, fueled in part by the president’s Twitter criticism of London Mayor Sadiq Khan and retweets of propaganda from a far-right British anti-Muslim group. \nRead: President Trump Said He’d Prefer Immigrants From Norway Over ‘Shithole Countries’ \nKhan said Trump “would without doubt have been met by mass peaceful protests” if he hadn’t canceled the trip. “It appears that President Trump got the message.” \nBritish opposition politicians said Trump was not welcome in the U.K. Former opposition Labour party leader leader Ed Miliband tweeted to Trump that the reason he cancelled was really “because nobody wanted you to come. And you got the message.” Wedding Snub \nFarage, who was the first British politician to meet Trump after his election victory, suggested political opposition to Trump’s views may have played a part. “It’s disappointing,” Farage told BBC Radio’s Today program on Friday. It’s possible that plans for “mass protests, those optics he didn’t like the look of.” \nAnother explanation could be reports that Trump isn’t happy because he may not be invited to the forthcoming wedding of British royal Prince Harry and Meghan Markle. The prince is on friendly terms with former President Barack Obama, who U.K. media have suggested will be invited. \n“Who his Royal Highness Prince Harry and Miss Markle invite to their wedding is really a matter for them,” said senior Conservative Party lawmaker Tom Tugendhat. Foreign heads of state should not automatically expect an invitation to the wedding, he added. \nRead: Carrier Factory ‘Saved’ By Donald Trump to Lay Off 200 More Workers \nTrump’s decision to stay away from the embassy opening is “a great shame” but will not cause lasting harm to the transatlantic relationship, Tugendhat told the Today program. “The United States is very much one of our closest allies but the alliance isn’t based on who lives in the White House and who lives in Number 10, it’s based on shared values, common interests and an absolute commitment to the international rules-based system.” \nThe new site on the south bank of the river Thames near to the Palace of Westminster had been scheduled to open during Obama’s term, but delays pushed back its formal opening until this year. The State Department agreed to sell the existing embassy building on Grosvenor Square, Mayfair, to Qatari Diar Real Estate Investment Co. in 2009 to fund the relocation. The investors have sought approval to turn the building into a hotel, according to the project’s website. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-12T07:46:00.000+02:00", "crawled": "2018-01-12T14:54:50.022+02:00", "highlightTitle": ""}