{"organizations": [], "uuid": "ded821315f6452f22e407951c795276315a17338", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/ulysse-nardin-watch.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/erotic-watches-ulysse-nardin/", "country": "US", "domain_rank": 1196, "title": "X-Rated Watches Are One of the Industry's Most Expensive Niches | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.924, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "ded821315f6452f22e407951c795276315a17338"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/19/erotic-watches-ulysse-nardin/", "ord_in_thread": 0, "title": "X-Rated Watches Are One of the Industry's Most Expensive Niches | Fortune", "locations": [], "entities": {"persons": [{"name": "ulysse nardin", "sentiment": "none"}], "locations": [{"name": "geneva", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg January 19, 2018 \nA leather fox mask and handcuffs adorn the walls of a small room behind the Ulysse Nardin stand at the Geneva watch fair. Step inside for a glimpse into one of the industry’s most expensive niches: erotic timepieces. \nThe boudoir displays the Kering-owned brand’s $300,000-plus Classic Voyeur, which marks the passing of time by setting into motion four naked figures depicted in what the company describes as a “Louis XIV salon.” Two of them are locked in coital embrace as the others peer from behind a curtain. \nUlysse Nardin’s “red room” might seem better suited to a fetish club in the “Fifty Shades of Grey” era than the trade show of a $50 billion industry in the post-Weinstein-scandal world. Yet the Classic Voyeur is just the latest example of a centuries-long heritage of X-rated timepieces from Swiss watchmakers, discreetly coveted by collectors for whom ordinary Ulysse Nardin models like the Marine Chronometer Torpilleur or Classico Jade have lost that certain sparkle. \n“I know it can sound funny when you look at the watch, but it’s actually a good illustration of how we master craftsmanship,” Ulysse Nardin Chief Executive Officer Patrick Pruniaux said in an interview. \nOver the past two decades,Ulysse Nardin has rekindled interest in the tradition with scenes depicting Kama Sutra positions and a 2008 timepiece that showed avatars of Adam, Eve and a serpent coming to life on the hour. This year, as the industry looks for innovations in technology and marketing to help move on from a multiyear slump, the brand shed its inhibitions. \nWhile the company plans to make only three-dozen Classic Voyeurs, it hosted a “Hot Horology” party replete with scantily clad burlesque entertainers, a male pole-dancer and fire-breathers. Guests were given wigs and feather boas. Pruniaux, who joined Ulysse Nardin last year from Apple Inc., donned a Venetian mask for a photo shoot. Minute Repeater \nThe watchmaker says the Classic Voyeur is its most intricate erotic timepiece yet, featuring a minute repeater — one of the technological pinnacles of mechanical timekeeping. It displays a scene that Pruniaux is quick to point out features consenting adults. \nUlysse Nardin has sold a handful of the watches, mostly to men from all over the world, the CEO said. The Classic Voyeur goes for $295,000 for a rose-gold version. A platinum model can be garnished with 60 baguette diamonds, raising the price to $373,000. \nWhile other brands, including Breguet, Richard Mille and Blancpain, have dabbled in X-rated watchmaking, they’ve sometimes featured the scenes on the backs of the cases. Ulysse Nardin decided to place them on the front. \n“We’re more open,” Pruniaux said. “It’s a lot of fun. When you look at the scene, it doesn’t say anything wrong about sexuality.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-20T17:44:40.035+02:00", "highlightTitle": ""}