{"organizations": [], "uuid": "f7631bad6a3299d3f5fb5fb2ddadd57fb0a6f8ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-gordon-brothers-to-market-sale-of-reedas-los-angeles-beverage-manufacturing-plant-and-branded-candy-business.html", "country": "US", "domain_rank": 767, "title": "Gordon Brothers to Market Sale of Reed’s Los Angeles Beverage Manufacturing Plant and Branded Candy Business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:30:00.000+02:00", "replies_count": 0, "uuid": "f7631bad6a3299d3f5fb5fb2ddadd57fb0a6f8ef"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-gordon-brothers-to-market-sale-of-reedas-los-angeles-beverage-manufacturing-plant-and-branded-candy-business.html", "ord_in_thread": 0, "title": "Gordon Brothers to Market Sale of Reed’s Los Angeles Beverage Manufacturing Plant and Branded Candy Business", "locations": [], "entities": {"persons": [{"name": "gordon brothers", "sentiment": "negative"}, {"name": "reed", "sentiment": "none"}, {"name": "virgil", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}, {"name": "reed", "sentiment": "none"}, {"name": "reed’s, inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON and LOS ANGELES, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Gordon Brothers, a global advisory, restructuring and investment firm specializing in the industrial, consumer products and retail sectors, has been retained by Reed’s, Inc. (NYSE American:REED), one of the nation’s leading portfolios of handcrafted, natural beverages, to manage the sale of its Los Angeles, California beverage manufacturing facility and the Reed’s branded candy business.\nThe sale process supports the Company’s previously announced plans to streamline its business model, improve margins and focus on becoming a sales and marketing driven organization. Proceeds from the sales process will go toward paying down the Company’s debt position.\n“After a thorough strategic review, it was determined that the Company’s business model and profitability would be materially improved by exiting the manufacturing business and utilizing larger, more efficient co-packers to manufacture our award-winning Reed’s and Virgil’s beverage offerings. In an ideal situation, we would work with the buyer of the facility to continue supplying our West Coast production needs,” commented Val Stalowir, Chief Executive Officer of Reed’s, Inc.\n“We are pleased to be able to offer a comprehensive solution to Reed’s as they execute on their business model transformation. We look forward to working with qualified purchasers of these assets over the coming months,” stated Robert Himmel, Senior Managing Director of Gordon Brothers.\nLocated at 13000 South Spring Street in unincorporated Los Angeles, California, the plant comprises over 30,000 square feet of manufacturing, distribution and office space. The beverage manufacturing operation is being offered as a fully functional production facility that currently supplies product for the Company’s branded natural beverage business as well as the private label offerings of prominent supermarkets and specialty retailers. Suitable for micro-brewing operations, the facility, which includes both legacy brewing equipment and newly purchased state-of-the-art automated labeling and filling equipment, offers a unique turnkey business opportunity due to its location and unique beverage production capabilities.\nOver the last two years, there have been significant plant upgrades to the water, gas and electrical systems that improve the overall capability of the facility to handle high speed manufacturing and provide a solid foundation for potential alternate uses for the facility.\nAdditionally, the proprietary Reed’s branded candy business is being offered for sale in a stand-alone or related transaction. Reed’s ginger based candy offerings include crystalized ginger and a variety of ginger chews that are currently sold to consumers through retailers and internet retail outlets.\nFor additional details, interested buyers can access more information at gordonbrothers.com/reeds , or contact reeds@gordonbrothers.com or (617) 422-7832.\nAbout Gordon Brothers\nSince 1903, Gordon Brothers ( www.gordonbrothers.com ) has helped lenders, operating executives, advisors, and investors move forward through change. The firm brings a powerful combination of expertise and capital to clients, developing customized solutions on an integrated or standalone basis across four service areas: valuations, dispositions, operations, and investments. Whether to fuel growth or facilitate strategic consolidation, Gordon Brothers partners with companies in the retail, commercial, and industrial sectors to put assets to their highest and best use. Gordon Brothers conducts more than $70 billion worth of dispositions and appraisals annually. Gordon Brothers is headquartered in Boston, with 25 offices across five continents.\nAbout Reed’s, Inc.\nEstablished in 1989, Reed’s has sold over 500 million bottles of its category leading natural, handcrafted beverages. Reed’s is America’s #1 selling Ginger Beer brand and has been the leader and innovator in the ginger beer category for decades. Virgil’s is America’s #1 selling independent, natural craft soda brand. The Reed’s, Inc. portfolio is sold in over 20,000 retail doors across the natural, specialty, grocery, drug, club and mass channels nationwide. Reed’s Ginger Beers are unique to the category because of the proprietary process of hand brewing its award-winning products using fresh organic ginger combined with natural spices and fruit juices. Reed’s Ginger Beers come in three levels of increasing ginger intensity that deliver a delicious and powerful ginger bite and burn that can only come from fresh ginger root. The Company uses this same handcrafted approach and dedication to the highest quality ingredients in its award-winning Virgil’s line of great tasting, bold flavored craft sodas.\nFor more information about Reed’s, please visit the Company’s website at: http://www.reedsinc.com or call 800-99-REEDS.\nFollow Reed’s on Twitter at http://twitter.com/reedsgingerbrew\nReed’s Facebook Fan Page at https://www.facebook.com/reedsgingerbrew\nSAFE HARBOR STATEMENT\nSome portions of this press release, particularly those describing Reed’s goals and strategies, contain “ ” These forward-looking statements can generally be identified as such because the context of the statement will include words, such as “expects,” “should,” “believes,” “anticipates” or words of similar import. Similarly, statements that describe future plans, objectives or goals are also While Reed’s is working to achieve those goals and strategies, actual results could differ materially from those projected in the forward-looking statements as a result of a number of risks and uncertainties. These risks and uncertainties include difficulty in marketing its products and services, maintaining and protecting brand recognition, the need for significant capital, dependence on third party distributors, dependence on third party brewers, increasing costs of fuel and freight, protection of intellectual property, competition and other factors, any of which could have an adverse effect on the business plans of Reed’s, its reputation in the industry or its expected financial return from operations and results of operations. In light of significant risks and uncertainties inherent in forward-looking statements included herein, the inclusion of such statements should not be regarded as a representation by Reed’s that they will achieve such For further details and a discussion of these and other risks and uncertainties, please see our most recent reports on Form 10-K, Form 10-Q and Form S-1, as filed with the Securities and Exchange Commission, as they may be amended from time to time. Reed’s undertakes no obligation to publicly update any forward-looking statement, whether as a result of new information, future events, or otherwise.\nINVESTOR CONTACT:\nReed's, Inc.\nInvestor Relations\n(310) 217-9400 Ext 6\nEmail: ir@reedsinc.com\nMEDIA CONTACT\nCal Shusta\nDirector, Marketing\nGordon Brothers\ncshusta@gordonbrothers.com\nSource:Reed's Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=41SSTNO-LLznPdA8ZJB0zjMQbSdug01FdqhLiaSwQhgKpCPutBVro6Jnr3OAnvde8x7pyZCtFT-93kN0uWDVN8Qg8Jgs5Li_GabzqYy0-z9RvtWIky1tSG7zpbRkBxicZEFebbwil8fNfuMoXbjYEw==", "https://www.globenewswire.com/Tracker?data=xxuf8da0jNBjCcya0a4gk0l_1g2BSKYUBsi_G4ML8ChVpbq5E5owe0YXAQDzxR0aMc0bTmTO6aVLl9QJOt5RHonEGN04pdnfVT83CmZ367U=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f554887a-e34e-4632-870b-18e4b1be7001", "https://www.facebook.com/reedsgingerbrew", "http://gordonbrothers.com/reeds", "https://www.globenewswire.com/Tracker?data=LjjgI2Ii8XIZU09uRL1eb4OzXQNfSR_uLNTloVSEcHDXv74vCsGQ4M8N0nGjg8C5NBgBdLrcbDFjMPeADJLGHkUXct-jTo2nMhoPh4NpsqQ=", "https://www.globenewswire.com/Tracker?data=7ustDekl4CxPV92HKfqTznjb9uLY4uJ2JNY9aYBDuoa5uRKojiHHiEB33SLUZ76y7vhAZ_uBrRmgW9W9eVPCkVZz-MlcUbOlWkU15s_UXBM=", "http://twitter.com/reedsgingerbrew", "https://www.globenewswire.com/Tracker?data=xxuf8da0jNBjCcya0a4gk9amVnCJ9MZ4aS-neXnX75dG1lzNTQ-AF7PKPiT3QhlfxSfmWPDtS1eNSxLq2Me46Wq78WN45E9Ww5-r28ngku7YhUZJQskRmt1I8UbbRsxK"], "published": "2018-01-08T16:30:00.000+02:00", "crawled": "2018-01-08T18:52:16.044+02:00", "highlightTitle": ""}