{"organizations": [], "uuid": "b0be72e2ec562d584c6d9e377d8943d1257061ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-transcat-reports-13-percent-operating-income-growth-on-record-revenue-of-40-point-5-million-for-fiscal-2018-third-quarter.html", "country": "US", "domain_rank": 767, "title": "Transcat Reports 13% Operating Income Growth on Record Revenue of $40.5 million for Fiscal 2018 Third Quarter", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.542, "site_type": "news", "published": "2018-01-30T00:15:00.000+02:00", "replies_count": 0, "uuid": "b0be72e2ec562d584c6d9e377d8943d1257061ea"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-transcat-reports-13-percent-operating-income-growth-on-record-revenue-of-40-point-5-million-for-fiscal-2018-third-quarter.html", "ord_in_thread": 0, "title": "Transcat Reports 13% Operating Income Growth on Record Revenue of $40.5 million for Fiscal 2018 Third Quarter", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "rochester", "sentiment": "none"}], "organizations": [{"name": "transcat, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Service segment revenue up 7.5% all on organic growth Service gross margin improved 30 basis points from productivity improvements Record Distribution sales of $21.7 million Achieved quarterly diluted earnings per share of $0.25; Reduced U.S. corporate tax rate contributed $0.04\nROCHESTER, N.Y.--(BUSINESS WIRE)-- Transcat, Inc. (NASDAQ:TRNS) (“Transcat” or the “Company”), a leading provider of accredited calibration, repair, inspection and laboratory instrument services and value-added distributor of professional grade handheld test, measurement and control instrumentation, today reported financial results for its third quarter ended December 23, 2017 (the “third quarter”) of fiscal year 2018, which ends March 31, 2018 (“fiscal 2018”).\n“We are pleased to report strong third quarter results in both segments. This quarter represents record results for our Distribution segment as momentum in our core sales as well as rentals continues to be strong. Our Service segment generated solid organic growth of 7.5% and delivered improved productivity with a 30 basis point increase in gross margin,” commented Lee D. Rudow, President and CEO. “Transcat continues to demonstrate results consistent with the effective execution of our strategic plan.”\nThird Quarter Fiscal 2018 Review (Results are compared with the third quarter of the fiscal year ended March 25, 2017 (“fiscal 2017”))\n($ in thousands) Change FY18 Q3 FY17 Q3 $'s % Service Revenue $ 18,769 $ 17,455 $ 1,314 7.5 % Distribution Sales $ 21,714 $ 20,358 $ 1,356 6.7 % Revenue $ 40,483 $ 37,813 $ 2,670 7.1 % Gross Profit $ 9,701 $ 8,915 $ 786 8.8 % Gross Margin 24.0 % 23.6 % Operating Income $ 2,654 $ 2,353 $ 301 12.8 % Operating Margin 6.6 % 6.2 % Net Income $ 1,831 $ 1,270 $ 561 44.2 % Net Margin 4.5 % 3.4 % Adjusted EBITDA* $ 4,400 $ 3,901 $ 499 12.8 % Adjusted EBITDA* Margin 10.9 % 10.3 % *See Note 1 on page 4 for a description of this non-GAAP financial measure and page 9 for the Adjusted EBITDA Reconciliation table.\nTranscat achieved record consolidated quarterly revenue of $40.5 million, up 7.1%. Consolidated gross profit grew by 8.8% and gross margin improved 40 basis points. General and Administrative expenses were up $0.5 million to $2.9 million, which reflected the Company’s continued investment in its infrastructure and operational excellence initiatives. Overall, operating income increased $0.3 million and operating margin increased 40 basis points to 6.6%.\nOn December 22, 2017, the Tax Cuts and Jobs Act (H.R. 1) (the \"Act\") was signed into law. The Act includes numerous changes in existing tax law, including a permanent reduction in the federal corporate income tax rate from 35% to 21%. The Act contains other provisions that are not expected to materially impact the Company. As a result of the reduction in the federal income tax rates, the effective tax rate for the third quarter of fiscal 2018 was 21.9% from the prescribed blending of old and new federal income tax rates and the reduction of certain deferred tax liabilities previously recorded. Third quarter diluted earnings per share increased $0.07 to $0.25, of which $0.04 of the increase was due to the Act.\nService segment delivers solid organic growth while focusing on productivity enhancements\nRepresents the accredited calibration, repair, inspection and laboratory instrument services business (46% of total revenue for the third quarter of fiscal 2018).\n($ in thousands) Change FY18 Q3 FY17 Q3 $'s % Service Segment Revenue $ 18,769 $ 17,455 $ 1,314 7.5 % Gross Profit $ 4,699 $ 4,306 $ 393 9.1 % Gross Margin 25.0 % 24.7 % Operating Income $ 1,063 $ 941 $ 122 13.0 % Operating Margin 5.7 % 5.4 % Adjusted EBITDA* $ 2,278 $ 2,067 $ 211 10.2 % Adjusted EBITDA* Margin 12.1 % 11.8 % *See Note 1 on page 4 for a description of this non-GAAP financial measure and page 9 for the Adjusted EBITDA Reconciliation table.\nService revenue increased 7.5% on all organic growth, and was comprised of new business from the life science market and growth in general industrial manufacturing, which includes both the defense and aerospace markets.\nGross profit increased $0.4 million and gross margin improved 30 basis points due to productivity improvements, including the ramp-up in productivity from technicians hired earlier in the fiscal year.\nDiversified sales channels lift Distribution segment\nRepresents the distribution and rental of new and used professional grade handheld test, measurement and control instrumentation (54% of total revenue for the third quarter of fiscal 2018).\n($ in thousands) Change FY18 Q3 FY17 Q3 $'s % Distribution Segment Sales $ 21,714 $ 20,358 $ 1,356 6.7 % Gross Profit $ 5,002 $ 4,609 $ 393 8.5 % Gross Margin 23.0 % 22.6 % Operating Income $ 1,591 $ 1,412 $ 179 12.7 % Operating Margin 7.3 % 6.9 % Adjusted EBITDA* $ 2,122 $ 1,834 $ 288 15.7 % Adjusted EBITDA* Margin 9.8 % 9.0 % *See Note 1 on page 4 for a description of this non-GAAP financial measure and page 9 for the Adjusted EBITDA Reconciliation table.\nThe Distribution sales increase reflected higher demand from industrial customers, including new equipment sold through the Company’s independent representative network and increased web-based sales. It also reflects higher rental revenue, which was up 44% to $1.0 million in the quarter. Despite a decrease in year over year volume-based vendor rebates, the segment recorded a 40 basis point improvement in gross margin.\nNine Month Review (Results are compared with the first nine months of fiscal 2017)\nTotal revenue was $112.7 million, up 6.9%, or $7.2 million for the first nine months of fiscal 2018, all from organic growth. Consolidated gross margin was 23.6% of revenue, down 30 basis points primarily due to Service segment productivity challenges earlier in fiscal 2018. As a percentage of total revenue, consolidated operating expenses were 18.7%, down 10 basis points. As a result, operating income increased $0.2 million to $5.5 million, or 4.9% of revenue. Net income was $3.5 million compared with $3.1 million, of which $0.3 million of this increase was from lower income tax expense resulting from the new tax Act. Adjusted EBITDA improved 7.3% to $11.1 million. See Note 1 on page 4 for a description of this non-GAAP financial measure and page 9 for the Adjusted EBITDA Reconciliation table.\nBalance Sheet and Cash Flow Overview\nCapital expenditures were $5.1 million for the first nine months of fiscal 2018. Investments were primarily for assets for customer-driven expansion of Service segment capabilities, including mobile calibration fleet investments and RF/electronics assets for the aerospace/defense and life science markets, and purchases of rental business assets.\nOn October 30, 2017, the Company entered into an amended and restated credit facility agreement, which extended the term of the Company’s $30.0 million revolving credit facility to 2021 and increased the amount of the term loan to $15.0 million, replacing the previous term loan. The excess funds of the new term loan were used to repay amounts outstanding under the revolving credit facility.\nAt December 23, 2017, the Company had total debt of $26.2 million, with $18.4 million available under its credit facility. Total debt compared with fiscal 2017 year-end was down $1.1 million. The Company’s leverage ratio, as defined in the credit agreement, was 1.72 at December 23, 2017, compared with 1.88 at fiscal 2017 year-end.\nAs previously announced, on December 20, 2017, the Company filed a universal shelf registration statement on Form S-3 with the United States Securities and Exchange Commission (the “SEC”). Under the shelf registration statement, the Company may from time to time in one or more future offerings, issue various types of securities up to an aggregate amount of $50 million. Mr. Rudow noted, “While we have no immediate plans to use this registration statement, we are being proactive in our efforts to support our growth strategy.” The SEC declared the shelf registration statement effective on January 5, 2018.\nOutlook\nMr. Rudow concluded, “We believe we are well positioned and on track for a record year in fiscal 2018. Our multi-year operational excellence initiatives are starting to gain traction and are positively impacting both segments. Our Service segment continues to strengthen its market position, particularly in the life science space where we believe our value proposition resonates the most, and where regulation and the high cost of failure drive recurring revenue streams. We will continue to focus on leveraging technology as a competitive advantage and a driver of increased margins.”\nGiven the changes to the federal corporate income tax rate, Transcat expects its blended income tax rate for fiscal year 2018 to range between 28% and 29%. For fiscal year 2019, the Company expects its effective income tax rate to be approximately 26%.\nThe Company tightened its capital expenditures expectations for the full year fiscal 2018 to a range of $6.0 million to $6.3 million, which is being used primarily for IT infrastructure investments to drive operational excellence, specific customer-opportunity driven Service capabilities and additional assets for the Company’s growing rental business.\nWebcast and Conference Call\nTranscat will host a conference call and webcast on Tuesday, January 30, 2018 at 11:00 a.m. ET. Management will review the financial and operating results for the third quarter, as well as the Company’s strategy and outlook. A question and answer session will follow the formal discussion. The review will be accompanied by a slide presentation, which will be available at www.transcat.com/investor-relations . The conference call can be accessed by calling (201) 689-8471. Alternatively, the webcast can be monitored at www.transcat.com/investor-relations .\nA telephonic replay will be available from 2:00 p.m. ET on the day of the call through Tuesday, February 6, 2018. To listen to the archived call, dial (412) 317-6671 and enter conference ID number 13675052, or access the webcast replay at www.transcat.com/investor-relations , where a transcript will be posted once available.\nNOTE 1 – Non-GAAP Financial Measures\nIn addition to reporting net income, a U.S. generally accepted accounting principle (“GAAP”) measure, we present Adjusted EBITDA (earnings before interest, income taxes, depreciation and amortization, and non-cash stock-based compensation expense), which is a non-GAAP measure. The Company’s management believes Adjusted EBITDA is an important measure of operating performance because it allows management, investors and others to evaluate and compare the performance of its core operations from period to period by removing the impact of the capital structure (interest), tangible and intangible asset base (depreciation and amortization), taxes, and stock-based compensation expense, which is not always commensurate with the reporting period in which it is included. As such, the Company uses Adjusted EBITDA as a measure of performance when evaluating its business segments and as a basis for planning and forecasting. Adjusted EBITDA is not a measure of financial performance under GAAP and is not calculated through the application of GAAP. As such, it should not be considered as a substitute for the GAAP measure of net income and, therefore, should not be used in isolation of, but in conjunction with, the GAAP measure. Adjusted EBITDA, as presented, may produce results that vary from the GAAP measure and may not be comparable to a similarly defined non-GAAP measure used by other companies. See the attached Adjusted EBITDA Reconciliation table on page 9.\nABOUT TRANSCAT\nTranscat, Inc. is a leading provider of accredited calibration, repair, inspection and laboratory instrument services. The Company is focused on providing best-in-class services and products to highly regulated industries, including life science, aerospace and defense, pharmaceutical, medical device manufacturing and biotechnology. Transcat provides permanent and periodic on-site services, mobile calibration services and in-house services through 22 Calibration Service Centers strategically located across the United States, Puerto Rico and Canada. The breadth and depth of measurement parameters addressed by Transcat’s ISO/IEC 17025 scopes of accreditation are believed to be the best in the industry.\nTranscat also operates as a leading value-added distributor that markets, sells and rents new and used national and proprietary brand instruments to customers primarily in North America. The Company believes its combined Service and Distribution segment offerings, experience, technical expertise and integrity create a unique and compelling value proposition for its customers.\nTranscat’s strategy is to leverage the complementary nature of its two operating segments, its comprehensive service capabilities, strong brand, enhanced e-commerce capabilities and leading distribution platform to drive organic sales growth. The Company will also look to expand its addressable calibration market through acquisitions and capability investments to further realize the inherent leverage of its business model.\nMore information about Transcat can be found at: Transcat.com .\nSafe Harbor Statement\nThis news release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are not statements of historical fact and thus are subject to risks, uncertainties and assumptions. Forward-looking statements are identified by words such as “expects,” “estimates,” “projects,” “anticipates,” “believes,” “could,” and other similar words. All statements addressing operating performance, events or developments that Transcat, Inc. expects or anticipates will occur in the future, including but not limited to statements relating to anticipated revenue, profit margins, sales operations, capital expenditures, cash flows, operating income, growth strategy, segment growth, potential acquisitions, integration of acquired businesses, market position, customer preferences, outlook and changes in market conditions in the industries in which Transcat operates are forward-looking statements. Forward-looking statements should be evaluated in light of important risk factors and uncertainties. These risk factors and uncertainties are more fully described in Transcat’s Annual Report and Quarterly Reports filed with the Securities and Exchange Commission, including under the heading entitled “Risk Factors.” Should one or more of these risks or uncertainties materialize, or should any of the Company’s underlying assumptions prove incorrect, actual results may vary materially from those currently anticipated. In addition, undue reliance should not be placed on the Company’s forward-looking statements. Except as required by law, the Company disclaims any obligation to update, correct or publicly announce any revisions to any of the forward-looking statements contained in this news release.\nFINANCIAL TABLES FOLLOW.\nTRANSCAT, INC.\nCONSOLIDATED STATEMENTS OF INCOME\n(In Thousands, Except Per Share Amounts)\n(Unaudited) (Unaudited) Third Quarter Ended Nine Months Ended December 23, December 24, December 23, December 24, 2017 2016 2017 2016 Service Revenue $ 18,769 $ 17,455 $ 55,490 $ 51,577 Distribution Sales 21,714 20,358 57,199 53,868 Total Revenue 40,483 37,813 112,689 105,445 Cost of Service Revenue 14,070 13,149 41,835 38,402 Cost of Distribution Sales 16,712 15,749 44,308 41,855 Total Cost of Revenue 30,782 28,898 86,143 80,257 Gross Profit 9,701 8,915 26,546 25,188 Selling, Marketing and Warehouse Expenses 4,150 4,159 12,247 12,612 General and Administrative Expenses 2,897 2,403 8,776 7,207 Total Operating Expenses 7,047 6,562 21,023 19,819 Operating Income 2,654 2,353 5,523 5,369 Interest and Other Expense, net 311 188 854 547 Income Before Income Taxes 2,343 2,165 4,669 4,822 Provision for Income Taxes 512 895 1,201 1,729 Net Income $ 1,831 $ 1,270 $ 3,468 $ 3,093 Basic Earnings Per Share $ 0.26 $ 0.18 $ 0.49 $ 0.44 Average Shares Outstanding 7,142 7,010 7,115 6,984 Diluted Earnings Per Share $ 0.25 $ 0.18 $ 0.48 $ 0.43 Average Shares Outstanding 7,319 7,204 7,273 7,161 TRANSCAT, INC.\nCONSOLIDATED BALANCE SHEETS\n(In Thousands, Except Share and Per Share Amounts)\n(Unaudited) December 23, March 25,\n2017 2017 ASSETS Current Assets: Cash $\n504\n$ 842 Accounts Receivable, less allowance for doubtful accounts of $270 and $210 as of December 23, 2017 and March 25, 2017, respectively 22,700 22,049 Other Receivables 1,535 1,227 Inventory, net 11,144 10,278 Prepaid Expenses and Other Current Assets 988 1,193 Total Current Assets 36,871 35,589 Property and Equipment, net 17,478 15,568 Goodwill 32,823 32,520 Intangible Assets, net 5,984 7,519 Other Assets 1,079 901 Total Assets $\n94,235\n$ 92,097 LIABILITIES AND SHAREHOLDERS' EQUITY Current Liabilities: Accounts Payable $\n11,478\n$ 11,615 Accrued Compensation and Other Liabilities 4,524 5,907 Income Taxes Payable 468 805 Current Portion of Long-Term Debt 2,143 1,429 Total Current Liabilities 18,613 19,756 Long-Term Debt 24,103 25,883 Deferred Tax Liability 955 1,134 Other Liabilities 1,960 1,923 Total Liabilities 45,631 48,696 Shareholders' Equity: Common Stock, par value $0.50 per share, 30,000,000 shares authorized; 7,144,475 and 7,043,754 shares issued and outstanding as of December 23, 2017 and March 25, 2017, respectively 3,572 3,522 Capital in Excess of Par Value 14,553 12,996 Accumulated Other Comprehensive Loss (161) (414) Retained Earnings 30,640 27,297 Total Shareholders' Equity 48,604 43,401 Total Liabilities and Shareholders' Equity $\n94,235\n$ 92,097 TRANSCAT, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In Thousands)\n(Unaudited)\n(Unaudited)\nFor the Nine Months Ended\nDecember 23, December 24, 2017 2016 Cash Flows from Operating Activities: Net Income $ 3,468 $ 3,093 Adjustments to Reconcile Net Income to Net Cash Provided by Operating Activities: Loss on Sale of Property and Equipment 57 6 Deferred Income Taxes 11 121 Depreciation and Amortization 4,527 4,667 Provision for Accounts Receivable and Inventory Reserves 341 243 Stock-Based Compensation 1,095 316 Changes in Assets and Liabilities: Accounts Receivable and Other Receivables (1,009 ) (3,168 ) Inventory (612 ) (3,967 ) Prepaid Expenses and Other Assets (29 ) (341 ) Accounts Payable (137 ) 3,378 Accrued Compensation and Other Liabilities (1,325 ) (454 ) Income Taxes Payable (570 ) (20 ) Net Cash Provided by Operating Activities 5,817 3,874 Cash Flows from Investing Activities: Purchase of Property and Equipment (5,084 ) (4,104 ) Proceeds from Sale of Property and Equipment 11 29 Business Acquisitions, net of cash acquired - (6,977 ) Net Cash Used in Investing Activities (5,073 ) (11,052 ) Cash Flows from Financing Activities: Proceeds from (Repayment of) Revolving Credit Facility, net (7,018 ) (1,924 ) Proceeds from Term Loan 7,143 10,000 Repayments of Term Loan (1,190 ) (952 ) Issuance of Common Stock 821 384 Repurchase of Common Stock (344 ) (98 ) Stock Option Redemption (90 ) (137 ) Payment of Contingent Consideration & Holdbacks Related to Business Acquisitions - (339 ) Net Cash (Used in) Provided by Financing Activities (678 ) 6,934 Effect of Exchange Rate Changes on Cash (404 ) 162 Net Decrease in Cash (338 ) (82 ) Cash at Beginning of Period 842 641 Cash at End of Period $ 504 $ 559 TRANSCAT, INC.\nAdjusted EBITDA Reconciliation Table\n(Dollars in thousands)\n(Unaudited)\nFiscal 2018 Q1 Q2 Q3 Q4 YTD Net Income $ 856 $ 781 $ 1,831 $ 3,468 + Interest Expense 236 281 250 767 + Other Expense / (Income) 36 (10 ) 61 87 + Tax Provision 283 406 512 1,201 Operating Income $ 1,411 $ 1,458 $ 2,654 $ 5,523 + Depreciation & Amortization 1,487 1,497 1,543 4,527 + Other (Expense) / Income (36 ) 10 (61 ) (87 ) + Noncash Stock Compensation 499 332 264 1,095 Adjusted EBITDA $ 3,361 $ 3,297 $ 4,400 $ 11,058 Segment Breakdown\nService Operating Income $ 885 $ 790 $ 1,063 $ 2,738 + Depreciation & Amortization 1,110 1,107 1,126 3,343 + Other (Expense) / Income (28 ) 4 (45 ) (69 ) + Noncash Stock Compensation 249 168 134 551 Service Adjusted EBITDA $ 2,216 $ 2,069 $ 2,278 $ 6,563 Distribution Operating Income $ 526 $ 668 $ 1,591 $ 2,785 + Depreciation & Amortization 377 390 417 1,184 + Other (Expense) / Income (8 ) 6 (16 ) (18 ) + Noncash Stock Compensation 250 164 130 544 Distribution Adjusted EBITDA $ 1,145 $ 1,228 $ 2,122 $ 4,495 Fiscal 2017\nQ1 Q2 Q3 Q4 YTD Net Income $ 906 $ 917 $ 1,270 $ 1,429 $ 4,522 + Interest Expense 137 180 184 218 719 + Other Expense / (Income) 31 11 4 5 51 + Tax Provision 364 470 895 913 2,642 Operating Income $ 1,438 $ 1,578 $ 2,353 $ 2,565 $ 7,934 + Depreciation & Amortization 1,549 1,556 1,562 1,517 6,184 + Other (Expense) / Income (31 ) (11 ) (4 ) (5 ) (51 ) + Noncash Stock Compensation 149 177 (10 ) 137 453 Adjusted EBITDA $ 3,105 $ 3,300 $ 3,901 $ 4,214 $ 14,520 Segment Breakdown\nService Operating Income $ 1,044 $ 791 $ 941 $ 1,993 $ 4,769 + Depreciation & Amortization 1,247 1,137 1,158 1,118 4,660 + Other (Expense) / Income (27 ) (12 ) (7 ) (9 ) (55 ) + Noncash Stock Compensation 80 94 (25 ) 68 217 Service Adjusted EBITDA $ 2,344 $ 2,010 $ 2,067 $ 3,170 $ 9,591 Distribution Operating Income $ 394 $ 787 $ 1,412 $ 572 $ 3,165 + Depreciation & Amortization 302 419 404 399 1,524 + Other (Expense) / Income (4 ) 1 3 4 4 + Noncash Stock Compensation 69 83 15 69 236 Distribution Adjusted EBITDA $ 761 $ 1,290 $ 1,834 $ 1,044 $ 4,929 TRANSCAT, INC.\nAdditional Information - Business Segment Data\n(Dollars in thousands)\n(Unaudited)\nChange SERVICE FY 2018 Q3 FY 2017 Q3 $'s % Service Revenue $ 18,769 $ 17,455 $ 1,314 7.5 % Cost of Revenue $ 14,070 $ 13,149 $ 921 7.0 % Gross Profit $ 4,699 $ 4,306 $ 393 9.1 % Gross Margin 25.0 % 24.7 % Selling, Marketing & Warehouse Expenses $ 2,092 $ 2,168 ($76 ) (3.5 %) General and Administrative Expenses $ 1,544 $ 1,197 $ 347 29.0 % Operating Income $ 1,063 $ 941 $ 122 13.0 % % of Revenue 5.7 % 5.4 % Change DISTRIBUTION FY 2018 Q3 FY 2017 Q3 $'s % Distribution Sales $ 21,714 $ 20,358 $ 1,356 6.7 % Cost of Sales $ 16,712 $ 15,749 $ 963 6.1 % Gross Profit $ 5,002 $ 4,609 $ 393 8.5 % Gross Margin 23.0 % 22.6 % Selling, Marketing & Warehouse Expenses $ 2,058 $ 1,991 $ 67 3.4 % General and Administrative Expenses $ 1,353 $ 1,206 $ 147 12.2 % Operating Income $ 1,591 $ 1,412 $ 179 12.7 % % of Sales 7.3 % 6.9 % Change TOTAL FY 2018 Q3 FY 2017 Q3 $'s % Total Revenue $ 40,483 $ 37,813 $ 2,670 7.1 % Total Cost of Revenue $ 30,782 $ 28,898 $ 1,884 6.5 % Gross Profit $ 9,701 $ 8,915 $ 786 8.8 % Gross Margin 24.0 % 23.6 % Selling, Marketing & Warehouse Expenses $ 4,150 $ 4,159 ($9 ) (0.2 %) General and Administrative Expenses $ 2,897 $ 2,403 $ 494 20.6 % Operating Income $ 2,654 $ 2,353 $ 301 12.8 % % of Revenue 6.6 % 6.2 % TRANSCAT, INC.\nAdditional Information - Business Segment Data\n(Dollars in thousands)\n(Unaudited)\nChange SERVICE FY 2018\nYTD\nFY 2017\nYTD\n$'s % Service Revenue $ 55,490 $ 51,577 $ 3,913 7.6 % Cost of Revenue $ 41,835 $ 38,402 $ 3,433 8.9 % Gross Profit $ 13,655 $ 13,175 $ 480 3.6 % Gross Margin 24.6 % 25.5 % Selling, Marketing & Warehouse Expenses $ 6,310 $ 6,815 ($505 ) (7.4 %) General and Administrative Expenses $ 4,607 $ 3,584 $ 1,023 28.5 % Operating Income $ 2,738 $ 2,776 ($38 ) (1.4 %) % of Revenue 4.9 % 5.4 % Change DISTRIBUTION FY 2018\nYTD\nFY 2017\nYTD\n$'s % Distribution Sales $ 57,199 $ 53,868 $ 3,331 6.2 % Cost of Sales $ 44,308 $ 41,855 $ 2,453 5.9 % Gross Profit $ 12,891 $ 12,013 $ 878 7.3 % Gross Margin 22.5 % 22.3 % Selling, Marketing & Warehouse Expenses $ 5,937 $ 5,797 $ 140 2.4 % General and Administrative Expenses $ 4,169 $ 3,623 $ 546 15.1 % Operating Income $ 2,785 $ 2,593 $ 192 7.4 % % of Sales 4.9 % 4.8 % Change TOTAL FY 2018\nYTD\nFY 2017\nYTD\n$'s % Total Revenue $ 112,689 $ 105,445 $ 7,244 6.9 % Total Cost of Revenue $ 86,143 $ 80,257 $ 5,886 7.3 % Gross Profit $ 26,546 $ 25,188 $ 1,358 5.4 % Gross Margin 23.6 % 23.9 % Selling, Marketing & Warehouse Expenses $ 12,247 $ 12,612 ($365 ) (2.9 %) General and Administrative Expenses $ 8,776 $ 7,207 $ 1,569 21.8 % Operating Income $ 5,523 $ 5,369 $ 154 2.9 % % of Revenue 4.9 % 5.1 %\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005994/en/\nTranscat, Inc.\nMichael J. Tschiderer, 585-352-7777\nChief Financial Officer\nmtschiderer@transcat.com\nor\nDeborah K. Pawlowski, 716-843-3908\nInvestor Relations\ndpawlowski@keiadvisors.com\nSource: Transcat, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.transcat.com%2F&esheet=51750223&newsitemid=20180129005994&lan=en-US&anchor=Transcat%2C+Inc.&index=1&md5=0fc1b4943b7285b2fe462a973f64689b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.transcat.com&esheet=51750223&newsitemid=20180129005994&lan=en-US&anchor=Transcat.com&index=5&md5=571a12d79e32899f454922229e1a1ec2", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.transcat.com%2Finvestor-relations&esheet=51750223&newsitemid=20180129005994&lan=en-US&anchor=www.transcat.com%2Finvestor-relations&index=3&md5=46420f5cc451eb8e9b33e8411b357240", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.transcat.com%2Finvestor-relations&esheet=51750223&newsitemid=20180129005994&lan=en-US&anchor=www.transcat.com%2Finvestor-relations&index=2&md5=9140aa25f3a0c7605eb494007e65e021", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.transcat.com%2Finvestor-relations&esheet=51750223&newsitemid=20180129005994&lan=en-US&anchor=www.transcat.com%2Finvestor-relations&index=4&md5=6e85e87390efab4d6d1478f06ab3f133", "http://www.businesswire.com/news/home/20180129005994/en/"], "published": "2018-01-30T00:15:00.000+02:00", "crawled": "2018-01-30T04:25:31.033+02:00", "highlightTitle": ""}