{"organizations": [], "uuid": "245d29c47a2f7a8e9ed86e2e05aed8b6ce5853e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hong-kong-stocks-strike-10-day-rising-streak-idUSZZN2N7900", "country": "US", "domain_rank": 408, "title": "Hong Kong stocks strike 10-day rising streak", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T10:31:00.000+02:00", "replies_count": 0, "uuid": "245d29c47a2f7a8e9ed86e2e05aed8b6ce5853e5"}, "author": "", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hong-kong-stocks-strike-10-day-rising-streak-idUSZZN2N7900", "ord_in_thread": 0, "title": "Hong Kong stocks strike 10-day rising streak", "locations": [], "entities": {"persons": [{"name": "reut", "sentiment": "negative"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}], "organizations": [{"name": "shanghai-hong kong stock connect", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}, {"name": "hang seng china enterprises", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI, Jan 8 (Reuters) - Hong Kong’s benchmark stock index rose for a 10th session in a row on Monday, aided by bullish sentiment in global equity markets, and inbound investment from the mainland. ** Asian shares crept toward all-time peaks on Monday after Wall Street boasted its best start to a year in over a decade, with brisk economic growth and benign inflation proving a potent cocktail for risk appetite. ** Chinese investors continued to pile into Hong Kong stocks via the Shanghai-Hong Kong Stock Connect, with nearly a quarter of the daily quotas under the scheme used up on Monday. ** At close of trade, the Hang Seng index was up 84.89 points or 0.28 percent at 30,899.53. The Hang Seng China Enterprises index rose 0.19 percent to 12,235.19. **The sub-index of the Hang Seng tracking energy shares rose 0.8 percent while the IT sector rose 0.94 percent, the financial sector was 0.2 percent lower and property sector rose 1.56 percent. ** The top gainer on Hang Seng was Country Garden Holdings Company Ltd, up 7.4 percent, while the biggest loser was AAC Technologies Holdings Inc, which fell 2.33 percent. ** China’s main Shanghai Composite index closed up 0.54 percent at 3,410.0 points while its blue-chip CSI300 index ended up 0.52 percent. ** Around the region, MSCI’s Asia ex-Japan stock index was 0.33 percent firmer. ** The yuan was Quote: d at 6.4919 per U.S. dollar at 08:12 GMT, 0.04 percent weaker than the previous close of 6.4887. ** The top gainers among H-shares were Air China Ltd up 6.57 percent, followed by China Shenhua Energy Co Ltd gaining 5.12 percent and Huatai Securities Co Ltd up by 4.5 percent. ** The three biggest H-shares percentage decliners were Zhuzhou CRRC Times Electric Co Ltd, which was down 3.29 percent, Guangzhou Automobile Group Co Ltd, which fell 2.2 percent and New China Life Insurance Co Ltd, down 1.9 percent. ** About 2.07 billion Hang Seng index shares were traded, roughly 118.2 percent of the market’s 30-day moving average of 1.75 billion shares a day. The volume traded in the previous trading session was 2.33 billion. ** At close, China’s A-shares were trading at a premium of 27.51 percent over the Hong Kong-listed H-shares. (Reporting by the Shanghai Newsroom; Editing by Sam Holmes)\n ", "external_links": [], "published": "2018-01-08T10:31:00.000+02:00", "crawled": "2018-01-08T11:02:55.011+02:00", "highlightTitle": ""}