{"organizations": [], "uuid": "790b98afe89fe01f7c239621dc974758a8289ef2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-cellcom-israel-announces-results-of-debenture-offering-in-israel.html", "country": "US", "domain_rank": 767, "title": "Cellcom Israel Announces Results of Debenture Offering in Israel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T09:29:00.000+02:00", "replies_count": 0, "uuid": "790b98afe89fe01f7c239621dc974758a8289ef2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-cellcom-israel-announces-results-of-debenture-offering-in-israel.html", "ord_in_thread": 0, "title": "Cellcom Israel Announces Results of Debenture Offering in Israel", "locations": [], "entities": {"persons": [], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "israel netanya", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "cellcom israel ltd.", "sentiment": "negative"}, {"name": "tase", "sentiment": "negative"}, {"name": "cellcom israel announces results", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NETANYA, Israel, January 24, 2018 /PRNewswire/ --\nCellcom Israel Ltd. (NYSE: CEL) (TASE: CEL) (hereinafter: the \"Company\") announced today that the public tender for its series L debentures, previously announced on January 22, 2018, have been concluded. The Company received offers for approximately NIS 1.1 billion total consideration and accepted only a portion of these offers. The final pricing information relating to the public offering is as follows:\nApproximately NIS 401 million principal amount of Series L debentures at an interest rate of 2.5% per annum, without linkage. The series will be sold at par value (NIS 1,000 per unit).\nThe total net consideration to be received by the Company is approximately NIS 396.5 million. The closing of the offering is expected to occur on January 24-25, 2018.\nThe offering described in this press release, was made in Israel to residents of Israel only. The said debentures will not be registered under the U.S. Securities Act of 1933 and will not be offered or sold in the United States . This press release shall not constitute an offer to sell or the solicitation of an offer to buy any debentures.\nAbout Cellcom Israel\nCellcom Israel Ltd., established in 1994, is the largest Israeli cellular provider; Cellcom Israel provides its approximately 2.805 million cellular subscribers (as at September 30, 2017) with a broad range of value added services including cellular telephony, roaming services for tourists in Israel and for its subscribers abroad and additional services in the areas of music, video, mobile office etc., based on Cellcom Israel's technologically advanced infrastructure. The Company operates an LTE 4 generation network and an HSPA 3.5 Generation network enabling advanced high speed broadband multimedia services, in addition to GSM/GPRS/EDGE networks. Cellcom Israel offers Israel's broadest and largest customer service infrastructure including telephone customer service centers, retail stores, and service and sale centers, distributed nationwide. Through its broad customer service network Cellcom Israel offers technical support, account information, direct to the door parcel delivery services, internet and fax services, dedicated centers for hearing impaired, etc. Cellcom Israel further provides OTT TV services, internet infrastructure and connectivity services and international calling services, as well as landline telephone communications services in Israel, in addition to data communications services. Cellcom Israel's shares are traded both on the New York Stock Exchange (CEL) and the Tel Aviv Stock Exchange (CEL). For additional information please visit the Company's website http://investors.cellcom.co.il .\nCompany Contact\nShlomi Fruhling\nChief Financial Officer\ninvestors@cellcom.co.il\nTel: +972-52-998-9735\nInvestor Relations Contact\nEhud Helft\nGK Investor & Public Relations In partnership with LHA\ncellcom@GKIR.com\nTel: +1-617-418-3096\nSOURCE Cellcom Israel Ltd.", "external_links": [], "published": "2018-01-24T09:29:00.000+02:00", "crawled": "2018-01-24T09:36:42.001+02:00", "highlightTitle": ""}