{"organizations": [], "uuid": "3cd1875cfbad0d8bca453b7346d83856e32af3a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-kennametal-names-new-business-segment-leaders.html", "country": "US", "domain_rank": 767, "title": "Kennametal Names New Business Segment Leaders", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-16T14:45:00.000+02:00", "replies_count": 0, "uuid": "3cd1875cfbad0d8bca453b7346d83856e32af3a9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-kennametal-names-new-business-segment-leaders.html", "ord_in_thread": 0, "title": "Kennametal Names New Business Segment Leaders", "locations": [], "entities": {"persons": [{"name": "ron port", "sentiment": "none"}, {"name": "pete", "sentiment": "none"}, {"name": "chris rossi", "sentiment": "none"}, {"name": "chuck", "sentiment": "none"}, {"name": "chuck byrnes", "sentiment": "none"}, {"name": "peter dragich", "sentiment": "none"}], "locations": [{"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "kmt", "sentiment": "negative"}, {"name": "kennametal", "sentiment": "negative"}, {"name": "kennametal inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH, Jan. 16, 2018 /PRNewswire/ -- Kennametal Inc. (NYSE: KMT) announced today two changes to its business segment leadership and executive management team.\nEffective January 16, 2018, Peter Dragich will become Kennametal vice president and president of the Industrial business with global responsibility for growth and modernization of the company's metalworking solutions and services.\nAt the same time, Ron Port will become Kennametal vice president and president of the Infrastructure business segment with global responsibility for the company's advanced materials, earth cutting tools, engineering components and ceramics business.\n\"These leadership changes are designed to position the company to well execute the growth, simplification and modernization plans we presented during Analyst Day in December 2017,\" said Chris Rossi, Kennametal president and CEO.\n\"I want to take this opportunity to thank Chuck Byrnes for his leadership of the Industrial business and certainly wish him well as he pursues other opportunities. Pete will continue to execute the strategies Chuck has started, while working to accelerate the execution of our modernization program. Pete's nearly 30 years of experience in supply chain, operations and cross-functional collaboration make him uniquely qualified to lead this effort. Furthermore, Ron brings 25 years of experience leading large P&L's, strategy and corporate business development. In addition, he was integral to the development of the current Infrastructure business segment strategy. Both leaders have a record of delivering results,\" he added.\nDragich has led Kennametal's Infrastructure business for the past two years, and served as the company's vice president of supply chain and logistics before that. Prior to joining Kennametal, he was vice president, global field operations, climate, controls and security for United Technologies Corporation. He also served in several manufacturing management positions at Ford Motor Company and was a Sergeant in the United States Marine Corps.\nDragich holds a master of business administration in strategy and operations from the University of Michigan and a bachelor of science in operations research and management from Case Western Reserve University.\nPort joined Kennametal in 2015 and most recently led the company's global engineered components business within the Infrastructure team. Prior to Kennametal, he led global P&L roles at Xylem, Inc. and ITT Corporation, and led strategy and business development for SPX Corp. (Flow Industrial).\nPort holds a master of business administration from University of Pittsburgh, a master of science degree in chemical engineering from Florida Institute of Technology and a bachelor of science degree in chemical engineering from University of Pittsburgh.\nDragich and Port will report directly to Kennametal President and CEO Chris Rossi.\nAbout Kennametal\nAt the forefront of advanced materials innovation for more than 75 years, Kennametal Inc. is a global industrial technology leader delivering productivity to customers through materials science, tooling and wear-resistant solutions. Customers across aerospace, earthworks, energy, general engineering and transportation turn to Kennametal to help them manufacture with precision and efficiency. Every day approximately 11,000 employees are helping customers in more than 60 countries stay competitive. Kennametal generated nearly $2.1 billion in revenues in fiscal 2017. Learn more at www.kennametal.com\nView original content: http://www.prnewswire.com/news-releases/kennametal-names-new-business-segment-leaders-300582742.html\nSOURCE Kennametal Inc.", "external_links": ["http://www.kennametal.com/", "http://www.prnewswire.com/news-releases/kennametal-names-new-business-segment-leaders-300582742.html"], "published": "2018-01-16T14:45:00.000+02:00", "crawled": "2018-01-16T17:08:07.034+02:00", "highlightTitle": ""}