{"organizations": [], "uuid": "e54849378f8774feb17b2b2e3a751bdd351f073e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-tallgrass-energy-partners-announces-crude-oil-terminal-acquisitions-and-commercial-developments-at-pony-express.html", "country": "US", "domain_rank": 767, "title": "Tallgrass Energy Partners Announces Crude Oil Terminal Acquisitions and Commercial Developments at Pony Express", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T17:00:00.000+02:00", "replies_count": 0, "uuid": "e54849378f8774feb17b2b2e3a751bdd351f073e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-tallgrass-energy-partners-announces-crude-oil-terminal-acquisitions-and-commercial-developments-at-pony-express.html", "ord_in_thread": 0, "title": "Tallgrass Energy Partners Announces Crude Oil Terminal Acquisitions and Commercial Developments at Pony Express", "locations": [], "entities": {"persons": [{"name": "david g. dehaemers jr.", "sentiment": "none"}], "locations": [{"name": "leawood", "sentiment": "none"}, {"name": "kan.", "sentiment": "none"}, {"name": "pawnee", "sentiment": "none"}, {"name": "colo.", "sentiment": "none"}], "organizations": [{"name": "pony express", "sentiment": "negative"}, {"name": "tallgrass energy partners announces crude oil terminal acquisitions", "sentiment": "negative"}, {"name": "tallgrass energy partners", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "tep", "sentiment": "negative"}, {"name": "tallgrass terminals", "sentiment": "none"}, {"name": "tallgrass energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LEAWOOD, Kan.--(BUSINESS WIRE)-- Tallgrass Energy Partners, LP (NYSE: TEP) today announced two strategic acquisitions by its Tallgrass Terminals business and several significant commercial developments that continue to expand the variety of services offered by Pony Express in key crude oil producing basins it serves.\n“Today’s announcements, along with last week’s news of the five-year contract extension with Pony Express’ largest customer, continue to solidify Pony Express’ track record as a reliable and diverse pipeline and strengthens its ability to serve crude oil markets for decades to come,” said David G. Dehaemers Jr., Tallgrass Energy President and Chief Executive Officer. \"With news of increasing crude oil production in basins Pony Express serves, we’re even more confident that utilization of our pipeline will continue to increase in the future.”\nTallgrass Terminals Strategic Acquisitions\nPawnee Terminal\nTallgrass Terminals, LLC (“Tallgrass Terminals”) has entered into an agreement to acquire a 51 percent membership interest in the Pawnee, Colo. crude oil terminal (“Pawnee Terminal”) from Zenith Energy for approximately $31 million. The Pawnee Terminal is an injection point for the Tallgrass Pony Express Northeast Colorado Lateral (“NECL”), with 300,000 barrels of storage and backed by minimum volume commitments of approximately 90,000 barrels per day. The Pawnee Terminal will provide commercial and operational synergies with Pony Express and offers the potential for incremental sourcing opportunities such as directly connecting nearby producers. Tallgrass Terminals expects the transaction to close in Q1 2018, subject to certain closing conditions.\nDeeprock Development Expansion\nIn addition, Tallgrass Terminals has acquired a 38 percent interest in Deeprock North, LLC (\"Deeprock North\"), which owns a crude oil terminal in North Cushing, Okla., immediately adjacent to the Deeprock Development, LLC (\"Deeprock Development\") crude oil terminal facility. The purchase price for the interest was $19.5 million or approximately eight times current cash flow. Immediately following the acquisition, Deeprock North was merged into Deeprock Development. After the acquisition and merger, Deeprock Development now owns a larger and more diverse terminalling complex with total storage capacity of 4.0 million barrels. Tallgrass Terminals owns approximately 60 percent of the combined entity and retains significant strategic and commercial control. Tallgrass expects the acquisition to enhance and expand Tallgrass Terminals’ commercial offerings for both Pony Express customers and other customers in Cushing.\nPony Express Commercial Updates and Developments\nSuccessful Platteville Extension Open Season\nPony Express recently concluded a successful binding open season to secure committed shipper contracts for crude oil transportation of a new common stream on the Platteville Extension. The open season resulted in additional unaffiliated third-party commitments of 10,000 barrels per day for a total of 37,500 barrels per day of short-haul and long-haul binding transportation commitments. The 55-mile Platteville Extension is approximately 60 percent complete and expected to begin operations in April 2018, with the associated Grasslands Terminal expected to be in service in Q4 2018. The initial capacity of the Platteville Extension will be approximately 40,000 barrels per day, increasing to approximately 80,000 barrels per day once the Grasslands Terminal is in service.\nRecord Volume Throughput Expected in January 2018\nIn late December 2017, Pony Express shippers nominated more than 10 million barrels, or approximately 325,000 barrels per day for movements in January 2018. If realized, this would constitute the largest per-day average during a single month in Pony Express' history. Tallgrass affiliates account for only about 5 percent of the nominated volumes.\nJanuary 2018 In-Service of Two New Refinery Connections Expected\nConstruction on the Holly Frontier El Dorado and CHS McPherson, Kan. refinery connections is complete, with line fill and commercial service expected in early January 2018 for both.\nOnce the two new refinery connections are in service, Pony Express shippers will be able to deliver more than 300,000 barrels per day to three significant refineries directly connected to Pony Express, including the currently connected refinery in Ponca City, Okla.\nNew Supply Connection\nAs previously announced, Tallgrass Terminals has a signed, 10-year take-or-pay agreement for 8,000 barrels per day from a new customer to support the construction of a terminal in the Central Kansas Uplift. Construction of the terminal is progressing on schedule, with completion and in-service expected by March 2018. Upon completion, the terminalling facilities will have delivery capabilities of approximately 20,000 barrels per day into the Pony Express mainline, providing the opportunity to accommodate incremental volumes from the Central Kansas Uplift.\nUpon completion of these projects, Pony Express will have six different supply sources and five different crude oil streams capable of being batched on the system.\n“We believe the execution of our organically developed commercial projects by Pony Express and Tallgrass Terminals and the expansion of Tallgrass Terminals’ complimentary service offerings through acquisition continue to demonstrate that Pony Express is the most attractive, diverse and capable crude oil transportation and logistics system in the regions in which it operates,” said Matt Sheehy, Tallgrass Energy Chief Commercial Officer. “Diversity of supply and delivery points, multiple batch shipment capability, readily available expansion capacity and an attractive tariff rate solidify Pony Express as a critical part of the country’s crude oil midstream infrastructure.”\nAbout Tallgrass Energy\nTallgrass Energy is a family of companies that includes publicly traded partnerships Tallgrass Energy Partners, LP (NYSE: TEP) and Tallgrass Energy GP, LP (NYSE: TEGP), and privately held Tallgrass Development, LP. Operating across 10 states, Tallgrass is a growth-oriented midstream energy operator with transportation, storage, terminal, water, gathering and processing assets that serve some of the nation’s most prolific crude oil and natural gas basins.\nTo learn more, please visit our website at www.tallgrassenergy.com .\nCautionary Note Concerning Forward-Looking Statements\nDisclosures in this press release contain forward-looking statements. All statements, other than statements of historical facts, included in this press release that address activities, events or developments that management expects, believes or anticipates will or may occur in the future are forward-looking statements. Without limiting the generality of the foregoing, forward-looking statements contained in this press release specifically include the level of future utilization of Pony Express, whether the closing of the Pawnee Terminal transaction will occur and, if it occurs, whether Pony Express will enjoy any commercial or operational synergies or additional sourcing opportunities, whether the Deeprock North acquisition and subsequent merger with Deeprock Development will expand or enhance commercial offerings for Pony Express", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tallgrassenergy.com&esheet=51736871&newsitemid=20180103005227&lan=en-US&anchor=www.tallgrassenergy.com&index=1&md5=44fd981159f793657792cc70b1294c34", "http://www.businesswire.com/news/home/20180103005227/en/"], "published": "2018-01-03T17:00:00.000+02:00", "crawled": "2018-01-03T16:29:41.011+02:00", "highlightTitle": ""}