{"organizations": [], "uuid": "43d7215177d20c72f27175a2145616e02f58cee9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-esterline-names-stephen-nolan-to-succeed-robert-george-as-the-companyas-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Esterline Names Stephen Nolan to Succeed Robert George as the Company’s Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T00:40:00.000+02:00", "replies_count": 0, "uuid": "43d7215177d20c72f27175a2145616e02f58cee9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-esterline-names-stephen-nolan-to-succeed-robert-george-as-the-companyas-chief-financial-officer.html", "ord_in_thread": 0, "title": "Esterline Names Stephen Nolan to Succeed Robert George as the Company’s Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "robert george", "sentiment": "negative"}, {"name": "stephen nolan", "sentiment": "negative"}, {"name": "curtis reusser", "sentiment": "none"}, {"name": "george", "sentiment": "none"}, {"name": "bob", "sentiment": "none"}, {"name": "stephen", "sentiment": "none"}], "locations": [{"name": "wash.", "sentiment": "none"}, {"name": "bellevue", "sentiment": "none"}], "organizations": [{"name": "esterline corporation", "sentiment": "negative"}, {"name": "company", "sentiment": "negative"}, {"name": "esterline", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "vista outdoor, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BELLEVUE, Wash., Jan. 09, 2018 (GLOBE NEWSWIRE) -- Esterline Corporation (NYSE:ESL) ( www.esterline.com ), a leading specialty manufacturer serving global aerospace and defense markets, today announced that Stephen Nolan, Chief Financial Officer for Vista Outdoor, Inc., will succeed Robert George as Esterline’s Chief Financial Officer, effective February 5, 2018. George, who has been with Esterline as Chief Financial Officer for 21 years, will remain with the company in a special advisory role to help ensure a seamless transition before retiring in June 2018.\nEsterline Corporation announces Stephen Nolan as Chief Financial Officer, effective February 5, 2018\nEsterline Chief Executive Officer Curtis Reusser said, “As a valued team member and leader, Bob helped Esterline grow into a strong, multi-billion dollar global company during his tenure. I’m pleased to congratulate him on his well-earned retirement and am grateful for his many significant contributions. We are also excited to welcome Stephen, who has extensive experience within the aerospace and defense sector, an impressive track record of strategic execution, and a history of success serving in senior financial and business management roles in global manufacturing environments. I know his expertise in financial and strategic planning, and his results-oriented business leadership will offer valuable perspective to help Esterline achieve its objectives.”\nNolan has more than 15 years of experience in operational and strategic finance, most recently serving as Chief Financial Officer for Vista Outdoor, Inc., a publicly traded manufacturer of outdoor sports and recreation products. Nolan was instrumental in the formation and spin-off of Vista Outdoor from its aerospace and defense parent company Alliant Techsystems (ATK) in 2015, as well as the related merger between ATK and Orbital Sciences to create Orbital ATK. These transactions unlocked more than $1.5 billion in shareholder value. Nolan quickly and effectively put together functional teams and financial infrastructure for Vista Outdoor, helping the company operate independently in less than a year. Prior to that, he spent nearly a decade in strategic and operational management roles with ATK, including Senior Vice President for Strategy and Business Development and several business unit leadership positions. Earlier in his career, Nolan served for five years in corporate development and strategy roles at Raytheon Company.\nNolan began his career in engineering and business consulting. He has a bachelor’s degree in engineering from Trinity College at the University of Dublin, a master’s degree in civil engineering from the University of Massachusetts Amherst, and an MBA from the Massachusetts Institute of Technology.\nAbout Esterline:\nEsterline Corporation is a leading worldwide supplier to the aerospace and defense industry specializing in three core business segments: Advanced Materials; Avionics & Controls; and Sensors & Systems. With annual sales of approximately $2 billion, Esterline employs roughly 13,000 people worldwide and is headquartered in Bellevue, Wash.\nOperations within the Advanced Materials segment focus on technologies including high-temperature-resistant materials and components used for a wide range of military and commercial aerospace purposes, and combustible ordnance and electronic warfare countermeasure products.\nOperations within the Avionics & Controls segment focus on technology interface systems for commercial and military aircraft and similar devices for land- and sea-based military vehicles, integrated cockpit systems, display technologies for avionics, training and simulation markets, secure communications systems, specialized medical equipment, and other high-end industrial applications.\nThe Sensors & Systems segment includes operations that produce high-precision temperature and pressure sensors, specialized harsh-environment connectors, electrical power distribution equipment, and other related systems principally for aerospace and defense customers.\nThis press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. These statements relate to future events or our future financial performance. In some cases, you can identify forward-looking statements by terminology such as \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"might,\" \"plan,\" \"potential,\" \"predict,\" \"should\" or \"will,\" or the negative of such terms, or other comparable terminology. These forward- only predictions based on the current intent and expectations of the management of Esterline, are not guarantees of future performance or actions, and involve risks and uncertainties that are difficult to predict and may cause Esterline's or its industry's actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Esterline's actual results and the timing and outcome of events may differ materially from those expressed in or implied by the forward-looking statements due to risks detailed in Esterline's public filings with the Securities and Exchange Commission including its most recent Annual Report on Form 10-K. Contact:\nInvestor Relations – John Hobbs\nMedia – Michelle DeGrand\n+1 425-453-9400\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/96156bbc-ec99-422d-ba55-1880abcc7df1\nSource:Esterline Technologies Corporation", "external_links": ["http://www.globenewswire.com/NewsRoom/AttachmentNg/96156bbc-ec99-422d-ba55-1880abcc7df1", "https://www.globenewswire.com/NewsRoom/AttachmentNg/96156bbc-ec99-422d-ba55-1880abcc7df1/en", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e26e85a1-adfe-428b-ab71-ef314944dbd2", "https://www.globenewswire.com/Tracker?data=ibvaEjodCrN0Chu9BET2VT7Q26UxTf8ku4oRNBCnHcT3QfpEzfR8jGQNFDA5FvMKcsRVGoNZUd3-UkceABvly7zOPvvqa4sFd8GfAYd34UGrkIakR5EYsOsNpHJHAKrf0O066sRf5rk_ovgViLMZkGx1Puw8EXxNANPjocO3X9hf2ouLiRF8m7IejZNVo1FXYbhpwcVxxro3ck_kqH-DMKJVMz8XiDKvTbzLsONUxPuhKFSZzenT4rXU-ggA_LV6SghL8oGsoWxVsiu_2mmYFg=="], "published": "2018-01-10T00:40:00.000+02:00", "crawled": "2018-01-10T02:25:00.001+02:00", "highlightTitle": ""}