{"organizations": [], "uuid": "b61c2f46a18e543df26486334d3f64eb7f71aac3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222757389&w=1200&r=LYNXMPEE0G153", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-israel-palestinians-teen/palestinian-teen-ordered-held-until-end-of-israeli-military-trial-idUKKBN1F61XY", "country": "US", "domain_rank": 408, "title": "Palestinian teen ordered held until end of Israeli military trial", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:18:00.000+02:00", "replies_count": 0, "uuid": "b61c2f46a18e543df26486334d3f64eb7f71aac3"}, "author": "", "url": "https://uk.reuters.com/article/uk-israel-palestinians-teen/palestinian-teen-ordered-held-until-end-of-israeli-military-trial-idUKKBN1F61XY", "ord_in_thread": 0, "title": "Palestinian teen ordered held until end of Israeli military trial", "locations": [], "entities": {"persons": [{"name": "al", "sentiment": "neutral"}, {"name": "tamimi", "sentiment": "none"}, {"name": "ahed tamimi", "sentiment": "none"}], "locations": [{"name": "west bank", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "sawafta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 3:23 PM / Updated 2 hours ago Palestinian teen ordered held until end of Israeli military trial Ali Sawafta 4 Min Read \nOFER PRISON, West Bank (Reuters) - A 16-year-old Palestinian girl, hailed as a hero by Palestinians for hitting and kicking Israeli soldiers outside her home, will remain in detention until the end of her trial for alleged assault, an Israeli military court ruled on Wednesday. \nAhed Tamimi was arrested after she was filmed confronting an Israeli officer and a soldier outside her home in a village in the occupied West Bank on December 15 following what Israel says was a stone-throwing assault on its troops. \nA video of the encounter showed Tamimi slapping an officer and punching a soldier next to him in the face. Both men, who were also kicked by the teenager, wore helmets and combat gear and tried to deflect her blows, but remained largely passive. \nThe soldiers had deployed during a weekly Palestinian protest in the village against Israeli policy on settlements in the West Bank, one of the most heated issues in efforts to restart Israeli-Palestinian peace talks, frozen since 2014. \nLondon-based Amnesty International noted the altercation took place on the same day Tamimi’s 15-year-old cousin was hit in the head by a rubber bullet fired by an Israeli soldier. \nRight-wing Israelis have debated whether the troops had appeared weak by opting not to strike back. The Israeli army said they acted professionally by showing restraint. \nThe case has made Tamimi into a potent symbol for Palestinians, and a commentator in the Israeli left-wing newspaper Haaretz said Israel risked turning her into the “Palestinian Joan of Arc”. Palestinian teen Ahed Tamimi enters a military courtroom at Ofer Prison, near the West Bank city of Ramallah, January 15, 2018. REUTERS/Ammar Awad \nCharges filed on Jan. 1 against Tamimi included aggravated assault, rock-throwing, incitement and participation in “violent riots”. No plea was entered at the hearing. \nTamimi’s lawyer, Gaby Lasky, said the court, convening at Israel’s Ofer prison near the Palestinian city of Ramallah, dismissed arguments that continued detention would violate Tamimi’s rights as a minor and concluded she would pose a danger if released on bail. \n“They decided the trial will begin on the thirty-first of January, but although she is only sixteen years old, the court believes that her indictment is enough to keep her in detention until the end of the trial,” the attorney told reporters. Palestinian teen Ahed Tamimi enters a military courtroom escorted by Israeli security personnel at Ofer Prison, near the West Bank city of Ramallah, January 15, 2018. REUTERS/Ammar Awad \nAn adult found guilty of assaulting a soldier could be jailed for up to 10 years, but such an outcome would be unlikely for a minor. \nCalling for Tamimi’s release, Amnesty said on Monday that nothing Tamimi had done against armed soldiers wearing protective gear “can justify the continuing detention of a 16-year-old girl”. \nTamimi, whose father is a prominent Palestinian activist, made news two years ago when she was pictured biting a soldier who tried to arrest her younger brother. \nPalestinians want the West Bank for a future state, along with East Jerusalem and the Gaza Strip. Most countries consider as illegal the Israeli settlements built in the territory which Israel captured in the 1967 Middle East war. \nIsrael disputes that its settlements are illegal and says their future should be determined in peace talks with the Palestinians. Writing by Jeffrey Heller in Jerusalem,", "external_links": [], "published": "2018-01-17T17:18:00.000+02:00", "crawled": "2018-01-17T17:46:38.016+02:00", "highlightTitle": ""}