{"organizations": [], "uuid": "74dbd64f88f815dc9ee9d2939cdaf12aeb849064", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/apple-park-photo-1-building-trees.jpg", "site_section": "http://bizdailies.com/News/Rss", "section_title": "Biz Dailies: Business and Financial News Feed", "url": "http://fortune.com/2018/01/18/apple-hq2-second-campus/", "country": "US", "domain_rank": 1196, "title": "After That Cash Windfall, Where Is Apple 's Second Campus Going? - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T20:15:00.000+02:00", "replies_count": 0, "uuid": "74dbd64f88f815dc9ee9d2939cdaf12aeb849064"}, "author": "", "url": "http://fortune.com/2018/01/18/apple-hq2-second-campus/", "ord_in_thread": 0, "title": "After That Cash Windfall, Where Is Apple 's Second Campus Going? - Fortune", "locations": [], "entities": {"persons": [{"name": "don reisinger", "sentiment": "neutral"}], "locations": [{"name": "amazon", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "apple park", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "u.s. apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Don Reisinger 1:19 PM EST \nAs Amazon closes in on the location for its second campus, currently codenamed HQ2, is Apple planning its own search for Apple HQ2? \nThe tech giant on Wednesday announced plans to invest billions of dollars in the U.S. as part of a broader effort to repatriate nearly a quarter-trillion dollars in overseas cash to the U.S. Apple also said that it will create 20,000 new jobs over the next five years. Those jobs will be created at its existing campus, as well as “a new one.” \n“The company plans to establish an Apple campus in a new location, which will initially house technical support for customers,” Apple said in the statement . “The location of this new facility will be announced later in the year.” \nApple is currently putting the finishing touches on its official headquarters, Apple Park. That facility, which houses 12,000 employees, includes the “Ring” office building in the center, along with a fitness center, restaurants, and an underground auditorium, among other buildings. It’s estimated Apple Park cost the company billions of dollars to build. \nGet Data Sheet , Fortune’s technology newsletter \nStill, if Apple (aapl) takes on 20,000 new employees in the next five years, the company will need a place to put them. And as big and expansive as Apple Park might be with its 2.8 million square feet of office space, it couldn’t accommodate all of those new hires. So Apple is now looking at building a new campus. \nThe move is all the more relevant in light of Amazon soliciting bids from North American municipalities to locate its second headquarters, Amazon HQ2. Amazon has argued that its campus will create billions of dollars in economic opportunity for the municipality it chooses and plans to make its final selection this year. \nNearly 240 cities offered bids for Amazon’s HQ2, but the company on Thursday announced that it had narrowed the list to 20 metropolitan areas , including Atlanta, New York City, and Miami. All of the cities that bid for Amazon’s HQ2 offered an array of tax breaks, perks, and other special offers to lure Amazon’s HQ2. \nNow, though, it’s Apple’s turn. But exactly how Apple will go about choosing its next campus location is unknown. \nApple only said in its statement that it will announce a new campus location later this year and didn’t say that it would publicly solicit bids like Amazon. The company also hasn’t made public how much space it needs, how big of a campus it’s planning, and what kinds (if any) economic breaks it’s seeking. \nStill, Apple’s timing is impeccable. If the company hasn’t already chosen a location for a second campus, it now knows what some of the cities that bid for Amazon’s campus were willing to offer. It’s likely Apple would get a similar, if not identical, deal. \nFor now, though, Apple is silent on its plans. And the company did not respond to a Fortune request for comment on more details surrounding its next campus pick. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-18T20:15:00.000+02:00", "crawled": "2018-01-18T21:18:57.021+02:00", "highlightTitle": ""}