{"organizations": [], "uuid": "7c222490ff86a3e9131e1181be44db31cb2963ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-hedgefunds-frase-exclusive/exclusive-ex-noble-head-frase-mulls-commodities-comeback-with-own-fund-idUSKBN1F62V7", "country": "US", "domain_rank": 408, "title": "Exclusive: Ex-Noble head Frase mulls commodities comeback with own fund", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T05:08:00.000+02:00", "replies_count": 0, "uuid": "7c222490ff86a3e9131e1181be44db31cb2963ee"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-hedgefunds-frase-exclusive/exclusive-ex-noble-head-frase-mulls-commodities-comeback-with-own-fund-idUSKBN1F62V7", "ord_in_thread": 0, "title": "Exclusive: Ex-Noble head Frase mulls commodities comeback with own fund", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Veteran oil trader Jeffrey Frase has been meeting with investors to test the waters for what he hopes will be his commodities trading comeback.\nFrase, who stepped down in November as co-chief executive officer and global head of oil liquids at struggling trader Noble Group, told Reuters in an interview on Wednesday he may launch a Houston-based commodities investment firm in the first half of the year. [nL3N1NJ3MC]\nNoble was once Asia’s biggest commodities trader, but has sold off large parts of its business amid heavy losses and high debt.\nFrase said his firm will likely use hedge-fund style trading of more liquid commodities securities, such as futures contracts linked to energy, metal and agricultural prices, using both human and automated decision-making.\nIt could also make more illiquid investments, including private equity-style bets on commodity-related businesses and trading physical commodities themselves.\nAny launch would come after a global commodities rout caused several high-profile funds to shutter or lose money in recent years.\n“The opportunity set to create value trading commodities in the next few years with everyone underestimating U.S. and global growth, not to mention inflation, appears very attractive,” Frase said.\nFrase, also a former senior oil trader and commodities executive at Goldman Sachs Group Inc and JPMorgan Chase & Co, said he is considering bringing on portfolio managers and other commodities investing veterans.\nOn Friday, longtime investor T. Boone Pickens said he had closed his Dallas-based energy hedge fund after health and financial upsets. [nL1N1P718J]\nLast year, oil trader Andy Hall closed his main Astenbeck Capital Management fund after betting on an early recovery in oil after a rout that started in late 2014.\nThe benchmark Absolute Return Commodities Index gained 2.4 percent in 2017 and has averaged an annual loss of 0.58 percent over the last six years.\nFrase has been meeting with potential investors but cautioned that nothing is set and there is not yet a name or structure for the proposed firm.\nIn the meantime, he is advising new cryptocurrency brokerage BitOoda Technologies LLC, led by former commodities broker Tim Kelly.\nFrase joined Noble in 2013 as global head of oil trading and was most recently responsible for the Americas operations of the Singapore-listed company while continuing to trade oil futures.\nNoble was damaged in 2015 by a stock research report that questioned its accounting. Noble rejected the allegations but was unable to recover investor confidence amid a downturn in commodity prices. [nL8N1P52FJ]\nFrase and William Randall were appointed co-CEOs in May 2016 after the resignation of Yusuf Alireza. [nL3N1NJ3MC]\nNoble said on Jan. 15 that it had completed the sale of its U.S. oil business that Frase had led. It is also shutting its London oil desk and winding down its Asia oil operations.\nReporting by Lawrence Delevingne, additional reporting by Catherine Ngai; Editing by Meredith Mazzilli\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T05:08:00.000+02:00", "crawled": "2018-01-18T01:05:34.034+02:00", "highlightTitle": ""}