{"organizations": [], "uuid": "f36beac200323d5b8dd0b6dbd7607533cc2f67e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-mountaingate-capital-platform-company-hs2-solutions-completes-first-add-on-acquisition.html", "country": "US", "domain_rank": 767, "title": "Mountaingate Capital Platform Company, HS2 Solutions, Completes First Add-on Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-04T19:58:00.000+02:00", "replies_count": 0, "uuid": "f36beac200323d5b8dd0b6dbd7607533cc2f67e8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-mountaingate-capital-platform-company-hs2-solutions-completes-first-add-on-acquisition.html", "ord_in_thread": 0, "title": "Mountaingate Capital Platform Company, HS2 Solutions, Completes First Add-on Acquisition", "locations": [], "entities": {"persons": [], "locations": [{"name": "america", "sentiment": "none"}], "organizations": [{"name": "mountaingate capital platform company", "sentiment": "negative"}, {"name": "careerbuilder", "sentiment": "none"}, {"name": "pbs", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "bj", "sentiment": "none"}, {"name": "caterpillar", "sentiment": "none"}, {"name": "wholesale club", "sentiment": "none"}, {"name": "google analytics certified partner", "sentiment": "none"}, {"name": "world", "sentiment": "none"}, {"name": "gnc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER--(BUSINESS WIRE)-- Digital transformation agency HS2 Solutions today announced that it has completed the acquisition of LunaMetrics, an award-winning analytics consultancy that specializes in using data to help businesses illuminate the bridge between marketing, user behavior and ROI. The acquisition brings an industry-leading digital and web analytics consulting offering to HS2’s broad range of digital transformation capabilities across strategy, development, e-commerce, experience design, and digital marketing.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180104005965/en/\nLunaMetrics serves a diverse group of leading marketers and brands including BJ’s Wholesale Club, CareerBuilder, Caterpillar, GNC, Leading Hotels of the World, PBS, and Teach for America, and is a Google Analytics Certified Partner and Google Premier Partner. LunaMetrics leverages insights and deep digital expertise to help clients personalize and improve digital experiences as well as optimize their digital advertising strategy.\n“LunaMetrics has been on the leading edge of digital analytics for over a decade, and founder and CEO Robbin Steif has built a world-class, results-driven team that bolsters our talent base and strengthens our digital marketing strategy and analytics and insights practices tremendously,” said Phil Hollyer, HS2 Solutions co-founder and CEO.\nWith the addition of LunaMetrics, HS2 Solutions, which was founded and is headquartered in Chicago, also expands its physical presence. In addition to its two Chicago-based collaboration centers and team hubs in Green Bay and Detroit, HS2 Solutions now has a stronghold in Pittsburgh and access to talent in the city’s vibrant tech community.\n“HS2 Solutions has an unmatched reputation in our industry,” Steif said. “With their seasoned team, they have amassed an exceptional portfolio of long-term client partnerships and sophisticated digital service offerings. By combining forces, we are able to expand our offerings to our customers and create additional career opportunities for our people.”\nSteif founded LunaMetrics in 2004, has served on the Board of Directors for the Digital Analytics Association, is a winner of the Business Women First award, and is a recipient of the Diamond Award for business leadership.\n“This dynamic partnership strengthens our ability to glean rich user behavior insights that will allow us to envision and build superior digital experiences that delight customers and deliver business results to our clients,” said HS2 Solutions co-founder and president Keith Schwartz. “We are thrilled to welcome the entire LunaMetrics team to HS2 Solutions.”\nIn November 2016, HS2 Solutions announced that it was being backed by Mountaingate Capital, a leading middle-market private equity investment firm, to accelerate continued growth through business acquisitions, talent additions, national expansion, and increased services.\nAbout HS2 Solutions\nHS2 Solutions is a full-service digital transformation agency that creates digital brand experiences that transform behavior and drive results. HS2 Solutions has capabilities within five primary service lines including strategy; digital experience platforms (eCommerce, web, and mobile development); experience design; digital marketing and audience management; and analytics and insights. HS2 Solutions prides itself on forming problem-solving partnerships with their clients to envision, design, and build their digital futures. For more information, please visit www.hs2solutions.com .\nAbout LunaMetrics\nLunaMetrics is a leading analytics and digital marketing strategy consultancy. In addition to being a Google Analytics Certified Sales and Support Partner, they offer a number of customer-tailored services, including data science solutions, digital advertising strategy, conversion rate optimization, and nation-wide public training sessions and workshops on a variety of Google products for different skill levels. LunaMetrics works closely with their clients to evaluate their mountains of data to make smart decisions. For more information, please visit www.lunametrics.com .\nAbout Mountaingate Capital\nMountaingate Capital is a private equity firm based in Denver that specializes in building and empowering lower middle market companies with strong growth potential and engaged leadership teams. The firm was launched by a team of partners with deep investment expertise in four distinct market sectors: marketing services, business/industrial services, specialty distribution and specialty manufacturing, including medical devices. Mountaingate’s focus on organic growth coupled with its proven customer-centric buy-and-build approach for add-on acquisitions and shared equity ownership with management creates more value for the end customer, while forging stronger, more collaborative, and more successful investment partnerships with management teams. In 2017, Mountaingate announced the close of its first fund with $395 million in capital commitments. Mountaingate targets investments in new platform companies typically with $5 million to $25 million of EBITDA. For more information on Mountaingate, please visit http://mountaingatecap.com/ .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005965/en/\nMountaingate Capital\nColton King, 303-390-5001\nManaging Director\nSource: Mountaingate Capital", "external_links": ["http://www.businesswire.com/news/home/20180104005965/en/", "http://mountaingatecap.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lunametrics.com&esheet=51737967&newsitemid=20180104005965&lan=en-US&anchor=www.lunametrics.com&index=2&md5=8f5522454009a33fc9796a7cb13e32a2", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.hs2solutions.com&esheet=51737967&newsitemid=20180104005965&lan=en-US&anchor=www.hs2solutions.com&index=1&md5=bcdc6c3638c8395bbad0e5f4bc523eb4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fmountaingatecap.com%2F&esheet=51737967&newsitemid=20180104005965&lan=en-US&anchor=http%3A%2F%2Fmountaingatecap.com%2F&index=3&md5=c74da27a29a7de5968d8ff609a1fb731"], "published": "2018-01-04T19:58:00.000+02:00", "crawled": "2018-01-04T20:31:52.074+02:00", "highlightTitle": ""}