{"organizations": [], "uuid": "2e24cd916864184a455b54bd2b537bcb8892a5dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-nevro-receives-fda-approval-for-senza-iia-spinal-cord-stimulation-system-delivering-hf10a-therapy.html", "country": "US", "domain_rank": 767, "title": "Nevro Receives FDA Approval for Senza II™ Spinal Cord Stimulation System Delivering HF10™ Therapy", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "2e24cd916864184a455b54bd2b537bcb8892a5dc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-nevro-receives-fda-approval-for-senza-iia-spinal-cord-stimulation-system-delivering-hf10a-therapy.html", "ord_in_thread": 0, "title": "Nevro Receives FDA Approval for Senza II™ Spinal Cord Stimulation System Delivering HF10™ Therapy", "locations": [], "entities": {"persons": [{"name": "tom simopoulos", "sentiment": "none"}], "locations": [{"name": "redwood city", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "nevro corp.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "spine center", "sentiment": "none"}, {"name": "scs", "sentiment": "none"}, {"name": "beth israel deaconess medical center", "sentiment": "none"}, {"name": "harvard medical school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "REDWOOD CITY, Calif., Jan. 8, 2018 /PRNewswire/ -- Nevro Corp. (NYSE:NVRO), a global medical device company that is providing innovative evidence-based solutions for the treatment of chronic pain, today announced that it has received FDA approval for its next-generation Senza II Spinal Cord Stimulation (SCS) System delivering HF10 therapy. The Senza II system offers the superior outcomes and clinical advantages of HF10 therapy through a smaller and more refined footprint while maintaining the performance and durability of the current Implantable Pulse Generator (IPG).\n\"My colleagues and I are excited about the approval of the Senza II SCS system,\" said Dr. Tom Simopoulos, Director of Pain Medicine and Co-Director of the Spine Center at the Beth Israel Deaconess Medical Center (an affiliate of the Harvard Medical School) in Boston, MA. \"The reduced size and optimized design of the Senza II IPG allow for greater patient comfort and placement options. Most importantly, it delivers HF10 therapy, a non-opioid treatment option that provides profound and paresthesia-free pain relief for patients.\"\n\"We are pleased to have received FDA approval for Senza II so quickly after our recent CE Mark clearance. Senza II is a step forward that represents our company's commitment to continuously advancing our product portfolio,\" said Rami Elghandour, President and CEO of Nevro. \"The smaller, refined footprint delivers the unparalleled performance of our current Senza system and is backed by the same best-in-class clinical evidence that you've come to expect from Nevro and HF10. The initial product feedback from our European customers has been excellent, and we look forward to launching Senza II in the United States.\"\nAbout the Senza II System and HF10 Therapy\nThe Senza II system delivers Nevro's proprietary HF10 therapy, an SCS therapy that provides electrical pulses to the spinal cord to alleviate pain. The electrical pulses are delivered by small electrodes on leads that are placed near the spinal cord and are connected to a compact, battery-powered generator implanted under the skin. HF10 therapy is the only SCS therapy indicated to provide pain relief without paresthesia (a stimulation-induced sensation, such as tingling or buzzing, which is the basis of traditional SCS) and is also the first SCS therapy to demonstrate superiority to traditional SCS for back and leg pain in a comparative pivotal study. Nevro's innovations in SCS, including the Senza® and Senza II™ systems and HF10™ therapy, are covered by more than 140 issued U.S. and international patents.\nAbout Nevro\nHeadquartered in Redwood City, California, Nevro is a global medical device company focused on providing innovative products that improve the quality of life of patients suffering from debilitating chronic pain. Nevro has developed and commercialized the SENZA® spinal cord stimulation (SCS) system, an evidence-based, non-pharmacologic neuromodulation platform for the treatment of chronic pain. The SENZA® system is the only SCS system that delivers Nevro's proprietary HF10™ therapy. Senza, Senza II, HF10, Nevro and the Nevro logo are trademarks of Nevro.\nInvestor Relations Contact:\nNevro Investor Relations\nKatherine Bock\n(650) 433-3247\nir@nevro.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/nevro-receives-fda-approval-for-senza-ii-spinal-cord-stimulation-system-delivering-hf10-therapy-300578766.html\nSOURCE Nevro Corp.", "external_links": ["http://www.prnewswire.com/news-releases/nevro-receives-fda-approval-for-senza-ii-spinal-cord-stimulation-system-delivering-hf10-therapy-300578766.html"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:11:58.078+02:00", "highlightTitle": ""}