{"organizations": [], "uuid": "802028093144d26a4669d354b39fbbc50e39ca69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/siesta-beach-florida.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/us-travel-industry-foreign-tourism/", "country": "US", "domain_rank": 1196, "title": "U.S. Travel Industry Unites to Fight Decline in Foreign Tourism | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.74, "site_type": "news", "published": "2018-01-17T02:00:00.000+02:00", "replies_count": 0, "uuid": "802028093144d26a4669d354b39fbbc50e39ca69"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/17/us-travel-industry-foreign-tourism/", "ord_in_thread": 0, "title": "U.S. Travel Industry Unites to Fight Decline in Foreign Tourism | Fortune", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}], "organizations": [{"name": "u.s. travel industry unites", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "u.s. coalition", "sentiment": "none"}, {"name": "national restaurant association", "sentiment": "none"}, {"name": "u.s. chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg January 17, 2018 \nAs more international travelers decide to skip the United States, 10 business associations, including the U.S. Chamber of Commerce and the National Restaurant Association, have created a travel industry group aimed at reversing the growing unpopularity of the U.S. as a vacation destination. \nHistorically, the U.S. had only to sit back and let foreign tourists and their money roll in. Over the past few years, though, that gravy train has begun to dry up, a trend that accelerated as President Donald Trump began to make good on campaign promises to restrict immigration. As a result, businesses that make up the multibillion-dollar industry relying on that revenue have grown increasingly nervous. \nSo on Tuesday, some of its biggest players unveiled the “Visit U.S. Coalition” to spur the Trump administration into enacting friendlier visa and border-security policies at a time when federal agencies are doing the opposite. \nSince 2015, the U.S. and Turkey have been the only places among the top dozen global travel destinations to experience a decline in inbound visitors, a time when other nations such as Australia, Canada, China and the United Kingdom have marked sizable gains. A strong U.S. dollar has also contributed to this dynamic. \nLast week, the Commerce Department reported a 3.3 percent drop in traveler spending for last year, through November, the equivalent of $4.6 billion in losses and 40,000 jobs. The U.S. share of international long-haul travel fell to 11.9 percent last year, from 13.6 percent in 2015, according to the U.S. Travel Association, a slippage the group said equates to 7.4 million visitors and $32.2 billion in spending. (The average “long-haul” visitor to the states spends 18 nights and $4,400, according to U.S. Travel.) \n“America isn’t winning when we’re falling behind our global competitors,” Roger Dow, U.S. Travel’s president, said on a conference call to announce the new organization. He added that the group sees its initiative as complementary to increased border and travel security. “Our goal is to make America the most secure and the most visited country on Earth—and we can do both.” \nIndustry groups weren’t silent as America’s desirability among travelers began to decline, but the coalition represents a new determination to reverse the trend. The inclusion of broader business lobbies is “an attempt to graduate to a new level of urgency” for policymakers to arrest the problem, said Jonathan Grella, a U.S. Travel vice president. The coalition plans to present specific policy changes to the administration, including efforts to speed visa processing times, that it expects will help boost tourism. Representatives of the State Department’s Consular Affairs Bureau and the Commerce Department didn’t return requests for comment. \nCoalition organizers said the U.S. remains a vital draw for foreign travelers and that only modest policy changes would be required. As an example, they noted how the U.S. successfully corrected a steep decline of inbound travel in the decade following the 2001 terrorist attacks. \nBut in the past year, the U.S. travel industry has grappled with an administration that made border security and tougher immigration laws its signature policies. One of Trump’s first initiatives was to ban travelers from seven nations with Muslim-majority populations, a move that ran into judicial roadblocks until it was revised. \nThe 10 groups in the Visit U.S. Coalition are: American Gaming Association, American Hotel & Lodging Association; American Society of Association Executives; Asian American Hotel Owners Association; International Association of Exhibitions and Events; National Restaurant Association; National Retail Federation; Society of Independent Show Organizers; U.S. Chamber of Commerce; and U.S. Travel Association. \nLast week, the coalition’s mission was made significantly harder. Trump’s reported vulgarity with regard to Haiti, El Salvador and African countries earned him international condemnation. “It isn’t so much about the offending comment as the distraction that the incident creates,” Grella said of the continuing fallout. “Every minute we’ve spent talking about [Trump’s] comment is time we’re not talking about visa policy.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T02:00:00.000+02:00", "crawled": "2018-01-18T02:38:27.018+02:00", "highlightTitle": ""}