{"organizations": [], "uuid": "171d4c457bf710f4ef39f432b00c9530099914dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-api-president-and-ceo-jack-gerard-to-depart-in-august.html", "country": "US", "domain_rank": 767, "title": "API President and CEO Jack Gerard to Depart in August", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-17T18:15:00.000+02:00", "replies_count": 0, "uuid": "171d4c457bf710f4ef39f432b00c9530099914dc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-api-president-and-ceo-jack-gerard-to-depart-in-august.html", "ord_in_thread": 0, "title": "API President and CEO Jack Gerard to Depart in August", "locations": [], "entities": {"persons": [{"name": "jack gerard", "sentiment": "negative"}, {"name": "gerard", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "api", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 17, 2018 /PRNewswire-USNewswire/ -- After 10 years running one of Washington's most influential associations covering all aspects of the oil and natural gas sector, API President and CEO Jack Gerard announced he will not make another long-term commitment to API and will step down when his current contract ends in August 2018. Until then, he will continue to direct the association's work and assist in the search for a new CEO.\n\"Serving the oil and natural gas industry during this historic time, when an American energy renaissance has made the U.S. the world's leading producer and refiner of oil and natural gas, has been among the most fulfilling professional experiences of my career,\" said Gerard. \"We have accomplished what few would have imagined: important public policy victories at all levels of government, and a revitalized association that has expanded globally and added significant strength to its advocacy capabilities. I have served for 10 years at API, which is the longest tenure of my career. I'm ready for my next challenge and want to ensure that API will have time for an orderly transition to plan for its next decade.\"\nSince Gerard joined API in 2008, association membership grew by almost 50 percent and added members from every sector of the industry. The organization tripled its growth in global markets where it promotes safety through standard setting and best practices, including expansions to Singapore, Dubai and Rio de Janeiro, and the industry's public policy influence improved dramatically at the local, state and federal level. During his tenure, Gerard built an effective grassroots network comprised of 45 million voters with representation in every congressional district who communicate with their elected officials on energy issues.\n\"Jack has been an extraordinary leader for the oil and natural gas industry during a time of challenge and opportunity,\" said API Chairman and ExxonMobil CEO Darren Woods. \"He has unified our industry, expanded our global reach, heightened our effectiveness, and navigated a number of significant public policy challenges to a successful conclusion, including: the end of the crude oil export ban; the preservation of a pro-development and refining tax and regulatory framework; and the creation of a Center for Offshore Safety, dedicated to safety in offshore operations. Jack has built a solid foundation from which we will continue to grow. We will miss Jack tremendously because of his significant accomplishments over the years. Our focus will now be on the search for a successor who will build on Jack's achievements.\"\nGerard joined API after serving as president and CEO of two large trade associations – the National Mining Association and the American Chemistry Council. He worked for almost a decade in the U.S. Senate and House. He is active in several civic organizations, including as an Advisory Board member and past chairman of the National Area Council of the Boys Scouts of America, a board member and former co-chair of The George Washington University's Graduate School of Political Management, and chairman of the board of directors for the Congressional Coalition on Adoption Institute.\nAPI is the only national trade association representing all facets of the oil and natural gas industry, which supports 10.3 million U.S. jobs and nearly 8 percent of the U.S. economy. API's more than 625 members include large integrated companies, as well as exploration and production, refining, marketing, pipeline, and marine businesses, and service and supply firms. They provide most of the nation's energy and are backed by a growing grassroots movement of more than 45 million Americans.\nView original content with multimedia: http://www.prnewswire.com/news-releases/api-president-and-ceo-jack-gerard-to-depart-in-august-300583926.html\nSOURCE American Petroleum Institute", "external_links": ["http://www.prnewswire.com/news-releases/api-president-and-ceo-jack-gerard-to-depart-in-august-300583926.html"], "published": "2018-01-17T18:15:00.000+02:00", "crawled": "2018-01-17T19:19:19.040+02:00", "highlightTitle": ""}