{"organizations": [], "uuid": "e603f5129d853ea1e047d72d286780dacc1de11f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/05/14/102679174-550996823.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/vegas-strip-casinos-see-gambling-revenues-dip-for-third-month-straight.html", "country": "US", "domain_rank": 767, "title": "Vegas Strip casinos see gambling revenues dip for third month straight", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.051, "site_type": "news", "published": "2018-01-31T23:49:00.000+02:00", "replies_count": 0, "uuid": "e603f5129d853ea1e047d72d286780dacc1de11f"}, "author": "Jeff Daniels", "url": "https://www.cnbc.com/2018/01/31/vegas-strip-casinos-see-gambling-revenues-dip-for-third-month-straight.html", "ord_in_thread": 0, "title": "Vegas Strip casinos see gambling revenues dip for third month straight", "locations": [], "entities": {"persons": [{"name": "vega", "sentiment": "negative"}, {"name": "wall stre", "sentiment": "none"}, {"name": "tanner", "sentiment": "none"}], "locations": [{"name": "las vegas strip", "sentiment": "none"}, {"name": "vegas strip", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "macau", "sentiment": "none"}, {"name": "caesars palace", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "nevada gaming control board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Casinos and Gaming Las Vegas Strip casinos see gambling revenues drop for three months straight Vegas Strip casinos saw gam bling revenue fall 3.2 percent in December from a year ago, according to Nevada's gaming regulator . Baccarat revenue declined in December by nearly 30 percent compared with a year ago. Analysts suggest the big drop in baccarat may be due to fewer high rollers from Asia and competition from the Macau market. All three of the major Las Vegas-based casinos were lower in stock trading Wednesday. Published 4:49 PM ET Wed, 31 Jan 2018 CNBC.com Tanner | Ullstein Bild | Getty Images The casino floor at Caesars Palace, Las Vegas. \nCasinos on the Las Vegas Strip have seen their gaming revenue drop now for three consecutive months, according to data released Wednesday by the Nevada Gaming Control Board. \nThe gaming regulator said the casinos on the Strip won about $571.5 million from gamblers in December 2017, a decline of 3.2 percent compared with the previous year. It followed monthly gaming revenue declines of more than 6 percent during October and November. \nWall Street analysts suggest the big drop maybe due to fewer high rollers from Asia and competition from the Macau market as the game of baccarat is considered especially popular with international gamblers. \n\"I am a little surprised with the quickness of the deceleration in the Las Vegas Strip,\" said Tuna Amobi, an analyst at CFRA Research. \"It's coming at a point when the Chinese territory of Macau is enjoying a rebound.\" \nMichael Lawton, senior research analyst at the NGCB, said the last time there was a three-month consecutive decline in the Strip gaming revenues was in the March to May 2016 period. \"We had a month where baccarat really kind of drove the numbers for the Strip down,\" said Lawton. \"Without baccarat, the Strip's win [in December] would have been up 7.5 percent, or $31.5 million.\" \nBaccarat revenue declined in December by nearly 30 percent compared with a year ago. \nAmobi said the decline in gaming revenue on the Strip comes as revenue per available room (or RevPAR) — a key metric used by the hotel industry — is also showing weakness in Las Vegas. \"It's now in the very low single digits and actually deepening to negative territory,\" he said. \nStill, Amobi said the convention business on the Las Vegas Strip has been holding up well despite softness in other areas. \n\"What happens is that convention business has been doing a lot of the heavy lifting for companies like Las Vegas Sands and Wynn Resorts, etc. because that market I think probably has a much longer cycle,\" he said. \nDespite the slowdown on the Vegas Strip, the downtown Las Vegas and north Las Vegas casinos as a group generated double-digit percentage increases in gaming revenue in December compared with a year ago. Also, the Reno, Nevada, casinos experienced a 10 percent increase in gaming revenue for the month. \nStatewide, Nevada casinos reported a total \"gaming win\" of $960.4 million in December, or an increase of less than 1 percent compared with a year ago. That represented a slight slowdown from a 2.3 percent increase in November. \nAll three of the major Las Vegas-based resort casinos were lower in Wednesday trading. Wynn Resorts fell 3.4 percent, MGM Resorts dipped nearly 2 percent and Las Vegas Sands slipped just more than 1 percent. The three companies also have significant investments in Macau, the world's largest gambling mecca. \nWednesday's weakness in casino stocks also follows the report Friday by The Wall Street Journal about a possible \"pattern of sexual misconduct\" by Wynn Resorts Chairman and CEO Steve Wynn . The casino mogul has denied the allegations but a special committee of Wynn Resorts' board is investigating the alleged misconduct and regulators in Nevada and several other markets where Wynn operates also have opened their own probes. \nWynn Resorts stock remains down more than 16 percent since the Journal report. Steve Wynn owns about 12 percent of the company's stock. \n\"There are still some investigations going on in Boston, in Las Vegas and in Macau — so all of those things are overhang on Wynn Resorts stock,\" said Amobi. \nEven so, the analyst said CFRA still has a buy investment rating on Wynn Resorts because investor reaction \"may be a little overdone, although not to minimize the seriousness of the allegations.\" \nAlso, Amobi said fundamentals of the company \"could trump the concerns\" and points out that Wynn Resorts gets more than 70 percent of its operating cash flow from the Macau market. \nMeantime, Macau's gaming regulator is expected to release January gross gaming revenue for its gambling market as early as Thursday. Analysts are looking for revenue to increase 21.1 percent. ", "external_links": [], "published": "2018-01-31T23:49:00.000+02:00", "crawled": "2018-01-31T23:49:07.007+02:00", "highlightTitle": ""}