{"organizations": [], "uuid": "d7dc418413f79417b90634342dff9fdef512d7de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000238/device/rss", "section_title": "Mark Zuckerberg", "url": "https://www.cnbc.com/2018/01/23/reuters-america-update-2-u-s-democrats-urge-social-media-firms-to-investigate-russia-linked-accounts.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-U.S. Democrats urge social media firms to investigate Russia-linked accounts", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T22:35:00.000+02:00", "replies_count": 0, "uuid": "d7dc418413f79417b90634342dff9fdef512d7de"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/reuters-america-update-2-u-s-democrats-urge-social-media-firms-to-investigate-russia-linked-accounts.html", "ord_in_thread": 0, "title": "UPDATE 2-U.S. Democrats urge social media firms to investigate Russia-linked accounts", "locations": [], "entities": {"persons": [{"name": "nunes", "sentiment": "negative"}, {"name": "dianne feinstein", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "devin nunes", "sentiment": "none"}, {"name": "adam schiff", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "facebook inc", "sentiment": "none"}, {"name": "senate intelligence committee", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "house intelligence committee", "sentiment": "none"}, {"name": "u.s. justice department", "sentiment": "none"}, {"name": "house intelligence", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "twitter inc", "sentiment": "none"}, {"name": "senate judiciary", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "accounts@ (Adds comment from Twitter, Facebook and Nunes spokesman)\nWASHINGTON, Jan 23 (Reuters) - Senior congressional Democrats urged social media companies to investigate accounts reportedly linked to a Russian influence operation on Tuesday, after claims they may have been used to help promote criticism of the U.S. Justice Department and the probe of President Donald Trump's ties with Moscow.\nAmid growing partisan rancor over the probes into Russian meddling in the 2016 U.S. presidential election, Senator Dianne Feinstein, a senior member of the Senate Intelligence Committee and ranking Democrat on Senate Judiciary, and Representative Adam Schiff, ranking Democrat on House Intelligence, wrote to Twitter Inc and Facebook Inc, requesting an \"in-depth forensic examination.\"\nRepublicans have been calling for the release of a classified memorandum commissioned by the House Intelligence committee's Republican chairman, Devin Nunes, which they say shows anti-Trump bias at the Justice Department, backed by a social media campaign with the hashtag #ReleasetheMemo.\nDemocrats have criticized the memo as a \"misleading set of talking points.\"\nLast week, the Alliance for Securing Democracy, a project of the nonpartisan German Marshall Fund, said Kremlin-controlled accounts were put into action as part of an expanded social media influence campaign to amplify demands for release of the secret memo.\nFeinstein and Schiff's committees - along with special counsel Mueller - are investigating whether Russia sought to influence the 2016 election and allegations of collusion between Trump's campaign and Moscow.\nMoscow denies seeking to influence the election, and Trump denies collusion.\n\"If these reports are accurate, we are witnessing an ongoing attack by the Russian government through Kremlin-linked social media actors directly acting to intervene and influence our democratic process,\" Feinstein and Schiff wrote to Twitter Chief Executive Jack Dorsey and Facebook CEO Mark Zuckerberg.\nThe lawmakers asked for a public report to Congress and the public by Jan. 26, and immediate steps to deactivate such accounts.\nA Facebook spokesman said the company received the letter and was reviewing it. A Twitter spokeswoman said the company takes assertions of malicious activities seriously and looked forward to working closely with the lawmakers to address their concerns.\nNunes spokesman Jack Langer said priorities \"are out of whack\" when Democrats ask for the investigation \"of a hashtag,\" but not the loss of Federal Bureau of Investigation evidence about text messages.\nIn another partisan dispute related to the Russia investigation, Republican Senator Ron Johnson released a letter this week saying the FBI did not keep text messages from officials involved in investigations of Trump and his Democratic 2016 opponent, Hillary Clinton, for six months ending in May 2017.\nTrump tweeted about the texts on Tuesday. (Reporting by Patricia Zengerle; editing by Bernadette Baum and Tom Brown)", "external_links": [], "published": "2018-01-23T22:35:00.000+02:00", "crawled": "2018-01-24T02:42:25.000+02:00", "highlightTitle": ""}