{"organizations": [], "uuid": "12a841e7bd5156a0cdf28ff158cbcd2d3ca87548", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-will-packer-media-acquires-popular-womenas-digital-destination-xonecole.html", "country": "US", "domain_rank": 767, "title": "Will Packer Media Acquires Popular Women’s Digital Destination xoNecole", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.534, "site_type": "news", "published": "2018-01-18T18:15:00.000+02:00", "replies_count": 0, "uuid": "12a841e7bd5156a0cdf28ff158cbcd2d3ca87548"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-will-packer-media-acquires-popular-womenas-digital-destination-xonecole.html", "ord_in_thread": 0, "title": "Will Packer Media Acquires Popular Women’s Digital Destination xoNecole", "locations": [], "entities": {"persons": [{"name": "necole kane", "sentiment": "none"}, {"name": "kane", "sentiment": "none"}], "locations": [], "organizations": [{"name": "los angeles & new york & atlanta", "sentiment": "none"}, {"name": "packer media", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Millennial lifestyle site is media company’s first owned and operated digital platform, complementing existing strength in TV, digital and branded content production\nLOS ANGELES & NEW YORK & ATLANTA--(BUSINESS WIRE)-- Will Packer Media announced today the acquisition of xoNecole , a lifestyle site created by, and for, urban millennial women. The deal expands WPM’s media footprint with xoNecole becoming the company’s first owned and operated digital platform and complementing its existing strength in TV, digital and branded content production. WPM will implement an accelerated growth strategy for the cross-platform brand, expanding its video, social and mobile offerings, and building a branded newsletter and multi-faceted event series to further connect with its audience.\nFounded by blogger Necole Kane, xoNecole’s mission is to promote positive images of women of color, as well as empower, educate and inspire millennials through interviews, beauty, fashion, lifestyle, career and travel features. Kane’s initial gossip site, NecoleBitchie.com , launched in 2008. The site rebranded in 2015 to focus on universal themes important to young women.\n“Necole is amazingly gifted in her ability to connect with women and deliver much needed engaging, smart and empowering content that is aspirational and impactful,” said Will Packer, CEO and founder, Will Packer Media. “We are thrilled to join forces with Necole and look forward to working together to broaden the offerings and reach of xoNecole as we continue to build it into a top lifestyle brand.”\nAiming squarely at the mainstream women’s editorial space, xoNecole will continue to be led by Kane, in addition to Will Packer Media co-founder and COO Alix Baudin, formerly SVP and GM of Scripps Networks Interactive, who will leverage his expertise building and developing digital products to propel the platform forward.\n“When I closed down my celebrity gossip blog in 2015, it was at the height of its success. Although it was a very risky and terrifying move, I knew I wanted to offer my readers content that was more empowering and purposeful, would inspire them to live their best lives, and was deeply rooted in giving women permission to evolve,” said Kane. “Will Packer is someone I've always admired and respected, and he knows my audience. I couldn't think of a better partnership. The acquisition has been a dream come true and I will now be able to see the xoNecole brand grow into the incredible platform I've always visualized it could be.”\n“We see Necole as the face of a young and empowered generation of women who want to lift each other up and be inspired to evolve,” said Baudin. “We will build the platform to include a robust series of events, including tentpole activations during Fashion Week and other cultural landmarks, as well as educational and networking events, bringing the xoNecole experience offline and into real life. Our content studio will build multiple video properties as well, looking at inspirational true stories, career and life advice, and exclusive interviews with notable celebrities and personalities.”\nIn addition to traditional ad sales, xoNecole will be supported by content marketing and branded entertainment partnerships, as well as event revenues.\nLaunched in 2017 by Hollywood producer Will Packer, in partnership with Discovery Communications and Universal Pictures, Will Packer Media is a first-of-its-kind production and branded content company focused on the New American Mainstream of young and urban millennials. The company currently has 15 projects in development across 10 networks and platforms.\nPacker’s films have earned more than $1 billion, and include blockbusters like Ride Along and Think Like a Man franchises, Stomp the Yard and Girls Trip, the highest grossing live action comedy in 2017. He served as an executive producer on the $203 million-grossing Straight Outta Compton. In television, he was an executive producer of the Emmy-nominated remake of “Roots,” and is an executive producer on the BET series “Being Mary Jane,” starring Gabrielle Union.\nAbout Will Packer Media\nLed by Hollywood producer Will Packer, Will Packer Media is a first-of-its-kind production and branded content company focused on the New American Mainstream audience, with an urban millennial core. In partnership with Discovery Communications and Universal Pictures, the company produces episodic scripted and unscripted series across television and digital platforms, compelling content for brand clients, and short-form digital content for millennial audiences. Will Packer’s films have earned more than $1 billion, with nine opening at number one at the box office.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005875/en/\nHarmonica / Will Packer Media\nPeter Epstein or Kelly Vogt Campbell\n+1 323-251-3567 or +1 310-927-4537\npeter@harmonica.co or kelly@harmonica.co\nSource: Will Packer Media", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.xonecole.com%2F&esheet=51745047&newsitemid=20180118005875&lan=en-US&anchor=xoNecole&index=1&md5=0cf16d37a492ec537968037bb237dd14", "http://www.businesswire.com/news/home/20180118005875/en/"], "published": "2018-01-18T18:15:00.000+02:00", "crawled": "2018-01-18T19:58:36.000+02:00", "highlightTitle": ""}