{"organizations": [], "uuid": "b9c974f8ada6d69415ea03884ad728f0c02a12eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104923442-GettyImages-899547558.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/02/us-stock-futures-data-dow-tax-politics-on-the-agenda.html", "country": "US", "domain_rank": 767, "title": "US stock futures: data, Dow, tax, politics on the agenda", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-02T13:39:00.000+02:00", "replies_count": 0, "uuid": "b9c974f8ada6d69415ea03884ad728f0c02a12eb"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/02/us-stock-futures-data-dow-tax-politics-on-the-agenda.html", "ord_in_thread": 0, "title": "US stock futures: data, Dow, tax, politics on the agenda", "locations": [], "entities": {"persons": [{"name": "michael nagle", "sentiment": "none"}, {"name": "kim jong-un", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "the u.s.", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. stocks kicked off the new year on a high note on Tuesday as Wall Street bet on another strong year for equities.\nThe S&P 500 gained 0.8 percent to close at 2,695.79, notching intraday and closing records, with consumer discretionary, energy materials and tech all rising more than 1 percent.\nThe Nasdaq composite advanced 1.5 percent to 7,006.90, also hitting record highs. The index also closed above 7,000 for the first time.\nThe Dow Jones industrial average rose 104.79 points to finish at 24,824.01, with Disney shares climbing 4 percent.\n\"This is basically an extension of what we saw in 2017,\" said Peter Cardillo, chief market economist at First Standard Financial. \"With economic data being strong, investors are betting that economic growth will translate into strong earnings growth.\"\nEquities had a banner year in 2017, with the three major indexes notching all-time highs. The S&P 500, Dow and Nasdaq gained 19.4 percent, 25.1 percent and 28.2 percent, respectively.\nStocks got a boost last year from strong growth in corporate earnings, solid economic data and as expectations of lower corporate taxes.\nLast month, President Donald Trump signed a bill that slashed the corporate tax rate in the U.S. to 21 percent from 35 percent. Several companies announced they were giving bonuses to their employees after Trump signed the bill .\nTrump tweeted on Tuesday: \"Companies are giving big bonuses to their workers because of the Tax Cut Bill. Really great!\"\nTweet\nA good start to the year is usually followed by strong yearly performances, according to Ryan Detrick, senior market strategist at LPL Financial.\nIn a tweet Monday, he said the S&P 500 has averaged a full-year return of 14.2 percent over the past 20 years when the index ends the first day of the year higher.\nDetrick tweet\nEquities rose broadly in the U.S. on Tuesday, but their European counterparts lagged. The Stoxx 600 index — which tracks a broad swath of European stocks — declined 0.2 percent.\nDisney 's stock rose after Macquarie upgraded it to outperform from neutral, pointing out the company's \"distribution leverage and optionality, concentration of valuable IP, which will only grow with the Fox acquisition, and continued theatrical momentum.\"\nDisney's \"Star Wars: The Last Jedi\" remained atop the weekend box office, raking in $68.4 million in North American ticket sales.\nMeanwhile, shares of Target rose 3.6 percent after Loup Ventures analyst Gene Munster predicted the retailer will be bought by Amazon .\nOn the data front, the IHS Markit manufacturing PMI rose to 55.1 in December, marking the strongest growth in the sector since March 2015 .\nInvestors also looked ahead to the release of the December jobs report on Friday. Economists polled by Reuters expect the U.S. economy to have added 188,000 jobs last month.\n\"Friday's employment report will be the highlight of the first week of the new year,\" Brett Ryan, senior U.S. economist at Deutsche Bank, said in a note Tuesday. \"We expect a continuation of the string of solid employment data, with nonfarm payrolls ... posting solid gains.\"", "external_links": [], "published": "2018-01-02T13:39:00.000+02:00", "crawled": "2018-01-02T12:51:31.008+02:00", "highlightTitle": ""}