{"organizations": [], "uuid": "3ad76021a1cfa25ed834ad51a3c5cc268a5f75af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225738308&w=1200&r=LYNXMPEE0Q087", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-men/cilic-aiming-to-turn-up-heat-on-federer-idUKKBN1FG0B6", "country": "US", "domain_rank": 408, "title": "PREVIEW-Tennis-Cilic aiming to turn up heat on Federer", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T12:00:00.000+02:00", "replies_count": 0, "uuid": "3ad76021a1cfa25ed834ad51a3c5cc268a5f75af"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-men/cilic-aiming-to-turn-up-heat-on-federer-idUKKBN1FG0B6", "ord_in_thread": 0, "title": "PREVIEW-Tennis-Cilic aiming to turn up heat on Federer", "locations": [], "entities": {"persons": [{"name": "federer martyn herma", "sentiment": "negative"}, {"name": "marton fucsovics", "sentiment": "none"}, {"name": "federer", "sentiment": "none"}, {"name": "nadal", "sentiment": "none"}, {"name": "rafael nadal", "sentiment": "none"}, {"name": "chung hyeon", "sentiment": "none"}, {"name": "tomas berdych", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "cilic", "sentiment": "negative"}, {"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 10:10 AM / Updated 2 hours ago Cilic aiming to turn up heat on Federer Martyn Herman 4 Min Read \nMELBOURNE (Reuters) - Even by Roger Federer’s standards his path to a 30th grand slam final has been a breeze but things are about to hot up as Croatian Marin Cilic prepares to try to stop the Swiss claiming a sixth Australian Open title on Sunday. \nFederer has only been extended past the two-hour mark twice in reaching his seventh final in Melbourne and even those two matches this week against unseeded Marton Fucsovics and Tomas Berdych were relatively straightforward straight-sets wins. \n“I can’t believe how fast now the week has turned out to be,” the 36-year-old said after his semi-final opponent Chung Hyeon retired after 62 minutes of an old-fashioned schooling with foot blisters. \nOne local bookmaker says it has already paid out A$500,000 to punters who backed world number two Federer to retain the title he won in a thriller against Rafael Nadal last year. \nHopes of a repeat of that epic were dashed when Nadal retired hurt in the fifth set of his quarter-final with Cilic on Tuesday, although nothing should be taken away from the Croatian sixth seed, who crunched a mind-boggling 83 winners. \nA top-10 regular, Cilic will bring an arsenal of heavy artillery to Rod Laver Arena on Sunday when temperatures in Melbourne are expected to be in the high 30s Celsius with high humidity -- the most extreme conditions Federer has faced during two weeks in which he played only one day match. \nCilic has a 1-8 head-to-head record against Federer but his sole victory came in the U.S. Open semi-final in 2014 when the six-foot-six powerhouse went on to claim his maiden grand slam title against Japan’s Kei Nishikori. \nHe also led by two sets at Wimbledon two years ago and had match points, although 12 months later in the final he suffered a painful straight sets Centre Court loss to Federer when blisters reduced him to tears. \nTo have the chance to banish that memory so soon in another grand slam final will make Cilic dangerous on Sunday. \n”I definitely think him winning the U.S. Open, it gave him great belief,“ Federer said. ”I like his attitude. He’s very professional. On the court, he’s a winner. \n“He’s there to win and not just to be there. Sometimes you see other players you feel like they’re happy to have made the quarters. I think he strives for more.” \nCilic, whose powerful serve and tree-chopping forehand will be the key to his chances, says Sunday’s showdown is not a chance of revenge for what happened at Wimbledon. \n“I think I played great tournament so far with my level of tennis,” the 29-year-old, bidding to become the first Croatian with multiple grand slam titles, said. \n“I think everything is in good, solid spot. I‘m really excited about the final.” \nHe will start as the underdog though as the apparently ageless Federer chases yet more records. \nShould Federer win he would join Novak Djokovic and Roy Emerson with the most Australian Open titles and would equal Rod Laver’s record of claiming four grand slams after turning 30. \nAsked what it would mean to claim a record-extending 20th grand slam title, Federer said: “Twenty times special. It would be amazing. I‘m happy I‘m still around, still healthy, still playing good, giving myself chances, playing the best.” Editing by Peter Rutherford", "external_links": [], "published": "2018-01-27T12:00:00.000+02:00", "crawled": "2018-01-27T12:22:10.065+02:00", "highlightTitle": ""}