{"organizations": [], "uuid": "b446607e09219dc6ca4f3a0601193daef75fd3e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968481-GettyImages-910249906.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/trump-im-willing-to-shift-more-on-daca-immigration.html", "country": "US", "domain_rank": 767, "title": "Trump: 'I'm willing to shift more' on DACA, immigration", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.119, "site_type": "news", "published": "2018-01-26T13:00:00.000+02:00", "replies_count": 0, "uuid": "b446607e09219dc6ca4f3a0601193daef75fd3e8"}, "author": "Christina Wilkie", "url": "https://www.cnbc.com/2018/01/26/trump-im-willing-to-shift-more-on-daca-immigration.html", "ord_in_thread": 0, "title": "Trump: 'I'm willing to shift more' on DACA, immigration", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "nicholas kamm", "sentiment": "negative"}, {"name": "goodlatte", "sentiment": "none"}, {"name": "cornyn", "sentiment": "none"}, {"name": "perdue", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump told CNBC on Thursday he is \"willing to shift more\" on his border security and DACA demands if that's what is required to reach an immigration deal that will pass Congress in February.\nThis includes supporting a path to citizenship for approximately 1.8 million undocumented young people who were brought to the U.S. as children and are eligible for Obama-era DACA protections against deportation, NBC News reported.\n\"We're going to solve the DACA problem,\" Trump told CNBC's \" Squawk Box \" in an interview from Davos, Switzerland.\nTrump said he believes that a core group of congressional Republicans who have been advising him on immigration would be willing to shift their positions, too.\n\"I think Cotton and Perdue and Goodlatte and the people that I've been dealing with — Cornyn, so many of the people — these are great people. These are people that really have shifted a lot. ... And I think they're willing to shift more, and so am I,\" Trump said, referring to Rep. Bob Goodlatte of Virginia and Sens. Tom Cotton of Arkansas, David Perdue of Georgia and John Cornyn of Texas.\n\"These are people that have very strong opinions on DACA and on immigration generally, and I happen to think they're largely right,\" Trump said in the interview with CNBC's Joe Kernen . Asked whether these lawmakers would agree to back a path to citizenship for DACA-eligible young people, Trump sounded optimistic. \"If we make the right deal, I think they will,\" he said.\nshow chapters Watch CNBC's full interview with President Trump from Davos 6 Hours Ago | 21:00 Such a deal, the White House told NBC News on Thursday, must include a $25 billion trust fund for border security and a border wall; an end to family reunification, or \"chain\" migration, policies and an end to the Diversity Immigrant Visa lottery program.\nApproximately 800,000 undocumented young people are currently shielded from deportation under the Deferred Action for Childhood Arrivals program. Another 1 million are likely eligible for DACA but have not applied for it. Trump rescinded the Obama executive order that created DACA in the fall of 2017, but he gave Congress six months to legislate a solution.\n\"These are good people,\" Trump said of the DACA-protected young people known as dreamers. \"These are people that should be able to stay in this country.\"\nMany DACA recipients have lived in the United States all their lives and have few ties left to the countries from which their parents emigrated. Their fate is hinging on negotiations in Congress, where a Feb. 8 deadline to pass a government spending bill is fast approaching.\nShould Congress fail to strike an immigration deal by then, Senate Majority Leader Mitch McConnell , R-Ky., has pledged to bring DACA legislation to the Senate floor, where it would likely pass with support from Democrats and moderate Republicans.\nStill, Trump's comments are likely to raise eyebrows on Capitol Hill, where Cotton and Perdue, in particular, have earned reputations as some of the toughest immigration hardliners in Congress.\nThe two freshman senators played key roles in persuading Trump to reject a bipartisan immigration deal two weeks ago, a reversal that upended parallel budget negotiations and resulted in a brief government shutdown.\nWhy Cotton or Perdue would be willing to \"shift\" now, after successfully pushing the president to the right on immigration last time, remains unclear. One certain bargaining chip, Trump said, will be congressional funding for border security, including a wall along the U.S. southern border.\n\"We need a strong border. And to do that, you need a wall. And [Democrats] did agree to a $25 billion wall, of which I'll have a lot of money left over, because I don't need $25 billion to build a wall,\" the president said.\nTrump continued: \"We'll build a great wall, and we'll have a lot of money left over, and we'll spend it on other things. But we need great security. And yes, Senator Perdue, Senator Cotton, Cornyn, this one, that one — we have tremendous support to get something done. Tremendous. And I think something will get done.\"", "external_links": [], "published": "2018-01-26T13:00:00.000+02:00", "crawled": "2018-01-26T13:01:53.000+02:00", "highlightTitle": ""}