{"organizations": [], "uuid": "968624b6dd267c3e7de8866c4719e2bcfdc24abf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-gensight-biologics-appoints-julio-benedicto-as-vice-president-of-marketing.html", "country": "US", "domain_rank": 767, "title": "GenSight Biologics Appoints Julio Benedicto as Vice President of Marketing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-25T09:30:00.000+02:00", "replies_count": 0, "uuid": "968624b6dd267c3e7de8866c4719e2bcfdc24abf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-gensight-biologics-appoints-julio-benedicto-as-vice-president-of-marketing.html", "ord_in_thread": 0, "title": "GenSight Biologics Appoints Julio Benedicto as Vice President of Marketing", "locations": [], "entities": {"persons": [{"name": "julio benedicto", "sentiment": "negative"}, {"name": "julio j. benedicto", "sentiment": "none"}, {"name": "benedicto", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "gensight biologics", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS--(BUSINESS WIRE)-- Regulatory News:\nGenSight Biologics (Paris: SIGHT) (Euronext: SIGHT, ISIN: FR0013183985, PEA-PME eligible), a biopharma company focused on discovering and developing innovative gene therapies for retinal neurodegenerative diseases and central nervous system disorders, announced it has appointed Julio J. Benedicto as Vice President of Marketing.\nMr. Benedicto brings over 20 years of experience as a strategy consultant in life sciences, both in Europe and the United States. His expertise includes developing and implementing marketing and sales strategies, launch planning and execution, and building commercialization processes and capabilities. His clients included top pharmaceutical and biotechnology companies, as well as specialty firms, often focused on rare diseases, bringing their first product to market.\nIn his role, Mr. Benedicto will oversee the global brand strategy, business intelligence, as well as design and roll out pre-commercialization and global launch roadmaps for the Company’s product candidates, and notably GS010 currently in Phase III trials. He will be a member of the Management team, and will initially be based in Paris.\n“Julio’s broad experience in developing global marketing strategies and launching new drugs, notably in rare diseases, is a brilliant addition to the management team at GenSight,” said Bernard Gilly , cofounder and Chief Executive Officer. “As we are now about to read out our first Phase III topline results of GS010 in just a few months, and have the ambition to go to market on our own, we need to transform the Company and gear up.”\nPrior to joining GenSight, Mr. Benedicto was a Principal at IQVIA, based in its Munich office, where he was a member of the Brand and Commercial Strategy and Launch Excellence centers of excellence. He also worked at Monitor Group (now Monitor Deloitte) in its New York and London offices and at Booz & Company (now Strategy&, the consulting subsidiary of PwC) in its Berlin office.\nMr. Benedicto received a B.A. in Economics summa cum laude from Yale University (USA), and an M.A. and an M.Phil. in Economics from Yale Graduate School of Arts and Sciences (USA).\n“I am energized to join the GenSight team at such an important time in the company’s evolution,” said Mr. Benedicto . “Turning the promise of path-breaking science into a novel life-changing treatment for patients is a complex but rewarding challenge, one that I am eager to help the company’s talented teams to navigate.”\nAbout GenSight Biologics\nGenSight Biologics S.A. is a clinical-stage biopharma company focused on discovering and developing innovative gene therapies for retinal neurodegenerative diseases and central nervous system disorders. GenSight Biologics’ pipeline leverages two core technology platforms, the Mitochondrial Targeting Sequence (MTS) and optogenetics to help preserve or restore vision in patients suffering from blinding retinal diseases. GenSight Biologics’ lead product candidate, GS010, is in Phase III trials in Leber Hereditary Optic Neuropathy (LHON), a rare mitochondrial disease that leads to irreversible blindness in teens and young adults. Using its gene therapy-based approach, GenSight Biologics’ product candidates are designed to be administered in a single treatment to each eye by intravitreal injection to offer patients a sustainable functional visual recovery.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006170/en/\nGenSight Biologics\nThomas Gidoin, +33 (0)1 76 21 72 20\nChief Financial Officer\ntgidoin@gensight-biologics.com\nor\nRooneyPartners\nMedia Relations\nMarion Janic, +1-212-223-4017\nmjanic@rooneyco.com\nor\nThe Trout Group\nUS Investor Relations\nChad Rubin, +1-646-378-2947\ncrubin@troutgroup.com\nor\nEurope Investor Relations\nJames Palmer, +33 7 60 92 77 74\nj.palmer@orpheonfinance.com\nSource: GenSight Biologics", "external_links": ["http://www.businesswire.com/news/home/20180124006170/en/"], "published": "2018-01-25T09:30:00.000+02:00", "crawled": "2018-01-25T09:09:23.038+02:00", "highlightTitle": ""}