{"organizations": [], "uuid": "6c79dbbc3228a1653df3d7d7fa43e4527995f9d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219719487&w=1200&r=LYNXMPEE041BV", "site_section": "http://feeds.reuters.com/reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-california-crime-immigrant/illegal-immigrant-acquitted-in-california-shooting-gets-three-years-on-gun-charge-idUSKBN1EU27O", "country": "US", "domain_rank": 408, "title": "Illegal immigrant acquitted in California shooting gets three years on gun charge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T01:51:00.000+02:00", "replies_count": 0, "uuid": "6c79dbbc3228a1653df3d7d7fa43e4527995f9d6"}, "author": "", "url": "https://www.reuters.com/article/us-california-crime-immigrant/illegal-immigrant-acquitted-in-california-shooting-gets-three-years-on-gun-charge-idUSKBN1EU27O", "ord_in_thread": 0, "title": "Illegal immigrant acquitted in California shooting gets three years on gun charge", "locations": [], "entities": {"persons": [{"name": "alex bastian", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "garcia zarate", "sentiment": "none"}, {"name": "alex dobuzinskis", "sentiment": "none"}, {"name": "bastian", "sentiment": "none"}, {"name": "steinle", "sentiment": "none"}, {"name": "jose ines garcia zarate", "sentiment": "none"}, {"name": "kate steinle", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "san francisco superior court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "district attorney’s office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 11:55 PM / in 17 hours Illegal immigrant acquitted in California death gets prison on gun charge Alex Dobuzinskis 3 Min Read \n(Reuters) - An illegal immigrant acquitted in a fatal San Francisco shooting, in a verdict condemned by President Donald Trump, was sentenced to three years in prison on a lesser gun charge on Friday. \nThe 45-year-old Mexican national, Jose Ines Garcia Zarate, has been held behind bars since his arrest in the July 2015 shooting death of Kate Steinle, and was fully credited for the three-year sentence, a spokesman for the San Francisco district attorney’s office said. \nThe San Francisco Sheriff’s Department handed Garcia Zarate over to U.S. Marshals on Friday on warrants stemming from federal gun charged related to the Steinle incident, sheriff’s department spokeswoman Nancy Crowley said. \nThe completion of the three-year sentence, handed down by a San Francisco judge, reflected both the time Garcia Zarate has been held since his arrest and certain credits, the spokesman for the district attorney’s office, Alex Bastian, said. \nA San Francisco Superior Court jury had found Garcia Zarate not guilty of murder and manslaughter charges in connection with Steinle’s death. Jurors found him guilty of being a felon in possession of a firearm. \nGarcia Zarate had found the gun that killed Steinle. It accidentally discharged, with the bullet ricocheting off the ground at a crowded pier before striking the 32-year-old woman, his defense attorneys have said. \nProsecutors claimed Garcia Zarate intentionally fired the gun, but they said they accepted the jury’s verdict. \nTrump, who used the Steinle case as a rallying cry against the policies of so-called sanctuary cities for immigrants during his successful run for the presidency, has called the jury’s verdict “disgraceful.” \nJust days after he was acquitted in San Francisco, Garcia Zarate was indicted on federal charges of being a felon in possession of a firearm and being an illegal immigrant in possession of a firearm. \nThe latest criminal counts against Zarate would not violate the constitutional protection against double jeopardy, which prohibits being tried twice on the same charges, because they differed legally from the state court charges, a U.S. Department of Justice spokesman said last month. \nA representative for the Office of the Federal Public Defender could not immediately be reached for comment. \nGarcia Zarate faces a maximum sentence of 10 years in prison on each charge if convicted. \nImmigration agents have vowed to eventually deport Garcia Zarate, who first came to the United States as a juvenile and was deported multiple times. Reporting by Alex Dobuzinskis in Los Angeles; Editing by Tom Brown and Leslie Adler", "external_links": [], "published": "2018-01-06T01:51:00.000+02:00", "crawled": "2018-01-06T02:05:18.028+02:00", "highlightTitle": ""}