{"organizations": [], "uuid": "5ad00a359625125b58031d5a6453fa2455fc26f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-drg-announces-new-leadership-hires-at-drg-digital--manhattan-research.html", "country": "US", "domain_rank": 767, "title": "DRG Announces New Leadership Hires at DRG Digital | Manhattan Research", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:53:00.000+02:00", "replies_count": 0, "uuid": "5ad00a359625125b58031d5a6453fa2455fc26f1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-drg-announces-new-leadership-hires-at-drg-digital--manhattan-research.html", "ord_in_thread": 0, "title": "DRG Announces New Leadership Hires at DRG Digital | Manhattan Research", "locations": [], "entities": {"persons": [{"name": "chris o'brien", "sentiment": "none"}, {"name": "jeff greene", "sentiment": "none"}, {"name": "fabien", "sentiment": "none"}, {"name": "jeff", "sentiment": "none"}, {"name": "fabien savenay", "sentiment": "none"}, {"name": "greene", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "burlington", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "piramal", "sentiment": "none"}, {"name": "asia/pacific", "sentiment": "none"}], "organizations": [{"name": "decision resources group", "sentiment": "negative"}, {"name": "drg digital | manhattan research", "sentiment": "negative"}, {"name": "fierce pharma", "sentiment": "none"}, {"name": "drg digital", "sentiment": "none"}, {"name": "drg", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}, {"name": "digital strategy", "sentiment": "none"}, {"name": "piramal enterprises limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BURLINGTON, Mass., Jan. 18, 2018 /PRNewswire/ -- Decision Resources Group (DRG), a subsidiary of India-based Piramal Enterprises Limited (Piramal), announced STM publishing veteran Fabien Savenay has joined DRG Digital | Manhattan Research as Senior Vice President, Digital and Commercial Innovation. Jeff Greene, an accomplished pharmaceutical marketing strategist, has joined as VP, Digital Strategy and Insights.\nSavenay most recently led EMEA-APAC sales for DRG, where he was responsible for growing the company's analytics, market assessment, and market access business in the EU and Asia/Pacific.\nGreene has consulted with pharmaceutical brands and commercial leadership the past 9 years, providing practical guidance on multichannel marketing best practices and customer innovation. He is a sought-after speaker and regular contributor to industry publications such as Fierce Pharma, Pharmaceutical Executive, and MM&M.\n\"We're thrilled to have these two accomplished leaders on board,\" commented Chris O'Brien, Chief Operating Officer, DRG. \"Fabien and Jeff will enable DRG Digital to continue its strong growth trajectory by bringing new, innovative research solutions and deep customer insights to our global clients.\"\nIn his new role, Savenay will oversee DRG Digital's team of 45+ research and commercial professionals, focusing on revenue growth and global market expansion. Prior to DRG, Savenay was VP Global Sales Operations at Wolters Kluwer Health, where he oversaw a team of 50 sales professionals in North America and Europe. He also held senior roles at Seed Media Group and Nature Publishing Group.\nGreene will drive innovation within the company's research portfolio and support clients and the industry with trends, thought leadership, and strategic marketing counsel. Prior to DRG, Greene was Partner at New Solutions Factory, leading marketing and analytics projects for organizations including Mylan Specialty, Otsuka Pharmaceuticals, and Publicis Healthcare. A dot-com-era veteran, he has 20 years of experience guiding clients into the digital age.\nAbout DRG Digital | Manhattan Research\nDRG Digital, a part of DRG, is the life science industry's partner for data-driven customer engagement and commercial innovation. DRG Digital's Manhattan Research studies have been the industry's go-to source for physician, patient and payer multichannel planning for more than 15 years. Brands, marketers and digital teams at 40+ leading life sciences companies rely on our experts, research and analytics to understand their customers and engage them with the right channels, content and messaging.\nVisit www.DRGDigital.com or follow @DRGDigital to keep up to date on our analysts' thinking and access eBooks, infographics, webinars and other resources.\nAbout Decision Resources Group\nDRG, a subsidiary of Piramal Enterprises Ltd., is the premier source for global healthcare data and market intelligence. A trusted partner for over 20 years, DRG helps companies competing in the global healthcare industry make informed business decisions. Organizations committed to developing and delivering life-changing therapies to patients rely on DRG's in-house team of expert healthcare analysts, data scientists, and consultants for critical guidance. DRG products and services, built on extensive data assets and delivered by experts, empower organizations to succeed in complex healthcare markets.\nTo learn more, visit www.decisionresourcesgroup.com .\nMedia Contact:\nDecision Resources Group\nJeff Greene\n+1-212-414-7531\njgreene@teamdrg.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/drg-announces-new-leadership-hires-at-drg-digital--manhattan-research-300584655.html\nSOURCE Decision Resources Group", "external_links": ["http://www.drgdigital.com/", "http://www.decisionresourcesgroup.com/", "http://www.prnewswire.com/news-releases/drg-announces-new-leadership-hires-at-drg-digital--manhattan-research-300584655.html", "https://twitter.com/drgdigital"], "published": "2018-01-18T18:53:00.000+02:00", "crawled": "2018-01-18T19:58:18.005+02:00", "highlightTitle": ""}