{"organizations": [], "uuid": "56eff71eaf5708c26da20d38131f21d9f119096d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220813335&w=1200&r=LYNXMPEE090P5", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-colombia-rebels-ecuador/ceasefire-with-colombias-eln-rebels-expires-talks-continue-idUKKBN1EZ1C9", "country": "US", "domain_rank": 408, "title": "Ceasefire with Colombia's ELN rebels expires, talks continue", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T14:19:00.000+02:00", "replies_count": 0, "uuid": "56eff71eaf5708c26da20d38131f21d9f119096d"}, "author": "", "url": "https://uk.reuters.com/article/uk-colombia-rebels-ecuador/ceasefire-with-colombias-eln-rebels-expires-talks-continue-idUKKBN1EZ1C9", "ord_in_thread": 0, "title": "Ceasefire with Colombia's ELN rebels expires, talks continue", "locations": [], "entities": {"persons": [{"name": "pablo beltran", "sentiment": "none"}], "locations": [{"name": "colombia", "sentiment": "none"}, {"name": "ecuador", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}, {"name": "quito", "sentiment": "none"}], "organizations": [{"name": "eln", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "national liberation army", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 12:22 PM / Updated 17 minutes ago Colombia's ELN rebels resume attacks after ceasefire expires Helen Murphy , Luis Jaime Acosta 4 Min Read \nBOGOTA (Reuters) - Colombia’s Marxist ELN rebels resumed attacks on oil installations and the armed forces on Wednesday, just hours after the expiration of a ceasefire with the government that had reduced the intensity of the conflict, high-level military sources said. FILE PHOTO - Rebels of Colombia's Marxist National Liberation Army (ELN) arrive in a boat, in the northwestern jungles, Colombia August 30, 2017. Picture taken August 30, 2017. REUTERS/Federico Rios \nThe attacks threatened peace talks scheduled to resume on Wednesday between the National Liberation Army (ELN) and the government. \nThe negotiations have been under way in Quito, the capital of Ecuador, since the beginning of last year in a bid to end more than 53 years of fighting but President Juan Manuel Santos ordered his chief negotiator back to Bogota to evaluate their future. \nThe rebels launched two bomb attacks in the early hours against the Cano Limon oil pipeline, which takes crude from the Cano Limon oil field, operated by Occidental Petroleum Corp, to the Caribbean. Two sections of the pipeline were damaged in Arauca and Boyaca provinces, forcing the suspension of pumping, a senior army official told Reuters. \nThe ELN also tossed a grenade at a naval base in Arauquita, in Arauca province, injuring two soldiers, the official said. \nState oil company Ecopetrol also reported an attack on one of its facilities in a rural area of Aguazul in Casanare province. \nIf talks continue, the assault likely will pressure the government to quickly negotiate a new suspension of hostilities with the ELN. \n“I deplore the decision by the ELN to reactivate its terrorist attacks,” Santos said in a televised address. “The government was always willing to extend the ceasefire. Inexplicably, the ELN refused. Under the circumstances I have ordered the return of our chief negotiator to evaluate the future of talks.” \nThe group’s first-ever ceasefire, which began in October, ended overnight without being extended as logistical problems prevented the two sides from meeting at the scheduled time on Monday, the government said. \nThe ELN has said it will not extend the truce under original terms and wants a new deal. \nBefore the attacks, centre-right Santos had not said he would launch an immediate offensive against the group now that the ceasefire has ended. \nDuring the ceasefire, reached on Sept. 4, the insurgent group promised to suspend hostage-taking, attacks on roads and oil installations, the use of landmines and the recruitment of minors. In turn, the government agreed to improve protection for community leaders and conditions for about 450 jailed rebels. \nThe 2,000-strong ELN has caused serious difficulty in the oil industry with its regular bombings of infrastructure and has taken numerous oil workers hostages over the years. It has clashed with other armed groups during the ceasefire. \nSantos, who leaves office this year, signed a peace deal with the larger Revolutionary Armed Forces of Colombia (FARC) in late 2016 after negotiations in Cuba that lasted four years. \nThe FARC is now a political party with a candidate for president in May elections. \nThe ELN, founded by radical Roman Catholic priests in 1964, has sought peace with the government before but made little progress. It is considered a terrorist group by the United States and European Union. Reporting by Helen Murphy; Additional reporting by Luis Jaime Acosta; Editing by Jeffrey Benkoe and Bill Trott", "external_links": [], "published": "2018-01-10T14:19:00.000+02:00", "crawled": "2018-01-10T14:40:35.015+02:00", "highlightTitle": ""}