{"organizations": [], "uuid": "d04da7fc8da193518854347862310a1fde9b42d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-cypress-energy-partners-l-p-announces-fourth-quarter-cash-distribution.html", "country": "US", "domain_rank": 767, "title": "Cypress Energy Partners, L.P. Announces Fourth Quarter Cash Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-26T14:00:00.000+02:00", "replies_count": 0, "uuid": "d04da7fc8da193518854347862310a1fde9b42d5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-cypress-energy-partners-l-p-announces-fourth-quarter-cash-distribution.html", "ord_in_thread": 0, "title": "Cypress Energy Partners, L.P. Announces Fourth Quarter Cash Distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "okla.", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}], "organizations": [{"name": "cypress energy partners", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "celp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TULSA, Okla.--(BUSINESS WIRE)-- Cypress Energy Partners, L.P. (NYSE: CELP ) announced today that the board of directors of its general partner declared a cash distribution for the fourth quarter of 2017. The cash distribution is $0.21 per limited partner unit. This amount remains unchanged from the third quarter of 2017. The distribution will be payable on February 14, 2018 to all unitholders of record on February 7, 2018.\nThis press release includes “forward-looking statements.” All statements, other than statements of historical facts included or incorporated herein, may constitute forward-looking statements. Actual results could vary significantly from those expressed or implied in such statements and are subject to a number of risks and uncertainties. While CELP believes its expectations as reflected in the forward-looking statements are reasonable, CELP can give no assurance that such expectations will prove to be correct. The forward-looking statements involve risk and uncertainties that can affect operations, financial performance, and other factors as provided in CELP’s filings with the Securities and Exchange Commission. Other factors which could impact any forward-looking statements are those risks described in CELP’s Annual Report filed on Form 10-K and in other public filings. You are urged to carefully review and consider the cautionary statements and other disclosures made in those filings, specifically those under the heading “Risk Factors.” CELP undertakes no obligation to publicly update or revise any forward-looking statements except as required by law.\nAbout Cypress Energy Partners, L.P. Cypress Energy Partners, L.P. is a growth-oriented master limited partnership that provides midstream services including pipeline inspection, integrity, and hydrostatic testing services to energy, E&P, public utility companies, and midstream companies and their respective vendors throughout the U.S. and Canada. Cypress also provides saltwater disposal and other water and environmental services to U.S. energy E&P companies and their vendors in North Dakota in the Williston Basin, and West Texas in the Permian Basin. In all three of these business segments, Cypress works closely with its customers to help them comply with increasingly complex and strict environmental and safety rules and regulations and reduce their operating costs. Cypress is headquartered in Tulsa, Oklahoma.\nThis release is a qualified notice under Treasury Regulation Section 1.1446-4(b). Brokers and nominees should treat 100% of Cypress Energy Partners L.P.’s distributions to foreign investors as being attributable to income that is effectively connected with a United States trade or business. Therefore, distributions to foreign investors are subject to federal income tax withholding at the highest applicable effective tax rate.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005089/en/\nCypress Energy Partners, L.P.\nJeff Herbers, Chief Accounting Officer, 918-947-5730\njeff.herbers@cypressenergy.com\nSource: Cypress Energy Partners, L.P.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ffinance.yahoo.com%2Fq%3Fs%3Dcelp&esheet=51749262&newsitemid=20180126005089&lan=en-US&anchor=CELP&index=1&md5=4765b6acb395b57f384e6529a43c4759", "http://www.businesswire.com/news/home/20180126005089/en/"], "published": "2018-01-26T14:00:00.000+02:00", "crawled": "2018-01-26T16:55:07.012+02:00", "highlightTitle": ""}