{"organizations": [], "uuid": "38529c8adf87920bc8cb4c966bcccfbafc54703e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-pershing-square-holdings-ltd-announces-proposed-sale-of-its-howard-hughes-corporation-common-stock-and-a-usd300000000.html", "country": "US", "domain_rank": 767, "title": "Pershing Square Holdings, Ltd. Announces Proposed Sale of Its Howard Hughes Corporation Common Stock and a USD300,000,000 Potential Tender Offer for PSH Shares by William A. Ackman and Affiliates", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.933, "site_type": "news", "published": "2018-01-03T00:15:00.000+02:00", "replies_count": 0, "uuid": "38529c8adf87920bc8cb4c966bcccfbafc54703e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-pershing-square-holdings-ltd-announces-proposed-sale-of-its-howard-hughes-corporation-common-stock-and-a-usd300000000.html", "ord_in_thread": 0, "title": "Pershing Square Holdings, Ltd. Announces Proposed Sale of Its Howard Hughes Corporation Common Stock and a USD300,000,000 Potential Tender Offer for PSH Shares by William A. Ackman and Affiliates", "locations": [], "entities": {"persons": [{"name": "william a. ackman", "sentiment": "neutral"}, {"name": "ackman", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "pershing square", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "psh", "sentiment": "neutral"}, {"name": "pershing square holdings, ltd", "sentiment": "neutral"}, {"name": "howard hughes corporation common stock", "sentiment": "neutral"}, {"name": "pershing square holdings, ltd.", "sentiment": "neutral"}, {"name": "pershing square capital management", "sentiment": "none"}, {"name": "hhc", "sentiment": "none"}, {"name": "pslp", "sentiment": "none"}, {"name": "howard hughes corporation", "sentiment": "none"}, {"name": "pscm acquisition co llc", "sentiment": "none"}, {"name": "pscm management team", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON--(BUSINESS WIRE)--\nRegulatory News:\nPershing Square Holdings, Ltd. (“PSH”) (LN:PSH) (NA:PSH) today announces the proposed sale of all of PSH’s 2,067,490 shares of common stock in The Howard Hughes Corporation (“HHC”) (NYSE: HHC). PSH is pursuing this sale in order to help facilitate a potential tender offer (“Potential Tender”) for PSH’s public shares by PSCM Acquisition Co LLC, an entity owned by Mr. William A. Ackman and members of the Pershing Square Capital Management, L.P. advisory board and senior management (together with Mr. Ackman, the “PSCM Management Team”). Selling PSH’s common stock in HHC will provide more flexibility under the \"United States real property holding company\" rules pursuant to the FIRPTA provisions in the Internal Revenue Code as further described below.\nIn addition to the sale of PSH’s stake in HHC, an affiliated fund, Pershing Square, L.P. (“PSLP”), will participate in the offering by selling 432,510 shares of common stock in HHC. PSLP is selling the Common Stock for portfolio management reasons. An aggregate of 2,500,000 shares of HHC common stock is expected to be sold in the offering. After the proposed sale, funds managed by Pershing Square Capital Management L.P. will beneficially own 5.1% of HHC common stock and will retain an additional 12.5% economic exposure to HHC through the ownership of total return swaps, for a total of 17.6% economic exposure to HHC.\nHHC has filed a registration statement (including a prospectus) and will file a preliminary prospectus supplement with the SEC for this offering of HHC common stock. Investors should read the prospectus in that registration statement, the preliminary prospectus supplement and other documents HHC has filed with the SEC for more complete information about HHC and this offering. Investors may access these documents for free by visiting EDGAR on the SEC website at www.sec.gov . Alternatively, HHC, any underwriter or any dealer participating in the offering will arrange to send investors the prospectus if requested. The underwriters are J.P. Morgan Securities LLC, Merrill Lynch, Pierce, Fenner & Smith Incorporated and Jefferies LLC. When available, copies of the prospectus supplement and accompanying prospectus related to the offering may also be obtained by contacting: (i) J.P. Morgan Securities LLC, Attention: Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, telephone: 1-866-803-9204; (ii) BofA Merrill Lynch, Attention: Prospectus Department, NC1- 004-03-43, 200 North College Street, 3rd Floor, Charlotte, North Carolina 28255-0001, or via email dg.prospectus_requests@baml.com ; or (iii) Jefferies LLC, Attention: Equity Syndicate Prospectus Department, 520 Madison Avenue, 2nd Floor, New York, NY 10022, telephone: 1-877-821-7388 or e-mail: Prospectus_Department@Jefferies.com .\nThe PSCM Management Team proposes to make the Potential Tender for PSH public shares because it would like to increase its investment in PSH which it believes is undervalued. In addition, the PSCM Management Team believes that the Potential Tender should assist in reducing the discount to net asset value at which PSH’s public shares currently trade. The board of PSH is supportive of the Potential Tender but will make no recommendation as to whether individual holders of PSH’s public shares should participate in the Potential Tender.\nThe specific terms of the Potential Tender will be made available by PSCM Acquisition Co LLC after the settlement of the HHC sale. It is anticipated that the Potential Tender will be for up to USD300,000,000 in value of PSH’s public shares.\nIn accordance with EU law, PSH is suspending its current share purchase program with immediate effect until the conclusion of the Potential Tender.\nPSH and PSCM Acquisition Co LLC hereby confirm that they have reached conditional agreement on the terms of the Potential Tender, subject to the conditions described herein.\nIf PSH’s HHC sale is completed, PSH anticipates that, on the basis of certain representations and undertakings by the PSCM Management Team, PSH’s board of directors may grant an exemption to the PSCM Management Team in respect of PSH’s public shares acquired in the Potential Tender from the limit contained in PSH's articles of incorporation that no person may own or be treated as owning, within the meaning of Section 318 of the US Internal Revenue Code (as modified by Section 897(c)(6)(C) of the US Internal Revenue Code) PSH’s public shares in excess of 4.99% of the value of PSH’s public shares (which is referred to in PSH’s articles of incorporation as the \"Ownership Limit\"). Accordingly, if such exemption is granted, the Ownership Limit shall not apply in respect of PSH public shares acquired by the PSCM Management Team in the Potential Tender. The Ownership Limit is in place because of tax issues relating to the \"United States real property holding company\" rules under the FIRPTA provisions in the Internal Revenue Code.\nThe PSCM Management Team will finance the Potential Tender through available cash and committed financing. The PSCM Management Team has no reason to believe that it will not be able to fund its obligations to purchase PSH public shares in the Potential Tender and pay the fees and expenses associated with the Potential Tender.\nPSH is not party to, or responsible for any aspect of, the Potential Tender. Launch of the Potential Tender, if and when made, and its specific timing is subject to the receipt of certain approvals from the Dutch Authority for the Financial Markets (Autoriteit Financiële Markten, “AFM”) and the UK Takeover Panel.\nAbout Pershing Square Holdings, Ltd.\nPershing Square Holdings, Ltd. (LN:PSH) (NA:PSH) is an investment holding company structured as a closed ended fund that makes concentrated investments principally in North American companies.\nThis is a joint press release by Pershing Square Holdings, Ltd. (“PSH”) and PSCM Acquisition Co LLC (“PSCMAC”), pursuant to the provisions of Section 4 paragraph 3, Section 5 paragraph 1 of the Decree on Public Takeover Bids (Besluit Openbare Biedingen Wft) in connection with a potential tender offer by PSCMAC for PSH’s public shares. This announcement does not constitute an offer, or any solicitation of any offer, to buy or subscribe for any securities. Any offer will be made only by means of an offer memorandum. This announcement is not for release, publication or distribution, in whole or in part, in or into, directly or indirectly, the United States, Canada or Japan or in any other jurisdiction in which such release, publication or distribution would be unlawful.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005841/en/\nMEDIA\nMaitland\nJames Devas, +44 20 7379 5151\nMedia-pershingsquareholdings@maitland.co.uk\nSource: Pershing Square Holdings, Ltd.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51736852&newsitemid=20180102005841&lan=en-US&anchor=www.sec.gov&index=1&md5=d03a9cefced21ae5d24a6f9ea98da63b", "http://www.businesswire.com/news/home/20180102005841/en/"], "published": "2018-01-03T00:15:00.000+02:00", "crawled": "2018-01-03T02:21:53.018+02:00", "highlightTitle": ""}