{"organizations": [], "uuid": "e9aa8560b1ee876dd6978e0ced6cd14b16248213", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-agrium-and-potashcorp-merger-completed-forming-nutrien-a-leader-in-global-agriculture.html", "country": "US", "domain_rank": 767, "title": "Agrium and PotashCorp Merger Completed Forming Nutrien, a Leader in Global Agriculture", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.325, "site_type": "news", "published": "2018-01-02T15:00:00.000+02:00", "replies_count": 0, "uuid": "e9aa8560b1ee876dd6978e0ced6cd14b16248213"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-agrium-and-potashcorp-merger-completed-forming-nutrien-a-leader-in-global-agriculture.html", "ord_in_thread": 0, "title": "Agrium and PotashCorp Merger Completed Forming Nutrien, a Leader in Global Agriculture", "locations": [], "entities": {"persons": [{"name": "nutrien", "sentiment": "negative"}, {"name": "chuck magro", "sentiment": "none"}], "locations": [{"name": "saskatoon", "sentiment": "none"}, {"name": "nutrien", "sentiment": "none"}], "organizations": [{"name": "nutrien ltd.", "sentiment": "negative"}, {"name": "agrium", "sentiment": "negative"}, {"name": "tsx", "sentiment": "negative"}, {"name": "global agriculture nyse", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "potashcorp", "sentiment": "none"}, {"name": "agrium inc.", "sentiment": "none"}, {"name": "potash corporation of saskatchewan inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NYSE, TSX: NTR\nSASKATOON, Jan. 2, 2018 /PRNewswire/ - Nutrien Ltd. (Nutrien) (TSX and NYSE: NTR) today announced the successful completion of the merger of equals between Agrium Inc. (Agrium) and Potash Corporation of Saskatchewan Inc. (PotashCorp), creating the world's premier provider of crop inputs and services. Nutrien has the largest crop nutrient production portfolio combined with an unparalleled global retail distribution network that includes more than 1,500 farm retail centers. With nearly 20,000 employees – and operations and investments in 14 countries – the company is committed to providing products and services that help growers optimize crop yields and their returns.\n\"Today we are proud to launch Nutrien, a company that will forge a unique position within the agriculture industry,\" said Chuck Magro, President & Chief Executive Officer of Nutrien. \"Our company will have an unmatched capability to respond to customer and market opportunities, focusing on innovation and growth across our retail and crop nutrient businesses. Importantly, we intend to draw upon the depth of our combined talent and best practices to build a new company that is stronger and better equipped to create value for all our stakeholders.\"\nNutrien common shares will trade on the Toronto Stock Exchange and the New York Stock Exchange under the ticker symbol NTR beginning today. Trading of common shares of Agrium and PotashCorp was halted on the Toronto Stock Exchange and New York Stock Exchange concurrently with the listing of Nutrien common shares on such exchanges. The merger of equals resulted in PotashCorp shareholders receiving 0.40 common shares of Nutrien for each common share of PotashCorp they owned, and Agrium shareholders received 2.23 common shares of Nutrien for each common share of Agrium they owned.\nAdditional information about Nutrien, including introductory videos, is available on our website at www.nutrien.com .\nNutrien Board of Directors and Senior Leadership Team\nAs previously announced, Nutrien's Board of Directors has equal representation from Agrium and PotashCorp. Mr. Jochen Tilk will serve as the Executive Chair, with Mr. Derek Pannell as the Board's independent Lead Director.\nThe Company's directors were selected to ensure that Nutrien has the experience, independence and perspective to provide strong corporate governance and the successful management of our business.\nIn addition to Mr. Magro and Mr. Tilk, previously announced members of Nutrien's senior leadership team include Wayne Brownlee, Executive Vice President & Chief Financial Officer, and Steve Douglas, Executive Vice President & Chief Integration Officer.\nAdditional members of Nutrien's senior leadership team include:\nHarry Deans, Executive Vice President and President, Nitrogen Michael Frank, Executive Vice President and President, Retail Kevin Graham, Executive Vice President and President, Sales Susan Jones, Executive Vice President and President, Phosphate Lee Knafelc, Executive Vice President & Chief Sustainability Officer Leslie O'Donoghue, Executive Vice President & Chief Strategy & Corporate Development Officer Joe Podwika, Executive Vice President & Chief Legal Officer Brent Poohkay, Executive Vice President & Chief Information Officer Raef Sully, Executive Vice President and President, Potash Mike Webb, Executive Vice President & Chief Human Resources Officer\nFor more information on Nutrien's Board of Directors and senior leadership team please visit our website at www.nutrien.com .\nNutrien Operating Synergies\nThe company is expected to generate US$500-million of annual operating synergies, primarily from distribution and retail integration, production and SG&A optimization, and procurement savings. We expect to achieve approximately US$250-million of these synergies by the end of 2018 with the full annualized run-rate achieved by the end of 2019.\nNutrien Capital Allocation\nWith major capacity expansion projects complete, expected proceeds from the divestiture of equity investments and significant cash flow generation capability, Nutrien will have flexibility to invest in focused growth initiatives and return excess capital to shareholders, while also prioritizing a strong investment grade credit rating profile.\nNutrien intends to target a stable and growing dividend that reflects the anticipated strengthened cash flow profile of the company.\nNutrien Financial Outlook\nNutrien intends to provide guidance for the 2018 fiscal year in connection with the reporting of fourth quarter 2017 results of each Agrium and PotashCorp on February 5, 2018.\nAbout Nutrien\nNutrien is the world's largest provider of crop inputs and services, playing a critical role in helping growers increase food production in a sustainable manner. We produce and distribute over 25 million tonnes of potash, nitrogen and phosphate products world-wide. With this capability and our leading agriculture retail network, we are well positioned to supply the needs of our customers. We operate with a long-term view and are committed to working with our stakeholders as we address our economic, environmental and social priorities. The scale and diversity of our integrated portfolio provides a stable earnings base, multiple avenues for growth and the opportunity to return capital to shareholders. For further information visit us at www.nutrien.com .\nForward Looking Statements\nCertain statements and other information included in this press release constitute \"forward-looking information\" or \" \" (collectively, \" \") under applicable securities laws. All statements in this press release, other than those relating to historical information or current conditions, are , including, but not limited to, statements relating to certain strategic benefits expected to result from the transaction, the nature and timing of operating synergies and Nutrien's expected capital allocation strategy and dividend policy.\nForward-looking statements in this press release are based on certain key expectations and assumptions made by Nutrien, including expectations and assumptions concerning: customer demand for Nutrien's products; commodity prices and interest and foreign exchange rates; operating synergies, capital efficiencies and cost-savings; applicable tax laws; future production rates; future debt ratings; the sufficiency of budgeted capital expenditures in carrying out planned activities; and the availability and cost of labour and services. Although Nutrien believes that the expectations and assumptions on which such are based are reasonable, undue reliance should not be placed on the because Nutrien can give no assurance that they will prove to be correct.\nForward-looking statements are subject to various risks and uncertainties which could cause actual results and experience to differ materially from the anticipated results or expectations expressed in this press release. Key risks and uncertainties include, but are not limited: general global economic, market and business conditions; weather conditions including impacts from regional flooding and/or drought conditions; crop plant area, yield and prices; the supply and demand and price levels for major products of Nutrien may vary from what we currently anticipate; failure to realiz", "external_links": ["http://www.nutrien.com/"], "published": "2018-01-02T15:00:00.000+02:00", "crawled": "2018-01-02T16:57:42.004+02:00", "highlightTitle": ""}