{"organizations": [], "uuid": "756539ee18f36e271f221e6f85fc24c4906f5d07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224162686&w=1200&r=LYNXMPEE0L17E", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-olympics-2018-skat-belchos/canadas-belchos-looks-to-mend-sochi-heartache-in-south-korea-idUSKBN1FB1MI", "country": "US", "domain_rank": 408, "title": "Canada's Belchos looks to mend Sochi heartache in South Korea", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.146, "site_type": "news", "published": "2018-01-22T21:50:00.000+02:00", "replies_count": 0, "uuid": "756539ee18f36e271f221e6f85fc24c4906f5d07"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-olympics-2018-skat-belchos/canadas-belchos-looks-to-mend-sochi-heartache-in-south-korea-idUSKBN1FB1MI", "ord_in_thread": 0, "title": "Canada's Belchos looks to mend Sochi heartache in South Korea", "locations": [], "entities": {"persons": [{"name": "belchos", "sentiment": "negative"}, {"name": "jordan belchos", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "calgary", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - After the heartbreak of missing out on the Winter Olympics in Sochi by the narrowest of margins four years ago, Canadian speed skater Jordan Belchos is all set to step it up a gear when he takes to the ice in South Korea.\nThe Toronto native missed the cut for Sochi by a few hundredths of a second and is still pinching himself after being selected to race for Canada in the 10,000m and the team pursuit at next month’s Winter Games.\n“Last Olympics, I missed the Games by six hundredths of a second, so I remember that feeling, and I guess just the contrast to that is pretty amazing,” he told Reuters from Canada’s training base in Calgary.\n“It was unbelievable. If it had happened to anybody else, I would have been like, ‘No way, that’s insane’.”\nBelchos’s misery at missing out on Sochi was compounded by confusion in the local media over whether he had qualified for the 10,000m.\n“There was a news article released (saying) that I’d qualified (for Sochi), there was a couple I guess that didn’t fully understand the rules,” the 28-year-old said.\n”I had to tell these people, ‘no, I‘m not qualified’. People were congratulating me and I was like, ‘No, no, I‘m actually just going to miss it.’\n“At a certain point I got sick of telling the same story. It was kind of a sad story. I made it my goal the next four years that I was going to use that to be better.”\nSTIFF COMPETITION Belchos faces stiff competition in the 10,000m from his Canada team mate Ted-Jan Bloemen, the current world record holder, as well as from Dutchman Sven Kramer, one of the favorites to medal in South Korea.\n”Ted and Sven Kramer, those guys are a little bit head and shoulders above the rest,“ he said. ”But besides that I believe there’s a lot of guys that have a chance.\n“To go to the Games and to really challenge in the same distance, the 10,000m, would be the ultimate kind of finish for me.”\nBelchos was struck down by injury before and after Canada’s Olympic trials for Sochi, but those experiences only strengthened his resolve.\n”So the June before Sochi, I crashed my bike and I had a bad concussion,“ he said. ”And then I came back that summer and I got demoted from the national team to the national development team.\n”And then in July (2014) I crashed and broke my kneecap while skating. So it was just like this whole series of events where nothing seemed to be easy.\n“You get difficult things and if you let them beat you down they will, but if you use them in the right way they make you stronger. So there was this constant belief that all these negative things in some way are going to be good for me.”\nTEAM DYNAMIC Canada will send a strong team pursuit squad to the Games, and Belchos believes their camaraderie gives them an edge over the competition.\n“For sure the team pursuit is a big target. We have a really good team,” he said.\n”I actually believe that a lot of our success can be attributed to the dynamic of the team because right now as it’s kind of shaped, it’s me, Denny Morrison, Ted-Jan Bloemen and Ben Donnelly, and those are three of my best friends.\n“We train together all the time and we’re always pushing each other. I just enjoy hanging out with those guys.”\nVincent De Haitre is also part of the squad for the team pursuit, and Belchos believes the Canadians will challenge for plenty of medals on the ice at the Gangneung Oval.\n”If you look at our team, you could find a medal contender in basically every single distance,“ he said. ”That’s pretty exciting.\n”Obviously not everybody is going to win a medal, but if there’s 14 events and seven win medals, that would be huge.\n“For me it comes down a lot to the culture that’s been established. You can see the buy-in from the athletes and the staff. We have a really good group of people, so that’s what works I think.”\nReporting by Simon Jennings in Bengaluru; Editing by Toby Davis\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T21:50:00.000+02:00", "crawled": "2018-01-23T18:16:10.016+02:00", "highlightTitle": ""}