{"organizations": [], "uuid": "2e6466896097963873e12d971e1aed4cbb5d3801", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226273144&w=1200&r=LYNXMPEE0S0QX", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-spain-politics-catalonia-scenarios/whats-next-for-catalonia-and-would-be-leader-puigdemont-idUKKBN1FI18L", "country": "US", "domain_rank": 408, "title": "What's next for Catalonia and would-be leader Puigdemont?", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T13:21:00.000+02:00", "replies_count": 0, "uuid": "2e6466896097963873e12d971e1aed4cbb5d3801"}, "author": "", "url": "https://uk.reuters.com/article/uk-spain-politics-catalonia-scenarios/whats-next-for-catalonia-and-would-be-leader-puigdemont-idUKKBN1FI18L", "ord_in_thread": 0, "title": "What's next for Catalonia and would-be leader Puigdemont?", "locations": [], "entities": {"persons": [{"name": "puigdemont", "sentiment": "neutral"}, {"name": "carles puigdemont", "sentiment": "none"}, {"name": "mariano rajoy", "sentiment": "none"}, {"name": "rajoy", "sentiment": "none"}, {"name": "ingrid melander", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "catalonia", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "min read  madrid", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 11:23 AM / Updated an hour ago What's next for Catalonia and would-be leader Puigdemont? Ingrid Melander 4 Min Read \nMADRID (Reuters) - Catalan lawmakers are scheduled to choose a president for Spain’s wealthiest region on Tuesday in an unlikely setting. The official candidate, Carles Puigdemont, has fled abroad and the central government in Madrid is trying to block his election. \nCatalonia has been ruled by Madrid for the past three months since Prime Minister Mariano Rajoy dismissed Puigdemont following a unilateral declaration of independence by the regional parliament in October. \nThousands of firms have moved their legal headquarters to elsewhere in Spain over the uncertainty in Catalonia, where separatists won a majority of seats in a December election but not a majority of votes, in a sign of how divided the region is. \nHere is a look at possible scenarios: - PUIGDEMONT IS ELECTED AND RULES CATALONIA: UNLIKELY \nIn theory, that should have been easy. The Dec. 21 regional election called by Rajoy in a bid to weaken the independence drive backfired and gave nationalists an absolute majority. \nBut Puigdemont is the subject of an arrest warrant for leading the secession bid. He is now in Brussels and faces arrest the minute he steps foot in Spain. \nPuigdemont and his allies have suggested electing Puigdemont and having him rule via proxy or by videolink from Belgium. \nBut the constitutional court ruled out such an option and said Puigdemont had to attend in person the swearing-in session to become regional leader. Catalonia’s parliament’s own legal advisers said being elected remotely would break the law. \n- PARLIAMENT ELECTS PUIGDEMONT AND HE CANNOT RULE: POSSIBLE \nThat depends on whether separatists will seek to defy the constitutional court ruling and elect Puigdemont remotely. \nWith three separatists in jail, others freed on bail and five in self-imposed exile to avoid arrest, the context is different from what it was when Catalonia unilaterally declared independence in October. \nThe ERC (Esquerra Republicana de Catalunya) party has suggested it could seek an alternative candidate in order to avoid a legal battle with the government. Madrid has already said it would keep direct rule in place if pro-independence parties tried to swear in Puigdemont from Brussels. - PARLIAMENT ELECTS ANOTHER CANDIDATE: MORE LIKELY \nSeparatists won 70 seats out of 135 in December when opinion polls had shown they were likely to lose their absolute majority in the chamber. That was two seats fewer than in the previous assembly. \nSo they would not necessarily have much interest in a complete stalemate that would eventually end up in new elections. That has shown in the more conciliatory tone of the parliament’s new speaker, Roger Torrent, who spoke of the need for unity in his inauguration speech. \nThere is no other obvious candidate because ERC’s leader, Oriol Junqueras, is in jail. But the Catalan parliament would have two months to agree on a candidate. \nIn that scenario, tensions would ease and that could eventually allow the jailed separatists to be freed. Puigdemont could continue to play a role from Brussels and may eventually be allowed back without risking jail. \nAnalysts and politicians alike agree that even in that case there would still be much to do to bridge the gap between those who back and oppose the independence. Rajoy should seek to woo the more moderate nationalist voters by offering more powers to Catalonia within Spain, analysts say. - DO NOT RULE OUT THE UNEXPECTED \nIf one thing is certain with the Catalonia crisis, it is the likelihood of last minute changes and unexpected moves. \nWhether with the independence referendum (banned but which took place anyway), the declaration of independence that followed (made and then suspended), or Puigdemont’s sudden appearance in Brussels, separatists have shown a knack for the 11th hour move. Additional reporting by Inmaculada Sanz; Editing by Angus MacSwan", "external_links": [], "published": "2018-01-29T13:21:00.000+02:00", "crawled": "2018-01-29T13:57:07.001+02:00", "highlightTitle": ""}