{"organizations": [], "uuid": "550674bcb85a67488acc0e4d51326b218ff43ac7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/slovenia-strike/update-1-slovenian-public-sector-workers-strike-for-higher-wages-idUSL8N1PJ4GW", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Slovenian public sector workers strike for higher wages", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T22:18:00.000+02:00", "replies_count": 0, "uuid": "550674bcb85a67488acc0e4d51326b218ff43ac7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/slovenia-strike/update-1-slovenian-public-sector-workers-strike-for-higher-wages-idUSL8N1PJ4GW", "ord_in_thread": 0, "title": "UPDATE 1-Slovenian public sector workers strike for higher wages", "locations": [], "entities": {"persons": [{"name": "lidija jerkic", "sentiment": "none"}, {"name": "jakob pocivavsek", "sentiment": "none"}, {"name": "cerar", "sentiment": "none"}, {"name": "marja novak", "sentiment": "none"}], "locations": [{"name": "ljubljana", "sentiment": "none"}, {"name": "ljubljana", "sentiment": "none"}], "organizations": [{"name": "zsss", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* One-day stoppage launched by 30,000 workers\n* More than 2,000 stage street protest for more pay\n* Pay should rise 16-20 pct-union official\n* Cerar decries unions’ “extreme pressures” (Adds street protest, Quote: s)\nBy Marja Novak\nLJUBLJANA, Jan 24 (Reuters) - About 30,000 Slovenian public servants including customs officers, nurses, social workers and university professors started a one-day strike on Wednesday to demand higher wages.\nOver 2,000 people protested for more pay in front of the government building in Ljubljana at noon, singing, blowing whistles and carrying banners which said: “Higher wages to all, not just the elites” and “Give us back what you took from us”.\n“The government is sending us a message that there is money for the rich but never for the rest,” Lidija Jerkic, the head of trade union ZSSS, told protesters.\n“We asked yesterday, we are demanding today, we will take tomorrow,” she added.\nJakob Pocivavsek, the unions’ head of strike coordination, told Reuters public sector pay should rise by 16 to 20 percent over a period to be determined in talks with the government.\n“Although this is the fifth year of economic growth some wage restrictions imposed in 2012 have not been lifted yet. It is time to scrap all restrictions and increase wages,” he said.\nSlovenia curbed public sector wage growth in 2012 amid a severe financial crisis which ended with a bank overhaul in 2013 that enabled the country to narrowly avoid an international bailout. It returned to economic growth a year later.\nLast year the government increased wages of doctors, public sector directors and school headmasters, which prompted similar demands among other public sector servants.\nAnalysts said unions had increased their demands in recent months also because they hoped the centre-left government may be more generous ahead of a parliamentary election due in June.\nWAGE BILL “We are trying to share the effects of economic growth as fairly as possible ... and only in the past two years the public sector wage bill was increased by 10.7 percent while the average wage rose by seven percent,” Prime Minister Miro Cerar told parliament on Monday.\n“That is why it is really hard to understand these extreme pressures of trade unions with enormous demands for more money,” he said, adding: “We cannot share what we do not have”.\nBut protesters said wage hikes so far were not big enough.\n“We are fighting to get back what was taken from us (in 2012). Many public sector employees, like cooks and cleaners, find it hard to make ends meet,” a 43-year-old protester, social worker Gordana Kosanic, said.\nThe government has said unions’ demands have reached almost one billion euros ($1.23 billion) and are unacceptable as they are not justified by productivity and economic growth and would threaten the planned fiscal consolidation.\n“If we increase the cost of labour in the public sector by one billion euros, we break macroeconomic balances. As a society we cannot survive that,” Public Administration Minister Boris Koprivnikar said.\nPolicemen, nurses and teachers plan separate strikes in February unless the government agrees to raise wages by then.\nSlovenia, a 40-billion-euro economy, expects economic expansion of 3.9 percent this year versus 4.4 percent in 2017, boosted by higher exports and investments. ($1 = 0.8120 euros) (Reporting By Marja Novak, Editing by William Maclean)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T22:18:00.000+02:00", "crawled": "2018-01-25T12:55:21.062+02:00", "highlightTitle": ""}