{"organizations": [], "uuid": "54442b926e90708ccf338e3a3aac3c89844566a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 57}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104939231-GettyImages-678169248.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/10/activision-blizzard-ceo-kotick-overwatch-league-seeing-a-lot-traction.html", "country": "US", "domain_rank": 767, "title": "Activision Blizzard CEO Kotick: Overwatch League seeing a lot traction", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-11T01:24:00.000+02:00", "replies_count": 0, "uuid": "54442b926e90708ccf338e3a3aac3c89844566a8"}, "author": "Michelle Fox", "url": "https://www.cnbc.com/2018/01/10/activision-blizzard-ceo-kotick-overwatch-league-seeing-a-lot-traction.html", "ord_in_thread": 0, "title": "Activision Blizzard CEO Kotick: Overwatch League seeing a lot traction", "locations": [], "entities": {"persons": [{"name": "kotick", "sentiment": "negative"}, {"name": "bobby kotick", "sentiment": "none"}], "locations": [], "organizations": [{"name": "overwatch league", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Activision Blizzard is making a big bet on esports, kicking off the inaugural season of its Overwatch League on Wednesday night.\nWhile it may take a while to see an impact on the company's bottom line, CEO Bobby Kotick told CNBC there has already been a lot of excitement surrounding the league.\n\"It's a ways before you're going to see certain revenue streams, but we're already seeing a lot of traction and enthusiasm from fans,\" Kotick said in an interview that aired on \" Fast Money .\"\nThe competition is organized by cities. For the first season, 12 franchises are representing major cities around the globe.\nThe video game giant, which is behind \"Call of Duty\" and \"Candy Crush,\" will broadcast the games on several platforms, including Amazon's Twitch.\nWhen asked if the new league is a way to promote the games or a way to drive revenue through the competitions themselves, Kotick said it was both.\n\"All of the commercial opportunities that exist in professional sports are opportunities that are available to us also,\" he said. \"Plus you have virtual items. You have over-the-top advertising opportunities that wouldn't exist in traditional sports.\"\nHe added: \"We have the best in both worlds and we have an enormous fan base that we're satisfying.\"\nAs for whether Activision will accept bitcoin or other cryptocurrencies as payment, Kotick said it is important for its 400 million customers in 196 countries to use whatever payment method they have access to.\n\"We are very supportive of whatever it is, the mechanism that our customers chose to pay,\" he said.\nActivision Blizzard is up more than 77 percent in the last 12 months.\n—CNBC's Julia Boorstin contributed to this report.", "external_links": [], "published": "2018-01-11T01:24:00.000+02:00", "crawled": "2018-01-11T01:33:00.001+02:00", "highlightTitle": ""}