{"organizations": [], "uuid": "bcb26f7b63e9fb3decd580ec16caa4f03ed710b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-illinois-transgender/illinois-judge-denies-transgender-student-unrestricted-locker-room-access-idUSKBN1FE36D", "country": "US", "domain_rank": 408, "title": "Illinois judge denies transgender student unrestricted locker room access", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:31:00.000+02:00", "replies_count": 0, "uuid": "bcb26f7b63e9fb3decd580ec16caa4f03ed710b9"}, "author": "", "url": "https://www.reuters.com/article/us-illinois-transgender/illinois-judge-denies-transgender-student-unrestricted-locker-room-access-idUSKBN1FE36D", "ord_in_thread": 0, "title": "Illinois judge denies transgender student unrestricted locker room access", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO (Reuters) - An Illinois judge on Thursday denied a Chicago-area transgender student’s demand to use the girls’ locker room at a local high school without being restricted to a private changing area inside the locker room.\nCook County Judge Thomas Allen rejected Palatine High School student Nova Maday’s request for a preliminary injunction that would have allowed unrestricted use, according to the American Civil Liberties Union of Illinois, which sued in November on Maday’s behalf.\nThe case marked the latest legal clash over the use of school bathrooms and facilities by transgender students in the United States, which has sparked battles in North Carolina, Kentucky and elsewhere.\nPalatine-Schaumburg High School District 211 requires transgender students to use a private changing area inside the locker rooms of their preferred gender. The judge ruled that a preliminary injunction was not warranted as the case proceeds.\n“I am disappointed with the decision today,“ Maday said in a statement. ”All I want is to be accepted by my school for who I am – a girl – and be able to take gym and use the locker room to change clothes like the other girls in my class.”\nSuperintendent Daniel Cates said in a statement to Reuters that the ruling upheld a balance between supporting students and privacy rights.\n“We are committed to providing supportive access to our school locker rooms, access that respects and balances the identity and privacy rights of all of the nearly 12,000 teenagers in our high schools,” he said. “Our practices welcome transgender teens into the locker room of their identity with an agreement that they change or shower in the locker room privacy stalls.”\nJohn Knight, LGBTQ & HIV Project Director of the ACLU of Illinois, said it amounted to discrimination and the group was deciding how to move forward.\nThe conservative legal groups Alliance Defending Freedom and Thomas More Society, which intervened in the lawsuit, said in a statement the decision ensures student privacy.\n“Schools should never be forced to give male students unrestricted access to areas where girls are changing clothes. Claiming a female gender identity doesn’t change that,” Thomas More attorney Thomas Brejcha said.\nThe issue has played out most prominently in North Carolina, which was mired in controversy and litigation after Republican lawmakers enacted a since-rescinded law in 2016 that restricted bathroom choice in state-run buildings to the sex on people’s birth certificates rather than their gender identity.\nReporting by Chris Kenning; Editing by Cynthia Osterman\n ", "external_links": [], "published": "2018-01-26T00:31:00.000+02:00", "crawled": "2018-01-26T00:52:12.001+02:00", "highlightTitle": ""}