{"organizations": [], "uuid": "6554eb3d6a01af94adf60d8c00ab28c16998aea8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-slips-vs-euro-after-strong-euro-zone-consumer-confidence-data-idUSL8N1PI4RD", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar slips vs euro after strong euro zone consumer confidence data", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.928, "site_type": "news", "published": "2018-01-24T00:09:00.000+02:00", "replies_count": 0, "uuid": "6554eb3d6a01af94adf60d8c00ab28c16998aea8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-slips-vs-euro-after-strong-euro-zone-consumer-confidence-data-idUSL8N1PI4RD", "ord_in_thread": 0, "title": "FOREX-Dollar slips vs euro after strong euro zone consumer confidence data", "locations": [], "entities": {"persons": [{"name": "naeem", "sentiment": "none"}, {"name": "saqib iqbal ahmed", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar index hits fresh three-year low\n* Euro zone consumer confidence jumps more than expected in Jan\n* Dollar slips vs yen after BoJ meet (Updates prices and market activity to U.S. market open, changes dateline; previous LONDON)\nBy Saqib Iqbal Ahmed\nNEW YORK, Jan 23 (Reuters) - The dollar slipped to a fresh three-year low against a basket of currencies on Tuesday after data showed euro zone consumer confidence jumped much more than expected in January, underlining the strong momentum in the euro zone economy.\nThe dollar index, which measures the greenback against six rival currencies, was down 0.34 percent at 90.094, after slipping as low as 90.096, its lowest since December 2014.\nThe euro was up 0.33 percent to $1.23 against the greenback.\nThe European Commission said consumer confidence in the 19 euro zone countries in January rose to 1.3 points from 0.5 point in December, well above the market consensus of a rise to 0.6.\n“The number tells us one story, which is that the growth is booming in the euro zone. Hence, we are seeing massive buying pressure for the euro,” said Naeem Aslam, chief market analyst for Think Markets in London.\nThe euro has rallied this year, boosted by growing optimism that a strengthening economy would prompt the European Central Bank to signal a quicker exit from its years of efforts to stimulate the economy than previously forecast.\nThe dollar failed to hold early gains against the Japanese yen after the Bank of Japan kept monetary policy unchanged.\nOn Tuesday, the BoJ said risks to prices were still tilted to the downside, though it did offer a more upbeat view on inflation expectations, saying they were “moving sideways recently.” In October, it described them as being on a weak note.\nThe greenback slipped about half a percent to 110.25 yen, its lowest since Wednesday.\nThe yen has gained since the BoJ trimmed its buying of long-dated government bonds earlier this month, sparking speculation of an eventual exit from its large stimulus.\n“Before today, people had been buying the yen on this hawkish take on the BoJ. Well, the BoJ tried to push back against it, but it really didn’t stick,” said Win Thin, the Global Head of Emerging Markets Strategy at Brown Brothers Harriman.\n“We are still stuck with this sell-the dollar-buy-the-yen trend right now,” he said.\nThe British pound pushed above the $1.40 mark, extending a rally in which growing optimism about the UK economy and protracted dollar weakness have trumped worries about the terms of Britain’s exit from the European Union.\nLatin American currencies weakened on concerns over potential U.S. protectionism.\nReporting by Saqib Iqbal Ahmed; Editing by Jonathan Oatis\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T00:09:00.000+02:00", "crawled": "2018-01-24T15:43:55.000+02:00", "highlightTitle": ""}