{"organizations": [], "uuid": "e758f6361e92aa309de9b0272f1756043cb8a669", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222450076&w=1200&r=LYNXMPEE0F124", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-mun-pogba/pogba-laying-the-foundations-for-sanchez-at-united-idUKKBN1F51UF", "country": "US", "domain_rank": 408, "title": "Pogba laying the foundations for Sanchez at United", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:57:00.000+02:00", "replies_count": 0, "uuid": "e758f6361e92aa309de9b0272f1756043cb8a669"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-mun-pogba/pogba-laying-the-foundations-for-sanchez-at-united-idUKKBN1F51UF", "ord_in_thread": 0, "title": "Pogba laying the foundations for Sanchez at United", "locations": [], "entities": {"persons": [{"name": "sanchez", "sentiment": "negative"}, {"name": "pogba", "sentiment": "negative"}, {"name": "nemanja matic", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "alexis sanchez", "sentiment": "none"}, {"name": "simon evans", "sentiment": "none"}, {"name": "paul pogba", "sentiment": "none"}], "locations": [{"name": "manchester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "old trafford", "sentiment": "none"}], "organizations": [{"name": "united", "sentiment": "negative"}, {"name": "juventus", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "manchester united vs stoke city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 3:01 PM / Updated 10 minutes ago Pogba laying the foundations for Sanchez at United Simon Evans 3 Min Read \nMANCHESTER, England (Reuters) - If Arsenal forward Alexis Sanchez does make the switch to Manchester United during this transfer window, he will join a team that, while 12 points behind Premier League leaders Manchester City, have built the necessary platform for the Chilean’s strengths. Soccer Football - Premier League - Manchester United vs Stoke City - Old Trafford, Manchester, Britain - January 15, 2018 Manchester United's Paul Pogba reacts REUTERS/Andrew Yates \nAnd what has become increasingly clear this season is that the key element of that platform is Paul Pogba. \nThe French midfielder did not quite live up to expectations in his first season back at United following his, then world record, 89 million pound move from Juventus in 2016. \nWhile far from a flop, Pogba certainly didn’t sparkle and shine the way United hoped from their latest expensive toy. \nBut this season, with the arrival of Nemanja Matic from Chelsea to add defensive solidity to the centre of midfield, the 24-year-old has begun to produce the moments of quality that his manager Jose Mourinho knew his team needed. \nIt is not always flashy or spectacular and Pogba isn’t bringing the crowd to their feet with a breathtaking moment in the way that Kevin De Bruyne at Manchester City has done this season. \nBut what he is delivering is consistency and a constant threat to opposition defences. \nIn Monday’s 3-0 league win over Stoke, Pogba made 77 passes with a completion rate of 90 percent and his 96 touches were the most of any United player on the field. \nWhile he was still delivering tackles and challenges, it was clear his role was further up the field, providing the central reference point for the wide-men and striker Romelu Lukaku. \nPogba provided the assists for Antonio Valencia’s opener and Anthony Martial’s second and varied his play with clever short passes and more ambitious cross-field balls. \n“I played further forward so I had more freedom, to pass forward and find my team mates,” he said after the game. \n“I can use more of my attributes to go forward to use my power, my shooting, or try to make an assist, so yes, playing up the field suits me more.” INFLUENTIAL \nIt doesn’t take a statistical genius to realise the importance of Pogba to United. \nIn the team’s three defeats in the league this season - at Huddersfield Town and Chelsea and at home to City, Pogba was absent through injury. \nWith Pogba on the field, United are unbeaten - with nine wins and four draws. Indeed, the midfielder has not been on the losing side in his last 35 Premier League games for United. \n“I think he is happy with the way the team is playing and he’s happy because the team is changing the profile and the profile is going more in his direction,” said Mourinho. \nIf that profile soon includes the sharp, incisive forward play of Sanchez, to compliment the physical power of Lukaku and the pace of Martial and Marcus Rashford, Pogba should be even happier. \nAnd United fans worried about a lengthy spell of dominance from their big-spending neighbours, might start to feel the future holds more promise. Reporting by Simon Evans; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-16T16:57:00.000+02:00", "crawled": "2018-01-16T17:20:34.000+02:00", "highlightTitle": ""}