{"organizations": [], "uuid": "0aae75a257be632f7bc0b652eed02601acaaf8b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-ac-ocean-walk-announces-acquisition-of-atlantic-citys-revel-hotel-and-casino.html", "country": "US", "domain_rank": 767, "title": "AC OCEAN WALK Announces Acquisition of Atlantic City's Revel Hotel and Casino", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.588, "site_type": "news", "published": "2018-01-08T19:51:00.000+02:00", "replies_count": 0, "uuid": "0aae75a257be632f7bc0b652eed02601acaaf8b5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-ac-ocean-walk-announces-acquisition-of-atlantic-citys-revel-hotel-and-casino.html", "ord_in_thread": 0, "title": "AC OCEAN WALK Announces Acquisition of Atlantic City's Revel Hotel and Casino", "locations": [], "entities": {"persons": [{"name": "bruce deifik", "sentiment": "none"}], "locations": [{"name": "atlantic city", "sentiment": "none"}, {"name": "n.j.", "sentiment": "none"}, {"name": "ocean resort casino atlantic city", "sentiment": "none"}, {"name": "atlantic city boardwalk", "sentiment": "none"}], "organizations": [{"name": "cean", "sentiment": "none"}, {"name": "revel casino hotel", "sentiment": "none"}, {"name": "stockton university", "sentiment": "none"}, {"name": "ocean resort casino", "sentiment": "none"}, {"name": "ac ocean walk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Property to be re-branded Ocean Resort Casino\nATLANTIC CITY, N.J., Jan. 8, 2018 /PRNewswire/ -- AC OCEAN WALK announced today that it acquired the former Revel Casino Hotel in Atlantic City for $200 million. The property will be re-branded as the Ocean Resort Casino, giving a nod to the property's location on 20 acres along the famed Atlantic City Boardwalk, and the ocean views featured in its 1,399 rooms. AC OCEAN WALK will begin work to ready the property for operation immediately, with plans to open in summer 2018.\nWhen fully operational, the property will provide between 2500-3000 jobs to Atlantic City, contributing greatly to the city's economic resurgence.\n\"We are incredibly excited that we were able to take advantage of the opportunity to acquire this tremendous property at a time when Atlantic City is seeing great economic strides. Now the city has a number of exciting new projects with our property and the Hard Rock, as well as Stockton University's new campus and the expansion of the medical center,\" said Bruce Deifik, the Chairman of AC OCEAN WALK.\n\"We are grateful for the wonderful team at JP Morgan and others that helped us on this eight month journey, and we would especially like to thank Atlantic City and the State of New Jersey for their hospitality, thoughtfulness and professionalism. We look forward to providing the same to all of the surrounding residents when the Ocean is operational,\" Deifik added.\nThe Revel Casino Hotel was originally opened in April 2012 with a total investment of nearly $3 billion and became a landmark building along the Atlantic City Boardwalk not only for its height as the tallest building in the city, but for the attention to detail that went into building the tower and casino.\n\"The former Revel property opened at a time when Atlantic City was still in economic recovery and operationally it just did not cater to the customer base for this destination. However, given the extraordinary quality and investment made during its development, the new 'Ocean' will represent one of the finest hotel, casino properties in existence today in an improving market that has demonstrated strength and resilience,\" Deifik said.\nThe newly envisioned Ocean Casino Resort will take full advantage of the 6.4 million total square feet of the property with plans for 138,000 square feet of gaming space—featuring 100 table games and 2,200 slot machines and plans for a \"best in market\" sports book.\n\"Atlantic City is coming back with a vengeance and with the groundwork for the legalization of sports betting, we foresee a great opportunity to bring a state of the art sports book to a city which caters to a large and diverse sports market,\" Deifik said.\nOcean Resort Casino will maintain the 165,000 square feet in meeting and convention space, as well as the 5,700 seat concert hall with space for potential future expansion. The property has an attached parking structure with 7,700 spaces making all of its hotel, casino and entertainment venues easily accessible for all guests.\n\"It is our mission and vision to fully serve the customer base of Atlantic City. In that regard, we are working to bring back some of the restaurants that were successful at the property and we have worked diligently to create some specialized new venues including a top Asian noodle bar and a high end players club. Our investment in this property will make certain there is something for everyone at the Ocean,\" Deifik said.\nIn addition to the hotel and casino tower, the property includes a unique central utility plant that was sized to handle the current and potential future electrical and thermal requirements of the site, which Deifik said \"is of great added value to this property.\"\n\"On a personal note, this is a dream come true. Without the support of my family, who saw my vision and belief in Atlantic City as a market in resurgence, today would never have happened and therefore, I am truly grateful to them,\" Deifik said.\nIntegrated properties is the principal owner and managing partner of AC OCEAN WALK. Integrated Properties is a Denver-based commercial and real estate development company, formed by Bruce and Nancy Deifik in 1990. The company manages assets, property, leasing and disposition of the commercial property portfolio of Deifik and his investment partners. Since its inception, the company has acquired over 103 commercial properties including mixed-use, office, retail, hotel/casino, apartment and warehouses in California, Colorado, Florida, Massachusetts, Nevada and Texas. The company's portfolio encompasses over 8.5 million square feet and specializes in urban mixed-use development.\nView original content with multimedia: http://www.prnewswire.com/news-releases/ac-ocean-walk-announces-acquisition-of-atlantic-citys-revel-hotel-and-casino-300579115.html\nSOURCE AC OCEAN WALK", "external_links": ["http://www.prnewswire.com/news-releases/ac-ocean-walk-announces-acquisition-of-atlantic-citys-revel-hotel-and-casino-300579115.html"], "published": "2018-01-08T19:51:00.000+02:00", "crawled": "2018-01-08T21:19:41.014+02:00", "highlightTitle": ""}