{"organizations": [], "uuid": "7e6539e0914c050b188143d556f28e7ab75e2731", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/27/reuters-america-update-5-wynn-resorts-ceo-calls-sexual-misconduct-accusations-preposterous-stock-falls.html", "country": "US", "domain_rank": 767, "title": "UPDATE 5-Wynn Resorts CEO calls sexual misconduct accusations 'preposterous'; stock falls", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T07:58:00.000+02:00", "replies_count": 0, "uuid": "7e6539e0914c050b188143d556f28e7ab75e2731"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/27/reuters-america-update-5-wynn-resorts-ceo-calls-sexual-misconduct-accusations-preposterous-stock-falls.html", "ord_in_thread": 0, "title": "UPDATE 5-Wynn Resorts CEO calls sexual misconduct accusations 'preposterous'; stock falls", "locations": [], "entities": {"persons": [{"name": "steve wynn", "sentiment": "none"}, {"name": "wynn", "sentiment": "none"}, {"name": "patricia mulroy", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "nevada gaming commission", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "wynn resorts ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "stock falls@ (Adds company forming special panel to investigate allegations)\nJan 26 (Reuters) - Las Vegas casino mogul Steve Wynn has routinely subjected women who work for him to unwanted sexual advances in a pattern of misconduct detailed by dozens of past and present employees, the Wall Street Journal reported on Friday, but the billionaire denied the accusations as \"preposterous.\"\nHours later, the board of directors of Wynn Resorts Ltd , of which Wynn is founder, chairman and chief executive officer, said it had met to form a special committee consisting solely of independent directors to investigate the allegations contained in the Journal's article.\nThe announcement of the inquiry followed a drop in the company's stock of more than 10.1 percent in heaving trading, closing at $180.29 per share on the Nasdaq exchange on Friday after publication of the Journal story.\nThe special investigation panel will be chaired by Patricia Mulroy, a member of the board's corporate governance and compliance committees and a former member of the Nevada Gaming Commission, the board said in a statement emailed to Reuters.\n\"The board is deeply committed to ensuring the safety and wellbeing of all the company's employees and to operating with the highest ethical standards,\" the statement said.\nEarlier in the day, the company appeared to side with its chairman in dismissing the Journal's article, saying in a statement that the newspaper account \"reflected allegations\" made by his ex-wife, Elaine Wynn, in her litigation against him and the company.\nThe Wall Street Journal said former and current company staff members it interviewed had accused Wynn of creating a hostile work environment for women and of regularly pressuring employees to perform sex acts.\nThe report was the latest in a wave of sexual abuse and harassment allegations leveled against powerful men during the past year, especially in the media and entertainment industries and politics.\nWynn has straddled both those worlds, as a prominent figure in the casino resort business and onetime rival of Donald Trump. Wynn was named finance chairman of the U.S. Republican National Committee after Trump became president.\nAVOIDING THE BOSS\nFormer workers, the Journal said, told of employees going to such lengths as making phony entries in appointment books to help other female employees avoid a request for services in Wynn's office, or arranged for others to pose as assistants so they would not be alone with him.\nOthers, the newspaper said, recounted female employees hiding in the lavatory or backrooms when they learned he was on his way to a hotel salon.\nThe article said Wynn paid a $7.5 million settlement to a former manicurist at his flagship Wynn Las Vegas resort who had accused Wynn of forcing her to have sex in his office in 2005.\nThe Journal said the alleged incident and settlement were mentioned obliquely in court documents filed in a lawsuit brought by the casino owner's former wife over control of her stock in the company.\nSteve Wynn, who turns 76 on Saturday, denied the allegations in a statement emailed to Reuters.\n\"The idea that I ever assaulted any woman is preposterous,\" he said. \"The instigation of these accusations is the continued work of my ex-wife, Elaine Wynn, with whom I am involved in a terrible and nasty lawsuit in which she is seeking a revised divorce settlement.\"\nA spokeswoman for Elaine Wynn, 75, declined comment, but her Washington-based attorney, James Cole, told Reuters the notion that his client fomented the allegations in the Journal article \"is just not true.\"\nThe couple first married in 1963 and divorced in 1986. They remarried in 1991 and divorced again in 2010, according to court papers. In an escalating battle that followed their bitter second split, Elaine Wynn sued her former spouse in 2016 seeking to gain control over her 9.4 percent stock in Wynn Resorts.\nThe lawsuit accused her ex-husband of breaching a 2010 stockholder agreement by engineering her ouster from the company's board the previous April.\nWynn owns roughly 11.8 percent of his company, regulatory filings show, giving him a stake worth close to $2.2 billion. Forbes magazine puts his overall net worth at about $3.5 billon.\nIn addition to Wynn Las Vegas, the company's assets include Encore at Wynn Las Vegas and Wynn Macau. Steve Wynn also helped develop such Las Vegas hotel-casino properties as the Bellagio, the Mirage and Treasure Island.\nThe Journal said none of the 150 people contacted for its story had reached out to the newspaper, and that most of those interviewed expressed fear that Wynn's influence in the casino industry could hurt their ability to find work elsewhere.\n(Reporting and writing by Steve Gorman in Los Angeles; Additional reporting by Caroline Valetkevitch in New York and Pranav Kran in Bengaluru; Editing by Clive McKeef, Lisa Shumaker and Nick Macfie)", "external_links": [], "published": "2018-01-27T07:58:00.000+02:00", "crawled": "2018-01-27T08:38:06.009+02:00", "highlightTitle": ""}