{"organizations": [], "uuid": "9fed5b18e92c9f08fc2f85c320dd77a452eb3679", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-kilroy-realty-announces-dates-for-2017-fourth-quarter-earnings-release-and-conference-call.html", "country": "US", "domain_rank": 767, "title": "Kilroy Realty Announces Dates for 2017 Fourth Quarter Earnings Release and Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T01:18:00.000+02:00", "replies_count": 0, "uuid": "9fed5b18e92c9f08fc2f85c320dd77a452eb3679"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-kilroy-realty-announces-dates-for-2017-fourth-quarter-earnings-release-and-conference-call.html", "ord_in_thread": 0, "title": "Kilroy Realty Announces Dates for 2017 Fourth Quarter Earnings Release and Conference Call", "locations": [], "entities": {"persons": [], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "kilroy realty corporation", "sentiment": "negative"}, {"name": "kilroy realty", "sentiment": "negative"}, {"name": "krc", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES--(BUSINESS WIRE)-- Kilroy Realty Corporation (NYSE: KRC) announced it will release 2017 fourth quarter financial results after the market closes on Wednesday, January 31, 2018. The company will hold a conference call to discuss the results at 10:00 a.m. PT / 1:00 p.m. ET on Thursday, February 1, 2018.\nTo participate in the call by telephone, please dial (866) 312-7299 five to 10 minutes prior to the start time to allow time for registration. International callers should dial (412) 317-1070.\nIn order to bypass speaking to the operator on the day of the call, please pre-register anytime at http://dpregister.com/10115542 .\nThis call will be broadcast live over the Internet and can be accessed on the Investor Relations section of Kilroy Realty’s website at http://investors.kilroyrealty.com/event .\nA replay will also be available beginning February 1, 2018 through February 8, 2018, by dialing (877) 344-7529 and entering passcode 10115542. International callers should dial (412) 317-0088 and enter the same passcode.\nAbout Kilroy Realty Corporation . Kilroy Realty Corporation (KRC), a publicly traded real estate investment trust and member of the S&P MidCap 400 Index, is one of the West Coast’s premier landlords. The company has over 70 years of experience developing, acquiring and managing office and mixed-use real estate assets. The company provides physical work environments that foster creativity and productivity and serves a broad roster of dynamic, innovation-driven tenants, including technology, entertainment, digital media and health care companies.\nAt September 30, 2017, the company’s stabilized portfolio totaled approximately 13.7 million square feet of office space located in the coastal regions of Los Angeles, Orange County, San Diego, the San Francisco Bay Area and Greater Seattle and 200 residential units located in the Hollywood submarket of Los Angeles. In addition, KRC had four projects totaling approximately 1.8 million square feet of office space, 237 residential units and 96,000 square feet of retail space under construction.\nThe company has been recognized by GRESB as the North American leader in office sustainability for the last four years and is listed in the Dow Jones Sustainability World Index. At the end of the third quarter, the company’s stabilized portfolio was 55% LEED certified and 73% of eligible properties were ENERGY STAR certified. More information is available at http://www.kilroyrealty.com .\nForward-Looking Statements. This press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements are based on our current expectations, beliefs and assumptions, and are not guarantees of future performance. Forward-looking statements are inherently subject to uncertainties, risks, changes in circumstances, trends and factors that are difficult to predict, many of which are outside of our control. Accordingly, actual performance, results and events may vary materially from those indicated in the forward-looking statements, and you should not rely on the forward-looking statements as predictions of future performance, results or events. Numerous factors could cause actual future performance, results and events to differ materially from those indicated in the forward-looking statements, including, among others: global market and general economic conditions and their effect on our liquidity and financial conditions and those of our tenants; adverse economic or real estate conditions generally, and specifically, in the States of California and Washington; risks associated with our investment in real estate assets, which are illiquid, and with trends in the real estate industry; defaults on or non-renewal of leases by tenants; any significant downturn in tenants’ businesses; our ability to re-lease property at or above current market rates; costs to comply with government regulations, including environmental remediation; the availability of cash for distribution and debt service and exposure to risk of default under debt obligations; increases in interest rates and our ability to manage interest rate exposure; the availability of financing on attractive terms or at all, which may adversely impact our future interest expense and our ability to pursue development, redevelopment and acquisition opportunities and refinance existing debt; a decline in real estate asset valuations, which may limit our ability to dispose of assets at attractive prices or obtain or maintain debt financing, and which may result in write offs or impairment charges; significant competition, which may decrease the occupancy and rental rates of properties; potential losses that may not be covered by insurance; the ability to successfully complete acquisitions and dispositions on announced terms; the ability to successfully operate acquired, developed and redeveloped properties; the ability to successfully complete development and redevelopment projects on schedule and within budgeted amounts; delays or refusals in obtaining all necessary zoning, land use and other required entitlements, governmental permits and authorizations for our development and redevelopment properties; increases in anticipated capital expenditures, tenant improvement and/or leasing costs; defaults on leases for land on which some of our properties are located; adverse changes to, or implementations of, applicable laws, regulations or legislation; risks associated with joint venture investments, including our lack of sole decision-making authority, our reliance on co-venturers’ financial condition and disputes between us and our co-venturers; environmental uncertainties and risks related to natural disasters; and our ability to maintain our status as a REIT. These factors are not exhaustive and additional factors could adversely affect our business and financial performance. For a discussion of additional factors that could materially adversely affect our business and financial performance, see the factors included under the caption “Risk Factors” in our annual report on Form 10-K for the year ended December 31, 2016 and our other filings with the Securities and Exchange Commission. All forward-looking statements are based on currently available information, and speak only as of the date on which they are made. We assume no obligation to update any forward-looking statement made in this press release that becomes untrue because of subsequent events, new information or otherwise, except to the extent we are required to do so in connection with our ongoing requirements under federal securities laws.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103006278/en/\nKilroy Realty Corporation\nTyler H. Rose\nExecutive Vice President\nand Chief Financial Officer\n(310) 481-8484\nor\nMichelle Ngo\nSenior Vice President\nand Treasurer\n(310) 481-8581\nSource: Kilroy Realty Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fdpregister.com%2F10115542&esheet=51737586&newsitemid=20180103006278&lan=en-US&anchor=http%3A%2F%2Fdpregister.com%2F10115542&index=1&md5=9aa1e0d64b93d68bb09d809bd76853c1", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.kilroyrealty.com%2Fevent&esheet=51737586&newsitemid=20180103006278&lan=en-US&anchor=http%3A%2F%2Finvestors.kilroyrealty.com%2Fevent&index=2&md5=6ae422c1cfece3f20a068a8427eb097f", "http://investors.kilroyrealty.com/event", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.kilroyrealty.com&esheet=51737586&newsitemid=20180103006278&lan=en-US&anchor=http%3A%2F%2Fwww.kilroyrealty.com&index=3&md5=bcabadaebc06859be18dc39dcb0184c6", "http://dpregister.com/10115542", "http://www.businesswire.com/news/home/20180103006278/en/"], "published": "2018-01-04T01:18:00.000+02:00", "crawled": "2018-01-04T00:25:08.003+02:00", "highlightTitle": ""}