{"organizations": [], "uuid": "c21872518e99a76bd2eefb7bb703b76854c2121d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-post-holdings-schedules-first-quarter-fiscal-year-2018-conference-call.html", "country": "US", "domain_rank": 767, "title": "Post Holdings Schedules First Quarter Fiscal Year 2018 Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T01:01:00.000+02:00", "replies_count": 0, "uuid": "c21872518e99a76bd2eefb7bb703b76854c2121d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-post-holdings-schedules-first-quarter-fiscal-year-2018-conference-call.html", "ord_in_thread": 0, "title": "Post Holdings Schedules First Quarter Fiscal Year 2018 Conference Call", "locations": [], "entities": {"persons": [{"name": "jeff a. zadoks", "sentiment": "none"}, {"name": "robert v. vitale", "sentiment": "none"}], "locations": [{"name": "st. louis", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "post holdings, inc.", "sentiment": "neutral"}, {"name": "post", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ST. LOUIS, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Post Holdings, Inc. (NYSE:POST), a consumer packaged goods holding company, today announced it will hold a conference call on Friday, February 2, 2018 at 9:00 a.m. EST to discuss financial results for the first quarter of fiscal year 2018 and fiscal year 2018 outlook and to respond to questions. Robert V. Vitale, President and Chief Executive Officer, and Jeff A. Zadoks, Executive Vice President and Chief Financial Officer, will participate in the call.\nPost also announced it plans to release its financial results for the first quarter of fiscal year 2018 after market close on Thursday, February 1, 2018.\nInterested parties may join the conference call by dialing (877) 540-0891 in the United States and (678) 408-4007 from outside the United States. The conference identification number is 2992278. Interested parties are invited to listen to the webcast of the conference call, which can be accessed by visiting the Investor Relations section of Post’s website at www.postholdings.com .\nA replay of the conference call will be available through Saturday, February 17, 2018 by dialing (800) 585-8367 in the United States and (404) 537-3406 from outside the United States and using the conference identification number 2992278. A webcast replay also will be available for a limited period on Post’s website in the Investor Relations section.\nAbout Post Holdings, Inc.\nPost Holdings, Inc., headquartered in St. Louis, Missouri, is a consumer packaged goods holding company operating in the center-of-the-store, foodservice, food ingredient, refrigerated, active nutrition and private label food categories. Through its Post Consumer Brands business, Post is a leader in the North American ready-to-eat cereal category offering a broad portfolio including recognized brands such as Honey Bunches of Oats®, Pebbles™, Great Grains® and Malt-O-Meal® bag cereal. Post also is a leader in the United Kingdom ready-to-eat cereal category with the iconic Weetabix® brand. Through Michael Foods, Post supplies innovative, value-added egg and refrigerated potato products to the foodservice and food ingredient channels. Through its refrigerated retail business, Post is a leader in the refrigerated side dish category offering potato, egg, sausage and cheese products through the Bob Evans®, All Whites®, Better’n Eggs®, Simply Potatoes® and Crystal Farms® brands. Post’s Active Nutrition platform aids consumers in adopting healthier lifestyles through brands such as Premier Protein®, PowerBar® and Dymatize®. Post’s Private Brands business manufactures private label peanut butter and other nut butters, dried fruit and nuts, pasta and granola. For more information, visit www.postholdings.com .\nContact:\nInvestor Relations\nBrad Harper\nbrad.harper@postholdings.com\n(314) 644-7626\nSource:Post Holdings, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/7bd688ca-efcf-4119-9376-b56a3813659b"], "published": "2018-01-17T01:01:00.000+02:00", "crawled": "2018-01-17T03:11:56.000+02:00", "highlightTitle": ""}