{"organizations": [], "uuid": "dd3afe7eb858c92ed2f1fe7f3693524ec57d9e29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-tdbbs-llc-announces-appointment-of-tim-hassett-as-ceo.html", "country": "US", "domain_rank": 767, "title": "TDBBS, LLC Announces Appointment of Tim Hassett as CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-23T14:30:00.000+02:00", "replies_count": 0, "uuid": "dd3afe7eb858c92ed2f1fe7f3693524ec57d9e29"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-tdbbs-llc-announces-appointment-of-tim-hassett-as-ceo.html", "ord_in_thread": 0, "title": "TDBBS, LLC Announces Appointment of Tim Hassett as CEO", "locations": [], "entities": {"persons": [{"name": "tim hassett", "sentiment": "negative"}, {"name": "hassett", "sentiment": "none"}], "locations": [{"name": "bregal partners richmond", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}, {"name": "tdbbs", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "bregal partners", "sentiment": "none"}, {"name": "kellogg", "sentiment": "none"}, {"name": "procter & gamble", "sentiment": "none"}, {"name": "campbell soup", "sentiment": "none"}, {"name": "beam suntory", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leadership Change Follows Growth Investment in TDBBS by Bregal Partners\nRICHMOND, Va.--(BUSINESS WIRE)-- TDBBS, LLC (“TDBBS” or the “Company”), a rapidly-growing natural dog treats and chews business, is pleased to announce the appointment of Tim Hassett as Chief Executive Officer. The hiring of Mr. Hassett follows a growth investment in the Company by leading middle market private equity firm Bregal Partners. The investment was made in partnership with the Company’s founder and management team, who remain significant shareholders in the business.\nMr. Hassett joins the Company from Beam Suntory, where he was President – Americas. He previously spent 10 years at Campbell Soup as Chief Customer Officer for the North America business, and also served at Kellogg’s and Procter & Gamble. He joins TDBBS with an exceptional track record of successfully growing global, consumer-focused businesses.\n“I am very excited for the opportunity to drive value creation at an organization as dynamic as TDBBS,” said Mr. Hassett. “The company has enormous potential, and I look forward to working closely with Bregal Partners and the management team in further growing TDBBS.”\nBregal Partners’ Managing Partner, Charles Yoon, stated, “We are thrilled Tim has joined the TDBBS team and are confident he is the right leader for the business. He is a world-class consumer-focused executive who has proven his ability to execute his vision and strategy while continuously inspiring those around him.”\nTDBBS, founded in 2007, is a market leader in providing healthy, natural dog treats and chews through a portfolio of brands, including Best Bully Sticks, Barkworthies, and Paw Luxury. In recent years, growth in the U.S. market for pet treats has outpaced the more mature pet food and supplies markets. Within pet treats, the natural and “occupational” chews category has been a key contributor to this growth as pet parents continue to view their dogs as members of the family, seeking out high quality products to keep their dogs busy, happy, and healthy. Items such as bully sticks, antlers, and other natural chews – many of which are single ingredient, high in protein, highly digestible, and offer dental benefits – provide pet parents with alternatives to rawhide, synthetic treats, and more traditional baked items that may contain artificial preservatives or long lists of ingredients with uncertain benefits.\nMr. Yoon further noted that Bregal had targeted the pet industry as an area of focus over the past two years, given positive industry trends and the team’s prior investment experience in the space. “We see a clear path for TDBBS to leverage its portfolio of high-quality products to take advantage of tailwinds surrounding the growing natural treats and chews category. As consumers increasingly demand higher quality, limited ingredient products for their pets, there is a notable opportunity to build greater awareness of the benefits of natural chews and drive new product innovation. We intend to continue investing behind our impressive team and infrastructure as we transform the natural chews category.”\nAvrum Elmakis, TDBBS’s founder, stated, “We are incredibly excited to bring Tim on board and to partner with Bregal. The Bregal team has many years of experience in the pet industry, which will prove to be an invaluable asset to the Company going forward. I have never been more excited about the growth prospects of the business, and I think we have an opportunity in the coming years to truly establish ourselves as the clear leaders in the natural chews category.”\nInvestment bank Harris Williams & Co. represented TDBBS, while Dechert LLP provided legal counsel to Bregal Partners on Bregal’s investment in TDBBS. BMO Sponsor Finance provided debt financing for the transaction. Financial terms of the transaction were not disclosed.\nAbout TDBBS\nTDBBS, based in Richmond, VA, is a leading provider of natural chews and pet treats. The Company operates a portfolio of brands including Best Bully Sticks, Barkworthies, and Paw Luxury, with a product offering spanning bully sticks, antlers, bones, jerky, and other natural chews. The Company specializes in products that are natural, limited ingredient, and high in protein. For more information on TDBBS, please visit www.tdbbsllc.com .\nAbout Bregal Partners\nBregal Partners is a leading middle market private equity firm with a focus on corporate social responsibility. The firm looks to acquire and grow market leading businesses in the consumer, food, multi-unit, and energy services industries. Bregal Partners is one of several dedicated firms under the Bregal Investments umbrella, which is a global private equity platform that has invested or committed over $12.5 billion since 2002. For more information on Bregal Partners, please visit www.bregalpartners.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005364/en/\nBackBay Communications\nPhilip Nunes, 617-391-0792\nphil.nunes@backbaycommunications.com\nSource: Bregal Partners", "external_links": ["http://www.businesswire.com/news/home/20180123005364/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tdbbsllc.com&esheet=51747084&newsitemid=20180123005364&lan=en-US&anchor=www.tdbbsllc.com&index=1&md5=e0f4983ddae48374832ab0bf3174d58a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bregalpartners.com&esheet=51747084&newsitemid=20180123005364&lan=en-US&anchor=www.bregalpartners.com&index=2&md5=15bed5720c14bd09a7de228f30a6427f"], "published": "2018-01-23T14:30:00.000+02:00", "crawled": "2018-01-23T14:17:26.000+02:00", "highlightTitle": ""}