{"organizations": [], "uuid": "3bdf4bbbef92a61373fff1ae024c6d8f45ff30d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-cymabay-announces-pricing-of-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "CymaBay Announces Pricing of Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-30T16:00:00.000+02:00", "replies_count": 0, "uuid": "3bdf4bbbef92a61373fff1ae024c6d8f45ff30d6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-cymabay-announces-pricing-of-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "CymaBay Announces Pricing of Public Offering of Common Stock", "locations": [], "entities": {"persons": [{"name": "oppenhe", "sentiment": "none"}, {"name": "cymabay", "sentiment": "none"}], "locations": [{"name": "newark", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "cymabay announces pricing of public offering of common stock", "sentiment": "negative"}, {"name": "cymabay therapeutics, inc.", "sentiment": "neutral"}, {"name": "leerink partners llc", "sentiment": "none"}, {"name": "evercore isi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEWARK, Calif., Jan. 30, 2018 (GLOBE NEWSWIRE) -- CymaBay Therapeutics, Inc. (Nasdaq:CBAY), a clinical-stage biopharmaceutical company focused on developing therapies for liver and other chronic diseases with high unmet need, today announced the pricing of its previously announced underwritten public offering of 11,600,000 shares of its common stock at a public offering price of $10.80 per share, before underwriting discounts and commissions. All of the shares of common stock are being offered by CymaBay. In addition, CymaBay has granted the underwriters a 30-day option to purchase up to an additional 1,740,000 shares of common stock at the public offering price less underwriting discounts and commissions. CymaBay anticipates using the net proceeds from the offering to fund ongoing development of seladelpar and for working capital and general corporate purposes.\nThe offering is expected to close on February 1, 2018, subject to the satisfaction of customary closing conditions.\nLeerink Partners LLC and Evercore ISI are acting as the joint book-running managers for the offering. Oppenheimer & Co. Inc. is acting as lead manager and H.C. Wainwright & Co., LLC and Roth Capital Partners are acting as co-managers for the offering.\nThe securities described above are being offered by CymaBay pursuant to a shelf registration statement previously filed with and declared effective by the Securities and Exchange Commission (the \"SEC\"). A preliminary prospectus supplement and the accompanying prospectus related to the offering have been filed with the SEC and are available on the SEC's website, located at www.sec.gov . Copies of the final prospectus supplement and the accompanying prospectus relating to this offering, when available may be obtained from: Leerink Partners LLC, Attn: Syndicate Department, One Federal Street, 37th Floor, Boston, Massachusetts 02110, by telephone at (800) 808-7525, ext. 6132, or by email at syndicate@leerink.com ; or Evercore ISI, Attn: Equity Capital Markets, 55 East 52nd Street, 36th Floor, New York, NY 10055, by telephone at (888) 474-0200, or by email at ecm.prospectus@evercore.com .\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout CymaBay\nCymaBay Therapeutics, Inc. (CBAY) is a clinical-stage biopharmaceutical company focused on developing therapies for liver and other chronic diseases with high unmet medical need. Seladelpar is a potent, selective, orally active PPARδ agonist currently in development for the treatment of patients with the autoimmune liver disease, primary biliary cholangitis (PBC) and nonalcoholic steatohepatitis (NASH). Two Phase 2 studies of seladelpar established proof of concept in PBC. CymaBay is currently planning to advance development of seladelpar into Phase 3 for PBC and Phase 2 for NASH.\nCautionary Statements\nThis announcement contains forward-looking statements, including statements relating to CymaBay’s expectations regarding the completion of the public offering and anticipated use of proceeds and expectations and plans related to product development and clinical or regulatory events. These statements are subject to significant risks and uncertainties and actual results could differ materially from those projected. CymaBay cautions investors not to place undue reliance on the forward-looking statements contained in this release. These risks and uncertainties include, without limitation, risks and uncertainties related to the satisfaction of customary closing conditions related to the public offering. There can be no assurance that CymaBay will be able to complete the public offering on the anticipated terms, or at all. Risks and uncertainties relating to CymaBay and its business can be found in the “Risk Factors” section of CymaBay’s Form 10-K for the year ended December 31, 2016, filed with the SEC on March 23, 2017, and Form 10-Q for the quarter ended September 30, 2017, filed with the SEC on November 8, 2017, and in the prospectus related to the offering filed with the SEC on January 29, 2018. CymaBay undertakes no duty or obligation to update any forward-looking statements contained in this release as a result of new information, future events or changes in CymaBay’s expectations.\nContacts:\nHans Vitzthum\nLifeSci Advisors, LLC\n(212) 915-2568\nHans@LifeSciAdvisors.com\nLifeSci Advisors, LLC, an affiliate of LifeSci Capital LLC, serves CymaBay as an investor relations, corporate communications and capital markets advisor.\nSource:CymaBay Therapeutics, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/4ae714bc-fc58-4a8c-94eb-53e0b0c13a01", "https://www.globenewswire.com/Tracker?data=xFxP-SwVTDYb8NkD3zVk9SYUSu0FUPFMYNuJRAM-h3Yi6QymV5IQ20_7XccQMbeg7uFTfNH-1V4vsRTi3Ys8e5bqqwGXeHJt61I5gPuCA7g="], "published": "2018-01-30T16:00:00.000+02:00", "crawled": "2018-01-30T17:49:31.009+02:00", "highlightTitle": ""}