{"organizations": [], "uuid": "d4bd2829cc1421f6d0ce3941e8679adf959c64db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225753174&w=1200&r=LYNXMPEE0Q0AR", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-itc-ruling-britain/relief-for-uk-workers-after-bombardier-trade-dispute-victory-idUSKBN1FG0EW", "country": "US", "domain_rank": 408, "title": "Relief for UK workers after Bombardier trade dispute victory", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T12:37:00.000+02:00", "replies_count": 0, "uuid": "d4bd2829cc1421f6d0ce3941e8679adf959c64db"}, "author": "", "url": "https://www.reuters.com/article/us-usa-itc-ruling-britain/relief-for-uk-workers-after-bombardier-trade-dispute-victory-idUSKBN1FG0EW", "ord_in_thread": 0, "title": "Relief for UK workers after Bombardier trade dispute victory", "locations": [], "entities": {"persons": [{"name": "greg clark", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "bombardier", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "u.s. international trade commission", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "boeing co", "sentiment": "none"}, {"name": "itc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 11:34 AM / in 6 hours Relief for UK workers after Bombardier trade dispute victory Reuters Staff 3 Min Read \nLONDON (Reuters) - British politicians and union leaders welcomed Bombardier’s surprise trade victory against U.S. planemaker Boeing Co, saying it safeguarded thousands of jobs in Northern Ireland and across British supply chains. \nFriday’s ruling by the U.S. International Trade Commission (ITC) was also a boost for British Prime Minister Theresa May, as the Bombardier operation in Northern Ireland is central to the concerns of the province’s largest unionist party, the Democratic Unionist Party, which is propping up her government after her poor showing in last June’s election. \nThe dispute between the two companies had put thousands of jobs at risk at the Belfast plant where Bombardier makes the carbon wings for the CSeries CS100 and CS300. \n“It’s a huge relief, we always knew that (the case) was unjustified,” Britain’s business minister Greg Clark told BBC radio on Saturday. \n“Not only does it mean this worry is out of the way, it means (Bombardier) can now go on with strength to expand because the CSeries has just tied up with Airbus,” he said. \nOn Friday, the U.S. ITC voted 4-0 to reject Boeing’s claims that it suffered injury by Bombardier underpricing the CSeries in the U.S. market and discarded a Commerce Department recommendation to slap a near 300-percent duty on sales of the 110-to-130-seat jets for five years. \n“Boeing has investments in the UK and it was clear that it would have been very difficult to have a good relationship with them if they were threatening these hugely important jobs in Belfast,” said Clark. \nOn Friday, May welcomed the ruling as “good news for British industry.” \nThe European Commission said the ruling was in line with what the EU had been arguing throughout the case and said it was a massive relief for Bombardier’s 4,000 workers in Northern Ireland and for the European aerospace industry as a whole. \n“The EU will always stand up and defend the interests of its industry when confronted by inappropriate use of trade defence instruments,” a Commission spokesman said. \nDemocratic Unionist Party member of parliament Gavin Robinson said the ruling was “fantastic news”. His East Belfast constituency includes a Bombardier plant that produces wings for the CSeries. \nTrade unions were similarly jubilant. \n“Bombardier workers in Northern Ireland and throughout the supply chain in the UK will be breathing a huge sigh of relief that the ITC has seen through Boeing’s baseless complaint,” said Steve Turner, assistant general secretary of the Unite union. \n“There can be no backsliding from the U.S. government on this decision.” Reporting by James Davey and Conor Humphries, additional reporting by Philip Blenkinsop in Brussels and Amanda Ferguson in Belfast; Editing by Mark Potter and Edmund Blair", "external_links": [], "published": "2018-01-27T12:37:00.000+02:00", "crawled": "2018-01-27T13:54:10.015+02:00", "highlightTitle": ""}