{"organizations": [], "uuid": "97acc04f8a792aaa40bd0f9882b5c30a22b696fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 341, "shares": 341, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/01/06/102313640-460161240.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/28/gop-pushes-back-on-gas-tax-as-trump-infrastructure-plan-takes-shape.html", "country": "US", "domain_rank": 767, "title": "GOP pushes back on gas tax as Trump infrastructure plan takes shape", "performance_score": 3, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T23:03:00.000+02:00", "replies_count": 0, "uuid": "97acc04f8a792aaa40bd0f9882b5c30a22b696fe"}, "author": "Ylan Mui", "url": "https://www.cnbc.com/2018/01/28/gop-pushes-back-on-gas-tax-as-trump-infrastructure-plan-takes-shape.html", "ord_in_thread": 0, "title": "GOP pushes back on gas tax as Trump infrastructure plan takes shape", "locations": [], "entities": {"persons": [{"name": "denis balibouse", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "charles", "sentiment": "none"}, {"name": "david koch", "sentiment": "none"}, {"name": "john cornyn", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "gop", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "wef", "sentiment": "none"}, {"name": "u.s. chamber of commerc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Denis Balibouse | Reuters President Donald Trump gestures as he arrives for the World Economic Forum (WEF) annual meeting in Davos, Switzerland January 25, 2018. President Donald Trump 's massive infrastructure package just hit a major roadblock.\nProminent Republican lawmakers are already coming out against raising the federal gas tax to pay for the president's promised $1 trillion investment in infrastructure. Speaking on Saturday night at a private donor retreat here hosted by billionaire industrialists Charles and David Koch, Senate Majority Whip John Cornyn opposed the idea.\n\"I'm not for raising the gas tax,\" he told the roughly 500 attendees. \"It's going to be a declining source of revenue.\"\nThe Trump administration is preparing to release an infrastructure plan in the coming weeks that reportedly includes at least $200 billion in federal spending that would jumpstart investment from the private sector, and state and local governments.\nYet the proposal is not expected to outline where the money would come from, leaving Congress to fill in the details.\nThe U.S. Chamber of Commerce unveiled a plan earlier this month to raise the gas tax by 25 cents — five cents a year for five years — a move the group acknowledged would be an uphill battle. The chamber estimated it would cost drivers $9 a month and raise $394 billion over the next decade.\n'The math doesn't work' \"It's the simplest, fairest, and most effective way to raise the money we need for roads, bridges, and transit,\" Chamber President Tom Donohue said in a statement.\nThe federal gas tax stands at 18.4 cents and has not been increased since 1993. Revenues from the gas tax have been declining, because it is not indexed to inflation, and because fuel efficiency standards have risen. The shortfall has left the federal highway trust fund chronically underfunded\nAt the donor retreat, lawmakers argued dwindling collections are a sign that the gas tax is not a sustainable source of revenue. Tennessee Rep. Marsha Blackburn came out against it, along with North Carolina Senator Thom Tillis, who said \"the math doesn't work.\"\nHe added: \"How do you fund [the administration's proposal]? I don't have all the answers. But I think it goes beyond something as simple as the gas tax.\"\nThe Koch network is also lobbying against the proposal. Tim Phillips, head of the Koch-affiliated Americans for Prosperity, called raising the gas tax \"a huge mistake.\"\n\"The gasoline tax would just be a disaster, especially coming on the heels of a really good tax proposal,\" he told reporters invited to attend the retreat here Saturday. \"That would just be terrible for the country.\"\nCorrection: The Chamber of Commerce estimates that a plan to hike the gas tax would raise $394 billion over the next decade.", "external_links": [], "published": "2018-01-28T23:03:00.000+02:00", "crawled": "2018-01-29T00:02:49.015+02:00", "highlightTitle": ""}