{"organizations": [], "uuid": "db8c54d77729a4d010efe0565997aa9b492a108a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224788853&w=1200&r=LYNXMPEE0N110", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-ge-results/ge-quarterly-revenue-drops-5-percent-idUSKBN1FD1IC", "country": "US", "domain_rank": 408, "title": "GE quarterly revenue drops 5 pct", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T13:48:00.000+02:00", "replies_count": 0, "uuid": "db8c54d77729a4d010efe0565997aa9b492a108a"}, "author": "", "url": "https://www.reuters.com/article/us-ge-results/ge-quarterly-revenue-drops-5-percent-idUSKBN1FD1IC", "ord_in_thread": 0, "title": "GE quarterly revenue drops 5 pct", "locations": [], "entities": {"persons": [{"name": "anil d'silva", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "ge", "sentiment": "negative"}, {"name": "general electric co", "sentiment": "none"}, {"name": "rachit vats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - U.S. securities regulators are probing a massive insurance charge recently announced by General Electric Co ( GE.N ), the latest blow to the nation’s largest industrial conglomerate as it struggles to reverse steep declines in some of its units and is looking to sell off $20 billion of assets.\nGE announced the probe after reporting a $10-billion loss in the latest quarter, hurt by a $6.2 billion charge to increase insurance reserves, which it disclosed last week, and steep declines in profit in its power and transportation divisions.\nIts shares were down 2.7 percent at $16.44 in afternoon trading in New York. They have fallen 43 percent over the past year.\nGE said the probe by the U.S. Securities and Exchange Commission began in late November and initially focused on long-term service agreements for maintenance of power plants, jet engines and other industrial equipment.\nIt said on Wednesday that the SEC recently expanded the inquiry to include the $6.2 billion charge and $15 billion more in provisions for insurance policies that GE announced last week.\n“If nothing else, board governance will be heightened and the auditors will sharpen the effort,” said Scott Davis, analyst at Melius Research.\nGE did not provide further details, but said it is cooperating with the investigation.\n“It’s very early days,” Chief Financial Officer Jamie Miller said on a conference call with analysts, adding “there’s nothing here I‘m overly concerned about.”\nMORE WEAKNESS AHEAD GE also forecast more weakness at its power business this year, a unit that produced 60 percent of GE’s profits as recently as 2016.\nThe company affirmed its outlook for earnings of $1 to $1.07 a share in 2018. But some analysts were skeptical, having expected GE to lower the target in light of the insurance charge, suspension of GE Capital dividends and weakness in power.\nAddressing speculation that GE will break itself into pieces, Chief Executive John Flannery said it will continue to exist as a company, “but it will look different” as it sheds about $20 billion in assets and looks for the best structure to support its core business of power, aviation and healthcare.\n“We really like the franchises we have in all three,” Flannery said in remarks echoing another executive.\nSTARK DECLINE While the fourth-quarter results contained no other sizeable charges, they threw into stark relief how far the U.S. industrial conglomerate had veered from its outlook less than a year ago, when former Chief Executive Jeff Immelt predicted that sales would rise as much as 5 percent in 2017 and margins would expand by a full percentage point.\nSlideshow (2 Images) In fact, GE said, sales fell 1 percent to $122.1 billion in 2017 and operating profit margins contracted by 5.7 percentage points to 5.7 percent.\nThe results also indicated that GE’s painful turnaround, which has sent its stock down 43 percent over the last year, likely has more months to run.\nThe stock had gained earlier, in part on relief that the company reaffirmed its 2018 profit forecast, RBC Capital Markets analyst Deane Dray said in a note to clients.\n“Some short-covering could be triggered just on the news that GE reaffirmed 2018, but the gravity of its operating challenges — especially at Power — are likely to continue to pressure the stock over the near-term,” he wrote.\nGE kept unchanged its recent forecast for 2018 earnings of between $1.00 and $1.07 a share, which contrasts markedly with the $2 a share that Immelt had promised before being replaced as CEO in August.\nPOWER FAILURE GE’s weakening performance largely reflected faster deterioration in GE’s power business, where profit fell 88 percent in the quarter, after a 51-percent drop in the third quarter.\nThe division, which makes and services electricity generating equipment, attributed the drop to unspecified charges and other factors.\nGE said the power market remains challenging. Revenue and orders also fell sharply at the power business.\nThe aviation, healthcare and renewable energy divisions reported rising profit, while profits in oil and gas and transportation fell.\nGE said cash from industrial operating activities totaled $7.8 billion in the quarter, above expectations of about $7 billion, and GE said its ability to generate cash is improving.\nGE’s loss totaled $10.01 billion in the quarter, compared with a profit of $3.48 billion a year earlier.\nOn a per-share basis, GE reported a loss from continuing operations of $1.15, compared with a profit of 39 cents per share.\nGE said last week it would book a $11-billion charge in the fourth quarter, including $6.2 billion for reevaluation of insurance assets. The insurance charge was double what GE had warned last year.\nTotal revenue in the quarter fell to $31.40 billion from $33.09 billion.\nRelated Coverage GE CEO says company will continue, but will 'look different' Reporting by Alwyn Scott in New York and Rachit Vats in Bengaluru; Editing by Anil D'Silva and Nick Zieminski\n ", "external_links": [], "published": "2018-01-24T13:48:00.000+02:00", "crawled": "2018-01-24T14:03:03.002+02:00", "highlightTitle": ""}