{"organizations": [], "uuid": "74157e2c304c84823454462061bbdcb4a762c15d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-bunge-m-a-grupo-minsa/bunge-buys-u-s-corn-flour-mills-following-adm-takeover-approach-idUSKBN1FK04K", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Bunge buys U.S. corn flour mills, following ADM takeover approach", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T02:51:00.000+02:00", "replies_count": 0, "uuid": "74157e2c304c84823454462061bbdcb4a762c15d"}, "author": "", "url": "https://www.reuters.com/article/us-bunge-m-a-grupo-minsa/bunge-buys-u-s-corn-flour-mills-following-adm-takeover-approach-idUSKBN1FK04K", "ord_in_thread": 0, "title": "UPDATE 1-Bunge buys U.S. corn flour mills, following ADM takeover approach", "locations": [], "entities": {"persons": [{"name": "tom", "sentiment": "negative"}, {"name": "todd bastean", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "bunge", "sentiment": "negative"}, {"name": "adm", "sentiment": "negative"}, {"name": "archer daniels midland co", "sentiment": "none"}, {"name": "bunge north america", "sentiment": "none"}, {"name": "minsa corp", "sentiment": "none"}, {"name": "polansek", "sentiment": "none"}, {"name": "bunge ltd", "sentiment": "none"}, {"name": "cargill", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  chicago", "sentiment": "none"}, {"name": "grupo minsa sab", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO (Reuters) - U.S. grain merchant Bunge Ltd ( BG.N ) beefed up its food ingredients business on Tuesday with a deal for two corn flour mills, after rival Archer Daniels Midland Co ( ADM.N ) proposed a takeover of Bunge that would consolidate the agribusiness sector.\nBunge acquired the mills in Iowa and Texas through a deal for Minsa Corp, the U.S. unit of Mexican corn miller Grupo Minsa SAB de CV ( MINSAB.MX ) that Bunge said was valued at $75 million.\nThe purchase is “an important strategic step” for Bunge’s food and ingredients unit and will make the company a leading U.S. producer of corn flour used to make tortillas, Todd Bastean, president of Bunge North America, said in a statement.\nBunge and other agricultural traders, including ADM and Cargill [CARG.UL], have been trying to diversify into higher-margin sectors, such as food ingredients and aquaculture, in the face of a global grains glut that has squeezed margins, reduced volatility and kept corn and soybean prices languishing for years.\nMergers in the agribusiness sector are seen as another potential remedy for the oversupply of grains.\nIn addition to ADM’s proposed takeover of Bunge, Glencore last year sought a tie-up with Bunge in what was viewed as a start of a wave of mergers and acquisitions in the grain industry.\nBunge rebuffed Glencore’s approach, and a standstill agreement prevents Glencore from making a new offer until next month, a source said this month. Bunge has declined to comment on ADM’s approach.\nADM owns some of the largest corn mills in the world in the United States. If the company acquires Bunge, it will likely need to sell U.S. grain and processing facilities to win regulatory approval because of business overlaps.\nIt was not immediately clear how Bunge’s latest acquisitions could affect potential divestments. Bunge named Cargill, but not ADM, among its major competitors in North American corn milling in an annual report filed with the U.S. Securities and Exchange Commission last year.\nBunge is focusing on its milling and oils businesses to expand in food and ingredients.\nBunge made the deal for Minsa’s U.S. mills after terminating an acquisition last year for a controlling stake in Grupo Minsa SAB de CV, which would have made Bunge the top grain miller in Mexico.\nIn September, Bunge bought a 70 percent stake in palm and tropical oils company IOI Loders Croklaan for nearly $1 billion. Industry experts said at the time that deal would make Bunge a tougher takeover target.\nReporting by Tom Polansek; Editing by Leslie Adler\n ", "external_links": [], "published": "2018-01-31T02:51:00.000+02:00", "crawled": "2018-01-31T03:05:30.017+02:00", "highlightTitle": ""}