{"organizations": [], "uuid": "31e96c050a2b5f5df95fa3e4998783cf47a4388c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220946452&w=1200&r=LYNXMPEE091JD", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-soccer-england-che-ars/chelsea-spurn-chances-in-league-cup-stalemate-with-arsenal-idUSKBN1EZ2VD", "country": "US", "domain_rank": 408, "title": "Chelsea spurn chances in League Cup stalemate with Arsenal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T00:05:00.000+02:00", "replies_count": 0, "uuid": "31e96c050a2b5f5df95fa3e4998783cf47a4388c"}, "author": "", "url": "https://www.reuters.com/article/us-soccer-england-che-ars/chelsea-spurn-chances-in-league-cup-stalemate-with-arsenal-idUSKBN1EZ2VD", "ord_in_thread": 0, "title": "Chelsea spurn chances in League Cup stalemate with Arsenal", "locations": [], "entities": {"persons": [{"name": "chelsea", "sentiment": "negative"}, {"name": "andreas christensen", "sentiment": "none"}, {"name": "toby davis", "sentiment": "none"}, {"name": "ed osmond", "sentiment": "none"}, {"name": "cesc fabregas", "sentiment": "none"}, {"name": "arsene wenger", "sentiment": "none"}], "locations": [{"name": "stamford bridge", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "bristol city", "sentiment": "none"}], "organizations": [{"name": "chelsea", "sentiment": "negative"}, {"name": "arsenal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Chelsea missed a string of chances to draw 0-0 at home with Arsenal in the first leg of their League Cup semi-final on Wednesday as the video assistant referee (VAR) stoked the tension with two important interventions.\nThe hosts struggled to break down Arsene Wenger’s side despite enjoying the majority of possession and will feel hard done by after crafting the best of the game’s few openings in a lively game at Stamford Bridge.\nChelsea defender Andreas Christensen wasted the best of the hosts’ opportunities, failing to find the target with two headers in the second half after Cesc Fabregas had also spurned a headed chance before the break.\nYet with limited goalmouth action, what little drama there was seemed to stem from referee Martin Atkinson referring a handful of decisions to the VAR.\nThe VAR system was being given its second outing in English soccer and was called into action in the first half to confirm Atkinson’s decision to wave away a penalty appeal after Arsenal’s Alex Iwobi went down following a challenge from Victor Moses.\nIt was called on again with two minutes remaining and once more confirmed the referee’s decision not to award a penalty, this time after Danny Welbeck got a faint touch on the ball when bringing down Fabregas.\nSoccer Football - Carabao Cup Semi Final First Leg - Chelsea vs Arsenal - Stamford Bridge, London, Britain - January 10, 2018 Chelsea's Michy Batshuayi, Arsenal's Rob Holding, David Ospina, Shkodran Mustafi and Granit Xhaka look on as the ball hits the goal post REUTERS/David Klein With the system still in the test phase all eyes were focused on how it would work, with Wenger voicing concerns in the aftermath about the length of time it took to confirm the referee’s decision not to award a penalty against Welbeck.\nHe was, however, delighted with how his side defended to leave the tie in the balance ahead of the second leg in two weeks time.\nSlideshow (2 Images) “I felt there was great togetherness, we didn’t give many chances away. I am pleased with the spirit and determination,” Wenger told sky Sports.\nArsenal came into the game without a win in their last three matches and nursing the wounds of a bruising third round FA Cup defeat to second tier Nottingham Forest, but they were resolute from the beginning in what was a relatively cagey affair.\nHeaded chances went begging for the hosts either side of halftime as Fabregas could only steer Cesar Azpilicueta’s diagonal ball straight at David Ospina while Christensen twice failed to find the net from close range after the break.\n“We tried with all our strength to win the game,” Chelsea boss Antonio Conte said. “We created chances to score but a few times we were not so clinical.”\nThe winners will face either Manchester City or second tier Bristol City in the final, with the Premier League leaders taking a 2-1 lead into the second leg.\nReporting by Toby Davis, editing by Ed Osmond\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-11T00:05:00.000+02:00", "crawled": "2018-01-11T00:26:56.001+02:00", "highlightTitle": ""}