{"organizations": [], "uuid": "ba9052886da22b3b6573d5e0c037434e66eeae48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-liberty-announces-quarterly-interest-payment-excess-regular-cash-dividend-amount-and-change-to-reference-shares-with-respect.html", "country": "US", "domain_rank": 767, "title": "Liberty Announces Quarterly Interest Payment, Excess Regular Cash Dividend Amount and Change to Reference Shares with Respect to 1.0% Senior Exchangeable Debentures Due 2043", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T00:30:00.000+02:00", "replies_count": 0, "uuid": "ba9052886da22b3b6573d5e0c037434e66eeae48"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-liberty-announces-quarterly-interest-payment-excess-regular-cash-dividend-amount-and-change-to-reference-shares-with-respect.html", "ord_in_thread": 0, "title": "Liberty Announces Quarterly Interest Payment, Excess Regular Cash Dividend Amount and Change to Reference Shares with Respect to 1.0% Senior Exchangeable Debentures Due 2043", "locations": [], "entities": {"persons": [], "locations": [{"name": "englewood", "sentiment": "none"}, {"name": "colo.", "sentiment": "none"}, {"name": "lvnta", "sentiment": "none"}], "organizations": [{"name": "eractive corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ENGLEWOOD, Colo.--(BUSINESS WIRE)-- Liberty Interactive LLC (\"Liberty\"), a subsidiary of Liberty Interactive Corporation (Nasdaq: QVCA, QVCB, LVNTA, LVNTB), announced the payment today of a quarterly interest payment to the holders, as of December 15, 2017, of its 1.0% Senior Exchangeable Debentures due 2043 (the \"Debentures\"). The amount of the quarterly interest payment is $2.50 per $1,000 original principal amount of Debentures. As of December 30, 2017, 900 Debentures remained outstanding in the aggregate adjusted principal amount of $775,505, after giving effect to today’s quarterly interest payment.\nUnder the Indenture for the Debentures, the original principal amount of the Debentures is reduced in an amount equal to each extraordinary distribution made to holders of the Debentures. Thereafter, the adjusted principal amount is further reduced on each successive quarterly interest payment date to the extent necessary to cause the quarterly interest payment to represent the payment of an annualized yield of 1.0% of the adjusted principal amount. This latter adjustment, to the extent it is made by reason of a particular extraordinary distribution that results in a reduction to the principal amount of the Debentures, takes effect on the second succeeding interest payment date after the payment of that extraordinary distribution.\nTo date, Liberty has made one extraordinary distribution to holders of the Debentures. On March 19, 2015, Liberty made an extraordinary distribution of $134.5800 per $1,000 original principal amount of the Debenture resulting from the declaration and payment by HSN, Inc. (“HSNi”) of a special cash dividend of $10.00 per share to HSNi shareholders of record as of February 9, 2015.\nReductions to the principal amount of the Debentures do not affect the amount of the quarterly interest payments received by holders of the Debentures, which will continue to be a rate equal to 1.0% per annum of the original principal amount of the Debentures. Below is a detail of the amount of the quarterly interest payment being made on the Debentures, its allocation between payment of interest and repayment of principal and the revised adjusted principal amount of the Debentures resulting from such payment, per $1,000 original principal amount of the Debentures:\nDecember 30, 2017\nBeginning Adjusted\nPrincipal\nPayment Interest Payment of\nPrincipal\nDecember 30, 2017\nEnding Adjusted\nPrincipal\n$862.0175 $2.50 $2.1550 $0.3450 $861.6725 Liberty also announced the payment today, to holders of the Debentures as of December 15, 2017, of an additional distribution of $2.2879 per Debenture, which is attributable to the portion of the quarterly dividend paid by HSNi on December 15, 2017 in excess of $0.18 per share. Payments of additional distributions attributable to “excess” regular cash dividends do not result in a reduction to the principal amount of the Debentures.\nAs a result of the previously announced acquisition by Liberty of the 62% of HSN, Inc. it did not already own in an all-stock transaction, the reference shares underlying the Debentures now consist of shares of Liberty Series A QVC Group Common Stock, and each $1,000 original principal amount of the Debentures is exchangeable for 22.2057 shares of Series A QVC Group Common Stock, or cash or a combination of Liberty Series A QVC Group Common Stock and cash having an equivalent value.\nAbout Liberty Interactive LLC\nLiberty Interactive LLC is an intermediate subsidiary of Liberty Interactive Corporation, owning interests in a broad range of electronic retailing, media, communications, and entertainment businesses.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005736/en/\nLiberty Interactive Corporation\nCourtnee Chun, 720-875-5420\nSource: Liberty Interactive Corporation", "external_links": ["http://www.businesswire.com/news/home/20180102005736/en/"], "published": "2018-01-03T00:30:00.000+02:00", "crawled": "2018-01-03T02:21:45.013+02:00", "highlightTitle": ""}