{"organizations": [], "uuid": "93534e539a8ba7b1ecba78884a8e549d976ae79f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 511, "shares": 511, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/14/104899470-RTX3R1H7.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/02/cramer-reflects-on-how-trumps-actions-fuel-the-beast-market-rally.html", "country": "US", "domain_rank": 767, "title": "Cramer reflects on how Trump's actions fuel the 'beast' market rally", "performance_score": 5, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T01:11:00.000+02:00", "replies_count": 0, "uuid": "93534e539a8ba7b1ecba78884a8e549d976ae79f"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/02/cramer-reflects-on-how-trumps-actions-fuel-the-beast-market-rally.html", "ord_in_thread": 0, "title": "Cramer reflects on how Trump's actions fuel the 'beast' market rally", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As the first trading day of 2018 wrapped up on a rosy note for the averages , CNBC's Jim Cramer noticed a hint of discord in the market layout.\n\"I swear people are bored with what's going on with stocks,\" the \" Mad Money \" host said. \"Either they don't want to say anything good about the market because of politics, as the president has done a very good job of linking himself with the performance of the averages, or they're just prone to sleep.\"\nWhatever the reason, the 54 percent of U.S. citizens who do own stocks should be entering the year on a high note, Cramer said.\nWith the S&P 500 having gained nearly 20 percent overall for 2017, investors have likely benefited from the monster rallies that rocketed nearly every sector higher, he said.\n\"That's what progress is all about. Is it related to President Trump's policies? Look, love him or hate him, the answer is yes,\" Cramer said. \"The president has created a pro-growth environment and along with a new tax code that will take money from the government ... and give it to the corporations.\"\nPresident Donald Trump's Twitter posts echo, if not embolden, this very message. On Sunday, he tweeted:\n\"If the Dems (Crooked Hillary) got elected, your stocks would be down 50% from values on Election Day. Now they have a great future - and just beginning!\"\nBut for those in states like New York, New Jersey and California, Cramer said the new tax law (and its alleged burdens on blue states ) might overshadow the market's impressive 2017 gains.\nStill, Cramer argued that individual stock-picking will benefit red- and blue-state investors alike in the new year, particularly in the technology sector.\nAfter brushing off Apple's \"battery gate\" problems as a momentary lapse with an easy fix, Cramer turned to the semiconductor space for investing ideas.\nAfter being under pressure for most of December, semiconductor stocks seem to be revitalized and some of the key contributors to the rally, the \"Mad Money\" host said.\n\"The highest multiple tech stocks — the Adobes , the Salesforces , the VMwares — are finally on the move after being stuck in the mud,\" he said. \"I think that they're all buys. VMware's really way too low given that blowout quarter .\"\nOil and retail stocks are also coming back to life thanks to rising crude prices and a robust holiday shopping season , respectively, and transports seem to be riding the holiday trend with them as e-commerce grows, Cramer said.\nCommodities are on the come-up, and even biotechnology stocks like Celgene and Gilead caught wind on Tuesday, securing some buyers after a difficult end to 2017 .\n\"I could go on and on,\" Cramer said. \"But the bottom line is simple: for whatever reason, the animal spirits triggered by the president's focus on deregulation , the bonuses being given to workers after the tax cut , the weaker dollar going into the earnings, the boom in the Southeast because of a glut of natural gas , the coming boost in earnings estimates thanks to the slashing of corporate taxes , we've got an incredible rally, and this kind of move is never boring. It's not a bull; it's a beast. And right now, it's in beast mode.\"\nWATCH: Cramer discusses Trump's effect on the 'beast' market show chapters Cramer reflects on how Trump's actions are fueling the 'beast' market rally 20 Hours Ago | 12:19 Disclosure: Cramer's charitable trust owns shares of Apple.\nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-03T01:11:00.000+02:00", "crawled": "2018-01-03T01:16:02.017+02:00", "highlightTitle": ""}