{"organizations": [], "uuid": "4f646e915a1cd7edc3703b22c24277a4a1b479d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-oz-management-appoints-robert-shafir-to-succeed-dan-och-as-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Oz Management Appoints Robert Shafir to Succeed Dan Och as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:15:00.000+02:00", "replies_count": 0, "uuid": "4f646e915a1cd7edc3703b22c24277a4a1b479d9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-oz-management-appoints-robert-shafir-to-succeed-dan-och-as-chief-executive-officer.html", "ord_in_thread": 0, "title": "Oz Management Appoints Robert Shafir to Succeed Dan Och as Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "robert shafir", "sentiment": "negative"}, {"name": "dan och", "sentiment": "negative"}, {"name": "rob", "sentiment": "none"}, {"name": "och", "sentiment": "none"}, {"name": "shafir", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "och-ziff capital management group llc", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "private banking & wealth management", "sentiment": "none"}, {"name": "credit suisse americas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 30, 2018 (GLOBE NEWSWIRE) -- Och-Ziff Capital Management Group LLC (NYSE:OZM) (the “Company,” “Oz Management” or “Oz”) announced today that Robert Shafir will succeed Dan Och as Chief Executive Officer, effective February 5, 2018. As part of the transition, Mr. Shafir will join the Board of Directors on the same date. Mr. Och, the Company’s largest shareholder, will continue to serve as Chairman of the Board through March 31, 2019, after which time he expects to remain involved with the firm.\nMr. Shafir, who previously served as the CEO of Credit Suisse Americas and Co-Head of Private Banking & Wealth Management, will provide day-to-day leadership and management of the Company. He will also be responsible for the planning and execution of Oz’s strategic direction, financial objectives and client engagement.\nMr. Och said, “Rob is a world-class executive who will be a great asset to Oz as we continue our evolution as a firm. His distinguished career of over 30 years leading global financial institutions and asset management businesses brings unique experience that will benefit Oz significantly. Importantly, having Rob as a dedicated CEO will enable our nearly 150 investment professionals to continue to focus solely on what they do best—generating returns for our clients. I am confident this will be a seamless transition and look forward to building on our strong 2017 results.”\nAllan S. Bufferd, Lead Independent Director of Oz Management, said, “We are grateful for Dan’s leadership over the past two decades and his continued efforts to position Oz for future success. We are thrilled to have someone of Rob’s caliber join and collaborate with the organization’s deep and experienced management team to drive the next phase of this storied firm’s development. Rob has exceptional experience growing and managing a global asset management firm. He has the support of the Board and we are confident that he is a perfect fit to lead Oz going forward.”\nMr. Shafir said, “Oz Management is an excellent firm with a stellar long-term track record and a robust institutional infrastructure. Dan has built a leading global asset management organization and I’m honored to lead the Company as the next CEO. The firm is deeply committed to its investors, employees and shareholders and I look forward to working with the Board, Dan and all of our employees to continue to drive value in the years ahead.”\nJimmy Levin, Co-Chief Investment Officer, said, “Oz is a tremendous firm with a talented and creative team that works each day to identify and execute on the most compelling investment opportunities around the world. I am excited about the future and look forward to welcoming Rob.”\nAbout Robert Shafir\nMr. Shafir previously served in various capacities at Credit Suisse Group AG, most recently as the CEO of Credit Suisse Americas from 2008 to 2016 and Co-Head of Private Banking & Wealth Management, which included oversight of Asset Management, from 2012 to 2016. He was a member of the Executive Board of Credit Suisse Group and Credit Suisse. He was also Chairman of the Americas CEO Management Committee and the Private Banking & Wealth Management Products Management Committee.\nPrior to joining Credit Suisse, in August 2007, Mr. Shafir worked at Lehman Brothers for 17 years serving as Head of Global Equities, as well as a member of their Executive Board. He also held other senior roles, including Head of European Equities and Global Head of Equities Trading, and played a key role in building Lehman's equities business into a global, institutionally-focused franchise. Prior to that, he worked at Morgan Stanley in the preferred stock business within the fixed income division.\nMr. Shafir received a B.A. in Economics from Lafayette College and an M.B.A. from Columbia Business School.\nAbout Oz Management\nOz Management is one of the largest institutional alternative asset managers in the world, with offices in New York, London, Hong Kong, Mumbai, Beijing, Shanghai and Houston. Oz provides asset management services to investors globally through its multi-strategy funds, dedicated credit funds, including opportunistic credit funds and Institutional Credit Strategies products, real estate funds and other alternative investment vehicles. Oz seeks to generate consistent, positive, absolute returns across market cycles, with low volatility compared to the broader markets, and with an emphasis on preservation of capital. Oz’s funds invest across multiple strategies and geographies, consistent with the investment objectives of each fund. The global investment strategies Oz employs include convertible and derivative arbitrage, corporate credit, long/short equity special situations, merger arbitrage, private investments, real estate and structured credit. As of January 1, 2018, Oz had approximately $31.9 billion in assets under management. For more information, please visit Oz Management’s website ( www.ozm.com ).\nInvestor Relations Contact Media Relations Contacts Adam Willkomm Joe Snodgrass Head of Business Development and Shareholder Services Head of Corporate Communications +1-212-719-7381 +1-212-887-4821 investorrelations@ozm.com joseph.snodgrass@ozm.com Jonathan Gasthalter Gasthalter & Co. LP +1-212-257-4170 jg@gasthalter.com\nSource:Och-Ziff Capital Management Group LLC", "external_links": [], "published": "2018-01-30T16:15:00.000+02:00", "crawled": "2018-01-30T17:39:24.003+02:00", "highlightTitle": ""}