{"organizations": [], "uuid": "050f4a173789fedb32ae0c83d26113f7f1410356", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224072438&w=1200&r=LYNXMPEE0L0GC", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-ukraine-crisis-russia-microsoft-exclu/u-s-sanctions-curb-microsoft-sales-to-hundreds-of-russian-firms-idUSKBN1FB0MU", "country": "US", "domain_rank": 408, "title": "Exclusive: U.S. sanctions curb Microsoft sales to hundreds of Russian firms", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T09:07:00.000+02:00", "replies_count": 0, "uuid": "050f4a173789fedb32ae0c83d26113f7f1410356"}, "author": "", "url": "https://www.reuters.com/article/us-ukraine-crisis-russia-microsoft-exclu/u-s-sanctions-curb-microsoft-sales-to-hundreds-of-russian-firms-idUSKBN1FB0MU", "ord_in_thread": 0, "title": "Exclusive: U.S. sanctions curb Microsoft sales to hundreds of Russian firms", "locations": [], "entities": {"persons": [{"name": "anastasia lyrchikova", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "microsoft", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 7:06 AM / in 10 hours Exclusive: U.S. sanctions curb Microsoft sales to hundreds of Russian firms Anastasia Lyrchikova 9 Min Read \nMOSCOW (Reuters) - Two of Microsoft’s official distributors in Russia have imposed restrictions on sales of Microsoft software to more than 200 Russian companies following new U.S. sanctions, according to notifications circulated by the distributors. \nWhile much of the focus around U.S. sanctions has been on ways they are being skirted, the moves by the Russian distributors show how tougher restrictions that came into force on Nov. 28 are starting to bite. \nThe new measures cut the duration of loans that can be offered to Russian financial firms subject to sanctions to 14 days from 30 days and to 60 days from 90 days for Russian energy companies on a U.S. sanctions list. \nPreviously, the restrictions had mainly affected Western banks lending to Russian firms but with such short financing periods, swathes of companies supplying goods and services to Russian clients fear they could fall foul of the rules too. \nIt is routine in Russia for suppliers to wait weeks or even months to get paid after submitting invoices for goods and services. \nSome Western firms have been advised by lawyers that the U.S. Treasury Department could, in theory, take the view this constituted financing in violation of the sanctions, according to several people involved in the discussions. \nOne of the two Microsoft distributors, a Russian company called Merlion, said in its notification to partners that all sanctioned buyers of Microsoft licenses must pay within tight deadlines, or even pay upfront in some cases. \nThe second distributor, RRC, said in its notification, seen by Reuters, that “serious restrictions are being introduced” on Microsoft orders from firms subject to U.S. sanctions. \nBoth Merlion and RRC cited rules stemming from the new package of U.S. sanctions - signed into law on Aug. 2 for Russia’s involvement in Ukraine and cyber attacks - as the reason for the additional restrictions. \nNeither Merlion nor RRC responded to Reuters questions. \nMicrosoft said in a statement to Reuters: “Microsoft has a strong commitment to complying with legal requirements and has robust processes around the world to help ensure that our partners are in compliance as well.” \nIn response to Reuters questions, a spokesman for the U.S. Treasury Department, which oversees the enforcement of sanctions, referred to its published guidance. \nThe guidance from the Treasury’s Office of Foreign Assets Control (OFAC) states that U.S. firms can conduct transactions with companies on the sanctions list as long as the payment terms do not exceed the permitted loan duration. \n“In the event that a U.S. person believes that it may not receive payment in full by the end of the relevant payment period, the U.S. person should contact OFAC to determine whether a license or other authorization is required,” it said. \n‘SECTORAL SANCTIONS’ \nThe United States can impose a civil penalty on violators of $250,000 or double the amount of the offending transaction if it is greater. If convicted of wilful violation, offenders face a fine up to $1 million, or 20 years in jail, or both. \nMicrosoft did not respond to Reuters questions about whether it had initiated the restrictions introduced by two of its Russian distributors. \nMicrosoft lists nine other official distributors of its main software products in Russia in the same category of partner companies as RRC and Merlion. One, Softline, declined to comment on whether it had introduced stricter payment rules. The others did not respond to Reuters requests for comment. \nReuters reported in October that software produced by Microsoft had been acquired by state organizations and firms in Russia and Crimea, despite sanctions barring U.S.-based companies from doing business with them. \nThat case, and several similar ones reported by Reuters, highlighted gaps between the sanctions and their enforcement. \nThe U.S. government operates two lists of firms subject to sanctions. U.S.-based entities are banned from doing almost all forms of business with firms on Washington’s Specially Designated Nationals (SDN) list. FILE PHOTO: Russian flag are reflected on the Microsoft Windows Installation CD in this illustration taken January 12, 2018. Picture taken January 12, 2018. REUTERS/Dado Ruvic \nA second list known as the Sectoral Sanctions Identifications (SSI) list covers 224 mostly Russian firms and their subsidiaries in the banking, energy and defense sectors which are subject to financial restrictions. \nThey include major Russian companies such as oil giant Rosneft, natural gas producer Novatek and Sberbank, Russia’s biggest lender. \nWhile the lending rules for financial and energy firms have been tightened, restrictions on financing for Russian defense manufacturers were left unchanged at 30 days though the new sanctions toughened the penalties for any violations. TOUGHER RULES \nThe notification from Microsoft distributor Merlion dated Nov. 29, the day after the new lending rules come into force, said orders would only be fulfilled for financial sector buyers once it had confirmation full payment had been received. \nFor the defense sector, it said orders would be fulfilled only if partners confirmed payment would be made within 30 days of the software license being activated. For energy sector clients, confirmation of payment within 60 days was required. \n“If we do not receive from you documents confirming payment on orders from the defense and energy sectors, the order could be viewed by the vendor as not complying with the processing procedure and rejected,” Merlion’s notification said. \nRRC did not spell out the new restrictions in its notification, sent by email last month to its partners. \n“In the event that you have buyers from the following sectors of the economy (financial, defense, energy) and they are in the sanctions list, you are requested IN ADVANCE to contact your RRC manager for further instructions.” \n“In connection with this, serious restrictions are being introduced on the placing of, and payment for, orders for Microsoft products ... placed by these buyers (and also their subsidiaries and affiliated companies),” the notification said. BLACKLISTED BY ASSOCIATION \nBesides the tighter lending rules and other new restrictions, a change of wording in the U.S. sanctions package is also sending ripples through the Russian economy. \nThe previous wording was the U.S. president “may impose” penalties if rules are violated. That has now changed to “shall impose” penalties, unless it is not in the national interest. \nLawyers who advise clients on U.S. sanctions compliance said this meant it was more likely Washington would impose penalties on foreign entities doing prohibited business with a company on the sanctions list. \nIn response, companies are trying to put as much distance as possible between themselves and Russian entities on the U.S. blacklist, fearing they could end up on it too by association, bankers, lawyers, officials, and business executives said. \nSome companies are conducting audits to find out if their partners deal with any sanctioned entities and are, in some cases, halting those relationships, according to a sanctions lawyer and an executive with a large industrial firm. \n“Even Chinese companies started to ask,” said a senior source close to the Kremlin and the Russian government, alluding to the fact some Chinese companies have until now continued to do deals even where many Western firms have pulled back. \nAt the same time, companies that are on the sanctions list, or believe they may be added, are looking for intermediary firms that would allow their partners to keep working with them, albeit at arm’s length. \nA person who works closely with a billionaire Russian oligarch said he assessed the risk the oligarch’s business would be put under U.S. sanctions was only 10 percent. Even so, he said, the business was taking precautions so it can keep operating if Washington does blacklist it. \n“We are establishing non-affiliated business units. Or deal with large local partners,” said the source, who declined to be identified to avoid attracting attention to his boss’s business. \nA Russian finance ministry source said he expected an uptick in the number of shell companies being set up as a mechanism to bypass the expanded sanctions. \nTwo executives from two top-20 Russian banks said they viewed the fact their clients included Rosneft as a risk. One said many of the bank’s clients had started to ask whether the Rosneft ties exposed the lender to sanctions risk. Additional reporting by Salvador Rodriguez in San Francisco, Joel Schectman in Washington, and Gleb Stolyarov, Katya Golubkova, Darya Korsunskaya, Olga Sichkar, Elena Fabrichnaya and Polina Nikolskaya; editing by David Clarke", "external_links": [], "published": "2018-01-22T09:07:00.000+02:00", "crawled": "2018-01-22T09:13:13.001+02:00", "highlightTitle": ""}