{"organizations": [], "uuid": "a0b3675842f43a1e0088ef19e0bfe78e22eff5fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 85, "shares": 85, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF962_0128vi_G_20180130205940.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7085.xml", "section_title": "WSJ.com: World News", "url": "https://www.wsj.com/articles/u-s-no-longer-considering-victor-cha-for-ambassador-to-south-korea-1517366790", "country": "US", "domain_rank": 387, "title": "U.S. No Longer Considering Victor Cha for Ambassador to South Korea", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T04:55:00.000+02:00", "replies_count": 0, "uuid": "a0b3675842f43a1e0088ef19e0bfe78e22eff5fa"}, "author": "Felicia Schwartz", "url": "https://www.wsj.com/articles/u-s-no-longer-considering-victor-cha-for-ambassador-to-south-korea-1517366790", "ord_in_thread": 0, "title": "U.S. No Longer Considering Victor Cha for Ambassador to South Korea", "locations": [], "entities": {"persons": [{"name": "victor cha", "sentiment": "negative"}, {"name": "cha", "sentiment": "none"}], "locations": [{"name": "south korea washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2 COMMENTS WASHINGTON—The Trump administration is searching for a new candidate to be the ambassador to South Korea, after U.S. officials said Tuesday that its previous pick, Victor Cha, is no longer under consideration .\nThe Trump administration notified the South Korean government in December that Mr. Cha would be its envoy to Seoul, but weeks passed without a formal nomination. \nOfficials familiar with the decision said Tuesday that the Trump administration dropped him from consideration, though it remains unclear why. In an op-ed published Tuesday night in The Washington Post, Mr. Cha, who was a White House National Security Council expert on Asia during the George W. Bush administration, wrote that he differed with the Trump administration over how to handle North Korea.\nMr. Cha said he disagrees with the view of some in the Trump administration that the U.S. could use a so-called bloody nose strike, which is a targeted attack meant to send a message to Pyongyang without provoking all-out war.\n“The answer is not, as some Trump administration officials have suggested, a preventive military strike,” Mr. Cha wrote. He said such a strike wouldn’t persuade North Korea to reconsider its nuclear weapons program and would likely lead to wider warfare.\nBut two administration officials told The Wall Street Journal that policy differences may not have been the only reason he was ruled out as the U.S. ambassador to Seoul. One official said that the decision to drop him from consideration was made during the vetting process. The official declined to provide additional information.\nMr. Cha, who is now a Georgetown University professor, didn’t immediately respond to a request for comment. \nThis means the U.S. almost certainly won’t have an ambassador in place ahead of the Winter Olympics in South Korea in February, contrary to what South Korea had previously expected\nThe U.S. has been without an ambassador in Seoul for more than a year, while the Trump administration has pursued a campaign to pressure North Korea to curtail its nuclear weapons program.\nNorth and South Korea have held talks on the Winter Olympics and will field a joint women’s ice hockey team and march into the opening ceremony together under a unified flag.\n—Michael R. Gordon contributed to this article. \nWrite to Felicia Schwartz at Felicia.Schwartz@wsj.com and Jonathan Cheng at jonathan.cheng@wsj.com", "external_links": [], "published": "2018-01-31T04:55:00.000+02:00", "crawled": "2018-01-31T05:26:29.008+02:00", "highlightTitle": ""}