{"organizations": [], "uuid": "ed1505eef988c5a779830057e97145efe6c2b25e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104933762-GettyImages-902386446.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/oprahs-globes-speech-sparks-2020-presidential-speculation.html", "country": "US", "domain_rank": 767, "title": "Oprah's Globes speech sparks 2020 presidential speculation", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2018-01-08T17:10:00.000+02:00", "replies_count": 0, "uuid": "ed1505eef988c5a779830057e97145efe6c2b25e"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/08/oprahs-globes-speech-sparks-2020-presidential-speculation.html", "ord_in_thread": 0, "title": "Oprah's Globes speech sparks 2020 presidential speculation", "locations": [], "entities": {"persons": [{"name": "oprah winfrey", "sentiment": "negative"}, {"name": "oprah", "sentiment": "negative"}, {"name": "harvey weinstein", "sentiment": "none"}, {"name": "winfrey", "sentiment": "none"}, {"name": "kevin spacey", "sentiment": "none"}, {"name": "cecil b. demille", "sentiment": "none"}, {"name": "kevork djansezian", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "beverly hilton hotel", "sentiment": "none"}], "organizations": [{"name": "golden globe awards", "sentiment": "none"}, {"name": "los angeles times", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oprah Winfrey 's widely shared speech about gender, race and opportunity at the Golden Globe Awards quickly fueled speculation that she could consider a presidential run in 2020.\nReceiving a lifetime achievement award, the media mogul spoke about hoping to start a \"new day,\" in which women can speak up about sexual harassment without fear. Her remarks came during an awards show dominated by talk about a national reckoning over sexual harassment that has swept up powerful Hollywood figures like Harvey Weinstein and Kevin Spacey.\nThe speech sparked speculation that Winfrey, 63, could seek the presidency in the next election, challenging another television personality and businessperson, President Donald Trump . The billionaire businesswoman and former talk show host was the subject of presidential rumors even before her Sunday night speech.\nIn his opening monologue, the show's host Seth Meyers joked about the possibility.\n\"In 2011, I told some jokes about our current president at the White House correspondents dinner, jokes about how he was unqualified to be president,\" the NBC late-night host said. \"And some have said that night convinced him to run. And if that's true, I would just like to say Oprah you will never be president.\"\nMore entertainers spoke about a potential Winfrey presidential bid after she spoke.\nSilverman tweet\nWilmore tweet\nStamos tweet\nOdom tweet\nWinfrey's partner, Stedman Graham, told the Los Angeles Times that a Winfrey run for office is \"up to the people\" but added that \"she would absolutely do it.\"\nOn Monday morning, CNN cited two sources close to the talk show phenom and reported that Winfrey is \"actively thinking\" about running for president. Winfrey previously denied having interest in running for president, and several media outlets reported Sunday night that she said, \"I don't. I don't,\" when asked again if she had any ambition for running.\nThe 2016 victory by Trump, the real estate developer who had never before held office or served in the military, brought more questions about who else without the typical credentials may run for president. Winfrey was a popular talk show host who has started her own media network and holds a 10 percent stake in Weight Watchers .\nLast year, Winfrey suggested that Trump's win made her think more about political ambitions.\n\"I thought, 'Oh gee I don't have the experience,\" Winfrey said. \"I don't know enough. And now I'm thinking, 'Oh? Oh!'\"\nHere are her full remarks at the Golden Globes:\nAh! Thank you. Thank you all. O.K., O.K. Thank you, Reese. In 1964, I was a little girl sitting on the linoleum floor of my mother's house in Milwaukee, watching Anne Bancroft present the Oscar for best actor at the 36th Academy Awards. She opened the envelope and said five words that literally made history: \"The winner is Sidney Poitier.\" Up to the stage came the most elegant man I had ever seen. I remember his tie was white, and of course his skin was black. And I'd never seen a black man being celebrated like that. And I've tried many, many, many times to explain what a moment like that means to a little girl — a kid watching from the cheap seats, as my mom came through the door bone-tired from cleaning other people's houses. But all I can do is Quote: and say that the explanation's in Sidney's performance in \"Lilies of the Field\": \"Amen, amen. Amen, amen.\" In 1982, Sidney received the Cecil B. DeMille Award right here at the Golden Globes, and it is not lost on me that at this moment there are some little girls watching as I become the first black woman to be given this same award.\nIt is an honor, and it is a privilege to share the evening with all of them, and also with the incredible men and women who've inspired me, who've challenged me, who've sustained me and made my journey to this stage possible. Dennis Swanson, who took a chance on me for \"A.M. Chicago\"; Quincy Jones, who saw me on that show and said to Steven Spielberg, \"Yes, she is Sophia in 'The Color Purple'\"; Gayle, who's been the definition of what a friend is; and Stedman, who's been my rock — just a few to name. I'd like to thank the Hollywood Foreign Press Association, because we all know that the press is under siege these days.\nBut we also know that it is the insatiable dedication to uncovering the absolute truth that keeps us from turning a blind eye to corruption and to injustice. To tyrants and victims and secrets and lies. I want to say that I value the press more than ever before, as we try to navigate these complicated times. Which brings me to this: What I know for sure is that speaking your truth is the most powerful tool we all have. And I'm especially proud and inspired by all the women who have felt strong enough and empowered enough to speak up and share their personal stories. Each of us in this room are celebrated because of the stories that we tell. And this year we became the story. But it's not just a story affecting the entertainment industry. It's one that transcends any culture, geography, race, religion, politics or workplace.\nSo I want tonight to express gratitude to all the women who have endured years of abuse and assault, because they — like my mother — had children to feed and bills to pay and dreams to pursue. They're the women whose names we'll never know. They are domestic workers and farmworkers; they are working in factories and they work in restaurants, and they're in academia and engineering and medicine and science; they're part of the world of tech and politics and business; they're our athletes in the Olympics and they're our soldiers in the military.\nAnd they're someone else: Recy Taylor, a name I know and I think you should know, too. In 1944, Recy Taylor was a young wife and a mother. She was just walking home from a church service she'd attended in Abbeville, Alabama, when she was abducted by six armed white men, raped and left blindfolded by the side of the road, coming home from church. They threatened to kill her if she ever told anyone, but her story was reported to the NAACP, where a young worker by the name of Rosa Parks became the lead investigator on her case and together they sought justice. But justice wasn't an option in the era of Jim Crow. The men who tried to destroy her were never persecuted. Recy Taylor died 10 days ago, just shy of her 98th birthday. She lived, as we all have lived, too many years in a culture broken by brutally powerful men. And for too long, women have not been heard or believed if they dared to speak their truth to the power of those men. But their time is up. Their time is up. Their time is up.\nAnd I just hope that Recy Taylor died knowing that her truth — like the truth of so many other women who were tormented in those years, and even now tormented — goes marching on. It was somewhere in Rosa Parks' heart almost 11 years later, when she made the decision to stay seated on that bus in Montgomery. And it's here with every woman who chooses to say, \"Me too.\" And every man — every man ", "external_links": [], "published": "2018-01-08T17:10:00.000+02:00", "crawled": "2018-01-08T17:10:23.027+02:00", "highlightTitle": ""}