{"organizations": [], "uuid": "cd025a4ec97ae55c716a71bd05e05ef804f81da2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222123389&w=1200&r=LYNXMPEE0E0NZ", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/us-britain-eu-scotland/scotland-sees-big-hit-to-its-economy-with-no-uk-brexit-deal-idUSKBN1F41BK", "country": "US", "domain_rank": 408, "title": "Sturgeon sees growing support for UK to stay in single market", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-15T19:28:00.000+02:00", "replies_count": 0, "uuid": "cd025a4ec97ae55c716a71bd05e05ef804f81da2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-eu-scotland/scotland-sees-big-hit-to-its-economy-with-no-uk-brexit-deal-idUSKBN1F41BK", "ord_in_thread": 0, "title": "Sturgeon sees growing support for UK to stay in single market", "locations": [], "entities": {"persons": [{"name": "nicola sturgeon", "sentiment": "neutral"}, {"name": "brexit", "sentiment": "none"}, {"name": "sturgeon", "sentiment": "none"}], "locations": [{"name": "edinburgh", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "sturgeon", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EDINBURGH (Reuters) - Scottish leader Nicola Sturgeon has sought to up the pressure on the British government to stay in Europe’s single market after Brexit, saying a growing political majority backs such a deal.\nScotland’s first minister said on Monday the northernmost part of the United Kingdom would suffer an 8.5 percent hit to the size of its economy by 2030 if Britain left the European Union with no trade deal at all.\nSimilarly, business investment in Scotland could be up to 10.2 percent lower than under a no-Brexit scenario.\nSturgeon, who campaigned for Britain to stay in the EU in the June 2016 referendum, said the British government should adopt the “least damaging” stance for Scotland and the UK as a whole.\n“If Brexit is to proceed, then staying in the single market is the only option that makes sense,” she told reporters at the unveiling of a Brexit impact assessment.\nBut Britain had wasted months in the first phase of Brexit talks, only to capitulate to the EU’s demands, and it needed to be more realistic when formal negotiations about a future trade deal start in March, she argued.\n“The UK government mustn’t waste time in this next phase seeking what they know to be unachievable. Common sense means economic considerations must prevail from the start.”\nInfighting in May’s cabinet and Conservative Party has complicated negotiations, while the opposition Labour Party is also split on the best way forward after Brexit.\n“I do believe there is a majority to be harnessed in favor of single market membership,” Sturgeon said, mentioning Conservative and Labour opposition lawmakers.\n“If you wind the clock back a year, the voices in favor of single market membership were not as many or as loud as they are now.”\nMay has ruled out Britain becoming part of the European Economic Area (EEA) because it would mean continued freedom of movement of workers from the EU into Britain, which she has vowed to end.\nThe Scottish government says being in the single market would provide Scotland, which makes up less than a tenth of Britain’s economy as a whole, with the free flow of immigration it needs to shore up its aging population. Britain as a whole voted for Brexit in June 2016, but Scotland voted against it.\nStaying in the single market as an EEA member would mean Scotland’s economy was 2.7 percent smaller by 2030 than it would be if Brexit did not happen at all, the impact report said.\nSturgeon, whose party supports Scottish independence from the UK, has said she will look again at that option by the end of the year, but declined to answer questions on the topic.\nReporting by Elisabeth O'Leary; Editing by William Schomberg and Andrew Roche\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T19:28:00.000+02:00", "crawled": "2018-01-15T22:16:32.006+02:00", "highlightTitle": ""}