{"organizations": [], "uuid": "d1614fec8a56ad0df60b157079dc82534ce63ee3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/canada-economy/wrapup-1-canada-economy-picks-up-in-nov-with-broad-based-growth-idUSL2N1PQ6XK", "country": "US", "domain_rank": 408, "title": "WRAPUP 1-Canada economy picks up in Nov with broad-based growth", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:19:00.000+02:00", "replies_count": 0, "uuid": "d1614fec8a56ad0df60b157079dc82534ce63ee3"}, "author": "", "url": "https://www.reuters.com/article/canada-economy/wrapup-1-canada-economy-picks-up-in-nov-with-broad-based-growth-idUSL2N1PQ6XK", "ord_in_thread": 0, "title": "WRAPUP 1-Canada economy picks up in Nov with broad-based growth", "locations": [], "entities": {"persons": [{"name": "leah schnurr", "sentiment": "none"}], "locations": [{"name": "ottawa", "sentiment": "none"}], "organizations": [{"name": "bank of canada", "sentiment": "none"}, {"name": "statistics canada", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 2:19 PM / in 30 minutes WRAPUP 1-Canada economy picks up in Nov with broad-based growth Leah Schnurr 3 Min Read \nOTTAWA, Jan 31 (Reuters) - The Canadian economy accelerated in November by the most in six months, with activity broad-based across a number of sectors including manufacturing and keeping the Bank of Canada on track to raise interest rates again before long. \nGross domestic product rose by 0.4 percent from October’s flat reading, Statistics Canada said on Wednesday, in line with economists’ expectations and the biggest increase since May 2017. \nGrowth in oil and gas extraction, and the retail and real estate sectors also contributed to November’s strength. The data saw the Canadian dollar extend gains against the greenback. \nEconomists said the report put the fourth quarter on track for about 2 percent growth. While that would be below the 2.5 percent that the Bank of Canada anticipates, it would still cap a strong year for the Canadian economy. \nThe expanding economy is expected to prompt the central bank to raise interest rates again in the coming months, with markets fully pricing in another hike by May. The bank has raised rates three times since last July. \nWith the economy operating near full capacity, the Bank of Canada does not need to see growth of 3 percent or 4 percent to keep on its tightening path, said Mark Chandler, head of Canadian fixed income and currency strategy at Royal Bank of Canada. \nChandler expects the central bank to hold rates steady at its next meeting in March before raising again in April. \nNovember growth was widespread as goods-producing industries led the way higher with a 0.8 percent gain. The manufacturing sector jumped 1.8 percent, its biggest gain since February 2014, helped by increased production of vehicles and parts. \nThe oil and gas extraction subsector climbed 1.6 percent as some facilities continued to get back to normal capacity after maintenance that started in mid-September. \nAmong the services industries, the real estate sector rose 0.4 percent as activity by agents and brokers increased for the fourth month in a row on higher home sales in Ontario and Alberta. \nStill, the industry was below its March 2017 level, just before the Ontario government implemented a number of measures to cool the housing market in Toronto and the surrounding areas. \nThe retail sector grew by 0.6 percent as sales at electronics, appliance and clothing stores were bolstered by Black Friday promotions. \nCanadian producer prices dipped in December due to lower costs of energy and petroleum products, separate data showed. Reporting by Leah Schnurr; Editing by Bernadette Baum and Jeffrey Benkoe", "external_links": [], "published": "2018-01-31T16:19:00.000+02:00", "crawled": "2018-01-31T16:50:31.005+02:00", "highlightTitle": ""}