{"organizations": [], "uuid": "5b651848535f40923750d5869f0f3242e02f3e41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-syntimmune-appoints-jean-paul-kress-m-d-as-president-and-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Syntimmune Appoints Jean-Paul Kress, M.D., as President and Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "5b651848535f40923750d5869f0f3242e02f3e41"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-syntimmune-appoints-jean-paul-kress-m-d-as-president-and-chief-executive-officer.html", "ord_in_thread": 0, "title": "Syntimmune Appoints Jean-Paul Kress, M.D., as President and Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "jean-paul kress", "sentiment": "negative"}, {"name": "kress", "sentiment": "none"}, {"name": "david de graaf", "sentiment": "none"}, {"name": "laurence blumberg", "sentiment": "none"}, {"name": "jean-paul", "sentiment": "none"}, {"name": "burt adelman", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}, {"name": "syntimmune", "sentiment": "none"}], "organizations": [{"name": "syntimmune, inc.", "sentiment": "neutral"}, {"name": "syntimmune", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM, Mass.--(BUSINESS WIRE)-- Syntimmune, Inc., a clinical-stage biotechnology company focused on FcRn biology, today announced that the company has appointed Jean-Paul Kress, M.D., as President and Chief Executive Officer. Dr. Kress, who will also serve as a director of the company, brings senior leadership experience in pharmaceutical and biotechnology firms, with a focus on operations and commercialization of innovative products addressing unmet medical needs across diverse disease indications. David de Graaf, Ph.D., has stepped down from his position as CEO and resigned from the company’s Board of Directors. Syntimmune co-founder Laurence Blumberg, M.D., will continue to serve as Syntimmune’s Chief Operating Officer and as a member of the Board.\n“Jean-Paul possesses decades of experience bringing to market therapies based on breakthrough science,” stated Burt Adelman, M.D., Syntimmune’s lead independent director and advisor to the company. “We are very pleased to welcome this industry veteran at the helm of Syntimmune. We believe Jean-Paul’s leadership brings vision and expertise that will be transformational as the company matures toward becoming a late-stage development organization and continues to rapidly advance therapies targeting FcRn biology to patients.”\nDr. Blumberg added, “We are grateful for David de Graaf’s many contributions during a period of substantial progress at Syntimmune, during which we initiated two mid-stage clinical trials of our lead candidate, SYNT001, and completed a successful Series B financing that has positioned us well for further advancement.”\nPrior to joining Syntimmune, Dr. Kress served as Executive Vice President and President, International, and Head of Global Therapeutic Operations at Biogen Inc., overseeing the company’s rare and specialty disease teams. Previously, Dr. Kress was Senior Vice President, Head of North America at Sanofi Genzyme, where he was instrumental in launching several therapeutic products, including dupilumab, the first biologic agent approved in atopic dermatitis. Prior to this, he was President and Chief Executive Officer of Sanofi Pasteur MSD, a vaccines joint venture of Sanofi and Merck & Co. Dr. Kress also held leadership roles at Gilead, serving as Vice President, US Sales and Marketing, and Vice President, General Manager for France. He began his industry career with Eli Lilly in France and held commercial and business development roles in the US and Europe at Abbott (now AbbVie). Dr. Kress received an M.D. degree from Faculté Necker-Enfants Malades in Paris, and graduate and post-graduate degrees in pharmacology and immunology from École Normale Supérieure in Paris.\n“I am excited to join the accomplished team at Syntimmune, which possesses world-class expertise in immunology and FcRn biology applicable to a broad range of autoimmune diseases,” said Dr. Kress. “Syntimmune has made important strides in advancing its clinical development pipeline, and I look forward to the progress of the company’s ongoing Phase 1b/2a clinical trials of SYNT001 in pemphigus and warm autoimmune hemolytic anemia, as well as the anticipated commencement of clinical studies in additional indications.”\nAbout Syntimmune\nFounded in 2013 by Richard Blumberg, M.D., and Laurence Blumberg, M.D., Syntimmune is advancing novel therapies based on its leading position in the biology of the neonatal Fc receptor (FcRn). Based upon preclinical models, FcRn functions as a core part of a central common pathway that enables abnormal IgG responses, making it a well-validated target for the treatment of IgG-mediated autoimmune diseases. Syntimmune’s lead candidate, SYNT001, is a monoclonal antibody that specifically blocks FcRn-IgG interactions and is being studied in multiple Phase 1b/2a trials for the treatment of IgG-mediated autoimmune diseases. In addition to SYNT001, Syntimmune is developing SYNT002, which targets the interaction between FcRn and albumin and promotes clearance of albumin-bound endo- and exotoxins. The Syntimmune team has world-class experience in the field of FcRn biology and has successfully pioneered and advanced biologics that engage FcRn. Since its founding, the company has been funded with a total of $78 million in capital commitments from leading life sciences investors, led by Apple Tree Partners and includes Partners Innovation Fund, FMB Research, and AFB Fund. For more information on Syntimmune, please visit the company’s website at www.syntimmune.com .\n //www.businesswire.com/news/home/20180103005080/en/\nBurns McClellan\nJustin Jackson, 212-213-0006, ext. 327\njjackson@burnsmc.com\nSource: Syntimmune, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.syntimmune.com&esheet=51736505&newsitemid=20180103005080&lan=en-US&anchor=www.syntimmune.com&index=1&md5=053c1e4549da150956b7f5bddb455e8d", "http://www.businesswire.com/news/home/20180103005080/en/"], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T17:08:01.000+02:00", "highlightTitle": ""}