{"organizations": [], "uuid": "f2a99e31acdbc9de313c5e2170afd7379a323345", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-service-credit-union-names-vp-of-marketing.html", "country": "US", "domain_rank": 767, "title": "Service Credit Union Names VP of Marketing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-16T20:05:00.000+02:00", "replies_count": 0, "uuid": "f2a99e31acdbc9de313c5e2170afd7379a323345"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-service-credit-union-names-vp-of-marketing.html", "ord_in_thread": 0, "title": "Service Credit Union Names VP of Marketing", "locations": [], "entities": {"persons": [{"name": "beswick", "sentiment": "none"}, {"name": "wendy bryant-beswick", "sentiment": "none"}, {"name": "dan clarke", "sentiment": "none"}], "locations": [{"name": "portmouth", "sentiment": "none"}, {"name": "n.h.", "sentiment": "none"}], "organizations": [{"name": "service credit union", "sentiment": "negative"}, {"name": "service credit union names vp of marketing", "sentiment": "negative"}, {"name": "firstmark credit union", "sentiment": "none"}, {"name": "national desjardins", "sentiment": "none"}, {"name": "bcci", "sentiment": "none"}, {"name": "digital marketing", "sentiment": "none"}, {"name": "retail service", "sentiment": "none"}, {"name": "generations federal credit union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PORTMOUTH, N.H., Jan. 16, 2018 /PRNewswire/ -- Service Credit Union is pleased to announce today the appointment of Wendy Bryant-Beswick to Vice President of Marketing. A seasoned executive with more than 20 years of marketing management experience, Beswick will oversee the planning and execution of Service Credit Union's marketing initiatives including positioning, brand oversight, acquisition, communications, public relations, and business development. She will report to Dan Clarke, SCU Chief Operating Officer.\nPrior to joining SCU, Beswick was recently the Chief Retail Officer for Firstmark Credit Union responsible for all aspects of Retail Service and Marketing. As Chief Marketing Officer for Generations Federal Credit Union, she redeveloped the brand and contributed to significant business growth garnering multiple awards and recognition to include the National Desjardins for youth financial education efforts. Prior to these roles, she served as Vice President of Digital Marketing for iShares/BlackRock, Chief Marketing Officer for BCCI Builders and Senior Business Strategist for Charles Schwab.\n\"Wendy is a dynamic individual and brings real passion, powerful insight from the market, and a proven ability to lead high-performing marketing teams that deliver winning results,\" said Clarke. \"Marketing is a fast-moving profession and Wendy has been on the leading edge throughout her career. She is able to leverage big data, media, creative, social/digital to develop clear, compelling strategies that connect with target audiences in alignment with the credit union's purpose.\"\n\"I am thrilled to join SCU's team and unique culture,\" said Beswick. \"The credit union puts members at the center of their business, evident by an impressive and enthusiastic membership and organizational reach in the US and Germany. I am excited about the opportunity as we continue to innovate and expand our reach across a variety of platforms.\"\nAbout Service Credit Union\nAs a dynamic, member-owned, not-for-profit financial cooperative, Service Credit Union is dedicated to offering quality financial services and products. In 1957, the credit union was established to provide affordable credit to the Pease Air Force Base community. Now the largest credit union in New Hampshire, with over $3 billion in assets and 51 branch locations in New Hampshire, Massachusetts, North Dakota and Germany, we continue to serve our communities and provide a better future to our members. For more information, visit https://servicecu.org or call toll free 1-800-936-7730 in the U.S. and 00800-4728-2000 internationally.\nView original content with multimedia: http://www.prnewswire.com/news-releases/service-credit-union-names-vp-of-marketing-300583279.html\nSOURCE Service Credit Union", "external_links": ["http://www.prnewswire.com/news-releases/service-credit-union-names-vp-of-marketing-300583279.html", "https://servicecu.org/"], "published": "2018-01-16T20:05:00.000+02:00", "crawled": "2018-01-16T21:14:57.000+02:00", "highlightTitle": ""}