{"organizations": [], "uuid": "da9dc3114f9521c7a070d3b3506f3d3b6b944a02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-yields-come-off-highs-as-german-inflation-data-eyed-idUSL8N1PP36Q", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Weak German inflation data pushes euro zone yields off highs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T18:10:00.000+02:00", "replies_count": 0, "uuid": "da9dc3114f9521c7a070d3b3506f3d3b6b944a02"}, "author": "", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-yields-come-off-highs-as-german-inflation-data-eyed-idUSL8N1PP36Q", "ord_in_thread": 0, "title": "UPDATE 2-Weak German inflation data pushes euro zone yields off highs", "locations": [], "entities": {"persons": [{"name": "fanny potkin", "sentiment": "none"}, {"name": "abhinav ramnarayan", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 11:58 AM / in 27 minutes UPDATE 2-Weak German inflation data pushes euro zone yields off highs Reuters Staff \n* German inflation slows unexpectedly in Jan \n* Borrowing costs fall 1-3 bps across the bloc \n* Italy sells 10- and 50-year bonds \n* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Adds German data, move in US yields, Knot comments ) \nBy Abhinav Ramnarayan and Fanny Potkin \nLONDON, Jan 30 (Reuters) - Borrowing costs across the euro zone came off multi-year highs on Tuesday after weak German inflation data supported a view that the European Central Bank would take a cautious approach to unwinding its massive monetary stimulus. \nIn a sign that price pressures remain moderate even in booming Germany, the euro zone’s largest economy, consumer price inflation, harmonised to compare with other euro zone countries, slowed to 1.4 percent on the year in January. \nThat was below the consensus forecast in a Reuters poll of analysts who had predicted an unchanged reading of 1.6 percent and followed mixed inflation data earlier from German regions. \nThe ECB’s target is for inflation of just below 2 percent in the euro zone. \nHaving hit multi-year highs on Monday on expectations that the ECB will unwind stimulus, the German data brought some relief to bond markets. \nTen-year bond yields fell 1-3 basis points across the board on Tuesday, but faced some upward pressure in afternoon trade as U.S. Treasury yields climbed to fresh highs. \n“If German inflation readings are weaker, we would enter a consolidation mode as questions are raised on the sustained inflation dynamics in the euro zone,” said DZ Bank analyst Sebastian Fellechner. \nIn late trade, central bank chief Klaas Knot said the ECB should end its asset buys after September as inflation was on its way towards the bank’s target, but that a short phasing-out period is acceptable. \nEuro zone bond yields have risen sharply in recent weeks as a booming European economy has fuelled expectations that the ECB will end extraordinary stimulus sooner rather than later. \nThe euro zone economy expanded at its fastest rate in a decade in 2017, preliminary data showed on Tuesday. \nGermany’s 10-year bond yield rose from 0.306 percent in the first week of December to an more-than two-year high of 0.707 percent on Monday. But it had slipped back on Tuesday to 0.68 percent, down around 1 bps on the day. \nAfter going positive for the first time since late 2015 on Monday, five-year German bond yields slipped back into negative territory. \nThis fall in yields comes even as Italy auctioned 7 billion euros in medium and longer-term bonds, including a sale of 50-year bonds. \nDespite expectations of volatility in the run-up to a March 4 general election, a strengthening euro zone economy has taken the edge off concerns over the popularity of anti-establishment party 5-Star Movement, keeping the Italy-Germany 10-year government bond yield spread tight at around 138 bps. (Reporting by Fanny Potkin; Additional reporting by Dhara Ranasinghe; Editing by Catherine Evans)", "external_links": [], "published": "2018-01-30T18:10:00.000+02:00", "crawled": "2018-01-30T18:46:49.006+02:00", "highlightTitle": ""}