{"organizations": [], "uuid": "03a25f52522d140b32e011e6b4b51347bf364361", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds-snb/graphic-in-great-central-bank-policy-unwind-dont-forget-the-snb-idUSL8N1P7530", "country": "US", "domain_rank": 408, "title": "GRAPHIC- In great central bank policy unwind, don't forget the SNB", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T18:06:00.000+02:00", "replies_count": 0, "uuid": "03a25f52522d140b32e011e6b4b51347bf364361"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds-snb/graphic-in-great-central-bank-policy-unwind-dont-forget-the-snb-idUSL8N1P7530", "ord_in_thread": 0, "title": "GRAPHIC- In great central bank policy unwind, don't forget the SNB", "locations": [], "entities": {"persons": [{"name": "dhara ranasinghe", "sentiment": "none"}, {"name": "vincent deluard", "sentiment": "none"}], "locations": [{"name": "czech republic", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "snb", "sentiment": "neutral"}, {"name": "european central bank", "sentiment": "none"}, {"name": "national bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* SNB bought 45 bln euros of German bonds since ‘15- analyst\n* Weaker Swiss franc eases pressure on SNB FX intervention\n* Pause in SNB bond-buying another headwind for bonds\nBy Dhara Ranasinghe\nLONDON, Jan 15 (Reuters) - As the European Central Bank cuts back on its asset purchases, the impact of other central banks in Europe pausing or unwinding their holdings of euro zone government debt should not be underestimated.\nCentral banks in Denmark, the Czech Republic and Switzerland have in recent years bought euro zone assets - in particular top-rated German bonds - as part of their intervention to weaken local currencies, according to analysts.\nThe Swiss National Bank (SNB) has bought around 45 billion euros ($55 billion) worth of German bonds since early 2015, Vincent Deluard, global macro strategist at U.S.-based broker dealer INTL FCStone, estimates.\nBased on the SNB’s annual statement, he calculates that about 18 percent of the SNB’s balance sheet expansion since 2015 ended up in short-dated German debt.\nA weakening in the Swiss franc suggests the SNB is under less pressure to intervene in the currency markets, by creating francs and selling them to buy German bonds.\nAny pause or unwinding in those purchases may add to selling pressure in German bonds, just as speculation is growing that the ECB will end its stimulus scheme earlier than expected. The ECB halved its monthly asset purchases in January, cutting its support for regional bonds.\nThe bulk of ECB purchases have focused on Germany, the euro zone’s biggest economy.\n“Look at the Swiss franc levels today - we’re almost back at levels before the currency was de-pegged, so arguably the justification to intervene in currency markets has gone,” Deluard said.\n“Massive foreign exchange interventions are no longer needed to contain a soaring Swiss franc: the currency has lost about 10 percent against the euro since April. All the gains that followed the January 2015 surprise un-pegging (against the euro)have unwound, so the SNB can declare victory, and focus on normalizing its bloated balance sheet.”\nSwitzerland upped its economic growth forecasts for 2017 and 2018 last month as the country’s export-led economy recovered.\nPictet Wealth Management economist Nadia Gharbi said weekly variations in total sight deposits at the SNB (a proxy for the central bank’s currency interventions), suggest no evidence that the bank has intervened in the market since July 2017.\n“In the hypothesis that the SNB decides to unwind FX interventions, one possibility could be to sell negatively yielding AAA-rated euro zone bonds faster to spread losses upon redemption in its portfolio,” she said.\nAnalysts say hefty demand from central banks help explain the fall in two-year German bond yields to record lows at minus 0.96 percent early last year.\nTwo-year German yields are now trading around minus 0.58 percent, having hit 6 1/2-month highs last week.\nLast month, the SNB said it expected Swiss inflation to exceed its target in three years - an indication of when it might exit its ultra-loose monetary policy.\nSNB “policy normalisation” remains some way off, but markets are likely to be any sensitive to any perceived shifts in policy .\nLast week, Japanese bond yields jumped on talk the Bank of Japan may wind down its monetary stimulus. A report that China may slow or halt U.S. bond purchases sent U.S. Treasury yields to 10-month highs and hawkish ECB minutes pushed German bond yields sharply higher .\nReporting by Dhara Ranasinghe; graphic by Ritvik Carvalho, editing by Larry King\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T18:06:00.000+02:00", "crawled": "2018-01-16T13:33:15.003+02:00", "highlightTitle": ""}