{"organizations": [], "uuid": "d7a2987289c01648b4dd5461ed91ff74127f043e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.cbd.int/rss/all-info.aspx", "section_title": "CBD Information Channel", "url": "https://www.reuters.com/article/malaysia-palmoil-protests/malaysian-farmers-protest-europes-push-to-curb-palm-oil-imports-idUSL3N1PB1G5", "country": "US", "domain_rank": 408, "title": "Headline: Malaysian farmers protest Europe's push to curb palm oil imports", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T02:00:00.000+02:00", "replies_count": 0, "uuid": "d7a2987289c01648b4dd5461ed91ff74127f043e"}, "author": "", "url": "https://www.reuters.com/article/malaysia-palmoil-protests/malaysian-farmers-protest-europes-push-to-curb-palm-oil-imports-idUSL3N1PB1G5", "ord_in_thread": 0, "title": "Headline: Malaysian farmers protest Europe's push to curb palm oil imports", "locations": [], "entities": {"persons": [{"name": "aliasak ambia", "sentiment": "none"}, {"name": "aliasak", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "kuala lumpur", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "national association of smallholders", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR, Jan 16 (Reuters) - Hundreds of Malaysian palm oil farmers gathered in the capital city of Kuala Lumpur on Tuesday to protest a push by European Union lawmakers to curb palm oil imports from the world’s second-biggest producer of the edible oil.\nSmallholders, who account for about 40 percent of Malaysia’s palm oil output, say the EU’s move could threaten their livelihoods because prices will likely fall if supply that would normally go to Europe is left sloshing around the market.\n“We are protesting (the EU’s call) ... as we will lose out,” said Aliasak Ambia, president of the National Association of Smallholders, which has submitted a petition to the EU representative office in Kuala Lumpur in protest of the vote.\n“Smallholders rely on palm oil income to buy food and send their children to school. We have cultivated palm for decades, (and) it has brought development. The country is rich because of palm oil,” Aliasak said.\nThe European Parliament backed a call in April last year for greater vetting of palm and other vegetable oils used in biofuels to prevent the European Union’s renewable transport targets for post-2020 leading to deforestation.\nEU lawmakers said the earlier move was a bid for wider discussion on the issue after environmental groups such as Greenpeace warned of harmful impact on climate mitigation and biodiversity.\nThe lawmakers are now reviewing and proposing amendments to EU draft targets on biofuels, which will then go before the European Commission and member states. The EU Parliament is set to vote on their position on the move this Wednesday before it is discussed again and becomes the law.\nA large portion of Europe’s palm oil imports are used to make biofuels, giving the palm oil industry cause for concern as they fear overall demand will fall.\nMalaysia’s Prime Minister Najib Razak and Indonesian President Joko Widodo have called the move discriminatory, saying it singles out palm oil even though the production of other vegetable oils has also “shown to contribute to the deforestation”.\nIndonesia is the world’s largest producer of palm oil, and the two countries together account for nearly 90 percent of global output.\n“If palm oil is boycotted, I don’t know what will be our fate,” said Farhan Noor Ishak, a farmer from Malaysia’s southern state of Johor.\nHis family’s income can be halved when palm oil prices drop. “We will be poor on our own land,” he said.\nEurope has overtaken China to become Malaysia’s second-largest export market for palm oil, importing 2.06 million tonnes in 2017, according to the Malaysian Palm Oil Board.\nIndia remains Malaysia’s top palm oil buyer at 2.83 million tonnes last year. China was the third-largest, importing 1.88 million tonnes last year. (Reporting by Emily Chow; Editing by Tom Hogue)\n ", "external_links": [], "published": "2018-01-16T02:00:00.000+02:00", "crawled": "2018-01-17T04:26:43.019+02:00", "highlightTitle": ""}