{"organizations": [], "uuid": "22e1b4656c2547877791be6a5361a90d60ed33aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/24/104792572-GettyImages-865708314.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/south-korea-cryptocurrency-regulations-come-into-effect.html", "country": "US", "domain_rank": 767, "title": "South Korea cryptocurrency regulations come into effect", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.213, "site_type": "news", "published": "2018-01-30T06:26:00.000+02:00", "replies_count": 0, "uuid": "22e1b4656c2547877791be6a5361a90d60ed33aa"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/29/south-korea-cryptocurrency-regulations-come-into-effect.html", "ord_in_thread": 0, "title": "South Korea cryptocurrency regulations come into effect", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Korean regulatory plans to tackle cryptocurrency speculation spooked investors earlier this month. But as the new rules take effect on Tuesday, participants in the market are sounding a positive note.\nSouth Korea's Financial Services Commission on Tuesday confirmed to CNBC that new measures outlined by the body earlier this month had been implemented, but a spokesperson said in an email that it was still too early to discuss any effects of those rules.\nIn a document published on Jan. 23, the regulator said it would only allow trade in cryptocurrencies from real-name bank accounts beginning Jan. 30. Those rules enabled banks to comply with their KYC AML (know your customer, anti-money laundering) obligations, the document said.\nThe measures outlined were intended to \"reduce room for cryptocurrency transactions to be exploited for illegal activities, such as crimes, money laundering and tax evasion,\" the FSC added in the document.\nMarkets appeared relatively sanguine following the implementation of the new rules.\nA representative of South Korean cryptocurrency exchange Bithumb, which began the real-name cryptocurrency identification service this morning local time, said operations had \"gone smoothly\" on Tuesday. \"Nothing has changed in terms of coin transaction,\" he added.\nMeanwhile, participants in the cryptocurrency space said the steps taken by South Korea were positive on a long-term basis.\n\"I think it's the start of a crackdown on anonymity and the illegal use cases that some cryptocurrencies might have,\" Julian Hosp, co-founder and president of cryptocurrency start-up TenX, told CNBC's \"The Rundown.\"\n\"If, afterwards, investors and companies have more legal security working in the ecosystem, it's going to have some short-term downsides, but long term, it's going to have a really, really big boost,\" Hosp explained.\nThe implementation of those news rules came after mixed messages about regulation from South Korean officials at various ministries spooked cryptocurrency markets earlier this month.\nshow chapters This investor welcomes regulations on cryptocurrencies 19 Hours Ago | 03:36 \"Protocols to protect investors have been what the cryptocurrency markets have been missing and it's what the legislation in South Korea seeks to implement,\" said John Sarson, managing partner at Blockchain Momentum, which invests in cryptocurrencies and blockchain-related companies.\n\"It's a good thing anytime an investment exchange knows their client and makes sure that their clients are doing things that are above board legally,\" he said, adding that those rules allowed for greater scale and legitimacy.\nTrade in bitcoin denominated in Korean won stood at around 4 percent on Tuesday, according to CryptoCompare. That compared to the more than 40 percent of total bitcoin trade denominated in Japanese yen and the roughly 30 percent transacted in dollar terms.\nDespite those proportions, the regulations in South Korea could still make a broader impact in the market, according to Hosp.\n\"The space is highly emotional and things are taken from a small thing and extrapolated into something really large. So even if Korea is quite small on a rational scale, it still could have a big impact,\" Hosp said, stressing that he thought the developments would ultimately be positive.\nRegulation and risks within the space have come back under the spotlight after some $530 million worth of virtual money was stolen from Japanese exchange Coincheck. Following the hack, authorities in Japan — which last year officially recognized several cryptocurrency exchanges — directed the exchange to improve its operations .\nCorrection: This story has been updated to reflect the name of South Korea's financial regulator.", "external_links": [], "published": "2018-01-30T06:26:00.000+02:00", "crawled": "2018-01-30T06:37:58.069+02:00", "highlightTitle": ""}