{"organizations": [], "uuid": "33552b656bba26965730016ee70ba6f8cdbddefa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/india-banks-results/update-1-indias-hdfc-bank-posts-record-q3-profit-on-steady-asset-quality-idUSL3N1PE2DR", "country": "US", "domain_rank": 408, "title": "UPDATE 2-India's HDFC Bank, Kotak report strong profit growth in Q3", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:29:00.000+02:00", "replies_count": 0, "uuid": "33552b656bba26965730016ee70ba6f8cdbddefa"}, "author": "", "url": "https://www.reuters.com/article/india-banks-results/update-1-indias-hdfc-bank-posts-record-q3-profit-on-steady-asset-quality-idUSL3N1PE2DR", "ord_in_thread": 0, "title": "UPDATE 2-India's HDFC Bank, Kotak report strong profit growth in Q3", "locations": [], "entities": {"persons": [{"name": "devidutta tripathy", "sentiment": "none"}, {"name": "krishna v kurup", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "kotak", "sentiment": "negative"}, {"name": "hdfc bank", "sentiment": "negative"}, {"name": "hdfc bank ltd", "sentiment": "none"}, {"name": "kotak mahindra bank ltd", "sentiment": "none"}, {"name": "kotak mahindra", "sentiment": "none"}, {"name": "idfc bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 7:17 AM / Updated an hour ago UPDATE 2-India's HDFC Bank, Kotak report strong profit growth in Q3 Reuters Staff \n* HDFC Bank, Kotak Mahindra Q3 profit rises 20 pct each \n* Retail-focused banks outpacing rivals choked by bad loans \n* IDFC Bank profit falls as non-performing loans rise (Adds Kotak Mahindra, IDFC Bank results, executive and analyst comments) \nBy Devidutta Tripathy and Krishna V Kurup \nMUMBAI, Jan 19 (Reuters) - Two of India’s biggest private-sector lenders - HDFC Bank Ltd and Kotak Mahindra Bank Ltd - each reported a 20 percent rise in third-quarter net profit on Friday due to strong lending growth and as bad loans remained stable. \nIndia’s banking sector has been burdened by nearly $150 billion of soured assets, the bulk of it with the state-backed lenders, crimping new lending. \nRetail-focused banks such as HDFC Bank and Kotak that have a relatively smaller exposure to the troubled metals and infrastructure sectors have fared better than rivals. \nHDFC Bank, the biggest of the Indian private sector lenders and second-biggest overall by assets, reported net profit rose 20 percent from a year earlier to a record 46.43 billion rupees ($728.4 million) for the three months to Dec. 31, in line with analysts’ expectations, helped by higher interest and fee income. \nKotak Mahindra, the fourth-biggest private sector bank by assets, said net profit rose 20 percent to 10.53 billion rupees in the quarter, also roughly matching analysts’ expectations. \nHDFC Bank’s deputy managing director Paresh Sukthankar told a news conference the lender saw loans growing during the quarter “equally strongly” in both the wholesale and retail segments. \nThe wholesale book, which is currently being driven by refinance and working capital related loans, could see a further pick up when companies’ capital expenditure cycle revives, he said. \nThe bank, the most valuable in the sector with a market capitalisation of more than $78 billion, has 55 percent of its lending in retail segments such as car loans, and the remainder in wholesale. \nAshutosh Mishra, a banking analyst at Mumbai brokerage Reliance Securities, said the brokerage would raise its valuation multiple on the stock on the back of a pick-up in loan growth and strong growth in other income. \nHDFC Bank’s gross bad loans as a percentage of total loans were 1.29 percent at end-December, versus 1.26 percent at end-September, with the bank upgrading an unnamed large corporate account with loan exposure of about 17 billion rupees back to standard from non-performing after “satisfactory” performance. \nKotak Mahindra’s profit was on the back of 23 percent growth in loans. The bank’s gross bad loan ratio narrowed slightly to 2.31 percent at end-December from 2.47 percent a quarter earlier. \nIDFC Bank, a smaller private sector lender that also reported third quarter results on Friday, saw its net profit fall 24 percent as its bad loans rose. The bank, heavily dependent on corporate loans, agreed last week to acquire non-bank lender Capital First in a share-swap deal to boost its retail lending. $1 = 63.7425 Indian rupees Reporting by Devidutta Tripathy and Krishna V Kurup; Editing by Himani Sarkar and Adrian Croft", "external_links": [], "published": "2018-01-19T15:29:00.000+02:00", "crawled": "2018-01-19T16:23:30.002+02:00", "highlightTitle": ""}