{"organizations": [], "uuid": "225d1455b1c21184e77b3407e8b42abd01fdcf6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-nbt-bancorp-inc-announces-net-income-of-82-point-2-million-and-diluted-earnings-per-share-of-1-point-87-declares-cash.html", "country": "US", "domain_rank": 767, "title": "NBT Bancorp Inc. Announces Net Income of $82.2 Million and Diluted Earnings Per Share of $1.87; Declares Cash Dividend; Excluding the Estimated Impact of Tax Reform, Net Income Up 10.4% from 2016 to $86.6 Million and Diluted Earnings Per Share of $1.97", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.263, "site_type": "news", "published": "2018-01-23T00:18:00.000+02:00", "replies_count": 0, "uuid": "225d1455b1c21184e77b3407e8b42abd01fdcf6b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-nbt-bancorp-inc-announces-net-income-of-82-point-2-million-and-diluted-earnings-per-share-of-1-point-87-declares-cash.html", "ord_in_thread": 0, "title": "NBT Bancorp Inc. Announces Net Income of $82.2 Million and Diluted Earnings Per Share of $1.87; Declares Cash Dividend; Excluding the Estimated Impact of Tax Reform, Net Income Up 10.4% from 2016 to $86.6 Million and Diluted Earnings Per Share of $1.97", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "norwich", "sentiment": "none"}], "organizations": [{"name": "nbt bancorp inc.", "sentiment": "neutral"}, {"name": "nbt bancorp inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NORWICH, N.Y., Jan. 22, 2018 (GLOBE NEWSWIRE) -- NBT Bancorp Inc. (“NBT” or the “Company”) (NASDAQ:NBTB) reported net income and diluted earnings per share for the year ended December 31, 2017.\nNet income for the year ended December 31, 2017 was $82.2 million, up from $78.4 million for the prior year. Diluted earnings per share for the year ended December 31, 2017 was $1.87, up from $1.80 for the prior year. Net income excluding the $4.4 million estimated one-time, non-cash charge recorded in the provision for income taxes related to the enactment of the Tax Cuts and Jobs Act (“Tax Reform”) was up 10.4% from 2016 to $86.6 million or $1.97 diluted earnings per share. The estimate may be refined in future periods as further information becomes available.\nNet income for the three months ended December 31, 2017 was $17.6 million, as compared to $22.9 million for the prior quarter and $19.6 million for the same period last year. Diluted earnings per share for the three months ended December 31, 2017 was $0.40, as compared with $0.52 for the prior quarter and $0.45 for the fourth quarter of 2016. Net income excluding the $4.4 million one-time, non-cash charge recorded in the provision for income taxes related to the enactment of Tax Reform was up 12.4% from the prior year fourth quarter to $22.0 million or $0.50 diluted earnings per share.\nThe Company will realize a reduction in tax expense beginning in 2018 due to Tax Reform decreasing the federal rate for corporations from 35% to 21%. As a result, the Company is raising the starting hourly pay rate of $11 to $15 per hour and employees earning $50,000 or less will receive a permanent minimum increase of 5%. This will positively impact over 61% of the Company’s workforce. Moreover, in 2018 the Company will be increasing both its investment in infrastructure to enhance customer-facing technology and contributions to nonprofit organizations in its footprint.\nHighlights:\nNet income up 4.8% from the prior year, up 10.4% excluding the impact of Tax Reform Year to date loan growth of 6.2% Average demand deposits up 8.4% for the year Net interest margin expands 4 basis points to 3.47%\n“We delivered strong results in 2017, including record net income for the fifth straight year and a new annual EPS record,” said NBT President and CEO John H. Watt, Jr. “Our talented team of professionals has driven our success and their efforts have been supported by an improving domestic economy and higher consumer confidence. Tax reform has created an important opportunity for NBT to invest in our employees, the customer experience and our communities,” continued Watt. “Allocating resources to permanent wage increases, customer-facing technology and contributions to the organizations that serve our communities is in alignment with the intent of the tax reform act and, most important, it allows us to invest in enhancing our business, ultimately increasing the return to our shareholders.”\nNet interest income was $283.5 million for the year ended December 31, 2017, up $19.1 million, or 7.2%, from 2016. Fully taxable equivalent (“FTE”) net interest margin was 3.47% for the year ended December 31, 2017 up from 3.43% for the year ended December 31, 2016. Average interest earning assets were up $457.9 million, or 5.9%, for the year ended December 31, 2017, as compared to the same period in 2016, driven by a $323.9 million increase in loans and a $132.8 million increase in securities. Interest income increased $22.5 million, or 7.8% due to the increase in earning assets combined with a 7 basis point (“bp”) improvement in asset yields. Interest expense was up $3.4 million, or 15.1%, for the year ended December 31, 2017 as compared to the same period in 2016 and resulted primarily from a $263.1 million increase in the average balance of interest bearing liabilities and a 4 bp increase in rates driven by changes in mix and higher borrowing costs.\nNet interest income was $73.5 million for the fourth quarter of 2017, up $1.5 million, or 2.1%, from the previous quarter. FTE net interest margin was 3.52% for the three months ended December 31, 2017 up from 3.47% for the previous quarter. The yield on average earning assets increased 4 bps from the prior quarter to 3.84% while the cost of interest bearing liabilities remained relatively consistent at 0.46% for the quarter ended December 31, 2017. Average interest earning assets were up $42.4 million, or 0.5%, as compared to the prior quarter, primarily driven by a $128.2 million increase in loans and a $77.0 million decrease in securities.\nNet interest income was $73.5 million for the fourth quarter of 2017, up $6.0 million, or 8.9%, from the fourth quarter of 2016. FTE net interest margin of 3.52% was up 11 bps from the fourth quarter of 2016 as the improvement in asset yields was partially offset by the increase in cost of interest bearing liabilities. Average interest earning assets were up $402.7 million, or 5.0%, from the same period in 2016, primarily driven by a $372.5 million increase in loans and a $33.7 million increase in securities.\nNoninterest income for the year ended December 31, 2017 was $121.3 million, up $5.6 million, or 4.8%, from the same period of 2016. The increase in noninterest income from the prior year was driven by higher retirement plan administration fees, net securities gains (losses), ATM and debit card fees and trust revenues that were partially offset by lower other noninterest income and insurance and other financial services revenue during 2017 as compared to 2016. Retirement plan administration fees increased in 2017 as compared to the prior year due primarily to acquisitions completed in 2016 and the acquisition of Downeast Pension Services (“DPS”) in the second quarter of 2017. Net securities gains (losses) increased due to a gain recognized on the sale of securities in 2017 as compared to a net loss in 2016. ATM and debit card fees increased from the prior year due to a higher number of accounts and increased usage in 2017 as compared to 2016. Trust revenue increased from the prior year due to market returns and account growth. Other noninterest income decreased from 2016 to 2017 due to lower swap fee income and a net decrease in non-recurring items of $1.4 million. Insurance and other financial services revenue decreased from the prior year primarily due to the divestiture of a book of business in the third quarter of 2016.\nNoninterest income for the three months ended December 31, 2017 was $31.5 million, up $0.7 million, or 2.3%, from the prior quarter and up $3.4 million, or 12.0%, from the fourth quarter of 2016. The increase from the prior quarter was driven by higher net securities gains (losses) offset by lower other noninterest income. Other noninterest income decreased due to $0.7 million in lower swap fees and a miscellaneous recovery of $0.2 million. The increase in noninterest income from the fourth quarter of 2016 was driven by higher net securities gains (losses), retirement plan administration, ATM and debit card fees and trust revenue that were offset by lower other financial services revenue during the fourth quarter of 2017. Other noninterest income decreased from the same period of 2016 due to $0.2 million reduction in swap fees and a $0.5 million equity investment dividend received in 2016 that did not occur in 2017.\nNoninterest expense for the year ended December 31, 2017 was $245.6 million, up $9.7 million, or 4.1%, from the same period of 2016 due to higher salaries and employee benefits, loan collection and other real estate owned (“OREO”) expense and other noninterest expense. Other noninterest expense increased $3.9 million due to the write-down of an intangible asset no longer in use due to a change in business strategy combined with a favorable settlement of an accrual in 2016. Salaries and employee benefits increased from the prior year due to the acquisition of DPS in the second quarter of 2017 and higher medical costs. Loan collection and OREO expense increased from the prior year due primarily to commercial property write-downs.\nNoninterest expense for the three months ended December 31, 2017 was $63.4 million, up $2.8 million, or 4.7%, from the prior quarter and up $5.8 million, or 10.1%, from the fourth quarter of 2016. The increase from the prior quarter was driven by higher other noninterest expense, professional fees and advertising expenses that were offset by a decrease in loan collection and OREO expenses. The increase from the fourth quarter of 2016 was driven by increases in other noninterest and salaries and employee benefits expenses. Salaries and employee benefits expense increased from the fourth quarter of 2016 due to the acquisition of DPS in the second quarter of 2017. Other noninterest expense increased from the prior quarter due to the write-down of intangible assets no longer in use. Other noninterest expense increased from the prior year quarter due to the previously mentioned intangible asset write-down combined with the favorable settlement of an accrual in the fourth quarter of 2016.\nIncome tax expense for the year ended December 31, 2017 was $46.0 million, up $5.6 million, or 13.9%, from $40.4 million, for the same period of 2016. The effective tax rate of 35.9% for 2017 was up from 34.0% for 2016. The increase from the prior year was primarily due to a higher level of taxable income in 2017 combined with the $4.4 million estimated non-cash charge related to the enactment of Tax Reform resulting in the re-measurement of the Company’s deferred tax assets and liabilities arising from the lower federal tax rate. The estimate may change, possibly materially, due to further analysis, guidance and changes in interpretations. Offsetting this charge was a $1.8 million income tax benefit related to the adoption of new accounting guidance in 2017. Excluding the Tax Reform charge and the tax benefit of the new accounting guidance, the effective tax rate was 33.8% for 2017.\nIncome tax expense for the three months ended December 31, 2017 was $15.7 million, up $4.3 million, or 38.3%, from the prior quarter and up $5.6 million, or 55.3%, from the fourth quarter of 2016. The effective tax rate of 47.1% for the fourth quarter of 2017 was up from 33.1% for the third quarter of 2017 and up from 34.0% for the fourth quarter of 2016. The increase in income tax expense from the prior quarter was due to the impact of Tax Reform. The increase in income tax expense from the same quarter of the prior year was due to a higher level of taxable income and the previously mentioned Tax Reform charge. Excluding the Tax Reform charge and the tax benefit of the new accounting guidance, the effective tax rate was 33.7% and 34.1% for the third and fourth quarters of 2017, respectively.\nIn the first quarter of 2017, NBT adopted new accounting guidance for equity-based transactions requiring that all excess tax benefits and tax deficiencies associated with equity-based compensation be recognized as an income tax benefit or expense in the income statement. Previously, tax effects resulting from changes in NBT’s share price subsequent to the grant date were recorded through stockholders’ equity at the time of vesting or exercise. The adoption of the accounting guidance resulted in income tax benefits of $1.4 million, $0.1 million, $0.2 million and $0.1 million, in the first, second, third and fourth quarters of 2017, respectively. The year-to-date impact to diluted earnings per share was $0.04.\nAsset Quality\nNet charge-offs were $26.7 million for the year ended December 31, 2017, as compared to $23.2 million for the same period of 2016. Provision expense was $31.0 million for the year ended December 31, 2017, as compared with $25.4 million for same period of 2016. Provision expense increased as compared to the year ended December 31, 2016 due to loan growth and higher net charge-offs driven by higher charge-offs in the consumer ($2.4 million) and residential ($0.6 million) portfolios. Annualized net charge-offs to average loans for the year ended December 31, 2017 was 0.42% compared with 0.39% for the same period of 2016.\nNet charge-offs were $7.0 million for the three months ended December 31, 2017, as compared to $6.1 million for the prior quarter and $8.6 million for the fourth quarter of 2016. Provision expense was $8.2 million for the three months ended December 31, 2017, as compared with $7.9 million for the prior quarter and $8.2 million for the fourth quarter of 2016. Annualized net charge-offs to average loans for the fourth quarter of 2017 was 0.43%, up from 0.38% for the prior quarter of 2017 and down from 0.56% for the fourth quarter of 2016.\nNonperforming loans to total loans was 0.47% at December 31, 2017, up 5 bps from 0.42% for the prior quarter and down 18 bps from 0.65% at December 31, 2016. Past due loans as a percentage of total loans were 0.63% at December 31, 2017, which equaled the prior quarter and were comparable to 0.64% at December 31, 2016.\nThe allowance for loan losses totaled $69.5 million at December 31, 2017, compared to $68.4 million at September 30, 2017 and $65.2 million at December 31, 2016. The allowance for loan losses as a percentage of loans was 1.06% (1.12% excluding acquired loans) at December 31, 2017, compared to 1.06% (1.13% excluding acquired loans) at September 30, 2017 and 1.05% (1.13% excluding acquired loans) at December 31, 2016.\nBalance Sheet\nTotal assets were $9.1 billion at December 31, 2017, up $269.5 million, or 3.0%, from December 31, 2016. Loans were $6.6 billion at December 31, 2017, up $386.7 million, or 6.2%, from December 31, 2016. Total deposits were $7.2 billion at December 31, 2017, up $196.9 million, or 2.8%, from December 31, 2016. Stockholders’ equity was $958.2 million, representing a total equity-to-total assets ratio of 10.49% at December 31, 2017, compared with $913.3 million or a total equity-to-total assets ratio of 10.30% at December 31, 2016.\nStock Repurchase Program\nThe Company did not purchase shares of its common stock during the three or twelve months ended December 31, 2017. As of December 31, there were 1,000,000 shares available for repurchase under a plan authorized on October 23, 2017, which expires on December 31, 2019.\nDividend\nThe NBT Board of Directors approved a 2018 first-quarter cash dividend of $0.23 per share at a meeting held today. The dividend will be paid on March 15, 2018 to shareholders of record as of March 1, 2018.\nCorporate Overview\nNBT Bancorp Inc. is a financial holding company headquartered in Norwich, N.Y., with total assets of $9.1 billion at December 31, 2017. The Company primarily operates through NBT Bank, N.A., a full-service community bank and through two financial services companies. NBT Bank, N.A. has 152 banking locations in New York, Pennsylvania, Vermont, Massachusetts, New Hampshire and Maine. EPIC Advisors, Inc., based in Rochester, N.Y., is a full-service 401(k) plan recordkeeping firm. NBT-Mang Insurance Agency, based in Norwich, N.Y., is a full-service insurance agency. More information about NBT and its divisions is available online at: www.nbtbancorp.com , www.nbtbank.com , www.epic1st.com and www.nbtmang.com .\nForward-Looking Statements\nThis news release contains forward-looking statements. These forward-looking statements involve risks and uncertainties and are based on the beliefs and assumptions of the management of NBT and its subsidiaries and on the information available to management at the time that these statements were made. There are a number of factors, many of which are beyond NBT’s control, which could cause actual conditions, events or results to differ significantly from those described in the forward-looking statements. Factors that may cause actual results to differ materially from those contemplated by such forward-looking statements include, among others, the following possibilities: (1) competitive pressures among depository and other financial institutions may increase significantly; (2) revenues may be lower than expected; (3) changes in the interest rate environment may reduce interest margins; (4) general economic conditions, either nationally or regionally, may be less favorable than expected, resulting in, among other things, a deterioration in credit quality and/or a reduced demand for credit; (5) legislative or regulatory changes, including changes in accounting standards and tax laws, may adversely affect the businesses in which NBT is engaged; (6) competitors may have greater financial resources and develop products that enable such competitors to compete more successfully than NBT; and (7) adverse changes may occur in the securities markets or with respect to inflation. Forward-looking statements speak only as of the date they are made. Except as required by law, NBT does not update forward-looking statements to reflect subsequent circumstances or events.\nNon-GAAP Measures\nThis press release contains financial information determined by methods other than in accordance with accounting principles generally accepted in the United States of America (“GAAP”). These measures adjust GAAP measures to exclude the effects of acquisition related intangible amortization expense on earnings and equity as well as providing a FTE yield on securities and loans. Where non-GAAP disclosures are used in this press release, the comparable GAAP measure, as well as a reconciliation to the comparable GAAP measure, is provided in the accompanying tables. Management believes that these non-GAAP measures provided useful information that is important to an understanding of the results of NBT’s core business as well as provide information standard in the financial institution industry. Non-GAAP measures should not be considered a substitute for financial measures determined in accordance with GAAP and investors should consider NBT’s performance and financial condition as reported under GAAP and all other relevant information when assessing the performance or financial condition of NBT.\nContact:\nJohn H. Watt, Jr., President and CEO\nMichael J. Chewens, CFO\nNBT Bancorp Inc.\n52 South Broad Street\nNorwich, NY 13815\n607-337-6119\nNBT Bancorp Inc. and Subsidiaries SELECTED FINANCIAL DATA (unaudited, dollars in thousands except per share data) 2017 2016 Profitability: 4th Q 3rd Q 2nd Q 1st Q 4th Q Diluted Earnings Per Share $ 0.40 $ 0.52 $ 0.49 $ 0.46 $ 0.45 Weighted Average Diluted Common Shares Outstanding 43,957,571 43,914,536 43,901,207 43,883,471 43,703,122 Return on Average Assets (1) 0.77% 1.00% 0.95% 0.92% 0.89% Return on Average Equity (1) 7.27% 9.55% 9.11% 8.94% 8.54% Return on Average Tangible Common Equity (1)(3) 10.65% 13.99% 13.46% 13.24% 12.68% Net Interest Margin (1)(2) 3.52% 3.47% 3.44% 3.46% 3.41% 12 Months ended December 31, Profitability: 2017 2016 Diluted Earnings Per Share $ 1.87 $ 1.80 Weighted Average Diluted Common Shares Outstanding 43,904,520 43,621,848 Return on Average Assets 0.91% 0.92% Return on Average Equity 8.71% 8.74% Return on Average Tangible Common Equity (4) 12.82% 13.13% Net Interest Margin (2) 3.47% 3.43% (1) Annualized. (2) Calculated on a FTE basis. (3) Non-GAAP measure - excludes amortization of intangible assets (net of tax) from net income and average tangible common equity is calculated as follows: 2017 2016 4th Q 3rd Q 2nd Q 1st Q 4th Q Net Income $ 17,637 $ 22,876 $ 21,359 $ 20,279 $ 19,608 Amortization of intangible assets (net of tax) 594 613 642 597 582 Net income, excluding intangibles amortization $ 18,231 $ 23,489 $ 22,001 $ 20,876 $ 20,190 Average stockholders' equity $ 962,660 $ 950,557 $ 940,897 $ 920,047 $ 913,849 Less: average goodwill and other intangibles 283,554 284,536 285,388 280,774 280,275 Average tangible common equity $ 679,106 $ 666,021 $ 655,509 $ 639,273 $ 633,574 (4) Non-GAAP measure - excludes amortization of intangible assets (net of tax) from net income and average tangible common equity is calculated as follows: 12 Months ended December 31, 2017 2016 Net Income $ 82,151 $ 78,409 Amortization of intangible assets (net of tax) 2,446 2,400 Net income, excluding intangibles amortization $ 84,597 $ 80,809 Average stockholders' equity $ 943,676 $ 897,230 Less: average goodwill and other intangibles 283,573 281,758 Average tangible common equity $ 660,103 $ 615,472 Note: Year-to-date EPS may not equal sum of quarters due to share count differences.\nNBT Bancorp Inc. and Subsidiaries SELECTED FINANCIAL DATA (unaudited, dollars in thousands except per share data) 2017 2016 4th Q 3rd Q 2nd Q 1st Q 4th Q Balance Sheet Data: Securities Available for Sale $ 1,255,925 $ 1,357,614 $ 1,365,521 $ 1,367,574 $ 1,338,290 Securities Held to Maturity 484,073 494,309 515,628 515,793 527,948 Net Loans 6,515,273 6,398,584 6,301,311 6,206,603 6,132,857 Total Assets 9,136,812 9,155,396 9,076,418 8,945,485 8,867,268 Total Deposits 7,170,636 7,231,236 7,015,284 7,185,051 6,973,688 Total Borrowings 909,188 872,060 1,021,339 745,462 886,986 Total Liabilities 8,178,635 8,200,158 8,136,057 8,018,646 7,953,952 Stockholders' Equity 958,177 955,238 940,361 926,839 913,316 Asset Quality: Nonaccrual Loans $ 25,708 $ 23,453 $ 29,134 $ 32,674 $ 35,712 90 Days Past Due and Still Accruing 5,410 3,388 2,849 2,392 4,810 Total Nonperforming Loans 31,118 26,841 31,983 35,066 40,522 Other Real Estate Owned 4,529 4,230 4,747 6,940 5,581 Total Nonperforming Assets 35,647 31,071 36,730 42,006 46,103 Allowance for Loan Losses 69,500 68,350 66,600 65,700 65,200 Asset Quality Ratios (Total): Allowance for Loan Losses to Total Loans 1.06% 1.06% 1.05% 1.05% 1.05% Total Nonperforming Loans to Total Loans 0.47% 0.42% 0.50% 0.56% 0.65% Total Nonperforming Assets to Total Assets 0.39% 0.34% 0.40% 0.47% 0.52% Allowance for Loan Losses to Total Nonperforming Loans 223.34% 254.65% 208.24% 187.36% 160.90% Past Due Loans to Total Loans 0.63% 0.63% 0.59% 0.54% 0.64% Net Charge-Offs to Average Loans (1) 0.43% 0.38% 0.42% 0.45% 0.56% Asset Quality Ratios (Originated) (2): Allowance for Loan Losses to Loans 1.12% 1.13% 1.13% 1.13% 1.13% Nonperforming Loans to Loans 0.46% 0.39% 0.48% 0.53% 0.61% Allowance for Loan Losses to Nonperforming Loans 243.85% 289.67% 235.08% 213.71% 186.82% Past Due Loans to Loans 0.65% 0.65% 0.61% 0.55% 0.66% Capital: Equity to Assets 10.49% 10.43% 10.36% 10.36% 10.30% Book Value Per Share $ 22.01 $ 21.94 $ 21.61 $ 21.34 $ 21.11 Tangible Book Value Per Share (3) $ 15.54 $ 15.42 $ 15.06 $ 14.88 $ 14.61 Tier 1 Leverage Ratio 9.14% 9.12% 9.08% 9.08% 9.11% Common Equity Tier 1 Capital Ratio 10.06% 10.08% 9.96% 10.02% 9.98% Tier 1 Capital Ratio 11.42% 11.46% 11.36% 11.43% 11.42% Total Risk-Based Capital Ratio 12.42% 12.45% 12.32% 12.40% 12.39% Common Stock Price (End of Period) $ 36.80 $ 36.72 $ 36.95 $ 37.07 $ 41.88 (1) Annualized. (2) Non-GAAP measure - Excludes acquired loans. (3) Non-GAAP measure - Stockholders' equity less goodwill and intangible assets divided by common shares outstanding.\nNBT Bancorp Inc. and Subsidiaries CONSOLIDATED BALANCE SHEETS (unaudited, dollars in thousands) December 31, December 31, Assets: 2017 2016 Cash and due from banks $ 156,852 $ 147,789 Short-term interest bearing accounts 2,812 1,392 Securities available for sale, at fair value 1,255,925 1,338,290 Securities held to maturity (fair value $481,871 and $525,050, respectively) 484,073 527,948 Trading securities 11,467 9,259 Federal Reserve and Federal Home Loan Bank stock 46,706 47,033 Loans 6,584,773 6,198,057 Less allowance for loan losses 69,500 65,200 Net loans 6,515,273 6,132,857 Premises and equipment, net 81,305 84,187 Goodwill 268,043 265,439 Intangible assets, net 13,420 15,815 Bank owned life insurance 172,388 168,012 Other assets 128,548 129,247 Total assets $ 9,136,812 $ 8,867,268 Liabilities and stockholders' equity: Deposits: Demand (noninterest bearing) $ 2,286,892 $ 2,195,845 Savings, NOW, and money market 4,076,978 3,905,432 Time 806,766 872,411 Total deposits 7,170,636 6,973,688 Short-term borrowings 719,123 681,703 Long-term debt 88,869 104,087 Junior subordinated debt 101,196 101,196 Other liabilities 98,811 93,278 Total liabilities 8,178,635 7,953,952 Total stockholders' equity 958,177 913,316 Total liabilities and stockholders' equity $ 9,136,812 $ 8,867,268\nNBT Bancorp Inc. and Subsidiaries CONSOLIDATED STATEMENTS OF INCOME (unaudited, dollars in thousands except per share data) Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Interest, fee and dividend income: Interest and fees on loans $ 69,697 $ 63,901 $ 267,096 $ 250,994 Securities available for sale 7,059 6,057 28,564 24,033 Securities held to maturity 2,671 2,524 10,934 9,852 Other 803 627 2,813 2,068 Total interest, fee and dividend income 80,230 73,109 309,407 286,947 Interest expense: Deposits 3,817 3,557 14,475 14,366 Short-term borrowings 1,621 641 5,996 2,309 Long-term debt 505 779 2,299 3,204 Junior subordinated debt 836 707 3,144 2,627 Total interest expense 6,779 5,684 25,914 22,506 Net interest income 73,451 67,425 283,493 264,441 Provision for loan losses 8,153 8,165 30,988 25,431 Net interest income after provision for loan losses 65,298 59,260 252,505 239,010 Noninterest income: Insurance and other financial services revenue 5,605 5,711 23,532 24,396 Service charges on deposit accounts 4,351 4,270 16,750 16,729 ATM and debit card fees 5,347 4,868 21,372 19,448 Retirement plan administration fees 5,332 4,126 20,213 16,063 Trust 4,966 4,717 19,586 18,565 Bank owned life insurance income 1,262 1,297 5,175 5,195 Net securities gains (losses) 1,869 (674) 1,867 (644) Other 2,740 3,773 12,809 15,961 Total noninterest income 31,472 28,088 121,304 115,713 Noninterest expense: Salaries and employee benefits 33,409 32,008 133,610 131,284 Occupancy 5,280 5,160 21,808 20,940 Data processing and communications 4,242 4,141 17,068 16,495 Professional fees and outside services 3,751 3,712 13,499 13,617 Equipment 4,001 3,632 15,225 14,295 Office supplies and postage 1,604 1,507 6,284 6,168 FDIC expense 1,196 1,273 4,767 5,111 Advertising 1,033 823 2,744 2,556 Amortization of intangible assets 961 952 3,960 3,928 Loan collection and other real estate owned 1,136 923 4,763 3,458 Other 6,831 3,508 21,920 18,070 Total noninterest expense 63,444 57,639 245,648 235,922 Income before income taxes 33,326 29,709 128,161 118,801 Income tax expense 15,689 10,101 46,010 40,392 Net income $ 17,637 $ 19,608 $ 82,151 $ 78,409 Earnings Per Share: Basic $ 0.40 $ 0.45 $ 1.89 $ 1.81 Diluted $ 0.40 $ 0.45 $ 1.87 $ 1.80\nNBT Bancorp Inc. and Subsidiaries QUARTERLY CONSOLIDATED STATEMENTS OF INCOME (unaudited, dollars in thousands except per share data) 2017 2016 4th Q 3rd Q 2nd Q 1st Q 4th Q Interest, fee and dividend income: Interest and fees on loans $ 69,697 $ 68,086 $ 65,286 $ 64,027 $ 63,901 Securities available for sale 7,059 7,278 7,218 7,009 6,057 Securities held to maturity 2,671 2,746 2,736 2,781 2,524 Other 803 737 654 619 627 Total interest, fee and dividend income 80,230 78,847 75,894 74,436 73,109 Interest expense: Deposits 3,817 3,648 3,536 3,474 3,557 Short-term borrowings 1,621 1,870 1,366 1,139 641 Long-term debt 505 589 599 606 779 Junior subordinated debt 836 810 772 726 707 Total interest expense 6,779 6,917 6,273 5,945 5,684 Net interest income 73,451 71,930 69,621 68,491 67,425 Provision for loan losses 8,153 7,889 7,567 7,379 8,165 Net interest income after provision for loan losses 65,298 64,041 62,054 61,112 59,260 Noninterest income: Insurance and other financial services revenue 5,605 5,536 5,621 6,770 5,711 Service charges on deposit accounts 4,351 4,261 4,161 3,977 4,270 ATM and debit card fees 5,347 5,557 5,518 4,950 4,868 Retirement plan administration fees 5,332 5,272 5,437 4,172 4,126 Trust 4,966 4,927 5,161 4,532 4,717 Bank owned life insurance income 1,262 1,284 1,218 1,411 1,297 Net securities gains (losses) 1,869 (4) 2 - (674) Other 2,740 3,945 3,186 2,938 3,773 Total noninterest income 31,472 30,778 30,304 28,750 28,088 Noninterest expense: Salaries and employee benefits 33,409 33,309 33,081 33,811 32,008 Occupancy 5,280 5,174 5,184 6,170 5,160 Data processing and communications 4,242 4,399 4,229 4,198 4,141 Professional fees and outside services 3,751 3,107 3,609 3,032 3,712 Equipment 4,001 3,733 3,793 3,698 3,632 Office supplies and postage 1,604 1,432 1,640 1,608 1,507 FDIC expense 1,196 1,257 1,136 1,178 1,273 Advertising 1,033 665 656 390 823 Amortization of intangible assets 961 993 1,039 967 952 Loan collection and other real estate owned 1,136 1,684 664 1,279 923 Other 6,831 4,848 5,290 4,951 3,508 Total noninterest expense 63,444 60,601 60,321 61,282 57,639 Income before income taxes 33,326 34,218 32,037 28,580 29,709 Income tax expense 15,689 11,342 10,678 8,301 10,101 Net income $ 17,637 $ 22,876 $ 21,359 $ 20,279 $ 19,608 Earnings Per Share: Basic $ 0.40 $ 0.52 $ 0.49 $ 0.47 $ 0.45 Diluted $ 0.40 $ 0.52 $ 0.49 $ 0.46 $ 0.45 Note: Year-to-date EPS may not equal sum of quarters due to share count differences.\nNBT Bancorp Inc. and Subsidiaries AVERAGE QUARTERLY BALANCE SHEETS (unaudited, dollars in thousands) Average Balance Yield / Rates Average Balance Yield / Rates Average Balance Yield / Rates Average Balance Yield / Rates Average Balance Yield / Rates Three Months ended, Q4 - 2017 Q3 - 2017 Q2 - 2017 Q1 - 2017 Q4 - 2016 Assets: Short-term interest bearing accounts $ 5,804 2.39% $ 9,000 2.42% $ 9,497 1.82% $ 14,342 1.33% $ 14,190 0.64% Securities available for sale (1)(2) 1,313,870 2.16% 1,374,739 2.13% 1,363,314 2.15% 1,352,219 2.14% 1,277,931 1.92% Securities held to maturity (1) 490,182 2.68% 506,324 2.66% 513,888 2.63% 520,283 2.66% 492,415 2.54% Investment in FRB and FHLB Banks 44,320 6.87% 49,902 5.42% 46,132 5.31% 46,326 5.01% 39,448 6.09% Loans (3) 6,528,449 4.25% 6,400,287 4.23% 6,294,056 4.17% 6,211,058 4.19% 6,155,985 4.14% Total interest earning assets $ 8,382,625 3.84% $ 8,340,252 3.80% $ 8,226,887 3.75% $ 8,144,228 3.75% $ 7,979,969 3.69% Other assets 747,468 759,636 753,383 748,476 760,563 Total assets $ 9,130,093 $ 9,099,888 $ 8,980,270 $ 8,892,704 $ 8,740,532 Liabilities and stockholders' equity: Money market deposit accounts $ 1,725,242 0.25% $ 1,652,730 0.23% $ 1,723,594 0.21% $ 1,688,060 0.21% $ 1,674,119 0.21% NOW deposit accounts 1,200,651 0.12% 1,130,940 0.10% 1,138,237 0.08% 1,143,231 0.06% 1,130,578 0.05% Savings deposits 1,215,932 0.06% 1,232,823 0.06% 1,232,301 0.06% 1,176,224 0.05% 1,145,352 0.06% Time deposits 792,969 1.10% 805,435 1.09% 824,398 1.08% 847,410 1.07% 890,506 1.06% Total interest bearing deposits $ 4,934,794 0.31% $ 4,821,928 0.30% $ 4,918,530 0.29% $ 4,854,925 0.29% $ 4,840,555 0.29% Short-term borrowings 684,447 0.94% 773,074 0.96% 643,971 0.85% 657,442 0.70% 523,708 0.49% Long-term debt 81,010 2.47% 88,935 2.63% 99,865 2.41% 104,048 2.36% 109,656 2.83% Junior subordinated debt 101,196 3.28% 101,196 3.18% 101,196 3.06% 101,196 2.91% 101,196 2.78% Total interest bearing liabilities $ 5,801,447 0.46% $ 5,785,133 0.47% $ 5,763,562 0.44% $ 5,717,611 0.42% $ 5,575,115 0.41% Demand deposits 2,266,672 2,260,973 2,181,952 2,159,893 2,136,310 Other liabilities 99,314 103,225 93,859 95,153 115,258 Stockholders' equity 962,660 950,557 940,897 920,047 913,849 Total liabilities and stockholders' equity $ 9,130,093 $ 9,099,888 $ 8,980,270 $ 8,892,704 $ 8,740,532 Interest rate spread 3.38% 3.33% 3.31% 3.33% 3.29% Net interest margin 3.52% 3.47% 3.44% 3.46% 3.41% (1) Securities are shown at average amortized cost. (2) Excluding unrealized gains or losses. (3) For purposes of these computations, nonaccrual loans are included in the average loan balances outstanding. Note: Interest income for tax-exempt securities and loans has been adjusted to a FTE basis using the statutory Federal income tax rate of 35%.\nNBT Bancorp Inc. and Subsidiaries AVERAGE YEAR-TO-DATE BALANCE SHEETS (unaudited, dollars in thousands) Average Yield/ Average Yield/ Balance Interest Rates Balance Interest Rates Twelve Months ended December 30, 2017 2016 Assets: Short-term interest bearing accounts $ 9,636 $ 179 1.86% $ 16,301 $ 95 0.58% Securities available for sale (1)(2) 1,350,995 28,969 2.14% 1,237,930 24,450 1.98% Securities held to maturity (1) 507,583 13,490 2.66% 487,837 12,255 2.51% Investment in FRB and FHLB Banks 46,673 2,634 5.64% 38,867 1,973 5.08% Loans (3) 6,359,447 267,934 4.21% 6,035,513 251,723 4.17% Total interest earning assets $ 8,274,334 $ 313,206 3.79% 7,816,448 $ 290,496 3.72% Other assets 752,258 740,506 Total assets $ 9,026,592 $ 8,556,954 Liabilities and stockholders' equity: Money market deposit accounts $ 1,697,386 $ 3,864 0.23% $ 1,668,555 $ 3,599 0.22% NOW deposit accounts 1,153,361 1,051 0.09% 1,077,581 546 0.05% Savings deposits 1,214,480 683 0.06% 1,135,182 652 0.06% Time deposits 817,370 8,877 1.09% 905,126 9,569 1.06% Total interest bearing deposits $ 4,882,597 $ 14,475 0.30% $ 4,786,444 $ 14,366 0.30% Short-term borrowings 690,036 5,996 0.87% 497,654 2,309 0.46% Long-term debt 93,389 2,299 2.46% 118,860 3,204 2.70% Junior subordinated debt 101,196 3,144 3.11% 101,196 2,627 2.60% Total interest bearing liabilities $ 5,767,218 $ 25,914 0.45% $ 5,504,154 $ 22,506 0.41% Demand deposits 2,217,785 2,045,465 Other liabilities 97,913 110,105 Stockholders' equity 943,676 897,230 Total liabilities and stockholders' equity $ 9,026,592 $ 8,556,954 Net interest income (FTE) 287,292 267,990 Interest rate spread 3.34% 3.31% Net interest margin 3.47% 3.43% Taxable equivalent adjustment 3,799 3,549 Net interest income $ 283,493 $ 264,441 (1) Securities are shown at average amortized cost. (2) Excluding unrealized gains or losses. (3) For purposes of these computations, nonaccrual loans are included in the average loan balances outstanding. Note: Interest income for tax-exempt securities and loans has been adjusted to a FTE basis using the statutory Federal income tax rate of 35%.\nNBT Bancorp Inc. and Subsidiaries CONSOLIDATED LOAN BALANCES (unaudited, dollars in thousands) 2017 2016 4th Q 3rd Q 2nd Q 1st Q 4th Q Residential real estate mortgages $ 1,321,695 $ 1,302,577 $ 1,275,807 $ 1,275,774 $ 1,262,614 Commercial 1,317,174 1,307,560 1,342,334 1,284,464 1,242,701 Commercial real estate 1,711,095 1,654,727 1,563,980 1,540,472 1,543,301 Consumer 1,740,038 1,700,340 1,684,936 1,669,369 1,641,657 Home equity 494,771 501,730 500,854 502,224 507,784 Total loans $ 6,584,773 $ 6,466,934 $ 6,367,911 $ 6,272,303 $ 6,198,057\nSource:NBT Bancorp Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=9PV-t08IUFR7icZga79PpY19qozxYSaWrty-NZ4zbxtyWTWO8h171kzraVFcHYg9BMC6TalANy2P7SY3ISd_lQ==", "https://www.globenewswire.com/Tracker?data=9PV-t08IUFR7icZga79PpTBqMPOrtxKg_tjBJYNX80oLMR1yg9HO--zJDLncxkwc6OtisNo0EcR1IzmbB5_zt944LL2nRT855LVFYV_kRck=", "https://www.globenewswire.com/Tracker?data=B-9r0a9CyX4KuoDErGLfw71HfKT2cVpU-Kh861iwrc4skYqeSx_FyrNyZznpce1G6rOD7nw_RLEE4M1IOa2JQA==", "https://www.globenewswire.com/Tracker?data=9PV-t08IUFR7icZga79PpVaew8JHYiIVK_GWqQaeZTydYJZyD0cGmBff6gUDe_U5SJr79L9XSR-8x0OYyMffljYih6qnKoip2sidbEr2770="], "published": "2018-01-23T00:18:00.000+02:00", "crawled": "2018-01-23T02:15:47.010+02:00", "highlightTitle": ""}