{"organizations": [], "uuid": "f7339504bd03e85a01d8a84814daa4d15ff879d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225189525&w=1200&r=LYNXMPEE0O180", "site_section": "http://feeds.reuters.com/reuters/INformulaOne", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/india-asean/india-asean-leaders-agree-to-boost-maritime-cooperation-idINKBN1FE29D", "country": "US", "domain_rank": 408, "title": "India, ASEAN leaders agree to boost maritime cooperation", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:31:00.000+02:00", "replies_count": 0, "uuid": "f7339504bd03e85a01d8a84814daa4d15ff879d7"}, "author": "", "url": "https://in.reuters.com/article/india-asean/india-asean-leaders-agree-to-boost-maritime-cooperation-idINKBN1FE29D", "ord_in_thread": 0, "title": "India, ASEAN leaders agree to boost maritime cooperation", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "none"}, {"name": "modi", "sentiment": "none"}, {"name": "preeti saran", "sentiment": "none"}, {"name": "saran", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "asean", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "association of southeast asian regional cooperation", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 3:33 PM / Updated an hour ago India, ASEAN leaders agree to boost maritime cooperation Reuters Staff 3 Min Read \nNEW DELHI (Reuters) - The leaders of India and southeast Asia agreed on Thursday to boost their maritime ties at a summit in New Delhi, as they seek to balance the increasing weight of China across the region. \nIndia is hosting the leaders of the Association of Southeast Asian Regional Cooperation (ASEAN) and the summit comes at a time when Prime Minister Narendra Modi is pursuing an “Act East” policy of developing ties with these countries. \nThe Indian and ASEAN leaders agreed “to establish a mechanism for greater cooperation in the maritime domain sector”, Preeti Saran, secretary in the Indian foreign ministry, told reporters. \n“They did discuss the issues of greater maritime cooperation, addressing both traditional and non-traditional challenges all of us face collectively,” Saran said, without elaborating. \nIn the talks Modi also pitched for an ASEAN-India women’s navy team which could sail around the world, just as an Indian team is doing currently, Saran said. Singapore Prime Minister Lee Hsien Loong and his Indian counterpart Narendra Modi arrive for a photo opportunity ahead of their meeting at Hyderabad House in New Delhi, India, January 25, 2018. REUTERS/Adnan Abidi \nModi has invited the leaders of all 10 ASEAN nations to join him for India’s Republic Day celebrations on Friday in the biggest ever gathering of foreign leaders at the parade, which showcases the country’s military might and cultural diversity. \nThe leaders attending the summit in New Delhi include Myanmar’s Aung San Suu Kyi, Indonesian President Joko Widodo and President Rodrigo Duterte of the Philippines. Slideshow (3 Images) \nNew Delhi’s push to expand economic ties with southeast Asia still trail those of China, whose trade with ASEAN was more than six times greater than India’s in 2016-17 at $470 million. \nChina has in recent years also built ports and power plants in countries around India’s periphery, expanding its presence in South Asia and pushing New Delhi to seek new allies. \nModi said he would work towards strengthening relations with ASEAN countries, saying trade had already grown “25 times in 25 years”. \n“Investments are robust and growing. We will further enhance trade ties and work towards greater interaction among our business communities,” Modi said. Reporting by Aditya Kalra; Editing by Sanjeev Miglani and Gareth Jones", "external_links": [], "published": "2018-01-25T17:31:00.000+02:00", "crawled": "2018-01-25T18:09:04.000+02:00", "highlightTitle": ""}