{"organizations": [], "uuid": "5f642ff319713a5ba671da64589f358d5cd671b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222320962&w=1200&r=LYNXMPEE0F09A", "site_section": "http://feeds.reuters.com/reuters/INentertainmentNews\r", "section_title": "Reuters: Entertainment News", "url": "https://in.reuters.com/article/australia-wallaby/wayward-wallaby-gets-the-jump-on-police-in-sydney-harbour-bridge-chase-idINKBN1F50CH", "country": "US", "domain_rank": 408, "title": "Wayward wallaby gets the jump on police in Sydney Harbour Bridge chase", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T06:43:00.000+02:00", "replies_count": 0, "uuid": "5f642ff319713a5ba671da64589f358d5cd671b2"}, "author": "", "url": "https://in.reuters.com/article/australia-wallaby/wayward-wallaby-gets-the-jump-on-police-in-sydney-harbour-bridge-chase-idINKBN1F50CH", "ord_in_thread": 0, "title": "Wayward wallaby gets the jump on police in Sydney Harbour Bridge chase", "locations": [], "entities": {"persons": [{"name": "kylie smith", "sentiment": "none"}], "locations": [{"name": "sydney harbour bridge", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "taronga", "sentiment": "none"}, {"name": "new south wales", "sentiment": "none"}, {"name": "harbour bridge", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 4:43 AM / in 15 hours Wayward wallaby gets the jump on police in Sydney Harbour Bridge chase Reuters Staff 3 Min Read \nSYDNEY (Reuters) - Australians often joke that tourists expect to see kangaroos hopping across the Sydney Harbour Bridge but the joke was on police on Tuesday when a wayward wallaby led them in an early-morning chase across the famous landmark. \nPolice said they chased the mysterious marsupial on foot and in a car over the bridge before dawn before catching it in a downtown park and taking it to the city’s Taronga Zoo. \n“Officers took the startled macropod into police custody ... with the police mounted unit arriving on scene soon after to take it to the zoo for veterinary assessment,” New South Wales Police said in a statement. \nVideo filmed from a pursuing patrol car showed the metre-high wallaby, which looks like a small kangaroo, hopping across the famous bridge. \nA policeman stifled a laugh as he drove behind. \n“Sydney’s got the best harbour in the world, so I’d imagine he was taking in the view,” police inspector Kylie Smith later told reporters. “We actually do have wallabies or kangaroos that jump down the main street of Sydney.” A supplied video screenshot obtained January 16, 2018 of a policeman approaching a wallaby on the Sydney Harbour Bridge in Sydney, Australia. AAP/NSW Police/via REUTERS \nNicknamed “The Coathanger,” Sydney’s famous arch-span bridge opened in 1932 and, with 8 traffic lanes, 2 railway lines and a footpath and cycleway, is the main harbour crossing linking the city with its northern suburbs. \nWhile wallabies and kangaroos are found in both rural and leafy suburban areas, it is highly unusual to see them in the middle of a major city. A supplied video screenshot obtained January 16, 2018 of a wallaby on the Sydney Harbour Bridge in Sydney, Australia. AAP/NSW Police/via REUTERS \n“I‘m from the ‘bush’ (rural Australia), so I‘m used to see them running around all over the place but I’ve never seen one so close to the city before,” said a driver who gave his name as Ray, one of several people who called Sydney radio station 2GB. \nPolice said the wallaby probably began its city-bound journey at a golf club on the harbour’s north shore before it was spotted hopping south across the bridge in lane 8 at about 5 a.m. (1800 GMT Monday). \n“Traffic controllers ... monitored the wallaby as it hopped across to lane 1 and, without indicating, exited onto Cahill Expressway then to Macquarie Street,” police said in a statement. \nLarry Vogelnest, senior veterinarian at Taronga Zoo, said X-rays showed the wallaby had not suffered any serious injuries. \n“The swamp wallaby remains in a stable condition at Taronga Wildlife Hospital’s intensive care unit ... our hope is that the wallaby will be able to be released back into the wild,” he said in a statement. Reporting by Tom Westbrook; Editing by Paul Tait", "external_links": [], "published": "2018-01-16T06:43:00.000+02:00", "crawled": "2018-01-16T07:28:54.012+02:00", "highlightTitle": ""}