{"organizations": [], "uuid": "c32add62bee10682fa9dfae3f1ae86beaece0ba6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/venezuela-economy/update-1-venezuela-to-resume-local-trading-of-hard-currency-securities-idUSL2N1PK14B", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Venezuela to resume local trading of hard-currency securities", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:08:00.000+02:00", "replies_count": 0, "uuid": "c32add62bee10682fa9dfae3f1ae86beaece0ba6"}, "author": "", "url": "https://www.reuters.com/article/venezuela-economy/update-1-venezuela-to-resume-local-trading-of-hard-currency-securities-idUSL2N1PK14B", "ord_in_thread": 0, "title": "UPDATE 1-Venezuela to resume local trading of hard-currency securities", "locations": [], "entities": {"persons": [{"name": "deisy buitrago", "sentiment": "none"}, {"name": "corina pons", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "caracas", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "socialist party", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 5:10 PM / in 34 minutes UPDATE 1-Venezuela to resume local trading of hard-currency securities Reuters Staff \n(Recasts with dollar-denominated securities) \nBy Corina Pons and Deisy Buitrago \nCARACAS, Jan 25 (Reuters) - Venezuela will allow securities denominated in hard currency to trade on a local bourse, the central bank said on Thursday, allowing citizens to legally acquire foreign exchange without going through the country’s 15-year-old currency controls. \nThe crisis-stricken OPEC nation is struggling under hyperinflation and product shortages that economists widely blame on currency controls that even ruling Socialist Party officials recognize have been plagued with corruption. \nCreating legal mechanisms to obtain dollars could make it easier for businesses to import raw materials or machine parts. \nBut it is unlikely to ease the economic crisis because the local bolivar currency has lost more than 99 percent of its value on the black market, leaving local firms largely unable to afford products acquired abroad. \n“This currency arrangement will reopen the market for securities for private citizens,” Central Bank Director Pedro Maldonado said in a press conference. “Any private company that wants to issue debt in hard currency can sell it on the Bicentenary Exchange,” he said, referring to a state-run bourse. \nBetween 2004 and 2010, local trading of dollar securities served as a parallel foreign exchange market known as “permuta” that provided hard currency to buyers who did not have permits to acquire it at a state-backed favorable rate. \nThe government of late President Hugo Chavez shut down the legal avenue for such trading in 2010, arguing that speculators were using it to damage the economy. \nBuying dollars on the black market continues to be seen as legally suspect despite being routine. \nThe central bank separately said the government-backed DICOM auction system, which was halted last year, will start selling euros. President Nicolas Maduro suspended DICOM in responses to financial sanctions by Washington. \nVenezuela’s exchange controls provide dollars at the official rate of 10 bolivars for import of priority goods such as food and medicine. The black market rate is currently 263,803 per dollar, according to web-site DolarToday, which is the most widely-used reference. \nThe central bank did not say what the new DICOM exchange rate would be. A Powerpoint presentation about DICOM says buyers will “pay the price they proposed.” \nBefore the auctions were halted, DICOM was selling dollars at 3,345 bolivars. Though the DICOM rate has been consistently more favorable than the black market, businesses generally say it is of little use because it sells limited volumes, meaning it does not provide a steady supply of hard currency for imports. (Reporting by Corina Pons; Writing by Brian Ellsworth; Editing by Susan Thomas)", "external_links": [], "published": "2018-01-25T19:08:00.000+02:00", "crawled": "2018-01-25T19:34:07.005+02:00", "highlightTitle": ""}