{"organizations": [], "uuid": "46015b58029cc5e2cd4f8fa13d7a490369638026", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-ethiopia-violence/weekend-clashes-during-ethiopia-religious-festival-leave-seven-dead-idUKKBN1FB253", "country": "US", "domain_rank": 408, "title": "Weekend clashes during Ethiopia religious festival leave seven dead", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T17:46:00.000+02:00", "replies_count": 0, "uuid": "46015b58029cc5e2cd4f8fa13d7a490369638026"}, "author": "", "url": "https://uk.reuters.com/article/uk-ethiopia-violence/weekend-clashes-during-ethiopia-religious-festival-leave-seven-dead-idUKKBN1FB253", "ord_in_thread": 0, "title": "Weekend clashes during Ethiopia religious festival leave seven dead", "locations": [], "entities": {"persons": [{"name": "amare goshu", "sentiment": "none"}, {"name": "aaron maasho", "sentiment": "none"}], "locations": [{"name": "ethiopia", "sentiment": "none"}, {"name": "woldiya", "sentiment": "none"}, {"name": "addis ababa", "sentiment": "none"}, {"name": "horn of africa", "sentiment": "none"}], "organizations": [{"name": "min read  addis ababa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 3:47 PM / Updated 9 minutes ago Weekend clashes during Ethiopia religious festival leave seven dead Aaron Maasho 2 Min Read \nADDIS ABABA (Reuters) - At least seven people died after clashes broke out between security forces and worshippers taking part in a religious ceremony marking Epiphany in northern Ethiopia over the weekend, officials said. \nAuthorities in the Horn of Africa country’s Amhara region said they were yet to determine the causes of the violence that first erupted on Saturday in the town of Woldiya, more than 500 kilometres north of the capital Addis Ababa. \n“Attempts to unblock roads and prevent the destruction of property are still ongoing. The situation has improved (since Sunday) but we are still having to undertake such measures,” said Amare Goshu, a police commissioner of the district. \nOne member of security forces deployed to quell the violence was among the dead, he said. Orthodox Christians use Epiphany celebrations to mark the baptism of Jesus Christ. \nIt was not immediately clear if the violence is related to unrest that plagued the country in 2015 and 2016. \nIn Ethiopia’s central Oromiya province, hundreds were killed over that period in violence triggered by allegations of land grabs, with protests then broadening into demonstrations over political restrictions and perceived rights abuses. \nProtests had also previously taken place in the Amhara region, with dozens dying in violence sparked by a territorial dispute. \nEthiopia is a Western ally against Islamist militants in neighbouring Somalia and an economic power seen as a centre of relative stability in a fragile region. \nThe government in Addis Ababa has sought to calm political turmoil by announcing reforms and releasing dissidents. Last week, a senior opposition leader jailed for collusion with anti-government rebel groups was freed alongside 114 other inmates. Reporting by Aaron Maasho; Editing by Toby Chopra", "external_links": [], "published": "2018-01-22T17:46:00.000+02:00", "crawled": "2018-01-22T18:05:43.026+02:00", "highlightTitle": ""}