{"organizations": [], "uuid": "c2ea0cefe9529431b103b3cfb4898c6722e4bb93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/iphone6s.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/02/an-apple-conspiracy-theory-blooms/", "country": "US", "domain_rank": 1196, "title": "Apple Admits To Slowing iPhones With Aging Batteries | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-02T11:12:00.000+02:00", "replies_count": 0, "uuid": "c2ea0cefe9529431b103b3cfb4898c6722e4bb93"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/02/an-apple-conspiracy-theory-blooms/", "ord_in_thread": 0, "title": "Apple Admits To Slowing iPhones With Aging Batteries | Fortune", "locations": [], "entities": {"persons": [{"name": "aaron pressman", "sentiment": "negative"}, {"name": "aaron", "sentiment": "none"}, {"name": "adam", "sentiment": "none"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "An Apple Conspiracy Theory Blooms Poravute By Aaron Pressman 9:12 AM EST \nThis article first appeared in Data Sheet, Fortune’s daily newsletter on the top tech news. Sign up here . \nGood morning and happy new year. Aaron in for Adam this morning. \nFor years, some iPhone owners have contended that Apple software updates purposely slowed their phones after two years in order to entice them to upgrade. The ghost of Steve Jobs forcing some planned obsolesce on customers , perhaps? You may have missed it over the holidays, but Apple actually admitted to purposely slowing older iPhones. So the conspiracy theorists are vindicated, right? Not exactly. \nWhat Apple (aapl) was up to over its past few iOS updates was not trying to entice new phone buying, but rather to solve a different conspiracy-theory-sparking iPhone bug. That was the glitch where an iPhone suddenly shut down even though the battery reported it had a remaining charge of 30%, 40%, sometimes even more than 50%. Why would an iPhone with half its charge left suddenly shut down? \nNow all is revealed. It turns out that as phone batteries age, not only do they hold less charge, they also lose the ability to output maximum voltage at one time. So when an iPhone with an older battery needed a lot of power all at once, the battery couldn’t keep up and the phone shut down. To avoid these seemingly random shutdowns, Apple tweaked iOS to cap the power draw, in effect forcing the phone to slow down. A better solution, or co-solution, might have been to alert iPhone owners that their batteries needed to be replaced. \nThat’s the new approach. So if you’re still rocking an iPhone 6 or 6S, and maybe even soon an iPhone 7, it’s probably time to get that battery replaced. And for only $29 , your iPhone will be back to full speed. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-02T11:12:00.000+02:00", "crawled": "2018-01-02T18:02:18.000+02:00", "highlightTitle": ""}