{"organizations": [], "uuid": "0415ad21a514e5fb237c737528951ff9063329d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/03/25/101524371-157284424.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/05/investors-face-tough-decisions-over-what-to-do-with-their-portfolios-in-2018-analysts-say.html", "country": "US", "domain_rank": 767, "title": "Investors face tough decisions over what to do with their portfolios in 2018, analysts say", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T13:49:00.000+02:00", "replies_count": 0, "uuid": "0415ad21a514e5fb237c737528951ff9063329d7"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/05/investors-face-tough-decisions-over-what-to-do-with-their-portfolios-in-2018-analysts-say.html", "ord_in_thread": 0, "title": "Investors face tough decisions over what to do with their portfolios in 2018, analysts say", "locations": [], "entities": {"persons": [{"name": "toogood", "sentiment": "none"}, {"name": "sonja laud", "sentiment": "none"}, {"name": "peter toogood", "sentiment": "none"}], "locations": [{"name": "fidelit", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "embark group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Now is the time when investors need to decide whether they want to start de-risking or hold on to their portfolios, two analysts told CNBC on Friday.\nDespite the strong start in markets in 2018, there seems to be little on offer that is not too expensive, they said.\n\"Investment professionals do not want to play in this market; they are not interested. There's nothing to go for, except momentum. None of it makes sense,\" Peter Toogood, chief information officer at Embark Group, said.\nOn Thursday, for instance, the Dow Jones industrial average broke above 25,000 for the first time and also registered its fastest 1,000-point move in its history. Analysts explained the jump on positive jobs data, and thus an increased confidence in the economy.\nHowever, there are concerns whether such momentum can be maintained, and thus a correction could be on the horizon.\n\"Bonds are insane and fixed, equities are on highs that don't make sense… the only diversifier is gold and cash, that's the only thing left, because everything is expensive, period,\" Toogood said.\nSonja Laud, head of equity at Fidelity International, told CNBC that \"there's not a lot left\" for those seeking to make returns in the short-term.\n\"Am I willing to go for the last percentage points or do I much more enter the camp of protecting the downside? That's a very interesting question,\" she said.\n\"If (investors) agree with us, they would start de-risking. If they say, 'I can stomach volatility, I'm happy to see the correction through,' you stay invested.\"\nBoth Laud and Toogood suggested that the key to navigate markets in 2018 is to monitor central bank policy.\n\"We should not look too much for the economy reversing (in 2018). It's what central banks are doing and whether inflation and the liquidity equilibrium will be distorted,\" Laud said.\nIn a note, she added that investors need to keep in mind that years of excess liquidity have led to a \"distorted perception of risk and risk pricing and artificially suppressed volatility.\"\nAlthough central bankers started reversing some of their policies in 2017 after about a decade of easy money, they intend to keep a loose monetary stance over the course of 2018, Toogood said in a note. This means that the risk of excess liquidity remains for the course of 2018.", "external_links": [], "published": "2018-01-05T13:49:00.000+02:00", "crawled": "2018-01-05T13:15:11.003+02:00", "highlightTitle": ""}