{"organizations": [], "uuid": "e6a660bacd3bdc0e974402ac48b646a13faa2b21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-rand-capital-portfolio-company-givegab-announces-acquisition-of-kimbia.html", "country": "US", "domain_rank": 767, "title": "Rand Capital Portfolio Company, GiveGab, Announces Acquisition of Kimbia", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-19T17:00:00.000+02:00", "replies_count": 0, "uuid": "e6a660bacd3bdc0e974402ac48b646a13faa2b21"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-rand-capital-portfolio-company-givegab-announces-acquisition-of-kimbia.html", "ord_in_thread": 0, "title": "Rand Capital Portfolio Company, GiveGab, Announces Acquisition of Kimbia", "locations": [], "entities": {"persons": [{"name": "kimbia givegab", "sentiment": "negative"}, {"name": "givegab", "sentiment": "none"}, {"name": "charlie mulligan", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "buffalo", "sentiment": "none"}, {"name": "kimbia", "sentiment": "none"}], "organizations": [{"name": "rand capital portfolio company", "sentiment": "negative"}, {"name": "givegab, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GiveGab becomes the leader in Giving Days nationwide\nBUFFALO, N.Y.--(BUSINESS WIRE)-- Rand Capital Corporation (NASDAQ: RAND) (“Rand”), a venture capital company which invests in growth businesses with unique product, service or technology concepts, reported that one of its portfolio companies, GiveGab, Inc. , announced its acquisition of substantially all of the assets of Kimbia . Best known for its nation-wide giving day events, Kimbia has supported the fundraising efforts of thousands of nonprofits across the country through their everyday giving products and Giving Days .\n“Kimbia is a pioneer and has been the leader in the giving day space, with more than $1 billion raised online for tens of thousands of nonprofits around the world,” said GiveGab’s Chief Executive Officer, Charlie Mulligan. “We’re thrilled to add their legacy and experience to our modern, secure, and user-friendly platform, and to continue to build on our absolute obsession with customer service. This acquisition will allow us to combine the very best of Kimbia with GiveGab, helping to advance the rapidly growing Giving Day market.”\nThe acquisition brings GiveGab closer to its goal of being the largest charitable software platform through the combined support of over 40,000 nonprofits since its inception.\n“We are very excited about the opportunity to continue support of Kimbia's clients under the leadership of GiveGab going forward,” said Mark Perkins, Chief Executive Officer of Kimbia. “The industry is ripe for consolidation and we believe that GiveGab is the best fit going forward to provide innovative tools to our nonprofit partners and grow their impact on the world. GiveGab's commitment to customer service is unparalleled and we know our partners are in good hands.\"\nAllen F. (“Pete”) Grum, President and Chief Executive Officer of Rand Capital, commented, “GiveGab has grown significantly since our initial investment in 2013. It is exciting to see successful advancements of our portfolio companies, from both a financial as well as a market penetration perspective. GiveGab’s acquisition of Kimbia takes them to the next level in furthering their mission. I look forward to sharing their success in the future.”\nABOUT GIVEGAB\nGiveGab is modern, easy-to-use software that cultivates long-term giving relationships between nonprofits and their supporters by providing robust online fundraising, donor management, supporter engagement, Giving Days, and more. From their first Giving Day in 2015, GiveGab has since launched over 30 successful Giving Days across the country, many of which were multi-million dollar days, with several more in the works. To learn more, visit www.givegab.com .\nABOUT KIMBIA\nKimbia is an online fundraising, crowdfunding, and event platform provider for nonprofits, higher education, and community foundations. In the last ten years, organizations including American Red Cross, Smithsonian Institution, Georgetown University, Communities Foundation of Texas, GiveMN, The Boston Foundation and The Miami Foundation have raised over a billion dollars using Kimbia’s Everyday Giving, Peer-to-Peer, Events and Giving Day solutions. To learn more, visit www.kimbia.com .\nABOUT RAND CAPITAL\nRand Capital (NASDAQ: RAND) provides investors the ability to participate in venture capital opportunities through an investment in the Company’s stock. Rand is a Business Development Company (BDC), and its first wholly-owned subsidiary is licensed by the U.S. Small Business Administration (SBA) as a Small Business Investment Company (SBIC). Its second SBIC is undergoing the approval process with the SBA. Rand focuses its equity investments in early or expansion stage companies and generally lends to more mature companies. Rand looks for strong leadership who is bringing to market new or unique products, technologies or services that have a high potential for growth. Additional information can be found at the Company’s website where it regularly posts information: http://www.randcapital.com/ .\nSafe Harbor Statement\nThis news release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements concerning receiving a new SBIC license and funding, future net asset value growth, investment returns and opportunities as well as Rand’s plans for utilizing proceeds from sales of portfolio companies when and if received. These statements involve known and unknown risks, uncertainties and other factors that could cause the actual results to differ materially from the results expressed or implied by such statements, including general economic and business conditions, conditions affecting the portfolio companies’ markets, competitor responses, and market acceptance of their products and services and other factors disclosed in the Corporation’s periodic reports filed with the Securities and Exchange Commission. Consequently, such forward-looking statements should be regarded as the Corporation’s current plans, estimates and beliefs. The Corporation assumes no obligation to update the forward-looking information contained in this release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005144/en/\nCompany:\nRand Capital Corporation\nAllen F. (\"Pete\") Grum, 716-853-0802\nPresident and CEO\npgrum@randcapital.com\nor\nInvestors:\nKei Advisors LLC\nDeborah K. Pawlowski, 716-843-3908\ndpawlowski@keiadvisors.com\nor\nKaren L. Howard, 716-843-3942\nkhoward@keiadvisors.com\nSource: Rand Capital Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.givegab.com&esheet=51745744&newsitemid=20180119005144&lan=en-US&anchor=www.givegab.com&index=5&md5=282634497ea15c54821ad17d157b8e32", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.givegab.com%2F&esheet=51745744&newsitemid=20180119005144&lan=en-US&anchor=GiveGab%2C+Inc.&index=2&md5=cc0df29f6742b085f410abc16345f45c", "http://www.randcapital.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fkimbia.com%2F&esheet=51745744&newsitemid=20180119005144&lan=en-US&anchor=Kimbia&index=3&md5=cdfeb254be3552223cf35c6eec4ebd98", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.kimbia.com&esheet=51745744&newsitemid=20180119005144&lan=en-US&anchor=www.kimbia.com&index=6&md5=90cacc5abcc5d1ae5ba751259417134f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.randcapital.com%2F&esheet=51745744&newsitemid=20180119005144&lan=en-US&anchor=http%3A%2F%2Fwww.randcapital.com%2F&index=7&md5=6dca39346aec2278901c36c8d7b48f9f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.randcapital.com%2F&esheet=51745744&newsitemid=20180119005144&lan=en-US&anchor=Rand+Capital+Corporation&index=1&md5=1d593d63171c919c08f2f90cd25ec254", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fkimbia.com%2Fgiving-days%2F&esheet=51745744&newsitemid=20180119005144&lan=en-US&anchor=Giving+Days&index=4&md5=096a3eeba0c64a6d7914dacf7a39dba8", "http://www.businesswire.com/news/home/20180119005144/en/"], "published": "2018-01-19T17:00:00.000+02:00", "crawled": "2018-01-19T21:02:03.000+02:00", "highlightTitle": ""}