{"organizations": [], "uuid": "731b6cf4084caedd226037c389c7a68abd8137d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INhealth\r", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/us-health-exercise-breast-cancer/even-obese-breast-cancer-survivors-may-cut-heart-disease-risk-with-exercise-idINKBN1FK2W8", "country": "US", "domain_rank": 408, "title": "Even obese breast cancer survivors may cut heart disease risk with exercise", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T21:30:00.000+02:00", "replies_count": 0, "uuid": "731b6cf4084caedd226037c389c7a68abd8137d4"}, "author": "", "url": "https://in.reuters.com/article/us-health-exercise-breast-cancer/even-obese-breast-cancer-survivors-may-cut-heart-disease-risk-with-exercise-idINKBN1FK2W8", "ord_in_thread": 0, "title": "Even obese breast cancer survivors may cut heart disease risk with exercise", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - Exercise can help overweight and obese breast cancer survivors reverse what’s known as metabolic syndrome - a cluster of conditions like high blood pressure and elevated blood sugar that raise risk for cardiovascular disease, stroke and diabetes - a new study suggests.\nMetabolic syndrome, which also includes also conditions like high cholesterol and excessive fat around the midsection, is exacerbated by overall obesity and a sedentary lifestyle as well as by chemotherapy. The current study focused on 100 overweight and obese women who were sedentary and had recently completed treatment for breast cancer.\nIn a four-month experiment, researchers randomly assigned participants to either stick with their usual activity levels or to do supervised workouts three times a week.\nWhen they joined the study, 77 percent of the women met the criteria for metabolic syndrome. By the end of the experiment, only 15 percent of the participants in the exercise group still had this diagnosis, compared with 80 percent of the inactive group.\n“Heart disease is the main cause of death in breast cancer survivors, and now we showed that exercise can improve risk factors associated with heart disease,” said lead study author Christina Dieli-Conwright, director of the Integrative Center for Oncology Research in Exercise at the University of Southern California in Los Angeles.\nExercise makes can improve the function of the heart, blood vessels, lungs and muscles and this, combined with fat loss, can ease the stress on the body that is caused by obesity, Dieli-Conwright said by email.\n“This process is critical for breast cancer survivors who may be obese but also suffering from treatment side effects such as fatigue, depression, and sedentary behavior,” Dieli-Conwright added. “They are now at a higher risk for heart disease and can benefit greatly from exercise.”\nPrevious research has linked cancer chemotherapies known as anthracyclines to weakening of the heart muscle. Research has also tied some radiation therapy to cardiac rhythm disorders and structural damage in arteries and heart valves.\nWomen in the current study who were assigned to the exercise group received one-on-one guidance through workouts that included resistance training with weights as well as moderate-intensity aerobic activities.\nIn addition to reversing metabolic syndrome, these workouts were also associated with a decrease in blood pressure and an increase in high-density lipoprotein (HDL) “good” cholesterol that helps purge blood vessels of debris and lower levels of triglycerides - dangerous fats that can make blood thicker, stickier and more prone to clots.\nThree months after the workouts stopped, women in the exercise group still had more improvements in metabolic syndrome than women who remained sedentary throughout the study, researchers report in the Journal of Clinical Oncology.\nOne limitation of the study is that the results from supervised workouts in the experiment might not reflect what would happen if women tried to exercise on their own, researchers note.\nAnother drawback is that the study didn’t examine the effects of exercise based on what type of breast cancer women had, and this might influence the impact of exercise on metabolic syndrome, said Linda Vona-Davis, a researcher at the West Virginia University Health Sciences Center in Morgantown.\n“Exercise and healthy eating may be equally effective,” Vona-Davis, who wasn’t involved in the study, said by email. “Be that as it may, adopting a physically active lifestyle has been shown to improve functional capacity and quality of life in women with breast cancer.”\nSOURCE: bit.ly/2BIqeOl Journal of Clinical Oncology, online January 22, 2018.\n ", "external_links": [], "published": "2018-01-31T21:30:00.000+02:00", "crawled": "2018-01-31T22:09:54.020+02:00", "highlightTitle": ""}