{"organizations": [], "uuid": "4faf1c3a0edb233d0dda99c82bc546758be8c588", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 298}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220388313&w=1200&r=LYNXMPEE071LH", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-samsung-elec-results/samsung-electronics-says-fourth-quarter-operating-profit-likely-up-64-percent-idUKKBN1EX2HO", "country": "US", "domain_rank": 408, "title": "Samsung Elec profit guidance misses expectations as won weighs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T03:43:00.000+02:00", "replies_count": 0, "uuid": "4faf1c3a0edb233d0dda99c82bc546758be8c588"}, "author": "", "url": "https://uk.reuters.com/article/us-samsung-elec-results/samsung-electronics-says-fourth-quarter-operating-profit-likely-up-64-percent-idUKKBN1EX2HO", "ord_in_thread": 0, "title": "Samsung Elec profit guidance misses expectations as won weighs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 11:50 PM / Updated 4 hours ago Samsung Electronics profit guidance misses expectations as won weighs Joyce Lee 4 Min Read \nSEOUL (Reuters) - Samsung Electronics Co Ltd ( 005930.KS ) on Tuesday estimated a record fourth-quarter profit but the guidance fell short of market expectations as a strong won and one-off staff bonuses took the shine off surging DRAM chip prices. FILE PHOTO: The logo of Samsung Electronics is seen at its office building in Seoul, South Korea South Korea, October 11, 2017. REUTERS/Kim Hong-Ji/File Photo \nThe global memory chip leader said its October-December operating profit likely jumped 64 percent year-on-year to 15.1 trillion won ($14.1 billion), shy of a 15.9 trillion won average estimate from 17 analysts surveyed by Thomson Reuters. Revenue was estimated at 66 trillion won, slightly below expectations. \nWhile the guidance put the South Korean tech giant on course for a record 2017 profit, Samsung shares fell as much as 2 percent amid doubts over the outlook for memory chips and smartphones. The broader market .KS11 was 0.3 percent higher. \n“The currency effect and bonuses appear to be the main reason for missing market forecasts, but smartphone shipments are also likely to be lower than expected,” said Song Myung-sup, analyst at HI Investment & Securities. \n“Considering Apple and Chinese firms’ sales weren’t stellar either, overall mobile demand appears to have been sluggish.” \nThe strong won and a end-year bonus for staff in the semiconductor business are expected to have dented fourth-quarter profit by about 400 billion won and 400-500 billion won respectively, two analysts said. \nBased on the guidance, Samsung’s 2017 operating profit is likely to come in at 53.6 trillion won, compared to the previous year’s 29.2 trillion won. \nThe Apple Inc ( AAPL.O ) smartphone rival did not elaborate on its October-December performance and will disclose detailed results at the end of January. \nThe last time a Samsung guidance statement disappointed the market was in the wake of the embarrassing withdrawal of its fire-prone Galaxy Note 7 handsets in October 2016. MEMORY AND MOBILE \nThe continued rise in the price of DRAM chips and demand from data center servers drove fourth-quarter earnings, offsetting a drop in NAND chip prices and the stronger won, analysts said. \nBut the outlook for semiconductors in 2018 is mixed, and Samsung shares have fallen 11.4 percent from their all-time high in early November as some investors bet on an end to the memory boom. \nNAND flash memory chips, used in things like digital cameras and USB drives, have entered a down-cycle and there is a view among some industry observers that DRAM market conditions also will soften later this year. \nOthers however expect DRAM supply to remain tight throughout 2018 as Google ( GOOGL.O ), Amazon ( AMZN.O ) and Facebook ( FB.O ) expand data centers used for cloud storage and computing. \nThe outlook for smartphones and other mobile devices, which analysts expect to contribute about 17 percent to Samsung’s fourth-quarter earnings, is also uncertain due to competition from Chinese rivals in markets like Europe and Asia. \nTom Kang, research director at data provider Counterpoint, said Samsung’s mobile division should show “moderate” shipment growth of about 1-2 percent in 2018. \nSouth Korean exporters like Samsung will be keeping a close eye on the won KRW=KFTC in 2018. The currency traded on Monday at its highest in more than three years. \n($1 = 1,067.7000 won)", "external_links": [], "published": "2018-01-09T03:43:00.000+02:00", "crawled": "2018-01-09T09:42:27.750+02:00", "highlightTitle": ""}