{"organizations": [], "uuid": "2bc92d28ceca6556982e30c6c26735014acada41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-delta-air-lines-announces-december-quarter-and-full-year-2017-profit.html", "country": "US", "domain_rank": 767, "title": "Delta Air Lines Announces December Quarter and Full Year 2017 Profit", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:00:00.000+02:00", "replies_count": 0, "uuid": "2bc92d28ceca6556982e30c6c26735014acada41"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-delta-air-lines-announces-december-quarter-and-full-year-2017-profit.html", "ord_in_thread": 0, "title": "Delta Air Lines Announces December Quarter and Full Year 2017 Profit", "locations": [], "entities": {"persons": [{"name": "ed bastian", "sentiment": "none"}], "locations": [{"name": "hartsfield-jackson airport", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}], "organizations": [{"name": "delta air lines", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "delta", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 11, 2018 /PRNewswire/ -- Delta Air Lines (NYSE: DAL) today reported financial results for the December quarter 2017. Highlights of those results, including both GAAP and adjusted metrics, are below and incorporated here.\nAdjusted pre-tax income for the December 2017 quarter was $1.0 billion, despite a $60 million impact from the combination of December's power outage at Atlanta's Hartsfield-Jackson Airport and Winter Storm Benji. For the full year, adjusted pre-tax income was $5.5 billion, a $621 million decrease relative to 2016.\n\"Delta people rose to the challenges of 2017 to produce solid financial results, industry leading operational reliability and strong improvements in customer satisfaction, and it's an honor to recognize their achievements with $1.1 billion in profit sharing,\" said Ed Bastian, Delta's chief executive officer. \"Looking ahead to 2018, we expect to drive solid earnings growth by growing our top line 4 to 6 percent, improving our cost trajectory and integrating our international partner network. As a result, we are able to increase our previous full-year guidance to $6.35 to $6.70 per share due to additional benefits from tax reform.\"\nRevenue Environment\nDelta's operating revenue of $10.2 billion for the December quarter was up 8.3 percent, or $787 million versus prior year. Total unit revenues excluding refinery sales increased 4.4 percent for the December quarter.\nPassenger revenue increased $527 million, including $200 million from Delta's Branded Fares initiatives. Passenger unit revenues increased 4.2 percent, including 0.5 points from one-time revenue adjustments, on 2.3 percent higher capacity.\nCargo revenue increased 14.4 percent, driven by higher volumes and yields. Other revenue improved 17.9 percent primarily due to higher loyalty revenue and a $150 million increase in third-party refinery sales.\nFor the full year, Delta's operating revenue of $41.2 billion was up 4.0 percent, or $1.6 billion versus prior year. Total unit revenues excluding refinery sales increased 2.4 percent on 1.0 percent higher capacity.\n\"We enter 2018 with significant momentum and every entity delivering positive passenger unit revenue for the first time in five years, driven by a robust demand environment and improving business fares,\" said Glen Hauenstein, Delta's president. \"We expect to deliver total unit revenue growth of 2.5 to 4.5 percent in the March quarter and leverage our unrivaled domestic network, international partnerships, and solid pipeline of commercial initiatives to deliver similar performance each quarter throughout 2018.\"\nIncrease (Decrease)\n4Q17 versus 4Q16\nChange\nUnit\nRevenue\n4Q17 ($M)\nYoY\nRevenue\nYield\nCapacity\nMainline\n4,766\n8.7 %\n3.4 %\n4.4 %\n5.1 %\nRegional\n1,423\n1.8 %\n6.7 %\n7.6 %\n(4.6) %\nTotal Domestic\n6,189\n7.0 %\n3.5 %\n4.4 %\n3.4 %\nAtlantic\n1,181\n9.0 %\n7.4 %\n3.7 %\n1.5 %\nPacific\n559\n0.1 %\n1.6 %\n0.7 %\n(1.5) %\nLatin America\n572\n4.5 %\n4.0 %\n5.0 %\n0.5 %\nTotal Passenger\n8,501\n6.6 %\n4.2 %\n4.1 %\n2.3 %\nCargo Revenue\n200\n14.4 %\nOther Revenue\n1,544\n17.9 %\nTotal Revenue\n10,245\n8.3 %\n4.4 %\nSee Note A for reconciliation of total unit revenue (TRASM) change\nMarch 201 8 Quarter Guidance\nFor the March quarter, Delta is expecting improving revenues and the benefit from tax reform to partially offset fuel cost increases and the period of highest non-fuel expense growth for the year.\n1Q18 Forecast\nEarnings per share\n$0.60 - $0.80\nPre-tax margin\n6% - 8%\nFuel price, including taxes and refinery impact\n$2.05 - $2.10\nTotal unit revenue excluding refinery sales (year-over-year)\nUp 2.5% - 4.5%\nCASM-Excluding fuel and profit sharing (year-over-year)\nUp 2% - 4%\nSystem capacity (year-over-year)\nUp ~3%\nSee Note A for information about reconciliation of projected non-GAAP financial measures\n2017 Cost Performance\nAdjusted fuel expense 2 increased $349 million compared to the same period in 2016 as market fuel prices increased throughout the quarter. Delta's adjusted fuel price per gallon for the December quarter was $1.93, which includes $0.03 of benefit from the refinery.\nCASM-Ex 3 including profit sharing decreased 0.4 percent for the December 2017 quarter compared to the prior year period driven by the impact of Delta's pilot agreement ratified in the December 2016 quarter. The pilot agreement resulted in $475 million of expense in the prior year period and included a $380 million retroactive payment for the first three quarters of 2016.\nNormalized CASM-Ex 4 including profit sharing increased 5.6 percent versus the prior year period, driven by continued investments in Delta's people, product and operation, as well as pressure from accelerated depreciation due to aircraft retirements.\nFor the full year, CASM-Ex including profit sharing increased 4.3 percent compared to 2016. Excluding profit sharing, 2017 CASM-Ex increased 4.7 percent driven by targeted investments in Delta's employees, fleet, and product.\nNon-operating expense increased $36 million for the December quarter due to higher interest expense from Delta's unsecured debt financing primarily used to fund its pension plan, as well as foreign exchange pressures.\n\"Our focus for 2018 is to bring our unit cost trajectory back in line with our long-term 0 to 2 percent target,\" said Paul Jacobson, Delta's chief financial officer. \"We have a line of sight to achieving our cost goal, and expect our March quarter to be the peak of our non-fuel expense growth as we lap investments in our business and higher levels of depreciation, and the savings from our fleet and efficiency initiatives begin ramping up as we move through the year.\"\nCash Flow, Shareholder Returns, and Adjusted Net Debt\nDelta generated $1.7 billion of adjusted operating cash flow and $435 million of free cash flow during the quarter. The company invested $850 million into the business for aircraft purchases and improvements, facilities upgrades and technology. The company also spent $450 million to purchase its 10 percent stake in Air France-KLM.\nDelta generated $6.8 billion of adjusted operating cash flow and $2.0 billion of free cash flow for the full year, and invested $3.6 billion into the business and $1.2 billion in equity stakes in partner airlines.\nDuring the December quarter, Delta announced an order for 100 state-of-the-art Airbus A321neo aircraft with deliveries beginning in 2020 and a long-term commitment with Pratt & Whitney for Delta TechOps to be a major maintenance, repair and overhaul provider for the PW1100G and PW1500G engines, powering Delta's A321neo and C Series aircraft.\nAdjusted net debt at the end of the quarter was $8.8 billion, up $2.6 billion versus the prior year largely as a result of a $2.5 billion increase in unsecured debt, primarily issued to accelerate pension funding. The company's unfunded pension liability declined by $3.6 billion from the end of 2016 to $7.0 billion at the end of 2017.\nFor the December quarter, Delta returned $541 million to shareholders, comprised of $325 million of share repurchases and $216 million in dividends. For the full year, Delta returned $2.4 billion to shareholders, comprised of $1.7 billion of share repurchases and $731 million in dividends.\nTax Reform\nAs a ", "external_links": ["http://news.delta.com/hartsfield-jackson-atlanta-international-airport", "https://www.facebook.com/delta", "http://www.skyteam.com/", "http://news.delta.com/minneapolis-st-paul-international-airport", "http://www.alitalia.com/", "https://twitter.com/deltanewshub", "http://news.delta.com/amsterdam-schiphol-airport-ams-0", "http://news.delta.com/paris-charles-de-gaulle-airport", "http://news.delta.com/tokyo-narita-international-airport", "http://www.delta.com/content/www/en_US/traveling-with-us/where-we-fly/flight-partners.html#connection", "http://news.delta.com/new-york-city-john-f-kennedy-international-airport-and-laguardia-airport", "http://www.delta.com/", "https://plus.google.com/+Delta/posts", "http://www.virgin-atlantic.com/gb/en.html", "http://news.delta.com/london-heathrow-airport", "http://www.prnewswire.com/news-releases/delta-air-lines-announces-december-quarter-and-full-year-2017-profit-300581218.html", "http://news.delta.com/seattle-tacoma-international-airport-0", "http://news.delta.com/salt-lake-city-international-airport", "http://news.delta.com/boston-logan-international-airport-0", "http://www.airfranceklm-finance.com/en", "http://www.delta.com/content/www/en_US/traveling-with-us/where-we-fly/flight-partners.html", "http://news.delta.com/los-angeles-international-airport", "http://news.delta.com/", "http://news.delta.com/detroit-metropolitan-wayne-county-airport", "http://news.delta.com/global-network"], "published": "2018-01-11T15:00:00.000+02:00", "crawled": "2018-01-11T15:00:19.014+02:00", "highlightTitle": ""}