{"organizations": [], "uuid": "5e6031342de85f6febf93c69d79e8eaed508861c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226939661&w=1200&r=LYNXMPEE0U0V3", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-boeing-results/boeing-says-to-deliver-more-planes-in-2018-idUSKBN1FK1QJ", "country": "US", "domain_rank": 408, "title": "Boeing says to deliver more planes in 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:40:00.000+02:00", "replies_count": 0, "uuid": "5e6031342de85f6febf93c69d79e8eaed508861c"}, "author": "", "url": "https://www.reuters.com/article/us-boeing-results/boeing-says-to-deliver-more-planes-in-2018-idUSKBN1FK1QJ", "ord_in_thread": 0, "title": "Boeing says to deliver more planes in 2018", "locations": [], "entities": {"persons": [{"name": "ankit ajmera   saumyadeb chakrabarty", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "boeing co", "sentiment": "negative"}, {"name": "boeing", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Boeing Co ( BA.N ) on Wednesday forecast full-year profit well above Wall Street estimates as it looks forward to its busiest year ever for plane deliveries, sending its shares up almost 5 percent.\nThe world’s biggest plane maker also said it would end years of job cuts in 2018, but would not now start hiring more people because of the recent reduction in the U.S. corporate tax rate.\n“More of an employment plateau in the near-term,” Boeing Chief Executive Dennis Muilenburg said on a conference call with analysts on Tuesday.\nBoeing has shed 20 percent of its workforce, or about 34,000 jobs, since employment peaked in 2012, in a bid to reduce costs and improve profits. Several U.S. companies have promised to boost hiring after December’s new tax law slashed the corporate rate to 21 percent from 35 percent.\nAlthough Chicago-based Boeing delivered more aircraft to customers than Airbus SE ( AIR.PA ) last year, and is much more profitable, it is still in a dogfight to win orders after its European rival sold about 22 percent more planes last year.\n“Our focus is to make Boeing ever tougher,” Muilenburg said.\nBoeing said it aims to ship between 810 and 815 commercial aircraft in 2018, as much as 7 percent more than the industry-record 763 jets it delivered in 2017, putting it ahead of Airbus for the sixth year in a row. Airbus delivered 718 jetliners last year.\nBoth companies are speeding up production at their factories to chip away at the large backlog of orders for new jetliners, created over the past few years as airlines want new, fuel-efficient planes to cope with a surge in demand for air travel.\nHelped by the hunger for new jets, Boeing forecast core profit would rise to $13.80 to $14.00 a share in 2018, ahead of analysts’ average estimate of $11.96, according to Thomson Reuters I/B/E/S.\nFor the fourth quarter ended Dec. 31, Boeing’s core earnings nearly doubled to $4.80 per share from $2.47 a year earlier, buoyed by rising plane output and a $1.74 per share gain from changes to the U.S. tax law.\nBoeing shares, which have more than doubled in the past 12 months, rose 4.7 percent to $353.60 on the New York Stock Exchange.\nSlideshow (2 Images) SETTING THE TABLE Boeing’s commercial planes unit posted an 8 percent increase in revenue in the fourth quarter to $15.47 billion, while operating profit rose 50 percent to $1.78 billion.\nThe company’s smaller defense business grow more slowly. Revenue for the unit rose 5 percent to $5.54 billion while operating profit rose 6 percent to $553 million.\nBoeing’s new services business - which maintains and overhauls planes for their owners - posted a 17 percent increase in revenue to $4 billion in the fourth quarter while operating profit rose 9 percent to $617 million. Boeing is aiming to hit $50 billion in revenue in that business by 2027.\nHowever, profit margins at the unit narrowed slightly to 15.4 percent, and Boeing said it expects margins near that level this year.\n“Margins weren’t as good as I thought,” said Sheila Kahyaoglu, an analyst at Jefferies LLC in New York.\nBoeing also forecast at least $12.8 billion in free cash flow this year, encouraging Wall Street analysts, who generally view the company’s early targets as conservative.\n“Actual results could ultimately be higher,” Seth Seifman, an analyst at JPMorgan, said in a note to clients. “As a result, we expect the stock to outperform despite its recent run now that management has set the table for a solid 2018.”\nBy raising production while holding down costs, Boeing and Airbus generate more profit and cash.\nDespite the rising output, their order backlogs have kept growing. Boeing said its total backlog, which includes military aircraft and other products, rose to $488 billion at year-end, compared with $474 billion at the end of the third quarter.\nExcluding the gain, Boeing reported earnings of $3.06 a share. On that basis, Wall Street had been expecting $2.89 a share.\nMuilenburg said Boeing still expects to increase operating profit margins to the mid-teens by 2020, from 9.6 percent last year, with most of the gain coming from reducing the cost of making 787 Dreamliners, while holding costs of its workhorse single-aisle 737 steady.\nRelated Coverage Boeing CEO says still in talks with Embraer on strategic deal Reporting by Alwyn Scott in New York and Ankit Ajmera in Bengaluru; Editing by Saumyadeb Chakrabarty and Bill Rigby\n ", "external_links": [], "published": "2018-01-31T14:40:00.000+02:00", "crawled": "2018-01-31T14:57:47.000+02:00", "highlightTitle": ""}