{"organizations": [], "uuid": "d15c4ca6a17a3fea560133e996b136378d3cb8cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218597517&w=1200&r=LYNXMPEE000SK", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/pope-peace/dont-extinguish-migrants-hopes-pope-says-on-world-day-of-peace-idINKBN1EQ0YF", "country": "US", "domain_rank": 408, "title": "Don't extinguish migrants' hopes, Pope says on World Day of Peace", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T14:54:00.000+02:00", "replies_count": 0, "uuid": "d15c4ca6a17a3fea560133e996b136378d3cb8cb"}, "author": "", "url": "https://in.reuters.com/article/pope-peace/dont-extinguish-migrants-hopes-pope-says-on-world-day-of-peace-idINKBN1EQ0YF", "ord_in_thread": 0, "title": "Don't extinguish migrants' hopes, Pope says on World Day of Peace", "locations": [], "entities": {"persons": [{"name": "pope", "sentiment": "negative"}, {"name": "reuters/max rossi  francis", "sentiment": "none"}, {"name": "francis", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}], "locations": [{"name": "vatican", "sentiment": "none"}, {"name": "st. peter’s square", "sentiment": "none"}], "organizations": [{"name": "roman catholic church", "sentiment": "none"}, {"name": "vatican city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "peace reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 12:59 PM / Updated 3 hours ago Don't extinguish migrants' hopes, Pope says on World Day of Peace Reuters Staff 3 Min Read \nVATICAN CITY (Reuters) - Pope Francis described migrants and refugees as the world’s “weakest and most needy” on Monday, using his traditional New Year’s address to “give voice” to people he has urged leaders to do more to help. \nFrancis reminded some 40,000 people who gathered in St. Peter’s Square at the Vatican that he had chosen the plight of migrants and refugees as the theme for the Roman Catholic Church’s World Day of Peace, which is celebrated every January 1. \n“For this peace, to which everyone has a right, many of them are willing to risk their lives in a journey which is often long and dangerous, they are willing to face strain and suffering.” \n“Please, let us not extinguish the hope in their hearts, let us not suffocate their hopes for peace!” \nAcross the world, the mass movement of people has shot to the top of the political agenda, and Francis has made defending those who migrate a central theme of his papacy. Pope Francis leads a mass to mark the World Day of Peace in Saint Peter's Basilica at the Vatican January 1, 2018. REUTERS/Max Rossi \nDuring a trip to Myanmar and Bangladesh last year, he met Muslim refugees and called for decisive measures to solve the political problems that caused many to flee. \nHe has also criticised President Donald Trump’s stated intention to build a wall along the U.S. border with Mexico to keep out illegal immigrants. Slideshow (5 Images) \nIn a homily earlier on Monday, Francis said everyone should look after their soul by taking a moment of silence every day, “to keep our freedom from being corroded by the banality of consumerism, the blare of commercials, the stream of empty words and the overpowering waves of empty chatter and loud shouting”. \nIn a message released in November ahead of the World Day of Peace, Francis said politicians who stoke fear of migrants were sowing violence and racism. He acknowledged that the presence of immigrants can compound existing problems in a country, but appealed for practical ways to be found to welcome newcomers. \nOn Monday, he said: “It is important that there is a commitment from everyone, from civil institutions, and those in education, welfare and church organisations, to ensure a peaceful future for refugees, migrants, everyone.” Reporting by Isla Binnie; editing by Jason Neely", "external_links": [], "published": "2018-01-01T14:54:00.000+02:00", "crawled": "2018-01-01T15:25:27.002+02:00", "highlightTitle": ""}