{"organizations": [], "uuid": "6759b0583e072c03f388703619cb9d130e28cf46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/30/reuters-america-update-5-after-turbulent-year-trump-extending-open-hand-for-cooperation.html", "country": "US", "domain_rank": 767, "title": "UPDATE 5-After turbulent year, Trump extending 'open hand' for cooperation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T02:13:00.000+02:00", "replies_count": 0, "uuid": "6759b0583e072c03f388703619cb9d130e28cf46"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/reuters-america-update-5-after-turbulent-year-trump-extending-open-hand-for-cooperation.html", "ord_in_thread": 0, "title": "UPDATE 5-After turbulent year, Trump extending 'open hand' for cooperation", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald tru", "sentiment": "negative"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "gallup", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts with speech excerpts, adds Gallup poll)\nWASHINGTON, Jan 30 (Reuters) - President Donald Trump, battling a probe into his campaign's alleged ties with Russia and struggling to sell Americans on his leadership abilities, will urge bipartisan cooperation on overhauling U.S. immigration policies and rebuilding infrastructure in an address to Congress on Tuesday night.\n\"So tonight I am extending an open hand to work with members of both parties, Democrats and Republicans, to protect our citizens, of every background, color, and creed,\" Trump will say, according to excerpts of his State of the Union speech released by the White House.\nFacing a deadline on an immigration controversy and strong Democratic opposition, Trump was calling for the type of cooperation between Republicans and Democrats that has eluded him during a rocky first year in office.\nTrump will visit Capitol Hill to deliver his first State of the Union speech at 9:10 p.m. (0210 GMT on Wednesday).\nIn preparing for the event, Trump told U.S. television network anchors that he would offer a message of unity, in what would be a rarity for the politically polarizing president.\n\"I would consider it a great achievement if we could make our country united,\" he told the anchors during a lunch, according to comments released by the White House.\nTrump's speech comes as Americans voice doubts about his fitness for office.\nA Gallup poll said Trump had an average job approval in 2017 of 38 percent, the lowest first-year rating for any president in the firm's history. Gallup said that was nearly 20 points lower than the 57 percent averaged by his Democratic predecessor, Barack Obama. Trump's current approval rating is also 38 percent.\nThat is alarming to Republicans as they seek to maintain control of the U.S. Congress in midterm elections in November.\nTAXES, IMMIGRATION\nTrump planned to use the televised speech to tout the benefits of a tax overhaul approved by the Republican-controlled Congress in December that was his first major legislative victory.\n\"Our massive tax cuts provide tremendous relief for the middle class and small businesses,\" Trump will say.\nThe atmosphere in the House of Representatives chamber where Trump will speak could be tense. Several Democratic lawmakers have said they will boycott the event. Some Democratic women who will attend plan to wear black in support of the #MeToo movement against sexual harassment.\nAhead of Trump's speech, Republicans and Democrats were deeply divided over immigration, which has been linked to congressional efforts to pass a spending bill. Lawmakers face a Feb. 8 deadline to reach a compromise on the issue and pass a new budget measure to avoid a second government shutdown after a brief closure earlier this month.\nTrump will argue that struggling U.S. communities, particularly immigrant communities, will be aided by immigration polices that \"focus on the best interests of American workers and American families.\"\nTo attract Democratic votes for an immigration deal, Trump has said he is open to letting \"Dreamers,\" a group of immigrants brought into the country illegally as children, stay in the United States.\nIn return, he has demanded funding for his long-proposed wall along the border with Mexico and measures to curb family sponsorship of immigrants, proposals that have failed to gain traction with Democrats in the past.\nRUSSIA PROBE\nTrump will also promote a $1.7 trillion plan to rebuild America's aging roads and other infrastructure, but he is not expected to offer many details.\nTrump is expected to address the various global issues that have preoccupied his administration, such as the challenge posed by North Korea's nuclear and weapons programs, and Iran's clout in the Middle East.\nThe president is being buffeted by a series of headlines about U.S. Special Counsel Robert Mueller's investigation into whether Trump or his aides colluded with Russia during the 2016 presidential election.\nU.S. intelligence agencies have concluded that Russia interfered in the campaign using hacking and propaganda to attempt to tilt the race in Trump's favor. Russia has denied meddling. Trump, who has called Muellers probe a witch hunt, has denied any collusion with Russia or that he has obstructed justice in his actions related to the federal investigation.\n(Additional reporting by Richard Cowan, Susan Cornwell, Amanda Becker and Roberta Rampton; Editing by Frances Kerry and Peter Cooney)", "external_links": [], "published": "2018-01-31T02:13:00.000+02:00", "crawled": "2018-01-31T14:27:49.003+02:00", "highlightTitle": ""}