{"organizations": [], "uuid": "ed37246ec3c79130f2881bffb4cdf2ae60e4758e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INhealth\r", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/us-health-transplants-kidney-donors/living-kidney-donors-have-low-but-elevated-risk-of-renal-failure-idINKBN1FI2RU", "country": "US", "domain_rank": 408, "title": "Living kidney donors have low but elevated risk of renal failure", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:41:00.000+02:00", "replies_count": 0, "uuid": "ed37246ec3c79130f2881bffb4cdf2ae60e4758e"}, "author": "", "url": "https://in.reuters.com/article/us-health-transplants-kidney-donors/living-kidney-donors-have-low-but-elevated-risk-of-renal-failure-idINKBN1FI2RU", "ord_in_thread": 0, "title": "Living kidney donors have low but elevated risk of renal failure", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}, {"name": "emanuele di angelantonio", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "nihr biomedical research unit in donor health and genomics", "sentiment": "none"}, {"name": "university of cambridge", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 10:45 PM / Updated 28 minutes ago Living kidney donors have low but elevated risk of renal failure Lisa Rapaport 5 Min Read \n(Reuters Health) - Kidney donors may be no more likely than other people to develop chronic health problems like diabetes or high blood pressure but they may still have an increased risk of renal failure, a research review suggests. \n“This study highlights the low but real risks of living kidney donation and emphasizes the importance of careful assessment and counseling for all living donors,” senior study author Dr. Emanuele Di Angelantonio, director of the NIHR Biomedical Research Unit in Donor Health and Genomics at the University of Cambridge in the UK, said by email. \nCompared with non-donors, living kidney donors were almost nine times more likely to develop end-stage renal disease (ESRD), severe kidney failure that requires people to receive a transplant or go on dialysis. \nEach year, the absolute risk of ESRD was 0.5 cases for every 1,000 living donors, compared with 0.1 cases for every 1,000 non-donors. \nEven though living kidney donation is the gold standard treatment for patients with ESRD, much of the research on the health effects for donors has offered an inconclusive picture of the long-term consequences of giving away a kidney, researchers note in the Annals of Internal Medicine. \nTo get a clearer picture of the lasting health effects of donation, researchers examined data from 52 previously published studies that, combined, included a total of 118,426 living kidney donors and 117,576 otherwise similar individuals who weren’t donors. These smaller studies followed participants for an average of 1 to 24 years. \nOverall, there was no increased risk of death from all causes associated with being a living kidney donor, the research review found. \nLiving kidney donors also didn’t appear to have an increased risk of developing cardiovascular disease, diabetes, high blood pressure or mental health problems. \nWomen did have a higher risk of preeclampsia, a serious form of high blood pressure that can develop during pregnancy and endanger the lives of both women and their babies when it isn’t properly treated. \nAmong living donors, there were 5.9 cases of preeclampsia for every 100 pregnancies, compared with 3.1 cases for every 100 pregnancies among non-donors. \nOne limitation of the study is that the control groups of non-donors in the analysis may not have been as healthy overall as the donors because of the stringent medical evaluations people must undergo to qualify to become living donors, the authors note. Another drawback is that some health problems related to donation might take decades to develop, making them impossible to detect in this study. \n“It’s safe to say that we now know a lot about what happens to kidney donors in the first ten years after donation, but much less about what happens later,” said Dr. Peter Reese, author of an accompanying editorial and a researcher at the University of Pennsylvania Perelman School of Medicine in Philadelphia. \nDonors younger than 25 should be particularly cautious about the potential long-term unknown risks of donation, since they might have many decades of life with only one kidney, Reese said by email. \nPatricia Sheiner, transplant surgeon and Director of Transplant at Hartford Hospital in Connecticut, who wasn’t involved in the study, told Reuters Health, “Even though the risk of kidney failure is higher in kidney donors than in the general population, the absolute incidence is still very low. However, it’s important that people considering donation understand the short term and long term risks. It’s also important that transplant programs continue to carefully select suitable donors, excluding those who are at risk for developing conditions that could contribute to kidney problems.” \n“We must keep in mind that the results might be different if donors were followed up for 30 years,” Reese added. “It is possible that there are small increased risks of death or cardiovascular disease from kidney donation that were not recognized because many living kidney donors may be selected because of their overall good health.” \nSOURCES: bit.ly/2DLxYF3 and bit.ly/2GtixiJ Annals of Internal Medicine, online January 29, 2018.", "external_links": [], "published": "2018-01-30T00:41:00.000+02:00", "crawled": "2018-01-30T01:19:50.014+02:00", "highlightTitle": ""}