{"organizations": [], "uuid": "f1fbef10e421357710aadb9749aba94b26947e50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/iran-nuclear-ballistics-france/update-1-france-says-iran-not-respecting-u-n-text-on-ballistic-missiles-idUSL8N1PH4XA", "country": "US", "domain_rank": 408, "title": "UPDATE 1-France says Iran not respecting U.N. text on ballistic missiles", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:17:00.000+02:00", "replies_count": 0, "uuid": "f1fbef10e421357710aadb9749aba94b26947e50"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/iran-nuclear-ballistics-france/update-1-france-says-iran-not-respecting-u-n-text-on-ballistic-missiles-idUSL8N1PH4XA", "ord_in_thread": 0, "title": "UPDATE 1-France says Iran not respecting U.N. text on ballistic missiles", "locations": [], "entities": {"persons": [{"name": "le drian", "sentiment": "none"}, {"name": "jean-yves le drian", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "lebanon", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* EU ministers to discuss Iran after Trump ultimatum\n* France says has started talks with Iran on ballistic missiles\n* Iran denies, says will not talk about such issues (Adds comments from German, Iranian officials,)\nBRUSSELS, Jan 22 (Reuters) - France’s foreign minister accused Iran on Monday of not respecting part of a U.N. resolution that calls on Tehran to refrain from work on ballistic missiles designed to carry nuclear warheads.\nSpeaking on arrival at a European Union foreign ministers meeting in Brussels, Jean-Yves Le Drian also said the 28 ministers would reiterate their concerns over Iran’s activities in Yemen, Lebanon and Syria, which he described as destabilising.\n“We will also have the opportunity of underlining our firmness on Iran’s compliance with United Nations Resolution 2231, which limits access to ballistic capacity and which Iran does not respect,” Le Drian said.\nUnder the U.N. resolution enshrining the 2015 nuclear deal with Britain, China, France, Germany, Russia and the United States, Iran is “called upon” to refrain from work on ballistic missiles designed to deliver nuclear weapons for up to 8 years.\nSome states say this phrasing does not make it an obligatory commitment.\nIran has repeatedly said its missile programme is purely defensive and denied the missiles are designed to carry nuclear warheads.\nLe Drian on Sunday said he would travel to Iran in March and that France had begun talks with Tehran to discuss its missile programme and regional activities.\nBut Iran’s foreign ministry spokesman on Monday dismissed the suggestion of talks on either issu and said Iran had shown it “would not change course under pressure.”\n“If there is such a Quote: that we held talks, we deny it. We have not had any negotiations about our missile and defence capabilities and will not talk about these issues with others,” Bahram Qasemi was Quote: d as saying by Tasnim news agency on Monday.\nWith U.S. President Donald Trump warning of a last chance for “the worst deal ever negotiated”, Britain, France and Germany have begun talks on a plan to satisfy him by addressing Iran’s ballistic missile tests and its regional influence while preserving the 2015 accord.\n“We should surely discuss Iran’s influence in the region because it has been a positive one and everyone has benefited from it. Without Iran’s influence, terrorists (would have) captured Damascus and Baghdad,” Qasemi said.\nIran’s chief nuclear envoy Abbas Araqchi was Quote: d on Iranian media as rejecting the European strategy.\n“Some of them (European signatories of the nuclear deal) think that if they make concessions to Trump on issues other than the nuclear deal, they can make him remain committed to the nuclear deal,” he said.\n“This is a fully wrong policy and will certainly have a reverse outcome and we have clearly said this to Europe too,” deputy Foreign Minister Abbas Araqchi was Quote: d by Iranian media as saying on Monday.\nThe German government appealed to Tehran to join European powers and the United States in discussions, citing concerns about its missile programme and regional activities.\nForeign Ministry spokeswoman Maria Adebahr said German, France and EU officials would launch high-level talks about their concerns. “There’s a lot to discuss, and we are now tackling that,” she said.\nAdebahr declined comment on a report in Der Spiegel magazine which said Germany, France and Britain were lobbying European allies to agree to fresh sanctions against Iran, to show Trump that were taking his concerns seriously.\nJuergen Hardt, foreign policy spokesman for Chancellor Angela Merkel’s conservatives in parliament, dismissed the report as “speculation” and said new sanctions could prompt Tehran to stop implementing the nuclear deal.\n“We will see in the next weeks if we find ways and means to move toward the American perspectives. It is also in our interest to counter the negative influence of Iran in the region,” he said. “But there is no European consensus yet.” (Robin Emmott in Brussels, Parisa Hafezi in Ankara, Andrea Shalal in Berlin and Bozorgmehr Sharafedin in London; writing by John Irish; editing by Richard Balmforth)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T00:17:00.000+02:00", "crawled": "2018-01-23T18:15:33.018+02:00", "highlightTitle": ""}