{"organizations": [], "uuid": "a4007222ca45413f69408798ccb489cebc8b6bb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/deals", "section_title": "Deals News | Reuters", "url": "https://www.reuters.com/article/us-steinhoff-intlnl-cfo/steinhoff-cfo-steps-down-from-post-to-focus-on-liquidity-idUSKBN1ET1U1", "country": "US", "domain_rank": 408, "title": "Steinhoff CFO steps down as crisis-hit retailer shuffles top team", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:09:00.000+02:00", "replies_count": 0, "uuid": "a4007222ca45413f69408798ccb489cebc8b6bb5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-steinhoff-intlnl-cfo/steinhoff-cfo-steps-down-from-post-to-focus-on-liquidity-idUSKBN1ET1U1", "ord_in_thread": 0, "title": "Steinhoff CFO steps down as crisis-hit retailer shuffles top team", "locations": [], "entities": {"persons": [{"name": "steinhoff", "sentiment": "negative"}, {"name": "ben la grange", "sentiment": "none"}, {"name": "philip dieperink", "sentiment": "none"}, {"name": "alixpartner", "sentiment": "none"}], "locations": [{"name": "poundland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "group", "sentiment": "none"}, {"name": "conforama", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG/FRANKFURT (Reuters) - Steinhoff’s ( SNHJ.J ) finance chief stepped down from the role on Thursday to focus on helping the South African retailer plug a 2.4 billion euro ($2.9 billion) hole in its finances after an accounting scandal.\nThe owner of more than 40 multinational retail brands including Conforama, Mattress Firm and Poundland, revealed the “accounting irregularity” last month along with the immediate departure of its chief executive. Its chairman briefly took the reins then also stepped down.\n“While the Group has achieved some degree of stabilization in its operating businesses, significant near-term liquidity is still required in certain of the business units,” Steinhoff said on Thursday.\nChief financial officer Ben la Grange, whom the company has cleared of any wrongdoing, will leave his position and Philip Dieperink, the finance chief of Steinhoff’s UK business, will become acting CFO.\nThe company said la Grange would concentrate on “the preservation and procurement of liquidity in the group” and finalizing its 2017 accounts.\nTurnaround specialist AlixPartners was called in last month to help shore up finances as lenders have started restricting access to credit lines and insurers are cancelling or reducing credit insurance.\nSteinhoff, which has debts of around 10.7 billion euros, said it planned to hire a debt restructuring expert in the role of chief restructuring officer.\nEarlier this week, Steinhoff said it would have to restate its 2015 accounts and maybe even earlier figures, having already warned on its 2016 numbers.\nSHARES REBOUND More than $10 billion has been wiped off Steinhoff’s market value following the disclosure of the scandal that has claimed the heads of CEO Markus Jooste and chairman Christo Wiese. They were key figures who transformed Steinhoff from a modest furniture distributor to a global household goods giant.\nShares in Steinhoff, still down about 80 percent from a month ago, rebounded more than 25 percent on Thursday to 8.60 rand.\nThis week UK subsidiary Poundland reported strong Christmas trading and European unit, Pepkor Europe, which houses Poundland and Dealz, said it had replaced planned investment from its parent in full with a new independent 180 million pound loan.\nMeanwhile, the company’s Asia Pacific subsidiary has hired lawyers and a restructuring specialist to advise on the “significant uncertainty” facing its parent.\nSteinhoff has so far raised around $400 million from the sale of a portion of its stake in South African investment heavyweight PSG Group ( PSGJ.J ). It is also due to receive around $1.2 billion in debt repayment from its subsidiary, Steinhoff Africa Retail.\nThe company, which moved its primary share listing from Johannesburg to Frankfurt two years ago, has been under investigation for suspected accounting fraud in Germany since 2015. Four current and former managers are under suspicion of having overstated revenues at subsidiaries, prosecutors have said.\nSteinhoff has previously said that the investigation relates to whether revenues were booked properly and whether taxable profits were correctly declared.\nEditing by Georgina Prodhan and Elaine Hardcastle\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T00:09:00.000+02:00", "crawled": "2018-01-04T21:10:16.031+02:00", "highlightTitle": ""}