{"organizations": [], "uuid": "e1eb57ebbdec5fdbcbe4686a3284800a4e24871f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 35}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/10/01/102049750-109901863.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/dominion-ceo-bullish-on-scana-deal-says-merger-will-end-uncertainty.html", "country": "US", "domain_rank": 767, "title": "Dominion CEO bullish on Scana deal, says merger will end 'uncertainty'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2018-01-05T01:22:00.000+02:00", "replies_count": 0, "uuid": "e1eb57ebbdec5fdbcbe4686a3284800a4e24871f"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/04/dominion-ceo-bullish-on-scana-deal-says-merger-will-end-uncertainty.html", "ord_in_thread": 0, "title": "Dominion CEO bullish on Scana deal, says merger will end 'uncertainty'", "locations": [], "entities": {"persons": [{"name": "tom farrell", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}, {"name": "farrell", "sentiment": "none"}], "locations": [{"name": "south carolinian", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "dominion", "sentiment": "negative"}, {"name": "scana", "sentiment": "negative"}, {"name": "cnbc.com shares  dominion energy", "sentiment": "neutral"}, {"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dominion Energy CEO Tom Farrell told CNBC on Thursday that Dominion's acquisition of South Carolinian utility Scana would set his company up for significant long-term gains.\n\"We're investing for the long-term in South Carolina,\" Farrell told \"Mad Money\" host Jim Cramer. \" Scana's a very good company. It's got very good growth in its electric and gas utilities. South Carolina's a wonderful state to do business in. We're already there with a pipeline business and some solar farms. Great prospects ahead.\"\nOn Wednesday, Dominion announced it would buy Scana in an all-stock deal worth nearly $15 billion. Shares of Scana popped on the announcement while Dominion's stock slid.\nThe merger will help Scana stem customer and shareholder outrage after a $9 billion nuclear project gone wrong, which resulted in Scana's former CEO stepping down .\nFarrell said that Dominion would absorb nearly $1.7 billion in costs from the uncompleted plant that were not yet reflected in customers' utility rates.\nThe deal also includes a unique provision loosely tied to Congress' newly enacted tax code : all residential customers of Scana's South Carolina Electric & Gas utility will receive an average payment of $1,000 within 90 days of the deal closing.\nFarrell said that customers would also receive a 5 percent rate reduction as consolation for the failed nuclear project, a nearly $600 million subsidy provided by Dominion.\n\"[It's a] very, very unusual thing to give a company's customers value in a transaction. I've never heard of it before,\" Farrell said. \"All in all, there's a tremendous amount of value going to the customers of Scana.\"\nYet even with all of Dominion's payouts, the deal will still be \"immediately accretive\" once it closes, the CEO said.\n\"It's been too long a period in South Carolina that they've been going through this uncertainty, uncertainty for Scana, its employees, its retirees, its shareholders, uncertainty for the citizens of South Carolina and their customers,\" Farrell told Cramer. \"It's really good for the people who have been paying the bills.\"\nIn an emailed response to CNBC's request for comment, Scana's new CEO Jimmy Quote: :\n\"Dominion Energy is a strong, well-regarded company in the utility industry and its commitment to customers and communities aligns well with our values,\" Addison said. \"Joining with Dominion Energy strengthens our company and provides resources that will enable us to once again focus on our core operations and best serve our customers.\"\nIn a later email, Addison added:\n\"The acquisition of SCANA by Dominion Energy will stabilize a situation for all involved that was destabilized by the bankruptcy filing of Westinghouse .\"\nWatch Tom Farrell's full interview here: show chapters Dominion CEO bullish on latest deal despite slumping stock: 'We're investing for the long term in South Carolina' 18 Hours Ago | 07:26 Questions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-05T01:22:00.000+02:00", "crawled": "2018-01-05T01:23:29.008+02:00", "highlightTitle": ""}