{"organizations": [], "uuid": "b80f7486fd99a26b2341713c69fb3846b5fd3692", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-morning-call-european-shares-seen-mixed-at-the-open-idUSL8N1P50LP", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Morning call: European shares seen mixed at the open", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T08:18:00.000+02:00", "replies_count": 0, "uuid": "b80f7486fd99a26b2341713c69fb3846b5fd3692"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-morning-call-european-shares-seen-mixed-at-the-open-idUSL8N1P50LP", "ord_in_thread": 0, "title": "LIVE MARKETS-Morning call: European shares seen mixed at the open", "locations": [], "entities": {"persons": [{"name": "julien ponthus", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 6:18 AM / Updated 40 minutes ago LIVE MARKETS-Closing snapshot: Europe pulls back from highs Reuters Staff 20 Min Read \n* European stocks fall on bond sell-off * Defensives under pressure; banks rise * Gold jumps, U.S. stocks down Jan 10 (Reuters) - Welcome to the home for real-time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Julien Ponthus. Reach him on Messenger to share your thoughts on market moves: julien.ponthus.thomsonreuters.com@reuters.net CLOSING SNAPSHOT: EUROPE PULLS BACK FROM HIGHS (1708 GMT) Bond market jitters have weighed on the broader stock market today, leaving rate-sensitive banks, up 2.1 percent, as the only clear sectoral winner on the day, while bond proxies like utilities and real estate suffered the most. Overall that resulted in the STOXX 600 index falling just 0.4 percent after hitting fresh 2-1/2 year highs yesterday, while the bank-heavy FTSE MIB index managed to post a small gain. Here's your closing snapshot: (Danilo Masoni) **** EYES ON THE 2.6% LEVEL (1644 GMT) Nervousness on the bond market is the flavour of the day and equity investors are also closely watching U.S. Treasury yield charts for any further spike that could have meaningful repercussions on the stock market. \"The 2.6% level on the 10-Year is an important level which if surpassed could be detrimental for equities,\" says Stephane Ekolo, Global Equity Strategist at Avalon Capital Markets. The yield on 10-year U.S. Treasuries has spiked today to fresh 10-month highs, to within striking distance from the 2.6% level. \"US CPI data point (this Friday at 1:30pm UK) should be closely monitored as it may provide evidence confirming the uptrend on the 10yr yield,\" adds Ekolo. (Danilo Masoni) CHRISTMAS CHEER? A MIXED BAG FOR UK RETAILERS (1606 GMT) Retailers' Christmas updates so far have been a mixed bag, Liberum analysts say, with electronics, clothing and fashion the weakest segments, although most warned of tough conditions going into 2018. Company updates and industry data alike paint a picture of weak in-store footfall being offset by strong online sales. \"What we're seeing is the disparity between the 'new-world' retailers versus the more traditional, mid-market players where the consumer proposition and service elements are not compelling or agile enough, is widening,\" they note, adding that most retailers highlighted tough conditions in 2018. What to bet on? Strong online players and value propositions, according to them - Liberum's preferences include ASOS, B&M and Boohoo, while it remains concerned about M&S, which reports Christmas trading tomorrow. Today we've had some disappointing updates from Superdry and Moss Brothers sending their shares sliding 8.8 and 16 percent respectively. But overall valuations for the UK's general retail sector have ticked up recently as some Christmas updates beat gloomy expectations. (Helen Reid) HOW DOES IT FEEL BEING A CRYPTO? 267 PCT HIGH THANK YOU! (1545 GMT) Shares of Eastman Kodak Co are up 65 percent today and have surged 267 percent since the beginning of the year after the one-time leader in photography became the latest company to jump on the cryptocurrency bandwagon. There's really something magical (or not) about crypto : Riot Blockchain shares have tripled since October when the former biotechnology firm changed its name. Same thing for soft drinks maker Long Island Iced Tea which has more than doubled since it said it was shifting focus to blockchain technology and changed its name to Long Blockchain. Here's crypto magic for you in the form of Kodak shares: (Julien Ponthus) JPM AM STICKS WITH SLIGHT PRO-CYCLICAL TILT IN EUROPE (1510 GMT) Stephen Macklow-Smith, head of Europe equity strategy at JPMorgan Asset Management, tells us that the faster earnings growth he expects to see in Europe is probably going to be in the financial and cyclical area of the market. \"If we're seeing higher growth and higher inflation, then yields should be moving higher and yield curves should be steepening, and that's exactly what we are seeing,\" Macklow-Smith says. \"That's normally an environment in which financials and cyclicals outperform defensives and growth companies.\" Macklow-Smith adds that they are sticking with the \"modest pro-cyclical financial tilt to the portfolio\" they have had through most of the time since the yield curve in Europe started to steepen in the middle of 2016. (Kit Rees) \"NO I DON’T THINK THIS IS THE START\": PERMABEAR REBUFFS BOND BEAR CLAIMS (1502 GMT) With bond kings such as Bill Gross claiming the start of a bear market has begun, you would have thought that SocGen's Albert Edwards, who's been warning for quite some time now about the possibility of a market collapse, would join in. But no, far from it. \"The US 10y can rise all the way to 3% and we will still be in a long-term secular bull market\", he just told us. \"My own view is that we could visit 3% before yields crash lower in the next recession to -1% US10y (yes that is minus 1%)\", he added. Just to reassure you guys, he is still a permabear : \"Do I think the equity markets could collapse this year, just like in 1987? Yes I certainly do,\" he stressed. Here's the chart he used yesterday during a conference in London to make his case: (Julien Ponthus) IS THIS THE TURNING POINT FOR A SOUR BET ON EUROPEAN BANKS?(1440 GMT) One equity trade of 2017 that has so far failed to pay off was euro zone banks, driven by the expectation that recovering economies and an eventual pull-back in bond purchasing by the ECB would finally nudge interest rates higher, firing up bank profits. But a turning point could be ahead with bank stocks shooting up today as bond yields rise. Every market watcher is talking about the interest rate outlook today and how to position in equities in preparation - with many strongly bullish on bank stocks. \"Higher rates could be coming in our view, and given the moves can be vicious when they finally arrive it seems sensible to position for such ahead of the event,\" write Northern Trust Capital Markets analysts. They cite valuation discounts, dividend premiums, a peak in regulation as just a few of the reasons to buy bank stocks. \"Clearly banks should win in a rising rate environment; so too should commodities,\" the analysts add. Citi analysts also remain overweight financials, saying the sector will be driven higher by rising bond yields, solid earnings growth, as well as the potential for sector M&A. (Helen Reid) AFTERNOON UPDATE: EUROPEAN BANKS SOAR BUT STOXX STILL SOUR (1354 GMT) It's just past lunchtime and financials are the one bright spot in an otherwise negative European stockmarket. Over in the U.S. it looks like it's going to be a similar story with Wall St futures pointing to a muted start to trading following a report that China may slow its purchases of U.S. bonds. Here's your snapshot: (Kit Rees) SMALL IS BEAUTIFUL IN EUROPEAN EQUITIES (1340 GMT) JP Morgan strategists are pouring praise on the small- and mid-cap parts of the market which they see as safe bets in this late-cycle stock market where valuations are running high. Small and mid-caps in Europe continue to offer faster earnings growth than large-caps, at discounted valuations, and with less leveraged balance sheets, they note. JPM believes the next global recession will start in the U.S., and accordingly analyzes the performance of small and mid-caps around th", "external_links": [], "published": "2018-01-10T08:18:00.000+02:00", "crawled": "2018-01-10T08:32:36.016+02:00", "highlightTitle": ""}