{"organizations": [], "uuid": "55daa91a7ad47fdcb35bade46b6524e2c5757ba3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/07/104695833-GettyImages-813397506.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/06/amazon-echo-and-other-assistants-often-lower-smartphone-use.html", "country": "US", "domain_rank": 767, "title": "Amazon Echo and other assistants often lower smartphone use", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T02:00:00.000+02:00", "replies_count": 0, "uuid": "55daa91a7ad47fdcb35bade46b6524e2c5757ba3"}, "author": "Matt Rosoff", "url": "https://www.cnbc.com/2018/01/06/amazon-echo-and-other-assistants-often-lower-smartphone-use.html", "ord_in_thread": 0, "title": "Amazon Echo and other assistants often lower smartphone use", "locations": [], "entities": {"persons": [{"name": "todd haselton", "sentiment": "none"}], "locations": [{"name": "amazon echo", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "accenture", "sentiment": "none"}, {"name": "accenture and harris interactive", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Drew Angerer | Getty Images News | Getty \nTwo thirds of people who use digital voice assistants like the Amazon Echo or Google Home use their smartphones less often, according to a new survey published by tech consultancy Accenture . \nThe results suggest that the next big wave of consumer technology will be centered around these digital assistants, and may spell trouble for smartphone makers like Apple and Samsung— who lag behind Amazon and Google in this emerging space. \nThe online survey, conducted by Accenture and Harris Interactive, included 21,000 people from 19 countries and was conducted in October and November 2017. \nWithin the survey, nearly 2,300 people responded to a question asking whether they agreed with the following statement: \"Since I got my digital voice assistant device, I use my smartphone for fewer activities.\" \n66 percent of the respondents said they agreed or strongly agreed. Todd Haselton | CNBC The Amazon Echo Spot shows the weather \nWithin the sub-group who said they use their smartphones less, 64 percent said they use phones less frequently for entertainment services, while 58 percent said they do less online purchasing with their phones; and 56 percent do fewer searches from their phones. \nThe survey also projected that ownership of digital assistants will skyrocket in 2018, if people follow through on their expressed intent to buy one. \nIn the U.S., Accenture estimated 21 percent of the online population owns such a device today, and 37 percent will own one by the end of 2018. In India, the figure will go from 14 percent of the online population today to 39 percent by the end of 2018. Google The Google Home Max speaker \nOnline surveys can present a skewed representation of reality: Respondents sometimes self-select, and tend to be more interested in technology than average consumers. Nonetheless, the large size of the survey makes it noteworthy. \nSmartphones dominate consumer attention today, but smartphone companies are several years behind when it comes to home digital assistants. Amazon first released the Echo widely in the summer of 2015 (it was available in a limited trial to Amazon Prime subscribers even earlier), while the first Google Home came out in November 2016. \nApple had planned to release the HomePod, a home audio speaker with its Siri digital assistant built in, for the 2017 holiday season. However, in November the tech giant announced it would delay the release until early 2018. \nSamsung is reportedly aiming to release a smart speaker of its own in the first half of 2018. Matt Rosoff Editorial Director, Digital Related Securities", "external_links": [], "published": "2018-01-08T02:00:00.000+02:00", "crawled": "2018-01-08T02:25:12.000+02:00", "highlightTitle": ""}