{"organizations": [], "uuid": "5f86bc1ebf127e861473a82304d59bb8f15e33e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/aurora.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/08/nvidia-self-driving-car-partners-uber-baidu-aurora/", "country": "US", "domain_rank": 1196, "title": "CES 2018: Nvidia's Self-Driving Car Partners Uber, Baidu, Aurora | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.989, "site_type": "news", "published": "2018-01-08T03:58:00.000+02:00", "replies_count": 0, "uuid": "5f86bc1ebf127e861473a82304d59bb8f15e33e5"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/08/nvidia-self-driving-car-partners-uber-baidu-aurora/", "ord_in_thread": 0, "title": "CES 2018: Nvidia's Self-Driving Car Partners Uber, Baidu, Aurora | Fortune", "locations": [], "entities": {"persons": [{"name": "xavier", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "chris urmson", "sentiment": "none"}, {"name": "kirsten korosec", "sentiment": "none"}, {"name": "jensen huang", "sentiment": "none"}], "locations": [{"name": "aurora", "sentiment": "none"}, {"name": "baidu", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "volkswagen", "sentiment": "negative"}, {"name": "nvidia", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "aurora innovation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec 1:58 AM EST \nNvidia (nvda) just gave us another clue about Aurora Innovation, a one-year-old self-driving vehicle startup founded by autonomous vehicle veterans from Google , Tesla, and Uber. \nNvidia CEO Jensen Huang revealed Sunday during his keynote at CES 2018, the annual tech trade show in Las Vegas, that Aurora is going to be using Nvidia’s new Xavier processor as one of the building blocks of its self-driving vehicle system. The Xavier processor, is essentially the processing foundation that Aurora will use to build on. \n“Nvidia Drive Xavier is a key element of Aurora’s computer, delivering the performance needed to power our self-driving system, said Aurora CEO Chris Urmson. \nAurora is just one of many companies lining up to work with Nvidia. More than 320 companies are working with the company in their pursuit to develop self-driving technology, Huang said Sunday. Nvidia revealed for the first time it’s working with Uber (uber) , Baidu (bidu) , and Volkswagen (vlkay) . \nNvidia is known as a graphics processing chipmaker. But the company has been diversifying new technologies, notably artificial intelligence and self-driving cars. Xavier is a complete system-on-a-chip processor that’s essentially an AI brain for self-driving cars. Nvidia’s Xavier processor is a brand-new architecture that Nvidia calls Volta, which has the speedier and more robust structure needed to unlock the power of artificial intelligence. \nSamples of the Xavier processor, which can deliver 30 trillion deep learning operations per second and only use 30 watts of power, will be delivered to customers this quarter. \nAurora first revealed its business model to Fortune back in April. But the company operated largely in secret until last week when it announced partnerships with Volkswagen Group and Hyundai. VW Group plans to launch commercial fleets of self-driving electric vehicles in two to five cities beginning in 2021. These “mobility-as-a-service” fleets—a system VW Group is currently developing—will initially include smaller self-driving vehicles that people can hail as well as larger vans. \nAurora was founded by Sterling Anderson, a former director of the semi-autonomous Autopilot program at Tesla; Drew Bagnell, who headed the autonomy and perception team at Uber’s Advanced Technologies Center; and Urmson, the former head of Google’s self-driving project. Urmson left Google before the self-driving project changed its name to Waymo and spun out to become a business under Google’s parent, Alphabet. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-08T03:58:00.000+02:00", "crawled": "2018-01-08T09:02:06.000+02:00", "highlightTitle": ""}