{"organizations": [], "uuid": "7e8530316000a9368a7be7d65793a3f171ebdb1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/column-russell-ironore-china/rpt-column-iron-ore-defies-bearish-factors-as-china-imports-hold-up-russell-idUSL4N1PI2K1", "country": "US", "domain_rank": 408, "title": "RPT-COLUMN-Iron ore defies bearish factors as China imports hold up: Russell", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.964, "site_type": "news", "published": "2018-01-23T20:02:00.000+02:00", "replies_count": 0, "uuid": "7e8530316000a9368a7be7d65793a3f171ebdb1c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/column-russell-ironore-china/rpt-column-iron-ore-defies-bearish-factors-as-china-imports-hold-up-russell-idUSL4N1PI2K1", "ord_in_thread": 0, "title": "RPT-COLUMN-Iron ore defies bearish factors as China imports hold up: Russell", "locations": [], "entities": {"persons": [{"name": "russell", "sentiment": "negative"}, {"name": "clyde russell", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "launceston", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "singapore exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats item issued earlier. The opinions expressed here are those of the author, a columnist for Reuters.)\n* GRAPHIC: China seaborne iron ore imports vs SGX price: reut.rs/2DWLToF\nBy Clyde Russell\nLAUNCESTON, Australia, Jan 23 (Reuters) - Spot iron ore prices in Asia appear to be poised on the precipice of a steep decline as a myriad of factors suggest an imminent correction.\nExcept for one factor, which is probably enough to hold them up, at least for a little longer.\nOn the bearish side, port inventories SH-TOT-INV in top importer China are at a record high of 154.3 million tonnes, steel prices are starting to weaken as China’s vast property sector shows signs of easing growth, and supply from major exporters Australia and Brazil is expected to increase.\nIn theory these factors should be more than enough to start a slide in spot prices, but so far this hasn’t happened.\nIron ore futures traded on the Singapore Exchange (SGX), which are based on the spot price for China cargoes, ended at $76.46 a tonne on Monday, up 7.3 percent since the end of last year and 31 percent since the 2017 low of $58.53 on Nov. 1.\nChina’s domestic iron ore benchmark futures ended Monday at 543 yuan ($84.84) a tonne, up 2.5 percent since the end of last year and 22.6 percent from their 2017 low in late October.\nWhile both contracts are off highs reached earlier in January, the decline so far has been modest, and certainly not enough to claim the current uptrend has been reversed.\nThe strongest reason why iron ore prices are holding up well is that China’s imports have remained robust.\nChina imported 1.07 billion tonnes of the steel-making ingredient in 2017, up 5 percent on the prior year, according to customs figures.\nDecember’s imports looked soft at 84.14 million tonnes, but vessel-tracking data compiled by Thomson Reuters Supply Chain and Commodity Forecasts suggest a strong January is in the offing.\nJANUARY REBOUND? Imports from the seaborne market are estimated at 106 million tonnes, a figure which if achieved would by a monthly record.\nThere are some caveats to that number, with the main risk being the large number of ship arrivals forecast for the last two days of the month.\nThe data has been filtered to show only vessels that have already discharged cargoes, are currently discharging or awaiting discharge at a Chinese port or are underway and expected to reach China by the end of the month.\nThe detailed breakdown of the ships shows 36 vessels are due to arrive at Chinese ports on either Jan. 30 or Jan. 31, meaning the risk is that those cargoes will only be offloaded in February, and thus miss being counted in the official figures for January.\nWhile it’s likely that the vessel-tracking data is currently overstating the strength of imports in January, it’s unlikely to be doing so by a wide margin, and the takeaway from the numbers is that China’s appetite for imported iron ore remains strong.\nThe SGX futures curve isn’t currently suggesting a rapid retreat in prices, with the April contract at $72.20 a tonne and December’s at $68.43.\nThis is in stark contrast to the forecast from the Australian government, which expects the iron ore price to drop 20 percent in 2018 from 2017 to an average $51.50 a tonne.\nRising supply and ongoing rationalisation of China’s steel sector were the main reasons for the bearish forecast, released on Jan. 8 by the Department of Industry, Innovation and Science.\nIf the department’s view is correct, this implies iron ore prices are going to have a fairly dramatic reversal at some stage this year.\nIt will likely take an easing in imports to focus the market on the downside risks to iron ore prices, given the raft of bearish factors currently visible haven’t ended the rally.\nEditing by Richard Pullin\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://reut.rs/2DWLToF"], "published": "2018-01-23T20:02:00.000+02:00", "crawled": "2018-01-24T15:22:48.000+02:00", "highlightTitle": ""}