{"organizations": [], "uuid": "debf68f9310d5b77e445f41a9c5491c86c50d38a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-western-digital-announces-proposed-offerings-of-2-point-3-billion-of-senior-notes-due-2026-and-1-point-0-billion-of.html", "country": "US", "domain_rank": 767, "title": "Western Digital Announces Proposed Offerings of $2.3 Billion of Senior Notes Due 2026 and $1.0 Billion of Convertible Senior Notes Due 2024 and up to $500M Share Repurchase", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:34:00.000+02:00", "replies_count": 0, "uuid": "debf68f9310d5b77e445f41a9c5491c86c50d38a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-western-digital-announces-proposed-offerings-of-2-point-3-billion-of-senior-notes-due-2026-and-1-point-0-billion-of.html", "ord_in_thread": 0, "title": "Western Digital Announces Proposed Offerings of $2.3 Billion of Senior Notes Due 2026 and $1.0 Billion of Convertible Senior Notes Due 2024 and up to $500M Share Repurchase", "locations": [], "entities": {"persons": [], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "western digital", "sentiment": "neutral"}, {"name": "share repurchase western digital", "sentiment": "neutral"}, {"name": "western digital corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Western Digital to Retire Existing 10.500% Senior Unsecured Notes Due 2024 and 7.375% Senior Secured Notes Due 2023 Subject to Successful Execution of Transactions\nInitiatives to Enhance Capital Structure\nSAN JOSE, Calif.--(BUSINESS WIRE)-- Western Digital Corporation (NASDAQ: WDC) (“Western Digital” or the “company”) today announced concurrent proposed offerings of $2.3 billion aggregate principal amount of senior notes due 2026 (the “2026 notes”) and $1.0 billion aggregate principal amount of convertible senior notes due 2024 (the “2024 convertible notes” and, together with the 2026 notes, the “notes”), in each case subject to market and other conditions as further described below. The notes will be issued by Western Digital, and guaranteed, jointly and severally on a senior basis, by certain of Western Digital’s subsidiaries.\nIn connection with the offerings of the 2026 notes (the “2026 notes offering”) and the 2024 convertible notes (the “2024 convertible notes offering” and, together with the 2026 notes offering, the “offerings”), Western Digital expects to obtain a new $5.022 billion Term Loan A-1 facility maturing 2023, reflecting a $1.0 billion increase in the size of the Term Loan A. The proceeds of this new Term Loan A-1 facility would be used to settle Western Digital’s existing $4.022 billion Term Loan A maturing in 2021. In connection with the offerings and the Term Loan A replacement, Western Digital also expects to extend the maturity of its existing revolving credit facility under its senior credit facilities by approximately two years to a maturity date of 2023, and to seek amendments to its senior credit facilities to, among other things, provide for more covenant flexibility, a decrease in the interest rate applicable to the new Term Loan A-1 facility and/or revolving credit facility and a release of the security and guarantees under certain circumstances. In the event the full amount of the 2024 convertible notes offering is not completed, Western Digital may further increase the size of the new Term Loan A-1 facility by up to an additional $1.0 billion.\nConcurrently with the offerings, the company also expects to commence a cash tender (the “tender offer”) to purchase any and all of its currently outstanding 10.500% senior unsecured notes due 2024 (the “existing 2024 unsecured notes”).\nWestern Digital expects to offer the 2026 notes in a public offering (the “2026 notes offering”). The company intends to use the net proceeds of the 2026 notes offering, together with available cash on hand, to fund the tender offer, and if the tender offer is not consummated or if the company purchases less than all of the currently outstanding existing 2024 unsecured notes in the tender offer, to fund the redemption of any existing 2024 unsecured notes that remain outstanding, in each case, including all accrued interest, related premiums, fees and expenses. BofA Merrill Lynch and J.P. Morgan Securities LLC are acting as lead book-running managers and RBC Capital Markets, Mizuho Securities and Wells Fargo Securities are acting as book-running managers for the 2026 notes offering.\nThe company intends to offer the 2024 convertible notes in a private offering to only qualified institutional investors (“QIBs”) in accordance with Rule 144A under the Securities Act of 1933, as amended (the “Securities Act”). In addition, the company expects to grant the initial purchasers a 30-day option to purchase up to an additional $100 million aggregate principal amount of 2024 convertible notes. The company intends to use the net proceeds of the 2024 convertible notes offering, together with the net proceeds from the new Term Loan A-1 facility and available cash on hand, to redeem all of its currently outstanding 7.375% senior secured notes due 2023 (the “2023 secured notes”), including all accrued interest, related premiums, fees and expenses. The 2024 convertible notes will be convertible into cash and/or shares of Western Digital’s common stock or a combination thereof at its election. The interest rate, conversion price and other terms of the 2024 convertible notes are to be determined.\nThe company expects to repurchase shares of its common stock concurrently with the 2024 convertible notes offering in privately negotiated transactions as well as subsequently through additional share repurchases that will occur after the completion of the 2024 convertible notes offering with available cash on hand. The aggregate amount of these stock repurchases could be up to $500 million.\nThe 2024 convertible notes, the common stock, if any, deliverable upon conversion of the 2024 convertible notes and the related guarantees have not been and will not be registered under the Securities Act or the securities laws of any other jurisdiction. They may not be offered or sold in the United States or to, or for the benefit of, U.S. persons absent registration under, or an applicable exemption from, the registration requirements of the Securities Act.\nThe 2026 notes and 2024 convertible notes offerings are being conducted as separate offerings. Neither offering is contingent upon the other.\nUpon successful completion of the transactions described above, we expect to reduce our total debt outstanding by up to approximately $1 billion. We expect that our available cash on hand will decrease by approximately $2.4 billion after giving effect to the transactions described above.\nThe company has filed a registration statement (including a prospectus) with the Securities and Exchange Commission (the “SEC”) for the 2026 notes offering. Before you invest, you should read the prospectus in the registration statement and other documents the company has filed with the SEC for more complete information about the company and the offerings. You may obtain these documents for free by visiting EDGAR on the SEC website at www.sec.gov or from BofA Merrill Lynch, NC1-004-03-43, 200 North College Street, 3rd floor, Charlotte, NC 28255-0001, Attn: Prospectus Department, or by email at dg.prospectus_requests@baml.com ; or from J.P. Morgan Securities LLC via Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, or by telephone at (866) 803-9204. This press release does not constitute an offer to sell or a solicitation of an offer to buy the notes or any other security, nor will there be any sale of the notes or any other security in any state or jurisdiction in which such an offer, solicitation or sale is not permitted. Any offer or sale will be made only by means of a prospectus or an offering memorandum, as applicable, and a free writing prospectus which has or will be filed with the SEC, as applicable.\nAbout Western Digital\nWestern Digital creates environments for data to thrive. The company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Western Digital data-centric solutions are marketed under the G-Technology™, HGST, SanDisk ® , Tegile™, Upthere™ and WD ® brands.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements concerning proposed offerings of the notes. These forward-looking statements are based on management’s current expectations and are subject to risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the forward-looking statements, including: volatility in global economic conditions; uncertainties with respect to the company’s business ventures with Toshiba; business conditions and growth in the storage ecosystem; impact of competitive products and pricing; market acceptance and cost of commodity materials and specialized product components; actions by competitors; unexpected advances in competing technologies; the development and introduction of products based on new technologies and expansion into new data storage markets; risks associated with acquisitions, mergers and joint ventures; difficulties or delays in manufacturing; impacts of new tax legislation; and other risks and uncertainties listed in the company's filings with the SEC, including the company’s Form 10-Q filed with the SEC on Nov. 7, 2017, to which your attention is directed. You should not place undue reliance on these forward-looking statements, which speak only as of the date hereof, and the company undertakes no obligation to update these forward-looking statements to reflect new events or events.\nWestern Digital, the Western Digital logo, G-Technology, HGST, SanDisk, Tegile, Upthere and WD are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the U.S. and/or other countries.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129006201/en/\nCompany contacts:\nWestern Digital Corporation\nInvestor Contact:\nBob Blair\n949.672.7834\nrobert.blair@wdc.com\nor\nMedia Contact:\nJim Pascoe\n408.717.6999\njim.pascoe@wdc.com\nSource: Western Digital Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51750469&newsitemid=20180129006201&lan=en-US&anchor=www.sec.gov&index=1&md5=767365d4d3119d58e8ba3a7d7897e574", "http://www.businesswire.com/news/home/20180129006201/en/"], "published": "2018-01-30T00:34:00.000+02:00", "crawled": "2018-01-30T03:55:24.003+02:00", "highlightTitle": ""}