{"organizations": [], "uuid": "66f93e9d394e57d15e2a1ea16f108bf3cc5f7311", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-consumer-payday/u-s-consumer-finance-bureau-says-intends-to-reconsider-payday-rule-idUSKBN1F52NV", "country": "US", "domain_rank": 408, "title": "U.S. consumer finance bureau says intends to reconsider payday rule", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.966, "site_type": "news", "published": "2018-01-17T04:56:00.000+02:00", "replies_count": 0, "uuid": "66f93e9d394e57d15e2a1ea16f108bf3cc5f7311"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-consumer-payday/u-s-consumer-finance-bureau-says-intends-to-reconsider-payday-rule-idUSKBN1F52NV", "ord_in_thread": 0, "title": "U.S. consumer finance bureau says intends to reconsider payday rule", "locations": [], "entities": {"persons": [{"name": "lisa lambert", "sentiment": "none"}, {"name": "makini brice", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. consumer financial protection bureau", "sentiment": "negative"}, {"name": "bureau", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The U.S. Consumer Financial Protection Bureau said on Tuesday that it intends to reconsider a recent rule that would significantly curb payday lending.\nThe rule, finalized in October under a President Barack Obama appointee and set to begin taking effect this year, would require lenders to determine if borrowers can repay debts and cap the number of loans that lenders could make to a borrower.\nThe decision to revisit the rule, which applies to small-dollar advances typically repaid on the borrower’s next payday, could mark the beginning of the most significant policy shifts since the Trump administration took control of the agency at the end of November.\nMick Mulvaney, the agency’s acting director and President Donald Trump’s budget director, had previously said he supported efforts by the U.S. Congress to undo the rule and was exploring his options for revisiting the rule as it takes effect.\n“The Bureau intends to engage in a rulemaking process so that the Bureau may reconsider the Payday Rule,” the CFPB said in a statement, noting that while the rule officially took effect Tuesday, lenders have until August 2019 to comply with most of its provisions.\nThe bureau also said it would consider granting waivers to any company that is beginning to prepare for one of the rule’s first requirements, which takes effect in April. That part of the rule requires companies that examine a borrower’s financial background on behalf of lenders to register with the regulator.\nThe CFPB’s payday rules marked one of the last major regulatory projects under the agency’s original director, Richard Cordray, an Obama appointee who resigned in November. The agency had worked on the rules for five years.\nIt was one of the agency’s more contentious projects. Consumer advocates and Democratic supporters of the CFPB argued strict rules policing payday lenders were necessary. The CFPB under Cordray found low-income borrowers ended up trapped in a cycle of high-interest loans, winding up with the equivalent of a 300 percent interest rate.\nBut critics said that the rule would devastate an industry serving 30 million customers, many of whom lack access to more traditional banking products. The CFPB estimated its rule would lower the industry’s revenue by two-thirds.\nEfforts are under way to repeal the rule in Congress, but it is unclear if a resolution to do so can garner sufficient support to pass. The payday lending rule was also expected to face legal challenges from companies impacted by it.\nReporting by Makini Brice and Pete Schroeder; Editing by Lisa Lambert and Cynthia Osterman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T04:56:00.000+02:00", "crawled": "2018-01-16T23:00:30.020+02:00", "highlightTitle": ""}