{"organizations": [], "uuid": "d412985d79026db026ea715f306a34f95c01385b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-indigo-natural-resources-llc-announces-confidential-submission-of-draft-registration-statement-for-proposed-initial-public.html", "country": "US", "domain_rank": 767, "title": "Indigo Natural Resources LLC Announces Confidential Submission of Draft Registration Statement for Proposed Initial Public Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:45:00.000+02:00", "replies_count": 0, "uuid": "d412985d79026db026ea715f306a34f95c01385b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-indigo-natural-resources-llc-announces-confidential-submission-of-draft-registration-statement-for-proposed-initial-public.html", "ord_in_thread": 0, "title": "Indigo Natural Resources LLC Announces Confidential Submission of Draft Registration Statement for Proposed Initial Public Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "indigo natural resources llc", "sentiment": "negative"}, {"name": "sec", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 29, 2018 /PRNewswire/ -- Indigo Natural Resources LLC (\"Indigo\") announced today that it has previously confidentially submitted a draft registration statement on Form S-1 to the U.S. Securities and Exchange Commission (the \"SEC\") relating to its proposed initial public offering. The size and price range for the proposed offering has not yet been determined. The offering is expected to commence when market conditions allow, subject to, among other things, completion of the SEC review process. There is no assurance that the initial public offering will be consummated.\nThis news release shall not constitute an offer to sell or the solicitation of an offer to buy securities. Any offers, solicitations or offers to buy, or any sales of securities will be made in accordance with the registration requirements of the Securities Act of 1933, as amended (\"Securities Act\"). This announcement is being issued in accordance with Rule 135 under the Securities Act.\nForward-Looking Statements\nThe information in this news release includes \"forward-looking statements.\" All statements, other than statements of historical fact included in this news release, regarding our strategy, future operations, financial position, estimated revenue and losses, projected costs, prospects, plans and objectives of management are forward-looking statements. When used in this news release, the words \"could,\" \"believe,\" \"anticipate,\" \"intend,\" \"estimate,\" \"expect,\" \"project\" and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain such identifying words. These forward-looking statements are based on our current expectations and assumptions about future events and are based on currently available information as to the outcome and timing of future events. These forward-looking statements are based on management's current belief, based on currently available information, as to the outcome and timing of future events. We caution you that these forward-looking statements are subject to all of the risks and uncertainties, most of which are difficult to predict and many of which are beyond our control, incident to the exploration for and development, production and sale of natural gas. These risks include, but are not limited to, commodity price volatility, lack of availability of drilling and production equipment and services, environmental risks, drilling and other operating risks, regulatory changes, the uncertainty inherent in estimating natural gas reserves and in projecting future rates of production, cash flow and access to capital, the timing of development expenditures, and the other risks.\nView original content with multimedia: http://www.prnewswire.com/news-releases/indigo-natural-resources-llc-announces-confidential-submission-of-draft-registration-statement-for-proposed-initial-public-offering-300589404.html\nSOURCE Indigo Natural Resources LLC", "external_links": ["http://www.prnewswire.com/news-releases/indigo-natural-resources-llc-announces-confidential-submission-of-draft-registration-statement-for-proposed-initial-public-offering-300589404.html"], "published": "2018-01-29T15:45:00.000+02:00", "crawled": "2018-01-29T16:38:21.005+02:00", "highlightTitle": ""}