{"organizations": [], "uuid": "ed7e1c92a34f3b3df090f9d45e47422296bdbdc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/09/brb-10-01-17-opioids.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/opioid-epidemic-china-us-postal-service/", "country": "US", "domain_rank": 1196, "title": "Opioid Epidemic: The U.S. Postal Service's Unwitting Role | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "ed7e1c92a34f3b3df090f9d45e47422296bdbdc7"}, "author": "Chris Morris", "url": "http://fortune.com/2018/01/25/opioid-epidemic-china-us-postal-service/", "ord_in_thread": 0, "title": "Opioid Epidemic: The U.S. Postal Service's Unwitting Role | Fortune", "locations": [], "entities": {"persons": [{"name": "chris morris", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "bitcoin", "sentiment": "none"}], "organizations": [{"name": "u.s. postal service", "sentiment": "negative"}, {"name": "paypal", "sentiment": "none"}, {"name": "senate homeland security", "sentiment": "none"}, {"name": "u.s. customs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Chris Morris January 25, 2018 \nThere’s little argument that opioids are overprescribed in the United States, but it can still be challenging for some Americans to get the medication after their prescriptions run out, especially with increased scrutiny of late. \nThat has opened a gray market in China , where users can easily buy drugs like fentanyl online without a prescription and have them delivered via the U.S. Postal Service. \nInvestigators for the Senate Homeland Security subcommittee have traced transactions between Chinese sellers and American buyers and found sales that were responsible for at least seven overdoses in the past year. \nOver 500 transactions went to 43 states, with users spending some $230,000. \nThe majority of the Chinese dealers preferred payments in Bitcoin, though many accepted credit cards, PayPal, and other more traditional payment methods. The drugs were sent through the local postal system, then via U.S. Mail rather than couriers, which were more likely to be intercepted by U.S. Customs agents. \nThe subcommittee’s report says the postal service is failing to “recognize and prepare for” packages that contain illegal drugs, including fentanyl. \n“We now know the depth to which drug traffickers exploit our mail system to ship fentanyl and other synthetic drugs into the United States,” said subcommittee Chairman Rob Portman. “The federal government can, and must, act to shore up our defense against this deadly drug and help save lives.” \nPortman did not seem to be blaming the USPS, but rather saying the agency was unequipped to check for illegal substances being shipped, given the volume of mail it handles each day. \nThe postal service, in a statement , said it is “working aggressively” to stem the flow of illegal drugs, but noted it is restricted in some ways its competitors are not. The USPS also has a very clear policy stating that if a controlled substance is unlawful (as these opioids are), then the mailing of them is also unlawful. \n“The Postal Service is very different from commercial operators like UPS and FedEx , because they have direct relationships with their international customers and can require them to provide advance electronic data (AED) before accepting their packages,” it said. “The Postal Service receives international packages from foreign posts, and must therefore secure cooperation from them, including through bilateral and multilateral negotiations, to obtain AED. In the last three years, we have gone from receiving almost no AED on inbound shipments to achieving current levels at approximately 40%.” \nAED provides information such as the name and address of the shipper and recipient, making it easier to flag mailings to and from persons of interest. \nPortman is proposing a bill that would require foreign postal systems to send AED before packages reach the U.S. That, he says, would allow agents to be more aware of which incoming parcels might contain narcotics. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T02:00:00.000+02:00", "crawled": "2018-01-26T03:01:33.010+02:00", "highlightTitle": ""}