{"organizations": [], "uuid": "4c30ae0f0d1dc0d07f587613dd4e151076d95fdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-black-cactus-global-appoints-anders-forsberg-to-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Black Cactus Global Appoints Anders Forsberg To Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:00:00.000+02:00", "replies_count": 0, "uuid": "4c30ae0f0d1dc0d07f587613dd4e151076d95fdf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-black-cactus-global-appoints-anders-forsberg-to-board-of-directors.html", "ord_in_thread": 0, "title": "Black Cactus Global Appoints Anders Forsberg To Board of Directors", "locations": [], "entities": {"persons": [{"name": "wang jianlin", "sentiment": "none"}, {"name": "forsberg", "sentiment": "none"}, {"name": "wanda", "sentiment": "none"}, {"name": "anders nils-thore forsberg", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "gatcoin", "sentiment": "none"}], "organizations": [{"name": "black cactus global inc.", "sentiment": "negative"}, {"name": "blockchain", "sentiment": "none"}, {"name": "company’s board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 17, 2018 (GLOBE NEWSWIRE) -- Black Cactus Global Inc., (OTC Markets:BLGI) (the “Black Cactus” or the “Company”) announces the appointment of Anders Nils-Thore Forsberg has joined the Company’s Board of Directors. Anders Nils-Thore Forsberg is a veteran entrepreneur, international business manager and seasoned investor. During his decades of successful business experience Mr. Forsberg has forged successful and lasting partnerships with some of the most influential political and business groups in China and throughout Asia.\nHe has been a founding partner in several Asian based venture capital companies including Gatcoin, a Blockchain based company providing digital wallet and exchange service for a broad array of merchant award points. Mr. Forsberg served for more than ten years as a senior executive for Chinese real estate giant, Wanda, the world’s biggest private property developer that is led by China’s richest individual, Wang Jianlin.\nOver the last 14 years Mr. Forsberg has been serving in senior advisory and executive positions for a wide variety of companies including Green Stream China, which is focused on the renewable energy market; Super Dynasty Group, a financial services company; Greene Light Stage Plc, a commercial production firm in the UK; and Schulze Global Investments Ltd., which manages investment capital for Asian and African ventures.\nAnders has gained career recognition as a skilful negotiator within China, having brokered and successfully closed M&A deals globally of total market value well exceeding 5 Billion USD.\nLawrence Cummins, CEO of the Company, stated, “We are excited to welcome Anders to the Company. His knowledge and skill set will be of tremendous value as we expand in the European and Asian marketspace.”\nAbout the Company\nBlack Cactus Global is a technology development company with a focus on Blockchain, machine learning, cryptocurrency, and the Internet of Things. We partner with large corporations and specialised groups on global development and consulting projects in our key development areas of Fintech, digital media, financial services, cyber security, and healthcare.\nOur mission is to pioneer the application of Blockchain and overlapping technologies to protect IP and the security of data and financial transactions.\nFor further information please visit our website at: www.blackcactusglobal.com .\nInvestor Relations:\nCompany Contact: Louis Silver\nTel: 1-610-710-1303 • Email: lsilver35@verizon.net ; louis@blackcactusglobal.com\nSafe Harbor Statements\nCertain information contained in this news release constitutes “forward-looking statements” as such term is used in applicable United States and Canadian laws. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as “expects” or “does not expect”, “is expected”, “anticipates” or “does not anticipate”, “plans”, “estimates”, “intends” or “believes”, or that certain actions, events or results “may”, “could”, “would”, “might” or “will be taken”, “occur”, or “be achieved”. Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made, and are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements. Many of these factors are beyond the Company’s ability to control or predict. Important factors that may cause actual results to differ materially and that could impact the Company and the statements contained in this news release can be found in the Company’s filings with the SEC. Such risks and other factors include, among others, the ability to locate and acquire suitable interests in alternative medicine manufacturing operations on terms acceptable to the Company, the availability of financing on acceptable terms, accidents, labor disputes, acts of God and other risks of the alternative medicine industry including, without limitation, delays in obtaining governmental approvals or permits, title disputes or claims limitations on insurance coverage. The Company believes that the expectations reflected in the forward-looking statements included in this news release are reasonable; however, no assurance can be given that these expectations will prove to be correct, and such forward-looking statements should not be unduly relied upon. The Company assumes no obligation to update or supplement any forward-looking statements whether as a result of new information, future events or otherwise.\nSource: Black Cactus Global", "external_links": ["https://www.globenewswire.com/Tracker?data=3Ze-IE1-5GW_a_R8cL55beK6FTbm9-cnMLAxjvDBkgc3XmxvH3LWUqqjAqSLbATD-v4qGLG5zZA4PDViMlYBkjuZK6CVXGpIJ0otut0edQ4=", "https://www.globenewswire.com/Tracker?data=7alDa9ixNzeCW3R70RY4MKmI_agRKU15AHhUM495067fY184Y044Q4J_q9rpWBisFJM8pIB50U8hLSytdAYpVPOP7eqrxfVy6oudYu8ovKA=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f5dc352b-b387-4321-9ed2-8809db10066d"], "published": "2018-01-17T16:00:00.000+02:00", "crawled": "2018-01-17T16:49:14.005+02:00", "highlightTitle": ""}