{"organizations": [], "uuid": "0abc657e03c62ff241404bf9bdbac891b21730c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-life-sciences-pioneer-stanley-lapidus-joins-atlas-genetics-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Life Sciences Pioneer Stanley Lapidus Joins Atlas Genetics Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.975, "site_type": "news", "published": "2018-01-05T16:30:00.000+02:00", "replies_count": 0, "uuid": "0abc657e03c62ff241404bf9bdbac891b21730c8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-life-sciences-pioneer-stanley-lapidus-joins-atlas-genetics-board-of-directors.html", "ord_in_thread": 0, "title": "Life Sciences Pioneer Stanley Lapidus Joins Atlas Genetics Board of Directors", "locations": [], "entities": {"persons": [{"name": "stan", "sentiment": "none"}, {"name": "stanley lapidus", "sentiment": "none"}, {"name": "lapidus", "sentiment": "none"}, {"name": "jeff luber", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "atlas", "sentiment": "none"}, {"name": "exas", "sentiment": "none"}], "organizations": [{"name": "life sciences pioneer stanley lapidus joins atlas genetics board of directors", "sentiment": "negative"}, {"name": "atlas genetics", "sentiment": "negative"}, {"name": "hologic corporation", "sentiment": "none"}, {"name": "cytyc corp.", "sentiment": "none"}, {"name": "exact sciences corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass. & BATH, England--(BUSINESS WIRE)-- Atlas Genetics, a rapid, near-patient and point-of-care (POC) testing company, today announced that it has appointed Stanley Lapidus to the role of independent board member on its Board of Directors. Lapidus has more than 30 years’ experience in the medical diagnostics industry as a founder, CEO and board member at companies that have dramatically impacted the diagnostics landscape, including his founding of EXACT Sciences Corp. (NASDAQ:EXAS) and, prior to that, Cytyc Corp., which was sold to Hologic Corporation in 2007.\n“We are honored to have Stan, a true luminary in biotechnology, join Atlas Genetics as its newest board member,” said Jeff Luber, President and CEO of Atlas. “He comes to Atlas at a pivotal time as we transition from clinical validation of our proprietary platform in POC testing to becoming a commercially disruptive force globally. As one of the most successful leaders, innovators and entrepreneurs in the diagnostics industry, Stan has provided strategic insights to emerging healthcare companies through similar commercial arcs. His counsel will be invaluable as Atlas capitalizes on a quickly changing healthcare landscape where rapid testing and consumer convenience become increasingly paramount. We view his association with Atlas as another indication of the opportunity here and the great things to come.”\nLapidus founded EXACT Sciences and served as its CEO and Chairman until 2006. Since commercial introduction of the company’s Cologuard test for non-invasive, early detection of colorectal cancer, EXACT has been the most rapidly growing company in the history of the diagnostics industry. Prior to EXACT Sciences, Lapidus was founder and CEO of Cytyc Corp prior to its acquisition by Hologic for $6.2 billion. He is the principal inventor of Cytyc’s ThinPrep Pap test, which revolutionized screening for cervical cancer and now accounts for approximately 80% of the world market for cervical cancer screening. Lapidus was also the founder and CEO of SynapDx and Helicos Biosciences.\nCurrently, Lapidus serves as a director to a number of public and private medical device and diagnostics companies, and he was an instructor at MIT from 2001 to 2017.\nLapidus is a seasoned innovator holding 36 U.S. patents. He was elected as a Fellow of the American Institute of Medical and Biological Engineering in 2013 for his work on the early detection of cancer.\nLapidus graduated from Cooper Union in New York City with a BS degree in electrical engineering.\nAbout Atlas Genetics\nAtlas Genetics is creating a new category of in vitro diagnostics focused on decentralized, near-patient and point-of-care (POC) testing for everyone. With routine testing rapidly moving from the “hub” to the “spokes,” Atlas’s io® platform is poised to benefit from this growing trend in decentralized testing. The company’s proprietary technology platform positions Atlas in the vanguard of the rapidly evolving and increasingly patient-directed landscape of consumer diagnostics, where convenience, rapid “test and treat,” and portability of platform are becoming critical to success. Atlas aims to meet patients where they are and improve patient outcomes by arming healthcare professionals with a simple-to-use, rapid and cost-effective solution for on-demand diagnosis of infectious diseases. Rapid turnaround times, high accuracy and low cost are hallmarks of the company’s broad platform for a broad range of infectious diseases. The io® platform offers a sample-to-answer time of 30 minutes, or less, making it possible to carry out infectious disease tests in primary care clinics and physicians’ offices anywhere.\nAtlas Genetics’ investors include Novartis Venture Fund, Consort Medical, Wondfo Biotech, LSP, BB Biotech, Johnson & Johnson Innovation, RMI Investments and Southwest Ventures Fund.\nFor further information visit www.atlasgenetics.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005073/en/\nAtlas Genetics\nMarc Jones, 1-646-847-8573\nmedia@atlasgenetics.com\nSource: Atlas Genetics", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.atlasgenetics.com&esheet=51738342&newsitemid=20180105005073&lan=en-US&anchor=www.atlasgenetics.com&index=1&md5=f58b84eb7afdef7222dbbdbcc273a39e", "http://www.businesswire.com/news/home/20180105005073/en/"], "published": "2018-01-05T16:30:00.000+02:00", "crawled": "2018-01-05T18:05:56.003+02:00", "highlightTitle": ""}