{"organizations": [], "uuid": "7cd76e8f9a294057e251ef14534d6535cfd2ea9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-global-slavery-business-funding/big-brands-from-disney-to-walmart-back-tech-startups-to-tackle-supply-chain-slavery-idUSKBN1FJ22U", "country": "US", "domain_rank": 408, "title": "Big brands from Disney to Walmart back tech startups to tackle supply chain slavery", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:57:00.000+02:00", "replies_count": 0, "uuid": "7cd76e8f9a294057e251ef14534d6535cfd2ea9d"}, "author": "", "url": "https://www.reuters.com/article/us-global-slavery-business-funding/big-brands-from-disney-to-walmart-back-tech-startups-to-tackle-supply-chain-slavery-idUSKBN1FJ22U", "ord_in_thread": 0, "title": "Big brands from Disney to Walmart back tech startups to tackle supply chain slavery", "locations": [], "entities": {"persons": [{"name": "umberto bacchi", "sentiment": "none"}], "locations": [], "organizations": [{"name": "disney", "sentiment": "negative"}, {"name": "walmart", "sentiment": "negative"}, {"name": "walmart foundation", "sentiment": "none"}, {"name": "humanity united", "sentiment": "none"}, {"name": "min read  london", "sentiment": "none"}, {"name": "working capital", "sentiment": "none"}, {"name": "c&a foundation", "sentiment": "none"}, {"name": "walt disney co", "sentiment": "none"}, {"name": "thomson reuters foundation", "sentiment": "none"}, {"name": "c&a", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 3:04 PM / Updated 31 minutes ago Big brands from Disney to Walmart back tech startups to tackle supply chain slavery Umberto Bacchi 3 Min Read \nLONDON (Thomson Reuters Foundation) - A $23 million venture fund aiming to tackle the threat of forced labor in big businesses with the help of tech startups was launched on Tuesday, backed by brands from Disney to Walmart. \nHumanity United, a U.S.-based foundation, has partnered with major corporations and the British government to create Working Capital, a first-of-its-kind fund to invest in innovations to ensure that companies’ supply chains are free of modern slavery. \nThe fund has received capital from the C&A Foundation, affiliated with fashion retailer C&A, the Walmart Foundation, and Walt Disney Co among others, according to Humanity United. \nIn recent years modern slavery has increasingly come under the global spotlight, putting ever greater regulatory and consumer pressure on firms to ensure their supply chains are free of forced labor, child labor and other forms of slavery. \nFrom cosmetics and clothes to shrimp and smartphones, supply chains are often complex with multiple layers across various countries - whether in sourcing the raw materials or creating the final product - making it hard to identify exploitation. \n“There is a growing market demand for more transparent and responsible corporate supply chains,” Ed Marcum, managing director at Working Capital, said in a statement. \n“We see an opportunity to invest in emerging solutions that will meet the demands of large multinational corporations while also benefiting millions of vulnerable workers,” Marcum added. \nThe fund, which received 2.5 million pounds ($3.5 million) from Britain’s foreign aid department (DFID), is investing in new technologies to map supply chains and help workers to raise grievances, find legitimate employers, and know their rights. \nIts portfolio includes Provenance, which uses blockchain to trace products from producer to consumer, and Ulula, a platform helping firms to measure risky practices in their supply chains. \n“Human rights abuses like modern slavery are still far too common and businesses are ... investing in innovative technology that will root out these unacceptable practices for good,” DFID minister Penny Mordaunt said in a statement. \nAbout 25 million people globally were estimated to be trapped in forced labor in 2016, according to the International Labour Organization (ILO) and rights group Walk Free Foundation. \nHumanity United, established by Ebay founder Pierre Omidyar and his wife Pam in 2005, was involved in founding The Freedom Fund, the world’s first private donor fund designed to raise and deploy at least $100 million to combat modern slavery worldwide. Reporting by Umberto Bacchi @UmbertoBacchi, Editing by Kieran Guilbert; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org", "external_links": [], "published": "2018-01-30T16:57:00.000+02:00", "crawled": "2018-01-30T17:39:23.000+02:00", "highlightTitle": ""}