{"organizations": [], "uuid": "06961e4f8ce16f9a16d16b34d91d805a463d478f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-eu-environment/eu-targets-recycling-as-china-bans-plastic-waste-imports-idUSKBN1F51SP", "country": "US", "domain_rank": 408, "title": "EU targets recycling as China bans plastic waste imports", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:39:00.000+02:00", "replies_count": 0, "uuid": "06961e4f8ce16f9a16d16b34d91d805a463d478f"}, "author": "", "url": "https://www.reuters.com/article/us-eu-environment/eu-targets-recycling-as-china-bans-plastic-waste-imports-idUSKBN1F51SP", "ord_in_thread": 0, "title": "EU targets recycling as China bans plastic waste imports", "locations": [], "entities": {"persons": [{"name": "jyrki katainen", "sentiment": "none"}, {"name": "katainen", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european parliament", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - EU regulators are searching for ways to increase recycling of plastic, as waste piles up in ports after China banned imports of “foreign garbage” from the start of 2018.\nAnnouncing a new policy push on Tuesday, European Commission Vice President Jyrki Katainen said Brussels is mulling a tax, curbs on throw-away items like plastic bags, imposing quality standards and new rules at ports among other restrictions.\n“We have all this raw material, and from the beginning of the year now even more, because China will not take our waste,” Katainen told reporters.\nThe Commission is eyeing environmental taxes - including revenue from its carbon cap-and-trade Emission Trading System (ETS) - as a way to plug the whole left in its budget when Britain’s exit from the bloc at the end of 2020 deprives it of revenue.\nSuch proposals are opposed by some member states, who prefer to keep the revenues in national coffers, and environmental campaigners, who want to see the proceeds reinvested in efforts to stem pollution.\nEurope’s budget commissioner Gunther Ottinger tweeted on Tuesday that he had won the support of fellow Commission officials for a levy on the production of polluting plastics.\nOil-derived plastic mostly ends up in landfills or incinerated, with less than 30 percent of 25 million tonnes of plastic waste generated each year being recycled in Europe.\nEU nations and European Parliament reached an agreement last month to set a legally-binding target for the bloc to recycle 55 percent of plastic packaging waste by 2030 and a ban on landfilling separately collected waste.\nEU regulators now want to ensure that the plastic packaging itself is fully recyclable and to improve consumer labeling by creating new quality standards.\nThe Commission said it will introduce measures to curb ocean-polluting microplastics, such as those used in cosmetics. New port reception facilities will seek to streamline waste management to ensure less gets dumped in the Ocean.\n“More and more it is becoming a health problem because it is degrading, going to little chips, fish are eating it and it is coming back to our dinner table,” Katainen said.\nBefore the ban, China was the world’s dominant importer of plastic waste. A senior EU officials said he now expected the waste to go to other countries in Southeast Asia, such as Vietnam and Malaysia.\nReporting by Alissa de Carbonnel @AdeCar; Editing by Robert-Jan Bartunek\n ", "external_links": [], "published": "2018-01-16T16:39:00.000+02:00", "crawled": "2018-01-16T16:59:51.011+02:00", "highlightTitle": ""}