{"organizations": [], "uuid": "9f93d784e91e9d647d982eac9b05539e8a9c9f4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-csi-reports-growth-in-revenues-for-third-quarter.html", "country": "US", "domain_rank": 767, "title": "CSI Reports Growth in Revenues for Third Quarter", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "9f93d784e91e9d647d982eac9b05539e8a9c9f4d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-csi-reports-growth-in-revenues-for-third-quarter.html", "ord_in_thread": 0, "title": "CSI Reports Growth in Revenues for Third Quarter", "locations": [], "entities": {"persons": [], "locations": [{"name": "ky.", "sentiment": "none"}, {"name": "paducah", "sentiment": "none"}], "organizations": [{"name": "computer services, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Revenues Increase 0.8% to $61 Million\nPADUCAH, Ky.--(BUSINESS WIRE)-- Computer Services, Inc. (CSI) (OTCQX: CSVI) today reported its results for the third quarter ended November 30, 2017.\nCSI’s revenues rose 0.8% to $61.0 million for the third quarter of fiscal 2018 compared with $60.5 million for the third quarter of fiscal 2017. The results for the third quarter of 2018 included approximately $809,000 in early contract termination fees compared with $1.3 million in the third quarter of fiscal 2017. Excluding the effect of early contract termination fees from both periods, net revenues increased approximately 1.8% compared with the third quarter of fiscal 2017. Early contract termination fees are generated when a customer terminates its contract prior to the end of the contracted term, a circumstance that typically arises when an existing CSI customer is acquired by another financial institution that is not a CSI customer. These fees can vary significantly from period to period based on the number and size of customers that are acquired and how early in the contract term a customer is acquired.\nThird quarter net income declined 7.1% to $7.7 million compared with $8.3 million for the third quarter of fiscal 2017. Net income per share declined 6.8% to $0.55 compared with $0.59 for the third quarter of fiscal 2017. Excluding the effect of early contract termination fees from both third quarter periods, net income declined approximately 3.4% compared with the third quarter of fiscal 2017. The decline in third quarter net income was due primarily to operating expense growth outpacing revenue for the quarter, including higher personnel, equipment, travel and professional fees.\n“CSI remains on track to report higher revenues and net income for fiscal 2018 compared with fiscal 2017,” stated Steven A. Powless, Chairman and CEO of CSI. “For the first nine months of fiscal 2018, revenues were up 7.1% to $186.9 million and net income was up 8.6% to $25.3 million compared with the same period in the prior fiscal year. We continue to benefit from high renewal rates on contracts and the high percentage of recurring revenues from long-term customer contracts. We also expect the newly enacted reduction in the federal income tax rate to reduce CSI’s tax expense in the fourth quarter.”\nThird Quarter Results\nConsolidated revenues increased 0.8% to $61.0 million in the third quarter of fiscal 2018 compared with $60.5 million in the third quarter of fiscal 2017. The growth in revenues benefited from higher sales of core processing, digital banking, regulatory compliance services and managed services. Revenues included approximately $809,000 in early contract termination fees in the third quarter of fiscal 2018 compared with $1.3 million in the third quarter of fiscal 2017. Excluding the effect of the early contract termination fees from both periods, third quarter fiscal 2018 revenues increased approximately 1.8% compared with the third quarter of last fiscal year.\n“We anticipate revenue growth to be suppressed in the fourth quarter due to expected lower early contract termination fees in the fourth quarter compared with last fiscal year. We also believe the effects of the reduction in the federal income tax rate and other tax offsets that are expected to be booked at fiscal year-end 2018 will more than offset the earnings impact from lower early contraction termination fees,” continued Powless.\nOperating income declined 5.6% to $12.7 million for the third quarter of fiscal 2018 compared with $13.5 million for the third quarter of fiscal 2017. Operating margin was 20.9% in the third quarter of fiscal 2018 compared with 22.3% for the third quarter of fiscal 2017.\nNet income for the third quarter of fiscal 2018 declined 7.1% to $7.7 million compared with $8.3 million for the third quarter of fiscal 2017. Net income per share declined 6.8% to $0.55 for the third quarter of fiscal 2018 on 13.96 million weighted average shares outstanding compared with $0.59 for the third quarter of fiscal 2017 on 14.02 million weighted average shares outstanding.\n“CSI’s financial position remained strong with $43.6 million in cash and no long-term debt at the end of the third fiscal quarter. We returned $14.0 million to shareholders in cash dividends and repurchases of common stock during the first nine months of fiscal 2018. We also invested $17.6 million in hardware and software during the first nine months of fiscal 2018, up 61.0% from $10.9 million for the same period last fiscal year. We believe our investments in new hardware, software and product development will contribute to CSI’s growth in the coming years,” concluded Powless.\nNine Months Results\nConsolidated revenues for the first nine months of fiscal 2018 rose 7.1% to $186.9 million compared with $174.6 million for the first nine months of fiscal 2017. CSI’s increase in revenues benefited from growth across all major product lines compared with the first nine months of fiscal 2017. Fiscal year-to-date revenues also included $7.0 million in early contract termination fees compared with $2.3 million in the first nine months of fiscal 2017. Excluding the effect of the early contract termination fees from both periods, fiscal year-to-date revenues increased approximately 4.5% compared with the first nine months of fiscal year 2017.\nOperating income rose 10.1% to $41.4 million for the first nine months of fiscal 2018 compared with $37.6 million for the first nine months of fiscal 2017. Operating margin rose to 22.2% in the first nine months of fiscal 2018 compared with 21.6% in the first nine months of fiscal 2017.\nCSI’s cash flow from operations declined 8.5% to $40.8 million for the first nine months of fiscal 2018 compared with $44.6 million in the first nine months of fiscal 2017. Cash and cash equivalents increased 13.5% to $43.6 million as of November 30, 2017, from $38.4 million as of November 30, 2016.\nNet income for the first nine months of fiscal 2018 increased by 8.6% to $25.3 million compared with $23.3 million in the first nine months of fiscal 2017. Net income per share rose 9.0% to $1.81 per share for the first nine months of fiscal 2018 compared with $1.66 for the first nine months of fiscal 2017. Excluding the effect of early contract termination fees from both periods, net income per share declined approximately 3.0% compared with the first nine months of fiscal 2017.\nAbout Computer Services, Inc.\nComputer Services, Inc. delivers core processing, managed services, digital banking, payments processing, print and electronic distribution, and regulatory compliance solutions to financial institutions and corporate customers across the nation. Exceptional service, dynamic solutions and superior results are the foundation of CSI’s reputation, and have resulted in the company’s inclusion in such top industry-wide rankings as the FinTech 100, Talkin’ Cloud 100 and MSPmentor Top 501 Global Managed Service Providers List. CSI’s stock is traded on OTCQX under the symbol CSVI. CSVI meets the financial media’s “Dividend Aristocrats” criterion of having 25+ years of consecutive annual dividend increases. For more in", "external_links": ["http://www.businesswire.com/news/home/20180108006027/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.otcmarkets.com&esheet=51738995&newsitemid=20180108006027&lan=en-US&anchor=www.otcmarkets.com&index=2&md5=397f8cad3e4465ef248311b9086a11f5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.otcqx.com&esheet=51738995&newsitemid=20180108006027&lan=en-US&anchor=www.otcqx.com&index=3&md5=3a308e23348e1e54d0c29fd0d46c3253", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.csiweb.com&esheet=51738995&newsitemid=20180108006027&lan=en-US&anchor=www.csiweb.com&index=1&md5=457cd8386859baf2239f517dc72bfad7"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:11:53.002+02:00", "highlightTitle": ""}