{"organizations": [], "uuid": "2128ff5aeb91b2b27534e0480cd1b96d1c4fe11f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-swiss-tax-secrecy/swiss-secrecy-could-slip-further-under-plan-to-scrap-anonymous-shares-idUSKBN1F61K0", "country": "US", "domain_rank": 408, "title": "Swiss secrecy could slip further under plan to scrap anonymous shares", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T14:58:00.000+02:00", "replies_count": 0, "uuid": "2128ff5aeb91b2b27534e0480cd1b96d1c4fe11f"}, "author": "", "url": "https://www.reuters.com/article/us-swiss-tax-secrecy/swiss-secrecy-could-slip-further-under-plan-to-scrap-anonymous-shares-idUSKBN1F61K0", "ord_in_thread": 0, "title": "Swiss secrecy could slip further under plan to scrap anonymous shares", "locations": [], "entities": {"persons": [{"name": "john revill", "sentiment": "none"}, {"name": "john miller", "sentiment": "none"}], "locations": [{"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "oecd", "sentiment": "none"}, {"name": "min read  zurich", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 1:02 PM / Updated 15 minutes ago Swiss secrecy could slip further under plan to scrap anonymous shares John Revill , John Miller 3 Min Read \nZURICH (Reuters) - Swiss secrecy could be rolled back further under a plan to eliminate a class of company share that can be used to help owners dodge taxes by hiding their identities. \nThe Swiss government, wary of being branded a tax avoidance pariah, said on Wednesday it was launching a public consultation on measures to convert anonymous bearer shares in private companies into registered shares which have owners’ names attached. \nLong seen as a haven for the wealthy to stash their money, Switzerland has already dismantled banking secrecy by agreeing to send information about customers’ accounts to foreign tax agencies. \nThe new bearer share proposal, recommended by an OECD panel, aims to clamp down on tax avoidance by people using shell-companies to hold bearer shares. As those shares have no name attached, ownership can be concealed and even transferred with no documentation. \nThere are no estimates for how much tax income is lost this way. A global crack down on illegal tax avoidance has allowed tax authorities around the world to recover more than $85 billion over the last eight years, the OECD estimates. \nThe Swiss proposal would only apply to non publicly listed companies and not groups such as pharmaceutical company Roche ( ROG.S ) ROGS or lift-maker Schindler ( SCHP.S ) that have historically used voting bearer shares to keep companies under the control of their founding families. \nThe proposed rules would carry financial penalties for companies that do not comply. \nIn 2015, Britain banned companies from issuing bearer shares and ordered companies that already had them to convert them into securities whose ownership can be documented. Singapore, Hong Kong, Belgium, Austria and the United States have also passed laws restricting bearer shares in recent years. \nAn earlier Swiss attempt to tighten rules on bearer shares was judged inadequate by the OECD’s Global Forum on Transparency and Exchange of Information for Tax Purposes. \n“If Switzerland does not follow the recommendation, it can expect to be labeled ‘non-conforming’ in this area,” according to a government report issued on Wednesday. \n“That means Switzerland could achieve only a total rating of ‘partial compliance’ during the next review of whether it meets international standards of financial transparency.” \nIn recent years, Switzerland says bearer shares have dwindled as companies voluntarily convert them into registered shares. Bearer shares now represent only 12 percent of the share capital of companies, down from 27 percent in 2014. Editing by Robin Pomeroy", "external_links": [], "published": "2018-01-17T14:58:00.000+02:00", "crawled": "2018-01-17T15:09:44.081+02:00", "highlightTitle": ""}