{"organizations": [], "uuid": "32b55edb4162d106dc0e9f6ffdf9d1a028d97a99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/canada-ombudsman-business/update-1-canada-creates-watchdog-to-oversee-companies-conduct-abroad-idUSL1N1PC1FJ", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Canada creates watchdog to oversee companies' conduct abroad", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T22:04:00.000+02:00", "replies_count": 0, "uuid": "32b55edb4162d106dc0e9f6ffdf9d1a028d97a99"}, "author": "", "url": "https://www.reuters.com/article/canada-ombudsman-business/update-1-canada-creates-watchdog-to-oversee-companies-conduct-abroad-idUSL1N1PC1FJ", "ord_in_thread": 0, "title": "UPDATE 1-Canada creates watchdog to oversee companies' conduct abroad", "locations": [], "entities": {"persons": [{"name": "nicole mordant  jan", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "canadian ombudsperson for responsible enterprise", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 8:04 PM / Updated 41 minutes ago UPDATE 1-Canada creates watchdog to oversee companies' conduct abroad Reuters Staff \n(Adds details on watchdog’s powers, reaction) \nBy Nicole Mordant \nJan 17 (Reuters) - Canada said on Wednesday it is creating an independent watchdog to monitor and investigate claims of human rights abuses by its companies operating abroad, describing it as the first initiative of its kind in the world. \nThe body, which will initially target the mining, oil and gas, and garment sectors, will also have the power to recommend sanctions against transgressors, including withdrawing Export Development Canada financial support, international trade minister François-Philippe Champagne said. \nIts oversight is expected to be expanded to other industries within a year, he said. \nUnions, advocates and industry welcomed the creation of the office, to be named the Canadian Ombudsperson for Responsible Enterprise, saying it would promote safer operations and that the body had more “teeth” than a predecessor created by the former Conservative government. \n“We now expect that Canadian corporations operating abroad will operate to high ethical standards and if they don’t there will be consequences,” John McKay, a Liberal Party politician who has been advocating for an ombudsman for a decade. \nCanada’s mining, oil and gas sectors had been expecting Ottawa to announce an ombudsman to keep tabs on their offshore business, a move demanded by environmental and human rights groups and promised by Prime Minister Justin Trudeau’s Liberal Party. \nNon-government groups have for years called for greater oversight of Canadian mining companies abroad following a number of environmental incidents and accusations of human rights abuses, including that of forced labor at Canadian miner Nevsun Resources Ltd’s mine in Eritrea. Nevsun has denied the allegations. \nThe watchdog’s mandate will be to help solve disputes or conflicts between communities and Canadian companies. It will be able to independently investigate, report, recommend remedy and monitor its implementation. It can refer any evidence of possible criminal wrongdoing to police. \nTrudeau’s predecessor, Conservative Stephen Harper, established a Corporate Social Responsibility Counselor in 2009, but critics have said it is toothless as the office focuses mainly on facilitating dialogue between companies and affected communities. \n“It has been a long road but we are encouraged to finally see progress,” MiningWatch Canada spokeswoman Catherine Coumans said in a statement. (Reporting by Nicole Mordant in Vancouver; Editing by Susan Thomas and Lisa Shumaker)", "external_links": [], "published": "2018-01-17T22:04:00.000+02:00", "crawled": "2018-01-17T22:26:18.025+02:00", "highlightTitle": ""}