{"organizations": [], "uuid": "a64a06a0af09953b60103f1b2fc437a45fcebaf9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104976888-nuro_web_product_designeddeliver.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/30/ex-google-engineers-built-a-different-kind-of-self-driving-car.html", "country": "US", "domain_rank": 767, "title": "Ex-Google engineers built a different kind of self-driving car", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T19:01:00.000+02:00", "replies_count": 0, "uuid": "a64a06a0af09953b60103f1b2fc437a45fcebaf9"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/ex-google-engineers-built-a-different-kind-of-self-driving-car.html", "ord_in_thread": 0, "title": "Ex-Google engineers built a different kind of self-driving car", "locations": [], "entities": {"persons": [{"name": "nuro", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A new startup that proposes a different spin on autonomous transportation came out of stealth today. The company, called Nuro, was founded by two former lead Google engineers who worked on the famed self-driving car project. Unlike the plethora of self-driving startups out there, Nuro isn't focused on reconfiguring robot taxis or autonomous trucks, but on designing a new type of vehicle altogether.\nNuro is focused on deliveries, specifically the kind that are low-speed, local, and last-mile: groceries, laundry, or your take-out order from Seamless. The startup thinks that automating these services could help shoulder the sharp increase in last-mile deliveries, while also reducing traffic accidents and boosting local businesses who are looking for ways to thrive and compete in the age of Amazon .\nLow speed, local, and last-mile And their timing couldn't be better. The converging trends of robotics, self-driving cars, and e-commerce are leading to an explosion of interest in the last-mile delivery challenge. Consumers are ordering more items online than ever before, and there is a growing expectation for shorter and shorter delivery windows. A recent study by McKinsey put the global price tag of last-mile delivery every year at around $86 billion, with staggering year-over-year growth rates.\nWhile it works out the kinks in its drone delivery project, Amazon is also considering using self-driving robots, having just filed a patent for an autonomous ground vehicle. Toyota unveiled its bizarre \"e-palette\" concept at CES this year. Meanwhile, Starship Technologies has sidewalk-only delivery robots making trips in California, Washington, DC, Germany, and the UK. Last year, Ford Motor Company teamed up with Domino's to deliver pizza via a self-driving car. And later today, a Northern Californian startup called Udelv is demonstratingwhat it calls \"the world's first public-road autonomous delivery test,\" in which a self-driving van (with human safety driver) will deliver goods from the high-end Draeger's Market chain in the Bay Area city of San Mateo.\nNuro is taking a different approach. Rather than dress up a Lexus crossover or a Ford Focus in self-driving hardware and throw some grocery sacks inside, their engineers have built something entirely new from the ground up. At first glance, Nuro's R1 prototype (just an internal nickname and not the official name) looks like a giant lunchbox on wheels, or maybe even a mobile toaster. If anything, Nuro's first vehicle looks more like the original \"Firefly\" prototypes that Google officially retired last summer than anything you'd see on the road today.\nA giant lunchbox on wheels But a closer inspection reveals that the \"handle\" on the roof is actually a platform for the vehicle's sensor array, which includes LIDAR, cameras, and radars. And a peek through the windshield will also reveal the complete absence of traditional controls like steering wheels, foot pedals, and gear shifts. There's no driver seat because humans were not meant to operate this vehicle.\nThat said, Nuro is designing its vehicles for remote operation, placing it alongside startups such as Phantom Auto and others that are working on remotely operated driverless vehicles. But real-time teleoperation has its challenges, such as signal latency and other issues. To gain enough confidence for public deployment, Nuro is using a fleet of six self-driving cars to collect data and optimize routes, which then gets fed into its prototype vehicles. Nuro has received a permit from the California DMV and plans to start testing on public roads later this year. But the company will need sign-off from the US National Highway Traffic Safety Administration before it can operate in states where regulation prohibits completely human-free driving.\n\"We've built the full software stack from scratch. There are a lot of components that are shared with general self-driving, and some things that are a bit different,\" said Dave Ferguson who, along with Jiajun Zhu, co-founded Nuro. \"We've been able to architecture this thing from scratch, geared toward this passenger-less, goods-only transportation.\"\nRead more from The Verge:\nThese six-wheeled robots are about to start delivering food in the US\nWaymo retires its cute self-driving car in favor of minivans\nPlastic pollution is making corals sick\nFerguson said they considered building the R1 to drive on sidewalks but ultimately decided to make it road-worthy instead. The vehicle is about as tall as a Toyota Highlander but only about half the width, which Ferguson said is one of its standout features. This skinniness translates into a 3 to 4-foot \"buffer\" around the R1 so other vehicles and pedestrians can maneuver safely around it.\n\"Even if you have the perfect self-driving vehicle, if someone pops out between two parked cars and it's within your stopping distance, you can't prevent that accident,\" he said. \"Whereas if you have a vehicle that's half the width, and you've got an extra three or four feet of clearance, you can avoid it... and you have room to maneuver around them. You can better design the vehicle to mitigate the severity of any accident.\"\nThere are some challenges to Nuro's business model, specifically how customers will receive their deliveries from the self-driving delivery pod. No driver means no one to ring your doorbell or trudge up four flights of stairs to hand over your pad thai. Ferguson says he envisions customers using — what else? — an app to inform them when the vehicle has arrived in front of their building or in their driveway. They would then be given a code that pops open the vehicle's side hatches so they can retrieve their items. They are also considering using facial recognition technology. But what's to prevent people from stealing someone else's deliveries? There are still a lot of details that need to be worked out, Ferguson acknowledged.\nNo driver means no one to ring your doorbell Ferguson and Zhu are two guys who know more than a little about autonomous driving. Zhu was one of the founding engineers of Google's self-driving team, while Ferguson was a leading software engineer on the team. Both left Google at the same time as its chief technology officer Chris Urmson, who has since gone on to start his own self-driving company, Aurora.\nAside from a brief internship at Intel, Zhu had spent much of his career at Google and was the self-driving team's principal software engineer from 2008-2016. Ferguson came to Google in 2011 after a stint at Carnegie Mellon's Robotics Institute, which has been at the forefront of the autonomous driving revolution. He served as the principal computer-vision and machine-learning engineer at Google before leaving with Zhu in late 2016 to start Nuro. Since then, they've attracted talent from the likes of Google, Apple , Tesla , Waymo, and GM to build out their team.\nNuro has already raised $92 million in two rounds of fundraising and is in talks with a number of retailers and delivery providers about possible partnerships. A likelier outcome is Nuro gets quickly bought up by a company like Amazon. The race to develop self-driving technology has sparked a furious round of mergers and acquisitions over the past few years, the rate of which has yet to subside.\nFerguson said that he hopes Nuro's fresh approach to self-driving — focusing on delivering goods rather than people — hopefully means that Nuro will stand out from the pack.\n\"Almost all of the big players in self-driving passenger transportation are really, really focused on that application because for many of them it's an existential threat,\" Ferguson said. \"And most of them feel that goods transportation is going to be a follow-on application. For us, we felt, in and of its own right, it was an important enough problem and one that we could make real headway on earlier than passenger transportation.\"\nHe added, \"That makes us sound smarter or more cunning than we are ... It makes sense for them to be focused on that, but it also leaves open a pretty big opportunity to go after this other area.\"", "external_links": [], "published": "2018-01-30T19:01:00.000+02:00", "crawled": "2018-01-30T21:00:39.015+02:00", "highlightTitle": ""}