{"organizations": [], "uuid": "35e7fbc4524f4a7ecf38d0391b455006d455a469", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/16/104847028-20150330-2-1176-2.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/going-on-a-complaint-diet-will-make-you-more-successful-in-2018.html", "country": "US", "domain_rank": 767, "title": "Going on a 'complaint diet' will make you more successful in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.137, "site_type": "news", "published": "2018-01-05T15:26:00.000+02:00", "replies_count": 0, "uuid": "35e7fbc4524f4a7ecf38d0391b455006d455a469"}, "author": "Deepak Chopra", "url": "https://www.cnbc.com/2018/01/05/going-on-a-complaint-diet-will-make-you-more-successful-in-2018.html", "ord_in_thread": 0, "title": "Going on a 'complaint diet' will make you more successful in 2018", "locations": [], "entities": {"persons": [{"name": "kabir sehgal", "sentiment": "neutral"}, {"name": "deepak chopra", "sentiment": "neutral"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you want to win the New Year, it's important to break bad habits – like consuming things that aren't good for you. We're not just talking about cutting back on calories. There's something else you should slash from your life: complaints.\nComplaining is a bad habit. Your brain likes to identify patterns. So when you moan, you become a pessimist who trains your brain to look for the \"bad\" in things. Your mind will detect things you don't like more often. This will only leave you feeling dissatisfied, frustrated and powerless because you can't do anything about it.\nConsider all the things you might carp about – the cold weather, slow traffic, underpaid job, mean manager, or a jealous spouse. Unless you're actually going to do something about it – like get a new job or change your commute – it doesn't help to whine. In fact, complaining is downright unhealthy because it can boost your cortisol levels and cause stress. Moreover, you might even turn off others because nobody wants to be around a downer.\nInstead, start 2018 by hitting the reset button on complaints and follow these three steps of the \"complaint diet.\"\nFirst, close your eyes and notice whatever it is that you want to grumble about. Just observe how it makes you feel. Second, tell yourself that you can't do anything about it. Third, take a deep breath and let it go.\nSource: Kabir Sehgal Kabir Sehgal You can even add a fourth step which is to recite to yourself the things for which you're grateful like good health, loving family, a decent paycheck. By doing so, you'll start to focus on what's going right versus what isn't.\nWhen you follow these steps, you will stop saying negative things aloud and to yourself. And eventually, you won't even think them. Rather, you will train your brain to see the \"good\" in things, and that can lead to all sorts of positive effects.\nIndeed, complaining less might be more beneficial to your health then a new gym membership. Perhaps you will feel less physical pain and discomfort, as positive thinking has been credited with reducing cardiovascular disease and increasing lifespan.\nBy reducing or even eliminating your desire to criticize, you will adopt an impactful habit that will set you up for success in the coming year.\nCommentary by Deepak Chopra and Kabir Sehgal. Chopra is the founder of The Chopra Foundation and co-founder of The Chopra Center for Wellbeing and a pioneer in integrative medicine and personal transformation. Sehgal is a New York Times bestselling author. He is a former vice president at JPMorgan Chase, multi-Grammy Award winner and U.S. Navy veteran. Chopra and Sehgal are co-creators of Home: Where Everyone Is Welcome , inspired by American immigrants.\nLike this story? Like CNBC Make It on Facebook !\nDon't miss: Mark Zuckerberg just made a 2018 resolution—here's how he and other leaders approach their goals\nshow chapters Former Google career coach shares a visual trick for making the new year more productive and happy 11:27 AM ET Thu, 21 Dec 2017 | 01:03", "external_links": [], "published": "2018-01-05T15:26:00.000+02:00", "crawled": "2018-01-05T16:18:07.058+02:00", "highlightTitle": ""}