{"organizations": [], "uuid": "f6d0b5e162846c56129fb3c904d01a4f1de8f4f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-violin-expands-international-enterprise-customer-and-partner-community-appoints-georgine-nordin-to-vp-international-alliances.html", "country": "US", "domain_rank": 767, "title": "Violin Expands International Enterprise Customer and Partner Community; Appoints Georgine Nordin to VP International Alliances", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-18T16:35:00.000+02:00", "replies_count": 0, "uuid": "f6d0b5e162846c56129fb3c904d01a4f1de8f4f0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-violin-expands-international-enterprise-customer-and-partner-community-appoints-georgine-nordin-to-vp-international-alliances.html", "ord_in_thread": 0, "title": "Violin Expands International Enterprise Customer and Partner Community; Appoints Georgine Nordin to VP International Alliances", "locations": [], "entities": {"persons": [{"name": "georgine nordin", "sentiment": "negative"}, {"name": "rick ruskin", "sentiment": "none"}, {"name": "nordin", "sentiment": "none"}, {"name": "georgine", "sentiment": "none"}], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "international enterprise customer and partner community", "sentiment": "negative"}, {"name": "systems llc", "sentiment": "negative"}, {"name": "apac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif., Jan. 18, 2018 /PRNewswire/ -- Violin ® Systems LLC, the enterprise storage industry leader for extreme performance with consistent low latency and data services, announced today that due to robust growth in Europe and APAC, the company is significantly expanding its international presence to serve its enterprise customers and partners outside North America.\nTo facilitate this strategic development, Violin has appointed Georgine Nordin to vice president, international alliances. Nordin has served Violin for nearly five years, first as vice president, worldwide sales operations and support, and more recently as vice president, worldwide field operations.\n\"As we build our capacity in these international markets, we recognize the need for more resources, especially in the UK, Germany, Russia, Turkey, and Japan, where adoption of our Flash Storage Platform™ is particularly strong,\" said Rick Ruskin, senior vice president of field operations. \"We've been fortunate to have Georgine's leadership in worldwide business relationships for some time, and this newly-created position will take full advantage of her talents.\"\nNordin has spent nearly three decades in executive roles at technology companies, holding VP-level titles with responsibility for sales, service operations, strategic partnerships, financial and strategic planning. She joined Violin in 2014 after positions at Ericsson, Actelis Networks, Network Equipment Technologies, and Redback Networks. As a specialist in international business, she has a wealth of experience in global channel relationships, international trade laws, multi-county compensation, contract negotiations, and partnerships throughout EMEA, APAC, and Latin America.\n\"We are benefiting from the demand and opportunity for all-flash arrays in critical markets around the world, in industries such as healthcare, communications and financial services,\" said Nordin. \"Engaging international customers is a strength of ours because of Violin's technical innovation and the highly personal service and support we are able to provide.\"\n\"Expanding our global footprint is another sound investment in strong management by Violin,\" said Rick Ruskin. \"I'm delighted to continue collaborating with Georgine, who is bringing our mission of first-class technology and first-class customer experience to the rest of the world.\"\nAbout Violin\nViolin, the disruptive innovator in All Flash Arrays, is revolutionizing how businesses operate by enabling storage technology to be Instrumental to their company by changing the SLAs and capabilities of private, hybrid and public cloud environments. The Flash Storage Platform™, powered by Concerto OS™, a fully integrated storage operating system, is the industry leader in the combination of every significant category measured in all flash arrays: low latency, affordability, density, scalability and performance. With tightly integrated data services, the Violin Flash Storage Platform provides a unique combination of data protection, business continuity, and data reduction services onto a flexible, uniquely scalable solution called Scale Smart™, delivering significant CAPEX and OPEX savings. Founded in 2005, Violin is headquartered in San Jose, California.\nContact:\nJudy Smith, JPR Communications\n818-798-1475\njudys@jprcom.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/violin-expands-international-enterprise-customer-and-partner-community-appoints-georgine-nordin-to-vp-international-alliances-300584103.html\nSOURCE Violin Systems LLC", "external_links": ["http://www.prnewswire.com/news-releases/violin-expands-international-enterprise-customer-and-partner-community-appoints-georgine-nordin-to-vp-international-alliances-300584103.html", "http://www.violin-systems.com/"], "published": "2018-01-18T16:35:00.000+02:00", "crawled": "2018-01-18T16:23:56.000+02:00", "highlightTitle": ""}