{"organizations": [], "uuid": "028b327813c8009492004fbcf6be24c740fdd142", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/28/104864771-GettyImages-881034868.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/markets-testing-fed-as-the-dollar-falls-against-euro-gold.html", "country": "US", "domain_rank": 767, "title": "Markets testing Fed as the dollar falls against euro, gold,", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.353, "site_type": "news", "published": "2018-01-02T13:18:00.000+02:00", "replies_count": 0, "uuid": "028b327813c8009492004fbcf6be24c740fdd142"}, "author": "David Reid", "url": "https://www.cnbc.com/2018/01/02/markets-testing-fed-as-the-dollar-falls-against-euro-gold.html", "ord_in_thread": 0, "title": "Markets testing Fed as the dollar falls against euro, gold,", "locations": [], "entities": {"persons": [{"name": "jerome powell", "sentiment": "negative"}, {"name": "carlos barria", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "giles keating", "sentiment": "none"}, {"name": "keating", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fed", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "werthstein institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The dollar has limped into 2018, slumping to a four-month low against a strengthening euro on Tuesday.\nThe move reflected the trend across 2017 that saw the U.S. currency slide almost 10 percent against a basket of its trading peers — the dollar's largest annual fall since 2004.\nGiles Keating, managing director at the Werthstein Institute, told CNBC Tuesday that, against the euro in particular, the dollar may continue to lose value.\n\"In the U.S., three or four rate hikes is just not enough at a time when the ECB (European Central Bank) has said more or less definitely they are going to be terminating QE (quantitative easing) in September and even beginning to talk about rate rises,\" he said.\n\"So the ECB is getting more aggressive. The Federal Reserve, I think, is dragging its feet. No wonder the euro is going up.\"\nThe dollar has weakened against a wide range of assets. Keating said traders are testing the new line-up at the Fed on what its interest rate policy will be.\n\"We are going to change three of the most important people on the FOMC (Federal Open Market Committee) this year. Really, the markets are saying to the newcomers, 'Are you going to be tough enough or not?'\" he said.\nThe euro rose 1.1 percent in the last week of 2017, bringing it back within sight of a two-and-a-half year peak of $1.209 set in September.\nUp goes the euro Benoit Coeure, the ECB board member in charge of its market operations, told a Chinese magazine Sunday that there was a \"reasonable chance\" that the ECB's QE program would end this September.\nFrom previous indications, that would put the timing of a rate rise at around the second quarter of 2019.\nshow chapters Euro will see further strength in 2018, analyst says 10 Hours Ago | 01:52 But Derek Halpenny, European head of global markets research at MUFG, said Tuesday that markets are starting to question the ECB message that rates can stay where they are until 2019.\n\"Particularly, the two important words 'well past,' in terms of 'rates remaining on hold until well past the end of quantitative easing,'\" the analyst said.\nHe added that if those two words should be dropped from ECB statements, then the market would price short-term interest rates at a higher level than at present. This, in turn, should drive the euro higher.\nHalpenny argued that a subtle change in the ECB message could mean an interest rate rise for the euro zone as soon by the end of 2018.", "external_links": [], "published": "2018-01-02T13:18:00.000+02:00", "crawled": "2018-01-02T13:22:22.001+02:00", "highlightTitle": ""}