{"organizations": [], "uuid": "e5b055ad5a4ab5b99a113c26bb89dbf85614c111", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-granite-reit-unlocks-value-with-sale-of-400-million-of-properties-including-three-special-purpose-properties.html", "country": "US", "domain_rank": 767, "title": "Granite REIT Unlocks Value With Sale of $400 Million of Properties Including Three Special Purpose Properties", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.554, "site_type": "news", "published": "2018-01-18T02:21:00.000+02:00", "replies_count": 0, "uuid": "e5b055ad5a4ab5b99a113c26bb89dbf85614c111"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-granite-reit-unlocks-value-with-sale-of-400-million-of-properties-including-three-special-purpose-properties.html", "ord_in_thread": 0, "title": "Granite REIT Unlocks Value With Sale of $400 Million of Properties Including Three Special Purpose Properties", "locations": [], "entities": {"persons": [], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "st. thomas", "sentiment": "none"}, {"name": "bowling green", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}], "organizations": [{"name": "granite real estate investment trust", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Granite Real Estate Investment Trust (\"Granite\") (TSX: GRT.UN / NYSE: GRP.U) announced today that it has achieved an important strategic milestone, by entering into agreements for the sale of ten properties for a total sales price of approximately $400 million (the \"Transactions\").The Transactions are subject to customary closing conditions and are expected to close within the next several weeks.\nThree of the ten properties are characterized by Granite as special purpose; two of the special purpose properties are located in St. Thomas, Ontario representing approximately 1.5 million square feet, and one is located in Bowling Green, Kentucky, representing approximately 1.2 million square feet. The total sales price for these three properties is expected to be approximately $334 million and, with a combined net operating income (\"NOI\") of approximately $24 million, the capitalization rate on the sale is estimated to be 7.0% for the Bowling Green property and 7.3% for the two St. Thomas properties.\nThe remaining seven properties are all contiguous, and located in the Greater Toronto Area (\"GTA\") in Newmarket, Ontario, and together represent approximately 0.6 million square feet on 45 acres of land. The total sales price for these seven assets is $63 million and, with a combined NOI of $2.8 million, the capitalization rate on the sale is estimated to be 4.5%.\nMichael Forsayeth, Granite's CEO, commented that \"The sale of these properties is another major value creation milestone for Granite. It significantly reduces Granite's exposure to Magna and the special purpose properties which are key strategic objectives of Granite. These tax efficient transactions are accretive to Granite's net asset value by approximately $1.50 per stapled unit. We believe that these transactions unlock the embedded value and demonstrate the liquidity potential of these assets, and that the halo effect of these transactions will have meaningful positive valuation implications on Granite's remaining special purpose properties as well as its properties located in the GTA. With our net leverage reduced to approximately 10%, our opportunity to deploy the balance sheet clearly increases and we remain committed to and confident in our ability to effectively allocate capital in the best interests of Granite's unitholders; including accelerating growth through more acquisitions similar to the high quality portfolio acquired in October 2017.\"\nThe benefits and highlights of these Transactions are summarized below:\nThe total sales price of approximately $400 million for these ten properties represents nearly $70 million, or $1.50 per stapled unit, in excess of the values reported for them in Granite's 2017 third quarter report. Pro-forma, upon completion of the Transactions and based on gross leasable area: Granite's Magna concentration will reduce from approximately 65% to 61%; the proportion of Granite's portfolio comprising of high quality warehouse and logistics properties is expected to increase by 3% to approximately 31%; and the special purpose properties will reduce by 5% to approximately 36% of Granite's total portfolio. Post completion of the Transactions, Granite's estimated net debt-to-gross book value will be approximately 10%. No change is anticipated to Granite's monthly distribution to its unitholders as a result of the Transactions.\nABOUT GRANITE\nGranite is a Canadian-based REIT engaged in the ownership and management of predominantly industrial, warehouse and logistics properties in North America and Europe. Granite owns approximately 32 million square feet in over 90 rental income properties. Our tenant base includes Magna International Inc. and its operating subsidiaries as our largest tenants, in addition to tenants from other industries.\nOTHER INFORMATION\nCopies of financial data and other publicly filed documents about Granite are available through the internet on the Canadian Securities Administrators' Systems for Electronic Document Analysis and Retrieval (SEDAR), which can be accessed at www.sedar.com , and on the United States Securities and Exchange Commission's Electronic Data Gathering, Analysis and Retrieval System (EDGAR), which can be accessed at www.sec.gov . For further information, please see our website at www. granitereit.com or contact Michael Forsayeth, Chief Executive Officer, at 647-925-7600 or Ilias Konstantopoulos, Chief Financial Officer, at 647-925-7540.\nFORWARD LOOKING STATEMENTS\nThis press release may contain statements that, to the extent they are not recitations of historical fact, constitute ''forward-looking statements'' or \"forward-looking information\" within the meaning of applicable securities legislation, including the United States Securities Act of 1933, as amended, the United States Securities Exchange Act of 1934, as amended, and applicable Canadian securities legislation. Forward-looking statements and forward-looking information may include, among others, statements regarding the intention of Granite and the purchaser to complete the Transactions on the terms and conditions described herein, the expected timing of closing of the Transactions, the impact of the Transactions on the valuation of Granite's remaining special purpose and GTA properties and on Granite's concentration of Magna-tenanted properties; special purpose properties and high quality warehouse and logistics properties; the impact of the Transactions on Granite's net asset value, cash balance and net debt-to-gross book value ratio; and Granite's plans, goals, strategies, intentions, beliefs, estimates, costs, objectives, economic performance, expectations, or foresight or the assumptions underlying any of the foregoing. Words such as ''may'', ''would'', ''could'', ''will'', ''likely'', ''expect'', ''anticipate'', ''believe'', ''intend'', ''plan'', ''forecast'', ''project'', ''estimate'', \"seek\" and similar expressions are used to identify forward-looking statements and forward-looking information. Forward-looking statements and forward-looking information should not be read as guarantees of the closing of the Transactions on the terms and conditions described herein, the expected impact of the Transactions as described herein, or other events, performance or results and will not necessarily be accurate indications of whether or the times at or by which such closing of the Transactions, impact of the Transactions, or other events or performance will be achieved. Undue reliance should not be placed on such statements. Forward-looking statements and forward-looking information are based on information available at the time and/or management's good faith assumptions and analyses made in light of its perception of historical trends, current conditions and expected future developments, as well as other factors management believes are appropriate in the circumstances, and are subject to known and unknown risks, uncertainties and other unpredictable factors, many of which are beyond Granite's control, that could cause actual events or", "external_links": ["http://www.granitereit.com/", "http://www.sec.gov/", "http://www.sedar.com/"], "published": "2018-01-18T02:21:00.000+02:00", "crawled": "2018-01-18T03:23:10.007+02:00", "highlightTitle": ""}