{"organizations": [], "uuid": "dd94a885afd7eb2f7f2983e5578eafff2b802f65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104961440-GettyImages-876878914.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/23/james-pitaro-has-the-best-shot-to-be-espns-next-president-commentary.html", "country": "US", "domain_rank": 767, "title": "James Pitaro has the best shot to be ESPN's next president COMMENTARY", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T19:44:00.000+02:00", "replies_count": 0, "uuid": "dd94a885afd7eb2f7f2983e5578eafff2b802f65"}, "author": "Eric Jackson", "url": "https://www.cnbc.com/2018/01/23/james-pitaro-has-the-best-shot-to-be-espns-next-president-commentary.html", "ord_in_thread": 0, "title": "James Pitaro has the best shot to be ESPN's next president COMMENTARY", "locations": [], "entities": {"persons": [{"name": "steve zak", "sentiment": "positive"}, {"name": "interactiv", "sentiment": "positive"}, {"name": "james pitaro", "sentiment": "positive"}, {"name": "zucker", "sentiment": "none"}, {"name": "bob iger", "sentiment": "none"}, {"name": "john skipper", "sentiment": "none"}, {"name": "jeff zucker", "sentiment": "none"}, {"name": "iger", "sentiment": "none"}, {"name": "john ourand", "sentiment": "none"}, {"name": "jimmy pitaro", "sentiment": "none"}], "locations": [], "organizations": [{"name": "espn", "sentiment": "positive"}, {"name": "cnn", "sentiment": "none"}, {"name": "disney", "sentiment": "none"}, {"name": "sports business journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Steve Zak Photography | FilmMagic | Getty Images Chairman of Disney Consumer Products and Interactive Media Jimmy Pitaro. \nLate last week, Deadline reported that CNN President Jeff Zucker was deep in talks with Disney's Bob Iger about becoming the next president of ESPN, replacing John Skipper, who stepped down recently to deal with substance abuse issues. \nThis report now appears to be in doubt, as the Sports Business Journal's John Ourand said he's confirmed with sources that Iger has never spoken to Zucker about the job. Zucker also had some PR person send out word late Friday night that he'd never been happier running CNN and had no plans to leave.\nWhat's going on here? It has been previously reported that there were a number of prominent outside candidates who'd made their interest in the ESPN job known to Disney — the majority owner of ESPN. Perhaps Zucker was among these people. \nBut Zucker would have been an odd choice to run ESPN, given how the network has had to defend itself in the past year from accusations of liberal bias. Zucker's tenure at CNN would bring more headaches in that area if he was picked for the job. \nAs I have argued here previously , I believe that it's far more likely that Bob Iger will select an internal candidate for the ESPN job rather than go outside (although I have no doubt there are plenty of people on the outside who'd love to run the network). Getty Images Jeff Zucker \nIt seems incomprehensible to me that Iger would have let Skipper leave without gathering names of possible candidates to consider to run ESPN. Instead, I suspect Iger already had a candidate in mind to take this role before Skipper left. Therefore, the deck seems stacked that this person has to be internal. \nThat suggests to me that it will be a Burbank person who gets the job, who has worked more closely with Iger on a day-to-day basis to win his trust. The three likeliest candidates then would be Kevin Mayer, Bob Chapek and James Pitaro over the three direct reports to John Skipper —Justin Connolly, Burke Magnus and Connor Schell. \nIn my December piece for CNBC , I argued that Kevin Mayer would be likeliest to get the nod, as he'd worked on all the major Disney acquisitions including the recent Fox one but would need some operating experience if he wanted to be in the mix to replace Iger as Disney CEO in 2021. \nHowever, since then, a New York Times article by Emily Steel came out on Vice Media which puts Mayer in a difficult position given his proximity to the Disney investment into Vice (and likely board observer rights, if not board seat). Mayer's other big weakness for the job is his lack of operational experience on his resume. Given how big the Media Networks job is at Disney, it would be tough for Iger — even though he likes Mayer — to give such a big first job to him. \nThat leaves Chapek and Pitaro. Bob Chapek has done a great job at the company's parks division, and he has no issues in terms of being known as an operator. He's been at Disney for 20 years and has prior experience in the Consumer Products and Distribution division. \nHowever, after having spoken to several tech investors and executives — though no one with any inside knowledge of what's going on at Disney — I'm going to lay out the case for why James Pitaro, currently the chairman of Disney's Consumer Products and Interactive Media group, has the best shot to be the next ESPN President — and probably the best bet to succeed Iger in '21. The case for James Pitaro \nAlthough Pitaro is not commonly discussed among the general business press, he is extremely well-liked in Silicon Valley. He worked at Launch Media as VP of business affairs for Dave Goldberg; Launch was eventually acquired by Yahoo, and Pitaro stayed on at Yahoo. He became head of all Yahoo Media after Jeff Weiner left. \nPitaro was very close with Goldberg at Launch and also got to know soon-to-be-former Disney board member Sheryl Sandberg very well. \nPeople who worked with him at Launch and Yahoo describe Pitaro as very driven, passionate, and a hands-on operator. Two people separately referred to Pitaro as a \"rock star.\" \nOthers who know him from his time at Disney describe him as well-liked by Iger and also someone who makes level-headed decisions. \"He's a trusted and sound thinker,\" said one person. Another said that Pitaro had made it known to Iger very directly that he one day wanted the ESPN job. Pitaro loves sports. \"He's a sports nut,\" said one person. \nJim Miller wrote in a recent Hollywood Reporter story about how Iger had asked to send Pitaro to work with Skipper a couple of years ago but Skipper had politely but firmly said no. That vignette suggests to me that Iger already trusts Pitaro for the position. \nIf you believe that ESPN needs to transition from a linear world to an over-the-top (OTT) and digital one, especially the launch of the OTT service ESPN+ later this year, Pitaro's digital background at Launch and Yahoo are a positive compared with Chapek's background. \nIn terms of Pitaro's weaknesses for the job, he's not a big name like a Jeff Zucker. However, his defenders say that Disney doesn't need a big name to impress Wall Street — especially if it's someone from the old TV world. It's more important that he can lead ESPN and Media Networks where they need to go, and they believe Pitaro can. Some will ask if Pitaro has achieved as much overseeing Interactive or Consumer Products as Chapek has at Parks. Pitaro defenders say that he led a cleanup effort at Interactive. He's only been leading Consumer Products for a little over a year. A couple of people wondered how Pitaro would deal with relocating to Bristol, Connecticut — where ESPN is headquartered — as they saw him more as a Los Angeles or New York person. However, you could ask the same thing about most Disney execs. \nThe bottom line is that Pitaro does tick off a number of the key boxes for the ESPN job. More importantly though, he's widely admired by many in Silicon Valley, by Sandberg and by Iger. Those could be the deciding factors here in his being offered the job. \nOf course, Pitaro would need help getting acclimated to the ESPN organization and culture if he did get the job. I wouldn't be surprised if George Bodenheimer stayed on as chairman for some period of time to help with the transition. I would also expect Pitaro to lean heavily on Connolly, Schell and Magnus if he took the job. \nTo me, reading all the various tea leaves floating around Burbank and Bristol, it seems like James Pitaro is now the most likely to be the next ESPN president. \nDisclosure: Affiliates controlled by Eric Jackson have long positions in the Walt Disney Company. \nCommentary by Eric Jackson. Sign up for Eric's monthly Tech & Media Email and his Podcast . You can follow Eric on Twitter @ericjackson . Eric Jackson Special columnist for CNBC.com Related Securities", "external_links": [], "published": "2018-01-23T19:44:00.000+02:00", "crawled": "2018-01-23T19:57:45.005+02:00", "highlightTitle": ""}