{"organizations": [], "uuid": "5c1cd8cff517aadfdbddb401b165ae2b450bd758", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104962881-2018-Buick-Regal-TourX-010.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/wagons-dont-sell-well-but-buick-bets-they-can-revamp-its-image.html", "country": "US", "domain_rank": 767, "title": "Wagons don’t sell well, but Buick bets they can revamp its image", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.034, "site_type": "news", "published": "2018-01-26T16:47:00.000+02:00", "replies_count": 0, "uuid": "5c1cd8cff517aadfdbddb401b165ae2b450bd758"}, "author": "Robert Ferris", "url": "https://www.cnbc.com/2018/01/26/wagons-dont-sell-well-but-buick-bets-they-can-revamp-its-image.html", "ord_in_thread": 0, "title": "Wagons don’t sell well, but Buick bets they can revamp its image", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "buick", "sentiment": "negative"}, {"name": "general motors", "sentiment": "none"}, {"name": "buick buick regal tour x  buick", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Buick hopes to capture a new set of customers with a crossover that looks a lot like one of the least popular cars in America.\nThe company is right now rolling out the Buick Regal TourX to dealerships across the U.S., and while the car is marketed as a crossover, it is really a wagon. Wagons sell poorly in the United States, but Buick is wagering the car will both win over fiercely loyal wagon fans and help the brand revamp its staid image among Americans.\nBuick was spared from extinction during General Motors' famous U.S. government bailout, mostly due to the brand's popularity in China, where it is highly desirable.\nIn the U.S., Buick has been associated with unadventurous cars for grandparents. In an attempt to overcome that image, Buick has made bets on unusual designs that differentiate it from its GM stablemates.\nThe TourX follows that new approach.\n\"We just thought it was a really good opportunity for us to revitalize the way we look at cars, at Buick,\" said Doug Osterhoff, marketing manager for the Buick Regal line.\n\"When people see the TourX, the perceptual change of Buick is even more significant because they don't expect to see that kind of vehicle from Buick,\" he added.\nSource: Buick 2018 Buick Regal TourX interior Once common across the country, and still popular elsewhere in the world, wagons have been unloved by the vast majority of American buyers for years. They were long ago eclipsed by sales of minivans and, later, sport utility vehicles.\nWagons were 1.9 percent of consumer vehicle sales in 2010 and have been essentially flat since, according to IHS Markit. In contrast, sales of sport utility vehicles have risen from 30 percent in 2010 to an expected 43 percent in 2018.\nThe big factor in this so far steady decline is the influence of the baby boomers, said Kelley Blue Book analyst Rebecca Lindland. This is generally considered the generation of Americans born from the mid-1940s to mid-1960s.\n\"In the States you have to go back into the '80s, when baby boomers started to make their mark in the marketplace,\" Lindland told CNBC. \"They were raised in station wagons, and they wanted something different.\"\nIFCAR | Wikimedia Commons They also wanted something large and intimidating, that fed the competitive mindset characteristic of their generation, Lindland said. The old American family station wagon did not project that image.\nAnd SUVs have their own intrinsic characteristics that make them sticky to buyers. They offer a higher riding height than sedans. This gives a better view of the road, but also has a psychological effect, Lindland said.\n\"We see from KBB from traffic that owners who have a sedan tend to shop both crossovers and sedans,\" she said. \"But crossover and SUV owners only shop for crossovers and SUVs. Once people have had a utility vehicle, it is really hard to get them out of it.\"\nBut many car enthusiasts argue that wagons are in some ways superior to most of the top-heavy crossovers and SUVs on offer today.\nPerhaps most importantly, sacrificing higher ride height makes the car drive as nimbly as a sedan — an advantage that especially shows at freeway speeds.\n\"Wagons are still based on sedans, and passenger cars are almost always going to be better on driving experience,\" said IHS Markit senior analyst Stephanie Brinley.\nAnd there is a group of buyers who are loyal to wagons, finding them the perfect balance between a sedan and a sport utility, Osterhoff said.\n\"The people who really want that driving dynamic of a car are really adamant,\" Osterhoff said. They also like being able to access the roof — the TourX comes with roof rails as a standard feature.\nThe downside is customers who prefer to buy wagons have few to choose from. And those currently on the market borrow elements from the crossover paradigm.\n\"If wagons want to have a chance in the U.S., they tend to be on stilts,\" said Dave Sullivan, an analyst with AutoPacific. This means they tend to be raised slightly, giving at least some of the seductive higher ride height. They also tend to have other features, such as all-wheel drive and tinted windows, he said.\nVolkswagen has had success with the Golf Alltrack. The Subaru Forester and Outback are examples of wagon-like cars that have bucked the trend and been good sellers, Sullivan said.\nSource: Subaru Subaru Outback On the higher end, some of the German manufacturers have seen success. The Audi A4 Allroad has a following, for example. Of course, Volvo has also made its name as a go-to brand for wagons.\nBut the Allroad starts at about $44,000, almost $15,000 higher than the TourX. Buick is trying to hit the price point between luxury brands and the lower-priced brands, such as Subaru.\nSource: Audi Audi A4 Allroad Buick is also positioning the TourX not as a wood-paneled family hauler, but as a car for people who are active and enjoy the outdoors. These consumers, Osterhoff said, make up many wagon buyers today.\n\"These people are active in the sense that they are ready to go out on a bike ride after lunch, or throw the kayak in the water after working,\" he said.\nSome promotional photos feature the car in a stand of trees, with surfboards or kayaks attached to the roof rack.\nSource: General Motors 2018 Buick Regal Tour X And despite the fact that wagon sales in the near future are not projected to rise much, the move may help cast Buick in a new light.\n\"I think it will open up that conversation about changing the brand image,\" Brinley said. \"I think that move is going to work out pretty well for them as a brand.\"", "external_links": [], "published": "2018-01-26T16:47:00.000+02:00", "crawled": "2018-01-26T16:47:23.014+02:00", "highlightTitle": ""}