{"organizations": [], "uuid": "319ba9f0dedee123f747281e64298da5519d7554", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 71, "shares": 71, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220360715&w=1200&r=LYNXMPEE071G0", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-apple-shareholders-breakingviews/breakingviews-tech-backlash-catches-up-to-apple-idUSKBN1EX2AO", "country": "US", "domain_rank": 408, "title": "Breakingviews - Tech backlash catches up to Apple", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T05:23:00.000+02:00", "replies_count": 0, "uuid": "319ba9f0dedee123f747281e64298da5519d7554"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-apple-shareholders-breakingviews/breakingviews-tech-backlash-catches-up-to-apple-idUSKBN1EX2AO", "ord_in_thread": 0, "title": "Breakingviews - Tech backlash catches up to Apple", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters Breakingviews) - The tech backlash has caught up to Apple. Jana Partners and CalSTRS want the $900 billion company to give parents better controls over their kids’ iPhones. It’s an unusual issue for an activist, and apps from Facebook and Snap would make better targets.\nTogether, the hedge fund and teachers’ pension giant want Apple to take responsibility for how its products are affecting children. In a letter to the board on Saturday, the activists - which include the pop star Sting and his wife, Trudie Styler, as advisers - cited research that suggests heavy smartphone use is linked to a rise of depression and suicide among teens and young adults.\nIntroduced more than a decade ago, the iPhone’s popularity has spread to an ever-younger demographic, leaving educators and researchers scrambling to understand how it may be affecting children’s development. Yet other technology outfits are culprits too and provide rich targets. More people have smartphones that run on Google’s Android system than on Apple’s operating system. Facebook and Snapchat’s business models depend on increasing the time spent on mobiles, and target children under the age of 13 with specialized apps.\nIt’s a worthy theme to explore but a departure for Jana. The hedge fund led by Barry Rosenstein is best known for getting tangible results measured in dollars by agitating for things like a sale of Whole Foods or a shake-up of the board of Tiffany. In this case, it’s smartly teaming up with CalSTRS, the largest U.S. public-sector teachers’ pension fund and one that’s increasingly emphasizing social responsibility with its investments. Together the two hold roughly $2 billion worth of Apple stock.\nThe fact Jana is launching a campaign in the more squishy territory of sustainability and ethics could signal a broader shift in the winds. Investors are increasingly pushing companies to address a wider range of issues and risks. Exxon Mobil and climate change is one example. Gender issues and the ability to attract more diverse talent are also issues that are rising to the level of proxies.\nSilicon Valley used to enjoy an exalted status, but questions about the role of social media in the 2016 presidential election and the way digital technologies may threaten jobs and promote monopolies are breeding skepticism. The new focus on Apple shows how much technology has lost its halo.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-09T05:23:00.000+02:00", "crawled": "2018-01-09T09:36:44.424+02:00", "highlightTitle": ""}