{"organizations": [], "uuid": "a09bc61ca2f0b4a724c0a451bd9c742b0bbd0f9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221114218&w=1200&r=LYNXMPEE0A0T4", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-iceh-forsberg/no-nhl-players-no-problem-says-sweden-great-forsberg-idUKKBN1F01EV", "country": "US", "domain_rank": 408, "title": "No NHL players? No problem, says Sweden great Forsberg", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T13:53:00.000+02:00", "replies_count": 0, "uuid": "a09bc61ca2f0b4a724c0a451bd9c742b0bbd0f9f"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-iceh-forsberg/no-nhl-players-no-problem-says-sweden-great-forsberg-idUKKBN1F01EV", "ord_in_thread": 0, "title": "No NHL players? No problem, says Sweden great Forsberg", "locations": [], "entities": {"persons": [{"name": "forsberg", "sentiment": "negative"}, {"name": "forsberg philip o'conn", "sentiment": "neutral"}, {"name": "eurosport", "sentiment": "none"}, {"name": "peter forsberg", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "lillehammer", "sentiment": "none"}, {"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "nhl", "sentiment": "negative"}, {"name": "min read  stockholm", "sentiment": "none"}, {"name": "national hockey league", "sentiment": "none"}, {"name": "stanley cups", "sentiment": "none"}, {"name": "colorado avalanche", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "columbus blue jackets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 54 AM / Updated 17 minutes ago No NHL players? No problem, says Sweden great Forsberg Philip O'Connor 3 Min Read \nSTOCKHOLM (Reuters) - There may be no National Hockey League (NHL) players on show in Pyeongchang but two-time Olympic ice hockey gold medallist Peter Forsberg still expects a great Olympic ice hockey tournament. FILE PHOTO: Colorado Avalanche's Peter Forsberg watches the puck against the Columbus Blue Jackets during the second period of their NHL hockey game in Columbus, Ohio February 11, 2011. REUTERS/Matt Sullivan/File Photo \nAnd if anyone knows about making the most of the NHL’s absence from the Games, it is Forsberg - the last time the league declined to allow its players to take part, he and his Swedish teammates won gold in Lillehammer in 1994. \n“I don’t think you’re going to sit there back home and think ‘this is not a good hockey game.’ I think they’re going to be great hockey games,” Forsberg, 44, told Reuters in an interview. \nForsberg, who went on to win two Stanley Cups in a glittering NHL career, was speaking at an event hosted by Eurosport, where he will be a cornerstone of their Olympic hockey coverage next month. \nWith no pros from North America, the Olympic squads will now mostly be drawn from the European and Russian professional hockey leagues. The Russian team, competing under a neutral flag due to the ban on formal Russian participation imposed over doping violations, are considered favourites for the gold medal. \n“I was a little disappointed in the beginning, but now I‘m kind of over it,” he said of the NHL’s decision not to allow its players to take part. FILE PHOTO: Swedish forward Peter Forsberg of the Colorado Avalanche chokes up as he announces his retirement from the game at a news conference in Denver February 14, 2011. REUTERS/Rick Wilking/File Photo \n“When I won the Olympics in ‘94, there were no NHL players and for me it was one of the biggest tournaments I ever played, so I have that perspective of the tournament - it doesn’t have to be the NHL players,” Forsberg said. \n“But for the players that are going there, they’re playing for their country and it’s still going to be a huge tournament, a lot of people watching and I think it’s going to be a great tournament, even if the NHL is not there.” \nThe NHL said last year it would not release players after for the Games after failing to reach a deal with the International Olympic Committee to cover players’ travel and insurance costs. \nForsberg’s infamous winning penalty against Canada in the 1994 Olympic final was later immortalised on a postage stamp in Sweden, and the former centre said the current crop of Swedish players might be able to repeat that feat. \n“I would say Sweden is up there and has a chance maybe to even to beat Russia, but they have to have a really good tournament if they are going to grab gold or silver,” he said. \nForsberg, who also has two World Championship golds in his trophy cabinet, said the fight for podium positions would be a tough one. \n“There’s a lot of teams that have a chance - Canada, the U.S., the Czechs, the Finns are all equal going into the tournament,” he said. “That’s the fun part of going to the Olympics - you never know who’s going to win.” Reporting by Philip O'Connor; editing by Mark Heinrich", "external_links": [], "published": "2018-01-11T13:53:00.000+02:00", "crawled": "2018-01-11T14:11:11.000+02:00", "highlightTitle": ""}