{"organizations": [], "uuid": "ab121903b852f2e2ba1ca781c7b8592434dec608", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-christopher-tower-of-bdo-usa-llp-appointed-to-pcaob-standing-advisory-group.html", "country": "US", "domain_rank": 767, "title": "Christopher Tower of BDO USA, LLP Appointed to PCAOB Standing Advisory Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.926, "site_type": "news", "published": "2018-01-18T18:08:00.000+02:00", "replies_count": 0, "uuid": "ab121903b852f2e2ba1ca781c7b8592434dec608"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-christopher-tower-of-bdo-usa-llp-appointed-to-pcaob-standing-advisory-group.html", "ord_in_thread": 0, "title": "Christopher Tower of BDO USA, LLP Appointed to PCAOB Standing Advisory Group", "locations": [], "entities": {"persons": [{"name": "christopher tower of bdo", "sentiment": "negative"}, {"name": "christopher", "sentiment": "none"}, {"name": "christopher tower", "sentiment": "none"}, {"name": "wayne berson", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "bdo usa", "sentiment": "none"}], "organizations": [{"name": "llp", "sentiment": "negative"}, {"name": "pcaob standing advisory group chicago", "sentiment": "negative"}, {"name": "pcaob", "sentiment": "none"}, {"name": "standing advisory group", "sentiment": "none"}, {"name": "public company accounting advisory board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO--(BUSINESS WIRE)-- BDO USA, LLP, one of the nation's leading accounting and advisory firms, today announced that Christopher Tower, the firm’s national managing partner for audit quality and professional practice, has been appointed to the Standing Advisory Group (SAG) of the Public Company Accounting Advisory Board (PCAOB). Made up of representatives from accounting, auditing, financial reporting, corporate finance, corporate governance and investor groups, the SAG advises the PCAOB on the development of auditing and related professional practice standards.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180118005061/en/\nChristopher Tower, National Managing Partner for Audit Quality and Professional Practice at BDO USA (Photo: Business Wire)\n“I want to congratulate Christopher Tower on being named to the PCAOB’s Standing Advisory Group. Our entire firm takes pride in Christopher being recognized through this tremendous achievement,” said Wayne Berson. “His extensive experience at BDO – having served as the West region managing partner, long tenure on the assurance standard setting and audit committees and his current role leading the firm’s national assurance office and audit quality initiatives – will make him a valuable contributor to the SAG.”\n“At BDO USA, we are committed to delivering quality audits to meet the growing expectations of today’s complex financial reporting challenges. By leveraging leading-edge technology and investing in new innovations we are constantly seeking to improve processes that will enhance audit quality,” said Christopher Tower. “As a member of the PCAOB’s Standing Advisory Group, I will be able to share lessons learned from these efforts and, most importantly, communicate what our clients view as critical information to be shared with investors and other stakeholders.”\nChristopher Tower was appointed national managing partner for audit quality and professional practice at BDO USA in 2016. He previously served on the firm’s board of directors and served as a regional assurance leader for many years. Christopher has over 30 years of public accounting experience serving both private and public companies. His broad experience includes auditing, ICFR attestation, technical accounting advisory, transaction due diligence, and other advisory services. He has substantial experience in managing public offerings and private placements with significant engagements involving initial and secondary stock offerings and debt offerings, as well as securitizations. Over the past decade, Christopher has been an active member of the firm’s assurance committee, audit efficiency task force, audit quality committee and served as a strong advocate for audit quality in his role as liaison to national assurance.\nAbout BDO USA\nBDO is the brand name for BDO USA, LLP, a U.S. professional services firm providing assurance, tax, and advisory services to a wide range of publicly traded and privately held companies. For more than 100 years, BDO has provided quality service through the active involvement of experienced and committed professionals. The firm serves clients through more than 60 offices and over 500 independent alliance firm locations nationwide. As an independent Member Firm of BDO International Limited, BDO serves multi-national clients through a global network of more than 73,000 people working out of 1,500 offices across 162 countries.\nBDO USA, LLP, a Delaware limited liability partnership, is the U.S. member of BDO International Limited, a UK company limited by guarantee, and forms part of the international BDO network of independent member firms. BDO is the brand name for the BDO network and for each of the BDO Member Firms. For more information please visit: www.bdo.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005061/en/\nBDO USA, LLP\nJerry Walsh, (631) 419-9008\njerry@prwalsh.com\nSource: BDO USA, LLP", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bdo.com&esheet=51744583&newsitemid=20180118005061&lan=en-US&anchor=www.bdo.com&index=1&md5=e0c827ae39ad1a623d2634fdbf735aa6", "http://www.businesswire.com/news/home/20180118005061/en/"], "published": "2018-01-18T18:08:00.000+02:00", "crawled": "2018-01-18T20:10:45.009+02:00", "highlightTitle": ""}