{"organizations": [], "uuid": "951f20f2bfa542cba46673874c9a72fcf8efc761", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-harley-davidson-announces-fourth-quarter-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Harley-Davidson Announces Fourth Quarter, Full-Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T14:55:00.000+02:00", "replies_count": 0, "uuid": "951f20f2bfa542cba46673874c9a72fcf8efc761"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-harley-davidson-announces-fourth-quarter-full-year-2017-results.html", "ord_in_thread": 0, "title": "Harley-Davidson Announces Fourth Quarter, Full-Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "milwaukee", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "harley-davidson", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "harley-davidson, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILWAUKEE, Jan. 30, 2018 /PRNewswire/ -- Harley-Davidson, Inc. (NYSE:HOG) fourth quarter 2017 diluted EPS decreased to $0.05 from $0.27 in the fourth quarter of 2016. Fourth quarter 2017 net income was $8.3 million on consolidated revenue of $1.23 billion versus net income of $47.2 million on consolidated revenue of $1.11 billion in the fourth quarter of 2016. Fourth quarter 2017 revenue was up on higher shipments. Net income and EPS were adversely impacted by a $53.1 million income tax charge related to the enactment of the 2017 Tax Cuts and Jobs Act and a $29.4 million pre-tax charge for a voluntary product recall.\nFull-year 2017 diluted EPS decreased to $3.02 from $3.83 in 2016. Full-year net income was $521.8 million on consolidated revenue of $5.65 billion versus net income of $692.2 million on consolidated revenue of $6.00 billion a year ago.\nHarley-Davidson worldwide retail motorcycle sales were down 6.7 percent in 2017 compared to 2016. U.S. retail sales decreased 8.5 percent and international retail sales were down 3.9 percent.\n\"Our actions to address the current environment through disciplined supply and cost management position us well as we drive to achieve our long-term objectives to build the next generation of Harley-Davidson riders globally,\" said Matt Levatich, president and chief executive officer, Harley-Davidson, Inc. \"We finished 2017 with over 32,000 more Harley-Davidson riders in the U.S. than one year ago, and we delivered another year of strong cash generation and cash returns to our shareholders.\"\nObjective to Build Riders Globally\nAs the company executed against its long-term objective to build the next generation of Harley-Davidson riders globally, 57 new international dealer points were added in 2017, and U.S. dealers trained more than 62,000 riders through the Harley-Davidson Riding Academy. The company also maintained its number one 601+cc motorcycle market share position in countries including the U.S., Canada, Japan, Australia and India for 2017.\nThe company also launched its model year 2018 lineup of motorcycles, featuring the all-new, highly-acclaimed Softail® motorcycles featuring the powerful Milwaukee-Eight® engine. Harley-Davidson remains fully committed to investing in product development to inspire new riders through redefining its product in traditional spaces and expanding into new spaces. The company is on target to launch its first electric motorcycle within 18 months. Today, the company announces it will invest more aggressively to lead in the application of electric motorcycle technology to inspire ridership among a new audience.\n\"The EV motorcycle market is in its infancy today, but we believe premium Harley-Davidson electric motorcycles will help drive excitement and participation in the sport globally,\" stated Levatich. \"As we expand our EV capabilities and commitment, we get even more excited about the role electric motorcycles will play in growing our business.\"\nManufacturing Optimization\nHarley-Davidson plans to further improve its manufacturing operations and cost structure by commencing a multi-year manufacturing optimization initiative anchored by the consolidation of its motorcycle assembly plant in Kansas City, Mo. into its plant in York, Pa. The company expects to incur restructuring and other consolidation costs of $170 to $200 million and capital investment of approximately $75 million over the next two years and expects ongoing annual cash savings of $65 to $75 million after 2020.\n\"The decision to consolidate our final assembly plants was made after very careful consideration of our manufacturing footprint and the appropriate capacity given the current business environment. Our Kansas City assembly operations will leave a legacy of safety, quality, collaboration and manufacturing leadership,\" stated Levatich.\nHarley-Davidson Retail Motorcycle Sales\n4 th Quarter\nFull-Year\n2017\n2016\n% Change\n2017\n2016\n% Change\nU.S.\n23,195\n26,077\n(11.1)\n147,972\n161,658\n(8.5)\nCanada\n1,318\n1,257\n4.9\n10,081\n10,203\n(1.2)\nLatin America\n2,449\n2,637\n(7.1)\n9,452\n9,701\n(2.6)\nEMEA\n7,460\n7,891\n(5.5)\n44,935\n45,838\n(2.0)\nAsia Pacific\n7,720\n8,748\n(11.8)\n30,348\n32,889\n(7.7)\nInternational Total\n18,947\n20,533\n(7.7)\n94,816\n98,631\n(3.9)\nWorldwide Total\n42,142\n46,610\n(9.6)\n242,788\n260,289\n(6.7)\nIn the fourth quarter, Harley-Davidson worldwide retail motorcycle sales declined 9.6 percent versus the prior year. Harley-Davidson U.S. retail motorcycle sales were down 11.1 percent and the overall industry was down 6.5 percent compared to the year-ago quarter. Harley-Davidson U.S. market share was 50.8 percent in the 601+cc segment in the fourth quarter.\nMotorcycles and Related Products Segment Results\n$ in thousands\n4 th Quarter\nFull-Year\n2017\n2016\n% Change\n2017\n2016\n% Change\nMotorcycle Shipments (vehicles)\n47,198\n42,414\n11.3\n241,498\n262,221\n(7.9)\nRevenue\nMotorcycles\n$801,726\n$685,047\n17.0\n$3,825,206\n$4,122,113\n(7.2)\nParts & Accessories\n$168,131\n$169,445\n(0.8)\n$804,363\n$842,637\n(4.5)\nGeneral Merchandise\n$71,236\n$72,919\n(2.3)\n$262,776\n$284,583\n(7.7)\nGross Margin Percent\n30.9%\n30.7%\n0.2 pts.\n33.6%\n35.1%\n(1.5) pts.\nOperating Income\n$37,821\n$9,271\n307.9\n$615,958\n$773,406\n(20.4)\nOperating Margin Percent\n3.6%\n1.0%\n2.6 pts.\n12.5%\n14.7%\n(2.2) pts.\nFourth quarter revenue from motorcycles and related products was up versus the prior year behind higher motorcycle shipments. Operating margin as a percent of revenue increased in the quarter compared to the same period in 2016.\nFinancial Services Segment Results\n$ in thousands\n4 th Quarter\nFull-Year\n2017\n2016\n% Change\n2017\n2016\n% Change\nRevenue\n$181,883\n$177,577\n2.4\n$732,197\n$725,082\n1.0\nOperating Income\n$63,674\n$60,139\n5.9\n$275,305\n$275,530\n(0.1)\nFinancial services operating income increased 5.9 percent in the fourth quarter compared to the year ago period.\nIncome Tax Rate\nFor 2017, Harley-Davidson's effective tax rate was 39.6 percent compared to 32.4 percent in the prior year. The increased tax rate was largely due to the impact of the write-down of deferred tax assets related to the 2017 Tax Cuts and Jobs Act.\nThe Company expects its 2018 full-year effective tax rate to be approximately 23.5 to 25.0 percent, down considerably behind the expected benefit of the new tax legislation.\nOther Results\nCash and marketable securities were $687.5 million at the end of 2017, compared to $765.5 million at the end of 2016. Harley-Davidson generated $1.01 billion of cash from operating activities in 2017 compared to $1.17 billion in 2016. On a discretionary basis, Harley-Davidson repurchased 8.7 million shares of its common stock at a cost of $456.1 million during 2017. During the fourth quarter of 2017, 169.2 million weighted-average diluted common shares were outstanding. At the end of 2017, 10.6 million shares remained on a board-approved share repurchase authorization.\n2018 Outlook\nFor 2018, Harley-Davidson anticipates full-year motorcycle shipments to be approximately 231,000 to 236,000 motorcycles. In the first quarter of 2018, Harley-Davidson expects to ship approximately 60,000 to 65,000 motorcycles.\nHarley-Davidson expects full-year 2018 operating margin as a percent of revenue to be approximately 9.5 to 10.5 percent including manufacturing optimization costs of $120 to $140 million.\nThe company anticipates 2018 capital expenditures of $250 million to $270 million which includes approximately $50 million to support manufacturing optimization.\nCompany Background\nHarley-Davidson, Inc. is the parent company of Harley-Davidson Motor Company and Harley-Davidson Financial Services. Since 1903, Harley-Davidson Motor Company has fulfilled dreams of personal freedom with custom, cruiser and touring motorcycles, riding experiences and events and a complete line of Harley-Davidson motorcycle parts, accessories, general merchandise, riding gear and apparel. Harley-Davidson Financial Services provides wholesale and retail financing, insurance, extended service and other protection plans and credit card programs to Harley-Davidson dealers and riders in the U.S., Canada and other select international markets. For more information, visit Harley-Davidson's Web site at www.harley-davidson.com .\nConference Call and Webcast Presentation\nHarley-Davidson will discuss fourth quarter and full-year 2017 results on a webcast at 8:00 a.m. CT today. The webcast login and supporting slides can be accessed at http://investor.harley-davidson.com/news-and-events/events-and-presentations . The audio will be posted by approximately 10:00 a.m. CT.\nForward-Looking Statements\nThe company intends that certain matters discussed in this release are \" \" intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These can generally be identified as such because the context of the statement will include words such as the company \"believes,\" \"anticipates,\" \"expects,\" \"plans,\" or \"estimates\" or words of similar meaning. Similarly, statements that describe future plans, objectives, outlooks, targets, guidance or goals are also . Such are subject to certain risks and uncertainties that could cause actual results to differ materially, unfavorably or favorably, from those anticipated as of the date of this release. Certain of such risks and uncertainties are described below. Shareholders, potential investors, and other readers are urged to consider these factors in evaluating the and cautioned not to place undue reliance on such . The included in this release are only made as of the date of this release, and the company disclaims any obligation to publicly update such to reflect subsequent events or circumstances.\nThe company's ability to meet the targets and expectations noted depends upon, among other factors, the company's ability to (i) execute its business strategy, (ii) execute its strategy of growing ridership, globally, (iii) effectively execute its manufacturing optimization initiative within expected costs and timing, (iv) develop and introduce products, services and experiences that are successful in the marketplace, (v) manage the impact that prices for and supply of used motorcycles may have on its business, including on retail sales of new motorcycles, (vi) balance production volumes for its new motorcycles with consumer demand, including in circumstances where competitors may be supplying new motorcycles to the market in excess of demand at reduced prices, (vii) manage through changes in general economic and business conditions, including changing capital, credit and retail markets, and the changing political environment, (viii) manage risks that arise through expanding international manufacturing, operations and sales, (ix) successfully execute the company's manufacturing strategy, including its flexible production strategy, (x) prevent and detect any issues with its motorcycles or any associated manufacturing processes to avoid delays in new model launches, recall campaigns, regulatory agency investigations, increased warranty costs or litigation and adverse effects on its reputation and brand strength, and carry out any product programs or recalls within expected costs and timing, (xi) continue to manage the relationships and agreements that the company has with its labor unions to help drive long-term competitiveness, (xii) accurately estimate and adjust to fluctuations in foreign currency exchange rates, interest rates and commodity prices, (xiii) manage the credit quality, the loan servicing and collection activities, and the recovery rates of HDFS' loan portfolio, (xiv) retain and attract talented employees, (xv) prevent a cybersecurity breach involving consumer, employee, dealer, supplier, or company data and respond to evolving regulatory requirements regarding data security, (xvi) continue to develop the capabilities of its distributors and dealers and manage the risks that its independent dealers may have difficulty obtaining capital and managing through changing economic conditions and consumer demand, (xvii) adjust to tax reform, healthcare inflation and reform and pension reform, and successfully estimate the impact of any such reform on the company's business, (xviii) manage through the effects inconsistent and unpredictable weather patterns may have on retail sales of motorcycles, (xix) manage supply chain issues, including quality issues and any unexpected interruptions or price increases caused by raw material shortages or natural disasters, (xx) implement and manage enterprise-wide information technology systems, including systems at its manufacturing facilities, (xxi) manage changes and prepare for requirements in legislative and regulatory environments for its products, services and operations, (xxii) manage its exposure to product liability claims and commercial or contractual disputes, and (xxiii) successfully access the capital and/or credit markets on terms (including interest rates) that are acceptable to the company and within its expectations.\nIn addition, the company could experience delays or disruptions in its operations as a result of work stoppages, strikes, natural causes, terrorism or other factors. Other factors are described in risk factors that the company has disclosed in documents previously filed with the Securities and Exchange Commission.\nThe company's ability to sell its motorcycles and related products and services and to meet its financial expectations also depends on the ability of the company's independent dealers to sell its motorcycles and related products and services to retail customers. The company depends on the capability and financial capacity of its independent dealers and distributors to develop and implement effective retail sales plans to create demand for the motorcycles and related products and services they purchase from the company. In addition, the company's independent dealers and distributors may experience difficulties in operating their businesses and selling Harley-Davidson motorcycles and related products and services as a result of weather, economic conditions or other factors.\nHarley-Davidson, Inc.\nCondensed Consolidated Statements of Income\n(In thousands, except per share amounts)\n(Unaudited)\n(Unaudited)\n(Unaudited)\nThree months ended\nTwelve months ended\nDecember 31,\nDecember 31,\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nMotorcycles and related products revenue\n$ 1,047,045\n$ 933,023\n$ 4,915,027\n$ 5,271,376\nGross profit\n323,261\n286,809\n1,653,344\n1,851,666\nSelling, administrative and engineering expense\n285,440\n277,538\n1,037,386\n1,078,260\nOperating income from motorcycles & related products\n37,821\n9,271\n615,958\n773,406\nFinancial services revenue\n181,883\n177,577\n732,197\n725,082\nFinancial services expense\n118,209\n117,438\n456,892\n449,552\nOperating income from financial services\n63,674\n60,139\n275,305\n275,530\nOperating income\n101,495\n69,410\n891,263\n1,048,936\nInvestment income\n1,041\n891\n3,580\n4,645\nInterest expense\n7,709\n7,702\n31,004\n29,670\nIncome before income taxes\n94,827\n62,599\n863,839\n1,023,911\nProvision for income taxes\n86,513\n15,420\n342,080\n331,747\nNet income\n$ 8,314\n$ 47,179\n$ 521,759\n$ 692,164\nEarnings per common share:\nBasic\n$ 0.05\n$ 0.27\n$ 3.03\n$ 3.85\nDiluted\n$ 0.05\n$ 0.27\n$ 3.02\n$ 3.83\nWeighted-average common shares:\nBasic\n168,271\n176,616\n171,995\n179,676\nDiluted\n169,195\n177,642\n172,932\n180,535\nCash dividends per common share\n$ 0.365\n$ 0.350\n$ 1.460\n$ 1.400\nHarley-Davidson, Inc.\nCondensed Consolidated Balance Sheets\n(In thousands)\n(Unaudited)\nDecember 31,\nDecember 31,\n2017\n2016\nASSETS\nCurrent assets:\nCash and cash equivalents\n$ 687,521\n$ 759,984\nMarketable securities\n-\n5,519\nAccounts receivable, net\n329,986\n285,106\nFinance receivables, net\n2,105,662\n2,076,261\nInventories\n538,202\n499,917\nRestricted cash\n47,518\n52,574\nOther current assets\n175,853\n174,491\nTotal current assets\n3,884,742\n3,853,852\nFinance receivables, net\n4,859,424\n4,759,197\nOther long-term assets\n1,228,506\n1,277,191\n$ 9,972,672\n$ 9,890,240\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable & accrued liabilities\n$ 757,419\n$ 721,970\nShort-term debt\n1,273,482\n1,055,708\nCurrent portion of long-term debt, net\n1,127,269\n1,084,884\nTotal current liabilities\n3,158,170\n2,862,562\nLong-term debt, net\n4,587,258\n4,666,975\nPension and postretirement healthcare liabilities\n173,359\n257,709\nOther long-term liabilities\n209,608\n182,836\nTotal shareholders' equity\n1,844,277\n1,920,158\n$ 9,972,672\n$ 9,890,240\nHarley-Davidson, Inc.\nCondensed Consolidated Statements of Cash Flows\n(In thousands)\n(Unaudited)\nTwelve months ended\nDecember 31,\nDecember 31,\n2017\n2016\nNet cash provided by operating activities\n$ 1,005,061\n$ 1,174,339\nCash flows from investing activities:\nCapital expenditures\n(206,294)\n(256,263)\nFinance receivables, net\n(363,637)\n(489,464)\nProceeds from sale of finance receivables\n-\n312,571\nNet change in marketable securities\n6,916\n40,014\nOther\n547\n411\nNet cash used by investing activities\n(562,468)\n(392,731)\nCash flows from financing activities:\nProceeds from issuance of medium-term notes\n893,668\n1,193,396\nRepayments of medium-term notes\n(800,000)\n(451,336)\nRepayments of securitization debt\n(444,671)\n(665,400)\nNet increase (decrease) in credit facilities and unsecured commercial paper\n212,809\n(145,812)\nBorrowings of asset-backed commercial paper\n469,932\n62,396\nRepayments of asset-backed commercial paper\n(176,227)\n(71,500)\nNet change in restricted cash\n8,458\n43,495\nDividends paid\n(251,862)\n(252,321)\nPurchase of common stock for treasury\n(465,263)\n(465,341)\nExcess tax benefits from share-based payments\n-\n2,251\nIssuance of common stock under employee stock option plans\n11,353\n15,782\nNet cash used by financing activities\n(541,803)\n(734,390)\nEffect of exchange rate changes on cash and cash equivalents\n26,747\n(9,443)\nNet (decrease) increase in cash and cash equivalents\n$ (72,463)\n$ 37,775\nCash and cash equivalents:\nCash and cash equivalents - beginning of period\n$ 759,984\n$ 722,209\nNet (decrease) increase in cash and cash equivalents\n(72,463)\n37,775\nCash and cash equivalents - end of period\n$ 687,521\n$ 759,984\nMotorcycles and Related Products Revenue and\nMotorcycle Shipment Data\n(Unaudited)\n(Unaudited)\n(Unaudited)\nThree months ended\nTwelve months ended\nDecember 31,\nDecember 31,\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nMOTORCYCLES AND RELATED PRODUCTS REVENUE (in thousands)\nMotorcycles\n$ 801,726\n$ 685,047\n$ 3,825,206\n$ 4,122,113\nParts & Accessories\n168,131\n169,445\n804,363\n842,637\nGeneral Merchandise\n71,236\n72,919\n262,776\n284,583\nOther\n5,952\n5,612\n22,682\n22,043\n$ 1,047,045\n$ 933,023\n$ 4,915,027\n$ 5,271,376\nMOTORCYCLE SHIPMENTS:\nUnited States\n26,475\n20,131\n144,893\n161,839\nInternational\n20,723\n22,283\n96,605\n100,382\nTotal\n47,198\n42,414\n241,498\n262,221\nMOTORCYCLE PRODUCT MIX:\nTouring\n19,353\n17,943\n99,745\n107,410\nCruiser\n19,651\n14,852\n87,344\n93,422\nSportster ® / Street\n8,194\n9,619\n54,409\n61,389\nTotal\n47,198\n42,414\n241,498\n262,221\nWorldwide Retail Sales of Harley-Davidson Motorcycles (1)\nThree months ended\nTwelve months ended\nDecember 31,\nDecember 31,\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nUnited States\n23,195\n26,077\n147,972\n161,658\nEurope (2)\n6,462\n6,734\n39,773\n39,942\nEMEA - Other\n998\n1,157\n5,162\n5,896\nTotal EMEA\n7,460\n7,891\n44,935\n45,838\nJapan\n2,512\n2,648\n9,506\n10,279\nAsia Pacific - Other\n5,208\n6,100\n20,842\n22,610\nTotal Asia Pacific\n7,720\n8,748\n30,348\n32,889\nLatin America\n2,449\n2,637\n9,452\n9,701\nCanada\n1,318\n1,257\n10,081\n10,203\nTotal International Retail Sales\n18,947\n20,533\n94,816\n98,631\nTotal Worldwide Retail Sales\n42,142\n46,610\n242,788\n260,289\n(1) Data source for retail sales figures shown above is new sales warranty and registration information provided by Harley-Davidson dealers and compiled by the Company. The Company must rely on information that its dealers supply concerning new retail sales, and the Company does not regularly verify the information that its dealers supply. This information is subject to revision.\n(2) Europe data includes Austria, Belgium, Denmark, Finland, France, Germany, Greece, Italy, Luxembourg, Netherlands, Norway, Portugal, Spain, Sweden, Switzerland, and the United Kingdom.\nMotorcycle Registration Data (1)\nTwelve months ended\nDecember 31,\nDecember 31,\n2017\n2016\nUnited States (2)\n288,802\n311,710\nEurope (3)\n390,619\n391,936\n(1) Data includes on-road 601+cc models. On-road 601+cc models include dual purpose models, three-wheeled motorcycles and autocycles.\n(2) United States data is derived from information provided by Motorcycle Industry Council (MIC). This third-party data is subject to revision and update.\n(3) Europe data includes Austria, Belgium, Denmark, Finland, France, Germany, Greece, Italy, Luxembourg, Netherlands, Norway, Portugal, Spain, Sweden, Switzerland, and the United Kingdom. Industry retail motorcycle registration data includes 601+cc models derived from information provided by Association des Constructeurs Europeens de Motocycles (ACEM), an independent agency. This third-party data is subject to revision and update.\nView original content: http://www.prnewswire.com/news-releases/harley-davidson-announces-fourth-quarter-full-year-2017-results-300589869.html\nSOURCE Harley-Davidson, Inc.", "external_links": ["http://www.harley-davidson.com/", "http://www.prnewswire.com/news-releases/harley-davidson-announces-fourth-quarter-full-year-2017-results-300589869.html", "http://investor.harley-davidson.com/news-and-events/events-and-presentations"], "published": "2018-01-30T14:55:00.000+02:00", "crawled": "2018-01-30T15:36:43.024+02:00", "highlightTitle": ""}