{"organizations": [], "uuid": "8649cffa1fb5a372e3a42ba316363e2eeec2bbf5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-usa-healthcare-medicaid-kentucky/u-s-sued-over-approval-of-kentucky-medicaid-work-provisions-idUSKBN1FD2NP", "country": "US", "domain_rank": 408, "title": "U.S. sued over approval of Kentucky Medicaid work provisions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T20:27:00.000+02:00", "replies_count": 0, "uuid": "8649cffa1fb5a372e3a42ba316363e2eeec2bbf5"}, "author": "", "url": "https://www.reuters.com/article/us-usa-healthcare-medicaid-kentucky/u-s-sued-over-approval-of-kentucky-medicaid-work-provisions-idUSKBN1FD2NP", "ord_in_thread": 0, "title": "U.S. sued over approval of Kentucky Medicaid work provisions", "locations": [], "entities": {"persons": [{"name": "brendan pierson", "sentiment": "none"}, {"name": "bernadette baum", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "kentucky medicaid", "sentiment": "negative"}, {"name": "u.s. department of health and services", "sentiment": "none"}, {"name": "medicaid", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 6:28 PM / in 22 minutes U.S. sued over approval of Kentucky Medicaid work provisions Brendan Pierson 3 Min Read \n(Reuters) - A group of Kentucky residents has filed a lawsuit challenging the federal government’s approval of new state requirements that people must work or get jobs training if they are to receive benefits from the state’s Medicaid health insurance program. \nThe proposed class action lawsuit, filed in Washington federal court against the U.S. Department of Health and Services (HHS), says the agency exceeded its authority under the federal Medicaid law when it approved Kentucky’s requirements earlier this month. \nA spokesman for the Centers for Medicare & Medicaid Services, the branch of HHS that oversees Medicaid, declined to comment. The office of Kentucky governor Matt Bevin did not immediately respond to a request for comment. \nKentucky’s new requirements mandate that able-bodied Medicaid recipients participate in at least 80 hours a month of “employment activities,” including jobs training, education and community service. The rules cover people from 19 to 64 years old, exempting some groups including pregnant women and former foster care youth. \nThey were approved through a process that allows states to receive “waivers” from federal Medicaid law in order to test new approaches to the 50-year-old program. \nThe plaintiffs said in their complaint that Kentucky has “effectively rewritten” the federal Medicaid law, “threatening irreparable harm to the health and welfare of the poorest and most vulnerable in our country.” \nThe state’s new program, which it plans to begin implementing in July, also imposes premiums on most Medicaid recipients based on income. Some who miss a payment or fail to re-enroll will be locked out for six months. \nWednesday’s lawsuit challenges those requirements as well. \nIt was filed by 15 Kentucky Medicaid recipients and seeks to represent a class of Kentucky residents enrolled in the program since Jan. 18. \nAttorneys at the National Health Law Program and Southern Poverty Law Center, left-leaning national advocacy groups, are among those representing the plaintiffs in the case. \nKentucky was among the 31 states that expanded Medicaid to those earning up to 138 percent of the federal poverty level under the Affordable Care Act, former Democratic President Barack Obama’s signature domestic policy achievement. \nMore than 400,000 Kentucky residents gained health insurance through the program, the highest growth rate of Medicaid coverage of any state. \nAt least nine additional states, mostly Republican-led, have proposed similar changes to Medicaid: Arizona, Arkansas, Indiana, Kansas, Maine, New Hampshire, North Carolina, Utah and Wisconsin. Reporting By Brendan Pierson in New York; Editing by David Gregorio, Bernadette Baum and Susan Thomas", "external_links": [], "published": "2018-01-24T20:27:00.000+02:00", "crawled": "2018-01-24T20:40:11.009+02:00", "highlightTitle": ""}