{"organizations": [], "uuid": "cffda0d0683c658761312dccb30faa45fcc409ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-sasol-limited-trading-statement-for-the-six-months-ended-31-december-2017.html", "country": "US", "domain_rank": 767, "title": "Sasol Limited- Trading Statement for the Six Months Ended 31 December 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.282, "site_type": "news", "published": "2018-01-23T11:08:00.000+02:00", "replies_count": 0, "uuid": "cffda0d0683c658761312dccb30faa45fcc409ba"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-sasol-limited-trading-statement-for-the-six-months-ended-31-december-2017.html", "ord_in_thread": 0, "title": "Sasol Limited- Trading Statement for the Six Months Ended 31 December 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "johannesburg", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "sasol", "sentiment": "negative"}, {"name": "sasol limited", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG, January 23, 2018 /PRNewswire/ --\nSasol's headline earnings per share (HEPS) for the six months ended 31 December 2017 are expected to increase by between 12% and 17% (approximating R1,81 to R2,57 per share) compared to the 2017 financial half year (prior period) HEPS of R15,12. Core HEPS [1] are expected to increase by between 1% and 6% compared to the prior period CHEPS of R17,41. Earnings per share (EPS) for the same period are expected to decrease by between 20% and 25% (approximately R2,84 to R3,55 per share) from the prior period EPS of R14,21.\nSasol is expected to deliver a largely strong set of results, underpinned by a satisfactory operational performance across most of the value chain, higher crude oil and product prices and increased demand for our specialty chemicals products. Our results were however constrained by poor economic conditions in South Africa, which impacted on demand for our products, a less than satisfactory operational performance at our Natref operations, a much stronger closing rand/US dollar exchange rate and the negative impact of remeasurement and once-off item charges.\nAverage Brent crude oil prices moved higher by 19% and since December 2017, spot prices have moved closer to the US$70/bbl mark, which if sustained at these levels, are expected to positively impact our results during the second half of financial year 2018. Similarly, our refining margins increased by 16% to US$9,73/bbl. We have also seen a steady increase in most commodity chemical prices. Despite the volatile macro-economic environment, average margins for most of our specialty chemicals products increased over the first six months ended 31 December 2017.\nSales and production performance are summarised as follows:\nNormalised sales volumes increased by 3% for our Performance Chemicals business spurred by increased market demand; Base Chemicals business reported a 1% decrease in normalised sales volumes attributable to delays at a port in South Africa and the impact of Hurricane Harvey in the US. Sales volumes lost as a result of the port constraint are expected to be recovered during the second half of the financial year; Production volumes from our Secunda Synfuels Operations decreased by 1% due to a planned shutdown. The Secunda Synfuels production volume trend is still in line with our planned 2018 production targets; Our Eurasian Operations increased production volumes by 2% on the back of stronger product demand and increased plant availability; Production volumes of 63kt from our FT Wax facility were achieved and are in line with market guidance; Natref's production volumes were down 21% owing to plant shutdowns and an unexpected Eskom electricity supply interruption at the start of the financial period. This, together with softer market demand, lowered our liquid fuels sales volumes by 3%; ORYX GTL continued to deliver an exceptional performance, with an average utilisation rate of 99%; Our mining operations were interrupted in December 2017 due to a tragic fatality at our Syferfontein Colliery which resulted in lower than expected production volumes. We are currently restoring the coal stockpile through our own production and additional external purchases to ensure continued supply to the Sasol integrated value chain. We are making steady progress with our LCCP project in Lake Charles. At 31 December 2017, capital expenditure amounted to US$8,8 billion, and the overall project completion was 81%. The total forecast capital cost for the project remains within the previous market guidance of US$11,13 billion and project progress is tracking the approved schedule. The recent tax reform changes in the US will have a positive impact on the returns of the asset and are expected to provide increased value to shareholders. More detail on the impact of the tax reform changes will be shared with the interim results to be released on 26 February 2018.\nSasol´s earnings for the six months ended 31 December 2017 will be impacted by the following notable once off and period close items:\nHEPS EPS Rand per Rand per share share Translation losses arising from a stronger closing rand/US dollar market exchange rate at 31 December 2017 (R1,34) (R1,34) Mark-to-market valuation of commodity and foreign exchange hedges using a forward rate at 31 December 2017 R0,79 R0,79 Net remeasurement items - (R6,37)\nIncluded in remeasurement items is an impairment of our US GTL project amounting to R1,1 billion (US$83 million) and a partial impairment of our Canadian shale gas assets of R2,8 billion (CAD281 million), driven mainly by the depressed gas market outlook.\nThe effective corporate tax rate increased from 28% in the prior year to 31% mainly due to the impairment of our Canadian shale gas assets. The tax litigation matter in respect of our crude oil procurement process is ongoing and there are no further significant developments.\nCore HEPS [ (1) ] are expected to range between an increase by 1% and 6% compared to the prior period, mainly as a result of higher crude oil and product prices, higher margins in specialty chemicals and improved refining margins, partially offset by the stronger rand/US dollar exchange rate. The increase/(decrease) to Core HEPS is as follows:\nHalf year Half year 2018 2017 Rand per Rand per share share Translation impact of closing exchange rate R1,34 R0,37 Mark-to-market valuation of oil and foreign exchange hedges (R0,79) R1,44 Once-off Uzbekistan licence fee - (R0,58) Strike action at Sasol Mining and related costs - R1,06\nA detailed summary of production and key business performance metrics for the financial half year for all our businesses is available on our website, http://www.sasol.com .\nKey macro-economic summary\nHalf year Half year 2018 2017 % change Rand/US dollar average exchange rate 13,40 13,99 (4) Rand/US dollar closing exchange rate 12,37 13,74 (10) Average dated brent crude oil price (US dollar / bbl) 56,74 47,68 19 Refining margin (US dollar / bbl) 9,73 8,42 16 Henry Hub gas price (US dollar / million British thermal unit) 2,93 2,95 (1)\nOur results for the first half of the 2018 financial year may be further affected by adjustments resulting from our half year-end closure process. This could result in a change in the estimated earnings noted above. This trading statement only deals with the comparison to the first half of the 2017 financial year.\nThe financial information on which this trading statement is based has not been reviewed and reported on by the Company's external auditors. Sasol's financial results for the six months ended 31 December 2017 will be announced on Monday, 26 February 2018.\nDisclaimer – Forward-looking statements: Sasol may, in this document, make certain statements that are not historical facts and relate to analyses and other information which are based on forecasts of future results and estimates of amounts not yet determinable. These statements may also relate to our future prospects, developments and business strategies. Examples of such forward-looking statements include, but are not limited to, statements regarding exchange rate fluctuations, volume growth, increases in market share, total shareholder return, executing our growth projects, (including LCCP), oil and gas reserves and cost reductions, including in connection with our BPEP, RP and our business performance outlook. Words such as “believe”, “anticipate”, “expect”, “intend\", “seek”, “will”, “plan”, “could”, “may”, “endeavour”, “target”, “forecast” and “project” and similar expressions are intended to identify such forward-looking statements, but are not the exclusive means of identifying such statements. By their very nature, forward-looking statements involve inherent risks and uncertainties, both general and specific, and there are risks that the predictions, forecasts, projections and other forward-looking statements will not be achieved. If one or more of these risks materialise, or should underlying assumptions prove incorrect, our actual results may differ materially from those anticipated. You should understand that a number of important factors could cause actual results to differ materially from the plans, objectives, expectations, estimates and intentions expressed in such forward-looking statements. These factors are discussed more fully in our most recent annual report on Form 20-F filed on 28 August 2017 and in other filings with the United States Securities and Exchange Commission. The list of factors discussed therein is not exhaustive; when relying on forward-looking statements to make investment decisions, you should carefully consider both these factors and other uncertainties and events. Forward-looking statements apply only as of the date on which they are made, and we do not undertake any obligation to update or revise any of them, whether as a result of new information, future events or otherwise.", "external_links": [], "published": "2018-01-23T11:08:00.000+02:00", "crawled": "2018-01-23T11:59:46.002+02:00", "highlightTitle": ""}