{"organizations": [], "uuid": "50637d4ac48866fb768499801ad5ede944c7540c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 26, "shares": 26, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104923851-GettyImages-899826860.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/03/iranian-protesters-need-trump-to-keep-tweeting-commentary.html", "country": "US", "domain_rank": 767, "title": "Iranian protesters need Trump to keep tweeting—Commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T15:38:00.000+02:00", "replies_count": 0, "uuid": "50637d4ac48866fb768499801ad5ede944c7540c"}, "author": "Jake Novak", "url": "https://www.cnbc.com/2018/01/03/iranian-protesters-need-trump-to-keep-tweeting-commentary.html", "ord_in_thread": 0, "title": "Iranian protesters need Trump to keep tweeting—Commentary", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "mike pence", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "e.u.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After a week of massive protests in Iran that have so far left 21 people dead, the grass roots uprising against the country's autocratic regime is showing no signs of slowing.\nIn fact, the protests that began last week are spreading geographically and with varying degrees of intensity. While lacking a singular message, demonstrators' ire is clearly focused on the Islamist regime.\nThe question is: What should the rest of the world do about it?\nThat's actually a question for the U.S., since few others will make a substantive move without taking a cue from the White House. In fact, Europe probably cannot be relied on to do much of anything at all since so many E.U. nations have tight economic ties to the Islamist regime; ties that became even tighter as soon as the nuclear deal was sealed in 2016.\nThe answer for the Trump team comes from that old adage about how 80 percent of life is just showing up. In this case, \"showing up\" means making sure the protesters in Iran are never in doubt that the U.S. supports them.\nSo far, President Trump and Vice President Mike Pence have done just that with multiple tweets, backed up by an official State Department statement.\nThat may not seem substantial, but the recent track record on these kinds of issues says otherwise. Widespread protests against the Iranian government that erupted in 2009 eventually died when the government responded harshly. Just when public support from the Obama administration was needed most, none came.\n\"The answer for the Trump team comes from that old adage about how 80 percent of life is just showing up. In this case, \"showing up\" means making sure the protesters in Iran are never in doubt that the U.S. supports them.\" Even former chairman of the Joint Chiefs under President Obama Mike Mullen said in a TV interview this weekend that, \"I think we chose to not be as supportive as we could have been then. And I hope we can be right now so that Iran can continue to evolve.\"\nThat was in sharp contrast to President Obama's strong vocal support for pro-democracy protesters in Egypt in 2011 during the so-called Arab Spring. Obama's encouraging words for those protesters bolstered them as they eventually succeeded in carrying out a more democratic election. Two years later, Obama switched to the silent treatment. He backed away from that new Egyptian government, led by the Muslim Brotherhood, and signaled with his silence that the U.S. would not move to block a military coup d'etat.\nWhen it comes to U.S. presidents, words and the lack of words really do matter.\nBut several former Obama administration officials are publicly calling for President Trump to stay silent about the Iran protests. They say the Iranian people are so generally opposed to President Trump that his support for the protests will kill their chances for success.\nSadly, that argument is embarrassing. Are Trump's enemies in this country so deluded as to believe that his open support would actually taint the Iranian people's desire for more democracy, a stronger economy, women's rights and free speech? Many of these protesters aren't even letting the Islamist leaders get away with using the age-old Arab-Israeli conflict as an excuse to deflect from their domestic corruption.\nTo that end, there is absolutely nothing these protesters are asking for that the U.S. under any president shouldn't be publicly supporting. Again by contrast, the 2011 Egyptian protest movement was much more fraught with voices calling for more Islamism or repression of women. These Iranian protests may be a lot less organized and focused, but no ideological red flags are evident right now.\nDoes the Trump team need to do more than tweet and make statements? Absolutely. Some of the other strategies should include working to remotely restore internet service in Iran using satellites , and at least trying to identify and contact some actual leaders of this protest movement.\nA more aggressive follow up could be to stretch the mullahs to the brink by ramping up military opposition to Iran's proxies in Syria, Lebanon, and Yemen. The U.S. has been in a basic state of war with Iran since 1979 with billions of dollars and many lives lost on both sides. The idea than any of those added efforts are some kind of wild escalation of hostilities between our two countries ignores the hard facts.\nBut those moves are basically the other 20 percent. It's easy to say public statements of support don't add up to much, but that sentiment has been proven wrong by Egypt's recent history and the Trump team's even more recent recognition of Jerusalem as Israel's true capital. With that in mind, no wonder Iran's President Hassan Rouhani wants President Trump to keep quiet.\nRouhani wants the protesters to shut up too. Defying him is up to those very courageous people in Iran. Luckily for President Trump, he has a much easier job in not giving Rouhani what he wants. He should keep it up.\nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny .\n Twitter.", "external_links": [], "published": "2018-01-03T15:38:00.000+02:00", "crawled": "2018-01-03T15:52:03.004+02:00", "highlightTitle": ""}