{"organizations": [], "uuid": "f94b449d2d9f14a2fc00c29479705ed073fe2160", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226641186&w=1200&r=LYNXMPEE0T14R", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-athletics-morris/athletics-pole-vaulting-isnt-morris-only-talent-idUSKBN1FJ277", "country": "US", "domain_rank": 408, "title": "Athletics: Pole vaulting isn't Morris' only talent", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T17:46:00.000+02:00", "replies_count": 0, "uuid": "f94b449d2d9f14a2fc00c29479705ed073fe2160"}, "author": "", "url": "https://www.reuters.com/article/us-athletics-morris/athletics-pole-vaulting-isnt-morris-only-talent-idUSKBN1FJ277", "ord_in_thread": 0, "title": "Athletics: Pole vaulting isn't Morris' only talent", "locations": [], "entities": {"persons": [{"name": "morris", "sentiment": "negative"}, {"name": "reno", "sentiment": "none"}, {"name": "sandi morris", "sentiment": "none"}, {"name": "carrie underwood", "sentiment": "none"}], "locations": [{"name": "reno", "sentiment": "none"}, {"name": "fayetteville", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "athletics", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - If Olympic silver medalist Sandi Morris steps up to the microphone and belts out a few tunes at her local club, don’t be surprised.\nPole vaulting isn’t the musically inclined American’s only talent.\nBefore delivering the year’s top pole vault, 4.90 meters, at the recent Pole Vault Summit in Reno, Nevada, Morris took center stage for the national anthem - with a little help.\n“I guess I sang the national anthem with everybody,” Morris, 25, said in a telephone interview from Fayetteville, Arkansas, her hometown.\n“I asked the crowd to sing with me because I was so nervous.”\nHer friends said she was amazing, but Morris would not go that far.\n“I love to sing and I am pretty good at it but I am definitely not Carrie Underwood,” the Olympian told Reuters.\n“I would love to do something like that (in the future) but I don’t know if I am good enough.”\nSo far it as been a few open mic nights at bars and the national anthem in Reno.\nBut music has always been a part of Morris’ life.\n“I taught myself acoustic guitar in high school and I grew up playing the violin in orchestra class so I am a natural with music.”\nThere’s even a pet lizard at home, named Thin Lizzy after the Irish rock band.\nMorris also was a talented volleyball player and still enjoys beach volleyball in the offseason.\nAthletics - World Athletics Championships - Women's Pole Vault Final – London Stadium, London, Britain - August 6, 2017. Sandi Morris of the U.S. in action. REUTERS/Kevin Coombs STIFF COMPETITION The focus at the moment, though, is pole vaulting, and the competition on Saturday at the NYRR Millrose Games in New York City could not be finer.\nGreece’s Olympic gold medalist and world champion Katerina Stefanidi headlines a field that includes Morris, U.S. world indoor pole vault record holder Jenn Suhr, who won the 2012 Olympic gold medal, plus American Katie Nageotte and Canada’s Alysha Newman, both ranked in the top seven globally.\nWorld number one Stefanidi has won the past three Millrose titles with Morris the runner-up last year.\nStefanidi’s 2017 victory touched off a streak of eight consecutive triumphs over her American rival, but Morris is hoping the results will be more balanced this season.\n“I finally feel strong and feel like myself again, whereas last year, I just never quite felt 100 percent,” said the American, who beat Stefanidi in six of their eight meetings in 2016 but lost the big one, the Olympic gold.\nBack issues kept Morris from being as strong in the weight room as she wanted to be in 2017.\n“That makes a big difference,” Morris said. “Being able to lift hard gives you that edge.”\nHer vault in Reno was the highest she has jumped since the middle of 2016 when she cleared five meters.\n“It was definitely a confidence booster,” Morris said of the Reno victory.\nNow comes the challenge of Stefanidi, who won her final 14 competitions last year.\n”We are cordial,“ Morris said of the rivalry. ”We are not friends but we are not necessarily enemies off the track. But we are enemies on the track.\n“It is not like a thing we take personally. We are just very competitive by nature and that is why both of us are Olympic medalists.”\nReporting by Gene Cherry in Salvo, North Carolina; Editing by Christian Radnedge\n ", "external_links": [], "published": "2018-01-30T17:46:00.000+02:00", "crawled": "2018-01-30T17:55:45.000+02:00", "highlightTitle": ""}