{"organizations": [], "uuid": "7f39f6ae8919c6ddaa6f46ccc621a03efb432544", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220610678&w=1200&r=LYNXMPEE081BS", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-yemen-security/yemens-houthis-threaten-to-block-red-sea-shipping-lane-idUKKBN1EY2AX", "country": "US", "domain_rank": 408, "title": "Yemen's Houthis threaten to block Red Sea shipping lane", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:48:00.000+02:00", "replies_count": 0, "uuid": "7f39f6ae8919c6ddaa6f46ccc621a03efb432544"}, "author": "", "url": "https://uk.reuters.com/article/uk-yemen-security/yemens-houthis-threaten-to-block-red-sea-shipping-lane-idUKKBN1EY2AX", "ord_in_thread": 0, "title": "Yemen's Houthis threaten to block Red Sea shipping lane", "locations": [], "entities": {"persons": [{"name": "aziz el yaakoubi", "sentiment": "none"}, {"name": "houthis", "sentiment": "none"}], "locations": [{"name": "red sea", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "bab al-mandab strait", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "hodeidah", "sentiment": "none"}, {"name": "zeyad  yemen", "sentiment": "none"}, {"name": "gulf of aden", "sentiment": "none"}, {"name": "arabian sea", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "suez canal", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "saba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 51 PM / Updated 22 minutes ago Yemen's Houthis threaten to block Red Sea shipping lane Aziz El Yaakoubi 3 Min Read \nDUBAI (Reuters) - Yemen’s armed Houthi movement threatened to block the strategic Red Sea shipping lane if the Saudi-led coalition it is fighting keeps pushing towards the port of Hodeidah it controls, the Houthi-run SABA news agency reported. A ship carrying 5,500 tonnes of flour is towed by a tugboat at the Red Sea port of Hodeidah, Yemen . Picture taken November 26, 2017. REUTERS/Abduljabbar Zeyad \nYemen lies beside the southern mouth of the Red Sea, one of the most important trade routes in the world for oil tankers, which pass near Yemen’s shores while heading from the Middle East through the Suez Canal to Europe. \nWhile SABA gave no details on how Houthis could carry out any such move, the Bab al-Mandab strait, where the Red Sea meets the Gulf of Aden in the Arabian Sea, is only 20 km (12 mile) wide, making hundreds of ships potentially an easy target. \n“If the aggressors keep pushing towards Hodeidah and if the political solution hits wall, there are some strategic choices that will be taken as a no return point, including blocking the international navigation in the Red Sea,” Houthis’ Ansarullah political council chief, Saleh al-Samad, was quoted saying. \n“Their ships pass by our waters while our people starve,” Samad was quoted as saying while he met U.N. officials. \nU.N. officials have been trying to get the two sides back to the negotiating table after talks collapsed 2016. Samad said his movement was ready to give concessions in any political talks in order to stop the bloodshed. \nYemen, one of the Arab world’s poorest countries, is embroiled in a proxy war between the Houthi armed movement, allied with Iran, and a U.S.-backed military coalition headed by Saudi Arabia. \nSome 8 million people are on the brink of famine, more than 10,000 have been killed and tens of thousands of others are struggling with cholera, diphtheria and other diseases. \nThe Saudi-led coalition has been trying since the start of the war in March 2015 to capture Hodeidah, Yemen’s biggest port, which receives 80 percent of Yemen’s imports, and has in recent weeks launched a ground campaign and intensified air strikes. \nOn Tuesday, the United Arab Emirates minister of state for foreign affairs, Anwar Gargash, said on Twitter the threats were another proof of “the terrorist nature of the Houthi militias”, especially as Samad was meeting a U.N. delegation. UAE is a major partner of the military coalition fighting the Houthis. \n“The Houthi who decimated crops and seeds, destroyed Yemen, betrayed his ally and partner, is now threatening the international navigation; we are facing a terrorist gang that the end of its existence in Yemen is nigh,” Gargash said. Reporting by Aziz El Yaakoubi; Editing by Alison Williams", "external_links": [], "published": "2018-01-09T20:48:00.000+02:00", "crawled": "2018-01-09T21:00:56.013+02:00", "highlightTitle": ""}