{"organizations": [], "uuid": "f7531549c996cf7b6dd26c34cc67730670c22411", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-kc-southern-results/kansas-city-southern-quarterly-profit-rises-on-commodity-volumes-idUSKBN1F81HD", "country": "US", "domain_rank": 408, "title": "UPDATE 2-NAFTA future clouds Kansas City Southern earnings beat", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:51:00.000+02:00", "replies_count": 0, "uuid": "f7531549c996cf7b6dd26c34cc67730670c22411"}, "author": "", "url": "https://www.reuters.com/article/us-kc-southern-results/kansas-city-southern-quarterly-profit-rises-on-commodity-volumes-idUSKBN1F81HD", "ord_in_thread": 0, "title": "UPDATE 2-NAFTA future clouds Kansas City Southern earnings beat", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ottensmeyer", "sentiment": "none"}], "locations": [{"name": "kansas city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "kansas city southern", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "kansas city southern", "sentiment": "negative"}, {"name": "nafta", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:19 PM / in 4 minutes NAFTA future clouds Kansas City Southern earnings beat Eric M. Johnson 3 Min Read \n(Reuters) - Kansas City Southern, a U.S. railroad with extensive operations in Mexico, sought to ease investor fears on Friday over the future of the North American Free Trade Agreement, touting forecasts of solid freight volumes and a stronger economy in 2018. \nUncertainty over NAFTA negotiations looms over the Kansas City, Missouri-based company, which dominates cross-border rail trade between the U.S. and Mexico and draws about 30 percent of its revenue from U.S.-Mexico shipments. \n“Next week could be a headline week for Kansas City Southern depending on the sentiment that comes out of negotiations,” the company’s CEO Pat Ottensmeyer told analysts on a conference call after the company posted higher quarterly profit. \nDespite beating on revenue, shares of the railroad were off 2 percent near midday. \nPresident Donald Trump has threatened to withdraw from the accord and the next round of talks is due to begin in Montreal later this month. \n“NAFTA talks are a big overhang,” said Morgan Stanley analyst Ravi Shanker, adding that the railroad’s guidance for its tax rate following the new U.S. tax law and for a tax credit for excise fuel were worse than the market expected. \nKansas City Southern said it expected a strengthening economy and cost control measures backed by strong volumes in grain, petroleum, and Mexican car production, to fuel momentum but said coal volumes would suffer from a coal-fired plant closure in Texas. \n“Ninety percent of our business and commodity portfolio looks like it’s going to be positive for 2018,” Ottensmeyer told analysts. \nShould NAFTA collapse, World Trade Organization rules and tariffs would apply to commodities and products covered by NAFTA, and “those are not horrible,” Ottensmeyer added. \nThe railroad posted fourth-quarter net income of $552 million, or $5.33 per diluted share, up from $130 million, or $1.21 per diluted share a year ago, which it attributed to revenue growth across its energy, automotive and chemical and petroleum units, and included benefits from changes to the U.S. tax code. \nAfter adjustments for one-time items, the railroad said it earned a record $1.38 per share, versus the $1.37 analysts expected. \nIt also achieved fourth quarter revenue of $660 million, with overall carload volumes up 5 percent compared with the prior year. For quarterly revenue, Wall Street analysts expected $656.28 million. \nIts operating ratio, a closely watched measure of operating costs as a percentage of revenue, was 64 percent, compared to 64.8 percent in fourth quarter 2016. A lower operating ratio shows improvement in profitability. Reporting by Eric M. Johnson in Seattle; Editing by Andrew Hay and Phil Berlowitz", "external_links": [], "published": "2018-01-19T17:51:00.000+02:00", "crawled": "2018-01-19T18:06:01.000+02:00", "highlightTitle": ""}