{"organizations": [], "uuid": "ef93b828e6d36bd1f711f524203853e37eb89406", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/31/104980170-GettyImages-471821252.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/vertex-chooses-two-drugs-to-advance-in-cystic-fibrosis-triple-combinations.html", "country": "US", "domain_rank": 767, "title": "Vertex chooses two drugs to advance in cystic fibrosis triple combinations", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.591, "site_type": "news", "published": "2018-01-31T23:01:00.000+02:00", "replies_count": 0, "uuid": "ef93b828e6d36bd1f711f524203853e37eb89406"}, "author": "Meg Tirrell", "url": "https://www.cnbc.com/2018/01/31/vertex-chooses-two-drugs-to-advance-in-cystic-fibrosis-triple-combinations.html", "ord_in_thread": 0, "title": "Vertex chooses two drugs to advance in cystic fibrosis triple combinations", "locations": [], "entities": {"persons": [{"name": "suzanne kreiter", "sentiment": "none"}, {"name": "jeffrey leiden", "sentiment": "none"}], "locations": [], "organizations": [{"name": "vertex", "sentiment": "negative"}, {"name": "modern medicine vertex", "sentiment": "negative"}, {"name": "vertex pharmaceuticals", "sentiment": "none"}, {"name": "boston globe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Modern Medicine Vertex chooses two drugs to advance in cystic fibrosis triple combinations Vertex Pharmaceuticals said it's chosen two medicines to move into final stage testing in combination with two other drugs for cystic fibrosis. This is a key step to extend potential treatment options to 90 percent of patients with the devastating genetic disease. The company plans to start phase 3 clinical trials of compounds called VX-659 and VX-445 as part of two different triple combination regimens this year Suzanne Kreiter | The Boston Globe | Getty Images Jeffrey Leiden, CEO of Vertex Pharmaceuticals. \nVertex Pharmaceuticals said it's chosen which two medicines to move into the final stage of testing in combination with two other drugs for cystic fibrosis, a key step to extending potential treatment options to 90 percent of patients with the devastating genetic disease. \nThe Boston-based biotechnology company plans to start phase 3 clinical trials of compounds called VX-659 and VX-445 as part of two different triple combination regimens this year, Vertex said Wednesday. \nThe move is an important step in Vertex's multi-year goal of expanding treatment options for patients with CF, a rare condition that causes build-up of mucus in the lungs and other organs, causing infections, trouble breathing, and extensive damage. \nThe company already has two medicines for CF on the market that can treat about 30,000 of the 75,000 people with the disease worldwide based on their genetic mutations, and in July saw its stock soar on initial data on three-drug combos that could treat more patients. \nThe decision to move two of those programs forward is based on data from ongoing trials showing they helped improve a measure of lung function, called percent predicted forced expiratory volume in one second, by up to 13.3 and 13.8 percentage points after four weeks of treatment. \nVertex said it's still in discussions with regulators about the design of the phase 3 programs, the final stage of testing generally required before filing for approval. \nVertex shares rose about 4 percent in after-hours trading following the announcement.", "external_links": [], "published": "2018-01-31T23:01:00.000+02:00", "crawled": "2018-01-31T23:02:17.007+02:00", "highlightTitle": ""}