{"organizations": [], "uuid": "b0223d2f7c0aef677e2c6d9f5a09cdbc65802c11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-hungarian-bond-yields-jump-on-irs-tender-forint-leads-easing-idUSL8N1PE3OV", "country": "US", "domain_rank": 408, "title": "CEE MARKETS-Hungarian bond yields jump on IRS tender, forint leads easing", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-19T22:55:00.000+02:00", "replies_count": 0, "uuid": "b0223d2f7c0aef677e2c6d9f5a09cdbc65802c11"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-hungarian-bond-yields-jump-on-irs-tender-forint-leads-easing-idUSL8N1PE3OV", "ord_in_thread": 0, "title": "CEE MARKETS-Hungarian bond yields jump on IRS tender, forint leads easing", "locations": [], "entities": {"persons": [{"name": "sandor peto", "sentiment": "none"}], "locations": [{"name": "hungary", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}], "organizations": [{"name": "irs", "sentiment": "negative"}, {"name": "nbh", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Currencies retreat after hitting multi-year highs vs dollar * Disappointment over IRS tender boosts Hungarian bond yields * Hungary trying to push down borrowing costs (Adds further rise in Hungarian bond yields, Czech parliament vote) By Sandor Peto BUDAPEST, Jan 19 (Reuters) - Hungary's 10-year government bond yield hit a two-month high on Friday due to concern that the central bank's (NBH) new interest rate swap (IRS) facility will not be as cheap as expected. The forint led a weakening of Central European currencies after their surge to multi-year highs against the dollar made the greenback more attractive for investors. The NBH, one of the most dovish central banks in the world, launched the IRS programme and mortgage note buying to push long-term market interest rates lower. The first IRS tender, held on Thursday, disappointed. The offered amount was well below demand and the pricing less cheap than expected, triggering selling in the domestic IRS market, tracked by government bonds. The yield on 10-year bonds rose 10 basis points on Thursday. They added further 10 basis points on Friday, to trade at 2.17 percent, after the NBH said it planned to use the IRS facility evenly for a long period of time, \"with the pricing conditions revealed at the first auction nearly unchanged\". \"It is uncertain, whether they mean the nominal yield level, or the spread (over market levels),\" one fixed income trader said. The forint jumped to a 3-month high against the euro on Thursday as the tender suggested that monetary stimulus may be less aggressive than expected. After that spike it turned into a regional underperformer on Friday against both the euro and the dollar. The dollar is labouring near a three-year low against a basket of global currencies, partly pressured by fears of a possible U.S. government shutdown. The forint and the zloty reached three-year highs and the Czech crown a record high against the greenback earlier this week, and on Friday they were knocked off those levels. The selling also weakened them in their euro crosses. The forint led the fall, shedding half a percent against the euro, to trade at 309.40 at 1431 GMT. The leu eased 0.2 percent, while the zloty and the Czech crown weakened by 0.1 percent. The Czech central bank (CNB) may deliver its third hike since August at its February meeting. A member of its board, Tomas Nidetzky was Quote: d as saying on Friday that two hikes this year could be sufficient. The Czech lower house voted on Friday to allow prosecution of Prime Minister Andrej Babis in a case of alleged EU subsidy fraud. But investors usually ignore political developments in the Czech Republic. CEE SNAPSHOT AT MARKETS 1531 CET CURRENCI ES Latest Previous Daily Change bid close change in 2018 Czech <EURCZK= 25.3930 25.3600 -0.13% +0.59% crown > Hungary <EURHUF= 309.4000 307.9500 -0.47% +0.49% forint > Polish <EURPLN= 4.1688 4.1652 -0.09% +0.18% zloty > Romanian <EURRON= 4.6595 4.6520 -0.16% +0.43% leu > Croatian <EURHRK= 7.4340 7.4400 +0.08% -0.05% kuna > Serbian <EURRSD= 118.4400 118.4300 -0.01% +0.05% dinar > Note: calculated from 1800 CET daily change Latest Previous Daily Change close change in 2018 Prague 1121.38 1119.050 +0.21% +4.01% 0 Budapest 39871.80 39663.92 +0.52% +1.26% Warsaw 2600.35 2591.22 +0.35% +5.65% Bucharest 8361.90 8374.67 -0.15% +7.84% Ljubljana <.SBITOP 832.40 831.33 +0.13% +3.23% > Zagreb 1873.57 1873.87 -0.02% +1.67% Belgrade <.BELEX1 775.29 773.33 +0.25% +2.04% 5> Sofia 709.96 711.20 -0.17% +4.80% BONDS Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year <CZ2YT=R 0.5980 0.0040 +120bps +2bps R> 5-year <CZ5YT=R 1.0430 0.0140 +118bps +2bps R> 10-year <CZ10YT= 1.7600 -0.0090 +119bps -1bps RR> Poland 2-year <PL2YT=R 1.5650 -0.0190 +216bps -1bps R> 5-year <PL5YT=R 2.6390 -0.0180 +278bps -1bps R> 10-year <PL10YT= 3.3140 -0.0160 +274bps -2bps RR> FORWARD RATE AGREEMEN T 3x6 6x9 9x12 3M interban k Czech Rep 1.01 1.19 1.35 0.77 <PRIBOR= > Hungary 0.11 0.18 0.25 0.02 Poland 1.75 1.77 1.85 1.72 Note: FRA are for ask prices Quote: s", "external_links": [], "published": "2018-01-19T22:55:00.000+02:00", "crawled": "2018-01-20T17:34:41.063+02:00", "highlightTitle": ""}