{"organizations": [], "uuid": "c4b8229c371bb84d175295ee62a69c64b8c3483e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221477184&w=1200&r=LYNXMPEE0B152", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-britain-eu-vote/uks-former-brexit-campaign-boss-says-no-desire-for-a-re-run-of-the-eu-referendum-idUKKBN1F11W5", "country": "US", "domain_rank": 408, "title": "UK's former Brexit campaign boss says no desire for a re-run of the EU referendum", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T17:24:00.000+02:00", "replies_count": 0, "uuid": "c4b8229c371bb84d175295ee62a69c64b8c3483e"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-vote/uks-former-brexit-campaign-boss-says-no-desire-for-a-re-run-of-the-eu-referendum-idUKKBN1F11W5", "ord_in_thread": 0, "title": "UK's former Brexit campaign boss says no desire for a re-run of the EU referendum", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "matthew elliott", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 3:25 PM / Updated 20 minutes ago Former Brexit campaign boss says no desire for a re-run of the EU referendum Reuters Staff 3 Min Read \nLONDON (Reuters) - British voters do not want a re-run of the referendum on European Union membership and any hint of another vote undermines the government’s Brexit negotiations, the former CEO of Britain’s main “Leave” campaign told Reuters. FILE PHOTO: Head of Vote Leave, Matthew Elliott, poses for a photograph at the Vote Leave campaign headquarters in London, Britain May 19, 2016. REUTERS/Peter Nicholls/File Photo \nTwo of Britain’s most prominent Brexit campaigners have endorsed a re-run of the referendum as a way to stop EU supporters from trying to water down or even halt Brexit. \nIn the United Kingdom’s 2016 referendum, 51.9 percent, or 17.4 million people, voted to leave the EU while 48.1 percent, or 16.1 million people, voted to stay. \n“There is no desire from the public for a second EU referendum,” said Matthew Elliott, former chief executive of Vote Leave. \n“Any hint of a second referendum will undermine the negotiations, because it will give [EU chief negotiator] Michel Barnier an incentive to present the UK with a bad deal, hoping that Britain votes to stay in, to continue our net contribution to the EU budget.” \nPrime Minister Theresa May clinched a divorce deal last month that paves the way for arduous talks on future trade ties ahead of the United Kingdom’s exit which is due on March 29, 2019. \nNigel Farage, one of the most prominent Brexit campaigners ahead of the referendum, said this week he was warming to the idea of holding a second vote to settle the argument on whether leaving was the right decision or not. \nBut Elliott, who led the official Leave campaign, said Farage was simply seeking publicity. \n“Nigel Farage is clearly craving a publicity fix. He fears irrelevance and can’t stand not seeing his name in the headlines,” Elliott said. \n“He should grow up, and realise that this issue is more important than any one person. It is about implementing the democratically expressed wishes of the British people in a serious and sensible way.” \nElliott praised May for her conduct of the negotiations which are now turning to the details of how Britain will trade with the world’s biggest trading bloc after Brexit. \n“Theresa May and her government are doing a good job in the negotiations and we should give them our full support,” he said. “Bickering and carping from the sidelines undermines the national interest at this important juncture in the talks.” \nOn Thursday, a ComRes poll for the Daily Mirror newspaper of 1,049 adults showed that although more people think there should not be a second referendum (51 to 43 percent), if there were to be a re-run, voters say they would opt to stay in the EU by 55 to 45 percent. Reporting by Guy Faulconbridge; editing by Stephen Addison", "external_links": [], "published": "2018-01-12T17:24:00.000+02:00", "crawled": "2018-01-12T17:33:46.001+02:00", "highlightTitle": ""}