{"organizations": [], "uuid": "cf69de48b7859d31b3820453bcfe9b3a788e9718", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104949730-Iraq_classic_cars_.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/17/optimism-in-iraq-fuels-revived-interest-in-vintage-cars.html", "country": "US", "domain_rank": 767, "title": "Optimism in Iraq fuels revived interest in vintage cars", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.518, "site_type": "news", "published": "2018-01-17T09:58:00.000+02:00", "replies_count": 0, "uuid": "cf69de48b7859d31b3820453bcfe9b3a788e9718"}, "author": "Sinan Salaheddin", "url": "https://www.cnbc.com/2018/01/17/optimism-in-iraq-fuels-revived-interest-in-vintage-cars.html", "ord_in_thread": 0, "title": "Optimism in Iraq fuels revived interest in vintage cars", "locations": [], "entities": {"persons": [{"name": "nashwan shakir mahmoud", "sentiment": "none"}, {"name": "sinan salaheddin", "sentiment": "none"}], "locations": [{"name": "iraq", "sentiment": "none"}, {"name": "mosul", "sentiment": "none"}, {"name": "baghdad", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When Iraqi forces drove Islamic State militants out of eastern Mosul a year ago, Nashwan Shakir Mahmoud raced back to his home, hoping that his red and white 1955 Chevrolet coupe had survived three years of war and upheaval.\nWhen he saw that it had only suffered light damage from a mortar shell that landed nearby, he was overjoyed. \"I had an unspeakable feeling, I sighed in relief when saw it,\" he said.\nHe spent 10 days carrying out his own repairs and then drove it all the way back to Baghdad, a 13-hour journey that would have taken four in a modern car. \"When I reached Baghdad,\" he said, \"people were stopping me in the streets to take pictures and videos. It was like a dream to me and to the people.\"\nThe 49-year-old father of six is part of a small community of vintage car aficionados who are hoping to rekindle their passion now that the war against the Islamic State group is over. For many, the cars remind them of happier times in Iraq, before decades of war and chaos, which they hope are finally coming to an end.\n\"These cars have something spiritual that lets you feel the happiness of the good old days,\" said Mahmoud, who also owns a 1964 GMC pickup. The pickup is in a mechanic's garage in Mosul's Old City, in an unsecured area cordoned off by security forces.\nMahmoud had two other vintage cars — a 1957 Dodge Coronet and a 1967 Dodge pickup — but U.S. soldiers towed them away in 2006 after warning him against parking them on the street without getting them repaired, saying militants could use them to conceal roadside bombs. He said he cried when they were taken away.\nDean Batchelor | The Enthusiast Network | Getty Images 1957 Dodge Coronet Road Test for Motor Life magazine. Iraq's vintage cars date back to the period between the discovery of oil in the 1920s and the booming 1970s, when the country was awash in petroleum wealth and boasted some of the finest roads in the region.\nMuch of that infrastructure was destroyed in the Iran-Iraq war in the 1980s and the 1990 Gulf War. The sanctions in the 1990s made it difficult to secure spare parts. In the chaotic years after the 2003 U.S.-led invasion, many collectors kept their cars hidden or locked up, while the daily bombings, and the blast walls and barbed wire that sprouted across Baghdad and other cities, took the pleasure out of driving.\nNow, many of those barriers have come down, and some collectors feel more comfortable showing off their treasures.\nSaad al-Nuaimi, 65, has parked six vintage cars in front of his coffee shop in Baghdad's northern Azamiyah neighborhood, including green and blue 1954 Chevrolet Bel Airs and two Townson cars from the mid-1960s. Three others, including a 1952 Chevrolet and a 1959 Townson, are being repaired.\n\"When you feel secure, you have the guts to get money out of your pocket to enjoy such beauties,\" he said.\nAri Jalal | Reuters An Iraqi soldier holds an Islamic State flag during a battle with Islamic State militants, north of Mosul, Iraq. Many Iraqis from war-battered areas are desperate to sell old cars, and as Iraqi forces have driven IS back over the past three years, more and more models have appeared on the market, al-Nuaimi said. His latest acquisition was a badly damaged maroon 1952 Chevrolet from Salahuddin province, where IS was driven out in 2015.\nHe restores the cars himself, ordering spare parts from Europe and the United States.\nThe government keeps its own trove of vintage cars, including a rare 1904 Jeep Levon and luxury models used by the Hashemite monarchy from 1921 until 1958, including a 1936 Mercedes-Benz that was a gift from Adolf Hitler. Others belonged to Uday, the notoriously brutal playboy son of Saddam Hussein.\nSome have had their bodywork restored but do not have working engines, while others are in very poor condition.\nThe collection is stored in a garage for safe-keeping and is only rarely exhibited to the public. Adil al-Ardawi, the vintage car expert in charge of the royal collection, says at least 1,000 troops were assigned to protect the cars when they were used in a parade last year to mark the 100th anniversary of Baghdad's al-Rashid Street.\nAhmad Shukor, a 39-year-old engineer who runs a Facebook page devoted to documenting Iraq's vintage cars, says only around 100 remain nationwide. He says a third were in Mosul, and that many of them may have been damaged or destroyed.\nHe's now in the final stages of opening a vintage car showroom in the central city of Najaf. The owners of more than 60 cars have agreed to display them there when the showroom opens in the coming months.\n\"We want to prove that Iraq is not done yet,\" he said.", "external_links": [], "published": "2018-01-17T09:58:00.000+02:00", "crawled": "2018-01-17T09:59:17.003+02:00", "highlightTitle": ""}