{"organizations": [], "uuid": "27c646d1784d374bff618045c7a3c3eaca6835b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224707751&w=1200&r=LYNXMPEE0N09G", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-brazil-politics-lula/brazil-braces-for-ruling-that-could-bar-lula-from-2018-race-idUKKBN1FD0FV", "country": "US", "domain_rank": 408, "title": "Brazil braces for ruling that could bar Lula from 2018 race", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T08:04:00.000+02:00", "replies_count": 0, "uuid": "27c646d1784d374bff618045c7a3c3eaca6835b6"}, "author": "", "url": "https://uk.reuters.com/article/uk-brazil-politics-lula/brazil-braces-for-ruling-that-could-bar-lula-from-2018-race-idUKKBN1FD0FV", "ord_in_thread": 0, "title": "Brazil braces for ruling that could bar Lula from 2018 race", "locations": [], "entities": {"persons": [{"name": "lula", "sentiment": "negative"}, {"name": "luiz inacio lula da silva", "sentiment": "none"}, {"name": "lisandra paraguassu", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "porto alegre", "sentiment": "none"}], "organizations": [{"name": "porto alegre", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 6:05 AM / Updated 17 minutes ago Brazil judge upholds Lula conviction; two more to vote Lisandra Paraguassu 4 Min Read \nPORTO ALEGRE, Brazil (Reuters) - The first of three appeals court judges voted Wednesday to uphold a corruption conviction against former President Luiz Inacio Lula da Silva in a case that could bar Brazil’s most popular politician from running in this year’s general election. \nJudge Pedro Gebran agreed with a lower court’s decision last year that Lula had taken millions in bribes from a large construction firm in exchange for it winning government contracts. \nLula, 72, who oversaw a commodities boom a decade ago as Brazil’s first working-class president, would be declared ineligible for the Oct. 7 election if his appeal was denied by at least two of three judges on the case, as expected. The other two judges should make rulings later Wednesday. \nLula can still appeal to higher courts to delay a final decision, avoiding jail and stringing the process out long enough to register his candidacy by the Aug. 15 deadline, though an electoral court could eventually revoke his candidacy. \nLula is one of scores of powerful politicians and businessmen caught up in sweeping corruption probes that have wracked the Brazilian establishment since 2014. \nHis exclusion from the election would radically alter the political landscape ahead of a campaign in which Lula is the early favourite, with 36 percent of voter preferences according to pollster Datafolha. That is double the percentage of his nearest rival, the far-right congressman and former army captain Jair Bolsonaro, who has been energised by anti-Lula sentiment. \nBrazil's benchmark Bovespa stock index .BVSP has risen 8 percent so far this year, propped up by expectations Lula will be barred from the election, clearing the way for a more market-friendly candidate who would stick to Brazil's austerity agenda. \nThe Bovespa hit an all-time high on Wednesday as the first of three judges on the court began reading his decision, dismissing a series of arguments presented by Lula’s lawyers. \nBrazil’s currency, the real BRBY, firmed 1.6 percent against the U.S. dollar, leading gains in Latin America. Slideshow (9 Images) MORE CASES \nLula faces six other indictments in corruption cases ranging from receiving bribes from engineering firm Odebrecht to obstructing justice and trafficking his influence to obtain government decisions favouring the auto industry. \nHe is among over 100 people convicted in the “Car Wash” investigation, the most sprawling of Brazil’s numerous probes, focused on graft involving oil firm Petroleo Brasileiro ( PETR4.SA ) and other state-run companies. \nSpeaking at a union rally on the outskirts of Sao Paulo on Wednesday, Lula told the crowd, “I committed no crime.” \n“The only fair decision today would be a 3-0 ruling that I was wrongly convicted and sentenced,” Lula said. BEACHSIDE APARTMENT \nLula was convicted of corruption and money laundering last year for accepting a beachside apartment from an engineering firm vying for contracts with the state oil company known as Petrobras. \nProsecutors said the apartment and its refurbishing was a bribe worth 3.7 million reais ($1.1 million). Lula maintains he never owned the penthouse apartment, criticizing prosecutors for relying on the plea bargain testimony of one witness, businessman Leo Pinheiro. \n“His word is not enough to incriminate Lula,” Lula’s lawyer Cristiano Zanin told the appeals court. Writing and additional reporting by Anthony Boadle in Brasilia; Additional reporting by Bruno Federowski in Brasilia and Pablo Garcia in Sao Bernardo do Campo; Editing by Lisa Shumaker and Andrew Hay", "external_links": [], "published": "2018-01-24T08:04:00.000+02:00", "crawled": "2018-01-24T08:34:52.041+02:00", "highlightTitle": ""}