{"organizations": [], "uuid": "6aa29adf0aa101c3a08c6edbfd5737fd71668887", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224460352&w=1200&r=LYNXMPEE0M0W8", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-procter-gamble-co-results/pg-profit-falls-due-to-sale-of-beauty-business-tax-charge-idUSKBN1FC1JT", "country": "US", "domain_rank": 408, "title": "P&G profit falls due to sale of beauty business, tax charge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T14:29:00.000+02:00", "replies_count": 0, "uuid": "6aa29adf0aa101c3a08c6edbfd5737fd71668887"}, "author": "", "url": "https://www.reuters.com/article/us-procter-gamble-co-results/pg-profit-falls-due-to-sale-of-beauty-business-tax-charge-idUSKBN1FC1JT", "ord_in_thread": 0, "title": "P&G profit falls due to sale of beauty business, tax charge", "locations": [], "entities": {"persons": [{"name": "vibhuti sharma", "sentiment": "none"}, {"name": "siddharth cavale", "sentiment": "none"}, {"name": "supriya kurane", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "p&g", "sentiment": "negative"}, {"name": "coty inc", "sentiment": "none"}, {"name": "reuters) - procter & gamble co", "sentiment": "none"}, {"name": "ge reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 12:29 PM / in 2 hours P&G second quarter beats, but margins worry investors Siddharth Cavale 3 Min Read \n(Reuters) - The world’s largest consumer goods maker Procter & Gamble Co reported better-than-expected sales and profit for its second quarter on Tuesday, but investors focused on a drop in gross margins, sending its shares down 2 percent. \nMargins fell by nearly 1 percent in the quarter, hit by higher commodity costs, investment outlays and cuts in prices in the grooming business that includes Gillette razorblades. \nThe company has just quelled activist investor Nelson Peltz’s attacks on its strategy by offering him a board seat but is struggling to boost Gillette sales against cheaper competitors like Unilever’s Dollar Shave Club. \nIt has reduced prices on the shaving products, upping volume growth but eating into profits and headline revenue from one of its biggest businesses. \nSome of that was offset by its efforts to pour more money into other lines including beauty and health care, leading to a 2 percent increase in organic sales. \nAnalysts, however, characterized the results as mixed and stopped short of predicting any upside for P&G shares after a rally spurred by the proxy fight with Peltz. \n“Second quarter was not a quality beat, with gross margin lower than expected, and little near term benefit from the Tax Act,” Wells Fargo analyst Bonnie Herzog wrote in a note. \nDON‘T EAT SOAP FILE PHOTO: Procter & Gamble's Oral-B toothbrush heads are seen in a store in Manhattan, New York, U.S., August 1, 2016. REUTERS/Andrew Kelly \nThe company said it was doing all it could against a social media fad that has teenagers daring each other to eat its Tide Pods laundry detergent live on video. \n“Our product labeling is clear ... but it can’t prevent intentional abuse fueled by poor judgment,” P&G’s Chief Financial Officer Jon Moeller told a media call. \n“We’re going to have to work with the broader part of society to address that.” \nP&G raised its full-year adjusted earnings per share growth forecast to 5-8 percent from 5-7 percent as it expects a $135 million net benefit from the recent U.S. tax overhaul, which sees corporate taxes falling to 21 percent. \nNet income attributable to the company fell to $2.50 billion, or 93 cents per share, in the second quarter ended Dec. 31, compared with $7.88 billion, or $2.88 per share, a year earlier. \nThe company said the drop reflects a net charge of $628 million it took related to the tax overhaul and a gain it incurred from the sale of a chunk of its beauty brands to Coty Inc in the same period last fiscal year. \nExcluding items, the company earned $1.19 per share, including a 5 cent benefit from the tax changes. Analysts had expected $1.14 per share, but several Wall Street brokerages said those estimates did not account for the tax benefit. \nNet sales rose 3 percent to $17.4 billion, boosted by strong Demand for Olay skincare products and its high-end SK-II brand and brisk sales of Oral-B toothbrushes as well as Vicks cough and cold products in a colder-than-usual winter season. \nP&G’s shares, which have risen 9.3 percent in 2017, were down 3 percent at $89.54. Reporting by Siddharth Cavale and Vibhuti Sharma in Bengaluru; Editing by Supriya Kurane and Anil D'Silva", "external_links": [], "published": "2018-01-23T14:29:00.000+02:00", "crawled": "2018-01-23T14:40:49.000+02:00", "highlightTitle": ""}