{"organizations": [], "uuid": "3725f3bae19250bd77b9195e1ce670a854dd13c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-624103084.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/most-popular-adult-film-stars/", "country": "US", "domain_rank": 1196, "title": "Call 'Em the Dirty Dozen: The 12 Most Popular Porn Stars of 2018 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.899, "site_type": "news", "published": "2018-01-25T14:40:00.000+02:00", "replies_count": 0, "uuid": "3725f3bae19250bd77b9195e1ce670a854dd13c0"}, "author": "Chris Morris", "url": "http://fortune.com/2018/01/24/most-popular-adult-film-stars/", "ord_in_thread": 0, "title": "Call 'Em the Dirty Dozen: The 12 Most Popular Porn Stars of 2018 | Fortune", "locations": [], "entities": {"persons": [{"name": "chris morris", "sentiment": "negative"}, {"name": "kassia wosick", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "new mexico state university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Chris Morris 12:40 PM EST \nFame in the adult entertainment industry is a fickle thing. Many performers leave the industry before anyone knows their name. Some experience a meteoric rise, only to fall in the course of a few months. Others prove eternal. \nThe adult entertainment industry’s annual exposition runs from Jan. 24 to 27 in Las Vegas. Ahead of the event, here is a list of this year’s most popular porn stars as judged by their standing among industry insiders and depth of fan interest, a critical factor to success in the industry. \nThose two components can make a tremendous difference when it comes to what performers earn. Globally, pornography is a $97 billion industry, according to Kassia Wosick, assistant professor of sociology at New Mexico State University. Between $10 and $12 billion of that total comes from the United States. \nBut pay is hardly equal among porn stars. For a typical male/female sex scene, the average actress’s compensation is typically between $800 and $1,000. Top-tier female performers, however, can earn as much as $1,500—and sometimes $2,000 if they’re among the industry’s most sought after. (A newcomer, for comparison, could earn as little as $300.) Male performers, meanwhile, average $500 to $600 per scene or day. Some can pull in $700 to $900, while the most popular male stars earn up to $1,500. \nThe most popular entertainers supplement these earnings by signing endorsement deals, creating customized videos for fans and, in some cases, launching their own production studios. Some performers leverage their relative fame to dance in adult clubs around the country, where they not only earn considerably more, but can also sell their own merchandise. One performer says she regularly earns between $7,000 and $10,000 per feature dancing appearance, which can last a day or two. \nThe list below first determines which 25 performers have earned the most nominations in the annual Adult Video News and Xbiz awards, the industry’s two highest-profile ceremonies. From there, a three-month average of the stars’ Google Trends ranking reveals the 12 highest scoring stars. \nA note: You’ll notice that all 12 stars on the list are female. That’s not for lack of trying—male performers were also taken into consideration. Though two men made the top 25 in terms of award nominations this year, they fell off the list once fan popularity was taken into consideration. While the demographic audience for pornography has widened considerably as it has become more readily available, actresses remain the fan favorites, owing to their relative prominence. Adult entertainment start Eva Lovia. EvaLovia.com Eva Lovia \nLovia rose to fame like many mainstream celebrities do these days—via a reality show. The winner of DP Star, she was awarded a contract with Digital Playground (that’s the “DP”), meaning she only shot films for that production studio. When that expired, she began shooting for Greg Lansky, owner of three of the fastest growing brand names in the adult industry. (Sales figures for its most viewed titles—or most popular scenes, since full-length features are less common—are closely guarded, per industry norms.) In just three years, though, Lovia has performed in more than 130 productions. Adult entertainment star Abella Danger. Abella Danger \nDanger, a three-year veteran of the adult entertainment industry, has amassed a large fan base by utilizing social media to promote her brand. She tweets, seemingly hourly, to her more than 500,000 followers, promoting upcoming scenes, products, and details of her life. That direct connection with fans (and their subsequent loyalty) has made Danger one of the most in-demand performers among studios. She was the 2016 winner of AVN’s best new starlet award. This year, she’s up for the female performer of the year honor—the industry’s top prize—from both AVN and Xbiz. XBIZ Awards Show 2014 at the Hyatt Regency Century Plaza Hotel in Century City California on January 24, 2014 Glenn Francis (c) Glenn Francis Romi Rain \nRain has a family history of adult entertainment—her mother once posed in Hustler magazine. Rain got her start as a nude model, eventually moving into the Webcam industry, where models pose and perform acts for fans online for cash tokens. Curiosity about the adult entertainment industry led her to star in her first feature and her fame escalated. Beyond the camera, Rain is a frequent feature dancer around the country and, like many actresses, has been increasingly focused on creating custom content, charging fans $20 per month for exclusive videos. (Based on current subscription numbers, that venture alone brings her an extra $52,00 per year in gross revenue.) Adult entertainment star Lana Rhoades © 2017 GMS Lana Rhoades \nAnother favorite of Lansky, Rhoades is an adult entertainment stars focused on virtual reality. She is a contract performer with Naughty America (one of the genre’s leading outlets), taping VR scenes exclusively for that company as she shoots traditional fare for others. Rhoades built her brand, in part, by appearing in Playboy , Penthouse , and Hustler magazines. She is also an extensive feature dancer. Studios don’t release numbers or best selling information, but Rhoades claims to have had two of the top selling star showcases on Lansky’s platforms. Gina Valentina attends the 2018 XBIZ Awards on Jan. 18, 2018 in Los Angeles, California. Joshua Blanchard—Getty Images for XBIZ Gina Valentina \nA relative newcomer to the industry, Valentina was a “trophy girl” at last year’s AVN Awards. That’s not the most progressive of titles, but in the adult entertainment world, it’s a sign that a performer is on the fast track to fame. Accelerating her standing in the industry, Valentina has been signed by the adult industry’s most powerful agent, Mark Spiegler, and has appeared in over 234 films. Unlike many other performers on the list, she relies mostly on on-camera and custom video work for her income, rather than supplementing it with feature dancing or adult novelty endorsements. Adult film actress Elsa Jean attends the 2016 AVN Adult Entertainment Expo at The Joint inside the Hard Rock Hotel & Casino on Jan. 22, 2016 in Las Vegas, Nevada. Gabe Ginsberg—FilmMagic via Getty Images Elsa Jean \nLike Gina Valentina, 21-year-old Elsa Jean was an AVN trophy girl and has gone on to perform in 280 films. Perhaps more than any performer on this list, she has fought the existence of social media accounts created by people pretending to be her online—an annoyance for most people, but something that can be damaging for an adult entertainment performer, since studios often favor talent with large followings. A former adult dancer, Jean seemingly has taken a hiatus from that industry and doesn’t work with any Webcam companies—by her own admission, because she is too busy on camera. Adult entertainment performer Chanel Preston Chanel Preston \nPreston has been an industry and fan favorite for years. Beyond being a prolific performer, she hosts the Web series/podcast Sex Think with political activist Rob Nelson, directs films, is a former board member of the Adult Performer Advocacy Committee, or APAC. Preston has also appeared on mainstream programs such as Showtime’s documentary on the adult industry, is a recurring feature dancer around the country, and heavily markets her custom video business on onlyfans. Actress Riley Reid arrives for the 2017 AVN Nomination Partyat Avalon at Avalon on Nov. 17, 2016 in Hollywood, California. Renard Garr—WireImage Riley Reid \nReid is an eight-year veteran of the adult entertainment industry and one of the most masterful performers when it comes to social media. She has cultivated an online fan base of over 735,000 people by regularly tweeting pictures and videos of herself—usually nude—and holding frequent “ask me anything” sessions on Reddit. Curiously, she doesn’t leverage those fans for custom videos, instead steering them to her own Website, where exclusive scenes can be purchased for $10 and up or fans can subscribe for $35 per month. In 2014, she was named Performer of the Year by Xbiz, which gave her already fast-growing career a big boost. She’s once again up for that same award from both Xbiz and AVN this year, along with 14 other nominations. Adult film actress Aidra Fox arrives at the 2015 Xbiz Awards in Los Angeles in Jan. 15, 2015. Hubert Boesl—picture-alliance/dpa/AP Images Aidra Fox \nFox was a Penthouse Pet of the Month at age 19, less than a year after getting started in the adult entertainment world. Now 22, she’s up for nine awards this year. In addition to using Twitter and other social media to promote her performances and custom videos (via Patreon), where fans pay $10 per month for photos and $50 per month for all access. She also strives for a personal connection via her (work safe!) YouTube channel, which largely consists of videos of her playing the popular video game series The Sims . She films regularly for most of the major adult studios and has filmed more than 280 scenes through her career. Adult entertainment performer Angela White. Rick Garcia Angela White \nWhite is one of the top performers in the industry these days, claiming 18 different award nominations, the most of any person on this list. She also runs and owns her own production company in Australia, her homeland, where she produced her own content. (In 2010, ran for office as a candidate for the Australian Sex Party.) These days, she’s highly sought after in Los Angeles County’s San Fernando Valley, the heart of America’s porn industry, and is active as a Webcam model as well. White is one of the hosts of this year’s AVN Awards, sometimes referred to as the “Oscars of porn.” Adult entertainment star Keisha Grey. Photograph by Chris Morris Keisha Grey \nGrey has narrowly focused on the celluloid side of the industry throughout her career, which started in 2013. She doesn’t promote feature dance appearances. She hasn’t signed any high profile endorsement deals for adult novelties. And other than her Website (which charges members $30 per month), she doesn’t seem to film custom videos, three of the most popular ways to supplement income in the industry. She has, though, appeared in 389 films to date—and she has a total of seven nominations this year. Adult entertainment star Jessica Drake Jessica Drake \nDrake, a longtime veteran of the adult entertainment industry, sprung to national fame last year when she was the 11th woman to accuse U.S. president Donald Trump of sexual misconduct. She alleges that Trump offered her $10,000 to join him in his suite in 2006, an accusation he denies. Beyond her role as a performer, Drake is a sex educator, and has released a series of explicit educational films to help couples learn more about sex and discuss it realistically, rather than through the filter of fantasy that most porn films prefer. She also directs adult films, acts as the envoy for Wicked Pictures (one of the top adult studios) around the country, and feature dances in adult clubs around the world. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T14:40:00.000+02:00", "crawled": "2018-01-25T01:16:21.003+02:00", "highlightTitle": ""}