{"organizations": [], "uuid": "a88e86cdffa34e1bed67339a3e62491a19c7c41e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 206, "shares": 206, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225643824&w=1200&r=LYNXMPEE0Q01X", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-usa-southkorea-northkorea/u-s-s-mattis-diplomacy-should-impose-reason-on-north-koreas-kim-idUSKBN1FG01Q", "country": "US", "domain_rank": 408, "title": "U.S.'s Mattis: Diplomacy should impose reason on North Korea's Kim", "performance_score": 2, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T03:01:00.000+02:00", "replies_count": 0, "uuid": "a88e86cdffa34e1bed67339a3e62491a19c7c41e"}, "author": "", "url": "https://www.reuters.com/article/us-usa-southkorea-northkorea/u-s-s-mattis-diplomacy-should-impose-reason-on-north-koreas-kim-idUSKBN1FG01Q", "ord_in_thread": 0, "title": "U.S.'s Mattis: Diplomacy should impose reason on North Korea's Kim", "locations": [], "entities": {"persons": [{"name": "north ko", "sentiment": "negative"}, {"name": "mattis", "sentiment": "negative"}, {"name": "phil stewart", "sentiment": "none"}, {"name": "jim mattis", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "sandra maler", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "kim reuters staff", "sentiment": "none"}, {"name": "defense", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. PACIFIC COMMAND HEADQUARTERS, Hawaii (Reuters) - U.S. Defense Secretary Jim Mattis stressed diplomacy as the way to deal with the North Korean crisis on Friday during talks with his South Korean counterpart in Hawaii, a day after Seoul’s top diplomat said a military solution would be unacceptable.\n“Diplomacy should (impose) reason on Kim’s reckless rhetoric and dangerous provocations,” Mattis said, referring to North Korean leader Kim Jong Un.\nHe added that the response to the threat remained “diplomacy led, backed up with military options available to ensure that our diplomats are understood to be speaking from a position of strength.”\nThe administration of U.S. President Donald Trump has said all options are on the table when it comes to North Korea’s pursuit of a nuclear-tipped missile capable of striking the United States.\nBut Mattis has consistently stressed non-military actions, including international sanctions. He renewed that message as he met South Korean Minister of Defense Song Young-moo at the U.S. Pacific Command headquarters in Hawaii.\nSong said he expected to discuss North Korea with Mattis, but noted firm coordination between the two militaries.\n“We both understand each other well and that as an alliance, we always go together,” he said, speaking through a translator.\nThe exchange came a day after South Korea’s Foreign Minister Kang Kyung-wha said the standoff over North Korea’s nuclear program must be resolved diplomatically, and added that she was certain Washington would consult her government first if a military option were to be considered.\nShe declined to comment if Washington had given Seoul clear assurance but added: “This is our fate that is at stake. Any option that is to be taken on the Korean Peninsula, cannot be implemented without us going along.”\nAfter their first formal talks in more than two years this month, officials from the two Koreas have been visiting each other to facilitate the North’s participation in the Olympics, to be held in the South’s alpine resort town of Pyeongchang.\nNorth Korea has waged a publicity campaign around its attendance, calling on Thursday for “all Koreans at home and abroad” to promote inter-Korean cooperation.\nKim’s regime has also set a new anniversary to mark the formation of its military on Feb. 8 - the day before the start of the Games. Analysts say the nation may observe the day with a large military parade.\nU.S. Vice President Mike Pence, who will represent the United States at the Olympics, said on Tuesday he would seek to counter what he described as an effort by North Korea to “hijack” the Games with a propaganda campaign.\nReporting by Phil Stewart; Editing by Sandra Maler and Lisa Shumaker\n ", "external_links": [], "published": "2018-01-27T03:01:00.000+02:00", "crawled": "2018-01-27T03:16:26.006+02:00", "highlightTitle": ""}