{"organizations": [], "uuid": "dc9cd898aee82a21e146eca867f8838f385b3f70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-on-assignment-inc-to-acquire-ecs-federal-llc-one-of-the-largest-privately-held-government-services-contractors-for-775.html", "country": "US", "domain_rank": 767, "title": "On Assignment, Inc. to Acquire ECS Federal, LLC, One of the Largest Privately-Held Government Services Contractors, for $775 Million in Cash", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:01:00.000+02:00", "replies_count": 0, "uuid": "dc9cd898aee82a21e146eca867f8838f385b3f70"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-on-assignment-inc-to-acquire-ecs-federal-llc-one-of-the-largest-privately-held-government-services-contractors-for-775.html", "ord_in_thread": 0, "title": "On Assignment, Inc. to Acquire ECS Federal, LLC, One of the Largest Privately-Held Government Services Contractors, for $775 Million in Cash", "locations": [], "entities": {"persons": [{"name": "lindsay goldberg", "sentiment": "none"}, {"name": "roy kapani", "sentiment": "none"}], "locations": [{"name": "calabasas", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "inc.", "sentiment": "negative"}, {"name": "llc", "sentiment": "negative"}, {"name": "largest privately-held government services contractors", "sentiment": "negative"}, {"name": "ecs federal", "sentiment": "none"}, {"name": "ecs", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Acquisition Expected to be Accretive to 2018 Adjusted EPS\nOn Assignment Announces Preliminary Fourth Quarter of 2017 Financial Results\nOn Assignment to Change Name to ASGN Incorporated\nCALABASAS, Calif.--(BUSINESS WIRE)-- On Assignment, Inc. (NYSE: ASGN), one of the foremost providers of IT and professional services in the technology, creative/digital, engineering and life sciences sectors, announced today that it has signed a definitive agreement to acquire ECS Federal, LLC (ECS) from Roy Kapani, the company’s majority owner and founder, and Lindsay Goldberg, a private investment firm, for $775 million in cash. The transaction is subject to various regulatory approvals and customary closing conditions and is expected to close on April 2, 2018.\nECS, one of the largest privately-held government services contractors, delivers cyber security, cloud, DevOps, IT modernization and advanced science and engineering solutions to government enterprises. Combined, On Assignment and ECS will be one of the largest and fastest growing IT and professional services firms in North America.\nFor the year ended December 31, 2017, ECS estimates its revenues and Adjusted EBITDA (a non-GAAP measure) on a pro forma basis will be approximately $586.4 million and $67.6 million, respectively. Estimated pro forma results assume a business acquired by ECS in April 2017 occurred at the beginning of the year. For 2018, ECS expects high single-digit year-over-year revenue growth.\nFor the year ended December 31, 2017, On Assignment estimates its revenues and net income will be approximately $2.6 billion and $157.7 million, respectively and its Adjusted EBITDA (a non-GAAP measure) will be approximately $311.4 million. On a pro forma basis, which assumes the acquisition of ECS occurred at the beginning of 2017 (a non-GAAP measure), On Assignment’s revenues and Adjusted EBITDA are estimated to be approximately $3.2 billion and $379 million, respectively. Additionally, the acquisition is accretive to On Assignment’s 2017 Adjusted Net Income (a non-GAAP measure).\nCommenting on the acquisition, Peter Dameris, CEO of On Assignment, said: “ECS’ government services solutions will complement and elevate our offerings and strengthen our position as a premium IT and professional services provider. Our addressable end market is now $279 billion by virtue of our entering the $129 billion Government Services space. ECS’ long-term contracts, which average 5 years in length, and robust backlog ($1.6 billion) provide strong revenue visibility and mitigate volatility from permanent placement revenue and a more challenging economic environment.”\nDameris concluded: “All companies struggle with identifying and attracting highly qualified technical personnel in today’s economy. Our combined 24,000+ billable consultants, of which 2,900 maintain security clearances, and our recruiting prowess will strengthen ECS’ fulfillment capabilities, credentials and qualifications as it competes for future awards.”\nECS has well established positions on critical IT systems of national importance which provide unmatched customer access and unique visibility into future technology transformation initiatives. For example, ECS’ domain expertise in cyber security for the defense industry will be immensely valuable to On Assignment’s customers given the increased frequency and complexity of cyber-attacks for customers everywhere.\nECS will become a division of On Assignment and continue to operate under the ECS brand name. The CEO of ECS, George Wilson, and the current leadership team will continue to execute the strategy and oversee the day-to-day operations of the business. “This acquisition immediately introduces a company with the scale, contracts, capabilities, personnel, past performance and ability to compete for the largest opportunities in the Federal market. The entire team is energized about the possibilities.” said George Wilson.\nOn Assignment intends to change its name to ASGN Incorporated to better reflect its evolving position as a leading provider of human capital in IT and Professional Services Solutions effective April 2, 2018.\nCommenting on the name change, Peter Dameris said: “On Assignment commenced operations as a life sciences staffing firm in 1985 and has since evolved its offerings to include technology, creative/digital, engineering and scientific solutions. As our company has grown over the last 33 years, we believe it is the right time to change our name to better reflect our path forward.” Dameris concluded: “Our success is the direct result of the hard work of our many dedicated employees and billable professionals and I would like to thank the entire organization for its continued commitment to excellence.”\nTransaction Details\nUnder terms of the definitive purchase agreement, On Assignment will acquire all of ECS’ equity for $775 million to be paid at closing.\nIn connection with the transaction, On Assignment has obtained a $1.6 billion financing commitment from Wells Fargo. The committed financing consists of a $200 million revolving credit facility (undrawn at close) and a $1.4 billion term B loan. We may complete a portion of the financing through an amendment to our existing facilities and expect to issue a new 7 year term B loan to fund the acquisition and to pay related transaction costs. Upon closing, funded debt is expected to total approximately 3.7 to 1 estimated pro forma Adjusted EBITDA for the year ended December 31, 2017.\nFor income tax reporting purposes, the acquisition will be treated as an asset purchase, resulting in tax basis in the intangibles assets acquired. This “step-up” in tax basis is expected to result in an annual cash income tax savings of approximately $12 million over the next 15 years from the amortization of these assets for income tax purposes.\nPreliminary Financial Results for Fourth Quarter of 2017\nIn connection with the announcement of the transaction, On Assignment is providing preliminary financial results for the fourth quarter of 2017. These results are subject to completion of the Company’s financial and accounting procedures and the annual independent audit. On Assignment anticipates reporting its complete financial results for the fourth quarter and year ended December 31, 2017 on February 14, 2018.\nThe preliminary fourth quarter results compared with previously-announced estimates are as follows (in millions, except per share amounts):\nPreliminary Results\nPreviously-\nAnnounced Estimates Revenues $ 679.0 $658.0 to $668.0 Net Income\n$ 67.3\n2\n$61.4 to $66.2 Adjusted Net Income (non-GAAP measure) 1 $\n76.0\n2,3\n$69.4 to $74.1 Income per diluted share:\nNet Income $ 1.28\n2\n$1.17 to $1.26 Adjusted Net Income (non-GAAP measure) 1 $ 1.44\n2\n$1.32 to $1.41 Number of shares and share equivalents used to calculated diluted earnings per share\n52.8 52.5 Adjusted EBITDA (non-GAAP measure)\n$ 82.9\n4\n$77.5 to $80.5 Non-cash tax benefit related to recently enacted Tax Cuts and Jobs Act\n$ 31.4 $30.5 to $33.5\n1 Does not include Cash Tax Savings on Indefinite-lived Intangible Assets. These savings total $6.8 million, or $0.13 per diluted share, and represent the economic value of the tax deduction that we receive from the amortization of goodwill and trademarks.\n2 Includes excess tax benefits related to stock-based compensation of $2.5 million (the tax effect of the difference between book and tax expense for stock-based compensation), which were not included in our previously-announced estimates. 3 Adjusted Net Income is calculated as follows: Net income plus (i) $8.4 million amortization of intangible assets, (ii) $0.9 million acquisition, integration and strategic planning expenses and (iii) $0.1 million loss from discontinued operations; less (i) $0.4 million income taxes on amortization not deductible for income tax purposes and (ii) $0.3 million tax effect on acquisition, integration and strategic planning expenses. 4 Adjusted EBITDA is calculated as follows: Net income plus (i) $8.4 million amortization of intangible assets, (ii) $6.7 million depreciation, (iii) $6.1 million stock-based compensation, (iv) $6.0 million interest expense, (v) $0.9 million acquisition, integration and strategic planning expenses and (vi) $0.1 million loss from discontinued operations; less $12.6 million income tax benefit. For the full year 2017, the Company estimates its net income and Adjusted EBITDA will be approximately $157.7 million and $311.4 million, respectively, and its cash flows from operating activities and free cash flow (non-GAAP measure) will be approximately $196.4 million and $172.2 million, respectively. At December 31, 2017, long-term debt was approximately $575.2 million and the leverage ratio (a non-GAAP measure) was 1.89 to 1.\nLegal and Financial Advisors\nOn Assignment, Inc. retained Sullivan & Cromwell LLP as legal counsel on the transaction, Latham & Watkins LLP as legal counsel on the secured financing commitment, Wells Fargo Securities, LLC as lead financial advisor, American Discovery Capital, LLC as financial advisor, Wolf Den Associates, LLC for strategic industry advisory services and Perkins Coie, LLP for support with government contracts. ECS retained Cravath, Swaine and Moore LLP and Venable LLP as legal counsel and Robert W. Baird & Co., Houlihan Lokey, Inc. and SunTrust Robinson Humphrey as financial advisors.\nConference Call\nOn Assignment will hold a conference call with analysts and stockholders today at 8:30 a.m. EST. The dial-in number is (800) 288-8961, (612) 332-0342 for callers outside the United States) and the conference ID number is 444143. Participants should dial in ten minutes before the call. A replay of the conference call will be available beginning today at 11:30 a.m. EST and ending at midnight EST on February 21, 2018. The access number for the replay is (800) 475-6701, (320) 365-3844 for callers outside the United States) and the conference ID number 444143.\nThis call is being broadcasted by CCBN and can be accessed via On Assignment’s web site at www.onassignment.com . We have also posted on our website a presentation regarding this transaction.\nAbout ECS\nFounded in 2001 and headquartered in Fairfax, Virginia, ECS is a leading national information technology solutions provider delivering cyber security, cloud, DevOps, IT modernization and advanced science and engineering solutions. ECS designs, implements and operationalizes security capabilities for some of the most highly-targeted government customers in the world. The company maintains partnerships with the world’s leading cyber and cloud technology organizations, with immediate reach-back capability and certified experience. ECS is strategically positioned at the intersection of mission and technology – delivering proven market differentiation and unparalleled growth at scale.\nAbout On Assignment\nOn Assignment, Inc. (NYSE: ASGN) is one of the foremost providers of IT and professional services in the technology, creative/digital, engineering and life sciences sectors. Through an integrated suite of professional staffing and IT solutions, On Assignment improves productivity and utilization among leading corporate enterprises.\nDue to our companies’ achievements, we are viewed as best in class across multiple industries and have built an outstanding reputation of excellence over the past 33 years.\nBased in Calabasas, California, On Assignment operates a network of over 150 branch offices across the United States, Canada and Europe. For more information, visit us at www.onassignment.com .\nReasons for Presentation of Non-GAAP Financial Measures\nStatements in this release may include non-GAAP financial measures. Such information is provided as additional information, not as an alternative to our consolidated financial statements presented in accordance with Generally Accepted Accounting Principles in the United States (\"GAAP\"). Such measures also are used to determine a portion of the compensation for some of our executives and employees. We believe the non-GAAP financial measures provide useful information to management, investors and prospective investors by excluding certain charges and other amounts that we believe are not indicative of our core operating results. These non-GAAP measures are included to provide management, our investors and prospective investors with an alternative method for assessing our operating results in a manner that is focused on the performance of our ongoing operations and to provide a more consistent basis for comparison between quarters. These terms might not be calculated in the same manner as, and thus might not be comparable to, similarly titled measures reported by other companies. Our press release on October 25, 2017 includes a reconciliation of each non-GAAP financial measure to the most directly comparable GAAP financial measure. Below is a discussion of our non-GAAP financial measures referenced in this release.\nNon-GAAP net income (net income, less income (loss) from discontinued operations, net of tax, plus, as applicable, refinancing costs, acquisition, integration and strategic planning expenses, accretion of fair value discount on contingent consideration, impairment charges, and the tax effect of these items) provides a method for assessing our operating results in a manner that is focused on the performance of our core business on an ongoing basis. Adjusted Net Income (Non-GAAP net income plus amortization of intangible assets, less income taxes on amortization for financial reporting purposes not deductible for income tax purposes) provides a method for assessing our operating results in a manner that is focused on the performance of our core business on an ongoing basis, adjusted for some of the cash flows associated with amortization of intangible assets to more fully present the performance of our acquisitions.\nEBITDA (earnings before interest, taxes, depreciation and amortization of intangible assets) and Adjusted EBITDA (EBITDA plus stock-based compensation expense and, as applicable, write-off of loan costs, acquisition, integration and strategic planning expenses, and impairment charges) are used to determine a portion of the compensation for some of our executives and employees. Stock-based compensation expense is added to arrive at Adjusted EBITDA because it is a non-cash expense. Write-off of loan costs, acquisition, integration and strategic planning expenses, and impairment charges are added, as applicable, to arrive at Adjusted EBITDA as they are not indicative of the performance of our core business on an ongoing basis.\nFree cash flow is defined as net cash provided by (used in) operating activities, less capital expenditures. Management believes this provides useful information to investors about the amount of cash generated by the business that can be used for strategic opportunities. Our leverage ratio provides information about our compliance with loan covenants and is calculated in accordance with our credit agreement, as filed with the Securities and Exchange Commission (\"SEC\"), by dividing our total indebtedness by trailing 12 months Adjusted EBITDA.\nEstimated pro forma results for On Assignment assume a business acquired by ECS in April 2017 occurred at the beginning of the year, as such these estimated pro forma results are non-GAAP measures.\nSafe Harbor\nCertain statements made in this news release are “forward-looking statements” within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, and involve a high degree of risk and uncertainty. Forward-looking statements include statements regarding the Company's anticipated financial and operating performance in 2018, the expected timing of the closing of the transaction and other statements regarding the expected performance of On Assignment and of the combined company. All statements in this release, other than those setting forth strictly historical information, are forward-looking statements. Forward-looking statements are not guarantees of future performance, and actual results might differ materially. In particular, the Company makes no assurances or guarantees: i) that a potential transaction with ECS Federal, LLC would occur; ii) what the final terms related to such a potential transaction would be; iii) that the assumptions made in determining the value of the transaction would be realized; or iv) that the Company would be able to finance the potential transaction per the terms set forth above. Further, the Company makes no assurances that estimates of revenues, net income, Adjusted Net Income, Adjusted EBITDA, free cash flow, leverage ratio and other financial metrics will be achieved. Factors that could cause or contribute to such differences include actual demand for our services, our ability to attract, train and retain qualified staffing consultants, our ability to remain competitive in obtaining and retaining staffing clients, the availability of qualified temporary and permanent placement professionals, management of our growth, continued performance of our enterprise-wide information systems, and other risks detailed from time to time in our reports filed with the SEC, including our Annual Report on Form 10-K for the year ended December 31, 2016, as filed with the SEC on March 1, 2017. We specifically disclaim any intention or duty to update any forward-looking statements contained in this release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005655/en/\nOn Assignment, Inc.\nMedia Inquiries:\nAdam Bleibtreu\nChief Marketing Officer\n(818) 878-7900\nor\nInvestor Inquiries:\nEd Pierce\nChief Financial Officer\n(818) 878-7900\nSource: On Assignment, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.onassignment.com%2F&esheet=51751469&newsitemid=20180131005655&lan=en-US&anchor=www.onassignment.com&index=1&md5=3eb7b3040b2020b08a2f14502904f3e3", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.onassignment.com&esheet=51751469&newsitemid=20180131005655&lan=en-US&anchor=www.onassignment.com&index=2&md5=d2d94d8cd1aa184653eb69609d7d388d", "http://www.businesswire.com/news/home/20180131005655/en/"], "published": "2018-01-31T15:01:00.000+02:00", "crawled": "2018-01-31T17:15:10.000+02:00", "highlightTitle": ""}