{"organizations": [], "uuid": "17d5e5c89a2139fc4d0b11880092eeff2a361e5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain-saudiarabia/villarreal-among-liga-clubs-to-sign-saudi-arabia-players-idUKKBN1FA14T", "country": "US", "domain_rank": 408, "title": "Villarreal among Liga clubs to sign Saudi Arabia players", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T22:50:00.000+02:00", "replies_count": 0, "uuid": "17d5e5c89a2139fc4d0b11880092eeff2a361e5c"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain-saudiarabia/villarreal-among-liga-clubs-to-sign-saudi-arabia-players-idUKKBN1FA14T", "ord_in_thread": 0, "title": "Villarreal among Liga clubs to sign Saudi Arabia players", "locations": [], "entities": {"persons": [{"name": "villarreal", "sentiment": "negative"}, {"name": "rayo vallecano", "sentiment": "none"}, {"name": "richard martin", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "liga", "sentiment": "none"}, {"name": "la liga", "sentiment": "none"}, {"name": "leganes", "sentiment": "none"}, {"name": "numancia", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "real valladolid", "sentiment": "none"}, {"name": "levante", "sentiment": "none"}, {"name": "gsa", "sentiment": "none"}, {"name": "la liga", "sentiment": "none"}, {"name": "general sports authority", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  barcelona", "sentiment": "none"}, {"name": "sporting gijon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 8:51 PM / Updated 31 minutes ago Villarreal among Liga clubs to sign Saudi Arabia players Richard Martin 3 Min Read \nBARCELONA (Reuters) - Spanish top flight clubs Villarreal, Leganes and Levante all announced on Sunday loan signings of Saudi Arabia internationals until the end of the season as part of an agreement between La Liga and the Arab state’s authorities. \nSecond-tier sides Sporting Gijon, Numancia, Rayo Vallecano and Real Valladolid also participated in the deal, with a statement from the league’s organising body saying a total of nine players would move to Spain, including two academy players. \nSaudi Arabia will play the opening game of the 2018 World Cup against hosts Russia after qualifying for the tournament for the first time since 2006. \n“The General Sports Authority (GSA) of Saudi Arabia, the Saudi Arabian Football federation (SAFF) and La Liga, the internationally renowned Spanish football league, today announced key next steps in their partnership to grow the game of football in Saudi Arabia,” said a statement from La Liga. \n”First announced in October, the multi-year partnership has multiple elements including an academy partnership and a talent scouting initiative for young footballers in Saudi Arabia. \n”These loan agreements, for an initial period of six months, allow these players to further develop their skills training and playing in Spain. \n“The incorporation of players from Saudi Arabia in the Spanish clubs follows a rigorous scouting programme that spanned multiple months to identify the best talent.” \nBefore the loan signings were announced on Sunday, the vast majority of Saudi Arabia’s international players competed in the country’s top flight. Only one player, Mukhtar Ali, plays abroad with Dutch top flight side Vitesse Arnhem. \nVillarreal, who are fifth in the Liga standings and in the last 32 of the Europa League, brought in midfielder Salem Al Dawsari, while Leganes signed forward Yahia Al-Shehri. Levante signed Fahad Al-Muwallad. \n“As part of this collaboration, our club in the past few months has worked alongside La Liga in scouting Saudi international footballers and youth prospects to determine the choice of our new signing,” said a statement from Levante. \n“With the arrival of Fahad Al-Muwallad we sign a player that will help gain visibility in the Arab world, where La Liga is the most followed international league.” Reporting by Richard Martin, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-21T22:50:00.000+02:00", "crawled": "2018-01-21T23:11:09.006+02:00", "highlightTitle": ""}