{"organizations": [], "uuid": "afdf46312dd5bd7f5acb49831531af49040be937", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226011356&w=1200&r=LYNXMPEE0R0E8", "site_section": "http://feeds.reuters.com/reuters/INformulaOne", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/us-india-budget/with-elections-coming-up-indias-government-will-aim-to-woo-rural-voters-in-budget-idINKBN1FH0GJ", "country": "US", "domain_rank": 408, "title": "With elections coming up, India's government will aim to woo rural voters in budget", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T14:02:00.000+02:00", "replies_count": 0, "uuid": "afdf46312dd5bd7f5acb49831531af49040be937"}, "author": "", "url": "https://in.reuters.com/article/us-india-budget/with-elections-coming-up-indias-government-will-aim-to-woo-rural-voters-in-budget-idINKBN1FH0GJ", "ord_in_thread": 0, "title": "With elections coming up, India's government will aim to woo rural voters in budget", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "none"}, {"name": "modi", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}, {"name": "manoj kumar", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI (Reuters) - India’s government will be trying to woo back rural voters and small businesses when it announces the 2018/19 budget on Thursday and pick up economic momentum as it heads into a season of elections, officials said.\nPrime Minister Narendra Modi, extolling India as a model of economic growth and political openness, told the World Economic Forum in Davos last week the country would be a $5 trillion economy by 2025, more than double its current size.\nBut at home, Modi is facing voter discontent over falling farm incomes and the lack of jobs for hundreds of thousands of youth entering the labor force each month.\nThis month, the government lowered its gross domestic growth forecast for the year ending March, 2018 to 6.5 percent, the weakest pace in four years. Growth slowed down because of a chaotic rollout of a nationwide goods and service tax (GST) last year and a shock move to ban high value currency notes in late 2016.\nModi’s ruling alliance barely scraped through an election in his home state of Gujarat last month and is now faced with elections in eight states spread over 2018 and a general election that must be held by May next year.\nFinance Minister Arun Jaitley will likely step up funding of existing rural programs such as a jobs guarantee scheme, rural housing and a crop insurance plan in what will be his final full year budget before the general election.\nBudget proposals are a closely guarded secret, but a finance ministry official with direct knowledge of the discussions said: “The government’s top priority is to create jobs and boost growth.”\nThe official added: “The budget is likely to offer incentives to the farm sector and small businesses.”\nSmall businesses form the core support base of Modi’s Bharatiya Janata Party and they are hurting over the implementation of the GST, with its cumbersome compliance procedures, and the demonetization policy that sucked cash out of the system.\nJaitley is also expected to stay the course on a massive plan to build highways, modernize the railways and end infrastructure bottlenecks that have long hobbled Asia’s third largest economy.\nAs early as November, as he began laying out his priorities, Jaitley said at a conference of government and industry leaders that “two areas to concentrate on in the upcoming budget are rural India and development of infrastructure.”\nIndia’s growth should pick up to 7.4 percent in 2018 as against China’s 6.6 percent, the IMF said this month, as the twin effects from the tax reform and demonetization wear off.\nFISCAL PRESSURES But the space for fiscal expansion remains limited at a time when the budget deficit is expected to breach the target of 3.2 percent of GDP in the current fiscal year for the first time in five years.\nFarmers load fodder onto a tractor in a field at Kolat Village on the outskirts of Ahmedabad, India January 27, 2018. Picture taken January 27, 2018. REUTERS/Amit Dave “Within the context of weak economic growth, we believe Jaitley faces a difficult balance in supporting growth without compromising significantly fiscal prudence (which could feed into higher inflation and potentially higher interest rates),” Goldman Sachs said in a pre-budget note.\nAlready, rising inflation, tightening cash conditions, and worries about a less fiscally prudent government have sparked a sharp sell-off in India’s bond markets.\nA budget that significantly expands the deficit in the next fiscal year could spark a further sell-off, leading to a continued rise in bond yields that could raise borrowing costs at a time when the government is seeking to stimulate growth.\nThe government’s scope to increase revenues is limited because the power to levy indirect taxes, which make up about half of total tax collections, has been transferred to the Goods and Services Tax Council that is administering India’s biggest tax reform in 70 years.\nSlideshow (2 Images) Jaitley retains control over direct taxes that cover personal and corporate taxes, and in both there could be slight concessions for smaller businesses and the smaller taxpayers, a second finance ministry official said.\nFirms with an annual turnover of 500 million rupees ($7.87 million) or less are charged 25 percent corporate tax instead of the standard 30 percent but there is a proposal to move businesses with greater turnover into the lower tax band, the official said.\nJaitley had promised in 2015 to lower corporate taxes in four years to bring them more in line with Asia’s average corporate tax of 21.91 percent at the time. But there is little expectation of a sharp move in that direction, economists said.\nThe government is likely to look for additional revenues from stake sales and could set a 2018/19 target of 1 trillion rupees, according to a banker involved in the asset divestment program.\nNew Delhi looks set to bring asset sales of about 925 billion rupees in this financial year, well above the 725 billion rupee target, officials said. [L4N1PK4IH]\nNational flag carrier Air India is expected to be sold in the first half of 2018, spurred by a government decision to allow foreign airlines to take a 49 percent share. Foreign players could earlier invest in India’s private airlines, but not the state airline.\nFormer Reserve Bank of India Governor Raghuram Rajan said that at this stage, India would grow faster if the government were to execute the programs it has committed itself to, rather than opt for a large dose of fiscal expansion.\n“We have to focus, if you want enhanced growth, not in terms of fiscal stimulus, but in terms of implementation of all the projects that have been announced, the schemes that have been announced,” he told an Indian television channel on the margins of the Davos conference.\n“We need to take a look at all that stuff and make sure it’s working. I would like to see a budget focused more on implementation.”\n($1 = 63.5100 Indian rupees)\nEditing by Sanjeev Miglani and Raju Gopalakrishnan\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-28T14:02:00.000+02:00", "crawled": "2018-01-28T14:49:18.001+02:00", "highlightTitle": ""}