{"organizations": [], "uuid": "e5e2085f6be11775b2e69456e6f0bc5f160e4042", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 24, "shares": 24, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/10/31/104064482-GettyImages-618002496.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/december-ism-manufacturing-index-november-construction-spending.html", "country": "US", "domain_rank": 767, "title": "December ISM manufacturing index November construction spending", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.083, "site_type": "news", "published": "2018-01-03T17:01:00.000+02:00", "replies_count": 0, "uuid": "e5e2085f6be11775b2e69456e6f0bc5f160e4042"}, "author": "Kevin Breuninger", "url": "https://www.cnbc.com/2018/01/03/december-ism-manufacturing-index-november-construction-spending.html", "ord_in_thread": 0, "title": "December ISM manufacturing index November construction spending", "locations": [], "entities": {"persons": [{"name": "rick wilking", "sentiment": "none"}], "locations": [{"name": "marietta", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "pioneer pipe", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}], "organizations": [{"name": "ism", "sentiment": "negative"}, {"name": "institute for supply management", "sentiment": "none"}, {"name": "supply management", "sentiment": "none"}, {"name": "gaylord rockies resort & convention center", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. factory activity increased more than expected in December, boosted by a surge in new orders growth, in a further sign of strong economic momentum at the end of 2017.\nThe economy's robust fundamentals were also underscored by other data on Wednesday showing construction spending rising to a record high in November amid broad gains in both private and public outlays.\nThe Institute for Supply Management (ISM) said its index of national factory activity jumped to a reading of 59.7 last month from 58.2 in November. A reading above 50 indicates growth in manufacturing, which accounts for about 12 percent of the U.S. economy.\nThe survey's production sub-index rose 1.9 points to a reading of 65.8 and a gauge of new orders shot up 5.4 points to 69.4. Manufacturers also reported an increase in export orders. A measure of factory employment, however, fell to 57.0 last month from 59.7 in November.\nManufacturing is likely to get a boost this year from a $1.5 trillion tax cut approved by the Republican-controlled U.S. Congress last month. The overhaul of the tax code, the most sweeping in 30 years, slashed the corporate income tax rate to 21 percent from 35 percent.\nBusiness spending surged in anticipation of the corporate tax cuts. Recent weakness in the dollar and a strengthening global economy are expected to buoy exports of U.S.-made goods, which would underpin manufacturing.\nThe dollar rose against the euro and yen after Wednesday's data. U.S. stock indexes hit new record highs, while prices of U.S. Treasuries were mixed.\nSolid economic outlook In a separate report on Wednesday, the Commerce Department said construction spending rose 0.8 percent to an all-time high of $1.257 trillion in November. Construction spending advanced 2.4 percent on a year-on-year basis.\nThe manufacturing and construction reports added to data ranging from the labor market to housing and consumer spending in sketching a robust picture of the U.S. economy.\nGross domestic product estimates for the fourth quarter are converging around a 2.8 percent annualized rate. The economy grew at a 3.2 percent pace in the third quarter.\nIn November, spending on private residential projects soared 1.0 percent to the highest level since February 2007 after rising 0.3 percent in October. The increase was in line with a recent jump in homebuilding and supports the view that housing would boost economic growth in the fourth quarter after acting as a drag on gross domestic product since the April-June period.\nSpending on nonresidential structures rebounded 0.9 percent in November after falling 0.2 percent in the prior month. Overall, spending on private construction projects climbed 1.0 percent in November to a record high. That followed a 0.3 percent increase in October.\nOutlays on public construction projects rose 0.2 percent in November after jumping 3.5 percent in October. Spending on state and local government construction projects rose 0.7 percent. Federal government construction spending tumbled 4.8 percent.\nRick Wilking | Reuters A worker cuts a metal stud in the convention center part of the Gaylord Rockies Resort & Convention Center under construction outside Denver, Colorado. Construction spending U.S. construction spending increased more than expected in November, hitting a record high, driven by a surge in investment in private residential and nonresidential projects.\nThe Commerce Department said on Wednesday that construction spending rose 0.8 percent to an all-time high of $1.257 trillion. October's construction outlays were revised down to show a 0.9 percent rise instead of the previously reported 1.4 percent gain.\nEconomists polled by Reuters had forecast construction spending increasing 0.5 percent in November. Construction spending advanced 2.4 percent on a year-on-year basis.\nIn November, spending on private residential projects soared 1.0 percent to the highest level since February 2007 after rising 0.3 percent in October. The increase was in line with a recent jump in homebuilding and supports the view that housing would boost economic growth in the fourth quarter after being a drag to gross domestic product since the April-June period.\nThe strong construction spending report suggests fourth-quarter GDP growth estimates, which are currently just below a 3.0 percent annualized rate, could be raised. The economy grew at a 3.2 percent pace in the third quarter.\nSpending on nonresidential structures rebounded 0.9 percent in November after falling 0.2 percent in the prior month. Overall, spending on private construction projects climbed 1.0 percent in November to a record high. That followed a 0.3 percent increase in October.\nOutlays on public construction projects rose 0.2 percent in November after jumping 3.5 percent in October. Spending on state and local government construction projects rose 0.7 percent. Federal government construction spending tumbled 4.8 percent.\n--CNBC's Kevin Breuninger contributed to this report.", "external_links": [], "published": "2018-01-03T17:01:00.000+02:00", "crawled": "2018-01-03T17:01:57.006+02:00", "highlightTitle": ""}