{"organizations": [], "uuid": "eea3c7361b00bd71d3eb42e3a556dfb4b6e22f83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/ram_jwp_62646d22obpguf5cq33fshlmklr3uc.jpeg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/15/fca-ram-1500-truck/", "country": "US", "domain_rank": 1196, "title": "Ram 1500: Fiat Chrysler Aims to Challenge Ford, GM With New Truck | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.693, "site_type": "news", "published": "2018-01-15T16:11:00.000+02:00", "replies_count": 0, "uuid": "eea3c7361b00bd71d3eb42e3a556dfb4b6e22f83"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/15/fca-ram-1500-truck/", "ord_in_thread": 0, "title": "Ram 1500: Fiat Chrysler Aims to Challenge Ford, GM With New Truck | Fortune", "locations": [], "entities": {"persons": [{"name": "ram bra", "sentiment": "negative"}, {"name": "manley", "sentiment": "negative"}, {"name": "joe wilssens", "sentiment": "none"}, {"name": "kirsten korosec", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}], "organizations": [{"name": "gm", "sentiment": "negative"}, {"name": "fortune detroit auto show inside fca", "sentiment": "negative"}, {"name": "ford", "sentiment": "negative"}, {"name": "challenge ford", "sentiment": "negative"}, {"name": "fca global", "sentiment": "none"}, {"name": "north american international auto show", "sentiment": "none"}, {"name": "chevrolet silverado", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "gmc sierra", "sentiment": "none"}, {"name": "fiat chrysler", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Detroit Auto Show Inside FCA's Ford F-150 Challenger: The Ram 1500 Truck ike Manley, Head of Ram Brand at FCA Global, introduces the all-new 2019 Ram 1500 and the Ram 1500 Rebel at the truck's 2018 North American International Auto Show global debut. Courtesy of FCA/ Photo by Joe Wilssens By Kirsten Korosec 2:11 PM EST \nFiat Chrysler Automobiles on Monday unveiled the 2019 model year Ram 1500, a half-ton truck that’s lighter, quieter, more fuel efficient, and loaded with tech. And it’s gunning for the big players in the full-size truck segment: the Ford F-150 and GM’s Chevrolet Silverado and GMC Sierra. \nFCA introduced the truck—the flagship model of its Ram brand— at the North American International Auto Show in Detroit. The automaker didn’t just make a few tweaks to the truck. FCA overhauled the Ram 1500, shaving 225 pounds off its total weight, even while making the vehicle longer and wider. The Ram 1500’s wheelbase and cab are up to four inches longer, which FCA says gives the truck improved proportions and better aerodynamics. \nIt even got a new redesigned logo. \nFCA was able to reduce the truck’s weight by using aluminum in all the right places—the tailgate and engine mounts are just a couple of spots—as well as an increase in steel in the frame and body. \nThe bed height has been raised by 1.5 inches, which aligns it with the beltline of the body to create a stronger, consistent horizontal profile with aero benefits. Designers also add a new spoiler on the aluminum tailgate, which drivers can drop using an interior switch or with the key fob, that helps reduce drag. Wind tunnel profile shows the aerodynamics of the 2019 Ram 1500. Courtesy of FCA \nThe Ram 1500 has two engine options: a 3.6-liter Pentaster V-6 or a 5.7-liter Hemi V-8. Both engines come standard with an upgraded eight-speed automatic transmission. The standard 3.6-liter Pentaster V-6 engine can produce 305 horsepower and 269 pound-feet of torque. The 5.7-liter Hemi V-8 can deliver 395 horsepower and 410 lb-feet of torque. \nRam has added a new “eTorque” mild-hybrid system, which replaces the traditional starter on the engine with a belt-drive motor with a 48-volt battery pack. The system starts the engine, gives some extra torque, provides brake energy regeneration, and even a start/stop feature that can help save gas. \nThe truck can tow 12,750 pounds and carry 2,300 pounds of payload. Pricing and fuel economy ratings have not yet been released. The vehicle will head to dealers later this year. \nInside the new truck, future drivers and passengers will notice more tech. The Ram 1500 is equipped with a fourth-generation version of its Uconnect infotainment system, which drivers and passengers can interact with an upgraded 12-inch touchscreen or the standard 8.4-inch one. The vehicle also comes with Android Auto and Apple CarPlay, in-car software platforms that brings the functionality of a smartphone to the vehicle’s screen. \nThe navigation system accommodates one-step, voice-controlled destination entry and enhanced 3-D navigation map graphics and there’s also a new version of SiriusXM radio that’s designed to offer more “smart” features that are attuned to the driver’s listening tastes. Ram 1500 owners will receive a one-year subscription to SiriusXM All Access with the purchase of equipped 2019 model vehicles. \nThe vehicle also comes with a 360-degree camera that provides a bird’s-eye perspective of vehicle and a new Harman Kardon audio system with 19 premium speakers, 900-watt surround sound amplifier, 10-inch subwoofer, and active noise cancellation. 2019 Ram 1500 – Forward Collision Warning-Plus \nIt also comes with several advanced driver assistance features, including adaptive cruise control and forward collision warning. The vehicle will warn the driver if impact appears imminent, and assist by deploying brakes. The Ram 1500 also has a lane departure warning alert and parking assist that uses ultrasonic sensors to help the driver perform technical maneuvers. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-15T16:11:00.000+02:00", "crawled": "2018-01-15T21:41:29.003+02:00", "highlightTitle": ""}