{"organizations": [], "uuid": "512826969e8e2263d8035368cffec3431193dc85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/07/104932682-GettyImages-887419798.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/07/ubs-on-ch.html", "country": "US", "domain_rank": 767, "title": "UBS on fintech, EVs and the business environment in China", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.04, "site_type": "news", "published": "2018-01-08T05:25:00.000+02:00", "replies_count": 0, "uuid": "512826969e8e2263d8035368cffec3431193dc85"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/07/ubs-on-ch.html", "ord_in_thread": 0, "title": "UBS on fintech, EVs and the business environment in China", "locations": [], "entities": {"persons": [{"name": "shih", "sentiment": "none"}, {"name": "kathryn shih", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}], "organizations": [{"name": "ubs", "sentiment": "neutral"}, {"name": "ubs greater china conference", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "ubs asia pacific", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "19 Hours Ago | 02:59 \nBeijing's push to transition its economy has led to the country moving on from simply being known as the world's factory, according to a top executive at Swiss bank UBS. \n\"A lot of things are being created now in China , rather than [it just] being a manufacturing hub,\" Kathryn Shih, president of UBS Asia Pacific, told CNBC on the sidelines of the UBS Greater China Conference in Shanghai. \n\"China is at the forefront of a lot of changes in financial technology. So we see a lot of financial firms using China technology now, whether it's local firms or even international firms,\" she said. \nChanges have also come to the manufacturing front as China moves into more high-tech sectors, with Shih pointing to developments in the Chinese electric car industry. \n\"We see the advent of ... electric cars here and I think that's going to be great in creating Chinese brands in the future,\" Shih said. She added that many UBS investors were looking to invest in up-and-coming names in the space — in which China is currently angling to become a leading player . \nThe broader shift comes as China continues with its years-long plan to transition from a factory-led model of growth to one driven by services and innovation. \nAnd while the country has drawn criticism over the business environment for foreign firms — the EU Chamber of Commerce in China last year called the country's \"Made in China 2025\" manufacturing strategy an import-substitution plan — Shih had a sanguine take on UBS' prospects when compared to domestic asset managers. \n\"I think the main advantage of being local here is distribution channels and that happens everywhere. But China has actually been creating a more and more open field,\" she said, highlighting Beijing's announcement last year to lift the foreign equity ownership limit in certain financial sector joint ventures. \n\"There's been a lot of opening up in recent few months that is great for foreign firms like us,\" Shih added.", "external_links": [], "published": "2018-01-08T05:25:00.000+02:00", "crawled": "2018-01-08T05:25:50.006+02:00", "highlightTitle": ""}