{"organizations": [], "uuid": "18113b3047d6deb3e189721da5b5e46032939e6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-eu-banks-resolution/eu-bank-rescue-agency-seeks-help-to-improve-image-idUKKBN1FJ2O9", "country": "US", "domain_rank": 408, "title": "EU bank rescue agency seeks help to improve image", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T20:58:00.000+02:00", "replies_count": 0, "uuid": "18113b3047d6deb3e189721da5b5e46032939e6b"}, "author": "", "url": "https://uk.reuters.com/article/uk-eu-banks-resolution/eu-bank-rescue-agency-seeks-help-to-improve-image-idUKKBN1FJ2O9", "ord_in_thread": 0, "title": "EU bank rescue agency seeks help to improve image", "locations": [], "entities": {"persons": [{"name": "finn", "sentiment": "none"}, {"name": "elke koenig", "sentiment": "none"}, {"name": "francesco canepa", "sentiment": "none"}, {"name": "kristien vermo", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "neutral"}, {"name": "srb", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "banco popular", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 6:59 PM / Updated 5 minutes ago EU bank rescue agency seeks help to improve image Francesco Canepa 3 Min Read \nFRANKFURT (Reuters) - The European Union agency in charge of winding down failing banks is seeking external help to improve its image, tarnished by criticism of its handling of three collapsing lenders and of its preparedness for the task. \nLaunched in 2014 to end an era of bank bailouts, the Single Resolution Board came under fire last year for deciding not to intervene in two failing Italian banks, weeks after forcing losses on some investors in Spanish lender Banco Popular. \nThe Brussels-based agency, chaired by German regulator Elke Koenig, has hired Belgian public relations firm Finn for some advice on how to improve its communication, Finn and the SRB told Reuters. \nFinn is planning interviews with journalists and officials from EU and national institutions to help form its recommendations for the SRB. \n“Finn is supporting the SRB to continue developing its communication strategies and to enhance its visibility,” the firm’s co-founder, Kristien Vermoesen, told Reuters. \nA spokeswoman for the SRB said it would not publish Finn’s report, but the initiative was not linked to past cases. She added the contract was not advertised on the SRB’s website because it fell below a minimum threshold of 15,000 euro (£13,149). \nThe institution set improving its “communication in times of crisis” as one of its objectives for this year. \nPopular’s rescue was hailed by the Spanish government and EU bodies as a successful first test of a tougher European regime to deal with troubled lenders, after Popular was hit by a bank run. \nBut investors hurt by the intervention have argued that Popular was not necessarily on the verge of collapse, sparking a flurry of lawsuits against the SRB. \nThe SRB has also been criticised for declaring two failing Italian banks too small to be resolved under European rules, allowing the Italian government to provide state aid with laxer conditions. \nEU auditors said last month that the SRB may not be fully prepared to deal with a new banking crisis, since had detailed resolution plans for only some of the banks and those available were “still missing key elements”. \nThe SRB is intended to minimise the cost to taxpayers and depositors when failing banks are wound down, forcing the losses on their shareholders and bondholders instead. Reporting By Francesco Canepa, editing by Larry King", "external_links": [], "published": "2018-01-30T20:58:00.000+02:00", "crawled": "2018-01-30T21:17:21.041+02:00", "highlightTitle": ""}