{"organizations": [], "uuid": "c3c2f0a9dca186d79539208b82bd47d826fc577d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-first-trust-strategic-high-income-fund-ii-declares-its-monthly-common-share-distribution-of-0-point-08-per-share-for.html", "country": "US", "domain_rank": 767, "title": "First Trust Strategic High Income Fund II Declares its Monthly Common Share Distribution of $0.08 Per Share for February", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:47:00.000+02:00", "replies_count": 0, "uuid": "c3c2f0a9dca186d79539208b82bd47d826fc577d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-first-trust-strategic-high-income-fund-ii-declares-its-monthly-common-share-distribution-of-0-point-08-per-share-for.html", "ord_in_thread": 0, "title": "First Trust Strategic High Income Fund II Declares its Monthly Common Share Distribution of $0.08 Per Share for February", "locations": [], "entities": {"persons": [], "locations": [{"name": "wheaton", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WHEATON, Ill.--(BUSINESS WIRE)-- First Trust Strategic High Income Fund II (the \"Fund\") (NYSE: FHY) has declared the Fund’s regularly scheduled monthly common share distribution in the amount of $0.08 per share payable on February 15, 2018, to shareholders of record as of February 2, 2018. The ex-dividend date is expected to be February 1, 2018. The monthly distribution information for the Fund appears below.\nFirst Trust Strategic High Income Fund II (FHY):\nDistribution per share: $0.08 Distribution Rate based on the January 19, 2018 NAV of $14.47: 6.63% Distribution Rate based on the January 19, 2018 closing market price of $12.74: 7.54% A portion of this distribution may come from net investment income, net short-term realized capital gains or return of capital. The final determination of the source of tax status of all 2018 distributions will be made after the end of 2018 and will be provided on Form 1099-DIV.\nThe Fund is a diversified, closed-end management investment company that seeks to provide a high level of current income. As a secondary objective, the Fund seeks to provide capital growth. The Fund seeks to achieve its investment objectives by investing in a diversified portfolio of below-investment grade and investment grade debt securities, and equity securities that the investment sub-advisor believes offer attractive yield and/or capital appreciation potential. The Fund may invest up to 100% of its managed assets in below-investment grade debt securities (commonly referred to as \"high-yield\" or \"junk\" bonds).\nFirst Trust Advisors L.P., the Fund's investment advisor, along with its affiliate, First Trust Portfolios L.P., are privately-held companies which provide a variety of investment services, including asset management and financial advisory services, with collective assets under management or supervision of approximately $118 billion as of December 31, 2017 through unit investment trusts, exchange-traded funds, closed-end funds, mutual funds and separate managed accounts.\nBrookfield Investment Management Inc. (\"Brookfield\") serves as the Fund's investment sub-advisor. Brookfield is a wholly-owned subsidiary of Brookfield Asset Management, a global alternative asset manager with over $265 billion in assets under management as of September 30, 2017. Brookfield Asset Management has over a 100-year history of owning and operating assets with a focus on property, renewable power, infrastructure and private equity. Brookfield Asset Management's public market activities are conducted by Brookfield, a registered investment advisor, with over $16 billion of assets under management as of September 30, 2017.\nPast performance is no assurance of future results. Investment return and market value of an investment in the Fund will fluctuate. Shares, when sold, may be worth more or less than their original cost.\nPrincipal Risk Factors: The debt securities in which the Fund invests are subject to certain risks, including issuer risk, reinvestment risk, prepayment risk, credit risk, and interest rate risk. Issuer risk is the risk that the value of fixed-income securities may decline for a number of reasons which directly relate to the issuer. Reinvestment risk is the risk that income from the Fund's portfolio will decline if the Fund invests the proceeds from matured, traded or called bonds at market interest rates that are below the Fund portfolio's current earnings rate. Prepayment risk is the risk that, upon a prepayment, the actual outstanding debt on which the Fund derives interest income will be reduced. Credit risk is the risk that an issuer of a security will be unable or unwilling to make dividend, interest and/or principal payments when due and that the value of a security may decline as a result. Interest rate risk is the risk that fixed-income securities will decline in value because of changes in market interest rates. Residential mortgage-backed securities may have less potential for capital appreciation than comparable fixed-income securities due to the likelihood of increased prepayments of mortgages as interest rates decline.\nThe Fund invests in non-investment grade debt instruments, commonly referred to as \"high-yield securities\". High yield securities are subject to greater market fluctuations and risk of loss than securities with higher ratings. Lower-quality debt tends to be less liquid than higher-quality debt.\nThe Fund invests in securities of non-U.S. issuers which are subject to higher volatility than securities of U.S. issuers. Risks may be heightened for securities of companies located in, or with significant operations in, emerging market countries. Because the Fund invests in non-U.S. securities, you may lose money if the local currency of a non-U.S. market depreciates against the U.S. dollar.\nUse of leverage can result in additional risk and cost, and can magnify the effect of any losses.\nThe risks of investing in the Fund are spelled out in the shareholder reports and other regulatory filings.\nThe information presented is not intended to constitute an investment recommendation for, or advice to, any specific person. By providing this information, First Trust is not undertaking to give advice in any fiduciary capacity ERISA and the Internal Revenue Code. First Trust has no knowledge of and has not been provided any information regarding any investor. Financial advisors must determine whether particular investments are appropriate for their clients. First Trust believes the financial advisor is a fiduciary, is capable of evaluating investment risks independently and is responsible for exercising independent judgment with respect to its retirement plan clients.\nThe Fund’s daily closing New York Stock Exchange price and net asset value per share as well as other information can be found at www.ftportfolios.com or by calling 1-800-988-5891.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006584/en/\nFirst Trust Strategic High Income Fund II\nPress Inquiries:\nJane Doyle, 630-765-8775\nor\nAnalyst Inquiries:\nJeff Margolin, 630-915-6784\nor\nBroker Inquiries:\nJeff Margolin, 630-915-6784\nSource: First Trust Strategic High Income Fund II", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ftportfolios.com&esheet=51747155&newsitemid=20180122006584&lan=en-US&anchor=www.ftportfolios.com&index=1&md5=430d5a7561bb8af6fb53361ffd497f88", "http://www.businesswire.com/news/home/20180122006584/en/"], "published": "2018-01-23T00:47:00.000+02:00", "crawled": "2018-01-23T02:15:49.017+02:00", "highlightTitle": ""}