{"organizations": [], "uuid": "46df35df8da698f80cb1a61bd75370c28ac9e693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/15/104946217-GettyImages-903215052.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/15/trumps-going-to-davos-where-america-first-will-be-his-buzzword.html", "country": "US", "domain_rank": 767, "title": "Trump's going to Davos where 'America First' will be his buzzword", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.14, "site_type": "news", "published": "2018-01-15T13:50:00.000+02:00", "replies_count": 0, "uuid": "46df35df8da698f80cb1a61bd75370c28ac9e693"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/15/trumps-going-to-davos-where-america-first-will-be-his-buzzword.html", "ord_in_thread": 0, "title": "Trump's going to Davos where 'America First' will be his buzzword", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "neutral"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "america first'  davos", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "All eyes will be on President Donald Trump at the World Economic Forum (WEF) in Davos, Switzerland, this month with analysts predicting he will use the meeting as a chance to show off his economic and policy successes so far in office.\nTrump's attendance at the 2018 Forum, announced in early January, raised eyebrows at the time as the president has roundly criticized elites such as the rich and powerful that attend Davos. His former adviser Steve Bannon said during Trump's election campaign that working people were \"tired of being dictated to by what we call the party of Davos.\"\nTrump will be the first sitting present to visit the meeting in the Alps since Bill Clinton in 2000. Recent presidents have avoided the meeting, perhaps to avoid giving the wrong impression to voters by rubbing shoulders with the elite.\nJohn Raines, head of political risk at IHS Markit, told CNBC ahead of the Forum that Trump's decision to attend Davos was \"interesting\", given his criticism of the meeting.\n\"Here's a guy who has really complained about the Davos set for quite some time, (and) during (his election) campaign,\" Raines said. \"He's come out and said that he disagrees with the agenda, he disagrees with globalization, free trade and here he is going right into the vortex.\"\nshow chapters Trump preps for Davos as concerns loom over welfare reform and infrastructure projects 7:06 AM ET Wed, 10 Jan 2018 | 03:19 \"But it kind of goes with his personality in which he gets to have this shindig with the corporate elite and he also gets to point to some of his economic and policy successes,\" he added.\n'America First' Davos' theme this year is \"creating a shared future in a fractured world.\"\nThe Forum's organizers hope that the 2,500 or so attendees — ranging from heads of state to CEOs, business leaders and policymakers — can discuss and agree ways to resolve some of the world's most pressing problems such as inequality, climate change and poverty — not subjects that Trump has put top of his agenda while in power.\nRather, Trump's first year in office has been characterized by shock and awe, although not always in a good way.\nYet, while he has caused controversy over his policy pronouncements over Muslims and immigrants, and U-turns in foreign policy (such as the embassy relocation in Israel and backtrack over the nuclear deal for Iran), he has also garnered praise among the Republican party for an overhaul of the U.S. tax system and among his supporters for implementing an \"America First\" manifesto .\nChip Somodevilla/Pool via Bloomberg U.S. President Donald Trump waves to members of the media before boarding Marine One following his first medical exam at Walter Reed National Military Medical Center in Besthesda, Maryland, U.S., on Friday, Jan. 12, 2018. White House Press Secretary Sarah Sanders has already signaled that Trump will use his attendance at Davos \"to advance his America First agenda with world leaders,\" according to a statement, that added: \"At this year's World Economic Forum, the president looks forward to promoting his policies to strengthen American businesses, American industries, and American workers.\"\nIHS Market's Raines believed that Trump would make the most of Davos to trumpet his achievements: \"He can say the stock market is hitting new highs on a daily basis , and on top of that the U.S. growth rate's continuing to pick up so I think he gets to go there and defend his policies while he gets to hang out with the people he likes,\" he said.\n\"I don't think he's going to go into Davos saying, 'Look there's a social contract we need to uphold.' I think he goes in saying, 'Hey listen, follow me, I have a recipe for success and you guys need to follow suit.'\"\nWhat will Davos make of Trump? It will be interesting to see how Trump is received in Davos. While U.S. businesses have largely lauded his overhaul of the taxation system because it lowered the corporate tax rate from 35 percent to 21 percent, policy makers — even those to the right of the political spectrum — have been surprised by some of Trump's more controversial moves.\nThese include acts such as a travel ban targeting several Muslim-majority countries and trying to rescind the Deferred Action for Childhood Arrivals (DACA) program , which shielded children brought to the United States illegally by their parents from being deported.\nIn Europe too, Trump's brash leadership style and policies have not found favor with the continent's more conciliatory and collaborative approach to politics and trade policies.\nCarl Weinberg, chief economist and managing director at High Frequency Economics, told CNBC ahead of the meeting that Trump could prompt European leaders to continue to pivot away from the U.S.\nUkas Michae/Pool/Getty Images U.S. President Donald Trump and German Chancellor Angela Merkel \"Let's look at what the reaction might be to the president to Davos,\" Weinberg said. \"So he comes and lays out this American agenda — well, the last time he came to Europe (German Chancellor Angela) Merkel stepped up and said, 'Well, we don't really like what we're hearing from the U.S. so it's time for us to pivot our relationships perhaps away from the U.S. towards China and Asia'.\"\nHowever, Weinberg noted that Davos 2018 could be Trump's chance to refute the notion that the U.S. was turning its back on the world. \"This could be his chance to come out with his core view which is 'We don't object to globalism but we want it to be on an equal playing field.'\"\nOne year of Trump The WEF meeting comes as the one-year anniversary of Trump in power with his unorthodox style of government and communication having made waves the world over. This year's WEF is predicated on the idea that the world is \"fractured\" and its audience will be looking back at Trump's first year in office and what effect he has had on the world so far.\nSpeaking to CNBC ahead of Davos, John Studzinski, vice-chairman of Blackstone, said Trump's presidency had so far been like \"a tale of two cities.\"\n\"You have to think of domestic Trump and you have to think of international or foreign policy Trump,\" he told CNBC in December ahead of Davos 2018.\n\"On domestic Trump, the stock market has continued to be robust, his laissez-faire attitude with respect to regulation has been seen as a very positive indicator and markets have responded very well to that.\n\"On the other hand, he inherited a global shift in the hegemony of America as the center of the world order . That is shifting and, with President Xi Jinping's speech in Davos 2017 , has really shifted to China as potentially a greater source of stability in the world.\"\nshow chapters Jury's still out on US President Trump's foreign policy: Blackstone 8:27 PM ET Sun, 24 Dec 2017 | 04:31 It would be hard to be indifferent to Trump's first year in office, with the president polarizing his supporters and detractors at a domestic and global level even further.\nTrump's most controversial decisions so far have been perhaps the move to ban citizens from certain Muslim countries from being able to travel to the U.S., a move which met with protests, as well as his response to the violence in Charlottesville, North Carolina.\nIn terms of the U.S.' diplomatic relations, while the president has sought closer ties with countries like Chi", "external_links": [], "published": "2018-01-15T13:50:00.000+02:00", "crawled": "2018-01-15T13:50:28.005+02:00", "highlightTitle": ""}