{"organizations": [], "uuid": "cd98b20e0907d5a7a519a2333c94c99b7425e35d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219203360&w=1200&r=LYNXMPEE0304E", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-southkorea-japan-comfortwomen/south-koreas-president-moon-to-meet-former-comfort-women-idUSKBN1ET08Q", "country": "US", "domain_rank": 408, "title": "South Korea's President Moon to meet former 'comfort women'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T04:34:00.000+02:00", "replies_count": 0, "uuid": "cd98b20e0907d5a7a519a2333c94c99b7425e35d"}, "author": "", "url": "https://www.reuters.com/article/us-southkorea-japan-comfortwomen/south-koreas-president-moon-to-meet-former-comfort-women-idUSKBN1ET08Q", "ord_in_thread": 0, "title": "South Korea's President Moon to meet former 'comfort women'", "locations": [], "entities": {"persons": [{"name": "moon", "sentiment": "negative"}, {"name": "moon jae-in", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "blue house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - South Korean President Moon Jae-in on Thursday met women who were forced to work in Japanese wartime brothels, days after their plight again cast a shadow over relations with Japan.\nA South Korean panel set up to investigate a 2015 agreement with Japan on the thousands of girls and women forced to work in Japan’s military brothels, euphemistically termed “comfort women” by Japan, said the deal failed to meet their needs.\nMoon said the 2015 deal, under which Japan apologized to victims and provided 1 billion yen ($8.8 million) to a fund to help them, was seriously flawed. Japan said any attempt to revise it could damage relations.\nEight of the women met Moon for lunch at the presidential compound, known as the Blue House, in Seoul, the president’s office said in a statement.\n“We told you the previous government’s agreement was wrong and this issue hasn’t been resolved,” Moon told one of the women before the lunch.\n“It’s still not an easy situation to handle within our bilateral relationship.”\nMoon wanted to gauge the women’s reaction to his government’s position on the deal, the Blue House said.\nMoon visited one of the women, Kim Bok-dong, separately in the morning as she was ill and unable to attend the lunch.\n“We survived when bullets were raining down and we’ll be able to get through this,” Kim told Moon, the Blue House said.\nThe women want Japan to take legal, binding responsibility for its actions and Kim was scornful of the 2015 pay-out.\n“The money should be sent back to Japan,” she said.\nSouth Korean activists estimate that there may have been as many as 200,000 Korean women forced to work in the brothels.\nAs of December, there are at least 32 surviving, according to a South Korean civic group set up to look after their rights.\nIt was the second time former “comfort women” visited the Blue House during Moon’s presidency after one was invited to a dinner when U.S. President Donald Trump visited in November.\nMoon’s announcement on the Japanese deal last week raised consternation in Japan, where media reported said Prime Minister Shinzo Abe may decide not to visit South Korea for the Winter Olympics there next month.\nSouth Korea’s foreign ministry said on Thursday it would seek final measures on the issue as quickly as possible while one ministry official told Reuters the measures could be finalised as early as next week.\nStrained ties come as the U.S. allies are trying to cooperate on security in the face of North Korea’s nuclear and missile development.\nBut their bitter history, including Japanese colonization of the Korean peninsula and the issue of the women, has regularly been a source of rancor between them.\nMoon came to power in May after the removal of his disgraced predecessor, Park Geun-hye, whose conservative government was criticized for failing to fully consult victims over the 2015 settlement.\nReporting by Christine Kim; Additional reporting by Hyonhee Shin; Editing by Robert Birsel\n ", "external_links": [], "published": "2018-01-04T04:34:00.000+02:00", "crawled": "2018-01-04T04:51:37.008+02:00", "highlightTitle": ""}