{"organizations": [], "uuid": "b9b83af050ea0e0b28d1dbb6eb68a632cf548193", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-yemen-security/nine-killed-in-saudi-led-air-strike-in-yemen-residents-idUSKBN1FC2TO", "country": "US", "domain_rank": 408, "title": "Nine killed in Saudi-led air strike in Yemen: residents", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T21:56:00.000+02:00", "replies_count": 0, "uuid": "b9b83af050ea0e0b28d1dbb6eb68a632cf548193"}, "author": "", "url": "https://www.reuters.com/article/us-yemen-security/nine-killed-in-saudi-led-air-strike-in-yemen-residents-idUSKBN1FC2TO", "ord_in_thread": 0, "title": "Nine killed in Saudi-led air strike in Yemen: residents", "locations": [], "entities": {"persons": [{"name": "abd-rabbu mansour hadi", "sentiment": "none"}, {"name": "hadi", "sentiment": "none"}], "locations": [{"name": "yemen", "sentiment": "none"}, {"name": "aal ali", "sentiment": "none"}, {"name": "razeh", "sentiment": "none"}, {"name": "saada", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 7:58 PM / in 27 minutes Nine killed in Saudi-led air strike in Yemen: residents Reuters Staff 3 Min Read \nSAADA, Yemen (Reuters) - At least nine civilians, including four children, were killed in a Saudi-led coalition air strike in northern Yemen on Tuesday, residents and medics said, bringing to 30 the number of people killed in military operations in the country in two days. \nYemen has been torn apart by nearly three years of conflict, which pits the internationally-recognized government of President Abd-Rabbu Mansour Hadi against the Iran-aligned Houthis who control most of the populous northern Yemen. Hadi’s forces and their allies control vast areas in south and eastern Yemen. \nResidents said an aircraft struck a vehicle traveling in the Aal Ali region of Razeh district in western Saada province, an area of confrontation between government forces loyal to Hadi and the Houthis. \nApart from those killed, three people were wounded, including two who were being treated at a local hospital, medics said. \n“We take this report very seriously and it will be fully investigated as all reports of this nature are,” a spokesman for the coalition said. “Whilst this is ongoing, it would be inappropriate to comment further.” \nThough little territory has changed hands between the two sides since war erupted in 2015, it has caused a major humanitarian crisis in which more than 10,000 have been killed, according to U.N. data. \nIt has pushed Yemen to the brink of famine and led to a cholera epidemic believed to have affected about one million people. \nOn Monday, coalition air strikes destroyed a building near the Saada provincial capital that housed a small clinic, killing seven people, including five children, while two more people died in a separate attack, also near Saada city. \nThe Western-backed coalition has come under criticism from the United Nations and international rights groups over repeated air strikes that hit civilians. \nThe coalition says it directs strikes only at military targets. \nIn southwestern Yemen, rockets fired by the Houthis on Monday at a parade of Yemeni government special security forces killed 12 people, including two journalists. The deputy interior minister, who was attending the parade, escaped unharmed. Writing by Sami Aboudi; Editing by Richard Balmforth", "external_links": [], "published": "2018-01-23T21:56:00.000+02:00", "crawled": "2018-01-23T22:14:31.021+02:00", "highlightTitle": ""}