{"organizations": [], "uuid": "7d8a3cbf7109d3e39cf959097845802578a2c6c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-landmark-announces-quarterly-distribution-increase-schedules-fourth-quarter-2017-earnings-release-and-conference-call.html", "country": "US", "domain_rank": 767, "title": "Landmark Announces Quarterly Distribution Increase; Schedules Fourth Quarter 2017 Earnings Release and Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T02:37:00.000+02:00", "replies_count": 0, "uuid": "7d8a3cbf7109d3e39cf959097845802578a2c6c8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-landmark-announces-quarterly-distribution-increase-schedules-fourth-quarter-2017-earnings-release-and-conference-call.html", "ord_in_thread": 0, "title": "Landmark Announces Quarterly Distribution Increase; Schedules Fourth Quarter 2017 Earnings Release and Conference Call", "locations": [], "entities": {"persons": [], "locations": [{"name": "el segundo", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EL SEGUNDO, Calif., Jan. 24, 2018 (GLOBE NEWSWIRE) -- Landmark Infrastructure Partners LP (the “Partnership”) (NASDAQ:LMRK) announced today that the board of directors of its general partner declared a cash distribution of $0.3675 per common unit, or $1.47 per common unit on an annualized basis, for the quarter ended December 31, 2017. This quarter’s cash distribution, which represents a 5.0% increase year-over-year, marks the twelfth consecutive quarter that the Partnership has increased its quarterly cash distribution since its IPO in November 2014. The distribution is payable on February 14, 2018 to common unitholders of record as of February 5, 2018.\nThe Partnership plans to publicly release its fourth quarter 2017 earnings results prior to the opening of U.S. financial markets on Thursday, February 15, 2018. Interested parties are invited to listen to a conference call hosted by management discussing the Partnership’s earnings results.\nWebcast Information\nEvent: Q4 2017 Landmark Infrastructure Partners LP Earnings Call\nDate: Thursday, February 15, 2018\nTime: 12:00 p.m. Eastern Time\nWebcast: https://edge.media-server.com/m6/p/qynxjyzg\nConference Call Information\nU.S. and Canada: 877-930-8063\nInternational: 253-336-7764\nParticipant Passcode: 2161829\nReplay Information\nA webcast replay will be available approximately two hours after the completion of the conference call through February 15, 2019 at https://edge.media-server.com/m6/p/qynxjyzg .\nAn audio replay is also available through February 24, 2018.\nDial-in: 855-859-2056 or 404-537-3406\nParticipant Passcode: 2161829\nNotice\nThis release serves as qualified notice to nominees as provided for under Treasury Regulation Section 1.1446-4(b)(4) and (d). Please note that we believe that 100 percent of the Partnership’s distributions to foreign investors are attributable to income that is effectively connected with a United States trade or business. Accordingly, all of the Partnership’s distributions to foreign investors are subject to federal income tax withholding at the highest effective tax rate for individuals or corporations, as applicable. Nominees, and not the Partnership, are treated as withholding agents responsible for withholding distributions received by them on behalf of foreign investors.\nAbout Landmark Infrastructure Partners LP\nThe Partnership owns and manages a portfolio of real property interests and infrastructure assets that the Partnership leases to companies in the wireless communication, outdoor advertising and renewable power generation industries. Headquartered in El Segundo, California, the Partnership’s assets include long-term and perpetual easements, tenant lease assignments and fee simple properties, primarily located in the United States.\nCautionary Note Regarding Forward Looking Statements\nDisclosures in this press release contain certain forward-looking statements within the meaning of the federal securities laws. Statements that do not relate strictly to historical or current facts are forward-looking. These statements contain words such as “possible,” “if,” “will,” “expect” and “assuming” and involve risks and uncertainties including, among others that our business plans may change as circumstances warrant. Accordingly, readers should not place undue reliance on forward-looking statements as a prediction of actual results. For more information concerning factors that could cause actual results to differ materially from those conveyed in the forward-looking statements, please refer to the “Risk Factors” section of our Annual Report on Form 10-K for the year ended December 31, 2016, as supplemented by our Quarterly Reports on Form 10-Q and Current Reports on Form 8-K filed with the SEC. Any forward-looking statements in this press release are made as of the date of this press release and the Partnership undertakes no obligation to update or revise such forward-looking statements to reflect events or circumstances that occur, or of which the Partnership becomes aware, after the date hereof, unless required by law.\nCONTACT:\nMarcelo Choi\nVice President, Investor Relations\n(213) 788-4528\nir@landmarkmlp.com\nSource:Landmark Infrastructure Partners LP", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/5ae411f5-ec21-462c-8fe5-1d4e1f6f70c8", "https://www.globenewswire.com/Tracker?data=ClZmM9yVSw4vLiMWS3NRxTUNb5WG-rW-mH2Kt9f7TuaShmhNrBi05kNvI1yp1JmBc43lmC_8OAl_TWP7fPTAQmSuYJVmvwozWR_Cxr2dJiVV-CO2m2mgOoRmjQnzZgZykjhLP8EctNngXac1Bw92lg==", "https://edge.media-server.com/m6/p/qynxjyzg", "https://www.globenewswire.com/Tracker?data=ClZmM9yVSw4vLiMWS3NRxTUNb5WG-rW-mH2Kt9f7TuaShmhNrBi05kNvI1yp1JmBq0i5tKte2KylrRdurT9xSolPmuvfOpvW_LCo-OrP0OtC8KwCKwjGZRBa7WTVu9-rviVqHBtTVByaMocQT6uw3g=="], "published": "2018-01-25T02:37:00.000+02:00", "crawled": "2018-01-25T05:41:47.008+02:00", "highlightTitle": ""}