{"organizations": [], "uuid": "16620d25d2713ebfad5358740f9bcf14987f9b7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-veeam-appoints-ivan-skerl-as-chief-information-officer.html", "country": "US", "domain_rank": 767, "title": "Veeam Appoints Ivan Skerl as Chief Information Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.047, "site_type": "news", "published": "2018-01-25T15:15:00.000+02:00", "replies_count": 0, "uuid": "16620d25d2713ebfad5358740f9bcf14987f9b7a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-veeam-appoints-ivan-skerl-as-chief-information-officer.html", "ord_in_thread": 0, "title": "Veeam Appoints Ivan Skerl as Chief Information Officer", "locations": [], "entities": {"persons": [{"name": "ivan skerl", "sentiment": "negative"}, {"name": "veeam", "sentiment": "negative"}, {"name": "skerl", "sentiment": "none"}, {"name": "ivan", "sentiment": "none"}, {"name": "peter mckay", "sentiment": "none"}], "locations": [{"name": "veeam", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "veeam software", "sentiment": "none"}, {"name": "brock group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newly created role will oversee Veeam’s IT strategy to optimize performance, design and customize systems and platforms to enhance customer experience\nBAAR, Switzerland--(BUSINESS WIRE)-- Veeam Software , the Availability for the Always-On Enterprise™ innovator, today announced that Ivan Skerl has been appointed Chief Information Officer (CIO). In this role, Skerl will be instrumental in ensuring Veeam is able to accelerate its growth by optimizing IT performance and overseeing the use of cutting-edge technologies and systems. Skerl joins Veeam from The Brock Group where he served as Vice President, IT and CIO. As Veeam’s CIO, Skerl will report to Veeam Co-CEO and President, Peter McKay.\n“Ivan brings both a depth and breadth of technology and international business expertise in driving corporate transformations that will be a tremendous asset to Veeam as we continue to expand into new regions and markets,” said Peter McKay, Co-CEO and President at Veeam. “We are thrilled to welcome Ivan and look forward to his leadership of Veeam’s global IT organization and his contribution to corporate-level strategic initiatives.”\n“As a software company, Veeam understands the critical role technology plays in digital transformation, which our company is doing just like all of our customers,” said Skerl. “While Veeam’s operations have efficiently supported our first decade of growth, our next chapter is about scaling and future-proofing our internal systems to meet the needs of our expanding worldwide operations and the hyper-growth in our customer base. I’m very excited about this opportunity to help accelerate Veeam’s success.”\nSkerl brings more than 20 years of extensive experience in transforming businesses through leading technologies and innovation. An accomplished business technology professional, Skerl has co-authored, published papers and presented at computer science and IT symposiums and conferences.\nSkerl spent the last two years at Brock Group, a $1.5 billion private company, where he led and completed several transformational initiatives to drive growth. Prior to that, Skerl held several senior roles at Baker Hughes, a $24 billion public global enterprise, where he led the IT department in delivering high-quality, reliable services, high customer satisfaction, and strong financial and regulatory controls. While there, he turned around the organization by improving IT perception across 60,000 employees. His other notable achievements include conceptualizing and rolling out operating models, governance processes, and organizational structures including a 1-3-5 year roadmap resulting in a business driven IT investment portfolio. Skerl started his career at the Vinca Institute of Nuclear Sciences, the largest scientific institute in the Republic of Serbia, where he designed, implemented, and published on VinčaNet, the first campus-wide computer network in Yugoslavia.\nSkerl has a Master’s degree program in Computer Science from the University of Houston and earned a bachelor’s degree in Mathematics from the University of St. Thomas.\nFor more information, please visit www.veeam.com\nAbout Veeam Software\nVeeam® recognizes the new challenges companies across the globe face in enabling the Always-On Enterprise™, a business that must operate 24.7.365. To address this, Veeam has pioneered a new market of Availability for the Always-On Enterprise™ by helping organizations meet recovery time and point objectives (RTPO™) of less than 15 minutes for all applications and data, through a fundamentally new kind of solution that delivers high-speed recovery, data loss avoidance, verified recoverability, leveraged data and complete visibility. Veeam Availability Suite™ , which includes Veeam Backup & Replication™ , leverages virtualization, storage, and cloud technologies that enable the modern data center to help organizations save time, mitigate risks, and dramatically reduce capital and operational costs, while always supporting the current and future business goals of Veeam customers.\nFounded in 2006, Veeam has 53,000+ ProPartners and 282,000+ customers with the highest customer satisfaction scores in the industry. Headquartered in Baar, Switzerland, Veeam has offices in more than 30 countries. To learn more, visit https://www.veeam.com or follow Veeam on Twitter @veeam.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005534/en/\nVeeam Software\nHeidi Monroe Kroft, 614-339-8200 x8309\nPublic Relations Manager, Corporate & Americas\nSource: Veeam Software", "external_links": ["https://www.veeam.com/", "https://www.linkedin.com/in/skerl/", "https://www.veeam.com/data-center-availability-suite.html", "https://www.veeam.com/vm-backup-recovery-replication-software.html", "http://www.businesswire.com/news/home/20180125005534/en/"], "published": "2018-01-25T15:15:00.000+02:00", "crawled": "2018-01-25T16:58:51.005+02:00", "highlightTitle": ""}