{"organizations": [], "uuid": "2835a59a02e9e7ddf70b33ccba49c229567db562", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-independent-bank-group-inc-announces-additions-to-senior-leadership.html", "country": "US", "domain_rank": 767, "title": "Independent Bank Group, Inc. Announces Additions to Senior Leadership", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T00:45:00.000+02:00", "replies_count": 0, "uuid": "2835a59a02e9e7ddf70b33ccba49c229567db562"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-independent-bank-group-inc-announces-additions-to-senior-leadership.html", "ord_in_thread": 0, "title": "Independent Bank Group, Inc. Announces Additions to Senior Leadership", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "McKINNEY, Texas, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Independent Bank Group, Inc. (Nasdaq:IBTX), the holding company for Independent Bank, James Tippit has been promoted to Executive Vice President Corporate Responsibility and Mark Haynie is joining the company as Executive Vice President General Counsel.\nChairman of the Board and CEO David R. Brooks said, “The addition of James and Mark to our executive leadership team is an important step as we enter into our next phase of growth at Independent Bank. James has done outstanding work in overseeing the area of Corporate Responsibility at the bank, which includes Human Resources, Marketing and our efforts in community investment and involvement.” Brooks continued, “Mark is a well-recognized bank lawyer who has functioned as outside general counsel for our company for many years and is a trusted advisor to me and the board of directors. His leadership in building the legal department is another important step as we move forward and I’m personally honored that he is willing to join our company.” Brooks concluded, “Independent Bank Group will be a stronger company with the addition of these proven executives to our leadership team.”\nJames Tippit has been with Independent Bank since 2011 as Community Reinvestment Act (CRA) Officer and then Head of Corporate Responsibility. As EVP, he will continue to oversee Human Resources, CRA, Community Development, Marketing and Communications. Prior to joining Independent Bank, James worked for JP Morgan Chase in the Wealth Management Division and American Express Financial Advisors.\nMark Haynie has over 35 years of experience representing community banks in a wide variety of corporate, regulatory and securities matters. Haynie has represented Independent Bank Group since its formation in 2002, serving as lead counsel on all of the company’s M&A and capital markets transactions. Haynie will continue in this role as well as direct the company’s overall legal function.\nAbout Independent Bank Group\nIndependent Bank Group, through its wholly owned subsidiary, Independent Bank, provides a wide range of relationship-driven commercial banking products and services tailored to meet the needs of businesses, professionals and individuals. Independent Bank Group operates in four market regions located in the Dallas/Ft. Worth, Austin, and Houston, Texas and the Colorado Front Range areas.\nContacts:\nAnalysts/Investors:\nMichelle Hickox\nExecutive Vice President and Chief Financial Officer\n(972) 562-9004\nmhickox@ibtx.com\nMedia:\nPeggy Smolen\nVice President Marketing & Communications\n(972) 562-9004\npsmolen@ibtx.com\nSource:Independent Bank Group, Inc", "external_links": [], "published": "2018-01-09T00:45:00.000+02:00", "crawled": "2018-01-09T10:13:57.501+02:00", "highlightTitle": ""}