{"organizations": [], "uuid": "c088b78314c0fef5e94e260a5a7ad2594127c6cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-shares-seek-to-extend-rally-dollar-at-mercy-of-bears-idUSL4N1PN0KJ", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Asia shares seek to extend rally, dollar at mercy of bears", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T08:22:00.000+02:00", "replies_count": 0, "uuid": "c088b78314c0fef5e94e260a5a7ad2594127c6cf"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-shares-seek-to-extend-rally-dollar-at-mercy-of-bears-idUSL4N1PN0KJ", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Asia shares seek to extend rally, dollar at mercy of bears", "locations": [], "entities": {"persons": [{"name": "thoms", "sentiment": "none"}, {"name": "wayne cole", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Asia shares ex-Japan aiming for 12th session of gains\n* Nikkei edges up in face of rising yen\n* Dollar on defensive as Trump complains of “unfair” trade\nBy Wayne Cole\nSYDNEY, Jan 29 (Reuters) - Asian shares looked to extend their recent bull run on Monday amid upbeat corporate earnings and strong global economic growth, while more rumblings from the White House about “unfair” trade practices kept the U.S. dollar on the defensive.\nMSCI’s broadest index of Asia-Pacific shares outside Japan added 0.19 percent in early trade and aiming for a 12th straight session of gains. It is up nearly 8 percent for the year so far.\nJapan’s Nikkei rose 0.2 percent, though the export sector was again struggling with a rising yen.\nHong Kong has been the best performer for the year with a rise of almost 11 percent, followed by Shanghai blue chips with gains of nearly 9 percent.\nWall Street has likewise been on a tear. Just last week, the Dow rose 2.08 percent, the S&P 500 2.22 percent and the Nasdaq 2.31 percent.\nQuarterly earnings growth for the S&P 500 is estimated at 13.2 percent, according to Thomson Reuters data, up from 12 percent at the start of the year. Of the 133 companies in the index that have reported, almost 80 percent beat forecasts.\nAnother 36 percent of the S&P 500 is due to report this week including heavy hitters Apple, Alphabet, Facebook, Microsoft and Amazon.\nThe rush to equities combined with the risk of faster global inflation, has been a major negative for sovereign bonds with yields rising across much of the developed world.\nYields on U.S. two-year Treasuries have risen steadily to their highest since 2008 and are fully priced for a rate hike by the Federal Reserve in March.\nThe central bank holds its next meeting on Wednesday, the last for Chair Janet Yellen, and analysts suspect the statement will only cement expectations for a March move.\nWORDS MATTER The inexorable increase in Treasury yields has not, however, been enough to rescue the U.S. dollar which sank to three-year lows last week as U.S. officials welcomed a weaker currency.\nPresident Donald Trump did try and walk some of that back late in the week but by then the damage had been done.\nIndeed, in an interview shown on Sunday, Trump threatened to confront the European Union over what he calls “very unfair” trade policy toward the U.S..\n””Words“ in the world of FX do matter,” said Deutsche Bank strategist George Saravelos. “The U.S. is reengaging with a weak dollar policy similarly to the 1994-95 period.”\nThis was happening while the sum of trade and investment flows into the United States was shrinking. The opposite was happening in the euro zone where the German export engine was powering an ever-expanding current account surplus.\n“We continue to target $1.30 in EUR/USD for this year,” Saravelos concluded.\nEarly Monday, the euro was steady at $1.2425 having reached a three-year peak of $1.2538 last week. The dollar had also touched a four-month trough on the yen at 108.28 and was last changing hands at 108.54.\nAgainst a basket of major currencies, it was near the lowest since late 2014 at 89.053.\nThe dollar faces a bevy of U.S. economic tests this week including releases on inflation, manufacturing and payrolls.\nThe currency’s decline has been a boon for many commodities with gold making a 17-month top last week and last trading at $1,352.27 an ounce.\nOil prices reached their highest in three years and Brent crude futures were holding atop $70 at $70.42 a barrel. U.S. crude futures were up 5 cents at $66.19.\nEditing by Shri Navaratnam\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T08:22:00.000+02:00", "crawled": "2018-01-29T06:03:13.012+02:00", "highlightTitle": ""}