{"organizations": [], "uuid": "185abaa98e91f143d4955098689d90c32786cac3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-realogy-appoints-dave-gordon-as-chief-technology-officer.html", "country": "US", "domain_rank": 767, "title": "Realogy Appoints Dave Gordon As Chief Technology Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:45:00.000+02:00", "replies_count": 0, "uuid": "185abaa98e91f143d4955098689d90c32786cac3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-realogy-appoints-dave-gordon-as-chief-technology-officer.html", "ord_in_thread": 0, "title": "Realogy Appoints Dave Gordon As Chief Technology Officer", "locations": [], "entities": {"persons": [{"name": "dave gordon", "sentiment": "negative"}, {"name": "gordon", "sentiment": "none"}, {"name": "– ryan schneider", "sentiment": "none"}, {"name": "ryan schneider", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "realogy", "sentiment": "none"}, {"name": "madison", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "realogy holdings corp.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MADISON, N.J., Jan. 10, 2018 /PRNewswire/ -- Realogy Holdings Corp. (NYSE: RLGY), the largest full-service residential real estate services company in the United States, today announced the appointment of Dave Gordon as Executive Vice President, Chief Technology Officer. He has more than 20 years of leadership experience in technology, innovation and business operations in the financial services industry. Gordon will report directly to Realogy Chief Executive Officer and President Ryan Schneider and begin effective January 22, 2018.\nQuote: S:\n\"Dave Gordon brings a strong business background with substantial expertise transforming and building leading-edge technology organizations, building digital products and recruiting great talent. He is an innovative leader who will be responsible for our technology transformation and working closely with Realogy's other business leaders to help drive our aggressive change agenda.\"\n– Ryan Schneider, Realogy CEO and President\n\"I am excited to join Realogy and help lead the changes that will enable the Company to fully leverage its technology and data scale and increase the use of analytics in an integrated manner across business lines. It's a tremendous opportunity to work with Ryan Schneider and the Realogy leadership and technology teams as we focus on driving a technology transformation intended to improve business results.\"\n– Dave Gordon, Realogy Executive Vice President, Chief Technology Officer\nEXPERIENCE:\nMost recently, Gordon served for the past three years as U.S. Chief Technology & Operations Officer at BMO Financial Group, which has approximately 45,000 employees serving more than 12 million banking customers. In this role, he led the strategic technology, operations and data initiatives in the United States. Gordon was also responsible for the company's U.S. innovation pipeline, which included projects involving digitization, data analytics and artificial intelligence.\nPrior to joining BMO Financial Group, Gordon served in multiple officer roles at Promontory Financial Group from 2013 to 2015, including Chief Administrative Officer and Chief Technology and Information Officer, where he led technology, facilities and human resources.\nFrom 2001 to 2013, Gordon held several key senior leadership positions at Capital One, including Chief Information Officer of the North American Card business and Senior Vice President of Technology Infrastructure.\nCLICK TO TWEET:\nDave Gordon appointed as new Chief Technology Officer #CTO responsible for @Realogy technology transformation\nAbout Realogy Holdings Corp.\nRealogy Holdings Corp. (NYSE: RLGY) is a leading provider of residential real estate services that is focused on empowering independent sales agents to best serve today's consumers. Realogy delivers its services through its well-known industry brands including Better Homes and Gardens® Real Estate, CENTURY 21®, Coldwell Banker®, Coldwell Banker Commercial®, Corcoran®, ERA®, Sotheby's International Realty® as well as NRT, Cartus, Title Resource Group and ZapLabs (SM) , an in-house innovation and technology development lab. Realogy's fully integrated business model includes brokerage, franchising, relocation, mortgage and, title and settlement services. Realogy provides independent sales agents access to leading technology, best-in-class marketing and learning programs, and support services to help them become more productive and build stronger businesses. Realogy's affiliated brokerages operate around the world with approximately 192,600 independent sales agents in the United States and approximately 94,000 independent sales agents in more than 100 other countries and territories. Realogy is headquartered in Madison, New Jersey.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. All statements, other than those of historical fact, contained in this report, are forward-looking statements including, but not limited to, statements regarding the Company's strategic plans, including those related to technology. These forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of Realogy Holdings Corp. to be materially different from those expressed or implied by such forward-looking statements, including that there can be no assurance that the Company's strategic plans will be successfully implemented or result in the anticipated benefits to the Company as well as those discussed in the Company's filings with the SEC. Any forward-looking statements speak only as of the date of this press release and, except to the extent required by applicable securities laws, the Company expressly disclaims any obligation to update or revise any of them to reflect actual results, any changes in expectations or any change in events. For additional information concerning risks, uncertainties and other factors that may cause actual results to differ from those anticipated in the forward-looking statements, and risks to the Company's business in general, please refer to Realogy Holdings Corp.'s SEC filings, including its Annual Report on Form 10-K for the fiscal year ended December 31, 2016 and its Quarterly Report on Form 10-Q for the quarterly period ended September 30, 2017.\nView original content with multimedia: http://www.prnewswire.com/news-releases/realogy-appoints-dave-gordon-as-chief-technology-officer-300580669.html\nSOURCE Realogy Holdings Corp.", "external_links": ["http://www.prnewswire.com/news-releases/realogy-appoints-dave-gordon-as-chief-technology-officer-300580669.html", "https://ctt.ec/fM07T"], "published": "2018-01-10T16:45:00.000+02:00", "crawled": "2018-01-10T18:36:57.126+02:00", "highlightTitle": ""}