{"organizations": [], "uuid": "e28ff2c0cb57981f0701c1a7b87d0040b2475c8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104961968-GettyImages-866358458.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/15837362/device/rss/rss.html", "section_title": "U.S. News", "url": "https://www.cnbc.com/2018/01/23/hope-fear-as-puerto-rico-moves-to-privatize-power-company.html", "country": "US", "domain_rank": 767, "title": "Hope, fear as Puerto Rico moves to privatize power company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T18:24:00.000+02:00", "replies_count": 0, "uuid": "e28ff2c0cb57981f0701c1a7b87d0040b2475c8f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/hope-fear-as-puerto-rico-moves-to-privatize-power-company.html", "ord_in_thread": 0, "title": "Hope, fear as Puerto Rico moves to privatize power company", "locations": [], "entities": {"persons": [], "locations": [{"name": "puerto rico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "puerto rico electric power authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Taxes Hope, fear as Puerto Rico moves to privatize power company The announcement that Puerto Rico's governor is moving to privatize the U.S. territory's public power company has many on the island of 3.3 million people asking whether this will finally bring them more affordable electric bills and more reliable service. Gov. Ricardo Rossello said privatizing the power company would both improve service and lower power bills, and he predicted it would lead to more investment in renewable energy projects. Sen. Juan Dalmau, whose party supports independence for Puerto Rico, believes privatization would not necessarily translate into efficiency or savings. Published 3 Hours Ago SHARES Xavier Garcia | Bloomberg | Getty Images Puerto Rico Electric Power Authority (PREPA) employees fix power lines in Santurce, San Juan, Puerto Rico, on Thursday, Oct. 19, 2017. \nThe announcement that Puerto Rico 's governor is moving to privatize the U.S. territory's public power company has many on the island of 3.3 million people asking whether this will finally bring them more affordable electric bills and more reliable service. \nMore than 30 percent of customers are still without electricity more than four months after Hurricane Maria, and many blame that and previous blackouts on the Puerto Rico Electric Power Authority, whose infrastructure averages roughly 45 years old, compared with 18 years on the U.S. mainland. \nMany also wonder who, if anyone, would be willing to buy a power company that has a $9 billion debt load, filed for bankruptcy last year and faces longstanding accusations of mismanagement and corruption. But Puerto Ricans in a flurry of exchanges across social media after Monday's announcement seemed to agree that any change would be a good one, though they remained wary that the utility could fall into the wrong hands. \n\"Some people have faith that privatization will improve everything, but it's not a guarantee,\" said Puerto Rico economist Jose Caraballo. \"If a good deal isn't hammered out, Puerto Rico can end up worse than it is.\" \nGov. Ricardo Rossello said he will be working with legislators in the coming days to draft a measure that would allow the government to sell the utility's assets in a process expected to take 18 months. The majority leader in Puerto Rico's House of Representatives said he would back the measure, while the president of the island's Senate said he first needed to see the legislation to ensure it would serve the interests of all Puerto Ricans. \nPower bills on the island have long been double the average of those on the U.S. mainland, in part because of imported fuel supplies three-fourths of the energy consumed in Puerto Rico, according to the U.S. Energy Information Administration. \nRossello said privatizing the power company would both improve service and lower power bills, and he predicted it would lead to more investment in renewable energy projects. \n\"With this transformation of PREPA, you will cease being its hostage,\" he told Puerto Ricans. \"The deficient and obsolete system of generation and distribution of energy is one of the great impediments to our economic development.\" \nSen. Juan Dalmau, whose party supports independence for Puerto Rico, said privatization would not necessarily translate into efficiency or savings. \n\"The message is a manipulation of the justified hopelessness of an island facing a lack of power after the hurricane,\" he said. \nA spokesman for the utility did not return a message for comment, while union leaders said they would not comment until Tuesday. \nRossello said the electrical grid is not designed for Puerto Rico's current needs, noting that the greatest demand exists in the northern part of the island while the main generation plants are in the south. In addition to its aging infrastructure, PREPA has lost 30 percent of its employees in the last five years, 86 percent of whom worked in maintenance, he added. \nThe company also has faced internal turmoil. Its director was forced out in November after the utility failed to immediately call for help from its mainland counterparts after Hurricane Maria. Instead, PREPA granted a power-restoration contract to a little-known company that the utility was later forced to rescind. Most recently, PREPA was blamed for the failure to distribute badly needed parts found in one of its warehouses even as repairs to the storm-damaged power system went undone for lack of supplies. \nFounded in 1979 as a public utility run by appointees of the island's governor, PREPA has long been criticized for political patronage and inefficiency. It has been beset by frequent blackouts, including an island-wide outage in September 2016. \nThe island's water and sewer company was once privatized, but the government had to take it back over in the early 2000s after problems with service, billing and quality requirements set the U.S. Environmental Protection Agency. But Puerto Rico has been privatizing the operations of some government agencies in recent years amid a recession that has lasted more than a decade, including management of the main international airport and one of its main highways. \nEconomist Gustavo Velez said privatizing PREPA will be a positive move if whoever buys it is a good operator. He added that he supports the privatization of not only the power company, but other state agencies as well, including the Ports Authority, the water and sewer company and the highway authority. \n\"We have to open up all these utilities that are bankrupt, failed,\" Velez said. ", "external_links": [], "published": "2018-01-23T18:24:00.000+02:00", "crawled": "2018-01-23T19:25:25.001+02:00", "highlightTitle": ""}