{"organizations": [], "uuid": "6123b4684e0a9f598b71136338fed5024794ee04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222738638&w=1200&r=LYNXMPEE0G0ZC", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-romania-government/romanian-president-to-pick-new-premier-eyes-on-anti-corruption-drive-idUKKBN1F61QH", "country": "US", "domain_rank": 408, "title": "Romanian president to pick new premier, eyes on anti-corruption drive", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T15:53:00.000+02:00", "replies_count": 0, "uuid": "6123b4684e0a9f598b71136338fed5024794ee04"}, "author": "", "url": "https://uk.reuters.com/article/uk-romania-government/romanian-president-to-pick-new-premier-eyes-on-anti-corruption-drive-idUKKBN1F61QH", "ord_in_thread": 0, "title": "Romanian president to pick new premier, eyes on anti-corruption drive", "locations": [], "entities": {"persons": [{"name": "dragnea", "sentiment": "none"}, {"name": "mihai tudose", "sentiment": "none"}, {"name": "iohannis", "sentiment": "none"}, {"name": "klaus iohannis", "sentiment": "none"}, {"name": "viorica dancila", "sentiment": "none"}, {"name": "dancila", "sentiment": "none"}, {"name": "mihai fifor", "sentiment": "none"}, {"name": "luiza ilie", "sentiment": "none"}, {"name": "liviu dragnea", "sentiment": "none"}, {"name": "radu magdin", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "iohannis", "sentiment": "none"}], "organizations": [{"name": "psd", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  bucharest", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 58 PM / Updated 10 minutes ago Romanian president to pick new premier, eyes on anti-corruption drive Luiza Ilie 4 Min Read \nBUCHAREST (Reuters) - When Romanian President Klaus Iohannis appoints Romania’s third new prime minister in a year, his choice will mostly be judged on whether it will hamper or facilitate the European Union state’s struggle to stamp out high-level corruption. \nAn outspoken critic of the ruling Social Democrats’(PSD) record on combating graft, Iohannis is expected to announce on Wednesday who will replace former premier Mihai Tudose, who quit after falling out with powerful party leader Liviu Dragnea. \nThe PSD has proposed European Parliament lawmaker Viorica Dancila, but her close ties with Dragnea, who is from the same county as her, could be offputting for the president. Iohannis’ decision to make Defence Minister Mihai Fifor interim premier prompted speculation that he was the preferred choice. \n“The president is likely to ask for another nomination,” said Radu Magdin, a political consultant. \n“(Dancila) is a sensible member of the European Parliament but she may not match the PM profile due to the criticism that she is too close to the party leader.” \nDragnea is one of a number of ruling coalition members facing trial on corruption charges. Party attempts to decriminalise some corruption offences were seen by the public as an attempt to avoid prosecution and sparked massive street protests. \nDespite the revolving door to the prime minister’s office and the biggest protests Romania has seen since the 1989 fall of communism, the PSD and junior coalition partner ALDE control government and have a solid majority in parliament. \nRomania was the EU’s fastest-growing economy last year but it remains its second-poorest and in 2018 it faces rising current account and budget deficits as well as interest rates. \nTransparency International ranks Romania as one of the European Union’s most corrupt states and Brussels keeps its justice system under special monitoring, although it has praised magistrates for their efforts to root out high-level graft. \nDragnea, who holds a tight grip over his party, cannot be prime minister because of a previous conviction in a vote-rigging case. \nHe is also currently on trial in an abuse of office case and faces a separate criminal investigation on suspicion of forming a criminal group to siphon off cash from state projects. He has denied all charges. \nThe government will be under pressure from the party to enforce an ambitious governing programme including further tax cuts, public sector wage and pension hikes and judicial changes. \nWhoever becomes prime minister will have the ability to push changes to judicial rules as government decrees, bypassing the lengthy legislative process. Tudose appeared reluctant to do so. His predecessor, Sorin Grindeanu, backed down from changing the criminal code in the face of street protests. \nIn December, PSD and junior coalition partner ALDE used their large parliamentary majority to approve a judicial overhaul that critics said limits magistrates’ independence and poses risks to rule and order. It is pending a challenge at the Constitutional Court. \nThe PSD also filed a slew of new changes to the criminal code that would decriminalise several graft offences, their second attempt in a year to weaken a crackdown on corruption. \nDozens of lawmakers and mayors across all parties stand to benefit from the changes. Romania’s anti-corruption prosecution unit has sent 72 members of parliament to trial since 2006. Writing by Justyna Pawlak; Editing by Raissa Kasolowsky", "external_links": [], "published": "2018-01-17T15:53:00.000+02:00", "crawled": "2018-01-17T16:11:25.000+02:00", "highlightTitle": ""}