{"organizations": [], "uuid": "a925be68c926433740f3757cc9cc56c01c790c08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222211620&w=1200&r=LYNXMPEE0E1BL", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-shell-solar/shell-ventures-back-into-solar-idUKKBN1F42G4", "country": "US", "domain_rank": 408, "title": "Shell ventures back into solar", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T20:41:00.000+02:00", "replies_count": 0, "uuid": "a925be68c926433740f3757cc9cc56c01c790c08"}, "author": "", "url": "https://uk.reuters.com/article/uk-shell-solar/shell-ventures-back-into-solar-idUKKBN1F42G4", "ord_in_thread": 0, "title": "Shell ventures back into solar", "locations": [], "entities": {"persons": [{"name": "ron bousso", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}, {"name": "lightsource", "sentiment": "none"}], "organizations": [{"name": "reuter", "sentiment": "negative"}, {"name": "shell", "sentiment": "negative"}, {"name": "silicon ranch corporation", "sentiment": "none"}, {"name": "royal dutch shell", "sentiment": "none"}, {"name": "partners group", "sentiment": "none"}, {"name": "silicon ranch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 42 PM / Updated 10 minutes ago Shell ventures back into solar Ron Bousso 3 Min Read \nLONDON (Reuters) - Royal Dutch Shell ( RDSa.L ) agreed on Monday to acquire a stake in a U.S. solar company, 12 years after exiting the sector, in the latest in a series of deals to grow beyond its core oil and gas business. FILE PHOTO: A logo for Shell is seen on a garage forecourt in central London, Britain, March 6, 2014. REUTERS/Neil Hall/File Photo \nThe Anglo-Dutch company also gave the green light for its first major new project in the North Sea in six years, signalling a cautious return to spending following three years of belt tightening in the face of lower oil prices. \nShell agreed to buy a 43.86 percent stake in Silicon Ranch Corporation from funds linked to Partners Group for up to $217 million (157.14 million pounds). It follows on the heels of British rival BP ( BP.L ), which last month also re-entered the solar sector with the $200 million investment in Lightsource. \nNashville, Tennessee-based Silicon Ranch develops, owns and operates solar plants across the United States with a capacity of 880 megawatts. Shell also has an option to increase its ownership after 2021. \n“With this entry into the fast-growing solar sector, Shell is able to leverage its expertise as one of the top three wholesale power sellers in the U.S., while expanding its global New Energies footprint,” Marc van Gerven, Shell vice president of solar,   \nIn November, Shell doubled its planned investment in its new energies division, which focuses on renewables and low carbon technologies, to $1 billion-$2 billion until 2020. \nThe investment in renewables far exceeds those of other major oil companies but still represents a fraction of Shell’s overall capital expenditure of around $25 billion. \nOil companies have come under growing pressure from investors to adapt to the transition to lower carbon energy as governments seek to reduce greenhouse gas emissions by the end of the century. \nThe deal follows a number of recent investments by Shell in the rapidly growing electric vehicle sector, including the acquisition in October of Dutch-based NewMotion. \nLast month, Shell agreed to buy British household energy and broadband provider First Utility, targeting a market for its gas supplies which it expects will play a growing role in the transition to low carbon energy sources. \nShell first entered the solar sector when it acquired Siemens Solar in 2002, only to sell the entire business six years later. It still retains a tiny stake in Showa Shell’s solar business after selling most of the business in 2016. Reporting by Ron Bousso; Editing by Susan Fenton", "external_links": [], "published": "2018-01-15T20:41:00.000+02:00", "crawled": "2018-01-15T21:01:29.061+02:00", "highlightTitle": ""}