{"organizations": [], "uuid": "273921099e29824c29e5f31296c3c1432caf3098", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220816875&w=1200&r=LYNXMPEE090Q5", "site_section": "http://feeds.reuters.com/reuters/peopleNews", "section_title": "Reuters: People News", "url": "https://www.reuters.com/article/us-people-harvey-weinstein-france-deneuv/french-feminists-liken-deneuve-and-fellow-metoo-critics-to-tiresome-uncle-idUSKBN1EZ1EH", "country": "US", "domain_rank": 408, "title": "French feminists liken Deneuve and fellow #Metoo critics to 'tiresome uncle'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T14:35:00.000+02:00", "replies_count": 0, "uuid": "273921099e29824c29e5f31296c3c1432caf3098"}, "author": "", "url": "https://www.reuters.com/article/us-people-harvey-weinstein-france-deneuv/french-feminists-liken-deneuve-and-fellow-metoo-critics-to-tiresome-uncle-idUSKBN1EZ1EH", "ord_in_thread": 0, "title": "French feminists liken Deneuve and fellow #Metoo critics to 'tiresome uncle'", "locations": [], "entities": {"persons": [{"name": "deneuve", "sentiment": "negative"}, {"name": "catherine deneuve", "sentiment": "none"}, {"name": "harvey weinstein", "sentiment": "none"}, {"name": "caroline de haas", "sentiment": "none"}, {"name": "oprah winfrey", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "le monde", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 12:36 PM / Updated 7 hours ago French feminists liken Deneuve and fellow #Metoo critics to 'tiresome uncle' Reuters Staff 3 Min Read \nPARIS (Reuters) - Catherine Deneuve and other critics of the #Metoo movement against sexual harassment sound like “the tiresome uncle at the family dinner” who does not understand that the world is changing, leading French feminists said on Wednesday. \nDeneuve and 99 other women on Tuesday signed a column in the newspaper Le Monde that argued that the #Metoo movement amounted to puritanism and was fueled by a hatred of men. \nTheir column struck a radically different tone from that of Sunday’s Golden Globe Awards ceremony at which Oprah Winfrey and major Hollywood figures backed #Metoo and other initiatives to fight gender inequality and sexual assault. \n“With this column they are trying to build back the wall of silence we have started breaking down,” feminist activist Caroline De Haas and some 30 other women said in their own column, published by franceinfo TV’s website. \nIn the aftermath of accusations against U.S. movie producer Harvey Weinstein, millions of women took to social media to share their stories of being sexually harassed or assaulted, using the #Metoo hashtag worldwide or #SquealOnYourPig (#balancetonporc)in France. \nBut 74-year-old Deneuve and the other signatories to the column said the #Metoo movement had gone too far, defending what they termed as a right for men to “pester” women. They said this was essential to sexual freedom and that women could be strong enough “not to be traumatized by gropers in the metro.” FILE PHOTO: 70th Cannes Film Festival - Event for the 70th Anniversary of the festival - Red Carpet Arrivals - Cannes, France. 23/05/2017. REUTERS/Stephane Mahe/File Photo \n“It’s dangerous to put it this way,” Gender Equality Minister Marlene Schiappa told France Culture radio, saying the government was already struggling to convince young women they are not to blame when someone gropes them and that they should go to the police to file a complaint when it happens. \nSchiappa told Reuters last year that she believed the Weinstein scandal would force a rethink of attitudes toward sexual harassment in France. \nTransport Minister Elisabeth Borne told France 2 television the column was “a bit out of sync with what many women may experience.” \nDeneuve received international acclaim for her acting, which included starring roles in films by renowned directors Francois Truffaut, Roman Polanski and Luis Bunuel. \nDeneuve also occasionally worked as a model, including as the face of Chanel No 5 and representing Marianne, the national symbol of France for some years during the 1980s. \nDe Haas and the other activists argued that those of a mind with Deneuve ignore the reality of sexual harassment. \n“As soon as there is some progress with (gender) equality, even by half a millimeter, some good souls warn that we may be going too far,” they wrote. Reporting by Ingrid Melander; Additional reporting by Caroline Pailliez; Editing by Raissa Kasolowsky, Larry King", "external_links": [], "published": "2018-01-10T14:35:00.000+02:00", "crawled": "2018-01-10T14:53:30.002+02:00", "highlightTitle": ""}