{"organizations": [], "uuid": "6296d10135a780a2d31076f20c69b079479ae244", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-new-york-le-bernardin/new-york-restaurant-le-bernardin-sued-for-sexual-harassment-idUSKBN1FD38S", "country": "US", "domain_rank": 408, "title": "New York restaurant Le Bernardin sued for sexual harassment", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T01:12:00.000+02:00", "replies_count": 0, "uuid": "6296d10135a780a2d31076f20c69b079479ae244"}, "author": "", "url": "https://www.reuters.com/article/us-new-york-le-bernardin/new-york-restaurant-le-bernardin-sued-for-sexual-harassment-idUSKBN1FD38S", "ord_in_thread": 0, "title": "New York restaurant Le Bernardin sued for sexual harassment", "locations": [], "entities": {"persons": [{"name": "jonathan stempel", "sentiment": "neutral"}, {"name": "le bernardin", "sentiment": "neutral"}, {"name": "kristin avery", "sentiment": "none"}, {"name": "maguy le coze", "sentiment": "none"}, {"name": "maimon kirschenbaum", "sentiment": "none"}, {"name": "ripert", "sentiment": "none"}, {"name": "eric ripert", "sentiment": "none"}, {"name": "le coze", "sentiment": "none"}, {"name": "avery", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "u.s. district court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - The famed New York City seafood restaurant Le Bernardin was sued on Wednesday by a former server who said female employees are subjected to sexual harassment and that management ignores their complaints or shames them for coming forward.\nKristin Avery, 29, a server from Sept. 2012 to July 2015, also named co-owners Maguy Le Coze and celebrity chef Eric Ripert as defendants in her complaint filed in the U.S. District Court in Manhattan.\nWhile Avery did not allege harassment specifically by Ripert, she accused Le Coze of “body shaming” for mocking her pregnancy-related weight gain.\nAvery, who now lives in Virginia outside Washington, D.C., also brought class-action claims for alleged failures to pay minimum wage and overtime.\n“My reaction is very simple. All of these allegations are completely false, completely, all of them,” Ripert said in a phone interview. “I am looking forward to defending our position in court.”\nAvery’s lawyer Maimon Kirschenbaum in a phone interview said Le Coze and Ripert “set the culture of the house” and must ensure that employees alleging harassment are not “squashed” by management. “The policy should not just be lip service,” he said.\nLe Bernardin was sued six weeks after celebrity chef Mario Batali stepped back from his own businesses after being accused of sexual misconduct.\nLong regarded as one of the world’s best restaurants, Le Bernardin is one of five New York City restaurants to have three Michelin stars, and also has four stars from The New York Times.\nIt was opened in 1986 by Le Coze and her brother Gilbert Le Coze, who died in 1994.\nAvery said Le Bernardin’s general manager ignored her several complaints about sexual harassment by male employees, and once told kitchen staff not to talk to her because she was “dangerous” and “a lawsuit waiting to happen.”\nShe said the alleged harassment included two occasions when captains touched her inappropriately on her butt, and one where kitchen staff claimed she made up a sexual assault and called her a whore.\nAvery also said that after returning to work in early 2015 following her daughter’s birth, Maguy Le Coze put her hand on her stomach and asked “Are you planning on losing weight?”\nAvery said she was trying to avoid dessert, and tearfully broke down after Le Coze allegedly responded: “It is very important.”\nRipert said “what surprised me a lot is that we are learning about this lawsuit through the press. We were not even aware of the accusations.”\nReporting by Jonathan Stempel in New York; editing by Clive McKeef\n ", "external_links": [], "published": "2018-01-25T01:12:00.000+02:00", "crawled": "2018-01-25T01:25:35.000+02:00", "highlightTitle": ""}