{"organizations": [], "uuid": "aeefce568234b52abf745188ac52779a7abb5aa5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-up-as-dollar-hurt-by-u-s-government-shutdown-fears-idUSL8N1PE3KK", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold up as dollar hurt by U.S. government shutdown fears", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-19T21:27:00.000+02:00", "replies_count": 0, "uuid": "aeefce568234b52abf745188ac52779a7abb5aa5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-up-as-dollar-hurt-by-u-s-government-shutdown-fears-idUSL8N1PE3KK", "ord_in_thread": 0, "title": "PRECIOUS-Gold up as dollar hurt by U.S. government shutdown fears", "locations": [], "entities": {"persons": [{"name": "maytaal angel", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Gold, silver, palladium set for first weekly drop in six * Platinum on track for sixth weekly gain * Analysts cautious on gold as dollar weakness seen overdone (Updates prices) By Maytaal Angel LONDON, Jan 19 (Reuters) - Gold prices rose half a percent on Friday as the dollar laboured near a three-year low on heightened fears of a U.S. government shutdown, but the precious metal was still on track for its first weekly drop in six. The U.S. dollar fell versus a basket of currencies after legislation to stave off an imminent federal government shutdown encountered obstacles in the Senate late on Thursday. A weak dollar makes dollar-priced gold cheaper for non U.S. investors. Spot gold was up 0.5 percent at $1,335.76 an ounce at 1314 GMT, on track for a weekly drop of 0.3 percent, having fallen from four-month highs hit on Monday. U.S. gold futures were up 0.5 percent at $1,334.40. Capping gains in gold, bond yields have been rising this week on expectations that strong economic data globally will encourage the U.S. Federal Reserve to press on with monetary tightening. Expectations of rising interest rates tend to lift bond yields, reducing the appeal of holding non-yielding bullion while also boosting the dollar, in which gold is priced. \"It all depends on the direction of the dollar and our forex strategists expect a dollar rebound as a result of rate hikes so gold should pare some of its gains,\" said Commerzbank analyst Carsten Fritsch. The Fed should raise interest rates three to four times in both 2018 and 2019, Cleveland Fed President Loretta Mester said on Thursday, a pace that is a bit faster than many of her fellow policymakers prefer. \"The overall run in gold has been overdone. The overall weakness in U.S. dollar is over ... I can't be more cautious on gold prices at the moment,\" said Mark To, head of research at Hong Kong's Wing Fung Financial Group. \"The fundamentals remain the same with the large trading range remaining intact at $1,200 to $1,400, with no major change in global political tensions or rate hike outlook,\" To said. Spot gold is still targeting $1,311 per ounce, as suggested by a small double-top and a Fibonacci retracement analysis, according to Reuters technical analyst Wang Tao. Holdings of SPDR Gold Trust , the world's largest gold-backed exchange-traded fund, rose 1.4 percent to 840.76 tonnes on Thursday from Wednesday. Silver advanced 0.5 percent to $17.02 per ounce, while palladium gained 0.8 percent to $1,108, but both metals, like gold, were set for their first weekly drop in six. Platinum climbed 1.1 percent to $1,010.90, having hit its highest since last September at $1,014.50, as it headed for its sixth weekly gain. (Additional reporting by Nallur Sethuraman in Bengaluru; Editing by Mark Potter and Edmund Blair)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T21:27:00.000+02:00", "crawled": "2018-01-20T17:26:48.031+02:00", "highlightTitle": ""}