{"organizations": [], "uuid": "eaf75353c1837c4e75d3eef96cd1c7cf4eb276ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-old-dominion-peanut-company-to-close-its-manufacturing-facility.html", "country": "US", "domain_rank": 767, "title": "Old Dominion Peanut Company to Close Its Manufacturing Facility", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T23:40:00.000+02:00", "replies_count": 0, "uuid": "eaf75353c1837c4e75d3eef96cd1c7cf4eb276ef"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-old-dominion-peanut-company-to-close-its-manufacturing-facility.html", "ord_in_thread": 0, "title": "Old Dominion Peanut Company to Close Its Manufacturing Facility", "locations": [], "entities": {"persons": [{"name": "hammond", "sentiment": "none"}, {"name": "andrew schuman", "sentiment": "none"}], "locations": [{"name": "denver", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "norfolk", "sentiment": "none"}], "organizations": [{"name": "old dominion peanut company", "sentiment": "negative"}, {"name": "old dominion", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER, Jan. 5, 2018 /PRNewswire/ -- Old Dominion Peanut Company today announced its intention to close its manufacturing facility in Norfolk, Virginia . As a result of a six-month analysis of the company's current operations and future needs of its customers, the decision comes in the wake of the neighborhood in transition from manufacturing and warehousing, to retail and upscale residential apartments, higher operating costs, and the lack of efficiencies operating out of multiple buildings.\n\"Business decisions that directly impact our employees are extremely difficult,\" said Andrew Schuman, President and Chief Executive Officer of Hammond's Brands. \"Old Dominion has operated in Norfolk for over 100 years and we have employees that have been with us for nearly 40 years. The plant closure does not reflect the end of the Old Dominion Peanut Company, rather it marks the beginning of the next chapter of our business operations for long-term health.\"\nThe closing is expected to be completed by early summer of this year. Hammond's Brands, owner of Old Dominion Peanut Company will relocate part of the ODP operations to its headquarters in Denver, Colorado and certain production of its products will be transferred to a third party under a long-term co-manufacturing agreement.\n\"This is a company restructuring initiative that will allow the company to intensify product scope and drive future profitability to our core businesses. Our response to this unfortunate solution is that we must combine a commitment to long-term investments in innovation and manufacturing. We believe this closure is crucial to our ability to increase efficiency and reduce the company's cost structure. Today's news will allow us to accelerate our growth strategy and drive long-term change, all to further Hammond's success,\" said Schuman.\nThe Norfolk facility currently employs approximately 70 wage and salaried employees and produces products such as peanut brittles, nut candies, and chocolate covered nuts. Recognizing that the ODP facility has been a significant part of the local economy in Norfolk, Hammond's is enlisting the aid of the Virginia Employment Commission and communities to allow workers the maximum access to public services and ensure a seamless transition for our employees.\nSchuman added, \"I am overwhelmingly appreciative of the contributions each of our employees have made to our company, and am sorry we have not been able to find a solution that would allow us to continue operations in Norfolk. Norfolk remains a wonderful place to do business and we have greatly respected the many services over the years provided by the city. We wish nothing but the best for the Norfolk and Hampton Roads communities.\"\nAbout Hammond's\nHammond's Candies began delighting candy lovers with artisan candy canes, beautifully spun ribbon candy, and larger-than-life lollipops when it was founded by the Hammond family in 1920, making it Colorado's favorite handmade confectioner for decades. In 2007, the company became the Hammond's that it is today through its acquisition by current President and CEO Andrew Schuman, growing from a much-loved, local candy company to a leading gourmet sweet provider with national regard. Hammond's has made several acquisitions to fuel its growth and has gain impressive recognitions for their brand packaging and product innovation.\nFollow Hammond's Candies on Facebook at http://www.facebook.com/hammondscandies and on Pinterest at http://pinterest.com/hammondscandies/ to stay up to date on their latest releases. More information is also available at www.hammondscandies.com or by calling 1-800-CANDY-99 (1-800-226-3999).\nMedia Contact:\nLynn Brainard\n188289@email4pr.com\nTelephone: 714-771-4397\nView original content with multimedia: releases/old-dominion-peanut-company-to-close-its-manufacturing-facility-300578330.html\nSOURCE Hammond's Brands", "external_links": ["http://www.hammondscandies.com/", "http://pinterest.com/hammondscandies/", "http://www.facebook.com/hammondscandies", "http://www.prnewswire.com/news-releases/old-dominion-peanut-company-to-close-its-manufacturing-facility-300578330.html"], "published": "2018-01-05T23:40:00.000+02:00", "crawled": "2018-01-06T01:05:10.009+02:00", "highlightTitle": ""}