{"organizations": [], "uuid": "ab4f4b1d9b356abbd56aa979192095ff93c1b779", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223409264&w=1200&r=LYNXMPEE0I1GD", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-usa-honduras-moneylaundering/ex-honduran-minister-gets-nearly-two-and-a-half-years-prison-in-u-s-drug-case-idUSKBN1F82C1", "country": "US", "domain_rank": 408, "title": "Ex-Honduran minister gets nearly two-and-a-half years prison in U.S. drug case", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T20:26:00.000+02:00", "replies_count": 0, "uuid": "ab4f4b1d9b356abbd56aa979192095ff93c1b779"}, "author": "", "url": "https://www.reuters.com/article/us-usa-honduras-moneylaundering/ex-honduran-minister-gets-nearly-two-and-a-half-years-prison-in-u-s-drug-case-idUSKBN1F82C1", "ord_in_thread": 0, "title": "Ex-Honduran minister gets nearly two-and-a-half years prison in U.S. drug case", "locations": [], "entities": {"persons": [{"name": "brendan pierson", "sentiment": "none"}, {"name": "rosenthal", "sentiment": "none"}, {"name": "juan orlando hernandez", "sentiment": "none"}, {"name": "yankel rosenthal", "sentiment": "none"}, {"name": "hernandez", "sentiment": "none"}, {"name": "john koeltl", "sentiment": "none"}, {"name": "samidh guha", "sentiment": "none"}, {"name": "emil bove", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "honduras", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 6:24 PM / in 21 minutes Ex-Honduran minister gets nearly two-and-a-half years prison in U.S. drug case Brendan Pierson 3 Min Read \nNEW YORK (Reuters) - A former member of Honduran President Juan Orlando Hernandez’s cabinet was sentenced by a New York federal judge to nearly 2-1/2 years in prison on Friday, after pleading guilty to attempting to launder drug money from the Central American country. \nYankel Rosenthal, who served as minister of investment under Hernandez, received his 29-month term from U.S. District Judge John Koeltl in Manhattan. He was also fined $50,000. \nRosenthal, 49, pleaded guilty in August, admitting that he tried to buy a property for $1 million in Florida on behalf of a lawyer he knew in Honduras. \nHe said he knew the lawyer did business with drug traffickers and suspected the money was from drug sales, but went ahead with the deal anyway, planning to take a commission for himself. \nAssistant U.S. Attorney Emil Bove said at the hearing that the deal never closed only because the seller backed out. Samidh Guha, a lawyer for Rosenthal, did not dispute that. \nIn a courtroom filled with family and friends, Rosenthal said before being sentenced that he regretted his actions but was “not a threat to society.” \n“I don’t need to rehabilitate myself,” he said. “I need to redeem myself in the eyes of my god, family and my country.” \nProsecutors had sought a sentence of at least five years, citing federal guidelines, while Rosenthal’s lawyers had asked for time served. \nKoeltl agreed that guidelines called for more than five years, but said the lighter sentence was warranted because Rosenthal never closed the real estate deal and had a history of charitable giving. \nRosenthal gave up the right to appeal any sentence below federal guidelines as part of his plea deal. \nHe had been arrested in October 2015 and released on bail two months later, court records show. \nU.S. prosecutors have also charged Rosenthal’s father Jaime Rosenthal, a former vice president of Honduras; his cousin Yani Rosenthal, a veteran politician and two-time presidential candidate; and Andres Acosta Garcia, a lawyer with the family’s Grupo Continental. \nProsecutors have said the three men took part in a long-running money laundering scheme involving the Cachiros, a Honduran drug trafficking ring. \nYani Rosenthal and Acosta Garcia have both pleaded guilty to money laundering. Yani Rosenthal was sentenced to three years in prison in December, while Acosta Garcia is scheduled to be sentenced on Jan. 26. Jaime Rosenthal remains at large. Reporting by Brendan Pierson in New York; Editing by Richard Chang", "external_links": [], "published": "2018-01-19T20:26:00.000+02:00", "crawled": "2018-01-19T20:39:21.035+02:00", "highlightTitle": ""}