{"organizations": [], "uuid": "13b5526bafdc32a9f7e9ade988e159522a7af73b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-preemies-race/race-may-matter-in-hospital-care-for-preemies-idUKKBN1ER1LH", "country": "US", "domain_rank": 408, "title": "Race may matter in hospital care for preemies", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T21:15:00.000+02:00", "replies_count": 0, "uuid": "13b5526bafdc32a9f7e9ade988e159522a7af73b"}, "author": "", "url": "https://uk.reuters.com/article/us-health-preemies-race/race-may-matter-in-hospital-care-for-preemies-idUKKBN1ER1LH", "ord_in_thread": 0, "title": "Race may matter in hospital care for preemies", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "negative"}, {"name": "elizabeth howell", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "mount sinai", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "icahn school of medicine", "sentiment": "none"}, {"name": "women’s health research institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 7:15 PM / Updated 2 hours ago Race may matter in hospital care for preemies Lisa Rapaport 4 Min Read \n(Reuters Health) - Among the tiniest preemies, black and Hispanic infants are more likely than white babies to be born at hospitals with worse death and complication rates, a study in New York City suggests. \nIn the study of 7,177 very preterm infants born at 39 hospitals citywide, 28 percent of the babies died or experienced serious complications. Compared to white infants, however, black preemies were almost twice as likely to die or have severe health issues, while the odds were about 50 percent higher for Hispanic babies. \nThis disparity is due at least in part to the fact that white children have a better chance of being born at hospitals that take better care of preemies, researchers report in JAMA Pediatrics. \n“Nearly 40 percent of the black-white disparity and nearly a third of the Hispanic-white disparity can be attributed to hospital of birth,” said Dr. Elizabeth Howell, director of the Women’s Health Research Institute at the Icahn School of Medicine at Mount Sinai in New York City. \n“Hospital quality is an important and modifiable cause of racial/ethnic disparities in neonatal outcomes,” Howell said by email. \nPregnancy normally lasts about 40 weeks, and babies born after 37 weeks are considered full term. The study focused on the most vulnerable preterm infants, delivered from 24 to 31 weeks’ gestation. \nDuring the weeks immediately after birth, preemies often have difficulty breathing and digesting food. They can also encounter longer-term challenges such as impaired vision, hearing and cognitive skills, as well as social and behavioral problems. \nWhile black newborns in the U.S. have long had higher mortality rates than white infants, much of this disparity has been attributed to the fact that black women are more likely to have preemies, Howell noted. \nFor the study, Howell and colleagues examined data for infants born in New York City from 2010 to 2014. \nOver this time, about 8 percent died within four weeks of birth or within one year if they were continuously hospitalized. Almost 23 percent of the babies experienced serious medical complications. \nBabies were more likely to die or suffer serious health issues when their mothers were born outside the U.S. or had diabetes or high blood pressure. \nOutcomes varied widely by hospital, with mortality and complication rates ranging from about 10 percent to almost 58 percent. \nWhen researchers sorted hospitals into three groups from the lowest to highest death and complication rates, they found black and Hispanic babies were more likely to be born at the worst-performing hospitals. \nAbout 43 percent of black preemies and 34 percent of Hispanic preemies were born at the hospitals with the worst mortality and complication rates, compared with 23 percent of white preemies, the study found. \nThe study wasn’t a controlled experiment designed to prove whether or how racial or ethnic disparities might develop among preemies. Researchers also lacked data on some factors that can influence outcomes for these babies, such as neighborhood poverty or exposure to environmental toxins. \n“Before we make any further inferences, we need to know what is the cause of where these women are delivering,” said Ciaran Phibbs, a researcher at the Stanford University School of Medicine and the VA Palo Alto Health Care System in California, who wrote an editorial accompanying the study. \n“Once we understand the problem, we can try to take steps to correct it,” Phibbs said by email. \nExpectant mothers can still try when possible to research the performance of hospitals and choose one that does well for these vulnerable infants, Phibbs advised. \n“Most deliveries are low-risk, and delivery hospital has no effect,” Phibbs said. “The issue for high-risk deliveries is that they have a limited time of advanced notice.” \nSOURCES: bit.ly/2A7msNN and bit.ly/2A7ljpv JAMA Pediatrics, online January 2, 2018.", "external_links": [], "published": "2018-01-02T21:15:00.000+02:00", "crawled": "2018-01-02T21:44:44.005+02:00", "highlightTitle": ""}