{"organizations": [], "uuid": "1415888e5825b6a4fbe8a198b11be3d80bbdb856", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-wayne-savings-sends-letter-to-stockholders.html", "country": "US", "domain_rank": 767, "title": "Wayne Savings Sends Letter to Stockholders", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T21:47:00.000+02:00", "replies_count": 0, "uuid": "1415888e5825b6a4fbe8a198b11be3d80bbdb856"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-wayne-savings-sends-letter-to-stockholders.html", "ord_in_thread": 0, "title": "Wayne Savings Sends Letter to Stockholders", "locations": [], "entities": {"persons": [{"name": "wayne savings", "sentiment": "none"}, {"name": "wayne", "sentiment": "none"}], "locations": [{"name": "wooster", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "wayne savings bancshares, inc.", "sentiment": "neutral"}, {"name": "wayne savings community bank", "sentiment": "none"}, {"name": "wayne savings bancshares, inc", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "l.p.", "sentiment": "none"}, {"name": "stilwell activist investments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WOOSTER, Ohio, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Wayne Savings Bancshares, Inc. (“Wayne Savings” or the “Bank”) (OTCQX: WAYN), the holding company parent of Wayne Savings Community Bank, today sent a letter to its stockholders concerning the nomination of a candidate to the Board of Directors of the Bank by Stilwell Activist Investments, L.P. and its affiliates.\nIncluded below is the full text of the letter to Wayne Savings stockholders:\nJanuary 16, 2018\nDear Fellow Wayne Savings Shareholder:\nWe are proud of the growth Wayne Savings has experienced in 2017 and believe it has been a transformational year for the Company. Wayne Savings is well on its way to becoming a high-performing community bank. We wish to thank you for the confidence in us you showed during an eventful year. We hope you feel your support has been rewarded with Wayne Savings poised to drive long-term shareholder value in 2018 and beyond.\nYou may have read that the New York hedge fund which unsuccessfully attempted to place a representative on the Wayne Savings Bancshares, Inc. Board of Directors in 2017 has submitted another nominee to the Board in 2018. We believe the Stilwell Fund has initiated the proxy contest to satisfy its own limited agenda of forcing the sale of Wayne Savings. Our current Board members have been working toward a common goal of creating significant long-term shareholder value driven by consistent and profitable growth.\nThe following paragraphs highlight some of our successes in 2017:\nRecord Earnings and Improvement in ROE and ROA: Wayne Savings announced record earnings for the quarter ended September 30, 2017. Net income of $855,000 or $0.31 per common share for the quarter ended September 30, 2017 represented an annualized return on equity of 8.06% and an annualized return on assets of 0.77%. This is compared to $0.20 per share (55% growth) for the quarter ended September 30, 2016, ROE of 5.31% (275 basis point improvement) and ROA of 0.49% (28 basis point improvement). These results were achieved by reducing overhead expenses while continuing to grow loans. We are pleased the record earnings have confirmed our steady commitment to the strategic plan. The Board of Directors is committed to accelerating our efforts to deliver improved earnings and robust growth.\nReturned Cash to Shareholders and Repurchased Stock: The Board of Directors believes in maximizing shareholder return through the pursuit of improved capital efficiency. Wayne Savings’ improved earnings in 2017 have enabled the Board to complete a stock repurchase program announced in 2016 and to increase our quarterly dividend. On December 6, 2017, the Board announced the repurchase of 75,995 shares (reducing share count by 2.7%) to complete the Company’s stock repurchase program announced on September 22, 2016. On December 22, 2017, Wayne Savings also announced a quarterly cash dividend increase of $0.01 to $0.10 per share of the Company’s common stock for the quarter ending December 31, 2017.\nHired an Accomplished CEO: The Company announced the hiring of James R. (Jay) VanSickle II as the President and Chief Executive Officer of the Company and the Bank on August 31, 2017. Jay brings an extensive knowledge of the banking industry and an impressive track record of successful execution and leadership. Jay is a former senior executive at National Bancshares Corporation (“NBOH”), and its wholly owned subsidiary, First National Bank headquartered in Orrville, Ohio. NBOH’s ROE improved from 3.29% in 2006 to 11.92% in 2014 during Jay’s tenure as CFO. With the addition of a permanent CEO, the Wayne Savings management team has completed several initiatives in 2017 designed to improve operational efficiency and maximize long-term shareholder value.\nAdded an Institutional Shareholder Director: In December 2017 we added a new director who represents the perspective of the institutional investor community. Brian Hopkins of Ancora Advisors LLC brings a background in corporate finance, capital allocation, corporate governance and strategic decision-making that we believe will add value to the Board. A registered investment advisor with combined firm assets under administration exceeding $5 billion, Ancora is a 6.0% shareholder in Wayne and has invested in numerous community banks throughout its history. Representatives of Ancora have sat on six community bank boards in the past five years. Adding Mr. Hopkins and Ancora’s bank expertise will help the Board with capital allocation strategy. This appointment demonstrates the Board’s receptiveness to investors.\nCompleted a Savings & Loan to Commercial Bank Charter Conversion: Wayne Savings completed the conversion of the Bank from an Ohio-chartered savings and loan association to an Ohio-chartered commercial bank in September, 2017. The charter conversion allows the Bank to continue the implementation of its strategic plan by acquiring more commercial business relationships, facilitating the restructure of our loan portfolio into higher yielding, shorter duration assets. The charter change allows the Bank to continue the growth in commercial loans with increased earnings. Nonresidential real estate and commercial business loans increased from $131.0 million as of December 31, 2016 to $142.3 million as of September 30, 2017.\nSecurities Exchange Commission SEC Deregistration: Wayne Savings announced the termination of the registration of common stock with the SEC under the Securities Exchange Act of 1934 on October 27, 2017. The decision to deregister our common stock was based on numerous factors, including six-figure annual cost savings which should be recognized in 2018.\nContinued Stock Price Improvement: The Company’s stock price has appreciated significantly since the Board announced on December 20, 2016 the appointment of an interim President and CEO and start of a search for a permanent successor. The stock price on the date of the announcement was $15.95 and has since appreciated over 12%. The stock price has closed at or above $18.00 per share on every trading day of 2018. The Board believes improved earnings, the common stock repurchase and the increase in the quarterly dividend has prompted this recent appreciation in stock price.\nThe current Board of Directors serves the interests of all shareholders and appreciates the confidence and support you have given. As always, we welcome input from all our shareholders. We believe Stilwell’s campaign to replace our qualified nominee could derail the significant progress we’ve made. We are excited about the opportunities in our market and will continue with our plan to transform Wayne Savings and create long-term value for all our shareholders. Your continued support of Wayne Savings Bancshares, Inc. is sincerely appreciated.\nIf you have any questions or would like us to contact you, please do not hesitate to reach out to our investor relations department at (330) 287-2857.\nSincerely, Peggy J. Schmitz David L. Lehman Chair, Board of Directors Board of Directors Additional Informatio", "external_links": [], "published": "2018-01-16T21:47:00.000+02:00", "crawled": "2018-01-16T21:00:53.026+02:00", "highlightTitle": ""}