{"organizations": [], "uuid": "78ea86cd8b39a9b16bcd57651d930a50a563f78b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-stocks-slip-as-high-bond-yields-weigh-dollar-steadies-idUSL4N1PQ1V4", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Asia stocks slip as high bond yields weigh, dollar steadies", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T11:25:00.000+02:00", "replies_count": 0, "uuid": "78ea86cd8b39a9b16bcd57651d930a50a563f78b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-stocks-slip-as-high-bond-yields-weigh-dollar-steadies-idUSL4N1PQ1V4", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Asia stocks slip as high bond yields weigh, dollar steadies", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "shinichi saoshiro", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "msci asia-pacific", "sentiment": "negative"}, {"name": "msci", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* MSCI Asia-Pacific index pulls back from record\n* Sharp drop in U.S. shares weigh on Asian equities\n* Broader equities capped by recent rapid rise in yields\n* Crude oil extends losses amid risk aversion\nBy Shinichi Saoshiro\nTOKYO, Jan 31 (Reuters) - Asia stocks pulled further back from record highs on Wednesday as the recent rise in global bond yields weighed on equities, while the dollar steadied ahead of the Federal Reserve’s policy decision.\nIn his first State of the Union address since becoming U.S. President, Donald Trump urged Republicans and Democrats to work toward compromises on immigration and infrastructure and implement legislation that generates at least $1.5 trillion for new infrastructure investment. Market reaction to the address was limited.\nMSCI’s broadest index of Asia-Pacific shares outside Japan added to the previous day’s losses and dipped 0.2 percent, after reaching a record high on Monday.\nSouth Korea’s KOSPI rose 0.3 percent and Japan’s Nikkei dropped 0.1 percent.\nHong Kong’s Hang Seng shed 0.55 percent Shanghai retreated 0.6 percent.\nWall Street, which has recently hit a succession of record peaks, has led a global equities rally over the past year thanks to strong world growth fuelling higher corporate earnings and stock valuations.\nBut the recent surge in U.S. long-term bond yields to near four-year highs have poured cold water on the rally.\nU.S. stocks fell for a second straight day on Tuesday, with the Dow registering its biggest two-day drop since September 2016, pressured by healthcare stocks and rising bond yields.\n“The key point is the speed of the latest rise in yields, which has been very rapid. Until recently the yield rise helped the financial sector, but the pace of the rise is now too rapid and raising worries about corporate borrowing costs,” said Junichi Ishikawa, senior FX strategist at IG Securities in Tokyo.\nHigher yields are seen hurting equities as they increase borrowing costs by companies and reduce their risk appetite. Higher yields also present a fresh alternative to investors, who may choose to allocate some of their money from equities to bonds.\nThe U.S. Treasury 10-year note yield touched its highest in nearly four years overnight at 2.733 percent, while 30-year bond yield climbed to its highest since May 2017.\nYields rose after the start of the Federal Reserve’s two-day meeting on Tuesday, which could offer more clues on the central bank’s economic and rate hike outlook.\nThe greenback failed to draw much support from higher Treasury yields as the risk-averse mood favoured its peers like the yen.\nThe dollar was a shade higher at 108.900 yen. It briefly popped up to 109.095 after the Bank of Japan increased its buying of JGBs of three- to five-year maturities at a regular debt-purchasing operation, a move seen as a warning shot against further rises in JGB yields.\nThe euro nudged up 0.15 percent to $1.2420, adding to modest overnight gains.\nThe dollar index against a basket of six major currencies was at 89.106, having crawled away from a three-year low of 88.438 set on Friday.\nThe risk aversion in the broader markets also took a toll on recently bullish crude oil. U.S. crude futures stretched overnight losses to slide 0.9 percent to $63.94 per barrel, with data showing a higher-than-expected rise in stocks also weighing.\nUnderpinned by the dollar’s recent slide, prices had risen to $66.66 per barrel on Thursday, the highest since December 2014.\nBrent crude was down 1 percent at $68.34 per barrel.\nEditing by Kim Coghill and Sam Holmes\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T11:25:00.000+02:00", "crawled": "2018-01-31T16:46:32.013+02:00", "highlightTitle": ""}