{"organizations": [], "uuid": "2c805309afc9ed19f7eb621b7463a53e485b54cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-california-fracking/update-1-california-sues-trump-administration-for-repeal-of-fracking-rules-idUSL2N1PJ1X9", "country": "US", "domain_rank": 408, "title": "UPDATE 1-California sues Trump administration for repeal of fracking rules", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T04:45:00.000+02:00", "replies_count": 0, "uuid": "2c805309afc9ed19f7eb621b7463a53e485b54cc"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-california-fracking/update-1-california-sues-trump-administration-for-repeal-of-fracking-rules-idUSL2N1PJ1X9", "ord_in_thread": 0, "title": "UPDATE 1-California sues Trump administration for repeal of fracking rules", "locations": [], "entities": {"persons": [{"name": "nichola groom", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "xavier becerra", "sentiment": "none"}, {"name": "becerra", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "golden state", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "blm", "sentiment": "none"}, {"name": "bureau of land management", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts with filing of the lawsuit)\nBy Nichola Groom\nLOS ANGELES, Jan 24 (Reuters) - California on Wednesday sued the Trump administration over its repeal of Obama-era rules meant to address public safety concerns on hydraulic fracturing, the process known as fracking that is used to extract oil and natural gas, on federal lands.\nThe suit, filed by Attorney General Xavier Becerra in federal court in San Francisco, marks the latest in a string of court challenges by the Golden State against the administration of Republican U.S. President Donald Trump’s policies on a range of issues from immigration to the environment.\nAccording to the suit, the federal Bureau of Land Management (BLM) violated the agency’s own statutory mandates and other federal laws by failing to provide a “reasoned analysis” for repealing the fracking regulations. In contrast, the rules had undergone a lengthy, multi-year review before they were issued.\n“They did nothing at BLM to undo the rule with any justification or factual basis,” Becerra said on a conference call with reporters. “There is plenty of reason to doubt that the fracking repeal engaged in by the Trump administration would withstand scrutiny in a court.”\nA BLM spokeswoman declined to comment on the litigation.\nFracking has been a source of ongoing controversy in many regions of the country between environmentalists and the oil and gas industry.\nThe BLM in 2015, under Democratic President Barack Obama, issued rules that would have required companies to provide data on chemicals used in fracking and to take steps to prevent leakage from oil and gas wells on federally owned land.\nFracking involves the injection of large amounts of water, sand and chemicals underground at high pressure to extract oil or natural gas trapped in rock formations. Most fracking takes place on private lands. California has the sixth highest number of fracked wells on federal lands of any state, the law suit said.\nEnvironmental groups and some neighbors of oil and gas wells have linked fracking to water pollution as well as increased earthquake activity in certain areas.\nThe rules for federal and tribal lands were never implemented because oil and gas industry groups sued to block them, arguing they were unnecessary and would slow the country’s path to energy independence. That litigation ended when the Trump administration repealed the regulations last year.\nBecerra said the new litigation “is going to stand on its own.”\nSeveral of the environmental groups involved in that earlier litigation, including the Sierra Club, Earthjustice and the Center for Biological Diversity, filed a similar lawsuit on Wednesday, also in federal court in San Francisco. (Reporting by Nichola Groom; Editing by G Crosse and Leslie Adler)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T04:45:00.000+02:00", "crawled": "2018-01-25T13:14:14.016+02:00", "highlightTitle": ""}