{"organizations": [], "uuid": "628678e66a2f2890b3e6ee53dd33c3893c507bfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218817495&w=1200&r=LYNXMPEE010M4", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-ars-wenger/arsenals-transfers-will-depend-on-key-players-contracts-wenger-idUKKBN1ER13P", "country": "US", "domain_rank": 408, "title": "Arsenal's transfers will depend on key players' contracts - Wenger", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T15:57:00.000+02:00", "replies_count": 0, "uuid": "628678e66a2f2890b3e6ee53dd33c3893c507bfc"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-ars-wenger/arsenals-transfers-will-depend-on-key-players-contracts-wenger-idUKKBN1ER13P", "ord_in_thread": 0, "title": "Arsenal's transfers will depend on key players' contracts - Wenger", "locations": [], "entities": {"persons": [{"name": "mesut ozil", "sentiment": "none"}, {"name": "ozil", "sentiment": "none"}, {"name": "jack wilshere", "sentiment": "none"}, {"name": "wenger", "sentiment": "none"}, {"name": "sanchez", "sentiment": "none"}, {"name": "arsene wenger", "sentiment": "none"}], "locations": [{"name": "west bromwich", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "emirates", "sentiment": "none"}], "organizations": [{"name": "arsenal", "sentiment": "negative"}, {"name": "wenger reuters staff", "sentiment": "none"}, {"name": "west bromwich albion", "sentiment": "none"}, {"name": "reuters/jason cairnduff  forward alexis sanchez", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 2:00 PM / Updated 4 minutes ago Arsenal's transfers will depend on key players' contracts - Wenger Reuters Staff 3 Min Read \n(Reuters) - Arsenal manager Arsene Wenger says the Premier League club’s transfer activity in the January window will be dictated by the contract situations of key players and injuries to his current squad. FILE PHOTO - Soccer Football - Premier League - West Bromwich Albion vs Arsenal - The Hawthorns, West Bromwich, Britain - December 31, 2017 Arsenal manager Arsene Wenger reacts Action Images via Reuters/Jason Cairnduff \nForward Alexis Sanchez and midfielders Mesut Ozil and Jack Wilshere will be out of contract in June and while the England international is keen to stay at Arsenal, both Sanchez and Ozil look unlikely to sign new deals to stay at the Emirates. \n“We are open in any position for the exceptional player who can give us a plus,” Wenger told a news conference on Tuesday. \n”It depends a little bit on the injuries as well and, on the other hand, I must say it depends on who will manage to extend the contracts of the players who are on the end of their contracts in June. \n“We will have to take the consequences of these decisions and respond to them.” \nSanchez and Ozil have been vital to Arsenal’s success in recent years but could leave in the ongoing window to avoid becoming free agents later in the year. \nMedia reports have linked the Chilean forward with a move to league leaders Manchester City while several clubs are linked with the German playmaker, including Manchester United and La Liga side Barcelona. \nWenger believes that even if the duo leave this month, Arsenal have the resources to compensate with quality signings of their own as they have done in the past. \n“We have not lost anybody yet and, secondly, we will respond to that by bringing in players of top quality. We have not been contacted by anybody (about Sanchez or Ozil),” Wenger added. \n“This club has lost many, many big players and has always responded well. Massive players have left this club and the club will always be in a strong position (afterwards). You want to keep your best players, yes.” \nDefenders Sead Kolasinac and Nacho Monreal are out of Wednesday’s league game against champions Chelsea with ankle problems while Ozil and Laurent Koscielny are doubtful due to a knee and Achilles injury, respectively. \nChelsea drew with Arsenal in September’s league match at Stamford Bridge and are currently seven points ahead of the fifth-placed north London club. Reporting by Aditi Prakash in Bengaluru; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-02T15:57:00.000+02:00", "crawled": "2018-01-02T16:11:37.010+02:00", "highlightTitle": ""}