{"organizations": [], "uuid": "5a3aab10cd75a47e869e9b1ea17ca76ba347a4ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/09/frd09-15_b.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/ford-snaps-up-two-more-startups-in-mobility-push/", "country": "US", "domain_rank": 1196, "title": "Ford Buys Cloud Services Startup Autonomic, TransLoc In Mobility Push | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.078, "site_type": "news", "published": "2018-01-26T15:28:00.000+02:00", "replies_count": 0, "uuid": "5a3aab10cd75a47e869e9b1ea17ca76ba347a4ab"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/25/ford-snaps-up-two-more-startups-in-mobility-push/", "ord_in_thread": 0, "title": "Ford Buys Cloud Services Startup Autonomic, TransLoc In Mobility Push | Fortune", "locations": [], "entities": {"persons": [{"name": "kirsten korosec", "sentiment": "negative"}], "locations": [{"name": "durham", "sentiment": "none"}], "organizations": [{"name": "ford buys cloud services startup autonomic", "sentiment": "negative"}, {"name": "est  ford motor", "sentiment": "neutral"}, {"name": "ford smart mobility", "sentiment": "none"}, {"name": "amazon web services", "sentiment": "none"}, {"name": "plato alto", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "mobility business group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec January 25, 2018 \nFord Motor is acquiring two software startups and restructuring its two-year-old transportation subsidiary, Ford Smart Mobility, as it continues a strategy to expand beyond its traditional business of making and selling cars. \nThe terms of the acquisitions of Autonomic and TransLoc, both of which provide software services related to transportation, were not disclosed. \nTransLoc is a Durham, N.C.-based company that has developed software that helps cities manage transit services. Autonomic, a Plato Alto, Calif.-based company that Ford took a minority stake in a year ago, has created an open-source cloud computing platform for transportation services, similar to how Amazon Web Services provides a cloud service for all businesses. \nMeanwhile, Ford is tweaking its Ford Smart Mobility subsidiary, a two-year old unit tasked with investing in and building the automaker’s transportation services. It will now be broken up into four divisions: Ford X, Mobility Business Group, Mobility Platforms and Products, and Mobility Marketing and Growth. \nFord Smart Mobility was initially led by Jim Hackett before he took over as Ford’s CEO. \nAutonomic CEO Sunny Madra will head Ford X, which will act as a incubator of potential products and services, or and new mobility businesses early in their development. Marion Harris , the chief financial officer at Ford Credit, has been named vice president of the mobility business group division, which will be responsible for scaling the company’s existing mobility businesses such as its Chariot shuttle business. \nRich Strader will head the subsidiary’s mobility platforms and products division, which will lead design and development for the technology underpinning Ford’s mobility businesses. This includes the platforms that delivers apps and services to passengers and drivers in vehicles through an Internet connection as well as manage vehicle fleets including ride-sharing or car-sharing services. And Brett Wheatley, who was director of Ford marketing and sales, will lead the mobility marketing and growth unit. TransLoc, which has established relationships with cities, will fall under this division. \nFord is hoping the reorganization will make it better positioned to profit off of the fast-evolving transportation landscape, including the eventual debut of a self-driving taxi service, delivering goods to people, and other shuttle services like Chariot, which uses crowdsourcing to determine where people needed rides. Ford acquired Chariot in 2016 . \nAutonomic stands to be an important piece of that vision—and not just because of the talent Ford now has access to. Earlier this month, Hackett outlined plans during his keynote speech at the big tech trade show CES to use Autonomic to develop a “transportation mobility cloud” service. This service wouldn’t just be designed for Ford. The aim is to make an open source cloud platform that other automakers, ride-hailing companies, and public transit agencies would use, similarly to how Nordstrom and Amazon.com—commerce rivals—both use AWS for cloud services, Madra explained to Fortune. \n“The more OEMs on the platform the better the experience is,” Madra said. \nThe name Autonomic— in a nod to “autonomic computing” and “autonomic nervous system”—spells the company’s primary goal is. The idea behind autonomic is self-regulating or self-managing; in the body, it’s an unconscious act like breathing. \n“These are the things that we don’t want OEMs and folks within the transportation system to think about,” Madra said. “We just want it to work for them.” \nThis so-called transportation mobility cloud could have services like geo-fencing that cities could use. For instance, a city with a lot of pollution and congestion might need a service that would create a geo-fence (operational or geographical barrier) that when a hybrid-electric vehicle enters into an urban center it would go into electric mode. This is just one example of the kinds of services that could be built on top of and delivered via cloud service. \n“When AWS first came or when the iPhone SDK (software development kit) first came out we didn’t know we’d have Uber and all these different applications,” Madra said, in an effort to describe the possibilities for this cloud service. “By making all these different services available we have no idea what’s going to come so we’re super excited.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-26T15:28:00.000+02:00", "crawled": "2018-01-26T01:26:11.019+02:00", "highlightTitle": ""}