{"organizations": [], "uuid": "a83018cac101d1eaa787f0323a2d251af55ecc88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-united-rentals-announces-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "United Rentals Announces Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:15:00.000+02:00", "replies_count": 0, "uuid": "a83018cac101d1eaa787f0323a2d251af55ecc88"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-united-rentals-announces-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "United Rentals Announces Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}, {"name": "stamford", "sentiment": "none"}], "organizations": [{"name": "united rentals announces fourth quarter", "sentiment": "negative"}, {"name": "inc.", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Provides 2018 Outlook and Estimated Impact of U.S. Tax Reform\nSTAMFORD, Conn.--(BUSINESS WIRE)-- United Rentals, Inc. (NYSE: URI) today announced financial results for the fourth quarter and full year 2017 1 .\nFourth Quarter 2017\nFor the fourth quarter of 2017, total revenue was $1.922 billion and rental revenue was $1.646 billion, compared with $1.523 billion and $1.298 billion, respectively, for the same period the prior year. On a GAAP basis, the company reported fourth quarter net income of $897 million, or $10.45 per diluted share, compared with $153 million, or $1.80 per diluted share, for the same period the prior year. The fourth quarter of 2017 includes a net income benefit estimated at $689 million, or $8.03 per diluted share, associated with the enactment of the Tax Cuts and Jobs Act of 2017 discussed below.\nAdjusted EPS 2 for the quarter was $11.37 per diluted share, compared with $2.67 for the same period the prior year. Excluding the estimated $8.03 per share benefit associated with the enacted tax reform discussed above, adjusted EPS for the fourth quarter of 2017 would have been $3.34. Adjusted EBITDA 2 was $947 million and adjusted EBITDA margin was 49.3% for the quarter, compared with $749 million and 49.2%, respectively, for the same period the prior year.\nFourth Quarter Highlights\nRental revenue 3 increased 26.8% year-over-year. Within rental revenue, owned equipment rental revenue increased 26.5%, reflecting increases of 28.7% in the volume of equipment on rent and 1.1% in rental rates. Pro forma 1 rental revenue increased 11.5% year-over-year, reflecting growth of 8.8% in the volume of equipment on rent and a 2.0% increase in rental rates. Time utilization increased 70 basis points year-over-year to 70.0%. On a pro forma basis, time utilization increased 100 basis points year-over-year. The company’s Trench, Power and Pump specialty segment's rental revenue increased by 38.7% year-over-year, primarily on a same store basis, while the segment’s rental gross margin improved by 230 basis points to 47.5%. The company generated $172 million of proceeds from used equipment sales at a GAAP gross margin of 39.0% and an adjusted gross margin of 57.6%, compared with $135 million of proceeds at a GAAP gross margin of 43.0% and an adjusted gross margin of 49.6% for the prior year. The year-over-year increase in adjusted gross margin primarily reflects the impact of selling NES and Neff equipment. 4\n1. The company completed the acquisitions of NES Rentals Holdings II, Inc. (“NES ”) and Neff Corporation (\"Neff\") in April 2017 and October 2017, respectively. NES and Neff are included in the company's results subsequent to the acquisition dates. Pro forma results reflect the combination of United Rentals, NES and Neff for all periods presented. 2. Adjusted EPS (earnings per share) and adjusted EBITDA (earnings before interest, taxes, depreciation and amortization) are non-GAAP measures that exclude the impact of the items noted in the tables below. See the tables below for amounts and reconciliations to the most comparable GAAP measures. Adjusted EBITDA margin represents adjusted EBITDA divided by total revenue. 3. Rental revenue includes owned equipment rental revenue, re-rent revenue and ancillary revenue. 4. Used equipment sales adjusted gross margin excludes the impact of the fair value mark-up of acquired RSC, NES and Neff fleet that was sold. Full Year 2017\nFor the full year 2017, total revenue was $6.641 billion and rental revenue was $5.715 billion, compared with $5.762 billion and $4.941 billion, respectively, for 2016. On a GAAP basis, full year net income was $1.346 billion, or $15.73 per diluted share, compared with $566 million, or $6.45 per diluted share, for 2016. 2017 includes a net income benefit estimated at $689 million, or $8.05 per diluted share, associated with the enactment of the Tax Cuts and Jobs Act of 2017 discussed below.\nAdjusted EPS for the full year was $18.64 per diluted share, compared with $8.65 per diluted share for 2016. Excluding the estimated $8.05 per share benefit associated with the enacted tax reform discussed above, adjusted EPS for 2017 would have been $10.59. Adjusted EBITDA was $3.164 billion and adjusted EBITDA margin was 47.6% for the full year, compared with $2.759 billion and 47.9%, respectively, for 2016.\nFull Year Highlights\nRental revenue increased 15.7% year-over-year. Within rental revenue, owned equipment rental revenue increased 15.3%, reflecting an increase of 18.2% in the volume of equipment on rent, partially offset by a 0.2% decrease in rental rates. Pro forma rental revenue increased 7.6% year-over-year, reflecting growth of 7.1% in the volume of equipment on rent and a 0.4% increase in rental rates. Time utilization increased 160 basis points year-over-year to 69.5%. On a pro forma basis, time utilization increased 150 basis points year-over-year to 69.1%. Time utilization was a full year record for the company on both an actual and a pro forma basis. The company’s Trench, Power and Pump specialty segment's rental revenue increased by 27.5% year-over-year, primarily on a same store basis, while the segment’s rental gross margin improved by 260 basis points to 49.6%. The company generated $550 million of proceeds from used equipment sales at a GAAP gross margin of 40.0% and an adjusted gross margin of 54.9%, compared with $496 million of proceeds at a GAAP gross margin of 41.1% and an adjusted gross margin of 48.2% for the prior year. The year-over-year increase in adjusted gross margin primarily reflects the impact of selling NES equipment. The company generated $2.230 billion of net cash provided by operating activities and $907 million of free cash flow 5 , compared with $1.953 billion and $1.182 billion, respectively, for the prior year. Net rental capital expenditures were $1.219 billion, compared with $750 million for the prior year. The company issued $2.925 billion of debt due from 2025 through 2028. The proceeds from the debt issuances were primarily used to fund the NES and Neff acquisitions, and to redeem $1.4 billion of debt that would have been due in 2022 and 2023. The company additionally increased the sizes of its ABL and AR securitization facilities by $500 million and $150 million, respectively.\nCEO Comments\nMichael Kneeland, chief executive officer of United Rentals, said, \"We capped a year of record results with a strong fourth quarter finish on the back of broad-based demand. Pro forma volume increased nearly 9% year-over-year in the quarter, and rental rates were up 2%. For the full year, we exceeded the upper-band of guidance on total revenue, adjusted EBITDA and free cash flow, and increased our ROIC by 50 basis points year-over-year to its highest level since 2015.\"\nKneeland continued, \"Our 2018 guidance reflects the confidence we feel in our operating environment based on what we hear from customers and see in key leading indicators. Our optimism is further supported by the tailwinds we expect from leveraging our 2017 acquisitions and our ongoing investments in people and technology, as well as the recent U.S. tax reform. Our strategy remains focused on balancing growth and returns to maximize our long-term value.\"\n5. Free cash flow is a non-GAAP measure. See the table below for amounts and a reconciliation to the most comparable GAAP measure. Free cash flow included aggregate merger and restructuring related payments of $76 million and $13 million for the full years 2017 and 2016, respectively. 2018 Outlook\nThe company provided the following outlook for the full year 2018.\n2018 Outlook 2017 Actual Total revenue $7.3 billion to $7.6 billion $6.641 billion Adjusted EBITDA 6 $3.60 billion to $3.75 billion $3.164 billion Net rental capital expenditures after gross purchases $1.2 billion to $1.35 billion, after gross purchases of $1.8 billion to $1.95 billion $1.219 billion net, $1.769 billion gross Net cash provided by operating activities $2.625 billion to $2.825 billion $2.230 billion Free cash flow (excluding merger and restructuring related payments, such payments were $76 million in 2017) $1.3 billion to $1.4 billion $983 million Estimated Impact of U.S. Tax Reform\nWhile we continue to assess the full impact of the Tax Cuts and Jobs Act of 2017 (the “Act”), our preliminary analysis suggests we will meaningfully benefit from the legislation. In particular, the combination of a lower U.S. federal tax rate at 21% and the full expensing of capital spending will materially exceed the impact of the repeal of Like-Kind Exchange provisions, which had allowed for the deferral of taxable gains on the sale of used equipment. On a net basis, and leaving all other factors unchanged, we estimate that the reforms will benefit our 2018 free cash flow by at least $250 million, which is incorporated into our 2018 outlook. On a blended basis, we expect an effective tax rate of approximately 25% in 2018.\nThe Act impacted our 2017 results primarily due to (i) a one-time non-cash tax benefit estimated at $746 million, reflecting the revaluation of our net deferred tax liability using a U.S. federal tax rate of 21% and (ii) a one-time transition tax estimated at $57 million on our unremitted foreign earnings and profits, which we will elect to pay over an eight-year period.\nFree Cash Flow and Fleet Size\nFor the full year 2017, net cash provided by operating activities was $2.230 billion, and free cash flow was $907 million after total rental and non-rental gross capital expenditures of $1.889 billion. For the full year 2016, net cash provided by operating activities was $1.953 billion, and free cash flow was $1.182 billion after total rental and non-rental gross capital expenditures of $1.339 billion. Free cash flow for the full years 2017 and 2016 included aggregate merger and restructuring related payments of $76 million and $13 million, respectively.\nThe size of the rental fleet was $11.51 billion of original equipment cost at December 31, 2017, compared with $8.99 billion at December 31, 2016. The age of the rental fleet was 47.0 months on an OEC-weighted basis at December 31, 2017, compared with 45.2 months at December 31, 2016.\n6. Information reconciling forward-looking adjusted EBITDA to the comparable GAAP financial measures is unavailable to the company without unreasonable effort, as discussed below. Return on Invested Capital (ROIC)\nReturn on invested capital was 8.8% for the year ended December 31, 2017, an increase of 50 basis points year-over-year. The company’s ROIC metric uses after-tax operating income for the trailing 12 months divided by average stockholders’ equity, debt and deferred taxes, net of average cash. To mitigate the volatility related to fluctuations in the company’s tax rate from period to period, the federal statutory tax rate of 35% is used to calculate after-tax operating income. When adjusting the denominator of the ROIC calculation to also exclude average goodwill, ROIC was 11.9% for the year ended December 31, 2017, an increase of 70 basis points year-over-year.\nIf the 21% federal statutory tax rate following the enacted tax reform discussed above was applied to ROIC for the year ended December 31, 2017, we estimate that ROIC would have been approximately 10.7%. Going forward, we expect ROIC to materially increase from the 8.8% achieved in 2017 due to the enacted tax reform.\nShare Repurchase Program\nThe company previously announced that it would resume its pre-existing $1 billion program to repurchase shares of its common stock (the “Program”). The Program commenced in November 2015 and was paused in October 2016 (at which point, the company had completed $627 million of repurchases under the Program) as the company evaluated potential acquisition opportunities. The company completed $28 million of repurchases under the Program in 2017, and intends to complete the remaining $345 million in 2018.\nConference Call\nUnited Rentals will hold a conference call tomorrow, Thursday, January 25, 2018, at 12:00 p.m. Eastern Time. The conference call number is 855-458-4217 (international: 574-990-3618). The conference call will also be available live by audio webcast at unitedrentals.com , where it will be archived until the next earnings call. The replay number for the call is 404-537-3406, passcode is 7899997.\nNon-GAAP Measures\nFree cash flow, earnings before interest, taxes, depreciation and amortization (EBITDA), adjusted EBITDA, and adjusted earnings per share (adjusted EPS) are non-GAAP financial measures as defined under the rules of the SEC. Free cash flow represents net cash provided by operating activities, less purchases of rental and non-rental equipment plus proceeds from sales of rental and non-rental equipment and excess tax benefits from share-based payment arrangements. EBITDA represents the sum of net income, (benefit) provision for income taxes, interest expense, net, depreciation of rental equipment and non-rental depreciation and amortization. Adjusted EBITDA represents EBITDA plus the sum of the merger related costs, restructuring charge, stock compensation expense, net, and the impact of the fair value mark-up of acquired fleet. Adjusted EPS represents EPS plus the sum of the merger related costs, restructuring charge, the impact on interest expense related to the fair value adjustment of acquired RSC indebtedness, the impact on depreciation related to acquired fleet and property and equipment, the impact of the fair value mark-up of acquired fleet, merger related intangible asset amortization, asset impairment charge and the loss on repurchase/redemption of debt securities and amendment of ABL facility. The company believes that: (i) free cash flow provides useful additional information concerning cash flow available to meet future debt service obligations and working capital requirements; (ii) EBITDA and adjusted EBITDA provide useful information about operating performance and period-over-period growth, and help investors gain an understanding of the factors and trends affecting our ongoing cash earnings, from which capital investments are made and debt is serviced; and (iii) adjusted EPS provides useful information concerning future profitability. However, none of these measures should be considered as alternatives to net income, cash flows from operating activities or earnings per share under GAAP as indicators of operating performance or liquidity.\nInformation reconciling forward-looking adjusted EBITDA to GAAP financial measures is unavailable to the company without unreasonable effort. The company is not able to provide reconciliations of adjusted EBITDA to GAAP financial measures because certain items required for such reconciliations are outside of the company’s control and/or cannot be reasonably predicted, such as the provision for income taxes. Preparation of such reconciliations would require a forward-looking balance sheet, statement of income and statement of cash flow, prepared in accordance with GAAP, and such forward-looking financial statements are unavailable to the company without unreasonable effort. The company provides a range for its adjusted EBITDA forecast that it believes will be achieved, however it cannot accurately predict all the components of the adjusted EBITDA calculation. The company provides an adjusted EBITDA forecast because it believes that adjusted EBITDA, when viewed with the company’s results under GAAP, provides useful information for the reasons noted above. However, adjusted EBITDA is not a measure of financial performance or liquidity under GAAP and, accordingly, should not be considered as an alternative to net income or cash flow from operating activities as an indicator of operating performance or liquidity.\nAbout United Rentals\nUnited Rentals, Inc. is the largest equipment rental company in the world. The company has an integrated network of 997 rental locations in 49 states and every Canadian province. The company’s approximately 14,800 employees serve construction and industrial customers, utilities, municipalities, homeowners and others. The company offers approximately 3,400 classes of equipment for rent with a total original cost of $11.51 billion. United Rentals is a member of the Standard & Poor’s 500 Index, the Barron’s 400 Index and the Russell 3000 Index® and is headquartered in Stamford, Conn. Additional information about United Rentals is available at unitedrentals.com .\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, and the Private Securities Litigation Reform Act of 1995, known as the PSLRA. These statements can generally be identified by the use of forward-looking terminology such as “believe,” “expect,” “may,” “will,” “should,” “seek,” “on-track,” “plan,” “project,” “forecast,” “intend” or “anticipate,” or the negative thereof or comparable terminology, or by discussions of vision, strategy or outlook. These statements are based on current plans, estimates and projections, and, therefore, you should not place undue reliance on them. No forward-looking statement can be guaranteed, and actual results may differ materially from those projected. Factors that could cause actual results to differ materially from those projected include, but are not limited to, the following: (1) the challenges associated with past or future acquisitions, including NES and Neff, such as undiscovered liabilities, costs, integration issues and/or the inability to achieve the cost and revenue synergies expected; (2) a slowdown in North American construction and industrial activities, which could reduce our revenues and profitability; (3) our significant indebtedness, which requires us to use a substantial portion of our cash flow for debt service and can constrain our flexibility in responding to unanticipated or adverse business conditions; (4) the inability to refinance our indebtedness at terms that are favorable to us, or at all; (5) the incurrence of additional debt, which could exacerbate the risks associated with our current level of indebtedness; (6) noncompliance with covenants in our debt agreements, which could result in termination of our credit facilities and acceleration of outstanding borrowings; (7) restrictive covenants and amount of borrowings permitted under our debt agreements, which could limit our financial and operational flexibility; (8) an overcapacity of fleet in the equipment rental industry; (9) a decrease in levels of infrastructure spending, including lower than expected government funding for construction projects; (10) fluctuations in the price of our common stock and inability to complete stock repurchases in the time frame and/or on the terms anticipated; (11) our rates and time utilization being less than anticipated; (12) our inability to manage credit risk adequately or to collect on contracts with customers; (13) our inability to access the capital that our business or growth plans may require; (14) the incurrence of impairment charges; (15) trends in oil and natural gas could adversely affect demand for our services and products; (16) our dependence on distributions from subsidiaries as a result of our holding company structure and the fact that such distributions could be limited by contractual or legal restrictions; (17) an increase in our loss reserves to address business operations or other claims and any claims that exceed our established levels of reserves; (18) the incurrence of additional costs and expenses (including indemnification obligations) in connection with litigation, regulatory or investigatory matters; (19) the outcome or other potential consequences of litigation and other claims and regulatory matters relating to our business, including certain claims that our insurance may not cover; (20) the effect that certain provisions in our charter and certain debt agreements and our significant indebtedness may have of making more difficult or otherwise discouraging, delaying or deterring a takeover or other change of control of us; (21) management turnover and inability to attract and retain key personnel; (22) our costs being more than anticipated and/or the inability to realize expected savings in the amounts or time frames planned; (23) our dependence on key suppliers to obtain equipment and other supplies for our business on acceptable terms; (24) our inability to sell our new or used fleet in the amounts, or at the prices, we expect; (25) competition from existing and new competitors; (26) security breaches, cybersecurity attacks and other significant disruptions in our information technology systems; (27) the costs of complying with environmental, safety and foreign laws and regulations, as well as other risks associated with non-U.S. operations, including currency exchange risk; (28) labor difficulties and labor-based legislation affecting our labor relations and operations generally; (29) increases in our maintenance and replacement costs and/or decreases in the residual value of our equipment; and (30) the effect of changes in tax law, such as the effect of the Tax Cuts and Jobs Act that was enacted on December 22, 2017. For a more complete description of these and other possible risks and uncertainties, please refer to our Annual Report on Form 10-K for the year ended December 31, 2017, as well as to our subsequent filings with the SEC. The forward-looking statements contained herein speak only as of the date hereof, and we make no commitment to update or publicly release any revisions to forward-looking statements in order to reflect new information or subsequent events, circumstances or changes in expectations.\nUNITED RENTALS, INC. CONDENSED CONSOLIDATED STATEMENTS OF INCOME (UNAUDITED) (In millions, except per share amounts) Three Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Revenues: Equipment rentals $ 1,646 $ 1,298 $ 5,715 $ 4,941 Sales of rental equipment 172 135 550 496 Sales of new equipment 52 48 178 144 Contractor supplies sales 20 19 80 79 Service and other revenues 32 23 118 102 Total revenues 1,922 1,523 6,641 5,762 Cost of revenues: Cost of equipment rentals, excluding depreciation 595 471 2,151 1,862 Depreciation of rental equipment 320 255 1,124 990 Cost of rental equipment sales 105 77 330 292 Cost of new equipment sales 44 40 152 119 Cost of contractor supplies sales 14 14 56 55 Cost of service and other revenues 17 9 59 41 Total cost of revenues 1,095 866 3,872 3,359 Gross profit 827 657 2,769 2,403 Selling, general and administrative expenses 255 186 903 719 Merger related costs 18 — 50 — Restructuring charge 22 6 50 14 Non-rental depreciation and amortization 70 63 259 255 Operating income 462 402 1,507 1,415 Interest expense, net 126 162 464 511 Other income, net — (2 ) (5 ) (5 ) Income before (benefit) provision for income taxes 336 242 1,048 909 (Benefit) provision for income taxes (1) (561 ) 89 (298 ) 343 Net income (1) $ 897 $ 153 $ 1,346 $ 566 Diluted earnings per share (1) $ 10.45 $ 1.80 $ 15.73 $ 6.45 (1) The three months and year ended December 31, 2017 include a substantial benefit associated with the enactment of the Tax Cuts and Jobs Act of 2017 discussed further above. UNITED RENTALS, INC. CONDENSED CONSOLIDATED BALANCE SHEETS (UNAUDITED) (In millions) December 31, 2017 December 31, 2016 ASSETS Cash and cash equivalents $ 352 $ 312 Accounts receivable, net 1,233 920 Inventory 75 68 Prepaid expenses and other assets 112 61 Total current assets 1,772 1,361 Rental equipment, net 7,824 6,189 Property and equipment, net 467 430 Goodwill 4,082 3,260 Other intangible assets, net 875 742 Other long-term assets 10 6 Total assets $ 15,030 $ 11,988 LIABILITIES AND STOCKHOLDERS’ EQUITY Short-term debt and current maturities of long-term debt $ 723 $ 597 Accounts payable 409 243 Accrued expenses and other liabilities 536 344 Total current liabilities 1,668 1,184 Long-term debt 8,717 7,193 Deferred taxes 1,419 1,896 Other long-term liabilities 120 67 Total liabilities 11,924 10,340 Common stock 1 1 Additional paid-in capital 2,356 2,288 Retained earnings 3,005 1,654 Treasury stock (2,105 ) (2,077 ) Accumulated other comprehensive loss (151 ) (218 ) Total stockholders’ equity 3,106 1,648 Total liabilities and stockholders’ equity $ 15,030 $ 11,988 UNITED RENTALS, INC. CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (UNAUDITED) (In millions) Three Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Cash Flows From Operating Activities: Net income $ 897 $ 153 $ 1,346 $ 566 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation and amortization 390 318 1,383 1,245 Amortization of deferred financing costs and original issue discounts 3 2 9 9 Gain on sales of rental equipment (67 ) (58 ) (220 ) (204 ) Gain on sales of non-rental equipment — (1 ) (4 ) (4 ) Stock compensation expense, net 23 12 87 45 Merger related costs 18 — 50 — Restructuring charge 22 6 50 14 Loss on repurchase/redemption of debt securities and amendment of ABL facility 11 65 54 101 Excess tax benefits from share-based payment arrangements (1) — (5 ) — (58 ) (Decrease) increase in deferred taxes (2) (630 ) 33 (533 ) 123 Changes in operating assets and liabilities: (Increase) decrease in accounts receivable (12 ) 8 (184 ) 15 Decrease in inventory 10 4 1 1 (Increase) decrease in prepaid expenses and other assets (19 ) 2 (20 ) 77 (Decrease) increase in accounts payable (209 ) (166 ) 141 (29 ) Increase (decrease) in accrued expenses and other liabilities 27 (50 ) 70 52 Net cash provided by operating activities 464 323 2,230 1,953 Cash Flows From Investing Activities: Purchases of rental equipment (284 ) (101 ) (1,769 ) (1,246 ) Purchases of non-rental equipment (33 ) (28 ) (120 ) (93 ) Proceeds from sales of rental equipment 172 135 550 496 Proceeds from sales of non-rental equipment 6 2 16 14 Purchases of other companies, net of cash acquired (1,314 ) — (2,377 ) (28 ) Purchases of investments — (2 ) (5 ) (2 ) Net cash (used in) provided by investing activities (1,453 ) 6 (3,705 ) (859 ) Cash Flows From Financing Activities: Proceeds from debt 3,099 2,940 11,801 8,752 Payments of debt (2,051 ) (3,202 ) (10,207 ) (9,223 ) Payments of financing costs — (12 ) (44 ) (24 ) Proceeds from the exercise of common stock options 2 1 3 1 Common stock repurchased (3) (30 ) (40 ) (56 ) (528 ) Excess tax benefits from share-based payment arrangements (1) — 5 — 58 Net cash provided by (used in) financing activities 1,020 (308 ) 1,497 (964 ) Effect of foreign exchange rates (3 ) (6 ) 18 3 Net increase in cash and cash equivalents 28 15 40 133 Cash and cash equivalents at beginning of period 324 297 312 179 Cash and cash equivalents at end of period $ 352 $ 312 $ 352 $ 312 Supplemental disclosure of cash flow information: Cash paid for income taxes, net $ 91 $ 85 $ 205 $ 99 Cash paid for interest 52 121 357 415 (1) In 2017, we adopted accounting guidance on share-based payments, as a result of which the excess tax benefits from share-based payment arrangements for 2017 are presented as a component of net cash provided by operating activities (within net income), while, for 2016, they are presented as a component of net cash used in financing activities. UNITED RENTALS, INC. CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (UNAUDITED) (continued) (2) The decreases in deferred taxes for the three months and year ended December 31, 2017 include the impact of the enactment of the Tax Cuts and Jobs Act of 2017 discussed further above. (3) We have an open $1 billion share repurchase program, under which we have purchased $655 million as of December 31, 2017, that we paused in October 2016 as we evaluated potential acquisition opportunities. We completed the NES and Neff acquisitions in April 2017 and October 2017, respectively. In October 2017, we resumed the share repurchase program, and we intend to complete the program in 2018. The common stock repurchases include i) shares repurchased pursuant to the $1 billion share repurchase program and ii) shares withheld to satisfy tax withholding obligations upon the vesting of restricted stock unit awards. UNITED RENTALS, INC. SEGMENT PERFORMANCE ($ in millions) Three Months Ended Year Ended December 31, December 31, 2017 2016 Change 2017 2016 Change General Rentals Reportable segment equipment rentals revenue $ 1,370 $ 1,099 24.7% $ 4,727 $ 4,166 13.5% Reportable segment equipment rentals gross profit 600 482 24.5% 1,950 1,725 13.0% Reportable segment equipment rentals gross margin 43.8 % 43.9 % (10) bps 41.3 % 41.4 % (10) bps Trench, Power and Pump Reportable segment equipment rentals revenue $ 276 $ 199 38.7% $ 988 $ 775 27.5% Reportable segment equipment rentals gross profit 131 90 45.6% 490 364 34.6% Reportable segment equipment rentals gross margin 47.5 % 45.2 % 230 bps 49.6 % 47.0 % 260 bps Total United Rentals Total equipment rentals revenue $ 1,646 $ 1,298 26.8% $ 5,715 $ 4,941 15.7% Total equipment rentals gross profit 731 572 27.8% 2,440 2,089 16.8% Total equipment rentals gross margin 44.4 % 44.1 % 30 bps 42.7 % 42.3 % 40 bps UNITED RENTALS, INC. DILUTED EARNINGS PER SHARE CALCULATION (In millions, except per share data) Three Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Numerator: Net income available to common stockholders (1) $ 897 $ 153 $ 1,346 $ 566 Denominator: Denominator for basic earnings per share—weighted-average common shares 84.6 84.4 84.6 87.2 Effect of dilutive securities: Employee stock options 0.4 0.3 0.4 0.3 Restricted stock units 0.8 0.4 0.6 0.3 Denominator for diluted earnings per share—adjusted weighted-average common shares 85.8 85.1 85.6 87.8 Diluted earnings per share (1) $ 10.45 $ 1.80 $ 15.73 $ 6.45 (1) Net income for the three months and year ended December 31, 2017 includes a benefit associated with the enacted tax reform discussed above estimated at $689 million, or $8.03 and $8.05 per diluted share for the three months and year ended December 31, 2017, respectively. UNITED RENTALS, INC.\nADJUSTED EARNINGS PER SHARE GAAP RECONCILIATION\nWe define “earnings per share – adjusted” as the sum of earnings per share – GAAP, as reported plus the impact of the following special items: merger related costs, merger related intangible asset amortization, impact on rental depreciation related to acquired fleet and property and equipment, impact of the fair value mark-up of acquired fleet, impact on interest expense related to fair value adjustment of acquired RSC indebtedness, restructuring charge, asset impairment charge and loss on repurchase/redemption of debt securities and amendment of ABL facility. Management believes that earnings per share - adjusted provides useful information concerning future profitability. However, earnings per share - adjusted is not a measure of financial performance under GAAP. Accordingly, earnings per share - adjusted should not be considered an alternative to GAAP earnings per share. The table below provides a reconciliation between earnings per share – GAAP, as reported, and earnings per share – adjusted.\nThree Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Earnings per share - GAAP, as reported (1) $ 10.45 $ 1.80 $ 15.73 $ 6.45 After-tax impact of: Merger related costs (2) 0.13 — 0.36 — Merger related intangible asset amortization (3) 0.32 0.29 1.15 1.12 Impact on depreciation related to acquired fleet and property and equipment (4) 0.01 — 0.05 — Impact of the fair value mark-up of acquired fleet (5) 0.23 0.06 0.59 0.25 Impact on interest expense related to fair value adjustment of acquired RSC indebtedness (6) — — — (0.01 ) Restructuring charge (7) 0.15 0.05 0.36 0.11 Asset impairment charge (8) — — 0.01 0.03 Loss on repurchase/redemption of debt securities and amendment of ABL facility 0.08 0.47 0.39 0.70 Earnings per share - adjusted (1) $ 11.37 $ 2.67 $ 18.64 $ 8.65 Tax rate applied to above adjustments (9) 38.6 % 37.9 % 38.5 % 38.2 % (1) Earnings per share – GAAP, as reported and earnings per share – adjusted include estimated benefits of $8.03 and $8.05 for the three months and year ended December 31, 2017, respectively, associated with the enacted tax reform discussed above. (2) Reflects transaction costs associated with the NES and Neff acquisitions discussed above. We have made a number of acquisitions in the past and may continue to make acquisitions in the future. Merger related costs only include costs associated with major acquisitions that significantly impact our operations. The historic acquisitions that have included merger related costs are RSC, which had annual revenues of approximately $1.5 billion prior to the acquisition, and National Pump, which had annual revenues of over $200 million prior to the acquisition. NES had annual revenues of approximately $369 million, and Neff had annual revenues of approximately $413 million. (3) Reflects the amortization of the intangible assets acquired in the RSC, National Pump, NES and Neff acquisitions. (4) Reflects the impact of extending the useful lives of equipment acquired in the RSC, NES and Neff acquisitions, net of the impact of additional depreciation associated with the fair value mark-up of such equipment. (5) Reflects additional costs recorded in cost of rental equipment sales associated with the fair value mark-up of rental equipment acquired in the RSC, NES and Neff acquisitions and subsequently sold. (6) Reflects a reduction of interest expense associated with the fair value mark-up of debt acquired in the RSC acquisition. (7) Primarily reflects severance and branch closure charges associated with our closed restructuring programs and our current restructuring program. We only include such costs that are part of a restructuring program as restructuring charges. Since the first such restructuring program was initiated in 2008, we have completed three restructuring programs. We have cumulatively incurred total restructuring charges of $284 million under our restructuring programs. (8) Reflects write-offs of leasehold improvements and other fixed assets in connection with our restructuring programs. (9) The tax rates applied to the adjustments reflect the statutory rates in the applicable entity. UNITED RENTALS, INC.\nEBITDA AND ADJUSTED EBITDA GAAP RECONCILIATION\n(In millions)\nEBITDA represents the sum of net income, (benefit) provision for income taxes, interest expense, net, depreciation of rental equipment, and non-rental depreciation and amortization. Adjusted EBITDA represents EBITDA plus the sum of the merger related costs, restructuring charge, stock compensation expense, net, and the impact of the fair value mark-up of acquired fleet. These items are excluded from adjusted EBITDA internally when evaluating our operating performance and for strategic planning and forecasting purposes, and allow investors to make a more meaningful comparison between our core business operating results over different periods of time, as well as with those of other similar companies. The EBITDA and adjusted EBITDA margins represent EBITDA or adjusted EBITDA divided by total revenue. Management believes that EBITDA and adjusted EBITDA, when viewed with the Company’s results under GAAP and the accompanying reconciliation, provide useful information about operating performance and period-over-period growth, and provide additional information that is useful for evaluating the operating performance of our core business without regard to potential distortions. Additionally, management believes that EBITDA and adjusted EBITDA help investors gain an understanding of the factors and trends affecting our ongoing cash earnings, from which capital investments are made and debt is serviced. However, EBITDA and adjusted EBITDA are not measures of financial performance or liquidity under GAAP and, accordingly, should not be considered as alternatives to net income or cash flow from operating activities as indicators of operating performance or liquidity. The table below provides a reconciliation between net income and EBITDA and adjusted EBITDA.\nThree Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Net income $ 897 $ 153 $ 1,346 $ 566 (Benefit) provision for income taxes (561 ) 89 (298 ) 343 Interest expense, net 126 162 464 511 Depreciation of rental equipment 320 255 1,124 990 Non-rental depreciation and amortization 70 63 259 255 EBITDA (A) $ 852 $ 722 $ 2,895 $ 2,665 Merger related costs (1) 18 — 50 — Restructuring charge (2) 22 6 50 14 Stock compensation expense, net (3) 23 12 87 45 Impact of the fair value mark-up of acquired fleet (4) 32 9 82 35 Adjusted EBITDA (B) $ 947 $ 749 $ 3,164 $ 2,759 (A) Our EBITDA margin was 44.3% and 47.4% for the three months ended December 31, 2017 and 2016, respectively, and 43.6% and 46.3% for the years ended December 31, 2017 and 2016, respectively. (B) Our adjusted EBITDA margin was 49.3% and 49.2% for the three months ended December 31, 2017 and 2016, respectively, and 47.6% and 47.9% for the years ended December 31, 2017 and 2016, respectively. (1) Reflects transaction costs associated with the NES and Neff acquisitions discussed above. We have made a number of acquisitions in the past and may continue to make acquisitions in the future. Merger related costs only include costs associated with major acquisitions that significantly impact our operations. The historic acquisitions that have included merger related costs are RSC, which had annual revenues of approximately $1.5 billion prior to the acquisition, and National Pump, which had annual revenues of over $200 million prior to the acquisition. NES had annual revenues of approximately $369 million, and Neff had annual revenues of approximately $413 million. (2) Primarily reflects severance and branch closure charges associated with our closed restructuring programs and our current restructuring program. We only include such costs that are part of a restructuring program as restructuring charges. Since the first such restructuring program was initiated in 2008, we have completed three restructuring programs. We have cumulatively incurred total restructuring charges of $284 million under our restructuring programs. (3) Represents non-cash, share-based payments associated with the granting of equity instruments. (4) Reflects additional costs recorded in cost of rental equipment sales associated with the fair value mark-up of rental equipment acquired in the RSC, NES and Neff acquisitions and subsequently sold. UNITED RENTALS, INC. RECONCILIATION OF NET CASH PROVIDED BY OPERATING ACTIVITIES TO EBITDA AND ADJUSTED EBITDA (In millions) Three Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Net cash provided by operating activities $ 464 $ 323 $ 2,230 $ 1,953 Adjustments for items included in net cash provided by operating activities but excluded from the calculation of EBITDA: Amortization of deferred financing costs and original issue discounts (3 ) (2 ) (9 ) (9 ) Gain on sales of rental equipment 67 58 220 204 Gain on sales of non-rental equipment — 1 4 4 Merger related costs (1) (18 ) — (50 ) — Restructuring charge (2) (22 ) (6 ) (50 ) (14 ) Stock compensation expense, net (3) (23 ) (12 ) (87 ) (45 ) Loss on repurchase/redemption of debt securities and amendment of ABL facility (11 ) (65 ) (54 ) (101 ) Excess tax benefits from share-based payment arrangements — 5 — 58 Changes in assets and liabilities 255 214 129 101 Cash paid for interest 52 121 357 415 Cash paid for income taxes, net 91 85 205 99 EBITDA $ 852 $ 722 $ 2,895 $ 2,665 Add back: Merger related costs (1) 18 — 50 — Restructuring charge (2) 22 6 50 14 Stock compensation expense, net (3) 23 12 87 45 Impact of the fair value mark-up of acquired fleet (4) 32 9 82 35 Adjusted EBITDA $ 947 $ 749 $ 3,164 $ 2,759 (1) Reflects transaction costs associated with the NES and Neff acquisitions discussed above. We have made a number of acquisitions in the past and may continue to make acquisitions in the future. Merger related costs only include costs associated with major acquisitions that significantly impact our operations. The historic acquisitions that have included merger related costs are RSC, which had annual revenues of approximately $1.5 billion prior to the acquisition, and National Pump, which had annual revenues of over $200 million prior to the acquisition. NES had annual revenues of approximately $369 million, and Neff had annual revenues of approximately $413 million. (2) Primarily reflects severance and branch closure charges associated with our closed restructuring programs and our current restructuring program. We only include such costs that are part of a restructuring program as restructuring charges. Since the first such restructuring program was initiated in 2008, we have completed three restructuring programs. We have cumulatively incurred total restructuring charges of $284 million under our restructuring programs. (3) Represents non-cash, share-based payments associated with the granting of equity instruments. (4) Reflects additional costs recorded in cost of rental equipment sales associated with the fair value mark-up of rental equipment acquired in the RSC, NES and Neff acquisitions and subsequently sold. UNITED RENTALS, INC.\nFREE CASH FLOW GAAP RECONCILIATION\n(In millions)\nWe define free cash flow as (i) net cash provided by operating activities less (ii) purchases of rental and non-rental equipment plus (iii) proceeds from sales of rental and non-rental equipment, and excess tax benefits from share-based payment arrangements. Management believes that free cash flow provides useful additional information concerning cash flow available to meet future debt service obligations and working capital requirements. However, free cash flow is not a measure of financial performance or liquidity under GAAP. Accordingly, free cash flow should not be considered an alternative to net income or cash flow from operating activities as an indicator of operating performance or liquidity. The table below provides a reconciliation between net cash provided by operating activities and free cash flow.\nThree Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Net cash provided by operating activities $ 464 $ 323 $ 2,230 $ 1,953 Purchases of rental equipment (284 ) (101 ) (1,769 ) (1,246 ) Purchases of non-rental equipment (33 ) (28 ) (120 ) (93 ) Proceeds from sales of rental equipment 172 135 550 496 Proceeds from sales of non-rental equipment 6 2 16 14 Excess tax benefits from share-based payment arrangements (1) — 5 — 58 Free cash flow (2) $ 325 $ 336 $ 907 $ 1,182 (1) The excess tax benefits from share-based payment arrangements result from stock-based compensation windfall deductions in excess of the amounts reported for financial reporting purposes. We adopted accounting guidance in 2017 that changed the cash flow presentation of excess tax benefits from share-based payment arrangements. In the table above, the excess tax benefits from share-based payment arrangements for 2017 are presented as a component of net cash provided by operating activities, while, for 2016, they are presented as a separate line item. Because we historically included the excess tax benefits from share-based payment arrangements in the free cash flow calculation, the adoption of this guidance did not change the calculation of free cash flow. (2) Free cash flow included aggregate merger and restructuring related payments of $24 million and $2 million for the three months ended December 31, 2017 and 2016, respectively, and $76 million and $13 million for the years ended December 31, 2017 and 2016, respectively. The table below provides a reconciliation between 2018 forecasted net cash provided by operating activities and free cash flow.\nNet cash provided by operating activities $2,625- $2,825 Purchases of rental equipment $(1,800)-$(1,950) Proceeds from sales of rental equipment $550-$650 Purchases of non-rental equipment, net of proceeds from sales $(75)-$(125) Free cash flow (excluding the impact of merger and restructuring related payments) $1,300- $1,400\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006197/en/\nUnited Rentals, Inc.\nTed Grace, 203-618-7122\nCell: 203-399-8951\ntgrace@ur.com\nSource: United Rentals, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180124006197/en/"], "published": "2018-01-25T00:15:00.000+02:00", "crawled": "2018-01-25T02:19:05.023+02:00", "highlightTitle": ""}