{"organizations": [], "uuid": "03252eeaaac200c6757d47142b087a9e8ca84862", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/9", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-riverview-bancorp-reports-earnings-for-third-fiscal-quarter-2018-pre-tax-income-increases-72-percent-year-over-year.html", "country": "US", "domain_rank": 767, "title": "Riverview Bancorp Reports Earnings for Third Fiscal Quarter 2018 Pre-Tax Income increases 72% Year-Over-Year", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-26T00:00:00.000+02:00", "replies_count": 0, "uuid": "03252eeaaac200c6757d47142b087a9e8ca84862"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-riverview-bancorp-reports-earnings-for-third-fiscal-quarter-2018-pre-tax-income-increases-72-percent-year-over-year.html", "ord_in_thread": 0, "title": "Riverview Bancorp Reports Earnings for Third Fiscal Quarter 2018 Pre-Tax Income increases 72% Year-Over-Year", "locations": [], "entities": {"persons": [], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "wash.", "sentiment": "none"}, {"name": "riverview", "sentiment": "none"}], "organizations": [{"name": "riverview bancorp", "sentiment": "negative"}, {"name": "riverview bancorp, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, Wash., Riverview Bancorp, Inc. (Nasdaq:RVSB) (“Riverview” or the “Company”) today reported net income of $1.5 million, or $0.07 per diluted share, in its third fiscal quarter ended December 31, 2017. This compares to net income of $3.1 million, or $0.14 per diluted share, in the preceding quarter and net income of $2.0 million, or $0.09 per diluted share, in the third fiscal quarter a year ago. Net income was impacted during the current quarter due to a valuation adjustment of the Company’s net deferred tax asset along with the use of a lower blended tax rate, which resulted in an additional net income tax expense of $1.8 million, or $0.08 per diluted share. Pre-tax income for the third fiscal quarter of 2018 was $5.1 million, which was a $449,000, or 9.6%, increase compared to the preceding quarter and a $2.1 million, or 71.8%, increase from the year ago quarter.\nIn the first nine months of fiscal year 2018, Riverview’s net income increased to $7.2 million, or $0.32 per diluted share, compared to $5.4 million, or $0.24 per diluted share, in the first nine months of fiscal year 2017.\n“Riverview had another successful quarter with strong net interest income generation, an expanding net interest margin and continued operating efficiencies,” stated Pat Sheaffer, chairman, chief executive officer and president. “With the successful integration of the MBank transaction behind us, our focus remains on expanding our franchise. We will continue to look for growth opportunities in the Portland area and its surrounding markets.”\nAs a result of the Tax Cuts and Jobs Act (the “Tax Act”) enacted on December 22, 2017, Riverview revalued its deferred tax assets and liabilities to account for the future impact of lower corporate tax rates and other provisions of the Tax Act. Based on its preliminary analysis, Riverview recorded a one-time net tax charge of $1.8 million related to the lower corporate tax rate adopted in the Tax Act. This increase in income tax expense was reflected in Riverview’s operating results for the third fiscal quarter of 2018 and was in addition to the normal provision for income tax related to pre-tax net operating income.\n“We recorded an additional net income tax expense of $1.8 million, or $0.08 per diluted share, due to the passage of the Tax Cuts and Jobs Act in the third fiscal quarter of 2018,” said Kevin Lycklama, executive vice president and chief operating officer. “Going forward, we expect to fully recoup this additional expense within the next fiscal year, due to the lower corporate tax rate. The effective tax rate for our fourth fiscal quarter of 2018 is expected to be approximately 31.5% due to our use of a blended tax rate for the remainder of this fiscal year. We expect our effective tax rate will decline to approximately 22.5% beginning on April 1, 2018 at the start of our new fiscal year.”\nThird Quarter Highlights (at or for the period ended December 31, 2017)\nNet interest margin (NIM) expanded by three basis points to 4.06% compared to the preceding quarter and expanded 31 basis points compared to the third quarter a year ago. Total loans increased $13.6 million during the quarter to $797.3 million. Non-performing assets were 0.26% of total assets. Efficiency ratio improved to 62.5%. Tangible book value per share was $3.93. Total risk-based capital ratio was 15.07% and Tier 1 leverage ratio was 9.82%. Declared quarterly cash dividend of $0.03 per share, generating a current dividend yield of 1.28% based on the market price on January 23, 2018.\nIncome Statement\nRiverview’s net interest income was $10.8 million in the third fiscal quarter of 2018, a $71,000 increase compared to $10.7 million in the preceding quarter and a $2.3 million increase compared to $8.5 million in the third fiscal quarter a year ago. In the first nine months of fiscal 2018, net interest income increased $7.5 million to $32.0 million compared to $24.4 million in the first nine months of fiscal 2017.\n“Our net interest margin expanded three basis points in the third quarter of fiscal 2018 compared to the prior linked quarter reflecting a lower balance of cash and liquid assets earning a nominal yield,” said Lycklama. The interest accretion on purchased loans totaled $175,000 and resulted in a six basis point increase in the NIM during the third fiscal quarter. Fiscal year-to-date, the NIM increased 33 basis points to 4.06% compared to 3.73% in the first nine months of fiscal 2017.\nNon-interest income was $2.9 million in the third fiscal quarter, a $177,000 increase compared to $2.7 million the prior quarter and a $557,000 increase compared to $2.3 million in the same quarter a year ago. In the first nine months of fiscal 2018, non-interest income increased to $8.3 million compared to $7.4 million in the first nine months of fiscal 2017. The nine month year over year increase was primarily due to an increase in fees and service charges and asset management fees.\nAsset management fees were $911,000 in the third fiscal quarter of 2018 compared to $818,000 in the preceding quarter and $709,000 in the third fiscal quarter a year ago. Riverview Trust Company’s (“RTC”) assets under management increased to $490.1 million at December 31, 2017 compared to $461.2 million three months earlier and $403.3 million a year earlier. During the fourth quarter of fiscal 2017, RTC opened a second office in the Portland suburb of Lake Oswego, expanding its footprint and product offerings in the Portland market.\nNon-interest expense decreased $201,000 to $8.6 million during the third fiscal quarter of 2018 compared to $8.8 million in the preceding quarter and increased $707,000 from $7.9 million for the same prior year period mainly due to the MBank transaction. There were no transaction related costs from the MBank transaction in the current quarter compared to $177,000 in transaction related costs during the preceding quarter. The efficiency ratio improved to 62.5% for the quarter ended December 31, 2017, compared to 65.2% in the preceding quarter and 72.5% in the third fiscal quarter a year ago. “With all MBank transaction costs behind us, we expect to continue to capitalize on the cost savings and operating efficiencies associated with a larger organization,” said Lycklama. “We will continue to look for other opportunities to improve profitability and increase shareholder value.”\nBalance Sheet Review\nTotal loans increased $13.6 million during the quarter to $797.3 million at December 31, 2017 compared to $783.7 million at September 30, 2017, and increased $133.0 million compared to $664.3 million a year ago. The growth in the loan portfolio was primarily concentrated in commercial business, multi-family and warehouse/industrial loans. Undisbursed construction loans totaled $61.8 million at December 31, 2017, with the majority of the undisbursed construction loans expected to fund over the next several quarters. The commercial loan pipeline totaled $61.6 million at the end of the quarter.\nTotal deposits increased $131.8 million to $972.2 million at December 31, 2017 compared to $840.4 million a year ago but decreased compared to $990.3 million at September 30, 2017. The decrease compared to the prior quarter end was primarily due to the timing of deposit transactions. Core deposits represent 98.0% of total deposits at December 31, 2017.\nShareholders’ equity was $116.8 million at December 31, 2017 compared to $116.7 million three months earlier and $109.4 million a year earlier. Tangible book value per share was $3.93 at both December 31, 2017 and September 30, 2017 and an increase compared to $3.72 at December 31, 2016. A quarterly cash dividend of $0.03 per share was paid on January 23, 2018.\nCredit Quality\nClassified assets totaled $6.9 million at December 31, 2017 compared to $7.1 million at September 30, 2017 and the classified asset to total capital ratio was 5.7% compared to 6.0%, respectively.\nRiverview’s non-performing loans were $2.7 million, or 0.33% of total loans, at December 31, 2017 compared to $2.8 million, or 0.35% of total loans, three months earlier. Real estate owned balances of $298,000 at December 31, 2017 were unchanged compared to the preceding quarter end.\nThe allowance for loan losses totaled $10.9 million, representing 1.36% of total loans at December 31, 2017 compared to $10.6 million and 1.35% of total loans at September 30, 2017. Included in the carrying value of loans are net discounts on the MBank purchased loans which may reduce the need for an allowance for loan losses on these loans, because they are carried at an amount below the outstanding principal balance. The remaining net discount on these purchased loans was $2.4 million at December 31, 2017 compared to $2.6 million at the end of the prior quarter. Net loan recoveries were $250,000 during the third fiscal quarter of 2018 compared to $20,000 in the preceding quarter.\nRiverview recorded no provision for loan losses during the third fiscal quarter of 2018 or in the preceding quarter, primarily as a result of the lower levels of delinquent, nonperforming and classified loans, elevated levels of net recoveries, as well as stabilizing values in our market areas which mitigated the required allowance for loan losses due to our loan growth.\nCapital\nRiverview continues to maintain capital levels well in excess of the regulatory requirements to be categorized as “well capitalized” with a total risk-based capital ratio of 15.07% and a Tier 1 leverage ratio of 9.82% at December 31, 2017. In addition at that date the Company’s tangible common equity to tangible assets ratio was 8.05%.\nNon-GAAP Financial Measures\nIn addition to results presented in accordance with generally accepted accounting principles (“GAAP”), this press release contains certain non-GAAP financial measures. We believe that certain non-GAAP financial measures provide investors with information useful in understanding the Company’s financial performance; however, readers of this report are urged to review these non-GAAP financial measures in conjunction with GAAP results as reported.\nFinancial measures that exclude intangible assets are non-GAAP measures. To provide investors with a broader understanding of capital adequacy, Riverview provides non-GAAP financial measures for tangible common equity, along with the GAAP measure. Tangible common equity is calculated as shareholders’ equity less goodwill and other intangible assets. In addition, tangible assets are total assets less goodwill and other intangible assets. We calculate tangible book value per share by dividing tangible common equity by the number of common shares outstanding. This non-GAAP financial measure has inherent limitations, is not required to be uniformly applied and is not audited. Further, the non-GAAP financial measure should not be considered in isolation or as a substitute for book value per share or total stockholders' equity determined in accordance with GAAP and may not be comparable to similarly titled measures reported by other companies. Reconciliations of the GAAP and non-GAAP financial measures are presented below.\n(Dollars in thousands) December 31, 2017 September 30, 2017 December 31, 2016 March 31, 2017 Shareholders' equity $ 116,803 $ 116,742 $ 109,400 $ 111,264 Goodwill 27,076 27,076 25,572 27,076 Core deposit intangible, net 1,161 1,219 - 1,335 Tangible shareholders' equity $ 88,566 $ 88,447 $ 83,828 $ 82,853 Total assets $ 1,128,342 $ 1,147,680 $ 985,669 $ 1,133,939 Goodwill 27,076 27,076 25,572 27,076 Core deposit intangible, net 1,161 1,219 - 1,335 Tangible assets $ 1,100,105 $ 1,119,385 $ 960,097 $ 1,105,528 About Riverview\nRiverview Bancorp, Inc. ( www.riverviewbank.com ) is headquartered in Vancouver, Washington – just north of Portland, Oregon on the I-5 corridor. With assets of $1.13 billion at December 31, 2017, it is the parent company of the 94-year-old Riverview Community Bank, as well as Riverview Trust Company. The Bank offers true community banking services, focusing on providing the highest quality service and financial products to commercial and retail customers. There are 19 branches, including 14 in the Portland-Vancouver area and three lending centers. For the past 4 years, Riverview has been named Best Bank by the readers of The Vancouver Business Journal, The Columbian and The Gresham Outlook.\n“Safe Harbor” statement under the Private Securities Litigation Reform Act of 1995: This press release contains forward-looking statements that are subject to risks and uncertainties, including, but not limited to: expected cost savings, synergies and other financial benefits from our recent purchase of certain assets and assumption of certain liabilities of MBank and Merchants Bancorp pursuant to the Purchase and Assumption Agreement (the \"Agreement\") with Merchants Bancorp and its wholly owned subsidiary MBank (the \"transaction\") might not be realized within the expected time frames or at all, and costs or difficulties relating to integration matters might be greater than expected; the Company’s ability to raise common capital; the credit risks of lending activities, including changes in the level and trend of loan delinquencies and write-offs and changes in the Company’s allowance for loan losses and provision for loan losses that may be impacted by deterioration in the housing and commercial real estate markets; changes in general economic conditions, either nationally or in the Company’s market areas; changes in the levels of general interest rates, and the relative differences between short and long term interest rates, deposit interest rates, the Company’s net interest margin and funding sources; fluctuations in the demand for loans, the number of unsold homes, land and other properties and fluctuations in real estate values in the Company’s market areas; secondary market conditions for loans and the Company’s ability to sell loans in the secondary market; results of examinations of us by the Office of Comptroller of the Currency or other regulatory authorities, including the possibility that any such regulatory authority may, among other things, require us to increase the Company’s reserve for loan losses, write-down assets, change Riverview Community Bank’s regulatory capital position or affect the Company’s ability to borrow funds or maintain or increase deposits, which could adversely affect its liquidity and earnings; legislative or regulatory changes that adversely affect the Company’s business including changes in regulatory policies and principles, or the interpretation of regulatory capital or other rules; the Company’s ability to attract and retain deposits; further increases in premiums for deposit insurance; the Company’s ability to control operating costs and expenses; the use of estimates in determining fair value of certain of the Company’s assets, which estimates may prove to be incorrect and result in significant declines in valuation; difficulties in reducing risks associated with the loans on the Company’s balance sheet; staffing fluctuations in response to product demand or the implementation of corporate strategies that affect the Company’s workforce and potential associated charges; computer systems on which the Company depends could fail or experience a security breach; the Company’s ability to retain key members of its senior management team; costs and effects of litigation, including settlements and judgments; the Company’s ability to successfully integrate any assets, liabilities, customers, systems, and management personnel it may in the future acquire into its operations and the Company’s ability to realize related revenue synergies and cost savings within expected time frames and any goodwill charges related thereto; increased competitive pressures among financial services companies; changes in consumer spending, borrowing and savings habits; the availability of resources to address changes in laws, rules, or regulations or to respond to regulatory actions; the Company’s ability to pay dividends on its common stock; and interest or principal payments on its junior subordinated debentures; adverse changes in the securities markets; inability of key third-party providers to perform their obligations to us; changes in accounting policies and practices, as may be adopted by the financial institution regulatory agencies or the Financial Accounting Standards Board, including additional guidance and interpretation on accounting issues and details of the implementation of new accounting methods; other economic, competitive, governmental, regulatory, and technological factors affecting the Company’s operations, pricing, products and services and the other risks described from time to time in our filings with the SEC.\nSuch forward-looking statements may include projections. Any such projections were not prepared in accordance with published guidelines of the American Institute of Certified Public Accountants or the Securities Exchange Commission regarding projections and forecasts nor have such projections been audited, examined or otherwise reviewed by independent auditors of the Company. In addition, such projections are based upon many estimates and inherently subject to significant economic and competitive uncertainties and contingencies, many of which are beyond the control of management of the Company. Accordingly, actual results may be materially higher or lower than those projected. The inclusion of such projections herein should not be regarded as a representation by the Company that the projections will prove to be correct.\nThe Company cautions readers not to place undue reliance on any forward-looking statements. Moreover, you should treat these statements as speaking only as of the date they are made and based only on information then actually known to the Company. The Company does not undertake and specifically disclaims any obligation to revise any forward-looking statements to reflect the occurrence of anticipated or unanticipated events or circumstances after the date of such statements. These risks could cause our actual results for fiscal 2018 and beyond to differ materially from those expressed in any forward-looking statements by, or on behalf of, us, and could negatively affect the Company’s operating and stock price performance.\nRIVERVIEW BANCORP, INC. AND SUBSIDIARY Consolidated Balance Sheets (In thousands, except share data) (Unaudited) December 31, 2017 September 30, 2017 December 31, 2016 March 31, 2017 ASSETS Cash (including interest-earning accounts of $3,739, $59,315, $14,302 $ 23,105 $ 76,245 $ 28,262 $ 64,613 and $46,245) Certificate of deposits held for investment 6,963 9,797 11,291 11,042 Loans held for sale 351 347 1,679 478 Investment securities: Available for sale, at estimated fair value 224,931 200,584 207,271 200,214 Held to maturity, at amortized cost 44 46 67 64 Loans receivable (net of allowance for loan losses of $10,867, $10,617 $10,289, and $10,528) 786,460 773,087 654,053 768,904 Real estate owned 298 298 298 298 Prepaid expenses and other assets 4,843 4,227 4,832 3,815 Accrued interest receivable 3,464 3,111 2,846 2,941 Federal Home Loan Bank stock, at cost 1,223 1,181 1,060 1,181 Premises and equipment, net 15,680 15,740 13,953 16,232 Deferred income taxes, net 3,988 6,167 8,665 7,610 Mortgage servicing rights, net 399 406 390 398 Goodwill 27,076 27,076 25,572 27,076 Core deposit intangible, net 1,161 1,219 - 1,335 Bank owned life insurance 28,356 28,149 25,430 27,738 TOTAL ASSETS $ 1,128,342 $ 1,147,680 $ 985,669 $ 1,133,939 LIABILITIES AND SHAREHOLDERS' EQUITY LIABILITIES: Deposits $ 972,214 $ 990,299 $ 840,391 $ 980,058 Accrued expenses and other liabilities 9,117 10,838 10,450 13,080 Advance payments by borrowers for taxes and insurance 260 920 288 693 Federal Home Loan Bank advances 1,050 - - - Junior subordinated debentures 26,461 26,438 22,681 26,390 Capital lease obligations 2,437 2,443 2,459 2,454 Total liabilities 1,011,539 1,030,938 876,269 1,022,675 SHAREHOLDERS' EQUITY: Serial preferred stock, $.01 par value; 250,000 authorized, issued and outstanding, none - - - - Common stock, $.01 par value; 50,000,000 authorized, December 31, 2017 - 22,551,912 issued and outstanding; September 30, 2017 - 22,533,912 issued and outstanding; 226 225 225 225 December 31, 2016 - 22,510,890 issued and outstanding; March 31, 2017 – 22,510,890 issued and outstanding; Additional paid-in capital 64,703 64,612 64,448 64,468 Retained earnings 53,878 53,034 46,750 48,335 Unearned shares issued to employee stock ownership plan - (26 ) (103 ) (77 ) Accumulated other comprehensive loss (2,004 ) (1,103 ) (1,920 ) (1,687 ) Total shareholders’ equity 116,803 116,742 109,400 111,264 TOTAL LIABILITIES AND SHAREHOLDERS' EQUITY $ 1,128,342 $ 1,147,680 $ 985,669 $ 1,133,939\nRIVERVIEW BANCORP, INC. AND SUBSIDIARY Consolidated Statements of Income Three Months Ended Nine Months Ended (In thousands, except share data) (Unaudited) Dec. 31, 2017 Sept. 30, 2017 Dec. 31, 2016 Dec. 31, 2017 Dec. 31, 2016 INTEREST INCOME: Interest and fees on loans receivable $ 9,978 $ 9,994 $ 7,883 $ 29,761 $ 22,954 Interest on investment securities - taxable 1,201 1,079 946 3,413 2,435 Interest on investment securities - nontaxable 31 14 11 59 11 Other interest and dividends 168 228 112 483 344 Total interest and dividend income 11,378 11,315 8,952 33,716 25,744 INTEREST EXPENSE: Interest on deposits 298 313 277 933 837 Interest on borrowings 284 277 173 829 494 Total interest expense 582 590 450 1,762 1,331 Net interest income 10,796 10,725 8,502 31,954 24,413 Provision for loan losses - - - - - Net interest income after provision for loan losses 10,796 10,725 8,502 31,954 24,413 NON-INTEREST INCOME: Fees and service charges 1,451 1,490 1,304 4,348 3,815 Asset management fees 911 818 709 2,582 2,258 Net gain on sale of loans held for sale 140 157 191 522 493 Bank owned life insurance 206 204 185 617 566 Other, net 182 44 (56 ) 272 296 Total non-interest income 2,890 2,713 2,333 8,341 7,428 NON-INTEREST EXPENSE: Salaries and employee benefits 5,383 5,251 4,850 16,056 14,021 Occupancy and depreciation 1,347 1,412 1,158 4,105 3,520 Data processing 534 580 562 1,730 1,533 Amortization of core deposit intangible 58 58 - 174 - Advertising and marketing expense 137 256 163 627 608 FDIC insurance premium 108 136 77 389 273 State and local taxes 96 177 170 427 455 Telecommunications 102 103 75 309 224 Professional fees 250 261 355 926 1,066 Real estate owned expenses 3 3 2 8 52 Other 540 522 439 1,740 2,311 Total non-interest expense 8,558 8,759 7,851 26,491 24,063 INCOME BEFORE INCOME TAXES 5,128 4,679 2,984 13,804 7,778 PROVISION FOR INCOME TAXES 3,608 1,620 991 6,571 2,408 NET INCOME $ 1,520 $ 3,059 $ 1,993 $ 7,233 $ 5,370 Earnings per common share: Basic $ 0.07 $ 0.14 $ 0.09 $ 0.32 $ 0.24 Diluted $ 0.07 $ 0.14 $ 0.09 $ 0.32 $ 0.24 Weighted average number of common shares outstanding: Basic 22,537,092 22,518,941 22,490,433 22,520,352 22,477,473 Diluted 22,622,129 22,609,480 22,563,712 22,608,603 22,537,663\n(Dollars in thousands) At or for the three months ended At or for the nine months ended Dec. 31, 2017 Sept. 30, 2017 Dec. 31, 2016 Dec. 31, 2017 Dec. 31, 2016 AVERAGE BALANCES Average interest–earning assets $ 1,055,600 $ 1,056,818 $ 900,542 $ 1,045,283 $ 869,364 Average interest-bearing liabilities 744,431 749,172 652,195 746,262 636,795 Net average earning assets 311,169 307,646 248,347 299,021 232,569 Average loans 785,264 783,213 658,212 784,926 645,598 Average deposits 988,558 992,111 839,588 980,766 810,700 Average equity 118,831 116,675 112,444 116,399 111,261 Average tangible equity (non-GAAP) 90,562 88,351 86,872 88,074 85,689 ASSET QUALITY Dec. 31, 2017 Sept. 30, 2017 Dec. 31, 2016 Non-performing loans $ 2,656 $ 2,745 $ 2,787 Non-performing loans to total loans 0.33 % 0.35 % 0.42 % Real estate/repossessed assets owned $ 298 $ 298 $ 298 Non-performing assets $ 2,954 $ 3,043 $ 3,085 Non-performing assets to total assets 0.26 % 0.27 % 0.31 % Net recoveries in the quarter $ (250 ) $ (20 ) $ (266 ) Net recoveries in the quarter/average net loans (0.13 )% (0.01 )% (0.14 )% Allowance for loan losses $ 10,867 $ 10,617 $ 10,289 Average interest-earning assets to average interest-bearing liabilities 141.80 % 141.06 % 138.08 % Allowance for loan losses to non-performing loans 409.15 % 386.78 % 369.18 % Allowance for loan losses to total loans 1.36 % 1.35 % 1.55 % Shareholders’ equity to assets 10.35 % 10.17 % 11.10 % CAPITAL RATIOS Total capital (to risk weighted assets) 14.94 % 15.07 % 15.93 % Tier 1 capital (to risk weighted assets) 13.68 % 13.82 % 14.68 % Common equity tier 1 (to risk weighted assets) 13.68 % 13.82 % 14.68 % Tier 1 capital (to average tangible assets) 9.84 % 9.75 % 10.81 % Tangible common equity (to average tangible assets) 8.05 % 7.90 % 8.73 % DEPOSIT MIX Dec. 31, 2017 Sept. 30, 2017 Dec. 31, 2016 March 31, 2017 Interest checking $ 170,151 $ 175,127 $ 167,522 $ 171,152 Regular savings 136,249 134,116 109,629 126,370 Money market deposit accounts 270,193 274,409 250,900 289,998 Non-interest checking 264,728 270,678 202,080 242,738 Certificates of deposit 130,893 135,969 110,260 149,800 Total deposits $ 972,214 $ 990,299 $ 840,391 $ 980,058\nCOMPOSITION OF COMMERCIAL AND CONSTRUCTION LOANS Other Commercial Commercial Real Estate Real Estate & Construction Business Mortgage Construction Total December 31, 2017 (Dollars in thousands) Commercial business $ 130,960 $ - $ - $ 130,960 Commercial construction - - 25,384 25,384 Office buildings - 122,281 - 122,281 Warehouse/industrial - 83,829 - 83,829 Retail/shopping centers/strip malls - 67,751 - 67,751 Assisted living facilities - 2,982 - 2,982 Single purpose facilities - 165,060 - 165,060 Land - 12,469 - 12,469 Multi-family - 61,851 - 61,851 One-to-four family construction - - 15,359 15,359 Total $ 130,960 $ 516,223 $ 40,743 $ 687,926 March 31, 2017 Commercial business $ 107,371 $ - $ - $ 107,371 Commercial construction - - 27,050 27,050 Office buildings - 121,983 - 121,983 Warehouse/industrial - 74,671 - 74,671 Retail/shopping centers/strip malls - 78,757 - 78,757 Assisted living facilities - 3,686 - 3,686 Single purpose facilities - 167,974 - 167,974 Land - 15,875 - 15,875 Multi-family - 43,715 - 43,715 One-to-four family construction - - 19,107 19,107 Total $ 107,371 $ 506,661 $ 46,157 $ 660,189 LOAN MIX Dec. 31, 2017 Sept. 30, 2017 Dec. 31, 2016 March 31, 2017 (Dollars in thousands) Commercial and construction Commercial business $ 130,960 $ 118,444 $ 64,401 $ 107,371 Other real estate mortgage 516,223 500,382 432,782 506,661 Real estate construction 40,743 53,878 52,707 46,157 Total commercial and construction 687,926 672,704 549,890 660,189 Consumer Real estate one-to-four family 91,752 90,764 85,956 92,865 Other installment 17,649 20,236 28,496 26,378 Total consumer 109,401 111,000 114,452 119,243 Total loans 797,327 783,704 664,342 779,432 Less: Allowance for loan losses 10,867 10,617 10,289 10,528 Loans receivable, net $ 786,460 $ 773,087 $ 654,053 $ 768,904\nDETAIL OF NON-PERFORMING ASSETS Other Southwest Other Oregon Washington Washington Other Total December 31, 2017 Commercial business $ - $ 289 $ - $ - $ 289 Commercial real estate 1,084 207 - - 1,291 Land 770 - - - 770 Consumer - 207 - 99 306 Total non-performing loans 1,854 703 - 99 2,656 REO - - 298 - 298 Total non-performing assets $ 1,854 $ 703 $ 298 $ 99 $ 2,954 DETAIL OF LAND DEVELOPMENT AND SPECULATIVE CONSTRUCTION LOANS Northwest Other Southwest Oregon Oregon Washington Total December 31, 2017 (dollars in thousands) Land development $ 486 $ 896 $ 11,087 $ 12,469 Speculative construction - 371 12,335 12,706 Total land development and speculative construction $ 486 $ 1,267 $ 23,422 $ 25,175\nAt or for the three months ended At or for the nine months ended SELECTED OPERATING DATA Dec. 31, 2017 Sept. 30, 2017 Dec. 31, 2016 Dec. 31, 2017 Dec. 31, 2016 Efficiency ratio (4) 62.53 % 65.18 % 72.46 % 65.74 % 75.57 % Coverage ratio (6) 126.15 % 122.45 % 108.29 % 120.62 % 101.45 % Return on average assets (1) 0.53 % 1.06 % 0.80 % 0.85 % 0.75 % Return on average equity (1) 5.07 % 10.40 % 7.03 % 8.25 % 6.41 % NET INTEREST SPREAD Yield on loans 5.04 % 5.06 % 4.75 % 5.03 % 4.72 % Yield on investment securities 2.24 % 2.14 % 2.06 % 2.20 % 1.96 % Total yield on interest-earning assets 4.28 % 4.25 % 3.95 % 4.29 % 3.93 % Cost of interest-bearing deposits 0.17 % 0.17 % 0.18 % 0.17 % 0.18 % Cost of FHLB advances and other borrowings 3.89 % 3.81 % 2.73 % 3.80 % 2.61 % Total cost of interest-bearing liabilities 0.31 % 0.31 % 0.27 % 0.31 % 0.28 % Spread (7) 3.97 % 3.94 % 3.68 % 3.98 % 3.65 % Net interest margin 4.06 % 4.03 % 3.75 % 4.06 % 3.73 % PER SHARE DATA Basic earnings per share (2) $ 0.07 $ 0.14 $ 0.09 $ 0.32 $ 0.24 Diluted earnings per share (3) 0.07 0.14 0.09 0.32 0.24 Book value per share (5) 5.18 5.18 4.86 5.18 4.86 Tangible book value per share (5) (non-GAAP) 3.93 3.93 3.72 3.93 3.72 Market price per share: High for the period $ 9.45 $ 8.48 $ 7.61 $ 9.45 $ 7.61 Low for the period 8.44 6.64 5.23 6.51 4.30 Close for period end 8.67 8.40 7.00 8.67 7.00 Cash dividends declared per share 0.0300 0.0225 0.0200 0.0750 0.0600 Average number of shares outstanding: Basic (2) 22,537,092 22,518,941 22,490,433 22,520,352 22,477,473 Diluted (3) 22,622,129 22,609,480 22,563,712 22,608,603 22,537,663\n(1) Amounts for the quarterly periods are annualized. (2) Amounts exclude ESOP shares not committed to be released. (3) Amounts exclude ESOP shares not committed to be released and include common stock equivalents. (4) Non-interest expense divided by net interest income and non-interest income. (5) Amounts calculated based on shareholders’ equity and include ESOP shares not committed to be released. (6) Net interest income divided by non-interest expense. (7) Yield on interest-earning assets less cost of funds on interest-bearing liabilities.\nContacts: Pat Sheaffer or Kevin Lycklama\nRiverview Bancorp, Inc. 360-693-6650\nSource:Riverview Bancorp Inc", "external_links": ["https://www.globenewswire.com/Tracker?data=xpioTxKq1_Am0epuAkb3nlvuyJNaTAAs_FDiO3yKJmH0vLBsj3V7xt5YuCjKqZQVs2ILNc9agXsT0wZZJBy7TwGd4OnmeDYxJcjLXEJFbDY=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/8781d6f6-5a94-4655-9dc7-bd7648171371"], "published": "2018-01-26T00:00:00.000+02:00", "crawled": "2018-01-26T03:01:32.002+02:00", "highlightTitle": ""}