{"organizations": [], "uuid": "946a0de0ce5746a219eb6abbf5c278c7ece62ce4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/16/the-associated-press-wave-of-lawsuits-filed-to-block-net-neutrality-repeal.html", "country": "US", "domain_rank": 767, "title": "Wave of lawsuits filed to block net-neutrality repeal", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T23:21:00.000+02:00", "replies_count": 0, "uuid": "946a0de0ce5746a219eb6abbf5c278c7ece62ce4"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/the-associated-press-wave-of-lawsuits-filed-to-block-net-neutrality-repeal.html", "ord_in_thread": 0, "title": "Wave of lawsuits filed to block net-neutrality repeal", "locations": [], "entities": {"persons": [{"name": "mozilla", "sentiment": "none"}, {"name": "eric schneiderman", "sentiment": "none"}, {"name": "ajit pai", "sentiment": "none"}, {"name": "brian hart", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "district of columbia", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "new america", "sentiment": "none"}], "organizations": [{"name": "federal communications commission", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "fcc", "sentiment": "none"}, {"name": "open technology institute", "sentiment": "none"}, {"name": "comcast", "sentiment": "none"}, {"name": "verizon", "sentiment": "none"}, {"name": "firefox", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (AP) — The expected wave of litigation against the Federal Communications Commission's repeal of net-neutrality rules has begun.\nA group of attorneys general for 21 states and the District of Columbia sued Tuesday to block the rules. So did Mozilla, the maker of the Firefox browser, public-interest group Free Press and New America's Open Technology Institute. Others may file suit as well, and a major tech-industry lobbying group has said it will support litigation.\nThe rules barred companies like AT&T, Comcast and Verizon from interfering with internet traffic and favoring their own sites and apps. FCC Chairman Ajit Pai's push to undo them inspired both street and online protests in defense of the Obama-era rules.\nNew York Attorney General Eric Schneiderman, who is leading the suit, said Tuesday that the end of the net neutrality rules would hurt consumers and businesses.\nFCC spokesman Brian Hart declined to comment on the litigation.\nThe lawsuits are part of a multi-pronged approach against the net-neutrality repeal. There are efforts by Democrats to undo the repeal in Congress. State lawmakers have also introduced bills to protect net neutrality in their own states. However, the FCC's order bars state laws from contradicting the federal government's approach. The FCC's new rules are not expected to go into effect until later this spring.\nTHE COURTS\nApart from New York, the other attorneys general participating in the lawsuit are from California, Connecticut, Delaware, Hawaii, Illinois, Iowa, Kentucky, Maine, Maryland, Massachusetts, Minnesota, Mississippi, New Mexico, North Carolina, Oregon, Pennsylvania, Rhode Island, Vermont, Virginia, Washington and the District of Columbia.\nThe New York attorney general says the FCC made \"arbitrary and capricious\" changes to existing policies and was unjustified in departing from the FCC's long-standing policy of defending net neutrality.\nThe legal challenge could face an uphill battle, however. Antitrust attorney David Balto says the courts have generally shown deference to agencies to set regulations as long as they provide adequate explanations. A court would likely judge that the FCC has the authority to class the internet as an \"information service\" and invalidate the prior rules, just as the Obama-era FCC had the authority to label internet service a telecommunications utility and regulate it more heavily.\nThe parties may have to file suit again after the FCC's order is published in the Federal Register. That hasn't happened yet. The different suits may also be consolidated.\nREPEAL IN CONGRESS\nDemocrats in the Senate will force a vote on a simple repeal of the FCC's repeal, using the same law, the Congressional Review Act, that Congress used to undo the Obama-era internet privacy rules . The vote probably won't happen for a few months.\nDemocrats need a least two Republican votes to pass a repeal in the Senate. Maine's Republican Sen. Susan Collins has already said she'll support it. But the resolution would probably run into difficulties in the House, where Republicans have a much bigger majority. And President Donald Trump seems likely to veto it. The White House has said it supports the FCC's efforts to roll back regulations.\nHowever, if net neutrality does become a campaign issue with young voters in the 2018 elections, as some Democrats hope, they could use Republicans' \"no\" votes on restoring net neutrality rules to their advantage.\nSTATE BILLS\nThe FCC order bars states and cities from imposing rules on broadband providers that contradict the FCC's plan. Lawmakers in a number of states are pursuing net-neutrality bills anyway.\nIn New York, a bill would bar the state from contracting with broadband companies that don't follow net-neutrality principles.\nIn California, one bill would forbid companies like AT&T, Comcast and Verizon from blocking, limiting or interfering with customers' internet service. Another is similar in its approach to the New York bill, predicating state contracts and local cable franchises to companies following net-neutrality policies.\nState lawmakers have also introduced bills in Missouri, Nebraska, New Jersey, Rhode Island, South Carolina and Washington, according to the National Conference of State Legislatures, which tracks state bills. A New Mexico state senator has said he will propose legislation.", "external_links": [], "published": "2018-01-16T23:21:00.000+02:00", "crawled": "2018-01-17T07:26:37.015+02:00", "highlightTitle": ""}