{"organizations": [], "uuid": "800134d1242e21460735f75c6b938c430eff424b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/9", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-sompo-international-announces-new-london-market-insurance-leadership-appointments.html", "country": "US", "domain_rank": 767, "title": "Sompo International Announces New London Market Insurance Leadership Appointments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-26T00:00:00.000+02:00", "replies_count": 0, "uuid": "800134d1242e21460735f75c6b938c430eff424b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-sompo-international-announces-new-london-market-insurance-leadership-appointments.html", "ord_in_thread": 0, "title": "Sompo International Announces New London Market Insurance Leadership Appointments", "locations": [], "entities": {"persons": [{"name": "ian keegan", "sentiment": "none"}, {"name": "paul ashworth", "sentiment": "none"}, {"name": "keegan", "sentiment": "none"}, {"name": "ashworth", "sentiment": "none"}], "locations": [{"name": "bermuda", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "sompo international announces new london market insurance leadership appointments pembroke", "sentiment": "negative"}, {"name": "sompo international", "sentiment": "negative"}, {"name": "london market insurance", "sentiment": "none"}, {"name": "hiscox", "sentiment": "none"}, {"name": "marine insurance", "sentiment": "none"}, {"name": "marine", "sentiment": "none"}, {"name": "head of london market aerospace, energy & marine", "sentiment": "none"}, {"name": "lloyd", "sentiment": "none"}, {"name": "faraday underwriting limited", "sentiment": "none"}, {"name": "hull & liability and cargo & specie marine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PEMBROKE, Bermuda, Sompo International, a Bermuda-based specialty provider of property and casualty insurance and reinsurance, announced today that Mr. Paul Ashworth has joined the company’s London Market Insurance platform as Head of Marine Insurance, managing a diverse portfolio, including Hull & Liability and Cargo & Specie Marine classes. Mr. Ashworth has built and managed Marine portfolios from both a carrier and broker perspective over his 30 year career in the London market, underwriting through both company and Lloyd’s syndicates.\nAt the same time, Mr. Ian Keegan has been promoted to the new role of Head of London Market Aerospace, Energy & Marine and will be a Deputy Active Underwriter for Sompo International’s Syndicate 5151. Mr. Keegan joined the company in April 2016 as Executive Vice President, Head of Aerospace in the London office where he established the company’s presence in the Aerospace market in London. Previously, he launched and managed similar aviation units at Hiscox and Faraday Underwriting Limited. Mr. Keegan reports to Mr. Richard Housley, CUO London Market Insurance and Active Underwriter of Syndicate 5151. Mr. Clifford Easton, Executive Vice President will continue to coordinate the Sompo International Marine & Energy business globally and will be taking on additional leadership responsibilities related to Japan Interest Account business in Europe.\nMr. Tom Houston has now been promoted to Head of Energy, London Market Insurance. Tom joined Sompo International in March 2014 as Senior Vice President, Energy with a focus on exploration and production and other upstream energy accounts. Previous experience includes Energy underwriting at Hiscox and Catlin’s London Syndicates.\nGraham Evans, CEO of London Market Insurance at Sompo International, commented, “With the addition of Paul to our business leadership and Ian and Tom’s new roles, we have a strong team in place to further expand our presence in these markets. Our specialty business in both the London market and Continental Europe continue to be a strategic growth area for Sompo International. With a broad range of products, talented underwriting teams and experienced and responsive claims servicing, we are confident that we can add significant value to our client base.”\nAbout Sompo International\nSompo International is a global specialty provider of property and casualty insurance and reinsurance, headquartered in Bermuda. Through its operating subsidiaries, Sompo International writes agriculture, professional lines, property, marine and energy, and casualty and other specialty lines of insurance and catastrophe, property, casualty, professional lines, weather risk and specialty lines of reinsurance. Sompo International companies are wholly owned subsidiaries of Sompo Holdings, Inc., whose core business encompasses one of the largest property and casualty insurance groups in the Japanese domestic market. We maintain excellent financial strength as evidenced by the ratings of A+ (Superior) from A.M. Best (XV size category), A (Strong) from Standard and Poor’s and A2 from Moody’s on our principal operating subsidiaries. Sompo International’s headquarters are located at Waterloo House, 100 Pitts Bay Road, Pembroke HM 08, Bermuda and its mailing address is Sompo International, Suite No. 784, No. 48 Par-la-Ville Road, Hamilton HM 11, Bermuda. For more information about Sompo International, please visit www.sompo-intl.com .\nContact\nInvestor Relations\nPhone: +1 441 278 0988\nEmail: investorrelations@sompo-intl.com\nSource:Sompo International", "external_links": ["https://www.globenewswire.com/Tracker?data=q5vn4yzgMwTp3nm2WkCJOzTNvJq0e_23YE-56OceBYf1aoOsBf4nyk7QApVrbzO23lcc1eISBWVwuO9ihvdFX9Qp5Q54Uq8zfLwgR8AWI0x6SVlRpGSlUUMSrT8QWiSwUIpOj4Ydu49Ve4T31FkBf0n94jT-gFr5m42o4SH-qQIumKRUMIzRqmcjwwqLsIcEsaE6Wgx16qMEgi7YZSCTPx4JoeDHQNGPxh_Jl_Z8FXVon-9LTTZxePrH-BLExpTk", "https://www.globenewswire.com/NewsRoom/AttachmentNg/80cc162e-bf95-4961-8462-1b4371030b4c"], "published": "2018-01-26T00:00:00.000+02:00", "crawled": "2018-01-26T02:59:03.001+02:00", "highlightTitle": ""}