{"organizations": [], "uuid": "b44e86aac4b822da8fe7def141230cd5b6cd9bc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/wh-smith-outlook/update-1-wh-smiths-sales-for-20-week-period-flat-idUSL4N1PJ2RY", "country": "US", "domain_rank": 408, "title": "UPDATE 2-WH Smith keeps faith with British high street despite sales slowdown", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:03:00.000+02:00", "replies_count": 0, "uuid": "b44e86aac4b822da8fe7def141230cd5b6cd9bc6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/wh-smith-outlook/update-1-wh-smiths-sales-for-20-week-period-flat-idUSL4N1PJ2RY", "ord_in_thread": 0, "title": "UPDATE 2-WH Smith keeps faith with British high street despite sales slowdown", "locations": [], "entities": {"persons": [{"name": "wh smith", "sentiment": "positive"}, {"name": "smith", "sentiment": "positive"}, {"name": "rahul b jan", "sentiment": "none"}, {"name": "clarke", "sentiment": "none"}, {"name": "stephen clarke", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* WH Smith looks to maintain high street presence\n* Travel business remains the strongest performer\n* Joke wears thin for spoof humour books (Recasts with CEO Quote: s, adds details)\nBy Rahul B\nJan 24 (Reuters) - The head of British stationer WH Smith said the company had no plans to close any high street stores after a slowdown in sales weighed on its performance over the past 20 weeks.\nThe problems on the high street contrast with a brighter outlook for the company’s travel business which sells items such as snacks and newspapers at locations including airports and railway stations at home and abroad.\n“If you look at the last 10 years, like-for-like sales have declined (at the high street) but our store count has stayed stubbornly consistent around 600 or so,” Chief Executive Stephen Clarke said on Wednesday, indicating the company did not intend to rethink its high street strategy.\n“We don’t manage our high street business for sales, we manage it for profit,” Clarke said adding that profit from the stores had held up despite lower sales.\nTotal sales for the 20 weeks to Jan. 20 were flat as gains made at the travel shops were offset by the high street business, pushing shares in the retailer down as much as 5 percent.\nComparable sales in its high street business fell 4 percent, caught up in a broader squeeze on consumer spending.\nSales were also hit by a sharp decline in demand for spoof humour titles in the books category -- a popular Christmas gift a year earlier. Many of these were written for adults in a style borrowed from an original series of children’s books.\n“So many people bought this (spoof books) as a present last year that people thought of it as last year’s gift,” Clarke said.\nComparable sales at the travel business were up 3 percent in the period, boosted by increasing demand for souvenir items such as miniature London buses, taxis and telephone booths.\nClarke added that the 225-year-old company has been increasing space for the souvenir category at its bigger stores at London’s Heathrow and Gatwick airports.\nThe company has been expanding its travel business internationally and added six units at airports in Rome. ($1 = 0.7130 pounds) (Reporting by Justin George Varghese and Rahul B in Bengaluru; Editing by Sunil Nair and Keith Weir)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T16:03:00.000+02:00", "crawled": "2018-01-25T13:19:44.000+02:00", "highlightTitle": ""}