{"organizations": [], "uuid": "eba262c1da3470c15a9973ad2372f57cc2014347", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-norway-fur/norway-to-ban-fur-farms-as-fox-mink-go-out-of-fashion-idUKKBN1F427J", "country": "US", "domain_rank": 408, "title": "Norway to ban fur farms as fox, mink go out of fashion", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T18:55:00.000+02:00", "replies_count": 0, "uuid": "eba262c1da3470c15a9973ad2372f57cc2014347"}, "author": "", "url": "https://uk.reuters.com/article/uk-norway-fur/norway-to-ban-fur-farms-as-fox-mink-go-out-of-fashion-idUKKBN1F427J", "ord_in_thread": 0, "title": "Norway to ban fur farms as fox, mink go out of fashion", "locations": [], "entities": {"persons": [{"name": "erna solberg", "sentiment": "none"}, {"name": "guri wormdahl", "sentiment": "none"}, {"name": "alister doyle", "sentiment": "none"}, {"name": "noah", "sentiment": "none"}], "locations": [{"name": "norway", "sentiment": "none"}], "organizations": [{"name": "fur breeders association", "sentiment": "none"}, {"name": "min read  oslo", "sentiment": "none"}, {"name": "liberal party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 5:00 PM / Updated an hour ago Norway to ban fur farms as fox, mink go out of fashion Alister Doyle 3 Min Read \nOSLO (Reuters) - A plan by Norway’s government to phase out fur farms by 2025 dismayed producers and delighted animal rights activists on Monday as a sign that fur is out of fashion even in a nation that was once the world’s top producer of fox pelts. \nConservative Prime Minister Erna Solberg’s government agreed to shut fox and mink farms that produce about one million pelts a year as part of a deal on Sunday to broaden her two two-party minority government by adding the anti-fur Liberal Party. \n“We’re shocked, shaken to the core,” said Guri Wormdahl of the Norwegian Fur Breeders Association. \nShe said there are about 200 fur farms in Norway employing about 400 people under strict rules for animal welfare with annual turnover of between 350 million to 500 million Norwegian crowns (45.95 million pounds). \nAnimal rights group Noah hailed the decision as part of a shift against what it views as an outdated and cruel business with dwindling appeal to fashion-conscious consumers. \n“We’re very pleased,” Noah leader Siri Martinsen said, adding the plan seemed sure of majority support in Norway’s parliament. \nFox farming peaked in Norway in 1939, just before World War Two, when the Nordic nation was the biggest world producer with almost 20,000 farms, according to a government report. \nIn 2013, by contrast, Norway produced only about three percent of 7.3 million fox furs worldwide in a market dominated by China, with 69 percent, and Finland, it said. \nThat same year, Norway produced one percent of world mink output of 72.6 million, a market also dominated by China. \n“It’s not a very lucrative business in Norway,” said Sveinung Fjose, of Menon Business Economics and an expert on fur farms. “It wouldn’t harm the Norwegian economy severely” to close it down. \nHumane Society International, which campaigns against the fur trade, said in a statement that Norway was the 14th European nation to phase out fur farming “sparing animals who would otherwise spend their entire lives in cramped, barren cages”. \nLast year, Italy’s Gucci said it would stop using fur in its designs, joining a growing number of fashion houses looking at alternatives after coming under pressure from animal rights activists and changing consumer tastes. Editing by Richard Balmforth", "external_links": [], "published": "2018-01-15T18:55:00.000+02:00", "crawled": "2018-01-15T19:19:36.077+02:00", "highlightTitle": ""}