{"organizations": [], "uuid": "0ab1bdb55eed8b398dc676cba86e1b183932cce9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-the-mosaic-company-announces-senior-leadership-change.html", "country": "US", "domain_rank": 767, "title": "The Mosaic Company Announces Senior Leadership Change", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-31T16:00:00.000+02:00", "replies_count": 0, "uuid": "0ab1bdb55eed8b398dc676cba86e1b183932cce9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-the-mosaic-company-announces-senior-leadership-change.html", "ord_in_thread": 0, "title": "The Mosaic Company Announces Senior Leadership Change", "locations": [], "entities": {"persons": [{"name": "rich mack wil", "sentiment": "negative"}, {"name": "tony", "sentiment": "none"}, {"name": "brausen", "sentiment": "none"}, {"name": "joc o’rourke", "sentiment": "none"}, {"name": "anthony t. “tony", "sentiment": "none"}, {"name": "rich", "sentiment": "none"}], "locations": [{"name": "plymouth", "sentiment": "none"}, {"name": "minn.", "sentiment": "none"}], "organizations": [{"name": "mosaic company", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "vale fertilizantes", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "cargill", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PLYMOUTH, Minn.--(BUSINESS WIRE)-- The Mosaic Company (NYSE: MOS) announced today that Rich Mack will step down from his position as Executive Vice President and Chief Financial Officer, and leave the company in May of 2018.\nAnthony T. “Tony” Brausen will serve as Senior Vice President – Finance and interim CFO, effective immediately, until the position is filled permanently. He will also serve as the Company’s designated principal accounting officer. Tony has led Mosaic’s accounting, financial analysis and reporting, treasury, tax, information technology and business unit finance teams.\n“On behalf of Mosaic’s Board of Directors and our Senior Leadership Team, I would like to thank Rich for his 24 years of dedicated service and his contribution to many aspects of the company, from his Cargill years prior to Mosaic’s formation through the very promising Vale Fertilizantes acquisition,” said Joc O’Rourke, President and CEO. “Rich advanced many strategic initiatives for Mosaic and conducted himself and led the CFO organization with the highest ethical standards and integrity. Rich has a broad network and is well respected at Mosaic and by outside constituents. We wish him all the best in his future endeavors.\n“We are pleased to have Tony serve as interim CFO, and he will continue in an advisory capacity to the permanent CFO.\n“Rich has agreed to continue to provide leadership and oversight of Mosaic’s investment in Streamsong Resort® through 2019, as an employee through May 2018 and then pursuant to a management services agreement. During this period, Rich will continue to focus on the ramp up of the resort to its full potential. Rich was the vision and driving force behind this innovative investment, an investment that has grown from an idea to a world-renowned golf destination and resort. Rich’s passion and commitment to Streamsong will bring continuity and success to the resort.”\nAbout The Mosaic Company\nThe Mosaic Company is one of the world's leading producers and marketers of concentrated phosphate and potash crop nutrients. Mosaic is a single source provider of phosphates and potash fertilizers and feed ingredients for the global agriculture industry. More information on the company is available at www.mosaicco.com .\nThis release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about the anticipated benefits and synergies of our acquisition of the global phosphate and potash operations of Vale S.A. conducted through Vale Fertilizantes S.A. (now known as Mosaic Fertilizantes P&K S.A.) (the “Transaction”), other proposed or pending future transactions or strategic plans and other statements about future financial and operating results. Such statements are based upon the current beliefs and expectations of The Mosaic Company’s management and are subject to significant risks and uncertainties. These risks and uncertainties include, but are not limited to: difficulties with realization of the benefits and synergies of the Transaction, including the risks that the acquired business may not be integrated successfully or that the anticipated synergies or cost or capital expenditure savings from the Transaction may not be fully realized or may take longer to realize than expected, including because of political and economic instability in Brazil or changes in government policy in Brazil; the predictability and volatility of, and customer expectations about, agriculture, fertilizer, raw material, energy and transportation markets that are subject to competitive and other pressures and economic and credit market conditions; the level of inventories in the distribution channels for crop nutrients; the effect of future product innovations or development of new technologies on demand for our products; changes in foreign currency and exchange rates; international trade risks and other risks associated with Mosaic’s international operations and those of joint ventures in which Mosaic participates, including the performance of the Wa’ad Al Shamal Phosphate Company (also known as MWSPC), the ability of MWSPC to obtain additional planned funding in acceptable amounts and upon acceptable terms, the timely development and commencement of operations of production facilities in the Kingdom of Saudi Arabia, and the future success of current plans for MWSPC and any future changes in those plans; the risk that protests against natural resource companies in Peru extend to or impact the Miski Mayo mine, which is operated by an entity in which we are the majority owner; difficulties with realization of the benefits of our long term natural gas based pricing ammonia supply agreement with CF Industries, Inc., including the risk that the cost savings initially anticipated from the agreement may not be fully realized over its term or that the price of natural gas or ammonia during the term are at levels at which the pricing is disadvantageous to Mosaic; customer defaults; the effects of Mosaic’s decisions to exit business operations or locations; changes in government policy; changes in environmental and other governmental regulation, including expansion of the types and extent of water resources regulated under federal law, carbon taxes or other greenhouse gas regulation, implementation of numeric water quality standards for the discharge of nutrients into Florida waterways or efforts to reduce the flow of excess nutrients into the Mississippi River basin, the Gulf of Mexico or elsewhere; further developments in judicial or administrative proceedings, or complaints that Mosaic’s operations are adversely impacting nearby farms, business operations or properties; difficulties or delays in receiving, increased costs of or challenges to necessary governmental permits or approvals or increased financial assurance requirements; resolution of global tax audit activity; the effectiveness of Mosaic’s processes for managing its strategic priorities; adverse weather conditions affecting operations in Central Florida, the Mississippi River basin, the Gulf Coast of the United States, Canada or Brazil, and including potential hurricanes, excess heat, cold, snow, rainfall or drought; actual costs of various items differing from management’s current estimates, including, among others, asset retirement, environmental remediation, reclamation or other environmental regulation, Canadian resources taxes and royalties, or the costs of the MWSPC, its existing or future funding and Mosaic’s commitments in support of such funding; reduction of Mosaic’s available cash and liquidity, and increased leverage, due to its use of cash and/or available debt capacity to fund financial assurance requirements and strategic investments; brine inflows at Mosaic’s Esterhazy, Saskatchewan, potash mine or other potash shaft mines; other accidents and disruptions involving Mosaic’s operations, including potential mine fires, floods, explosions, seismic events, sinkholes or releases of hazardous or volatile chemicals; and risks associated with cyber security, including reputational loss; as well as other risks and uncertainties reported from time to time in The Mosaic Company’s reports filed with the Securities and Exchange Commission. Actual results may differ from those set forth in the forward-looking statements.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005248/en/\nThe Mosaic Company\nMedia\nBen Pratt, 763-577-6102\nben.pratt@mosaicco.com\nor\nInvestors\nLaura Gagnon, 763-577-8213\ninvestor@mosaicco.com\nSource: The Mosaic Company", "external_links": ["http://www.businesswire.com/news/home/20180131005248/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mosaicco.com&esheet=51751217&newsitemid=20180131005248&lan=en-US&anchor=www.mosaicco.com&index=1&md5=1fa411008534d9444884fba5a30f8e11"], "published": "2018-01-31T16:00:00.000+02:00", "crawled": "2018-01-31T15:55:37.004+02:00", "highlightTitle": ""}