{"organizations": [], "uuid": "e7db0a8143d79c32d746c108125097caca42f696", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222221857&w=1200&r=LYNXMPEE0E1DW", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-canada-rigging/lawsuit-in-u-s-accuses-nine-banks-of-rigging-canadian-rate-benchmark-idUSKBN1F42IN", "country": "US", "domain_rank": 408, "title": "Lawsuit in U.S. accuses nine banks of rigging Canadian rate benchmark", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T21:31:00.000+02:00", "replies_count": 0, "uuid": "e7db0a8143d79c32d746c108125097caca42f696"}, "author": "", "url": "https://www.reuters.com/article/us-canada-rigging/lawsuit-in-u-s-accuses-nine-banks-of-rigging-canadian-rate-benchmark-idUSKBN1F42IN", "ord_in_thread": 0, "title": "Lawsuit in U.S. accuses nine banks of rigging Canadian rate benchmark", "locations": [], "entities": {"persons": [{"name": "jonathan stempel", "sentiment": "none"}, {"name": "matt scuffham", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "bank of nova scotia", "sentiment": "none"}, {"name": "fire & police pension association of colorado", "sentiment": "none"}, {"name": "royal bank of canada", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "district court", "sentiment": "none"}, {"name": "toronto-dominion bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK/TORONTO (Reuters) - Nine large banks, including six from Canada, have been accused in a lawsuit of conspiring to rig a Canadian rate benchmark to improve profits from derivatives trading.\nThe complaint, filed by a Colorado pension fund in U.S. District Court in Manhattan late on Friday, accused Royal Bank of Canada ( RY.TO ), Toronto-Dominion Bank ( TD.TO ), Bank of Nova Scotia ( BNS.TO ) and the other banks of suppressing the Canadian Dealer Offered Rate (CDOR) from Aug. 9, 2007, to June 30, 2014.\nAccording to the Fire & Police Pension Association of Colorado, the banks hoped to reduce interest they would owe investors on CDOR-based derivatives transactions in the United States, including swaps and Canadian dollar futures contracts, and generate potentially billions of dollars of improper profit.\nThe fund is seeking unspecified damages for investors in the proposed class action for alleged violations of U.S. antitrust, commodity and anti-racketeering laws over the nearly seven-year period.\nOther defendants include Bank of Montreal ( BMO.TO ), Canadian Imperial Bank of Commerce ( CM.TO ), National Bank of Canada ( NA.TO ), Bank of America Corp ( BAC.N ), Deutsche Bank AG ( DBKGn.DE ) and HSBC Holdings Plc ( HSBA.L ).\nEight of the banks declined to comment on Monday. The ninth, Bank of Montreal, did not respond to requests for comment.\nCDOR is a rate at which banks will lend to corporate clients using bankers’ acceptances, a short-term credit instrument. It is now known as the Canadian Dollar Offered Rate, and calculated daily by Thomson Reuters based on rate submissions from banks.\nCanadian regulators updated the CDOR-setting process after the Investment Industry Regulatory Organization of Canada in January 2013 identified the “potential” for manipulation.\nThat came after regulators worldwide began accusing, and eventually fined, many banks for manipulating the London Interbank Offered Rate and other benchmarks.\nAccording to Friday’s complaint, the Colorado fund conducted more than $1.2 billion of CDOR-based derivatives transactions, including with seven defendants, during the alleged conspiracy.\nThe fund said banks coordinated false CDOR submissions after their CDOR-based derivatives portfolios, on which they made interest payments, had grown far larger than their CDOR-based loan portfolios, on which they collected interest.\nIt said the conspiracy was intended in part to address this imbalance, and included a 151-day stretch when four banks made identical submissions.\nThe federal court in Manhattan is home to a wide variety of private litigation accusing banks of conspiring to rig rate benchmarks, markets such as U.S. Treasuries, and prices for commodities such as gold and silver.\nOne case, over alleged currency manipulation, led to agreements by 15 banks to pay out $2.31 billion.\nThe case is Fire & Police Pension Association of Colorado v Bank of Montreal et al, U.S. District Court, Southern District of New York, No. 18-00342.\nReporting by Jonathan Stempel in New York and Matt Scuffham in Toronto; Editing by Leslie Adler\n ", "external_links": [], "published": "2018-01-15T21:31:00.000+02:00", "crawled": "2018-01-15T21:52:07.000+02:00", "highlightTitle": ""}