{"organizations": [], "uuid": "148b02c18bea17d24f60baf36eb641f45ad6fcd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-nonprofit-accounting-industry-expert-retires.html", "country": "US", "domain_rank": 767, "title": "Nonprofit Accounting Industry Expert Retires", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:45:00.000+02:00", "replies_count": 0, "uuid": "148b02c18bea17d24f60baf36eb641f45ad6fcd2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-nonprofit-accounting-industry-expert-retires.html", "ord_in_thread": 0, "title": "Nonprofit Accounting Industry Expert Retires", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEEDHAM, Mass., Jan. 31, 2018 /PRNewswire/ -- After 16+ years at AccuFund's helm, Peter Stam retires, effective January 31, 2018. Peter will continue to be involved at a strategic planning level. Gordon Holfelder has assumed the role of President after serving as Vice President since the company's inception. Ian Scotland is named Vice President and General Manager.\nSince 2001, AccuFund has provided nonprofits and government agencies with state-of-the-art financial software, helping clients grow and improve their overall financial management. \"It's been an honor working closely with so many wonderful clients over the years. I've enjoyed getting to know our clients, their business, and helping them build financial solutions that contribute to their community's success, \"explains Peter Stam, \"I take great pride in knowing we have built a strong business that will continue helping our clients serve their communities.\" In retirement, Peter looks forward to spending more time with family and friends, enjoying time on Martha's Vineyard, and traveling.\nAs news spread throughout the nonprofit sector, industry leaders offered their congratulations. Paul Clolery, Vice President/Editorial Director at The Nonprofit Times shared, \"Peter was always one of the more thoughtful executives to whom I turned, even on topics that did not involve accounting software. He had a sense of where the marketplace was going based not only on his own sales but also on what he was learning from customers and others in the industry.\"\nAmy DeVita, COO at TopNonprofits added, \"Peter Stam has always inspired me with his incredible spirit and commitment to the nonprofit sector. I've particularly been impressed with his passion for providing the nonprofit sector with an accounting solution they can rely on, allowing them to really focus time and efforts on their actual mission. I wish him the best in his retirement.\"\n\"The nonprofit world is crowded with brilliant advocates and leaders. AccuFund co-founder Peter Stam is among the best and the brightest. He maintained unwavering, committed focus on the critical financial accounting needs of nonprofits. And, he and his team delivered nonprofit accounting solutions that made Finance Directors heroes and Executive Directors better able to advance the mission,\" offered Dawn Westerberg, President of Dawn Westerberg Consulting LLC.\nGordon Holfelder, President of AccuFund provides additional sentiments, resonating among those familiar with Peter's impact on the nonprofit and government industry, \"Over the course of sixteen years as AccuFund's President and CEO, Peter has been instrumental in establishing our company as a leader in accounting software solutions to the nonprofit and municipal markets. Best wishes, Peter, for an active and rewarding retirement.\"\nAbout AccuFund\nAccuFund, Inc. is a nonprofit financial improvement systems specialist. AccuFund uses award-winning financial software, consulting services and industry best practices to help organizations streamline processes, improve efficiency and lower costs. Their nonprofit financial solutions are available on-premise or cloud-based.\nAccuFund provides scalable accounting software systems to nonprofit organizations and government agencies. AccuFund's products are available exclusively through Value Added Resellers (VARs) located throughout the United States. The VARs provide AccuFund's customers with cost-effective onsite training and installation assistance.\nFor more information, call 877-872-2228 ext. 231, email kristenf@accufund.com or visit www.accufund.com .\nContact:\nKristen Faiola, Marketing & Media\nAccuFund, Inc.\n400 Hillside Ave.\nNeedham, MA 02494\nPhone: 781-433-0233 ext. 231 Fax: 781-453-0460\n189632@email4pr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/nonprofit-accounting-industry-expert-retires-300590435.html\nSOURCE AccuFund, Inc.", "external_links": ["http://www.accufund.com/", "http://www.prnewswire.com/news-releases/nonprofit-accounting-industry-expert-retires-300590435.html"], "published": "2018-01-31T16:45:00.000+02:00", "crawled": "2018-01-31T18:35:25.009+02:00", "highlightTitle": ""}