{"organizations": [], "uuid": "8b83e7299d0b724eec17b3ae6230907dbe2ba5bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 501, "shares": 501, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225082944&w=1200&r=LYNXMPEE0O0FM", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-usa-vietnam-mattis-carrier/u-s-aircraft-carrier-to-visit-vietnam-in-march-defense-ministry-idUSKBN1FE0XI", "country": "US", "domain_rank": 408, "title": "U.S. aircraft carrier to visit Vietnam in March: defense ministry", "performance_score": 5, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T11:05:00.000+02:00", "replies_count": 0, "uuid": "8b83e7299d0b724eec17b3ae6230907dbe2ba5bb"}, "author": "", "url": "https://www.reuters.com/article/us-usa-vietnam-mattis-carrier/u-s-aircraft-carrier-to-visit-vietnam-in-march-defense-ministry-idUSKBN1FE0XI", "ord_in_thread": 0, "title": "U.S. aircraft carrier to visit Vietnam in March: defense ministry", "locations": [], "entities": {"persons": [{"name": "jacqueline wong", "sentiment": "none"}, {"name": "phil stewart", "sentiment": "none"}, {"name": "james pearson", "sentiment": "none"}, {"name": "jim mattis", "sentiment": "none"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "northeast asia", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "south china sea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "hanoi", "sentiment": "none"}, {"name": "hanoi", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "u.s. defense", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HANOI (Reuters) - In a post-war first, the United States is poised to send an aircraft carrier to Vietnam in March, officials of both sides said on Thursday, dramatic evidence of deepening military ties between them, more than four decades after the Vietnam War.\nThe announcement came during a two-day visit to Hanoi by U.S. Defense Secretary Jim Mattis that had been expected to focus on shared concerns about China.\nThe proposed visit is set for March at the central port of Danang, Vietnam’s defence ministry said in a statement. Such a visit by a U.S. aircraft carrier could bring the most U.S. forces to Vietnam since the conflict ended in 1975.\nMattis cheered the planned port visit during talks with Nguyen Phu Trong, the general secretary of the ruling Communist Party of Vietnam.\n“Thank you for the increasing partnership, with our aircraft carrier coming into Danang here in March,” Mattis said.\nCaptain Jeff Davis, a Pentagon spokesman, confirmed the carrier visit was discussed by Mattis and Defence Minister Ngo Xuan Lich, and Vietnam’s defence ministry was seeking final approvals from national leaders.\n“We expect it will be approved,” Davis said.\nThe arrival of a U.S. aircraft carrier in Vietnam will be welcomed by an emerging network of countries that are nervously eyeing China’s military rise, particularly its assertive stance and island-building activities in the South China Sea.\nThe busy waterway is a vital global trade route linking Northeast Asia with the Middle East and Europe.\nIn particular, the militaries of U.S., Japan, India and Australia are working more closely together as a “quad” of liberal democracies across what they now term the “Indo-Pacific” – moves driven by mistrust of China.\nU.S. Pacific Commander Admiral Harry Harris last week described China as a “disruptive transitional force in the Indo-Pacific” after meetings with Japanese and Indian military leaders in New Delhi.\nIndia, Japan and Australia have all boosted military relations with Vietnam in recent years, with New Delhi providing advanced training for its emerging submarine forces and jet fighter pilots.\nBACKROOM DIPLOMACY\nU.S. Secretary of Defense Jim Mattis (R) and Vietnam's Defence Minister Ngo Xuan Lich review the guard of honour during a welcoming ceremony in Hanoi, Vietnam January 25, 2018. REUTERS/Kham Thursday’s confirmation of the U.S. aircraft carrier visit to Danang caps months of backroom military diplomacy between Hanoi and the Pentagon, diplomats said.\nThe prospect surfaced when U.S. President Donald Trump met Vietnamese Prime Minister Nguyen Xuan Phuc at the White House last May, and talks continued when Vietnamese Defence Minister Ngo Xuan Lich met Mattis in Washington in August.\nVietnam’s Deputy Defence Minister Nguyen Chi Vinh became the country’s highest-ranking official to tour a U.S. carrier when he led 11 Vietnamese officials to watch flight operations aboard the USS Carl Vinson off southern California last October, the U.S. Navy said at the time.\nAlthough no U.S. aircraft carrier has been to Vietnam since the end of the war, other, smaller U.S. warships have made high-level visits as ties improved in recent years.\nThat includes a 2016 visit by submarine tender USS Frank Cable and guided-missile destroyer USS John S. McCain to Cam Ranh Bay, which was a crucial logistics complex during the Vietnam War.\nSlideshow (4 Images) The planned carrier visit was “highly significant”, said Ian Storey, a South China Sea expert at the ISEAS Yusof Ishak Institute in Singapore.\n“It is a potent symbol of the way the defence relationship has moved forward against the backdrop of China’s rising power,” Storey added.\nDecades after the U.S. war in Vietnam, ties between the United States and the Communist-ruled state are increasingly seen through shared concern over China’s aggressive behaviour in the South China Sea, through which more than $3 trillion in cargo passes every year.\nVietnam has emerged as the most vocal opponent of China’s territorial claims and has been buying U.S. military hardware, such as an armed, Hamilton-class Coast Guard cutter.\nThe ship, one U.S. official said, was larger than anything Vietnam had in its navy.\n“(Vietnam) does have one of the region’s fastest growing economies and so freedom of navigation and access in the South China Sea will be critical to them economically and of course in their security efforts,” Mattis said before arrival on Wednesday.\nU.S. ties with Vietnam have developed significantly in the decades since they normalised ties in 1995. Still, there were vivid reminders of the history of conflict during Mattis’ visit.\nThat included a stop by Mattis on Tuesday to a U.S. Defense Department office in Hanoi that seeks to recover the remains of U.S. troops killed in the conflict.\nAbout 1,293 U.S. military personnel are still unaccounted for, a U.S. official said.\nAdditional reporting by Mai Nguyen in HANOI and Greg Torode in HONG KONG; Editing by Jacqueline Wong and Clarence Fernandez\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-25T11:05:00.000+02:00", "crawled": "2018-01-25T11:17:33.000+02:00", "highlightTitle": ""}