{"organizations": [], "uuid": "99dd3cd521510297fcf7c3ac840ed0a4b241b705", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224566078&w=1200&r=LYNXMPEE0M1OY", "site_section": "https://www.reuters.com/subjects/middle-east", "section_title": "Middle East Insight", "url": "https://www.reuters.com/article/us-davos-meeting-trudeau/at-davos-canadas-trudeau-speaks-up-on-womens-rights-idUSKBN1FC2PX", "country": "US", "domain_rank": 408, "title": "At Davos, Canada's Trudeau speaks up on women's rights", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-24T03:19:00.000+02:00", "replies_count": 0, "uuid": "99dd3cd521510297fcf7c3ac840ed0a4b241b705"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-meeting-trudeau/at-davos-canadas-trudeau-speaks-up-on-womens-rights-idUSKBN1FC2PX", "ord_in_thread": 0, "title": "At Davos, Canada's Trudeau speaks up on women's rights", "locations": [], "entities": {"persons": [{"name": "justin trudeau", "sentiment": "negative"}, {"name": "trudeau", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "group of seven", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland (Reuters) - Canadian Prime Minister Justin Trudeau gave a passionate defense of gender and social equality in Davos on Tuesday, days before U.S. President Donald Trump was due to take the stage at a forum traditionally seen as an enclave of the global elite.\nTrudeau, whose country has the presidency of the Group of Seven industrialized nations this year, said gender equality would be a priority in “everything the G7 does this year”.\nTrudeau, who appointed a cabinet with an equal number of women and men on taking power in 2015, also referenced social media campaigns against sexual harassment and misconduct and women’s marches in several U.S. cities last weekend in which speakers blasted Trump for policies they said had hurt women.\n“MeToo, TimesUp, the Women’s March, these movements tell us that we need to have a critical discussion on women’s rights, equality and power dynamics of gender,” said Trudeau.\nThe movements sprang up after a string of scandals involving powerful men in Hollywood, Washington and elsewhere.\n“Sexual harassment for example, in business and in government, is a systemic problem and it is unacceptable. As leaders we need to recognize and to act to show that truly time is up,” he said.\nCanada's Prime Minister Justin Trudeau speaks during the World Economic Forum (WEF) annual meeting in Davos, Switzerland January 23, 2018 REUTERS/Denis Balibouse Over the past two years, more than a dozen women have accused Trump of making unwanted sexual advances against them years before he entered politics. Trump has denied the accusations, and the White House has accused the women of lying.\nSince the 2016 presidential campaign, Trump has had sharply lower approval ratings among women than among men. A Pew Research Center poll in May showed 46 percent of men approving of Trump’s job performance, while only a third of women did.\nSlideshow (2 Images) Trudeau also called on global leaders to not forget “the people who aren’t here in Davos and never will be”.\n“The people in this room are immensely privileged. We owe it to society to use this privilege for good. We should ask ourselves: do we want to live in a world where the wealthy hide in their gated enclaves while those around them struggle or do we want to create a world grounded in the notion of fairness.”\nIn his speech on Friday, Trump is expected to urge investors to take advantage of his deregulatory and tax cut policies, which his Democrat opponents describe as a giveaway to the wealthy which will widen the income gap between rich and poor.\nTrump signed sweeping tax legislation into law last year, in a bill that slashes taxes for corporation and the wealthy while giving mixed, temporary tax relief to middle-class Americans.\nWriting by Yara Bayoumy; Editing by Mark Bendeich\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T03:19:00.000+02:00", "crawled": "2018-01-24T08:27:10.000+02:00", "highlightTitle": ""}