{"organizations": [], "uuid": "0cfec0631f0a956c43b5a219a51375e8de0f0cd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-george-industries-acquires-numerical-precision.html", "country": "US", "domain_rank": 767, "title": "George Industries Acquires Numerical Precision", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:00:00.000+02:00", "replies_count": 0, "uuid": "0cfec0631f0a956c43b5a219a51375e8de0f0cd9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-george-industries-acquires-numerical-precision.html", "ord_in_thread": 0, "title": "George Industries Acquires Numerical Precision", "locations": [], "entities": {"persons": [{"name": "shankar kiru", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "endicott", "sentiment": "none"}, {"name": "il", "sentiment": "none"}], "organizations": [{"name": "george industries llc", "sentiment": "negative"}, {"name": "np", "sentiment": "none"}, {"name": "george industries", "sentiment": "none"}, {"name": "orangewood partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ENDICOTT, N.Y.--(BUSINESS WIRE)-- George Industries LLC (\"George\"), a leading designer and manufacturer of engineered aerospace, defense and industrial components and portfolio company of Orangewood Partners (\"Orangewood\"), today announced it has acquired the assets of Numerical Precision (\"NP\") from QCC, LLC (“QCC”). The acquisition of NP enhances George Industries' engineering and machining capabilities including complex geometry and exotic material machining.\nBased in Wheeling, IL, NP has a 50 year history of manufacturing close-tolerance, high reliability components for satellites, aircraft and other aerospace and defense programs. NP will operate as a division of George, continuing its focus on engineering and machining excellence. NP’s management team and employees will all continue with the company going forward.\nShankar Kiru, CEO of George Industries, stated, \"The acquisition of Numerical Precision represents an important step for the business as we continue to execute on our strategic plan to grow both organically and through acquisition to better service our customers. NP’s expertise in complex machining, including 5-axis, wire and sinker EDM and large turning capabilities complement George’s core capabilities in brazing and support services. As a combined company, we have an even stronger position as a leading full-service provider for our growing customer base.”\nRon Rygiel, Vice President and General Manager of Numerical Precision, said, \"This is an exciting day for Numerical Precision and our talented employees. We look forward to working closely with Shankar Kiru and the George Industries team to deliver world-class service while maintaining our tradition of uncompromising quality. I am delighted to continue with NP and help the overall sales growth in this very important aerospace and defense industry. \"\nAlan Goldfarb, Founder and Managing Partner of Orangewood added, “We enjoyed working with QCC on this transaction and are thrilled to welcome Numerical Precision and its great team to George Industries. NP shares George’s culture of commitment to quality and customer service and is a fantastic complement to George as we continue to build our growing customer base and capabilities.”\nHonigman Miller Schwartz and Cohn LLP served as legal advisor to George Industries.\nAbout George Industries\nGeorge Industries is a recognized leader in the design, development and manufacture of mission critical engineered components for the aerospace, defense, transportation and industrial sectors. Core manufacturing capabilities include dip brazing, vacuum brazing, CNC machining, fabricating, welding, painting, artwork, photography, silk screening, laser cutting and mechanical assembly. George Industries was founded in 1954 and proudly remains headquartered in Endicott, NY. For more information, please visit www.georgeindustries.com .\nAbout Numerical Precision\nNumerical Precision, headquartered in Wheeling, IL, is a highly respected brand of fifty years, manufacturing close-tolerance, high-reliability components for satellites, aircraft and defense programs. Core engineering and machining capabilities include extreme tolerance, complex geometry and exotic material machining, EDM and assembly. For more information, please visit www.numericalprecision.com .\nAbout Orangewood\nOrangewood Partners (“Orangewood”) is a New York-based private investment firm that pursues equity and credit investments in both public and private companies. Orangewood takes a long-term approach and invests in companies with great management teams and sustainable growth characteristics. The firm seeks to partner with businesses to help provide them the additional capital, resources, and operational capabilities and expertise to generate long-term performance. Orangewood was founded in 2015 by Alan Goldfarb, former Managing Director of Special Situations at Senator Investment Group and former Principal at The Carlyle Group. For more information, please visit www.orangewoodpartners.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005330/en/\nMedia:\nGasthalter & Co.\nJonathan Gasthalter/Nathaniel Garnick, 212-257-4170\nSource: George Industries LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.numericalprecision.com&esheet=51744310&newsitemid=20180117005330&lan=en-US&anchor=www.numericalprecision.com&index=2&md5=fe3d7341caec3c2ad395fc0adfccae32", "http://www.businesswire.com/news/home/20180117005330/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.georgeindustries.com&esheet=51744310&newsitemid=20180117005330&lan=en-US&anchor=www.georgeindustries.com&index=1&md5=5714c4ec5d82d582eec3cc640e127b8f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.orangewoodpartners.com&esheet=51744310&newsitemid=20180117005330&lan=en-US&anchor=www.orangewoodpartners.com&index=3&md5=3ab76469177b80fe252d5c2edf771f18"], "published": "2018-01-17T16:00:00.000+02:00", "crawled": "2018-01-17T16:46:18.003+02:00", "highlightTitle": ""}