{"organizations": [], "uuid": "b395ee494b5dac5d1b550dc0f124457153acfb8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224046047&w=1200&r=LYNXMPEE0L09X", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-kerber/tennis-kerber-ends-hsiehs-fairytale-run-to-reach-quarters-idUKKBN1FB0E8", "country": "US", "domain_rank": 408, "title": "Tennis-Kerber ends Hsieh's fairytale run to reach quarters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T06:23:00.000+02:00", "replies_count": 0, "uuid": "b395ee494b5dac5d1b550dc0f124457153acfb8f"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-kerber/tennis-kerber-ends-hsiehs-fairytale-run-to-reach-quarters-idUKKBN1FB0E8", "ord_in_thread": 0, "title": "Tennis-Kerber ends Hsieh's fairytale run to reach quarters", "locations": [], "entities": {"persons": [{"name": "ian ransom", "sentiment": "negative"}, {"name": "hsieh", "sentiment": "negative"}, {"name": "angelique kerber", "sentiment": "none"}, {"name": "hsieh su-wei", "sentiment": "none"}, {"name": "peter rutherford", "sentiment": "none"}], "locations": [{"name": "rod laver arena", "sentiment": "none"}], "organizations": [{"name": "american madison keys", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 4:47 AM / Updated 11 minutes ago Kerber back in quarter-finals club after tough year Ian Ransom 3 Min   Former champion Angelique Kerber was driven to distraction by the unorthodox game of world number 88 Hsieh Su-wei but overhauled the Taiwanese battler 4-6 7-5 6-2   on Monday. \nThe German 21st seed was being tied up in knots by double-sided Hsieh’s angles and slices before her raw power prevailed at a sunbathed Rod Laver Arena. \nThe 2016 champion’s next opponent may be far more to her liking than Hsieh, whose dazzling marksmanship left Kerber shrieking in frustration throughout much of the two-hour and eight-minute clash. \nU.S. Open finalist Madison Keys, a fellow baseline basher, has never taken a set off Kerber in five hardcourt encounters. \nKerber was barely able to win three matches on the bounce through a dismal 2017 but has now strung together nine in a row in a dramatic return to form under the stewardship of new coach Wim Fissette. \nShe returns to the quarter-finals of a grand slam for the first time since her run to the 2016 U.S. Open title and audacious heist of Serena Williams’s world number one ranking. \n“You know, it’s great to being back in the quarters again,” the 30-year-old told reporters. \n”I had a tough offseason, and right now I try to enjoy it. \n“I just try to play like 2016 a little bit, like not doing too many things to complicate it. Not thinking too much about everything. Just going there, doing my job.” WEAK SERVE   Hsieh Su-Wei of Taiwan reacts during her match against Angelique Kerber of Germany. REUTERS/Thomas Peter \nIt could easily have been a bad day at the office for the German, as Hsieh, the oldest woman left in the draw, chased her own piece of history at the age of 32 and came close to becoming Taiwan’s first woman to reach a grand slam quarter-final. \nHer double-handed style had befuddled Wimbledon champion Garbine Muguruza in the second round and Kerber was similarly bemused as she fell 3-1 behind. \nAfter wrong-footing Kerber with a string of baseline drop shots, Hsieh leaned back and laconically slapped a forehand winner to claim a second set point and duly converted it with a lucky net cord. \nHer weak serve was a problem, though, and Kerber began to exploit it. \nThe Taiwanese saved four break points at 2-2 but dropped serve in the seventh game with a backhand into the tramlines. \nKerber handed the break back in a hail of unforced errors and her incessant grunting grew to ear-splitting levels in a sign of the pressure. \nIn the end it was a gift from Hsieh on deuce at 5-5 that cracked open the match, an unforced error giving Kerber a window and she smashed through it with a rocketed forehand down the line. \nA huge serve wrapped up the set and Hsieh’s range slowly began to desert her. \nA cross-court backhand fell wide by a half-inch to allow Kerber to break to 2-1. The miss seemed to sap the energy of Hsieh whose serves were barely clearing the net by the end, easy pickings for the now marauding Kerber. \nHsieh saved two match points to hold serve in a late burst of resistance but surrendered in the next game when Kerber rushed forward for the easiest of passing shots.  ", "external_links": [], "published": "2018-01-22T06:23:00.000+02:00", "crawled": "2018-01-22T07:05:13.026+02:00", "highlightTitle": ""}