{"organizations": [], "uuid": "a15862ff3dea4181114d493f1486189d1325c2e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-loop-industries-announces-restatement-of-previously-issued-financial-statements-related-to-non-cash-stock-based.html", "country": "US", "domain_rank": 767, "title": "Loop Industries Announces Restatement of Previously Issued Financial Statements Related to Non-Cash Stock-Based Compensation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-11T00:22:00.000+02:00", "replies_count": 0, "uuid": "a15862ff3dea4181114d493f1486189d1325c2e0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-loop-industries-announces-restatement-of-previously-issued-financial-statements-related-to-non-cash-stock-based.html", "ord_in_thread": 0, "title": "Loop Industries Announces Restatement of Previously Issued Financial Statements Related to Non-Cash Stock-Based Compensation", "locations": [], "entities": {"persons": [], "locations": [{"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "loop industries", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stock-Based Compensation Expense for Fiscal Year Ended February 28, 2017 Reduced From $5.5 million to $800,000\nAdjustment Has No Impact to Cash Flows\nMONTREAL, Jan. 10, 2018 (GLOBE NEWSWIRE) -- Loop™ Industries, Inc. (NASDAQ:LOOP) (the “Company” or “Loop”), an innovative technology company leading the sustainable plastic revolution, today announced that it is restating its previously issued consolidated financial statements for the fiscal year ended February 28, 2017 to correct an error in the accounting for stock-based compensation and consequently adjusting its consolidated balance sheet and statement of shareholders’ equity in the quarterly periods ended May 31, 2017 and August 31, 2017.\nThe Company recognized a reduction in non-cash stock-based compensation expense of $4.7 million for the fourth quarter and fiscal year ended February 28, 2017, resulting in stock-based compensation expense of $800,000, compared to previously reported stock-based compensation expense of $5.5 million.\nThe Company made an error related to the measurement of stock-based compensation associated with the grant of common shares to the Company’s President and Chief Executive Officer. The share-based award vests based on the achievement of specified performance conditions, which, pursuant to ASC 718, impacts the timing of expense recognition but does not affect the fair value determination. Rather than using the fair value of the equity-based compensation arrangement at the grant date of June 2015, the Company determined the fair value of the award on the date it became probable that the first of four performance conditions had been met.\nThe restatements along with additional information and associated disclosures are contained in a Form 8-K to be filed today by the Company with the United States Securities and Exchange Commission. The Company also intends to file a Form 10-K/A for the fiscal year ended February 28, 2017, as well as revised Form 10-Qs for the periods ended May 31, 2017 and August 31, 2017 as soon as practicable.\nThe Company expects to file its quarterly report on Form 10-Q for the period ended November 30, 2017 as scheduled on January 12, 2018.\nAbout Loop Industries, Inc.\nLoop’s mission is to accelerate the world’s shift toward sustainable plastic and away from our dependence on fossil fuels. Loop has created a revolutionary technology poised to disrupt the plastics industry. This ground-breaking technology decouples plastic from fossil fuels by depolymerising waste PET plastic and Polyester fiber to its base building blocks. The monomers are then repolymerised to create virgin-quality PET plastic that meets FDA requirements for use in food-grade packaging. Loop™ branded PET resin allows consumer goods companies to meet and exceed their stated sustainability goals. http://www.loopindustries.com\nForward-Looking Statements\nThis news release contains \"forward-looking statements.\" Such statements may be preceded by the words \"intends,\" \"may,\" \"will,\" \"plans,\" \"expects,\" \"anticipates,\" \"projects,\" \"predicts,\" \"estimates,\" \"aims,\" \"believes,\" \"hopes,\" \"potential\" or similar words. These forward-looking statements are based on our current assumptions, expectations and beliefs and are subject to substantial risks, estimates, assumptions, uncertainties and changes in circumstances that may cause the Company’s actual results, performance or achievements, as well as the Company’s expectations regarding materiality or significance and the restatement’s quantitative effects, to differ materially from those expressed or implied in any forward-looking statement. Factors that could cause actual results to differ materially from those in the forward-looking statements include, but are not limited to, the risk that additional information may arise from the Company’s and its audit committee’s internal review, the risk that the process of preparing and auditing the restated financial statements or other subsequent events would require the Company to make additional adjustments and the time and effort required to complete the restatement of its financial statements, whether the reassessment of the Company’s internal controls over financial reporting could lead the Company to conclude that there were deficiencies in its internal control over financial reporting that constitute material weaknesses; the Company’s responses to potential comments from the SEC; adverse effects on the Company’s business and operations as a result of increased regulatory, media or financial reporting issues and practices, rumors or otherwise; the costs and expenses of the restatement; the initiation of legal proceedings; the volatility of the Company’s stock price; and other risks described more fully in the Company’s filings with the SEC. Because the risks, estimates, assumptions and uncertainties referred to above could cause actual results or outcomes to differ materially from those expressed in any forward-looking statements, you should not place undue reliance on any forward-looking statements. Any forward-looking statement speaks only as of the date hereof, and, except as required by law, the Company assumes no obligation and does not intend to update any forward-looking statement to reflect events or circumstances after the date hereof.\nContacts\nFrank Zitella\nChief Financial Officer\nLoop Industries, Inc.\n450.951.8555\nFinancial Profiles:\nInvestors:\nLauren Crawford\n310.622.8239\nJohan Yokay\n310.622.8241\nloop@finprofiles.com\nMedia:\nLuke Seiler\n310.622.8240\nloop@finprofiles.com\nSource:Loop Industries, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/7cd4a9fc-92af-455d-82f9-83b626140476", "https://www.globenewswire.com/Tracker?data=CiJtbNJG9vIvP09z5GyIHF9F6ZsEqZevRFUmzDvkOzA3hbGw3IHUBt6fFZnEOXTAtkvMjdSETt2hCIts3rDiyod_3wLuDYlF8oFacQnPNe0=", "https://www.globenewswire.com/Tracker?data=CiJtbNJG9vIvP09z5GyIHITY5hKoqH7VbWKyQ3X-C6KXuxAvP--K3ks3qZPFa2rjL3axK48WlKXELqGcsvOqsSdBXbYZ95T5wk4mhgUdya4=", "https://www.globenewswire.com/Tracker?data=2HY-Si8yOBqTl7WXMfVpccBbne5oww-0nSg8OZ1L2N0JA-6Ee59WCFcndLH7HCJzYDNRADoYrFYFJu3RCANM4B_5uyyC6UwCzxZoxyTc2JE="], "published": "2018-01-11T00:22:00.000+02:00", "crawled": "2018-01-11T01:33:05.003+02:00", "highlightTitle": ""}