{"organizations": [], "uuid": "b1f9bd847ef17f34ffbebb6fea1259cc50fb8a0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/19/104907724-Bill_Gates_Wave.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/bill-gates-new-favorite-book-enlightenment-now-by-steven-pinker.html", "country": "US", "domain_rank": 767, "title": "Bill Gates' new favorite book: 'Enlightenment Now' by Steven Pinker", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.141, "site_type": "news", "published": "2018-01-29T20:03:00.000+02:00", "replies_count": 0, "uuid": "b1f9bd847ef17f34ffbebb6fea1259cc50fb8a0a"}, "author": "Sarah Berger", "url": "https://www.cnbc.com/2018/01/29/bill-gates-new-favorite-book-enlightenment-now-by-steven-pinker.html", "ord_in_thread": 0, "title": "Bill Gates' new favorite book: 'Enlightenment Now' by Steven Pinker", "locations": [], "entities": {"persons": [{"name": "steven pinker", "sentiment": "negative"}, {"name": "bill g", "sentiment": "negative"}, {"name": "bill gates", "sentiment": "negative"}, {"name": "aurelien meunier", "sentiment": "negative"}, {"name": "pinker", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "harvard university", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "better angels", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bust out your bookmark — billionaire philanthropist Bill Gates has a new favorite book, and it'll make you feel optimistic.\nGates touts \"Enlightenment Now: The Case for Reason, Science, Humanism and Progress\" by Steven Pinker as his new top read, beating out a previous pick written by the author, \"The Better Angels of Our Nature: Why Violence Has Declined.\"\n\"Enlightenment,\" Gates claims, is, \"like 'Better Angels' on steroids.''\nTWEET\nGates recently tweeted praise for \"Enlightenment,\" writing that he \"can't wait for readers to get their hands on\" the tome. Anyone who's interested can sign up via Gates' blog to be a \" Gates Notes Insider \" and download a free chapter. The book is slated for a Feb. 27 release on Amazon.\nGates' favorite facts from \"Enlightenment\"\nIn the book, Pinker — a psychology professor at Harvard University and the author of 10 books — presents \"the big picture of human progress,\" according to Amazon , and points to data that shows life, health, prosperity, safety, peace, knowledge and happiness are on the rise worldwide.\n\"The world is getting better, even if it doesn't always feel that way. I'm glad we have brilliant thinkers like Steven Pinker to help us see the big picture,\" Gates writes in his review of the book. \"'Enlightenment Now' is not only the best book Pinker's ever written. It's my new favorite book of all time.\"\nIn the blog post, Gates points to his favorite facts in the book, which show the world is improving. They include optimistic nuggets like the stat that you're 37 times less likely to be killed by a bolt of lightning than you were at the turn of the century, or that time spent doing laundry fell from 11.5 hours a week in 1930 to an hour and a half in 2014.\nThere is one topic, however, on which Gates thinks Pinker is too optimistic: artificial intelligence.\n\"He's quick to dismiss the idea of robots overthrowing their human creators. While I don't think we're in danger of a Terminator-style scenario, the question underlying that fear — who exactly controls the robots? — is a valid one,\" Gates writes . \"We're not there yet, but at some point, who has AI and who controls it will be an important issue for global institutions to address.\"\nHis other faves\nCan't wait for the February release of \"Enlightenment\" and need a book to cozy up with now? Gates — an avid reader — also recommends \"The Best We Could Do\" by Thi Bui and \"Evicted: Poverty and Profit in the American City\" among others.\nThe founder of Microsoft read 50 books last year.\n\"It's very relaxing for me. I do a lot of work, and it's kind of this reward. But I have to be careful. Amazon or Netflix video watching can actually cut into my book time,\" Gates recently told Time .\nDon't miss: Bill Gates is paying off this country's $76 million debt\nshow chapters Multi-billionaire tech investor: Here's what the next Mark Zuckerberg and Bill Gates will see in A.I. 12:59 PM ET Mon, 25 Sept 2017 | 01:49 Like this story? Like us on Facebook", "external_links": [], "published": "2018-01-29T20:03:00.000+02:00", "crawled": "2018-01-29T20:06:33.007+02:00", "highlightTitle": ""}