{"organizations": [], "uuid": "82ce655f7eaa21e93761875a5f2ba02863f8578e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/olympics-2018-northkorea-tourism/n-korea-trumpets-world-level-tourist-project-ahead-of-olympics-idUSL4N1PK3A4", "country": "US", "domain_rank": 408, "title": "N.Korea trumpets world-level tourist project ahead of Olympics", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:25:00.000+02:00", "replies_count": 0, "uuid": "82ce655f7eaa21e93761875a5f2ba02863f8578e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/olympics-2018-northkorea-tourism/n-korea-trumpets-world-level-tourist-project-ahead-of-olympics-idUSL4N1PK3A4", "ord_in_thread": 0, "title": "N.Korea trumpets world-level tourist project ahead of Olympics", "locations": [], "entities": {"persons": [{"name": "kang", "sentiment": "negative"}], "locations": [{"name": "seoul", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "kcna", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL, Jan 25 (Reuters) - North Korea advertised a new “world-level” tourist project in coastal Kangwon province on Thursday, a statement that coincides with plans by Winter Olympics host South Korea to participate in joint sporting and cultural events in the area.\nThe announcement appears aimed at capitalising on international publicity ahead of next month’s Games in Pyeongchang by boosting tourism in North Korea, one of the areas of economic activity yet to be fully choked by international sanctions over Pyongyang’s nuclear weapons programmes.\n“When the tourist area is built, it will satisfy the demand of domestic and foreign tourists and will be the most ideal place to link various tourist destinations to the Wonsan-Mt Kumgang international tourist zone,” North Korea’s state-run KCNA news agency said in a statement.\nThe statement did not provide specifics of the resort, but described the geographic features of the area, including a “famous sandy beach”, and said the project would put the country’s tourism “on world level”.\nThis week, South Korean officials travelled to the Wonsan area to inspect facilities at the Masik Pass ski resort and the nearby Kalma airport, which has yet to see any international flights two years after it opened in September 2015.\nAs part of unity activities surrounding the Olympics, the two countries agreed to hold joint ski training at Masik Pass and a cultural event at Mount Kumgang.\nSouth Korea’s offer to send a delegation to the resorts risks giving leader Kim Jong Un’s regime legitimacy and some much needed cash, North Korean defectors and experts say.\nAlready facing criticism for plans to march under a unity flag and field a combined Korean ice hockey team, the administration of South Korean President Moon Jae-in may come under further pressure if it is seen to be endorsing Kim’s luxury getaway on North Korea’s east coast.\nWonsan and Kalma airport are also important defence areas, used for large-scale artillery drills and as the launch site for dozens of missile tests in recent years.\nIn April last year, for example, Kim used the beach near Wonsan’s new airport to unleash an artillery drill described by state media as the country’s largest ever.\nExperts say that tourism is an important part of Kim’s plans to boost the North Korean economy. It is one of a shrinking range of North Korean cash sources not specifically targeted by international sanctions.\nJoint ventures with the state are banned, however, making attracting international investment in North Korea’s tourism industry difficult.\nLast year, America banned its citizens from visiting North Korea and there are no up-to-date statistics on current visitors.\nChina said more than 237,000 Chinese visited in 2012 but it stopped publishing the statistics in 2013. For comparison, eight million Chinese visited South Korea in 2016. (Reporting by Josh Smith; Editing by Nick Macfie)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T17:25:00.000+02:00", "crawled": "2018-01-26T21:14:33.000+02:00", "highlightTitle": ""}