{"organizations": [], "uuid": "3eeeb4cb00920266b4b89432cb5d89f332560d50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 14}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WZ213_3hjV5_TOP_20180112141401.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7031.xml", "section_title": "WSJ.com: Markets", "url": "https://www.wsj.com/articles/how-central-banks-doing-nothing-can-still-move-markets-1516710120", "country": "US", "domain_rank": 387, "title": "How Central Banks Doing Nothing Can Still Move Markets", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T14:22:00.000+02:00", "replies_count": 0, "uuid": "3eeeb4cb00920266b4b89432cb5d89f332560d50"}, "author": "Richard Barley", "url": "https://www.wsj.com/articles/how-central-banks-doing-nothing-can-still-move-markets-1516710120", "ord_in_thread": 0, "title": "How Central Banks Doing Nothing Can Still Move Markets", "locations": [], "entities": {"persons": [{"name": "mario draghi", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bank of japan", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "neutral"}, {"name": "ecb", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "boj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2 COMMENTS The Bank of Japan stuck to its policy guns Tuesday. The European Central Bank is likely to do the same on Thursday. But even a lack of immediate action can’t stop market perceptions of shifting.\nGovernment-bond yields have moved higher in 2018--taking the 10-year Treasury yield, now at 2.63%, to a three-year high. Last year, such rises were generally quickly reversed, often in response to reassuring messages from central bankers keen to avoid tighter financial conditions. Bond markets went sideways in 2017 .\nBut nerves have been jangled in January. First, a small tweak to the BOJ’s government-bond purchases raised questions about a shift in policy. Then the account of the ECB’s December meeting was perceived as more hawkish than the tone struck by President Mario Draghi in his press conference comments. One key concern is that there is a growing gap between crisis-era negative interest rates and asset purchases versus a relatively buoyant global economy, and jubilant asset markets. Leaving monetary-policy settings unchanged is providing more and more stimulus.\nThat leaves a narrow path for central banks to walk, which raises the risk of a misstep. Expectations are evolving: J.P. Morgan Chase economists now think the ECB will stop bond purchases in September and have moved forward the first rate rise in 2019 to March. Central bankers may no longer find it so easy to water down or dispel these shifts if the economic data remains strong.\nPedestrians cross a road in front of the Bank of Japan headquarters in Tokyo. Photo: Kiyoshi Ota/Bloomberg News For markets, that means bond yields could remain higher rather than resetting lower again as they did in 2017. Crucially, however, equity markets have powered on: the performance gap is widening. The S&P 500 sports a total return above 6% already this year while U.S. Treasurys are down 1.2%.\nContinued resilience in stock markets removes a barrier to yields continuing to climb, as it short-circuits the need for investors to run to safety. Meanwhile, strong equity returns may lure more cash out of bonds.\nUltimately, higher bond yields, reflecting higher growth and inflation, would be a sign of success for central banks. But equally, they signal a fresh test, raising questions about just how long policy can stay so loose.\nWrite to Richard Barley at richard.barley@wsj.com", "external_links": [], "published": "2018-01-23T14:22:00.000+02:00", "crawled": "2018-01-23T16:27:42.006+02:00", "highlightTitle": ""}