{"organizations": [], "uuid": "3bd506a6c6502b63b37d15dfe518a97f3eb08ef3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-wynn-resorts-acquires-smiling-king-bear-sculpture-by-spanish-contemporary-artist-okuda-san-miguel.html", "country": "US", "domain_rank": 767, "title": "Wynn Resorts Acquires 'Smiling King Bear' Sculpture By Spanish Contemporary Artist Okuda San Miguel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.61, "site_type": "news", "published": "2018-01-26T20:02:00.000+02:00", "replies_count": 0, "uuid": "3bd506a6c6502b63b37d15dfe518a97f3eb08ef3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-wynn-resorts-acquires-smiling-king-bear-sculpture-by-spanish-contemporary-artist-okuda-san-miguel.html", "ord_in_thread": 0, "title": "Wynn Resorts Acquires 'Smiling King Bear' Sculpture By Spanish Contemporary Artist Okuda San Miguel", "locations": [], "entities": {"persons": [{"name": "steve wynn", "sentiment": "none"}, {"name": "roger thomas", "sentiment": "none"}, {"name": "wynn", "sentiment": "none"}, {"name": "okuda", "sentiment": "none"}], "locations": [{"name": "san miguel las vegas", "sentiment": "none"}, {"name": "okuda san miguel", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "wynn resorts", "sentiment": "negative"}, {"name": "contemporary artist okuda", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 26, 2018 /PRNewswire/ -- Wynn Resorts adds a new level of modern vigor to its world-class art collection with the acquisition of Smiling King Bear, a pop-surreal sculpture created by the famed Spanish contemporary artist Okuda San Miguel. At a towering 16-feet tall and executed in the artist's signature prismatic style, the sculpture is a multicolored geometric masterpiece featuring a whimsical bear with a spiked crown, holding an equally imposing smiling ball.\n\"We are delighted to include Okuda's Smiling King Bear in the Wynn Resorts Collection of Fine Art. It is an exuberant, sophisticated and original statement of joy, and a colorful reference to a cherished childhood toy or the memory of a fictional character of benevolent protection,\" said Roger Thomas, Executive Vice President of Design for Wynn Resorts. \"Steve Wynn established the first important art collection in Las Vegas, and has continued to add significant examples of 20th and 21st century art in each Wynn resort. The most delightful and rewarding aspect of designing our iconic destinations has been the selection and installation of these wonderful creations. Each work is selected for its beauty, joyous expression, and distinctive relevance to the art of its time.\"\nFashioned from fiberglass, aluminum, and highly pigmented synthetic enamel, Smiling King Bear originally arrived in the United States from Spain as part of an outdoor art exhibition in Downtown Las Vegas curated by global creative house, Justkids. After its acquisition, the sculpture was installed at Wynn Las Vegas during a meticulous multi-day process overseen by the artist, and is now on display in the Wynn Plaza rotunda as part of the resort's continued appreciation and commitment to public art.\n\"It is great to be displayed in a prestigious Las Vegas resort like Wynn, and to continue the collaboration with Justkids in the United States. Wynn has a remarkable art collection and I am honored to be a part of it. The architectural elements of the hotel and its luminosity highlights the shapes and colors of my Smiling King Bear. This juxtaposition of classical and contemporary is very often part of my artistic concept, so the resort is a perfect fit for the sculpture,\" said Okuda.\nOkuda is considered to be one of the most renowned artists among the contemporary art movement, celebrated for his unique geometric structures and patterns that have developed their own instantly recognizable iconographic language. Featured in hundreds of solo and group exhibitions, his works can be seen in streets and galleries around the world including India, Mali, Mozambique, United States, Japan, Chile, Brazil, Peru, South Africa, Mexico, many parts of Europe, and beyond. Highly sought after for large scale projects, Okuda is perhaps best known for his conversion of an abandoned Spanish church aptly named Kaos Temple, which has become a new icon of contemporary art.\nABOUT WYNN LAS VEGAS\nWynn Resorts is the recipient of more Forbes Travel Guide Five Star Awards than any other independent hotel company in the world. Wynn Las Vegas opened on April 28, 2005 and was once again named the best resort in Nevada on Condé Nast Traveler's 2018 \"Gold List,\" a title received for the tenth time. Wynn and Encore Las Vegas feature two luxury hotel towers with a total of 4,750 spacious hotel rooms, suites and villas, approximately 192,000 square feet of casino space, 22 dining experiences featuring signature chefs and 11 bars, two award-winning spas, approximately 290,000 square feet of meeting and convention space, approximately 103,000 square feet of retail space as well as three nightclubs, a beach club and recreation and leisure facilities. In addition to two luxury retail esplanades, a Strip-front expansion, Wynn Plaza, is currently under construction and is scheduled to be completed by the third quarter of 2018. For more information on Wynn and Encore Las Vegas, visit www.wynnpressroom.com , and follow @WynnLasVegas on Twitter , Instagram and Facebook .\nView original content with multimedia: http://www.prnewswire.com/news-releases/wynn-resorts-acquires-smiling-king-bear-sculpture-by-spanish-contemporary-artist-okuda-san-miguel-300588653.html\nSOURCE Wynn Las Vegas", "external_links": ["http://www.wynnpressroom.com/", "http://www.twitter.com/wynnlasvegas", "http://www.facebook.com/wynnlasvegas", "http://www.instagram.com/wynnlasvegas", "http://www.prnewswire.com/news-releases/wynn-resorts-acquires-smiling-king-bear-sculpture-by-spanish-contemporary-artist-okuda-san-miguel-300588653.html"], "published": "2018-01-26T20:02:00.000+02:00", "crawled": "2018-01-26T20:02:28.002+02:00", "highlightTitle": ""}