{"organizations": [], "uuid": "86672d47945304ab16f73d30dfccbe34d0346236", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-vanguard-supports-cfp-board-center-for-financial-planning-as-visionary-circle-sponsor.html", "country": "US", "domain_rank": 767, "title": "Vanguard Supports CFP Board Center for Financial Planning as Visionary Circle Sponsor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-30T18:40:00.000+02:00", "replies_count": 0, "uuid": "86672d47945304ab16f73d30dfccbe34d0346236"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-vanguard-supports-cfp-board-center-for-financial-planning-as-visionary-circle-sponsor.html", "ord_in_thread": 0, "title": "Vanguard Supports CFP Board Center for Financial Planning as Visionary Circle Sponsor", "locations": [], "entities": {"persons": [{"name": "marilyn mohrman-gillis", "sentiment": "none"}, {"name": "frank kolimago", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "cfp board center for financial planning", "sentiment": "negative"}, {"name": "vanguard", "sentiment": "negative"}, {"name": "cfp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 30, 2018 /PRNewswire-USNewswire/ -- The CFP Board Center for Financial Planning today announced that Vanguard will support its work as a Visionary Circle Sponsor.\n\"Vanguard has been a strong supporter of the CERTIFIED FINANCIAL PLANNER™ certification and its role in contributing to a talent pipeline for the financial planning profession,\" said Marilyn Mohrman-Gillis, Executive Director of the CFP Board Center for Financial Planning. \"We are thrilled that Vanguard is among those at the forefront of working to grow and diversify the profession through its support of the Center and its initiatives.\"\nVanguard's sponsorship aligns with the Center's commitment to attracting and developing the next generation of trusted financial professionals so that every American has access to competent and ethical financial planning.\n\"At Vanguard we are committed to placing client needs first while giving them the best chance for long-term investment success,\" said Frank Kolimago, Principal and Head of Personal Advisor Services. \"The CFP® certification has become the recognized standard of excellence for personal financial planning. When combined with Vanguard's mission, this credential gives advisors a strong foundation for helping clients achieve their goals.\"\nMohrman-Gillis noted that there are many challenges facing the financial planning profession, including an aging workforce that does not reflect the diversity of the public that it serves and a dire shortage of qualified faculty to teach the next generation of financial planning professionals. The Center brings together stakeholders, including more than 80,000 CFP® professionals, firms of all sizes, CFP Board's registered programs, non-profit organizations and subject matter experts to address these challenges facing the profession.\nTo learn more and support the Center's initiatives, visit www.CenterforFinancialPlanning.org . The work of the Center is also made possible through Center sponsors, including Lead Founding Sponsor TD Ameritrade Institutional and Founding Sponsor Northwestern Mutual.\nABOUT VANGUARD\nVanguard is one of the world's largest investment management companies. As of December 31, 2017, Vanguard managed $4.9 trillion in global assets. The firm, headquartered in Valley Forge, Pennsylvania, offers 385 funds to its more than 20 million investors worldwide. For more information, visit vanguard.com .\nABOUT CFP BOARD\nThe mission of Certified Financial Planner Board of Standards, Inc. is to benefit the public by granting the CFP ® certification and upholding it as the recognized standard of excellence for competent and ethical personal financial planning. The Board of Directors, in furthering CFP Board's mission, acts on behalf of the public, CFP ® professionals and other stakeholders. CFP Board owns the certification marks CFP ® , CERTIFIED FINANCIAL PLANNER™, CFP ® (with plaque design) and CFP ® (with flame design) in the U.S., which it awards to individuals who successfully complete CFP Board's initial and ongoing certification requirements. CFP Board currently authorizes over 80,000 individuals to use these marks in the U.S.\nABOUT the CFP BOARD CENTER FOR FINANCIAL PLANNING\nThe CFP Board Center for Financial Planning seeks to create a more diverse and sustainable financial planning profession so that every American has access to competent and ethical financial planning advice. The Center brings together CFP® professionals, firms, educators, researchers and experts to address profession-wide challenges in the areas of diversity and workforce development, and to build an academic home that offers opportunities for conducting and publishing new research that adds to the financial planning body of knowledge. More about the Center and its initiatives can be found at www.CenterforFinancialPlanning.org .\nView original content: http://www.prnewswire.com/news-releases/vanguard-supports-cfp-board-center-for-financial-planning-as-visionary-circle-sponsor-300590326.html\nSOURCE Certified Financial Planner Board of Standards, Inc.", "external_links": ["http://www.centerforfinancialplanning.org/", "http://www.prnewswire.com/news-releases/vanguard-supports-cfp-board-center-for-financial-planning-as-visionary-circle-sponsor-300590326.html"], "published": "2018-01-30T18:40:00.000+02:00", "crawled": "2018-01-30T20:48:47.016+02:00", "highlightTitle": ""}