{"organizations": [], "uuid": "e75a838d42697090648518ee6b1700bac7f76c27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223160582&w=1200&r=LYNXMPEE0H23I", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-canada-prison-solitary/canadas-ontario-to-stop-putting-the-mentally-ill-in-solitary-confinement-idUSKBN1F738L", "country": "US", "domain_rank": 408, "title": "Canada's Ontario to stop putting the mentally ill in solitary confinement", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T00:34:00.000+02:00", "replies_count": 0, "uuid": "e75a838d42697090648518ee6b1700bac7f76c27"}, "author": "", "url": "https://www.reuters.com/article/us-canada-prison-solitary/canadas-ontario-to-stop-putting-the-mentally-ill-in-solitary-confinement-idUSKBN1F738L", "ord_in_thread": 0, "title": "Canada's Ontario to stop putting the mentally ill in solitary confinement", "locations": [], "entities": {"persons": [{"name": "anna mehler paperny", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 10:35 PM / Updated 20 hours ago Canada's Ontario to stop putting the mentally ill in solitary confinement Anna Mehler Paperny 2 Min Read \nTORONTO (Reuters) - Ontario, Canada’s most populous province, will stop putting people with mental illness in indefinite solitary confinement and begin phasing out segregation entirely amid growing pressure for Canadian governments to end treatment the United Nations has deemed “torture.” \nUnder an agreement with the province’s human rights commission, the Ontario government will immediately begin to track and ultimately end the practice of putting people with mental illness in segregation. There are currently no limits on who can be placed in solitary confinement or for how long. \nThe province has agreed to appoint an independent reviewer to monitor its compliance. \nThe agreement comes more than four years after the province originally agreed to stop segregating people with mental illness. It states solitary confinement “must only be used as a measure of last resort” but did not specify what that would mean. \n“The goal, for us, is the absolute prohibition of solitary confinement for people with mental health disabilities,” Renu Mandhane, Ontario’s human rights commissioner, said on Thursday. FILE PHOTO: An officer walks in front of the Toronto South Detention Centre in Toronto, Canada, May 24, 2017. REUTERS/Mark Blinch/File Photo \nIn a statement, Ontario Correctional Minister Marie-France Lalonde welcomed the agreement and promised “work to overhaul and ultimately phase out segregation.” \nThe agreement applies to all provincial jails in Ontario. Slideshow (2 Images) \nOn Wednesday a Canadian judge ruled that indefinite solitary confinement in federal prisons is unconstitutional and gave Canada’s government a year to fix it. \nMost of the people in Ontario’s jails, including many of those in solitary confinement, are awaiting trial. As Reuters has reported, people in Canadian jails are more likely to die while awaiting trial than when serving sentences. \nThe United Nations has said solitary confinement for more than 15 days constitutes torture and has called for the prohibition of solitary for youth and those with mental illness. Reporting by Anna Mehler Paperny; Editing by Matthew Lewis", "external_links": [], "published": "2018-01-19T00:34:00.000+02:00", "crawled": "2018-01-19T00:52:41.005+02:00", "highlightTitle": ""}