{"organizations": [], "uuid": "1074548a7b1dd997d25a3efc6579f74fec244d70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1220976950&w=1200&r=LYNXMPEE0A01A", "site_section": "http://feeds.reuters.com/reuters/INoddlyEnoughNews\r", "section_title": "Reuters: Oddly Enough", "url": "https://in.reuters.com/article/tech-ces-power/brief-power-outage-darkens-ces-tech-electronics-show-idINKBN1EZ2YS", "country": "US", "domain_rank": 408, "title": "Brief power outage darkens CES tech, electronics show", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T02:24:00.000+02:00", "replies_count": 0, "uuid": "1074548a7b1dd997d25a3efc6579f74fec244d70"}, "author": "", "url": "https://in.reuters.com/article/tech-ces-power/brief-power-outage-darkens-ces-tech-electronics-show-idINKBN1EZ2YS", "ord_in_thread": 0, "title": "Brief power outage darkens CES tech, electronics show", "locations": [], "entities": {"persons": [{"name": "joseph white", "sentiment": "none"}, {"name": "endgadget", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "las vegas convention center", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "min read  las vegas", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 11:44 PM / Updated 3 hours ago Brief power outage darkens CES tech, electronics show Joseph White 2 Min Read \nLAS VEGAS (Reuters) - The digital economy’s big annual trade show, CES, suffered a brief, disruptive plunge into darkness on Wednesday because of a power outage the show’s organizers blamed on a glitch caused by heavy rains the day before in usually sunny Nevada. A partial blackout is seen during the 2018 CES in Las Vegas, Nevada, U.S. January 10, 2018 in this picture obtained from social media. Courtesy of ARIANNA HOEPPNER/via REUTERS \nThe irony of a partial blackout at a trade show dedicated to the latest electronic technology did not escape social or industry media. “Lights out at CES 2018. Does anyone have a battery pack?” wrote Endgadget, a technology news site. \nLarge swaths of the sprawling Las Vegas Convention Center lost power at about 11:15 a.m. local time, shutting down brightly lit company booths and darkening rooms used by hundreds of journalists covering CES. Emergency lights stayed on, and backup batteries kept wireless internet connections functioning. \nCES organizers said power was restored within minutes to the convention centre’s South Hall, where many gaming companies had exhibits. Other areas took longer. Power was fully restored at 2:10 p.m., CES said in a statement. \nA preliminary assessment found that moisture from heavy rains on Tuesday had caused a “flashover” in one of the convention centre’s transformers, it said. \nPower and rain are not the only challenges CES has faced this year. A central theme of this year’s show is “Smart Cities,” and automakers and other companies have used elaborate virtual reality displays of tree-lined streets with smooth flowing traffic to promote technology and investments aimed at relieving urban congestion. \nOn Las Vegas’ physical streets, traffic crawled on Tuesday as thousands of CES attendees shuttled between hotels and conference venues in heavy rain. Long lines formed at the convention centre for cabs. Ride hailing companies such as Uber and Lyft could not pick up passengers at the convention centre, but operated from parking lots a block or more away. Reporting by Joe White; Editing by Richard Chang", "external_links": [], "published": "2018-01-11T02:24:00.000+02:00", "crawled": "2018-01-11T02:48:15.017+02:00", "highlightTitle": ""}