{"organizations": [], "uuid": "513c3033e494330d5dfe77a306b85ac42a326744", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-kla-tencor-reports-fiscal-2018-second-quarter-results.html", "country": "US", "domain_rank": 767, "title": "KLA-Tencor Reports Fiscal 2018 Second Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:15:00.000+02:00", "replies_count": 0, "uuid": "513c3033e494330d5dfe77a306b85ac42a326744"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-kla-tencor-reports-fiscal-2018-second-quarter-results.html", "ord_in_thread": 0, "title": "KLA-Tencor Reports Fiscal 2018 Second Quarter Results", "locations": [], "entities": {"persons": [{"name": "rick wallace", "sentiment": "none"}], "locations": [{"name": "milpitas", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "kla-tencor", "sentiment": "negative"}, {"name": "kla-tencor corporation", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILPITAS, Calif., KLA-Tencor Corporation (NASDAQ: KLAC) today announced operating results for its second quarter of fiscal year 2018, which ended on Dec. 31, 2017, and reported GAAP net loss of $(134) million and GAAP loss per diluted share of $(0.86) on revenues of $976 million.\nLogo - http://photos.prnewswire.com/prnh/20140123/SF50413LOGO\n\"KLA-Tencor reported a record quarter in December 2017, delivering new quarterly highs in shipments, revenues, gross margin, and non-GAAP earnings per diluted share in the period. Full year results in calendar 2017 also set records for each of these metrics, as well as in free cash flow generation,\" commented Rick Wallace, president and chief executive officer of KLA-Tencor. \"These outstanding results demonstrate the dedication that runs throughout our organization to serving our customers and delivering results to our stockholders, as well as the long-term value generated in successful execution of the Company's strategic objectives.\"\nGAAP Results\nQ2 FY 2018\nQ1 FY 2018\nQ2 FY 2017\nRevenues\n$976 million\n$970 million\n$877 million\nNet Income (Loss)\n$(134) million\n$281 million\n$238 million\nEarnings (Loss) per Diluted Share\n$(0.86)\n$1.78\n$1.52\nNon-GAAP Results\nQ2 FY 2018\nQ1 FY 2018\nQ2 FY 2017\nNet Income\n$309 million\n$284 million\n$238 million\nEarnings per Diluted Share\n$1.97\n$1.80\n$1.52\nA reconciliation between GAAP operating results and non-GAAP operating results is provided following the financial statements included in this release. Non-GAAP results include the impact of stock-based compensation, but exclude the impact of acquisitions, restructuring, severance, merger and other related charges and certain discrete tax items. KLA-Tencor will discuss the results for its fiscal year 2018 second quarter, along with its outlook, on a conference call today beginning at 3:00 p.m. Pacific Time. A webcast of the call will be available at: www.kla-tencor.com .\nAbout KLA-Tencor:\nKLA-Tencor Corporation, a leading provider of process control and yield management solutions, partners with customers around the world to develop state-of-the-art inspection and metrology technologies. These technologies serve the semiconductor and other related nanoelectronics industries. With a portfolio of industry-standard products and a team of world-class engineers and scientists, the company has created superior solutions for its customers for more than 40 years. Headquartered in Milpitas, Calif., KLA-Tencor has dedicated customer operations and service centers around the world. Additional information may be found at http://www.kla-tencor.com . (KLAC-F)\nUse of Non-GAAP Financial Information :\nThe non-GAAP and supplemental information provided in this press release is a supplement to, and not a substitute for, KLA-Tencor's financial results presented in accordance with United States GAAP.\nTo supplement KLA-Tencor's condensed consolidated financial statements presented in accordance with GAAP, the company provides certain non-GAAP financial information, which is adjusted from results based on GAAP to exclude certain costs and expenses (benefits), as well as other supplemental information. The non-GAAP and supplemental information is provided to enhance the user's overall understanding of KLA-Tencor's operating performance and its prospects in the future. Specifically, KLA-Tencor believes that the non-GAAP information provides useful measures to both management and investors regarding financial and business trends relating to KLA-Tencor's financial performance by excluding certain costs and expenses (benefits) that the company believes are not indicative of its core operating results. The non-GAAP information is among the budgeting and planning tools that management uses for future forecasting. However, because there are no standardized or generally accepted definitions for most non-GAAP financial metrics, definitions of non-GAAP financial metrics (for example, determining which costs and expenses (benefits) to exclude when calculating such a metric) are inherently subject to significant discretion. As a result, non-GAAP financial metrics may be defined very differently from company to company, or even from period to period within the same company, which can potentially limit the usefulness of such information to an investor. The presentation of non-GAAP and supplemental information is not meant to be considered in isolation or as a substitute for results prepared and presented in accordance with United States GAAP.\nKLA-Tencor Corporation\nCondensed Consolidated Unaudited Balance Sheets\n(In thousands)\nDec. 31, 2017\nJune 30, 2017\nASSETS\nCash, cash equivalents and marketable securities\n$\n2,758,190\n$\n3,016,740\nAccounts receivable, net\n740,903\n571,117\nInventories\n787,971\n732,988\nOther current assets\n66,929\n71,221\nLand, property and equipment, net\n281,634\n283,975\nGoodwill\n350,023\n349,526\nDeferred income taxes, non-current\n193,740\n291,967\nPurchased intangibles, net\n16,563\n18,963\nOther non-current assets\n211,315\n195,676\nTotal assets\n$\n5,407,268\n$\n5,532,173\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable\n$\n149,844\n$\n147,380\nDeferred system profit\n248,829\n180,861\nUnearned revenue\n64,256\n65,507\nCurrent portion of long-term debt\n—\n249,983\nOther current liabilities\n703,619\n649,431\nTotal current liabilities\n1,166,548\n1,293,162\nNon-current liabilities:\nLong-term debt\n2,486,426\n2,680,474\nUnearned revenue\n67,927\n59,713\nOther non-current liabilities\n460,742\n172,407\nTotal liabilities\n4,181,643\n4,205,756\nStockholders' equity:\nCommon stock and capital in excess of par value\n548,691\n529,283\nRetained earnings\n729,456\n848,457\nAccumulated other comprehensive income (loss)\n(52,522)\n(51,323)\nTotal stockholders' equity\n1,225,625\n1,326,417\nTotal liabilities and stockholders' equity\n$\n5,407,268\n$\n5,532,173\nKLA-Tencor Corporation\nCondensed Consolidated Unaudited Statements of Operations\nThree months ended Dec. 31,\nSix months ended Dec. 31,\n(In thousands, except per share amounts)\n2017\n2016\n2017\n2016\nRevenues:\nProduct\n$\n761,587\n$\n683,733\n$\n1,522,374\n$\n1,245,486\nService\n214,235\n193,152\n423,029\n382,072\nTotal revenues\n975,822\n876,885\n1,945,403\n1,627,558\nCosts and expenses:\nCosts of revenues\n347,334\n318,507\n700,783\n596,343\nResearch and development\n156,745\n130,912\n303,477\n260,145\nSelling, general and administrative\n105,546\n93,532\n213,259\n187,920\nInterest expense and other, net\n18,890\n27,089\n44,425\n54,085\nIncome before income taxes\n347,307\n306,845\n683,459\n529,065\nProvision for income taxes\n481,626\n68,594\n536,842\n112,713\nNet income (loss)\n$\n(134,319)\n$\n238,251\n$\n146,617\n$\n416,352\nNet income (loss) per share:\nBasic\n$\n(0.86)\n$\n1.52\n$\n0.94\n$\n2.66\nDiluted\n$\n(0.86)\n$\n1.52\n$\n0.93\n$\n2.65\nCash dividends declared per share\n$\n0.59\n$\n0.54\n$\n1.18\n$\n1.06\nWeighted-average number of shares:\nBasic\n156,587\n156,335\n156,707\n156,232\nDiluted\n156,587\n157,123\n157,688\n157,071\nKLA-Tencor Corporation\nCondensed Consolidated Unaudited Statements of Cash Flows\nThree months ended\nDec. 31,\n(In thousands)\n2017\n2016\nCash flows from operating activities:\nNet income (loss)\n$\n(134,319)\n$\n238,251\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\nDepreciation and amortization\n16,130\n14,892\nNon-cash stock-based compensation expense\n13,739\n12,444\nNet (gain) loss on sales of marketable securities and other investments\n69\n(681)\nAccounts receivable, net\n(73,877)\n(24,386)\nInventories\n(24,240)\n13,132\nOther assets\n84,502\n(28,315)\nAccounts payable\n11,069\n11,786\nDeferred system profit\n39,562\n8,302\nOther liabilities\n196,736\n(23,012)\nNet cash provided by operating activities\n129,371\n222,413\nCash flows from investing activities:\nAcquisition of non-marketable securities\n(3,377)\n(900)\nBusiness acquisition\n(4,780)\n—\nCapital expenditures, net\n(13,369)\n(8,629)\nProceeds from sale of assets\n—\n2,582\nPurchases of available-for-sale securities\n(134,268)\n(372,950)\nProceeds from sale of available-for-sale securities\n56,506\n78,136\nProceeds from maturity of available-for-sale securities\n123,095\n159,077\nPurchases of trading securities\n(18,914)\n(20,813)\nProceeds from sale of trading securities\n21,062\n23,164\nNet cash provided by (used in) investing activities\n25,955\n(140,333)\nCash flows from financing activities:\nProceeds from revolving credit facility, net of debt issuance costs\n248,693\n—\nRepayment of debt\n(540,000)\n(40,000)\nIssuance of common stock\n20,579\n23,694\nTax withholding payments related to vested and released restricted stock units\n(2,567)\n(79)\nCommon stock repurchases\n(40,427)\n—\nPayment of dividends to stockholders\n(92,575)\n(84,529)\nNet cash used in financing activities\n(406,297)\n(100,914)\nEffect of exchange rate changes on cash and cash equivalents\n3,668\n(10,458)\nNet decrease in cash and cash equivalents\n(247,303)\n(29,292)\nCash and cash equivalents at beginning of period\n1,320,697\n966,325\nCash and cash equivalents at end of period\n$\n1,073,394\n$\n937,033\nSupplemental cash flow disclosures:\nIncome taxes paid, net\n$\n123,625\n$\n71,164\nInterest paid\n$\n55,693\n$\n56,773\nNon-cash activities:\nPurchase of land, property and equipment - investing activities\n$\n5,548\n$\n1,985\nUnsettled common stock repurchase - financing activities\n$\n1,289\n$\n—\nDividends payable - financing activities\n$\n7,590\n$\n12,763\nKLA-Tencor Corporation\nCondensed Consolidated Unaudited Supplemental Information\n(In thousands, except per share amounts)\nReconciliation of GAAP Net Income (Loss) to Non-GAAP Net Income\nThree months ended\nSix months ended\nDec. 31,\n2017\nSept. 30,\n2017\nDec. 31,\n2016\nDec. 31,\n2017\nDec. 31,\n2016\nGAAP net income (loss)\n$\n(134,319)\n$\n280,936\n$\n238,251\n$\n146,617\n$\n416,352\nAdjustments to reconcile GAAP net income (loss) to non-GAAP net income:\nAcquisition-related charges\na\n1,608\n1,587\n513\n3,195\n1,780\nMerger-related charges\nb\n—\n3,015\n4,069\n3,015\n7,674\nIncome tax effect of non-GAAP adjustments\nc\n(465)\n(1,599)\n(1,580)\n(2,064)\n(2,839)\nDiscrete tax items\nd\n441,894\n—\n(3,064)\n441,894\n(3,064)\nNon-GAAP net income\n$\n308,718\n$\n283,939\n$\n238,189\n$\n592,657\n$\n419,903\nGAAP net income (loss) per diluted share\n$\n(0.86)\n$\n1.78\n$\n1.52\n$\n0.93\n$\n2.65\nNon-GAAP net income per diluted share\n$\n1.97\n$\n1.80\n$\n1.52\n$\n3.76\n$\n2.67\nShares used in diluted shares calculation\n156,587\n157,846\n157,123\n157,688\n157,071\nPre-tax impact of items included in Condensed Consolidated Unaudited Statements of Operations\nAcquisition-\nrelated charges\nMerger-related charges\nTotal pre-tax\nGAAP to non-\nGAAP adjustments\nThree months ended Dec. 31, 2017\nCosts of revenues\n$\n1,530\n$\n—\n$\n1,530\nSelling, general and administrative\n78\n—\n78\nTotal in three months ended Dec. 31, 2017\n$\n1,608\n$\n—\n$\n1,608\nThree months ended Sept. 30, 2017\nCosts of revenues\n$\n1,530\n$\n405\n$\n1,935\nResearch and development\n—\n1,147\n1,147\nSelling, general and administrative\n57\n1,463\n1,520\nTotal in three months ended Sept. 30, 2017\n$\n1,587\n$\n3,015\n$\n4,602\nThree months ended Dec. 31, 2016\nCosts of revenues\n$\n500\n$\n348\n$\n848\nResearch and development\n—\n1,054\n1,054\nSelling, general and administrative\n13\n2,667\n2,680\nTotal in three months ended Dec. 31, 2016\n$\n513\n$\n4,069\n$\n4,582\nTo supplement our condensed consolidated financial statements presented in accordance with GAAP, we provide certain non-GAAP financial information, which is adjusted from results based on GAAP to exclude certain costs and expenses, as well as other supplemental information. The non-GAAP and supplemental information is provided to enhance the user's overall understanding of our operating performance and our prospects in the future. Specifically, we believe that the non-GAAP information provides useful measures to both management and investors regarding financial and business trends relating to our financial performance by excluding certain costs and expenses that we believe are not indicative of our core operating results. The non-GAAP information is among the budgeting and planning tools that management uses for future forecasting. However, because there are no standardized or generally accepted definitions for most non-GAAP financial metrics, definitions of non-GAAP financial metrics (for example, determining which costs and expenses to exclude when calculating such a metric) are inherently subject to significant discretion. As a result, non-GAAP financial metrics may be defined very differently from company to company, or even from period to period within the same company, which can potentially limit the usefulness of such information to an investor. The presentation of non-GAAP and supplemental information is not meant to be considered in isolation or as a substitute for results prepared and presented in accordance with United States GAAP.\na.\nAcquisition-related charges include amortization of intangible assets and inventory fair value adjustments, and transaction costs associated with acquisitions. Management believes that the expense associated with the amortization of acquisition related intangible assets and acquisition related costs are appropriate to be excluded because a significant portion of the purchase price for acquisitions may be allocated to intangible assets that have short lives, and exclusion of these expenses allows comparisons of operating results that are consistent over time for both KLA-Tencor's newly acquired and long-held businesses. Management believes excluding these items helps investors compare our operating performances with our results in prior periods as well as with the performance of other companies.\nb.\nMerger-related charges associated with the terminated merger agreement between KLA-Tencor and Lam Research Corporation (\"Lam\") primarily includes employee retention-related expenses, legal expenses and other costs. Management believes that it is appropriate to exclude these items as they are not indicative of ongoing operating results and therefore limit comparability and excluding these items helps investors compare our operating performance with our results in prior periods as well as with the performance of other companies.\nc.\nIncome tax effect of non-GAAP adjustments includes the income tax effects of the excluded items noted above. Management believes that it is appropriate to exclude the tax effects of the items noted above in order to present a more meaningful measure of non-GAAP net income.\nd.\nDiscrete tax item during the three months ended Dec. 31, 2017 includes the income tax effects of an income tax expense from the enacted tax reform legislation through the Tax Cuts and Jobs-Act (\"the Act\"), which was signed into law on Dec. 22, 2017, of which the impact is primarily related to the provisional tax amounts recorded for the transition tax on accumulated foreign earnings and the re-measurement of certain deferred tax assets and liabilities as a result of the enactment of the Act. Discrete tax item during the three months ended Dec. 31, 2016 include the tax impact of certain merger-related charges that only became deductible during the three months ended Dec. 31, 2016 as a result of the termination of the proposed merger between KLA-Tencor and Lam. Management believes that it is appropriate to exclude these items as they are not indicative of ongoing operating results and therefore limit comparability. Management believes excluding these items helps investors compare our operating performance with our results in prior periods as well as with the performance of other companies.\n : releases/kla-tencor-reports-fiscal-2018-second-quarter-results-300588547.html\nSOURCE KLA-Tencor Corporation", "external_links": ["http://photos.prnewswire.com/prnh/20140123/SF50413LOGO", "https://www.kla-tencor.com/", "http://www.prnewswire.com/news-releases/kla-tencor-reports-fiscal-2018-second-quarter-results-300588547.html", "http://www.kla-tencor.com/"], "published": "2018-01-26T00:15:00.000+02:00", "crawled": "2018-01-26T02:33:19.031+02:00", "highlightTitle": ""}