{"organizations": [], "uuid": "2e107705ccdf5a7e0809011a48ea123050535d61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/04/reuters-america-update-1-trump-administration-aims-to-open-nearly-all-us-offshore-waters-to-drilling.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-Trump administration aims to open nearly all US offshore waters to drilling", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T20:47:00.000+02:00", "replies_count": 0, "uuid": "2e107705ccdf5a7e0809011a48ea123050535d61"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/reuters-america-update-1-trump-administration-aims-to-open-nearly-all-us-offshore-waters-to-drilling.html", "ord_in_thread": 0, "title": "UPDATE 1-Trump administration aims to open nearly all US offshore waters to drilling", "locations": [], "entities": {"persons": [{"name": "zinke", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "ryan zinke", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "arctic", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "american energy dominance", "sentiment": "none"}, {"name": "interior", "sentiment": "none"}, {"name": "interior department", "sentiment": "none"}, {"name": "national outer continental shelf oil and gas leasing program", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "drilling@ (Recasts with announcement, adds details, remarks by Zinke)\nWASHINGTON, Jan 4 (Reuters) - The Trump administration on Thursday proposed opening nearly all U.S. offshore waters to oil and gas drilling, reversing protections in the Arctic, Atlantic and Pacific.\nThe bid to expand American energy production faces objections from environmentalists, state officials and some business groups worried about spills and the potential impact on coastal tourism.\nInterior Secretary Ryan Zinke said the draft National Outer Continental Shelf Oil and Gas Leasing Program for 2019 to 2024 would make over 90 percent of the outer continental shelfs total acreage available for leasing, including areas put off-limits by the Obama administration.\n\"We want to grow our nations offshore energy industry, instead of slowly surrendering it to foreign shores,\" Zinke said in prepared remarks, saying the plan is part of the Trump administration's \"American Energy Dominance\" agenda.\nThe Interior Department identified 47 potential lease sales compared with 11 under Democratic former President Barack Obama's strategy, making it \"the largest number of lease sales in U.S. history\" offered in a federal five-year plan.\nWeeks before leaving office, Obama had banned new oil and gas drilling in federal waters in the Atlantic and Arctic oceans, protecting 115 million acres (46.5 million hectares) of waters off Alaska and 3.8 million acres (1.5 million hectares)in the Atlantic from New England to the Chesapeake Bay.\nRepublican President Donald Trump last April ordered the Interior Department to overhaul the existing offshore drilling plan, which the agency said placed 94 percent of the outer continental shelf off-limits to drillers.\nThe proposal comes as low oil prices and soaring onshore production have curtailed industry demand for offshore leases, raising questions about the benefits of the move.\nAhead of Thursday's announcement, lawmakers from both parties, environmental groups and local business leaders along the Atlantic Coast said they were opposed to any effort to open up their coastlines to drilling rigs, citing environmental risks and threats to their lucrative tourism industries.\nA spokesman for Florida Republican Governor Rick Scott said in a statement on Wednesday that he \"is aggressively fighting to protect Floridas environment by proposing more than $3.8 billion to preserve it.\"\nCoastal tourism business groups are also girding for a long fight against the Interior Department.\nFrank Knapp, founder of the South Carolina Small Business Chamber of Commerce, accused the federal agency of favoring the oil and gas sector over the tourism sector.\n\"What part of the business sector are they listening to? Its certainly not small or coastal businesses, Knapp said. (Reporting By Valerie Volcovici; Editing by Nick Zieminski)", "external_links": [], "published": "2018-01-04T20:47:00.000+02:00", "crawled": "2018-01-05T04:35:11.000+02:00", "highlightTitle": ""}