{"organizations": [], "uuid": "2fbcb7ce520bbe93e07b9cdbbc629e1d1bd6dcec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222781566&w=1200&r=LYNXMPEE0G1CI", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-sweden-violence/swedish-pm-does-not-rule-out-use-of-army-to-end-gang-violence-idUSKBN1F629L", "country": "US", "domain_rank": 408, "title": "Swedish PM does not rule out use of army to end gang violence", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T19:06:00.000+02:00", "replies_count": 0, "uuid": "2fbcb7ce520bbe93e07b9cdbbc629e1d1bd6dcec"}, "author": "", "url": "https://www.reuters.com/article/us-sweden-violence/swedish-pm-does-not-rule-out-use-of-army-to-end-gang-violence-idUSKBN1F629L", "ord_in_thread": 0, "title": "Swedish PM does not rule out use of army to end gang violence", "locations": [], "entities": {"persons": [{"name": "law", "sentiment": "none"}, {"name": "stefan lofven", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "stockholm", "sentiment": "none"}, {"name": "stockholm", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STOCKHOLM (Reuters) - Sweden will do whatever it takes, including sending in the army, to end a wave of gang violence that has seen a string of deadly shootings, Prime Minister Stefan Lofven said in Wednesday.\nSweden’s murder rate is relatively low in international terms, but gang violence has surged in recent years and Swedes are worried that the police are unable to cope.\nIn 2016, the latest year for which official statistics are available, 106 people were murdered in Sweden, a country of 10 million.\nBut Swedish TV reported there were over 300 shootings, mostly in turf battles between gangs over drugs, protection rackets and prostitution.\nFour people were shot dead in the first week of this year. One man died after picking up a hand grenade outside a subway station in a suburb of Stockholm.\nLaw and order is likely to be a major issue in a parliamentary election scheduled for September with the populist, opposition Sweden Democrats linking public concern about the rising crime rate to a large increase in the numbers of immigrants.\n“It would not be my first option to bring in the military, but I am prepared to do whatever is necessary to make sure that serious, organized crime is stamped out,” Lofven told news agency TT.\nThe government has promised police an extra 7.1 billion crowns ($880 million) through 2020, toughened laws on gun crimes and made it easier for the police to monitor private phone calls and emails, among other measures.\nBut a report by the Swedish National Council for Crime Prevention shows increasing numbers of Swedes worried about crime with confidence falling in the police and the judicial system.\n“People are shot to death in pizza restaurants, people are killed by hand grenades they find on the street,” Sweden Democrat leader Jimmie Akesson said in parliament on Wednesday.\n“This is the new Sweden; the new, exciting dynamic, multicultural paradise that so many here in this assembly ... have fought to create for so many years,” he said sarcastically.\nReporting by Simon Johnson; editing by Richard Balmforth\n ", "external_links": [], "published": "2018-01-17T19:06:00.000+02:00", "crawled": "2018-01-17T19:28:04.054+02:00", "highlightTitle": ""}