{"organizations": [], "uuid": "53d4d965e0dd142db0ae10cc483f566cadd5b7ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226542705&w=1200&r=LYNXMPEE0T0G5", "site_section": "https://www.reuters.com/finance/deals", "section_title": "Deals News | Reuters", "url": "https://www.reuters.com/article/us-telecomitalia-network/telecom-italia-proposes-to-separate-network-assets-sources-idUSKBN1FJ108", "country": "US", "domain_rank": 408, "title": "Telecom Italia proposes separating network - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:57:00.000+02:00", "replies_count": 0, "uuid": "53d4d965e0dd142db0ae10cc483f566cadd5b7ff"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-telecomitalia-network/telecom-italia-proposes-to-separate-network-assets-sources-idUSKBN1FJ108", "ord_in_thread": 0, "title": "Telecom Italia proposes separating network - sources", "locations": [], "entities": {"persons": [{"name": "amos genish", "sentiment": "none"}, {"name": "vivendi", "sentiment": "none"}, {"name": "carlo calenda", "sentiment": "none"}], "locations": [{"name": "rome", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "telecom italia", "sentiment": "negative"}, {"name": "agcom", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILAN/ROME (Reuters) - Telecom Italia (TIM) ( TLIT.MI ) has drawn up plans to put its network into a separate company fully owned by the group, a source familiar with the matter said, seeking to address calls for it to loosen its grip over a key industry asset.\nA meeting between Italian communications regulator AGCOM and TIM’s Chief Executive Amos Genish took place on Monday, when the CEO presented the plan, another source said.\nTIM has come under pressure from Italian politicians, regulators and rivals to separate and upgrade its network, its most prized asset which analysts have valued at up to 15 billion euros ($18.6 billion).\nThe pressure has intensified since French media group Vivendi ( VIV.PA ), the Italian phone group’s top shareholder with a 24 percent stake, began to exert greater influence, raising concerns among politicians in Rome.\nIndustry Minister Carlo Calenda has repeatedly said TIM should unbundle its network and services operations into two separate legal entities.\nThe first source said the voluntary separation aimed at guaranteeing the network’s quality and equal access to all operators. It would also include a road map of future investments to guarantee the continued rollout of ultrafast broadband in Italy.\n“The proposal is in line with what’s been requested by minister Calenda, but there is no talk of listing the network on the stock market,” the person said.\nA slot on the new entity’s board would be reserved for an AGCOM representative, the source added.\nGenish will present the proposal to Calenda on Feb. 7 and the company’s board the same month, the source said.\nThe news was first reported by Italy’s daily Il Messaggero earlier on Tuesday.\nTelecom Italia shares were up 3.5 percent at 0948 GMT, the biggest rise on Italy's top-40 blue-chip index .FTMIB .\nGenish said in November TIM wanted to keep control of the network, but did not need to own it in full, adding the company would make a decision “on our terms when we really believe it’s needed”.\nLast year, sources told Reuters that AGCOM was considering whether it could force TIM to put its network into a separate company to address competition concerns.\nItaly’s biggest phone group is vertically integrated, meaning it gives rivals access to its backbone infrastructure, but also competes with them in commercial activities.\nWhile TIM has put in place measures to boost transparency and ensure equal access to competitors, notably by setting up an in-house structure called Open Access, the regulator regularly reviews the set-up to see whether changes are needed.\n($1 = 0.8079 euros)\nReporting by Stefano Rebaudo in MILAN and Francesa Piscioneri in ROME; Writing by Agnieszka Flak; Editing by Mark Potter\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T16:57:00.000+02:00", "crawled": "2018-01-30T16:31:46.000+02:00", "highlightTitle": ""}