{"organizations": [], "uuid": "06a9401a725c13f156a08ad914f467e5239b5c20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-liberty-oilfield-services-inc-prices-upsized-initial-public-offering.html", "country": "US", "domain_rank": 767, "title": "Liberty Oilfield Services Inc. Prices Upsized Initial Public Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.044, "site_type": "news", "published": "2018-01-12T10:01:00.000+02:00", "replies_count": 0, "uuid": "06a9401a725c13f156a08ad914f467e5239b5c20"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-liberty-oilfield-services-inc-prices-upsized-initial-public-offering.html", "ord_in_thread": 0, "title": "Liberty Oilfield Services Inc. Prices Upsized Initial Public Offering", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "liberty oilfield services inc", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "liberty oilfield services inc.", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "liberty llc", "sentiment": "none"}, {"name": "liberty", "sentiment": "none"}, {"name": "liberty oilfield services new holdco llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER--(BUSINESS WIRE)-- Liberty Oilfield Services Inc. (NYSE: LBRT) (“Liberty”) announced today the pricing of an upsized initial public offering of 12,731,092 shares of its Class A common stock at $17.00 per share. The shares are expected to begin trading on the New York Stock Exchange under the ticker symbol “LBRT” on January 12, 2018. In addition, Liberty and the selling shareholder granted the underwriters a 30-day option to purchase up to an additional 1,909,663 shares of Liberty’s Class A common stock at the initial public offering price, less underwriting discounts and commissions. The offering is expected to close on January 17, 2018, subject to customary closing conditions.\nLiberty expects to receive approximately $194.5 million of net proceeds from the offering, or $220.4 million if the underwriters exercise their option to purchase additional shares in full. Liberty intends to contribute the net proceeds of the offering it receives to Liberty Oilfield Services New HoldCo LLC (“Liberty LLC”), its subsidiary, in exchange for limited liability company units in Liberty LLC (“Liberty LLC Units”). Liberty LLC intends to use such net proceeds to repay borrowings incurred under Liberty’s credit facility, to repay borrowings under Liberty’s term loan and for general corporate purposes, including funding a portion of Liberty’s 2018 and other future capital expenditures. If the underwriters exercise their option to purchase additional shares, Liberty intends to use the proceeds it receives to redeem shares of Class A common stock or Liberty LLC Units from certain existing holders.\nMorgan Stanley, Goldman Sachs & Co. LLC, Wells Fargo Securities, Citigroup, J.P. Morgan and Evercore ISI are acting as joint book-running managers for the offering. The offering of these securities will be made only by means of a prospectus that meets the requirements of Section 10 of the Securities Act of 1933. A copy of the prospectus may be obtained from:\nMorgan Stanley\nAttention: Prospectus Department\n180 Varick Street, 2 nd Floor\nNew York, NY 10014\nGoldman Sachs & Co. LLC\nAttention: Prospectus Department\n200 West Street\nNew York, NY 10282\nTelephone: 1-866-471-2526\nEmail: prospectus-ny@ny.email.gs.com\nWells Fargo Securities\nc/o Equity Syndicate Department\n375 Park Avenue\nNew York, NY 10152\nTelephone: 1-800-326-5897\nEmail: cmclientsupport@wellsfargo.com\nImportant Information\nA registration statement relating to these securities has been filed with, and declared effective by, the SEC. The registration statement may be obtained free of charge at the SEC’s website at www.sec.gov under “Liberty Oilfield Services Inc.” This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Liberty Oilfield Services Inc.\nLiberty Oilfield Services Inc. is an independent provider of hydraulic fracturing services to onshore oil and natural gas exploration and production companies in North America.\nCautionary Statement Concerning Forward-Looking Statements\nCertain statements contained in this press release constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements, including statements regarding the closing of the initial public offering and Liberty’s use of proceeds from the offering, represent Liberty’s expectations or beliefs concerning future events, and it is possible that the results described in this press release will not be achieved. These forward-looking statements are subject to risks, uncertainties and other factors, many of which are outside of Liberty’s control, that could cause actual results to differ materially from the results discussed in the forward-looking statements.\nAny forward-looking statement speaks only as of the date on which it is made, and, except as required by law, Liberty does not undertake any obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise. New factors emerge from time to time, and it is not possible for Liberty to predict all such factors. When considering these forward-looking statements, you should keep in mind the risk factors and other cautionary statements in the prospectus filed with the SEC in connection with Liberty’s initial public offering. The risk factors and other factors noted in Liberty’s prospectus could cause its actual results to differ materially from those contained in any forward-looking statement.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111006270/en/\nLiberty Oilfield Services Inc.\nMichael Stock\nChief Financial Officer\n(303) 515-2894\nIR@libertyfrac.com\nSource: Liberty Oilfield Services Inc.", "external_links": ["http://www.businesswire.com/news/home/20180111006270/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51742323&newsitemid=20180111006270&lan=en-US&anchor=www.sec.gov&index=1&md5=26c6b8d8bb12b1d1826b6a6eb55ad5b6"], "published": "2018-01-12T10:01:00.000+02:00", "crawled": "2018-01-12T10:34:16.042+02:00", "highlightTitle": ""}