{"organizations": [], "uuid": "f336092b563626eea62d33c7f3e78190f054f833", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 362, "shares": 362, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218999239&w=1200&r=LYNXMPEE020C8", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-people-thomasmonson/mormon-president-thomas-monson-dies-aged-90-in-utah-church-idUSKBN1ES0HM", "country": "US", "domain_rank": 408, "title": "Mormon President Thomas Monson dies aged 90 in Utah: church", "performance_score": 3, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T10:44:00.000+02:00", "replies_count": 0, "uuid": "f336092b563626eea62d33c7f3e78190f054f833"}, "author": "", "url": "https://www.reuters.com/article/us-people-thomasmonson/mormon-president-thomas-monson-dies-aged-90-in-utah-church-idUSKBN1ES0HM", "ord_in_thread": 0, "title": "Mormon President Thomas Monson dies aged 90 in Utah: church", "locations": [], "entities": {"persons": [{"name": "thomas monson", "sentiment": "negative"}, {"name": "brendan o'brien", "sentiment": "none"}, {"name": "monson", "sentiment": "none"}, {"name": "alison williams", "sentiment": "none"}, {"name": "jesus christ", "sentiment": "none"}], "locations": [{"name": "utah", "sentiment": "none"}, {"name": "milwaukee", "sentiment": "none"}, {"name": "salt lake city", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 8:46 AM / Updated 6 hours ago Thomas Monson, president of the Mormon church, dies at 90 Reuters Staff 3 Min Read \n(Reuters) - Thomas Monson, leader of the Mormon church, has died at his home in Salt Lake City, Utah, the church said on Wednesday. He was 90. \nMonson became the 16th President of the Church of Jesus Christ of Latter-day Saints, as the religion is officially known, in 2008. As its leader, members of the faith considered him a prophet who received divine revelations. \nMonson died late on Tuesday surrounded by his family, the church said in a statement on its website. \n“President Monson had all the hallmarks of an unassuming servant of the Lord,” the church statement said. \nMormons worship Jesus, believing in a “restored” church, with living apostles and prophets. They believe in the Bible, as well as an additional book of scripture, the Book of Mormon. \nThe church, which was formally organized in 1830 in Upstate New York, reported last year to have 15.8 million members worldwide. They include the 2012 Republican presidential nominee and former Massachusetts Gov. Mitt Romney and actor Katherine Heigl. \nRomney praised Monson on Wednesday for his work and said he would be remembered for his love and compassion for “every one of God’s children.” FILE PHOTO: Church of Jesus Christ of Latter-day Saints First Counselor Henry B. Eyring (L), President Thomas S. Monson and Second Counselor Dieter F. Uchtdorf (R) attend the church's biannual general conference in Salt Lake City, Utah, U.S., April 5, 2014. REUTERS/Jim Urquhart/File Photo \n“Ann and I and our family join the widows and orphans and homeless and countless others who today mourn the life of a true prophet of God and apostle of the Lord Jesus Christ,” he said in statement on Facebook. \nBorn and raised in Salt Lake City, Monson was appointed in 1963 to the Quorum of the Twelve Apostles, the church’s second-highest governing body after the three-man First Presidency. Slideshow (2 Images) \nIn May 2015, the LDS Church said Monson was “feeling the effects of advancing age,” according to reports from the Salt Lake Tribune newspaper, and began cutting back public appearances and addresses to preserve his energy. \nUpon death, a Mormon president is succeeded by the head of the Quorum of the Twelve Apostles, a post currently held by the 93-year-old Russell Nelson. \nMonson’s predecessor Gordon Hinckley died at 97 in late 2007. \nAs well as his life-long dedication to his faith, Monson had a “broad business background” and led a successful career in the publishing industry, the church said on its website. \n“Do something for someone else on that day to make his or her life better. Find someone who is having a hard time, or is ill, or lonely, and do something for them. That’s all I would ask,” he said during an interview on his 81st birthday, according to the church. Reporting by Brendan O'Brien in Milwaukee; Editing by Bernadette Baum", "external_links": [], "published": "2018-01-03T10:44:00.000+02:00", "crawled": "2018-01-03T11:04:11.006+02:00", "highlightTitle": ""}