{"organizations": [], "uuid": "9f8c9dbcb487cdff77f9ce659e46a9986da271a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221296687&w=1200&r=LYNXMPEE0B02R", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-global-markets/stocks-resume-ascent-on-earnings-hopes-euro-gets-lift-from-ecb-idUKKBN1F103T", "country": "US", "domain_rank": 408, "title": "Stocks resume ascent on earnings hopes, euro gets lift from ECB", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T09:19:00.000+02:00", "replies_count": 0, "uuid": "9f8c9dbcb487cdff77f9ce659e46a9986da271a1"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-markets/stocks-resume-ascent-on-earnings-hopes-euro-gets-lift-from-ecb-idUKKBN1F103T", "ord_in_thread": 0, "title": "Stocks resume ascent on earnings hopes, euro gets lift from ECB", "locations": [], "entities": {"persons": [{"name": "hideyuki sano", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "tokyo stock exchange", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 1:11 AM / Updated an hour ago Stocks resume ascent on earnings hopes, euro gets lift from ECB Hideyuki Sano 6 Min Read \nTOKYO (Reuters) - Asian stocks resumed their ascent on Friday, supported by U.S. earnings optimism and higher oil prices while the euro edged up as the European Central Bank signalled an end to its massive stimulus. A woman, dressed in ceremonial kimonos, poses for her souvenir photo in front of an electronic board displaying the Nikkei average (top in R) after the ceremony which kicks off the first day of trading in 2018 at the Tokyo Stock Exchange in Tokyo, Japan January 4, 2018. REUTERS/Kim Kyung-Hoon \nEuropean shares are expected to rise, with futures for German’s Dax FDXc1 and France’s CAC FCEc1 up 0.3 percent and those for Britain’s FTSE FFIc1 up 0.1 percent. \nMSCI's broadest index of Asia-Pacific shares outside Japan .MIAPJ0000PUS rose 0.6 percent, following two straight sessions of decline and is on course to log its fifth straight week of gains. Japan's Nikkei .N225 , however, dropped for a third day, shedding 0.2 percent for the day and 0.3 percent for the week. \nChina’s custom-cleared trade data showed brisk growth in exports and imports in 2017, underscoring a global economy that continues to hum along nicely, though growth hit a speed bump in December after a surge in November. \nWall Street’s three major stock indexes hit record highs with earnings for S&P 500 companies expected to have increased by 11.8 percent in the recently-ended quarter, according to Thomson Reuters I/B/E/S. \nMSCI’s broadest gauge of the world’s stock markets .MIWD PUS also hit a record high on Thursday, having risen in seven of the eight business days so far this year for a total increase of 3.3 percent. \nThe energy sector led the gains as oil prices rose to three-year highs while interest rate sensitive-sectors, such as utilities and real estate companies, underperformed. \nU.S. Treasury yields fell on Thursday after China disputed a media report that its government officials had recommended the country slow or halt its purchases of U.S. bonds. \nChina’s currency regulator dismissed the report but said it is diversifying its foreign exchange reserves in order to safeguard their value. \n“China is starting to rebuild its forex reserves so it does not make sense economically that China would want to stop buying U.S. Treasuries,” said Shuji Shirota, head of macro economics strategy group at HSBC in Tokyo. \nThe 10-year Treasuries yield stood at 2.550 percent US10YT=RR, off Wednesday’s ten-month high of 2.597 percent. \nOn the other hand, the benchmark German 10-year Bunds yield hit a five-month high of 0.532 percent DE10YT=TWEB after accounts of the ECB’s December meeting showed it thinks it should revisit its communication stance in early 2018. \nWith the euro zone seeing its best growth in a decade, the ECB should gradually shift its stance to avoid a more disruptive move later and look at a broader revision of its policy guidance to reduce the focus on bond purchases and raise the emphasis on interest rates, they showed. Traders work on the floor of the New York Stock Exchange, (NYSE) in New York, U.S., January 8, 2018. REUTERS/Brendan McDermid \n“I would imagine the ECB is dying to give it a try to end negative interest rates after September. If that doesn’t go down well in markets, the bank will modify its message but it should want to at least test the water,” said Yoshinori Shigemi, global market strategist at JPMorgan Asset Management. \nThe ECB has pledged to continue its bond purchase programme at least until September and investors expect any rate hike to take place next year. \n“Given the ECB’s track record of reacting only very gradually, we continue to see an end to QE in December and a first rate hike in June 2019, but the likelihood of an earlier normalisation has logically increased,” Anatoli Annenkov, senior European economist at Societe Generale in London wrote in report. \nThe euro’s overnight index swap rates EUROIS have risen sharply this week as traders price in higher chance of a rate hike early next year. \nThe euro EUR= rose back above $1.2 and last traded at $1.2048, near its three-month high of $1.2089 touched last week. \nOn the other hand, the dollar was broadly weak after U.S. wholesale price dipped in December from November, reinforcing investors’ expectations of a tame inflation. \nThe U.S. currency slipped to a six-week low of 111.05 yen JPY= on Thursday and last stood at 111.21 yen. \nFriday will see U.S. data on consumer inflation and retail sales, both at 1330 GMT. \nBitcoin flirted with this year’s low, having fallen 11.1 percent on Thursday after the government in South Korea, a major source of digital currency demand, unveiled plans to ban cryptocurrency trading. \nOn the Bitstamp Exchange, it traded at $13,696, up 3.41 percent but not far from Thursday’s low of $12,800, which was its lowest level since Dec. 31. \nOil prices retreated from big gains the previous day but still traded near three-year highs on signs of tightening supply in the United States. \nU.S. West Texas Intermediate (WTI) crude futures CLc1 changed hands at $63.42, down 0.6 percent on the day. The day before they hit its strongest since late 2014 at $64.77 a barrel. \nBrent crude futures LCOc1 ticked down 0.2 percent to $69.13 a barrel after hitting $70.05 a barrel during the previous session, its highest level since November 2014. Editing by Sam Holmes", "external_links": [], "published": "2018-01-12T09:19:00.000+02:00", "crawled": "2018-01-12T09:44:28.003+02:00", "highlightTitle": ""}