{"organizations": [], "uuid": "f4dc6469a65a719358b901aa5447df62a93c99ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-first-hawaiian-inc-cfo-to-leave-the-company-in-january-2018.html", "country": "US", "domain_rank": 767, "title": "First Hawaiian, Inc. CFO to Leave the Company in January 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-09T02:06:00.000+02:00", "replies_count": 0, "uuid": "f4dc6469a65a719358b901aa5447df62a93c99ee"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-first-hawaiian-inc-cfo-to-leave-the-company-in-january-2018.html", "ord_in_thread": 0, "title": "First Hawaiian, Inc. CFO to Leave the Company in January 2018", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HONOLULU, Jan. 08, 2018 (GLOBE NEWSWIRE) -- First Hawaiian, Inc. (NASDAQ:FHB) announced today that Michael Ching, Chief Financial Officer and Treasurer of First Hawaiian, Inc. and First Hawaiian Bank, will be leaving the company. His last day of employment will be January 31, 2018. He will continue to assist the company on a consulting basis, and, effective February 1, Eric Yeaman, President and Chief Operating Officer, will serve as acting CFO as the company conducts a search for a permanent replacement.\nMichael Ching joined the company in June 2015 and played an important role in First Hawaiian Bank’s transition from a wholly owned subsidiary of BNP Paribas to a publicly traded company with First Hawaiian, Inc.’s initial public offering “IPO” in August of 2016.\n“Mike has played an integral role at First Hawaiian — we will miss his expertise, great sense of humor and collaborative nature,” said Bob Harrison, chairman and CEO. “We would like to thank Mike for his contributions and wish him well.”\n“It’s been exciting to be a part of First Hawaiian’s journey over the last two and a half years, especially the work and development that went into the execution of the company’s successful IPO. I am looking forward to applying the experience I have gained in this process as I take on my next exciting venture,” said First Hawaiian CFO Michael Ching. “Leaving the Bank will be very difficult, and I wish the best for all of my FHB colleagues who have been like family.”\nFirst Hawaiian, Inc. (NASDAQ:FHB) is a bank holding company headquartered in Honolulu, Hawaii. Its principal subsidiary, First Hawaiian Bank was founded in 1858 as Bishop & Co., and today is Hawaii’s oldest and largest financial institution with branch locations throughout Hawaii, Guam and Saipan. The company offers a comprehensive suite of banking services to consumer and commercial customers including deposit products, loans, wealth management, insurance, trust, retirement planning, credit card and merchant processing services. Customers may also access their accounts through ATMs, online and mobile banking channels. For more information about First Hawaiian Inc., visit www.fhb.com .\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements reflect our current views with respect to, among other things, future events and our financial performance. These statements are often, but not always, made through the use of words or phrases such as “may”, “might”, “should”, “could”, “predict”, “potential”, “believe”, “expect”, “continue”, “will”, “anticipate”, “seek”, “estimate”, “intend”, “plan”, “projection”, “would”, “annualized” and “outlook”, or the negative version of those words or other comparable words or phrases of a future or forward-looking nature. These forward-looking statements are not historical facts, and are based on current expectations, estimates and projections about our industry, management's beliefs and certain assumptions made by management, many of which, by their nature, are inherently uncertain and beyond our control. Accordingly, we caution you that any such forward-looking statements are not guarantees of future performance and are subject to risks, assumptions, estimates and uncertainties that are difficult to predict. Although we believe that the expectations reflected in these forward-looking statements are reasonable as of the date made, actual results may prove to be materially different from the results expressed or implied by the forward-looking statements. For a discussion of the risks and important factors that could affect our future results and financial condition, see our U.S. Securities and Exchange Commission (“SEC”) filings, including, but not limited to, our annual report on Form 10-K for the year ended December 31, 2016.\nInvestor Relations Contact:\nKevin Haseyama, CFA\n(808) 525-6288\nkhaseyama@fhb.com\nMedia Contact:\nSusan Kam\n(808) 525-6254\nskam@fhb.com\nSource:First Hawaiian, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=ZVxLheUQDIVWPVdttN1CPlZF8jRKbr_QzsuXPpoPUPKsmaWb7VpE1SMwtplf7Go9Q0y74qhGu1sa6d8PSF97uA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e5063e6e-53c2-413f-8727-03de84dea180", "https://www.globenewswire.com/Tracker?data=NfET2eVtXxOeYKQPBCyvH-TRUwsl7nFO9ieRDFAz-beEKK3Aw6MIS1OTAdzgY8UMfhBAtQG7iRCDF44tOVnqgg==", "https://www.globenewswire.com/Tracker?data=Ra7jLevkGUyA9yfLg6LJzrCdv5yOzd3379mVce4NOJ_X2Twx5snJ8uKzNa8iXKfJ0i-hmqC8VRSk89bkzviCGg=="], "published": "2018-01-09T02:06:00.000+02:00", "crawled": "2018-01-09T09:41:25.512+02:00", "highlightTitle": ""}