{"organizations": [], "uuid": "98addd37d1752247937dd6f591ff7176f479866f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226761510&w=1200&r=LYNXMPEE0U00V", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-china-britain/uk-pm-may-says-she-wants-free-trade-deal-with-china-idUSKBN1FK023", "country": "US", "domain_rank": 408, "title": "UK PM May says she wants free trade deal with China", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T08:25:00.000+02:00", "replies_count": 0, "uuid": "98addd37d1752247937dd6f591ff7176f479866f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-britain/uk-pm-may-says-she-wants-free-trade-deal-with-china-idUSKBN1FK023", "ord_in_thread": 0, "title": "UK PM May says she wants free trade deal with China", "locations": [], "entities": {"persons": [], "locations": [{"name": "china wuhan", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "wuhan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "royal air force", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING, China (Reuters) - China’s relations with Britain will remain unchanged through Brexit, Premier Li Keqiang said on Wednesday, as British Prime Minister Theresa May kicked off a three-day visit to China, where she aims to sign nine billion pounds in deals.\nBritain is trying to reinvent itself as a global trading nation after a 2016 referendum decision to leave the European Union, but Brexit has unnerved Beijing, even as London hopes to sign a free trade deal with the world’s second-largest economy.\nSpeaking to reporters after meeting May in Beijing’s Great Hall of the People, Li proffered support for relations between the two countries, which both like to refer to as being in a “golden era”.\n“Our relationship will not change because of changes in Britain-Europe ties,” Li said.\nBut he acknowledged there would need to be an adaption.\n“While we must adapt to these changes, we will assess and talk about future bilateral trade and investment arrangements, to continue to push forward China-Britain relations, including trade and business ties.”\nMay, who is perceived to be less keen on courting China than her predecessor, David Cameron, said she was committed to deepening the relationship in light of Brexit and would explore all options in future trade ties.\n“We are determined to deepen our trading relationship even further and we are ambitious for what our future trade relationship will be,” she said.\nMay said the two countries would agree on more than nine billion pounds worth of deals during her visit, and that China had agreed to lift a ban on British beef exports within the next six months.\n“We have also agreed to open up the Chinese market to enable our great UK financial services expertise to reach more Chinese consumers.”\nSpeaking earlier on her way to the central Chinese city of Wuhan, May said Britain was seeking a free trade agreement with China, adding that more should be done immediately to open up market access for British firms.\n“China is a country that we want to do a trade deal with,” May told reporters aboard her Royal Air Force jet on the way to the university city.\nSlideshow (2 Images) “But, I think that there is more we can be doing in the interim...in terms of looking at potential barriers to trade and the opening up of markets to ensure...British businesses able to do good trade into China.”\nChina accounts for just a small proportion of British exports, 3.1 percent in 2016, versus 43 percent for the European Union.\nWhile diplomatic sources say China has expressed willingness to talk about a future free trade deal with Britain, formal talks cannot begin until Britain officially leaves the EU next year. Free trade talks typically take many years to conclude.\nBritain has also pushed a strong message to Chinese companies that it is fully open for business.\nNotable Chinese investments in Britain include the Hinkley C nuclear power station which is being built by China General Nuclear Power Corp and the British arm of France’s EDF ( EDF.PA ), while British firms, such as Rolls Royce ( RR.L ), have won large deals from Chinese firms to supply items like plane engines.\nBoth May and senior Chinese officials have restated their commitment to the “golden era” in ties but a row over May’s decision to delay approval for the Chinese-funded Hinkley nuclear plant in late 2016 chilled relations.\nHowever, Britain was the first Western country to sign up to the China-backed Asian Infrastructure Investment Bank and it sent Finance Minister Philip Hammond to a Beijing summit last year about President Xi Jinping’s flagship ‘Belt and Road Initiative’ - a trillion-dollar infrastructure-led push to build a modern Silk Road.\nMay said the Belt and Road had huge potential and that Britain was a “natural partner”, but cautioned that projects had to carried out in the proper way.\n“We’ve discussed how the U.K. and China will continue to work together to identify how best we can cooperate on the Belt and Road initiative across the region and ensure it meets international standards,” she said in Beijing.\nSpeaking earlier, May said she would raise the future of Hong Kong in her meetings with Xi, underlining Britain’s commitment to the ‘one country, two systems’ rule in the former British colony.\nBritain’s last governor in Hong Kong before it was handed back to the Chinese, Chris Patten, had written to May on Monday urging her to raise concerns over the “increasing threats to the basic freedoms, human rights and autonomy” in the territory.\nHong Kong was rocked by pro-democracy protests in 2014 in the largest show of defiance against Beijing rule since 1997. The government has since cracked down on activists, including last week banning one from running in a by-election in March.\nRelated Coverage China's Li says ties with Britain will remain unchanged through Brexit Reporting by William James and Ben Blanchard; Additional reporting by Philip Wen in BEIJING and Brenda Goh in SHANGHAI; Editing by Paul Tait and Clarence Fernandez\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T08:25:00.000+02:00", "crawled": "2018-01-31T04:26:36.045+02:00", "highlightTitle": ""}