{"organizations": [], "uuid": "6a994db513b602d3521bb31b298d60824b584c5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-mgic-investment-corporation-schedules-4th-quarter-2017-earnings-call-and-releases-monthly-operating-statistics.html", "country": "US", "domain_rank": 767, "title": "MGIC Investment Corporation Schedules 4th Quarter 2017 Earnings Call and Releases Monthly Operating Statistics", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:45:00.000+02:00", "replies_count": 0, "uuid": "6a994db513b602d3521bb31b298d60824b584c5b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-mgic-investment-corporation-schedules-4th-quarter-2017-earnings-call-and-releases-monthly-operating-statistics.html", "ord_in_thread": 0, "title": "MGIC Investment Corporation Schedules 4th Quarter 2017 Earnings Call and Releases Monthly Operating Statistics", "locations": [], "entities": {"persons": [], "locations": [{"name": "milwaukee", "sentiment": "none"}], "organizations": [{"name": "mtg", "sentiment": "negative"}, {"name": "mgic investment corporation", "sentiment": "negative"}, {"name": "mgic investment corporation schedules", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "mgic", "sentiment": "none"}, {"name": "newsroom", "sentiment": "none"}, {"name": "eastern time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILWAUKEE, Jan. 9, 2018 /PRNewswire/ -- MGIC Investment Corporation (NYSE: MTG) has announced plans to release its 4 th quarter 2017 financial results before the market opens on Thursday, January 18, 2018. A conference call/webcast has been scheduled for 10:00 a.m. Eastern Time to discuss the Company's results for the quarter ended December 31, 2017.\nIndividuals interested in joining over the phone should dial 1-844-231-8825 ten minutes before the conference call begins. The call is also being webcast and can be accessed via the company's website http://mtg.mgic.com under Newsroom. A replay of the webcast will be available on the company's website through February 18, 2018, under Newsroom.\nMGIC also today issued an Operational Summary of its insurance subsidiaries for the month of December 2017 for their primary mortgage insurance. The summary is also available on the company's website under Newsroom, Press Releases.\nThe information concerning new delinquency notices and cures is compiled from reports received from loan servicers. The level of new notice and cure activity reported in a particular month can be influenced by, among other things, the date on which a servicer generates its report, the accuracy of the data provided by servicers, the number of business days in a month, transfers of servicing between loan servicers, and whether all servicers have provided the reports in a given month.\nDecember 2017\nDecember 2016\nChange\nInsurance in Force (billions)\n$194.9\n$182.0\n7.1%\nFlow Only\n$186.9\n$172.8\n8.2%\nBeginning Primary Delinquent Inventory (# of loans)\n46,900\n50,136\n(6.5%)\nPlus: New Delinquency Notices – Non-Hurricane Impacted Areas (1)\n4,723\n5,213\n(9.4%)\nPlus: New Delinquency Notices - Hurricane Impacted Areas (1)\n1,375\n698\n97.0%\nLess: Cures\n5,883\n4,869\n20.8%\nLess: Paids (including those charged to a deductible or captive reinsurer)\n526\n838\n(37.2%)\nLess: Rescissions and Denials\n33\n58\n(43.1%)\nEnding Primary Delinquent Inventory (# of loans)\n46,556\n50,282\n(7.4%)\n(1)\nHurricane impacted areas are locations that the Federal Emergency Management Agency has declared Individual Assistance Disaster Areas as a result of hurricanes Harvey, Irma and Maria. There were 12,446 and 7,162 loans in our Ending Primary Delinquent Inventory as December 31, 2017 and 2016, respectively, that were located in these areas. Based on our analysis and past experience, we do not expect the increased level of notices received in those areas to result in a material increase in our incurred losses or paid claims. The Private Mortgage Insurer Eligibility Requirements of Fannie Mae and Freddie Mac require us to maintain significantly more \"Minimum Required Assets\" for delinquent loans than for performing loans. We expect the increase in delinquency notices to result in a temporary increase in \"Minimum Required Assets\" and a decrease in the level of our excess \"Available Assets\" under the PMIERs. Due to the suspension of certain foreclosures by the GSEs, our receipt of claims associated with foreclosed mortgages in the hurricane-affected areas may be delayed. The following factors could cause our actual results to differ from our expectations in the forward looking statements in this press release:\n•\nThird party reports that indicate the extent of flooding in the hurricane-affected areas may be understated.\n•\nHome values in hurricane-affected areas may decrease at the time claims are filed from their current levels thereby adversely affecting our ability to mitigate loss.\n•\nHurricane-affected areas may experience deteriorating economic conditions resulting in more borrowers defaulting on their loans in the future (or failing to cure existing defaults) than we currently expect.\n•\nIf an insured contests our claim denial or curtailment, there can be no assurance we will prevail. We describe how claims under our policy are affected by damage to the borrower's home in our Current Report on Form 8-K filed with the SEC on September 14, 2017.\nAbout MGIC\nMGIC ( www.mgic.com ), the principal subsidiary of MGIC Investment Corporation, serves lenders throughout the United States, Puerto Rico, and other locations helping families achieve homeownership sooner by making affordable low-down-payment mortgages a reality. At December 31, 2017, MGIC had $194.9 billion of primary insurance in force covering approximately one million mortgages.\nFrom time to time MGIC Investment Corporation releases important information via postings on its corporate website, including corrections of previous disclosures, without making any other disclosure and intends to continue to do so in the future. Investors and other interested parties are encouraged to enroll to receive automatic email alerts and Really Simple Syndication (RSS) feeds regarding new postings. Enrollment information can be found at http://mtg.mgic.com under Investor Information.\nView original content: http://www.prnewswire.com/news-releases/mgic-investment-corporation-schedules-4th-quarter-2017-earnings-call-and-releases-monthly-operating-statistics-300579191.html\nSOURCE MGIC Investment Corporation", "external_links": ["http://mtg.mgic.com/", "http://www.prnewswire.com/news-releases/mgic-investment-corporation-schedules-4th-quarter-2017-earnings-call-and-releases-monthly-operating-statistics-300579191.html", "http://www.mgic.com/"], "published": "2018-01-09T14:45:00.000+02:00", "crawled": "2018-01-09T15:41:58.026+02:00", "highlightTitle": ""}