{"organizations": [], "uuid": "e8e2cc2c1b3c456242c3e8ccf7f021bf4e8c5f12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-audax-recapitalizes-belmont-instrument-corporation.html", "country": "US", "domain_rank": 767, "title": "Audax Recapitalizes Belmont Instrument Corporation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.04, "site_type": "news", "published": "2018-01-19T06:06:00.000+02:00", "replies_count": 0, "uuid": "e8e2cc2c1b3c456242c3e8ccf7f021bf4e8c5f12"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-audax-recapitalizes-belmont-instrument-corporation.html", "ord_in_thread": 0, "title": "Audax Recapitalizes Belmont Instrument Corporation", "locations": [], "entities": {"persons": [{"name": "belmont", "sentiment": "none"}, {"name": "geoffrey s. rehnert", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "billerica", "sentiment": "none"}, {"name": "ma", "sentiment": "none"}], "organizations": [{"name": "mirus capital advisors", "sentiment": "negative"}, {"name": "audax recapitalizes belmont instrument corporation", "sentiment": "negative"}, {"name": "audax group", "sentiment": "none"}, {"name": "audax private equity", "sentiment": "none"}, {"name": "belmont", "sentiment": "none"}, {"name": "ems", "sentiment": "none"}, {"name": "belmont instrument corporation", "sentiment": "none"}, {"name": "audax", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 18, 2018 /PRNewswire/ -- Mirus Capital Advisors announced today that it acted as the exclusive financial advisor to Belmont Instrument Corporation (\"Belmont\"), in its recapitalization with Audax Private Equity (\"Audax\"). Belmont is a leading provider of fluid warming infusion systems sold into acute care, military, and EMS settings. Headquartered in Billerica, MA, it is a technology leader in rapid infusion systems used to treat critically injured patients experiencing material blood loss. Audax partnered with Belmont's private owners in connection with the recapitalization.\nGeoffrey S. Rehnert, co-chief executive officer, Audax Group, said, \"Belmont is a best-in-class provider of life-sustaining fluid warming infusion systems. We are excited to partner with management to build on Belmont's leading position and accelerate growth by continuing its investment in new product development, and global marketing and salesforce expansion, and through acquisition of complementary critical care and patient warming medical technologies.\"\n\"Audax was a perfect fit for Belmont,\" commented Patrick West, a partner at Mirus who leads the firm's med-tech practice. \"Our client was seeking a challenging trifecta: a financial outcome fully commensurate with the value of the business that the Belmont team built, a buyer that would honor the legacy of the founders, and a commitment to the company's location and employees. We are thrilled that we were able to help deliver exactly that. It is going to be exciting to see how Audax builds off Belmont's superior brand and operational foundation given its impressive track record in the space. We believe this transaction further establishes Mirus as the go-to boutique advisor for middle market med-tech transactions.\"\n\"The Mirus team was very professional and effective throughout,\" commented Andrew Jay, one of Belmont's directors. \"We ran a competitive process when selecting our advisor, and the Mirus team stood out from the beginning. They brought a unique combination of committed competitiveness, deep domain expertise and a real personal touch that was essential in meeting the goals of the shareholders.\"\nAbout Mirus Capital Advisors\nSuccessful business owners have turned to Mirus Capital Advisors for more than 30 years to help them realize their ultimate accomplishment – the sale of their business. As a mid-market investment bank focused on mergers and acquisitions, Mirus drives successful deals for companies in the consumer, industrial, business services, healthcare and technology industries. Mirus has proven time and again that its deep industry expertise, focus on relationships, thorough preparation and unwavering commitment to every deal lead to meaningful accomplishments for business owners.\nCONTACT: Adrienne Locke, locke@merger.com\nView original content: http://www.prnewswire.com/news-releases/audax-recapitalizes-belmont-instrument-corporation-300585138.html\nSOURCE Mirus Capital Advisors, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/audax-recapitalizes-belmont-instrument-corporation-300585138.html"], "published": "2018-01-19T06:06:00.000+02:00", "crawled": "2018-01-19T05:16:46.008+02:00", "highlightTitle": ""}