{"organizations": [], "uuid": "222a6f6322656b684ee6869cd5be946e9dccbf47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-german-american-bancorp-inc-gabc-posts-8th-consecutive-year-of-record-annual-earnings-announces-15-percent-cash-dividend.html", "country": "US", "domain_rank": 767, "title": "German American Bancorp, Inc. (GABC) Posts 8th Consecutive Year of Record Annual Earnings & Announces 15% Cash Dividend Increase", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T03:05:00.000+02:00", "replies_count": 0, "uuid": "222a6f6322656b684ee6869cd5be946e9dccbf47"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-german-american-bancorp-inc-gabc-posts-8th-consecutive-year-of-record-annual-earnings-announces-15-percent-cash-dividend.html", "ord_in_thread": 0, "title": "German American Bancorp, Inc. (GABC) Posts 8th Consecutive Year of Record Annual Earnings & Announces 15% Cash Dividend Increase", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JASPER, Ind., Jan. 29, 2018 (GLOBE NEWSWIRE) -- German American Bancorp, Inc. (NASDAQ:GABC) reported that the Company has achieved record annual earnings for the year ended on December 31, 2017, marking the 8th consecutive year of record performance. This level of annual earnings performance resulted in a 11.6% return on shareholders’ equity for 2017, noting the 13 th consecutive fiscal year in which the Company has delivered double-digit returns on shareholders’ equity. The Company also announced a 15% increase in its quarterly cash dividend.\nThe Company’s 2017 net income of $40.7 million, or $1.77 per share, was an increase of approximately $5.5 million, or 13% on a per share basis, over its previous record annual net income of $35.2 million, or $1.57 per share, reported in 2016. Current year fourth quarter earnings of $11.6 million, or $0.51 per share, represented an increase of approximately 16%, on a per share basis, relative to 2016 fourth quarter results of $10.1 million, or $0.44 per share. The 2017 reported fourth quarter and year-to-date net income were positively impacted by a $2.3 million net tax benefit resulting from the revaluation of the Company’s deferred tax assets and liabilities related to the federal tax reform legislation enacted during the fourth quarter of 2017.\nIn addition to the federal income tax benefit noted above, the record financial performance achieved in 2017 was largely attributable to a $5.0 million increased level of net interest income driven primarily by a higher level of average loans outstanding. 2017 year-end loans outstanding increased by approximately $151.6 million, or 8%, from the prior year-end level. The year-over-year increase in loans outstanding was attributable to strong organic loan growth broadly based across the Company’s entire market area and within all loan categories.\nCommenting on the Company’s eighth consecutive year of record financial performance in 2017, Mark A. Schroeder, German American’s Chairman & CEO, stated, \"We were very pleased to be able to continue our pattern of record financial performance in the past year and were extremely encouraged to see a further strengthening of economic growth throughout our market area in 2017. As evidenced by the double-digit annualized loan growth we experienced in the last half of the year, both business and consumer clients throughout our market area are feeling more confident in the growth potential and vibrancy of the economy. Based on the exceptionally strong growth in both loans and deposits we experienced in 2017, a strong and growing pipeline at year-end of potential future loan growth, and an expectation of accelerated overall economic growth resulting from the recent federal tax reform legislation, we have a positive outlook regarding our ability to continue this record of exceptional financial performance in 2018 and beyond.”\nThe Company also announced a 15% increase in its regular quarterly cash dividend, as its Board of Directors declared a regular quarterly cash dividend of $0.15 per share, which will be payable on February 20, 2018 to shareholders of record as of February 10, 2018.\nBalance Sheet Highlights\nTotal assets for the Company increased to $3.144 billion at December 31, 2017, representing an increase of $71.5 million, or 9% on an annualized basis, compared with September 30, 2017 and an increase of $188.4 million, or 6%, compared with December 31, 2016.\nAt December 31, 2017, total loans increased $55.3 million, or 11% on an annualized basis, compared with September 30, 2017 and increased $151.6 million, or 8%, compared with December 31, 2016. The increase during the fourth quarter of 2017 was largely related to an increase of approximately $11.7 million, or 10% on an annualized basis, of commercial and industrial loans, an increase of $28.0 million, or 12% on an annualized basis, of commercial real estate loans, an increase of $6.2 million, or 8% on an annualized basis, of agricultural loans and an increase of $9.4 million, or 10% on annualized basis, of retail loans. The increase was broadly based across the Company's entire market area.\nEnd of Period Loan Balances 12/31/2017 9/30/2017 12/31/2016 (dollars in thousands) Commercial & Industrial Loans $ 486,668 $ 474,917 $ 457,372 Commercial Real Estate Loans 926,729 898,752 856,094 Agricultural Loans 333,227 327,026 303,128 Consumer Loans 219,662 209,537 193,520 Residential Mortgage Loans 178,733 179,481 183,290 $ 2,145,019 $ 2,089,713 $ 1,993,404 Non-performing assets totaled $11.9 million at December 31, 2017 compared to $10.2 million of non-performing assets at September 30, 2017 and $4.0 million at December 31, 2016. Non-performing assets represented 0.38% of total assets at December 31, 2017 compared to 0.33% of total assets at September 30, 2017 and 0.14% of total assets at December 31, 2016. Non-performing loans totaled $11.8 million at December 31, 2017 compared to $9.7 million at September 30, 2017 and $3.8 million at December 31, 2016. Non-performing loans represented 0.55% of total loans at December 31, 2017 compared to 0.46% at September 30, 2017 and 0.19% at December 31, 2016. The increase in non-performing assets during the fourth quarter of 2017 was primarily attributable to a single commercial lending relationship that was downgraded during the quarter. The increase in non-performing assets during the year ended December 31, 2017 compared with year-end 2016 was primarily related to two commercial lending relationships.\nNon-performing Assets (dollars in thousands) 12/31/2017 9/30/2017 12/31/2016 Non-Accrual Loans $ 11,091 $ 9,177 $ 3,793 Past Due Loans (90 days or more) 719 474 2 Total Non-Performing Loans 11,810 9,651 3,795 Other Real Estate 54 568 242 Total Non-Performing Assets $ 11,864 $ 10,219 $ 4,037 Restructured Loans $ 149 $ 152 $ 28 The Company’s allowance for loan losses totaled $15.7 million at December 31, 2017 compared to $15.3 million at September 30, 2017 and $14.8 million at December 31, 2016. The allowance for loan losses represented 0.73% of period-end loans at December 31, 2017 compared with 0.73% of period-end loans at September 30, 2017 and 0.74% of period-end loans at December 31, 2016. Under acquisition accounting treatment, loans acquired are recorded at fair value which includes a credit risk component, and therefore the allowance on loans acquired is not carried over from the seller. The Company held a net discount on acquired loans of $7.6 million as of December 31, 2017, $8.0 million at September 30, 2017 and $10.0 million at December 31, 2016.\nTotal deposits increased $59.5 million, or 10% on an annualized basis, as of December 31, 2017 compared with September 30, 2017 and increased $134.5 million, or 6%, compared with December 31, 2016.\nEnd of Period Deposit Balances 12/31/2017 9/30/2017 12/31/2016 (dollars in thousands) Non-interest-bearing Demand Deposits $ 606,134 $ 589,315 $ 571,989 IB Demand, Savings, and MMDA Accounts 1,490,033 1,454,073 1,399,381 Time Deposits < $100,000 198,646 204,946 207,824 Time Deposits > $100,000 189,239 176,238 170,357 $ 2,484,052 $ 2,424,572 $ 2,349,551 Results of Operations Highlights - Year ended December 31, 2017\nNet income for the year ended December 31, 2017 totaled $40,676,000 or $1.77 per share, an increase of $5,492,000, or approximately 13% on a per share basis, from the year ended December 31, 2016 net income of $35,184,000 or $1.57 per share. The 2017 results of operations were positively impacted by the revaluation of the Company's deferred tax assets and deferred tax liabilities related to the federal tax reform legislation enacted during the fourth quarter of 2017. The revaluation resulted in a net tax benefit of $2,284,000, or approximately $0.10 per share during 2017. In addition, the 2016 results of operations included only ten month's operations of River Valley Bancorp, which the Company acquired effective March 1, 2016.\nSummary Average Balance Sheet (Tax-equivalent basis / dollars in thousands) Year Ended December 31, 2017 Year Ended December 31, 2016 Principal\nBalance Income/\nExpense Yield/Rate Principal\nBalance Income/\nExpense Yield/Rate Assets Federal Funds Sold and Other Short-term Investments $ 12,405 $ 134 1.09% $ 22,180 $ 74 0.33% Securities 744,985 23,595 3.17% 723,044 21,102 2.92% Loans and Leases 2,036,717 92,449 4.54% 1,904,779 86,755 4.55% Total Interest Earning Assets $ 2,794,107 $ 116,178 4.16% $ 2,650,003 $ 107,931 4.07% Liabilities Demand Deposit Accounts $ 572,356 $ 513,199 IB Demand, Savings, and MMDA Accounts $ 1,442,474 $ 3,971 0.28% $ 1,322,593 $ 2,515 0.19% Time Deposits 380,316 3,123 0.82% 414,100 2,672 0.65% FHLB Advances and Other Borrowings 233,315 4,027 1.73% 242,483 3,274 1.35% Total Interest-Bearing Liabilities $ 2,056,105 $ 11,121 0.54% $ 1,979,176 $ 8,461 0.43% Cost of Funds 0.40% 0.32% Net Interest Income $ 105,057 $ 99,470 Net Interest Margin 3.76% 3.75% During the year ended December 31, 2017, net interest income totaled $99,909,000 representing an increase of $5,005,000, or 5%, from the year ended December 31, 2016 net interest income of $94,904,000. The increased level of net interest income during 2017 compared with 2016 was driven primarily by a higher level of earning assets resulting from organic loan growth and the acquisition of River Valley Bancorp effective March 1, 2016.\nThe tax equivalent net interest margin for the year ended December 31, 2017 was 3.76% compared to 3.75% in 2016. The modest increase in the net interest margin during 2017 compared with the prior year was primarily attributable to an improved yield on the Company's securities portfolio combined with a larger loan portfolio, partially offset by a higher cost of funds and a lower level of accretion of loan discounts on acquired loans. Accretion of loan discounts on acquired loans contributed approximately 9 basis points to the net interest margin during 2017 and 13 basis points in 2016. The Company's cost of funds increased approximately 8 basis points during 2017 compared with 2016. The higher cost of funds was largely attributable to an increase in short-term market interest rates over the past several quarters.\nDuring the year ended December 31, 2017, non-interest income declined less than 1% from the year ended December 31, 2016.\nYear Ended Year Ended Non-interest Income 12/31/2017 12/31/2016 (dollars in thousands) Trust and Investment Product Fees $ 5,272 $ 4,644 Service Charges on Deposit Accounts 6,178 5,973 Insurance Revenues 7,979 7,741 Company Owned Life Insurance 1,341 987 Interchange Fee Income 4,567 3,627 Other Operating Income 2,641 3,703 Subtotal 27,978 26,675 Net Gains on Loans 3,280 3,359 Net Gains on Securities 596 1,979 Total Non-interest Income $ 31,854 $ 32,013 Trust and investment product fees increased $628,000, or 14%, during 2017 compared with 2016. The increase was primarily attributable to fees generated from increased assets under management in the Company's wealth advisory group.\nCompany owned life insurance revenue increased $354,000, or 36%, during 2017, compared with 2016. The increase was largely related to death benefits received from life insurance policies during 2017.\nInterchange fee income increased $940,000, or 26%, during 2017 compared with 2016. The increase was attributable to increased card utilization by customers and a full year of operations from River Valley included in 2017 compared with ten months of operations of River Valley included in 2016.\nOther operating income declined $1,062,000, or 29%, during 2017 compared with 2016. The decline was largely attributable to decreased fees and fair value adjustments associated with swap transactions with loan customers.\nThe Company realized a net gain on sales of securities of $596,000 during 2017 compared with a net gain on the sale of securities of $1,979,000 in 2016.\nDuring 2017, non-interest expense increased $1,216,000, or 2%, compared with 2016. During 2016, the Company recorded costs related to the River Valley merger transaction that totaled $4,318,000.\nYear Ended Year Ended Non-interest Expense 12/31/2017 12/31/2016 (dollars in thousands) Salaries and Employee Benefits $ 46,642 $ 43,961 Occupancy, Furniture and Equipment Expense 9,230 8,558 FDIC Premiums 954 1,151 Data Processing Fees 4,276 5,686 Professional Fees 2,817 3,672 Advertising and Promotion 3,543 2,657 Intangible Amortization 942 1,062 Other Operating Expenses 9,399 9,840 Total Non-interest Expense $ 77,803 $ 76,587 Salaries and benefits increased $2,681,000, or 6%, during 2017 compared with the 2016. The increase in 2017 compared with 2016 was primarily attributable to having River Valley's operations included for the entire year in 2017 compared with ten months of 2016 combined with an increased number of full-time equivalent employees and higher levels of employee benefit costs including health insurance costs. During 2016, salary and benefit expense included $1,934,000 in settlement costs for various employment and benefit arrangements related to the River Valley merger.\nOccupancy, furniture and equipment expense increased $672,000, or 8%, in 2017 compared with 2016. This increase was largely related to capital investments into the Company's branch network and to the operation of River Valley's 15 branch network during all of 2017.\nData processing fees declined $1,410,000, or 25%, in 2017 compared with 2016. The decline during 2017 compared with 2016 was primarily related to expenses totaling $1,288,000 associated with the acquisition of River Valley that were incurred during 2016.\nProfessional fees declined $855,000, or 23%, in 2017 compared with 2016. The decline during 2017 compared with 2016 was attributable to expenses totaling $770,000 associated with the acquisition of River Valley.\nAdvertising and promotion increased $886,000 during 2017 compared with 2016. The primary driver of the increase in advertising and promotion was a contribution expense of $773,000 related to the donation of a former branch facility to a municipality in one of the Company's market areas.\nDuring the year ended December 31, 2017, the Company recorded a provision for income tax expense of $11,534,000 compared with a provision for income tax expense of $13,946,000 during 2016. The 2017 income tax provision was positively impacted by the revaluation of the Company's deferred tax assets and deferred tax liabilities related to federal tax reform legislation enacted during the fourth quarter of 2017. The revaluation resulted in a net tax benefit of $2,284,000 during the fourth quarter of 2017. The revaluation of the Company’s deferred tax assets and deferred tax liabilities at year-end 2017 was based on reasonable estimates by the Company of certain income tax effects of the new federal tax reform legislation. These effects may be subject to adjustment as the Company completes its evaluation during 2018.\nResults of Operations Highlights – Quarter ended December 31, 2017\nNet income for the quarter ended December 31, 2017 totaled $11,621,000, or $0.51 per share, which represented an increase of approximately 21% on a per share basis compared with the third quarter 2017 net income of $9,660,000, or $0.42 per share, and an increase of 16% on a per share basis compared with the fourth quarter 2016 net income of $10,065,000, or $0.44 per share. As previously discussed, the fourth quarter of 2017 results of operation were positively impacted by the revaluation of the Company's deferred tax assets and deferred tax liabilities, resulting in a net tax benefit of $2,284,000, or approximately $0.10 per share.\nSummary Average Balance Sheet (Tax-equivalent basis / dollars in thousands) Quarter Ended Quarter Ended Quarter Ended December 31, 2017 September 30, 2017 December 31, 2016 Principal\nBalance Income/\nExpense Yield/\nRate Principal\nBalance Income/\nExpense Yield/\nRate Principal\nBalance Income/\nExpense Yield/\nRate Assets Federal Funds Sold and Other Short-term Investments $ 10,268 $ 34 1.33% $ 13,543 $ 46 1.38% $ 19,738 $ 12 0.24% Securities 755,659 6,001 3.18% 748,754 5,872 3.14% 737,619 5,582 3.03% Loans and Leases 2,100,432 23,872 4.51% 2,058,453 23,358 4.51% 2,004,983 22,734 4.51% Total Interest Earning Assets $ 2,866,359 $ 29,907 4.15% $ 2,820,750 $ 29,276 4.13% $ 2,762,340 $ 28,328 4.09% Liabilities Demand Deposit Accounts $ 598,107 $ 572,204 $ 559,597 IB Demand, Savings, and MMDA Accounts $ 1,488,671 $ 1,177 0.31% $ 1,447,693 $ 1,117 0.31% $ 1,412,398 $ 708 0.20% Time Deposits 376,585 889 0.94% 382,827 842 0.87% 412,151 675 0.65% FHLB Advances and Other Borrowings 226,437 1,090 1.91% 246,698 1,110 1.79% 217,033 829 1.52% Total Interest-Bearing Liabilities $ 2,091,693 $ 3,156 0.60% $ 2,077,218 $ 3,069 0.59% $ 2,041,582 $ 2,212 0.43% Cost of Funds 0.44% 0.43% 0.32% Net Interest Income $ 26,751 $ 26,207 $ 26,116 Net Interest Margin 3.71% 3.70% 3.77% During the quarter ended December 31, 2017, net interest income totaled $25,454,000, which represented an increase of $537,000, or 2%, from the quarter ended September 30, 2017 net interest income of $24,917,000 and an increase of $565,000, or 2%, compared with the quarter ended December 31, 2016 net interest income of $24,889,000. The increased level of net interest income during the fourth quarter of 2017 compared with the third quarter of 2017 was driven primarily by a higher level of earning assets resulting from organic loan growth.\nThe tax equivalent net interest margin for the quarter ended December 31, 2017 was 3.71% compared with 3.70% in the third quarter of 2017 and 3.77% in the fourth quarter of 2016. The modest increase in the stated net interest margin, when comparing the fourth quarter of 2017 with the third quarter, was primarily due to an improved yield on securities, organic loan growth, and increased accretion of loan discounts on acquired loans partially offset by an increase in Company's cost of funds. Accretion of loan discounts on acquired loans contributed approximately 6 basis points to the net interest margin on an annualized basis in the fourth quarter of 2017, 5 basis points in the third quarter of 2017, and 13 basis points in the fourth quarter of 2016. The Company's cost of funds increased approximately 1 basis points in the fourth quarter of 2017 compared with the third quarter of 2017 and 12 basis points compared with the fourth quarter of 2016. The higher cost of funds was largely attributable to an increase in short-term market interest rates over the past several quarters.\nDuring the quarter ended December 31, 2017, the Company recorded a provision for loan loss of $650,000 compared with a provision for loan loss of $250,000 during the third quarter of 2017 and no provision for loan loss in the fourth quarter of 2016. The provision during all periods was done in accordance with the Company's standard methodology for determining the adequacy of its allowance for loan loss.\nDuring the quarter ended December 31, 2017, non-interest income totaled $7,594,000, a decline of $681,000, or 8%, compared with the quarter ended September 30, 2017, and a decline of $763,000, or 9%, compared with the fourth quarter of 2016.\nQuarter Ended Quarter Ended Quarter Ended Non-interest Income 12/31/2017 9/30/2017 12/31/2016 (dollars in thousands) Trust and Investment Product Fees $ 1,378 $ 1,301 $ 1,209 Service Charges on Deposit Accounts 1,608 1,608 1,594 Insurance Revenues 1,867 1,728 1,748 Company Owned Life Insurance 290 317 278 Interchange Fee Income 1,202 1,186 1,001 Other Operating Income 546 608 1,222 Subtotal 6,891 6,748 7,052 Net Gains on Loans 682 952 752 Net Gains on Securities 21 575 553 Total Non-interest Income $ 7,594 $ 8,275 $ 8,357 Interchange fee income increased $16,000, or 1%, during the fourth quarter of 2017 compared with the third quarter of 2017 and $201,000, or 20%, compared with the fourth quarter of 2016. The increase during the fourth quarter of 2017 compared with the fourth quarter of 2016 was largely attributable to increased card utilization by customers.\nOther operating income decreased $62,000, or 10%, during the quarter ended December 31, 2017 compared with the third quarter of 2017 and decreased $676,000, or 55%, compared with the fourth quarter of 2016. The decline in the fourth quarter of 2017 compared with the fourth quarter of 2016 was largely attributable to decreased fees associated with swap transactions with loan customers and to a gain realized in 2016 related to the liquidation of a limited partnership tax credit investment.\nNet gains on sales of loans decreased $270,000, or 28%, during the fourth quarter of 2017 compared with the third quarter of 2017 and declined $70,000, or 9%, compared with the fourth quarter of 2016. The decline in the gain on sales of loans during the fourth quarter of 2017 compared with both comparative periods was primarily due to a lower level of loans sold in secondary market. Loan sales totaled $28.9 million during the fourth quarter of 2017, compared with $39.2 million during the third quarter of 2017 and $37.9 million during the fourth quarter of 2016.\nThe Company realized $21,000 in gains on sales of securities during the fourth quarter of 2017 compared with $575,000 during the third quarter of 2017 and gains of $553,000 in the fourth quarter of 2016.\nDuring the quarter ended December 31, 2017, non-interest expense totaled $20,000,000, an increase of $229,000, or 1%, compared with the quarter ended September 30, 2017, and an increase of $645,000, or 3%, compared with the fourth quarter of 2016.\nQuarter Ended Quarter Ended Quarter Ended Non-interest Expense 12/31/2017 9/30/2017 12/31/2016 (dollars in thousands) Salaries and Employee Benefits $ 12,168 $ 11,570 $ 11,604 Occupancy, Furniture and Equipment Expense 2,452 2,372 2,229 FDIC Premiums 242 241 111 Data Processing Fees 1,154 1,067 1,079 Professional Fees 550 551 797 Advertising and Promotion 820 1,315 797 Intangible Amortization 217 230 262 Other Operating Expenses 2,397 2,425 2,476 Total Non-interest Expense $ 20,000 $ 19,771 $ 19,355 Salaries and benefits increased $598,000, or 5%, during the quarter ended December 31, 2017 compared with the third quarter of 2017 and increased $564,000, or 5%, compared with the fourth quarter of 2016. The increase in salaries and benefits during the fourth quarter of 2017 compared with the third quarter of 2017 was primarily attributable to higher levels employee benefit costs. The increase in salaries and benefits during the fourth quarter of 2017 compared with the fourth quarter of 2016 was primarily attributable to an increased number of full-time equivalent employees and higher level health insurance costs.\nAdvertising and promotion declined $495,000, or 38%, during the quarter ended December 31, 2017 compared with the third quarter of 2017 and increased $23,000 or 3%, compared with the fourth quarter of 2016. The primary driver of the decrease in advertising and promotion during the fourth quarter compared with the third quarter of 2017 was the recognition of a contribution expense of $773,000 related to the donation of a former branch facility to a municipality in one of the Company's market areas during the third quarter of 2017.\nDuring the quarter ended December 31, 2017, the Company recorded a provision for income tax expense of $777,000 compared with a provision for income tax expense of $3,511,000 during the third quarter of 2017 and $3,826,000 in the fourth quarter of 2016. The fourth quarter of 2017 income tax provision was positively impacted by the revaluation of the Company's deferred tax assets and deferred tax liabilities related to federal tax reform legislation enacted during the fourth quarter of 2017. The revaluation resulted in a net tax benefit of $2,284,000 during the fourth quarter of 2017.\nAbout German American\nGerman American Bancorp, Inc., is a NASDAQ-traded (symbol: GABC) bank holding company based in Jasper, Indiana. German American, through its banking subsidiary German American Bancorp, operates 53 banking offices in 19 contiguous southern Indiana counties and one northern Kentucky county. The Company also owns an investment brokerage subsidiary (German American Investment Services, Inc.) and a full line property and casualty insurance agency (German American Insurance, Inc.).\nCautionary Note Regarding Forward-Looking Statements\nCertain statements in this press release may be deemed “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Readers are cautioned that, by their nature, forward-looking statements are based on assumptions and are subject to risks, uncertainties, and other factors. Actual results and experience could differ materially from the anticipated results or other expectations expressed or implied by these forward-looking statements as a result of a number of factors, including but not limited to, those discussed in this press release. Factors that could cause actual experience to differ from the expectations expressed or implied in this press release include the unknown future direction of interest rates and the timing and magnitude of any changes in interest rates; changes in competitive conditions; the introduction, withdrawal, success and timing of asset/liability management strategies or of mergers and acquisitions and other business initiatives and strategies; changes in customer borrowing, repayment, investment and deposit practices; changes in fiscal, monetary and tax policies; changes in financial and capital markets; potential deterioration in general economic conditions, either nationally or locally, resulting in, among other things, credit quality deterioration; capital management activities, including possible future sales of new securities, or possible repurchases or redemptions by the Company of outstanding debt or equity securities; risks of expansion through acquisitions and mergers, such as unexpected credit quality problems of the acquired loans or other assets, unexpected attrition of the customer base of the acquired institution or branches, and difficulties in integration of the acquired operations; factors driving impairment charges on investments; the impact, extent and timing of technological changes; potential cyber-attacks, information security breaches and other criminal activities; litigation liabilities, including related costs, expenses, settlements and judgments, or the outcome of matters before regulatory agencies, whether pending or commencing in the future; actions of the Federal Reserve Board; changes in accounting principles and interpretations; potential increases of federal deposit insurance premium expense, and possible future special assessments of FDIC premiums, either industry wide or specific to the Company’s banking subsidiary; actions of the regulatory authorities under the Dodd-Frank Wall Street Reform and Consumer Protection Act and the Federal Deposit Insurance Act and other possible legislative and regulatory actions and reforms; the continued availability of earnings and excess capital sufficient for the lawful and prudent declaration and payment of cash dividends; and other risk factors expressly identified in the Company’s filings with the United States Securities and Exchange Commission. Such statements reflect our views with respect to future events and are subject to these and other risks, uncertainties and assumptions relating to the operations, results of operations, growth strategy and liquidity of the Company. Readers are cautioned not to place undue reliance on these forward-looking statements. It is intended that these forward-looking statements speak only as of the date they are made. We do not undertake any obligation to release publicly any revisions to these forward-looking statements to reflect future events or circumstances or to reflect the occurrence of unanticipated events.\nGERMAN AMERICAN BANCORP, INC. (unaudited, dollars in thousands except per share data) Consolidated Balance Sheets December 31, 2017 September 30, 2017 December 31, 2016 ASSETS Cash and Due from Banks $ 58,233 $ 44,804 $ 48,467 Short-term Investments 12,126 9,758 16,349 Interest-bearing Time Deposits with Banks — — — Investment Securities 740,994 741,710 709,786 Loans Held-for-Sale 6,719 8,484 15,273 Loans, Net of Unearned Income 2,141,638 2,086,325 1,989,955 Allowance for Loan Losses (15,694 ) (15,321 ) (14,808 ) Net Loans 2,125,944 2,071,004 1,975,147 Stock in FHLB and Other Restricted Stock 13,048 13,048 13,048 Premises and Equipment 54,246 51,355 48,230 Goodwill and Other Intangible Assets 56,160 56,378 56,893 Other Assets 76,890 76,348 72,801 TOTAL ASSETS $ 3,144,360 $ 3,072,889 $ 2,955,994 LIABILITIES Non-interest-bearing Demand Deposits $ 606,134 $ 589,315 $ 571,989 Interest-bearing Demand, Savings, and Money Market Accounts 1,490,033 1,454,073 1,399,381 Time Deposits 387,885 381,184 378,181 Total Deposits 2,484,052 2,424,572 2,349,551 Borrowings 275,216 261,941 258,114 Other Liabilities 20,521 25,751 18,062 TOTAL LIABILITIES 2,779,789 2,712,264 2,625,727 SHAREHOLDERS' EQUITY 364,571 360,625 330,267 TOTAL LIABILITIES AND SHAREHOLDERS' EQUITY $ 3,144,360 $ 3,072,889 $ 2,955,994 END OF PERIOD SHARES OUTSTANDING (1) 22,934,403 22,930,017 22,904,157 TANGIBLE BOOK VALUE PER SHARE (1) (2) $ 13.45 $ 13.27 $ 11.94 (1) As Adjusted for the 3 for 2 Stock Split distributed on April 21, 2017. (2) Tangible Book Value per Share is defined as Total Shareholders' Equity less Goodwill and Other Intangible Assets divided by End of Period Shares Outstanding.\nGERMAN AMERICAN BANCORP, INC. (unaudited, dollars in thousands except per share data) Consolidated Statements of Income Three Months Ended Year Ended December 31,\n2017 September 30,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 INTEREST INCOME Interest and Fees on Loans $ 23,699 $ 23,182 $ 22,557 $ 91,745 $ 86,202 Interest on Short-term Investments and Time Deposits 34 46 12 134 74 Interest and Dividends on Investment Securities 4,877 4,758 4,532 19,151 17,089 TOTAL INTEREST INCOME 28,610 27,986 27,101 111,030 103,365 INTEREST EXPENSE Interest on Deposits 2,066 1,959 1,383 7,094 5,187 Interest on Borrowings 1,090 1,110 829 4,027 3,274 TOTAL INTEREST EXPENSE 3,156 3,069 2,212 11,121 8,461 NET INTEREST INCOME 25,454 24,917 24,889 99,909 94,904 Provision for Loan Losses 650 250 — 1,750 1,200 NET INTEREST INCOME AFTER PROVISION FOR LOAN LOSSES 24,804 24,667 24,889 98,159 93,704 NON-INTEREST INCOME Net Gain on Sales of Loans 682 952 752 3,280 3,359 Net Gain on Securities 21 575 553 596 1,979 Other Non-interest Income 6,891 6,748 7,052 27,978 26,675 TOTAL NON-INTEREST INCOME 7,594 8,275 8,357 31,854 32,013 NON-INTEREST EXPENSE Salaries and Benefits 12,168 11,570 11,604 46,642 43,961 Other Non-interest Expenses 7,832 8,201 7,751 31,161 32,626 TOTAL NON-INTERST EXPENSE 20,000 19,771 19,355 77,803 76,587 Income before Income Taxes 12,398 13,171 13,891 52,210 49,130 Income Tax Expense 777 3,511 3,826 11,534 13,946 NET INCOME $ 11,621 $ 9,660 $ 10,065 $ 40,676 $ 35,184 BASIC EARNINGS PER SHARE (1) $ 0.51 $ 0.42 $ 0.44 $ 1.77 $ 1.57 DILUTED EARNINGS PER SHARE (1) $ 0.51 $ 0.42 $ 0.44 $ 1.77 $ 1.57 WEIGHTED AVERAGE SHARES OUTSTANDING (1) 22,930,666 22,929,864 22,887,567 22,924,726 22,389,137 DILUTED WEIGHTED AVERAGE SHARES OUTSTANDING (1) 22,930,666 22,929,864 22,887,567 22,924,726 22,391,115 (1 ) As Adjusted for the 3 for 2 Stock Split distributed on April 21, 2017.\nGERMAN AMERICAN BANCORP, INC. (unaudited, dollars in thousands except per share data) Three Months Ended Year Ended December 31, September 30, December 31, December 31, December 31, 2017 2017 2016 2017 2016 EARNINGS PERFORMANCE RATIOS Annualized Return on Average Assets 1.51 % 1.27% 1.36% 1.35 % 1.24% Annualized Return on Average Equity 12.83 % 10.78% 11.90% 11.59 % 10.94% Net Interest Margin 3.71 % 3.70% 3.77% 3.76 % 3.75% Efficiency Ratio (1) 58.23 % 57.34% 56.15% 56.83 % 58.25% Net Overhead Expense to Average Earning Assets (2) 1.73 % 1.63% 1.59% 1.64 % 1.68% ASSET QUALITY RATIOS Annualized Net Charge-offs to Average Loans 0.05 % 0.05% 0.07% 0.04 % 0.04% Allowance for Loan Losses to Period End Loans 0.73 % 0.73% 0.74% Non-performing Assets to Period End Assets 0.38 % 0.33% 0.14% Non-performing Loans to Period End Loans 0.55 % 0.46% 0.19% Loans 30-89 Days Past Due to Period End Loans 0.32 % 0.48% 0.36% SELECTED BALANCE SHEET & OTHER FINANCIAL DATA Average Assets $ 3,078,875 $ 3,033,055 $ 2,970,408 $ 3,002,695 $ 2,841,096 Average Earning Assets $ 2,866,359 $ 2,820,750 $ 2,762,340 $ 2,794,107 $ 2,650,003 Average Total Loans $ 2,100,432 $ 2,058,453 $ 2,004,983 $ 2,036,717 $ 1,904,779 Average Demand Deposits $ 598,107 $ 572,204 $ 559,597 $ 572,356 $ 513,199 Average Interest Bearing Liabilities $ 2,091,693 $ 2,077,218 $ 2,041,583 $ 2,056,105 $ 1,979,176 Average Equity $ 362,356 $ 358,299 $ 338,270 $ 350,913 $ 321,520 Period End Non-performing Assets (3) $ 11,864 $ 10,219 $ 4,037 Period End Non-performing Loans (4) $ 11,810 $ 9,651 $ 3,795 Period End Loans 30-89 Days Past Due (5) $ 6,865 $ 10,089 $ 7,109 Tax Equivalent Net Interest Income $ 26,751 $ 26,207 $ 26,116 $ 105,057 $ 99,470 Net Charge-offs during Period $ 277 $ 249 $ 346 $ 864 $ 830 (1 ) Efficiency Ratio is defined as Non-interest Expense divided by the sum of Net Interest Income, on a tax equivalent basis, and Non-interest Income. (2 ) Net Overhead Expense is defined as Total Non-interest Expense less Total Non-interest Income. (3 ) Non-performing assets are defined as Non-accrual Loans, Loans Past Due 90 days or more, Restructured Loans, and Other Real Estate Owned. (4 ) Non-performing loans are defined as Non-accrual Loans, Loans Past Due 90 days or more, and Restructured Loans. (5 ) Loans 30-89 days past due and still accruing.\nFor additional information, contact:\nMark A Schroeder, Chairman & Chief Executive Officer of German American Bancorp, Inc.\nBradley M Rust, Executive Vice President/CFO of German American Bancorp, Inc.\n(812) 482-1314\nSource:German American Bancorp, Inc.", "external_links": [], "published": "2018-01-30T03:05:00.000+02:00", "crawled": "2018-01-30T07:09:47.930+02:00", "highlightTitle": ""}