{"organizations": [], "uuid": "dab1cb0f35a0d90ba2b8e1928b800cf2c1c2d424", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-bgl-announces-the-merger-of-frch-design-worldwide-and-nelson.html", "country": "US", "domain_rank": 767, "title": "BGL Announces the Merger of FRCH Design Worldwide and NELSON", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T01:29:00.000+02:00", "replies_count": 0, "uuid": "dab1cb0f35a0d90ba2b8e1928b800cf2c1c2d424"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-bgl-announces-the-merger-of-frch-design-worldwide-and-nelson.html", "ord_in_thread": 0, "title": "BGL Announces the Merger of FRCH Design Worldwide and NELSON", "locations": [], "entities": {"persons": [{"name": "worldwi", "sentiment": "negative"}, {"name": "nelson", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "cincinnati", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "brown gibbons lang & company", "sentiment": "negative"}, {"name": "frch", "sentiment": "none"}, {"name": "bgl's business services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 23, 2018 /PRNewswire/ -- Brown Gibbons Lang & Company (BGL) is pleased to announce the merger of FRCH Design Worldwide (FRCH) with NELSON. BGL's Business Services team served as the exclusive financial advisor to FRCH in the transaction. The specific terms of the transaction were not disclosed.\nBased in Cincinnati, Ohio, FRCH is an award-winning strategic design and architectural firm that creates experiences for retail, hospitality, food & beverage, mixed-use and corporate brands all over the globe. The merging of the expertise of these two organizations will allow NELSON and FRCH to bring a new level of diversity to the combined organization, spanning industries from their traditional strongholds in corporate interiors, retail and hospitality to growing healthcare, industrial, mixed-use, government and multi-family residential practices. Leveraging proprietary processes and 50 years of design and architecture experience, the combined organization will continue to create innovative brand experiences for both corporate and consumer-facing environments that express brand values and communication tailored to each audience in a meaningful and relevant manner.\nJim Tippmann, CEO of FRCH said \"The BGL team played a key role of evaluating strategic alternatives throughout the M&A process, executing a complicated transaction to a successful close. Their guidance in coordinating all of the principals and advisors involved in this transaction led to a successful execution of our merger with Nelson Worldwide and for that I am grateful for their experience and expertise.\"\nJohn \"Ozzie\" Nelson Jr., Chairman and CEO of NELSON said, \"Having completed over forty mergers / acquisitions, I am obviously exposed broadly to the market. In my team's experience with BGL in the FRCH transaction, BGL proved to be among the very best with whom we have ever worked.\"\nOzzie Nelson and Jim Tippmann will lead the new organization as Co-CEOs.\nTo learn more about BGL's Business Services Group , please visit: www.bglco.com/business-services\nAbout Brown Gibbons Lang & Company\nBrown Gibbons Lang & Company is a leading independent investment bank serving the middle market. BGL specializes in mergers and acquisitions advisory services, debt and equity placements, financial restructuring advice, and valuations and fairness opinions, with global industry teams in Business Services, Consumer & Retail, Environmental & Industrial Services, Healthcare & Life Sciences, Industrials, and Real Estate. BGL has offices in Chicago, Cleveland, Philadelphia, San Antonio, and San Diego in addition to Global M&A partner offices in more than 50 countries across 5 continents. BGL is able to deliver to our clients unparalleled access to strategic relationships, investors, and opportunities globally. For more information, please visit www.bglco.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/bgl-announces-the-merger-of-frch-design-worldwide-and-nelson-300587079.html\nSOURCE Brown Gibbons Lang & Company", "external_links": ["http://www.prnewswire.com/news-releases/bgl-announces-the-merger-of-frch-design-worldwide-and-nelson-300587079.html", "http://www.bglco.com/", "http://www.bglco.com/business-services"], "published": "2018-01-24T01:29:00.000+02:00", "crawled": "2018-01-24T01:22:54.029+02:00", "highlightTitle": ""}