{"organizations": [], "uuid": "af47fec90d33a8965c0104e7037b24febc470a41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-afghanistan-attack-charity/save-the-children-head-vows-charity-to-stay-in-afghanistan-after-deadly-attack-idUSKBN1FE2KQ", "country": "US", "domain_rank": 408, "title": "Save the Children head vows charity to stay in Afghanistan after deadly attack", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-26T01:32:00.000+02:00", "replies_count": 0, "uuid": "af47fec90d33a8965c0104e7037b24febc470a41"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-afghanistan-attack-charity/save-the-children-head-vows-charity-to-stay-in-afghanistan-after-deadly-attack-idUSKBN1FE2KQ", "ord_in_thread": 0, "title": "Save the Children head vows charity to stay in Afghanistan after deadly attack", "locations": [], "entities": {"persons": [{"name": "helle thorning-schmidt", "sentiment": "none"}, {"name": "thorning-schmidt", "sentiment": "none"}], "locations": [{"name": "afghanistan", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "jalalabad", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}], "organizations": [{"name": "save the children", "sentiment": "negative"}, {"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "children international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - The head of Save the Children vowed on Thursday to resume operations in Afghanistan as soon as possible following a “malicious and senseless” attack by gunmen which killed four staff at one of the aid agency’s offices.\n“I cannot express how sad we are and how appalled we are that this can happen to people who are trying to help children,” Save the Children International CEO Helle Thorning-Schmidt told the Thomson Reuters Foundation.\n“We’re so sad. We have been hugging each other,” added Thorning-Schmidt, a former prime minister of Denmark.\nThe charity halted operations in Afghanistan on Wednesday after gunman stormed its office in the eastern city of Jalalabad. Staff were carrying out security assessments on Thursday. Initial reports put the staff death toll at three but Thorning-Schmidt said the number had risen to four.\n“We will be back as soon as we are ready,” said Thorning-Schmidt by phone from Davos, where she is attending the World Economic Forum.\n“We have been working in Afghanistan for 40 years and we remain fully committed to helping the children of Afghanistan.”\nIslamic State claimed responsibility for the assault in which gunmen battled Afghan security forces for about 10 hours.\nAuthorities said a member of the security forces and a shopkeeper were also killed and at least 25 people injured.\nThorning-Schmidt said it was too early in the investigation to say who was behind the attack or to pinpoint a motive.\n“Whatever the motive is, attacks against workers must never be tolerated,” she said.\nThorning-Schmidt said such attacks hurt people who do “a courageous and fantastic job” as well as the children they help.\nTRAUMA HELP The assault underlines how difficult it has become for aid groups, which have faced heavy pressure from armed groups and kidnappers, to keep operating in Afghanistan.\nSeventeen aid workers were killed and 32 injured in the country last year. Preliminary global figures compiled by the Aid Worker Security Database suggest 115 aid workers were killed in 2017, up from 101 in 2016.\nIn October, the Red Cross said it was reducing operations in Afghanistan following attacks that had killed seven staff.\nThorning-Schmidt voiced hope the assault in Jalalabad would not deter other aid agencies, especially given the high global demand for their services.\n“The people who got killed so brutally were doing the most innocent work you can imagine,” she said, adding that they were working on child health, education and protection programs and trying to stop child marriage.\nThorning-Schmidt said she had spoken to those caught up in the attack and they would be offered help for trauma.\n“Everyone is devastated and we are doing everything we can to help the families who have lost their loved ones,” she added.\nShe said they were “very, very lucky” that 47 staff had escaped. Four were hurt, all with minor injuries.\nThe dead included a guard and two program staff. All three had families and children. No international staff were in the office at the time.\nThe assault began with a suicide car bombing outside the building. Aside from the bomber, four gunmen were shot by security forces. Witnesses said at least some were in police uniform, a common tactic.\nThe attack came just days after Taliban militants raided the Hotel Intercontinental in the Afghan capital, Kabul, killing at least 20 people.\nEditing by Lyndsay Griffiths.; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, which covers humanitarian news, women's rights, trafficking, corruption and climate change. Visit news.trust.org to see more stories.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T01:32:00.000+02:00", "crawled": "2018-01-26T21:22:51.008+02:00", "highlightTitle": ""}