{"organizations": [], "uuid": "31ad9fa1c651bf9f4389db3edbda07d69554de48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-neophore-appoints-pioneering-cancer-researchers-and-clinicians-to-scientific-advisory-board.html", "country": "US", "domain_rank": 767, "title": "NeoPhore Appoints Pioneering Cancer Researchers and Clinicians to Scientific Advisory Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-08T11:30:00.000+02:00", "replies_count": 0, "uuid": "31ad9fa1c651bf9f4389db3edbda07d69554de48"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-neophore-appoints-pioneering-cancer-researchers-and-clinicians-to-scientific-advisory-board.html", "ord_in_thread": 0, "title": "NeoPhore Appoints Pioneering Cancer Researchers and Clinicians to Scientific Advisory Board", "locations": [], "entities": {"persons": [{"name": "bardelli", "sentiment": "none"}, {"name": "alberto bardelli", "sentiment": "none"}], "locations": [{"name": "cambridge", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "torino", "sentiment": "none"}], "organizations": [{"name": "scientific advisory board", "sentiment": "negative"}, {"name": "department of oncology", "sentiment": "none"}, {"name": "neophore scientific advisory board", "sentiment": "none"}, {"name": "university of torino", "sentiment": "none"}, {"name": "european association for cancer research", "sentiment": "none"}, {"name": "neophore limited", "sentiment": "none"}, {"name": "neophore scientific founder", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, England, January 8, 2018 /PRNewswire/ --\nCompany attracts world-leading researchers who discovered the role of mismatch repair biology in cancer and cancer immunotherapy\nNeoPhore Limited, a cancer immuno-oncology company today announced the formation of its Scientific Advisory Board, featuring internationally-renowned experts in the fields of cancer genetics, translational clinical oncology and immuno-oncology.\nThe NeoPhore Scientific Advisory Board will be chaired by NeoPhore Scientific Founder Professor Alberto Bardelli, Department of Oncology at the University of Torino, and deputy Director of the Candiolo Cancer Institute-IRCCS, Torino, Italy. In addition to his role in founding NeoPhore, Professor Bardelli also co-founded Horizon Discovery, Plc and he is also the President Elect of the European Association for Cancer Research (EACR). Professor Bardelli's ground-breaking mechanistic insights into dynamic neoantigen evolution and cancer immunology were recently featured as a research manuscript published in the journal Nature.\nThe other members of the NeoPhore advisory board are:\nLuis Alberto Diaz Jr: an internationally recognized physician-scientist and Head of the Division of Solid Tumor Oncology at Memorial Sloan Kettering Hospital. Dr. Diaz directed clinical studies used for FDA approval of the PD-1 checkpoint inhibitor Keytruda (pembrolizumab) as indicated for any cancer with defective DNA mismatch repair. Bert Vogelstein: a landmark figure in cancer research, Clayton Professor of Oncology and Pathology and Co-Director of the Ludwig Cancer at the Johns Hopkins Kimmel Cancer Center and Founder of Papgene Inc. Ken Kinzler: a pioneer of cancer genetics and genomics and Professor of Oncology and Co-Director of the Ludwig Center at the Johns Hopkins Kimmel Cancer Center. Ashok Venkitaraman: an international leader in cancer biology, the Ursula Zoellner Professor of Cancer Research at the University of Cambridge and the Director of the Medical Research Council (MRC) Cancer Unit.\nCommenting on the appointments, NeoPhore co-founder and Chairman of the SAB, Professor Alberto Bardelli, said: \"We are very pleased to have attracted such a prestigious group of cancer researchers and clinicians to our Scientific Advisory Board. The high level of mechanistic and clinical validation behind NeoPhore's therapeutic approach is based upon the SAB member's breakthrough cancer genetics research and its translation into cancer clinical care. Our advisors offer unprecedented expertise and insight into mismatch repair, neoantigen evolution and cancer immunology, which will be invaluable as we develop novel small-molecule drugs to stimulate immunity in diverse cancers.\"\nNeoPhore, a spin-out from PhoreMost Ltd with financing from Sixth Element Capital, is focused on the discovery and development of novel small molecule therapies to treat cancer through stimulation of the immune system. NeoPhore's drugs are designed to revive sensitivity and create lasting efficacy in non-immunogenic and immunogenic cancer types, particularly in combination with immune checkpoint drugs. Their mechanism and activity is differentiated from many competing strategies for combination immune-oncology therapy: NeoPhore's drugs are first-in-class inhibitors of mismatch DNA-repair, which clinical, genetic and laboratory evidence suggests is a fundamental approach to enhance cancer immunity.\nNOTES TO EDITORS\nNeoPhore Ltd\nNeoPhore, based in Cambridge, UK is focused on the discovery and development of novel small molecule therapies to treat cancer through stimulation of the immune system. Cancer neoantigens are known to stimulate the immune system and potentially be a weak spot in a tumour cell's defence mechanisms. The Company's approach targets genetic mechanisms that both clinical and laboratory studies suggest will promote neoantigen creation and diversity across numerous cancers. Using these insights, the Company aims to generate next-generation immuno-oncology therapeutics to improve clinical outcomes for cancer patients. NeoPhore was spun-out of PhoreMost Ltd and is backed by Sixth Element Capital LLP, a UK based fund manager established to manage investments for the £70 million CRT Pioneer Fund.\nLuis Alberto Diaz Jr., MD: an internationally recognized physician-scientist, Dr. Diaz is the Head of the Division of Solid Tumor Oncology at Memorial Sloan Kettering Hospital. Dr. Diaz's was the senior clinical investigator on pivotal clinical studies that led to the FDA approval of the PD-1 checkpoint inhibitor Keytruda (pembrolizumab) as indicated for any cancer with defective DNA mismatch repair. Dr. Diaz's breakthrough clinical studies underpin NeoPhore's therapeutic concept, which aims to induce neoantigen creation and cancer immunity using small-molecule inhibitors of mismatch repair, particularly in combination with other immunotherapy approaches. In addition to his research and clinical practice, Dr. Diaz is a founder of Personal Genome Diagnostics, Sysmex Inostics, Papgene Inc and PagerBox.\nBert Vogelstein, MD: A landmark figure in cancer research, Dr. Vogelstein is the Clayton Professor of Oncology and Pathology and Co-Director of the Ludwig Cancer at the Johns Hopkins Kimmel Cancer Center. Over 40 years, Dr. Vogelstein's research has defined multiple paradigms in cancer biology and genetics, including the first contemporary molecular model of carcinogenesis and deciphering the first cancer genomes and computational models of cancer. Dr. Vogelstein is also a Howard Hughes Medical Institute Investigator and Founder of Papgene Inc.\nKen Kinzler, Ph.D: A pioneer of cancer genetics and genomics, Dr. Kinzler is a Professor of Oncology and Co-Director of the Ludwig Center at the Johns Hopkins Kimmel Cancer Center. Dr. Kinzler identified many of the most essential genes associated with human cancer and helped pioneer several breakthrough techniques in genomics, including \"SAGE\", high-throughput genome sequencing and circulating tumor DNA (ctDNA) analysis.\nAshok Venkitaraman, MBBS, Ph.D.: an international leader in cancer biology, Dr. Venkitaraman is the Ursula Zoellner Professor of Cancer Research at the University of Cambridge, and the Director of the Medical Research Council (MRC) Cancer Unit. Dr. Vekitaraman's studies have illuminated fundamental mechanisms of genome repair during cell division, and his work to develop innovative technology platforms for the discovery of novel disease therapies led to him to co-found PhoreMost Limited.\nSOURCE NeoPhore", "external_links": ["http://www.neophore.com/news/breakthrough-discoveries-published", "http://neophore.com/"], "published": "2018-01-08T11:30:00.000+02:00", "crawled": "2018-01-08T12:14:03.000+02:00", "highlightTitle": ""}