{"organizations": [], "uuid": "26dc6792c36123ba647a9de965395191e9e713dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219849498&w=1200&r=LYNXMPEE050DE", "site_section": "http://feeds.reuters.com/reuters/businessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-carillion/uks-carillion-speeding-up-rescue-talks-with-banks-sky-news-idUSKBN1EV0IS", "country": "US", "domain_rank": 408, "title": "UK's Carillion speeding up rescue talks with banks: Sky News", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T18:04:00.000+02:00", "replies_count": 0, "uuid": "26dc6792c36123ba647a9de965395191e9e713dd"}, "author": "", "url": "https://www.reuters.com/article/us-carillion/uks-carillion-speeding-up-rescue-talks-with-banks-sky-news-idUSKBN1EV0IS", "ord_in_thread": 0, "title": "UK's Carillion speeding up rescue talks with banks: Sky News", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "carillion", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sky news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 4:05 PM / Updated 4 hours ago UK's Carillion to discuss rescue with creditors on Jan. 10 Reuters Staff 3 Min Read \nLONDON (Reuters) - Struggling British building and services company Carillion ( CLLN.L ), which is involved in Britain’s planned high-speed rail link HS2, said on Saturday it will meet creditors on Wednesday as it seeks a financial rescue plan. \nCarillion, a provider of infrastructure projects in several countries beyond Britain, has been fighting for its survival after costly contract delays and a downturn in new business. \nIt is also under investigation by regulators over “the timeliness and content” of statements it made before it issued a profit warning in July, the first of three such warnings issued in quick succession. \n“The group is currently finalizing its business plan, which it intends to present to its financial creditors and certain other stakeholders on Jan. 10, in line with the previously announced timetable,” a company spokesman said. \nCarillion was in talks to “reduce net debt and recapitalize and/or restructure the group’s balance sheet,” he said. \n“Once finalised, the business plan will provide the basis for the agreement of a proposal to restore Carillion’s balance sheet,” the spokesman said. \nEarlier on Saturday, Sky News said Carillion’s rescue plan would involve handing back loss-making contracts, revising the terms of others and possibly accepting government financial support if it cannot secure private funding. \nThat government support could be a loan on commercial terms, a deal to reprice some contracts, or to allow Carillion to hand back loss-making work to the government, Sky News said, quoting unidentified sources. \nAnalysts have estimated the company has debt including provisions, pensions and accounts payable of about 1.5 billion pounds ($2.04 billion) compared with its market capitalization of about 70 million pounds, according to Thomson Reuters data. \nIn December, Carillion said discussions with stakeholders about its options to cut debt and avoid a breach of debt covenants were “progressing well”. \nSky News said the company faced a funding gap of hundreds of millions of pounds and the precise size of the shortfall depended on whether it was able to get out of loss-making contracts. The company’s lenders included Barclays ( BARC.L ), HSBC ( HSBA.L ) and Santander UK ( SAN.MC ), it said. \nCarillion, which operates in Canada and the Middle East as well as Britain and employs more than 30,000 people, last month brought forward the start date for new chief executive Andrew Davies to Jan. 22. Writing by William Schomberg; Editing by Angus MacSwan and Adrian Croft", "external_links": [], "published": "2018-01-06T18:04:00.000+02:00", "crawled": "2018-01-06T18:15:21.000+02:00", "highlightTitle": ""}