{"organizations": [], "uuid": "5bd646fb5341b6b2873e335c83e8e3ab468af5f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224678939&w=1200&r=LYNXMPEE0N05V", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-zverev-fine/zverev-fine-to-cure-plague-of-first-round-pull-outs-idUSKBN1FD09D", "country": "US", "domain_rank": 408, "title": "Zverev fine to cure plague of first-round pull-outs", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T11:37:00.000+02:00", "replies_count": 0, "uuid": "5bd646fb5341b6b2873e335c83e8e3ab468af5f6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tennis-ausopen-zverev-fine/zverev-fine-to-cure-plague-of-first-round-pull-outs-idUSKBN1FD09D", "ord_in_thread": 0, "title": "Zverev fine to cure plague of first-round pull-outs", "locations": [], "entities": {"persons": [{"name": "zverev", "sentiment": "negative"}, {"name": "mischa zverev", "sentiment": "none"}, {"name": "chung hyeon", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - The plague of tennis players retiring hurt or ill in the first round of grand slam tournaments was largely absent at the Australian Open this year for a very good reason -- as Mischa Zverev has found out to his cost.\nThe German player, ranked 35th in the world, pulled out after only 48 minutes of his opening match against South Korea’s Chung Hyeon because of a viral illness.\nOn Tuesday, he was handed a hefty fine by Australian Open organizers for a so-called ‘unprofessional’ first round performance.\nThe fine was originally posted as $45,000 but organizers later confirmed that it was not U.S. dollars but in the local currency, which works out at around $36,009.\nWith first round prize money of A$60,000 ($48,012), Zverev may well be out of pocket for his trip Down Under given the cost of airlines tickets, hotels and coaches.\nIt comes after tennis’s Grand Slam Board introduced new measures to stop players turning up injured or ill, only to retire in the first round and yet still pick up a lucrative first-round loser’s cheque.\n“Any player who competes in the first round main draw singles and retires or performs below professional standards, may now be subject to a fine up to (the equivalent) first round prize money in 2018,” the new rule states.\nThe problem of first-round retirements reared its head at Wimbledon last year when eight players retired from their opening matches, including in matches against Novak Djokovic and Roger Federer in back-to-back matches on Centre Court.\nThat left fans angry after paying for expensive tickets, only to be served up poor-quality entertainment.\nZverev was the only player to retire in the first round of the men’s singles at Melbourne Park this year.\nFour players pulled out before the tournament commenced, allowing lower-ranked players the chance to enter the draw.\nThe rule states that players unfit to compete in the first round, but who pull out before, collect half their prize money.\n“What occurred in the first round has shown that the new rule works,” tournament director Craig Tiley told local media.\n“The real winner from this is the tennis fan who gets to see high-quality, competitive tennis.”\nZverev may disagree but it is a fair bet to assume there will not be many first-round retirements at the French Open.\nReporting by Martyn Herman, editing by Nick Mulvenney\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T11:37:00.000+02:00", "crawled": "2018-01-24T06:39:26.015+02:00", "highlightTitle": ""}