{"organizations": [], "uuid": "aac3a776d623166f3237e038b328e5d801c5fd40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 81, "shares": 81, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928788-GettyImages-672950150.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/gop-senator-vows-to-hold-up-all-doj-nominations-over-ags-pot-policy.html", "country": "US", "domain_rank": 767, "title": "GOP senator vows to hold up all DOJ nominations over AG's pot policy", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.053, "site_type": "news", "published": "2018-01-05T00:37:00.000+02:00", "replies_count": 0, "uuid": "aac3a776d623166f3237e038b328e5d801c5fd40"}, "author": "Kevin Breuninger", "url": "https://www.cnbc.com/2018/01/04/gop-senator-vows-to-hold-up-all-doj-nominations-over-ags-pot-policy.html", "ord_in_thread": 0, "title": "GOP senator vows to hold up all DOJ nominations over AG's pot policy", "locations": [], "entities": {"persons": [{"name": "cory gardner", "sentiment": "none"}, {"name": "jeff sessions", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill clark", "sentiment": "none"}, {"name": "gardner", "sentiment": "none"}, {"name": "sessio", "sentiment": "none"}], "locations": [{"name": "colorado", "sentiment": "none"}], "organizations": [{"name": "colorado gop", "sentiment": "negative"}, {"name": "ag", "sentiment": "negative"}, {"name": "gop", "sentiment": "negative"}, {"name": "doj", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "' justice department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Republican Senator Cory Gardner of Colorado promised on Thursday to put holds on all nominees for Attorney General Jeff Sessions ' Justice Department, amid a furor over a policy change that aims to reverse the federal government's permissive stance toward states that legalize marijuana.\nOn the Senate floor, a visibly agitated Gardner decried a \"complete reversal\" of the position he said Sessions and President Donald Trump had taken with respect to enforcing federal laws that outlaw marijuana use.\n\"Prior to his confirmation, then-Senator Sessions told me there would be no plans to reverse the Cole memorandum,\" Gardner said. He referred to a 2013 memo penned by former Deputy Attorney General James Cole essentially assuring that the Obama administration would not stop states from legalizing marijuana.\n\"One tweet later, one policy later, a complete reversal of what many of us on the Hill were told before the confirmation, what we had continued to believe the last year,\" Gardner said. \"And without any notification, conversation, or dialogue with Congress [the policy was] completely reversed.\"\nGardner said he will be putting holds on every nomination to the Justice Department until Sessions \"lives up to the commitment that he made to me in my pre-confirmation meeting with him.\"\nA Senate hold enables a single senator to block a nomination, a motion or even a piece of legislation from being seen in the Senate.\nTo put holds on all nominations is especially consequential for the Justice Department, which reportedly is still missing Senate-confirmed leaders in at least six divisions.\nOn Thursday, Sessions issued a directive rescinding Cole's policy . The former Alabama senator directed federal prosecutors \"to use previously established prosecutorial principles that provide them all the necessary tools to disrupt criminal organizations, tackle the growing drug crisis, and thwart violent crime across our country.\"\nThe Department of Justice later said in a public statement that Sessions' decision represented \"a return to the rule of law.\"\nTrump, Gardner noted on the Senate floor, had previously stated that as a presidential candidate, he wouldn't use federal authority to shut down sales of recreational marijuana.\n\"I think it's up to the states,\" Trump said in a 2016 interview. \"I'm a states person. I think it should be up to the states. Absolutely.\"\nBrandon Rittiman tweet: Had to ask @ realDonaldTrump about # marijuana in light of his alliance with @ GovChristie :# 9NEWS # COpolitics\n\"I would like to know from the attorney general what has changed,\" Gardner said on Thursday. \"What has changed President Trump's mind that the Cole memorandum would be reversed and rescinded?\"\nCory Gardner tweet 1: .@realdonaldtrump had it right. This must be left up to the states.\nCory Gardner tweet 2: I am prepared to take all steps necessary, including holding DOJ nominees, until the Attorney General lives up to the commitment he made to me prior to his confirmation.\nMarijuana has remained federally prohibited for decades, and Colorado is one of the pioneers of legalization at the state level. In 2016, the state topped $1 billion in legal weed revenues, allowing the government to reap a $198.5 million windfall in marijuana taxes.\nIn 2012, Colorado became the first state in the nation to legalize marijuana for recreational use. Since then, marijuana sales have created hundreds of millions in revenue for the state every year.\nThe Department of Justice did not respond to a request for comment on Gardner's remarks in time for publication of this story.", "external_links": [], "published": "2018-01-05T00:37:00.000+02:00", "crawled": "2018-01-05T00:36:20.023+02:00", "highlightTitle": ""}