{"organizations": [], "uuid": "7542e3d1d319833967d4eb560e76b165b9084a5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 79, "shares": 79, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/20/104415643-GettyImages-546757020.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/08/cramer-says-4-things-including-taxes-will-continue-to-drive-stocks-up.html", "country": "US", "domain_rank": 767, "title": "Cramer says 4 things—including taxes—will continue to drive stocks up", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T01:14:00.000+02:00", "replies_count": 0, "uuid": "7542e3d1d319833967d4eb560e76b165b9084a5a"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/08/cramer-says-4-things-including-taxes-will-continue-to-drive-stocks-up.html", "ord_in_thread": 0, "title": "Cramer says 4 things—including taxes—will continue to drive stocks up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "18 Hours Ago | 01:27 \nAs the stock market resumed its march higher on Monday, CNBC's Jim Cramer pinpointed the main drivers fueling the monstrous rally. \n\"First, let's understand: this market is largely driven not by stock-pickers, but by index funds,\" the \" Mad Money \" host said. \"That index fund money comes in automatically, every day, over the transom. Billions of dollars placed in equities will move equities higher.\" \nCramer described this particular driver as \"one-directional.\" In other words, index funds typically add money into the market rather than taking it out. \nBecause Treasury yield rates remain comparatively low, that \"money in\" becomes an essential prop for the bull market, keeping demand intact as it \"soaks up supply,\" Cramer said. \nSecond, there are nearly half the number of publicly-traded companies on the market than there were when Cramer was investing professionally 17 years ago. \nNot only does that mean that fewer companies are benefiting from all the money flowing into the market, but that companies that implement share buyback programs tend to see their stocks go higher, the \"Mad Money\" host said. \n\"There's an extraordinary amount of stock being 'crunched,' or retired, by the major old-line companies out there,\" Cramer said. \"When you do that, not only do the earnings get higher, but the price-to-earnings multiple — the main way we value stocks ... the apples-to-apples way — goes lower.\" \nIn darker times, this practice could threaten stocks, Cramer said. If companies keep shrinking their share count, the valuation of the overall market declines and so does supply. \nBut market stalwarts like Walmart and 3M , both of which have reduced their stock supply by millions of shares in the last several years, know what they're doing, Cramer argued. \n\"Those incredible shrinking numbers ... coupled with the money coming in automatically means that these stocks have a natural bid or put 'underneath,' meaning there are usually going to be more buyers than sellers,\" he said. \"Put it all together and you've got a natural recipe for higher stock prices.\" \nThird, major research firms and brokerage houses are still factoring in the effects of Congress' newly passed tax law , Cramer said. \nFor example, shares of Caterpillar hit all-time highs on Monday after J.P. Morgan upgraded its stock based on benefits stemming from the tax bill. \n\"Each day we get upgrades like this,\" Cramer said. \"More favorable depreciation rules, lower corporate tax rates, a stock shortage and a positive piece of research produce a nice move up.\" \nFourth, market-wide re-valuations are causing stocks like Tesla to enjoy unexpected boosts and stocks like Nvidia to rally in the face of high expectations, Cramer said. \nCase in point: shares of Tesla have surged since the company said it would not be able to meet its production goals for the highly anticipated Model 3 sedan. \n\"This market is starting to value Tesla like a tech stock. I understand it: when a tech company has a hot new product ... but can't produce it in volume this year, investors will give it a pass because they figure it'll make up that volume next year,\" Cramer said. \n\"So when Tesla can't produce enough Model 3s this year, these tech-seeking investors give it a pass — they'll sell the cars next year,\" he continued. \"Look, I am not saying that you should give Tesla a free pass. But that's obviously what the people who trade the stock are doing given how much it's up after those miserable numbers.\" \nNvidia is in a different boat. Even though Cramer pounded the table on the stock all week ahead of CEO Jensen Huang's Sunday speech at CES, investors didn't bite. \nBut after Huang announced two major partnerships with Uber and Volkswagen , the stock popped, proving Cramer right and, more importantly, exposing this market's sentiment. \n\"Here's the bottom line: stock shortages, index funds that own, don't trade, lower valuations than you think and negative news viewed as positive, or shocking news that could have been guessed at, have all combined to levitate stocks,\" the \"Mad Money\" host said. \"Remember, I'm not saying you should buy these stocks because they are rallying. I'm simply trying to explain what keeps driving the market higher, and it's something that's not going away. If anything, it seems to be accelerating.\" WATCH: Cramer lists the rally's chief drivers show chapters", "external_links": [], "published": "2018-01-09T01:14:00.000+02:00", "crawled": "2018-01-09T09:40:45.169+02:00", "highlightTitle": ""}