{"organizations": [], "uuid": "a2a9b5f686e38f4fedf1f745345852bdbe8b5878", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/abengoa-bionergia-restucturing/abengoa-bionergias-brazil-lenders-eye-sugarcane-mills-sales-sources-idUSL2N1PL1F0", "country": "US", "domain_rank": 408, "title": "Abengoa Bionergia's Brazil lenders eye sugarcane mills sales -sources", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.964, "site_type": "news", "published": "2018-01-30T02:13:00.000+02:00", "replies_count": 0, "uuid": "a2a9b5f686e38f4fedf1f745345852bdbe8b5878"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/abengoa-bionergia-restucturing/abengoa-bionergias-brazil-lenders-eye-sugarcane-mills-sales-sources-idUSL2N1PL1F0", "ord_in_thread": 0, "title": "Abengoa Bionergia's Brazil lenders eye sugarcane mills sales -sources", "locations": [], "entities": {"persons": [{"name": "sao paulo", "sentiment": "negative"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "abengoa bionergia", "sentiment": "negative"}, {"name": "bp plc", "sentiment": "none"}, {"name": "abengoa sa", "sentiment": "none"}, {"name": "abengoa bioenergia brasil sa", "sentiment": "none"}, {"name": "abengoa", "sentiment": "none"}, {"name": "bp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAO PAULO, Jan 29 (Reuters) - Banks and investors involved in the court reorganization of energy group Abengoa Bioenergia Brasil SA hope to get paid through a potential sale of the company’s two sugarcane mills, two sources close to the matter told Reuters.\nThere are non-disclosure agreements signed with four potential bidders for the mills, said one of the sources. Two of the suitors already operate in the sector while the other two are investment funds, the source said.\nThough there is no binding proposal, it is hoped all the stakeholders can reach an agreement before the beginning of the next harvest cycle in April, the person said.\nBP Biocombustíveis is a fifth potential suitor, according to the second source. But talks between the sugarcane crushing arm of Spain’s Abengoa SA and the local unit of BP Plc are in the initial stages, the person said.\nBP did not reply to a comment request. Abengoa declined to comment.\nThe potential acquisitions underscore the good prospects of Brazil’s clean energy sector after the government passed rules to increase the amount of biofuels in the country’s fuel mix.\nCrowe Horwath International, which evaluated Abengoa’s assets, said if the company’s Usina São Luiz unit is sold, up to 36 percent of the debt claims could be recovered, amounting to 400 million reais ($126 million), according to court filings.\nAbengoa’s Usina São João could attract a price of 335 million reais, which would equal 30 percent of the debt being restructured in court, according to Crowe Horwath.\nAbengoa Bionergia Brasil filed for bankruptcy protection in September to restructure about 1.1 billion reais ($354 million) of loans and other liabilities in Brazil. Its main creditors are Banco do Brasil, Banco Bradesco SA, Banco Original SA , Banco Santander Brasil SA, and Amerra Capital, court filings show.\nBradesco and Santander declined to comment. Amerra, Banco do Brasil and Banco Original did not reply to comment requests.\nAbengoa debuted in Brazil’s sugar and ethanol sector in 2007 after taking over Dedini Agro for 1.3 billion reais and assuming 730 million reais of debt. Its two mills in São Paulo state can crush about 6 million tonnes of sugarcane annually.\nAbengoa presented an in-court reorganization plan in December.\n$1 = 3.1652 reais Reporting by Ana Mano and José Roberto Gomes; Writing by Ana Mano Editing by Marguerita Choy\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T02:13:00.000+02:00", "crawled": "2018-01-30T18:53:03.009+02:00", "highlightTitle": ""}