{"organizations": [], "uuid": "092953ff0dd3c260e4c22da303967e75e7094d3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-sasb-hires-technical-director.html", "country": "US", "domain_rank": 767, "title": "SASB Hires Technical Director", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:12:00.000+02:00", "replies_count": 0, "uuid": "092953ff0dd3c260e4c22da303967e75e7094d3e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-sasb-hires-technical-director.html", "ord_in_thread": 0, "title": "SASB Hires Technical Director", "locations": [], "entities": {"persons": [{"name": "sonal dalal", "sentiment": "none"}, {"name": "david post", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "ipieca", "sentiment": "none"}], "organizations": [{"name": "epa", "sentiment": "none"}, {"name": "osha", "sentiment": "none"}, {"name": "standards board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 22, 2018 /PRNewswire-USNewswire/ -- The Sustainability Accounting Standards Board (SASB), the independent standard setter for material sustainability information, today announced Sonal Dalal will serve as its new Technical Director.\nThis mission-critical role reports to the SASB Director of Research and will support the work of the independent Standards Board to drive the decision-usefulness and cost effectiveness of SASB standards. The Technical Director is responsible for ensuring the quality and consistency of metrics across all 79 Sustainable Industry Classification System™ (SICS™) industries, evaluating cross-cutting issues, driving thought leadership regarding SASB standards, and managing key relationships with other organizations.\n\"Many people don't realize that SASB is an aggregator of metrics and standards from more than 200 different organizations and entities, such as OSHA, CDP, IPIECA, GRI and the EPA—to name just a few,\" said David Post, SASB Director of Research. \"That's important because it means SASB standards are cost-effective for both companies and investors to implement. As Technical Director, one of Sonal's key responsibilities will be managing great working relationships with these organizations.\"\nSonal brings over two decades of experience in sustainability metrics development and assessment, thought leadership and relationship management. Sonal most recently completed the first ESG materiality assessment at Facebook, where she was Sustainability Strategy Manager. Previously, she held leadership roles over fifteen years at Conservation International where she was a technical specialist and account manager for Coke, Wal-Mart, McDonald's, and other issuers. Prior to CI, Sonal conducted climate risk and human capital research across multiple industries, and counseled executives on best practices in sustainability at The Nature Conservancy.\nThe Technical Director will work closely with SASB Sector Analysts to evaluate the technical aspects of stakeholder public comments on the exposure drafts of the proposed standards and develop a research agenda for future standards updates as SASB moves to codify a complete set of material sustainability standards later this year.\nAbout SASB\nEstablished in 2011, the Sustainability Accounting Standards Board (SASB) is an independent standards-setting organization dedicated to enhancing the efficiency of the capital markets by fostering high-quality disclosure of material sustainability information that meets investor needs. The SASB develops and maintains sustainability accounting standards—for 79 industries in 11 sectors—that help public corporations disclose material information to investors in annual SEC filings. The SASB's rigorous process, which includes evidence-based research and broad, balanced stakeholder participation, yields standards that are valued by investors and corporations alike because they are cost-effective and decision-useful. The SASB standards board comprises nine members with diverse backgrounds and expertise, encompassing capital markets regulation and policy; investing; financial accounting; securities law; corporate finance, and sustainability. For more information, visit www.sasb.org and follow us on Twitter @SASB .\nMedia Contact\nMatt Garrison\nDirector of Communications\nSASB\n(646) 512-4038\nmatt.garrison@sasb.org\nView original content with multimedia: http://www.prnewswire.com/news-releases/sasb-hires-technical-director-300586025.html\nSOURCE Sustainability Accounting Standards Board (SASB)", "external_links": ["https://url.emailprotection.link/?aCGEYRy2346e3rLtV2FLuapkoonqLE9qSBBKneFzWMgo~", "https://twitter.com/SASB", "http://www.prnewswire.com/news-releases/sasb-hires-technical-director-300586025.html"], "published": "2018-01-22T21:12:00.000+02:00", "crawled": "2018-01-22T23:21:36.000+02:00", "highlightTitle": ""}