{"organizations": [], "uuid": "39fa9f1dd00453db18919fad7d8fd66f20be5f7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226607421&w=1200&r=LYNXMPEE0T0WK", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-ecb-board/ireland-to-nominate-central-bank-chief-lane-for-ecb-vice-president-source-idUSKBN1FJ1T0", "country": "US", "domain_rank": 408, "title": "Ireland's Lane to join race for ECB vice president -source", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T21:29:00.000+02:00", "replies_count": 0, "uuid": "39fa9f1dd00453db18919fad7d8fd66f20be5f7c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-ecb-board/ireland-to-nominate-central-bank-chief-lane-for-ecb-vice-president-source-idUSKBN1FJ1T0", "ord_in_thread": 0, "title": "Ireland's Lane to join race for ECB vice president -source", "locations": [], "entities": {"persons": [{"name": "philip lane", "sentiment": "negative"}, {"name": "lane", "sentiment": "negative"}, {"name": "mario draghi", "sentiment": "none"}, {"name": "luis de guindos", "sentiment": "none"}, {"name": "vitor constancio", "sentiment": "none"}, {"name": "paschal donohoe", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "central bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBLIN (Reuters) - Ireland will nominate its central bank governor Philip Lane for the post of European Central Bank Vice President, a government source said on Tuesday, ensuring there will be a contest for the role that could foreshadow the tussle for the ECB’s top job.\nEuro zone finance ministers launched the process of choosing a new ECB number two last week and their choice may offer clues about political positions in the race to replace ECB President Mario Draghi in 2019, euro zone officials told Reuters.\nSpanish Economy Minister Luis de Guindos, the favorite for the job, is so far the only other publicly known candidate to replace Vitor Constancio, whose exit in May will kick off two years of flux at one of Europe’s most vital institutions.\nIrish Finance Minister Paschal Donohoe will confirm the nomination later on Tuesday, the government source told Reuters. Euro zone governments can present their candidates until Feb. 7 and euro zone finance ministers will vote on Feb. 19 ahead of a European Parliament hearing and final appointment by EU leaders.\nWith EU spoils shared around the bloc, selecting a southern European would signal that Draghi’s job will go to northern Europe, possibly Germany, euro zone officials, who asked not to be named, have told Reuters.\nBut handing Ireland a position on the ECB’s executive board for the first time next month could change that dynamic.\nFrench officials have privately expressed support for the Irish candidate, in the hope the nomination of a northern European for the vice-president’s job would ensure a more open contest for the presidency.\nLane, an economics professor who received a doctorate from Harvard and spent time at Columbia University before returning home to Trinity College Dublin, has also been mentioned as a possible candidate to take over as ECB Chief Economist in 2019.\nThe 48-year-old was appointed governor of Ireland’s central bank in October 2015 on a seven-year term.\nHe has acted as an academic consultant for the European Commission, International Monetary Fund, World Bank and a number of central banks, including the ECB.\nLane has most recently spearheaded a taskforce in Frankfurt working on a new “safe asset” aimed at breaking a vicious circle of lending by banks to their national governments.\nReporting by Padraic Halpin; Editing by Catherine Evans\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T21:29:00.000+02:00", "crawled": "2018-01-30T16:27:09.022+02:00", "highlightTitle": ""}