{"organizations": [], "uuid": "18763fac69436503d8ff58567dd1381a1ab30af8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226412095&w=1200&r=LYNXMPEE0S1KO", "site_section": "http://feeds.reuters.com/reuters/politicsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-fiscal/u-s-budget-deficit-to-top-1-trillion-in-2019-budget-experts-idUSKBN1FI2P2", "country": "US", "domain_rank": 408, "title": "U.S. budget deficit to top $1-trillion in 2019: budget experts", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T23:51:00.000+02:00", "replies_count": 0, "uuid": "18763fac69436503d8ff58567dd1381a1ab30af8"}, "author": "", "url": "https://www.reuters.com/article/us-usa-fiscal/u-s-budget-deficit-to-top-1-trillion-in-2019-budget-experts-idUSKBN1FI2P2", "ord_in_thread": 0, "title": "U.S. budget deficit to top $1-trillion in 2019: budget experts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - As the U.S. Congress limps toward the likely passage next week of another stopgap spending bill to avert a government shutdown, a Washington think tank has estimated the federal budget deficit is on track to blow through $1 trillion in 2019.\nIf it does, it would be the first time since 2012 the U.S. economy will have to support a deficit so large, highlighting a basic shift for the Republican Party, which has traditionally prided itself on fiscal conservatism.\nThe Committee for a Responsible Federal Budget, a Washington fiscal watchdog, said the red ink may rise in fiscal 2019 to $1.12 trillion. If current policies continue, it said, the deficit could top a record-setting $2 trillion by 2027.\nThe committee had previously projected the deficit - the difference between the government spending and its annual tax revenue - would reach $983 billion in fiscal 2019. That estimate came after Congress in December passed a tax overhaul that will add about $1.5 trillion to the national debt over a decade.\nBut that estimate was made obsolete by a shutdown-averting stopgap funding bill Congress approved earlier this month. It delayed the implementation of some healthcare taxes, further reducing the government’s projected tax revenues.\nCongress in coming days is expected to weigh another stopgap funding bill, needed by Feb. 8. Lawmakers also want to pass disaster relief funding, and they are pursuing an agreement to lift budget caps on spending.\nStan Collender, a longtime budget expert, predicted in October that trillion-dollar deficits would become “the new normal” under President Donald Trump. Trump and fellow Republicans control the White House and both chambers of Congress.\nThere were four consecutive $1-trillion deficits under former President Barack Obama. But they resulted from a historic financial crisis, a recession and stimulative spending.\n“During the Trump years, the deficits are occurring mostly because of legislative changes, like the tax cut,” Collender said.\nIn June 2017, before the tax overhaul was enacted, the nonpartisan Congressional Budget Office, Congress’ official scorekeeper, predicted the U.S. government would hit a trillion-dollar deficit in fiscal 2022.\nAn updated CBO report would typically be released around now, but the office said last week that the update would be delayed, partly because of the need to produce projections that reflect the recently enacted tax legislation.\nReporting by Susan Cornwell; Editing by Kevin Drawbaugh and David Gregorio\n ", "external_links": [], "published": "2018-01-29T23:51:00.000+02:00", "crawled": "2018-01-30T00:12:22.001+02:00", "highlightTitle": ""}