{"organizations": [], "uuid": "e63c027cc7c4b04d369ab26897264616b1124924", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-gex-management-stock-symbol-returns-to-gxxm-following-recent-dividend-and-announces-2018-growth-strategy.html", "country": "US", "domain_rank": 767, "title": "GEX Management Stock Symbol Returns to GXXM Following Recent Dividend and Announces 2018 Growth Strategy", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.027, "site_type": "news", "published": "2018-01-12T12:44:00.000+02:00", "replies_count": 0, "uuid": "e63c027cc7c4b04d369ab26897264616b1124924"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-gex-management-stock-symbol-returns-to-gxxm-following-recent-dividend-and-announces-2018-growth-strategy.html", "ord_in_thread": 0, "title": "GEX Management Stock Symbol Returns to GXXM Following Recent Dividend and Announces 2018 Growth Strategy", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "gex management stock symbol returns", "sentiment": "negative"}, {"name": "gex management, inc.", "sentiment": "neutral"}, {"name": "northwest arkansas", "sentiment": "none"}, {"name": "gex management", "sentiment": "none"}, {"name": "nyse american stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 12, 2018 /PRNewswire/ -- GEX Management, Inc. (OTCQB: GXXM), a visionary management and professional services company, announced the implementation of its 2018 growth strategy to enlarge its corporate footprint, increase liquidity, and ultimately satisfy the requirements necessary to up-list to the NYSE American Stock Exchange.\nThe initial phase of this strategy included a stock dividend. This dividend had a net effect of a 4-for-3 forward split. The process of implementing the forward split included the addition of the letter \"D\" to the Company's stock symbol for approximately 20 trading days. The GEX Management stock ticker has now reverted back to its original trading symbol of \" GXXM .\" \"I believe this forward split will increase the liquidity of our company stock, deliver quantifiable value to our shareholders, and grow our investor base. The recent acquisition of property in Northwest Arkansas is reflective of management's commitment to growth. My aim is to continue accelerating this GEX Management trend with the aspiration of up-listing with a national exchange designed for growing companies,\" stated Carl Dorvil, CEO of GEX Management.\nAbout GEX Management\nGEX Management, Inc. Is a licensed Professional Employer Organization (PEO) and a Professional Services Company providing comprehensive back office services to clients in a variety of industries. GEX Management services include HR, Payroll, Risk & Compliance, and Executive Consulting, and provides progressive and complete solutions for employee management and operational needs. http: www.gexmanagement.com\nInformation on Forward Looking Statements\nThe statements contained herein that are not historical facts are forward-looking statements within the meaning of the federal securities laws (Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934). You can identify such forward-looking statements by the words \"expects,\" \"intends,\" \"plans,\" \"projects,\" \"believes,\" \"estimates,\" \"likely,\" \"possibly,\" \"probably,\" \"goal,\" \"opportunity,\" \"objective,\" \"target,\" \"assume,\" \"outlook,\" \"guidance,\" \"predicts,\" \"appears,\" \"indicator\" and similar expressions. Forward-looking statements involve a number of risks and uncertainties. In the normal course of business, GEX Management, Inc., in an effort to help keep our stockholders and the public informed about our operations, may from time to time issue such forward-looking statements, either orally or in writing. Generally, these statements relate to business plans or strategies, projected or anticipated benefits or other consequences of such plans or strategies, or projections involving anticipated revenues, earnings, profits, pricing, operating expenses or other aspects of operating results. We base the forward-looking statements on our expectations, estimates, and projections at the time such statements are made. These statements are not guarantees of future performance and involve risks and uncertainties that we cannot predict. In addition, we have based many of these forward-looking statements on assumptions about future events that may prove to be inaccurate. The actual results of the future events described in such forward-looking statements could differ materially from those stated in such forward-looking statements.\nView original content: http://www.prnewswire.com/news-releases/gex-management-stock-symbol-returns-to-gxxm-following-recent-dividend-and-announces-2018-growth-strategy-300581811.html\nSOURCE GEX Management", "external_links": ["http://www.gexmanagement.com/", "http://www.prnewswire.com/news-releases/gex-management-stock-symbol-returns-to-gxxm-following-recent-dividend-and-announces-2018-growth-strategy-300581811.html"], "published": "2018-01-12T12:44:00.000+02:00", "crawled": "2018-01-12T13:13:59.000+02:00", "highlightTitle": ""}