{"organizations": [], "uuid": "6437e1355ee5b5fd738207bfaee310ee259aa984", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222991917&w=1200&r=LYNXMPEE0H0PR", "site_section": "https://www.reuters.com/finance/currencies", "section_title": "Currency Converter, Currencies News | Reuters.com", "url": "https://www.reuters.com/article/uk-britain-sterling/sterling-steady-after-recent-run-up-as-brexit-risks-take-backseat-idUSKBN1F716Q", "country": "US", "domain_rank": 408, "title": "Sterling tops $1.39, heads for longest winning streak since 2014", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:29:00.000+02:00", "replies_count": 0, "uuid": "6437e1355ee5b5fd738207bfaee310ee259aa984"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-sterling/sterling-steady-after-recent-run-up-as-brexit-risks-take-backseat-idUSKBN1F716Q", "ord_in_thread": 0, "title": "Sterling tops $1.39, heads for longest winning streak since 2014", "locations": [], "entities": {"persons": [{"name": "londo", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "mufg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Sterling climbed above $1.39 on Thursday for the first time since Britain’s vote to leave the European Union and was on track for a fifth consecutive week of gains against the U.S. currency - its longest winning streak since mid-2014.\nThe pound has been buoyed by a combination of broad dollar weakness and optimism that Britain will reach a favourable divorce deal with the EU and that the economy will continue to grow at a healthy clip - albeit more slowly that if there had been no Brexit vote.\nSterling has climbed more than 5 percent against the dollar over the past two months, helped by Britain’s success in late December in securing a deal to move exit talks on to discussions over a transition period and post-Brexit trade.\nThe pound jumped to as high as $1.3942 in New York trading on Wednesday before easing back by the end of the day. On Thursday it rebounded half a percent to trade at $1.3903.\nJapanese bank MUFG says it sees sterling trading around $1.47 by the end of the year.\n“We have a bullish view on the pound,” said the bank’s chief macro strategist in London, Derek Halpenny.\n“Once a transition period for Brexit is confirmed, that takes off the cliff-edge risk of March 29 (2019, the date Britain is due to officially leave the EU) and paves the way for two rate hikes from the BoE (Bank of England),” he added.\nSterling has in recent sessions been supported by a sell-off in the dollar and more positive noises from Europe over negotiations with Britain over the terms of its departure from the trading bloc.\nBritish Prime Minister Theresa May on Thursday offered France 44.5 million pounds ($62 million) to bolster security at French border controls, part of measures to deepen cooperation that she hopes will foster goodwill in Brexit talks.\nWith the improved outlook for those discussions, traders said sterling had been able to anchor itself again to the domestic story, where the economy is proving more resilient than expected.\n“It seems the Brexit negotiations are starting to pan out. Some of the political uncertainties in the UK are starting to fade. It’s turning into a bit of a momentum rally,” said Martin Arnold, macro strategist at ETF Securities.\nAgainst the euro, which has rallied in recent weeks, the pound was flat at 88.12 pence per euro.\nBank of England policymaker Michael Saunders said on Wednesday that British unemployment was likely to fall further than most economists expected this year, pushing pay growth higher.\nWhile he stuck close to BoE language that any interest rate rises would be “limited and gradual”, some analysts believe the bank will be forced to tighten monetary policy faster if inflation fails to fall as predicted.\nReporting by Tommy Wilkes and Jemima Kelly; Additional reporting by Dhara Ranasinghe; Editing by Jon Boyle\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T19:29:00.000+02:00", "crawled": "2018-01-19T00:54:56.000+02:00", "highlightTitle": ""}