{"organizations": [], "uuid": "9f3c4e753f502f4218d4c39ce7e6ee741a12956a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-autonomic-m-a-ford/ford-buys-transport-services-startups-autonomic-transloc-idUSKBN1FE2I1", "country": "US", "domain_rank": 408, "title": "Ford buys transport services startups Autonomic, TransLoc", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:00:00.000+02:00", "replies_count": 0, "uuid": "9f3c4e753f502f4218d4c39ce7e6ee741a12956a"}, "author": "", "url": "https://www.reuters.com/article/us-autonomic-m-a-ford/ford-buys-transport-services-startups-autonomic-transloc-idUSKBN1FE2I1", "ord_in_thread": 0, "title": "Ford buys transport services startups Autonomic, TransLoc", "locations": [], "entities": {"persons": [{"name": "sunny madra", "sentiment": "none"}, {"name": "joseph white", "sentiment": "none"}, {"name": "jim hackett", "sentiment": "none"}], "locations": [{"name": "palo alto, california-based autonomic", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "ford", "sentiment": "negative"}, {"name": "autonomic technologies inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "transloc inc", "sentiment": "none"}, {"name": "ford motor co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (Reuters) - Ford Motor Co on Thursday said it will buy transportation software companies Autonomic Technologies Inc and TransLoc Inc for undisclosed sums as part of a strategy to expand ride services and transport businesses.\nFord said Sunny Madra, the chief executive of Autonomic, will join Ford to run a new unit called “Ford X” to develop new transport services businesses. Palo Alto, California-based Autonomic has about 70 employees.\nDurham, North Carolina-based TransLoc provides software to help cities schedule and manage transit services.\nFord said it plans to expand its Chariot van service this year to more cities, and shift Chariot’s focus to collaborating with businesses to provide rides to employees.\nFord last year bought an undisclosed stake in Autonomic. Ford Chief Executive Jim Hackett this month outlined plans to use Autonomic to develop a Transportation Mobility Cloud service that would serve as an industry standard for connecting vehicles and public transit.\nFILE PHOTO: Jim Hackett, CEO of Ford Motor Company, listens to an audience member during the Ford keynote at CES in Las Vegas, Nevada, U.S., January 9, 2018. REUTERS/Rick Wilking/File Photo Neil Schloss, chief financial officer for Ford’s Smart Mobility operations, said the automaker could make more acquisitions as it tests different ways to generate revenue from transportation services and vehicles connected to the internet.\nFord, for example, plans to expand a test of a service providing non-emergency medical transport, such as transferring patients from a hospital to a nursing home. Ford is working with a hospital in the Detroit area, and now plans to expand the effort, Schloss said.\n“We do all the fleet management, we have the drivers and we provide the service,” Schloss said.\nFord on Wednesday reported a loss of $299 million on investments in mobility services, and forecast higher spending this year. Still, investments in transportation services are small compared to overall spending.\nFord shares are down 3.5 percent for the year to date, and slumped earlier this month after company officials warned that 2018 results would decline from 2017 levels because of higher commodity costs and other factors.\nFord on Wednesday reported lower-than-expected profits for the fourth quarter of 2017, and analysts expressed frustration that Hackett did not offer more specific details on how the company intends to rebuild profits in its core automotive business.\nReporting by Joe White; Editing by Will Dunham\n ", "external_links": [], "published": "2018-01-25T19:00:00.000+02:00", "crawled": "2018-01-25T19:14:53.073+02:00", "highlightTitle": ""}