{"organizations": [], "uuid": "88128f6114b17ebc83a2b9f2e6347381dcd23f5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 9}, "facebook": {"likes": 210, "shares": 210, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/20/104540349-GettyImages-502194322.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/08/cramer-marijuana-bitcoin-and-micron-are-all-speculative-investments.html", "country": "US", "domain_rank": 767, "title": "Cramer: Marijuana, bitcoin and Micron are all speculative investments", "performance_score": 2, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T01:32:00.000+02:00", "replies_count": 0, "uuid": "88128f6114b17ebc83a2b9f2e6347381dcd23f5d"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/08/cramer-marijuana-bitcoin-and-micron-are-all-speculative-investments.html", "ord_in_thread": 0, "title": "Cramer: Marijuana, bitcoin and Micron are all speculative investments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Twitter has long been a part of how CNBC's Jim Cramer interacts with viewers, gets feedback and finds the hottest, most talked-about trends in the market.\n\"Right now, the speculators are pressing me on three major issues: marijuana, cryptocurrencies and the stock of Micron ,\" the \" Mad Money \" host said on Monday.\nNow, Cramer might get testy on Twitter from time to time, but he respects legitimate speculation when he sees it.\nBut the \"Mad Money\" host was concerned that people buying marijuana stocks, bitcoin and its derivatives or shares of Micron didn't know they were actually speculating on these equities.\n\"They seem to think they're making a normal investment and I think that's a mistake,\" Cramer said.\nCramer began with the cryptocurrency market. While he believed in its staying power, he said that derivatives and other speculative vehicles only make it harder to pin a precise value on a given digital currency.\n\"[They] ultimately don't sync with the value of the thing they actually represent, or tangential equities like an Overstock ... or a Square or AMD or Nvidia ,\" Cramer said. \"I'll change my mind and become more positive the moment I see that cryptocurrencies are being treated like de-facto currencies, a la gold.\"\nNext, Cramer turned to marijuana. Cannabis stocks took a hit last week after U.S. Attorney General Jeff Sessions revealed plans to rescind an Obama-era policy stating that the federal government couldn't override states' rights when it came to legalization.\nCramer noted that while the global marijuana market would recover despite the setback, the domestic market seems to be facing further turmoil.\n\"As far as I'm concerned, there's way too much speculation in this sector already,\" he said.\nFinally, Cramer addressed the backlash he received after cautioning investors about the stock of Micron.\nHis Twitter followers pounced after he detailed some potential negatives for the chipmaker on Friday and said he preferred the stocks of Nvidia and Broadcom .\n\"The bull case? Micron's stock sells for less than five times earnings,\" Cramer said. \"To me, though, that's exhibit A for the bears, because when Micron has sold that cheaply in the past, it usually means that the company won't be able to meet its earnings estimates.\"\nThe \"Mad Money\" host pointed out that Micron's two main products, flash memory and DRAM chips, are both commodities and subject to boom-and-bust cycles.\nCramer said that pricing for flash memory chips peaked several months ago and DRAM could be following closely behind: a potential death knell for Micron's next earnings report.\n\"I've seen this stock collapse three separate times in my life and the circumstances were almost identical to those we're seeing right now: more supply coming on after a big run in price for DRAMs,\" Cramer said. \"The difference? This time Micron does have a second product line, flash, but as I mentioned, flash has peaked, and once commodities peak, they tend to stay down for ages.\"\nSo while the winds of demand, supply, power and politics could still blow in favorable directions for any of these three investments, Cramer wanted to set the record straight for speculators.\n\"Clever speculation always makes sense to me,\" Cramer concluded. \"But a recognition that you're speculating — not investing — would make me [feel] a whole lot better ... about anyone making these choices. Everyone focuses on the rewards from these kinds of stories, but you'll never get anywhere unless you start taking the risks as seriously as the rewards. That's right: calculate the risk, how much you can lose, not just how much you can win.\"\nWATCH: Cramer on what pot, bitcoin and Micron have in common show chapters Cramer: Marijuana, bitcoin and Micron are all speculative investments 15 Hours Ago | 07:09 Disclosure: Cramer's charitable trust owns shares of Nvidia and Broadcom.\n ", "external_links": [], "published": "2018-01-09T01:32:00.000+02:00", "crawled": "2018-01-09T09:47:29.660+02:00", "highlightTitle": ""}