{"organizations": [], "uuid": "aad924e892fae533f26bd4c40db511b34cb19ff5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-cim-group-acquires-datacenter-in-toronto-area.html", "country": "US", "domain_rank": 767, "title": "CIM Group Acquires Datacenter in Toronto Area", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T23:24:00.000+02:00", "replies_count": 0, "uuid": "aad924e892fae533f26bd4c40db511b34cb19ff5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-cim-group-acquires-datacenter-in-toronto-area.html", "ord_in_thread": 0, "title": "CIM Group Acquires Datacenter in Toronto Area", "locations": [], "entities": {"persons": [], "locations": [{"name": "toronto area toronto", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "markham", "sentiment": "none"}, {"name": "clegg road", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "cim group", "sentiment": "negative"}, {"name": "cim group acquires datacenter", "sentiment": "negative"}, {"name": "greater toronto area", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO--(BUSINESS WIRE)-- CIM Group, in partnership with fifteenfortyseven Critical Systems Realty (“1547”), today announced the acquisition of a 42,000-square-foot operating datacenter situated on 3.5 acres in Markham, ON which is part of the Greater Toronto Area. I.C.E Datacenters ( I nterconnection & C olocation for the E nterprise) sold the property to the partnership and will leaseback a significant portion of the data center. This acquisition adds to CIM Group's portfolio of diverse, infrastructure investments that includes renewable energy, urban parking facilities, water supply infrastructure, and waste solutions, and marks 1547’s first international data center location.\nLocated in the technology capital of Canada, just 20 miles outside of downtown Toronto, the Markham facility at 105 Clegg Road was originally purpose-built as an enterprise supercomputer site, and over the last year was redeveloped into a multi-tenant Tier III datacenter by I.C.E Datacenters. The property consists of the existing, fully-built 2 megawatts facility, and includes entitlements for up to 60,000 square-feet of datacenter space, with an additional 6 megawatts of available power. The existing datacenter features two private and independent fiber paths connecting to the leading downtown interconnection hub at 151 Front Street, providing access to robust fiber infrastructure as well as immediate proximity to international and primary U.S. network and cloud peering points.\n“Our portfolio expansion with CIM Group into one of Canada’s most robust datacenter markets will bring much needed multi-tenant wholesale datacenter capacity online to service the growing demand,” states J. Todd Raymond, CEO of 1547. “Additionally, we’re looking forward to working with the team at I.C.E Datacenters and its sister company, Metro Optic, to expand opportunities for both organizations.”\nI.C.E Datacenters and the new owners will jointly market the datacenter, with 1547 focused on the wholesale market and I.C.E Datacenters on retail colocation and connectivity to all major networks, carrier hotels and cloud providers. Additionally, CIM and 1547 have begun marketing the entitled expansion to potential tenants and pursue development with pre-leasing.\n“We are excited to have CIM Group and 1547 as our new property owner and partner,” comments Michael Bucheit, CEO of I.C.E Datacenters and Metro Optic. “Their presence in key U.S. markets and deep expertise in wholesale datacenters, combined with our relationships and knowledge of the local Toronto and broader Canadian markets, create material synergies that will enable both companies to excel in this location and beyond.”\n“Our relationship with I.C.E Datacenters will enable us to service a range of customer requirements, from pure, single cross-connect interconnection through multi-megawatt turn-key and build-to-suit deployments,” adds Mr. Raymond.\nCIM started its investment activities in Canada through SkyPower Global, which has become one of the biggest solar developers, with offices in more than 30 countries and a pipeline of projects adding up to 250,000 megawatts. This is CIM’s second acquisition in Toronto, and its second investment with 1547. Earlier this summer, the joint venture marked its first datacenter acquisition with 400 Paul Avenue, a 7.3-acre property planned for a 240,000-square-foot data center campus.\nAbout CIM Group\nEstablished in 1994, CIM is a vertically-integrated owner and operator of real assets for its own account, and on behalf of its partners and co-investors seeking to invest in urban real assets and associated credit strategies, with a principal focus on North America. CIM’s real assets include urban residential, commercial, retail, hospitality, debt, and infrastructure investments. CIM’s broad expertise includes in-house research, acquisition, investment, development, finance, leasing and asset management capabilities. For more information, please visit www.cimgroup.com\nAbout fifteenfortyseven Critical Systems Realty, LLC\nfifteenfortyseven Critical Systems Realty is a leading developer and operator of custom-designed datacenters with over 500,000 square feet of datacenter space under development in Orangeburg, NY, Chicago, IL, Cheyenne, WY, San Francisco, CA and Kapolei, HI. Central to the firm’s strategy is the ability to uncover the true intrinsic value of properties, opportunistically developing world-class datacenter facilities with a focus on providing tenants with customized mission critical solutions from concept through completion. 1547 was formed in 2011 by a group of experienced executives from the financial and datacenter industries to leverage their combined expertise to produce market leading datacenter development projects. Together, the team has over 60 years of experience in developing, renovating and operating datacenter space. This wealth of experience allows 1547 to be uniquely positioned to acquire, develop, and operate strategically-located, custom built datacenter properties. For more information, please visit www.1547realty.com .\nAbout I.C.E Datacenters\nI.C.E Datacenters (Interconnection & Colocation for the Enterprise) operates multiple datacenter sites and interconnection hubs in Canada including flagship sites in Montreal and Toronto. I.C.E Datacenters combines international datacenter expertise serving enterprises and cloud operators in the U.S. and Canada with deep expertise in operating high-speed fiber networks through its sister company Metro Optic. I.C.E Datacenters serves 150+ clients including global network providers, Fortune 500 companies in industry, e-commerce, financial services and healthcare, the government, cloud providers, ISPs, content providers and CDNs across its datacenter and fiber network in Canada. For more information, please visit www.icedatacenters.com and www.metrooptic.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006431/en/\nMEDIA CONTACTS:\nFor: CIM Group\nDiehl Communications\nKaren Diehl\n(310) 741-9097\nkaren@diehlcommunications.com\nor\nFor: 1547 Datacenters\niMiller Public Relations\n(866) 307-2510\npr@imillerpr.com\nor\nFor: I.C.E Datacenters & Metro Optic\nVanessa Graetz-Côté\nMarketing & P.R. Coordinator\n(514) 954-1162 ext. 602\nvanessa@metrooptic.com\nSource: CIM Group", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.icedatacenters.com%2F&esheet=51747010&newsitemid=20180123006431&lan=en-US&anchor=I.C.E+Datacenters&index=1&md5=80ee16e4a055955dd8f17b6bd1f17032", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.icedatacenters.com&esheet=51747010&newsitemid=20180123006431&lan=en-US&anchor=www.icedatacenters.com&index=4&md5=943370d3889855155dacbf8c1c45725d", "http://www.businesswire.com/news/home/20180123006431/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.metrooptic.com&esheet=51747010&newsitemid=20180123006431&lan=en-US&anchor=www.metrooptic.com&index=5&md5=d51aaf83f5d843eaf0e9f2a4753c4a97", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.1547realty.com&esheet=51747010&newsitemid=20180123006431&lan=en-US&anchor=www.1547realty.com&index=3&md5=2e1a4d43e02934b94ee6d6fc7600e26d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cimgroup.com&esheet=51747010&newsitemid=20180123006431&lan=en-US&anchor=www.cimgroup.com&index=2&md5=97b6b80cf36af2420ad0e309ac4ea25c"], "published": "2018-01-23T23:24:00.000+02:00", "crawled": "2018-01-24T01:56:43.045+02:00", "highlightTitle": ""}