{"organizations": [], "uuid": "46c4a6fa6a0d7bd14bef7cabace60a72407aed44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/15/104946980-GettyImages-524191812.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/esma-cryptocurrency-icos-can-result-in-loss-of-your-investments.html", "country": "US", "domain_rank": 767, "title": "ESMA: Cryptocurrency ICOs can result in loss of your investments.", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-16T10:00:00.000+02:00", "replies_count": 0, "uuid": "46c4a6fa6a0d7bd14bef7cabace60a72407aed44"}, "author": "Andrew Wong", "url": "https://www.cnbc.com/2018/01/16/esma-cryptocurrency-icos-can-result-in-loss-of-your-investments.html", "ord_in_thread": 0, "title": "ESMA: Cryptocurrency ICOs can result in loss of your investments.", "locations": [], "entities": {"persons": [{"name": "maijoor", "sentiment": "none"}, {"name": "horacio villalobos", "sentiment": "none"}, {"name": "steven maijoor", "sentiment": "none"}], "locations": [], "organizations": [{"name": "corbis", "sentiment": "none"}, {"name": "european securities and markets authority", "sentiment": "none"}, {"name": "ipo", "sentiment": "none"}, {"name": "frankfurt european banking congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Buying into initial coin offerings (ICOs) can lead to the total loss of an investment, said the head of a top European regulator.\nICOs bear similarities to initial public offerings for a stock, but in an IPO, the investor usually has a stake in the company, whereas coin sales differ widely in terms of acquired rights. That's been a primary criticism of ICOs, but differences in regulation are also important factors for investors to consider, according to Steven Maijoor, the chair of the European Securities and Markets Authority.\n\"You don't have the regular protection that regulated investments offer, and can lose all of your investments,\" Maijoor said Tuesday. \"As a European securities market authority, we have warned, in November, about the so-called ICOs because while ICOs in principle can give you services in return for the coin that you buy, or a share in the revenue, this happens in a very unregulated space.\"\nHoracio Villalobos | Corbis | Getty Images Steven Maijoor at the 25th Frankfurt European Banking Congress on November 20, 2015. The issues associated with ICOs have led to some countries taking action. China moved to ban new coin offerings and shut down domestic cryptocurrency exchanges in 2017. More recently, South Korea's justice minister suggested that a bill to ban all cryptocurrency trading was being considered.\nMaijoor also mentioned that, while government action has so far only been taken in Asia, the ESMA's role as a regulator is to provide information across countries to better prepare for cryptocurrency developments.\n\"It is hard for me to generalize the attitude towards cryptocurrency across Europe and Asia because the regulations, rules and intervention need to be based on local situations and circumstances,\" the ESMA chair said.\n\"Cryptocurrency has different developments across the world ... our role as regulators is to exchange information to help each other prepare for these developments.\"", "external_links": [], "published": "2018-01-16T10:00:00.000+02:00", "crawled": "2018-01-16T10:01:47.010+02:00", "highlightTitle": ""}