{"organizations": [], "uuid": "2085512021830c5e9e3449ff9e8868b2f0e240d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-cilic/tennis-cilic-dealt-tough-hand-again-against-federer-idUKL4N1PN0CH", "country": "US", "domain_rank": 408, "title": "Tennis-Cilic dealt tough hand again against Federer", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T17:07:00.000+02:00", "replies_count": 0, "uuid": "2085512021830c5e9e3449ff9e8868b2f0e240d8"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-cilic/tennis-cilic-dealt-tough-hand-again-against-federer-idUKL4N1PN0CH", "ord_in_thread": 0, "title": "Tennis-Cilic dealt tough hand again against Federer", "locations": [], "entities": {"persons": [{"name": "tennis-cilic", "sentiment": "negative"}, {"name": "fede", "sentiment": "negative"}, {"name": "martyn herman", "sentiment": "none"}, {"name": "federer", "sentiment": "none"}, {"name": "cilic", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "tennis-cilic", "sentiment": "none"}, {"name": "cilic", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "marin cilic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 3:12 PM / Updated an hour ago Tennis-Cilic dealt tough hand again against Federer Martyn Herman 3 Min Read \nMELBOURNE, Jan 28 (Reuters) - Beating Roger Federer is a daunting enough prospect at the best of times but Marin Cilic must be wondering when he will get a fair crack against the record-breaking Swiss. \nSix months ago in his first Wimbledon final, the Croatian was hobbled by blisters that left him at the mercy of Federer who duly notched his 19th grand slam title. \nOn Sunday in sweltering Melbourne, in Cilic’s first Australian Open final, Federer made it 20 major triumphs as circumstances again conspired against the 29-year-old. \nFerocious temperatures meant tournament organisers made a late call to play the showpiece final with the roof closed. \nAnd while Federer had warmed up on Rod Laver Arena with the roof closed earlier in the day, Cilic prepared with his usual routine on an outside court, apparently expecting the contest to take place in oven-like conditions. \nWhen play began Cilic was all at sea. He lost the first four games, two on his own serve, in a flash before losing the opening set in 24 minutes -- changing his racket after two games as he struggled with string tensions. \nAgainst the best front-runner in the business and the best exponent of indoor tennis, for Cilic it was like climbing Mount Everest with a fridge. But he stuck manfully to his task to give Federer a real fright before losing 6-2 6-7(5) 6-3 3-6 6-1. \nCilic did not even receive much appreciation for his effort. Federer has proxy-Aussie status Down Under and the sell-out crowd was overwhelmingly on his side chanting “Roger, Roger” as the match wore on. If only there were a grand slam in Zagreb, Cilic must have thought. \nWhile making no excuses, Cilic said the roof decision, provoked by the tournament’s “extreme heat” rules, had thrown him off a little at the start of the contest. \n“Really happy with the performance that I did. Mentally was tough,” Cilic, who can console himself with a rise to world number three, told reporters. \n”Difficult with the conditions. It was just little bit difficult to adjust. With the roof closed, it was way, way cooler than I expected. \n”They just came to me to tell they were going to make the final decision around 7pm, just before the match. \n“I didn’t mind to have roof closed, but it was a huge difference in temperature from having outside 38 (degrees Celsius), then when you came in, it was like 23.” \nCilic said the two break points he had at the start of the fifth set when Federer was rocking were crucial, with Federer admitting he may not have recovered had he lost that game. \n“That game was crucial with the break points that I didn’t convert,” he said. “It ran away from me after that.” (Reporting by Martyn Herman, editing by Pritha Sarkar)", "external_links": [], "published": "2018-01-28T17:07:00.000+02:00", "crawled": "2018-01-28T17:36:35.003+02:00", "highlightTitle": ""}