{"organizations": [], "uuid": "7dc797e4c39650f9cdaa443328c7b10668a47135", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222154761&w=1200&r=LYNXMPEE0E0Z7", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-venezuela-politics-perez/venezuelan-authorities-surround-self-identified-rogue-helicopter-pilot-idUSKBN1F41SO", "country": "US", "domain_rank": 408, "title": "Venezuelan authorities surround self-identified rogue helicopter pilot", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:03:00.000+02:00", "replies_count": 0, "uuid": "7dc797e4c39650f9cdaa443328c7b10668a47135"}, "author": "", "url": "https://www.reuters.com/article/us-venezuela-politics-perez/venezuelan-authorities-surround-self-identified-rogue-helicopter-pilot-idUSKBN1F41SO", "ord_in_thread": 0, "title": "Venezuelan authorities surround self-identified rogue helicopter pilot", "locations": [], "entities": {"persons": [{"name": "oscar perez", "sentiment": "none"}, {"name": "perez", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "caracas", "sentiment": "none"}, {"name": "el junquito", "sentiment": "none"}, {"name": "caracas", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "national guard", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CARACAS (Reuters) - - Self-identified rogue helicopter pilot Oscar Perez appeared with a bloody face in a series of Instagram videos on Monday, saying that he was surrounded by authorities who were shooting at him in a poor neighborhood outside Caracas. \nPerez, a former police pilot, is wanted for using a stolen helicopter to lob grenades and shoot at government buildings in June as well as for breaking into a National Guard unit in December to steal weapons. \nPresident Nicolas Maduro’s leftist government has described him as a “fanatic, extremist terrorist” and a manhunt has been under way for months. Some critics of Maduro have questioned whether his attacks were staged in cahoots with the government to justify a further crackdown on the opposition. \nAuthorities appeared to finally track him down in the poor hillside neighborhood of El Junquito. In a dozen dramatic videos posted on Instagram, Perez said authorities were firing at him with grenade launchers and snipers were outside. \n“We’re wounded... they’re killing us!” said Perez, seemingly wearing a bulletproof vest, as he crouched down in what appeared to be a small house and gunshots were heard in the background. \n“Venezuela, don’t lose hope... Now only you have power so that we can all be free,” he said in an earlier video, staring into the camera and telling his children he loves them and hopes to see them again. \n‘CAUGHT LIKE A RAT’ \nThe Information Ministry did not immediately respond to a request for comment. However, some members of Maduro’s government scoffed at Perez on Monday morning. \n“What a coward now that he’s caught like a rat!” tweeted Prisons Minister Iris Varela. “Where is the courage he had to attack military units, kill and injure officials and steal weapons?” \nAn action film star who portrays himself as a James Bond or Rambo-like figure on social media, Perez has added surreal twists to Venezuela’s long-running political drama. \nHe rose to fame in June after allegedly hijacking a police helicopter, flying over Caracas’ center and firing shots at and lobbing grenades on the Interior Ministry and the Supreme Court. \nPerez claimed responsibility for the attack, saying it was to fight what he said was a tyrannical government. \nHe went into hiding afterward, only to pop up two weeks later at an opposition vigil for anti-government protesters killed during demonstrations that rocked the country last year. \nThen in December, a video posted on Perez’s YouTube account shows armed, masked men taking control of military barracks under cover of night. \nThey smash photos of Maduro and his predecessor, the late Hugo Chavez, handcuff around a dozen soldiers and berate them for supporting “dictatorship” in Venezuela. Perez says his team stole around 26 AK-103’s and over 3,000 munitions for the rifles, as well as pistols. \nAdditional reporting by Christian Veron; Writing by Alexandra Ulmer; Editing by Frances Kerry\n ", "external_links": [], "published": "2018-01-15T16:03:00.000+02:00", "crawled": "2018-01-15T16:11:30.018+02:00", "highlightTitle": ""}