{"organizations": [], "uuid": "895d69873981bdf1f35cdb74bb34c32ed8cd712e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/donald-trump-camp-david.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/06/donald-trump-north-korea-talks/", "country": "US", "domain_rank": 1196, "title": "Donald Trump Open to North Korea Talks at the 'Appropriate Time' | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.155, "site_type": "news", "published": "2018-01-06T18:04:00.000+02:00", "replies_count": 0, "uuid": "895d69873981bdf1f35cdb74bb34c32ed8cd712e"}, "author": "Jaclyn Gallucci", "url": "http://fortune.com/2018/01/06/donald-trump-north-korea-talks/", "ord_in_thread": 0, "title": "Donald Trump Open to North Korea Talks at the 'Appropriate Time' | Fortune", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "donald trump donald trump", "sentiment": "negative"}, {"name": "jaclyn gallucci", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "saul loeb", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "camp david", "sentiment": "none"}, {"name": "thurmont", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "united nations general assembly", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump Donald Trump Says He's Open to North Korea Talks at the 'Appropriate Time' US President Donald Trump speaks during a retreat with Republican lawmakers at Camp David in Thurmont, Maryland, January 6, 2018. / AFP PHOTO / SAUL LOEB (Photo credit should read SAUL LOEB/AFP/Getty Images) SAUL LOEB AFP/Getty Images By Bloomberg 4:04 PM EST \nPresident Donald Trump said the U.S. is open to engaging in discussions with South Korea and North Korea at “the appropriate time” and that he’d be willing to speak directly with Kim Jong Un if certain conditions were met. \n“Right now they’re talking Olympics. It’s a start. It’s a big start,” Trump said at a press conference at Camp David about talks expected in the coming week between South Korea and North Korea. It would be “great for humanity” if something beyond cooperating in February’s Winter Olympic Games comes out of the talks, he said. \nWhen asked whether he’d be open to talking to Kim, the North Korean leader, whom he’s dismissed in Twitter messages and in a speech to the United Nations General Assembly as “Rocket Man,” Trump said “Sure, I always believe in talking,” adding that “he knows I’m not messing around, not even a little bit.” \nTrump praised the talks planned for this week after previously shunning such diplomatic efforts, and even publicly chiding Secretary of State Rex Tillerson in October for “wasting his time” by pursing them. Bigger ‘Button’ \nHis comments Saturday went further than his earlier endorsements, though, and Trump said the meeting wouldn’t have been possible without his tough rhetoric toward North Korea. The remark also followed days after Trump warned on Twitter that his “nuclear button” is bigger and more powerful than Kim’s. \n“These are constructive comments by the president,” Nicholas Burns, a former Undersecretary of State in President George W. Bush’s administration who’s now a professor at the Harvard Kennedy School of Government, said of Saturday’s press conference. “It is essential that we remain united with Seoul and not permit Kim Jong Un to divide us.” \nSouth Korean President Moon Jae-in, who was elected in May, campaigned on greater engagement with North Korea after both hard-line and more accommodating approaches toward Pyongyang have failed over the years. When Kim used his New Year’s address to offer direct talks with Seoul, Moon quickly accepted, underscoring the differences between the U.S. and its long-time ally. Previously the Trump administration has said that Kim must abandon or at least pause his nuclear weapons program before talks would be considered. Winter Olympics \nTillerson was right to say “that any talks with the North should have as their aim denuclearization by the North,” Burns said of a CNN interview on Friday with the top U.S. diplomat. \nAt Moon’s request, Trump delayed annual joint U.S.-South Korean military exercises, long a source of consternation to the North, ahead of February’s Olympics in Pyeongchang, which is about 50 miles (80 kilometers) from the heavily fortified border between the two Koreas. \nMoon assured Trump that his government would coordinate over talks between the two Koreas next week to discuss the possibility of Pyongyang sending a delegation to the Games. \nU.S. Secretary of Defense Jim Mattis told reporters on Jan. 4 that the military drills were postponed to accommodate the Games, not as a condition of talks between Pyongyang and Seoul. The large annual military exercises with South Korea would resume some time after the Paralympic Games conclude on March 18, he said. \nNorth Korea and South Korea remain technically at war, and more than 30,000 U.S. troops are stationed in the country as a deterrent to conflict resuming. The latest detente could fail as quickly as earlier efforts. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-06T18:04:00.000+02:00", "crawled": "2018-01-06T23:06:39.003+02:00", "highlightTitle": ""}