{"organizations": [], "uuid": "23fa6f144c0a92dae7ba3c39d53c93559b2fb26d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968308-Trump1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/25/trump-interview-with-cnbc-full-transcript.html", "country": "US", "domain_rank": 767, "title": "Trump interview with CNBC: Full transcript", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.196, "site_type": "news", "published": "2018-01-26T13:01:00.000+02:00", "replies_count": 0, "uuid": "23fa6f144c0a92dae7ba3c39d53c93559b2fb26d"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/trump-interview-with-cnbc-full-transcript.html", "ord_in_thread": 0, "title": "Trump interview with CNBC: Full transcript", "locations": [], "entities": {"persons": [{"name": "joe kernen", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "joe", "sentiment": "none"}, {"name": "kernen", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "america first", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "7 Hours Ago | 21:00 \nPresident Donald Trump sat down for an interview with CNBC's Joe Kernen at the World Economic Forum in Davos, Switzerland. The president touched on an array of topics, including immigration reform, the potential for renegotiating multilateral trade deals , and the dollar . \nRead the full transcript of the interview below. \nJOE KERNEN: Mr. President, welcome to Davos. PRESIDENT TRUMP: Thank you very much, Joe. KERNEN: Thank you for agreeing to come on CNBC and Squawk Box. I appreciate it. PRESIDENT TRUMP: I've known you a long time. KERNEN: You have known me a long time. PRESIDENT TRUMP: And we've done many of these, but a little bit different position. I was a developer. KERNEN: Little bit different position — few more people around, too. PRESIDENT TRUMP: Couple of more people. KERNEN: So, the America First president comes to Davos. And you know, when you say \"Davos\" you know what a lot of people think: globalists, elitists. What will you say when you address not just the globalists and the elitists, but everyone? When you address them, what will be your message? PRESIDENT TRUMP: So when I decided to come to Davos I didn't think in terms of elitists or globalists. I think I thought in terms of lots of people that want to invest lots of money, and they're all coming back to the United States, they're coming back to America. And I thought of it much more in those terms. After I said that I was going there were massive stories about the elite, and the globalists, and the planes flying in, and everything else. It's not about that. It's about coming to America, investing your money, creating jobs, companies coming in. We're setting records every week, every day we're setting records. You see what's going on. Apple now with $350 billion. Most people thought they meant $350 million, which would build a nice plant. But I spoke with Tim Cook and I was very honored. But you remember my campaign, I used to say, \"I won't consider this great unless Apple starts coming in and really investing big money doing the plants.\" They're gonna do a lot. KERNEN: You've moved a little ... PRESIDENT TRUMP: ... but so many companies are coming in and so many jobs ... KERNEN: Yes. You've moved a little towards the center. But so Macron's saying that globalism doesn't solve problems. Suddenly other countries are saying, you know, \"We need to take care of, you know, our own country to some extent.\" So it's almost like the differences between America First and Davos. I think there's plenty of room for you ... \nPRESIDENT TRUMP: There's a lot of room. And we love global, but we love home. We have to take care of our home. KERNEN: Right. It's not usually exclusive. PRESIDENT TRUMP: Now, we have the disadvantage of having spent, as of about a month ago, $7 trillion in the Middle East. $7 trillion. That's a big disadvantage. And we're still there, and I've beaten ISIS, I've done—we've done a good job. But it's such a shame. It's such a sad, sad thing. KERNEN: Let me tell you about the difference of Davos this year. PRESIDENT TRUMP: Go ahead. KERNEN: We've done three three-hour shows, we have about eight guests per hour, so that's, like, 50 or 60 guests. PRESIDENT TRUMP: Right. KERNEN: They are more optimistic this year — and there's global growth. PRESIDENT TRUMP: Sure. KERNEN: But the one thing most are bringing up — and then I want to tell you about — if you didn't see the Jamie Dimon and the Lloyd Blankfein interview, I want to just tell you what they said about the potential for GDP growth ... \nPRESIDENT TRUMP: Good. Good. KERNEN: Because those guys might know what they're talking about. But the tax plan has been brought up almost without exception in a positive way by not just the CEOs, but by leaders from other countries even. They maybe they need to look at — maybe they need to invest in the United States now because it's a better environment for business. PRESIDENT TRUMP: And that's why I'm here. To a large extent, that's why I'm here. I think that the tax plan has been even better than we thought, Joe. What did happen that nobody considered is that AT&T started, but they immediately followed ... KERNEN: Same day almost. PRESIDENT TRUMP: Hundreds of companies are giving thousands and thousands of dollars to their workers. And now you have almost 3 million workers that are receiving thousands of dollars. Nobody ever thought — that was not, like, in the plan ... KERNEN: Even Starbucks. Even Starbucks ... PRESIDENT TRUMP: Yeah, even Starbucks, yesterday Disney and others. I mean ... KERNEN: So Dimon said ... PRESIDENT TRUMP: By the way, the ones that aren't doing it, those employees are going like, \"How about us?\" Guess what? They're gonna be doing it, too. Go ahead. KERNEN: JPMorgan CEO Jamie Dimon, I know you know him. Not only did he say he thought 3 percent was possible, he said we could get to 4 percent in 2018. Lloyd Blankfein, and I pressed him a little because I said, \"That was not the outcome — the election that you were, I think, hoping for. Now that you've seen what's happened to the stock market, up 40 percent since Election Day, how businesses are growing confidence, are you happy with the outcome?\" And he said — he couldn't really say, \"I'm happy with the outcome,\" but he did say ... PRESIDENT TRUMP: No. I don't think – they can't do that. KERNEN: ... but no, but he did. PRESIDENT TRUMP: He can't do it ... KERNEN: But he said ... PRESIDENT TRUMP: It's OK. KERNEN: But — no, but he said, \"I don't think the stock market would be where it is, I don't think GDP would be where it is. Maybe the polarization would be less,\" but he had to concede that the benefits probably outweighed any of the downside of ... PRESIDENT TRUMP: That was Lloyd? KERNEN: That was Lloyd. PRESIDENT TRUMP: And Jamie's become very positive ... KERNEN: Jamie and Lloyd also said 3 percent is possible long term, which we haven't heard from all the economists that supposedly ... PRESIDENT TRUMP: I think it'll be much higher than that. So I said and let's see what happens, because as you know, we're getting a report very soon, so we're going to see what that is. But I just happened to ask what we were doing. Because you know, if you look at the real numbers, had I not won, had the Democrat won — I'm going to be nice — the Democrat, I say, won— I would consider their last quarter my first quarter. Because you know, I just got there. So let's say the first quarter of '17 you had a 1.2 GDP. OK? 1.2. In the fourth quarter, which is the Obama quarter, you had a 1.8. Before that, you had a 2.8, a 2.2. You had — weren't doing very well. And it was the worst recovery — I guess do they say ever, or since the Great Depression? But it was the worst recovery. \nOK. Now, in my first quarter, which I consider to be the second quarter because I was there now long enough to have made an impact and don't kid yourself, regulations are just as big as the tax cuts. I've cut more regulations than any president in history and I've been here for one year. You can take their term whether it's eight years or 16 years in one instance — but you can take anybody you want, in one year, we've cut more regulations. And by the way, there's going to be regulation but they're good, solid, sane regulations. But in quarter two, we had 3.1, and in quarter three, as you know, we had 3.2. But in quarter one, which is the Obama quarter — really the last, I would say, Obama quarter, you had 1.2. We were going in the wrong direction. KERNEN: Right. There was the hurricane. PRESIDENT TRUMP: Had the Democrat won — the stock market is up almost 50 percent since my election — had the Democrat won, I believe you would have been down 50. That's the direction we were headed. And you know, a lot of that, regulation. It was staggering. You could not do anything. You couldn't build — I approved immediately — the two pipelines, 48,000 jobs ... KERNEN: Right. Can we talk about the year? PRESIDENT TRUMP: Yes. KERNEN: So the year, all these things that you have pointed out. But you've been dealing, negotiating now in government instead of in the private sector. And it's been I think lovingly referred to as the swamp by certain ... \nPRESIDENT TRUMP: Yeah. It's difficult. KERNEN: Is it difficult? And have you learned — are you approaching it differently now? Would you give your — what would you give yourself in terms of dealing, negotiating with the government versus business? What grade for the first year? PRESIDENT TRUMP: Well, a lot of people have given me an A. Somebody gave me an A-plus. So look, I got the biggest tax plan in our history approved. And don't forget, not just a tax plan. KERNEN: Have you learned anything? PRESIDENT TRUMP: I got rid of the ... KERNEN: Would you do anything different now? PRESIDENT TRUMP: Joe, one second. I got rid of the individual mandate, the most — the biggest part and the most unpopular thing in Obamacare, which really repeals Obamacare, because it can't live without the mandate, because that's where a lot of the money came. It was very unfair to people. And we did ANWR [Arctic National Wildlife Refuge]. ANWR, Ronald Reagan tried to do it 40 years ago. I mean, everybody's been trying to do ANWR, and I got ANWR done as part of that same bill. So on top of the biggest tax cuts, great reform and the money is coming in. I mean, the money is pouring in. We probably take in $4 trillion from overseas that would never have been able to be here because of regulation. KERNEN: Well, can we talk trade real quickly while we're doing it. PRESIDENT TRUMP: And taxes. Yeah. KERNEN: So we had solar panels, washing machines. I'm not sure where it goes from here. PRESIDENT TRUMP: Yeah. KERNEN: I'm not sure how China reacts, whether steel's next ... PRESIDENT TRUMP: Whatever it is. KERNEN: You'll — they're grown-ups and I think they understand that maybe we had some ... PRESIDENT TRUMP: It's time ... KERNEN: We have some legitimate — right. Would you — you going to stick with bilateral or would you ever go back in the multi — would TPP, would that ever be possible to look at that again? PRESIDENT TRUMP: I like bilateral because if you have a problem, you terminate. When you're in with many countries, like with TPP — so you have 12 if we were in — you don't have that same, you know, you don't have that same option. But somebody asked me other day would I do TPP. Here's my answer. I'll give you a big story. I would do TPP if we made a much better deal than we had. We had a horrible deal. The deal was a horrible deal. NAFTA's a horrible deal, we're renegotiating it. I may terminate NAFTA, I may not. We'll see what happens. But NAFTA was and I went around and I'd tell stadiums full of people, \"I'll terminate it or renegotiate it.\" KERNEN: So you might re-enter — are you opening up the door to reopening TPP? Or ... PRESIDENT TRUMP: I'm only saying this: I would do TPP if we were able to make a substantially better deal. The deal was terrible. The way it was structured was terrible. If we did a substantially better deal I would be open to TPP. KERNEN: That's interesting. Would you handicap ... PRESIDENT TRUMP: Are you surprised to hear me say that? KERNEN: I'm a little bit, yeah. I'm a little taken aback ... PRESIDENT TRUMP: Don't be surprised, no. But we have to make a better deal ... KERNEN: I want to know ... PRESIDENT TRUMP: The deal was a bad deal, like the Iran deal is a bad deal ... KERNEN: You said — but NAFTA, maybe not NAFTA ... PRESIDENT TRUMP: These are bad deals. KERNEN: Can you give me any indication which way you're leaning? Because there's a lot of people, lot of the CEOs that have been on here, they all seem to acknowledge that it's 30 years later and there's a lot of changes that make a lot of sense, but to not abandon the deal. We ... PRESIDENT TRUMP: Hey Joe, we have a trade deficit with Mexico. Mexico, $71 billion a year, right? We have a trade deficit with Canada of a substantial amount of money. I have a number but they keep arguing, they keep saying no — so I won't say it. I won't tell you it's $17 million, OK? We have a trade deficit with Canada. We have a massive trade deficit with Mexico. Got to do something. We can't continue to do this ... KERNEN: Are you leaning towards staying in or would you really go out of the ... PRESIDENT TRUMP: I've always said during the campaign and as you noticed and as you've actually said a couple of times, which I've always appreciated, I have fulfilled a lot of what I've said. And I'm only here a year. You know, I think I have four years and maybe another four years, OK, if we keep going ... KERNEN: So what we'll see ... PRESIDENT TRUMP: We'll see what happens. But Joe, we have a $71 billion a year trade deficit with Mexico. We got to do something. We can't have that. So will it be renegotiated? We're trying right now with [U.S. Trade Representative] Bob Lighthizer and the whole group. I think we have a good chance but we'll see what happens. KERNEN: The way that the shutdown finally was, you know, was ended. PRESIDENT TRUMP: Yeah. KERNEN: I get the feeling that Senator Schumer is taking a lot of flak from his flank, from the far-left flank. So I feel like he's been burnt, which makes me worry about when we go back. In two weeks ... PRESIDENT TRUMP: He made a mistake in shutting down. He shouldn't have shut down. People of this country want security, they want safety, they want their military to be taken care of. KERNEN: What's going to happen on Monday with DACA? What are you willing to go further to the ... PRESIDENT TRUMP: Well, we've already started the process ... KERNEN: Will you stay with Cotton or will you move further to what ... PRESIDENT TRUMP: I think Cotton, and Perdue and Goodlatte, and the people that I've been dealing with — Cornyn, so many of the people — these are great people. These are people that really have shifted a lot. They've really shifted a lot, and I think they're willing to shift more, and so am I. KERNEN: You said 10n to 12 years for citizenship, right, for the Dreamers. Will Cotton go along with that? PRESIDENT TRUMP: We're going to see. If we make the right deal. I think they will. These are people that have very strong opinions on DACA and on immigration generally. And I happen to think they're largely right. Look, we're going to try and make a deal on DACA. We have a good chance of making it. What we need is we need the wall, we need security, we need security at the border. We have to stop the drugs from coming in. We need safety and we need a strong military. KERNEN: You want ... PRESIDENT TRUMP: We need almost more than ever before — I mean, we've been in wars so we needed it then — but we need to be sure that our military is properly funded, and it would be really great to get rid of the, you know, we'd like to have a regular budget. KERNEN: Will you ask for $25 billion, Mr. President? Is that ... PRESIDENT TRUMP: We're asking ... KERNEN: ... and did Chuck Schumer offer $1.6 billion? PRESIDENT TRUMP: We agreed to $25 billion ... KERNEN: Did he take it back? Did he ... PRESIDENT TRUMP: Yeah, sure. He took it back but, you know, that's ... KERNEN: Did he — how much did he agree to? PRESIDENT TRUMP: But he didn't really take it back. If you see numerous senators on the other side they said, \"We'd give the wall in two minutes if we could do something with DACA.\" Everybody wants to solve the DACA problem. They've been wanting to solve it for a long time. It should've been solved by President Obama. It would've been easier to solve it, especially when he had the House and the Senate. They could've solved it in a day. But they didn't solve it, he didn't solve things. And he did something that he didn't have the right to do. You understand, he did an executive order and that was no good. \nAnd by the way, the court — it wasn't me. The courts were not upholding that executive order. You have to do it through Congress. I want to solve the DACA problem. I will consider that a great achievement to solve the DACA problem. It's been out there for a long time. These are good people, these are people that should be able to stay in this country. We're going to solve the DACA problem. But we also want to solve a tremendous problem on the southern border, which is crime. We need a wall, we need the drugs to stop flowing in. They are coming in like — well, they're coming in less now than they were because we have a very strong — we have great Border Patrol agents, great ICE — we have great people and they are really doing a good job. And you see what's happening at the border, it's much better. \nBut we need a strong border. And to do that you need a wall. And they did agree to a $25 billion wall, of which I'll have a lot of money left over. Because I don't need $25 billion to build a wall. We'll build a great — that's what I do. We'll build a great wall and we'll have a lot of money left over, and we'll spend it on other things. But we need great security. And yes, Senator Perdue, Senator Cotton, Cornyn, this one, that one, we have tremendous support to get something done. Tremendous, Joe. And I think something will get done. KERNEN: I want to ask you a Davos question, just because we're here and I don't know, I even get taken over by this. But whenever we're here, we talk about wealth disparity and income inequality, not just globally but everywhere. PRESIDENT TRUMP: Big problem. KERNEN: Big problem. A resurgent United States, a strongly growing United States makes a world of difference — not just for the United States but for the world in general. But I'm just wondering if you did — if you were able to keep GDP or if the United States grows at 3 percent or 4 percent and we have the coffers, that we can do a lot with 3 percent or 4 percent. It's totally different than when we don't have money. PRESIDENT TRUMP: Different country. KERNEN: Do you have a way of addressing the skills gap and education? As a businessperson, you solve problems. Now you're in government ... PRESIDENT TRUMP: We need vocational schools. We need the community colleges in many cases ... KERNEN: Will that be something that will ... PRESIDENT TRUMP: Oh, I think it's a big factor for us. But I also want these great companies that are coming in — Toyota's now coming in. We talked already about Apple. Apple's coming in with a very big presence. We had many companies — Chrysler's coming in, leaving Mexico and coming back to Michigan. I mean, how good is that? When was the last time you heard that? And without me being here and without what we've been doing including regulation, by the way, because I happen to think that regulation is as big as the tax cuts, OK? I think the tax cuts are incredible. But I think the regulations, the cutting of regulations — because the businesses couldn't even — they couldn't do anything. They were totally bound. You'd have to get 16 different approvals from 15 different agencies. Hey Joe, it was impossible to do business. And I think you know that maybe better than anybody. The cutting of the regulations was every bit as important as what we did with the tax cuts. But you put them both together and we have a dynamic country again. I mean, everybody's talking. I just came out and some really wonderful people said, \"Davos has never been like this.\" This is like walking into the Academy Awards, except we have more photographers. KERNEN: The Journal this morning, lead editorial was that — and they gave a lot of credit to the Trump administration for where economic growth is right now. But then they said, \"Why would a Cabinet member bring up the idea of a weaker dollar when things are going so well?\" And I'm wondering whether — you saw Secretary Mnuchin's comments yesterday. Do you agree with those? Were they taken out of context? Where are you ... PRESIDENT TRUMP: So let me tell you, I think they were taken out of context because I read his exact statement. I'll tell you where I stand, which ultimately is very important. No. 1, I don't like talking about it because, frankly, nobody should be talking about it. It should be what it is. It should also be based on the strength of the country. We are doing so well, our country is becoming so economically strong again — and strong in other ways too, by the way — that the dollar is going to get stronger and stronger. And ultimately, I want to see a strong dollar. Right now it floats. But it's your great reserve currency. There can never be anything even close to it. There is nothing close to it, there never will be. \nBut ultimately the dollar, because our country is going to get so much stronger economically, if you look at what's happened to our country over the — look, I've been talking about this with you for 25 years. Trade. It started with Japan, morphed into China, now it's China, Japan, it's everybody. And everybody has taken advantage of our country. They have ripped our country off. You look at what they do. I saw something on motorcycles today with a certain country. Why should I say? But they sell motorcycles into our country, no tax. We sell motorcycles into their country — Harley-Davidsons, the greatest, right? We sell them into their country, 100 percent tax. Not going to happen. \nThe word \"reciprocal\" is the most important word with Donald Trump when it comes to what the subject that we talk about and the subject that CNBC covers so well — especially you, by the way, because I don't agree with all of you people, but that's OK. But reciprocal. I want reciprocal. If they're going to charge us 100 percent for a motorcycle, it should be 100 percent the other way, too. And you know, when you mention a tax at the border, a 10 percent tax on the border for everything coming in, I'm a free trader. Totally. I'm a fair trader. I'm all kinds of trader, but I want reciprocal. Because when China's charging us a fortune to send products in and making it impossible for the product to get there — and many other countries, by the way, not just China. China's the biggest. And then we charge them nothing to sell their stuff here. It's not fair. When you use the word \"reciprocal\" everybody understands that. If they do it to you, you do it to them and everybody understands it, Joe. And you're going to see a lot of that in my administration. And you're already seeing it. KERNEN: Well, we're going to have to end it there. I'm just — last question. Will we have another shutdown? Will you move more to the center on immigration ... PRESIDENT TRUMP: I don't think the Democrats would shut it down again. KERNEN: You don't think they'll do it ... PRESIDENT TRUMP: No. Because you look at every poll, it said they made a mistake. KERNEN: Where's the movement going to come? PRESIDENT TRUMP: I don't want to say Schumer got badly beaten. Why should I do that? I'm negotiating with someone — I'm not going to say he got badly beaten. But you look at what happened. The people want security and they want DACA taken care of. But more importantly, they want security, they want the borders strong, they want to have a strong border. They don't want to have MS-13 coming into our cities. You know how many of these people were getting out? These are horrible, horrible human beings. And they came here as horrible human beings. And Joe, it sounds terrible. They don't shoot somebody, they cut them up into little pieces because it's more painful. I don't want them — we are taking them out by the thousands. By the thousands. \nWe don't want them coming in, but we're going to take care of DACA. Nobody wants to take care of DACA more than myself and the Republican Party. And the Republican Party is unified at a level that Paul Ryan called me the other day. He said, \"I have to tell you, Mr. President, I've been here for a long time and I've been a part of the Republican Party, and I've been watching it for a long time. For many decades I've never seen the Republican Party unified like it is under your presidency.\" And that — that was Paul Ryan. And I thought that was a very nice statement, a very nice statement. And I think Mitch McConnell actually feels the same way. We want to do what's right and we're going to do what's right, and we're going to solve the DACA problem. And I don't think the Democrats would want to pull another shutdown. But we'll get it solved. And if we need a little more time, we'll take a little more time. I want to get the problem solved correctly. KERNEN: All right. Thank you very much. PRESIDENT TRUMP: Thank you very much, Joe. It's been an honor. Playing", "external_links": [], "published": "2018-01-26T13:01:00.000+02:00", "crawled": "2018-01-26T13:02:44.007+02:00", "highlightTitle": ""}