{"organizations": [], "uuid": "8df6fa0c377208a9b38761319f047c28e5b8b959", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225984742&w=1200&r=LYNXMPEE0R07P", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-usa-trump-britain/trump-says-he-would-negotiate-brexit-with-tougher-attitude-than-theresa-may-idUSKBN1FH08Y", "country": "US", "domain_rank": 408, "title": "Trump says he would negotiate Brexit with 'tougher' attitude than Theresa May", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T11:34:00.000+02:00", "replies_count": 0, "uuid": "8df6fa0c377208a9b38761319f047c28e5b8b959"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-britain/trump-says-he-would-negotiate-brexit-with-tougher-attitude-than-theresa-may-idUSKBN1FH08Y", "ord_in_thread": 0, "title": "Trump says he would negotiate Brexit with 'tougher' attitude than Theresa May", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "may", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "theresa may reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 9:34 AM / in an hour Trump says he would negotiate Brexit with 'tougher' attitude than Theresa May Reuters Staff 3 Min Read \nLONDON (Reuters) - U.S. President Donald Trump would take a “tougher” approach to Brexit negotiations than Britain’s Prime Minister Theresa May, he said in a television interview to be broadcast later on Sunday. \nIn the interview with British channel ITV, Trump said the European Union was “not cracked up to what it’s supposed to be” and claimed he had predicted the result of the June 2016 referendum in which Britons voted to leave the EU. Trump was elected to the U.S. presidency later the same year. \nWhen asked if May was in a “good position” regarding the ongoing Brexit talks, Trump replied: “Would it be the way I negotiate? No, I wouldn’t negotiate it the way it’s [being] negotiated ... I would have had a different attitude.” \nPressed on how his approach would be different, he said: “I would have said the European Union is not cracked up to what it’s supposed to be. I would have taken a tougher stand in getting out.” \nMay was the first foreign leader to visit Trump after his inauguration in January last year and they were filmed emerging from the White House holding hands. \nBut the “special relationship” between the two nations has since faced several ups and downs, including Trump rebuking May on Twitter after she criticized him for retweeting British far-right anti-Islam videos. \nHe said in an earlier extract from the same interview that he had not intended to cause offense in Britain by sharing the videos and that he would apologize if the original posters were horrible racists. \nTrump’s comments on militant attacks in Britain have angered some and he has often exchanged barbs on social media with Mayor of London Sadiq Khan. \nTrump also said in the interview that he had anticipated the Brexit referendum result because of many Britons’ concerns over immigration -- also a key plank of his U.S. election campaign. \n“I said [that] because of trade, but mostly immigration, Brexit is going to be a big upset. And I was right,” he said. “I know the British people and understand them.” \n“They don’t want people coming from all over the world into Britain, they don’t know anything about these people.” \nTrump also said he had been invited by May to make two visits to Britain this year. \nEarlier this month, he canceled a trip to London to open a new embassy, saying he did not want to endorse a bad deal agreed by the Obama administration to sell the old one for “peanuts”. \nSome Britons are angry at the prospect of a visit by Trump, with large protests expected when he does arrive. Reporting by Andrew MacAskill; Editing by Catherine Evans", "external_links": [], "published": "2018-01-28T11:34:00.000+02:00", "crawled": "2018-01-28T11:44:02.007+02:00", "highlightTitle": ""}