{"organizations": [], "uuid": "3994c020d70fa2b65fe9985578cf6042795e1aee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-agios-announces-proposed-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Agios Announces Proposed Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:01:00.000+02:00", "replies_count": 0, "uuid": "3994c020d70fa2b65fe9985578cf6042795e1aee"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-agios-announces-proposed-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Agios Announces Proposed Offering of Common Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "agios pharmaceuticals, inc.", "sentiment": "neutral"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "agios", "sentiment": "none"}, {"name": "cowen and company", "sentiment": "none"}, {"name": "goldman sachs & co", "sentiment": "none"}, {"name": "j.p. morgan securities llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass., Jan. 17, 2018 (GLOBE NEWSWIRE) -- Agios Pharmaceuticals, Inc. (Nasdaq:AGIO) today announced that it is offering to sell, subject to market and other conditions, up to $400 million of its common stock in an underwritten public offering. Agios also intends to grant the underwriters a 30-day option to purchase from it up to an additional 15% of the shares of common stock offered in the public offering. All of the shares in the offering are to be sold by Agios. The proceeds of the offering are expected to be used to fund the company’s research, clinical development and pre-commercial activities. The offering is subject to market and other conditions, and there can be no assurance as to whether or when the offering may be completed.\nJ.P. Morgan Securities LLC, Goldman Sachs & Co. LLC and Cowen and Company, LLC are acting as joint book-running managers for the offering.\nThe shares are being offered by Agios pursuant to an automatically effective shelf registration statement that has been filed with the Securities and Exchange Commission (“SEC”). A preliminary prospectus supplement relating to, and describing the terms of, the offering will be filed with the SEC and will be available on the SEC’s web site at www.sec.gov .\nCopies of the preliminary prospectus supplement and the accompanying prospectus relating to this offering can be obtained from J.P. Morgan Securities LLC, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, telephone: 866-803-9204; Goldman Sachs & Co. LLC, Attn: Prospectus Department, 200 West Street, New York, New York 10282, telephone: 866-471-2526, facsimile: 212-902-9316, e-mail: prospectus-ny@ny.email.gs.com ; or Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY 11717, Attention: Prospectus Department, or by telephone at (631) 274-2806. The final terms of the offering will be disclosed in a final prospectus supplement to be filed with the SEC.\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Agios Pharmaceuticals, Inc.\nAgios is focused on discovering and developing novel investigational medicines to treat cancer and rare genetic diseases through scientific leadership in the field of cellular metabolism. In addition to an active research and discovery pipeline across both therapeutic areas, Agios has an approved oncology precision medicine and multiple first-in-class investigational medicines in clinical and/or preclinical development. All Agios programs focus on genetically identified patient populations, leveraging our knowledge of metabolism, biology and genomics.\nCautionary Note Regarding Forward Looking Statements\nThis press release contains forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995, such as those, among others, relating to Agios’ plans to consummate its proposed public offering and the intended use of proceeds therefrom. The words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “plan,” “predict,” “project,” “would,” “could,” “potential,” “possible,” “hope” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. Actual results may differ materially from those projected or implied in these forward-looking statements. Factors that may cause such a difference include, without limitation, risks and uncertainties related to whether or not Agios will be able to raise capital through the sale of shares of common stock, the final terms of the proposed offering, market and other conditions, the satisfaction of customary closing conditions related to the proposed public offering and the impact of general economic, industry or political conditions in the United States or internationally. There can be no assurance that Agios will be able to complete the proposed public offering on the anticipated terms, or at all. You should not place undue reliance on these forward-looking statements. Additional risks and uncertainties relating to the proposed offering, Agios and its business can be found under the caption “Risk Factors” included in Agios’ Quarterly Report on Form 10-Q for the quarter ended September 30, 2017, Agios’ preliminary prospectus supplement to be filed with the SEC on January 17, 2018, and other filings that Agios may make with the SEC in the future. Any forward-looking statements contained in this press release speak only as of the date hereof, and Agios expressly disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.\nCONTACTS:\nKendra Adams, Senior Director, Investor & Public Relations\nKendra.Adams@agios.com\n617-844-6407\nRenee Leck, Senior Manager, Investor & Public Relations\nRenee.Leck@agios.com\n617-649-8299\nSource:Agios Pharmaceuticals, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/d8e7652d-64f4-4083-8fbc-9c91c627d91b", "https://www.globenewswire.com/Tracker?data=__PsMuNgPboG4nrX_TvNOapUSduPck4Vycw-fP6Nwf0bOh_kzyoLNvZm1ofFWNzvXk0od40csRN4Fxz6DN-SE4i7-Bw_TciNpso2qqJMBFa1BmAIFU9kg8xdiEXMHxPd"], "published": "2018-01-18T00:01:00.000+02:00", "crawled": "2018-01-18T00:26:01.011+02:00", "highlightTitle": ""}