{"organizations": [], "uuid": "8f2320e578c003e899591b608ccd116731c36962", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219104521&w=1200&r=LYNXMPEE0211L", "site_section": "http://feeds.feedburner.com/Court-GoogleNews", "section_title": "COURT - Google News", "url": "https://www.reuters.com/article/us-canada-boyle-arrest/freed-canadian-hostage-appears-in-court-on-criminal-charges-idUSKBN1ES1M0", "country": "US", "domain_rank": 408, "title": "Freed Canadian hostage appears in court on criminal charges - Reuters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T19:51:00.000+02:00", "replies_count": 0, "uuid": "8f2320e578c003e899591b608ccd116731c36962"}, "author": "", "url": "https://www.reuters.com/article/us-canada-boyle-arrest/freed-canadian-hostage-appears-in-court-on-criminal-charges-idUSKBN1ES1M0", "ord_in_thread": 0, "title": "Freed Canadian hostage appears in court on criminal charges - Reuters", "locations": [], "entities": {"persons": [{"name": "haqqani", "sentiment": "none"}, {"name": "ljunggren", "sentiment": "none"}, {"name": "boyle", "sentiment": "none"}, {"name": "caitlan coleman", "sentiment": "none"}, {"name": "joshua boyle", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "taliban", "sentiment": "none"}, {"name": "min read  ottawa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OTTAWA (Reuters) - A Canadian court on Wednesday postponed a bail hearing for former Taliban hostage Joshua Boyle, who was arrested on Saturday and faces criminal charges including assault, sexual assault and forcible confinement.\nThe charges, filed on Monday, are for crimes prosecutors said occurred in Canada after Boyle and his family returned to the country last October. Boyle and his wife Caitlan Coleman were kidnapped in October 2012 while backpacking in Afghanistan.\nWhen they returned to Canada with three children born in captivity, Boyle said a fourth child had been murdered and his spouse raped after their capture by the Taliban-allied Haqqani network. The Taliban denied the accusations of rape and murder.\nBoyle, 34, appeared in an Ottawa courtroom on Wednesday via video link dressed in an orange prison jumpsuit. He confirmed his name, but did not enter a plea to the charges.\nHe is due to appear again in court on Jan. 8.\nThe court imposed a publication ban that prevents media from reporting on information that could identify any victims or witnesses. The ban also prohibits reporting on the details of the bail hearing.\nThe charges include eight counts of assault, two counts of sexual assault, two counts of forcible confinement and one count of uttering death threats.\nBoyle has retained the services of Lawrence Greenspon, one of Canada’s leading criminal defense lawyers.\n“Mr. Boyle is presumed innocent of all charges. He has no criminal record and has never been in trouble with the police,” Greenspon said in an e-mailed statement.\n“As Mr. Boyle has only just been charged, we are waiting to receive more information about these allegations so that we can respond to them appropriately in court,” Greenspon said. He declined to comment further.\nA sign attached to the door of the Boyle apartment in Ottawa said family members would not be speaking to the media and requested privacy. The Canadian Broadcasting Corp posted a picture of the notice on its website.\nU.S. officials said Boyle and his family spent almost all of their five years of confinement in neighboring Pakistan, which is where they were freed by Pakistani troops.\nThe family met Canadian Prime Minister Justin Trudeau in his Parliament Hill office last month. Photos released on Twitter showed Trudeau holding the youngest child in his lap.\n(Corrects spelling of first name of Boyle’s wife to Caitlan instead of Caitlin, second paragraph.)\nReporting by David Ljunggren and Anna Mehler Paperny; Editing by Jim Finkle, Andrew Hay and Grant McCool\n ", "external_links": [], "published": "2018-01-03T19:51:00.000+02:00", "crawled": "2018-01-04T02:51:35.000+02:00", "highlightTitle": ""}