{"organizations": [], "uuid": "b47ab6881bd5be95d5362d65e76b52df81a3226b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-peggy-merriss-city-manager-of-decatur-georgia-appointed-chair-of-the-icma-rc-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Peggy Merriss, City Manager of Decatur Georgia, Appointed Chair of the ICMA-RC Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T21:34:00.000+02:00", "replies_count": 0, "uuid": "b47ab6881bd5be95d5362d65e76b52df81a3226b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-peggy-merriss-city-manager-of-decatur-georgia-appointed-chair-of-the-icma-rc-board-of-directors.html", "ord_in_thread": 0, "title": "Peggy Merriss, City Manager of Decatur Georgia, Appointed Chair of the ICMA-RC Board of Directors", "locations": [], "entities": {"persons": [{"name": "peggy merriss", "sentiment": "negative"}, {"name": "merriss", "sentiment": "none"}, {"name": "j. thomas lundy", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "decatur georgia", "sentiment": "none"}, {"name": "decatur", "sentiment": "none"}, {"name": "catawba county", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}], "organizations": [{"name": "international city/county management association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 4, 2018 /PRNewswire/ -- The ICMA-RC Board of Directors is pleased to announce the appointment of Peggy Merriss as its Chair. Ms. Merriss has more than three decades of local government leadership experience and is currently City Manager of Decatur, Georgia. She previously served as President of the International City/County Management Association, the first woman to hold that office, and has been a member of the ICMA-RC Board of Directors since 2011. She was appointed to serve a two-year term as Chair of the ICMA-RC Board of Directors beginning January 1, 2018.\nThe ICMA-RC Board of Directors, which is comprised of ten members, is responsible for oversight of the business affairs and governance of the Corporation. Ms. Merriss succeeds Mr. J. Thomas Lundy, who served as Chair of the ICMA-RC Board of Directors from 2014 until 2017. He retired as County Manager of Catawba County, North Carolina in 2016.\n\"Peggy Merriss is a highly qualified public official whose exceptional leadership abilities will be a tremendous asset to the ICMA-RC Board of Directors and to the Corporation,\" said Mr. Lundy. \"I will miss working with her and others on the Board of Directors but I know the Corporation is in good hands as it continues to achieve its mission of helping public sector employees build retirement security.\"\nMs. Merriss has a distinguished career in professional management and became the first woman to serve as City Manager of Decatur, GA nearly 25 years ago in 1993. She began working for Decatur in 1983, initially as Personnel Director and then as Assistant City Manager. Ms. Merriss received a BA in political science from Converse College and a master's degree in public administration from the University of North Carolina, Chapel Hill.\nAbout ICMA-RC\nFounded in 1972, ICMA-RC is a non-profit financial services corporation with approximately $54 billion in assets under management and administration (as of December 31, 2017), and is focused on providing retirement plans and related services for over a million public sector participant accounts. ICMA-RC's mission is to lessen the burdens of local and state government by helping public sector employees build retirement security. The organization's mission is delivered through its RealizeRetirement® approach in which ICMA-RC representatives actively engage participants in their retirement programs, help them build their asset base, and help them realize their retirement goals through a comprehensive retirement planning strategy. For more information, visit www.icmarc.org or follow ICMA-RC on Facebook , LinkedIn and Twitter .\nAbout Decatur, GA\nDecatur, a city in DeKalb County Georgia, was founded in 1823 and named for Commodore Stephen Decatur. Decatur is the county seat of DeKalb County and is 4.4 square miles with a population of 23,000 people. The city, known for its homes, schools, places of worship, diversity, events and festivals, and a thriving business community, is located six miles east of Atlanta. For more information, visit www.decaturga.com or follow the City of Decatur on Facebook , and Twitter .\nView original content with multimedia: http://www.prnewswire.com/news-releases/peggy-merriss-city-manager-of-decatur-georgia-appointed-chair-of-the-icma-rc-board-of-directors-300577799.html\nSOURCE ICMA-RC", "external_links": ["http://www.prnewswire.com/news-releases/peggy-merriss-city-manager-of-decatur-georgia-appointed-chair-of-the-icma-rc-board-of-directors-300577799.html", "http://www.icmarc.org/", "https://twitter.com/ICMARC", "https://protect-us.mimecast.com/s/up3SClY0DEfkjwLIvV9aI?domain=facebook.com", "https://www.facebook.com/icmarchq", "http://www.decaturga.com/", "https://www.linkedin.com/company/icma-rc?trk=", "https://protect-us.mimecast.com/s/hE0JCmZkGNs69ovux95AI?domain=twitter.com"], "published": "2018-01-04T21:34:00.000+02:00", "crawled": "2018-01-04T22:53:27.001+02:00", "highlightTitle": ""}