{"organizations": [], "uuid": "8ce4754d2420fbb93987ac52e6485d9891288f2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 23, "shares": 23, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219542672&w=1200&r=LYNXMPEE040EL", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-coffee/uk-should-introduce-latte-levy-on-disposable-coffee-cups-lawmakers-idUKKBN1EU0O8", "country": "US", "domain_rank": 408, "title": "UK should introduce 'latte levy' on disposable coffee cups - lawmakers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T10:19:00.000+02:00", "replies_count": 0, "uuid": "8ce4754d2420fbb93987ac52e6485d9891288f2d"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-coffee/uk-should-introduce-latte-levy-on-disposable-coffee-cups-lawmakers-idUKKBN1EU0O8", "ord_in_thread": 0, "title": "UK should introduce 'latte levy' on disposable coffee cups - lawmakers", "locations": [], "entities": {"persons": [{"name": "caffe nero", "sentiment": "none"}, {"name": "mary creagh", "sentiment": "none"}, {"name": "greggs", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "canary wharf", "sentiment": "none"}], "organizations": [{"name": "costa coffee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "starbucks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 8:13 AM / Updated 22 minutes ago UK needs 'latte levy' on disposable coffee cups to cut waste - MPs Costas Pitas 3 Min Read \nLONDON (Reuters) - Britain should charge a 25-pence ($0.34) “latte levy” on disposable coffee cups to cut down waste and ban them if a recycling target is not met by 2023, a committee of members of parliament said on Friday. A commuter carries a disposable coffee cup in London, Britain, January 5, 2018. REUTERS/Toby Melville \nLess than 1 percent of coffee cups are recycled in Britain because of the tightly bonded plastic liner, the difficulties of recycling packaging which has been in contact with food and drink and a lack of facilities, the MPs said. \nChains Pret A Manger, Costa Coffee ( WTB.L ), Caffe Nero and Greggs ( GRG.L ) alongside U.S. firm Starbucks ( SBUX.O ) are among the biggest coffee-sellers in Britain and have rapidly expanded in the last 10 years to meet increasing demand. \nAlthough some outlets give a discount to customers using their own cup, only 1-2 percent of buyers take up the offer, according to parliament’s environmental audit committee which said a “latte levy” was needed instead. \n“The UK throws away 2.5 billion disposable coffee cups every year; enough to circle the planet five and a half times,” said Chair of the committee, Mary Creagh. \n“We’re calling for action to reduce the number of single use cups, promote reusable cups over disposable cups and to recycle all coffee cups by 2023,” she said. \nThe committee said that money raised by the charge should help improve recycling facilities and if the 2023 target is not met then disposable coffee cups should be banned. \nThe Irish parliament is considering banning single-use coffee cups whilst the German city Hamburg said in 2016 it will no longer use coffee-makers with aluminium capsules in its own offices or buildings. Slideshow (4 Images) \nIn October 2015, Britain introduced a charge of 5 pence on all single-use plastic bags provided by large shops, which led to an 83 percent reduction in UK plastic bags used in the first year. \nOn Friday the environment ministry said the government was working closely with the sector and had made progress in increasing recycling rates. \n“We are encouraged by industry action to increase the recycling of paper cups with some major retail chains now offering discounts to customers with reusable cups,” said a ministry spokeswoman. \n“We will carefully consider the committee’s recommendations and respond shortly,” she said. \nGreggs and Caffe Nero did not immediately respond to requests for comment by Reuters on Friday. \nCosta Coffee said it offered a 25 pence discount to those using reusable cups but the government needed to focus on improving recycling infrastructure. Pret A Manger’s customers have benefitted from a 50 pence discount from this week. \nU.S chain Starbucks said it will trial a 5 pence levy at up to 25 London branches in February for three months. \n“We will investigate the impact of a 5p charge on a paper cup, coupled with prominent marketing of reusable cups, on customer behaviour,” it said in a statement posted on its website. Editing by Kate Holton/Guy Faulconbridge", "external_links": [], "published": "2018-01-05T10:19:00.000+02:00", "crawled": "2018-01-05T10:39:08.010+02:00", "highlightTitle": ""}