{"organizations": [], "uuid": "7afced56d06909d5d4cb2b693dde286b034aa0ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-ghouta/syrian-rebels-release-24-detainees-from-besieged-damascus-suburb-sana-idUSKBN1F52D2", "country": "US", "domain_rank": 408, "title": "Syrian rebels release 24 detainees from besieged Damascus suburb: SANA", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T20:15:00.000+02:00", "replies_count": 0, "uuid": "7afced56d06909d5d4cb2b693dde286b034aa0ef"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-ghouta/syrian-rebels-release-24-detainees-from-besieged-damascus-suburb-sana-idUSKBN1F52D2", "ord_in_thread": 0, "title": "Syrian rebels release 24 detainees from besieged Damascus suburb: SANA", "locations": [], "entities": {"persons": [{"name": "bashar al-assad", "sentiment": "none"}], "locations": [{"name": "damascus", "sentiment": "none"}, {"name": "beirut", "sentiment": "none"}], "organizations": [{"name": "sana", "sentiment": "none"}, {"name": "sana reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "international committee of the red cross", "sentiment": "none"}, {"name": "syrian arab red crescent", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIRUT (Reuters) - Syrian rebels in the besieged enclave of eastern Ghouta released 24 captive men, women and children in a deal mediated by the Syrian Arab Red Crescent, state media said on Tuesday.\nState news agency SANA said the detainees had been held for between eight months and three years in the suburb east of Damascus where almost 400,000 people have been under siege by President Bashar al-Assad’s forces since 2013.\nEastern Ghouta is the last major rebel position close to the capital.\nIn late December a deal was reached between Damascus and the rebels to evacuate critical medical cases in exchange for detainee releases.\nThe International Committee of the Red Cross said in December that 29 of the most serious cases had been allowed to enter government territory for treatment under the deal.\nSANA said a number of detainees were also released at the end of December under the deal.\nAround 600 people remain on the medical evacuation list, the U.N. World Health Organization said.\nA U.N. official in Syria confirmed the release of around 24 people to Reuters, saying they were civilians who had been kidnapped by rebels and that some of them had been held for up to three years.\nThe map of Syria’s seven-year conflict has been decisively redrawn in favor of Assad and his Russian and Iranian allies during the past two years.\nThey have recaptured major population centers in western Syria from rebels seeking to overthrow him and pushed back Islamic State in the east.\nBacked by Russian strikes, Syrian government forces have escalated military operations against Eastern Ghouta in recent months, seeking to tighten a siege that residents and aid workers say is a deliberate use of starvation as a weapon of war, a charge the government denies.\nEastern Ghouta is suffering severe shortages of food, fuel and drinking water, World Food Programme spokesperson Bettina Luescher said on Tuesday.\n“We have seen many cases of severe malnutrition, some of the people have been eating animal fodder and garbage. The plight of people, we have flagged that before, is really amazing, how they survive,” she said.\nThe ICRC was not immediately available for comment.\nReporting by Lisa Barrington in Beirut and Stephanie Nebehay in Geneva; Editing by Matthew Mpoke Bigg\n ", "external_links": [], "published": "2018-01-16T20:15:00.000+02:00", "crawled": "2018-01-16T20:28:13.000+02:00", "highlightTitle": ""}