{"organizations": [], "uuid": "c5f55794c746f2027fbf98e39d9dddc16b4c5bc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/12/104581552-IMG_4708-jim-paulsen.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/23/gut-check-correction-to-tear-up-rally-jim-paulsen-warns.html", "country": "US", "domain_rank": 767, "title": "'Gut-check correction' to tear up rally, Jim Paulsen warns", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T15:00:00.000+02:00", "replies_count": 0, "uuid": "c5f55794c746f2027fbf98e39d9dddc16b4c5bc8"}, "author": "Stephanie Landsman", "url": "https://www.cnbc.com/2018/01/23/gut-check-correction-to-tear-up-rally-jim-paulsen-warns.html", "ord_in_thread": 0, "title": "'Gut-check correction' to tear up rally, Jim Paulsen warns", "locations": [], "entities": {"persons": [{"name": "dwight eisenhower", "sentiment": "negative"}, {"name": "jim paulsen", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "paulsen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "the leuthold group", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "18 Hours Ago | 01:40 \nIt's a win streak that hasn't been seen since Dwight Eisenhower was in the White House and Billboard's top song of the year was \"The Battle of New Orleans.\" \nFast forward about 60 years later, and the S&P 500 is setting itself up to potentially do it again. Ten-straight months of gains — unless long-time bull Jim Paulsen's \"gut-check correction\" forecast grips the market before then. \n\"There is a breakout of optimism among corporations, among consumers and among investors,\" Paulsen said Monday on CNBC's \" Trading Nation .\" \"People are getting out over their skis. They're bidding up valuations too high. They're ignoring negatives.\" \nPaulsen, chief investment strategist at The Leuthold Group, has grown cautious during the past few months and sees 2018 getting hit with a \"very scary\" pullback. \n\"I lean a little more towards 15 percent,\" he said. \nPaulsen doesn't believe it'll be a sign of a recession, however. He makes the case that synchronized global growth and President Donald Trump's pro-business policies should keep the U.S. economy out of a downturn for at least a couple of years. \nBut Paulsen is convinced the odds of a deeper and deeper pullback grows each day the stock market sets an all-time high — ans says optimism is way too high right now. The S&P 500 saw its 11th record close of the year on Monday. \n\"The thing that hits me the most is the whole premise of this bull — for both stocks and bonds over the last nine years — has been we've climbed a perpetual wall of worry the whole way. People have been conservative and thinking it would end at any moment,\" he said. \nHe contends that risks associated with rising 10-year note yields , high stock valuations and an unsustainable rate of positive economic and earnings surprises as a recipe for a steep market drop. \n\"You see inflation evidence creeping into the system,\" Paulsen said. \"There's pressure building.\" \nYet there is a silver lining. Paulsen believes it'll give stock market investors a \"whale of a buying opportunity.\" \nAnd where would Paulsen start? He says likely with financials which should do well as 10-year yields rise.", "external_links": [], "published": "2018-01-23T15:00:00.000+02:00", "crawled": "2018-01-23T15:34:03.015+02:00", "highlightTitle": ""}