{"organizations": [], "uuid": "114b98780adac15f052cc29913890e6cbbe5786d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-philippines-media/philippine-regulator-revokes-license-of-news-website-for-ownership-violations-idUKKBN1F40TI", "country": "US", "domain_rank": 408, "title": "Philippine regulator revokes license of news website for ownership violations", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T10:25:00.000+02:00", "replies_count": 0, "uuid": "114b98780adac15f052cc29913890e6cbbe5786d"}, "author": "", "url": "https://uk.reuters.com/article/uk-philippines-media/philippine-regulator-revokes-license-of-news-website-for-ownership-violations-idUKKBN1F40TI", "ord_in_thread": 0, "title": "Philippine regulator revokes license of news website for ownership violations", "locations": [], "entities": {"persons": [{"name": "armando pan", "sentiment": "none"}, {"name": "neil jerome morales", "sentiment": "none"}, {"name": "rappler", "sentiment": "none"}, {"name": "rodrigo duterte", "sentiment": "none"}], "locations": [{"name": "manila", "sentiment": "none"}], "organizations": [{"name": "securities and exchange commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "rappler holdings corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 8:29 AM / Updated 23 minutes ago Philippine regulator revokes license of news website for ownership violations Neil Jerome Morales 3 Min Read \nMANILA (Reuters) - The Philippine corporate regulator has rescinded the operating license of a prominent online news platform, arguing it had used a “deceptive scheme” to violate the constitution’s restrictions on foreign ownership of domestic media. \nThe Securities and Exchange Commission (SEC) said in a statement news website Rappler (www.rappler.com) as a media entity had violated foreign equity restrictions because it “sold control to foreigners”. \nIts holding company, Rappler Holdings Corporation, existed only to effect a “deceptive scheme to circumvent the constitution”, the SEC said in explaining a Jan. 11 ruling, which was made public on Monday. \nSEC Secretary Armando Pan in a text message said the decision was “not final and executory” and Rappler could appeal within 15 days. \nRappler, established in July 2011, has had a rocky relationship with the administration of President Rodrigo Duterte, who has voiced in numerous speeches his annoyance at its reporting. \nRappler said in a statement the decision was “pure and simple harassment” and called it “the seeming coup de grace to the relentless and malicious attacks against us since 2016”. \n“We intend to not only contest this through all legal processes available to us, but also to fight for our freedom to do journalism,” it said. \nDuterte threatened during his State of the Nation Address last year to investigate Rappler’s ownership, accusing it of being fully American owned. \nRappler at the time responded saying that though it had foreign investors, they were not the owners, and Rappler “remains 100 percent Filipino owned”. \nTwo foreign investors were bought into the company in 2015 through Philippine Depositary Receipts. They were Omidyar Network, a fund created by eBay founder and entrepreneur Pierre Omidyar, and North Base Media, a fund for independent journalism founded by three prominent foreign journalists. \nSEC Commissioner Antonieta Ibe said the decision was carefully reached and should not be seen as an attack on the media. \n“There was continuous deliberation by the lawyers. It was really studied,” Ibe told Reuters. \nDuterte’s spokesman Harry Roque said the president’s office respected the decision of the SEC, which is empowered to determine the legality of corporations. \nAccording to the 1987 Philippine constitution, ownership and management of media “shall be limited to citizens of the Philippines, or to corporations, cooperatives or associations, wholly-owned and managed by such citizens”. Additional reporting by Karen Lema and Manolo Serapio Jr; Writing by Martin Petty; Editing by Robert Birsel", "external_links": [], "published": "2018-01-15T10:25:00.000+02:00", "crawled": "2018-01-15T10:54:45.009+02:00", "highlightTitle": ""}