{"organizations": [], "uuid": "9ec4f2647544c341f94b96863209fe83add2a34a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-893557438.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/bitcoin-monero-cryptocurrency-crime/", "country": "US", "domain_rank": 1196, "title": "Bitcoin: Crooks Drop Bitcoin for Monero Cryptocurrency | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.526, "site_type": "news", "published": "2018-01-22T12:03:00.000+02:00", "replies_count": 0, "uuid": "9ec4f2647544c341f94b96863209fe83add2a34a"}, "author": "Jeff John Roberts", "url": "http://fortune.com/2018/01/22/bitcoin-monero-cryptocurrency-crime/", "ord_in_thread": 0, "title": "Bitcoin: Crooks Drop Bitcoin for Monero Cryptocurrency | Fortune", "locations": [], "entities": {"persons": [{"name": "jeff john roberts", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "chainalysis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jeff John Roberts 10:03 AM EST \nBitcoin is the world’s most popular digital currency but, in the crypto community, complaints are growing: Bitcoin takes too long to process transactions, the fees are too high, it’s expensive, and too volatile . \nOne sign of this discontent is reports that online criminals—who are among bitcoin’s oldest and most dedicated users—are ditching it in favor of different currencies that offer a better user experience and more privacy. \nStories of crooks looking for bitcoin alternatives are not new, but there is an increasing amount of evidence the currency is falling out of favor in the underworld. This includes a new report by the forensic firm Chainalysis that says the proportion of bitcoin transactions related to “dark web” sites, where people often engage in criminal activities, has fallen from 30% to under 1%. \nA big part of this drop is because far more people are using bitcoin, and are choosing to hold it rather than spend it. But Chainalysis, which counts many law enforcement agencies among its clients, also cites the growing use on the dark web of other currencies like Monero , Dash, and Zcash . \nThese newer currencies not only offer faster and cheaper transactions, but also include extra layers of anonymity that make them far more difficult to track than bitcoin. Indeed, the Executive Director of Europol, Rob Wainwright, warned this trend is already underway. \n“We’ll see a progressive shift in 2018 towards criminal use of cryptocurrencies other than Bitcoin, making it generally more challenging for law enforcement to counter,” said Wainwright on Twitter . \nMeanwhile, a detailed report on the topic last week by the tech site ZDNet cited several researchers who claimed that high fees and sluggish transactions times are causing crooks to move to Monero. The phenomenon reportedly extends to ransomware, which involves hackers freezing victims’ computers and demanding payment: \n“Instead of being provided with instructions on how to buy bitcoin—which, thanks to its popularity, might now prove cumbersome—it’s likely cybercriminals will soon be providing their ransomware victims with instructions on how to buy and exchange Monero,” writes ZDNet. \nBut while criminals may be turning away from bitcoin for ordinary transactions, they have hardly lost interest in it altogether. According to Chainalysis’s report, crooks might not want to use it—but they definitely want to steal it. \n“We find that theft of Bitcoin has risen from at least $3 million in 2013 to $95 million in 2016,” the firm states, adding that at least $172 million worth of Bitcoin between 2013 and 2017, using prices at the date of the hack. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-22T12:03:00.000+02:00", "crawled": "2018-01-22T17:50:30.018+02:00", "highlightTitle": ""}