{"organizations": [], "uuid": "9b3af9e41bb31e0846361ec4019bebe38031ce62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223697047&w=1200&r=LYNXMPEE0J0TA", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-ars-cry-sanchez/alexis-who-wenger-looks-to-life-after-sanchez-as-arsenal-triumph-idUKKBN1F913I", "country": "US", "domain_rank": 408, "title": "Alexis who? Wenger looks to life after Sanchez as Arsenal triumph", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T22:29:00.000+02:00", "replies_count": 0, "uuid": "9b3af9e41bb31e0846361ec4019bebe38031ce62"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-ars-cry-sanchez/alexis-who-wenger-looks-to-life-after-sanchez-as-arsenal-triumph-idUKKBN1F913I", "ord_in_thread": 0, "title": "Alexis who? Wenger looks to life after Sanchez as Arsenal triumph", "locations": [], "entities": {"persons": [{"name": "sanchez", "sentiment": "negative"}, {"name": "wenger", "sentiment": "negative"}, {"name": "alexis", "sentiment": "negative"}, {"name": "alistair smout", "sentiment": "none"}, {"name": "alexis sanchez", "sentiment": "none"}, {"name": "arsene wenger", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "arsenal", "sentiment": "negative"}, {"name": "crystal palace", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 8:29 PM / Updated 28 minutes ago Alexis who? Wenger looks to life after Sanchez as Arsenal triumph Alistair Smout 3 Min Read \nLONDON (Reuters) - The drawn out transfer saga of Alexis Sanchez is nearing a conclusion, Arsenal manager Arsene Wenger said on Saturday, and his team’s demolition of Crystal Palace suggested that they might be able to get by without their Chilean forward. \nA scintillating start set the tone for a 4-1 victory, Arsenal’s first win of 2018, showing the north London side at their fluid best to end a five-game winless run - even as Sanchez was omitted pending a possible move to Manchester United. \nThe result suggested that while Sanchez’s world-class attacking talents will be missed, the likely conclusion of his move could let Arsenal prosper without the distraction of the most high-profile transfer saga of the January window. \n“The period of uncertainty was difficult... Once things are clear, the team responds and focusses on the job,” Wenger said at a news conference after the victory over Palace. \n“We started well, played well, and played the kind of football we want to play and that we know we can play when everybody is focussed.” \nArsenal swept Palace away with four goals in a blistering first 22 minutes. Defender Nacho Monreal scored and picked up two assists, while striker Alexandre Lacazette scored his first goal since early December. \nThe return of German playmaker Mesut Ozil, who laid on a beautiful backheeled assist for Lacazette’s goal, also helped Arsenal fans to forget the absence of Sanchez, who was left out of the squad for a second straight game. Soccer Football - Premier League - Arsenal vs Crystal Palace - Emirates Stadium, London, Britain - January 20, 2018 Arsenal manager Arsene Wenger Action Images via Reuters/Paul Childs \nWenger joked that while he had been tempted to select Sanchez, the logistics of transfers made his inclusion more difficult. \n“I didn’t take him because there is this question of him moving to Manchester United, you cannot drive up north and as well play football,” he said . Soccer Football - Premier League - Arsenal vs Crystal Palace - Emirates Stadium, London, Britain - January 20, 2018 Arsenal manager Arsene Wenger and Alex Iwobi Action Images via Reuters/Paul Childs \n“That’s difficult, so that’s why I decided to leave him out.” \nHe said that the transfer was “likely”, and could be confirmed in the next 48 hours. The deal would see Armenian midfielder Henrikh Mkhitaryan move to the Gunners, which made talks more complicated and was slowing them down, Wenger said. \nWenger did not comment on speculation linking Arsenal to Borussia Dortmund striker Pierre-Emerick Aubameyang as a possible Sanchez replacement. \nYet even without new reinforcements, Crystal Palace manager Roy Hodgson said that Arsenal had a team that could punish anyone, regardless of Sanchez’s absence. \n“With the quality of players they have... they’re always capable of producing that type of scintillating 20, 25 minute spell which really put the game beyond doubt,” he said. Editing by Toby Davis", "external_links": [], "published": "2018-01-20T22:29:00.000+02:00", "crawled": "2018-01-20T23:06:37.022+02:00", "highlightTitle": ""}