{"organizations": [], "uuid": "121e880b4e6dae0eb2a457eaf8e5b4d9b1766b87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/21/103807799-GettyImages-503572780.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/27/telegrams-ico-is-attracting-the-industrys-newer-crypto-investors.html", "country": "US", "domain_rank": 767, "title": "Telegram’s ICO is attracting the industry’s newer crypto investors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T23:41:00.000+02:00", "replies_count": 0, "uuid": "121e880b4e6dae0eb2a457eaf8e5b4d9b1766b87"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/27/telegrams-ico-is-attracting-the-industrys-newer-crypto-investors.html", "ord_in_thread": 0, "title": "Telegram’s ICO is attracting the industry’s newer crypto investors", "locations": [], "entities": {"persons": [{"name": "yuri milner", "sentiment": "none"}, {"name": "andreessen horowitz", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "union square ventures", "sentiment": "none"}, {"name": "sequoia capital", "sentiment": "none"}, {"name": "kleiner perkins caufield & byers", "sentiment": "none"}, {"name": "bessemer venture partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Some of the most prominent investors in cryptocurrency are passing on a much-hyped initial coin offering hosted by the messaging app Telegram, while the venture firms that have largely missed out are preparing to invest.\nThat role reversal is crystallizing ahead of a deadline to decide whether to participate in the $1.2 billion project. The venture firms that have been among the most aggressive in the burgeoning cryptocurrency sector — Andreessen Horowitz, Union Square Ventures and Bessemer Venture Partners — are all expected not to invest in the upcoming ICO, according to sources familiar with their plans.\nThis ICO, however, is attracting a range of U.S. investors who see the deal as less of an investment in cryptocurrency and more as another investment in a promising consumer product. Several major players in Silicon Valley who are newer to cryptocurrencies are investing: Benchmark, Sequoia Capital, Kleiner Perkins Caufield & Byers and the investor Yuri Milner, in his personal capacity, according to people briefed on their plans.\nOutside investors are being asked to contribute about $20 million in the pre-sale period of the ICO offered by Telegram, the encrypted social messaging app that is hugely popular overseas. The $1.2 billion made in the ICO would allow Telegram to build and support a payment system on its platform.\nThe Telegram Open Network offering would put the currency before the app's 180 million monthly active users.\n\"TON is not a technology bet, since the ICO isn't really proposing anything new. It is a user-traction bet,\" said one investor with knowledge of the transaction.\nRead more from Recode:\nTed Ullyot is retiring from Andreessen Horowitz after almost three years running the firm's policy team\nTwitter is selling a new kind of ad: Sponsored Moments\nFacebook wants more gamers livestreaming, so it's offering paid deals and a chance to earn donations from fans\nFounders Fund, the investment vehicle started by Peter Thiel that has also taken the unusual step of buying cryptocurrencies directly, is also still deciding whether to allocate money to the ICO. Some of those interested firms' plans were first reported by the Financial Times.\nVenture capitalists in recent months have been huddling with their funds' own investors to see whether they can purchase ICO tokens instead of securities — or stock in private companies, which is what they're supposed to do. Some firms are treading cautiously, but others like Coinbase backers Andreessen and USV have effectively become branded as, in the words of one investor, \"the establishment\" in this market.\nNearly every major venture firm has had access to participate in the Telegram ICO. And this deal appeals to venture funds, they say, because it offers an easy, introductory way for them to gain exposure to the crypto-economy without taking a risk on whether the currency will gain sufficient distribution. Interested investors say that Telegram's mainstream appeal means that venture investors are not betting on some obscure platform that could fail even if the underlying technology is brilliant.\n\"It's an easy 'first ICO' for VC's ramping up to get their head around\" cryptocurrency, said another person close to the ICO.\nBut here's the bearish case, in the eyes of investors that passed on the deal: The assumption that every Telegram user is interested in using cryptocurrency isn't valid. And this ICO does not solve the underlying problem for all ICOs — it is unclear how venture firms will cash in, even if the project is successful.\nAnd others worry about the ICO's lockup period — which sources say ends one to two years after its launch — and whether that could handcuff participants. A savvier move, investors say, would be to merely buy the currencies directly and be able to ride the incredible rise in the value of things like bitcoin.\nSome others worry about the background of Pavel Durov, Telegram's controversial CEO, or say they are not impressed by the underpinnings of the technology.\nBut unlike in traditional financing, the opinions of top-flight venture firms are only somewhat relevant to cryptocurrency insiders. The blessing of a Benchmark — or the thumbs-down of an Andreessen Horowitz — does not have the same signaling effect as it does when a startup is raising capital.\nAnd also unlike startup fundraising, there is not one or two \"lead\" investors that provide most of the money. Some venture funds here that are pushing around $20 million also later plan to distribute their investment to their own syndicates of investors.\nMuch of the cash for the Telegram ICO is expected to come from non-American financiers, too.\nAbout half the money for the project will be raised from the public at large later this winter, after institutional investors have had the chance to buy in.", "external_links": ["https://www.recode.net/2018/1/26/16937718/twitter-new-ads-moments-sponsor", "https://www.recode.net/2018/1/26/16938698/ted-ullyot-andreessen-horowitz-retiring-policy", "https://www.ft.com/content/790d9506-0175-11e8-9650-9c0ad2d7c5b5", "https://www.recode.net/2018/1/26/16934662/facebook-livestreaming-video-games-esports"], "published": "2018-01-27T23:41:00.000+02:00", "crawled": "2018-01-27T22:59:07.013+02:00", "highlightTitle": ""}