{"organizations": [], "uuid": "6aaa5c947f5552e36acfcae5b3555a208045c11f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970091-GettyImages-910486198_1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/riksbanks-skingsley-bitcoin-cryptocurrencies-are-assets-not-money.html", "country": "US", "domain_rank": 767, "title": "Riksbank's Skingsley: Bitcoin, cryptocurrencies are assets, not money", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-26T14:02:00.000+02:00", "replies_count": 0, "uuid": "6aaa5c947f5552e36acfcae5b3555a208045c11f"}, "author": "Ryan Browne", "url": "https://www.cnbc.com/2018/01/26/riksbanks-skingsley-bitcoin-cryptocurrencies-are-assets-not-money.html", "ord_in_thread": 0, "title": "Riksbank's Skingsley: Bitcoin, cryptocurrencies are assets, not money", "locations": [], "entities": {"persons": [{"name": "jason alden", "sentiment": "negative"}, {"name": "cecilia skingsley", "sentiment": "negative"}, {"name": "skingsley", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "riksbank", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bitcoin and other cryptocurrencies are \"not a very good version of money\" due to their volatile nature, the deputy governor of Sweden's central bank said Thursday.\nCecilia Skingsley said that digital currencies were not an efficient store of value or means of exchange, but conceded that they could be called assets instead.\n\"In my view, cryptocurrencies, bitcoin and the others — the way I've seen them so far — they don't meet the criteria to be called money,\" the Riksbank deputy said at the World Economic Forum (WEF) in Davos, Switzerland.\n\"They can be called an asset, fine, but they are not a very good version of money because it's not a very stable store of value where they fluctuate a lot. And it's not a very efficient medium of exchange because you don't buy your groceries with bitcoin.\"\nReferring to the historical development of money and currencies from dated methods like copper and gold, Skingsley defined \"good money\" as a stable store of value with enough demand within a country or currency union.\nVirtual currencies have come under fire from both bankers and regulators recently due to concerns of wild price swings and illegal activities like money laundering.\nshow chapters Russians want to invest in bitcoin, but it’s a bubble: RDIF CEO 11:50 AM ET Tue, 23 Jan 2018 | 03:05 Earlier this month, reports emerged of South Korea planning a bill to ban cryptocurrency trading via exchanges, news that sent the value of multiple digital assets down significantly. And J.P. Morgan CEO Jamie Dimon notably referred to bitcoin as a \"fraud\" that will eventually \"blow up,\" comparing it to the Tulip mania phenomenon of the 17th century.\nCentral bank-backed digital currency Sweden itself has mulled the development of its own fiat digital currency, the ekrona, due to a decline in cash use in the Scandinavian country.\n\"We see a rapid decrease in the value of circulation of notes and coins and as a central bank we are sort of neutral about this,\" Skingsley said. \"We think that people should be able to use the payment methods that they find safe and efficient, as long as they are safe and efficient.\"\nShe added: \"If we find that there is a need for a public sector digital version, we are looking into what sort of features that would have.\"\nSkingsley said that this concept was \"far away into the future,\" and that the central bank was not decided about whether it would use blockchain technology to underpin the ekrona. Blockchain is a decentralized network of computers that logs cryptocurrency transactions.\nOn the regulation of cryptocurrencies, Skingsley said that rules already exist in Sweden and other countries to clamp down on illicit activity and ensure consumer protection.\nFollow CNBC International on Twitter and Facebook .", "external_links": [], "published": "2018-01-26T14:02:00.000+02:00", "crawled": "2018-01-26T14:25:41.018+02:00", "highlightTitle": ""}