{"organizations": [], "uuid": "dc7c98095fa96bceae870ddb86357dedca488ae9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-europe-companies-research/will-mifid-ii-lead-to-the-rise-of-the-lone-analyst-idUSKBN1F41ON", "country": "US", "domain_rank": 408, "title": "Will MiFID II lead to the rise of the lone analyst?", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-15T21:34:00.000+02:00", "replies_count": 0, "uuid": "dc7c98095fa96bceae870ddb86357dedca488ae9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-europe-companies-research/will-mifid-ii-lead-to-the-rise-of-the-lone-analyst-idUSKBN1F41ON", "ord_in_thread": 0, "title": "Will MiFID II lead to the rise of the lone analyst?", "locations": [], "entities": {"persons": [{"name": "bruno bulic", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Bruno Bulic doesn’t have any problems asking a question when Swiss biotech firm Basilea Pharmaceutica ( BSLN.S ) hosts its earnings call. He’s the only sell-side analyst to cover the company, according to Thomson Reuters data.\nThough still rare, the number of billion-dollar stocks covered by just one broker could be about to increase after the roll-out of European Union rules aimed at making financial markets more transparent.\nUnder the Markets in Financial Instruments Directive II (MiFID II), which went live this month, fund managers will have to pay an explicit fee for receiving research from banks, whereas previously they could get it for free and pay for it in trading costs.\nOne likely consequence of forcing fund managers to pay is that it will make them more selective and could force brokers to cut back on staff and rein in their scope of coverage.\nAnalysis of Europe’s major small-cap indices shows companies in mainland Europe already suffer from a lack of analyst coverage, compared to the UK, the largest and most mature small cap market.\nSwitzerland, which is not in the EU but will have to abide by MiFID II rules, has the lowest analyst coverage among major European markets. Companies on its MSCI Small Cap Index .dMICH000S0P are covered by just four analysts on average, compared with an average of nine on the equivalent UK index .dMIGB000S0P, and eight on Germany’s small-cap index .dMIDE000S0P.\n“If you are looking for good quality coverage in the MiFID context, it is going to be more and more challenging,” said Bulic, who covers healthcare companies for broker Baader Helvea.\nOn Switzerland's main stock exchange index .SSMI , 30 companies, or 16 percent, have no sell-side research, while 28 (15 percent) are covered by just one analyst. The figures exclude investment trusts and companies with either a market capitalization under $100 million or a free float under 25 percent.\nOn Britain's FTSE All Share index .FTAS in contrast, only 2 percent are covered by one analyst, while just one stock out of more than 450, Goodwin ( GDWN.L ), was not covered at all, Thomson Reuters data shows.\nWhile a headache for fund managers, decreasing coverage can be a boon for specialist brokers, leaving them with monopolies on smaller companies and making them indispensable to investors.\n“It is a good thing, of course,” said Daniel Bürki, an analyst at ZKB, which is the only broker to offer coverage of Swiss media company APG ( APGN.S ).\n“We have exclusive management contact and some clients have to contact you if they are interested in the stock.”\nEven in the UK, with its far deeper, wealthier equity trading community, independent brokerages see a risk to the quality and depth of research on smaller companies.\nSmall-cap stockbroking specialists, who could lose out as big fund manager clients cut their research providers, may try to continue distributing research for free while relying solely on their corporate clients for payment.\n“That causes complications, as investors may find themselves in a situation where the only research available on a small-cap company is from the house broker, which by definition is not independent,” said Ross Mitchinson, co-CEO of Numis, which covers around 400 large and smaller UK companies.\nHe said it means less research written on smaller UK stocks, and far less independent research.\n“That can only be a bad thing for capital markets, and for the UK as a listing venue,” Mitchinson said.\n(For a graphic, click bit.ly/2DySxl6 )\nReporting by Alasdair Pal; Editing by Tom Pfeiffer and Susan Fenton\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://bit.ly/2DySxl6"], "published": "2018-01-15T21:34:00.000+02:00", "crawled": "2018-01-16T13:37:51.018+02:00", "highlightTitle": ""}