{"organizations": [], "uuid": "ebefba25071835c296be1dd8b68b87487a208f96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 40, "shares": 40, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/21/103323850-462716068.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/us-stocks-earnings-season-delta-walmart.html", "country": "US", "domain_rank": 767, "title": "Stocks open higher on better-than-expected earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.441, "site_type": "news", "published": "2018-01-11T16:30:00.000+02:00", "replies_count": 0, "uuid": "ebefba25071835c296be1dd8b68b87487a208f96"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/11/us-stocks-earnings-season-delta-walmart.html", "ord_in_thread": 0, "title": "Stocks open higher on better-than-expected earnings", "locations": [], "entities": {"persons": [{"name": "andy kapyrin", "sentiment": "none"}, {"name": "kapyrin", "sentiment": "none"}, {"name": "andrew burton", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "s&p", "sentiment": "negative"}, {"name": "new york stock exchange  delta air lines", "sentiment": "none"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}, {"name": "regentatlantic", "sentiment": "none"}, {"name": "homebuilder kb home", "sentiment": "none"}, {"name": "s&p capital iq", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "j.p. morgan chase and wells fargo", "sentiment": "none"}, {"name": "blackrock", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dow spikes 205 points to record close, led by Boeing The major averages rebounded from losses posted in the previous session. Delta Air Lines and homebuilder KB Home posted better-than-expected quarterly profits. Earnings are expected to have grown by 10.6 percent during the fourth quarter, according to S&P Capital IQ. 4 Hours Ago | 03:04 \nThe Dow Jones industrial average rose to an all-time high on Thursday as investors bet economic growth would pick up steam. \nThe index rose 205.60 points to 25,574.73, a record close, with Boeing as the biggest contributor of gains. Boeing is one of the companies that stands to benefit the most if economic growth ratches up. \nThe Nasdaq composite also hit a record high, rising 0.8 percent to 7,211.78, as shares of Apple gained 0.6 percent. The S&P 500 gained 0.7 percent to finish at 2,767.56 and reached an all-time high, with energy surging on the back of rising oil prices. Symbol NASDAQ --- \nThe major averages rebounded from losses posted in the previous session.The S&P 500 and Nasdaq snapped a six-day winning streak on Wednesday. Investors fretted over the possibility of China halting its Treasury bond purchases and the U.S. pulling out of NAFTA. \n\"Ever since last summer, we've really struggled to have a meaningful pullback,\" said Andy Kapyrin, director of research at RegentAtlantic. Kapyrin also said there is optimism about the global synchronous economic recovery and the upcoming earnings season. Andrew Burton | Getty Images Trader working on the floor of the New York Stock Exchange \nDelta Air Lines reported adjusted earnings that surpassed analyst expectations, sending the company's stock 4.8 percent higher. Homebuilder KB Home also posted a better-than-expected quarterly profit; the stock rose 12.3 percent. \nBlackRock, J.P. Morgan Chase and Wells Fargo are all scheduled to report Friday. Earnings are expected to have grown by 10.6 percent during the fourth quarter, according to S&P Capital IQ. \nAnalyst and investors will be looking for clues about how the recent changes to the U.S. tax code will impact each company. President Donald Trump signed a bill last month that slashed the corporate tax rate to 21 percent from 35 percent. \n\"On a static basis, the [Joint Committee on Taxation] expects the rate reduction to lower the corporate tax bill by $1.3 trillion over the next 10 years,\" said Ed Yardeni, president and chief investment strategist at Yardeni Research, in a note this week. \"That's a nice chunk of change, but it's not the complete picture.\" \n\"The tax rate that companies actually pay may be lower, or even higher, than 21% depending on other tax adjustments,\" Yardeni said. \nIn economic news, U.S. producer prices fell for the first time in more than a year. Treasury yields pared gains following the data release, but the 10-year yield remained close to its highest levels since March.", "external_links": [], "published": "2018-01-11T16:30:00.000+02:00", "crawled": "2018-01-11T16:32:45.008+02:00", "highlightTitle": ""}