{"organizations": [], "uuid": "69f0fbfdc5af9ed922aeb2ffa5faeec4b0b9be47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222712471&w=1200&r=LYNXMPEE0G0RN", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-bank-of-america-results/bank-of-america-profit-slumps-on-2-9-billion-tax-charge-idUSKBN1F61E0", "country": "US", "domain_rank": 408, "title": "Bank of America profit slumps on $2.9 billion tax charge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T14:03:00.000+02:00", "replies_count": 0, "uuid": "69f0fbfdc5af9ed922aeb2ffa5faeec4b0b9be47"}, "author": "", "url": "https://www.reuters.com/article/us-bank-of-america-results/bank-of-america-profit-slumps-on-2-9-billion-tax-charge-idUSKBN1F61E0", "ord_in_thread": 0, "title": "Bank of America profit slumps on $2.9 billion tax charge", "locations": [], "entities": {"persons": [{"name": "sweta singh", "sentiment": "none"}, {"name": "elizabeth dilts", "sentiment": "none"}, {"name": "saumyadeb chakrabarty", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "bank of america", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters) - bank of america corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 12:03 PM / Updated an hour ago Bank of America takes tax hit, vows longer-term boost Sweta Singh , Elizabeth Dilts 4 Min Read \n(Reuters) - Bank of America Corp’s ( BAC.N ) quarterly profit was nearly chopped in half by tax-related charges but the lender’s management promised the new U.S. tax system would eventually benefit shareholders. \nThe tax overhaul, signed by U.S. President Donald Trump late in December, is taking a chunk out of Wall Street profits this quarter as lenders swallow one-time charges on overseas earnings and account for tax benefits that are now less valuable because of the lower corporate rate. \nLeaving aside the tax hit, which Bank of America announced late last year, profit topped analyst expectations. \nThe bank’s shares were down 0.1 percent in late afternoon trading. They had run up nearly 16 percent in the past three months, leading gains in a sector that rose broadly in anticipation of the tax bill. \nInvestors expect the eventual windfall from lower tax rates to be passed on through higher dividends and more share buybacks. They are also watching for knock-on effects of the overhaul like higher borrowing, trading and deal activity that would boost the bank’s bottom line. \nBank of America Chief Executive Brian Moynihan said some tax savings would be funneled into technology investments but the bulk of the windfall would be returned to investors. \n“Most of the benefits will fall to the bottom line and be used to return to shareholders,” he said. \nThe lender expects its effective tax rate this year to be around 20 percent, 9 percentage points lower than 2017. \nThe second-largest U.S. bank by assets booked a $2.9 billion charge related to the tax overhaul, which dragged its net income down to $2.37 billion. \nExcluding that charge, it earned $5.3 billion, or 47 cents per share. According to Thomson Reuters I/B/E/S, excluding the tax charge and another item, the company earned 48 cents per share, topping analysts’ estimate of 44 cents. FILE PHOTO: A customer uses an ATM at a Bank of America branch in Boston, Massachusetts, U.S., October 11, 2017. REUTERS/Brian Snyder/File Photo \nThe bank trades at a lower valuation than some rivals and its quarterly return on equity was 7.8 percent, down from 8.1 percent at the end of the third quarter and below a 10 percent theoretical cost of capital. THE DEFINITION OF RISK \nDogged for years by litigation and penalties stemming from the financial crisis, Bank of America has been put on a more stable footing by Moynihan’s years-long effort to cut costs and focus the bank’s sprawling operations. \nThe lender’s large stock of deposits and rate-sensitive mortgage securities make it especially well placed to benefit from interest rate rises. Its net interest income rose more than 11 percent to $11.46 billion, helped by the three Federal Reserve rate hikes in 2017. \nRevenue rose at three of its four businesses, pushing total revenue up about 2 percent to $20.69 billion. Non-interest expenses fell 1 percent. \nBank of America’s trading revenue was down compared with a year earlier when investors actively changed positions around the U.S. elections, but the 13 percent drop in bond trading was shallower than falls at JPMorgan Chase & Co ( JPM.N ) and Citigroup Inc ( C.N ). \nGoldman Sachs, which is heavily reliant on trading, reported a 50 percent slide in trading fixed income, commodities and currencies on Wednesday. \nBank of America’s quarterly results were also hit by a $292 million charge for single-name loss, which a source familiar with the situation said was related to troubled South African furniture retailer Steinhoff International ( SNHJ.J ). \nThe company’s woes have rippled through Wall Street with Citigroup and JPMorgan booking losses of $130 million and $143 million, respectively, and more pain is expected when European banks start reporting results in the coming weeks. \n“We are very comfortable with the risk we take. Once in a while something doesn’t turn out the way you want because that’s what the definition of risk is,” said Moynihan. Additional reporting by David Henry in New York. Writing by Carmel Crimmins; Editing by Saumyadeb Chakrabarty and Meredith Mazzilli", "external_links": [], "published": "2018-01-17T14:03:00.000+02:00", "crawled": "2018-01-17T14:13:06.002+02:00", "highlightTitle": ""}