{"organizations": [], "uuid": "3ffc2439809274a02e576858c9187c322650b3d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-mauna-kea-technologies-reports-fourth-quarter-and-full-year-2017-sales.html", "country": "US", "domain_rank": 767, "title": "Mauna Kea Technologies Reports Fourth Quarter and Full Year 2017 Sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.027, "site_type": "news", "published": "2018-01-31T19:45:00.000+02:00", "replies_count": 0, "uuid": "3ffc2439809274a02e576858c9187c322650b3d6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-mauna-kea-technologies-reports-fourth-quarter-and-full-year-2017-sales.html", "ord_in_thread": 0, "title": "Mauna Kea Technologies Reports Fourth Quarter and Full Year 2017 Sales", "locations": [], "entities": {"persons": [{"name": "sacha loiseau", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "mauna kea technologies", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Global sales declined 24% in 2017 and U.S. clinical business revenue remained stable\n(+1%) as transition to pay-per-use model in U.S. continues\nRestructured and fully-staffed U.S. commercial team under new leadership\nStrong €20.6m cash position (end of Jan. 2018) securing strategy’s roll-out over the next two years\nPARIS--(BUSINESS WIRE)-- Regulatory News:\nMauna Kea Technologies will host a conference call today at 7:15 PM (CET / Paris time) / 1:15 PM (ET / New York time) to discuss the Company’s full year 2017 sales results and to provide a business update. The conference call will be hosted by Sacha Loiseau (CEO). To access the conference call, please use one of the following dial-in numbers at least 5 minutes prior to the scheduled start time and follow the instructions: USA: +1 844-286-0643 / UK: +44 (0)2071943759 / FR: +33 (0)1 72 72 74 03. The passcode for the conference call is: 99721603#. Following the conclusion of the live call, a replay will be available for 90 days. To access the replay, please dial one of the following numbers: USA: +1 646-722-4969 / UK: +44(0) 2033645147 / FR: +33 (0)1 70 71 01 60. The passcode for the replay is: 418727404#.\nMauna Kea Technologies (Paris:MKEA) (OTCQX:MKEAY) inventor of Cellvizio®, the multidisciplinary confocal laser endomicroscopy platform, today announced its sales for the fourth quarter and full year ended December 31, 2017.\nSacha Loiseau, Ph.D., Founder and Chief Executive Officer of Mauna Kea Technologies, stated, “Revenue in the full year decreased 24%, which is consistent with the trend observed for the first nine months. This was driven by our strategic decision to focus on the U.S. in the clinical segment, especially with the roll-out of our pay-per-use business model, which increased but inconsistently. We aggressively addressed this issue over the fourth quarter and restructured the sales force. We now have a fully staffed U.S. sales force and, under new leadership, we expect that the team will gain traction over the coming quarters and be fully trained and productive by the second half of 2018. In addition, we accelerated our go-to-market strategy with our new distribution partner in China, our second key focus market. We approach 2018 leveraging a strong cash position and positive physician feedback and look forward to increasing shareholder value through broader market adoption supported by anticipated regulatory, reimbursement, and clinical milestones.”\nFull Year 2017 Sales\n(in € thousands) – IFRS 2017 2016 Change % 1 st Quarter 1,599 1,954 (18%) 2 nd Quarter 1,686 2,511 (33%) 3 nd Quarter 1,852 2,108 (12%) 4 nd Quarter 1,550 2,213 (30%) Total Sales 6,687 8,787 (24%) Full Year 2017 Sales by Category\n(in € thousands) – IFRS 2017 2016 Change % Systems 3,101 4,217 (26%) Consumables 2,397 2,941 (18%) o/w pay-per-use program (*) 671 449 +49% Services 1,188 1,629 (27%) Total Sales 6,687 8,787 (24%) (*) This amount includes in 2016 revenue generated by systems first placed under the pay-per-use program, which have finally been converted into sales by the customers. This option was limited to the placement realized in 2016 for testing only.\nThe Company shipped 43 Cellvizio systems in the full year 2017, including 13 systems placed under the Company’s pay-per-use program, a decrease of 20% compared to 54 systems in the full year 2016 including six systems under the pay-per-use program. Shipped consumable probes unit volume was 606 units, a decrease of 15% compared to 716 probes sold in the full year 2016.\nThe number of probe reorders (probes sold to existing customers or pay-per-use customers) was 491 in the full year 2017, a decrease of 9% compared to 541 in the full year 2016. This included a 26% increase in reorder volumes in the U.S., which was offset by a 48% decrease in reorder volumes in other markets due to the Company’s focus on transitioning to a pay-per-use model in the U.S.\nAs of January 31, 2018, the Company had a net cash balance of €20.6 million (€17.4 million as of December 2017). This is sufficient capital to fund operations over the next two years.\nFourth Quarter 2016 Revenue by Category\n(in € thousands) – IFRS Q4 2017 (December 31, 2017)\nQ4 2016 (December 31, 2016)\nChange % Systems 652 1,034 (37%) Consumables 624 701 (11%) o/w pay-per-use program (*) 154 179 (14%) Services 273 478 (43%) Total Sales 1,550 2,213 (30%) (*) This amount includes in 2016 revenue generated by systems first placed under the pay-per-use program, which have finally been converted into sales by the customers. This option was limited to the placement realized in 2016 for testing only.\nThe Company shipped 9 Cellvizio systems in the fourth quarter 2017, including one system placed under the Company’s pay-per-use program, a decrease of 25% compared to 12 systems in the fourth quarter 2016 and no system placed under the pay-per-use program.\nShipped consumable probes unit volume was 177 units, an increase of 17% compared to 151 probes sold in the fourth quarter 2016. The number of probe reorders (probes sold to existing customers or pay-per-use customers) totaled 161 in the fourth quarter 2017, an increase of 29% compared to 125 in the fourth quarter 2016.\nRevenue from the pay-per-use program decreased 14% in the fourth quarter 2017. This is a result of the pay-per-use systems placed in 2016 associated with “beta-testing” the program, which allowed customers the right to convert it to a purchase. Some customers where pay-per-use systems were placed exercised this option (which does not exist anymore). This resulted in a difficult year-over-year comparison as the consumption of systems that were transitioned to a sale is not included under the pay-per-use program in 2017.\nFourth Quarter 2017 Sales by Geography with split by activity (Clinical / Pre-clinical)\n(in € thousands) – IFRS 2017 2016 Change % Americas 721 1,140 (37%) Clinical 695 1,104 (37%) Pre-clinical 26 36 (28%) Asia-Pacific 665 653 2% Clinical 311 227 37% Pre-clinical 354 426 (17%) EMEA 164 420 (61%) Clinical 122 401 (70%) Pre-clinical 42 19 121% Total Clinical Sales 1,128 1,732 (35%) Total Pre-clinical Sales 422 481 (12%) Total Sales 1,550 2,213 (30%) Clinical sales\nClinical sales in the Americas region decreased 37% in the fourth quarter 2017 to €695 thousand. As previously mentioned, the Company’s challenges with adding representatives to the U.S. sales team along with the continued impact of the transition to a consignment model hindered performance in the region. The fourth quarter 2017 restructuring of the U.S. commercial team enabled the recruitment of 11 new sales representatives as of January 31, 2018 (compared to less than 3 full-time equivalent in 2017). This sales force is supported by a team of clinical account managers, which is also being strengthened. The Company anticipates that with a fully-staffed U.S. sales force, it is well positioned to educate the market on the innovative nature of Cellvizio and to increase its adoption significantly.\nClinical sales increased 37% in the Asia-Pacific region as the Company began generating top-line benefits from the go-to-market strategy in China. The Company anticipates continued market development in China in 2018 with its new commercial partner. This was offset by a 70% decline in the EMEA as the Company continued to focus its resources on the growth of its core clinical business in the U.S.\nPre-clinical sales\nAs stated in prior quarters, pre-clinical sales are by nature less recurring compared to clinical ones resulting in a difficult comparison from one period to the other one. Pre-clinical sales declined 12% in the fourth quarter 2017, with growth in the EMEA region offset by declines in the Americas and Asia-Pacific regions, reflecting the inherent lumpiness in this business and the Company’s focus on its clinical business.\nFull Year 2017 Sales by Geography with split by activity (Clinical / Pre-clinical)\n(in € thousands) – IFRS December 31, 2016 December 31, 2017 Q1 Q2 Q3 Q4 12m Q1 Q2 Q3 Q4 12m Var (%) Americas 809 951 911 1140 3811 850 708 1174 721 3453 -9% Clinical 610 782 874 1104 3370 871 693 1168 695 3427 2% Pre-clinical 199 169 41 36 445 -21 15 6 26 26 -94% Asia-Pacific 668 814 717 653 2852 202 476 609 665 1951 -32% Clinical 424 625 614 227 1890 171 262 485 311 1229 -35% Pre-clinical 244 190 103 426 963 31 213 124 354 722 -25% EMEA 477 746 480 420 2123 547 502 69 163 1281 -40% Clinical 445 719 457 401 2022 219 419 56 122 816 -60% Pre-clinical 33 28 21 19 101 328 83 13 42 466 361% Total Clinical Sales 1479 2126 1945 1732 7282 1261 1374 1709 1128 5472 -25% Total Pre-clinical Sales 476 387 165 481 1509 338 311 143 422 1214 -20% Total Sales 1955 2513 2110 2213 8791 1599 1685 1852 1550 6686 -24% Systems 920 1374 889 1034 4217 685 838 926 652 3101 -26% Consumables 681 783 776 701 2941 535 564 674 624 2397 -18% Services 353 354 445 478 1630 380 284 251 273 1188 -27% Total Sales 1954 2511 2110 2213 8788 1600 1686 1851 1550 6687 -24% 2017 Quarterly Unit Sales by Type\nUnits Q1 Q2 Q3 Q4 2017 Q1 Q2 Q3 Q4 2016 New systems straight sales (per unit) 5 9 8 8 30 9 17 10 12 48 New consignments placed 6 2 4 1 13 1 5 0 0 6 Probes 125 129 175 177 606 197 217 151 151 716 o/w reorders or pay-per-use 115 107 108 161 491 167 139 110 125 541 About Mauna Kea Technologies\nMauna Kea Technologies is a global medical device company focused on eliminating uncertainties related to the diagnosis and treatment of cancer and other diseases thanks to real time in vivo microscopic visualization. The Company’s flagship product, Cellvizio, has received clearance to sell a wide range of applications in more than 40 countries, including the United States, Europe, Japan, China, Canada, Brazil and Mexico. For more information on Mauna Kea Technologies, visit www.maunakeatech.com\nDisclaimer\nThis press release contains forward-looking statements concerning Mauna Kea Technologies and its activities. Such forward looking statements are based on assumptions that Mauna Kea Technologies considers to be reasonable. However, there can be no assurance that the anticipated events contained in such forward-looking statements will occur. Forward- looking statements are subject to numerous risks and uncertainties including the risks set forth in the registration document of Mauna Kea Technologies registered by the French Financial Markets Authority (Autorité des marchés financiers (AMF)) on May 31, 2017 under number D.17-0574 and available on the Company's website ( www.maunakeatech.com ), and to the development of economic situation, financial markets, and the markets in which Mauna Kea Technologies operates. The forward-looking statements contained in this release are also subject to risks unknown to Mauna Kea Technologies or that Mauna Kea Technologies does not consider material at this time. The realization of all or part of these risks could lead to actual results, financial conditions, performances or achievements by Mauna Kea Technologies that differ significantly from the results, financial conditions, performances or achievements expressed in such forward-looking statements. This press release and the information it contains do not constitute an offer to sell or to subscribe for, or a solicitation of an order to purchase or subscribe for, Mauna Kea Technologies shares in any country.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005920/en/\nMauna Kea Technologies\nSacha Loiseau\nCEO\ninvestors@maunakeatech.com\nor\nUnited States\nRobert Flamm/ Lee Roth\nThe Ruth Group\n646-536-70217/ 7012\nrflamm@theruthgroup.com\nlroth@theruthgroup.com\nor\nU.S. Media\nKirsten Thomas\nThe Ruth Group\n508-280-6592\nkthomas@theruthgroup.com\nor\nFrance and Europe\nNewCap - Investor Relations\nFlorent Alba\n+33 (0)1 44 71 94 94\nmaunakea@newcap.fr\nSource: Mauna Kea Technologies", "external_links": ["http://www.businesswire.com/news/home/20180131005920/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.maunakeatech.fr%2F&esheet=51751708&newsitemid=20180131005920&lan=en-US&anchor=www.maunakeatech.com&index=1&md5=b2a9fd95fdb54a9ae9219f482cd3a5e2", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.maunakeatech.fr%2F&esheet=51751708&newsitemid=20180131005920&lan=en-US&anchor=www.maunakeatech.com&index=2&md5=07b9226807d9557d1b6302812ad4474c"], "published": "2018-01-31T19:45:00.000+02:00", "crawled": "2018-01-31T22:52:40.002+02:00", "highlightTitle": ""}