{"organizations": [], "uuid": "27280fcc01526184de9a900c58ced71b5b5ad400", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/09/reuters-america-corrected-bluebird-to-seek-approvals-for-three-treatments-by-end-of-2019.html", "country": "US", "domain_rank": 767, "title": "CORRECTED-Bluebird to seek approvals for three treatments by end of 2019", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T22:09:00.000+02:00", "replies_count": 0, "uuid": "27280fcc01526184de9a900c58ced71b5b5ad400"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/reuters-america-corrected-bluebird-to-seek-approvals-for-three-treatments-by-end-of-2019.html", "ord_in_thread": 0, "title": "CORRECTED-Bluebird to seek approvals for three treatments by end of 2019", "locations": [], "entities": {"persons": [{"name": "nick leschly", "sentiment": "none"}, {"name": "leschly", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bluebird", "sentiment": "none"}, {"name": "celgene corp", "sentiment": "none"}, {"name": "american society of hematology", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "jp morgan healthcare conference", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Corrects name of multiple myeloma drug to bb2121 from b2121 in fourth and fifth paragraphs)\nJan 9 (Reuters) - U.S. biotech bluebird bio Inc, which does not yet have any marketed products, expects to be able to file for regulatory approval of three novel treatments by the end of 2019, chief executive Nick Leschly announced on Tuesday.\nBluebird expects to file for approval this year for its treatment for transfusion-dependent beta thalassemia, which is intended to eliminate the need for repeated transfusions for the inherited blood disorder, Leschly said at the JP Morgan Healthcare Conference in San Francisco.\nThe other two treatments are bluebird's CAR-T therapy for multiple myeloma, being developed with partner Celgene Corp , and a treatment for a rare and deadly genetic brain disorder, cerebral adrenoleukodystrophy, both of which have demonstrated impressive early results.\nThe company caused a stir at the American Society of Hematology meeting in December with its CAR-T bb2121 as the therapy led to extremely high response and remission rates with good safety in a small study of heavily pretreated multiple myeloma patients who had run out of options.\nLeschly said the company expects to file for U.S. and European approval of bb2121 in 2019.\nBeyond those three, bluebird is also developing a promising treatment for sickle cell disease, a potentially life-shortening inherited blood disorder that causes severe pain and often leads to repeat hospitalizations.\nThe company plans to discuss appropriate endpoints for future sickle cell clinical trials with health regulators and will provide an update on the program at the end of the year, the CEO said.\nHe said the company is looking to develop \"the right pricing and reimbursement strategy\" for treatments expected to be extremely expensive. The first two approved CAR-T treatments for other cancers from Novartis and Gilead Sciences were priced at $475,000 and $373,000, respectively, for the one-time treatments.\nAs bluebird progresses toward a portfolio of potentially game-changing commercial treatments, Leschly said one of his overriding principles is: \"Don't do stupid shortsighted stuff.\"\n\"We haven't done anything yet,\" Leschly said. \"We need to deliver products to patients.\" (Reporting by Bill Berkrot; Editing by Tom Brown and Bill Trott)", "external_links": [], "published": "2018-01-09T22:09:00.000+02:00", "crawled": "2018-01-09T23:26:35.013+02:00", "highlightTitle": ""}