{"organizations": [], "uuid": "ce8bb43b6a64f5bf181293be9d9421a3b497560a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-china-migrants/beijing-to-demolish-15-square-miles-of-illegal-structures-idUSKBN1FD0RE", "country": "US", "domain_rank": 408, "title": "Beijing to demolish 15 square miles of illegal structures", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T10:10:00.000+02:00", "replies_count": 0, "uuid": "ce8bb43b6a64f5bf181293be9d9421a3b497560a"}, "author": "", "url": "https://www.reuters.com/article/us-china-migrants/beijing-to-demolish-15-square-miles-of-illegal-structures-idUSKBN1FD0RE", "ord_in_thread": 0, "title": "Beijing to demolish 15 square miles of illegal structures", "locations": [], "entities": {"persons": [{"name": "chen jining", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london hyde parks", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - Beijing plans to tear down at least 40 million square meters, or a staggering 15.44 square miles, of illegal structures, roughly an area of 28 London Hyde Parks, and shut 500 manufacturing firms this year.\nThe city will “ensure zero increase of such structures” this year and will continue to relocate people out of the city center, acting mayor Chen Jining said in an annual work report to the city’s government on Wednesday.\nBeijing last year set a similar goal to demolish 40 million square meters of illegal structures, but there was no indication in this year’s report whether the target was met.\nBeijing launched a citywide safety blitz in November following a deadly fire that has resulted in the demolition of buildings that violate safety codes and the eviction of thousands of migrant workers from their homes and businesses.\nThe evictions sparked unusually direct criticism from China’s intellectuals, students and journalists, who say the government is unfairly targeting the vulnerable underclass.\nThere will also be no letting up in a campaign to sanitize ancient hutong alleyways that last year displaced migrants as many were evicted from homes and businesses were shut down along the narrow passageways.\nThe city will continue to “close small shops operated from illegal openings cut in the wall”, the report said, referring to what the city says are illegal modifications to the traditional structures.\nAuthorities will also preserve the historical areas of Beijing, including the appropriation of properties, though Chen said housing will be provided for those relocated.\nBeijing has been moving what it calls “non-capital functions” out of the city in order to relieve traffic congestion and pressure on public services, with the Xiongan New Area announced last year as a major focus for regional development.\n“Whatever support Xiongan needs, we will be there to provide it,” said Chen.\nReporting by Elias Glenn; Editing by Michael Perry\n ", "external_links": [], "published": "2018-01-24T10:10:00.000+02:00", "crawled": "2018-01-24T10:19:17.017+02:00", "highlightTitle": ""}