{"organizations": [], "uuid": "2a283a0901f77ca0d4159e213c62b67aa3b9d1fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-teekay-corporation-announces-pricing-of-convertible-senior-notes-offering.html", "country": "US", "domain_rank": 767, "title": "Teekay Corporation Announces Pricing of Convertible Senior Notes Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:46:00.000+02:00", "replies_count": 0, "uuid": "2a283a0901f77ca0d4159e213c62b67aa3b9d1fe"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-teekay-corporation-announces-pricing-of-convertible-senior-notes-offering.html", "ord_in_thread": 0, "title": "Teekay Corporation Announces Pricing of Convertible Senior Notes Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "bermuda", "sentiment": "none"}], "organizations": [{"name": "globe newswire", "sentiment": "negative"}, {"name": "teekay corporation", "sentiment": "negative"}, {"name": "teekay", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HAMILTON, Bermuda, Teekay Corporation ( Teekay or the Company ) (NYSE:TK) today announced that it has priced its offering of $125 million aggregate principal amount of 5.0% Convertible Senior Notes due 2023 (the Convertible Notes ) in a private offering. The Convertible Notes were offered to qualified institutional buyers pursuant to Rule 144A under the Securities Act of 1933, as amended (the Securities Act ). Teekay has granted the initial purchasers an option to purchase up to an additional $25 million aggregate principal amount of the Convertible Notes on the same terms and conditions, solely to cover over-allotments.\nThe Convertible Notes will be the general senior unsecured obligations of Teekay and will accrue interest at a rate of 5.0%, payable semi-annually in arrears, and will mature on January 15, 2023. The Convertible Notes will be convertible into Teekay’s common stock, initially at a rate of 85.4701 shares of common stock per $1,000 principal amount of Convertible Notes. This represents an initial effective conversion price of approximately $11.70 per share of common stock. The initial conversion price represents a premium of 20.0% to the concurrent common stock offering price of $9.75 per share described below.\nThe Company also announced today by separate press release that it has priced its registered public offering pursuant to an effective shelf registration statement of 10 million shares of its common stock at $9.75 per share. The Company has granted the underwriters in that offering a 30-day option to purchase up to an additional 1.5 million shares of common stock. Nothing contained herein shall constitute an offer to sell or the solicitation of an offer to buy the common stock.\nThe Company intends to use the net proceeds from the offerings for general corporate purposes, which may include, among other things, repaying a portion of outstanding indebtedness and funding working capital. Teekay expects to close both offerings on January 26, 2018, subject to the satisfaction of customary closing conditions.\nThis press release is being issued pursuant to Rule 135c under the Securities Act, and does not constitute an offer to sell, or the solicitation of an offer to buy, these securities (including the shares of Teekay’s common stock into which the Convertible Notes are convertible), nor will there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale is not permitted. Any offers of the Convertible Notes will be made only to qualified institutional buyers in reliance on Rule 144A under the Securities Act by means of a private offering memorandum.\nThe statements in this press release that are not historical facts may be forward-looking statements. These forward-looking statements involve risks and uncertainties that could cause the outcome to be materially different. These risks and uncertainties include, but are not limited to, those discussed in Teekay’s public filings with the SEC. Teekay undertakes no obligation to revise or update any forward looking statements, unless required to do so under the securities laws.\nAbout Teekay\nTeekay Corporation operates in the marine midstream space through its ownership of the general partner and a portion of the outstanding limited partner interests in Teekay LNG Partners L.P. (NYSE:TGP) and an interest in the general partner and a portion of the outstanding limited partner interests in Teekay Offshore Partners L.P. (NYSE:TOO). In addition, Teekay has a controlling ownership interest in Teekay Tankers Ltd. (NYSE:TNK) and directly owns a fleet of vessels. The combined Teekay entities manage and operate approximately 210 liquefied gas, offshore, and conventional tanker assets.\nTeekay’s common stock is listed on the New York Stock Exchange where it trades under the symbol “TK”.\nFor Investor Relations\nenquiries contact:\nRyan Hamilton\nTel: +1 (604) 609-2963\nSource:Teekay Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/f5973b34-2b94-41cc-8f32-3a21a56e0546"], "published": "2018-01-24T16:46:00.000+02:00", "crawled": "2018-01-24T16:55:21.027+02:00", "highlightTitle": ""}