{"organizations": [], "uuid": "e3d28908bfdcd6f41b6f759b8c1a42f7bef8cce3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225297626&w=1200&r=LYNXMPEE0O1QR", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/britain-eu-davis/offering-brighter-future-uks-davis-tries-to-convince-on-eu-transition-idINKBN1FE37J", "country": "US", "domain_rank": 408, "title": "Offering brighter future, UK's Davis tries to convince on EU transition", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:49:00.000+02:00", "replies_count": 0, "uuid": "e3d28908bfdcd6f41b6f759b8c1a42f7bef8cce3"}, "author": "", "url": "https://in.reuters.com/article/britain-eu-davis/offering-brighter-future-uks-davis-tries-to-convince-on-eu-transition-idINKBN1FE37J", "ord_in_thread": 0, "title": "Offering brighter future, UK's Davis tries to convince on EU transition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Britain will on Friday demand the freedom to sign trade deals during its post-Brexit transition period, as Prime Minster Theresa May seeks to quell a mounting dispute in her party over future ties with Europe.\nBrexit minister David Davis will set out the government’s position on a transition period in a speech, looking to offer something for both those who want to keep close ties with the EU after leaving and those who want a more radical break.\nThe balancing act designed to appease both business and Brexiteers is a taste of things to come for a weakened May after internal divisions in her party spilled out into the open.\nOn Thursday, finance minister Philip Hammond was rebuked by May’s office after he said he hoped Britain would diverge from the EU only “very modestly” after Brexit. He spoke hours before the head of a hardline group of Brexiteer lawmakers urged May to stop accepting negotiating terms set by the EU.\n“Of course maintaining access to each other’s markets on current terms means we will replicate the effects of the EU customs union during the implementation period,” Davis will say in a speech in northeastern England.\n“But participating in a customs union should not preclude us from formally negotiating - or indeed signing - trade agreements,” he will say, while adding that any such deals could not enter into force until the transition period has ended.\nThere is little distance between Britain and the EU to overcome to agree the transitional deal, which will give the two sides time to prepare for the far-ranging impact of the end of more than 40 years of union.\nThe EU is willing to be flexible on the duration and other terms of a Brexit transition period, which could include letting London sign trade deals, according to a document due to be formally endorsed by EU ministers on Monday.\nBut May, who gambled on a snap election last year that lost her party its majority in parliament, is facing pressure from multiple angles: pro-EU lawmakers, hardline Brexiteers, and another contingent who question her leadership credentials and criticise a ‘dull dull dull’ domestic agenda.\nSeveral newspaper reports have said the number of ‘No Confidence’ letters is approaching the threshold of 48 required to trigger a leadership contest. The actual number is not made public by the party committee which holds them.\nHARD OR SOFT Finance minister Hammond sparked a row on Thursday when he spelled out his hopes for Brexit, prompting a backlash from eurosceptics who forced him to clarify that he still backed the country’s withdrawal from the EU single market and customs union.\nHammond’s remarks earned him a stiff rebuke from May’s office who, wary of the need to keep senior Brexiteers happy, said the changes Britain was planning to undergo could not be described as “very modest”.\nNevertheless, the plan to change little of the current relationship after Britain formally leaves on March 29, 2019, is fuelling anger among Brexit campaigners, who fear their mantra of “taking back control” is being sold out.\nOn Wednesday, a lawmaker from May’s Conservative Party, Jacob Rees-Mogg, accused Davis of allowing Britain to become a “vassal state” of the EU by paying into the bloc and adhering to its laws during transition.\nRees-Mogg, who heads a hardline group of pro-Brexit Conservative lawmakers which could have enough members to topple May, later repeated his warning saying Britain must stop accepting negotiating terms set by the EU.\n“This is no way to negotiate and it is no way for this country to behave,” Rees-Mogg said in a speech on Thursday.\nThe febrile mood in the party is likely to linger for May, who has struggled to keep her divided lawmakers united over everything from transition, to the future relationship, to the so-called Brexit dividend - the funds that will be freed up when Britain stops paying into EU coffers.\nBut Davis will try to persuade them that the future relationship he is pressing for is well worth the wait.\n“As an independent country, no longer a member of the European Union - the United Kingdom will once again have its own trading policy,” Davis will say.\n“For the first time in more than 40 years, we will be able to step out and sign new trade deals with old friends, and new allies, around the globe.”\nAdditional reporting by William James; Editing by Janet Lawrence\n ", "external_links": [], "published": "2018-01-26T00:49:00.000+02:00", "crawled": "2018-01-26T01:21:37.015+02:00", "highlightTitle": ""}