{"organizations": [], "uuid": "088277dffa44a599e18f89011b7543e38ee66ae5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-france-centralafrica-justice/magistrates-dismiss-sex-abuse-case-against-french-soldiers-in-africa-idUKKBN1F423O", "country": "US", "domain_rank": 408, "title": "Magistrates dismiss sex abuse case against French soldiers in Africa", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T23:01:00.000+02:00", "replies_count": 0, "uuid": "088277dffa44a599e18f89011b7543e38ee66ae5"}, "author": "", "url": "https://uk.reuters.com/article/uk-france-centralafrica-justice/magistrates-dismiss-sex-abuse-case-against-french-soldiers-in-africa-idUKKBN1F423O", "ord_in_thread": 0, "title": "Magistrates dismiss sex abuse case against French soldiers in Africa", "locations": [], "entities": {"persons": [{"name": "elysee gamon", "sentiment": "none"}], "locations": [{"name": "africa", "sentiment": "none"}, {"name": "bangui", "sentiment": "none"}, {"name": "africa    paris", "sentiment": "none"}, {"name": "central african republic", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 4:10 PM / Updated 43 minutes ago Magistrates dismiss sex abuse case against French soldiers in Africa   \nPARIS (Reuters) - French magistrates have dismissed a case brought against a group of French soldiers accused of sexually abusing children while on deployment in the Central African Republic in 2013-2014, a judicial source said on Monday. \nParis prosecutors called last year for the case to be dismissed because some of the testimony was deemed inconsistent and some elements could not be confirmed, even if they could not exclude that abuses took place. \nThe decision was met with frustration in Central African Republic’s capital, Bangui, where repeated allegations of sexual misconduct have helped fuel anger towards French and U.N. troops deployed there. \n“Our government must do its job and judge these acts here, because they were committed on Central African territory, even if the case has been abandoned in France,” said Elysee Gamon, 52. “No one is above the law.” \nThe country’s justice minister was not immediately available for comment. \nThe accusations emerged in April 2015 after the leak of an internal U.N. document containing the testimony of six children who said they were sexually abused by French soldiers in exchange for rations while at a displacement camp in Bangui. \nThe abuse was alleged to have taken place between December 2013 and June 2014 after France intervened in its former colony to stem violence between Christian militias and largely Muslim Seleka rebels. \nAccording to the leaked U.N. report, at least 13 French soldiers, two from Equatorial Guinea and three from Chad were implicated in the abuse. \nThe then French president, Francois Hollande, promised to show no mercy if the allegations were confirmed. \nThe French soldiers were not operating under U.N. command at the time. A later U.N. mission, known as MINUSCA, has been accused of widespread misconduct. \nECPAT, an organisation that campaigns against the sexual exploitation of children, told Reuters it did not rule out the possibility of appealing the magistrates’ decision, an option that was supported by some Bangui residents. \n“The victims are still young boys and girls who are living with the after-effects,” said Anne Gaelle Mandjou, 31. “(The soldiers) must be judged. The lawyers must appeal this decision in the name of the victims.” Reporting by Simon Carraud; Additional reporting by Crispin Dembassa-Kette in Bangui; Editing by Joe Bavier and Alison Williams", "external_links": [], "published": "2018-01-15T23:01:00.000+02:00", "crawled": "2018-01-15T23:36:52.047+02:00", "highlightTitle": ""}