{"organizations": [], "uuid": "6835b24c260d29743ea53b8a05af5395207fd5ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222158579&w=1200&r=LYNXMPEE0E10F", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-russia-economy-gdp/russian-economy-suddenly-shrinks-in-november-idUSKBN1F41V1", "country": "US", "domain_rank": 408, "title": "Russian economy suddenly shrinks in November", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.054, "site_type": "news", "published": "2018-01-15T22:29:00.000+02:00", "replies_count": 0, "uuid": "6835b24c260d29743ea53b8a05af5395207fd5ef"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-russia-economy-gdp/russian-economy-suddenly-shrinks-in-november-idUSKBN1F41V1", "ord_in_thread": 0, "title": "Russian economy suddenly shrinks in November", "locations": [], "entities": {"persons": [], "locations": [{"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - Russia’s economy unexpectedly contracted in November, hit by a drop in industrial production, the economy ministry said on Monday.\nGross domestic product shrank 0.3 percent year on year in November, the economy ministry said, contrasting with analysts’ consensus call for a 1.5 percent growth.\nRussia’s oil-dependent economy was on the mend in 2017 after two years of recession, triggered by a sharp drop in global commodity prices as well as sanctions imposed by Western countries against Moscow for its role in the Ukrainian crisis.\nIn November, GDP was dragged down by the industrial sector where output contracted 3.6 percent compared with a year ago.\nThe economy ministry said it blamed the weaker industrial output on the global agreement of major oil producers, including Russia, to limit crude production in order to prop up commodity prices.\nThe ministry also said the industrial output sank because of the warm weather, which pressured demand for natural gas on either domestic and foreign markets.\nNovember’s contraction in GDP after a 1.0 percent growth in year-on-year terms in October prompted the economy ministry to revise GDP growth figures for the whole of 2017.\nThe ministry said on Monday the economy grew by 1.4-1.8 percent in 2017. Ahead of November’s contraction, Economy Minister Maxim Oreshkin pledged the economy would grow by at least 2.2 percent that year.\nNow the ministry expects economic growth pace to pick up in 2018 to around 2 percent, with inflation to stay below the central bank’s target of 4 percent if there are no weather shocks.\nIn January, inflation is seen staying at record lows between 2.3 and 2.5 percent, the economy ministry said.\nLow inflation would give the central bank room for further rate cuts. The central bank said last month as it chopped the key rate to 7.75 percent from 8.25 percent it expected inflation to return back to the 4 percent target by the end of 2018.\nReporting by Polina Nikolskaya; Editing by Andrey Ostroukh\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T22:29:00.000+02:00", "crawled": "2018-01-15T16:47:48.000+02:00", "highlightTitle": ""}