{"organizations": [], "uuid": "66e1ba1e821c541052d5e4c18d2673f888eb366d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-retireup-acquires-reppro-creating-a-powerhouse-digital-retirement-planning-solution.html", "country": "US", "domain_rank": 767, "title": "RetireUp Acquires RepPro, Creating a Powerhouse Digital Retirement Planning Solution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-11T16:30:00.000+02:00", "replies_count": 0, "uuid": "66e1ba1e821c541052d5e4c18d2673f888eb366d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-retireup-acquires-reppro-creating-a-powerhouse-digital-retirement-planning-solution.html", "ord_in_thread": 0, "title": "RetireUp Acquires RepPro, Creating a Powerhouse Digital Retirement Planning Solution", "locations": [], "entities": {"persons": [{"name": "michael roth", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 11, 2018 /PRNewswire/ -- RetireUp , a retirement planning software for financial advisors, today announced the acquisition of their strategic partner, RepPro , a smart forms and digital business execution platform. This acquisition comes on the heels of the companies' latest joint endeavor, the launch of RetireUp Pro , an end-to-end retirement income planning platform that elevates the client experience from start to finish, while helping advisors accelerate their business. The joint company will assume the RetireUp brand, headquartered in Chicago, IL.\n\"RetireUp was created to bring the complexities of retirement planning to life in a simple and engaging way so the client and the advisor can work together, on the same side of the table,\" said RetireUp President and Chief Sales Officer, Michael Roth. \"When we were introduced to RepPro, there was an automatic synergy between the functionality of the two platforms, as well as the mission both companies shared of making retirement planning more accessible for people and more profitable to advisors. We're incredibly proud about this partnership and believe that RepPro's best-in-class software will continue to improve the workflow at every stage of our advisors' planning process, as we've already seen with our RetireUp Pro product – enabling advisors to allocate valuable time back to serving their clients.\"\nFounded in 2012 by a team of financial advisors, RetireUp serves thousands of financial advisors across the nation. The platform is a comprehensive, web-based retirement planning tool which uses engaging charts and graphs to transform complex financial concepts into easy to understand, \"big-picture\" visuals that invite clients to become active participants in their own financial futures –creating personalized income plans within 30 minutes.\nUsers of RetireUp Pro have full access to RepPro's automated smart forms and business logic, which uses powerful data integration, and a fully automated filing system to expedite administrative tasks from start to finish while reducing human error. As a result of the acquisition, Patrick Kelly, RepPro Co-Founder and CEO , will assume the role of Executive Vice President, Business Development of RetireUp.\n\"Joining RetireUp is an exciting next chapter for RepPro,\" said Kelly. \"The two technologies fit seamlessly together to create the end-to-end business and client solution that advisors have been searching for– especially as they strive to provide scale and next-level client service to compete in the growing marketplace. After launching RetireUp Pro and seeing the overwhelmingly positive response from distributors and their advisors, we're excited to see what's next for RetireUp and the impact we can make together.\"\nFor information about RetireUp or to request a demo, visit www.retireup.com . For media inquiries, contact retireuppro@ficommpartners.com .\nAbout RetireUp\nRetireUp transforms client conversations into the centerpiece of the Retirement Income Story© - with compelling discussions around the full picture of defined income (Social Security, variable annuities, fixed index annuities, pensions) and other assets. RetireUp's web based tool sets itself apart with a focus on the distribution phase of retirement, the ability to model annuity and insurance products, and an engaging interface. The tool provides a useful balance between basic retirement calculators and complicated retirement planning tools. RetireUp works with enterprises, registered representatives, independent financial advisors and RIAs. For more information go to www.retireup.com .\nAbout RepPro\nRepPro was designed to eliminate the headaches, hassles, and inefficiencies that exist with current processing methods. The platform takes the entire transition process online and creates a system that significantly reduces time and errors. Store your clients' information, fill out and execute their plan, and in the future, accessing a client's information and status is just a few clicks away. For more information go to www.reppro.co .\nMedia Contact:\nOlivia Gagnon\nFiComm Partners\nO: (917) 636-4809\nOlivia.Gagnon@FicommPartners.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/retireup-acquires-reppro-creating-a-powerhouse-digital-retirement-planning-solution-300581208.html\nSOURCE RetireUp", "external_links": ["http://www.prnewswire.com/news-releases/retireup-acquires-reppro-creating-a-powerhouse-digital-retirement-planning-solution-300581208.html", "http://www.retireup.com/", "http://www.retireuppro.com/", "http://www.reppro.co/"], "published": "2018-01-11T16:30:00.000+02:00", "crawled": "2018-01-11T18:50:34.062+02:00", "highlightTitle": ""}