{"organizations": [], "uuid": "75112314be24309fabee9185f9ca4f2f04e58331", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222228549&w=1200&r=LYNXMPEE0E1EB", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-mun-stk-mkhitaryan/mkhitaryan-left-out-of-united-squad-amid-sanchez-swap-reports-idUKKBN1F42JU", "country": "US", "domain_rank": 408, "title": "Mkhitaryan left out of United squad amid Sanchez swap reports", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T22:06:00.000+02:00", "replies_count": 0, "uuid": "75112314be24309fabee9185f9ca4f2f04e58331"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-mun-stk-mkhitaryan/mkhitaryan-left-out-of-united-squad-amid-sanchez-swap-reports-idUKKBN1F42JU", "ord_in_thread": 0, "title": "Mkhitaryan left out of United squad amid Sanchez swap reports", "locations": [], "entities": {"persons": [{"name": "sanchez", "sentiment": "negative"}, {"name": "mkhitaryan", "sentiment": "negative"}, {"name": "alexis sanchez", "sentiment": "none"}, {"name": "simon evans", "sentiment": "none"}, {"name": "arsene wenger", "sentiment": "none"}, {"name": "henrikh mkhitaryan", "sentiment": "none"}], "locations": [{"name": "manchester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "old trafford", "sentiment": "none"}], "organizations": [{"name": "united", "sentiment": "negative"}, {"name": "manchester city", "sentiment": "none"}, {"name": "arsenal", "sentiment": "none"}, {"name": "stoke city", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "burnley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 8:10 PM / Updated 16 minutes ago Mkhitaryan left out by United as City drop Sanchez interest Simon Evans 3 Min Read \nMANCHESTER, England (Reuters) - Manchester United midfielder Henrikh Mkhitaryan was left out of the squad to face Stoke City in the Premier League on Monday amid reports he may be part of negotiations to bring Arsenal forward Alexis Sanchez to Old Trafford. Soccer Football - Premier League - Manchester United vs Burnley - Old Trafford, Manchester, Britain - December 26, 2017 Manchester United's Henrikh Mkhitaryan during the warm up before the match REUTERS/Andrew Yates \nBritish media have reported that United are attempting to bring Chilean Sanchez, a long-term target of rivals Manchester City, to the club during the January transfer window -- six months before his contract at Arsenal runs out. \nNeither United nor City have made public statements about the suggested deal while Arsenal manager Arsene Wenger has said Sanchez is “half in, half out” of the London club. \nOn Monday, the Manchester Evening News reported that City had decided to drop their interest in the Chilean after meetings with the club to discuss the financial aspects of the deal. \nWhile City manager Pep Guardiola, who coached Sanchez at Barcelona, was keen to add the 29-year-old to his squad, his wage demands and transfer fee were considered excessive by the club given he is out of contract at the end of the season, the paper said. \nSome media reports said Arsenal want to sign Mkhitaryan, 28, in part-exchange for Sanchez and while United manager Jose Mourinho did not confirm that directly, he said the Armenian’s omission from his lineup reflected doubts over his future. \n“I would lie if I said it was a pure tactical decision. It was just a choice of the players that we know, in this moment, they have 100 percent their heads in Manchester United,” Mourinho told Sky Sports before the Stoke game at Old Trafford. \n“I don’t think it’s easy for a player to play when there are doubts about his future. It’s added pressure that a player doesn’t need, so I think it’s the best for him and for us, while the doubt is in the air, to protect him,” he added. \nSanchez was left out of Arsenal’s squad for their 2-1 defeat at Bournemouth on Sunday, with Wenger saying a decision on the Chilean’s future was “imminent”. \n“Yes (it’s imminent). Don’t read too much in it because even I don’t know which way it will go,” said the Frenchman. \n“He’s being vague at the moment. The situation is not completely decided one way or the other, so I left him at home.” Reporting by Simon Evans; Editing by Ken Ferris and Pritha Sarkar", "external_links": [], "published": "2018-01-15T22:06:00.000+02:00", "crawled": "2018-01-15T22:24:32.011+02:00", "highlightTitle": ""}