{"organizations": [], "uuid": "2cfd39f6e8b4babba2baa247eae1068a18e254e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221297483&w=1200&r=LYNXMPEE0B02T", "site_section": "http://feeds.reuters.com/reuters/INlifestyle\r", "section_title": "Reuters: Lifestyle", "url": "https://in.reuters.com/article/us-usa-lynx/canada-lynx-no-longer-threatened-by-extinction-u-s-wildlife-agency-idINKBN1F1043", "country": "US", "domain_rank": 408, "title": "Canada lynx no longer threatened by extinction: U.S. wildlife agency", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T03:15:00.000+02:00", "replies_count": 0, "uuid": "2cfd39f6e8b4babba2baa247eae1068a18e254e7"}, "author": "", "url": "https://in.reuters.com/article/us-usa-lynx/canada-lynx-no-longer-threatened-by-extinction-u-s-wildlife-agency-idINKBN1F1043", "ord_in_thread": 0, "title": "Canada lynx no longer threatened by extinction: U.S. wildlife agency", "locations": [], "entities": {"persons": [{"name": "jennifer strickland", "sentiment": "none"}, {"name": "laura zuckerman", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "whistler", "sentiment": "none"}, {"name": "wyo.", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "pinedale", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "wildlife service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 1:11 AM / in 17 hours Canada lynx no longer threatened by extinction: U.S. wildlife agency Laura Zuckerman 3 Min Read \nPINEDALE, Wyo. (Reuters) - The Canada lynx, a wild cat found in just a handful of mostly western U.S. states as well as Canada, no longer needs federal protection from extinction in the Lower 48 states, U.S. wildlife officials said on Thursday, sparking an outcry from conservationists. FILE PHOTO: A lynx climbs a hill after crossing the finish area during the first training run for the men's Downhill race of the Vancouver 2010 Winter Olympics in Whistler, British Columbia, February 10, 2010. REUTERS/Leonhard Foeger/File Photo \nThe finding is one step in a process that will see the U.S. Fish and Wildlife Service formally propose removing Canada lynx from the federal endangered and threatened species list. There is no timeline for when such a plan would be floated, agency spokeswoman Jennifer Strickland told Reuters in an email. \nConservationists said it was mystifying how the Trump administration determined the lynx has recovered and should be delisted since the Fish and Wildlife Service doesn’t know how many of the wild cats there are where they are protected in the Rocky Mountains and elsewhere. \nConservationists say stripping protections from Canada lynx, listed in 2000 in the Lower 48 states, would lead to its demise where it is found in parts of Colorado, Idaho, Maine, Minnesota, Montana and Washington. The lynx is not considered imperiled where it is found in Alaska or Canada. \n“This spells disaster for lynx,” Michael Garrity, head of Alliance for the Wild Rockies, said by telephone. \nThe Montana-based Alliance is one of several conservation groups that have sued to force the Fish and Wildlife Service to broaden restrictions on activities such as logging, mining and snowmobiling where they take place on public lands and are likely to harm lynx. \nThe reclusive wild feline, about twice the size of a domestic house cat, is known for its solitary nature, and disproportionately long legs and large paws that make it well-adapted to hunt in deep mountain snows for its preferred prey, the snowshoe hare. \nAlthough climate change, including decreased mountain snowpack, is “an important factor” affecting Canada lynx, they are not at risk of extinction from climate change in the foreseeable future, U.S. wildlife managers said in a statement. \nThe agency’s Strickland conceded that the number of Canada lynx in the Lower 48 was unknown but said efforts by federal land managers and others to lessen destruction or modification of lynx habitat have reduced threats. \n“We believe these measures have adequately protected the species to the point where it no longer needs protection,” she said in an email. Reporting by Laura Zuckerman; Editing by Sandra Maler", "external_links": [], "published": "2018-01-12T03:15:00.000+02:00", "crawled": "2018-01-12T03:29:35.014+02:00", "highlightTitle": ""}