{"organizations": [], "uuid": "fca32c3594e72561b43fc30635f64f9f0441c34d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221301042&w=1200&r=LYNXMPEE0B03L", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-global-oil/oil-dips-away-from-levels-last-seen-in-late-2014-but-analysts-say-market-supported-idUKKBN1F1057", "country": "US", "domain_rank": 408, "title": "Oil slips away from 2014 highs, though overall 2018 outlook remains firm", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T10:05:00.000+02:00", "replies_count": 0, "uuid": "fca32c3594e72561b43fc30635f64f9f0441c34d"}, "author": "", "url": "https://uk.reuters.com/article/us-global-oil/oil-dips-away-from-levels-last-seen-in-late-2014-but-analysts-say-market-supported-idUKKBN1F1057", "ord_in_thread": 0, "title": "Oil slips away from 2014 highs, though overall 2018 outlook remains firm", "locations": [], "entities": {"persons": [], "locations": [{"name": "huntington beach", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "min read  singapore", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 1:35 AM / Updated 5 minutes ago Oil slips away from 2014 highs, though overall 2018 outlook remains firm 4 Min Read \nSINGAPORE (Reuters) - Oil prices on Friday slipped away from December-2014 highs reached the previous day. FILE PHOTO: An offshore oil platform is seen in Huntington Beach, California, U.S. September 28, 2014. REUTERS/Lucy Nicholson/File Photo \nAlthough analysts and traders have been warning of the risks of a downward price correction since the start of the year, they point out that overall market conditions remain strong, largely due to ongoing production cuts led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia. \nU.S. West Texas Intermediate (WTI) crude futures CLc1 were at $63.34 a barrel at 0755 GMT, down 46 cents, or 0.7 percent, from their last settlement. WTI the day before rose to its strongest since late 2014 at $64.77. \nBrent crude futures LCOc1 were at $68.97 a barrel, down 29 cents, or 0.4 percent, from their last close. Brent also marked a December-2014 high the previous day, at $70.05 a barrel. \nTraders said relatively weak China December oil data had weighed on prices. China’s crude oil imports in December eased to 33.7 million tonnes, or 7.97 million barrels per day, versus 37.04 million tonnes in November, customs data showed on Friday. \nMeanwhile, its December oil products exports hit a record 6.17 million tonnes, as refiners churn out more fuel than even thirsty China can absorb. \nThis has contributed to a fall in Singapore refinery profit margins DUB-SIN-REF to below $6 per barrel this month, their lowest seasonal level in five years. \nAs a result, some refiners have already scaled back their output, reducing demand for feedstock crude. \nAn expected rise in U.S. oil production C-OUT-T-EIA, currently at 9.5 million bpd, to above 10 million bpd soon has also weighed on prices, traders said. \nDespite the lower prices on Friday, many analysts expect crude markets to remain firm this year, especially due to the OPEC-led production cuts. \n“OPEC has acted successfully to reduce the inventory overhang and demand growth remains robust in the short term,” said Sanjeev Bahl, analyst at Edison Investment Research in a 2018 outlook. \nThe production cuts started in January last year and are set to last through 2018. \n“There is potential for oil prices to move higher as inventories normalize,” Bahl said. \nU.S. commercial crude oil inventories C-STK-T-EIA fell almost 5 million barrels in the week to Jan. 5, to 419.5 million barrels. \nThat’s slightly below the five-year average of just over 420 million barrels. \nFuel price hedging company Global Risk Management said in its 2018 outlook that “the likelihood of elevated oil prices this year seems imminent”, largely due to the ongoing supply cuts led by OPEC and Russia as well as political risk especially in Iran, Venezuela and Libya. \nTaking into account price supportive and pressuring factors, a market survey of over 1,000 energy professionals conducted by Reuters in January showed crude oil price expectations clustered in a range of $60 to $70 per barrel for 2018. \n“Oil market fundamentals for 2018 remain robust even if the upside to Brent prices from here is not especially clear,” U.S. investment bank Jefferies said. Reporting by Henning Gloystein; Editing by Joseph Radford and Christian Schmollinger", "external_links": [], "published": "2018-01-12T10:05:00.000+02:00", "crawled": "2018-01-12T10:17:05.048+02:00", "highlightTitle": ""}