{"organizations": [], "uuid": "b726073dbc94575b2f7cc6414e76ab8dfc9bace3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226315747&w=1200&r=LYNXMPEE0S11W", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/usa-stocks/wall-street-set-to-dip-at-open-apple-likely-to-weigh-idINKBN1FI1R7", "country": "US", "domain_rank": 408, "title": "Wall Street set to dip at open, Apple likely to weigh", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:12:00.000+02:00", "replies_count": 0, "uuid": "b726073dbc94575b2f7cc6414e76ab8dfc9bace3"}, "author": "", "url": "https://in.reuters.com/article/usa-stocks/wall-street-set-to-dip-at-open-apple-likely-to-weigh-idINKBN1FI1R7", "ord_in_thread": 0, "title": "Wall Street set to dip at open, Apple likely to weigh", "locations": [], "entities": {"persons": [{"name": "tanya agrawal", "sentiment": "negative"}, {"name": "janet yellen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "fed", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nikkei", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 2:15 PM / Updated 4 minutes ago Apple leads Wall Street's retreat from record levels Tanya Agrawal 3 Min Read \n(Reuters) - Wall Street’s major indexes dropped on Monday, easing from record levels last week, weighed down by a slump in Apple after a media report added to concerns about demand for the iPhone X. \nApple fell as much as 2.6 percent in early trading after the Nikkei said the company will halve the production target for its flagship iPhone X this quarter. \nThe report added to growing concerns around weak sales of the $999 phone ahead of Apple’s quarterly results on Thursday. \nThe technology sector’s 0.75 percent drop weighed the most on the markets, but the biggest decliners were the defensive sectors utilities, real estate and telecommunications, all down more than 1 percent as U.S. 10-year treasury yields hit their highest since 2014. \nThe higher yields boost bank stocks, which were among the few gainers on a day when all 11 major S&P sectors were lower. \n“Today’s movement is just a bit of profit taking after last week and ahead of a very busy week,” said Randy Frederick, vice president of trading and derivatives for Charles Schwab in Austin, Texas. \nBeside a host of earnings reports, this week includes U.S. President Donald Trump’s State of the Union address, the Federal Reserve’s monetary policy meeting and the jobs report on Friday. \n“The earning season has been pretty good so far and guidance, for the most part, has been strong, which should support equities,” Frederick said. \nStrong earnings reports have pushed up analysts estimates for S&P 500 earnings growth to 13.2 percent, from 12 percent at the start of the year, according to Thomson Reuters data, helping send Wall Street on its best four-week run since 2016. \nAt 10:50 a.m. ET (1550 GMT), the Dow Jones Industrial Average was down 104.41 points, or 0.39 percent, at 26,512.3, the S&P 500 was down 13.65 points, or 0.475135 percent, at 2,859.22. \nThe Nasdaq Composite was down 34.43 points, or 0.46 percent, at 7,471.34. \nBut the blistering pace of the S&P’s 7 percent rally this year has also driven up the anxiety factor in the market, in a break with history. \nThe CBOE Volatility Index, the main gauge to measure fears of a near-term drop, was 13.23, its highest since Dec. 1. \nAmong stocks, AT&T Verizon and Sprint dropped between 1.1 percent and 1.6 percent on reports that the U.S. government was planning to build a super-fast 5G wireless network to counter the threat of espionage. \nDr Pepper Snapple Group soared as much as 32.4 percent to an all-time high after K-cup maker Keurig Green Mountain said it will buy the soda maker in a deal worth more than $21 billion. \nWynn Resorts fell 6.6 percent after the company said it is forming a committee to investigate sexual misconduct allegations against CEO Steve Wynn. \nDeclining issues outnumbered advancers on the NYSE by 2,340 to 562. On the Nasdaq, 1,809 issues fell and 1,009 advanced. Reporting by Tanya Agrawal; Editing by Savio D'Souza", "external_links": [], "published": "2018-01-29T16:12:00.000+02:00", "crawled": "2018-01-29T16:43:53.009+02:00", "highlightTitle": ""}