{"organizations": [], "uuid": "113a15ad6f56d2a2950f99fd091f39e49a3b8d5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/entertainment", "section_title": "Reuters: Entertainment News", "url": "https://www.reuters.com/article/us-israel-appelfeld/aharon-appelfeld-acclaimed-israeli-novelist-and-holocaust-survivor-dies-at-85-idUSKBN1ET0X5", "country": "US", "domain_rank": 408, "title": "Aharon Appelfeld, acclaimed Israeli novelist and Holocaust survivor, dies at 85", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T11:24:00.000+02:00", "replies_count": 0, "uuid": "113a15ad6f56d2a2950f99fd091f39e49a3b8d5d"}, "author": "", "url": "https://www.reuters.com/article/us-israel-appelfeld/aharon-appelfeld-acclaimed-israeli-novelist-and-holocaust-survivor-dies-at-85-idUSKBN1ET0X5", "ord_in_thread": 0, "title": "Aharon Appelfeld, acclaimed Israeli novelist and Holocaust survivor, dies at 85", "locations": [], "entities": {"persons": [{"name": "aharon appelfeld", "sentiment": "negative"}, {"name": "appelfeld", "sentiment": "none"}, {"name": "reuven rivlin", "sentiment": "none"}, {"name": "amos oz", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "army radio", "sentiment": "none"}, {"name": "nazis", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 9:27 AM / in 12 minutes Aharon Appelfeld, acclaimed Israeli novelist and Holocaust survivor, dies at 85 Reuters Staff 3 Min Read \nJERUSALEM (Reuters) - Aharon Appelfeld, a prolific Israeli novelist and Holocaust survivor whose works examined the lost world of European Jews and the new lives they pursued in Israel, died on Thursday. He was 85. \nWriting in Hebrew, the Romanian-born Appelfeld penned more than 40 books and was one of Israel’s most widely translated authors. \nAppelfeld’s “Blooms of Darkness”, the tale of an 11-year-old boy hidden from the Nazis by a prostitute, won the Independent Foreign Fiction Prize in London in 2012. Appelfeld was also awarded the State of Israel Prize for Literature in 1983 and was a Man Booker International Prize finalist in 2013. \nIsraeli President Reuven Rivlin, on Twitter, expressed sorrow “about the passing of our beloved writer”. \nAmos Oz, one of Israel’s most prominent novelists, said on Army Radio that Appelfed shied away from graphic depictions of the Holocaust, choosing instead to describe its effect on the lives of his characters. \n“Appelfeld never wrote about gas chambers, never wrote about executions, about mass graves, atrocities and experiments on human beings. He wrote about survivors before and after. He wrote about people who did not know what was about to happen to them and about people who already knew everything but hardly spoke about it,” Oz said on Army Radio. \n“He didn’t want, or he was unable, to write depictions of the horrors - he said that too. They are beyond the ability of human language to express them. You have to approach them indirectly, tiptoeing from afar,” said Oz, once Appelfeld’s student in a kibbutz. \nAppelfeld was a young boy when his mother was killed by the Nazis. He and his father were sent to a concentration camp in Transnistria in an area of Ukraine then under control of the German-allied Romanian forces. Aged 10 at the time, he escaped and spent three years hiding in forests in Ukraine. \n“I survived in the fields and forests. Sometimes I worked as a shepherd or taking care of broken-down horses,” he told The New York Times in 1986. “I lived with marginal people during the war - prostitutes, horse thieves, witches, fortune tellers. They gave me my real education.” \nAfter the war, he immigrated to Israel - he learned Hebrew beforehand - and when he was 28 he discovered that his father had survived and they were reunited in Israel. \n“Even though I spent time on kibbutzim that tried to change me, I did not change. I remained, basically, the Jewish refugee child who survived,” he said in an interview with Israel’s Haaretz newspaper in 2015. \nAmerican-Jewish author Philip Roth once described Appelfeld as a “displaced writer of displaced fiction, who made displacement and disorientation a subject uniquely his own”. \nWorks by Appelfeld translated into English include “Badenheim 1939” (1978), a tale set in a fictional Austrian resort on the eve of World War Two, and “The Immortal Bartfuss” (1988), a fictional portrait of a troubled survivor in Israel. Writing by Jeffrey Heller; Editing by Maayan Lubell and Gareth Jones", "external_links": [], "published": "2018-01-04T11:24:00.000+02:00", "crawled": "2018-01-04T11:42:25.002+02:00", "highlightTitle": ""}