{"organizations": [], "uuid": "b53c3e8ce93211afac8806b090bdee18f8eb84bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226283111&w=1200&r=LYNXMPEE0S0TH", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/uk-global-euro-speculators/commentary-music-still-playing-euro-speculators-still-dancing-idUKKBN1FI1DP", "country": "US", "domain_rank": 408, "title": "Commentary: Music still playing, euro speculators still dancing", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T14:18:00.000+02:00", "replies_count": 0, "uuid": "b53c3e8ce93211afac8806b090bdee18f8eb84bd"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-euro-speculators/commentary-music-still-playing-euro-speculators-still-dancing-idUKKBN1FI1DP", "ord_in_thread": 0, "title": "Commentary: Music still playing, euro speculators still dancing", "locations": [], "entities": {"persons": [], "locations": [{"name": "united states", "sentiment": "none"}], "organizations": [{"name": "chicago futures trading commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 12:08 PM / Updated 20 hours ago Commentary: Music still playing, euro speculators still dancing   Speculators have never been so bullish on the euro. \nYou might think at least a temporary reversal in the build up of their bets - and therefore the euro itself - is on the cards, but there’s little evidence of speculators and hedge funds blinking just yet. \nQuite the opposite. The euro is enjoying its best start to a year ever, and the momentum that has taken it above $1.25 is encouraging hedge funds and speculators to add to these bets, not reduce them. \nThe latest Chicago Futures Trading Commission data show that these types of investors increased their net long euro position to a new record 144,717 contracts in the week to Jan. 24 from 139,490 the week before. \nThat’s a cumulative bet worth $22.245 billion on the euro going up. A long position in an asset is effectively a bet it will appreciate in value, and a short position is a bet it will depreciate. \nThere’s logic to this. \nThe 19-nation euro zone economy is booming. It grew faster than the United States last year and market expectations around how the European Central Bank will end its super-easy stimulus and eventually raise interest rates are shifting rapidly. \nEuro zone bond yields are rising - the German five-year yield even popped above zero percent on Monday for the first time in more than two years. \nECB officials, including President Mario Draghi last week, have raised little objection to the euro’s ascent to its three-year peak. At the same time, U.S. Treasury Secretary Steven Mnuchin in Davos last week said “obviously a weaker dollar is good for us as it relates to trade and opportunities.” \nThis appeared to be a break from Washington’s long-standing mantra that a strong dollar is in U.S. interests, a position that President Donald Trump later attempted to reestablish. \nMnuchin’s remarks, the euro’s break above $1.25, Draghi’s news conference and Trump clarifying what Mnuchin had said were all after Tuesday, meaning any shift in CFTC speculators’ positions will be reflected in next week’s data. \nThese figures will be the last ones for January. As it stands right now, net long CFTC euro positions are up 52,569 from the previous month, meaning January is on course for the seventh biggest monthly increase in euro longs since the single currency’s launch in 1999. \nBut are speculators getting ahead of themselves? History shows that record levels in any financial market, whether it’s price, positioning or direction, more often than not flash a red warning sign that something is about to give. \n“When the music stops, in terms of liquidity, things will be complicated. But as long as the music is playing, you’ve got to get up and dance. We’re still dancing,” Citigroup’s then boss Chuck Prince said in July 2007. \nThe now infamous quote came back to haunt him when the U.S. subprime mortgage crisis bubbling under the surface erupted the following year with catastrophic consequences for the global banking system, financial markets and economy. \nThere are few - if any - similarities between the events of 2007-08 and the current “europhoria” sweeping across world currency markets. But if there is one, it’s this: the music is still playing and euuro bulls are still dancing. \n-- The opinions expressed here are those of the author, a columnist for Reuters -- \nBy Jamie McGeever", "external_links": [], "published": "2018-01-29T14:18:00.000+02:00", "crawled": "2018-01-30T10:58:38.038+02:00", "highlightTitle": ""}