{"organizations": [], "uuid": "b0008f36563adf4b5a4b48dd81a72acf7cf51d50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104927851-GettyImages-901440750.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/04/china-president-xi-jinping-orders-military-not-to-fear-death.html", "country": "US", "domain_rank": 767, "title": "China President Xi Jinping orders military not to fear death", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.028, "site_type": "news", "published": "2018-01-04T16:31:00.000+02:00", "replies_count": 0, "uuid": "b0008f36563adf4b5a4b48dd81a72acf7cf51d50"}, "author": "Justina Crabtree", "url": "https://www.cnbc.com/2018/01/04/china-president-xi-jinping-orders-military-not-to-fear-death.html", "ord_in_thread": 0, "title": "China President Xi Jinping orders military not to fear death", "locations": [], "entities": {"persons": [{"name": "xi jinping", "sentiment": "negative"}, {"name": "xi", "sentiment": "none"}, {"name": "mao zedong", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "hebei", "sentiment": "none"}], "organizations": [{"name": "xinhua", "sentiment": "none"}, {"name": "central military commission", "sentiment": "none"}, {"name": "people's liberation army", "sentiment": "none"}, {"name": "party", "sentiment": "none"}, {"name": "communist party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chinese President Xi Jinping addressed China's entire armed forces in a speech Thursday, in which he urged troops to show the \"fighting spirit of fearing neither hardship nor death.\"\nAt a first-of-its-kind meeting for the whole People's Liberation Army, Xi spoke to more than 7,000 armed officers in Hebei province of northern China, reported state news agency Xinhua . In other parts of the country, over 4,000 branches of the military also listened to Xi's address.\nAs reported by Xinhua, Xi commanded troops to: \"Create an elite and powerful force that is always ready for the fight, capable of combat and sure to win in order to fulfil the tasks bestowed by the Party and the people in the new era.\"\nTWEET\nXi occupies multiple roles as well as the presidency of China, and is chairman of the Central Military Commission. He is considered one of China's most powerful leaders in history, with \"Xi Jinping Thought\" written into the Communist Party's constitution last year alongside that of Mao Zedong.\nChina's flexing of its military muscles comes amid an international security crisis in the region: the nuclear threat from North Korea.\n\"It is not an exaggeration to say that the security environment surrounding Japan is at its severest since World War II,\" Japanese Prime Minister Shinzo Abe said Thursday at a news conference, as reported by Reuters .\nJapan's military spending has risen in recent years despite its pacifist constitution. Reuters reported that as of April 1 this year, Japan's defense budget will be 5.19 trillion yen ($46 billion), a 1.3 percent year-on-year rise.\nU.S. President Donald Trump struck a defiant tone in his latest tweet about North Korea Thursday, saying that he was \"firm, strong, and willing to commit (the U.S.') total 'might'\" to addressing the issue.\nTWEET\nTrump was criticized for a tweet earlier this week that boasted about the size of his \"nuclear button\" in comparison to that of North Korea's Supreme Leader Kim Jong Un .\nshow chapters Trump tweeting on North Korea doesn't move the dial at all: Control Risks 12 Hours Ago | 02:52 Trump's language in the latter tweet is \"frightening\", Charles Hecker, senior partner at consultancy Control Risks, told CNBC on Thursday. \"That sort of rhetoric doesn't move the dial on the crisis at all\" in descaling the threat from volatile North Korea, he added.\nChina's role in the North Korea nuclear crisis is misconstrued, Heckler said.\n\"One of the greatest misconceptions in this crisis is that China's going to fix it, and (that) this is China's problem\" he said, explaining that the Asian superpower did not want disruption on its borders.\nChina \"is not the place to look for the answer,\" he said.", "external_links": ["http://www.xinhuanet.com/english/2018-01/03/c_136870001.htm", "https://twitter.com/XHNews/status/948884736029741058", "https://www.reuters.com/article/us-northkorea-missiles-japan-abe/japan-faces-greatest-danger-since-world-war-due-to-north-korea-pm-idUSKBN1ET0IN", "https://twitter.com/realDonaldTrump/status/948879774277128197"], "published": "2018-01-04T16:31:00.000+02:00", "crawled": "2018-01-04T16:29:32.001+02:00", "highlightTitle": ""}