{"organizations": [], "uuid": "aad7d72a77c22b87309651c612c488b1aafd0e15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-fluvaccination-seniors-hospita/flu-deaths-may-be-less-likely-with-annual-vaccination-idUSKBN1FE2VL", "country": "US", "domain_rank": 408, "title": "Flu deaths may be less likely with annual vaccination", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T03:40:00.000+02:00", "replies_count": 0, "uuid": "aad7d72a77c22b87309651c612c488b1aafd0e15"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-health-fluvaccination-seniors-hospita/flu-deaths-may-be-less-likely-with-annual-vaccination-idUSKBN1FE2VL", "ord_in_thread": 0, "title": "Flu deaths may be less likely with annual vaccination", "locations": [], "entities": {"persons": [], "locations": [{"name": "canadi", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - Seniors who get a flu shot every year are less likely to be hospitalized with severe influenza infections or to die from them than those who get vaccinated only sporadically, a Spanish study suggests.\nResearchers looked at the effect of getting annual influenza vaccinations - in terms of preventing flu-related hospital admissions or death - in people age 65 or older admitted to 20 hospitals in Spain.\nCompared to people who got no vaccination during the current or three previous flu seasons, getting vaccinated in the current season and at least one previous season was 31 percent effective at preventing hospital admission for nonsevere cases of influenza, the study found.\nVaccination in the current season and at least one prior season was also 74 percent effective at preventing admission to hospital intensive care units (ICUs) for influenza and 70 percent effective at preventing deaths from the flu.\nBut having been vaccinated only in the current season didn’t appear to impact whether people would be hospitalized with severe influenza, researchers report in the Canadian Medical Association Journal.\n“These results show the importance of annual vaccination for preventing severe influenza in the older population,” said senior study author Dr. Jesus Castilla of the Navarra Public Health Institute and the Spanish Network of Epidemiology and Public Health in Pamplona, Spain.\nWhile the study didn’t explore why only one year of vaccination didn’t appear to stop severe flu cases, it’s possible that older adults didn’t get sufficient protection with a single dose of the vaccine because they have a weaker immune response due to chronic health problems, Castilla said by email.\n“Repeated vaccination acts as a booster for the immune response and seems to increase the protection,” Castilla said. “Influenza vaccination may have double effect in the older population, by the combination of influenza prevented and the reduced severity of influenza patients in whom vaccination did not prevent influenza illness.”\nThe study included 728 patients hospitalized with confirmed cases of influenza in the 2013-2014 and 2014-2015 flu seasons.\nResearchers matched 130 hospitalized patients with severe influenza to a control group of 333 similar people hospitalized for other reasons. They also matched 598 patients hospitalized with milder flu cases to a control group of 1,493 people hospitalized for other reasons.\nAmong hospital patients with influenza, vaccination in the current and any previous flu season reduced the risk of severe outcomes by 55 percent, the study found.\nOne limitation of the study is the potential for frail elderly patients to be less likely to be vaccinated and more likely to have illnesses of greater severity, the authors note. There might also be other, unknown differences in the behavior or health status of people who get vaccinated regularly and those who don’t.\nResults also may be different in other countries or in different flu seasons, and the effectiveness of the vaccine against circulating strains of influenza varies from one year to the next.\nEven so, the findings offer fresh evidence of the benefits of annual vaccination, said Laura Rosella, a researcher at the Dalla Lana School of Public Health at the University of Toronto who wasn’t involved in the study.\n“Demonstrating the benefit among older individuals who have the greatest (complications) from influenza, but also may have a different immune response, is important,” Rosella said by email.\n“This helps ease any concerns about repeat vaccinations, which is distinct from most of the existing evidence that evaluates a given vaccine for a particular year,” Rosella added. “It also reinforces the message on how important the annual influenza vaccinations are to reduce the burden caused by influenza.”\nSOURCE: bit.ly/2AVIrrr Canadian Medical Association Journal, online January 8, 2018.\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://bit.ly/2AVIrrr"], "published": "2018-01-26T03:40:00.000+02:00", "crawled": "2018-01-25T21:52:59.000+02:00", "highlightTitle": ""}