{"organizations": [], "uuid": "6f64e8772d75c4b5c040e7124a2ab4763f6fa94e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 28, "shares": 28, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/14/104840375-777F.1910x1000.PNG", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/boeing-earnings-q4-2017.html", "country": "US", "domain_rank": 767, "title": "Boeing Earnings Q4 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.778, "site_type": "news", "published": "2018-01-31T13:55:00.000+02:00", "replies_count": 0, "uuid": "6f64e8772d75c4b5c040e7124a2ab4763f6fa94e"}, "author": "Michael Sheetz", "url": "https://www.cnbc.com/2018/01/31/boeing-earnings-q4-2017.html", "ord_in_thread": 0, "title": "Boeing Earnings Q4 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "boeing", "sentiment": "negative"}, {"name": "airbus", "sentiment": "none"}, {"name": "u.s. international trade commission", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "bombardier", "sentiment": "none"}, {"name": "u.s. commerce department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Boeing shares surged 6 percent Wednesday after it posted fourth-quarter results that solidly beat analyst expectations, with strong performance across the board.\nThe defense and aerospace company gave an upbeat forecast for 2018. Boeing expects to deliver 810 to 815 commercial aircraft this year. That's an increase of at least 47 from last year, when it set a company record of 763.\nIn the quarter ended Dec. 31, Boeing said, its net income nearly doubled to $3.13 billion, or $5.18 per share, from $1.63 billion, or $2.59 per share, a year ago. Excluding nonrecurring items, and a gain from tax law changes, Boeing earned $3.06 per share. Analysts were forecasting earnings of $2.89 per share, according to Thomson Reuters.\nFourth-quarter revenue grew to $25.37 billion in 2017, a 9 percent increase from the same period last year.\nExpectations vs. results: EPS: $3.06 vs. $2.89 expected by Thomson Reuters Revenue: $25.37 billion vs. $24.69 billion expected by Thomson Reuters Boeing expects to bring in revenue of between $96 billion to $98 billion this year, while earning between $15.90 and $16.10 per share.\nEach of Boeing's three businesses saw an increase in its backlog of orders, bringing the company's total backlog up to $488 billion.\nThe commercial airplanes division booked another 912 orders, bringing its backlog of commercial aircraft orders to 5,864 — an all-time high. Boeing began production on its highly-anticipated 777X flight test plane with the long-range jet due to enter service in 2019. Orders for the company's backbone 737 MAX series also surpassed 4,300 at the end of the quarter.\nBoeing's defense business finished the year with $50 billion in orders on the books, with 40 percent coming from international customers. The division, which also includes Boeing's space and security businesses, delivered 42 aircraft and one satellite last quarter. Production problems in the third quarter had racked up $329 million in costs for the KC-46 tanker program but Boeing says it plans to deliver the first 18 aircraft to the Air Force this year.\nFinally, Boeing's global services business ended 2017 with $6 billion in orders. The company says it expects the business is worth at least $2.6 trillion over the next decade as maintenance and parts demand continues to rise for Boeing aircraft.\nTalks of a partnership with Embraer surfaced in December. Such a venture could see Boeing and the Brazilian airplane manufacturer cooperate to strengthen the former company's regional jet offerings. The companies cautioned in a joint release any deal would be subject to the Brazilian government, regulators and each companies' boards and shareholders.\n\"We're interested in a business combination because we see strong strategic value and clear synergy in a number of areas,\" CEO Dennis Muilenburg said of the Embraer talks during a conference call with investors.\nThe company's stock has risen 109 percent in the last 12 months, as of Monday's closing price of $340.82 per share.\nBoeing hit an all-time high of $360.97 per share in early trading Wednesday, beating its previous high of $352.23 hit on Jan. 17.", "external_links": [], "published": "2018-01-31T13:55:00.000+02:00", "crawled": "2018-01-31T13:55:39.000+02:00", "highlightTitle": ""}