{"organizations": [], "uuid": "6b1dcc91492353eb4d3ad1f25b861a5572153500", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF599_3hSpF_TOP_20180130061609.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7455.xml", "section_title": "WSJ.com: WSJD", "url": "https://www.wsj.com/articles/apple-to-curtail-iphone-x-production-in-the-face-of-weak-demand-1517312098", "country": "US", "domain_rank": 387, "title": "Apple to Cut iPhone X Production in the Face of Weak Demand", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T13:34:00.000+02:00", "replies_count": 0, "uuid": "6b1dcc91492353eb4d3ad1f25b861a5572153500"}, "author": "Yoko Kubota", "url": "https://www.wsj.com/articles/apple-to-curtail-iphone-x-production-in-the-face-of-weak-demand-1517312098", "ord_in_thread": 0, "title": "Apple to Cut iPhone X Production in the Face of Weak Demand", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "apple inc", "sentiment": "negative"}, {"name": "apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  3:59 p.m. ET Share \nThe high-end device may have been a swipe too far for most people Getty Images The iPhone X is Apple’s most expensive phone to date. Did the company go too far? \nBy Quentin Fottrell Personal Finance Editor \nThe iPhone X has a lot of new features to entice consumers, but many appear to be sticking with their old version. \nThe Wall Street Journal, citing people familiar with the matter, reported Tuesday that Apple is slashing the planned production of the gadget due to slow demand. “Apple plans to make about 20 million iPhone X handsets in the first quarter, down from roughly 40 million initially planned, according to a person with knowledge of Apple’s production goals,” the paper reported. The iPhone X was released on Nov. 3, 2017. \n“Apple has lost their way in the marketing of the iPhone X and iPhone 8,” said technology consultant Jeff Kagan. “It should have made both the iPhone 8 and iPhone X available at the same time.” \nSinolink Securities Co. analyst Zhang Bin, said the $1,000 price for the iPhone X may cut into first-quarter demand. “After the first wave of demand has been fulfilled, the market now worries that the high price of the iPhone X may weaken demand in the first quarter,” he wrote, according to Bloomberg . (Apple did not respond to request for comment.) \nDon’t miss: Why investors may have to worry about Apple shares in 2018 Apple has also had some negative press lately, with some reports alleging that Apple replaces old iPhones with slower batteries to reportedly save memory for other features. It also received a rare downgrade by analysts at Instinet. \nApple has also had some negative press lately, with some reports alleging that Apple replaces old iPhones with slower batteries. “The reasons are less malicious than some conspiracy theorists postulated, though the effect on the consumer experience remains the same,” Ryan Shrout, founder and lead analyst at Shrout Research, wrote on MarketWatch . \n“Apple was forced down this road after iPhones began shutting off unexpectedly during periods of heavy load, from simply opening an app or starting the camera,” he added. \nThe $1,000 is a big ask \nThe iPhone X has several new features to lure customers. You can use facial recognition technology to open the phone, it has wireless charging with a wireless charging mat and the camera is significantly better than previous iPhone models. Despite the new features, some experts believe Apple is pushing customers too far and too fast with increasingly expensive upgrades. Many people don’t even know whether to call it the ‘X’ or the ‘10.’ CEO Tim Cook says it’s called the latter to mark the 10th anniversary of the iPhone. However, there was no explanation as to what happened to the iPhone 9. \nThe $1,000 is a big ask. Customers are now paying as much for a phone as they have traditionally paid for a laptop — and most people are not upgrading their laptops every two years. The upgrade rate has extended along with the length of the installment plans: 30 months rather than 24, some studies suggest . There’s a limit to people’s excitement, said Julie Ask, an analyst with Forrester Research. “Maybe the upgrade rate won’t be as frequent.” \nDon’t miss: This 2007 iPhone will cost you 15 times more than the iPhone X \nPeople were confused about the branding. Apple AAPL, -0.59% is part technology company, part lifestyle brand, part social signifier and, yes, part luxury goods company. However, many people don’t even know whether to call it the “X” or the “10.” \nAt the iPhone’s launch, CEO Tim Cook said the iPhone X should be called the “10,” to mark the 10th anniversary of the first iPhone. However, there was no explanation as to what happened to the iPhone 9 . That was a rare piece of confusing over Apple branding. \nApple customers tend to be wealthier than Android users \nHow much is too much for a phone that costs as much as many laptops? “It’s bold,” Ask added. “It’s a bit audacious. But there’s evidence they serve a more affluent base than Android.” \nSome 77% of people with an annual income under $20,000 don’t own an Apple device versus 65% for people without an Android device in the same income bracket, according to data from Verto Analytics , a digital consumer analysis company. \nThe percentage of people without an Apple device drops to 39% for those earning $150,000 a year or more, but 59% still didn’t have an Android in that income bracket. Affluent Apple customers also spend more with their phones than Android . \nApple bulls believe in the iPhone X \n“Apple has not lost the plot, and the price tag will not hold back demand for iPhone X,” said Vincent Thielke, research analyst at research firm Canalys. “Apple will sell every unit of iPhone X it can make in the next six months. The iPhone is not a necessity, it is a luxury. Apple customers grow increasingly locked into its ecosystem, with apps, cloud storage, mobile pay, music subscriptions, and proprietary smartwatches.” \nThat growing ecosystem gives Apple many ways to sweeten the deal, just like car manufacturers entice customers with freebies. “If Apple wanted to lower the price of the device, it would find a way with free subscriptions to Apple Music and gift cards — just like General Motors does with zero financing.” ‘Apple is pushing the upper limits of consumer acceptance with a $1,000 iPhone X, but it remains relatively affordable to affluent city workers in places like New York or London who can purchase the device on monthly leasing plans.’ Neil Mawston, analyst at Strategy Analytics \nApple is careful to gradually raise prices \nWhat’s more, Apple has gradually prepared customers for the $1,000 psychological price point. Neil Mawston, analyst at Strategy Analytics, estimates the global average wholesale trade price of an iPhone has almost doubled to $650 in 2017 from $387 in 2007. “The $1,000 iPhone X is just another step in Apple’s long-term strategy to increase, not decrease, pricing,” he said. “Apple fans and critics complain about high iPhone pricing every year, but still go out and buy tens of millions of them.” \n“Apple is pushing the upper limits of consumer acceptance with a $1,000 iPhone X, but it remains relatively affordable to affluent city workers in places like New York or London who can purchase the device on monthly leasing plans,” Mawston said. “When paid off monthly in smaller chunks, the iPhone X feels much less expensive.” \nThose chunks remain somewhat consistent on Apple’s 30-month payment plan, or with two-year subsidized plans through carriers like AT&T T, +0.48% Verizon V, -1.03% and T-Mobile TMUS, +0.25%", "external_links": [], "published": "2018-01-30T13:34:00.000+02:00", "crawled": "2018-01-30T16:13:29.014+02:00", "highlightTitle": ""}