{"organizations": [], "uuid": "dd1a8c115f54acf190cccb1fcfefe5dfadf31c52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-the-everett-clinic-announces-senior-leadership-transitions.html", "country": "US", "domain_rank": 767, "title": "The Everett Clinic Announces Senior Leadership Transitions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:37:00.000+02:00", "replies_count": 0, "uuid": "dd1a8c115f54acf190cccb1fcfefe5dfadf31c52"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-the-everett-clinic-announces-senior-leadership-transitions.html", "ord_in_thread": 0, "title": "The Everett Clinic Announces Senior Leadership Transitions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EVERETT, Wash., Jan. 31, 2018 /PRNewswire/ -- The Everett Clinic, a DaVita Medical Group and division of DaVita Inc. (NYSE: DVA), announced that effective today its chief executive officer (CEO) and market president, Rick Cooper, will retire after more than 40 years of service and Dr. Aric Coffman will step in as CEO and market president.\nThis leadership transition follows The Everett Clinic's recent growth in the community, with the openings of clinics in Bothell and Woodinville .\n\"It has been my great privilege and honor to work in this community for the past four decades,\" said Rick Cooper, CEO and market president at The Everett Clinic. \"As a physician, Aric brings an important clinical perspective to market strategy and operations and I'm confident that I'm leaving my post at The Everett Clinic in good hands.\"\nIn his tenure, Rick helped establish the clinic as one of the most successful independent medical groups in the Pacific Northwest, earning a reputation for excellence in patient care and the introduction of innovative initiatives that help lower health care costs and price transparency for patients. In addition, Rick has also led the company to be nationally recognized, including Fortune magazine's designation as a Best Place to Work and the Puget Sound Business Journal's Top Corporate Philanthropist.\n\"Rick is an incredible example of what dedication to providing high quality, coordinated health care to a community can accomplish,\" said Aric Coffman, MD, market president at DaVita Medical Group New Mexico. \"I'm thrilled to follow in his footsteps at The Everett Clinic and continue the work toward growth and realizing our goal of being the essential out-patient focused healthcare system serving Snohomish and North King counties.\"\nAric has served in several DaVita Medical Group leadership roles within the past 12 years including residency program director, associate medical director of specialty care, senior medical director and chief medical officer. In addition, Aric was an influential part of DaVita Medical Group's recent brand launch in Albuquerque, New Mexico .\nThe Everett Clinic, a DaVita Medical Group | everettclinic.com\nFounded in 1924, The Everett Clinic, a DaVita Medical Group, is a nationally-recognized physician group known for providing high-quality healthcare services while lowering the overall cost of care. The Everett Clinic operates 30 care sites throughout Snohomish and King Counties caring for more than 330,000 patients and employing about 2,400 teammates, including almost 600 specialty and primary care providers. It serves patients through traditional doctor's offices, urgent care, lab services, imaging, hearing and vision centers, behavioral health, and cancer treatment. Consistently named as a Fortune Magazine \"100 Best Companies to Work For,\" The Everett Clinic staff and providers support the core value of doing what is right for each patient.\nAbout DaVita Medical Group\nDaVita Medical Group is a division of DaVita Inc., a Fortune 500® company, that operates and manages medical groups and affiliated physician networks in California, Colorado, Florida, Nevada, New Mexico, and Washington. A leading independent medical group in America, DaVita Medical Group has over two decades of experience providing coordinated, outcomes-based medical care in a cost-effective manner. DaVita Medical Group's teammates, employed clinicians and affiliated clinicians provided care for approximately 1.7 million patients. For more information, please visit DaVitaMedicalGroup.com .\nAbout DaVita Inc.\nDaVita Inc., a Fortune 500® company, is the parent company of DaVita Kidney Care and DaVita Medical Group. DaVita Kidney Care is a leading provider of kidney care in the United States, delivering dialysis services to patients with chronic kidney failure and end stage renal disease. As of September 30, 2017, DaVita Kidney Care operated or provided administrative services at 2,470 outpatient dialysis centers located in the United States serving approximately 196,000 patients. The company also operated 230 outpatient dialysis centers located in 11 countries outside the United States. DaVita Medical Group manages and operates medical groups and affiliated physician networks in California, Colorado, Florida, Nevada, New Mexico, Pennsylvania and Washington in its pursuit to deliver excellent-quality health care in a dignified and compassionate manner. DaVita Medical Group's teammates, employed clinicians and affiliated clinicians provided care for approximately 1.7 million patients. For more information, please visit DaVita.com/About .\nContact Information\nMedia:\nJessica Geurkink\n(720) 925-3184\nJessica.Geurkink@davita.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/the-everett-clinic-announces-senior-leadership-transitions-300590994.html\nSOURCE The Everett Clinic", "external_links": ["https://www.abqjournal.com/967418/one-on-one-with-aric-coffman-of-davita-medical-group.html", "http://www.everettclinic.com/", "http://www.heraldnet.com/news/everett-clinic-expanding-to-kirkland-bothell-woodinville/", "http://davita.com/about", "http://pressreleases.davita.com/2018-01-08-The-Everett-Clinic-Offers-Personalized-Care-to-Bothell-Community", "http://www.prnewswire.com/news-releases/the-everett-clinic-announces-senior-leadership-transitions-300590994.html", "http://www.davitamedicalgroup.com/"], "published": "2018-01-31T17:37:00.000+02:00", "crawled": "2018-01-31T18:37:22.026+02:00", "highlightTitle": ""}