{"organizations": [], "uuid": "3e8788fb376d30267a4117e89671a2cd8f23a10c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225205520&w=1200&r=LYNXMPEE0O1BK", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-che-conte/lack-of-forward-options-giving-conte-the-biggest-headache-idUKKBN1FE2FA", "country": "US", "domain_rank": 408, "title": "Lack of forward options giving Conte the biggest headache", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:33:00.000+02:00", "replies_count": 0, "uuid": "3e8788fb376d30267a4117e89671a2cd8f23a10c"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-che-conte/lack-of-forward-options-giving-conte-the-biggest-headache-idUKKBN1FE2FA", "ord_in_thread": 0, "title": "Lack of forward options giving Conte the biggest headache", "locations": [], "entities": {"persons": [{"name": "conte", "sentiment": "negative"}, {"name": "peter hall", "sentiment": "none"}, {"name": "michy batshuayi", "sentiment": "none"}, {"name": "alvaro morata", "sentiment": "none"}, {"name": "antonio conte", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}], "locations": [{"name": "brighton", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "norwich city", "sentiment": "none"}], "organizations": [{"name": "hove albion", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 37 PM / Updated 28 minutes ago Lack of forward options giving Conte the biggest headache Peter Hall 3 Min Read \nLONDON (Reuters) - Antonio Conte voiced his concerns over a lack of transfer activity at Chelsea after his side’s League Cup exit on Wednesday and it is the manager’s paucity of striking options that will be causing him most concern. \nChelsea are clearly not at crisis point as before their 2-1 semi-final second-leg defeat at Arsenal they were unbeaten in 12 games and are still in the Champions League and the FA Cup. \nBut a look at Chelsea’s forward resources and their lack of goals recently shows why Conte cut such a frustrated figure in the aftermath of the Arsenal loss. \nTake the 4-0 win over Brighton and Hove Albion on Saturday out of the equation and Chelsea have scored two goals in their last five games and two of the matches were against Championship side Norwich City. \nIn the absence of Alvaro Morata, Michy Batshuayi acted as an excellent attacking pivot in the victory over Brighton but it is clear Conte remains unconvinced by the Belgium international. \nBatshuayi was again dropped to the bench for the Arsenal clash and when Willian left the pitch early due to injury Conte turned to midfielder Ross Barkley, who had not played all season because of a hamstring injury. \nLeading marksman Morata’s goals have dried up. After six in his first six Premier League games, the Spaniard has scored four in his last 14 since picking up an injury in late September. \n“You expect him to be a little bit cooler in front of the goalkeeper,” former Chelsea forward Gianfranco Zola said after Chelsea’s 2-2 Premier League draw at Arsenal. “He needs to be a bit more ruthless.” \nUnless Conte deploys Eden Hazard as a striker, as he did against Arsenal on Wednesday, that is about it in terms of forward options. \n“We don’t have many players to make subs,” Conte said after the Arsenal loss. “My first task is to do my job and be a coach. I don’t have a big impact in the transfer market.” \nA host of names have been linked with a move to Stamford Bridge this transfer window, including West Ham United’s Andy Carroll and Stoke City’s Peter Crouch, but there have been no arrivals apart from Barkley. \nWithout new additions, Chelsea’s season may depend on whether Morata can rediscover his sharpness in front of goal. Reporting by Peter Hall, editing by Ed Osmond", "external_links": [], "published": "2018-01-25T18:33:00.000+02:00", "crawled": "2018-01-25T19:00:29.015+02:00", "highlightTitle": ""}