{"organizations": [], "uuid": "30673779ba6eb45d3b3b018f5ba0b31fd4f2c437", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226275322&w=1200&r=LYNXMPEE0S0RL", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/us-usa-cftc-arrests/u-s-authorities-due-to-make-arrests-in-futures-spoofing-probe-sources-idUKKBN1FI19J", "country": "US", "domain_rank": 408, "title": "U.S. authorities due to make arrests in futures 'spoofing' probe - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T13:35:00.000+02:00", "replies_count": 0, "uuid": "30673779ba6eb45d3b3b018f5ba0b31fd4f2c437"}, "author": "", "url": "https://uk.reuters.com/article/us-usa-cftc-arrests/u-s-authorities-due-to-make-arrests-in-futures-spoofing-probe-sources-idUKKBN1FI19J", "ord_in_thread": 0, "title": "U.S. authorities due to make arrests in futures 'spoofing' probe - sources", "locations": [], "entities": {"persons": [{"name": "michelle", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "federal bureau of investigation", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "u.s. department of justice", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "commodity futures trading commission", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "cftc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 11:33 AM / Updated an hour ago U.S. authorities due to make arrests in futures 'spoofing' probe: sources Michelle Price 3 Min Read \nWASHINGTON (Reuters) - U.S. authorities were set to arrest several people on Monday in connection with a federal investigation into so-called spoofing and manipulation in the U.S. futures market by three European banks, three people with direct knowledge of the matter told Reuters. \nThe individuals, some of whom had formerly been employed as traders by UBS ( UBSG.S ), Deutsche Bank ( DBKGn.DE ) and HSBC ( HSBA.L ), will be charged as part of a multi-agency probe by the Commodity Futures Trading Commission, or CFTC, the U.S. Department of Justice and the Federal Bureau of Investigation into the manipulative trading behavior, two of the sources said. \nReuters reported on Friday that the CFTC was set to announce it had fined UBS, Deutsche Bank and HSBC millions of dollars each to settle the regulator’s civil case against the banks for their role in the “spoofing” and manipulation, which was conducted across a range of futures products. \nSpokesmen for all three banks declined to comment on Friday. \nSpoofing, which is a criminal offense under the 2010 Dodd- Frank financial reform law, involves placing bids to buy or offers to sell futures contracts with the intent to cancel them before execution. By creating an illusion of demand, spoofers can influence prices to benefit their market positions. FILE PHOTO: Logos of Deutsche Bank AG are seen in Tokyo July 16, 2014. REUTERS/Toru Hanai/File Photo \nIn August, a U.S. appeals court upheld the conviction of former New Jersey-based high-speed trader Michael Coscia who was the first individual to be criminally prosecuted for spoofing. \nThis is the first time the CFTC, DOJ and FBI have worked together to bring both criminal and civil charges against multiple companies and individuals, sources said. \nThe bank investigations have been going on for more than a year, but the CFTC has pursued the charges against the traders as part of a more recent effort led by the agency’s head of enforcement, James McDonald, to hold individual employees accountable for corporate wrongdoing, two of the sources said. \nMcDonald, a former prosecutor in the Southern District of New York who was appointed to the CFTC role in March, has said he aims to achieve that by encouraging companies and staff to report their own wrongdoing and cooperate with investigators in return for more lenient penalties. \nA spokeswoman for the Justice Department declined to comment. A spokeswoman for the FBI did not respond to a request for comment. Reporting by Michelle Price; Editing by Peter Cooney", "external_links": [], "published": "2018-01-29T13:35:00.000+02:00", "crawled": "2018-01-29T14:30:09.001+02:00", "highlightTitle": ""}