{"organizations": [], "uuid": "84a8a9fb9d23089b136b4f488f646c6bc2f00932", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/11/104891350-RTR3KH14.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/blockchain-capital-partner-bitcoin-could-trade-over-50000-in-2018.html", "country": "US", "domain_rank": 767, "title": "Blockchain Capital partner: bitcoin could trade over $50,000 in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.208, "site_type": "news", "published": "2018-01-04T02:10:00.000+02:00", "replies_count": 0, "uuid": "84a8a9fb9d23089b136b4f488f646c6bc2f00932"}, "author": "Chloe Aiello", "url": "https://www.cnbc.com/2018/01/03/blockchain-capital-partner-bitcoin-could-trade-over-50000-in-2018.html", "ord_in_thread": 0, "title": "Blockchain Capital partner: bitcoin could trade over $50,000 in 2018", "locations": [], "entities": {"persons": [{"name": "bogart", "sentiment": "none"}], "locations": [{"name": "bogart", "sentiment": "none"}], "organizations": [{"name": "blockchain capital", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "15 Hours Ago | 06:15 \nOne of bitcoin's biggest bulls sees a $50,000 future for bitcoin in 2018. \nSpencer Bogart, a partner at Blockchain Capital, thinks the controversial cryptocurrency will continue to perform, as long as both retail and institutional investors get involved and stay there. \nOn the institutional side, there is only room to move up, according to Bogart. And surveys show growing interest in bitcoin ownership from retail investors, especially young ones. \n\"Institutional ownership is still effectively zero percent. There's a lot of room for upward movement here,\" Bogart said on CNBC's \"Fast Money.\" \"The drawbridges for institutional pools of capital have just been lowered.\" \nBogart admits bitcoin is still new, calling it a \"bit of an exotic product for institutional investors,\" but he is confident the popularity will eventually trickle down to these investors, even if they sit out a couple of rounds to focus on derivatives. \n\"If institutional players want to play in this market, they'll dip their toe in the water or wait on the sidelines to see if the products themselves function,\" Bogart said. \"This is a first round of product set that's going to evolve and mature and eventually become a deep market.\" \nBut much of Bogart's confidence comes from bitcoin's popularity among young adults. He referenced a Harris Poll for Blockchain Capital that found 19 percent of Americans and 32 percent of millennial Americans said they would invest in bitcoin in 5 years. \n\"When I think about what are likely good indicators of future technology trends, I pick younger demographics over older demographics every time,\" he said. \nIn the blockchain versus bitcoin debate, Bogart said it will still be important to focus on bitcoin in the coming year. But the verdict is out on the long-term value, so he'll keep investing in both, he said. \n\"There's certainly a thesis that suggests that a lot of the value accrues to the underlying protocols like bitcoin, ethereum, litecoin,\" he said. \"But I think that there is a lot of value accruing to the businesses built on top of these networks. The Ripples of the world, the Coinbases of the world, are worth a significant amount of capital right now.\" Chloe Aiello News Associate for CNBC.com Playing", "external_links": [], "published": "2018-01-04T02:10:00.000+02:00", "crawled": "2018-01-04T02:11:00.028+02:00", "highlightTitle": ""}