{"organizations": [], "uuid": "3c0a171276a2d76fb0884d68e6ad4b85fe06f7a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224724959&w=1200&r=LYNXMPEE0N0GF", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-israel-palestinians-politics/alienation-drives-young-palestinians-beyond-politics-idUSKBN1FD0L1", "country": "US", "domain_rank": 408, "title": "Alienation drives young Palestinians beyond politics", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T09:22:00.000+02:00", "replies_count": 0, "uuid": "3c0a171276a2d76fb0884d68e6ad4b85fe06f7a0"}, "author": "", "url": "https://www.reuters.com/article/us-israel-palestinians-politics/alienation-drives-young-palestinians-beyond-politics-idUSKBN1FD0L1", "ord_in_thread": 0, "title": "Alienation drives young Palestinians beyond politics", "locations": [], "entities": {"persons": [{"name": "miri", "sentiment": "negative"}, {"name": "nidal al-mughrabi", "sentiment": "negative"}, {"name": "berger", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "gaza", "sentiment": "none"}, {"name": "east jerusalem", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "hamas", "sentiment": "none"}, {"name": "fatah", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 7:23 AM / Updated 7 hours ago Alienation drives young Palestinians beyond politics Nidal al-Mughrabi , Miriam Berger 6 Min Read \nGAZA/JERUSALEM (Reuters) - Confrontations between young Palestinians and Israeli soldiers have taken on a life of their own since Palestinian leaders called for protests against Donald Trump’s decision to treat Jerusalem as Israel’s capital. \nWhile Hamas, Fatah and other groups call for a weekly show of strength on Fridays, dozens of stone-throwers turn out along the border between Gaza and Israel every day, even when, as last Friday, a protest is called off due to bad weather. \nSome wear the colors of the various factions vying to lead the drive for a Palestinian state with East Jerusalem as its capital, but others have no affiliation, a sign of alienation that makes the political situation more volatile. \n“I am not against any of the factions, but we are grown-ups and are intelligent and we see that the ongoing division is weakening us all,” said a 28-year-old protester, referring to a renewed standoff between the Islamist Hamas and secular Fatah. \nThe two groups have long been rivals and have failed to achieve any lasting unity agreement in years of off-and-on negotiations. Hamas seized control of the Gaza Strip from Fatah forces in 2007. \nConscious of the growing influence of the youth due to their ballooning numbers, both Hamas and Fatah have recently tried to court them, holding large, separate meetings in Gaza to convince them to back reconciliation. \nBut, as the daily scene on the border shows, young Palestinians are increasingly beyond reach, put off by a four-year stalemate in peace talks with Israel and little progress toward healing internal rifts. \nTheir growing frustration surfaces in social media criticism of their leaders that is met by with an increasingly authoritarian response. \nThe stone-throwers say the more alienated they feel, the greater the likelihood they will take to the streets to protest. \n“We are hungry and at home we have no electricity and our fathers have no jobs. This can’t bring about anything except an explosion,” said a 23-year-old unemployed history graduate who gave his name as Ahmed. \nAsked about the target of such an explosion, he said: “Against the Israeli occupation, because it bears prime responsibility for everything, even for the division between Hamas and Fatah.” \nPhoto essay reut.rs/2E2SwWz ELECTIONS? \nPalestinian politicians have agreed to hold long-delayed elections in both territories this year as part of moves to end the schism that led to Hamas seizing control of Gaza in 2007 from the Fatah-led Palestinian Authority based in the larger West Bank. \nWhether they will materialize is unclear. \nPalestinian security officials have over the past few years questioned many people, sometimes for weeks, about social media posts criticizing Fatah and Hamas, according to Palestinian human rights groups and New York-based Human Rights Watch. A protester holds a Palestinian flag as he poses for a photograph at the scene of clashes with Israeli troops near the border with Israel, east of Gaza City, January 19, 2018. REUTERS/Mohammed Salem \nIn Gaza, most complaints center on electricity shortages that date back 11 years, with both groups seen at fault. \nSlow unity efforts are another hot-button issue: some blame Hamas for balking at handing full control of Gaza to the Palestinian Authority while others criticize Fatah for retaining salary cuts in Gaza. \nFatah is also faulted for the fact that its engagement in peace talks with Israel has brought little progress toward a Palestinian state and for keeping aging leaders in place. \nPeople aged 15 to 29 make up a third of the population of the Israeli-occupied West Bank and partially blockaded Gaza strip and a disproportionate number of the many unemployed. \n“There is no party that represents me or that I can say ‘this party speaks for me,'” said Oula Jabara, a university student in the occupied West Bank aged 20, who was a child when Mahmoud Abbas was elected president in 2005. Slideshow (7 Images) \nAlmost three quarters of university students and 69 percent of all 18 to 22-year-olds want Abbas to resign, compared with 59 percent of Palestinians aged 50 and above, a December poll by the Palestinian Center for Policy and Survey Research showed. \nHasan Faraj, the Secretary General of Fatah’s Youth Movement, declined to provide membership numbers, calling it an internal matter. He said the movement remained relevant with “tens of thousands” of official members, and more affiliated. \nThe lack of transparency underscores a common complaint by young people that party leaders do not think they count. \nOf six people interviewed at protests against Trump’s Jerusalem move, none was prepared to say who they wanted to replace Abbas. \n“Whoever it is will just be like the last,” said Taha, a 33-year-old cook who declined to give his last name and wore a mask to avoid identification by Israeli authorities. \n“I don’t have faith in any of the parties.” \nIn the absence of political dialogue either within Palestinian factions or between them and Israel, many young Palestinians suffer in silence and some take to the streets. \nPalestinian uprisings erupted in 1987 and in 2000, the latter after the failure of U.S.-sponsored peace talks. A build-up of grievances could spark a new one, but it would likely take broad public support among Palestinians and involvement by factions to keep it going. \n“Non-affiliated youth may fuel an uprising, a short but aggressive one, but they can’t sustain it,” said Palestinian political analyst Akram Attallah. \nSixteen Palestinians and one Israeli have been killed in protests since Trump’s Dec. 6 announcement and hundreds of Palestinians have been injured, eight on the Gaza border on Friday alone, according to the territory’s health ministry. \nA 13-year-old boy on the border said he had been hit twice by rubber bullets. His mother had warned him a third hit could be fatal and his father had beaten him to try to keep him away. \n“I always find an excuse to slip out,” he said. “So what, I will be a martyr.” Editing by Jeffrey Heller and Philippa Fletcher", "external_links": [], "published": "2018-01-24T09:22:00.000+02:00", "crawled": "2018-01-24T09:57:53.010+02:00", "highlightTitle": ""}