{"organizations": [], "uuid": "94d17d28fde669d180c53ca6b43e15a463884afd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/23/reuters-america-update-1-iraqs-southern-oil-exports-fall-in-january-from-record.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-Iraq's southern oil exports fall in January from record", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T14:35:00.000+02:00", "replies_count": 0, "uuid": "94d17d28fde669d180c53ca6b43e15a463884afd"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/reuters-america-update-1-iraqs-southern-oil-exports-fall-in-january-from-record.html", "ord_in_thread": 0, "title": "UPDATE 1-Iraq's southern oil exports fall in January from record", "locations": [], "entities": {"persons": [], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "kirkuk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Southern exports in first 21 days of Jan dip 100,000 bpd\n* Northern exports steady at 320,000 bpd\n* Iraq plans to send small volume of Kirkuk to Iran in Jan (Adds comments from source, details)\nLONDON, Jan 23 (Reuters) - Oil exports from southern Iraq have fallen by 100,000 barrels per day (bpd) this month from a record high, according to shipping data and an industry source, as bad weather curbed shipments from OPEC's second-largest producer.\nSouthern Iraqi exports in the first 21 days of January averaged about 3.44 million bpd, according to shipping data tracked by Reuters and independent tracking by an industry source.\nThe fall suggests there is still no sign of extra supplies reaching the market from Iraq even though oil prices rallied to $70 a barrel for the first time since 2014, supported by an OPEC-led agreement to cut output.\nIraq says it is committed to the OPEC deal.\n\"We are showing a slight decline,\" the source who tracks Iraq's exports said. \"I'm sure they will ramp back up soon enough.\"\nLoading of some tankers in the month was delayed by high winds, shipping sources said. Such delays often occur at this time of year.\nIraq has been boosting exports from its southern terminals, which handle most exports to offset a halt in shipments from its northern Kirkuk oilfields in mid-October after Iraqi forces seized control of fields from Kurdish fighters.\nNorthern exports have averaged 320,000 bpd so far in January, compared with an estimated 310,000 bpd in December, according to shipping data and the industry source. That is far below levels of more than 500,000 bpd in some months of 2017.\nTotal exports from Iraq in January were 3.76 million bpd, down 90,000 bpd from December.\nNorthern exports could rise slightly if Iraq goes ahead with a plan to export Kirkuk oil to Iran before the end January. Oil Minister Jabar al-Luaibi said that initially about 30,000 bpd would be trucked to an Iranian refinery.\nOPEC, Russia and other producers are cutting output by about 1.8 million bpd until the end of 2018 in an effort to get rid of a global crude glut and support prices.\nIraq showed less compliance to the supply deal than its OPEC peers, such as Saudi Arabia and Kuwait, for much of 2017, but the drop in Kirkuk output boosted Iraqi and overall compliance.\n(Reporting by Alex Lawler; Editing by Editing by Edmund Blair)", "external_links": [], "published": "2018-01-23T14:35:00.000+02:00", "crawled": "2018-01-24T09:16:45.022+02:00", "highlightTitle": ""}