{"organizations": [], "uuid": "7dfcdbc4dcfde2adf3f33cbba621beef1e88e6d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-FY913_WR_whe_ZG_20171122164617.jpg", "site_section": "http://feeds.marketwatch.com/marketwatch/topstories?format=xml", "section_title": "MarketWatch.com - Top Stories", "url": "https://www.wsj.com/articles/where-should-you-live-in-retirement-1510542841", "country": "US", "domain_rank": 387, "title": "The Wall Street Journal: 9 questions to ask yourself before deciding where to retire", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:42:00.000+02:00", "replies_count": 0, "uuid": "7dfcdbc4dcfde2adf3f33cbba621beef1e88e6d9"}, "author": "", "url": "https://www.wsj.com/articles/where-should-you-live-in-retirement-1510542841", "ord_in_thread": 0, "title": "The Wall Street Journal: 9 questions to ask yourself before deciding where to retire", "locations": [], "entities": {"persons": [{"name": "chris ford", "sentiment": "negative"}, {"name": "dorian mintzer", "sentiment": "none"}, {"name": "chris kornelis", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " 42 a.m. ET Share \nMany people don’t give it enough thought Chris Ford \nBy Chris Kornelis \nIt’s one of the most basic questions people ask themselves when they start planning for retirement: Where am I going to live? \nIt’s also one of the most crucial questions, and one that, surprisingly, many people don’t give a lot of thought to. Sure, they ask themselves some cursory questions—especially about the weather and affordability. But they rarely delve very deeply, even though making the right choice can offer a greater chance of having a more fulfilling life. \n“People really need to figure out what they’re looking for,” says Dorian Mintzer, a Boston psychologist and co-author of “The Couple’s Retirement Puzzle.” “Often people don’t think about what kind of life they want. Do they want to do volunteer work? An encore career? Is that a factor in terms of where they live?” \nWith that in mind, here are nine questions people should ask themselves before they answer the big question about where. 1. What do you want to do? \nOK, it’s a basic question, but it’s one surprisingly few people ask themselves. They may have some superficial sense about where they want to live, without thinking first about what kind of life they want. \n“One of the great things about being in older age,” says Paul Irving, chairman of the Milken Institute Center for the Future of Aging, “is the opportunity to be truly honest with ourselves about what’s truly important to us. Not what you saw in a television commercial or a newspaper ad, but to think about what really matters to you and to your family and how you want to live the rest of your life.” \nYou might like: Retire Here, Not There — state by state \nYet that honesty isn’t easy, in part because of those television commercials and in part because what somebody wants in retirement may be totally different from what they believed they wanted when they were younger. \nMike Newes, a real-estate agent in Fort Myers, Fla., says he often sees couples start their retirements buying a home in one location. Then, two or three years later, they move somewhere else: closer to their children, closer to friends, a smaller house—something that supports the lifestyle they want in retirement. They waste a lot of time, and a lot of expense. \nPeople really don’t think about what they want to do with their retirement, he says. They think: “ ‘I want to not do this.’ But what do you want to do?” 2. Is Skype close enough to your grandchildren? \nThese days, thanks to technology, people thinking about retirement dismiss proximity: We can always FaceTime every day, they figure. \nBut they quickly discover that it doesn’t work out that way. Family, and especially children, aren’t as eager to tell the grandparents about their day, even if they can see them on their phones. \nAs a result, says Neil Brown, a certified financial planner at Burkett Financial Services in West Columbia, S.C., people often misjudge the distance they’re putting between themselves and their families. They think that between Skype, text messaging and “just jumping on an airplane,” they will remain close, he says. \nBert Sperling, the founder of BestPlaces.net—a website that studies and provides research on cities and places—says a real-estate agent recently told him that he sells the same homes to the same kinds of people every five or six years: retirees who want to stare at the ocean and have a place on the beach for family to visit. But after a few years, they discover that they don’t need to look at the ocean every day and their families are busy and don’t visit as often as they thought they would. \nSo before deciding on that first move, ask yourself: How likely is your family to stay put? People change jobs much more quickly today, and it isn’t uncommon for people to move to be near their children and grandchildren—only to have the children pack up their families shortly afterward. In other words: Are you willing to be the trailing grandparents? 3. Are you open to renting? \nFinancial advisers say it can be hard for retirees who have spent their lives building equity in their homes—and being taught about the virtues of homeownership—to become renters. It feels like throwing money away. But renting a home in a city before buying can give retirees a chance to really know if it’s the place they want to spend retirement. \nDave Bensema, a wealth-planning consultant at BMO Private Bank in Chicago, says it’s especially common for people to retire somewhere they’ve been while on vacation. He cautions that the two experiences are completely different. Renting a home for a year lets you get to know the area in all its seasons—in terms of weather, culture, politics. \nAlso read: 10 of the greatest places in the world to retire if you’re not rich \n“What you’ll put up with on vacation for a week,” Bensema says, “is different than something you’d put up with every day.” \nRenting can also give people a chance to see the area from the perspective of a residential neighborhood, not a hotel. Even if they don’t want to spend an entire year as a renter, Sperling says, people can stay in an actual neighborhood for a few weeks or months thanks to Airbnb. They can then get the feeling of the part of town they’re likely to live in, as opposed to going to bed at night by the beach or downtown. 4. Will your doctor accept Medicare? \nWhen planning for retirement, health care is often not even on the list of considerations. After all, people in their 40s, 50s and even 60s find it hard to anticipate the physical ailments ahead. \nBut Stephen Golant, a gerontologist and geographer at the University of Florida, says finding a health-care provider in retirement should be a major point of discussion. It’s difficult, he says, to find a doctor that you’re compatible with when you move to a new city and have a half-dozen prescriptions. \n“It’s very hard to find new, reliable doctors,” he says. “Older people, despite the hype they hear, have to be prepared for their bodies to experience some decline that needs to be responded to and treated.” \nBrown, the certified financial planner, says one client just told him that he moved to a place where he had to go to three different medical practices to find someone who would accept new Medicare patients. 5. How are you going to get an ice-cream cone? \nThis is one of three retirement destination questions that Joseph Coughlin, director of MIT’s AgeLab, addresses in his new book, “The Longevity Economy.” He says the question is about knowing what makes you happy, and making sure you know you’ll be able to access it even if you can’t drive, even if you can’t arrange a van to pick you up, and even if you can’t ask a child or friend to give you a lift. \nDon’t miss: 10 of the prettiest towns in the U.S. where you can retire reasonably well \n“Life is made of these little moments—not punctuation points like Christmas dinner and a trip to Italy—but the little moments: getting a newspaper, getting a cup of coffee,” he says. “You have to understand when you’re doing retirement planning, what are those little moments, those little things that only you, not even your spouse, know that will make you smile? And from a transportation point of view: Do you have access to it?” 6. How are you going to change your lightbulbs? \nCoughlin says people often make the mistake of planning for themselves today, not the people they will become later in retirement. At 65, changing a lightbulb, fixing an appliance and taking out the trash might not be something people struggle with. But they may need help with those tasks when they’re 85. \n“Having money is great,” he says, “but unless you have those additional services to enable you to live well, then that’s not necessarily a good retirement. That’s a subsistence retirement.” 7. Who are you going to have lunch with? \nPerhaps one of the most important aspects of picking the right place to retire is the social one. Who are you going to see on a daily basis? Who will be in your social circle? Who are you going to have lunch with? \n“Isolation is perhaps the greatest pandemic facing an aging society,” Coughlin says. “Because you’ve spent an entire life, generally speaking, where things come to you, people come to you, you’re in the flow that work and society and volunteering and church and everything gives you. And as you age, you’re likely to do less, get out less. As a result, fewer people are coming to you.” \nIt’s therefore crucial, he says, that part of preparing for retirement “is to make sure you put yourself in the flow of constant chance collisions of new friends and relationships.” \nIrving of the Milken Institute echoes that warning. “We talk a lot about the fact that sitting may be as bad for you as smoking,” he says. “But isolation may be as bad or worse than both of them.” 8. How busy is this place going to get? \nAnother way to think about this question is: If you are thinking about moving to a place, it’s likely others are, too. And because people are living so long, it is worth thinking about what a community will look like in, say, 20 years. \nSee: The top 10 destinations for retirees moving across America \nNewes, the Florida real-estate agent, says people consider how much an area will grow and whether it can support the new development. He obviously knows this too well: He says that people moved to Florida’s east coast thinking it would be 30 minutes between X and Y, and now it takes 60 or 90 minutes. 9. What’s wrong with where I live now? \nThis is perhaps the most important question people should ask. A lot of people assume that they will move in retirement. But the fact is most people don’t. In fact, Danielle Hale, chief economist for Realtor.com, says that 85% of retirees stay in the area where they raised their families. \nThere’s a reason for that. Irving says people have often spent their entire lives building a community in one location. Moving to, say, a warmer climate, may sound appealing, but he cautions that people should think about what they’ll be leaving behind, and if they would trade a lifetime of friends, family, cultural institutions and familiar roads for more days of sun a year. \n“Aging well is about more than warm weather,” Irving says. “It’s about more than leisure. It’s about ongoing opportunities for engagement and connection and lifelong learning.” Chris Kornelis is a writer in Seattle. Email him at .", "external_links": [], "published": "2018-01-30T15:42:00.000+02:00", "crawled": "2018-01-30T15:48:35.000+02:00", "highlightTitle": ""}