{"organizations": [], "uuid": "b5bbbcedbc100caa6d242fba347522074eb7d7cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223885585&w=1200&r=LYNXMPEE0K0JZ", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-britain-eu-cbi/britain-must-stay-in-european-customs-union-business-group-cbi-idUSKBN1FA0QI", "country": "US", "domain_rank": 408, "title": "Britain must stay in European customs union-business group CBI", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T16:23:00.000+02:00", "replies_count": 0, "uuid": "b5bbbcedbc100caa6d242fba347522074eb7d7cb"}, "author": "", "url": "https://www.reuters.com/article/us-britain-eu-cbi/britain-must-stay-in-european-customs-union-business-group-cbi-idUSKBN1FA0QI", "ord_in_thread": 0, "title": "Britain must stay in European customs union-business group CBI", "locations": [], "entities": {"persons": [{"name": "fairbairn", "sentiment": "none"}, {"name": "carolyn fairbairn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "peston", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "cbi", "sentiment": "negative"}, {"name": "cbi reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european customs union", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 2:45 PM / in 7 hours Britain must stay in European customs union: business group CBI Reuters Staff 3 Min Read \nLONDON (Reuters) - Britain must stay in a comprehensive customs union with the European Union in order to preserve trade in its biggest markets after Brexit, the business lobby group CBI said on Sunday. \nPrime Minister Theresa May ruled out remaining a member of the European single market and the European Customs Union a year ago, saying that Britain wanted the freedom to negotiate its own trade deals. \nThe CBI’s Director General Carolyn Fairbairn said Britain’s businesses valued the certainty of existing free trade in Europe above and beyond possible future trade deals elsewhere. \n“Looking at this hard choice around customs union or not, the value of our frictionless trade within the European Union is worth more than having the potentially unknown value of trade deals in other parts of the world,” she told ITV’s Peston On Sunday. \nFairbairn was speaking ahead of a speech on Monday in which she will call for greater urgency in Brexit talks to give clarity to companies that will otherwise need to trigger alternative plans, including moving jobs and investment offshore. \n“Time is running out - by March next year our country will be out of the EU,” she will say, according to excerpts of the speech released on Sunday. \nThe British government said it had already made good progress in Brexit talks, with agreements in a range of issues such as citizens’ rights and the financial settlement, and it was confident it could negotiate a bespoke trade deal. \n“The EU has said they will offer their most ambitious free trade approach and we are confident of negotiating a deep and special economic partnership that includes a good deal for financial services - that will be in the EU’s best interests, as well as ours,” a Department for Exiting the European Union spokeswoman said. \n“But, as the Prime Minister has already made clear, we will be leaving the single market and the customs union after EU exit day.” \nFairbairn will call for a “jobs-first” transition deal to be nailed down in the next 70 days in her speech and unambiguous heads of terms to be agreed with the European Union by October. \nShe will say a no deal scenario would be an act of “great economic self harm”, by imposing billions of pounds of costs on UK goods sold to the EU and vice versa, and existing trade deals between the EU and Canada and the EU Norway would not be the best solution for Britain. \nGreater flexibility is needed from both sets of negotiators, and opening positions need to be revisited to deliver a deal that builds on 40 years of economic integration. \n“Economics and prosperity must be put ahead of politics and red lines,” she will say. Reporting by Paul Sandle, Editing by William Maclean", "external_links": [], "published": "2018-01-21T16:23:00.000+02:00", "crawled": "2018-01-21T16:55:59.011+02:00", "highlightTitle": ""}