{"organizations": [], "uuid": "6dbe92bee28a0b198fe2e72261366fda767d40e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224409820&w=1200&r=LYNXMPEE0M0I7", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-tesla-ceo/tesla-says-ceo-musk-to-get-paid-only-when-company-performs-well-idUSKBN1FC0VN", "country": "US", "domain_rank": 408, "title": "Tesla says CEO Musk to get paid only when company performs well", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T10:44:00.000+02:00", "replies_count": 0, "uuid": "6dbe92bee28a0b198fe2e72261366fda767d40e1"}, "author": "", "url": "https://www.reuters.com/article/us-tesla-ceo/tesla-says-ceo-musk-to-get-paid-only-when-company-performs-well-idUSKBN1FC0VN", "ord_in_thread": 0, "title": "Tesla says CEO Musk to get paid only when company performs well", "locations": [], "entities": {"persons": [{"name": "musk", "sentiment": "negative"}, {"name": "tesla", "sentiment": "negative"}, {"name": "shubham kalia", "sentiment": "none"}, {"name": "gopakumar warrier", "sentiment": "none"}], "locations": [{"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "tesla inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 8:51 AM / in 31 minutes Tesla sets massive stock awards for Musk based on boosting market value Subrat Patnaik , Alexandria Sage 5 Min Read \nBANGALORE/SAN FRANCISCO (Reuters) - Silicon Valley billionaire Elon Musk could earn as much as $55.8 billion in Tesla Inc stock and own more than a quarter of the electric car company in the next decade if he hits all targets of a bold new pay plan. \nThe unexpected compensation arrangement - announced in the middle of the night in California - involves no salary or cash bonus but sets up rewards for Musk multiplying Tesla’s market value as much as ten-fold to $650 billion over the next 10 years. \nThat ambitious target implies Tesla stock will grow by 1,000 percent over a decade, or about 27 percent per year, a feat achieved by only a handful of major U.S. companies recently, including Amazon.com Inc, Priceline Group Inc and Domino’s Pizza Inc. Netflix has surged 6,600 percent in the past 10 years. \nTesla’s current market value of $60 billion is about the same as General Motors Co, but far below Apple Inc’s $921 billion. \nThe plan comes after Tesla’s much-anticipated Model 3 sedan missed several production targets and as many on Wall Street expect the company to launch another round of capital raising. \n“We see Elon Musk’s ambitious long-term awards plan as an aspirational marketing tool to attract talent and capital ahead of an upward inflection in competition” for electric and autonomous vehicles, said Morgan Stanley analyst Adam Jonas, who has been bullish on Tesla shares. \nMusk could earn more than $70 billion in incremental compensation through the deal, Jonas estimated. Tesla itself put Musk’s maximum gain at $55.8 billion. \nWith the new plan, Tesla effectively quietened speculation that Musk may be planning to quit as the targets require him to remain as chief executive or serve as both executive chairman and chief product officer. \nTesla noted, however, that the deal provides “the flexibility to bring in another CEO who would report to Elon at some point in the future.” The company added that there was no current intention for this to happen. \nSome investors worry that Musk’s ambition to build Tesla into a behemoth will severely stretch its production capabilities, aggravating production delays and stretching Tesla’s high cash burn rate. \nMeanwhile, a host of global automakers from Volkswagen AG ( VOWG_p.DE ) to Ford Motor Co plan to introduce new electric vehicles into the marketplace in coming years, posing a major threat. \nTesla’s shares, which gained 46 percent last year, were up 0.7 percent in afternoon trade. NEW TERMS \nThe new performance award consists of a 10-year grant of stock options that vest in 12 tranches tied to milestones. \nThe company’s market value must increase to $100 billion for the first tranche to vest and must continue to increase in additional $50 billion increments for the remaining 11 tranches. \nMusk, also Tesla’s chairman, was an early investor in the company and is now its biggest shareholder, owning about a fifth of all shares outstanding. \nHe has founded several companies, including rocket maker SpaceX and The Boring Company - leading some to speculate that his interest in leading Tesla could eventually wane. His net worth is about $20 billion, according to Forbes. \nMusk has vowed that Tesla will become “the best manufacturer on Earth,” helped by a new, highly automated assembly line and a simpler design for its Model 3 sedan. However, production woes have slowed deliveries. \nWhile Tesla’s luxury Model S sedans and Model X SUVs have earned it a legion of fans for its technical innovations and respect from the automotive industry, it is the more mass-market Model 3 sedan that is key to the company’s long-term viability. \nThe company said on Tuesday it must meet a set of escalating revenue and adjusted EBITDA targets for Musk to earn compensation tied to the operational milestones. \nFor each tranche, Musk will vest in stock options that correspond to about 1.69 million shares, or 1 percent of Tesla’s current total outstanding shares. \nThe performance award was created by the company’s board in consultation with third party compensation consultant Compensia Inc. It requires the approval of Tesla’s shareholders. \nMusk and his brother Kimbal did not participate in the more than six-month process. Shareholders, excluding the Musks, will be asked to vote on it in a special shareholder scheduled in late March. Reporting by Subrat Patnaik and Shubham Kalia in Bengaluru, additional reporting by Sonam Rai and Noel Randewich; Writing by Sayantani Ghosh; Editing by Saumyadeb Chakrabarty and Bill Rigby", "external_links": [], "published": "2018-01-23T10:44:00.000+02:00", "crawled": "2018-01-23T11:00:32.030+02:00", "highlightTitle": ""}