{"organizations": [], "uuid": "ac4050c5a254888d05dae18bfaab5786e8744b1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/deals-day/deals-of-the-day-mergers-and-acquisitions-idUSL4N1OY43V", "country": "US", "domain_rank": 408, "title": "Deals of the day-Mergers and acquisitions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T23:56:00.000+02:00", "replies_count": 0, "uuid": "ac4050c5a254888d05dae18bfaab5786e8744b1d"}, "author": "", "url": "https://www.reuters.com/article/deals-day/deals-of-the-day-mergers-and-acquisitions-idUSL4N1OY43V", "ord_in_thread": 0, "title": "Deals of the day-Mergers and acquisitions", "locations": [], "entities": {"persons": [{"name": "didi chuxing", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "didi", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "rbs", "sentiment": "none"}, {"name": "dominion energy inc", "sentiment": "none"}, {"name": "updates dominion energy", "sentiment": "none"}, {"name": "moneygram international inc", "sentiment": "none"}, {"name": "scana corp", "sentiment": "none"}, {"name": "spectrum brands", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Updates Dominion Energy, Didi; adds RBS, Spectrum Brands and others)\nJan 3 (Reuters) - The following bids, mergers, acquisitions and disposals were reported by 2135 GMT on Wednesday:\n** Dominion Energy Inc said it would buy Scana Corp in an all-stock deal worth about $7.9 billion, offering the utility a way out of dealing with unhappy customers and federal investigations following a failed nuclear project.\n** China’s ride-hailing application Didi Chuxing has agreed to acquire control of Brazil’s 99, the companies said in a statement, potentially creating a formidable rival to Uber in Latin America’s largest economy.\n** Ant Financial’s plan to acquire U.S. money transfer company MoneyGram International Inc collapsed on Tuesday after a U.S. government panel rejected it over national security concerns, the most high-profile Chinese deal to be torpedoed under the administration of U.S. President Donald Trump.\n** A German court is likely to decide on Thursday whether to reverse the insolvency filing of airline Niki, according to a statement from Berlin’s civil courts, which could derail the sale of the Air Berlin unit to Britain’s IAG.\n** Britain’s Royal Bank of Scotland (RBS) has sold offshore loans held by its Lombard Finance subsidiary to specialist lenders Investec and Shawbrook Bank, an Investec spokesman said.\n** Spectrum Brands Holding Inc said it is exploring strategic options, including a sale, for its unit that sells brands such as George Foreman cookware and Rayovac batteries.\n** Canada Pension Plan Investment Board (CPPIB), Singapore wealth fund GIC and property owner Scion Group LLC said their student housing joint venture had bought 24 U.S. student housing properties for $1.1 billion.\n** Nigeria has agreed a $550-million deal to buy two Chinese communications satellites and hopes to sign the contract before the end of the month, the communication minister said.\n** The Czech National Bank has issued an initial decision to reject a request by Chinese investment group CEFC to raise its stake in Czech-based privately held J&T Finance Group (JTFG) to 50 percent from 9.9 percent, a source with knowledge of the process said.\n** International and German investors have sued Deutsche Bank for 740 million euros ($890 million) in connection with the bank’s takeover of Postbank, their lawyer said.\n** Collapsed German airline Air Berlin said it had sold its subsidiary Air Berlin Aviation GmbH to Thomas Cook Group Airlines Plc, continuing the carve-up of its business.\n** Kenya’s telecoms regulator has ditched a proposal to break Safaricom up into separate telecoms and financial services businesses due to its dominant size, Kenya’s Business Daily newspaper said.\n** Tie-up talks between Boeing Co and Embraer SA have not settled key questions such as control of the Brazilian planemaker or the possibility of a more narrow joint venture, two people familiar with the negotiations told Reuters, pushing back against a newspaper report.\n** Fortuna Entertainment Group’s majority shareholder, Fortbet Holdings Limited, will launch an offer for the company at 182.50 crowns per share, the Czech betting company said.\n** Qatar Re, a unit of Qatar Insurance, has agreed to buy UK motor insurer Markerstudy’s underwriting businesses for an undisclosed sum, Markerstudy said.\n** Australia’s DuluxGroup Ltd said its majority-owned joint venture company DGL Camel International has agreed to sell most of its coatings business in Hong Kong and China to Yip’s Chemical Holdings Ltd. (Compiled by Laharee Chatterjee and Nikhil Subba in Bengaluru)\n ", "external_links": [], "published": "2018-01-03T23:56:00.000+02:00", "crawled": "2018-01-04T00:12:23.003+02:00", "highlightTitle": ""}