{"organizations": [], "uuid": "32d2c6ef8a7017c3870cf45212f8ed43175fd212", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-capital-forensics-inc-further-expands-compliance-and-regulatory-capabilities-with-addition-of-attorney-john-m-ivan.html", "country": "US", "domain_rank": 767, "title": "Capital Forensics, Inc. Further Expands Compliance and Regulatory Capabilities With Addition of Attorney John M. Ivan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T16:30:00.000+02:00", "replies_count": 0, "uuid": "32d2c6ef8a7017c3870cf45212f8ed43175fd212"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-capital-forensics-inc-further-expands-compliance-and-regulatory-capabilities-with-addition-of-attorney-john-m-ivan.html", "ord_in_thread": 0, "title": "Capital Forensics, Inc. Further Expands Compliance and Regulatory Capabilities With Addition of Attorney John M. Ivan", "locations": [], "entities": {"persons": [{"name": "john m. ivan", "sentiment": "negative"}, {"name": "joh", "sentiment": "negative"}, {"name": "ivan", "sentiment": "none"}, {"name": "raymond james", "sentiment": "none"}, {"name": "m. ivan", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "palatine", "sentiment": "none"}], "organizations": [{"name": "cfi", "sentiment": "negative"}, {"name": "capital forensics, inc", "sentiment": "neutral"}, {"name": "capital forensics, inc.", "sentiment": "neutral"}, {"name": "finra", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}, {"name": "department of labor", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALATINE, Ill., Jan. 24, 2018 /PRNewswire/ -- Capital Forensics, Inc. (CFI) announced today that John M. Ivan has joined the firm's senior management team as a Managing Director, adding greater depth to CFI's existing range of services designed to help financial services firms address regulatory requirements and reduce their associated legal and compliance risks. His 35-year career includes senior level legal, compliance and regulatory positions for some of the securities industry's largest and most respected firms.\nIn particular, Mr. Ivan's professional focus has been on wealth management, full-service retail brokerage and dual registrant investment adviser firms. His range of expertise includes regulatory matters related to Department of Labor's Fiduciary Standards Reform; the U.S. Securities and Exchange Commission and FINRA Dual Registrant investment adviser priorities; as well as issues related to sales practices, complex products and protection of senior investors.\nMost recently, he served as Chief Compliance Officer for Raymond James, the full-service retail and capital markets broker-dealer based in St. Petersburg, Florida. He was also head of compliance for all of Raymond James' retail independent and employee channels, along with their dual registrant businesses. Prior to that, he served as Managing Director at Bank of America Merrill Lynch, responsible for compliance of the products and services within its Global Wealth and Retirement Services division. Previously, he was General Counsel and Chief Compliance Officer for Janney Montgomery Scott LLC, in Philadelphia.\nEarlier in his career, Mr. Ivan also served in senior compliance and legal roles at Goldman Sachs in New York, and at First Union Securities and Wheat First Butcher Singer in Richmond, Virginia, predecessor firms to Wells Fargo Advisors. He began his career as an enforcement attorney at the Securities and Exchange Commission.\nCapital Forensics' Chairman and CEO, Vadim Khavinson, said, \"The appointment of John Ivan is an important step for CFI, in terms of broadening appreciation of the firm's capabilities within the financial services industry. John's Wall Street credentials, combined with his depth of knowledge and practical experience in critical legal, compliance and regulatory issues, raise CFI's ability to address those complex challenges for firms of any size.\"\nJohn Ivan holds an undergraduate degree from the University of Virginia, and a law degree from the University of Richmond. He holds Series 7, 9, 10, 14, 24 and 65 securities industry licenses. He's an active member of the Securities Industry and Financial Markets Association (SIFMA), serving on numerous committees, including the Compliance and Regulatory Policy Committee and the General Counsel / Chief Compliance Officer Regional Firm Roundtable. He is a former member of SIFMA's Compliance & Legal Society Executive Committee, General Counsels Committee, and the Arbitration Committee; as well as FINRA's Compliance Advisory Committee, District 9 Business Committee, and Complaints Initiatives Committee. He is a former FINRA arbitrator and New York Stock Exchange hearing officer.\nAbout Capital Forensics. Inc.\nFounded in 1993, Capital Forensics, Inc. (CFI) provides data analysis, expert testimony, litigation support and regulatory consulting for the financial services industry. CFI's clients range from financial institutions – including broker-dealers, hedge funds and Registered Investment Advisors – to FORTUNE 500 companies.\nCFI's major practice areas include: Data Analytics • Litigation Support & Expert Testimony • Compliance, Regulatory & Risk Consulting • Forensic & Fraud Investigations • The industry's most comprehensive suite of Arbitration Tools, including ArbReporter®, ArbSelector® and MockArb®. CFI has assisted business leaders and litigation teams in thousands of successful case resolutions and regulatory inquiries. www.capitalforensics.com\nContact:\nEric H. Siber\nManaging Director\n189148@email4pr.com\n(917) 225-6659\nView original content with multimedia: http://www.prnewswire.com/news-releases/capital-forensics-inc-further-expands-compliance-and-regulatory-capabilities-with-addition-of-attorney-john-m-ivan-300586717.html\nSOURCE Capital Forensics, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/capital-forensics-inc-further-expands-compliance-and-regulatory-capabilities-with-addition-of-attorney-john-m-ivan-300586717.html", "http://www.capitalforensics.com/"], "published": "2018-01-24T16:30:00.000+02:00", "crawled": "2018-01-24T16:52:55.008+02:00", "highlightTitle": ""}