{"organizations": [], "uuid": "dd4e4daa7f4e28694fdc4d1c8a1791573c96ea6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-correcting-and-replacing--hurco-reports-fourth-quarter-and-full-year-results-for-fiscal-2017.html", "country": "US", "domain_rank": 767, "title": "CORRECTING and REPLACING - Hurco Reports Fourth Quarter and Full Year Results for Fiscal 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.064, "site_type": "news", "published": "2018-01-05T17:40:00.000+02:00", "replies_count": 0, "uuid": "dd4e4daa7f4e28694fdc4d1c8a1791573c96ea6e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-correcting-and-replacing--hurco-reports-fourth-quarter-and-full-year-results-for-fiscal-2017.html", "ord_in_thread": 0, "title": "CORRECTING and REPLACING - Hurco Reports Fourth Quarter and Full Year Results for Fiscal 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "indianapolis", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "hurco", "sentiment": "negative"}, {"name": "hurco companies, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "INDIANAPOLIS, Jan. 05, 2018 (GLOBE NEWSWIRE) -- In a release issued under the same headline earlier today by Hurco Companies, Inc. (Nasdaq:HURC), please note that in the sixth paragraph, introducing the second table, certain figures did not match the corresponding table. The corrected release follows:\nHurco Companies, Inc. (Nasdaq:HURC) today reported results for the fourth fiscal quarter and fiscal year ended October 31, 2017. Hurco recorded net income of $6,702,000, or $1.00 per diluted share, for the fourth quarter of fiscal 2017 compared to net income of $3,003,000, or $0.45 per diluted share, for the corresponding period in fiscal 2016. For fiscal 2017, Hurco reported net income of $15,115,000, or $2.25 per diluted share, compared to $13,292,000, or $1.99 per diluted share, for fiscal 2016.\nSales and service fees for the fourth quarter of fiscal 2017 were $75,931,000, an increase of $9,577,000, or 14%, compared to the corresponding prior year period and included a favorable currency impact of $1,581,000, or 2%, when translating foreign sales to U.S. dollars for financial reporting purposes. Sales and service fees for fiscal 2017 were $243,667,000, an increase of $16,378,000, or 7%, compared to fiscal 2016 and included a negative currency impact of $1,275,000, or 1%, when translating foreign sales to U.S. dollars for financial reporting purposes.\nThe following table sets forth net sales and service fees by geographic region for the fourth quarter and fiscal year ended October 31, 2017 and 2016 (dollars in thousands):\nThree Months Ended Fiscal Year Ended October 31, October 31, $ % $ % 2017 2016 Change Change 2017 2016 Change Change Americas $23,597 $27,288 ($3,691 ) -14% $75,540 $74,386 $1,154 2% Europe 42,714 31,849 10,865 34% 133,671 124,070 9,601 8% Asia Pacific 9,620 7,217 2,403 33% 34,456 28,833 5,623 20% Total $75,931 $66,354 $9,577 14% $243,667 $227,289 $16,378 7% Sales in the Americas for the fourth quarter of fiscal 2017 decreased by 14% compared to the corresponding period in fiscal 2016, as the fourth quarter of fiscal 2016 reflected year-end promotional activities following the International Manufacturing Technology Show (“IMTS”) held in September 2016. Sales in the Americas for fiscal 2017 increased by 2% compared to fiscal 2016 and reflected improved U.S. market conditions and demand from customers for all product lines (Hurco, Takumi and Milltronics) and in all regions of the country where our customers are located.\nEuropean sales for the fourth quarter of fiscal 2017 increased by 34%, compared to the corresponding period in fiscal 2016, and included a favorable currency impact of 4%, when translating foreign sales to U.S. dollars for financial reporting purposes. The increase in European sales for the fourth quarter of fiscal 2017 was primarily attributable to an increased sales volume of Hurco and Takumi machines in Germany, the United Kingdom and France. European sales for fiscal 2017 increased by 8%, compared to fiscal 2016, and included a negative currency impact of 1% when translating foreign sales to U.S. dollars for financial reporting purposes. Excluding the negative impact of currency, the year-over-year increase in European sales for fiscal 2017 was driven primarily by increased sales of Hurco machines in the United Kingdom and Germany.\nAsian Pacific sales for the fourth quarter and fiscal 2017 increased by 33% and 20%, respectively, compared to the corresponding periods in fiscal 2016, primarily due to increased sales of Hurco and Takumi machines in all Asian Pacific countries where our customers are located, with China contributing the largest increase. Asian Pacific sales for the fourth quarter and fiscal 2017 included a favorable currency impact of 4% and 1%, respectively, when translating foreign sales to U.S. dollars for financial reporting purposes.\nOrders for the fourth quarter of fiscal 2017 were a record $73,680,000 an increase of $6,538,000, or 10%, compared to the corresponding period in fiscal 2016, and included a favorable currency impact of $1,034,000, or 2%, when translating foreign orders to U.S. dollars. Orders for fiscal 2017 were a record $260,609,000, an increase of $41,387,000, or 19%, compared to fiscal 2016, and included a negative currency impact of $2,581,000, or 1%, when translating foreign orders to U.S. dollars.\nThe following table sets forth new orders booked by geographic region for the fourth quarter and fiscal year ended 2017 and 2016 (dollars in thousands):\nThree Months Ended Fiscal Year Ended October 31, October 31, $ % $ % 2017 2016 Change Change 2017 2016 Change Change Americas $26,526 $28,526 ($2,000 ) -7% $85,070 $70,944 $14,126 20% Europe 36,881 31,915 4,966 16% 137,622 121,519 16,103 13% Asia Pacific 10,273 6,701 3,572 53% 37,917 26,759 11,158 42% Total $73,680 $67,142 $6,538 10% $260,609 $219,222 $41,387 19% Orders in the Americas for the fourth quarter of fiscal 2017 decreased by 7%, compared to the corresponding period in fiscal 2016, as the fourth quarter of fiscal 2016 reflected year-end promotional activities following the IMTS held in September 2016. Orders in the Americas for fiscal 2017 increased by 20% compared to fiscal 2016 and reflected improved U.S. market conditions and demand from customers for all product lines (Hurco, Takumi and Milltronics) and in all regions of the country where our customers are located.\nEuropean orders for the fourth quarter and fiscal 2017 increased by 16% and 13%, respectively, compared to the corresponding prior year periods. The year-over-year increases in orders were driven primarily by increased demand for Hurco and Takumi vertical milling machines in Germany, the United Kingdom, and Italy. European orders for the fourth quarter and fiscal 2017 included a favorable currency impact of 2% and a negative currency impact of 2%, respectively, when translating foreign orders to U.S. dollars.\nAsian Pacific orders for the fourth quarter and fiscal 2017 increased by 53% and 42%, respectively, compared to the corresponding prior year periods. The year-over-year increases in orders were driven primarily by increased demand for Hurco and Takumi machines in all Asian Pacific countries where our customers are located, with China contributing the largest increase. Asian Pacific orders for the fourth quarter and fiscal 2017 included a favorable currency impact of 4% and 1%, respectively, when translating foreign orders to U.S. dollars.\nMichael Doar, Chief Executive Officer, stated, “There isn’t a better way to begin Hurco’s 50th anniversary celebration in 2018, than to finish 2017 with record orders and record sales. All of our brands (Hurco, Takumi and Milltronics) and all geographic regions finished the year with higher orders and sales levels than last year. I’m particularly happy to see such a strong finish to the year by our United Kingdom, Germany and China operations as our focus on global markets is an integral component of our strategic plan. We plan to continue to invest in the future of new products and advanced CNC technologies that are designed to provide customers with high levels of productivity to increase their profitability. We look forward to celebrating our 50 th anniversary worldwide to exhibit the past, present, and future of innovation that is the foundat", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/cfd2cfd5-9661-4a5c-b313-52344a385a15", "https://www.globenewswire.com/Tracker?data=tNp_h7TNb1qi_XNb0-296-w_2PwbTqLBzNXibF5cEsngkOOFkEz0_Fuyx5SPW7TlVianijU-nEdYKoEUZZBn1Q=="], "published": "2018-01-05T17:40:00.000+02:00", "crawled": "2018-01-05T20:21:55.019+02:00", "highlightTitle": ""}