{"organizations": [], "uuid": "75a17d12cc65c9b25851c92d8837a3809b2b36ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-us-upstream-ma-deal-value-falls-sharply-in-h2-2017.html", "country": "US", "domain_rank": 767, "title": "US Upstream M&A Deal Value Falls Sharply in H2 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "75a17d12cc65c9b25851c92d8837a3809b2b36ae"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-us-upstream-ma-deal-value-falls-sharply-in-h2-2017.html", "ord_in_thread": 0, "title": "US Upstream M&A Deal Value Falls Sharply in H2 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "permian", "sentiment": "none"}, {"name": "bopco", "sentiment": "none"}], "organizations": [{"name": "upstream m&a deal value falls sharply", "sentiment": "negative"}, {"name": "clayton williams energy", "sentiment": "none"}, {"name": "exxonmobil", "sentiment": "none"}, {"name": "noble energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PE-Backed Start-Ups Could be Catalyst for 2018 Rebound\nNEW YORK--(BUSINESS WIRE)-- Total 2017 US upstream transaction value was $64 billion in line with 2016 value and the 2008-2015 average of $69 billion. However, after $43 billion in deals in H2 2016 and $46 billion in H1 2017, transaction value plunged to just $18 billion in H2 2017, according to oil and gas information provider 1Derrick. ‘Mega’ deals (>$1 billion) crashed from 13 in H2 2016 and 9 in H1 2017 to just 3 in the second half of the year. The impact was most notable in the Permian, where transaction value fell to $2.6 billion in the last six months of 2017. However, strengthening industry fundamentals and new analysis by 1Derrick of US Private Equity (PE) investment and private company M&A trends suggests another round of deal-making and consolidation is on the horizon.\nUS deal activity in 2017 was dominated by Permian which peaked at $17.5 billion in Q1 with ExxonMobil’s $5.6 billion purchase of Bopco and Noble Energy’s $3.2 billion purchase of Clayton Williams Energy. Permian deal value plummeted to $2.8 billion in Q2, but was replaced by $10 billion in Marcellus activity including EQT’s $8.2 billion merger with Rice Energy. Second half 2017 activity was lower but broad based including more than $6 billion in the Rockies. Producers continued to high grade their portfolios by shedding non-core acreage and expanding contiguous positions in key plays to increase average working interests and expanded lateral drilling opportunities.\n“US M&A transaction value was driven by ‘Permania,’ an intense bidding frenzy for large asset packages in the Permian Basin,” commented Mangesh Hirve, COO of 1Derrick, “before conditions changed by mid-2017. Falling oil prices widened the gap between buyer and seller expectations. A significant decline in E&P company stock prices, made it more expensive for producers to use their equity to fund large acquisitions”. He added, “However, sub billion M&A activity level remained solid, with the number of transactions between $100 million and $1 billion increasing from 16 in Q2 to 17 in Q3 and 20 in Q4. More importantly, investment continued to pour into the sector, as more than 60 new companies received more than $11 billion in capital commitments from PE firms in 2017. Private E&Ps and PE-backed firms accounted for 28% of total acquisitions in 2017.”\nDespite the mid-year dip in oil prices, companies reaffirmed their long-term confidence in industry growth by remaining committed to their 2017 capital programs. That confidence was shared by Private Equity firms, which played a major role in 2017 M&A activity. PE-backed firms were involved in 15 of the 20 largest deals, participated in nearly $15 billion each in acquisitions and in divestitures during the year. More significantly, Private Equity committed more than $11 billion to 63 new companies in 2017. The largest allocations have been made by Quantum Energy Partners ($2.5 billion to five new E&Ps), EnCap Investments ($1.8 billion to seven new E&Ps), and Apollo Global Management ($1.6 billion to four new E&Ps). Appalachia-focused HG Energy II received the highest commitment among 2017 start-ups - $1.5 billion from Quantum Energy Partners to target the Marcellus and Utica shales. The Canada Pension Plan Investment Board contributed $1 billion to Encino Acquisition Partners, which is seeking assets across multiple basins. PE backed start-ups are also targeting the Mid-Continent, Eagle Ford, and Permian plays.\n“This level of PE-investment is one reason why we believe another wave of US M&A and consolidation is on the horizon,” according to 1Derrick’s Mangesh Hirve. “Very few of these new companies have made their first acquisitions,” he said. “For example, EnCap and Natural Gas Partners each funded seven companies that have yet to make any significant acquisitions. The remaining capital will likely be allocated over the next two or three quarters, with the focus expanding beyond the Permian. We expect oil-weighted investment will accelerate to the rapidly growing alphabet soup of plays in the Mid-Continent, such as the STACK, SCOOP, Merge, CNOW, and SoHot; to the Niobrara, and Bakken where margins have expanded since the Dakota Access Pipeline came onstream. With gas production reaching all-time highs to meet growing domestic and export demand, deal making is likely to increase in the Marcellus/Utica, where output has reached record growth, and the revitalized Haynesville Shale, where production increased more than 25% during 2017.”\n1Derrick’s research shows that non-PE funded Private E&Ps acquired $28.7 billion in assets during 2011-2014, reaching a historic high of $13.4 billion in 2014. That activity fell off dramatically to $5.3 billion during 2015-2017 as these companies, many conservatively managed, awaited confirmation of a price recovery. Some companies took advantage of Permania to monetize their assets, such as the Bass Brothers’ Bopco ($5.6 billion sale to ExxonMobil) and RKI Exploration ($2.75 billion sale to WPX Energy), and we expect more to opportunistically pursue asset or corporate sales to the new wave of PE-funded privates or established E&Ps. With oil prices rebounding to $60, others are likely to resume growth as public E&Ps shed non-core assets. An example is Merit Energy, the fourth largest US private company by production, which purchased Marathon Oil’s Wyoming assets for $870 million.\nThe oil price rebound has encouraged public E&Ps to extend their accelerated investment programs commenced in 2017. Early 2018 guidance suggests an average 15% boost to 2018 capital spending. The S&P E&P index has also risen 27% from mid-year lows, strengthening the ability of companies to finance larger transactions. One example is Oasis Petroleum’s December 2017 acquisition of Delaware Basin acreage from Forge Energy for $946 million, 83% of which was funded through the issuance of common shares. This first significant Permian deal since March 2017, could be harbinger of accelerated 2018 M&A activity.\n1Derrick ( www.1derrick.com ) is an independent oil and gas research firm with offices in Houston, Dallas, New York, London, Singapore and Bangalore. For more information on its industry leading databases and reports on M&A, business development strategy, new ventures, and exploration, please contact Ajit Thomas at Ajit.Thomas@1Derrick.com or 1.646.284.8661.\n //www.businesswire.com/news/home/20180103005540/en/\n1Derrick\nAjit Thomas, 646-284-8661\nAjit.Thomas@1Derrick.com\nSource: 1Derrick", "external_links": ["http://www.businesswire.com/news/home/20180103005540/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.1derrick.com&esheet=51737109&newsitemid=20180103005540&lan=en-US&anchor=www.1derrick.com&index=1&md5=3d1a5049df25dffb88d847bff297597e"], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T16:51:39.000+02:00", "highlightTitle": ""}