{"organizations": [], "uuid": "cce80ad0fb1a54621bacc05f90577fd0bcb6b703", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-obalon-announces-termination-of-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Obalon Announces Termination of Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:13:00.000+02:00", "replies_count": 0, "uuid": "cce80ad0fb1a54621bacc05f90577fd0bcb6b703"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-obalon-announces-termination-of-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Obalon Announces Termination of Public Offering of Common Stock", "locations": [], "entities": {"persons": [{"name": "stifel", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "obalon", "sentiment": "none"}], "organizations": [{"name": "obalon therapeutics, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "kpmg llp", "sentiment": "none"}, {"name": "canaccord genuity", "sentiment": "none"}, {"name": "ubs investment bank", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}, {"name": "btig", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 23, 2018 (GLOBE NEWSWIRE) -- Obalon Therapeutics, Inc. (the “Company” or “Obalon”) (NASDAQ:OBLN) today announced the termination of the underwriting agreement and cancellation of its previously announced public offering (the “Offering”) of 5,454,545 shares of its common stock at a public offering price of $5.50 per share.\nUBS Investment Bank, Canaccord Genuity and Stifel were acting as joint book-running managers for the offering. BTIG was acting as a co-manager. The offering was being made pursuant to a shelf registration statement (File No. 333-221264) previously filed with and declared effective by the U.S. Securities and Exchange Commission.\nThe Offering was scheduled to close on January 23, 2018. However, a purported whistleblower contacted KPMG LLP, the Company’s independent auditors, to make certain allegations relating to allegedly improper revenue recognition during the Company’s fourth fiscal quarter of 2017 (“Q4 2017”). These allegations were reported to Obalon late in the day on January 22, 2018, making it infeasible for the Company to complete an investigation of the allegations prior to the intended closing of the public offering.\nObalon’s Audit Committee will oversee an internal investigation of these allegations (the “Investigation”). The Company is currently unable to predict the timing or outcome of the Investigation. Based on information known at this time, management does not currently believe material adjustments to the preliminary, unaudited revenue for Q4 2017 and full year 2017 previously reported by the Company will be required as a result of these allegations. The Company intends to make a further announcement regarding the outcome of the Investigation as soon as practicable.\nAbout Obalon Therapeutics, Inc.\nObalon Therapeutics, Inc. (NASDAQ:OBLN) is a San Diego-based company focused on developing and commercializing novel technologies for weight loss. The Obalon management team has over 150 combined years of experience in developing and commercializing novel medical technologies with a track record of financial and clinical excellence. For more information, please visit www.obalon.com .\nForward Looking Statements\nThis press release contains forward-looking statements within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995, including, but not limited to, statements regarding the outcome of any internal investigation by the Company or its Audit Committee, including without limitation, any such investigation into the Company’s preliminary, unaudited Q4 2017 and full year 2017 financial results. All statements other than statements of historical fact are statements that could be deemed forward-looking statements. Although Obalon believes that the expectations reflected in such forward-looking statements are reasonable, the company cannot guarantee future events, results, actions, levels of activity, performance or achievements. Forward-looking statements are subject to risks and uncertainties that may cause Obalon’s actual activities or results to differ significantly from those expressed in any forward-looking statement, including risks and uncertainties related to the outcome of the Investigation and additional information that the Audit Committee may learn during the course thereof. These forward-looking statements speak only as of the date of this press release, and the company undertakes no obligation to revise or update any forward-looking statements to reflect events or circumstances after the date hereof.\nFor Obalon Therapeutics, Inc.\nInvestor Contact:\nWilliam Plovanic\nChief Financial Officer\nObalon Therapeutics, Inc.\nOffice: +1 760 607 5103\nwplovanic@obalon.com\nMedia:\nMegan Driscoll\nEvolveMKD\nOffice Phone: +1 646 517 4220\nmdriscoll@evolvemkd.com\nSource:Obalon Therapeutics, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/e02ca260-1349-45d0-a97e-755cdb8403b4", "https://www.globenewswire.com/Tracker?data=lRZDZZfSN3CID615zOY0eTdYIt6x0esMk0vJ6LbylyNxmj-xpCNdYNr6SwzzRJfwOmteMz_r1KqQVxY-0cQvFBIvrgdnVV9axmSNoqaUdyqPgEk7BgnhoK4y683IvkT3JpcISVHzUsJ_sLH6GQR_fIAdC0JIOMWpsWPuKHywr9_UntoEf5RX1xLkDxFMktC88onMmQ0VtBDo1dLLCBx9M7hcuufQrEBshI29QfkwAuOzt9tGskXOqN3h33G0S6HImpFtFn034-kexlJxnuAZ1w==", "https://www.globenewswire.com/Tracker?data=OkNkGJ6jYwUrEOH6XaRZrchFgZB0S2B5h2nfzPitRvCmdDiRGjcy-Dy80PPoQjHBFg8-qyxTlIPLRd5yIiVkaNV4O93-7majqMLE7LZ8SqwoG6pdpfjTFQzu9KHNgxLZ7gkgdfO-Fmgy-ziknpjGHIoTDqgScQIZkajFr4CpC_UtuZU7dwDnb8URultRpmKF0gNl3JcYYjoQOhWlwty1fVBNgwwEF1FmFHHeLJFqyOHp2pT9yPHylBlBA1KufGu2mZHu79EbehOpYhNz2MKnHg=="], "published": "2018-01-23T17:13:00.000+02:00", "crawled": "2018-01-23T17:36:31.018+02:00", "highlightTitle": ""}