{"organizations": [], "uuid": "1bb254c643d65ceef779659f48d12d2e2c7734b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224754813&w=1200&r=LYNXMPEE0N0P7", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-britain-eu-davis/britain-seeking-equivalence-with-eu-regulation-not-harmonisation-minister-idUKKBN1FD111", "country": "US", "domain_rank": 408, "title": "Britain seeking equivalence with EU regulation, not harmonisation - minister", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T11:35:00.000+02:00", "replies_count": 0, "uuid": "1bb254c643d65ceef779659f48d12d2e2c7734b7"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-davis/britain-seeking-equivalence-with-eu-regulation-not-harmonisation-minister-idUKKBN1FD111", "ord_in_thread": 0, "title": "Britain seeking equivalence with EU regulation, not harmonisation - minister", "locations": [], "entities": {"persons": [{"name": "elizabeth piper", "sentiment": "none"}, {"name": "william james", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrew macaskill", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 9:36 AM / Updated 5 hours ago Britain is not a vassal state, says minister defending EU transition deal Elizabeth Piper , William James 4 Min Read \nLONDON (Reuters) - Brexit minister David Davis was forced to defend on Wednesday a transition deal with the European Union that leaves little changed, rejecting criticism that Britain will continue to be a “vassal state”. \nSpeaking to a parliamentary committee, Davis said Britain’s ties with the EU would “look exactly the same” during what Britain hopes to be two years after Brexit to allow customs, businesses and politicians prepare for a new deal with the bloc. \nBut his description of a status quo transition, which he, like the EU, expects to be agreed by the end of March, raised concerns among Brexit campaigners, underlining the deep divisions in not only the governing Conservatives but across the country. \nFellow Conservative pro-Brexit lawmaker Jacob Rees-Mogg accused Davis of allowing Britain to become a vassal state during the transition period, saying it would leave in name only and would continue to pay into the bloc and adhere to its laws. \n“No, we’re not,” Davis answered. “We are transitioning from one state to another ... you can call it what you like, but not vassal.” \nAs Davis made his case in London, envoys representing the other 27 EU states approved in Brussels their joint stance for negotiations with Britain over the post-Brexit transition. It is now due for approval by EU ministers on Jan. 29. \n“How fast can a deal be sealed? Depends exclusively on progress made in negotiations on legal text in Brussels,” Germany’s Brexit coordinator, Peter Ptassek, said of talks due to start in February in Brussels between Britain and the EU negotiator Michel Barnier. \nThe 27 other EU states indeed want Britain to remain bound by the bloc’s laws and regulations in exchange for access to the internal market. Britain, however, would no longer have a vote in EU institutions. \nBritain’s prime minister, Theresa May, has struggled to keep the warring factions of her party, including her top ministers, united as she negotiates the end of more than 40 years of union with the bloc. \nThose divisions were aired in public on Tuesday, when foreign minister Boris Johnson demanded the government pay 100 million pounds a week more to the public health service to show the voting public what the benefits of Brexit could be. \nInstead, he was slapped down by May, but won support in a Conservative Party which is losing members at a time when opposition Labour is enjoying record support. Related Coverage Don't worry, you won't be deported - UK minister tells EU citizens \nFor Brexit supporters such as Rees-Mogg, the continued jurisdiction of the European Court of Justice after Brexit day on March 29, 2019, is a betrayal of a campaign promise to voters to “take back control”. \nBut Davis said they would only have to swallow such close relations for a little while longer and should instead focus on what ties Britain would have with the EU in the future. \n“I am relaxed about transition because my primary concern is about the future relationship,” he said. “That’s what matters, that’s what people will think about and judge us on in 10, 20 30 years’ time.” Reporting by Elizabeth Piper and William James, Additional reporting by Gabriela Baczynska, Editing by Alistair Smout and Alison Williams", "external_links": [], "published": "2018-01-24T11:35:00.000+02:00", "crawled": "2018-01-24T12:18:09.003+02:00", "highlightTitle": ""}