{"organizations": [], "uuid": "dfcae4edd252658e02d7d648c291e4eaca9e1d98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/germany-stocks-factors/german-stocks-factors-to-watch-on-january-10-idUSL8N1P4180", "country": "US", "domain_rank": 408, "title": "German stocks - Factors to watch on January 10", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T14:18:00.000+02:00", "replies_count": 0, "uuid": "dfcae4edd252658e02d7d648c291e4eaca9e1d98"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/germany-stocks-factors/german-stocks-factors-to-watch-on-january-10-idUSL8N1P4180", "ord_in_thread": 0, "title": "German stocks - Factors to watch on January 10", "locations": [], "entities": {"persons": [{"name": "john cryan", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "continental", "sentiment": "none"}, {"name": "deutsche", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT, Jan 10 (Reuters) - The following are some of the factors that may move German stocks on Wednesday:\nGERMAN GOVERNMENT Germany’s would-be coalition partners have reached agreement on a law to attract skilled immigrants, German media reported on Tuesday, suggesting the parties are edging closer to a decision to open formal coalition negotiations.\nCONTINENTAL The German auto parts and tyre maker said on Tuesday it was in “early stages” of talks about a structural overhaul to become more nimble amid the car industry’s transition to electric and self-driving vehicles, confirming media reports.\nIts finance chief said it was in talks with banks and other relevant parties about a possible structural overhaul of the auto parts and tyre maker and expects to specify its deliberations by the summer.\nIt expects sales to keep growing this year on rising demand for electric and driver-assistance technologies, after matching targets in 2017.\nDEUTSCHE BANK The lender’s warning last week of a third year of losses has prompted some investors to question whether John Cryan should be given more time to turn around the bank, after less than three years as chief executive.\nLUFTHANSA Monthly traffic figures due at 1200 GMT.\nThe administrator of Niki said he would press ahead with an agreed sale of the insolvent Austrian airline to British Airways owner IAG after a German court ruling fanned concern that the deal could unravel.\nAIRBUS French President Emmanuel Macron said a contract with China for 184 Airbus A320s would be finalised soon and that his country also had ambitions to sell A350 and A380 planes in coming weeks or months.\nMETAL AND ENGINEERING INDUSTRY German industrial workers continue strike action in support of wage claims and demands for shorter working hours by trade union IG Metall.\nANALYSTS’ VIEWS\nDEUTSCHE LUFTHANSA - Credit Suisse raises to “outperform” from “neutral”, Raises price target to 36.93 euros from 30.52 euros\nDIALOG SEMICONDUCTOR - Credit Suisse cuts to “neutral” from “outperform‍​”\nOVERSEAS STOCK MARKETS Dow Jones +0.4 pct, S&P 500 +0.1 pct, Nasdaq +0.1 pct at close.\nNikkei -0.3 pct, Shanghai stocks unchanged.\nTime: 6.14 GMT.\nGERMAN ECONOMIC DATA No economic data scheduled.\nEUROPEAN FACTORS TO WATCH DIARIES REUTERS TOP NEWS (Reporting by Tom Sims and Ludwig Burger)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T14:18:00.000+02:00", "crawled": "2018-01-11T12:21:24.000+02:00", "highlightTitle": ""}