{"organizations": [], "uuid": "41f2563796421117d67d44351de8699573fa5c15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-2-oil-dips-as-north-american-output-soars-overall-market-remains-strong.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-Oil dips as North American output soars; overall market remains strong", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T09:59:00.000+02:00", "replies_count": 0, "uuid": "41f2563796421117d67d44351de8699573fa5c15"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-2-oil-dips-as-north-american-output-soars-overall-market-remains-strong.html", "ord_in_thread": 0, "title": "UPDATE 2-Oil dips as North American output soars; overall market remains strong", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "strong@\n* U.S. production to hit 10 million bpd soon\n* Canadian output is also rising\n* But overall oil markets remain well supported by OPEC-led cuts\n* Weakening dollar has also supported crude futures (Recasts with lower Brent prices; adds Canadian production detail)\nSINGAPORE, Jan 29 (Reuters) - Oil prices dipped on Monday as soaring North American production was seen undermining efforts led by OPEC and Russia to tighten supplies.\nDespite this, traders said overall market conditions remained strong due to the production cuts and healthy demand-growth.\nBrent crude futures held above $70 per barrel, but were down by 19 cents from their last close at $70.34 a barrel at 0749 GMT.\nU.S. West Texas Intermediate (WTI) crude futures were at $66.19 a barrel, up 5 cents.\nDespite generally bullish sentiment, analysts said the market was coming under pressure from rising output in North America.\nU.S. crude production <C-OUT-T-EIA> has grown by over 17 percent since mid-2016 to 9.88 million barrels per day (bpd) in mid-January.\nOutput is expected to break through 10 million bpd soon. U.S. energy companies added 12 oil rigs drilling for new production last week, taking the total to 759, General Electric Baker Hughes energy services firm said on Friday.\nU.S. production is already on par with top exporter and OPEC kingpin Saudi Arabia. Only Russia produces more, averaging 10.98 million bpd in 2017.\nThere are also signs that Canadian oil production, already at 335,000 bpd, could start to rise as investment in its shale sector picks up. Canada's overall crude production currently stands at 4.2 million bpd.\nOil major Total said on Monday that production at its Fort Hill oil sands project has started and that output would reach 180,000 bpd over the next few months.\nJP Morgan said it expected prices to fall towards the end of the year as markets become \"flush with oil from shale and other unconventional oils\".\nSTRONG OVERALL MARKET\nGrowing North American output has been one of few factors holding back oil markets.\nCrude has been propped up by supply restraint led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia. These have coincided with strong demand on the back of healthy economic growth.\nAs a result, oil prices have risen by 60 percent since mid-2017 as investors pour cash into crude futures in expectation of higher prices.\nOil has also been supported by a weakening dollar.\n\"Loose fiscal policy in the U.S., a recovery in growth in Europe and an acceleration in EM (emerging market) growth have all combined to push the dollar lower and oil prices higher,\" Bank of America Merrill Lynch said in a note.\nU.S. bank JP Morgan said it had increased its 2018 average price forecast by $10 per barrel to $70 per barrel for Brent and by $10.70 per barrel for WTI to $65.63.\n\"We expect Brent to touch close to $78 per barrel towards end of Q1 2018 or early Q2 2018,\" it added.\n(Reporting by Henning Gloystein; Editing by Richard Pullin and Joseph Radford)", "external_links": [], "published": "2018-01-29T09:59:00.000+02:00", "crawled": "2018-01-29T11:36:29.001+02:00", "highlightTitle": ""}