{"organizations": [], "uuid": "e348eaf3d0e063610d4a6c9e47dfb7377f65c265", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180121.html", "section_title": "Archive News &amp; Video for Sunday, 21 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-regains-footing-after-u-s-govt-shutdown-higher-yields-support-idUSL4N1PH07O", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar regains footing after U.S. govt shutdown, higher yields support", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T12:15:00.000+02:00", "replies_count": 0, "uuid": "e348eaf3d0e063610d4a6c9e47dfb7377f65c265"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-regains-footing-after-u-s-govt-shutdown-higher-yields-support-idUSL4N1PH07O", "ord_in_thread": 0, "title": "FOREX-Dollar regains footing after U.S. govt shutdown, higher yields support", "locations": [], "entities": {"persons": [{"name": "shinichi saoshiro", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar sags but manages to hold above 3-year lows\n* US govt shutdown seen to have been priced in\n* Treasury yields at 3-1/2-yr highs, support dollar\n* Pound slips after 7 days of gains on weak UK retail sales (Adds details and Quote: s, updates prices)\nBy Shinichi Saoshiro\nTOKYO, Jan 22 (Reuters) - The dollar regained some footing on Monday after slipping earlier on a U.S. government shutdown, supported by higher Treasury yields, while investors took a relatively calm view of the Washington wrangling.\nThe U.S. government shutdown took effect at midnight on Friday after Democrats and Republicans, locked in a bitter dispute over immigration and border security, failed to agree on a last-minute deal to fund government operations.\nIn order to break the impasse, Republican and Democratic leaders of the U.S. Senate held talks on Sunday. The Senate was expected to vote at 0600 GMT on whether to advance a measure to fund the government through Feb. 8.\n“The market is accustomed with what is taking place in U.S. politics. It is not reading too far into the shutdown, which is more like a political show,” said Koji Fukaya, president of FPG Securities in Tokyo.\nThe dollar’s index against a basket of six other major currencies initially dipped to hit 90.155 but was last up 0.07 percent at 90.634, managing to hold above the three-year trough of 90.113 set on Thursday.\nThe euro was mostly flat at $1.2227 after dipping to$1.2275, and failing to regain a three-year peak of $1.2323 that it scaled on Wednesday.\n“The dollar’s losses have been limited as negotiations going into Friday were proving difficult and the market had time to price in a U.S. government shutdown,” said Shin Kadota, senior strategist at Barclays in Tokyo.\n“The shutdown is also not expected to last a very long time. That said, if the shut down stretches out to several weeks, then we would have to start worrying about the negative impact on the U.S. economy.”\nThe dollar pared its earlier losses and was little changed at 110.810 yen, still some distance from a four-month low of 110.190 plumbed on Wednesday.\nThe greenback received some support from higher U.S. yields.\nThe 10-year Treasury yield extended Friday’s rise and touched a 3-1/2-year high of 2.672 percent. The debt market had been on the defensive through much of last week in the wake of a rally in risk asset markets.\n“A reverse correlation has been in place for a while between Treasury yields and the dollar, but there are signs that the disconnect between the two is finally beginning to reverse,” Fukaya at FPG Securities said.\nThe Australian dollar climbed 0.1 percent to $0.7994 and the New Zealand dollar also advanced 0.1 percent, to $0.7284.\nThe pound dipped 0.25 percent to $1.3868, pulling away from a 1-1/2-year top of $1.3942 reached on Wednesday following Friday’s disappointing UK retail sales data.\nBefore Friday’s fall sterling had gained for seven straight sessions against the dollar, with traders welcoming positive noises from the European Union about negotiations for Britain’s exit.\nReporting by Shinichi Saoshiro; Editing by Shri Navaratnam and Eric Meijer\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T12:15:00.000+02:00", "crawled": "2018-01-22T20:45:55.025+02:00", "highlightTitle": ""}