{"organizations": [], "uuid": "752c35afc6769186c7bbffc19318ba4a495853b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-jack-in-the-box-inc-announces-leadership-changes-for-jack-in-the-boxa-brand.html", "country": "US", "domain_rank": 767, "title": "Jack in the Box Inc. Leadership Changes for Jack in the Box® Brand", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T17:01:00.000+02:00", "replies_count": 0, "uuid": "752c35afc6769186c7bbffc19318ba4a495853b2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-jack-in-the-box-inc-announces-leadership-changes-for-jack-in-the-boxa-brand.html", "ord_in_thread": 0, "title": "Jack in the Box Inc. Leadership Changes for Jack in the Box® Brand", "locations": [], "entities": {"persons": [{"name": "jack", "sentiment": "negative"}, {"name": "frances allen", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "marcus tom", "sentiment": "none"}, {"name": "lenny comma", "sentiment": "none"}, {"name": "frances", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "qdoba", "sentiment": "none"}], "organizations": [{"name": "box inc.", "sentiment": "neutral"}, {"name": "box inc", "sentiment": "neutral"}, {"name": "strategic initiatives & operations services", "sentiment": "none"}, {"name": "operations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO--(BUSINESS WIRE)-- Jack in the Box Inc. (NASDAQ: JACK) today announced two leadership changes at the Jack in the Box® brand: Frances Allen has informed the company of her decision to resign as Brand President, effective February 9, 2018, and Marcus Tom will join the company on February 12, 2018, as Vice President and Chief Operating Officer. Tom will oversee Operations for company and franchise restaurants as well as Strategic Initiatives & Operations Services.\n“As I mentioned at the recent ICR Conference, I will take the opportunity to flatten our organizational structure following the expected sale of our QDOBA® brand,” said Chairman and Chief Executive Officer Lenny Comma. “Frances graciously suggested the elimination of her position so that we could more quickly begin restructuring the brand’s leadership. Frances was instrumental in refining the brand’s strategy and positioning, with an emphasis on improving the quality of the food and transforming the business model to be more asset light through refranchising. We’re grateful for her exemplary leadership and believe the Jack in the Box brand is stronger as a result of her many contributions. We wish her all the best.”\nAllen said, “I’m very proud to have led this brand over the last three-plus years and of the accomplishments we have made during my tenure, but I could not in good conscience remain in position within a single-brand structure. The appointment of a new COO is the right time for me to exit, and I am excited to embark on the next phase of my career.”\nTom will join Jack in the Box with more than 15 years of experience in operations leadership positions, most recently at JAB Beech Inc., where he was Senior Vice President, Operations of its Caribou Coffee brand from January 2017 to December 2017 and Senior Vice President, Operations for its Einstein Bros. Bagels brand from July 2015 to December 2016. From March 2006 to June 2015, Tom held several positions of increasing responsibility with Starbucks Coffee Company. He was Director of Business Operations from January 2014 to June 2015 for all licensed stores in the U.S. and Canada. From May 2012 to December 2013, he was Starbucks’ Regional Director, Licensed Stores in California and West Arizona, and from March 2006 to May 2012, he was a Regional Director with responsibility for Starbucks’ company-operated stores in San Diego and the greater Phoenix area. He also served as a Regional Vice President overseeing 600 stores during a six-month limited-time assignment in 2009. Prior to joining Starbucks, Tom held several positions with YUM Brands International from 1991 to 2006, including being a senior leader for YUM's franchised business in Central America and the Caribbean. Tom is a graduate of the Wharton School at the University of Pennsylvania with a bachelor’s degree in Economics.\n“Marcus is an agile leader with a proven record of achieving high levels of operational excellence across large retail systems, like Starbucks,” Comma said. “Adding a seasoned restaurant-industry veteran like him, with his unique skillset and proficiencies in operations, is a key piece of our re-focused Jack in the Box leadership team.”\nSaid Tom, “I'm very excited to be joining the Jack in the Box leadership team. The company has an incredible culture with people who care deeply about each other, their customers, and the communities where they work and live.\n“I've had the opportunity to meet with several franchisees and found them to be passionate about the brand and committed to its success. As Chief Operating Officer, I look forward to working with the broader team and our franchisees to build the brand, provide great customer experiences, and contribute to Jack in the Box’s overall success.”\nAbout Jack in the Box Inc.\nJack in the Box Inc. (NASDAQ: JACK), based in San Diego, is a restaurant company that operates and franchises Jack in the Box® restaurants, one of the nation’s largest hamburger chains, with more than 2,250 restaurants in 21 states and Guam. Additionally, through a wholly owned subsidiary, the company operates and franchises QDOBA MEXICAN EATS®, a leader in fast-casual dining, with more than 700 restaurants in 47 states, the District of Columbia and Canada. For more information on Jack in the Box and QDOBA, including franchising opportunities, visit www.jackinthebox.com or www.qdoba.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005091/en/\nJack in the Box Inc.\nInvestor Contact:\nCarol DiRaimo, (858) 571-2407\nor\nMedia Contact:\nBrian Luscomb, (858) 571-2291\nSource: Jack in the Box Inc.", "external_links": ["http://www.businesswire.com/news/home/20180126005091/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.qdoba.com&esheet=51749251&newsitemid=20180126005091&lan=en-US&anchor=www.qdoba.com&index=2&md5=c8c25ce9d7d8e3a6cd6b0831fd24cb7a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.jackinthebox.com&esheet=51749251&newsitemid=20180126005091&lan=en-US&anchor=www.jackinthebox.com&index=1&md5=90279b0a2378cecb6a20a6553c267489"], "published": "2018-01-26T17:01:00.000+02:00", "crawled": "2018-01-26T18:01:06.003+02:00", "highlightTitle": ""}