{"organizations": [], "uuid": "e72707eb6bb7ae0f4b0d3bacebc7c0af249b2552", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-dual-acquisitions-advance-red-hawk-as-fire-security-integrator.html", "country": "US", "domain_rank": 767, "title": "Dual Acquisitions Advance Red Hawk as Fire & Security Integrator", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T19:12:00.000+02:00", "replies_count": 0, "uuid": "e72707eb6bb7ae0f4b0d3bacebc7c0af249b2552"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-dual-acquisitions-advance-red-hawk-as-fire-security-integrator.html", "ord_in_thread": 0, "title": "Dual Acquisitions Advance Red Hawk as Fire & Security Integrator", "locations": [], "entities": {"persons": [{"name": "michael mcwilliams", "sentiment": "none"}], "locations": [{"name": "boca raton", "sentiment": "none"}, {"name": "fla.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "anaheim", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}], "organizations": [{"name": "red hawk fire & security llc", "sentiment": "negative"}, {"name": "dual acquisitions advance red hawk", "sentiment": "negative"}, {"name": "dpsi", "sentiment": "none"}, {"name": "diversified protection systems, inc.", "sentiment": "none"}, {"name": "atci communications, inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOCA RATON, Fla.--(BUSINESS WIRE)-- Red Hawk Fire & Security LLC , a leader in fire, life safety and security services, today announced the purchase of two companies to build upon its capabilities in the special hazard fire suppression business and the integrated security services arena.\nIn separate transactions, Red Hawk announced the purchase of Anaheim, California-based Diversified Protection Systems, Inc., (DPSI ) and ATCi Communications, Inc . (“ATCI”), headquartered in Miami, Florida. The two purchases represent Red Hawk’s fifth and sixth acquisitions in the last 20 months as the company continues to grow both organically and through strategically aligned acquisitions.\n“Joining forces with these two great companies on opposite U.S. coasts elevates our expertise and complements our existing geographic presence while also presenting a broader suite of innovative solutions to our valued clients to further our aim of being the preferred choice for all our customers’ fire, life safety and security needs,” said Michael McWilliams, Red Hawk President and CEO.\nDPSI is well-respected in the industry and by loyal clients for providing design, installation and the 24 x 7 service for mission critical environments and high value assets. DPSI’s expertise includes special hazard clean agent and water mist fire suppression, early warning smoke detection & controls, hazardous gas monitoring & specialty cooling systems. DPSI President Dominic De Maria will remain with Red Hawk helping develop the new Red Hawk Fire & Security “Critical Infrastructure Division.”\n“We are just as enthusiastic about this purchase as Red Hawk. Not only does it advance Red Hawk’s posture in the fire and life safety industry by adding our specialized team of professionals, but it expands the resources and geographic reach we can now offer our clients as well,” said De Maria.\nAs South Florida’s largest independent security systems integrator, ATCi Communications brings an expert team that designs, installs and provides technical support and maintenance services of enterprise-level, intelligent video surveillance systems, access control and intrusion alarms for federal and local government facilities and law enforcement agencies, luxury residential and mixed-use properties and large scale commercial projects. ATCI also expands Red Hawk’s “best in class” specialty portfolio of capabilities through its market leader position in providing customized CityWide Surveillance (CWS) and Automated License Plate Reader (ALPR) solutions to municipal clients.\n“Being able to now offer fire and life safety services to our existing security portfolio is a win-win for our customers, our people and Red Hawk as well. We look forward to combining our sales and business development efforts to maximize our potential across all product and service lines throughout the entire Florida market,” said Vincent. J. Vento, ATCI’s Founder and President.\nRed Hawk is ranked No. 3 for Non-Residential Revenue in the latest SDM 100 listing of companies in the industry and No. 7 for total revenue at just under $300 million dollars.\nLos Angeles-based Imperial Capital, LLC and Miami-based Pacifica Capital Group LLC co-represented ATCI as financial advisors for the transaction.\nAbout Red Hawk Fire & Security\nRed Hawk Fire & Security designs, installs, tests, inspects and maintains a broad portfolio of life safety and security solutions using the latest technologies and advanced systems integration for enterprise level access control, video surveillance systems and physical security equipment. An industry leader with 1,200 employees and a national footprint, the company serves more than 50,000 commercial facilities in financial services, retail, education, healthcare and manufacturing. Red Hawk Fire & Security is headquartered in Boca Raton, Florida and their website is http://www.redhawkus.com .\nAbout Diversified Protection Systems, Inc. (DPSI)\nDiversified Protection Systems, Inc. (DPSI) is a client’s single source provider for design, construction, installation and service of specialty systems, which support and maintain critical operations. DPSI’s life safety and cooling specialty systems provide 24-hour, 7-day protection of clean rooms, computer rooms, and telecommunication facilities, as well as high asset value facilities such as museums, libraries and entertainment entities. http://www.dps-sc.com./\nATCi Communications, Inc. (ATCI)\nATCi Communications, Inc. is a privately-held security and communications system integrator headquartered in Miami, Florida. The company’s diverse portfolio of specialty products and services encompasses a wide range of sectors including government, luxury residential, education, mixed-use and commercial developments. ATCi prides itself on a strong entrepreneurial culture that honors quality, client engagement and employee development. http://atcicomm.com/\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116006292/en/\nRed Hawk Fire & Security\nMedia Contact:\nAnn O’Connor, 561-212-5913\nann.oconnor@redhawkus.com\nSource: Red Hawk Fire & Security", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.redhawkus.com&esheet=51743856&newsitemid=20180116006292&lan=en-US&anchor=http%3A%2F%2Fwww.redhawkus.com&index=4&md5=57c7714b5dfb6092b38c942e9666f73e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.dps-sc.com.%2F&esheet=51743856&newsitemid=20180116006292&lan=en-US&anchor=http%3A%2F%2Fwww.dps-sc.com.%2F&index=5&md5=5f30728a4d5d993f7a4a8775ff7ec086", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.redhawkus.com%2F&esheet=51743856&newsitemid=20180116006292&lan=en-US&anchor=Red+Hawk+Fire+%26+Security+LLC&index=1&md5=75be6b4b09b10341c2096a24eae80a64", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.dps-sc.com%2F&esheet=51743856&newsitemid=20180116006292&lan=en-US&anchor=Diversified+Protection+Systems%2C+Inc.%2C+%28DPSI&index=2&md5=0c1c44c23c7f947c8ae24b6cd6b11ecb", "http://atcicomm.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fatcicomm.com%2F&esheet=51743856&newsitemid=20180116006292&lan=en-US&anchor=http%3A%2F%2Fatcicomm.com%2F&index=6&md5=d1701be08485fa544455c4114f0e2fac", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fatcicomm.com%2F&esheet=51743856&newsitemid=20180116006292&lan=en-US&anchor=ATCi+Communications%2C+Inc&index=3&md5=cf7a46fd9770423a0dd3b95b45c3141d", "http://www.businesswire.com/news/home/20180116006292/en/", "http://www.dps-sc.com./"], "published": "2018-01-16T19:12:00.000+02:00", "crawled": "2018-01-16T21:12:49.048+02:00", "highlightTitle": ""}