{"organizations": [], "uuid": "fee506dc430e5efbdb922ec4f8e0c57bc5049ed1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-helmerich-payne-inc-announces-first-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Helmerich & Payne, Inc. Announces First Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:00:00.000+02:00", "replies_count": 0, "uuid": "fee506dc430e5efbdb922ec4f8e0c57bc5049ed1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-helmerich-payne-inc-announces-first-quarter-results.html", "ord_in_thread": 0, "title": "Helmerich & Payne, Inc. Announces First Quarter Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "okla.", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}], "organizations": [{"name": "helmerich & payne, inc", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "none"}, {"name": "helmerich & payne, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Quarterly U.S. Land revenue days (activity) increased by approximately 4% H&P’s spot pricing in the U.S. Land market continued to increase (approximately 4%) from the date of the fourth quarter results announcement (November 16, 2017) to January 25, 2018 Quarterly U.S. Land adjusted average rig margin per day increased by approximately 11% (1) H&P’s U.S. Land contracted rig count increased by approximately 4% from 197 rigs at September 30, 2017 to 204 rigs at December 31, 2017, compared to a slight decline in the industry rig count (2) Upgraded 16 FlexRigs to super-spec (3) capacity during the first fiscal quarter of 2018\nTULSA, Okla., Jan. 25, 2018 (GLOBE NEWSWIRE) -- Helmerich & Payne, Inc. (NYSE:HP) reported net income of $500 million or $4.55 per diluted share from operating revenues of $564 million for the first quarter of fiscal 2018. Net income per diluted share includes $4.57 of after-tax gains comprised of select items (4) , the most significant of which is a non-cash gain of approximately $501 million related to a reduction of H&P’s deferred income tax liability as a result of applying the new corporate tax rate enacted by the Tax Cuts and Jobs Act (5) .\nPresident and CEO John Lindsay commented, “Our team continued to deliver better-than-expected results. Setting aside the significant and favorable impact of the non-cash adjustment related to the new tax law, our operational results exceeded expectations in the first fiscal quarter. We are encouraged by an improving macro outlook for oil prices, and the prospect of an increasing level of rig activity that it portends.\n“One of the primary factors driving rig pricing is the continued demand for high capacity super-spec rigs and the near full utilization of that portion of the U.S. fleet. A significant driver for super-spec rig demand last year was an average 15% increase in the length of laterals, and we expect this trend to continue. H&P has over 40% of the active super-spec rigs and with that portion of the industry fleet fully utilized we believe pricing should continue to improve. We also have a significant advantage for future growth as we have roughly half of the 200 to 250 upgradeable rigs available in the U.S. market today that could be readily upgraded to super-spec capacity.\n“We are well equipped for the industry’s digital evolution. With our acquisitions of Motive Drilling Technologies and MagVAR we can provide additional value for our customers through improved wellbore quality and placement. Both companies are technology leaders in their respective space and the demand for their offerings is increasing as the importance of wellbore accuracy grows with longer laterals and tighter well spacing.\n“Our people, performance, technology, reliability and uniform FlexRig fleet remain our strongest competitive advantages. Our most recent acquisitions add an attractive dimension to our strategic vision and further differentiate us from others in the market. Along with our scale and financial rigor, we are able to continue to provide superior value to customers and shareholders.”\nOperating Segment Results for the First Quarter of Fiscal 2018\nU.S. Land Operations:\nSegment operating income increased by $28.9 million to $24.7 million sequentially. For the third quarter in a row, the favorable change was primarily attributable to an increase in quarterly revenue days and a higher average rig margin per day. The segment’s Depreciation expense for the quarter includes non-cash charges of $7.2 million for abandonments of used drilling rig components related to rig upgrades, compared to similar non-cash charges of $15.4 million during the fourth fiscal quarter of 2017.\nThe number of quarterly revenue days increased sequentially by approximately 4%. Adjusted average rig revenue per day increased by $483 to $22,167 (1) as pricing continued to improve throughout the quarter. The average rig expense per day decreased sequentially by $359 to $13,546; the decrease in the average was mostly attributable to lower than anticipated self-insurance expenses. The corresponding adjusted average rig margin per day increased sequentially by $842 to $8,621 (1) .\nOffshore Operations:\nSegment operating income increased by $3.7 million to $8.7 million sequentially primarily as a result of higher management contract contributions and slightly higher average rig margins during the quarter. Management contracts on customer-owned platform rigs contributed approximately $6.5 million to the segment’s operating income, compared to approximately $2.5 million during the prior quarter. The number of quarterly revenue days on H&P-owned platform rigs decreased sequentially by approximately 6%, and the average rig margin per day increased sequentially by $287 to $12,375.\nInternational Land Operations:\nThe segment had operating income this quarter as compared to an operating loss during the previous quarter. The $5.5 million sequential increase in operating income was primarily attributable to a higher number of revenue days during the quarter. Revenue days increased during the quarter by 23% to 1,587. The average rig margin per day decreased by $1,035 to $11,351. Both the first fiscal quarter and the prior quarter benefited from favorable adjustments that are not expected to recur going forward.\nOperational Outlook for the Second Quarter of Fiscal 2018\nU.S. Land Operations:\nQuarterly revenue days expected to increase by approximately 1% to 2% sequentially (representing a 3% to 4% increase in the average number of active rigs given the lower number of calendar days during the second fiscal quarter) Average rig revenue per day expected to be roughly flat to slightly up as compared to the first fiscal quarter (excluding any impact from early termination revenue) Average rig expense per day expected to be roughly $13,900\nOffshore Operations:\nQuarterly revenue days expected to decrease by approximately 2% sequentially (as a result of the lower number of calendar days during the second fiscal quarter) Average rig margin per day expected to be approximately $11,500 Management contracts expected to generate approximately $4 million in operating income\nInternational Land Operations:\nQuarterly revenue days expected to decrease by approximately 4% sequentially (representing a 2% decline in the average number of active rigs given the lower number of calendar days during the second fiscal quarter) Average rig margin per day expected to be roughly $8,000\nOther Estimates for Fiscal 2018\nGiven the continued improvement in market conditions and corresponding opportunities, fiscal 2018 capital expenditures are now expected to be approximately $350 million, up from our original estimate of $250 to $300 million. The estimate for general and administrative expenses for fiscal 2018 is now approximately $180 million.\nOther Highlights\nOn December 8, 2017 H&P continued to add to its Family of Solutions by acquiring Magnetic Variation Services, LLC (MagVAR), an industry leader in enhancing the accuracy of directional drilling and wellbore placement. Since November 16, 2017, 10 AC drive FlexRigs were upgraded to super-spec (3) capacity resulting in 171 super-spec rigs in our fleet today. On December 5, 2017, Directors of the Company declared a quarterly cash dividend of $0.70 per share on the Company’s common stock payable March 1, 2018 (as filed on Form 8‑K at the time of the declaration).\nSelect Items Included in Net Income (or Loss) per Diluted Share\nFirst Quarter of Fiscal 2018 net income of $4.55 per diluted share included $4.57 in after-tax gains comprised of the following:\n$4.55 of income tax adjustments related to the recognition of the new corporate tax rate under the Tax Cuts and Jobs Act in calculating the Company’s new deferred income tax liability $0.03 of after-tax income from long-term contract early termination compensation from customers $0.04 of after-tax gains related to the sale of used drilling equipment $(0.05) of after-tax losses from abandonment charges related to the decommissioning of used drilling equipment\nFourth Quarter of Fiscal 2017 net loss of $(0.21) per diluted share included $(0.07) in after-tax losses comprised of the following:\n$0.03 of after-tax income from long-term contract early termination compensation from customers $0.02 of after-tax gains related to the sale of used drilling equipment $0.03 of after-tax gains related to a favorable adjustment to interest and other expenses as a result of the reversal of previously booked uncertain tax positions where the statute of limitations has expired $(0.11) of after-tax losses from abandonment charges related to the decommissioning of used drilling equipment $(0.04) of income tax adjustments related to a net operating loss carryback to a prior fiscal year that caused a reduction of prior year Section 199 domestic production deductions\nAbout Helmerich & Payne, Inc.\nHelmerich & Payne, Inc. is primarily a contract drilling company. As of January 25, 2018, the Company’s fleet includes 350 land rigs in the U.S., 38 international land rigs, and eight offshore platform rigs. The Company’s global fleet has a total of 388 land rigs, including 373 AC drive FlexRigs.\nForward-Looking Statements\nThis release includes “forward-looking statements” within the meaning of the Securities Act of 1933 and the Securities Exchange Act of 1934, and such statements are based on current expectations and assumptions that are subject to risks and uncertainties. All statements other than statements of historical facts included in this release, including, without limitation, statements regarding the registrant’s future financial position, operations outlook, business strategy, budgets, projected costs and plans and objectives of management for future operations, are forward-looking statements. For information regarding risks and uncertainties associated with the Company’s business, please refer to the “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” sections of the Company’s SEC filings, including but not limited to its annual report on Form 10‑K and quarterly reports on Form 10‑Q. As a result of these factors, Helmerich & Payne, Inc.’s actual results may differ materially from those indicated or implied by such forward-looking statements. We undertake no duty to update or revise our forward-looking statements based on changes in internal estimates, expectations or otherwise, except as required by law.\nNote Regarding Trademarks. Helmerich & Payne, Inc. owns or has rights to the use of trademarks, service marks and trade names that it uses in conjunction with the operation of its business. Some of the trademarks that appear in this release include FlexRig and Family of Solutions, which may be registered or trademarked in the U.S. and other jurisdictions.\n(1) See the Selected Statistical & Operational Highlights table(s) for details on the revenues or charges excluded on a per revenue day basis. The inclusion or exclusion of these amounts results in adjusted revenue, expense, and/or margin per day figures, which are all non-GAAP measures.\n(2) The overall market’s decrease of seven rigs (less than 1%) was calculated using the U.S. Land rig counts corresponding to the last weeks of the third and fourth calendar quarters of 2017 as publicly published by BHGE.\n(3) The term “super-spec” herein refers to rigs with the following specifications: AC drive, 1,500 hp drawworks, 750,000 lbs. hookload rating, 7,500 psi mud circulating system and multiple-well pad capability.\n(4) See the corresponding section of this release for details regarding the select items.\n(5) On December 22, 2017, the Tax Cuts and Jobs Act of 2017 was signed into law, effective January 1, 2018. H&P continues to analyze the effect of the new tax law on the Company’s tax position, which may result in further adjustments to our income tax provision.\nContact: Investor Relations\ninvestor.relations@hpinc.com\n(918) 588‑5190\nHELMERICH & PAYNE, INC.\nUnaudited\n(in thousands, except per share data) Three Months Ended CONSOLIDATED STATEMENTS OF December 31\nSeptember 30\nDecember 31\nOPERATIONS 2017 2017 2016 Operating Revenues: Drilling — U.S. Land $ 461,640 $ 439,404 $ 263,636 Drilling — Offshore 33,366 32,505 33,812 Drilling — International Land 63,214 55,109 68,031 Other 5,867 5,286 3,111 $ 564,087 $ 532,304 $ 368,590 Operating costs and expenses: Operating costs, excluding depreciation and amortization 373,083 367,346 247,679 Depreciation and amortization 143,267 153,876 133,847 General and administrative 46,548 40,331 34,262 Research and development 3,234 3,462 2,808 Income from asset sales (5,565 ) (3,034 ) (842 ) 560,567 561,981 417,754 Operating income (loss) 3,520 (29,677 ) (49,164 ) Other income (expense): Interest and dividend income 1,724 1,887 990 Interest expense (5,773 ) (2,244 ) (5,055 ) Other 530 2,125 387 (3,519 ) 1,768 (3,678 ) Income (loss) from continuing operations before income taxes 1 (27,909 ) (52,842 ) Income tax benefit (500,641 ) (6,198 ) (18,288 ) Income (loss) from continuing operations 500,642 (21,711 ) (34,554 ) Income (loss) from discontinued operations, before income taxes (519 ) 580 (424 ) Income tax provision 17 1,401 85 Loss from discontinued operations (536 ) (821 ) (509 ) NET INCOME (LOSS) $ 500,106 $ (22,532 ) $ (35,063 ) Basic earnings per common share: Income (loss) from continuing operations $ 4.57 $ (0.20 ) $ (0.33 ) Loss from discontinued operations $ — $ (0.01 ) $ — Net income (loss) $ 4.57 $ (0.21 ) $ (0.33 ) Diluted earnings per common share: Income (loss) from continuing operations $ 4.55 $ (0.20 ) $ (0.33 ) Loss from discontinued operations $ — $ (0.01 ) $ — Net income (loss) $ 4.55 $ (0.21 ) $ (0.33 ) Weighted average shares outstanding: Basic 108,683 108,588 108,276 Diluted 109,095 108,588 108,276\nHELMERICH & PAYNE, INC.\nUnaudited\n(in thousands) December 31 September 30 CONSOLIDATED CONDENSED BALANCE SHEETS 2017 2017 ASSETS Cash and cash equivalents $ 383,664 $ 521,375 Short-term investments 42,541 44,491 Other current assets 740,139 669,398 Current assets of discontinued operations 2 3 Total current assets 1,166,346 1,235,267 Investments 83,943 84,026 Net property, plant, and equipment 4,950,400 5,001,051 Other assets 161,407 119,644 TOTAL ASSETS $ 6,362,096 $ 6,439,988 LIABILITIES AND SHAREHOLDERS’ EQUITY Current liabilities $ 355,668 $ 344,311 Current liabilities of discontinued operations 94 74 Total current liabilities 355,762 344,385 Non-current liabilities 918,346 1,434,098 Non-current liabilities of discontinued operations 4,470 4,012 Long-term debt less unamortized discount and debt issuance costs 493,168 492,902 Total shareholders’ equity 4,590,350 4,164,591 TOTAL LIABILITIES AND SHAREHOLDERS’ EQUITY $ 6,362,096 $ 6,439,988\nHELMERICH & PAYNE, INC. Unaudited\n(in thousands) Three Months Ended December 31 CONSOLIDATED CONDENSED STATEMENTS OF CASH FLOWS 2017 2016 As adjusted OPERATING ACTIVITIES: Net income (loss) $ 500,106 $ (35,063 ) Adjustment for loss from discontinued operations 536 509 Income (loss) from continuing operations 500,642 (34,554 ) Depreciation and amortization 143,267 133,847 Changes in assets and liabilities (577,277 ) (32,585 ) Income from asset sales (5,565 ) (842 ) Other 11,205 8,524 Net cash provided by operating activities from continuing operations 72,272 74,390 Net cash used in operating activities from discontinued operations (57 ) (19 ) Net cash provided by operating activities 72,215 74,371 INVESTING ACTIVITIES: Capital expenditures (91,698 ) (82,127 ) Purchase of short-term investments (16,183 ) (15,025 ) Payment for acquisition of business, net of cash acquired (47,832 ) — Proceeds from sale of short-term investments 18,120 13,900 Proceeds from asset sales 8,749 1,209 Net cash used in investing activities (128,844 ) (82,043 ) FINANCING ACTIVITIES: Dividends paid (76,503 ) (76,176 ) Proceeds from stock option exercises 892 10,253 Payments for employee taxes on net settlement of equity awards (5,471 ) (6,073 ) Net cash used in financing activities (81,082 ) (71,996 ) Net decrease in cash and cash equivalents (137,711 ) (79,668 ) Cash and cash equivalents, beginning of period 521,375 905,561 Cash and cash equivalents, end of period $ 383,664 $ 825,893\n“As adjusted” – Effective October 1, 2017, we adopted Accounting Standards Update No. 2016-09, Improvements to Employee Share-Based Payment Accounting . The cash flow statement for the three months ended December 31, 2016 has been adjusted to reflect changes that were applied retrospectively from that adoption.\nDecember 31 September 30\nDecember 31\nSEGMENT REPORTING 2017 2017 2016 (in thousands, except days and per day amounts) U.S. LAND OPERATIONS Revenues $ 461,640 $ 439,404 $ 263,636 Direct operating expenses 299,064 297,978 170,606 General and administrative expense 13,993 13,150 11,642 Depreciation 123,838 132,438 112,276 Segment operating income (loss) $ 24,745 $ (4,162 ) $ (30,888 ) Revenue days 18,362 17,593 9,784 Average rig revenue per day $ 22,400 $ 21,944 $ 24,788 Average rig expense per day $ 13,546 $ 13,905 $ 15,204 Average rig margin per day $ 8,854 $ 8,039 $ 9,584 Rig utilization 57 % 55 % 31 % OFFSHORE OPERATIONS Revenues $ 33,366 $ 32,505 $ 33,812 Direct operating expenses 21,122 24,069 22,845 General and administrative expense 1,165 918 916 Depreciation 2,354 2,469 3,267 Segment operating income $ 8,725 $ 5,049 $ 6,784 Revenue days 460 491 644 Average rig revenue per day $ 35,776 $ 34,797 $ 31,317 Average rig expense per day $ 23,401 $ 22,709 $ 20,839 Average rig margin per day $ 12,375 $ 12,088 $ 10,478 Rig utilization 63 % 67 % 78 % INTERNATIONAL LAND OPERATIONS Revenues $ 63,214 $ 55,109 $ 68,031 Direct operating expenses 46,737 42,949 53,350 General and administrative expense 1,132 785 669 Depreciation 11,811 13,374 13,187 Segment operating income (loss) $ 3,534 $ (1,999 ) $ 825 Revenue days 1,587 1,291 1,157 Average rig revenue per day $ 38,039 $ 40,540 $ 55,880 Average rig expense per day $ 26,688 $ 28,154 $ 42,911 Average rig margin per day $ 11,351 $ 12,386 $ 12,969 Rig utilization 45 % 37 % 33 %\nOperating statistics exclude the effects of offshore platform management contracts, gains and losses from translation of foreign currency transactions, and do not include reimbursements of “out-of-pocket” expenses in revenue per day, expense per day and margin calculations.\nReimbursed amounts were as follows:\nU.S. Land Operations $ 50,315 $ 53,357 $ 21,098 Offshore Operations $ 4,098 $ 5,900 $ 4,431 International Land Operations $ 2,861 $ 2,762 $ 3,377 Segment operating income for all segments is a non-GAAP financial measure of the Company’s performance, as it excludes general and administrative expenses, corporate depreciation, income from asset sales and other corporate income and expense. The Company considers segment operating income to be an important supplemental measure of operating performance for presenting trends in the Company’s core businesses. This measure is used by the Company to facilitate period-to-period comparisons in operating performance of the Company’s reportable segments in the aggregate by eliminating items that affect comparability between periods. The Company believes that segment operating income is useful to investors because it provides a means to evaluate the operating performance of the segments and the Company on an ongoing basis using criteria that are used by our internal decision makers. Additionally, it highlights operating trends and aids analytical comparisons. However, segment operating income has limitations and should not be used as an alternative to operating income or loss, a performance measure determined in accordance with GAAP, as it excludes certain costs that may affect the Company’s operating performance in future periods.\nThe following table reconciles operating income per the information above to income (loss) from continuing operations before income taxes as reported on the Consolidated Statements of Operations (in thousands).\nThree Months Ended December 31\nSeptember 30\nDecember 31\n2017 2017 2016 Operating income (loss) U.S. Land $ 24,745 $ (4,162 ) $ (30,888 ) Offshore 8,725 5,049 6,784 International Land 3,534 (1,999 ) 825 Other (7,317 ) (3,697 ) (2,049 ) Segment operating income (loss) $ 29,687 $ (4,809 ) $ (25,328 ) Corporate general and administrative (28,549 ) (24,506 ) (21,035 ) Other depreciation (3,545 ) (3,796 ) (4,077 ) Inter-segment elimination 362 400 434 Income from asset sales 5,565 3,034 842 Operating income (loss) $ 3,520 $ (29,677 ) $ (49,164 ) Other income (expense): Interest and dividend income 1,724 1,887 990 Interest expense (5,773 ) (2,244 ) (5,055 ) Other 530 2,125 387 Total other income (expense) (3,519 ) 1,768 (3,678 ) Income (loss) from continuing operations before income taxes $ 1 $ (27,909 ) $ (52,842 )\nSUPPLEMENTARY STATISTICAL INFORMATION\nThe tables and information that follow are additional statistical information that may also help provide further clarity and insight into the operations of the Company.\nSELECTED STATISTICAL & OPERATIONAL HIGHLIGHTS\n(Used to determine adjusted per revenue day statistics, which is a non-GAAP measure) Three Months Ended December 31 September 30 2017 2017 (in dollars per revenue day) U.S. Land Operations Early contract termination revenues $ 233 $ 260 Total impact per revenue day: $ 233 $ 260\nU.S. LAND RIG COUNTS & MARKETABLE FLEET STATISTICS\nJanuary 25 December 31 September 30 Q1FY18 2018 2017 2017 Average U.S. Land Operations Term Contract Rigs 109 102 100 101.7 Spot Contract Rigs 97 102 97 97.9 Total Contracted Rigs 206 204 197 199.6 Idle or Other Rigs 144 146 153 150.4 Total Marketable Fleet 350 350 350 350.0\nH&P GLOBAL FLEET UNDER TERM CONTRACT STATISTICS\nNumber of Rigs Already Under Long-Term Contracts (1) (Estimated Quarterly Average — as of 01/25/18) Q2 Q3 Q4 Q1 Q2 Q3 Q4 Segment FY18 FY18 FY18 FY19 FY19 FY19 FY19 U.S. Land Operations 104.1 91.4 74.1\n63.7 29.1 24.5 20.9 International Land Operations 10.8 10.0 10.0 10.0 10.0 10.0 10.0 Offshore Operations 2.0 1.9 0.3 — — — — Total 116.9 103.3 84.4 73.7 39.1 34.5 30.9", "external_links": [], "published": "2018-01-25T14:00:00.000+02:00", "crawled": "2018-01-25T16:21:26.031+02:00", "highlightTitle": ""}