{"organizations": [], "uuid": "b766e42595168ab6d9de9f5bb350cefdfd8ccb11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-berry-global-group-inc-prices-500-million-second-priority-senior-secured-notes-private-offering.html", "country": "US", "domain_rank": 767, "title": "Berry Global Group, Inc. Prices $500 Million Second Priority Senior Secured Notes Private Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:26:00.000+02:00", "replies_count": 0, "uuid": "b766e42595168ab6d9de9f5bb350cefdfd8ccb11"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-berry-global-group-inc-prices-500-million-second-priority-senior-secured-notes-private-offering.html", "ord_in_thread": 0, "title": "Berry Global Group, Inc. Prices $500 Million Second Priority Senior Secured Notes Private Offering", "locations": [], "entities": {"persons": [{"name": "berry", "sentiment": "none"}], "locations": [{"name": "evansville", "sentiment": "none"}, {"name": "ind.", "sentiment": "none"}], "organizations": [{"name": "berry global group, inc", "sentiment": "neutral"}, {"name": "berry global group, inc.", "sentiment": "neutral"}, {"name": "berry global, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EVANSVILLE, Ind.--(BUSINESS WIRE)-- Berry Global Group, Inc. (“Berry”) (NYSE: BERY) announced today the pricing of the private offering launched January 19, 2018 by its wholly owned subsidiary Berry Global, Inc. (the “Issuer”). The Issuer will issue $500 million of second priority senior secured notes due 2026 (the “Notes”). The closing of the private offering is expected to occur on or about January 26, 2018.\nThe Notes will bear interest at a rate of 4.500% payable semiannually, in cash in arrears, on February 15 and August 15 of each year, commencing August 15, 2018 and will mature on February 15, 2026.\nThe Notes will be guaranteed by Berry and each of the Issuer’s existing and future direct or indirect domestic subsidiaries that guarantee the Issuer’s senior secured credit facilities and existing second priority senior secured notes, subject to certain exceptions. The Notes and the guarantees will be senior secured second priority obligations and will rank senior in right of payment to all of the Issuer’s, and, in the case of the guarantees, to all of the guarantors’, existing and future subordinated debt. The guarantee by Berry will be unsecured. The Notes and the subsidiary guarantees thereof will be secured on a second-priority basis, respectively, by liens on the assets of the Issuer and the subsidiary guarantors that secure Issuer’s obligations under its senior secured credit facilities, subject to certain exceptions.\nThe net proceeds from the offering are intended to be used to fund the cash consideration due in respect of the acquisition of all of the equity of Clopay Plastic Products Company, Inc., a Delaware corporation (the “Clopay Acquisition”), to pay related fees and expenses and any remainder for general corporate purposes. The consummation of the Clopay Acquisition is not a condition to the closing of the offering. If the Clopay Acquisition is not consummated, Berry intends to use the net proceeds of the offering to repay debt under its senior secured credit facilities and for general corporate purposes.\nThe Notes are being offered only to persons reasonably believed to be qualified institutional buyers in reliance on Rule 144A under the Securities Act of 1933, as amended (the “Securities Act”), and outside the United States, only to non-U.S. investors pursuant to Regulation S. The Notes have not been and will not be registered under the Securities Act or any state securities laws and may not be offered or sold in the United States absent an effective registration statement or an applicable exemption from registration requirements or a transaction not subject to the registration requirements of the Securities Act or any state securities laws.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy any security and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offering, solicitation or sale would be unlawful. Any offers of the Notes will be made only by means of a private offering circular.\nAbout Berry Global\nBerry is committed to its mission of ‘Always Advancing to Protect What’s Important,’ and proudly partners with its customers to provide them with value-added customized protection solutions. The Company’s products include engineered materials, non-woven specialty materials, and consumer packaging. Berry’s world headquarters is located in Evansville, Indiana. With net sales of $7.1 billion in fiscal 2017, Berry, a Fortune 500 company, is listed on the New York Stock Exchange under the ticker symbol BERY.\nForward Looking Statements\nCertain statements and information included in this release may constitute “forward looking statements” within the meaning of the Federal Private Securities Litigation Reform Act of 1995. You can identify forward-looking statements because they contain words such as “believes,” “expects,” “may,” “will,” “should,” “would,” “could,” “seeks,” “approximately,” “intends,” “plans,” “estimates,” “anticipates,” “outlook,” or “looking forward,” or similar expressions that relate to our strategy, plans or intentions. All statements we make relating to our estimated and projected earnings, margins, costs, expenditures, cash flows, growth rates and financial results or to our expectations regarding future industry trends are forward-looking statements. Such forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance, or achievements of Berry to be materially different from any future results, performance, or achievements expressed or implied in such forward looking statements. Additional discussion of factors that could cause actual results to differ materially from management’s projections, forecasts, estimates and expectations is contained in Berry’s filings with the U.S. Securities and Exchange Commission (the “SEC”). Berry does not undertake any obligation to update any forward-looking statements, or to make any other forward-looking statements, whether as a result of new information, future events or otherwise. In addition, we, through our senior management, from time to time make forward-looking public statements concerning our expected future operations and performance and other developments. These forward-looking statements are subject to risks and uncertainties that may change at any time, and, therefore, our actual results may differ materially from those that we expected.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005781/en/\nBerry Global Group, Inc.\nMedia Contact:\nEva Schmitz, 812-306-2424\nevaschmitz@berryglobal.com\nor\nInvestor Contact:\nDustin Stilwell, 812-306-2964\ndustinstilwell@berryglobal.com\nSource: Berry Global Group, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180119005781/en/"], "published": "2018-01-20T00:26:00.000+02:00", "crawled": "2018-01-20T00:45:21.034+02:00", "highlightTitle": ""}