{"organizations": [], "uuid": "09835f9d9b5f0c349aab778f19fb2bc32ac91814", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-bright-scholar-announces-unaudited-financial-results-for-2018-first-fiscal-quarter.html", "country": "US", "domain_rank": 767, "title": "Bright Scholar Announces Unaudited Financial Results for 2018 First Fiscal Quarter", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T01:00:00.000+02:00", "replies_count": 0, "uuid": "09835f9d9b5f0c349aab778f19fb2bc32ac91814"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-bright-scholar-announces-unaudited-financial-results-for-2018-first-fiscal-quarter.html", "ord_in_thread": 0, "title": "Bright Scholar Announces Unaudited Financial Results for 2018 First Fiscal Quarter", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "foshan", "sentiment": "none"}], "organizations": [{"name": "bright scholar education holdings limited", "sentiment": "negative"}, {"name": "frost & sulli", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FOSHAN, China, Jan. 23, 2018 /PRNewswire/ -- Bright Scholar Education Holdings Limited (\"Bright Scholar,\" the \"Company,\" \"we\" or \"our\") (NYSE: BEDU), the largest operator of international and bilingual K-12 schools in China*, today announced its unaudited financial results for the 2018 first fiscal quarter ended November 30, 2017.\n2018 First Fiscal Quarter Financial Highlights (in comparison to the same period of last fiscal year)\nRevenue was RMB465.2 million, up 23.0% Gross profit was RMB216.8 million, up 39.0%; gross margin was 46.6%, up from 41.2% Operating income was RMB137.1 million, up 27.6%; operating margin was 29.5%, up from 28.4% Net income and adjusted net income (1) were RMB119.1 million, up 42.0%; net margin and adjusted net margin (1) were 25.6%, up from 22.2% EPS was RMB1.02 up 67.2% from RMB0.61, adjusted EPS (2) was RMB1.02, up 67.2% from RMB0.61 Adjusted EBITDA (3) was RMB161.4 million, up 28.6%; adjusted EBITDA margin (3) was 34.7%, up from 33.2%\n* In terms of student enrollment as of September 1, 2017, according to an industry report commissioned by Bright Scholar and prepared by Frost & Sullivan in 2017.\n(1) Adjusted net income/(loss) is defined as net income/(loss) excluding share-based compensation expenses. Adjusted net margin is defined as adjusted net income/(loss) divided by revenue.\n(2) Adjusted EPS is defined as adjusted net income/(loss) divided by the weighted average number of ordinary shares or American depositary shares (each an \"ADS\"), each representing one Class A ordinary share of the Company, on an as-converted basis.\n(3) Adjusted EBITDA is defined as EBITDA (which refers to income from operations, which excludes interest income, income tax benefit and expense and depreciation and amortization expenses) excluding share-based compensation expenses. Adjusted EBITDA margin is defined as adjusted EBITDA divided by revenue.\nFor more information on these adjusted financial measures, please see the section captioned under \"Non-GAAP Financial Measures\" and the tables captioned \"Reconciliation of GAAP and Non-GAAP Results\" set forth at the end of this release.\n\"We are pleased to report our first fiscal quarter for 2018 fiscal year with robust academic, financial and operating results,\" said Jerry He, Bright Scholar's Chief Executive Officer. \"Our performance is a reflection of our commitment to quality education and to delivering the best academic results for our students. We are delighted that student enrollment has gone up 17% year–on-year with approximately 34,163 students enrolled at our schools as of November 30, 2017. We provide our students with premier education services that have consistently delivered outstanding academic outcomes. As of the date of this release, approximately 51.0% of students in the 2018 graduating class of our international schools have received over 350 offers from global top 50 institutions. We anticipate a growing proportion of our student body receiving offers from these elite institutions and continuous improvement in student grades across all age groups this academic year.\"\n\"We have delivered a very strong set of business and operational results and executed our business strategies well by remaining steadfast in our strategic priorities, maintaining rigorous discipline on maximizing profitability and focusing investments on long term profitable growth. Our revenue grew by 23.0% with further margin expansion as supported by continuous enhancement within existing schools in utilization, student/teacher ratio and effective cost management.\"\n\"Our results in first fiscal quarter demonstrate the continued progress we are making on our strategy. The rapid expansion of our network has never been more critical to our business success. We currently expect to open 12 new schools during fiscal 2018 of which eight commenced operation during the first fiscal quarter. In December 2017, we have entered into an agreement to acquire 75% equity interests in five kindergartens to further strengthen our foothold in Hubei province of China. We currently expect to complete the acquisition by the end of the second fiscal quarter.\"\n\"We could not have furthered our success without the support of our senior business and academic leaders and ongoing recruitment and retention of top talents, which are critical building blocks to our long term and sustainable business growth. On December 15, 2017, our board of directors granted share options to purchase approximately 900,000 Class A ordinary shares of the Company or 17% of the total shares reserved under our current share incentive plan, to school principals and management team members with vesting period varying from 3 to 5 years. We expect the dilution impact to be less than 1% on a fully converted basis.\"\n\"We are very pleased with the positive industry trends, the encouraging regulatory environments and full year outlook for the business. In fiscal 2018, we will continue to pursue domestic and international strategic investment opportunities in network expansion, test preparation, college counselling and extra curriculum that would further strengthen Bright Scholar's position as the leader in the premium school market and will provide significant momentum to our continued growth.\"\n2018 FIRST FISCAL QUARTER ENDED NOVEMBER 30, 2017 UNAUDITED FINANCIAL RESULTS\nRevenues\nRevenues for the first fiscal quarter were RMB465.2 million, representing 23.0% increase from RMB378.2 million in the same period of last fiscal year.\nThe table below sets forth a breakdown of revenues:\nFirst Fiscal Quarter\nEnded November 30, 2017\nFirst Fiscal Quarter\nEnded November 30, 2016\nYoY % Change\n(RMB in million)\n(RMB in million)\nInternational Schools\n174.6\n149.9\n16.5%\nBilingual Schools\n155.5\n120.4\n29.2%\nKindergartens\n106.2\n88.5\n20.0%\nComplementary\n28.9\n19.4\n49.0%\nTotal\n465.2\n378.2\n23.0%\nInternational Schools: Revenue for the quarter was RMB174.6 million, representing a 16.5% increase from RMB149.9 million, accounting for 37.5% of total revenues as compared to 39.6% in the same period of last fiscal year, primarily due to a 15.3% increase in the average number of students from 6,266 to 7,227, and a 1.3% increase in the average tuition and fees from RMB23,900 to RMB24, 200 during the comparison periods.\nBilingual Schools: Revenue for the quarter was RMB155.5 million, representing a 29.2% increase from RMB120.4 million, accounting for 33.4% of total revenues as compared to 31.8% in the same period of last fiscal year. This was primarily due to a 17.1% increase in the average number of students from 13,126 to 15,371, and a 9.8% increase in the average tuition and fees from RMB9,200 to RMB10,100 during the comparison periods.\nKindergartens: Revenue for the quarter was RMB106.2 million, representing a 20.0% increase from RMB88.5 million, accounting for 22.8% of total revenues as compared to 23.4% in the same period of last fiscal year. This was primarily due to a 15.7% increase in the average number of students from 9,780 to 11,318, and a 4.4% increase in the average tuition and fees from RMB9,000 to RMB9,400during the comparison periods.\nComplementary: Revenue for the quarter was RMB28.9 million, representing a 49.0% increase from RMB19.4 million, accounting for 6.2% of total revenues as compared to 5.1% in the same period of last fiscal year. This was primarily due to an increase in the revenue of élan English learning centers from RMB18.1 million to RMB24.7 million, and an increase of RMB2.9 million in other categories of revenue (e.g., camps) during the comparison periods.\nCost of Revenues\nCost of revenues for the quarter was RMB248.4 million, representing an 11.8% increase from RMB222.2 million in the same period of last fiscal year. This was primarily due to an increase of RMB21.7 million in staff costs as a consequence of an increase in the headcount of teaching staff as our school network expanded. The average number of our teachers and instructors increased by 14.0% from 3,098 to 3,533 during the comparison periods.\nInternational Schools: Cost of revenues for the quarter was RMB89.0 million, representing a 2.9% decrease from RMB91.7 million in the same period of last fiscal year.\nBilingual Schools: Cost of revenues for the quarter was RMB88.1 million, representing a 23.2% increase from RMB71.5 million in the same period of last fiscal year.\nKindergartens: Cost of revenues for the quarter was RMB53.5 million, representing a 16.8% increase from RMB45.8 million in the same period of last fiscal year.\nComplementary: Cost of revenues for the quarter was RMB17.8 million, representing a 34.8% increase from RMB13.2 million in the same period of last fiscal year.\nGross Profit and Gross Margin\nGross profit for the quarter was RMB216.8 million, representing a 39.0% increase from RMB156.0 million in the same period of last fiscal year. Gross margin for the quarter was 46.6%, as compared to 41.2% in the same period of the last fiscal year. The margin expansion was primarily attributed to the scale growth of existing schools, an increase in average tuitions and fees, and improvements in operational efficiency.\nInternational Schools: Gross profit for the quarter was RMB85.6 million, representing a 47.1% increase from RMB58.2 million in the same period of last fiscal year. Gross margin for the quarter was 49.0%, as compared to 38.8% in the same period of last fiscal year.\nBilingual Schools: Gross profit for the quarter was RMB67.4 million, representing a 37.8% increase from RMB48.9 million in the same period of last fiscal year. Gross margin for the quarter was 43.3%, as compared to 40.6% in the same period of last fiscal year.\nKindergartens: Gross profit for the quarter was RMB52.7 million, representing a 23.4% increase from RMB42.7 million in the same period of last fiscal year. Gross margin for the quarter was 49.6%, as compared to 48.2% in the same period of last fiscal year.\nComplementary: Gross profit for the quarter was RMB11.1 million, representing a 79.0% increase from RMB6.2 million in the same period of last fiscal year. Gross margin for the quarter was 38.4%, as compared to 32.0% in the same period of last fiscal year.\nSelling, General and Administrative Expenses and Adjusted SG&A Expenses (4)\nTotal selling, general and administrative expenses and adjusted SG&A expenses (4) for the quarter were RMB80.6 million, representing a 63.8% increase from RMB49.2 million in the same period of last fiscal year, accounting for 17.3% of total revenues as compared to 13.0% in the same period of last fiscal year. The increase in selling, general and administrative expenses was primarily due to the increase in the compensation and benefits paid to additional general and administrative staff members to support business expansion, and the increase in marketing fees for brand promotion and professional services to support the growing business as a listed company.\n(4) Adjusted SG&A Expenses are defined as selling, general and administrative expenses excluding share-based compensation expenses.\nOperating Income and Operating Margin\nOperating income for the quarter was at RMB137.1 million, representing a 27.6% increase from RMB107.4 million in the same period of last fiscal year. Operating margin for the quarter was 29.5%, as compared to 28.4% in the same period of last fiscal year.\nNet Income and Adjusted Net Income\nNet income and adjusted net income for the quarter were at RMB119.1 million, representing a 42.0% increase from RMB83.9 million in the same period of the last fiscal year.\nEarnings per ordinary share/ADS and Adjusted Earnings per ordinary share/ADS\nBasic and diluted and adjusted basic and diluted net profit per ordinary share/ADS attributable to ordinary shareholders/ADS holders, on an as-converted basis, for the quarter were RMB1.02 and RMB1.02, respectively, up 67.2% as compared to profit of RMB0.61 and RMB0.61, respectively, in the same period of last fiscal year.\nAdjusted EBITDA\nAdjusted EBITDA for the quarter was RMB161.4 million, representing a 28.6% increase from RMB125.5 million in the same period of last fiscal year.\nCash and Working Capital\nAs of November 30, 2017, the Company's cash and cash equivalents and restricted cash totaled RMB1, 618.5 million, as compared to RMB1,896.7 million as of August 31, 2017.\nGUIDANCE FOR FISCAL YEAR ENDING AUGUST 31, 2018\nThe Company reaffirms its guidance of organic growth published on November 8, 2017, which is based on the current market and operating conditions and reflects the Company's current and preliminary estimates of such market and operating conditions and customer demand, all subject to change.\nConference Call\nThe Company's management will host a conference call at 8:00 a.m. U.S. Eastern Time (9:00 pm Beijing/Hong Kong Time) on January 24, 2018, to discuss its quarterly results and recent business activities.\nTo participate in the conference call, please dial the following number five to ten minutes prior to the scheduled conference call time:\nChina:\n4001-201-203\nHong Kong:\n800-905-945\nUnited States:\n1-888-346-8982\nCanada Toll Free\n1-855-669-9657\nInternational:\n1-412-902-4272\n* Please ask to be joined into Bright Scholar Education Holdings Limited's call.\nThe Company will also broadcast a live audio webcast of the conference call. The webcast will be available at http://ir.brightscholar.com .\nFollowing the earnings conference call, an archive of the call will be available by dialing:\nUnited States:\n1-877-344-7529\nInternational:\n1-412-317-0088\nCanada Toll Free:\n855-669-9658\nReplay Passcode:\n10115383\nReplay End Date:\nJanuary 31, 2018\nSTATEMENT REGARDING UNAUDITED FINANCIAL INFORMATION\nThe unaudited financial information set forth above is subject to adjustments that may be identified when audit work is performed on the Company's year-end financial statements, which could result in significant differences from this unaudited financial information.\nCONVENIENCE TRANSLATION\nThe Company's business is primarily conducted in China and almost all of the revenues are denominated in RMB. However, periodic reports made to shareholders will include current period amounts translated into U.S. dollars using the then current exchange rates, for the convenience of the readers. Translations of balances in the combined and consolidated balance sheets, and the related combined and consolidated statements of operations, shareholders' equity and cash flows from RMB into US dollars as of and for the year ended November 30, 2017 are solely for the convenience of the readers and were calculated at the rate of US$1.00=RMB 6.6090, representing the noon buying rate set forth in the H.10 statistical release of the U.S. Federal Reserve Board on November 30, 2017. No representation is made that the RMB amounts could have been, or could be, converted, realized or settled into US$ at that rate on November, 2017, or at any other rate.\nNON-GAAP FINANCIAL MEASURES\nIn evaluating our business, we consider and use certain non-GAAP measures, including primarily adjusted EBITDA and adjusted net income/(loss), as supplemental measures to review and assess our operating performance. The presentation of these non-GAAP financial measures is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with U.S. GAAP. We define adjusted EBITDA as income from operations (which excludes interest income, income tax benefit and expense and depreciation and amortization expenses) excluding share-based compensation expenses and adjusted net income/(loss) as net income/(loss) excluding share-based compensation expenses. We define adjusted SG&A as expense excluding share-based compensation expenses. We incurred share-based compensation in the 2016 fiscal year only, which was associated with the acquisition of Mr. Jerry He's equity interests in Impetus in January 2016.\nWe present the non-GAAP financial measures because they are used by our management to evaluate our operating performance and formulate business plans. Such non-GAAP measures, including adjusted EBITDA and adjusted net income/(loss), enable our management to assess our operating results without considering the impact of non-cash charges, including depreciation expenses and share-based compensation expenses, and without considering the impact of non-operating items such as interest income and income tax benefit and expenses. We also believe that the use of the non-GAAP measure facilitate investors' assessment of our operating performance.\nThe non-GAAP financial measures are not defined under U.S. GAAP and are not presented in accordance with U.S. GAAP. The non-GAAP financial measures have limitations as analytical tools. One of the key limitations of using these non-GAAP financial measures is that they do not reflect all items of income and expense that affect our operations. Interest income, income tax benefit and expenses, depreciation expenses and share-based compensation expenses have been and may continue to be incurred in our business and are not reflected in the presentation of these non-GAAP measures, including adjusted EBITDA or adjusted net income/(loss). Further, these non-GAAP measures may differ from the non-GAAP information used by other companies, including peer companies, and therefore their comparability may be limited.\nAbout Bright Scholar Education Holdings Limited\nBright Scholar is the largest operator of international and bilingual K-12 schools in China*. The Company is dedicated to providing quality international education to Chinese students and equipping them with the critical academic foundation and skillsets necessary to succeed in the pursuit of higher education overseas. It also complements its international offerings with Chinese government-mandated curriculum for students who wish to maintain the option of pursuing higher education in China. As of November 30, 2017, Bright Scholar operated 60 schools covering the breadth of K-12 academic needs of its students across seven provinces in China. In the first three months of the 2018 school year ended November 30, 2017, Bright Scholar had an average of 33,916 students enrolled at its schools.", "external_links": ["http://ir.brightscholar.com/"], "published": "2018-01-24T01:00:00.000+02:00", "crawled": "2018-01-24T01:22:53.023+02:00", "highlightTitle": ""}