{"organizations": [], "uuid": "f0daa5ef347eea0d471afa7de8a5beea2dbbe45f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/brazil-economy-budget/update-1-brazil-central-govt-easily-meets-2017-primary-budget-target-idUSL2N1PO153", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Brazil taps sovereign fund to meet 2018 budget rules", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T02:27:00.000+02:00", "replies_count": 0, "uuid": "f0daa5ef347eea0d471afa7de8a5beea2dbbe45f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/brazil-economy-budget/update-1-brazil-central-govt-easily-meets-2017-primary-budget-target-idUSL2N1PO153", "ord_in_thread": 0, "title": "UPDATE 2-Brazil taps sovereign fund to meet 2018 budget rules", "locations": [], "entities": {"persons": [{"name": "marcela ayres", "sentiment": "negative"}, {"name": "mateus maia br", "sentiment": "negative"}, {"name": "ana paula vescovi", "sentiment": "none"}], "locations": [{"name": "asilia", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "bndes", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Retops with budget measures, adds details from news conference)\nBy Marcela Ayres and Mateus Maia\nBRASILIA, Jan 29 (Reuters) - Brazil’s government will tap the nation’s sovereign fund and recent surpluses to cut debt and avoid breaking budget rules this year, officials said on Monday, after easily meeting the 2017 fiscal target.\nThe government is 208.6 billion reais ($65.9 billion) short of meeting the so-called golden rule in 2018, which forbids it from issuing debt worth more than its investments in a given year, Treasury Secretary Ana Paula Vescovi said on Monday.\nState development bank BNDES had previously agreed to early repayment of 130 billion reais worth of loans to help meet those requirements, following a similar transaction last year.\nSeveral other measures will help to cover the rest of the shortfall, such as tapping 26 billion reais from its sovereign fund and 16 billion reais from a deactivated development fund to cut debt, moves that require congressional approval.\nThe government will also free up an undisclosed amount of funds stemming from past surpluses, currently earmarked by law, and reassess how much spending authorized in previous years has carried over to 2018.\nThe measures highlight challenges facing policymakers as they try to meet fiscal rules, curb growth of public debt and avoid further sovereign credit downgrades amid rising government spending.\nPlanning Minister Dyogo Oliveira told Reuters this month that he saw “no risk” of breaking the golden rule in 2018 but that there was “no possibility” of meeting it in 2019.\nThe central government, comprised of the federal government, social security system and the central bank, posted a deficit of 124.401 billion in 2017 before interest rate payments, the fourth straight negative result.\nStill, the deficit fell 23 percent from the year before and easily met the official deficit target of 159 billion reais, as Latin America’s largest economy continued to rebound from its deepest recession in decades, boosting tax revenue.\nReuters had reported last week that the deficit was likely to be around 30 billion reais smaller than the official target.\nThe December deficit totaled 21.168 billion reais, below the median estimate of 25.2 billion reais in a Reuters poll.\n$1 = 3.16 reais Reporting by Marcela Ayres and Mateus Maia; Writing by Bruno Federowski; Editing by Andrea Ricci and Chizu Nomiyama\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T02:27:00.000+02:00", "crawled": "2018-01-30T18:43:46.015+02:00", "highlightTitle": ""}