{"organizations": [], "uuid": "d9eb859cf99937346be2dd5773ffb46eb412eaa4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225229318&w=1200&r=LYNXMPEE0O1GB", "site_section": "http://feeds.reuters.com/reuters/topNews\r", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-fbi-texts/u-s-justice-department-watchdog-has-recovered-key-missing-text-messages-letter-idUSKBN1FE2OY", "country": "US", "domain_rank": 408, "title": "U.S. Justice Department watchdog has recovered key missing text messages: letter", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T20:14:00.000+02:00", "replies_count": 0, "uuid": "d9eb859cf99937346be2dd5773ffb46eb412eaa4"}, "author": "", "url": "https://www.reuters.com/article/us-usa-fbi-texts/u-s-justice-department-watchdog-has-recovered-key-missing-text-messages-letter-idUSKBN1FE2OY", "ord_in_thread": 0, "title": "U.S. Justice Department watchdog has recovered key missing text messages: letter", "locations": [], "entities": {"persons": [{"name": "michael horowitz", "sentiment": "none"}, {"name": "lisa page", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "peter strzok", "sentiment": "none"}, {"name": "sarah n. lynch", "sentiment": "none"}, {"name": "bernadette baum", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "justice department", "sentiment": "negative"}, {"name": "u.s. justice department", "sentiment": "negative"}, {"name": "federal bureau of investigation", "sentiment": "none"}, {"name": "congressional", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The U.S. Justice Department’s internal watchdog said Thursday it recovered five months of missing text messages between two Federal Bureau of Investigation officials whom Republicans have accused of bias against President Donald Trump.\nIn a letter to several key Republican lawmakers, Inspector General Michael Horowitz said he would not object if the Justice Department shares with congressional committees the messages between FBI agent Peter Strzok and FBI lawyer Lisa Page that were recovered using forensic tools.\nIn texts that were previously released to Congress, Strzok and Page referred to Trump as an “idiot” and a “loathsome human.” After news reports about the messages, lawmakers demanded to see them amid Republican concerns that agency officials were biased against Trump.\nStrzok and Page both worked on the FBI’s investigation into former Secretary of State Hillary Clinton’s use of a private email server, and they also each briefly worked on Special Counsel Robert Mueller’s ongoing probe into whether the 2016 Trump campaign colluded with Russia.\nTheir cellphones are just two of “thousands” whose texts were not backed up and stored on the FBI’s systems between Dec. 14, 2016 and May 17, 2017, according to a Justice Department official.\nThe FBI has blamed the snafu on “misconfiguration issues” that occurred while the bureau was rolling out new software updates for Samsung 5 devices.\nBut Republicans have claimed the timing is suspect, especially because May 17 marks the date that Deputy Attorney General Rod Rosenstein appointed Mueller as special counsel.\nStrzok and Pages’ text messages have become a focal point of congressional Republicans’ investigation into whether the FBI is biased against Trump and gave Clinton more favorable treatment in its investigation of her private email use.\nHorowitz, whose office is conducting its own review into the FBI’s handling of the Clinton matter, discovered the texts over the summer and informed Mueller. Strzok was then reassigned. Page, meanwhile, left the team in July after her 45-day detail ended.\nWhile Republicans have accused the two of bias against Trump, some of the texts suggest he was just one of many people targeted in their routine political banter.\nAt times, for instance, they were also critical of Clinton.\nIn addition, another Strzok text also appears to contradict the notion that the FBI is out to get Trump, after he told Page he was hesitant to join Mueller’s team because of his “gut sense and concern there’s no big there there.”\nReporting by Sarah N. Lynch; Editing by Cynthia Osterman\n ", "external_links": [], "published": "2018-01-25T20:14:00.000+02:00", "crawled": "2018-01-25T20:23:24.002+02:00", "highlightTitle": ""}