{"organizations": [], "uuid": "7b34b69cc576d5691b538cb4c505cffe071560a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 10}, "facebook": {"likes": 53, "shares": 53, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930929-Starbucks_Blonde_Roast_Espresso.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/15837362/device/rss/rss.html", "section_title": "U.S. News", "url": "https://www.cnbc.com/2018/01/08/starbucks-espresso-goes-blonde-to-lure-in-new-coffee-drinkers.html", "country": "US", "domain_rank": 767, "title": "Starbucks espresso goes 'blonde' to lure in new coffee drinkers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T10:00:00.000+02:00", "replies_count": 0, "uuid": "7b34b69cc576d5691b538cb4c505cffe071560a1"}, "author": "Sarah Whitten", "url": "https://www.cnbc.com/2018/01/08/starbucks-espresso-goes-blonde-to-lure-in-new-coffee-drinkers.html", "ord_in_thread": 0, "title": "Starbucks espresso goes 'blonde' to lure in new coffee drinkers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Starbucks espresso goes 'blonde' to lure in new coffee drinkers Starbucks is now offering \"blonde espresso\" at restaurants nationwide. The new espresso offers customers more ways to customize their drinks and features a more mild, crisp flavor compared with Starbucks' Signature espresso. Blonde espresso is a permanent menu item and will cost the same as the company's traditional espresso. Starbucks' new Blonde Espresso \nStarbucks ' coffee isn't the only menu item to go blonde. \nThe coffee giant is now offering \"blonde espresso\" at all U.S. locations, marking the first time the company has given its consumers a chance to pick the espresso in their cup. \nThis new espresso, made with beans from Latin America, packs 10 more milligrams of caffeine per shot and has a distinctively crisp, citrus flavor and a creamy texture. \nThe company said it hopes offering customers a little more choice will make espresso more approachable to new coffee drinkers. This gateway espresso will be a permanent fixture on Starbucks' menu for the same price as Starbucks' Signature espresso shot. \nThe company introduced blonde espresso in Canada before testing it in Austin, Texas, and Tampa, Florida. Starbucks said that it was well-received by customers and its baristas. \nStarbucks has worked hard to define itself as a go-to premium coffee destination, especially with its newer Roastery and Reserve Bar locations. Adding blonde espresso allows the company to appeal to consumers who haven't acquired a taste for strong and bold coffee flavors. Because of this, Starbucks said that it isn't worried about sales cannibalization. \nThis product launch, which started Tuesday, comes at a time when Starbucks is faced with increasing competition from coffee companies like Dunkin' Donuts , which has increased its number and variety of premium coffee items, and even fast-food chains like McDonald's , which has gained a foothold in the market with its $2 McCafe drinks. \nStarbucks is also under pressure to revitalize its U.S. sales growth. In November, Starbucks reset its long-term financial targets, and now expects global same-store sales growth of 3 percent to 5 percent, down from a prior goal of mid-single digit growth.", "external_links": [], "published": "2018-01-09T10:00:00.000+02:00", "crawled": "2018-01-09T11:36:41.038+02:00", "highlightTitle": ""}