{"organizations": [], "uuid": "b28ea3e79d98ec3849ee096c878eca86300be4fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223139738&w=1200&r=LYNXMPEE0H1YU", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-cancer-gardening/gardening-may-help-cancer-survivors-eat-better-feel-greater-worth-idUKKBN1F730X", "country": "US", "domain_rank": 408, "title": "Gardening may help cancer survivors eat better, feel greater ‘worth’", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:02:00.000+02:00", "replies_count": 0, "uuid": "b28ea3e79d98ec3849ee096c878eca86300be4fe"}, "author": "", "url": "https://uk.reuters.com/article/us-health-cancer-gardening/gardening-may-help-cancer-survivors-eat-better-feel-greater-worth-idUKKBN1F730X", "ord_in_thread": 0, "title": "Gardening may help cancer survivors eat better, feel greater ‘worth’", "locations": [], "entities": {"persons": [{"name": "wendy demark-wahnefried", "sentiment": "none"}, {"name": "carolyn crist", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "academy of nutrition and dietetics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 04 PM / Updated 33 minutes ago Gardening may help cancer survivors eat better, feel greater ‘worth’ Carolyn Crist   For cancer survivors, three seasons of home vegetable gardening may increase physical activity, fruits and vegetables in the diet and also enhance feelings of self-worth, researchers say. \nPossibly as a result of these healthy behaviors, gardeners in the small study also tended to gain less weight around their waists compared to their counterparts on a waiting list for the gardening intervention, the study team reports. \nIt’s estimated there are more than 15 million cancer survivors in the U.S., over two thirds of whom are over age 60, they note in the Journal of the Academy of Nutrition and Dietetics. \n“For cancer survivors, especially those who are older, we look for lifestyle changes that can help them get healthier but are also holistic and have meaning,” said lead author Wendy Demark-Wahnefried, chair of nutrition sciences   Alabama at Birmingham’s Comprehensive Cancer Center. \n“We can send people to the gym, but that isn’t meaningful, and we can counsel them to eat better, but we want it to be more rewarding, and we want it to be long-term,” Demark-Wahnefried told Reuters Health in a telephone interview. “With gardening, we’ve hit the ball out of the ballpark.” \nDemark-Wahnefried and her colleagues did a pilot study with 42 cancer survivors, randomly assigning half to participate in a year-long gardening program with cooperative extension master gardeners and the other half to be put on a waiting list for the gardening program. All the participants were age 60 or older, lived in Alabama and had been diagnosed with early and mid-stage cancers that have high survival rates - such as localized bladder, breast, prostate or thyroid cancers. \nFor the participants in the gardening group, the master gardeners brought raised growing beds as well as plants, seeds and other gardening supplies to each person’s home and helped them establish three seasonal vegetable gardens over the course of the experiment. \nBefore and after the year-long study period, researchers assessed the participants’ diets, performed strength and balance tests, as well as blood tests for markers of stress and overall health. They also administered a series of questions to gauge stress levels, quality of life and mental state. \nAt the end of the experiment, researchers found that the gardeners were eating, on average, one more fruit or vegetable serving per day than the waitlist participants. Gardeners had also gained, on average, just 2.3 centimeters (0.91 inch) around their waists, versus nearly 8 cm (3.15 inches) in the waitlist group. Blood results showed some lower markers of stress in the gardening group, and while gardeners reported an increased feeling of “worth,” the waitlist participants had a decline in this category. \nAmong participants in the gardening group, 91 percent stuck with the program through the one-year follow-up, 70 percent said their experience was “excellent” and 85 percent said they “would do it again.” \n“With more people with cancer surviving and living longer, we need these programs,” Demark-Wahnefried said. “In this and previous studies, we’ve seen people are not only getting their physical functioning back, but it has an impact on quality of life.” \nOne limitation of the study is the small size. Physical activity improvements, for example, can be difficult to measure in small numbers, especially with an activity such as gardening that has different intensities, said Miriam Morey of Duke University School of Medicine in Durham, North Carolina, who wasn’t involved in the study. \n“Some people may spend all day in the garden, but how intense is it? How much exercise is it?” Morey said by phone. “That’s one area where tracking and new technology will enable us to do a better job with research.” \nOther programs exploring the benefits of gardening for cancer survivors include the Garden of Hope, a three-acre farm hosted by The Ohio State University College of Medicine for cancer survivors and caregivers to harvest vegetables grown seasonally by staff and student interns. Last year, 400 cancer survivors visited the farm, which is on the university’s Columbus campus, and participated in studies. \n“Nutrition interns walk around with them in the field, and agriculture folks show them how to harvest and keep plants thriving,” said Colleen Spees, who leads the Garden of Hope program but wasn’t involved in the current study. \n“In the chaos of cancer, people often feel like they control nothing,” Spees told Reuters Health by phone. “When you give them a new skill set, it gives them control over their destiny and a place and space to help them on this journey.” \nSOURCE: bit.ly/2DJsUhj Journal of the Academy of Nutrition and Dietetics, online January 2, 2018.", "external_links": [], "published": "2018-01-18T23:02:00.000+02:00", "crawled": "2018-01-18T23:40:51.003+02:00", "highlightTitle": ""}