{"organizations": [], "uuid": "05757761970efdc18ace620a4f1eba8173ad851d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225362170&w=1200&r=LYNXMPEE0P032", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-global-oil/oil-dips-as-dollar-halts-slide-short-term-demand-outlook-weakens-idUSKBN1FF05D", "country": "US", "domain_rank": 408, "title": "Oil firms as dollar falls further, but weaker crude demand looms", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-26T09:31:00.000+02:00", "replies_count": 0, "uuid": "05757761970efdc18ace620a4f1eba8173ad851d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-oil/oil-dips-as-dollar-halts-slide-short-term-demand-outlook-weakens-idUSKBN1FF05D", "ord_in_thread": 0, "title": "Oil firms as dollar falls further, but weaker crude demand looms", "locations": [], "entities": {"persons": [{"name": "georgi slavov", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bmi research", "sentiment": "none"}, {"name": "marex spectron", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 1:31 AM / in 34 minutes Oil rises, set for weekly gain as weak dollar underpins Bryan Sims 3 Min Read \nHOUSTON (Reuters) - Oil prices rose on Friday after hitting fresh three-year highs in the previous session, as weakness in the dollar continued to underpin prices with crude on track for a weekly gain. \nBrent crude futures were trading 28 cents higher at $70.70 per barrel at 1:30 p.m. EST (1830 GMT). On Thursday, the contract climbed to as high as $71.28, its highest since 2014. \nU.S. West Texas Intermediate (WTI) crude futures were 66 cents, or nearly 1 percent higher, at $66.16 a barrel. On Thursday, they also reached their highest since December 2014, at $66.66. \n“One has to question if this rally is sustainable. Downside protection is going to be warranted,” said Brian LaRose, technical analyst at United-ICAP. \nBoth contracts were set for weekly gains after support from a weakening dollar, which on Friday hit new three-year lows against a basket of other leading currencies. [USD/] \nBrent was so far up 3 percent this week, while WTI was on track for a weekly gain of 4 percent. \n“This inverse dollar relationship with crude can be nebulous at times, but we’ve reached a point where the impact will be felt in the form of higher crude prices,” said John Kilduff, partner at Again Capital LLC in New York. \nAs oil is traded in dollars, swings in the greenback can impact oil demand as they affect the price of fuel purchases for countries using other currencies. \nStill, crude prices were capped by seasonally weakening demand. \nMany refiners shut down after winter for maintenance, resulting in lower orders for crude, their most important feedstock. \nThis is reflecting in oil inventories. U.S. bank Morgan Stanley noted that global oil stocks built up overall in the week ending Jan. 19. \nOn the supply side, U.S. oil production was expected to hit 10 million barrels per day (bpd) soon, putting it on a par with top exporter Saudi Arabia. \nU.S. oil drillers added 12 rigs this week, the biggest weekly increase since March, General Electric Co’s Baker Hughes energy services firm said in its closely followed report on Friday. \n“The U.S. rig activity didn’t push (U.S.) prices up too much...really a muted reaction at first,” said John Macaluso, analyst at Tyche Capital Advisors in New York. Additional reporting by Libby George in London and Henning Gloystein in Singapore; Editing by Marguerita Choy", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T09:31:00.000+02:00", "crawled": "2018-01-26T11:48:09.060+02:00", "highlightTitle": ""}