{"organizations": [], "uuid": "afc0d9886de6ddf8f87ba9dcd3a3cafaa7ac20c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224945340&w=1200&r=LYNXMPEE0N28X", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-usa-congress-opioids/chinas-illegal-opioids-enter-u-s-through-postal-service-gaps-probe-idUKKBN1FD340", "country": "US", "domain_rank": 408, "title": "China's illegal opioids enter U.S. through Postal Service gaps: probe", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:16:00.000+02:00", "replies_count": 0, "uuid": "afc0d9886de6ddf8f87ba9dcd3a3cafaa7ac20c6"}, "author": "", "url": "https://uk.reuters.com/article/us-usa-congress-opioids/chinas-illegal-opioids-enter-u-s-through-postal-service-gaps-probe-idUKKBN1FD340", "ord_in_thread": 0, "title": "China's illegal opioids enter U.S. through Postal Service gaps: probe", "locations": [], "entities": {"persons": [{"name": "richard cowan", "sentiment": "none"}, {"name": "u.", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "u.s. postal service", "sentiment": "none"}, {"name": "senate homeland security", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 10:06 PM / Updated 9 hours ago China's illegal opioids enter U.S. through Postal Service gaps: probe Richard Cowan 4 Min Read \nWASHINGTON (Reuters) - Illegal shipments of the powerful and addictive opioid fentanyl are pouring into the United States by mail from China and the U.S. Postal Service must step up the use of high-tech detection methods to fight the problem, according to a congressional report unveiled on Wednesday. \nA year-long probe by a Senate Homeland Security and Government Affairs investigations subcommittee found there is easy access for buyers in the United States to purchase fentanyl, often in relatively large quantities, through the internet. \nThe drugs are mailed by “labs” in China to individuals who consume them or to middlemen who dilute them for resale. \nInvestigators refused to divulge the names of the labs. \nAccording to the report, the U.S. Postal Service has failed to widely deploy a system to capture advanced electronic data (AED) about packages destined for American ports, which would help identify suspicious mail to be turned over to U.S. Customs and Border Protection agents. \nThe U.S. Postal Service said in a statement it was “working aggressively with law enforcement and key trading partners to stem the flow of illegal drugs entering the United States.” \nUSPS is “prioritizing obtaining AED from the largest volume foreign posts, which collectively account for over 90 percent of inbound volumes,” the statement said. \nAsked about the probe, Chinese foreign ministry spokeswoman Hua Chunying told a regular briefing that she was unaware of the specifics, but said that prevention of drug production, possession and sale is a “brightspot” in China-U.S. relations. EXPRESS MAIL \nStaff of the Permanent Investigations Subcommittee said they focused on six “very responsive” providers in China, out of hundreds of pages of websites offering fentanyl for sale. \nThe result was the identification of 500 online transactions involving fentanyl, mainly in powder form, with a street value of about $766 million. \nU.S. fatalities linked to opioids including fentanyl have been rising dramatically and totaled more than 42,000 in 2016, according to government data. \nOnline sales from China tracked by the Senate investigators were linked to seven confirmed synthetic opioid-related deaths in the United States, they said. \nThe investigation was overseen by Republican Senator Rob Portman of Ohio, the subcommittee chairman, and Senator Tom Carper of Delaware, the panel’s senior Democrat. \nInvestigators said the Chinese sellers were eager to ship the fentanyl using Express Mail Service, which operates worldwide through each country’s postal operations, including the U.S. Postal Service. \nSurcharges are applied, the investigators said, for customers demanding shipment through private delivery services, such as FedEx, DHL and United Parcel Service, because of the greater likelihood the goods would be seized. \nThe Senate investigation concluded that the U.S. Postal Service received advanced electronic data on 36 percent of all international packages, meaning about 318 million parcels last year were not monitored. \n“We now know the depth to which drug traffickers exploit our mail system to ship fentanyl and other synthetic drugs into the United States,” Portman said in a statement. \nThe Senate panel scheduled a hearing for Thursday to question postal, border protection, State Department and other officials. \nThe report recommended tighter monitoring of international shipments, increased inspections and other steps. Reporting by Richard Cowan; Additional reporting by Christian Shepherd in Beijing; Editing by Tom Brown and Neil Fullick", "external_links": [], "published": "2018-01-25T00:16:00.000+02:00", "crawled": "2018-01-25T00:33:25.010+02:00", "highlightTitle": ""}