{"organizations": [], "uuid": "be3af52fdf7212f282b864f08b94bcdd057a84ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225804217&w=1200&r=LYNXMPEE0Q0KY", "site_section": "http://feeds.feedburner.com/Reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/us-trade-nafta/canada-hopeful-nafta-talks-can-continue-sees-some-progress-idUKKBN1FG0QL", "country": "US", "domain_rank": 408, "title": "Canada hopes NAFTA talks go on to next round; some progress made", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T00:30:00.000+02:00", "replies_count": 0, "uuid": "be3af52fdf7212f282b864f08b94bcdd057a84ac"}, "author": "", "url": "https://uk.reuters.com/article/us-trade-nafta/canada-hopeful-nafta-talks-can-continue-sees-some-progress-idUKKBN1FG0QL", "ord_in_thread": 0, "title": "Canada hopes NAFTA talks go on to next round; some progress made", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "steve verheul", "sentiment": "none"}, {"name": "david ljunggren", "sentiment": "none"}, {"name": "anthony esposito", "sentiment": "none"}, {"name": "chrystia freeland", "sentiment": "none"}, {"name": "ildefonso guajardo", "sentiment": "none"}, {"name": "robert lighthizer", "sentiment": "none"}, {"name": "verheul", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "min read  montreal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 4:11 PM / Updated 16 hours ago Canada hopes NAFTA talks go on to next round; some progress made David Ljunggren , Anthony Esposito 4 Min Read \nMONTREAL (Reuters) - Officials trying to hammer out differences over how to update the North American Free Trade Agreement have made some progress and hope politicians decide the talks should continue, Steve Verheul, Canada’s chief negotiator, told Reuters on Saturday. \nThe United States, Canada and Mexico are due to finish the sixth of seven planned rounds of NAFTA discussions on Monday, with several major issues far from being resolved. \nU.S. President Donald Trump, who describes the $1.2 trillion pact as a disaster, has frequently threatened to walk away from it unless major changes are made. \nU.S. Trade Representative Robert Lighthizer, Canadian Foreign Minister Chrystia Freeland and Mexican Economy Minister Ildefonso Guajardo will hold a news conference later on Monday to announce the next steps. \nAsked whether he thought the three ministers would decide there is enough momentum to continue with the next round, Verheul said: “Well, that’s our hope.” \nLater in the day, he told reporters: “We’re moving in a slightly more positive direction. We’ll take that encouragement where we can.” \nA Mexican official, who asked not to be named, said “we don’t foresee a negative reaction to the round, we believe the balance will be positive.” \nWork is moving ahead on less-contentious parts of NAFTA, the Mexican official and a Canadian source close to the talks said on Saturday, and the three nations have closed a chapter on measures to fight corruption. \nCanada and Mexico initially dismissed some of the main U.S. demands as unworkable but later made it clear they were ready to be more flexible. \nDuring the sixth round, Canada raised what it called creative ways of meeting U.S. demands for higher North American content in autos, a sunset clause that would allow one party to quit the treaty after five years, and major changes to existing conflict resolution mechanisms. \n“I think we have demonstrated we have engaged on most of the big issues,” Verheul said in his remarks to Reuters. “We’ve made progress on some of the smaller ones, so I think (it was) not a bad week.” \nThe Mexican official said that Canada’s proposals on rules of origin for autos, the sunset clause and conflict resolution mechanism were “positive, in as much as they are an attempt to move things forward.” \nSpeaking separately, a second Canadian government source said Ottawa was cautiously optimistic about the round, given that the U.S. side had not summarily rejected the proposals for compromise. \nBut the source, who requested anonymity because of the sensitivity of the situation, said much would depend on Lighthizer’s reaction on Monday. \nMarkets and industries are worried about the possible collapse of the $1.2 trillion pact. \n“It’s unclear to us that anything that anyone does here will be enough ... which is concerning for agriculture,” said Brian Innes, president of the Canadian Agri-food Trade Alliance. \n“Our position with all the political parties is that the negotiations must go on,” said Juan Pablo Castanon, president of the Consejo Coordinador Empresarial, the umbrella group representing Mexican private sector interests at the talks. \n“We want free trade, but not at any cost,” he said. \nThe talks were initially scheduled to wrap up by the end of March to avoid clashing with Mexico’s presidential election in July. Guajardo told Reuters on Friday that the process could be extended if need be. \nAndres Manuel Lopez Obrador, the leftist front-runner in the presidential race, said on Friday that the renegotiation should wait until after the election so that the next government, which he aims to lead, would get a say in the treaty’s future. Reporting by David Ljunggren, David Lawder and Anthony Esposito; Editing by Lisa Von Ahn and Susan Thomas", "external_links": [], "published": "2018-01-28T00:30:00.000+02:00", "crawled": "2018-01-28T06:04:54.166+02:00", "highlightTitle": ""}