{"organizations": [], "uuid": "164f6680fa26faf7a8b8b3f466264180918be7a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/swiss-retail/swiss-retail-in-recovery-mode-as-franc-loses-shine-idUSL8N1P43UV", "country": "US", "domain_rank": 408, "title": "Swiss retail in recovery mode as franc loses shine", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:55:00.000+02:00", "replies_count": 0, "uuid": "164f6680fa26faf7a8b8b3f466264180918be7a8"}, "author": "", "url": "https://www.reuters.com/article/swiss-retail/swiss-retail-in-recovery-mode-as-franc-loses-shine-idUSL8N1P43UV", "ord_in_thread": 0, "title": "Swiss retail in recovery mode as franc loses shine", "locations": [], "entities": {"persons": [{"name": "john revill", "sentiment": "negative"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}], "organizations": [{"name": "credit suisse", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 2:55 PM / in 38 minutes Swiss retail in recovery mode as franc loses shine John Revill 3 Min Read \nZURICH, Jan 9 (Reuters) - Switzerland’s retail sector is expected to partially recover in 2018 due to a buoyant Swiss economy, which has largely overcome problems triggered by a strong franc following the scrapping in 2015 of a central bank cap against the euro. \nSwiss shoppers who flocked to neighbouring Germany, France and Italy to pick up bargains are expected to spend more money at home and sales by the country’s retailers are forecast to rise by 0.3 percent this year, Credit Suisse said on Tuesday. \nThe improvement would follow a 0.1 percent increase in 2017, the first rise in three years, the bank said. \nAlthough Switzerland’s retail market is relatively small at around 90 billion Swiss francs ($92 billion) per year, it is an important market for luxury brands in particular. \nThe outlook comes as official data on Tuesday showed retail sales rose by 0.2 percent in November compared with a year earlier, although when inflation was taken into account there was a 0.2 percent decline. \n“There is a recovery for the retail sector as a whole, although it is lagging the entire Swiss economy,” said Sascha Jucker, a Credit Suisse economist. \n“Overall you can talk about a stabilisation, the start of a recovery, although not every retailer will agree with you. There are still some problematic areas like clothing and personal care which are not benefiting to the same extent as food retailers.” \nShop managers interviewed by consultancy Fuhrer & Holz are also slightly more optimistic, with 60 percent expecting rising sales in 2018. \nSwiss supermarket Coop - one of the two chains which dominate the country - last week reported net sales of 17.4 billion francs for 2017 in its retail business, up from 17.2 billion francs a year earlier. \nWhen the Swiss National Bank scrapped the long-standing cap it sent the franc rocketing and left Swiss shops saddled with products costing 50 percent more than just across the border. \nBut last year’s near 9 percent depreciation of the franc versus the euro, coupled with higher inflation outside Switzerland, has led to a comparative price reduction. \nShopping tourism from Switzerland was estimated to have levelled out or even slightly declined in 2017, from 11 billion francs in 2016, Credit Suisse said. \nBut retail growth still lags the overall Swiss economy, which Credit Suisse expects to grow by 1.7 percent this year, largely because of ecommerce, with more Swiss shoppers using services like Zalando and Amazon \nOnline retailers have around 7 percent of the Swiss market, a figure Credit Suisse expects to rise to 11 percent by 2022. \n“The biggest challenge will come from online retailers as they expand their offering in Switzerland,” Jucker said. ($1 = 0.9821 Swiss francs) (Reporting by John Revill; editing by Alexander Smith)", "external_links": [], "published": "2018-01-09T16:55:00.000+02:00", "crawled": "2018-01-09T17:05:26.000+02:00", "highlightTitle": ""}