{"organizations": [], "uuid": "9cd704f9d816ebe532400b741ceeedd57840a2d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/28/104617911-GettyImages-624375870.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/mark-zuckerberg-says-facebook-will-look-into-cryptocurrency.html", "country": "US", "domain_rank": 767, "title": "Mark Zuckerberg says Facebook will look into cryptocurrency", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.112, "site_type": "news", "published": "2018-01-05T21:21:00.000+02:00", "replies_count": 0, "uuid": "9cd704f9d816ebe532400b741ceeedd57840a2d5"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/05/mark-zuckerberg-says-facebook-will-look-into-cryptocurrency.html", "ord_in_thread": 0, "title": "Mark Zuckerberg says Facebook will look into cryptocurrency", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "negative"}, {"name": "cryptocurrencie", "sentiment": "none"}, {"name": "barclay", "sentiment": "none"}, {"name": "michael novogratz", "sentiment": "none"}, {"name": "jamie dimon", "sentiment": "none"}, {"name": "zuckerberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "facebook shares  facebook", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook CEO Mark Zuckerberg says Facebook will be looking into cryptocurrency in the new year.\n\"There are important counter-trends to this — encryption and cryptocurrency — that take power from centralized systems and put it back into people's hands,\" Zuckerberg wrote in his 2018 mission statement , issued on Thursday. \"But they come with the risk of being harder to control. I'm interested to go deeper and study the positive and negative aspects of these technologies, and how best to use them in our services.\"\nShould you be looking into digital currency too? Here's what top investors have to say:\nJamie Dimon: Bitcoin is a 'fraud' The cryptocurrency \" is a fraud ,\" JPMorgan Chase CEO Jamie Dimon said at the Delivering Alpha conference presented by CNBC and Institutional Investor. \"It's just not a real thing, eventually it will be closed.\"\nHe added, at a separate conference organized by Barclay, \"It's worse than tulip bulbs. It won't end well.\"\nshow chapters Jamie Dimon: Governments look at bitcoin as a novelty      3:48 PM ET Tue, 12 Sept 2017 | 01:45 Michael Novogratz: Cryptocurrencies like bitcoin are 'going to be the biggest bubble of our lifetimes' \"I think this [crypto] is going to be the biggest bubble of our lifetimes by a long shot,\" the former Fortress hedge fund manager said at a CoinDesk bitcoin conference .\n\"To be fair, this is a bubble and there's a lot of fraud mixed in. We look at tons of projects. And some get funded, and they literally look like Ponzi's. There's a lot of froth and fraud in something that's exciting as this.\"\nNovogratz's remarks came right after he gave an aggressive projection for bitcoin : It \"could be at $40,000 at the end of 2018. It easily could,\" he said on CNBC's \" Fast Money .\" And he saw big things for other cryptocurrencies too: \"Ethereum, which I think just touched $500 or is getting close, could be triple where it is as well.\"\nshow chapters Bitcoin will be \"the biggest bubble of our lifetimes,\" says hedge fund manager      5:32 PM ET Tue, 28 Nov 2017 | 01:01 Mark Cuban: Only invest if you're prepared to lose your money According to billionaire Mark Cuban , it's OK to invest up to 10 percent of your savings in high-risk investments, including bitcoin and ethereum. You've just \"got to pretend you've already lost your money,\" he told Vanity Fair , adding that it's like throwing \"the Hail Mary.\"\nJim Cramer: Bitcoin is like 'Monopoly money' Bitcoin is a pure gamble , said CNBC's Jim Cramer on \" Squawk Box \": \"It's kind of like Monopoly money. Obviously, there's people who use it. If you ever say anything bad about it, there's like this bitcoin mafia that comes after you. But it is an oddity that has nothing to do with us\" as investors.\n\"It's just pure gambling at this point,\" the market expert continued. \"I mean, if you want to gamble, go to Vegas. Vegas is fabulous.\"\nshow chapters Jim Cramer says Bitcoin is like 'Monopoly money'      4:41 PM ET Wed, 6 Dec 2017 | 00:36 Howard Marks: It's a 'pyramid scheme' \"In my view, digital currencies are nothing but an unfounded fad (or perhaps even a pyramid scheme), based on a willingness to ascribe value to something that has little or none beyond what people will pay for it,\" the respected value investor and co-chairman of Oaktree Capital wrote in an investor letter .\nshow chapters Billionaire investor Howard Marks says bitcoin is a 'pyramid scheme'      9:19 AM ET Thu, 27 July 2017 | 00:54 Tony Robbins: Investing in bitcoin is 'like going to Vegas' The self-made millionaire and best-selling author of \" Money: Master the Game \" isn't completely sold on the idea yet either.\n\"I think [bitcoin] is very iffy,\" Robbins told CNBC's \" Fast Money . \"I don't have a clue. I look at that as it's like going to Vegas.\" In other words, only bet what you can afford to lose.\nRobbins himself directs a certain amount of money to risky ventures and doesn't rely on them to work out. For those investments, his mentality is, \"I know it is just for fun I'm investing, I know I could lose, this is Vegas.\"\nshow chapters Tony Robbins shares the mindset you need to invest in bitcoin      4:14 PM ET Thu, 14 Dec 2017 | 01:10 Jack Bogle: Avoid it 'like the plague' Legendary investor and index fund revolutionary Jack Bogle isn't impressed. He weighed in on the subject at a Council on Foreign Relations event.\n\"Avoid bitcoin like the plague. Did I make myself clear?\" said the Vanguard founder in response to an audience question.\n\"Bitcoin has no underlying rate of return,\" Bogle continued. \"You know bonds have an interest coupon, stocks have earnings and dividends, gold has nothing. There is nothing to support bitcoin except the hope that you will sell it to someone for more than you paid for it.\"\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: Mark Cuban: Here's the best way to invest your money right now \nshow chapters This 18-year-old is a millionaire thanks to bitcoin      4:13 PM ET Thu, 22 June 2017 | 01:06", "external_links": [], "published": "2018-01-05T21:21:00.000+02:00", "crawled": "2018-01-05T21:28:50.007+02:00", "highlightTitle": ""}