{"organizations": [], "uuid": "9c57e748533b19de34af06f809208e1182d52ce8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/03/the-associated-press-5-things-small-business-owners-should-know-or-do-in-2018.html", "country": "US", "domain_rank": 767, "title": "5 things small business owners should know or do in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T18:03:00.000+02:00", "replies_count": 0, "uuid": "9c57e748533b19de34af06f809208e1182d52ce8"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/03/the-associated-press-5-things-small-business-owners-should-know-or-do-in-2018.html", "ord_in_thread": 0, "title": "5 things small business owners should know or do in 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "irs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (AP) — Small business owners have entered 2018 with many questions about how big their tax bills will be, but they're also optimistic about profiting from a strong economy. And aside from financial matters, owners with employees must stay mindful about one of the troubling issues of 2017, sexual harassment.\nHere are five things small business owners need to know about or do in 2018:\nTAXES\nThe new tax law changes rates for many small business owners, whether they are sole proprietorships, partnerships or corporations. But the benefits aren't across the board: Some owners will lose out on savings because they'll end 2018 with income above thresholds set out in the law, or they work in fields like accounting, law or consulting.\nMany business owners aren't sure yet how the law will affect them. Although accountants and other tax professionals may have given owners some general ideas about the impact, the IRS must still write regulations that will spell out what taxpayers can do under the law and how they must comply.\nSome things are known. The Section 179 deduction that small businesses can use to get an immediate break on purchases of equipment ranging from computers to vehicles to manufacturing equipment doubles this year to $1 million.\nAnd separate from the tax bill, the IRS has set the standard mileage rate for business use for a car at 54.5 cents per mile, up 1 cent from 2017. The rate is one of two methods for accounting for how much an owner spent on using a car for business; the second is to deduct the actual expenses for the car. Under the actual expense method an owner must calculate the percentage of miles the car is driven for business, and apply that percentage to expenses like lease payments, fuel, maintenance, repairs, insurance and depreciation.\nTHE ECONOMY\nIf the economy maintains the robust expansion it showed in 2017, owners' profits and their optimism should grow as well. But that may not translate into more jobs.\nIn multiple surveys last year, owners indicated they're generally sticking to their conservative hiring patterns. Job creation plans ticked higher in a fourth-quarter survey by researchers at Pepperdine University's Graziadio School of Business and Management and Dun & Bradstreet Corp., with 42 percent of small business owners saying they'd add one to two staffers in the next six months, up from 38 percent in the third quarter.\nOwners have said a significant revenue increase might persuade them to hire. For many, that could depend on whether consumer spending remains strong. The government's figures on retail sales and consumer spending show Americans were feeling fine about spending as 2017 ended, a sign that business will be good in the new year. Retail sales rose 0.8 percent in November after a 0.5 percent gain in October, according to the Commerce Department. Overall consumer spending rose 0.6 percent in November after rising 0.2 percent in October.\nMany small businesses are dependent on consumers, among them restaurants, retailers and service providers like hair salons. Consumers may feel like spending if the stock market extends its big 2017 advance; the Dow Jones industrial average rose 25 percent, giving many people with 401(k)s and other accounts a stronger sense of financial well-being.\nUnpredictable events like blizzards and hurricanes can hurt spending, and slow the economy. But if consumers regain their confidence quickly, small businesses are likely to shrug off any dips.\nHEALTH CARE\nMost companies' health care plans are set for 2018, but there will be some changes when it comes time to choose policies that begin later this year or in 2019.\nOwners who want to sign up for group insurance through the government's Small Business Health Options Program, or SHOP, now must do so through a health insurance agent or broker or directly through an insurance company. They're no longer able to sign up through the government website, www.healthcare.gov . However, they can visit the site to get information.\nThe new tax law has ended the requirement that individuals buy health insurance starting in 2019. Some very small business owners had stopped offering health plans when the Affordable Care Act was enacted because their staffers were able to get coverage through health insurance exchanges. While businesses with fewer than 50 employees aren't required to offer insurance, some may find their staffers are interested in group coverage.\nSEXUAL HARASSMENT\nHuman resources experts usually advise business owners to update their employee handbooks early in the year. It's a task that's more of a priority at many companies this year following a series of reports of workplace sexual harassment.\n\"Every employer should have a policy in their handbook that makes clear that sexual harassment is not welcome and that defines sexual harassment,\" says Jay Starkman, CEO of Engage PEO, an HR provider based in Hollywood, Florida.\nOwners can find templates for sexual harassment policies online. Whether they're creating a policy for the first time or already have one, they should have it reviewed by an HR professional or an attorney with expertise in sexual harassment or employment law.\nCompanies may also want to consider training sessions to educate staffers and managers about harassment — what it is, how to recognize it, how to report it to owners or senior executives.\nOwners who don't have employee handbooks should think about creating them. Besides harassment policies, they should contain the company's policies on discrimination, discipline, vacations, performance reviews, ethics and use of company computers, among many other issues. They should also include information on benefits. Owners can find templates online.\nMINIMUM WAGE RISES\nEighteen states have higher minimum wages as of Dec. 31, 2017, or Jan. 1.\nLaws were passed boosting the wage floor in 10 of those states: Arizona, California, Colorado, Hawaii, Maine, Michigan, New York, Rhode Island, Vermont and Washington state.\nEight states see increases because their minimums are tied to the inflation rate. They are Alaska, Florida, Minnesota, Missouri, Montana, New Jersey, Ohio and South Dakota.\nSmall businesses such as restaurants or food service companies are most likely to now be paying their workers more under the higher minimums. Three-fifths of all workers paid at or below the federal minimum wage of $7.25 an hour are in the leisure and hospitality industries. Almost all of those are restaurants or food service businesses, according to the Department of Labor.\nFollow Joyce Rosenberg at www.twitter.com/JoyceMRosenberg . Her work can be found here: https://apnews.com/search/joyce%20rosenberg", "external_links": [], "published": "2018-01-03T18:03:00.000+02:00", "crawled": "2018-01-03T19:42:13.004+02:00", "highlightTitle": ""}