{"organizations": [], "uuid": "0a6ec56a652eea91b528ee1530bdc616a010fb75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222805620&w=1200&r=LYNXMPEE0G1LF", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-britain-equalpay-women/british-women-lose-tens-of-billions-in-gender-pay-gap-idUSKBN1F62KG", "country": "US", "domain_rank": 408, "title": "British women lose tens of billions in gender pay gap", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.062, "site_type": "news", "published": "2018-01-18T03:03:00.000+02:00", "replies_count": 0, "uuid": "0a6ec56a652eea91b528ee1530bdc616a010fb75"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-equalpay-women/british-women-lose-tens-of-billions-in-gender-pay-gap-idUSKBN1F62KG", "ord_in_thread": 0, "title": "British women lose tens of billions in gender pay gap", "locations": [], "entities": {"persons": [{"name": "carole easton", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "young women’s trust", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Women in Britain earn almost 140 billion pounds ($195 billion) a year less than men, with many falling into debt or relying on charities for free food, campaigners said on Wednesday.\nMen working full-time earn an average of 39,000 pounds, about a third more than Britain’s 15 million full-time working women, who earn almost 30,000 pounds, government data shows.\n“Where companies find they have a gap, there should be a requirement to put in place a plan to close it,” said Carole Easton, head of anti-poverty group Young Women’s Trust, which produced the figure for women’s lost wages.\n“Without action, today’s young women face a lifetime of unequal pay,” she said in a statement, adding that the pay gap widens when part-time work is taken into account.\nBritain was one of the first countries to introduce a law in 2017 requiring companies with at least 250 workers - which covers almost half of Britain’s workforce - to report pay discrepancies between male and female employees.\nThe government is also investing in free childcare and introducing shared parental leave in a drive to promote gender equality in the workplace.\nAs in many other countries, pay inequality based on gender has been a persistent problem in Britain despite outlawing sex discrimination in the 1970s.\nYoung Women’s Trust said the gender pay gap exists because men tend to be paid more, reach higher positions and are more likely to work in higher-paid industries.\n“Young women are more likely to be on low pay and many are resorting to food banks or falling into debt,” it said, referring to charities that provide emergency supplies.\nThe group called for support for women to enter better-paid, male-dominated sectors, like engineering and construction, and for flexible working hours to enable parents to share childcare.\n“These numbers bring to life the very real impact that has on women’s income, leaving them more exposed to poverty and less able to save for their future,” said Jemima Olchawski, policy chief at the Fawcett Society, a leading women’s rights charity.\n“Women are consistently undervalued in and excluded from the paid economy,” she told the Thomson Reuters Foundation.\nThe BBC’s China Editor Carrie Gracie quit her post this month to fight for her right to pay equality with male peers.\n($1 = 0.7179 pounds)\nReporting by Lee Mannion @leemannion. Editing by Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T03:03:00.000+02:00", "crawled": "2018-01-18T16:01:45.056+02:00", "highlightTitle": ""}