{"organizations": [], "uuid": "807e6e26b38b1e3530b484adab044d627a76b4f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-siriusxm-beats-2017-subscriber-guidance-issues-2018-subscriber-and-financial-guidance.html", "country": "US", "domain_rank": 767, "title": "SiriusXM Beats 2017 Subscriber Guidance; Issues 2018 Subscriber and Financial Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:00:00.000+02:00", "replies_count": 0, "uuid": "807e6e26b38b1e3530b484adab044d627a76b4f7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-siriusxm-beats-2017-subscriber-guidance-issues-2018-subscriber-and-financial-guidance.html", "ord_in_thread": 0, "title": "SiriusXM Beats 2017 Subscriber Guidance; Issues 2018 Subscriber and Financial Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 10, 2018 /PRNewswire/ -- SiriusXM today announced it added approximately 1.56 million self-pay subscribers to finish 2017 with approximately 27.5 million self-pay subscribers, improving upon the company's increased guidance by approximately 160,000 net additions. Total net subscriber additions in 2017 were approximately 1.39 million, resulting in total subscribers of 32.7 million at year end.\nThe company also announced that it expects to meet or exceed its 2017 guidance for revenue, adjusted EBITDA and free cash flow.\n\"2017 was a year of remarkable performance for SiriusXM, and I congratulate our team on its hard work and efforts to achieve these results. In addition to ending the year with a record number of subscribers and setting new high water marks for revenue, adjusted EBITDA, and free cash flow, we made substantial progress in our efforts to win business in used cars and deploy our next-generation 360L platform. We also continued to return significant capital to stockholders in 2017 via stock buybacks and an increased dividend, and we have set ambitious targets for continued growth in 2018,\" said Jim Meyer, SiriusXM's Chief Executive Officer.\nThe company also issued 2018 guidance for self-pay net subscriber additions, revenue, adjusted EBITDA and free cash flow:\nSelf-pay net subscriber additions of approximately 1 million, Revenue of approximately $5.7 billion, Adjusted EBITDA of approximately $2.15 billion, and Free cash flow of approximately $1.5 billion.\n\"We are very pleased to project adjusted EBITDA growth in 2018 despite the unexpected increase in our royalty rate for the use of sound recordings recently imposed by the Copyright Royalty Board. The projected increase in adjusted EBITDA again highlights the durability and flexibility of our business. Revenue growth will remain strong despite the adoption of the new revenue recognition accounting standard (FASB ASU 2014-09) that was effective January 1, 2018, reclassifying approximately $90 million of revenue to offset expenses principally related to automaker agreements. We are also pleased with the recent tax reform act which is expected to increase our cash generation by nearly $900 million over the next 4 years and $200 million in annual tax savings for us beyond that,\" noted David Frear, SiriusXM's Senior Executive Vice President and Chief Financial Officer.\nAbout SiriusXM\nSirius XM Holdings Inc. (NASDAQ: SIRI) is the world's largest radio company measured by revenue and has approximately 32.7 million subscribers. SiriusXM creates and offers commercial-free music; premier sports talk and live events; comedy; news; exclusive talk and entertainment, and a wide-range of Latin music, sports and talk programming. SiriusXM is available in vehicles from every major car company and on smartphones and other connected devices as well as online at siriusxm.com . SiriusXM radios and accessories are available from retailers nationwide and online at SiriusXM. SiriusXM also provides premium traffic, weather, data and information services for subscribers through SiriusXM Traffic™, SiriusXM Travel Link, NavTraffic®, NavWeather™. SiriusXM delivers weather, data and information services to aircraft and boats through SiriusXM Aviation™ and SiriusXM Marine™. In addition, SiriusXM Music for Business provides commercial-free music to a variety of businesses. SiriusXM holds a minority interest in SiriusXM Canada which has approximately 2.8 million subscribers. SiriusXM is also a leading provider of connected vehicles services, giving customers access to a suite of safety, security, and convenience services including automatic crash notification, stolen vehicle recovery assistance, enhanced roadside assistance and turn-by-turn navigation.\nTo download SiriusXM logos and artwork, visit http://www.siriusxm.com/LogosAndPhotos .\nThis communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements. SiriusXM is providing non‐GAAP information on a prospective basis that excludes certain items because of the nature of these items and the impact they have on the analysis of underlying business performance and trends. We believe investors find these Non-GAAP financial useful in evaluating our core trends because they provide a direct view of our underlying contractual costs. This information should be viewed in addition to, and not as an alternative for or superior to, our results prepared in accordance with GAAP. In addition, SiriusXM's Non-GAAP financial measures may not be comparable to similarly-titled measures by other companies. SiriusXM does not provide a non-GAAP reconciliation for Adjusted EBITDA guidance to Net income or Free cash flow guidance to Net cash provided by operating activities because it does not provide guidance for the reconciling items between adjusted EBITDA to Net income, which includes the provision for income taxes, interest expense and other income, nor does the Company provide guidance for the reconciling items between Free cash flow to Net cash provided by operating activities, which includes additions to property and equipment. As items that impact Net income and Net cash provided by operating activities are out of the Company's control and/or cannot be reasonably predicted, the Company is unable to provide such guidance as the most directly comparable GAAP financial measures may vary materially from the corresponding GAAP financial measures. Accordingly, a reconciliation to Net income and Net cash provided by operating activities is not available without unreasonable effort.\nThe following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements: our substantial competition, which is likely to increase over time; our ability to attract and retain subscribers, which is uncertain; interference to our service from wireless operations; consumer protection laws and their enforcement; unfavorable outcomes of pending or future litigation; the market for music rights, which is changing and subject to uncertainties; our dependence upon the auto industry; general economic conditions; the security of the personal information about our customers; existing or future government laws and regulations could harm our business; failure of our satellites would significantly damage our business; the interruption or failure of our information technology and communications syste", "external_links": ["http://www.sec.gov/", "http://www.prnewswire.com/news-releases/siriusxm-beats-2017-subscriber-guidance-issues-2018-subscriber-and-financial-guidance-300580342.html", "http://www.siriusxm.com/LogosAndPhotos"], "published": "2018-01-10T16:00:00.000+02:00", "crawled": "2018-01-10T19:16:43.007+02:00", "highlightTitle": ""}