{"organizations": [], "uuid": "d7f0400f3dbbeabef162f7ef76b6c434cc4358fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/903914330.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/amazon-salary-history-wage-gap/", "country": "US", "domain_rank": 1196, "title": "Amazon Recruiters No Longer Allowed to Ask About Salary History | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.45, "site_type": "news", "published": "2018-01-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "d7f0400f3dbbeabef162f7ef76b6c434cc4358fa"}, "author": "Valentina Zarya", "url": "http://fortune.com/2018/01/18/amazon-salary-history-wage-gap/", "ord_in_thread": 0, "title": "Amazon Recruiters No Longer Allowed to Ask About Salary History | Fortune", "locations": [], "entities": {"persons": [{"name": "phil murphy", "sentiment": "none"}], "locations": [{"name": "oregon", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "golden state", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "amazon recruiters", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "cisco", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 \nWill this be the year we finally make progress in closing the gender pay gap? \nIt’s only the middle of January, but 2018 has already seen the implementation of new laws and policies that have the potential to boost women’s paychecks. The latest news comes from Amazon , which this week banned its hiring managers from asking prospective hires about their salary histories, according to BuzzFeed . \nThe tech giant follows in the footsteps of companies like Google , Facebook , and Cisco , which earlier this month were legally banned from posing the question to potential employees in California, thanks to a new law that took effect on Jan. 1 . Though the law technically applies only to those who work in the Golden State, most have proactively applied the law to all of their U.S. hires. Massachusetts, Oregon, Philadelphia, New York City, and San Francisco have passed similar laws over the past couple of years —though Amazon’s home state of Washington has yet to do so. \nAlso this week, New Jersey Gov. Phil Murphy signed an executive order banning state agencies—though not private companies—from asking the controversial question. (The rule takes effect on Feb. 1). New York, Delaware, New Orleans, Pittsburg, and Albany already have similar laws in effect. \nWhile such laws technically apply to a specific jurisdiction, they may have a broader effect. Rather than creating a different set of policies for various cities and states, some companies simply use the strictest set of employment laws as the benchmark for the entire company’s human resources policies. This may explain why major employers like Amazon, which has half a million workers across the country, are opting to embrace a blanket rule. \nMany of the policy changes are being positioned as efforts to fight the pay gap that plagues women and people of color. In Gov. Murphy’s statement accompanying the executive order, he called the policy, “the first meaningful step towards gender equity and fighting the gender pay gap.” \nIn 2016, women made about 80 cents on a man’s dollar , a number that has remained mostly stagnant. The gap is wider for women of color and has been growing for Millennial women . One of the reasons for this, says Andrea Johnson, senior counsel for state policy at the National Women’s Law Center (NWLC), is the salary history question, which “forces women to carry pay discrimination with them from job to job.” \nJohnson calls the efforts to ban the question “exciting,” but notes that such laws are just one piece of the puzzle. Her organization is currently focused on pushing for pay transparency laws, which have already gone into effect in Iceland and the U.K. An Obama-era effort to collect salary information via EEO-1 forms—which must be filled out by any company with 100 or more—has been rolled back under the current administration . The NWLC is one of the dozens of civil rights groups challenging that decision. \nWithout the support of the federal government, companies’ embrace of policies that advance fair pay—such as Amazon’s move to ban the salary history question and Citigroup’s recent decision to share pay data —are especially important and powerful. Says Johnson: “It’s harder to de-bias minds and easier to de-bias processes.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T02:00:00.000+02:00", "crawled": "2018-01-20T18:41:10.009+02:00", "highlightTitle": ""}