{"organizations": [], "uuid": "a0038154cdf4c93d6e957eddb727eb4ff02ab582", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/28/the-associated-press-ingvar-kamprad-who-founded-furniture-giant-ikea-dies-at-91.html", "country": "US", "domain_rank": 767, "title": "Ingvar Kamprad, who founded furniture giant IKEA, dies at 91", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T13:18:00.000+02:00", "replies_count": 0, "uuid": "a0038154cdf4c93d6e957eddb727eb4ff02ab582"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/28/the-associated-press-ingvar-kamprad-who-founded-furniture-giant-ikea-dies-at-91.html", "ord_in_thread": 0, "title": "Ingvar Kamprad, who founded furniture giant IKEA, dies at 91", "locations": [], "entities": {"persons": [{"name": "ingvar kamprad", "sentiment": "negative"}, {"name": "kamprad", "sentiment": "none"}, {"name": "jesper brodin", "sentiment": "none"}], "locations": [{"name": "stockholm", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "smaland", "sentiment": "none"}], "organizations": [{"name": "ikea", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "ikea group", "sentiment": "none"}, {"name": "ikea sverige", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STOCKHOLM (AP) — IKEA founder Ingvar Kamprad, who turned a small-scale mail order business started on his family's farm into a furniture empire by letting customers piece together his simple and inexpensive furniture themselves, has died at age 91.\nKamprad died on Saturday at his home in Smaland, in southern Sweden, the chain's Swedish unit, IKEA Sverige, said on Twitter on Sunday. He died peacefully following a short illness, it said.\n\"He will be much missed and warmly remembered by his family and IKEA staff all around the world,\" the company said.\nThe IKEA Group's president, Jesper Brodin, said Kamprad's \"legacy will be admired for many years to come and his vision — to create a better everyday life for many people — will continue to guide and inspire us.\"\nKamprad's life story is intimately linked to the company he founded at age 17 on the family farm. His work ethic, frugality and down-to-earth style remain at the core of its corporate identity today. But his missteps in life, including early flirtations with Nazism, never rubbed off on IKEA, one of the world's most recognizable brands.\nAlong the way, Kamprad became extremely rich, though estimates of his wealth vary wildly, from slightly more than $100 million to nearly $60 billion when he died.\nKamprad formed the company's name from his own initials and the first letters of the family farm, Elmtaryd, and the parish where it's located, Agunnaryd. The farm is in the heart of Smaland, a forested province whose people are known for their thrift and ingenuity, qualities Kamprad possessed.\nKamprad, despite his wealth, never adopted the aura of a tycoon, though his name regularly appeared on lists of the world's richest men. He drove a modest Volvo and dressed unassumingly. In a 1998 book he co-authored about IKEA's history, he described his habit of visiting vegetable street markets right before they closed for the day, hoping to get better prices.\nHis reputation for living modestly became part of a carefully crafted image perpetuated by him and his company, his former executive assistant Johan Stenebo said.\n\"He wanted to appear a man of the people, one of us,\" Stenebo wrote in a behind-the-scenes book, \"The Truth About Ikea,\" released shortly after he left the company nearly a decade ago.\nKamprad, who was born on March 30, 1926, was a precocious entrepreneur who sold matchboxes to neighbors from his bicycle. He found that he could buy the matchboxes in bulk very cheaply from Stockholm and sell them at a low price but still make a good profit. From matches, he expanded to selling fish, Christmas tree decorations, seeds and later ballpoint pens and pencils.\nHe soon moved away from making sales calls and began advertising in local newspapers and operating a makeshift mail order catalog. He distributed his products via the local milk van, which delivered them to the nearby train station.\nIn 1950, Kamprad introduced furniture, pieces produced by manufacturers in the forests close to his home, into his catalog. After the positive response he received, he decided to discontinue all other products and focus on low-priced furniture.\nSince then the IKEA concept — keeping prices low by letting customers put together the furniture themselves — offers affordable home furnishings at stores across the globe.\nThe concept of selling unassembled future in flat boxes was revolutionary at the time, said Neil Saunders, managing director of the research firm GlobalData Retail.\n\"He believed people should be able to buy quality furniture at accessible prices, as long as they were willing to do some assembly themselves,\" Saunders said. \"He really left an indelible imprint on retail and on consumers' lives.\"\nBut IKEA'S often-confounding assembly instructions have flummoxed so many people through the years that some couldn't resist wondering how long it might take to put together Kamprad's coffin in macabre posts on Twitter.\nBefore Kamprad's company became a household word, he formed allegiances that came back to haunt him.\nIn 1994, Swedish newspaper Expressen reported that Kamprad had contacts with Swedish fascist leader Per Engdahl in the 1940s and '50s. In a letter to IKEA employees, Kamprad acknowledged that he once had sympathies for the far-right leader and called it \"a part of my life which I bitterly regret.\"\nIn the 1998 book, he gave more details about his youthful \"delusions,\" saying he had been influenced as a child by his German grandmother's strong support for Adolf Hitler.\n\"Now I have told all I can,\" he said at a book release ceremony at an IKEA store in suburban Stockholm. \"Can one ever get forgiveness for such stupidity?\"\nThe book also contained details about his struggles with alcohol and his successes and failures in business.\nIKEA celebrates its Swedish heritage: Its stores are painted blue and yellow like the Swedish flag and serve meatballs and other traditional Swedish food. But Kamprad's relationship with his homeland was sometimes complicated.\nHe moved to Switzerland in the late 1970s to avoid paying Swedish taxes, which at the time were the highest in the world. He decided to return home only after his second wife died in 2011.\nThe estate inventory filed to Swedish tax authorities in 2013 confirmed that the couple lived comfortably but hardly in opulence. They had two cars, a 2008 Skoda and a 1993 Volvo 240. Kamprad's personal wealth was established at 750 million kronor ($113 million), a considerable amount but far from the multibillion-dollar sums attributed to him on world's-richest lists compiled by Forbes and others.\nIKEA officials have said such lists, which compared his wealth to that of Warren Buffet or Bill Gates, erroneously considered IKEA's assets as his own. IKEA is owned by a foundation Kamprad created, whose statutes require profits to be reinvested in the company or donated to charity.\nThe estate inventory showed that Kamprad had donated more than $20 million to philanthropic causes in 2012 alone.\nIn June 2013, Kamprad announced he would retire from the board that controls the IKEA brand as part of moves to hand responsibilities over to one of his sons.\nAlthough he was no longer involved in IKEA's daily operations, his principles remained deeply ingrained in the company, which sometimes operated more like a secretive cult than a business, according to Stenebo's book.\n\"There was an unwritten law for Ikea's upper management — loyalty to Ingvar until death,\" Stenebo wrote.\nJari Tanner contributed from Helsinki, Finland. AP Business Writer Michael Liedtke contributed from San Francisco.", "external_links": [], "published": "2018-01-28T13:18:00.000+02:00", "crawled": "2018-01-29T03:47:28.016+02:00", "highlightTitle": ""}