{"organizations": [], "uuid": "3047436837f2da2167e8fb000985bb73314a06fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-metricstream-appoints-mikael-hagstroem-as-new-ceo.html", "country": "US", "domain_rank": 767, "title": "MetricStream Appoints Mikael Hagstroem as New CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:35:00.000+02:00", "replies_count": 0, "uuid": "3047436837f2da2167e8fb000985bb73314a06fc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-metricstream-appoints-mikael-hagstroem-as-new-ceo.html", "ord_in_thread": 0, "title": "MetricStream Appoints Mikael Hagstroem as New CEO", "locations": [], "entities": {"persons": [{"name": "mikael hagstroem", "sentiment": "negative"}, {"name": "archambeau", "sentiment": "none"}, {"name": "mikael", "sentiment": "none"}, {"name": "shellye archambeau", "sentiment": "none"}, {"name": "hagstroem", "sentiment": "none"}], "locations": [{"name": "palo alto", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "metricstream", "sentiment": "negative"}, {"name": "sas", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "sas institute", "sentiment": "none"}, {"name": "mckinsey", "sentiment": "none"}, {"name": "grc", "sentiment": "none"}, {"name": "mckinsey analytics", "sentiment": "none"}, {"name": "united states council for international business", "sentiment": "none"}, {"name": "global agenda council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALO ALTO, Calif., Jan. 3, 2018 /PRNewswire/ -- MetricStream, a leading provider of Governance, Risk, and Compliance (GRC) Apps and Solutions, announced today that Mikael Hagstroem will succeed Shellye Archambeau as President and Chief Executive Officer effective January 2018. Ms. Archambeau will join and continue to actively serve the company on MetricStream's board of directors.\nPreviously, Mr. Hagstroem served as Partner and COO of McKinsey Analytics, where he helped clients harness high-performance analytics to reshape their business models, modernize their organizations, and unlock competitive advantage and growth. Prior to McKinsey, Mikael was EVP at SAS Institute, where he led more than 5,000 employees across 48 countries, and over 25 years grew a multibillion-dollar software business, contributing to SAS' leadership in business analytics and risk intelligence. He currently serves on the executive committee of the United States Council for International Business, and has served as chair of the World Economic Forum's Global Agenda Council on Data-Driven Development and chair of the Executive Council of the American Chamber of Commerce to the European Union.\nThe GRC market is at a critical inflection point, where market demands for business insights from risk and compliance data are adding to the ongoing focus of protecting and preserving corporate integrity and reputations. This next chapter in the market will be marked by demands for significant investment and growth in the areas of intelligence and analytics, and the ability to provide sharper and proactive risk insights to drive business outcomes. With the exponential growth in technology innovations and digital business models, MetricStream's customers are looking to leverage their digital data to predict outcomes and automate possible actions, as well as harness and monetize risk intelligence to drive business performance.\nMs. Archambeau stated, \"As I pass the baton on to Mikael, I am confident that with his experience and leadership, MetricStream will continue to accelerate its global growth and enter new markets, drive deeper customer engagement and success, and do what MetricStream does best – innovate. I enthusiastically welcome Mikael as MetricStream's new CEO.\"\nMr. Hagstroem commented, \"I'm thrilled to take the helm at MetricStream, where I will have the opportunity to lead the company into this next exciting phase of customer-centric innovation and growth. Together with industry shaping organizations including global 2000 customers, incredible partners, and the world-class team at MetricStream, we are well placed to make GRC fit for the digital age.\"\nMetricStream remains on its growth path as the leading independent GRC company in the world, and continues to inspire confidence from the market and investment community. With its latest financing round led by Clearlake Capital, with participation from EDBI and contributions from existing investors including Goldman Sachs, Sageview Capital and others, along with the successful launch of M7, MetricStream is truly bringing GRC into the future.\nMetricStream Executive Chairman, Gunjan Sinha commented, \"We are delighted to welcome Mikael as the new President and CEO of MetricStream. Mikael's background and experience leading global teams and building a successful global software solutions and analytics business will enable MetricStream to continue to lead with GRC. Shellye's legacy of strong leadership will continue as she joins MetricStream's board of directors where she will contribute valuable guidance and insight.\"\nAbout MetricStream\nMetricStream, the independent market leader in enterprise and cloud applications for Governance, Risk, Compliance (GRC) and Quality Management, makes GRC simple. MetricStream apps and solutions improve business performance by strengthening risk management, corporate governance, regulatory compliance, vendor governance, and quality assurance for hundreds of thousands of users in dozens of industries, including Financial Services, Healthcare, Life Sciences, Energy and Utilities, Food, Retail, CPG, Government, Hi-Tech and Manufacturing. MetricStream is headquartered in Palo Alto, California, with an operations and R&D center in Bangalore, India, and sales and operations support in 12 other cities globally. ( www.metricstream.com )\nMedia Contact :\nMolly Palm\nUS: +1 (925) 451-1468\n188152@email4pr.com\nView original content: http://www.prnewswire.com/news-releases/metricstream-appoints-mikael-hagstroem-as-new-ceo-300576400.html\nSOURCE MetricStream", "external_links": ["http://www.metricstream.com/", "http://www.prnewswire.com/news-releases/metricstream-appoints-mikael-hagstroem-as-new-ceo-300576400.html"], "published": "2018-01-03T16:35:00.000+02:00", "crawled": "2018-01-03T16:27:54.010+02:00", "highlightTitle": ""}