{"organizations": [], "uuid": "0e71374ee2467e1db24072a074861e92a56a9be6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-greystar-acquires-170-unit-class-a-zig-apartments-in-seattleas-prestigious-first-hill-neighborhood.html", "country": "US", "domain_rank": 767, "title": "Greystar Acquires 170-Unit Class A Zig Apartments in Seattle’s Prestigious First Hill Neighborhood", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.033, "site_type": "news", "published": "2018-01-22T20:30:00.000+02:00", "replies_count": 0, "uuid": "0e71374ee2467e1db24072a074861e92a56a9be6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-greystar-acquires-170-unit-class-a-zig-apartments-in-seattleas-prestigious-first-hill-neighborhood.html", "ord_in_thread": 0, "title": "Greystar Acquires 170-Unit Class A Zig Apartments in Seattle’s Prestigious First Hill Neighborhood", "locations": [], "entities": {"persons": [{"name": "kevin kaberna", "sentiment": "none"}, {"name": "greystar", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "broadway", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "greystar real estate partners", "sentiment": "negative"}, {"name": "first hill", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE--(BUSINESS WIRE)-- Funds managed by Greystar Real Estate Partners, LLC (“Greystar”), a global leader in the investment, development, and management of high-quality rental housing properties, today announced the acquisition of Zig Apartments, the brand new, 170-unit, core asset. The property also includes 5,018 square feet of retail space. Completed in the summer of 2017 with a full amenity package and luxury finishes, the asset is extremely well-located at 550 Broadway in Seattle’s First Hill neighborhood, offering Class A living with immediate access to the city’s burgeoning tech hub and a vibrant mix of shopping, dining and entertainment options.\n“Zig Apartments offers Greystar a rare opportunity to acquire a best-in-class multifamily asset in the strategic gateway market of Seattle. The property will greatly benefit from the city’s robust employment growth and resulting positive rental trends,” said Kevin Kaberna, Executive Director and leader of Greystar’s US Investment platform. “This core plus acquisition is indicative of Greystar’s continued commitment to acquiring core assets in up-and-coming areas of gateway markets where we can deliver maximum returns and outstanding value to our investors.”\nSeattle leads the country in year-over-year job growth and has reached a record high of almost 1.7 million jobs. For the past seven years, an average of nearly 61,000 jobs have been added to the market annually. The asset’s location at the heart of First Hill, the city's foremost medical community, and adjacent to the Central Business District (CBD), South Lake Union and Capitol Hill neighborhoods uniquely positions it to capitalize on this continued growth. With an address on Broadway, one of the most transit connected street in Seattle, Zig earns a Transit Score of 100 and Walk Score of 97.\nAs the nation’s largest apartment operator, Greystar currently owns 2,206 units in the Seattle Metro Area and manages 21,186 additional units in the region.\nAbout Greystar\nGreystar is a leading, fully integrated multifamily real estate company offering expertise in investment management, development and property management of rental housing properties globally. Headquartered in Charleston, South Carolina with offices throughout the United States, Europe, Latin America and Asia-Pacific, Greystar operates in over 130 markets globally and is the largest operator of apartments in the United States, managing over 420,000 units, with an aggregate estimated value of approximately $80 billion. Greystar also has a robust institutional investment management platform dedicated to managing capital on behalf of a global network of institutional investors with over $23 billion in gross assets under management including more than $8 billion of developments that have been completed or are underway. Greystar was founded by Bob Faith in 1993 with the intent to become a provider of world class service in the rental housing real estate business. To learn more about Greystar, visit www.greystar.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006277/en/\nMedia:\nICR, Inc.\nAngela Bonnici, 646-277-1276\nAngela.Bonnici@icrinc.com\nSource: Greystar Real Estate Partners, LLC", "external_links": ["http://www.businesswire.com/news/home/20180122006277/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.greystar.com&esheet=51746821&newsitemid=20180122006277&lan=en-US&anchor=www.greystar.com&index=1&md5=2c17f6d3a9f9b9e20d519cbc99af2daa"], "published": "2018-01-22T20:30:00.000+02:00", "crawled": "2018-01-22T23:33:56.000+02:00", "highlightTitle": ""}