{"organizations": [], "uuid": "8a662e92bd27721dd08dc6baf081c3f883e02f9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-854119934.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/08/fire-and-fury-publisher-trump/", "country": "US", "domain_rank": 1196, "title": "‘Fire and Fury’ Publisher Blasts Trump in Statement | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.198, "site_type": "news", "published": "2018-01-08T14:10:00.000+02:00", "replies_count": 0, "uuid": "8a662e92bd27721dd08dc6baf081c3f883e02f9a"}, "author": "Chris Morris", "url": "http://fortune.com/2018/01/08/fire-and-fury-publisher-trump/", "ord_in_thread": 0, "title": "‘Fire and Fury’ Publisher Blasts Trump in Statement | Fortune", "locations": [], "entities": {"persons": [{"name": "michael wolff", "sentiment": "neutral"}, {"name": "chris morris", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "none"}, {"name": "john sargent", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}], "organizations": [{"name": "macmillan", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "henry holt and co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Chris Morris 12:10 PM EST \nNow that Michael Wolff’s Fire and Fury is available at bookstores, the publisher has a few words to say about Donald Trump’s attempt to stop its publication. And it’s not mincing any of them. \nCiting several court cases, Macmillan CEO John Sargent blasted the president, saying his demand that the publisher cease and desist from distributing the book was a clear example of prior restraint—and is “flagrantly unconstitutional.” (Macmillan owns Henry Holt and Co., which published the book.) \n“The president is free to call news ‘fake’ and to blast the media. That goes against convention, but it is not unconstitutional,” the publisher said in a statement . “But a demand to cease and desist publication— a clear effort by the President of the United States to intimidate a publisher into halting publication of an important book on the workings of the government—is an attempt to achieve what is called prior restraint. That is something that no American court would order as it is flagrantly unconstitutional.” \nCiting a trio of Supreme Court cases that centered on press freedom, the publisher made its case that it was very much within its rights to publish the book. It was just as insistent that Trump’s actions were appalling for the person who is sworn to protect the Constitution. \n“There is no ambiguity here. This is an underlying principle of our democracy. We cannot stand silent,” it wrote. “We will not allow any president to achieve by intimidation what our Constitution precludes him or her from achieving in court. We need to respond strongly for Michael Wolff and his book, but also for all authors and all their books, now and in the future. And as citizens we must demand that President Trump understand and abide by the First Amendment of our Constitution.” \nFire and Fury sold out in its first day of availability. Macmillan is reportedly rushing a second print of the book now. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-08T14:10:00.000+02:00", "crawled": "2018-01-08T21:10:23.015+02:00", "highlightTitle": ""}