{"organizations": [], "uuid": "568ffdd4049dd070b995ea6616061239b1bb4d20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-massachusetts-marijuana/massachusetts-federal-prosecutor-says-opioids-top-pot-as-priority-idUSKBN1FD2M4", "country": "US", "domain_rank": 408, "title": "Massachusetts federal prosecutor says opioids top pot as priority", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T20:10:00.000+02:00", "replies_count": 0, "uuid": "568ffdd4049dd070b995ea6616061239b1bb4d20"}, "author": "", "url": "https://www.reuters.com/article/us-massachusetts-marijuana/massachusetts-federal-prosecutor-says-opioids-top-pot-as-priority-idUSKBN1FD2M4", "ord_in_thread": 0, "title": "Massachusetts federal prosecutor says opioids top pot as priority", "locations": [], "entities": {"persons": [{"name": "nate raymond", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "andrew lelling", "sentiment": "none"}, {"name": "lelling", "sentiment": "none"}], "locations": [{"name": "massachusetts", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 6:13 PM / in 21 minutes Massachusetts federal prosecutor: opioids, not pot, are priority Nate Raymond 3 Min Read \nBOSTON (Reuters) - Massachusetts’ new federal prosecutor said on Wednesday he will not rule out prosecuting marijuana businesses in a state that has legalized the drug, but stressed that his focus is on the opioid epidemic. \n“The No. 1 enforcement priority for my office is the opioid crisis,” said U.S. Attorney Andrew Lelling. “As I was pointing out to someone the other day, 2,100 people in Massachusetts were killed by opioid overdoses last year, not marijuana overdoses.” \nLelling sought to clarify his stance on marijuana prosecutions in the first press conference in his new role after Republican President Donald Trump’s administration rescinded an Obama-era policy easing federal enforcement in states that legalized the drug. \nMassachusetts is among nine U.S. states that have legalized recreational marijuana use, which remains illegal under federal law. State voters in 2016 backed an initiative legalizing its recreational use and retail sales could begin later this year. \nBut on Jan. 4, U.S. Attorney General Jeff Sessions rescinded a policy put in place under Democratic President Barack Obama that limited enforcement of marijuana laws where the drug had been legalized. \nThe new policy gave U.S. attorney’s offices discretion in how they enforced the law. Lelling, a Trump nominee who took office in December, said on Jan. 8 he would not promise to refrain from prosecuting state-sanctioned marijuana businesses. \nThose remarks worried advocates for Massachusetts’ nascent marijuana industry. Lelling said on Wednesday people “have lost sight a little bit of the prior statements of the office.” \nHe said the 14 prosecutors he oversees devoted to drug cases were focused on fentanyl and heroin traffickers. The U.S. Centers for Disease Control and Prevention says opioids were involved in over 42,000 overdose deaths around the country in 2016. \n“That is where my resources are going right now,” Lelling said. \nHe also said he was open to pursuing cases over corporations’ roles in the opioid epidemic. \nMedical marijuana businesses would not be a priority, he said, given a budget rule that prevents the Justice Department from spending funds to interfere with state medical marijuana laws. \nBut he would not rule out investigating banks that open accounts for marijuana businesses. \n“I‘m a not a policymaker,” he said. “I just deal with the law as it is. The law as it should be? That’s somebody else.” Reporting by Nate Raymond; Editing by Scott Malone, G Crosse and Frances Kerry", "external_links": [], "published": "2018-01-24T20:10:00.000+02:00", "crawled": "2018-01-24T20:29:56.051+02:00", "highlightTitle": ""}