{"organizations": [], "uuid": "23bc9bb4e77346d28e8fe9c4329118c74ed2fd68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222518008&w=1200&r=LYNXMPEE0F1H3", "site_section": "http://feeds.reuters.com/reuters/entertainment", "section_title": "Reuters: Entertainment News", "url": "https://www.reuters.com/article/us-usa-trump-media/the-fakeys-comedians-turn-tables-on-trumps-fake-news-awards-idUSKBN1F52L1", "country": "US", "domain_rank": 408, "title": "'The Fakeys': Comedians turn tables on Trump's 'fake news' awards", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T22:10:00.000+02:00", "replies_count": 0, "uuid": "23bc9bb4e77346d28e8fe9c4329118c74ed2fd68"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-media/the-fakeys-comedians-turn-tables-on-trumps-fake-news-awards-idUSKBN1F52L1", "ord_in_thread": 0, "title": "'The Fakeys': Comedians turn tables on Trump's 'fake news' awards", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jimmy kimmel", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "samantha bee", "sentiment": "none"}, {"name": "jill serjeant", "sentiment": "none"}, {"name": "stephen colbert", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "times square", "sentiment": "none"}], "organizations": [{"name": "min read  los angeles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (Reuters) - Comedian Samantha Bee is campaigning for “Shrillest Reporting,” late-night talk show host Stephen Colbert put up a billboard in New York’s Times Square in a bid to win votes, and rival Jimmy Kimmel calls them “The Stupid People’s Choice Awards.”\nFar from silencing these critics, U.S. President Donald Trump’s announcement that he would hand out awards for what he calls “fake news” has fired up comics and media commentators - and has them competing for a “prize.”\nTrump, who has frequently criticized the press, calling them “the enemy of the people,” often uses the term “fake news” to cast doubt on reports critical of him or his administration, many times without presenting evidence to support his case.\nTrump on Jan. 2 tweeted that he planned to announce “THE MOST DISHONEST & CORRUPT MEDIA AWARDS OF THE YEAR” six days later. He then postponed the event until Jan. 17, saying on Twitter, “The interest in, and importance of, these awards is far greater than anyone could have anticipated!”\nLate-night TV hosts, who have mocked Trump since his 2016 election win, swiftly dubbed the awards “The Fakeys” or “The Trumpies.”\nColbert, host of “The Late Show” on CBS, is campaigning for “Fakest Dishonesty,” “Dishonestest Corruption” and “Smallest Button” among several other made-up categories.\nA billboard for late-night talk show host Stephen Colbert is seen near Times Square in the Manhattan borough of New York City. New York, U.S., January 16, 2018. REUTERS/Mike Segar In the spirit of Hollywood’s movie awards season now underway, “The Daily Show” on Comedy Central took out a spoof full-page “for your consideration” ad in the New York Times, touting the program’s qualifications.\nIn a tongue-in-cheek war of insults, “The Daily Show” has also run videos asking whether Colbert and comic Samantha Bee of “Full Frontal” on TBS “can really be mistrusted,” and proclaiming the satirical show’s South African-born host, Trevor Noah, “literally un-American.”\nA billboard for late-night talk show host Stephen Colbert is seen near Times Square in the Manhattan borough of New York City. New York, U.S., January 16, 2018. REUTERS/Mike Segar Public radio’s predominantly serious “On the Media” show last week ran spoof red-carpet coverage of “The Fakeys,” with various newspaper and TV journalists jostling for fake-news honors.\nAs of Tuesday, the White House had not given any details of whether or how Trump intended to go ahead with his awards.\nHis announcement followed nearly a year in which, according to a Washington Post analysis, Trump made some 2,000 false or misleading statements in his first 12 months in office.\nThe term “fake news” was originally coined to describe false reports, often spread through social media and sometimes aimed at supporting or hurting a political figure.\nFacebook and Twitter have said they have found tens of thousands of posts or accounts linked to Russian-based operatives, many of them spreading misinformation in the months before and after the 2016 election.\nReporting by Jill Serjeant; Editing by Jonathan Oatis\n ", "external_links": [], "published": "2018-01-16T22:10:00.000+02:00", "crawled": "2018-01-16T22:19:26.001+02:00", "highlightTitle": ""}