{"organizations": [], "uuid": "4ecd2f9fcc8ddb50976b9af5d37124d9ea3cd384", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-inspirata-acquires-toronto-based-artificial-intelligence-in-medicine-inc-aim-to-enhance-its-rd-in-artificial-intelligence.html", "country": "US", "domain_rank": 767, "title": "Inspirata Acquires Toronto-based Artificial Intelligence In Medicine, Inc. (AIM) to Enhance its R&D in Artificial Intelligence and Natural Language Processing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-02T20:00:00.000+02:00", "replies_count": 0, "uuid": "4ecd2f9fcc8ddb50976b9af5d37124d9ea3cd384"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-inspirata-acquires-toronto-based-artificial-intelligence-in-medicine-inc-aim-to-enhance-its-rd-in-artificial-intelligence.html", "ord_in_thread": 0, "title": "Inspirata Acquires Toronto-based Artificial Intelligence In Medicine, Inc. (AIM) to Enhance its R&D in Artificial Intelligence and Natural Language Processing", "locations": [], "entities": {"persons": [], "locations": [{"name": "fl", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}], "organizations": [{"name": "inspirata acquires toronto-based artificial intelligence in medicine, inc.", "sentiment": "neutral"}, {"name": "nlp", "sentiment": "none"}, {"name": "artificial intelligence in medicine, inc.", "sentiment": "none"}, {"name": "inspirata ® , inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tampa, FL, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Cancer informatics and digital pathology workflow solution provider Inspirata ® , Inc. announced today that it has acquired Toronto-based Artificial Intelligence in Medicine, Inc. (AIM). AIM has spent more than 30 years developing and commercializing tools that leverage Artificial Intelligence (AI) and Natural Language Processing (NLP) to extract cancer related information and data from clinical documents, such as pathology reports, molecular testing reports, treatment plans and clinician’s notes.\nNLP is the application of computer science, linguistics and AI to interpret narrative text. More than 65 percent of clinical data is in the form of unstructured text in healthcare documents stored in electronic medical records and laboratory information systems. Without the use of NLP and other AI techniques to make this data available efficiently and accurately for analysis and reporting, cancer centers must resort to manual data abstraction, which is expensive, time consuming and error prone.\nOnce extracted from source documents and files, the discrete cancer data, which includes specific tumor properties, such as size, margins, nodal involvement, stage, grade, laterality as well as patient demographics and other information, can be stored and readily searched to create specific datasets needed for analysis and reporting. This includes the reports that U.S. cancer centers must provide to their state National Program of Cancer Registries (NPCR) as well as the National Cancer Institute’s Surveillance, Epidemiology and End Results Program (SEER). These federally mandated registries are responsible for reporting to the Center for Disease Control (CDC) all invasive cancers diagnosed in their respective states. In addition to Cancer Registry reporting requirements, cancer centers need to be able to employ cancer data for population health studies, to evaluate quality metrics, identify patient cohorts for clinical trials and cancer research, as well as for a wide range of other applications.\n“The acquisition of AIM is extremely strategic for Inspirata because it enables us to bolster our own NLP development efforts by leveraging AIM’s 30+ years in this field,” says Inspirata CEO Satish Sanan. “AIM has an outstanding group of NLP engineers and data scientists as well as a solid leadership team that will remain in place and continue to focus on R&D and business growth. This acquisition also establishes a solid footprint for Inspirata in Canada, allowing us to better grow our customer base to our north.”\n“After spending the last 34 years building AIM into a leader in creating technologies to improve cancer care, I am confident that I am leaving behind a great legacy and turning the future of AIM over to an organization that is equally committed to the same goals we’ve always had,” says AIM founder and CEO, Peter Brueckner. “Continuity is so very important and that is why our current Vice President of Engineering, Jack Golabek, will become the new CEO of AIM, reporting directly to Satish. I am confident that what we have built over the last three decades will flourish within Inspirata and that AIM’s technology will form the foundation for a suite of superior cancer informatics products.”\nAbout AIM, Inc.\nArtificial Intelligence in Medicine, Inc. (AIM) is a software engineering firm focused on using informatics to improve healthcare by designing, developing and deploying information systems for the healthcare industry and cancer control. For more information, visit http://www.aim.ca/about/ .\nAbout Inspirata, Inc.\nInspirata ® , Inc. offers the most comprehensive cancer diagnostics workflow solution available for precision diagnosis today. The solution, which employs a unique “solution-as-a-service” business and delivery model, accelerates anatomic and molecular pathology workflows and facilitates whole slide imaging and image analytics, prognostic and predictive assays, remote consultations and tumor boards. This comprehensive solution includes an Enterprise Service Bus (ESB) to help to solve interoperability issues and a Natural Language Processing Engine (NLP) for structuring data. Inspirata amalgamates this structured data into a central multi-institutional and multi-modal big data cancer repository for clinical, research and educational purposes. Its use will extend to physicians, patients, researchers and pharma among others. This comprehensive solution facilitates a modern precision diagnosis to build a strong foundation for precision medicine. For more information, please visit www.inspirata.com or contact info@inspirata.com .\nAll trademarks used herein are the property of their respective owners.\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/db68a2b3-52df-4f2f-aa60-4259dfd50f7d\nMarjorie Bulone Inspirata, Inc. +813-570-8905 mbulone@inspirata.com Jack Golabek AIM, Inc. +416-594-9393 ext. 226 jgolabek@aim.ca\nSource:Inspirata, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=OuMF_Vh4tcf_xC5rq41J9Su3iju4UjhJmXmv7OxgwEZ0X6DrlpOhTWLOPVb6WYxAjXK0xD_BGdGFMko-wGjrEw==", "https://www.globenewswire.com/Tracker?data=cCOAH8BvhxdbSuS6ZPHuL3hhpyjofAWmeTFnTWzu0m8tMdIOEABW_Kqr5I7NCTNttRUuonaA6G4yjg3ni_ItcQ==", "https://www.globenewswire.com/Tracker?data=uiU_bWePOutsiUU3iIrWf7h97oN3E2Q-So8ERLDaVvoFFACMajfkgpqX8TUEVwADDofaXjGx421y2D-yaMMUTEWfR8fN57Yj0NvNuX9gutg=", "https://www.globenewswire.com/Tracker?data=YcCDLqqefdxjiTaC7cbz_7TaO5-TISNRPfL3yFtpbsUja3BI3lp2da87nyk-_cKhVzoWpxSBW47bSWxDulSuYpQP_DoYyK74PqF7KrVAdem6gjOhZELaSFVomQMb94YbJXRgr0XvnS7Jfqt0q3D5boB_dpRgqjJ17sqrbxsQczsi9IOJjccT6bnU3msi2cl50dKOT55Fw54XJreAPUK7tyHIgNMhU2seqicNRQhUsB2mpBjAnXDHza4rbavO5WUXhxot2AZchBMbXlqbmrlOUQ==", "http://www.aim.ca/about/", "http://www.globenewswire.com/NewsRoom/AttachmentNg/db68a2b3-52df-4f2f-aa60-4259dfd50f7d", "https://www.globenewswire.com/NewsRoom/AttachmentNg/db68a2b3-52df-4f2f-aa60-4259dfd50f7d/en", "https://www.globenewswire.com/Tracker?data=YcCDLqqefdxjiTaC7cbz_59G-3-s8PwQuKyvYboK1k0dgcEHNCtmFPRSyywIUr_7sPQ9muUGfOQL8dCQrbIQjfq4wTYWiGIqgDjN-FzP7DE="], "published": "2018-01-02T20:00:00.000+02:00", "crawled": "2018-01-02T21:34:23.003+02:00", "highlightTitle": ""}