{"organizations": [], "uuid": "66dfa6685bf454bb8fb47e3ce2d16a0e0236a920", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-hawaiian-holdings-reports-2017-fourth-quarter-and-full-year-financial-results.html", "country": "US", "domain_rank": 767, "title": "Hawaiian Holdings Reports 2017 Fourth Quarter and Full Year Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-30T00:01:00.000+02:00", "replies_count": 0, "uuid": "66dfa6685bf454bb8fb47e3ce2d16a0e0236a920"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-hawaiian-holdings-reports-2017-fourth-quarter-and-full-year-financial-results.html", "ord_in_thread": 0, "title": "Hawaiian Holdings Reports 2017 Fourth Quarter and Full Year Financial Results", "locations": [], "entities": {"persons": [{"name": "mark dunkerley", "sentiment": "none"}], "locations": [{"name": "ha", "sentiment": "none"}, {"name": "honolulu", "sentiment": "none"}], "organizations": [{"name": "hawaiian holdings, inc.", "sentiment": "neutral"}, {"name": "hawaiian airlines, inc.", "sentiment": "none"}, {"name": "hawaiian airlines", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONOLULU, Jan. 29, 2018 /PRNewswire/ -- Hawaiian Holdings, Inc. (NASDAQ: HA) (the \"Company\"), parent company of Hawaiian Airlines, Inc. (\"Hawaiian\"), today reported its financial results for the fourth quarter and full year 2017.\nFourth Quarter 2017 - Key Financial Metrics\nGAAP\nYoY Change\nAdjusted\nYoY Change\nNet Income\n$172.1M\n+$170.2M\n$57.5M\n$(11.3)M\nDiluted EPS\n$3.29\n+$3.25\n$1.10\n$(0.18)\nPre-tax Margin\n16.0%\n+15.4 pts.\n13.6%\n(4.0) pts.\nFull Year 2017 - Key Financial Metrics\nGAAP\nYoY Change\nAdjusted\nYoY Change\nNet Income\n$364.0M\n+$128.6M\n$301.1M\n+$21.1M\nDiluted EPS\n$6.82\n+$2.46\n$5.64\n+$0.45\nPre-tax Margin\n15.2%\n(0.3) pts.\n17.6%\n(0.8) pts.\n\"We're delighted to report record earnings for 2017 after our fourth quarter results cap an extremely strong year for Hawaiian\" said Mark Dunkerley, Hawaiian Airlines president and CEO. \"Robust demand in all of our major geographies and moderate industry capacity growth offset the rising price of fuel. We carried more guests this year than ever before and set new records for fourth quarter and full year revenue. These results are the product of the tireless efforts of the 6,600 employees who deliver authentic Hawaiian hospitality on the ground and in the air every single day.\nLooking ahead, 2018 stands to be a year that Hawaiian enters into the last phase of a strategy mapped out over a decade ago. With new aircraft, new markets, and product enhancements tailored to the needs of the Hawai'i traveler, we are better equipped to compete today than at any time in our past. We look forward to the year ahead and all that it has in store.\"\nStatistical data, as well as a reconciliation of the reported non-GAAP financial measures, can be found in the accompanying tables.\nLiquidity and Capital Resources\nOn October 12, 2017, the Company announced the initiation of a quarterly cash dividend of 12 cents per share, the first of which was paid on November 30, 2017 to all stockholders of record as of November 17, 2017.\nIn addition, the Company repurchased approximately 2.5 million shares of common stock for approximately $100 million in 2017. The Company also announced a new $100 million stock repurchase program in effect through December 31, 2019.\nAs of December 31, 2017 the Company had:\nUnrestricted cash, cash equivalents and short-term investments of $460 million. Outstanding debt and capital lease obligations of $571 million.\n2017 Highlights\nOperational\nCarried a record 11.5 million passengers in 2017, a 4.1% increase over the previous year. Completed new hangar facility which will provide significant efficiencies moving forward. Introduced new uniforms which complements brand refresh that was unveiled earlier in the year.\nNew routes and increased frequencies\nNorth America Started operating new daily non-stop service between Portland International Airport (PDX) and Maui's Kahului Airport (OGG) in January 2018. Announced new daily non-stop service between San Diego International Airport (SAN) and Kahului (OGG) as well as between Long Beach Airport (LGB) and Honolulu's Daniel K. Inouye International Airport (HNL) with both expected to start in May 2018. Extended seasonal non-stop service to year-round non-stop service between Los Angeles International Airport (LAX) and Kaua'i's Līhu'e Airport (LIH). Commenced summer seasonal service with daily non-stop flights between Oakland International Airport (OAK) and Līhu'e (LIH) and thrice weekly flights between Los Angeles (LAX) and Kona International Airport (KOA). Announced extended service between Los Angeles (LAX) and both Kona (KOA) and Kahului (OGG), between Oakland (OAK) and both Līhu'e (LIH) and Kona (KOA), and between San Francisco International Airport (SFO) and Honolulu (HNL). International Announced expansion of non-stop service between New Zealand's Auckland Airport (AKL) and Honolulu (HNL) starting in March 2018. Announced expanded seasonal summer flights to include daily non-stop service between Narita International Airport (NRT) and Honolulu (HNL). Neighbor Islands Launched daily round trip service between Maui's Kapalua Airport (JHM) and both Honolulu (HNL) and Kahului (OGG), and between Līhu'e (LIH) and Kona (KOA).\nPartnerships\nAnnounced a new partnership with Japan Airlines (JAL) that provides for extensive code sharing, lounge access and frequent flyer program reciprocity, taking effect on March 25, 2018 (subject to government approval). Also announced the intention to establish a joint venture with JAL designed to provide even more choices, convenience and enhancements to the traveling public to/from Japan and beyond to multiple Asian markets.\nFleet and financing\nCompleted a sale-leaseback transaction covering three Boeing 767-300 aircraft as part of the planned exit from its Boeing 767-300 fleet. Took delivery of its first two Airbus 321neo aircraft, its 24 th Airbus 330-200 aircraft, and its first ATR-72 turboprop aircraft in an all-cargo configuration. Entered into an agreement in January 2018 to purchase three Boeing 767-300s which it previously leased and will subsequently sell later this year in line with plans to retire its Boeing 767-300 fleet by the end of 2018.\nPeople\nRatified a 63-month contract with its pilots represented by the Airline Pilots Association (ALPA). Contributed $150.6 million during the year to employee benefit plans, comprised of a one-time payment of $18.5 million to fully fund and terminate the Hawaiian Airlines, Inc. Salaried & IAM Merged Pension Plan, a one-time payment of $101.9 million to settle a portion of the post-65 medical plan obligation in connection with the ratification of a contract amendment with the Air Line Pilots Association, representing its pilots, and a contribution of approximately $30.2 million, $25.5 million above the minimum required, to further reduce pension obligations.\nProduct and loyalty\nUnveiled brand refresh in May 2017 which included an updated logo and aircraft livery. Announced the introduction of remodeled Airbus 330-200 aircraft to its non-stop service between Sapporo's New Chitose Airport (CTS) and Honolulu (HNL) starting in February 2018.\nFirst Quarter and Full Year 2018 Outlook\nThe table below summarizes the Company's expectations for the first quarter ending March 31, 2018 and the full year ending December 31, 2018, expressed as an expected percentage change compared to the pro forma results for the quarter ended March 31, 2017 or the year ended December 31, 2017, as applicable.\nIn May 2014, the FASB issued ASU 2014-09, Revenue from Contracts with Customers, and created a new topic (ASC 606), requiring an entity to recognize the amount of revenue to which it expects to be entitled for the transfer of promised goods or services to customers. ASC 606 will replace most existing revenue recognition guidance in GAAP when it becomes effective. ASC 606 is effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2017. The Company has elected to adopt the full retrospective transition method as of January 1, 2018, resulting in the restatement of all prior periods on the date of adoption. Metrics in the guidance tables below that have been impacted by ASC 606 are shown as both originally stated and on an unaudited pro forma basis.\nFirst Quarter\nFirst Quarter\nFirst Quarter\nFirst Quarter\nItem\n2017 Original\n2017 Restated\n2018 Guidance\nGAAP Equivalent\n2018 Guidance\nCost per ASM excluding Fuel (a)\n9.39¢\n9.29¢\nUp 3.5% to up 6.5%\nCost per ASM (a)\nUp 3.3% to up 6.7%\nOperating Revenue Per ASM\n13.58¢\n13.40¢\nDown 0.5% to up 2.5%\nASMs\nUp 3.0% to up 5.0%\nGallons of jet fuel consumed\nUp 4.0% to up 6.0%\nEconomic fuel cost per gallon (b)(c)\n$1.90 to $2.00\nFuel cost per gallon (b)\n$2.01 to $2.11\nFull Year\nFull Year\nFull Year\nFull Year\nItem\n2017 Original\n2017 Restated\n2018 Guidance\nGAAP Equivalent\n2018 Guidance\nCost per ASM excluding Fuel (a)\n9.20¢\n9.19¢\nDown 0.5% to up 2.5%\nCost per ASM (a)\nUp 1.9% to up 5.4%\nASMs\nUp 5.0% to up 8.0%\nGallons of jet fuel consumed\nUp 3.0% to up 6.0%\nEconomic fuel cost per gallon (b)(c)\n$1.97 to $2.07\nFuel cost per gallon (b)\n$2.02 to $2.12\n(a)\nSee Table 4 for a reconciliation of GAAP operating expenses to operating expenses excluding aircraft fuel.\n(b)\nEconomic fuel cost per gallon estimates are based on the January 16, 2018 fuel forward curve.\n(c)\nSee Table 3 for a reconciliation of GAAP fuel costs to economic fuel costs.\nInvestor Conference Call\nHawaiian Holdings' quarterly and full year earnings conference call is scheduled to begin today (January 29, 2018) at 4:30 p.m. Eastern Time (USA). The conference call will be broadcast live over the Internet. Investors may listen to the live audio webcast on the investor relations section of the Company's website at www.HawaiianAirlines.com . For those who are not available for the live webcast, the call will be archived and available for 90 days on the investor relations section of the Company's website.\nAbout Hawaiian Airlines\nHawaiian® has led all U.S. carriers in on-time performance for each of the past 13 years (2004-2016) as reported by the U.S. Department of Transportation. Consumer surveys by Condé Nast Traveler and Travel + Leisure have placed Hawaiian among the top of all domestic airlines serving Hawai'i.\nNow in its 89th year of continuous service, Hawaiian is Hawai'i's biggest and longest-serving airline. Hawaiian offers non-stop service to Hawai'i from more U.S. gateway cities (11) than any other airline, along with service from Japan, South Korea, China, Australia, New Zealand, American Samoa and Tahiti. Hawaiian also provides approximately 170 jet flights daily between the Hawaiian Islands, with a total of more than 250 daily flights system-wide.\nHawaiian Airlines, Inc. is a subsidiary of Hawaiian Holdings, Inc. (NASDAQ: HA). Additional information is available at HawaiianAirlines.com . Follow updates on Twitter about Hawaiian ( @HawaiianAir ) and its special fare offers ( @HawaiianFares ), and become a fan on its Facebook page ( Hawaiian Airlines ). For career postings and updates, follow Hawaiian's LinkedIn page.\nFor media inquiries, please visit Hawaiian Airlines' online newsroom .\nForward-Looking Statements\nThis press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 that reflect the Company's current views with respect to certain current and future events and financial performance. Such forward-looking statements include, without limitation, the Company's expectations regarding cost per available seat mile, cost per available seat mile excluding fuel, available seat miles, gallons of jet fuel consumed, fuel cost per gallon, and economic fuel cost per gallon each for the quarter ending March 31, 2018 and for the full year ending December 31, 2018; the Company's expectations regarding operating revenue per available seat mile for the quarter ending March 31, 2018; the statements of our president and CEO; the Company's plans to retire its Boeing 767-300 fleet by the end of 2018; the Company's expected tax rate in 2018; and statements as to other matters that do not relate strictly to historical facts or statements of assumptions underlying any of the foregoing. Words such as \"expects,\" \"anticipates,\" \"projects,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" variations of such words, and similar expressions are also intended to identify such forward-looking statements. These forward-looking statements are and will be, as the case may be, subject to many risks, uncertainties and assumptions relating to the Company's operations and business environment, all of which may cause the Company's actual results to be materially different from any future results, expressed or implied, in these forward-looking statements. These risks and uncertainties include, without limitation, the Company's ability to accurately forecast quarterly and annual results; economic volatility; macroeconomic developments; political developments; the price and availability of aircraft fuel; fluctuations in demand for transportation in the markets in which the Company operates; the Company's dependence on tourist travel; labor negotiations and related developments; competitive pressures, including the potential impact of rising industry capacity between North America and Hawai'i; the Company's ability to continue to generate sufficient cash flow to support the payment of a quarterly dividend; changes in the Company's future capital needs; foreign currency exchange rate fluctuations; and the Company's ability to implement its growth strategy.\nThe risks, uncertainties and assumptions referred to above that could cause the Company's results to differ materially from the results expressed or implied by such forward-looking statements also include the risks, uncertainties and assumptions discussed from time to time in the Company's other public filings and public announcements, including the Company's Annual Report on Form 10-K and the Company's Quarterly Reports on Form 10-Q, as well as other documents that may be filed by the Company from time to time with the Securities and Exchange Commission. All forward-looking statements included in this document are based on information available to the Company on the date hereof. The Company does not undertake to publicly update or revise any forward-looking statements to reflect events or circumstances that may arise after the date hereof even if experience or future changes make it clear that any projected results expressed or implied herein will not be realized.\nTable 1.\nHawaiian Holdings, Inc.\nConsolidated Statements of Operations\n(in thousands, except for per share data) (unaudited)\nThree Months Ended December 31,\nTwelve Months Ended December 31,\n2017\n2016 (a)\n% Change\n2017\n2016 (a)\n% Change\nOperating Revenue:\nPassenger\n$\n596,801\n$\n553,647\n7.8\n%\n$\n2,362,076\n$\n2,145,742\n10.1\n%\nOther\n89,748\n79,326\n13.1\n%\n333,552\n304,838\n9.4\n%\nTotal\n686,549\n632,973\n8.5\n%\n2,695,628\n2,450,580\n10.0\n%\nOperating Expenses:\nWages and benefits\n166,225\n139,545\n19.1\n%\n632,997\n535,264\n18.3\n%\nAircraft fuel, including taxes and delivery\n123,960\n95,806\n29.4\n%\n440,383\n344,322\n27.9\n%\nAircraft rent\n34,881\n32,220\n8.3\n%\n137,764\n124,565\n10.6\n%\nMaintenance materials and repairs\n58,187\n62,069\n(6.3)\n%\n219,553\n228,970\n(4.1)\n%\nAircraft and passenger servicing\n35,997\n33,631\n7.0\n%\n140,566\n126,876\n10.8\n%\nCommissions and other selling\n33,115\n31,795\n4.2\n%\n131,783\n125,731\n4.8\n%\nDepreciation and amortization\n29,490\n26,499\n11.3\n%\n113,277\n108,128\n4.8\n%\nOther rentals and landing fees\n30,000\n29,749\n0.8\n%\n116,763\n108,087\n8.0\n%\nPurchased services\n31,359\n23,385\n34.1\n%\n110,787\n96,274\n15.1\n%\nOther\n43,157\n33,210\n30.0\n%\n144,533\n127,489\n13.4\n%\nSpecial items\n—\n109,142\n(100.0)\n%\n23,450\n109,142\n(78.5)\n%\nTotal\n586,371\n617,051\n(5.0)\n%\n2,211,856\n2,034,848\n8.7\n%\nOperating Income\n100,178\n15,922\n529.2\n%\n483,772\n415,732\n16.4\n%\nNonoperating Income (Expense):\nOther nonoperating special items\n4,617\n—\n(45,585)\n—\nInterest expense and amortization of debt discounts and issuance costs\n(7,609)\n(8,159)\n(30,901)\n(36,612)\nInterest income\n1,652\n963\n6,132\n4,007\nCapitalized interest\n2,179\n1,244\n8,437\n2,651\nGains on fuel derivatives\n13,540\n4,685\n3,312\n20,106\nLoss on extinguishment of debt\n—\n(480)\n—\n(10,473)\nOther components of net periodic benefit cost\n(3,420)\n(5,053)\n(16,713)\n(20,270)\nOther, net\n(1,060)\n(5,561)\n2,101\n4,323\nTotal\n9,899\n(12,361)\n(73,217)\n(36,268)\nIncome Before Income Taxes\n110,077\n3,561\n410,555\n379,464\nIncome tax expense (benefit)\n(62,053)\n1,619\n46,514\n144,032\nNet Income\n$\n172,130\n$\n1,942\n$\n364,041\n$\n235,432\nNet Income Per Common Stock Share:\nBasic\n$\n3.31\n$\n0.04\n$\n6.86\n$\n4.40\nDiluted\n$\n3.29\n$\n0.04\n$\n6.82\n$\n4.36\nWeighted Average Number of Common Stock Shares Outstanding:\nBasic\n51,939\n53,433\n53,074\n53,502\nDiluted\n52,263\n53,910\n53,413\n53,958\nCash Dividends Declared Per Common Share\n$\n0.12\n—\n$\n0.12\n—\n(a)\nThe other components of net periodic benefit cost are required to be presented in the income statement separately from the service cost component and outside a subtotal of income from operations, if one is presented. Accounting Standard Update 2017-07 (ASU 2017-07) is effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2017, with early adoption only permitted for the Company in the first quarter of 2017, provided all provisions of the ASU are adopted. The Company early adopted this standard during the first quarter of 2017. The adoption of ASU 2017-07 resulted in a reclassification of $5.1 million and $20.3 million from wages and benefits to other components of net periodic benefit cost on the Company's consolidated statement of operations for the three months and twelve months ended December 31, 2016, respectively.\nTable 2\nHawaiian Holdings, Inc.\nSelected Statistical Data\n(in thousands, except as otherwise indicated) (unaudited)\nThree Months Ended December 31,\nTwelve Months Ended December 31,\n2017\n2016\n% Change\n2017\n2016\n% Change\nScheduled Operations (a) :\nRevenue passengers flown\n2,910\n2,728\n6.7\n%\n11,498\n11,044\n4.1\n%\nRevenue passenger miles (RPM)\n4,120,002\n3,929,846\n4.8\n%\n16,307,344\n15,484,369\n5.3\n%\nAvailable seat miles (ASM)\n4,788,457\n4,565,978\n4.9\n%\n18,991,566\n18,371,544\n3.4\n%\nPassenger revenue per RPM (Yield)\n14.49\n¢\n14.09\n¢\n2.8\n%\n14.48\n¢\n13.86\n¢\n4.5\n%\nPassenger load factor (RPM/ASM)\n86.0\n%\n86.1\n%\n(0.1)\npt\n85.9\n%\n84.3\n%\n1.6\npt\nPassenger revenue per ASM (PRASM)\n12.46\n¢\n12.13\n¢\n2.7\n%\n12.44\n¢\n11.68\n¢\n6.5\n%\nTotal Operations (a) :\nRevenue passengers flown\n2,914\n2,730\n6.7\n%\n11,505\n11,051\n4.1\n%\nRPM\n4,125,894\n3,932,713\n4.9\n%\n16,316,739\n15,492,509\n5.3\n%\nASM\n4,798,039\n4,570,679\n5.0\n%\n19,006,682\n18,384,637\n3.4\n%\nPassenger load factor (RPM/ASM)\n86.0\n%\n86.0\n%\n—\npt\n85.8\n%\n84.3\n%\n1.5\npt\nOperating revenue per ASM (RASM)\n14.31\n¢\n13.85\n¢\n3.3\n%\n14.18\n¢\n13.33\n¢\n6.4\n%\nOperating cost per ASM (CASM)\n12.22\n¢\n13.50\n¢\n(9.5)\npt\n11.64\n¢\n11.07\n¢\n5.1\n%\nCASM excluding aircraft fuel and special items (b)\n9.64\n¢\n9.02\n¢\n6.9\n%\n9.20\n¢\n8.61\n¢\n6.9\n%\nAircraft fuel expense per ASM (c)\n2.58\n¢\n2.10\n¢\n22.9\n%\n2.32\n¢\n1.87\n¢\n24.1\n%\nRevenue block hours operated\n47,926\n44,627\n7.4\n%\n189,881\n179,254\n5.9\n%\nGallons of jet fuel consumed\n66,511\n61,647\n7.9\n%\n259,915\n244,118\n6.5\n%\nAverage cost per gallon of jet fuel (actual) (c)\n$\n1.86\n$\n1.55\n20.0\n%\n$\n1.69\n$\n1.41\n19.9\n%\nEconomic fuel cost per gallon (c)(d)\n$\n1.84\n$\n1.51\n21.9\n%\n$\n1.70\n$\n1.52\n11.8\n%\n(a)\nIncludes the operations of the Company's contract carrier under a capacity purchase agreement.\n(b)\nSee Table 4 for a reconciliation of GAAP operating expenses to operating expenses excluding aircraft fuel.\n(c)\nIncludes applicable taxes and fees.\n(d)\nSee Table 3 for a reconciliation of GAAP fuel costs to economic fuel costs.\nTable 3.\nHawaiian Holdings, Inc.\nEconomic Fuel Expense\n(in thousands, except per-gallon amounts) (unaudited)\nThe Company believes that economic fuel expense is a good measure of the effect of fuel prices on its business as it most closely approximates the net cash outflow associated with the purchase of fuel for its operations in a period. The Company defines economic fuel expense as GAAP fuel expense plus losses/(gains) realized through actual cash (receipts)/payments received from or paid to hedge counterparties for fuel hedge derivative contracts settled during the period.\nThree Months Ended December 31,\nTwelve Months Ended December 31,\n2017\n2016\n% Change\n2017\n2016\n% Change\nAircraft fuel expense, including taxes and delivery\n$\n123,960\n$\n95,806\n29.4\n%\n$\n440,383\n$\n344,322\n27.9\n%\nRealized (gains)/losses on settlement of fuel derivative contracts\n(1,565)\n(2,778)\n(43.7)\n%\n534\n27,572\n(98.1)\n%\nEconomic fuel expense\n$\n122,395\n$\n93,028\n31.6\n%\n$\n440,917\n$\n371,894\n18.6\n%\nFuel gallons consumed\n66,511\n61,647\n7.9\n%\n259,915\n244,118\n6.5\n%\nEconomic fuel costs per gallon\n$\n1.84\n$\n1.51\n21.9\n%\n$\n1.70\n$\n1.52\n11.8\n%\nEstimated three months ending\nMarch 31, 2018\nEstimated full year ending\nDecember 31, 2018\nAircraft fuel expense, including taxes and delivery\n$\n128,994\n-\n$\n137,885\n$\n540,894\n-\n$\n583,805\nRealized (gains)/losses on settlement of fuel derivative contracts\n(7,000)\n-\n(7,000)\n(13,500)\n-\n(13,500)\nEconomic fuel expense\n$\n121,994\n-\n$\n130,885\n$\n527,394\n-\n$\n570,305\nFuel gallons consumed\n64,208\n-\n65,442\n267,712\n-\n275,510\nEconomic fuel costs per gallon\n$\n1.90\n-\n$\n2.00\n$\n1.97\n-\n$\n2.07\nTable 4.\nHawaiian Holdings, Inc.\nNon-GAAP Financial Reconciliation\n(in thousands, except per-share and CASM data) (unaudited)\nThe Company evaluates its financial performance utilizing various GAAP and non-GAAP financial measures, including net income, diluted net income per share, CASM, PRASM, RASM, Passenger Revenue per RPM and EBITDAR. Pursuant to Regulation G, the Company has included the following reconciliation of reported non-GAAP financial measures to comparable financial measures reported on a GAAP basis. The adjustments are described below:\n•\nChanges in fair value of derivative contracts, net of tax, are based on market prices for open contracts as of the end of the reporting period. This line item includes the unrealized amounts of fuel and interest rate derivatives (not designated as hedges) that will settle in future periods and the reversal of prior period unrealized amounts. The Company believes that excluding the impact of these derivative adjustments helps investors to analyze the Company's core operational performance and compare its results to other airlines in the periods presented below.\n•\nLoss on extinguishment of debt, net of tax, is excluded to help investors analyze the Company's core operational performance and compare its results to other airlines in the periods presented below.\n•\nAs a result of the Tax Cuts and Jobs Act of 2017, the Company recognized a one time benefit of $104.2 million in the quarter ended December 31, 2017 from the estimated impact of the revaluation of deferred tax assets and liabilities. For 2018, the expected reduction in the corporate tax rate will result in an all-in book tax rate for the Company of 24% to 26%.\n2016 special items\n•\nThe impairment analysis and ultimate charge was triggered by the decision in the fourth quarter of 2016 to exit the Boeing 767-300 fleet in 2018. The Company estimated the fair value of the owned Boeing 767-300 fleet assets using third party pricing information and Quote: s from potential buyers, which resulted in a $49.4 million impairment charge ($0.92 per diluted share).\n•\nIn 2016, the Company accrued $34.0 million associated with the tentative agreement with ALPA related to past service (prior to January 1, 2017) and also elected to pay a $4.8 million profit sharing bonus payment to other labor groups related to prior period service.\n•\nIn connection with the decision to exit the Boeing 767-300 fleet, the Company negotiated a termination of its Boeing 767-300 maintenance agreement and recorded a $21.0 million charge related to the amount paid to terminate the contract.\n2017 special items\n•\nIn August 2017, the Company terminated the Hawaiian Airlines, Inc. Salaried & IAM Merged Pension Plan (the Merged Plan) and settled a portion of its pilots' other post-retirement medical plan liability. In connection with the reduction of these liabilities the Company recorded one-time other nonoperating special items of $35.2 million related to the Merged Plan termination and $10.4 million related to the other post-retirement (OPEB) medical plan partial settlement.\n•\nIn April 2017, the Company executed a sale leaseback transaction with an independent third party for three Boeing 767-300 aircraft. The lease terms for the three aircraft commenced in April 2017 and continues through November 2018, December 2018, and January 2019, respectively. During the twelve months ended December 31, 2017, the Company recorded a loss on sale of aircraft of $4.8 million.\n•\nIn February 2017, the Company reached a tentative agreement with ALPA, covering the Company's pilots. In March 2017, the Company received notice from ALPA that the agreement was ratified by ALPA's members. The agreement became effective April 1, 2017 and has a term of 63 months. The agreement includes, among other various benefits, a pay adjustment and ratification bonus computed based on previous service. During the twelve months ended December 31, 2017, the Company expensed $18.7 million related to (1) a one-time payment to reduce the Company's future 401K employer contribution for certain pilot groups, which is not recoverable once paid and (2) a one-time true up of the pilot vacation accrual at the revised rates set forth in the agreement.\nThe Company believes that excluding such special items helps investors analyze the Company's operational performance and compare its results to other airlines in the periods presented below.\nThree Months Ended December 31,\nTwelve Months Ended December 31,\n2017\n2016\n2017\n2016\nTotal\nDiluted\nPer Share\nTotal\nDiluted\nPer Share\nTotal\nDiluted\nPer Share\nTotal\nDiluted\nPer Share\nGAAP net income, as reported\n$\n172,130\n$\n3.29\n$\n1,942\n$\n0.04\n$\n364,041\n$\n6.82\n$\n235,432\n$\n4.36\nAdd: estimated effect of revaluation of deferred tax liability\n(104,176)\n(1.99)\n—\n—\n(104,176)\n(1.95)\n—\n—\nAdd (deduct): changes in fair value of derivative contracts\n(11,974)\n(0.23)\n(1,907)\n(0.04)\n(3,846)\n(0.07)\n(47,678)\n(0.88)\nAdd: loss on extinguishment of debt\n—\n—\n480\n0.01\n—\n—\n10,473\n0.19\nAdd: special items\nOperating\nLoss on sale of aircraft\n—\n—\n—\n—\n4,771\n0.09\n—\n—\nCollective bargaining charge\n—\n—\n38,781\n0.72\n18,679\n0.35\n38,781\n0.72\nImpairment charge\n—\n—\n49,361\n0.92\n—\n—\n49,361\n0.92\nTermination of Boeing 767-300\n—\n—\n21,000\n0.39\n—\n—\n21,000\n0.39\nNonoperating\nPartial settlement and curtailment loss\n(4,617)\n(0.09)\n—\n—\n10,384\n0.19\n—\n—\nLoss on plan termination\n—\n—\n—\n—\n35,201\n0.66\n—\n—\nTotal special items\n(4,617)\n(0.09)\n109,142\n2.03\n69,035\n1.29\n109,142\n2.03\nAdd (deduct): tax effect of adjustments\n6,089\n0.12\n(40,903)\n(0.76)\n(23,924)\n(0.45)\n(27,307)\n(0.51)\nAdjusted net income\n$\n57,452\n$\n1.10\n$\n68,754\n$\n1.28\n$\n301,130\n$\n5.64\n$\n280,062\n$\n5.19\nThree months ended\nDecember 31,\nTwelve months ended\nDecember 31,\n2017\n2016\n2017\n2016\nIncome Before Income Taxes, as reported\n$\n110,077\n$\n3,561\n$\n410,555\n$\n379,464\nAdd: changes in fair value of derivative contracts\n(11,974)\n(1,907)\n(3,846)\n(47,678)\nAdd: loss on extinguishment of debt\n—\n480\n—\n10,473\nAdd: special items\nOperating\nLoss on sale of aircraft\n—\n—\n4,771\n—\nCollective bargaining charge\n—\n38,781\n18,679\n38,781\nImpairment charge\n—\n49,361\n—\n49,361\nTermination of Boeing 767-300\n—\n21,000\n—\n21,000\nNonoperating\nPartial settlement and curtailment loss\n(4,617)\n—\n10,384\n—\nLoss on plan termination\n—\n—\n35,201\n—\nTotal special items\n$\n(4,617)\n$\n109,142\n$\n69,035\n$\n109,142\nAdjusted Income Before Income Taxes\n$\n93,486\n$\n111,276\n$\n475,744\n$\n451,401\nOperating Costs per Available Seat Mile (CASM)\nThe Company has separately listed in the table below its fuel costs per ASM and non-GAAP unit costs, excluding fuel and special items. These amounts are included in CASM, but for internal purposes the Company consistently uses cost metrics that exclude fuel and special items (if applicable) to measure and monitor its costs.\nThree Months Ended\nDecember 31,\nTwelve Months Ended\nDecember 31,\n2017\n2016 (a)\n2017\n2016 (a)\nGAAP operating expenses\n$\n586,371\n$\n617,051\n$\n2,211,856\n$\n2,034,848\nLess: aircraft fuel, including taxes and delivery\n(123,960)\n(95,806)\n(440,383)\n(344,322)\nLess: special items\nOperating\nLoss on sale of aircraft\n—\n—\n(4,771)\n—\nCollective bargaining charge\n—\n(38,781)\n(18,679)\n(38,781)\nImpairment charge\n—\n(49,361)\n—\n(49,361)\nTermination of Boeing 767-300\n—\n(21,000)\n—\n(21,000)\nTotal special items\n$\n—\n$\n(109,142)\n$\n(23,450)\n$\n(109,142)\nAdjusted operating expenses—excluding aircraft fuel and special items\n$\n462,411\n$\n412,103\n$\n1,748,023\n$\n1,581,384\nAvailable Seat Miles\n4,798,039\n4,570,679\n19,006,682\n18,384,637\nCASM—GAAP\n12.22\n¢\n13.50\n¢\n11.64\n¢\n11.07\n¢\nLess: aircraft fuel\n(2.58)\n(2.10)\n(2.32)\n(1.87)\nLess: special items\nOperating\nLoss on sale of aircraft\n—\n—\n(0.02)\n—\nCollective bargaining charge\n—\n(0.84)\n(0.10)\n(0.20)\nImpairment charge\n—\n(1.08)\n—\n(0.28)\nTermination of Boeing 767-300\n—\n(0.46)\n—\n(0.11)\nTotal special items\n—\n¢\n(2.38)\n¢\n(0.12)\n¢\n(0.59)\n¢\nCASM—excluding aircraft fuel and special items\n9.64\n¢\n9.02\n¢\n9.20\n¢\n8.61\n¢\n(a)\nThe other components of net periodic benefit cost are required to be presented in the income statement separately from the service cost component and outside a subtotal of income from operations, if one is presented. Accounting Standard Update 2017-07 (ASU 2017-07) is effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2017, with early adoption only permitted for the Company in the first quarter of 2017, provided all provisions of the ASU are adopted. The Company early adopted this standard during the first quarter of 2017. The adoption of ASU 2017-07 resulted in a reclassification of $5.1 million and $20.3 million from wages and benefits to other components of net periodic benefit cost on the Company's consolidated statement of operations for the three months and twelve months ended December 31, 2016, respectively.\nEstimated three months ending\nMarch 31, 2018\nEstimated full year ending\nDecember 31, 2018\n(in thousands, except for CASM\nfigures)\n(in thousands, except for CASM\nfigures)\nGAAP operating expenses\n$\n576,870\n-\n$\n607,691\n$\n2,365,773\n-\n$\n2,517,418\nLess: aircraft fuel, including taxes and delivery\n(128,994)\n-\n(137,885)\n(540,894)\n-\n(583,805)\nAdjusted operating expenses - excluding aircraft fuel\n$\n447,876\n-\n$\n469,806\n$\n1,824,879\n-\n$\n1,933,613\nAvailable Seat Miles\n4,658,024\n-\n4,748,471\n19,957,016\n-\n20,527,217\nCASM - GAAP\n12.39\n¢\n-\n12.79\n¢\n11.85\n¢\n-\n12.26\n¢\nLess: aircraft fuel\n(2.77)\n-\n(2.90)\n(2.71)\n-\n(2.84)\nCASM - excluding aircraft fuel\n9.62\n¢\n-\n9.89\n¢\n9.14\n¢\n-\n9.42\n¢\nPre-tax margin\nThe Company excludes unrealized (gains) losses from fuel derivative contracts, losses on extinguishment of debt and special items from pre-tax margin for the same reasons as described above.\nThree months ended\nDecember 31,\nTwelve months ended\nDecember 31,\n2017\n2016\n2017\n2016\nPre-Tax Margin, as reported\n16.0\n%\n0.6\n%\n15.2\n%\n15.5\n%\nAdd: changes in fair value of derivative contracts\n(1.7)\n%\n(0.3)\n%\n(0.2)\n%\n(2.0)\n%\nAdd: loss on extinguishment of debt\n—\n%\n0.1\n%\n—\n%\n0.4\n%\nAdd: special items\nOperating\nLoss on sale of aircraft\n—\n%\n—\n%\n0.2\n%\n—\n%\nCollective bargaining charge\n—\n%\n6.1\n%\n0.7\n%\n1.6\n%\nImpairment charge\n—\n%\n7.8\n%\n—\n%\n2.0\n%\nTermination of Boeing 767-300\n—\n%\n3.3\n%\n—\n%\n0.9\n%\nNonoperating\nPartial settlement and curtailment loss\n(0.7)\n%\n—\n%\n0.4\n%\n—\n%\nLoss on plan termination\n—\n%\n—\n%\n1.3\n%\n—\n%\nAdjusted Pre-Tax Margin\n13.6\n%\n17.6\n%\n17.6\n%\n18.4\n%\nLeverage ratio\nThe Company uses adjusted total debt, including aircraft rent, in addition to long-term adjusted debt and capital leases, to represent long-term financial obligations. The Company excludes unrealized (gains) losses from fuel derivative contracts, losses on extinguishment of debt, and special items from earnings before interest, taxes, depreciation, amortization and rent (EBITDAR) for the reasons as described above. Management believes this metric is helpful to investors in assessing the Company's overall debt.\nTwelve months ended\nDecember 31, 2017\nDebt and capital lease obligations\n$\n570,671\nPlus: Aircraft leases capitalized at 7x last twelve months' aircraft rent\n964,348\nAdjusted debt and capital lease obligations\n$\n1,535,019\nEBITDAR:\nIncome Before Income Taxes\n$\n410,555\nAdd back:\nInterest and amortization of debt expense\n30,901\nDepreciation and amortization\n113,277\nAircraft rent\n137,764\nEBITDAR\n$\n692,497\nAdjustments:\nAdd: changes in fair value of derivative contracts\n(3,846)\nAdd: special items\nOperating\nCollective bargaining charge\n18,679\nLoss on sale of aircraft\n4,771\nNonoperating\nPartial settlement and curtailment loss\n10,384\nLoss on plan termination\n35,201\nAdjusted EBITDAR\n$\n757,686\nLeverage Ratio\n2.0\nx\nView original content: http://www.prnewswire.com/news-releases/hawaiian-holdings-reports-2017-fourth-quarter-and-full-year-financial-results-300589216.html\nSOURCE Hawaiian Holdings, Inc.", "external_links": ["https://newsroom.hawaiianairlines.com/", "http://www.prnewswire.com/news-releases/hawaiian-holdings-reports-2017-fourth-quarter-and-full-year-financial-results-300589216.html", "http://www.hawaiianairlines.com/", "http://www.twitter.com/HawaiianFares", "https://www.linkedin.com/company/hawaiian-airlines?trk=biz-companies-cym", "http://www.twitter.com/HawaiianAir", "http://www.facebook.com/hawaiianairlines"], "published": "2018-01-30T00:01:00.000+02:00", "crawled": "2018-01-30T04:43:47.030+02:00", "highlightTitle": ""}