{"organizations": [], "uuid": "b392f790beccca1e98c287c8d63f9e14d92aa234", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-krystala-to-begin-2018-with-new-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Krystal® to Begin 2018 with New Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T00:09:00.000+02:00", "replies_count": 0, "uuid": "b392f790beccca1e98c287c8d63f9e14d92aa234"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-krystala-to-begin-2018-with-new-chief-financial-officer.html", "ord_in_thread": 0, "title": "Krystal® to Begin 2018 with New Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "krystal", "sentiment": "negative"}, {"name": "omar janjua", "sentiment": "none"}, {"name": "epley", "sentiment": "none"}, {"name": "berry", "sentiment": "none"}, {"name": "berry l. epley", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "krystal company", "sentiment": "negative"}, {"name": "sec", "sentiment": "none"}, {"name": "krispy kreme doughnuts, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 2, 2018 /PRNewswire/ -- With the new year rapidly approaching, The Krystal Company® announced today the appointment of a new Chief Financial Officer – Berry L. Epley – a proven financial leader with nearly 20 years in the food & beverage industry. Epley will officially take over all CFO functions on January 2, 2018.\n\"As we move forward into the next chapter for Krystal, we are more focused than ever on delivering the quality and value our guests have come to expect from us over the past 85 years,\" said Omar Janjua, Chief Executive Officer for The Krystal Company. \"Berry has an astute business mind with the financial vision and insight to strengthen our market presence, create strong franchise relationships, and drive bottom-line performance across the board. His involvement will be instrumental in the continued long-term success of one of America's favorite restaurant brands.\"\nPrior to coming to Krystal, Epley served as the Chief Accounting Officer for Krispy Kreme Doughnuts, Inc., where he was responsible for all financial accounting, public reporting, SEC compliance, and more. Among his many accomplishments in that role were the development of a treasury function that enhanced cash forecasting, reduced risk, and improved working capital. He also was a key member of the transaction team that shifted Krispy Kreme from a publicly-traded company to a private company. Other career highlights include more than a dozen years with The Pantry, Inc. in which Epley helped orchestrate multi-million-dollar acquisitions and purchases, management of numerous capital market transactions, significant cost reductions, and a refinancing for the business. In his early career, Epley worked with PricewaterhouseCoopers, LLP, overseeing a wide range of financial tasks for the firm's various corporate clients.\n\"I am honored to be part of such a respected restaurant brand,\" said Epley. \"2018 is going to be a year focused on maximizing opportunities and strengthening our position in all the markets Krystal currently serves. I hope to apply my expertise and insight towards achieving ever-greater performance for this storied brand.\"\nEpley graduated Magna Cum Laude from Appalachian State University, where he earned his Bachelor's Degree in Accounting. He then went on to graduate Summa Cum Laude from Campbell University, where he earned his Master's Degree in Business Administration. Epley is also an active Certified Public Accountant.\nAbout The Krystal ® Company\nFounded in Chattanooga, Tennessee, in 1932, The Krystal Company is the oldest quick service restaurant chain in the South. Its hamburgers are still served fresh and hot off the grill on the iconic square bun at more than 360 restaurants in 11 states. Krystal's Atlanta-based Restaurant Support Center serves a team of 6,000 employees. For more information, visit http://www.Krystal.com or http://www.facebook.com/Krystal or follow the brand on Twitter and Instagram @Krystal .\nContact:\nPeyton Sadler\n305.631.2283\nPeyton@inklinkmarketing.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/krystal-to-begin-2018-with-new-chief-financial-officer-300576577.html\nSOURCE The Krystal Company", "external_links": ["http://www.krystal.com/", "http://www.prnewswire.com/news-releases/krystal-to-begin-2018-with-new-chief-financial-officer-300576577.html", "http://www.facebook.com/Krystal", "http://www.twitter.com/krystal"], "published": "2018-01-03T00:09:00.000+02:00", "crawled": "2018-01-03T02:18:16.001+02:00", "highlightTitle": ""}