{"organizations": [], "uuid": "957e2ea301ee012f71500b821195c41f2596f2cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-metastasis-breast-cancer/immune-cells-linked-to-very-early-spread-of-breast-cancer-idUKKBN1ER1F3", "country": "US", "domain_rank": 408, "title": "Immune cells linked to very early spread of breast cancer", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T18:44:00.000+02:00", "replies_count": 0, "uuid": "957e2ea301ee012f71500b821195c41f2596f2cb"}, "author": "", "url": "https://uk.reuters.com/article/us-health-metastasis-breast-cancer/immune-cells-linked-to-very-early-spread-of-breast-cancer-idUKKBN1ER1F3", "ord_in_thread": 0, "title": "Immune cells linked to very early spread of breast cancer", "locations": [], "entities": {"persons": [{"name": "marilynn l", "sentiment": "negative"}, {"name": "julio aguirre-ghiso", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "mount sinai", "sentiment": "none"}], "organizations": [{"name": "nature communications", "sentiment": "none"}, {"name": "tisch cancer institute", "sentiment": "none"}, {"name": "icahn school of medicine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 4:40 PM / Updated 5 hours ago Immune cells linked to very early spread of breast cancer Marilynn Larkin 3 Min Read \n(Reuters Health) - Normal immune cells that live near milk ducts in healthy breast tissue may play a key role in helping early breast cancer cells leave the breast for other parts of the body, researchers say. \nThis could possibly cause cancer to metastasize, or spread, even before a tumor has developed, according to Dr. Julio Aguirre-Ghiso of The Tisch Cancer Institute at the Icahn School of Medicine at Mount Sinai in New York City and colleagues. The study was published online January 2 in Nature Communications. \nIn previous work, the team identified a group of early cancer cells that get disseminated into the body during the earliest stages of breast cancer, before any cancer can be detected. \nIn the current study, they report that immune cells called macrophages play an important part in this process. Working in mice and in human cells in the laboratory, the team found that dissemination occurs when macrophages are attracted to the milk ducts, where they trigger a chain reaction that enables the early cancer cells to leave the breast. \n“We show that by disrupting this (process), we can prevent early dissemination and, ultimately, deadly metastasis,” Aguirre-Ghiso said in an email to Reuters Health. \n“Our study challenges the dogma that early diagnosis and treatment means sure cure,” he said. \nIt could also be a “starting point” for a test that could identify patients with the earliest form of breast cancer, known as ductal cell carcinoma in situ, who may already have disseminated disease, he suggested. \nFuture work will involve identifying the type of macrophages involved in early dissemination and exactly how the process occurs, which potentially could lead to the development of novel therapies to prevent it. \nThe kind of large, double-blind clinical trial that could prove this approach is still far in the future, Aguirre-Ghiso noted. \n“Even so,” he said, “our findings point to the notion that early treatment of high-risk patients may prevent the formation of deadly metastasis better than the current standard of treating metastatic disease (only after it has appeared).” \nCancer geneticist and researcher Dr. Theodora Ross of UT Southwestern in Dallas told Reuters Health by email, “The concept that macrophages are assisting in early metastases is so intriguing.” But for now, she cautioned, “the extension of this hypothesis to humans remains speculative.” \nHowever, “the point that patients with small ‘early’ breast cancers are not necessarily cured (by early treatment) is a good one,” she said. “What if metastases happen way before you ever see the cancer on a screening test?” \n(This version of the story fixes date in source link at end of story from 2017 to 2018) \nSOURCE: go.nature.com/2A6Funy Nature Communications, online January 2, 2018.", "external_links": [], "published": "2018-01-02T18:44:00.000+02:00", "crawled": "2018-01-02T19:27:32.012+02:00", "highlightTitle": ""}