{"organizations": [], "uuid": "aaf05df83cbd5ad58970c02dc5867f95c2d12298", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/us-britain-politics-lombardelli/uk-finance-ministry-names-new-chief-economist-idUKKBN1FK1YS", "country": "US", "domain_rank": 408, "title": "UK appoints first woman as chief economist to Treasury", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T18:54:00.000+02:00", "replies_count": 0, "uuid": "aaf05df83cbd5ad58970c02dc5867f95c2d12298"}, "author": "", "url": "https://uk.reuters.com/article/us-britain-politics-lombardelli/uk-finance-ministry-names-new-chief-economist-idUKKBN1FK1YS", "ord_in_thread": 0, "title": "UK appoints first woman as chief economist to Treasury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 1:57 PM / Updated 17 minutes ago UK appoints first woman as chief economist to finance ministry Reuters Staff 2 Min Read \nLONDON (Reuters) - Britain’s finance ministry appointed a woman for the first time as its next chief economist at a time when lawmakers want to increase the number of women appointed to senior economic policy roles. \nClare Lombardelli is currently in charge of helping finance minister Philip Hammond draw up his annual budget. She joined the finance ministry in 2005 after beginning her career at the Bank of England, the finance ministry said. \nShe previously served as an economic advisor to David Cameron when he was prime minister and was then-finance minister George Osborne’s principal private secretary. \nBefore that, she was seconded to the International Monetary Fund where she was part of a team based in the Greek finance ministry to monitor bailout terms during 2010 and 2011. \nLombardelli’s new role will make her responsible for advising Hammond on economic issues related to Brexit, and she will also be the finance ministry’s non-voting representative at BoE monetary policy meetings. \nLombardelli is also likely to help Hammond select a successor to BoE Governor Mark Carney, who steps down next year. \nHammond appointed Lombardelli’s predecessor, Dave Ramsden, to be one of the BoE’s deputy governors in September. She will start her new job on April 3. \nAfter Ramsden’s appointment, the head of the parliament committee which supervises the BoE and Britain’s Treasury said Hammond had done too little to encourage diversity at the BoE, which at the time had only two women among its 23 most senior policymakers. \nLombardelli featured on the front page of the Daily Mail newspaper in August 2010 under the headline “That Woman Must Show Some Respect” - a view attributed to the welfare minister at the time, Iain Duncan Smith, who clashed with Osborne and his officials over changes to social security benefits. Reporting by David Milliken; Editing by William Schomberg", "external_links": [], "published": "2018-01-31T18:54:00.000+02:00", "crawled": "2018-01-31T19:10:49.008+02:00", "highlightTitle": ""}