{"organizations": [], "uuid": "c5ff414586e0f2de03832b03447666d26c07b939", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-fiverr-acquires-professional-freelance-saas-platform-and-co-to-provide-its-software-for-free.html", "country": "US", "domain_rank": 767, "title": "Fiverr Acquires Professional Freelance SaaS Platform AND CO to Provide Its Software for Free", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.394, "site_type": "news", "published": "2018-01-24T20:00:00.000+02:00", "replies_count": 0, "uuid": "c5ff414586e0f2de03832b03447666d26c07b939"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-fiverr-acquires-professional-freelance-saas-platform-and-co-to-provide-its-software-for-free.html", "ord_in_thread": 0, "title": "Fiverr Acquires Professional Freelance SaaS Platform AND CO to Provide Its Software for Free", "locations": [], "entities": {"persons": [{"name": "micha kaufman", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "and co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 24, 2018 (GLOBE NEWSWIRE) -- Fiverr , the marketplace for creative and digital services for entrepreneurial and small businesses, today announced the acquisition of freelance services platform AND CO . As part of the acquisition, AND CO’s previously paid premium SaaS offerings will become widely available at no cost, providing offline and online professional freelancers everywhere efficiency, organization and opportunity. The addition of AND CO furthers Fiverr’s platform evolution to become a standard for online freelancing. The development and continued expansion of its portfolio further positions the company to dominate the entire freelance lifecycle both as a digital marketplace and as a growing platform of services to make offline freelance work easy and accessible.\n“We built Fiverr to help people live the freelancing lifestyle. That’s why we’ve always sought to provide every freelancer with the opportunity to succeed,” said Micha Kaufman, CEO of Fiverr. “As a marketplace, Fiverr has built all the tools necessary to conduct your business as a freelancer. This includes everything from efficiently creating invoices and receiving payments to managing one’s time and projects. But even still today, 97 percent of freelancing is done offline, and we believe those freelancers should also enjoy access to these premium tools, and it shouldn’t have a cost associated with it. Adding AND CO to the Fiverr family is another step in realizing that vision and making a meaningful difference in the lives of freelancers building businesses online and offline. We’re eager to get to work building more of the products and solutions that help entrepreneurs and freelancers effectively collaborate and do more.”\nFounded in 2015 in New York City by Leif Abraham and Martin Strutz, AND CO received venture funding from Thrive Capital, BoxGroup, Red Swan Ventures and Designer Fund. The startup has grown its community of freelancers by building the infrastructure that enables people to focus on the work they love most. With a broad suite of services, AND CO solves many of the problems that plague the modern freelancer, including time tracking, invoicing, payments, contract creation, task management and income and expense tracking. Joining Fiverr brings AND CO into the creation of a comprehensive freelancing ecosystem that includes selling services and managing a business.\n“Having the opportunity to join the Fiverr team is an extension of AND CO’s original mission of enabling people to focus on the work they love most,” said Leif Abraham, AND CO CEO and co-founder. “This new chapter is a chance to globally scale AND CO and bring more freelancers from the offline world to the online one, something that could only be accomplished the help of a market leader and massive community like Fiverr.”\nWhile the two brands will collaborate extensively, they will remain separate in the near-term, with AND CO becoming AND CO from Fiverr.\nAND CO marks Fiverr’s second recent acquisition following the purchase of vertical video marketplace player Veed.me in late June. The company will continue to aggressively pursue professional vertical marketplaces as well as toolsets and services that allow freelancers and entrepreneurs to effectively accomplish more, while expanding its Pro initiative to provide professional freelancers a home to build high end businesses.\nAbout Fiverr\nFiverr is the world's largest marketplace for creative and digital services, including graphic design, copywriting, voice overs, and music and film editing. Fiverr's mission is to champion the entrepreneur in us all by giving entrepreneurs, freelancers, small businesses and even enterprises the resources they need to get things done in the new economy. Fiverr's global community of freelancers have delivered over 40 million high-quality Gigs from over 100 service categories across 190 countries. We invite you to visit us at fiverr.com , and our blog and follow us on Facebook , Twitter and Instagram .\nSam Katzen\nPhone Number: +1 925-389-6887\nEmail: sam.k@fiverr.com\nSource:Fiverr International Ltd", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/a9b94778-9f52-45f4-896e-ce42d55c30ca", "http://ctt.marketwire.com/?release=1228252&id=7677211&type=1&url=http%3a%2f%2fwww.fiverr.com%2f", "https://www.facebook.com/Fiverr/", "http://ctt.marketwire.com/?release=1228252&id=7677217&type=1&url=https%3a%2f%2ftwitter.com%2ffiverr", "http://ctt.marketwire.com/?release=1228252&id=7677220&type=1&url=https%3a%2f%2finstagram.com%2ffiverr%2f", "http://blog.fiverr.com/"], "published": "2018-01-24T20:00:00.000+02:00", "crawled": "2018-01-24T20:59:14.043+02:00", "highlightTitle": ""}