{"organizations": [], "uuid": "ab47428fc166dc7807a84f024a03b5b879da9419", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-endo-intl-subpeona/endo-gets-subpoena-for-drugs-containing-opioid-painkiller-idUSKBN1F01T3", "country": "US", "domain_rank": 408, "title": "Endo gets subpoena for drugs containing opioid painkiller", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:56:00.000+02:00", "replies_count": 0, "uuid": "ab47428fc166dc7807a84f024a03b5b879da9419"}, "author": "", "url": "https://www.reuters.com/article/us-endo-intl-subpeona/endo-gets-subpoena-for-drugs-containing-opioid-painkiller-idUSKBN1F01T3", "ord_in_thread": 0, "title": "Endo gets subpoena for drugs containing opioid painkiller", "locations": [], "entities": {"persons": [{"name": "endo", "sentiment": "negative"}, {"name": "akankshita mukhopadhyay", "sentiment": "none"}, {"name": "savio d'souza", "sentiment": "none"}], "locations": [{"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "reuters) - endo international plc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "u.s. attorney’s office for the southern district of florida", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 2:00 PM / Updated an hour ago U.S. subpoenas Endo for information on opioid painkillers Nate Raymond 3 Min Read \n(Reuters) - Pharmaceutical company Endo International Plc said on Thursday it had received a grand jury subpoena from federal prosecutors in Miami seeking documents related to drugs it produces that contain the opioid painkiller oxymorphone. \nThe federal probe comes amid a growing number of lawsuits by state and local governments accusing Endo of contributing to the national drug addiction epidemic by deceptively marketing Opana ER, a powerful opioid painkiller containing oxymorphone. \nEndo and other drugmakers facing similar lawsuits have denied wrongdoing. They have generally argued the U.S. Food and Drug Administration approved their products as safe and effective and that they carried warning labels disclosing their risks. \nEndo said the subpoena from the U.S. Attorney’s Office for the Southern District of Florida broadly requests documents relating to, among other things, product safety, overdoses and the abuse and addictivness of the drugs. \nEndo said the subpoena also seeks copies of its distribution agreements; sales and marketing, training, financial, compensation and corporate information; and documents related to the drugmaker’s interactions with government agencies. \nDublin-based Endo said it plans to cooperate with the investigation and that its policy is to comply with all applicable laws governing the sale and marketing of pharmaceutical products. \nEndo’s shares were trading at $7.82, down 3 percent, at midday on Thursday. \nThe U.S. Centers for Disease Control and Prevention says opioids were involved in over 42,000 deaths in 2016. In October, U.S. President Donald Trump declared the problem a national public health emergency. \nEndo has faced a wave of lawsuits by Kentucky, Louisiana, Mississippi, Missouri, New Mexico, and Ohio, as well as several cities and counties, over its marketing of opioids. Many of those cases target other drugmakers as well. \nThe lawsuits have centered on Opana ER, a long-acting opioid painkiller. Endo last year pulled it from the market after the FDA said the drug’s benefit did not outweigh public health risks associated with opioid abuse. \nThe lawsuits have generally alleged that Endo sought to overstate the benefits of using Opana ER for the long-term treatment of chronic pain while downplaying the risk of addiction, helping to fuel a public health epidemic. \nBeyond the lawsuits Endo, along with other opioid manufacturers, is facing a coordinated investigation by a group of state attorneys general related to their products. Reporting by Nate Raymond in Boston and Akankshita Mukhopadhyay in Bengaluru; Editing by Savio D'Souza and Susan Thomas", "external_links": [], "published": "2018-01-11T15:56:00.000+02:00", "crawled": "2018-01-11T16:11:09.000+02:00", "highlightTitle": ""}