{"organizations": [], "uuid": "12db9a1afdbed955d4ebae42ab127edb84a1ea04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-duke-energy-ohio-names-amy-spiller-vice-president-of-government-and-community-affairs.html", "country": "US", "domain_rank": 767, "title": "Duke Energy Ohio names Amy Spiller vice president of Government and Community Affairs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-08T18:00:00.000+02:00", "replies_count": 0, "uuid": "12db9a1afdbed955d4ebae42ab127edb84a1ea04"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-duke-energy-ohio-names-amy-spiller-vice-president-of-government-and-community-affairs.html", "ord_in_thread": 0, "title": "Duke Energy Ohio names Amy Spiller vice president of Government and Community Affairs", "locations": [], "entities": {"persons": [{"name": "amy spiller", "sentiment": "negative"}, {"name": "spiller", "sentiment": "none"}, {"name": "duke ene", "sentiment": "none"}, {"name": "amy", "sentiment": "none"}, {"name": "jim henning", "sentiment": "none"}], "locations": [{"name": "cincinnati", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "community affairs", "sentiment": "negative"}, {"name": "duke energy ohio", "sentiment": "negative"}, {"name": "duke energy ohio/kentucky", "sentiment": "none"}, {"name": "duke energy", "sentiment": "none"}, {"name": "cinergy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CINCINNATI, Jan. 8, 2018 /PRNewswire/ -- Duke Energy Ohio has named Amy Spiller vice president of Government and Community Affairs, effective Jan. 16, 2018. Spiller will manage state government and regulatory policies, strategies and relationships impacting Duke Energy Ohio's interests and those of its customers. She will also lead the company's local community relations efforts with key stakeholders in southwest Ohio.\n\"Amy brings deep knowledge and experience, commitment and proven leadership to build on our positive record in Ohio,\" said Jim Henning, president of Duke Energy Ohio/Kentucky. \"She'll continue to be an outstanding advocate for our customers and stakeholders across southwest Ohio – as we continue our path toward a smarter energy future.\"\nSpiller joined Cinergy, a predecessor to Duke Energy, in 2003 as an associate general counsel focused on litigation. In 2008, she was promoted to her current role of deputy general counsel, where she helps shape and guide the company's regulatory strategic planning in Ohio and Kentucky. Spiller is also responsible for advancing Duke Energy's rate and regulatory initiatives before the Kentucky Public Service Commission and Public Utilities Commission of Ohio. She will continue to lead this important legal function until the company names her successor.\n\"I'm excited for this opportunity and the challenge of my new role,\" said Spiller. \"Most of all, I'm thrilled to work with a very respected, passionate and talented team.\"\nSpiller earned a bachelor's degree in economics and management from Albion College in Michigan and a law degree from Wake Forest University in Winston-Salem, N.C. Following law school, she spent two years working for a legal publishing company in northeast Ohio. Then, from 1993 to 2003, Spiller rose from associate to partner at a small insurance defense law firm in Cincinnati.\nShe serves on the board of directors of Red Bike, Cincinnati's nonprofit bike-share system, and is a member of the Cincinnati and Northern Kentucky bar associations. Spiller previously served on the boards of Accountability and Credibility Together and the Cincinnati Youth Collaborative, and was a member of the steering committee for the Greater Cincinnati Minority Counsel Program. She's a graduate of the Cincinnati Chamber of Commerce's WE Lead program and, in 2015, Spiller was also inducted into the Hall of Fame of Duke Energy's Business Women's Network employee resource group in Cincinnati. A native of northern Michigan, Spiller and her husband, Keith, have lived in Cincinnati for nearly 25 years.\nDuke Energy Ohio/Kentucky\nDuke Energy Ohio/Kentucky's operations provide electric service to about 850,000 residential, commercial and industrial customers in a 3,000-square-mile service area and natural gas service to approximately 529,000 customers.\nHeadquartered in Charlotte, N.C., Duke Energy is one of the largest energy holding companies in the United States. Its Electric Utilities and Infrastructure business unit serves approximately 7.5 million customers located in six states in the Southeast and Midwest. The company's Gas Utilities and Infrastructure business unit distributes natural gas to approximately 1.6 million customers in the Carolinas, Ohio, Kentucky and Tennessee. Its Commercial Renewables business unit operates a growing renewable energy portfolio across the United States.\nDuke Energy is a Fortune 125 company traded on the New York Stock Exchange under the symbol DUK. More information about the company is available at duke-energy.com .\nThe Duke Energy News Center serves as a multimedia resource for journalists and features news releases, helpful links, photos and videos. Hosted by Duke Energy, illumination is an online destination for stories about people, innovations, and community and environmental topics. It also offers glimpses into the past and insights into the future of energy.\nFollow Duke Energy on Twitter , LinkedIn , Instagram and Facebook .\nMedia contact: Lee Freedman\n513.287.4152 | @DE_LeeF | 24-Hour: 800.559.3853\nView original content with multimedia: http://www.prnewswire.com/news-releases/duke-energy-ohio-names-amy-spiller-vice-president-of-government-and-community-affairs-300579007.html\nSOURCE Duke Energy", "external_links": ["https://twitter.com/dukeenergy", "http://www.duke-energy.com/", "http://illumination.duke-energy.com/", "https://www.instagram.com/duke_energy", "https://www.facebook.com/dukeenergy", "http://news.duke-energy.com/", "https://twitter.com/DE_LeeF", "http://www.prnewswire.com/news-releases/duke-energy-ohio-names-amy-spiller-vice-president-of-government-and-community-affairs-300579007.html", "https://www.linkedin.com/company/duke-energy-corporation"], "published": "2018-01-08T18:00:00.000+02:00", "crawled": "2018-01-08T18:55:26.004+02:00", "highlightTitle": ""}