{"organizations": [], "uuid": "f23c220f08840bb2296d2240eb33d40fa97bcb24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 145, "shares": 145, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1224994763&w=1200&r=LYNXMPEE0O032", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea/korean-hockey-players-arrive-for-joint-olympics-practice-as-north-korea-calls-for-unity-idUSKBN1FE05F", "country": "US", "domain_rank": 408, "title": "Korean hockey players arrive for joint Olympics practice as North Korea calls for unity", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T04:04:00.000+02:00", "replies_count": 0, "uuid": "f23c220f08840bb2296d2240eb33d40fa97bcb24"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea/korean-hockey-players-arrive-for-joint-olympics-practice-as-north-korea-calls-for-unity-idUSKBN1FE05F", "ord_in_thread": 0, "title": "Korean hockey players arrive for joint Olympics practice as North Korea calls for unity", "locations": [], "entities": {"persons": [{"name": "christine kim", "sentiment": "none"}], "locations": [{"name": "north korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "koreas", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - A delegation of North Korean officials and ice hockey players crossed the heavily guarded border into South Korea on Thursday for joint Olympics training, as Pyongyang called for all Koreans to seek unification of the two nations.\nThe group included 12 North Korean players who will form a combined women’s ice hockey team with their southern counterparts at next month’s Winter Olympics in the South Korean mountain resort of Pyeongchang.\nAfter going through South Korean checkpoints at the border, the team travelled to a national training centre in Jincheon, 90 km (56 miles) south of Seoul.\nStepping off a bus, the athletes ignored questions as they were mobbed by throngs of media.\nThey wore puffy winter jackets in the white, blue, and red colours of North Korea’s flag, with “DPR Korea” emblazoned on the back, referring to the country’s official name, the Democratic People’s Republic of Korea.\nThe athletes were met in Jincheon with flowers from their South Korean counterparts, as well as head coach Sarah Murray, who previously had called the government’s decision to form a joint team a “tough situation.”\nUnder an agreement worked out during the first official talks between the two Koreas in two years, the joint team will wear unity jerseys and march under a unified peninsula flag at the Games’ opening ceremony on February 9.\nSouth Korea has prepared “all contingency scenarios” in case North Korea makes any provacative moves during the Olympics, but the games remain an opportunity for “peaceful engagement,” South Korean foreign minister Kang Kyung-wha told Reuters in an interview on the sidelines of the World Economic Forum in Davos, Switzerland. “We just need to make the best of it.”\nEarly on Thursday, North Korea sent a rare announcement addressed to “all Koreans at home and abroad”, saying they should make a “breakthrough” for unification without the help of other countries, its state media said.\nAll Koreans should “promote contact, travel, cooperation between North and South Korea” while adding Pyongyang will “smash” all challenges against reunification of the Korean peninsula.\nNorth and South Korea remain technically at war after their 1950-53 conflict ended in a truce rather than a peace treaty. Tensions escalated dramatically last year as the regime of Kim Jong Un stepped up its programme aimed at developing a nuclear-tipped missile capable of striking the United States.\nPEACE OR PROPAGANDA?\nThe Olympic Cauldron for the upcoming 2018 Pyeongchang Winter Olympic Games is pictured at the Alpensia resort in Pyeongchang, South Korea, January 23, 2018. REUTERS/Fabrizio Bensch In a separate statement on Thursday, North Korea advertised a new “large scale” tourist project in coastal Kangwon province, the same area where South Korean officials have agreed to hold joint athletic and cultural events around the Olympics.\nSome South Korean opposition politicians and conservatives have criticised Seoul’s response to North Korea’s participation in the games, saying Kim was using North Korea’s involvement for his own purposes.\nMany other South Koreans welcomed the North’s participation, but complained that the unified women’s ice hockey team - the only such joint team to be formed - was unfair to the players.\nThe controversy has sent South Korean President Moon Jae-in’s overall approval rating below 60 percent for the first time since he took office in May last year, according to a survey released on Thursday by South Korean pollster Realmeter, dropping more than 6 percentage points since last week.\nU.S. Vice President Mike Pence plans to use his attendance at the Games to try to counter what he sees as Kim’s efforts to “hijack” the games with a propaganda campaign, a White House official said on Tuesday.\nThe South Korean government has rejected criticism that the games had been hijacked by North Korea, saying the event will help defuse tensions over Pyongyang’s nuclear and missile programme.\nStill, Washington on Wednesday imposed fresh sanctions on nine entities, 16 people and six North Korean ships it accuses of helping the North’s weapons programmes. It also urged China and Russia, North Korea’s main allies, to expel North Koreans raising funds for the programmes.\nChina, the main source of North Korea’s fuel, said on Thursday it had exported no oil products to North Korea in December except for a tiny cargo of jet fuel, the latest sign that Beijing has kept up pressure on its isolated neighbour.\nRelated Coverage North Korea trumpets 'world-level' tourist project ahead of Olympics North Korean ice hockey players arrive in South Korea for joint Olympics practice: Yonhap Military tension on the Korean peninsula was a “fundamental obstacle” for the improvement of inter-Korean relations and unification, the North’s official news agency said in its statement on Thursday.\nIt added joint military drills with “outside forces” were unhelpful for the development of relations between North and South Korea.\nSouth Korea successfully pressed the United States to delay large-scale annual drills involving the two countries troops until after the Olympics, but Washington officials have rejected the idea of a permanent halt to the exercises in exchange for North Korea freezing its missile and nuclear weapons tests.\nThe proposal to delay the exercise was based on the “spirit of the Olympic Games”, Foreign Minister Kang said, declining to elaborate on whether the South would resume the drills after the event.\nAdditional reporting by Yuna Park, Hyonhee Shin and Haejin Choi in SEOUL, and Soyoung Kim in DAVOS, Switzerland; Writing by Josh Smith; Editing by Lincoln Feast and Neil Fullick\n ", "external_links": [], "published": "2018-01-25T04:04:00.000+02:00", "crawled": "2018-01-25T04:25:41.013+02:00", "highlightTitle": ""}