{"organizations": [], "uuid": "c49f0067071ad7d817cc4ae922f4ea8b8b3de6cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219774930&w=1200&r=LYNXMPEE05060", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-china-banks-regulation/china-tightens-scrutiny-on-commercial-lender-shareholders-idUSKBN1EV06B", "country": "US", "domain_rank": 408, "title": "China tightens scrutiny on commercial lender shareholders", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T08:36:00.000+02:00", "replies_count": 0, "uuid": "c49f0067071ad7d817cc4ae922f4ea8b8b3de6cd"}, "author": "", "url": "https://www.reuters.com/article/us-china-banks-regulation/china-tightens-scrutiny-on-commercial-lender-shareholders-idUSKBN1EV06B", "ord_in_thread": 0, "title": "China tightens scrutiny on commercial lender shareholders", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "china banking regulatory commission", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "cbrc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 6:39 AM / Updated 14 hours ago China tightens rules on commercial lender shareholders, entrusted loans Reuters Staff 3 Min Read \nBEIJING (Reuters) - China’s banking regulator has introduced new measures to increase scrutiny on investments in commercial lenders and tighten regulation on the entrusted loans market, a rapidly growing segment of the country’s shadow banking. \nThe China Banking Regulatory Commission (CBRC) published regulations on its website late on Friday that put limits on the number of commercial banks that single investors can have major holdings in. The rules are aimed at tackling “disorder” in the banking sector, including the abuse of rights by major shareholders and the prevalence of “invisible shareholders”. \nAnd in separate measures announced on Saturday, the CBRC said it would require firms to step up their risk management and disclosure around entrusted loans, a form of business-to-business financing. \nUnder the new commercial lender shareholding regulations, a single investor can hold 5 percent or more, considered a major shareholding, of no more than two commercial banks, or a controlling stake of no more than one lender. \nAny stake purchase of more than 5 percent must be approved by the CBRC and major shareholders of commercial lenders cannot hold interests in the same institution via financial products. \nThe measures, which follow draft regulations released in November, also require major shareholders to disclose their ownership structures up to the ultimate beneficial holder. \nThe regulatory moves could have implications for companies such as Anbang Insurance Group, which holds multiple stakes in commercial lenders. \nAs of Sept. 30, Anbang Insurance Group held a 15.54 percent in China Minsheng Bank 600016 as a result of a direct stake held by Anbang Life and through two separate financial products, company filings show. \nThe Beijing-based insurer also held a greater than 13 percent interest in China Merchants Bank Co ( 600036.SS ) through its property and casualty insurance unit during the same period. \nThe CBRC’s new rules regulating entrusted loans, published on its website on Saturday, include strengthening risk management, supervision, and disclosures on the source and intended use of the funds. \nEntrusted loans are a form of inter-company financing in which one firm serves as the ultimate lender and records the loan asset on its balance sheet while banks act as intermediaries for a fee. \nThe entrusted loans market has grown rapidly in recent years and had some positive effects, the CBRC said, but a lack of standardized regulations meant there were “certain hidden risks”. \nIn recent months, Chinese regulators have introduced a series of new measures aimed at controlling risk and leverage in the financial system, with everything from lending practices to shadow banking under the microscope. Reporting by Matt Miller and Philip Wen; Editing by Sam Holmes", "external_links": [], "published": "2018-01-06T08:36:00.000+02:00", "crawled": "2018-01-06T09:02:18.024+02:00", "highlightTitle": ""}