{"organizations": [], "uuid": "0b7eaeadc680aa4bfa9c595dcbe6d5804970874c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-dollar-extends-weakness-on-mnuchin-remarks-bond-prices-down-idUSL8N1PJ5C8", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Dollar extends weakness on Mnuchin remarks; bond prices down", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T01:35:00.000+02:00", "replies_count": 0, "uuid": "0b7eaeadc680aa4bfa9c595dcbe6d5804970874c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-dollar-extends-weakness-on-mnuchin-remarks-bond-prices-down-idUSL8N1PJ5C8", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Dollar extends weakness on Mnuchin remarks; bond prices down", "locations": [], "entities": {"persons": [{"name": "wilbur ross", "sentiment": "negative"}, {"name": "mnuchin", "sentiment": "negative"}, {"name": "caroline valetkevitch", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "u.s. treasury", "sentiment": "negative"}, {"name": "commerce", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Wall St mood cools after Wilbur Ross comments on China\n* U.S. Treasury prices tumble after Mnuchin endorses weak dollar\n* Dollar dented by Mnuchin comments, slips vs all major peers (Updates with midday U.S. markets activity)\nBy Caroline Valetkevitch\nNEW YORK, Jan 24 (Reuters) - The U.S. dollar extended recent weakness, hitting three-year lows again, and U.S. bond prices eased on Wednesday after U.S. Treasury Secretary Steven Mnuchin said he welcomed its weakness in the currency.\nFear of protectionism from the U.S. economy, the world’s largest, had already pushed the greenback to a three-year low, but Mnuchin’s remark at the annual Davos summit of business and political leaders pushed it down further.\nAdding to those fears, Commerce Secretary Wilbur Ross said U.S. trade authorities are investigating whether there is a case for taking action over China’s infringements of intellectual property.\nU.S. President Donald Trump had slapped steep tariffs on imported washing machines and solar panels on Monday.\nThe dollar index, which measures the greenback against a basket of six major currencies, was down 0.93 at 89.283, slipping below 90 for the first time since December 2014.\n“It’s quite significant given that this is the first time in a very long time that a Treasury secretary has spoken against a strong dollar,” said Sireen Harajli, FX strategist at Mizuho.\nThe S&P 500 was flat, paring gains after the Ross comments, which fueled trade war fears. The dollar’s weakness, however, was providing some support since it helps U.S. multinationals’ earnings.\n“To the extent that global growth is solid and a sizable portion of S&P earnings are earned overseas, I don’t look at this as being dollar negative at all,” said Joseph LaVorgna, chief economist for Americas at Nations in New York.\nAlso weighing on the S&P 500, GE shares were down 2.7 percent. In the latest blow to the largest U.S. industrial conglomerate, U.S. securities regulators are probing a massive insurance charge GE announced last week. GE also forecast more weakness at its power business this year, a unit that produced 60 percent of profits as recently as 2016.\nThe Dow Jones Industrial Average rose 51.4 points, or 0.2 percent, to 26,262.21, the S&P 500 lost 3.03 points, or 0.11 percent, to 2,836.1 and the Nasdaq Composite dropped 43.40 points, or 0.58 percent, to 7,416.89.\nThe pan-European FTSEurofirst 300 index lost 0.51 percent and MSCI’s gauge of stocks across the globe gained 0.12 percent.\nEuro zone businesses enjoyed a much better start to 2018 than anyone polled by Reuters expected, ramping up activity at the fastest rate since the middle of 2006, a survey showed on Wednesday.\nU.S. Treasury debt prices slumped, also after Mnuchin’s comments.\nBenchmark 10-year notes last fell 8/32 in price to yield 2.6502 percent, from 2.622 percent late on Tuesday.\nIn the oil market, U.S. crude rose 0.51 percent to $64.80 per barrel and Brent was last at $69.85, down 0.16 percent on the day.\nAdditional reporting by Abhinav Ramnarayan and Marc Jones in London, and Saqib Iqbal Ahmed in New York and Sruthi Shankar in Bengaluru; Editing by Mark Heinrich and Nick Zieminski\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T01:35:00.000+02:00", "crawled": "2018-01-25T12:59:03.005+02:00", "highlightTitle": ""}