{"organizations": [], "uuid": "55be74e2380f70863518a83a85cdb7f9308366f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-corus-entertainment-declares-monthly-dividend-for-class-a-and-class-b-shareholders.html", "country": "US", "domain_rank": 767, "title": "Corus Entertainment Declares Monthly Dividend for Class A and Class B Shareholders", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:01:00.000+02:00", "replies_count": 0, "uuid": "55be74e2380f70863518a83a85cdb7f9308366f4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-corus-entertainment-declares-monthly-dividend-for-class-a-and-class-b-shareholders.html", "ord_in_thread": 0, "title": "Corus Entertainment Declares Monthly Dividend for Class A and Class B Shareholders", "locations": [], "entities": {"persons": [], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}], "organizations": [{"name": "corus entertainment inc.", "sentiment": "negative"}, {"name": "corus entertainment", "sentiment": "negative"}, {"name": "corus", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "ast trust comp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan. 10, 2018 /PRNewswire/ - Corus Entertainment Inc. (TSX: CJR.B) announced today that its Board of Directors has declared monthly dividends of $0.094583 per Class A Share and $0.095 per Class B Share payable on each of February 28, 2018, March 30, 2018 and April 30, 2018 to shareholders of record at the close of business on February 14, 2018, March 15, 2018 and April 16, 2018, respectively.\nThe foregoing dividends are designated as \"eligible\" dividends for the purpose of the Income Tax Act (Canada) and any similar provincial legislation.\nCorus' Board of Directors reviews the dividend on a quarterly basis. Shareholders are entitled to receive dividends only when any such dividends are declared by Corus' Board of Directors and there is no entitlement to any dividend prior thereto.\nRegistered shareholders who are residents of Canada and who are not currently participating in Corus' Dividend Reinvestment Plan (\"the Plan\") may elect to participate in the Plan through the completion of an enrollment form which can be obtained from the Company's plan administrator, AST Trust Company (Canada), on their website at www.astfinancial.com/ca-en/ or by calling 1.800.387.0825. The Plan allows eligible holders of Class A Shares and Class B Shares to acquire additional Class B Shares through reinvestment of the cash dividends paid on their respective shareholdings. Non-registered beneficial shareholders who are residents of Canada and who wish to join the Plan should consult their broker, financial institution or other intermediary through which they hold Class A Shares or Class B Shares.\nCorus' Board of Directors confirms that the Company will continue to issue shares from treasury at a 2% discount from the average market price to Plan participants of record, as determined pursuant to the terms of the Plan.\nThere were 3,421,792 Class A Voting Shares and 203,923,227 Class B Non-Voting Shares outstanding on December 31, 2017.\nCorus Entertainment Inc. reports in Canadian dollars.\nAbout Corus Entertainment Inc.\nCorus Entertainment Inc. (TSX: CJR.B) is a leading media and content company that creates and delivers high quality brands and content across platforms for audiences around the world. The company's portfolio of multimedia offerings encompasses 45 specialty television services, 39 radio stations, 15 conventional television stations, a global content business, digital assets, live events, children's book publishing, animation software, technology and media services. Corus' roster of premium brands includes Global Television, W Network, OWN: Oprah Winfrey Network Canada, HGTV Canada, Food Network Canada, HISTORY®, Showcase, National Geographic Channel, Q107, CKNW, Fresh Radio, Disney Channel Canada, YTV and Nickelodeon Canada. Visit Corus at www.corusent.com .\nFollow Corus PR @CorusPR\nSOURCE Corus Entertainment Inc.", "external_links": ["http://www.astfinancial.com/ca-en/", "http://www.corusent.com/", "https://twitter.com/CorusPR"], "published": "2018-01-10T15:01:00.000+02:00", "crawled": "2018-01-10T16:19:13.000+02:00", "highlightTitle": ""}