{"organizations": [], "uuid": "5d7dd23163b4a0bc06ec94801918eb0c7a600615", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-samson-oil-gas-enters-into-letter-of-intent-with-respect-to-foreman-butte-project.html", "country": "US", "domain_rank": 767, "title": "Samson Oil & Gas Enters into Letter of Intent with Respect to Foreman Butte Project", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.998, "site_type": "news", "published": "2018-01-23T02:10:00.000+02:00", "replies_count": 0, "uuid": "5d7dd23163b4a0bc06ec94801918eb0c7a600615"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-samson-oil-gas-enters-into-letter-of-intent-with-respect-to-foreman-butte-project.html", "ord_in_thread": 0, "title": "Samson Oil & Gas Enters into Letter of Intent with Respect to Foreman Butte Project", "locations": [], "entities": {"persons": [{"name": "firehawk", "sentiment": "none"}, {"name": "samson", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}], "organizations": [{"name": "foreman butte project denver & perth", "sentiment": "negative"}, {"name": "samson oil", "sentiment": "negative"}, {"name": "samson oil & gas enters", "sentiment": "negative"}, {"name": "firehawk oil and gas llc", "sentiment": "none"}, {"name": "foreman butte project", "sentiment": "none"}, {"name": "omaha bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER & PERTH, Australia--(BUSINESS WIRE)-- Samson Oil and Gas Limited (ASX: SSN and OTC: SSNYY) has executed a non-binding letter of intent to sell its Foreman Butte Project, which comprises substantially all of its assets, to Firehawk Oil and Gas LLC for US$41.5 million. The parties have agreed to a 21-day exclusivity period during which the buyer will conduct customary due diligence on the properties with a view to executing a definitive agreement at or prior to its expiration. The effective date of the transaction would be January 1 st 2018.\nSamson and Firehawk, a private equity funded exploration and production company, expect to close the sale by 1 March 2018. Firehawk has already conducted an extensive technical and financial analysis of the Project.\nThe transaction is subject to the approval of Samson’s shareholders, which will be sought at a shareholder meeting to be called as soon as practicable.\nWhen completed, the transaction would allow the Company’s current debt facility with Mutual of Omaha Bank to be repaid in full along with its other liabilities, including the Company’s hedge book.\nThe Company would expect to emerge from this transaction with a cash balance of approximately US$12 million. The residual cash calculation of US$12 million is only an internal estimate, has not been audited and is subject to change. However, it would represent a net cash asset value of US$0.73 per ADS or A$0.0045 per ordinary share (assuming a 0.8 exchange rate to the A$).\nThe Foreman Butte Project was acquired for $16 million in January 2016. Upon its acquisition, the Company recognized a gain on bargain purchase of $10.8 million. After allowing for capital expenditures, depreciation and the release of associated provisions for asset retirement, the Company would expect to record a profit of approximately US$10.0 million on the proposed US$41.5 million sale, before transactional expenses and associated costs.\nSamson’s Ordinary Shares are traded on the Australian Securities Exchange under the symbol \"SSN.\" Samson's American Depository Shares (ADSs) are traded on the OTC Markets under the symbol \"SSNYY.\" Each ADS represents 200 fully paid Ordinary Shares of Samson. Samson has a total of 3,283 million ordinary shares issued and outstanding, which would be the equivalent of 16.5 million ADSs. Accordingly, based on the OTC Pink closing price of US$0.15 per ADS on January 19th, 2018, the Company has a current market capitalization of approximately US$2.6 million. Correspondingly, based on the ASX closing price of A$0.002 for ordinary shares, on January 19 th , 2018, the Company has a current market capitalization of approximately A$6.5 million.\nSAMSON OIL & GAS LIMITED\nTERRY BARR\nManaging Director\nStatements made in this press release that are not historical facts may be forward-looking statements, including but not limited to statements using words like “may,” “believe,” “expect,” “anticipate,” “should” or “will.” Actual results may differ materially from those projected in any forward-looking statement. There are a number of important factors that could cause actual results to differ materially from those anticipated or estimated by any forward-looking information, including the risks that the anticipated sales transaction will not close or that the purchase price will be materially reduced on account of potential liabilities uncovered during due diligence as well as uncertainties inherent in estimating the methods, timing and results of exploration activities. A description of the risks and uncertainties that are generally attendant to Samson and its industry, as well as other factors that could affect Samson’s financial results, are included in the prospectus and prospectus supplement for its recent Rights Offering as well as the Company's report to the U.S. Securities and Exchange Commission on Form 10-K, which are available at www.sec.gov/edgar/searchedgar/webusers.htm .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006659/en/\nSamson Oil and Gas Limited\nTerry Barr, CEO, 303-296-3994 (US office)\nSource: Samson Oil and Gas Limited", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov%2Fedgar%2Fsearchedgar%2Fwebusers.htm&esheet=51747199&newsitemid=20180122006659&lan=en-US&anchor=www.sec.gov%2Fedgar%2Fsearchedgar%2Fwebusers.htm&index=1&md5=61af19517332a92c70d72b0a32865788", "http://www.businesswire.com/news/home/20180122006659/en/"], "published": "2018-01-23T02:10:00.000+02:00", "crawled": "2018-01-23T04:04:32.011+02:00", "highlightTitle": ""}