{"organizations": [], "uuid": "4bf56fb6c473cf52619a6d62bce3cdc0ea0dbfc4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 21}, "facebook": {"likes": 58, "shares": 58, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104971639-blockhain_conf_5.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/27/blockchain-connect-conference-attracted-1500-to-sf-and-it-was-chaos.html", "country": "US", "domain_rank": 767, "title": "Blockchain Connect Conference attracted 1,500 to SF and it was chaos", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-27T19:50:00.000+02:00", "replies_count": 0, "uuid": "4bf56fb6c473cf52619a6d62bce3cdc0ea0dbfc4"}, "author": "Ari Levy", "url": "https://www.cnbc.com/2018/01/27/blockchain-connect-conference-attracted-1500-to-sf-and-it-was-chaos.html", "ord_in_thread": 0, "title": "Blockchain Connect Conference attracted 1,500 to SF and it was chaos", "locations": [], "entities": {"persons": [{"name": "ari levy", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ari Levy | CNBC Attendees waiting in line at the Blockchain Connect Conference in San Francisco \nNear the entrance to the Palace of Fine Arts, a woman was handing out fliers promoting the initial coin offering for RecordGram , a project that's aiming to put song rights on the blockchain. She was pitching to dozens of people who were trying to get into the Blockchain Connect Conference, but were held up because they first had to download the Eventbrite app to access their digital tickets. \nThat was just to get a temporary badge to get them in the door. From there, they had to stand in another long line on Friday morning and wait for their actual nametag. \nWelcome to blockchain 2018, a chaotic mishmash of hardcore developers with wild ideas, nouveau investors with money to blow and overcrowded conferences with — at least in some cases — lousy logistical sense. \nBlockchain Connect described itself as the \"first U.S.-China blockchain conference,\" and an event that would bring together \"over 1,000 scientists, entrepreneurs, investors and developers from all over the world for a day of blockchain discussion.\" \nThe problem for paying attendees is that they numbered well over 1,000. According to the website for the Palace of Fine Arts, the theatre holds 962 people. As of about 10:30 a.m., according to a person working the door, there were over 1,500 people on hand, with most paying between $500 and $1,000 for a ticket. \nThe exhibition hall doubled as a spillover room, where conferencegoers could watch sessions on a big-screen TV, though they were unlikely to hear much over the loud surrounding chatter. There was a curtained off VIP lounge for speakers and the press, but nobody was checking badges so anyone could enter. Inside, there were two TVs and equally bad acoustics. Ari Levy | CNBC VIP Lounge at the Blockchain Connect Conference in San Francisco \nLunch was served before 11 a.m. You could choose boxed up sandwiches, with either ham and cheese, eggplant or \"rare roast beef.\" \nAnd then there was perhaps the most bizarre thing this reporter has seen in 12 years attending tech conferences as a journalist. \nA line of people had formed inside the exhibit hall. They weren't waiting to get into the theatre, which had long since reached capacity, but just wanted to enter the lobby and many just needed to exit the building. The only other way out was an exit door near the rear of the exhibit hall that, by all appearances, wasn't supposed to be in use. \nPeople were angry. Some just needed to retrieve their belongings from another room. \nAmong those in line to the lobby was Sanjay Parihar, the co-founder and CEO of ParentRound , a site that's designed to help parents connect and discuss things like homework and safety topics. Parihar was in town from Houston to meet blockchain experts as he prepares to launch an ICO later this year. ParentRound's virtual currency will let people earn tokens for activities like volunteer work, he said. Decentralized everything \n\"I'm here to connect and to learn,\" said Parihar, adding that he attends on average two blockchain events a month. \"[San Francisco] is the place for the blockchain.\" \nThe event's featured speakers included Litecoin founder Charlie Lee, Ripple CEO Brad Garlinghouse and venture capitalists from General Catalyst Partners, Institutional Venture Partners and Foundation Capital. Aaron Cai, the general manager of Tencent Blockchain, gave a presentation on the Chinese internet giant's various projects. \nInside the exhibition hall, there were booths for teams working on decentralized autonomous video content, decentralized online marketplaces, blockchain-based cloud computing, a peer-to-peer electricity exchange and a cryptocurrency mining pool. Ari Levy | CNBC Exhibition hall at the Blockchain Connect Conference in San Francisco \nAddy Crezee was there to promote another blockchain conference called BlockShow , and he was offering $99 tickets (an 80 percent discount) for attendees of Blockchain Connect. \nCrezee, who said he's based in Singapore and Russia, witnessed firsthand the spike in conference attendance. At the BlockShow in Singapore two months ago, there were 1,500 people. He said he's expecting 5,000 people to attend the Las Vegas show in August, and about the same number in Singapore this year. \n\"There are lots of investors now because you can invest any amount of money,\" said Crezee, BlockShow's CEO. \"They're looking for interesting products.\" \nCrezee said he's also seeing more lawyers exploring the market as well as banks and big corporations. Events in France, Israel and Mexico \nAccording to the website Brave New Coin , there are 35 notable blockchain conferences around the world between now and the end of February. They include this weekend's World Blockchain and Cryptocurrency Summit in Moscow, next week's Paris Fintech Forum, and the OurCrowd Global Investor Summit in Jerusalem on Feb. 1. \nTwo days after the Israel conference, enthusiasts will travel to the beaches of Tulum, Mexico, for the CryptoPsychedelic Summit , an event that promises to \"bring together leaders in blockchain and psychedelic science to discuss new possibilities in research, innovation, and community building.\" \nTim Siwula was at Blockchain Connect on Friday, volunteering at the booth for ConsenSys , a company that provides infrastructure for developers and businesses building on the ethereum blockchain. \nSiwula, who recently graduated from the University of San Francisco with a computer science degree, has attended a number of more technical events and meetups. Yet he said the crowd at the Palace of Fine Arts was \"more general\" and seemed to include more business people and investors. \nStill, he was impressed by the size of the audience and how many attendees were there from a variety of industries and backgrounds. \n\"It's pretty vibrant,\" he said. \"This one seems pretty big. You can't get inside the theatre. And there's only one bathroom.\" \nThere were actually at least two, but the security guard he asked gave him incorrect information. WATCH: How bitcoin can transform music show chapters", "external_links": [], "published": "2018-01-27T19:50:00.000+02:00", "crawled": "2018-01-27T19:50:41.000+02:00", "highlightTitle": ""}