{"organizations": [], "uuid": "1767cdf73cdc54afcf62a99fb39edce0250b2265", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-pregnancy-nausea/more-evidence-common-morning-sickness-drug-may-not-work-idUSKBN1F62NS", "country": "US", "domain_rank": 408, "title": "More evidence common morning sickness drug may not work", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T21:31:00.000+02:00", "replies_count": 0, "uuid": "1767cdf73cdc54afcf62a99fb39edce0250b2265"}, "author": "", "url": "https://www.reuters.com/article/us-health-pregnancy-nausea/more-evidence-common-morning-sickness-drug-may-not-work-idUSKBN1F62NS", "ord_in_thread": 0, "title": "More evidence common morning sickness drug may not work", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}, {"name": "persaud", "sentiment": "none"}, {"name": "nav persaud", "sentiment": "none"}], "locations": [{"name": "health canada", "sentiment": "none"}, {"name": "diclectin", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "st. michael’s hospital", "sentiment": "none"}, {"name": "u.s. food and drug administration", "sentiment": "none"}, {"name": "university of toronto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 7:33 PM / Updated an hour ago More evidence common morning sickness drug may not work Lisa Rapaport 5 Min Read \n(Reuters Health) - - A pill millions of women have used for morning sickness may not actually help relieve nausea, according to a new study that some doctors say reinforces their decision to stop prescribing the drug. \nThe U.S. Food and Drug Administration (FDA) approved the drug, pyridoxine-doxylamine (Diclegis, Diclectin), based on results from a clinical trial. But previously unpublished data from the trial show the drug worked no better than a placebo at reducing nausea and vomiting in pregnant women, researchers report in PLOS One. \n“I have stopped prescribing this medication,” said lead study author Dr. Nav Persaud, a researcher and family physician at St. Michael’s Hospital and the University of Toronto. \n“Based on all the information available, I don’t think that it works,” Persaud said by email. \nFor the current study, researchers analyzed findings from a 9,000-page clinical trial report from Health Canada that provided more information about the medicine than results from the trial that were published in 2010. \nThe 2010 report included 101 women who took the drug for two weeks and 86 women who took a placebo, or dummy pill. \nWhile these results suggested that the drug worked better than a placebo, the current analysis found that this difference was too small to be clinically meaningful for patients. \nThat’s because women rated nausea symptoms on a 13-point scale and achieved only a 0.7-point greater reduction with the drug than with a placebo. Unpublished records from the trial indicate that the drug needed to achieve at least a 3-point greater reduction in nausea and vomiting to be considered better than a placebo. \nHealth Canada and the FDA should revoke marketing approval for the medicine, and until this happens doctors shouldn’t prescribe it, Persaud and colleagues argue. \n“It is surprising that the FDA and those who determine clinical practice guidelines would make recommendations based on a single clinical trial that lacks a robust conclusion of efficacy,” said Dr. Marlena Fejzo, an obstetrician and gynecologist at the University of Southern California and the University of California, Los Angeles, who wasn’t involved in the study. \n“Most patients do not take the decision of using a medication in pregnancy lightly, and deserve to know that their provider is basing their recommendations on a single study that had opposing interpretations with respect to medication effectiveness,” Fejzo said by email. \nThe drug was developed in the 1970s, and an older version of the medicine was in use as far back as the 1950s. Early in 2017, Persaud coauthored a re-analysis of a clinical trial from the 1970s; like the current study, last year’s re-analysis found missing data and called into question the effectiveness of the medication. \nMany doctors still consider the drug among their best options for treating morning sickness and continue to prescribe it for women. \nIn December, in a practice bulletin published in Obstetrics & Gynecology, the American College of Obstetricians and Gynecologists (ACOG) reaffirmed its recommendation that doctors prescribe Diclegis first before considering alternative medications to ease nausea. \nACOG is aware of the current study and still considers Diclegis to be safe and effective for morning sickness, said Dr. Mark Turrentine, chair of ACOG’s committee that drafted the nausea treatment recommendations. \n“If the U.S. Food and Drug Administration, the authors of the original studies, or the drug manufacturer, correct or retract any of the evidence used to develop ACOG’s guidance, we will reassess,” Turrentine said by email. \nUp to four in five pregnant women experience nausea, and half of them endure vomiting and retching, ACOG notes in its practice guidelines. The condition often peaks early in pregnancy, and can ease without treatment, but in severe cases women can become dehydrated and malnourished and require hospitalization. \nWomen may relieve symptoms by taking ginger capsules, wearing acupressure wrist bands, or swapping their prenatal vitamins for a supplement that contains only folic acid, ACOG advises. \nOther drugs that ACOG recommends for morning sickness include: dimenhydrinate (Dramamine, Gravol), diphenhydramine (Benadryl), prochlorperazine (Compro), and promethazine (Phenergan). Pregnant women are generally advised to check with their doctor before taking any medication, however – especially in the first trimester. \nSOURCES: bit.ly/2DIxnks PLOS One, online January 17, 2018, and bit.ly/2DJv94f Obstetrics & Gynecology, online December 21, 2017.", "external_links": [], "published": "2018-01-17T21:31:00.000+02:00", "crawled": "2018-01-17T21:54:27.000+02:00", "highlightTitle": ""}