{"organizations": [], "uuid": "1485cb7f3cc45cfd6d08d5394be9fb28d4d38e94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/01/104874844-AP_17334011591445.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/13/hawaii-cell-phone-users-hit-with-false-alarm-of-a-ballistic-missile-heading-toward-the-island.html", "country": "US", "domain_rank": 767, "title": "Hawaii cell phone users hit with false alarm of a ballistic missile heading toward the island", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T20:47:00.000+02:00", "replies_count": 0, "uuid": "1485cb7f3cc45cfd6d08d5394be9fb28d4d38e94"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/13/hawaii-cell-phone-users-hit-with-false-alarm-of-a-ballistic-missile-heading-toward-the-island.html", "ord_in_thread": 0, "title": "Hawaii cell phone users hit with false alarm of a ballistic missile heading toward the island", "locations": [], "entities": {"persons": [{"name": "david benham", "sentiment": "none"}, {"name": "tulsi gabbard", "sentiment": "none"}, {"name": "gabbard", "sentiment": "none"}], "locations": [{"name": "hawaii", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "u.s. pacific command", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. Air Force | Reuters An unarmed Minuteman III intercontinental ballistic missile launches during an operational test at 2:10 a.m. Hawaiians were sent into a panic on Saturday after a false alert claimed that a ballistic missile was heading for the islands.\nThe alert was sent out due to human error, Hawaii Gov. David Ige told CNN.\n\"It was a mistake made during a standard procedure at the change over of a shift and an employee pushed the wrong button,\" Gov. Ige said. \"The warning went out to cell phones, television and radio got the emergency alert.\"\nAround 1 p.m. ET, social media lit up with Hawaiian residents and visitors who received cellphone alerts warning that a projectile was heading for the island. The message, which was transmitted by the Civil Defense department, was accompanied by an ominous warning that the alarm was \"not a drill.\"\nTweet\nThe erroneous alert sent recipients into a state of frenzy, with scores reportedly running for shelter and taking cover, until Democratic Rep. Tulsi Gabbard debunked the alert as a false alarm. Hawaiian officials, as well as the U.S. Pacific Command, followed suit but not until nearly 40 minutes later.\nGabbard\n\"State Warning Point has issued a Missile Alert in ERROR! There is NO threat to the State of Hawaii,\" U.S. Pacific Command's David Benham said in a statement.\nMichael Kucharek, spokesman for the North American Aerospace Defense Command in Colorado Springs, Colorado, said NORAD and the U.S. Northern Command are still trying to verify what happened in Hawaii — but that \"NORAD did not see anything that indicated any sort of threat\" to the island.\n\"From a NORAD perspective and that of the U.S. Northern Command, we are still trying to verify what happened,\" he said of the false alert.\nNORAD is a U.S.-Canada joint command that conducts aerospace warning, aerospace control and maritime warning to defend North America. The U.S. Northern Command, also based in Colorado Springs, Colorado, is tasked with air, land and sea defense of the continental United States, Alaska, Canada, Mexico and portions of the Caribbean.\nPresident Donald Trump was said to be at Trump International Golf Course in Florida when the false alert was sent out, but was briefed after the alert sent Hawaiians scrambling for cover.\n\"The President has been briefed on the state of Hawaii's emergency management exercise. This was purely a state exercise,\" White House spokeswoman Lindsay Walters said.\nThe U.S. Federal Communications Commission confirmed to NBC News that it's launching an investigation into the false emergency alert.\n'Everyone regarded this as a serious threat' The panic ensued as tensions between the U.S. and North Korea have been heightened — a fact that was not lost on Hawaiians and visitors who were sent scrambling as the mistaken alert hit cellphones.\nJodi Luchs, an ophthalmologist from Merrick, N.Y. visiting Hawaii for a conference, told CNBC that he was settling in for breakfast on an otherwise perfect day, when hundreds of diners received the false alarm simultaneously.\n\"On the face of it, it was extremely concerning ... everyone got up in a rather orderly fashion and started filing toward the interior areas of the hotel\" because the venue had no basement, Luchs told CNBC. About half an hour passed before the hotel's guests got an all-clear, he said, adding that some people were legitimately scared and in tears until they realized the alarm was false.\n\"Most people were obviously very relieved about everything, and the concern was real given that the wording of the message did not leave much to the imagination,\" Luchs told CNBC. \"With tensions with North Korea, everyone regarded this as a serious threat.\"\nTweet\nNorth Korea has tested a volley of ballistic missiles over the last few years, and has repeatedly threatened the U.S. with nuclear conflict. Amid the threat, Hawaii last month tested a nuclear siren warning for the first time since the Cold War.\n\"This is a false alarm but this is also how [ accidental] wars start,\" Jon Wolfsthal, a scholar at the Carnegie Endowment for International Peace and a nuclear nonproliferation expert, posted on Twitter. He called for \"military to military\" talks between the U.S. and North Korea to begin \"as soon as possible.\"\n--Reuters and The Associated Press contributed to this article.", "external_links": [], "published": "2018-01-13T20:47:00.000+02:00", "crawled": "2018-01-13T21:02:00.025+02:00", "highlightTitle": ""}