{"organizations": [], "uuid": "9381ff266cc6605516fde7271d1a5bb585fe17a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-hedgefunds-massachusetts-fraud/massachusetts-hedge-fund-manager-pleads-guilty-to-fraud-idUSKBN1EY2OC", "country": "US", "domain_rank": 408, "title": "Massachusetts hedge fund manager pleads guilty to fraud", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T23:54:00.000+02:00", "replies_count": 0, "uuid": "9381ff266cc6605516fde7271d1a5bb585fe17a0"}, "author": "", "url": "https://www.reuters.com/article/us-hedgefunds-massachusetts-fraud/massachusetts-hedge-fund-manager-pleads-guilty-to-fraud-idUSKBN1EY2OC", "ord_in_thread": 0, "title": "Massachusetts hedge fund manager pleads guilty to fraud", "locations": [], "entities": {"persons": [{"name": "nate raymond", "sentiment": "none"}, {"name": "yasuna murakami", "sentiment": "none"}, {"name": "murakami", "sentiment": "none"}], "locations": [{"name": "massachusetts", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "mc2 capital management llc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 10:09 PM / Updated a day ago Massachusetts hedge fund manager pleads guilty to fraud Nate Raymond 3 Min Read \nBOSTON (Reuters) - A Massachusetts hedge fund manager pleaded guilty on Tuesday after prosecutors accused him of misusing millions of dollars from investors to pay for lavish personal expenses like a sports car and to engage in a Ponzi-like scheme. \nYasuna Murakami, who managed Cambridge, Massachusetts-based MC2 Capital Management LLC and another investment advisory firm, pleaded guilty in federal court in Boston to one count of wire fraud. \nMurakami was arrested last May. Under a plea agreement, prosecutors agreed to recommend a sentence of eight years and one month in prison. Murakami, 44, is scheduled to be sentenced on April 9. \nMurakami declined to comment outside after a court hearing. In court, he said that he was engaged in counseling for stress, anxiety and personal issues, matters that he called “somewhat related to this case.” \nAccording to securities regulators, from 2007 to 2016, Murakami and a business partner operated three hedge funds through two investment advisory businesses, MC2 Capital and MC2 Canada Capital Management LLC. \nProsecutors said Murakami schemed to defraud investors in a hedge fund he set up in 2011 that was managed by MC2 Canada and that allowed U.S. investors to gain exposure to a fund overseen by Toronto-based Donville Kent Asset Management. \nAfter soliciting money from investors for MC2 Capital Canadian Opportunities Fund, Murakami misused investments for personal expenses like international travel and high-end department stores, according to a criminal complaint. \nHe also used investor funds to make personal investments in the MC2 Canadian fund; to pay for a black Nissan GT-R sports car; and to make Ponzi-like payments to earlier investors, prosecutors said. \nIn a related lawsuit, the U.S. Securities and Exchange Commission said Murakami and his partner, Avi Chiat, defrauded more than 50 investors in their three funds after raising more than $15 million. \nThe regulator said both men misled investors about the funds’ performance. Murakami also stole more than $8 million and used another $1.3 million to make Ponzi-like payments to earlier investors by misusing funds from later ones, the SEC said. \nThe criminal case was filed after Massachusetts Secretary of the Commonwealth William Galvin brought an administrative action in January 2017 accusing Murakami of operating a Ponzi scheme. \nThe SEC’s case against Chiat remains pending. His lawyer did not respond to a request for comment. \nThe case is U.S. v. Murakami, U.S. District Court, District of Massachusetts, No. 17-cr-10346. \n(The story was refiled to fix the spelling of “Murakami” in paragraph 10) Reporting by Nate Raymond in Boston; Editing by Leslie Adler", "external_links": [], "published": "2018-01-09T23:54:00.000+02:00", "crawled": "2018-01-10T00:23:03.010+02:00", "highlightTitle": ""}