{"organizations": [], "uuid": "4124fcaca734e485c5c604b0c923a7d049558f4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/04/24/101610574-482797595.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/why-moneyball-author-michael-lewis-left-wall-street-to-start-writing.html", "country": "US", "domain_rank": 767, "title": "Why 'Moneyball' author Michael Lewis left Wall Street to start writing", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.478, "site_type": "news", "published": "2018-01-08T16:06:00.000+02:00", "replies_count": 0, "uuid": "4124fcaca734e485c5c604b0c923a7d049558f4e"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/08/why-moneyball-author-michael-lewis-left-wall-street-to-start-writing.html", "ord_in_thread": 0, "title": "Why 'Moneyball' author Michael Lewis left Wall Street to start writing", "locations": [], "entities": {"persons": [{"name": "michael lewis", "sentiment": "negative"}, {"name": "lewis", "sentiment": "none"}], "locations": [{"name": "wall street", "sentiment": "none"}], "organizations": [{"name": "salomon brothers", "sentiment": "none"}, {"name": "salomon brothers international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Before Michael Lewis wrote his best-sellers \" Moneyball ,\" \" The Big Short \" and \" Flashboys ,\" he had turned a degree in art history into a six-figure job on Wall Street.\nHis first job in finance came along serendipitously. While getting his master's in economics, he attended a dinner party where he sat next to, and charmed, \"these women whose husbands ran Salomon Brothers International,\" he writes for Money . \"I got along quite well with one of the women, and she made her husband hire me after the dinner. It was just about the best possible place to land on Wall Street at that moment.\"\nBy his late 20s, Lewis was earning a $60,000 salary, plus a bonus of $160,000. That's about when he knew he wanted to leave Salomon Brothers and pursue his dream of writing full-time.\n\"I remember when I told my dad that I wanted to quit. … My dad thought I was crazy to walk away from that kind of money,\" Lewis recalls. \"He said, 'Stay ten years and you won't have to work any longer. Then you can write your novels till you die.'\"\n\"But when I looked around at the guys who were ten years older than me, I saw that none of them could leave. If I'd stayed, I would have been trapped by that success; the money would have gotten too big, and my life would've changed.\"\nGetty Images Michael Lewis participates in a discussion at George Washington University on April 4, 2014. Lewis also notes that he didn't have any student loans or a family to provide for at the time: \"So I didn't have to let money rule my decisions. Some people don't have that liberty.\"\nHe quit at age 27. Two years later, his first book came out: \" Liar's Poker ,\" an account of his time working on Wall Street. Since then, he has become a New York Times-bestselling author, and three of his books have been turned into acclaimed, Oscar-nominated movies.\n\"Looking back, it seems like a giant risk to quit a job that paid me all kinds of money at Salomon for a fairly unknown future as a writer. But I knew I really wanted to do it,\" says Lewis. \"There wasn't a shred of doubt, and I was getting so sick of going to work there every morning. So it was not a terribly hard decision, and it didn't feel like that much of a risk.\"\nHe's not the only advocate of following your passion . \"Late Night\" host Seth Meyers encourages it, even if you don't have a back up plan .\n\"If you're going to go for it, really go for it and put yourself at risk,\" especially at the beginning of your career, Meyers said at The New Yorker Festival . \"Failure is a lot easier the younger you are. It's like gravity, and each year you get older you get farther away from the ground — so the fall is worse.\"\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: Michael Lewis endorses a strategy for getting out of anything you don't want to do \n\nshow chapters PepsiCo CEO Indra Nooyi shares tips on how to succeed at work      12:28 PM ET Wed, 1 Feb 2017 | 00:51", "external_links": [], "published": "2018-01-08T16:06:00.000+02:00", "crawled": "2018-01-08T16:07:06.000+02:00", "highlightTitle": ""}