{"organizations": [], "uuid": "c31ad9c74615c2f68121795d5f4e5e709d42b3af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-mavenir-acquires-aquto-to-help-mobile-operators-drive-data-monetization-and-customer-loyalty.html", "country": "US", "domain_rank": 767, "title": "Mavenir Acquires Aquto to Help Mobile Operators Drive Data Monetization and Customer Loyalty", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T17:00:00.000+02:00", "replies_count": 0, "uuid": "c31ad9c74615c2f68121795d5f4e5e709d42b3af"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-mavenir-acquires-aquto-to-help-mobile-operators-drive-data-monetization-and-customer-loyalty.html", "ord_in_thread": 0, "title": "Mavenir Acquires Aquto to Help Mobile Operators Drive Data Monetization and Customer Loyalty", "locations": [], "entities": {"persons": [{"name": "mavenir", "sentiment": "none"}, {"name": "aquto", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}], "organizations": [{"name": "rcs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Enabling Mobile Operators to reduce churn of Prepaid customers\nRICHARDSON, Texas--(BUSINESS WIRE)-- Mavenir , the world leader in mobile messaging and RCS, announces it has acquired Aquto , the leader in mobile sponsored data and data rewards. Aquto’s cloud-based sponsored data platform brings new capability to Mavenir’s portfolio of carrier revenue generation products by building a bridge to the mobile marketing and advertising ecosystems.\nSponsored data enables users to gain cellular data connectivity through 3 rd party sponsorships, and enterprises can use data sponsorship to reach users and increase mobile engagement.\nAquto uses data as a form of currency to improve engagement with marketers to fund sponsorship of mobile data. Aquto’s technology then enables marketers to use data sponsorship to improve mobile engagement across any type of mobile campaign (app downloads, in-app engagement, media, etc.) such as:\n1) Native Data Rewards: Enables in-app engagement for native experiences (i.e. make an in-app purchase, or take actions in an app, and receive a data reward) and drives loyalty.\n2) Mobile Media Data Rewards: Drives engagement and improves conversions with mobile advertising/media.\n3) Offline Rewards: Drives in-store engagement with Physical Data Rewards vouchers on packaged goods, soft drinks, etc.\n4) Zero Rating: Enables users to engage with a mobile app or content without getting charged for any usage allowing enterprises to drive specific user behavior, cost savings and loyalty.\n“What’s critical to the subscriber is mobile data connectivity and what’s important to carriers is monetization and loyalty,” said Pardeep Kohli. “In this marketplace, operators can monetize sponsors through the value exchange model - where mobile data is the primary currency. Enterprises can attach data rewards to a specific call to action (CTA). Users/consumers, when provided with sponsored data services, engage more with the operator and ultimately buy more data from the operator (i.e. reduced churn by 5% and increased ARPU by 15% for prepaid subscribers).”\n“Carriers worldwide trust Mavenir to deliver the best in class products and services, and we are excited to be a part of a great team that will enable us to scale our mobile marketing and advertising expertise and integrate with Mavenir’s portfolio,” said Susie Kim Riley, Founder and CEO, Aquto.\nAdded Kohli, “We believe that this can also rejuvenate the Prepaid market and help Operators reduce churn of those Prepaid customers. Mavenir will enable our 250+ Service providers customers to further monetize their messaging and data service. The Aquto platform will also be complementary to our B2C Messaging offerings which include Messaging as a Platform (MaaP), RCS Hub, and Multi-ID and will integrate into Mavenir’s in-network product evolution and hosted service plans for voice & messaging.”\nThe SaaS Platform Distribution is available either as a white-label Sponsored Data platform to enable single MNO or group of MNOs or as Global Sponsored Data Platform connected to all MNOs.\nThe Aquto team brings strong partnerships with Tier 1 carriers globally, including America Movil, AT&T , Telefonica, Verizon, as well as a portfolio of patents issued/pending on Sponsored Data and Data Rewards, and a rich set of partnerships with major agencies and brands.\nAbout Mavenir:\nMavenir is purpose-built to redefine mobile network economics for Communication Service Providers (CSPs). Our solutions pave the way to 5G with 100% software-based, end-to-end, Cloud Native network solutions. Leveraging industry-leading firsts in VoLTE, VoWiFi, Advanced Messaging (RCS), Multi-ID, vEPC and Cloud RAN, Mavenir accelerates network transformation for more than 250+ CSP customers in over 130 countries, serving over 50% of the world’s subscribers.\nWe embrace disruptive, innovative technology architectures and business models that drive service agility, flexibility, and velocity. With solutions that propel NFV evolution to achieve web-scale economics, Mavenir offers solutions to CSPs for revenue generation, cost reduction and revenue protection. Mavenir.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005447/en/\nMavenir\nMaryvonne Tubb\npr@mavenir.com\nor\nLoren Guertin\nmavenir@matternow.com\nor\nHannah Locke\nmavenir@hotwirePR.com\nSource: Mavenir", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.att.com%2Fatt%2Fdataperks%2Fen%2Findex.html&esheet=51737743&newsitemid=20180104005447&lan=en-US&anchor=AT%26T&index=3&md5=21db61c01fc75902c9778b41e30b7f4d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mavenir.com&esheet=51737743&newsitemid=20180104005447&lan=en-US&anchor=Mavenir&index=1&md5=0f10c649433e3f2a041b951acbdad63b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mavenir.com&esheet=51737743&newsitemid=20180104005447&lan=en-US&anchor=Mavenir.com&index=4&md5=57f65900ce72a92d5f22e911fed52a5b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.aquto.com&esheet=51737743&newsitemid=20180104005447&lan=en-US&anchor=Aquto&index=2&md5=9daec47e83f0eb47fc58950211d8d7c6", "http://www.businesswire.com/news/home/20180104005447/en/"], "published": "2018-01-04T17:00:00.000+02:00", "crawled": "2018-01-04T16:39:06.000+02:00", "highlightTitle": ""}