{"organizations": [], "uuid": "278eb839599ddce7bc7170e395c618a1ca3dfab6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/27/pr-newswire-shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-capitala-finance-corporation-of.html", "country": "US", "domain_rank": 767, "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with Losses on their Investment in Capitala Finance Corporation of Class Action Lawsuit and Upcoming Deadline- CPTA", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T16:00:00.000+02:00", "replies_count": 0, "uuid": "278eb839599ddce7bc7170e395c618a1ca3dfab6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/27/pr-newswire-shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-capitala-finance-corporation-of.html", "ord_in_thread": 0, "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with Losses on their Investment in Capitala Finance Corporation of Class Action Lawsuit and Upcoming Deadline- CPTA", "locations": [], "entities": {"persons": [{"name": "robert s. willoughby", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "united states district court", "sentiment": "none"}, {"name": "capitala", "sentiment": "none"}], "organizations": [{"name": "capitala finance corporation", "sentiment": "neutral"}, {"name": "pomerantz llp", "sentiment": "neutral"}, {"name": "central district of california", "sentiment": "none"}, {"name": "western division", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 27, 2018 /PRNewswire/ -- Pomerantz LLP announces that a class action lawsuit has been filed against Capitala Finance Corporation (\"Capitala\" or the \"Company\") (NASDAQ: CPTA) and certain of its officers. The class action, filed in United States District Court, for the Central District of California, Western Division, and docketed under 18-cv-00052, is on behalf of a class consisting of investors who purchased or otherwise acquired Capitala securities, seeking to recover compensable damages caused by defendants' violations of the Securities Exchange Act of 1934.\nIf you are a shareholder who purchased Capitala securities between January 4, 2016, and August 7, 2017, both dates inclusive, you have until February 26, 2018, to ask the Court to appoint you as Lead Plaintiff for the class. A copy of the Complaint can be obtained at www.pomerantzlaw.com . To discuss this action, contact Robert S. Willoughby at rswilloughby@pomlaw.com or 888.476.6529 (or 888.4-POMLAW), toll-free, Ext. 9980. Those who inquire by e-mail are encouraged to include their mailing address, telephone number, and the number of shares purchased.\n[Click here to join this class action]\nCapitala Finance Corporation is a business development company that invests primarily in first and second liens, subordinated debt and, to a lesser extent, equity securities issued by lower and traditional middle-market companies.\nCapitala Investment Advisors, LLC (\"Capitala Investment Advisors\") manages the Company's investment activities. The Company's Board of Directors supervises the Company's investment activities. The Company's executive officers are part of Capitala Investment Advisors' management team.\nUnder the Company's investment advisory agreement with Capitala Investment Advisors (the \"Investment Advisory Agreement\"), the Company pays Capitala Investment Advisors an annual base management fee based on the Company's gross assets as well as an incentive fee based on the Company's performance.\nOn January 4, 2016, the Company announced that Capitala Investment Advisors agreed to voluntarily waive its quarterly incentive fee.\nThe Complaint alleges that throughout the Class Period, Defendants made materially false and misleading statements regarding the Company's business, operational and compliance policies. Specifically, Defendants made false and/or misleading statements and/or failed to disclose that: (i) Capitala Investment Advisors had been losing professional talent in both underwriting and portfolio management due to the waiving of its incentive fee; (ii) such loss of talent negatively impacted the quality of the Company's investment portfolio; and (iii) as a result, Capitala's public statements were materially false and misleading at all relevant times.\nOn August 7, 2017, the Company revealed during aftermarket hours that six of its investments were on non-accrual status—twice as many as in the previous quarter.\nOn August 8, 2017, the Company's Chief Executive Officer Joseph B. Alala III revealed that Capitala Investment Advisors had been losing professional talent in underwriting and portfolio management since waiving its incentive fee, which resulted in a rising number of nonaccrual investments.\nOn this news, shares of the Company fell $3.82 per share, or approximately 30%, over the next three trading days to close at $8.99 per share on August 10, 2017, damaging investors.\nThe Pomerantz Firm, with offices in New York, Chicago, Los Angeles, and Paris, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, the Pomerantz Firm pioneered the field of securities class actions. Today, more than 80 years later, the Pomerantz Firm continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomerantzlaw.com\nCONTACT:\nRobert S. Willoughby\nPomerantz LLP\nrswilloughby@pomlaw.com\n888.476.6529 Ext. 9980\nView original content: http://www.prnewswire.com/news-releases/shareholder-alert--pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-capitala-finance-corporation-of-class-action-lawsuit-and-upcoming-deadline-cpta-300588944.html\nSOURCE Pomerantz LLP", "external_links": ["http://www.prnewswire.com/news-releases/shareholder-alert--pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-capitala-finance-corporation-of-class-action-lawsuit-and-upcoming-deadline-cpta-300588944.html", "http://www.pomerantzlaw.com/", "https://form.jotformpro.com/pomerantzllp2/capitala"], "published": "2018-01-27T16:00:00.000+02:00", "crawled": "2018-01-27T20:12:02.000+02:00", "highlightTitle": ""}