{"organizations": [], "uuid": "123992bb862318a82a15e2e830fa19548275f515", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 72, "shares": 72, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226151042&w=1200&r=LYNXMPEE0S02J", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-china-pollution/chinas-coal-futures-hit-record-high-as-utilities-warn-of-shortages-idUSKBN1FI03X", "country": "US", "domain_rank": 408, "title": "China's coal futures hit record high as utilities warn of shortages", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T03:17:00.000+02:00", "replies_count": 0, "uuid": "123992bb862318a82a15e2e830fa19548275f515"}, "author": "", "url": "https://www.reuters.com/article/us-china-pollution/chinas-coal-futures-hit-record-high-as-utilities-warn-of-shortages-idUSKBN1FI03X", "ord_in_thread": 0, "title": "China's coal futures hit record high as utilities warn of shortages", "locations": [], "entities": {"persons": [{"name": "josephine mason", "sentiment": "none"}, {"name": "richard pullin", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "china huaneng group", "sentiment": "none"}, {"name": "china datang corp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "state power investment corp", "sentiment": "none"}, {"name": "china huadian corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China’s worst blizzards this winter have snarled the country’s railroads and highways, cutting off critical supplies of thermal coal, and fuelling a rally in prices to record highs and raising concerns about potential heating and electricity shortages.\nThe chaos, with coal piling up at mines and ports after a week of heavy snowfall, comes two weeks before the week-long Spring Festival holiday, when hundreds of millions of people travel vast distances home to celebrate with their families.\nThe severe weather and congestion prompted four of China’s top utilities to warn last week of heating and electricity shortages due to tight supplies of coal ahead of and during the Lunar New Year holiday.\nBeijing has worked for years to wean the nation off its favourite fuel, but coal still accounts for most of the electricity generated.\nAverage daily coal demand at utilities hit a winter-time record on Sunday of 818,000 tonnes, almost double a year ago due to soaring residential heating demand as temperatures in some regions - including the two most populous cities Shanghai and Beijing - plunged to below-average levels.\nThe snowstorms are expected to ease up in southern and central provinces, which are much warmer than the north, although temperatures will remain below average until Feb. 5, spurring heating demand.\nChina Railway Corp issued orders in recent days restricting freight trains in some parts of the north from heading south to Yunnan, Guizhou, Guangxi and Guangdong, so they don’t get trapped due to bad weather, an official at the railroad’s customer service hotline said.\nIt’s not clear how long the limits will be in place, she said. Coal deliveries have been made a priority, she added, underscoring growing concern in the government as cold weather sweeps across swathes of the nation.\nThe transport congestion, which will take time to clear, will also affect grain and fertiliser shipments.\nThermal coal futures on Monday rose more than 1 percent to 679.8 yuan ($107.49) per tonne, their highest since the contract launched in 2015.\n“The price rally is being driven by blizzard weather across the country, which has blocked highways and even rail transportation in some places and boosted demand for heating,” said Xu Bo, analyst at Haitong Futures.\n“It is hard to ease tight coal supply in a short period since China is currently at its peak period for heating.”\nPrices have jumped 11 percent this year, extending a months-long rally and putting them on track for their best monthly performance since June last year.\nCOAL PILING UP Coal traders said the bottleneck caused by extreme winter weather highlighted the fragility of the country’s freight rail network, even after China’s breakneck expansion over the past decade of its passenger train capacity.\nChina’s main coal mining hubs are in the northern regions of Inner Mongolia and Shanxi.\n“Coal is piling up at mines because there is not enough rail freight. The same thing has happened at ports. They don’t have trucks and rail to get them out,” said a Beijing-based physical trader.\nInventory at the country’s three major coal ports - Qinhuangdao, Caofeidian and Jingtang - stood at 8.3 million tonnes on Monday, 10 percent higher than at this time last year.\nXu said he expected coal prices to fall eventually as they were already above levels China’s utilities could afford.\nThe utilities are under particular pressure this winter because of low natural gas supplies after Beijing ordered millions of households and some industrial plants in northern China to change to gas heating from coal as part of its war on pollution.\nEMERGENCY MEASURES Renewing worries about winter heating crisis, Jiangxi and Hunan provinces introduced power rationing to industrial users due to heavy snowfall, with snowy storms also striking parts of the provinces of Anhui, Jiangsu, Zhejiang, Hubei and Hunan.\nIn Jiangsu, the authorities posted a letter dated Jan. 26 on their website asking utilities to ensure sufficient power for heating because of bad weather and snarled transportation.\nJiangsu province has 7.46 million tonnes of coal inventory, enough for 13 days of demand, but seven utilities have less than seven days of stock, the notice warned.\nReporting by Josephine Mason and Muyu Xu; Editing by Richard Pullin, Joseph Radford and Tom Hogue\n ", "external_links": [], "published": "2018-01-29T03:17:00.000+02:00", "crawled": "2018-01-29T03:37:54.000+02:00", "highlightTitle": ""}