{"organizations": [], "uuid": "62747aacf77093f33b44ad7d3b79a62d681edc00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226298232&w=1200&r=LYNXMPEE0S0XD", "site_section": "https://www.reuters.com/news/world", "section_title": "World News | Reuters.com", "url": "https://www.reuters.com/article/us-britain-eu-transition-factbox/factbox-the-eus-brexit-transition-demands-and-what-they-mean-idUSKBN1FI1KD", "country": "US", "domain_rank": 408, "title": "Factbox: The EU's Brexit transition demands -- and what they mean", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T21:05:00.000+02:00", "replies_count": 0, "uuid": "62747aacf77093f33b44ad7d3b79a62d681edc00"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-eu-transition-factbox/factbox-the-eus-brexit-transition-demands-and-what-they-mean-idUSKBN1FI1KD", "ord_in_thread": 0, "title": "Factbox: The EU's Brexit transition demands -- and what they mean", "locations": [], "entities": {"persons": [{"name": "mic", "sentiment": "negative"}, {"name": "barnier", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - EU ministers will approve on Monday their instructions to Brexit negotiator Michel Barnier, setting the 27 states’ demands on what Britain must do to secure a transition period after leaving the European Union on March 29, 2019.\nFollowing are key points from the final draft seen by Reuters, annotated at key points:\n9. ... the provisions of the citizens’ rights part of the withdrawal agreement should apply as from the end of the transition period. The ‘specified date’ ... should consequently be defined as that of the end of the transition period.\nBRITAIN HAS GUARANTEED LIFETIME RIGHTS TO EU RESIDENTS WHO ARRIVE BEFORE BREXIT. OFFICIALS SAY THEY WILL ARGUE AGAINST THEM FOR PEOPLE ARRIVING ONLY DURING THE TRANSITION AFTER BREXIT.\n10. ... any agreement will have to be based on a balance of rights and obligations, and ensure a level playing field;\nBRITAIN CANNOT UNDERCUT EU TAX, LABOR AND OTHER STANDARDS. – preserving the integrity of the Single Market excludes participation based on a sector-by-sector approach;\nEU LAYS DOWN A MARKER AGAINST BRITISH HOPES OF ACHIEVING SPECIAL DEALS ON FUTURE TRADE FOR SECTORS LIKE FINANCIAL FIRMS.\n– a non-member of the Union, that does not live up to the same obligations as a member, cannot have the same rights and enjoy the same benefits as a member;\n– the four freedoms of the Single Market are indivisible and there can be no “cherry picking”;\nFREE IMMIGRATION FROM THE EU MUST CONTINUE IN THE TRANSITION.\n– the Union will preserve its autonomy as regards its decision-making as well as the role of the Court of Justice of the European Union ... this refers notably to the competence of the Court of Justice of the European Union.\nTHE ECJ WILL REMAIN THE ULTIMATE ARBITER DURING TRANSITION.\n11. ... any such transitional arrangements must be clearly defined and precisely limited in time. They must also be subject to effective enforcement mechanisms.\nEU STATES DO NOT WANT A NEVER-ENDING TRANSITION MUDDLE. 13. ... the Union acquis should apply to and in the United Kingdom as if it were a Member State. Any changes to the Union acquis should automatically apply to and in the United Kingdom during the transition period.\nALL EU LAWS, INCLUDING NEW ONES PASSED AFTER BREXIT, SHOULD APPLY TO BRITAIN. IT CAN CONTINUE TO OPT OUT OF SOME CHANGES TO JUSTICE AND SECURITY LAWS BUT WOULD NO LONGER BE ALLOWED TO OPT IN TO MOST MEASURES IN THIS AREA. BRITAIN MAY OBJECT TO LOSING SOME OPTIONS AND WANTS A WAY TO “RESOLVE CONCERNS” ON NEW LAWS.\n14. ... the direct effect and primacy of Union law should be preserved.\n15. ...the United Kingdom should remain bound by the obligations stemming from the agreements concluded by the Union ... while the United Kingdom should however no longer participate in any bodies set up by those agreements.\nBRITAIN WOULD HAVE TO HONOR EU TREATIES WITH OTHER STATES 16. ... require the United Kingdom’s continued participation in the Customs Union and the Single Market (with all four freedoms) during the transition. The United Kingdom should take all necessary measures to preserve the integrity of the Single Market and of the Customs Union. The United Kingdom should continue to comply with the Union trade policy. It should also [collect] Common Customs Tariff duties and [perform] all checks required under Union law at the border vis-à-vis other third countries. During the transition period, the United Kingdom may not become bound by international agreements entered into in its own capacity in the fields of competence of Union law, unless authorized to do so by the Union.\nBRITAIN ENFORCES EU CUSTOMS RULES AND PASSES DUTIES ON TO BRUSSELS. IT NEEDS EU CONSENT TO SIGN ITS OWN TRADE DEALS -- THOUGH NOTHING STOPS IT NEGOTIATING PACTS FOR THE FUTURE.\n17. ... requires existing Union regulatory, budgetary, supervisory, judiciary and enforcement instruments and structures to apply, including the competence of the Court of Justice of the European Union.\nYET ANOTHER RAMMING HOME OF ECJ SUPREMACY -- SOMETHING MANY BREXIT SUPPORTERS SEE AS A PRIME REASON FOR LEAVING THE EU\n18. ... Union institutions, bodies and agencies should conduct all supervision and control proceedings foreseen by Union law ... The United Kingdom will however no longer participate in or nominate or elect members of the Union institutions, nor participate in the decision-making or the governance of the Union bodies, offices and agencies.\nDESPITE TAKING EU RULES, BRITAIN LOSES ALL REPRESENTATION 19. ... as a general rule, the UK will not attend meetings of committees ... and other similar entities ... where member states are represented. Exceptionally on a case-by-case basis, the United Kingdom could be invited to attend without voting rights such meetings provided that:\n– the discussion concerns individual acts to be addressed to the United Kingdom or to United Kingdom natural or legal persons; or\n– the presence of the United Kingdom is necessary and in the interest of the Union, in particular for the effective implementation of the Union acquis during the transition period.\n20. The Withdrawal Agreement should define the precise conditions and the clear framework under which such exceptional attendance should be allowed.\n21. Specific consultations should also be foreseen with regard to the fixing of fishing opportunities ...\nBRITAIN TO HAVE OBSERVER STATUS IN SOME EU MEETINGS UNDER A PRECISE FRAMEWORK AND WILL HAVE A SAY IN ANNUAL FISHING QUOTAS\n22. The transition period ... should not last beyond 31 December 2020.\nTHAT 21-MONTH PERIOD COINCIDES WITH THE END OF THE EU‘S 7-YEAR BUDGET BUT STATES ARE WILLING TO EXTEND IT -- A LITTLE -- IF NEEDED TO SMOOTH THE START OF A NEW TRADE DEAL.\nReporting by Jan Strupczewski and Alastair Macdonald; Editing by Robin Pomeroy\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T21:05:00.000+02:00", "crawled": "2018-01-29T15:13:33.001+02:00", "highlightTitle": ""}