{"organizations": [], "uuid": "8317cb6a27e6dec34e299f72a86da087d65e6496", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-goldman-sachs-bdc-inc-schedules-earnings-release-and-conference-call-to-announce-fourth-quarter-and-fiscal-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Goldman Sachs BDC, Inc. Schedules Earnings Release and Conference Call to Announce Fourth Quarter and Fiscal Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T02:07:00.000+02:00", "replies_count": 0, "uuid": "8317cb6a27e6dec34e299f72a86da087d65e6496"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-goldman-sachs-bdc-inc-schedules-earnings-release-and-conference-call-to-announce-fourth-quarter-and-fiscal-year-2017-results.html", "ord_in_thread": 0, "title": "Goldman Sachs BDC, Inc. Schedules Earnings Release and Conference Call to Announce Fourth Quarter and Fiscal Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "goldman sachs bdc, inc", "sentiment": "neutral"}, {"name": "goldman sachs bdc, inc.", "sentiment": "neutral"}, {"name": "gs bdc", "sentiment": "none"}, {"name": "goldman sachs bdc", "sentiment": "none"}, {"name": "eastern time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Goldman Sachs BDC, Inc. (“GS BDC”) (NYSE:GSBD) announced today that it will report its fourth quarter and fiscal year ended December 31, 2017 financial results after the market closes on Thursday, February 22, 2018. GS BDC will also host an earnings conference call on Friday, February 23, 2018 at 9:00 am Eastern Time to discuss its financial results.\nAll interested parties are invited to participate via telephone or the audio webcast, which will be hosted on the Investor Resources section of GS BDC’s website at www.goldmansachsbdc.com .\nConference Call Information:\nDomestic: (866) 884-8289\nInternational: +1 (631) 485-4531\nConference ID: 5097383\nAll participants are asked to dial in approximately 10-15 minutes prior to the call, and reference “Goldman Sachs BDC, Inc.” when prompted.\nReplay Information:\nAn archived replay of the call will be available from approximately 12:00 pm Eastern Time on February 23 through March 23. To hear the replay, please find dial-in numbers listed below. An archived replay will also be available on our webcast link located on the Investor Resources section of our website.\nDomestic: (855) 859-2056\nInternational: +1 (404) 537-3406\nConference ID: 5097383\nPlease direct any questions regarding obtaining access to the conference call to Goldman Sachs BDC, Inc. Investor Relations, via e-mail, at gsbdc-investor-relations@gs.com .\nABOUT GOLDMAN SACHS BDC, INC.\nGoldman Sachs BDC, Inc. is a specialty finance company that has elected to be regulated as a business development company under the Investment Company Act of 1940. GS BDC was formed by The Goldman Sachs Group, Inc. (“Goldman Sachs”) to invest primarily in middle-market companies in the United States, and is externally managed by Goldman Sachs Asset Management, L.P., an SEC-registered investment adviser and a wholly-owned subsidiary of Goldman Sachs. GS BDC seeks to generate current income and, to a lesser extent, capital appreciation primarily through direct originations of secured debt, including first lien, first lien/last-out unitranche and second lien debt, and unsecured debt, including mezzanine debt, as well as through select equity investments. For more information, visit www.goldmansachsbdc.com . Information on the website is not incorporated by reference into this press release and is provided merely for convenience.\nFORWARD-LOOKING STATEMENTS\nThis press release may contain that involve substantial risks and uncertainties. You can identify these statements by the use of forward-looking terminology such as “may,” “will,” “should,” “expect,” “anticipate,” “project,” “target,” “estimate,” “intend,” “continue,” or “believe” or the negatives thereof or other variations thereon or comparable terminology. You should read statements that contain these words carefully because they discuss our plans, strategies, prospects and expectations concerning our business, operating results, financial condition and other similar matters. These statements represent the Company’s belief regarding future events that, by their nature, are uncertain and outside of the Company’s control. We believe that it is important to communicate our future expectations to our investors. There are likely to be events in the future, however, that we are not able to predict accurately or control. Any forward-looking statement made by us in this press release speaks only as of the date on which we make it. Factors or events that could cause our actual results to differ, possibly materially from our expectations, include, but are not limited to, the risks, uncertainties and other factors we identify in the sections entitled “Risk Factors” and “Cautionary Statement Regarding Forward-Looking Statements” in filings we make with the Securities and Exchange Commission, and it is not possible for us to predict or identify all of them. We undertake no obligation to update or revise publicly any , whether as a result of new information, future events or otherwise, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006608/en/\nGoldman Sachs BDC, Inc.\nInvestors:\nKatherine Schneider, 212-902-3122\nor\nMedia:\nAndrew Williams, 212-902-5400\nSource: Goldman Sachs BDC, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180123006608/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.goldmansachsbdc.com&esheet=51747897&newsitemid=20180123006608&lan=en-US&anchor=www.goldmansachsbdc.com&index=2&md5=391f5ce4a568e19e85e381c5869baa9c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.goldmansachsbdc.com&esheet=51747897&newsitemid=20180123006608&lan=en-US&anchor=www.goldmansachsbdc.com&index=1&md5=eb5750ff8ce1b6407aaca111f46cc7d7"], "published": "2018-01-24T02:07:00.000+02:00", "crawled": "2018-01-24T03:28:44.004+02:00", "highlightTitle": ""}