{"organizations": [], "uuid": "ce25e7e1adbe599a27390fc41b5ac83fb8a22bf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220225020&w=1200&r=LYNXMPEE070J2", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-stocks/weak-results-weigh-on-ftse-100-profit-warning-pummels-mothercare-idUKKBN1EX0S3", "country": "US", "domain_rank": 408, "title": "Weak results weigh on FTSE 100, profit warning pummels Mothercare", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T11:59:00.000+02:00", "replies_count": 0, "uuid": "ce25e7e1adbe599a27390fc41b5ac83fb8a22bf3"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-stocks/weak-results-weigh-on-ftse-100-profit-warning-pummels-mothercare-idUKKBN1EX0S3", "ord_in_thread": 0, "title": "Weak results weigh on FTSE 100, profit warning pummels Mothercare", "locations": [], "entities": {"persons": [{"name": "deb", "sentiment": "none"}, {"name": "mothercare helen reid", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "london stock exchange group", "sentiment": "none"}, {"name": "mothercare", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "micro focus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 10:00 AM / Updated 34 minutes ago Weak results weigh on FTSE 100, profit warning pummels Mothercare Helen Reid , Kit Rees 4 Min Read \nLONDON (Reuters) - Ripples through the retail sector dented British stocks on Monday as small-cap Mothercare sank by a third after a profit warning, while software firm Micro Focus dropped nearly 17 percent after cutting guidance. The London Stock Exchange Group offices are seen in the City of London, Britain, December 29, 2017. REUTERS/Toby Melville \nThe FTSE 100 .FTSE underperformed European benchmarks, ending the session down 0.4 percent, with tech and health care the biggest weights. Mid-caps .FTMC also fell 0.4 percent while small caps .FTSC clung on to a 0.2 percent gain despite some big single-stock falls. \nBaby goods retailer Mothercare ( MTC.L ) sank 27.5 percent to a record low after saying full-year profit would be much lower than earlier expectations as it did not see any short-term improvement to the UK market. \nMothercare’s update marked a poor start to a heavy week for UK retailers reporting on Christmas trading, after the season kicked off last week with a disappointing update from department store Debenhams ( DEB.L ). \n“Very much in the Debenhams, rather than Next, school of post-Christmas updates, the baby specialist unveiled an ugly 7.2 percent plunge in like-for-like sales with an especially ominous 6.9 percent drop in online sales,” said Spreadex market analyst Connor Campbell. \nAlso in small-caps, McBride ( MCB.L ), a provider of household goods, sank 12.4 percent after its trading update showed declining revenues and Investec cut its price target on the stock. \nUK consumer spending fell in 2017 for the first time in five years, an overnight survey from Visa found, highlighting the strain many retailers are under. \nSainsbury’s ( SBRY.L ), Tesco ( TSCO.L ), Morrisons ( MRW.L ), and M&S ( MKS.L ) are all reporting Christmas trading this week. \nConcerns around consumers, the engine of the UK economy, have been weighing on forecasts for Britain’s economic growth and keeping UK stocks from fully participating in the strong rally across European markets. \n“Happy bullish year EU (27 that is, not the other one),” was how Bank of America Merrill Lynch analysts put it. \nMicro Focus ( MCRO.L ) tumbled 16.9 percent to the bottom of the FTSE 100 after first-half results in which lower-than-expected revenue guidance overshadowed positives including a 16 percent dividend hike and future U.S. tax reform benefits. \n“Perhaps investors need more time to see that the latest monster acquisition is providing value,” said Accendo Markets analyst Michael van Dulken, referring to the company’s $8.8 billion acquisition of Hewlett Packard Enterprise’s software assets. \n“Given the mix of pluses and minuses, we expect some volatility in the share price,” said Stifel analysts. \nAdding to the downbeat mood, shares in Shire ( SHP.L ) dropped more than 5 percent after the pharma firm cut its 2020 outlook. \nElsewhere troubled builder Carillion ( CLLN.L ) shot more than 26 percent higher thanks to a report of a potential government bailout. Reporting by Helen Reid and Kit Rees; Editing by Catherine Evans", "external_links": [], "published": "2018-01-08T11:59:00.000+02:00", "crawled": "2018-01-08T12:14:19.003+02:00", "highlightTitle": ""}