{"organizations": [], "uuid": "f156022bc460d63f361c493d833a7befa28aa333", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/gymnastics-usa-nassar/usa-gymnastics-facing-resignation-pressure-over-abuse-scandal-idUSL2N1PK05K", "country": "US", "domain_rank": 408, "title": "USA Gymnastics facing resignation pressure over abuse scandal", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:40:00.000+02:00", "replies_count": 0, "uuid": "f156022bc460d63f361c493d833a7befa28aa333"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/gymnastics-usa-nassar/usa-gymnastics-facing-resignation-pressure-over-abuse-scandal-idUSL2N1PK05K", "ord_in_thread": 0, "title": "USA Gymnastics facing resignation pressure over abuse scandal", "locations": [], "entities": {"persons": [{"name": "nassar", "sentiment": "none"}, {"name": "scott blackmun", "sentiment": "none"}, {"name": "larry nassar", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "usa gymnastics", "sentiment": "negative"}, {"name": "u.s. olympic committee", "sentiment": "none"}, {"name": "usoc", "sentiment": "none"}, {"name": "michigan state university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 25 (Reuters) - The 18 listed directors of USA Gymnastics were facing calls to resign after disgraced team doctor Larry Nassar was sentenced to up to 175 years in prison for abusing young female gymnasts who were entrusted to his care.\nAfter Nassar was sentenced on Wednesday, the chief executive of the U.S. Olympic Committee called for all current USA Gymnastics directors to step down.\nPiling pressure on the directors, the president of Michigan State University, where Nassar had also worked, decided on Wednesday to resign after facing a barrage of criticism for not doing enough to halt the abuse.\n“All current USA Gymnastics directors must resign,” U.S. Olympic Committee Chief Executive Scott Blackmun said in an open letter on Wednesday.\nThe USOC decided not to decertify USA Gymnastics as a national governing body because such a move would hurt clubs and athletes who had no hand in the scandal, he said.\nUSA Gymnastics did not respond directly to the calls for mass resignations. In a statement on Wednesday, it said the sport “may be better served by moving forward with meaningful change within our organization, rather than decertification.”\nThree USAG board members resigned on Monday in the wake of the scandal, following the exit last March of the federation’s president and chief executive.\nBut former U.S. Olympic gymnasts abused by Nassar and the USOC chief executive have said a full change in leadership must be implemented.\nAs his victims wept in a Michigan courtroom on Wednesday, long-time USA Gymnastics team doctor Nassar was sentenced to up to 175 years in prison for abusing young female gymnasts who were entrusted to his care.\n“I’ve signed your death warrant,” Ingham County Circuit Court Judge Rosemarie Aquilina told Nassar, following days of accounts from about 160 of his victims.\nAfter the verdict, the president of Michigan State University, Lou Anna Simon, said she was resigning after facing a barrage of criticism for not doing enough to halt the abuse.\n“As tragedies are politicized, blame is inevitable. As president, it is only natural that I am the focus of this anger,” Simon said in her resignation letter.\nThe scandal is one of the biggest to hit the U.S. Olympic Committee. In 2003 it moved to decertify the U.S. Taekwondo Union over financial troubles and in 2008 forced U.S.A. Track & Field in 2008 to shrink what the USOC saw as a bloated leadership structure. (Additional reporting by Joseph Ax in New York and Steve Friess in Lansing, Michigan; Writing by Jon Herskovitz; Editing by Gareth Jones)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T18:40:00.000+02:00", "crawled": "2018-01-26T21:16:22.002+02:00", "highlightTitle": ""}