{"organizations": [], "uuid": "fc070e8b55f602928a53449bb36a549a82dd528f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223514066&w=1200&r=LYNXMPEE0J02U", "site_section": "http://feeds.reuters.com/reuters/environment/", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-china-pollution/china-draws-up-new-special-emission-curbs-on-industries-idUSKBN1F903W", "country": "US", "domain_rank": 408, "title": "China draws up new 'special' emission curbs on industries", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T05:10:00.000+02:00", "replies_count": 0, "uuid": "fc070e8b55f602928a53449bb36a549a82dd528f"}, "author": "", "url": "https://www.reuters.com/article/us-china-pollution/china-draws-up-new-special-emission-curbs-on-industries-idUSKBN1F903W", "ord_in_thread": 0, "title": "China draws up new 'special' emission curbs on industries", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "min read  shanghai", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "ministry of environmental protection", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 3:13 AM / Updated 13 hours ago China draws up new 'special' emission curbs on industries Reuters Staff 3 Min Read \nSHANGHAI (Reuters) - China will impose “special emissions restrictions” on enterprises in major industrial sectors in northern China later this year, as it bids to ensure its war on pollution continues once a tough winter anti-smog campaign ends in March. \nTo meet politically crucial air quality targets last year, China forced 28 cities in northern China to cut concentrations of hazardous, breathable particles known as PM2.5 by 10-25 percent from October 2017-March 2018. \nBut amid concerns that enterprises and local governments could lower their guard once short-term campaigns to meet air quality targets have been completed, China has been trying to “normalize compliance” and put firms under more permanent scrutiny and pressure. \nIn a notice published on its website late on Friday, China’s Ministry of Environmental Protection said all new industrial projects in 28 key northern Chinese cities would now have to comply with even tougher emission curbs when undergoing environmental impact assessments from March 1. \nExisting industrial boilers as well as facilities in sectors like thermal power, steel, petrochemicals, chemicals, non-ferrous metals (excluding aluminum) and cement, will be subject to tougher emission limits for sulphur dioxide, nitrogen oxides, particulate matter and volatile organic compounds beginning from Oct. 1, the notice said. \nCoking chemical plants will have longer to comply with the new restrictions, and will have to renovate by October 2019. \nThe notice said existing enterprises must take effective measures to comply with the new restrictions by the required deadline. If they fail to do so, they can be fined, ordered to restrict output or forced to shut down completely. \nAs part of the winter campaign, the 28 cities were subjected to an unprecedented central government inspection regime and have been under orders to cut industrial output, thin traffic and curb coal use in order to reduce smog build-ups. All 28 met their targets in the final quarter of 2017. \nChina has been aiming to establish a nationwide, real-time, 24-hour monitoring system that puts firms under permanent pressure to comply with environmental rules, and it has also been trying to empower police and courts to take on persistent offenders. Reporting by David Stanway", "external_links": [], "published": "2018-01-20T05:10:00.000+02:00", "crawled": "2018-01-20T05:35:45.004+02:00", "highlightTitle": ""}