{"organizations": [], "uuid": "9b77256f9e9d9dc732d0816af98ec707a66a2c70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-court-tax/update-1-u-s-supreme-court-takes-up-state-online-sales-tax-dispute-idUSL1N1P71SZ", "country": "US", "domain_rank": 408, "title": "UPDATE 1-U.S. Supreme Court takes up state online sales tax dispute", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T22:05:00.000+02:00", "replies_count": 0, "uuid": "9b77256f9e9d9dc732d0816af98ec707a66a2c70"}, "author": "", "url": "https://www.reuters.com/article/usa-court-tax/update-1-u-s-supreme-court-takes-up-state-online-sales-tax-dispute-idUSL1N1P71SZ", "ord_in_thread": 0, "title": "UPDATE 1-U.S. Supreme Court takes up state online sales tax dispute", "locations": [], "entities": {"persons": [{"name": "lawrence hurley", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "south dakota", "sentiment": "none"}], "organizations": [{"name": "supreme court", "sentiment": "negative"}, {"name": "update 1-u.s. supreme court", "sentiment": "negative"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "overstock.com inc", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "newegg inc", "sentiment": "none"}, {"name": "wayfair inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 8:06 PM / Updated 9 minutes ago UPDATE 1-U.S. Supreme Court takes up state online sales tax dispute Reuters Staff \n(Adds details, background on case, paragraphs 3-11) \nBy Lawrence Hurley \nWASHINGTON, Jan 12 (Reuters) - The U.S. Supreme Court on Friday agreed to decide whether to expand the ability of states to require online retailers to collect sales tax, taking up South Dakota’s dispute with three e-commerce companies. \nSouth Dakota, appealing a lower court decision that favored Wayfair Inc, Overstock.com Inc and Newegg Inc, is asking the justices to overturn a 1992 Supreme Court ruling that companies with no physical presence in a state are not required to collect a state sales tax on purchases. \nSome online retailers, including leading player Amazon.com Inc, already collect state sales tax but others do not. \nSouth Dakota has no state income tax and relies heavily on sales taxes to fill state coffers. The state enacted a law requiring out-of-state retailers to collect sales tax in 2016, knowing that the move would provoke a legal battle. \nThe state law was passed partly in response to a concurring opinion written by Justice Anthony Kennedy in a unanimous 2015 Supreme Court ruling that allowed a challenge to a Colorado law encouraging retailers to collect the taxes to go forward. \nKennedy questioned the 1992 precedent, set in a case called Quill Corp v. North Dakota, and said the high court should reconsider it due to the explosive growth of online sales. \n“Given these changes in technology and consumer sophistication, it is unwise to delay any longer a reconsideration of the court’s holding in Quill,” Kennedy wrote. \nSouth Dakota began the legal fight by filing suit against four retailers soon after the law was enacted: Wayfair, Overstock.com, Newegg Inc and Systemax Inc. Systemax agreed to collect the tax, while the other companies contested the state law. \nIn a September 2017 ruling, the South Dakota Supreme Court, citing the 1992 precedent, ruled against the state. \nThe National Retail Federation and 35 states urged the high court to take up South Dakota’s appeal. In its brief, the retail group said that software is now widely available that makes it easy for retailers to collect sales tax. \nOnline marketplace eBay Inc, which exclusively sells products via third-party vendors, allows for sales tax to be calculated based on the address of the purchaser, for example. \nThe court is likely to decide the case by the end of June, when its current term ends. Reporting by Lawrence Hurley; Editing by Will Dunham", "external_links": [], "published": "2018-01-12T22:05:00.000+02:00", "crawled": "2018-01-12T22:23:24.000+02:00", "highlightTitle": ""}