{"organizations": [], "uuid": "3488512ce438fed710058f39adb19946d06078d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970944-GettyImages-129166800.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/patrick-meehan-others-wont-run-in-2018-midterms-because-of-sexual-misconduct.html", "country": "US", "domain_rank": 767, "title": "Patrick Meehan, others won't run in 2018 midterms because of sexual misconduct", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.235, "site_type": "news", "published": "2018-01-26T22:46:00.000+02:00", "replies_count": 0, "uuid": "3488512ce438fed710058f39adb19946d06078d4"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/26/patrick-meehan-others-wont-run-in-2018-midterms-because-of-sexual-misconduct.html", "ord_in_thread": 0, "title": "Patrick Meehan, others won't run in 2018 midterms because of sexual misconduct", "locations": [], "entities": {"persons": [{"name": "patrick meehan", "sentiment": "negative"}, {"name": "meehan", "sentiment": "none"}], "locations": [], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "mins ago cnbc.com  when", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Updated 7 Mins Ago CNBC.com \nWhen Rep. Patrick Meehan declined to seek re-election this week , he became only the latest in a string of lawmakers to decide not to run following sexual misconduct accusations. \nThe resignations and retirements come amid a national reckoning over workplace harassment and have sparked efforts to overhaul the secretive harassment reporting and settlement process in Congress . A bipartisan bill proposed this month would require lawmakers to personally pay harassment settlements rather than using taxpayer funds, as Meehan reportedly did . \nThe wave of harassment claims could also have an effect on which party controls the House after November's midterm elections. Parties generally have an easier time holding seats with an incumbent running, and the departures have put one or more competitive House elections up for grabs. \nThe revelation about the Republican Meehan and his decision not to run again suddenly make his southeastern Pennsylvania district more competitive. Even when disgraced or unpopular lawmakers leave office, negative public perception can sometimes track new candidates from their parties. \nRepublicans hold a 238 to 193 seat majority in the House, with four current vacancies. \nHere are the lawmakers who chose to leave Congress after harassment allegations, and the state of the races for their seats: Rep. Patrick Meehan, R-Pa. Mitchell Layton | NHLI | Getty Images \nMeehan settled a harassment claim with taxpayer funds last year, The New York Times first reported Saturday. The lawmaker reportedly expressed romantic interest in an aide and \"grew hostile\" when she did not reciprocate. \nReports emerged Thursday that Meehan, 62, would not run again. In letter to his campaign manager reported by The Philadelphia Inquirer , Meehan wrote about the need to \"own it because it is my own conduct that fueled the matter.\" \nMeehan's 7th District in Pennsylvania will likely become a more serious target for Democrats. Democrat Hillary Clinton narrowly beat Republican President Donald Trump there in the 2016 presidential election. \nAfter the settlement revelation but before Meehan decided not to run, the Cook Political Report rated the race as a \"toss up.\" Meehan won re-election in 2016 with nearly 60 percent of the vote. \nAt least five Democrats and a Republican will vie for his seat. The parties' nominees will be decided in the May primaries. Rep. Ruben Kihuen, D-Nev. \nRep. Ruben Kihuen, a freshman Democratic congressman from Nevada, said in December that he will seek re-election after an aide on his 2016 campaign and a lobbyist accused him of harassment. Kihuen, who denies the claims, said the accusations would be a distraction during a campaign. \nThe House Ethics Committee had opened an investigation into the 37-year-old's conduct. \nKihuen's 4th District could be competitive this year. He won the seat by about 4 percentage points in 2016. \nThe district leans Democratic as of now, according to Cook's ratings. June primary elections will determine the candidates for November's contest. Rep. Blake Farenthold, R-Texas \nAlso in December, Rep. Blake Farenthold, R-Texas, said he would not seek re-election after reports of a taxpayer funded sexual discrimination settlement and a toxic office environment. While Farenthold denied specific allegations that he talked about having \"sexual fantasies\" about a former aide, he acknowledged issues in his office. \n\"I allowed a workplace culture to take root in my office that was too permissive and decidedly unprofessional,\" the 56-year-old said in a video at the time of his announcement. \nHis seat appears to have little chance of going to the Democrats. Farenthold won his 2016 re-election bid with nearly 62 percent of the vote. \nCook rates his 27th District as \"solid\" Republican. Multiple GOP candidates will push to replace Farenthold. Rep. Trent Franks, R-Ariz. Aaron P. Bernstein | Reuters Rep. Trent Franks (R-AZ) testifying before a House Judiciary Committee hearing in Washington, DC \nRep. Trent Franks, R-Ariz., announced his resignation in December after he acknowledged that he discussed with two female staffers his desire to find a surrogate mother . The House Ethics Committee was investigating the 60-year-old's conduct. \nFranks' 8th District appears safe for Republicans. \nFranks won re-election in 2016 with nearly 70 percent of the vote. Trump carried the district by more than 20 points, according to NBC News. Cook rates the seat as solid Republican. \nA special primary election will take place in February, while Franks' successor in Congress will be chosen by an April special election. Rep. John Conyers, D-Mich. \nConyers, who had been the longest-serving House member, announced his immediate retirement in December as he faced a House Ethics Committee investigation over harassment claims by former staffers. Conyers, 88, denied the allegations and cited his health in his decision to step down. \nNo special election will be held to replace him, so the next member of Congress from Conyers' 13th District will not take office until next January. \nDemocrats likely have little fear of losing the seat. Conyers won about 77 percent of the vote in the district in 2016. \nCook rates the district as \"solid\" Democrat. Others not running \nTwo other House members said they either would resign or not run for re-election this year after scandals in their personal lives. \nRep. Tim Murphy, R-Pa., announced his resignation in October after reports that the pro-life lawmaker asked his mistress to get an abortion. In March, Republican Rick Saccone and Democrat Conor Lamb will vie for the 18th District seat in a special election. \nThat race appears to favor Republicans. While little polling on the race has surfaced so far, it leans Republican, according to Cook. Murphy won it uncontested in 2016. \nIn November, Rep. Joe Barton, R-Texas, announced that he would not run for re-election. A nude photo of the lawmaker and lewd message he had written surfaced on the internet. Barton expressed regret for the incident, and said a woman with whom he had a consensual relationship had threatened to share photos of him. \nHis 6th District appears safe for Republicans. \nIn the Senate, Minnesota Democrat Al Franken resigned at the start of the year amid accusations of sexual misconduct before he was in Congress. While Franken either denied the incidents or said he remembered them differently, he admitted that he could no longer serve effectively. \nSen. Tina Smith, D-Minn., replaced Franken after getting appointed by Minnesota Gov. Mark Dayton. She will have to face an election this year. \nCook rates the race as a toss up. Clinton narrowly won Minnesota in 2016.", "external_links": [], "published": "2018-01-26T22:46:00.000+02:00", "crawled": "2018-01-26T22:54:54.022+02:00", "highlightTitle": ""}