{"organizations": [], "uuid": "ce75a9bd920efc314a1e6e9fe06b02bbc7e33890", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/britain-bbc/bbc-women-denounce-unequal-pay-as-heat-rises-for-broadcaster-idUSL8N1PO58F", "country": "US", "domain_rank": 408, "title": "BBC women denounce unequal pay as heat rises for broadcaster", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T08:02:00.000+02:00", "replies_count": 0, "uuid": "ce75a9bd920efc314a1e6e9fe06b02bbc7e33890"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/britain-bbc/bbc-women-denounce-unequal-pay-as-heat-rises-for-broadcaster-idUSL8N1PO58F", "ord_in_thread": 0, "title": "BBC women denounce unequal pay as heat rises for broadcaster", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "nuj", "sentiment": "none"}, {"name": "national union of journalists", "sentiment": "none"}, {"name": "bbc women", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 30 (Reuters) - Women working for the BBC have complained they were paid less than men in equivalent jobs and have accused managers of misleading them about their pay to hide widespread gender discrimination at the public broadcaster.\nThe complaints by BBC Women, a group of 170 staff, were sent to parliament’s media committee, which is investigating BBC pay after the corporation was forced to disclose last July that two- thirds of on-air high earners were men and that some were paid far more than female peers.\nThe revelations caused a spate of bad headlines for the BBC and angered many female staff, who demanded equal pay for equal work. The National Union of Journalists (NUJ) has lodged a collective grievance to the BBC on behalf of 121 women.\n“While individual BBC managers have been supportive, there is still a bunker mentality in some quarters and women have experienced veiled threats made against them when they raised the subject of equal pay,” BBC Women said in written evidence to parliament’s media committee.\nThe lawmakers are due to hear oral evidence on Wednesday from Carrie Gracie, the BBC’s former China editor, who quit this month in protest over being paid less than her male peers .\nSenior BBC managers, including Director-General Tony Hall, are due to appear before the committee just after Gracie .\nFunded by a licence fee levied on TV viewers and reaching 95 percent of British adults every week, the BBC is a pillar of the nation’s life, but as such it is closely scrutinised and held to exacting standards by the public and by rival media.\nThe BBC said in response to the evidence submitted by BBC Women and the NUJ that it was committed to equal pay and did not accept the assertion that it had not been complying with equality laws.\nIn the wake of Gracie’s resignation and the public debate it sparked, six of the BBC’s best-known male presenters and journalists agreed to take pay cuts. That was widely welcomed, but campaigners for equal pay said it did not solve the underlying issues.\nBBC Women said gender pay discrimination affected every part of the organisation, not just high earners.\nThe group provided 14 individual examples of women in a range of roles as TV and radio presenters and reporters, all of whom described frustrating battles with managers after discovering they were paid less than their male counterparts.\n“I have co-presented with a male colleague for many years ... I estimate he’s paid around double what I earn for doing the same job,” said one of the unnamed women in a typical submission. “I raised the equal pay issue many times over the years, but nothing was done.” (Reporting by Estelle Shirbon, editing by Larry King)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T08:02:00.000+02:00", "crawled": "2018-01-30T18:43:41.005+02:00", "highlightTitle": ""}