{"organizations": [], "uuid": "89100ae7c5e28ea0996bb76bb846b43493d24015", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220797308&w=1200&r=LYNXMPEE090KY", "site_section": "http://feeds.reuters.com/reuters/politicsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-trump-russia-elections/democrats-target-russia-trump-in-report-on-election-interference-idUSKBN1EZ13P", "country": "US", "domain_rank": 408, "title": "Democrats target Russia, Trump in report on election interference", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T13:06:00.000+02:00", "replies_count": 0, "uuid": "89100ae7c5e28ea0996bb76bb846b43493d24015"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-russia-elections/democrats-target-russia-trump-in-report-on-election-interference-idUSKBN1EZ13P", "ord_in_thread": 0, "title": "Democrats target Russia, Trump in report on election interference", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "patricia zengerle", "sentiment": "none"}, {"name": "ben cardin", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "senate foreign relations committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Democratic U.S. lawmakers accused Russia on Wednesday of a “relentless assault” on democratic institutions worldwide, and called on President Donald Trump to treat election interference as a national crisis.\nDemocrats on the Senate Foreign Relations Committee released a report detailing what they described as nearly two decades of Russian efforts to tilt politics across Europe, and criticizing Trump for doing too little to address the issue.\nBut Republicans, who control the committee, said they planned no immediate action as the panel has held hearings and briefings on Russia, and helped pass sanctions aimed at Moscow over alleged interference in the 2016 presidential election.\nU.S. intelligence agencies concluded Russians tried to tip the election to Trump through hacking and releasing emails to embarrass Democratic nominee Hillary Clinton and spreading social media propaganda.\nOther Western nations, including France, have accused Russia of trying to interfere in their elections.\nSenator Ben Cardin, the committee’s top Democrat, commissioned the report after Trump’s surprise election victory.\nMoscow has denied interfering in the U.S. election. Trump dismisses such assertions as sour grapes about his victory.\nThe report’s release comes amid deepening rifts between Republicans, who control Congress, and Democrats over investigations of Russia and the election. Some Republican lawmakers have been casting doubt on the congressional probes, and one led by Special Counsel Robert Mueller.\nDemocrats have been pushing Trump and other Republicans to do more, accusing them of risking the integrity of this November’s U.S. mid-term elections by doing too little to address the issue.\n“Mr. (Russian President Vladimir) Putin will push as far as he’s allowed to push, if we don’t push back,” Cardin said in a speech introducing the report at the German Marshall Fund. Earlier, he called on Trump to “clear-eyed about the Russian threat.”\nRepublicans reject such criticism, pointing to the ongoing investigations in the Senate and House of Representatives.\nThe 200-page document details tools the Senate investigators said Russia used to influence elections in Europe and makes more than 30 recommendations for how to prevent further interference in elections in Europe, the United States and elsewhere.\nIt calls on the U.S. government to set up an agency to coordinate the response to Russian election interference and establishing new sanctions to punish those responsible.\n‘CYBERCRIMINALS’\nThe investigators accused Moscow of spreading malicious disinformation, threatening countries’ energy security and using “cybercriminals” to steal information.\nRecommendations included working to build democratic institutions in countries vulnerable to election interference, and setting up an organization similar to the National Counterterrorism Center to coordinate U.S. reaction to any meddling.\nMicah Johnson, a spokeswoman for Senator Bob Corker, the Republican foreign relations committee chairman said there were no plans now for the committee to respond as it has conducted oversight related to Russia, including passing new sanctions.\n“While we will review the report in its entirety, including the recommendations, no further full committee action is planned at this time,” she said.\nReporting by Patricia Zengerle; Editing by Grant McCool and Alistair Bell\n ", "external_links": [], "published": "2018-01-10T13:06:00.000+02:00", "crawled": "2018-01-10T13:28:53.000+02:00", "highlightTitle": ""}