{"organizations": [], "uuid": "b1e0f907b9259333a16bc971cf3a392f34f93df0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218537758&w=1200&r=LYNXMPEE000N9", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-cambodia-politics/detained-cambodian-opposition-leader-calls-for-free-and-fair-vote-idUKKBN1EQ0QI", "country": "US", "domain_rank": 408, "title": "Detained Cambodian opposition leader calls for free and fair vote", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T07:24:00.000+02:00", "replies_count": 0, "uuid": "b1e0f907b9259333a16bc971cf3a392f34f93df0"}, "author": "", "url": "https://uk.reuters.com/article/uk-cambodia-politics/detained-cambodian-opposition-leader-calls-for-free-and-fair-vote-idUKKBN1EQ0QI", "ord_in_thread": 0, "title": "Detained Cambodian opposition leader calls for free and fair vote", "locations": [], "entities": {"persons": [{"name": "kem sokha", "sentiment": "none"}, {"name": "reuters/samrang pring  kem sokha", "sentiment": "none"}, {"name": "hun sen", "sentiment": "none"}, {"name": "kem monovithya", "sentiment": "none"}], "locations": [{"name": "cambodia", "sentiment": "none"}, {"name": "phnom penh", "sentiment": "none"}], "organizations": [{"name": "min read  phnom penh", "sentiment": "none"}, {"name": "cambodia national rescue party", "sentiment": "none"}, {"name": "appeal court", "sentiment": "none"}, {"name": "cnrp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "prak chan thul", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 5:27 AM / Updated 9 hours ago Detained Cambodian opposition leader calls for free and fair vote Prak Chan Thul 2 Min Read \nPHNOM PENH (Reuters) - Cambodia’s detained opposition leader Kem Sokha called for free and fair elections in the Southeast Asian country in a New Year’s message on Monday. Supporters of Kem Sokha, leader of the Cambodia National Rescue Party (CNRP), stand outside the Appeal Court during a bail hearing for the jailed opposition leader in Phnom Penh, Cambodia September 26, 2017. REUTERS/Samrang Pring \nKem Sokha, head of the banned opposition Cambodia National Rescue Party (CNRP), was arrested in September. \nHe is accused of trying to overthrow the government of strongman Prime Minister Hun Sen with American help and of espionage - charges he denies and says are politically motivated. \nIn a two-page letter read by his daughter Kem Monovithya and posted on Facebook on Monday, Kem Sokha said Cambodia faces losing aid and its export markets abroad as well as condemnation by the international community after the CNRP’s dissolution. \n“Leave an opportunity for people to choose leadership representatives through an election that is free and fair,” Kem Sokha said, calling for national unity and non-violence to solve the political crisis. \nHis message comes amid an ongoing crackdown by Cambodia’s government on critics, civil society groups and independent media that rights group say amounts to the destruction of democracy. \nKem Sokha’s CNRP was dissolved by the Supreme Court in November at the request of the government. The decision also banned more than 100 opposition lawmakers from politics. \nThat prompted the European Union and the United States to withdraw their support of the 2018 election. \nCambodia will hold a general election on July 29. Hun Sen has vowed to extend his more than 30 years in power by at least another decade. \nKem Sokha said 2017 was marked by big political crises that led to a “democracy walked backward.” \nA spokesman from Hun Sen’s ruling party, Sok Eysan said there was little interest in Kem Sokha’s new year message, adding that opposition politicians could create a new party. \n“They have the political rights as citizens ... to create a new party to compete,” Sok Eysan told Reuters. Reporting by Prak Chan Thul; Editing by Amy Sawitta Lefevre and Kim Coghill", "external_links": [], "published": "2018-01-01T07:24:00.000+02:00", "crawled": "2018-01-01T08:11:37.001+02:00", "highlightTitle": ""}