{"organizations": [], "uuid": "d4fa499b561b727fb63e4badf5b079ee4d24869e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222271168&w=1200&r=LYNXMPEE0F00A", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-safrica-politics-mckinsey/south-african-court-authorizes-freezing-of-130-million-in-mckinsey-case-source-idUSKBN1F500F", "country": "US", "domain_rank": 408, "title": "South African court authorizes freezing of $130 million in McKinsey case: source", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T08:10:00.000+02:00", "replies_count": 0, "uuid": "d4fa499b561b727fb63e4badf5b079ee4d24869e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-safrica-politics-mckinsey/south-african-court-authorizes-freezing-of-130-million-in-mckinsey-case-source-idUSKBN1F500F", "ord_in_thread": 0, "title": "South African court authorizes freezing of $130 million in McKinsey case: source", "locations": [], "entities": {"persons": [{"name": "gupta", "sentiment": "none"}, {"name": "trillian", "sentiment": "none"}, {"name": "zuma", "sentiment": "none"}, {"name": "jacob zuma", "sentiment": "none"}], "locations": [{"name": "johannesburg", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "mckinsey", "sentiment": "negative"}, {"name": "national prosecuting authority", "sentiment": "none"}, {"name": "pretoria high court", "sentiment": "none"}, {"name": "eskom", "sentiment": "none"}, {"name": "npa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG (Reuters) - A South African court has authorized the freezing of 1.6 billion rand ($130 million) in assets earned by global consultancy McKinsey and a firm linked to friends of President Jacob Zuma, a source at the state prosecutors’ office told Reuters.\nThe Pretoria High Court made the decision in December after a request by the National Prosecuting Authority (NPA) to freeze the fees earned by McKinsey and local consultancy Trillian for advising South African power utility Eskom.\nPrivately-held McKinsey, one of the world’s largest management consultancies, has already lost several clients over the contract.\nThis month Zuma agreed to set up a commission of enquiry into allegations of influence peddling by the Gupta brothers, who controlled the firm McKinsey partnered with on the 1.6 billion rand contract to advise Eskom in 2016.\nSeparately, parliament is investigating whether McKinsey knowingly let funds from Eskom be diverted to Trillian as a way of securing the contract.\n“On Dec. 14, 2017, the NPA obtained a preservation order from the Pretoria High Court to preserve assets worth around 1.6 billion rand relating to Trillian and McKinsey,” said the NPA source, who declined to be identified.\n“Tomorrow parties in the case will be served with the order,” the source said. The order allows prosecutors to freeze assets pending the outcome of an investigation.\nA spokesman for McKinsey said on Monday it had not received formal communication about the preservation order.\n“As we have said before ... we will return the fee we earned from the Eskom turnaround program (R1.028bn) no matter what,” the spokesman said in an email to Reuters.\nMcKinsey will cooperate with South African authorities in their investigations into the case, he added.\nMcKinsey launched its own investigation into its handling of the partnership with Trillian and says it ceased work with the firm in March 2016 after due diligence showed links to the Gupta brothers.\nTrillian did not respond to a request for comment from Reuters on Monday. When contacted in November by Reuters, Trillian denied wrongdoing relating to the Eskom contract.\nBoth Zuma and the Guptas deny wrongdoing. Zuma’s spokesman did not reply to a Reuters request for comment.\nThe court decision is one of the first instances in which authorities have acted on allegations of wrongdoing by three Gupta brothers, Ajay, Atul and Rajesh, who South Africa’s anti-corruption watchdog accuses of siphoning off public funds.\nDeputy President Cyril Ramaphosa was elected last month to replace Zuma as leader of the ruling African National Congress, putting him in pole position to become South Africa’s next president.\nHe ran on a pledge to root out cases of corruption in government and on Saturday he said the judicial enquiry which Zuma agreed to set up should be given top priority.\nEditing by Matthew Mpoke Bigg\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T08:10:00.000+02:00", "crawled": "2018-01-16T03:15:09.006+02:00", "highlightTitle": ""}