{"organizations": [], "uuid": "f081f7a7927fbbdc9711c37772adc3cab533dec5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219319098&w=1200&r=LYNXMPEE030S2", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-figs-chen/quad-king-chen-pushes-for-artistry-ahead-of-pyeongchang-idUSKBN1ET1G4", "country": "US", "domain_rank": 408, "title": "Quad king Chen pushes for artistry ahead of Pyeongchang", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T15:17:00.000+02:00", "replies_count": 0, "uuid": "f081f7a7927fbbdc9711c37772adc3cab533dec5"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-figs-chen/quad-king-chen-pushes-for-artistry-ahead-of-pyeongchang-idUSKBN1ET1G4", "ord_in_thread": 0, "title": "Quad king Chen pushes for artistry ahead of Pyeongchang", "locations": [], "entities": {"persons": [{"name": "chen", "sentiment": "negative"}, {"name": "pyeongchang gabrielle te", "sentiment": "negative"}, {"name": "shae-lynn bourne", "sentiment": "none"}, {"name": "nathan chen", "sentiment": "none"}, {"name": "lori nichol", "sentiment": "none"}], "locations": [{"name": "pyeongchang", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "min read  moscow", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 1:19 PM / Updated 12 minutes ago Quad king Chen pushes for artistry ahead of Pyeongchang Gabrielle Tetrault-Farber 4 Min Read \nMOSCOW (Reuters) - Nathan Chen became the first figure skater to land five quadruple jumps in a single program last year, but the 18-year-old American insists he has much more to offer. \nIn his second season on the senior circuit, the 2017 U.S. national champion is hoping to prove at the Pyeongchang Olympics that he’s not all about the quad. \nChen has packed his programmers with quadruple jumps, four-revolution jumps that have become key elements in world-class men’s programmers. \nBut Chen has made special efforts to improve his presentation, turning to Canadian choreographers Shae-Lynn Bourne and Lori Nichol to develop his artistry -- footwork, expression and other elements essential to a high score. \nChen says he is trying to “imagine the program as a whole picture,” and not unnecessarily waste energy on its individual components. \n“That’s definitely what I‘m trying to prove this season,” Chen told reporters a day after winning his first senior grand prix event in Moscow in October. \n“Obviously there is still work to be done. But definitely I‘m in the right direction.” \nChen opened the season by beating defending Olympic and world champion Yuzuru Hanyu of Japan in Moscow, landing four quadruple jumps in his short program including a breathtaking combination of the quad lutz and triple toe loop. \nIn November he won the Skate America grand prix event despite one of the worst free skates of his senior career. \nHe had planned five quadruple jumps but only attempted four and put his hand on the ice on his quad flip before falling on his quad toeloop. \nChen redeemed himself at the Grand Prix Final in December, overcoming an error-filled free skate to win the title. CHINESE INFLUENCE \nThe youngest of five children, Chen was born in Salt Lake City to Chinese immigrant parents. He was not quite three years old when his hometown hosted the 2002 Winter Olympics. FILE PHOTO: Figure Ice Skating - ISU Grand Prix of Figure Skating Final - Men Award Ceremony - Nagoya, Japan - December 8, 2017. Gold medalist Nathan Chen of the U.S. greets the fans. Ê REUTERS/Issei Kato/File Photo \nChen is skating his free program to music from the movie “Mao’s Last Dancer”, based on an autobiography of former Chinese ballet dancer Li Cunxin. Li defected to the United States and became one of the world’s most acclaimed dancers. \nChen initially had reservations about Nichol’s suggested soundtrack, saying it he thought it was “a little bit too political.” \nBut the music’s melancholic strings and the plot’s parallels with the story of Chen’s parents helped dissipate his doubts. \n“I can be very emotional on the ice with that music,” he said. \n“It’s cool to be able to tell their (my parents’) story in a sense through my skating. Once all of that came together, I was definitely sold on the piece.” AMERICAN SKATING \nChen has battled the uncertainty and nerves surrounding his first Olympic season by approaching it as if it were any other year. \n“I have literally no idea what to expect,” Chen said. \n“I can’t really think too far into the future. It’s helping this Olympic season so I don’t just start freaking out about what’s in the future.” \nChen recognizes that his performance in Pyeongchang could have a profound effect on the popularity of his sport in the United States. \n“Comparatively to Japan and a lot of other countries, we are definitely lacking in fan base,” Chen said. “We are lacking in a lot of participation.” \nChen says the prospect of boosting figure skating participation back home motivates him, but also gives him more responsibility. \nBut he says he won’t let the pressure of performing and raising the status of his sport weigh him down. \n“I think that at the end of the day, it’s my life, it’s my sport, it’s my career,” Chen said. “It’s all what I decide to do that day, honestly.” Reporting by Gabrielle Tétrault-Farber; Editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-04T15:17:00.000+02:00", "crawled": "2018-01-04T15:39:35.012+02:00", "highlightTitle": ""}