{"organizations": [], "uuid": "62068802596c0929b54e3a4326c38a0450a11917", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222425174&w=1200&r=LYNXMPEE0F0VS", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-germany-politics/split-social-democrats-could-sink-merkels-coalition-plans-idUKKBN1F51KN", "country": "US", "domain_rank": 408, "title": "Split Social Democrats could sink Merkel's coalition plans", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:20:00.000+02:00", "replies_count": 0, "uuid": "62068802596c0929b54e3a4326c38a0450a11917"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-politics/split-social-democrats-could-sink-merkels-coalition-plans-idUKKBN1F51KN", "ord_in_thread": 0, "title": "Split Social Democrats could sink Merkel's coalition plans", "locations": [], "entities": {"persons": [{"name": "madeline", "sentiment": "negative"}, {"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}, {"name": "schulz", "sentiment": "none"}, {"name": "reuters/wolfgang rattay", "sentiment": "none"}], "locations": [{"name": "dortmund", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "split social democrats", "sentiment": "negative"}, {"name": "spd", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "social democratic party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 1:20 PM / Updated 10 minutes ago Split Social Democrats could sink Merkel's coalition plans Madeline Chambers , Tom Käckenhoff 5 Min Read \nBERLIN/DUESSELDORF (Reuters) - The leader of Germany’s Social Democrats (SPD) tried on Tuesday to quash a grassroots rebellion against a blueprint agreed with Angela Merkel’s conservatives to enter formal talks on a “grand coalition” which could scupper her plan for a fourth term. Martin Schulz, Germany's Social Democratic Party (SPD) leader, looks on as he meets with local SPD members in Dortmund, Germany, January 15, 2018. REUTERS/Wolfgang Rattay \nAfter five days of talks, SPD leader Martin Schulz agreed a framework deal with Merkel and Bavarian conservatives on Friday. But before he can start official negotiations he needs the backing of his party in a vote at a conference on Sunday. \nConvincing them is proving difficult. Two regional branches have already said they do not back his deal. Many rank and file members accuse Schulz of selling out to Merkel and failing to win a signature policy to take to coalition talks, such as a major healthcare reform or tax hikes for the rich. \nSchulz is touring the country to convince his party base. \nSpeaking to reporters before meeting SPD members in the western city of Duesseldorf, Schulz said the coalition blueprint had enough “political substance” to start detailed negotiations. \n“We want to put the SPD into a position ... in which it can make our country better,” Schulz said. Two dozen young SPD members protested against another grand coalition, or “Groko”, government with Merkel’s conservatives, holding up placards reading “Groko is rubbish” and “Groko never again.” \nIn a live Facebook broadcast, Schulz said the party had a duty to look at how it could improve the life of people. \n“We are living in the world of (U.S. President Donald) Trump, (Russian President Vladimir) Putin, (Turkish President Tayyip) Erdogan. We live in a world of dictators who make the world’s breath pause with their crazed ideas ... And we have the chance to make Europe a bit more social, peaceful and just.” \nIf the SPD rejects entering talks on Sunday, the prospect looms of a new election or a minority government under Merkel, both unwelcome options for stability-loving Germans. \nDefeat would also almost certainly mean the end of Schulz’s leadership of the SPD. \nUncertainty over the shape of the government in Europe’s biggest economy is worrying investors, nearly four months after an election in which the conservatives had their worst result since 1949 and the SPD their worst since World War Two. Both of the parties that have dominated Germany for generations bled support to the far right AfD, which joined parliament for the first time, becoming the third biggest bloc. \nMany in the SPD are wary of a re-run of the grand coalition which ruled under Merkel between 2013 and 2017. A junior role leaves them in her shadow, unable to win credit from voters. \nThe SPD had vowed to go into opposition after its dismal election result but was forced to reconsider in the interest of national stability after Merkel was humiliated by the collapse of three-way talks on a coalition with other parties. Martin Schulz, Germany's Social Democratic Party (SPD) leader, is seen as he grabs for a bottle of water, during a meeting with local SPD members in Dortmund, Germany, January 15, 2018. REUTERS/Wolfgang Rattay STRONG FEELING \nHighlighting the strength of feeling, regional party branches in Berlin and the state of Saxony Anhalt have already signalled their opposition to the deal. \n“A renewed grand coalition cannot be the result of talks. We reject the start of coalition negotiations with the conservatives,” said the motion by Berlin’s SPD chief Michael Mueller which was passed. \nIt said proposals on home building, rents and migration and integration were unsatisfactory, and expressed disappointment over the absence of plans to shake up the health system. FILE PHOTO - Acting German Chancellor Angela Merkel and Social Democratic Party (SPD) leader Martin Schulz attend a news conference after exploratory talks about forming a new coalition government at the SPD headquarters in Berlin, Germany, January 12, 2018. REUTERS/Hannibal Hanschke \nThe SPD’s youth wing, Jusos, opposes the deal and its head, Kevin Kuehnert, is undertaking his own “NoGroKo Tour”. \nHowever, it is difficult to predict the outcome of Sunday’s vote as the regional results are not binding. At the Bonn congress 600 delegates are free to vote how they wish. \nBoth states that have rejected the agreement so far are relatively small. Schulz is trying to woo delegates in the biggest state, North Rhine-Westphalia, which has more than a quarter of the votes, in a series of events this week. \nTrade unions, some other localities and the state of Brandenburg, have already said they back the deal. \nSome leading SPD members argue Sunday’s vote is only on the blueprint for a final deal and details can still be negotiated. After any final coalition deal, the SPD’s 443,000 members will be balloted. \nSome conservatives have expressed confidence that the SPD will back the blueprint. “I can only recommend moving at top speed,” said Bavarian conservative Alexander Dobrindt. \n“I look forward to starting coalition negotiations on Monday,” he said, adding his only concern was the “masochistic way” the SPD had of talking down its successes. \nFor a graphic on coalitions under Merkel, click tmsnrt.rs/2AdhTpO \nFor a graphic on coaltion and election scenarios, click tmsnrt.rs/2AjqF5m Additional reporting by Holger Hansen, Thomas Escritt and Michael Nienaber; Editing by Alison Williams and Peter Graff", "external_links": [], "published": "2018-01-16T15:20:00.000+02:00", "crawled": "2018-01-16T15:34:27.000+02:00", "highlightTitle": ""}