{"organizations": [], "uuid": "c00cccdcccb763e32dcc6060c179124cee894360", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-livingtree-acquires-edbacker-and-names-gary-hensley-as-new-ceo.html", "country": "US", "domain_rank": 767, "title": "LivingTree Acquires Edbacker and Names Gary Hensley as New CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-30T17:00:00.000+02:00", "replies_count": 0, "uuid": "c00cccdcccb763e32dcc6060c179124cee894360"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-livingtree-acquires-edbacker-and-names-gary-hensley-as-new-ceo.html", "ord_in_thread": 0, "title": "LivingTree Acquires Edbacker and Names Gary Hensley as New CEO", "locations": [], "entities": {"persons": [{"name": "gary hensley", "sentiment": "negative"}, {"name": "edbacker", "sentiment": "none"}, {"name": "livingtree", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "livingtree acquires edbacker", "sentiment": "negative"}, {"name": "livingtree engage", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Jan. 30, 2018 /PRNewswire/ -- LivingTree, the private, safe and secure engagement platform today announced that it has acquired district fundraising tool, Edbacker. With the acquisition, Gary Hensley will take the helm as the new CEO.\nLivingtree, the K-12 engagement company will now deliver three key products: LivingTree Engage - the rapidly growing communication and parent engagement platform (formerly known as LivingTree), LivingTree Giving - A district wide fundraising platform (formerly Edbacker), and LivingTree Messenger (formerly Class Messenger) - A teacher centric communications solution.\n\"Districts, schools and educators need robust tools and tailored solutions,\" said Gary Hensley, new CEO of LivingTree. \"LivingTree Engage, Giving, and Messenger offer the necessary tools to deepen parent involvement with teachers, deliver increased student achievement, and strengthen communication. Uniting our enterprise fundraising solution, Edbacker and LivingTree services, will continue to fulfill LivingTree's mission in helping better serve and connect their school communities.\" Hensley will be taking on his role as CEO after more than 12 years working in education, along with an extensive career in the technology industry.\nPrior to joining LivingTree, Hensley's founded and led Edbacker as CEO, developing a user-friendly, district-wide online fundraising platform to connect parents, corporations and districts to address America's education funding gap. Before Edbacker, Hensley served as Director of Strategic Partnerships and Product Management at Pearson, which bought Hensley's K-12 dropout prevention software.\nEdbacker's secure and transparent, fundraising solution eliminates unwanted surprises with one account for all transactions and a single district site for all fundraising search and visibility. The company was funded by 1776, Moonshots Capital, Michael Chasen, (Former Blackboard Founder and CEO), Capital Factory of Austin, and DC's Acrebay Investment Management. Edbacker's platform will now be offered through LivingTree and rebranded as LivingTree Give, allowing users to easily access and implement the built-in customizable approval process from teacher-to-district.\n\"We're on a mission to expand our solution set to fully serve district needs with one comprehensive LivingTree platform. Hensley has a proven record in developing technology that solves critical gaps at the district level and will only continue to increase LivingTree's engagement impact,\" said Dean Drako, LivingTree Chairman.\nTo learn more about how you or your school and classroom can get access to LivingTree, visit www.LivingTree.com or call toll-free (844-548-8733).\nAbout LivingTree\nFounded in 2012, LivingTree's mission is to connect the people who raise, develop, and educate our children. Through its fundraising platform LivingTree Giving, teacher based messaging app LivingTree Messenger, and communication and parent engagement platform LivingTree Connect, LivingTree aims to better serve and connect school communities. LivingTree has been recognized for its work by the Stevie ® Awards for Women in Business as the 2016 Gold Community Involvement Program of the Year and 2016 Silver Smartphone App of the Year. http://www.LivingTree.com\nMedia Contact:\nGabrielle Asadoor\nGabrielle@apccollective.com\n310.270.0992\nView original content with multimedia: http://www.prnewswire.com/news-releases/livingtree-acquires-edbacker-and-names-gary-hensley-as-new-ceo-300590027.html\nSOURCE LivingTree", "external_links": ["http://www.livingtree.com/", "http://www.prnewswire.com/news-releases/livingtree-acquires-edbacker-and-names-gary-hensley-as-new-ceo-300590027.html"], "published": "2018-01-30T17:00:00.000+02:00", "crawled": "2018-01-30T18:30:41.000+02:00", "highlightTitle": ""}