{"organizations": [], "uuid": "76be74d19f58b329d17a9f71e8cafa7339ff0f2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226309525&w=1200&r=LYNXMPEE0S0ZV", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-indonesia-indrawati-dollar/dont-ruin-world-with-protectionism-indonesia-urges-u-s-idINKBN1FI1OG", "country": "US", "domain_rank": 408, "title": "Don't ruin world with protectionism, Indonesia urges U.S.", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:47:00.000+02:00", "replies_count": 0, "uuid": "76be74d19f58b329d17a9f71e8cafa7339ff0f2e"}, "author": "", "url": "https://in.reuters.com/article/us-indonesia-indrawati-dollar/dont-ruin-world-with-protectionism-indonesia-urges-u-s-idINKBN1FI1OG", "ord_in_thread": 0, "title": "Don't ruin world with protectionism, Indonesia urges U.S.", "locations": [], "entities": {"persons": [{"name": "marc jones", "sentiment": "negative"}, {"name": "fa", "sentiment": "negative"}, {"name": "sri mulyani indrawati", "sentiment": "none"}, {"name": "indrawati", "sentiment": "none"}, {"name": "steve mnuchin", "sentiment": "none"}, {"name": "potkin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - The United States needs to resist protectionist trade measures that could “ruin the world” and destroy progress made in reducing global poverty, Indonesia’s finance minister said on Monday.\nSri Mulyani Indrawati told Reuters she remained optimistic recent U.S. tariffs affecting other major Asian economies would not turn into a tit-for-tat trade war as open trade had been the big driver in reducing poverty over the last 30 years.\n“That is why you don’t want to ruin the world,” Indrawati said about U.S. protectionism.\n“It could be one or two practices you want to correct, but don’t destroy the achievement that is already remarkable - and that is good for the United States and good for the world.”\nShe also commented on the dollar’s decline. The world’s dominant currency is its biggest slide since 2010-2011 and its fall accelerated last week when U.S. Treasury Secretary Steve Mnuchin said the weakness had its advantages.\n“The U.S. dollar, should be reflecting the fundamentals of their economy. It’s not going to be a tool to boosting of their competitiveness,” Indrawati said.\nReferring back to the issue of trade protectionism she added: “We are hoping, as President Trump said, that ‘America First’ does not mean America alone.”\nAbout 16 percent of Indonesia’s trade is directly with the United States, though it also has an indirect exposure through other trading partners like nearby Singapore and Japan.\nIndrawati was in London to help launch the second “komodo” bond, a rupiah denominated bond sold in international debt markets rather than in Jakarta and named after the large, aggressive lizard found only in Indonesia.\nThis one was from state-owned infrastructure and procurement firm, Wijaya Karya, which raised 5.4 trillion rupiah ($404.13 million) as part of the government’s plans to get its firms to broaden their sources of financing.\nTwo more state owned enterprises are expected to follow but Jakarta is also a drive to make them more profitable and ensure they do not overstretch themselves by taking on too many large projects, which also crowds out private firms.\nThe minister said the government was bringing in new rules which will prevent state owned enterprises or their subsidiaries bidding on any infrastructure project contract worth under $40 million.\nShe added that Indonesia was working toward a U.S. dollar-denominated “Green”, sukuk bond.\n“I think it is very good feedback from bond investors and when the time is right we will bring the issue with the right size as well as the right structure.”\nAsked whether it was imminent, she replied. “We’ll see, we’ll see.”\n($1 = 13,362.0000 rupiah)\nReporting by Marc Jones & Fanny Potkin; Editing by Angus MacSwan\n ", "external_links": [], "published": "2018-01-29T15:47:00.000+02:00", "crawled": "2018-01-29T16:01:25.019+02:00", "highlightTitle": ""}