{"organizations": [], "uuid": "7838bd96b4e5d07b6a60eb801a3785573119fa97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-allscripts-to-acquire-practice-fusion-business.html", "country": "US", "domain_rank": 767, "title": "Allscripts to acquire Practice Fusion business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.906, "site_type": "news", "published": "2018-01-08T16:01:00.000+02:00", "replies_count": 0, "uuid": "7838bd96b4e5d07b6a60eb801a3785573119fa97"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-allscripts-to-acquire-practice-fusion-business.html", "ord_in_thread": 0, "title": "Allscripts to acquire Practice Fusion business", "locations": [], "entities": {"persons": [], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "allscripts", "sentiment": "negative"}, {"name": "practice fusion", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Allscripts (NASDAQ:MDRX), a global leader in healthcare technology, today announced a definitive agreement to acquire Practice Fusion, for $100 million in cash, subject to adjustment for working capital and net debt.\nPractice Fusion is a Silicon Valley pioneer in partnering with top-tier life sciences organizations to drive innovation. In combination with Allscripts existing payer and life sciences business, Allscripts expects to expand its big data insights and analytics, data sharing technologies, and clinical trial solutions to enable life sciences organizations to accelerate bringing life-changing therapies to market. Practice Fusion offers an affordable certified cloud-based EHR for traditionally hard-to-reach small, independent physician practices. Privately held Practice Fusion, founded in 2005 and based in San Francisco, supports 30,000 ambulatory practices and 5 million patient visits a month.\nThis strategic acquisition is expected to further advance Allscripts’ strategy to offer the most comprehensive, high performing health information technology and solutions. Practice Fusion’s EHR will complement and round out Allscripts existing ambulatory clinical portfolio, providing a value offering and “last mile” reach to the under-served clinicians in small and individual practices.\n“By adding Practice Fusion offerings to our portfolio, Allscripts will be further positioned for continued growth and long-term leadership in healthcare,” said Allscripts President Rick Poulton. “Combined with Practice Fusion, we expect Allscripts to continue to drive innovation in addressing gaps-in-care, improving clinical outcomes and real-world-evidence research. Plus, Practice Fusion’s affordable EHR technology supports traditionally hard-to-reach independent physician practices, and its cloud-based infrastructure aligns with Allscripts forward vision for solution delivery.”\nPoulton continued, “We believe this transaction will directly benefit Practice Fusion clients, who will now have access to Allscripts solutions and services. We look forward to welcoming Practice Fusion team members to our family. Allscripts highest priority remains to successfully meet healthcare providers’ highly complex needs as we enable them to lead the change to smarter care.”\nTransaction Summary\nThis transaction is targeted to close in the first quarter of calendar 2018, subject to the satisfaction of customary closing conditions, including the expiration or termination of the waiting period under U.S. antitrust laws.\nAllscripts intends to fund the purchase price through its existing secured credit facilities and cash balances.\nAdditional details of the acquisition are available in a Form 8-K to be filed by Allscripts with the Securities and Exchange Commission.\nAbout Allscripts\nAllscripts (NASDAQ:MDRX) is a leader in healthcare information technology solutions that advance clinical, financial and operational results. Our innovative solutions connect people, places and data across an Open, Connected Community of Health™. Connectivity empowers caregivers to make better decisions and deliver better care for healthier populations. To learn more, visit www.allscripts.com , Twitter , YouTube and It Takes A Community: The Allscripts Blog .\nFor more information contact:\nAllscripts:\nInvestors:\nDennis Olis\n312-386-6700\nddennis.oolis@allscripts.com\nMedia:\nConcetta Rasiarmos\n312-447-2466\nconcetta.rasiarmos@allscripts.com\nForward-Looking Statements\nThis press release contains forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995, that involve risks and uncertainties. Forward-looking statements provide current expectations of future events based on certain assumptions and include any statement that does not directly relate to any historical fact or pattern. Forward-looking statements can also be identified by the use of words such as “future,” “anticipates,” “believes,” “estimates,” “expects,” “intends,” “plans,” “predicts,” “will,” “would,” “could,” “can,” “may,” and similar terms. Forward-looking statements are not guarantees of future performance. Actual results could differ significantly from those set forth in the forward-looking statements, and reported results should not be considered an indication of future performance. Certain factors that could cause our actual results to differ materially from those described in the forward-looking statements include, but are not limited to: the timing or ultimate completion of the acquisition of Practice Fusion, as the transaction is subject to certain closing conditions, including the expiration or termination of the waiting period under U.S. antitrust laws; the possibility that expected benefits may not materialize as expected; the expected financial contribution and results of the Practice Fusion business; the successful integration of the Practice Fusion business; and the anticipated and unanticipated expenses and liabilities related to the acquisition and the acquired Practice Fusion business. Additional information about these and other risks, uncertainties, and factors affecting Allscripts business is contained in Allscripts filings with the Securities and Exchange Commission, including under the caption “Risk Factors” in the most recent Allscripts Annual Report on Form 10-K, in subsequent Form 10-Qs and in our Form 8-K regarding the pending Practice Fusion acquisition to be filed with the Securities and Exchange Commission under the heading “Forward-Looking Statements and Risk Factors.” Except as required by law, Allscripts does not undertake to update forward-looking statements to reflect changed assumptions, the impact of circumstances or events that may arise after the date of the forward-looking statements, or other changes in its business, financial condition or operating results over time.\nShareholders are encouraged to review SEC filings and more information about Allscripts available on Allscripts website.\nSource: Allscripts", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/401c8f4a-6f8b-4b2d-89f2-9b7dbef48d54", "https://www.globenewswire.com/Tracker?data=cQjXQ1w6_4EBDRp5itmTim6isVfPGRftdXKnthz09Wxjfkxn8j3J7xsf1dEOX0qMY5HFckG-gEXgTZs-p7OFaihKWlPLpISWeEcgVbbVTQCZ75FWUvDpwqnCAEEHFovm", "https://www.globenewswire.com/Tracker?data=vwIjoSQV9zEnCXlyP3XAgYh8Q4-5l1X2G100g4a-pnSsN6_TVvMhvJSInZeWC-tibVTKxaF5fnJs6Y0Guydswt7R_nXYHWFB4b-xle6Vvc1ow4niDCt90bdqvlHyB5FH", "https://www.globenewswire.com/Tracker?data=8qqQ3pghOCSOrjg1UlAnCuqYjdDA3c7tZQ0ftVXExYhyPZYPZUwYQ1nCpZ-hIWEZzG2pSAP-ElTmYYS3DdgQwQIk45szttm-gbet0Ue-kBI=", "https://www.globenewswire.com/Tracker?data=jO_suyNNcIjtXWRkcCOjPcHxGfudIZJnruMQLg87stOk2_V5_FlrkT-ZETzQFIgboAK-ArX4PrwTqHDTnV6w-Q==", "https://www.globenewswire.com/Tracker?data=97p_h4Cx424-olftbKrB70PnNoPM6lgBVhVWJqFOOWdqU0vubBbOq-3T2v9l-Qlk1oIhgjrtxepiNDaDy-1iTGQe08i8H6Kq4dbDN6T8HDI=", "https://www.globenewswire.com/Tracker?data=rHTSRfSVzEn72TuvvC5MhPSkqY5HvcDMT4HFtM_Ba4ZFxnSq8BYyxu120FNFmZCb-FLkPyXjuGDmH_iRVYWOgoolVdRZ7RC6pqLErLo6Z6xyhgYlxE8RbYmyJWtrVZx2"], "published": "2018-01-08T16:01:00.000+02:00", "crawled": "2018-01-08T19:40:29.004+02:00", "highlightTitle": ""}