{"organizations": [], "uuid": "3082932569e645c6218b23b48d6da2bef8883e42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219671732&w=1200&r=LYNXMPEE0415K", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-immigration/u-s-republicans-democrats-joust-over-dreamer-immigration-effort-idUKKBN1EU1W8", "country": "US", "domain_rank": 408, "title": "U.S. Republicans, Democrats joust over 'Dreamer' immigration effort", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T21:28:00.000+02:00", "replies_count": 0, "uuid": "3082932569e645c6218b23b48d6da2bef8883e42"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-immigration/u-s-republicans-democrats-joust-over-dreamer-immigration-effort-idUKKBN1EU1W8", "ord_in_thread": 0, "title": "U.S. Republicans, Democrats joust over 'Dreamer' immigration effort", "locations": [], "entities": {"persons": [{"name": "susan heavey", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "reuters/jose luis gonzalez/file photo  trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "sunland park", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 7:29 PM / Updated an hour ago U.S. Republicans, Democrats joust over 'Dreamer' immigration effort Susan Heavey 4 Min Read \nWASHINGTON (Reuters) - Congressional Republicans on Friday downplayed the likelihood of a deal soon with Democrats on saving 700,000 young, undocumented U.S. immigrants from being kicked out of the country in March, a possibility created by President Donald Trump. FILE PHOTO: 'Dreamers' react as they meet with relatives during the 'Keep Our Dream Alive' binational meeting at a new section of the border wall on the U.S.-Mexico border in Sunland Park, U.S., December 10, 2017. REUTERS/Jose Luis Gonzalez/File Photo \nTrump in September ordered an Obama-era programme that provided the young “Dreamer” immigrants with work permits and prevented them from being deported to end in six months. The programme is known as Deferred Action for Childhood Arrivals, or DACA. \nDespite his order, the Republican president has vacillated in his view of the Dreamers, young people who were brought to the United States as children illegally. Raised and educated in the country, most of them have little or no experience of their parents’ homelands in Latin America, Asia, Africa and elsewhere. \nSaving the Dreamers from deportation is a high priority for Democrats, but the issue has been swept up in other debates, including one on the wall that Trump wants to build along the U.S.-Mexico border. \nRepublican Senator John Cornyn, in a tweet on Friday, accused Democrats of trying to force a deal on Dreamers by doing a “slow walk” on efforts to approve critical disaster aid and defence spending. \nTwo other Republicans late on Thursday said the sides remained far apart. “Our discussions on border security and enforcement with Democrats are much further apart, and that is key to getting a bipartisan deal on DACA,” senators Thom Tillis and James Lankford said in a statement. \nDemocrats have said they are open to tying DACA to additional funding for border security technology. But they oppose Trump’s wall, which government estimates have said could cost over $21 billion. \nRepublican lawmakers met with Trump at the White House on Thursday and initially emerged saying they were optimistic that they could find a legislative fix for DACA. \nAt the meeting, a Department of Homeland Security document was discussed detailing the Trump administration’s budget proposal seeking $18 billion to build hundreds of miles of border barriers over a decade, an aide to one of the participants said. \nHouse Democratic Leader Nancy Pelosi said in a letter to Democratic colleagues that the document, first reported in the Wall Street Journal, was “alarming.” \nThe struggle over the Dreamers carries political weight for both parties heading into the November 2018 midterm congressional elections. Most of the Dreamers came from Mexico and Hispanics tend to vote for Democrats. \nOn Friday and Saturday, Trump and senior Republican congressional leaders are expected to discuss the issue at Camp David, the U.S. president’s mountain retreat in Maryland. \nA meeting between Trump and leaders of both parties was set for Tuesday. \nCornyn, in an interview on Fox News on Friday, said Trump would demand that an immigration deal address the visa lottery system and chain migration that unites family members. \n“Those are things that he’s insisted upon,” and Democrats would have to embrace them along with border security, said Cornyn. Additional reporting by Makini Brice and Susan Cornwell; Editing by Alistair Bell and Rosalba O'Brien", "external_links": [], "published": "2018-01-05T21:28:00.000+02:00", "crawled": "2018-01-05T22:02:37.006+02:00", "highlightTitle": ""}