{"organizations": [], "uuid": "4c4307c8e474e12c4b508ee69adbf9a37d5d7ab2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225055513&w=1200&r=LYNXMPEE0O09N", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-clariant-m-a-sabic/activist-investors-sell-clariant-stake-to-saudis-sabic-idINKBN1FE0LG", "country": "US", "domain_rank": 408, "title": "Activist White Tale sells Clariant stake to Saudi's SABIC", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T09:10:00.000+02:00", "replies_count": 0, "uuid": "4c4307c8e474e12c4b508ee69adbf9a37d5d7ab2"}, "author": "", "url": "https://in.reuters.com/article/us-clariant-m-a-sabic/activist-investors-sell-clariant-stake-to-saudis-sabic-idINKBN1FE0LG", "ord_in_thread": 0, "title": "Activist White Tale sells Clariant stake to Saudi's SABIC", "locations": [], "entities": {"persons": [{"name": "saud", "sentiment": "negative"}, {"name": "yousef al-benyan", "sentiment": "none"}], "locations": [], "organizations": [{"name": "clariant", "sentiment": "negative"}, {"name": "sabic", "sentiment": "negative"}, {"name": "sabic reuters staff", "sentiment": "none"}, {"name": "saudi basic industries corp", "sentiment": "none"}, {"name": "sab", "sentiment": "none"}, {"name": "white tale", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "clariant ag", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ZURICH/KHOBAR, Saudi Arabia (Reuters) - Activist investor White Tale has sold its nearly 25 percent stake in Swiss speciality chemicals group Clariant to Saudi Basic Industries Corp (SABIC) in a surprise move announced on Thursday.\nThe sale comes despite White Tale’s previous assertions that it was a long-term investor in Clariant, which had snubbed the activist’s demands for an independent strategic review and three seats on its board of directors.\nWhite Tale last year blocked Clariant’s $20 billion merger with U.S. peer Huntsman, saying the proposed tie-up undervalued the Swiss company and the thinking behind the deal did not make sense.\nClariant shares have risen by nearly a third since White Tale’s initial 7.2 percent investment emerged in July. They slid 4.5 percent in early European trading.\nSABIC did not say how much it paid for the deal, but the stake is worth around $2.4 billion based on market capitalization. Its shares were up 1.6 percent, outperforming the benchmark index which was up 0.2 percent.\nSABIC’s move to target more lucrative speciality chemicals comes as Saudi Arabia as a whole is looking for ways to diversify its economy and lessen reliance on oil.\nMiddle Eastern energy players have been eager to expand into more advanced downstream chemicals operations. State oil company Saudi Aramco in 2015 took a 50 percent stake in the synthetic-rubber business of Germany’s Lanxess, for around 1.2 billion euros in cash.\n“Clariant AG is complementary to SABIC’s existing specialties business and is well in line with SABIC’s strategy of opening up new growth opportunities in specialty chemicals,” SABIC CEO Yousef al-Benyan said in a statement.\nNO TAKEOVER PLANS SABIC, the world’s number 4 chemical firm, said it had no plans now to launch a full takeover of Clariant.\nClariant in a statement took note that “chemical industry peer and partner SABIC” had bought the 24.99 percent stake, making it Clariant’s biggest investor.\nIt said Clariant was informed in advance of the deal by petrochemical producer SABIC, already a partner in a catalyst joint venture.\n“Clariant intends to engage with SABIC over the coming weeks in order to discuss the new situation and explore possible ways to create value. Clariant will also continue the existing dialogue with all its other shareholders,” it said.\nAl-Benyan had told Reuters in November that SABIC planned to spend $3-10 billion on acquisitions and was looking at two producers of speciality plastics with operations in Europe, the Middle East and China.\n“The positive takeaway for SABIC from the deal is diversification as Clariant will give them the foothold in specialty chemical business,” said Nitin Garg, an analyst at investment bank, SICO Bahrain.\nSABIC is focused on commodity chemicals, while Clariant is involved in speciality chemicals business areas like Care Chemicals, Natural Resources, Catalysis and Plastics & Coatings.\nThe investors behind White Tale called their sale a success.\n“SABIC is an established global leader in the chemicals industry with a world-class management team and a long-term, sophisticated vision for the future. We are confident that this transaction allows Clariant AG to continue its path to becoming a global specialty chemicals leader,” said David Winter, co-chief investment officer of 40 North.\nAdditional reporting by Ludwig Burger in Frankfurt and Saeed Azhar in Dubai, editing by John Revill and John Miller; Editing by Keith Weir\n ", "external_links": [], "published": "2018-01-25T09:10:00.000+02:00", "crawled": "2018-01-25T09:36:45.004+02:00", "highlightTitle": ""}