{"organizations": [], "uuid": "e01dd4d3ef4936c37d4afb172b982144efaeeaae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/28/104865148-GettyImages-881220110-trump.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100370673/device/rss/rss.html", "section_title": "Commentary", "url": "https://www.cnbc.com/2018/01/05/donald-trump-and-the-extreme-danger-of-an-irrelevant-president-commentary.html", "country": "US", "domain_rank": 767, "title": "Donald Trump and the extreme danger of an irrelevant president-commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T17:43:00.000+02:00", "replies_count": 0, "uuid": "e01dd4d3ef4936c37d4afb172b982144efaeeaae"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/donald-trump-and-the-extreme-danger-of-an-irrelevant-president-commentary.html", "ord_in_thread": 0, "title": "Donald Trump and the extreme danger of an irrelevant president-commentary", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "korean peninsula", "sentiment": "none"}], "organizations": [{"name": "new york times trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When it comes to the conduct of American foreign affairs, the Trump administration has recently been performing competently—even admirably. That comes as a surprise to many observers because the administration's successes are a direct result of the president's failure to govern as he campaigned .\nGiven the discrepancies between how the president talks about foreign affairs and how his administration conducts itself abroad, foreign governments could be forgiven for thinking that the president did not have the final word on how U.S. pursues its interests—or even what those interests are. That could put the United States and the world in a uniquely parlous place.\nTo illustrate the discrepancies between the president's approach to a foreign crisis and the administration he supposedly manages, look toward the Korean Peninsula.\nRead more from Commentary:\nBannonism Goes Bust\nMore Iran Nonsense From the New York Times\nTrump's Tweets Are Ruining Him, But Do His Fans Care?\nThe contradictions between what Donald Trump says and how his government behaves were already evident when Secretary of State Rex Tillerson issued a direct appeal to North Korea's leader, Kim Jong-un . While on a September visit to Beijing, Tillerson admitted that the Trump administration was \"probing\" the Democratic People's Republic of Korea for an opening that could lead to talks between the two nations and had opened several lines of communications to Pyongyang.\nUpon reading the news, the president tweeted that his secretary of state was \"wasting his time\" issuing overtures to the Kim regime. \"Save your energy, Rex,\" Trump added , \"we'll do what has to be done.\"\n\"An adversarial power is justified in concluding that Trump is not the last word when it comes to American foreign policy, and that could be extremely dangerous.\" Perhaps the administration was playing the good-cop-bad-cop game with Pyongyang? If so, Tillerson didn't get the memo. In December, the secretary of state again approached the Kim regime. \"We are ready to have the first meeting without precondition,\" Tillerson said of his North Korean counterparts. \"Let's just meet, and we can talk about the weather if you want.\"\nBut within hours, a National Security Council source contradicted the secretary of state, insisting that the DPRK must suspend all missile and nuclear tests for a significant period before there could be any dialogue. Tillerson soon withdrew his offer of condition-free talks.\nIn Kim's New Year's Day address, the North Korean despot issued a perfunctory bleat of bellicosity, declaring his nuclear arsenal functional and capable of reaching the entirety of the United States. But in a more consequential part of that speech, Kim entertained the prospect of bilateral talks with the South Korean government.\nDonald Trump responded to this speech by disregarding its most substantial elements and instead tweeted cavalierly about the prospect of a thermonuclear exchange with the rogue state. South Korea, by contrast, ignored the threat and responded warmly to the overture.\nThe following day, the North Korean government accepted contact with the South Korean government on a hotline that had been dead for two years and indicated that further communications were forthcoming.\n\"[D]oes anybody really believe that talks and dialogue would be going on between North and South Korea right now if I wasn't firm,\" Trump tweeted , apparently missing the fact that Pyongyang's objective has always been to shut the United States out of the diplomatic process on the peninsula.\nAnd in a significant departure from Trump's alleged firmness, Washington and Seoul announced on Thursday their intention to halt all military exercise during the forthcoming Olympic Games in South Korea—a small but important concession to Pyongyang that should facilitate further thawing on the Peninsula.\nThere will always be those who suggest that Donald Trump is playing a masterful game, keeping all his opponents off balance. More likely, the Trump administration is of multiple minds on many subjects and is so poorly staffed at the consular level that the United States is diplomatically rudderless.\nAn adversarial power is justified in concluding that Trump is not the last word when it comes to American foreign policy, and that could be extremely dangerous. If Trump comes to be seen as a man who can be ignored in favor of other voices or signals from elsewhere within the administration, it could lead foreign governments to take Trump's statements for granted.\nThat presumption could lead a foreign power to miscalculate; after all, miscalculations are only miscalculations in hindsight. An adversarial power that executes a gambit on the world stage that does not elicit a response from the United States hasn't miscalculated at all.\nIf, however, Russia, or China, or Iran, or another revisionist powers were to conclude that Trump could be ignored and accidentally pushed him to a point at which he feels compelled to respond, that could trigger a crisis from which no one has a face-saving way out; and those have the potential to spiral out of control.\nAs erratic as this president may be, and despite the sighs of relief that the \"generals\" like James Mattis, H.R. McMaster, and John Kelly are largely in command of American foreign affairs, it is terribly dangerous if the United States fails to speak with one voice.\nThat condition leads to confusion; confusion leads to mistakes; and mistakes lead to confrontation—even the kind that no one wants. If Trump is going to outsource the role of the president to his subordinates, he's better off keeping quiet. Ambiguity about who is really in control of American affairs could get people killed.\nCommentary by Noah Rothman, the associate editor of Commentary magazine. Follow him on Twitter @noahcrothman .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": ["https://www.commentarymagazine.com/politics-ideas/trumps-tweets-ruining-fans-care/", "https://www.commentarymagazine.com/foreign-policy/middle-east/iran/more-iran-nonsense-from-the-new-york-times/", "http://www.businessinsider.com/south-korea-called-north-korea-hotline-daily-someone-finally-answered-2018-1", "http://bit.ly/2AolDAa", "http://www.twitter.com/noahcrothman", "https://www.nytimes.com/2017/09/30/world/asia/us-north-korea-tillerson.html?_r=0", "https://www.washingtonpost.com/news/checkpoint/wp/2018/01/04/trump-agrees-to-delay-military-exercise-with-south-korea-until-after-winter-olympics/?utm_term=.4404e30e1db3", "https://www.nytimes.com/2017/12/31/world/asia/north-korea-kim-jong-un-olympics.html", "https://www.nytimes.com/2018/01/02/us/politics/trump-tweet-north-korea.html", "https://www.nytimes.com/2018/01/02/world/asia/south-north-korea-olympics-talks.html?hp&action=click&pgtype=Homepage&clickSource=story-heading&module=first-column-region&region=top-news&WT.nav=top-news", "https://www.washingtonpost.com/news/post-politics/wp/2017/10/01/trump-says-tillerson-is-wasting-his-time-trying-to-pursue-negotiations-with-north-korea/?utm_term=.7dcb13738a5a", "https://www.commentarymagazine.com/podcast/bannonism-goes-bust/", "http://www.twitter.com/CNBCopinion", "https://www.commentarymagazine.com/foreign-policy/donald-trump-nevertrump-foreign-policy/", "https://www.commentarymagazine.com/foreign-policy/the-death-rattle-of-obamas-foreign-policy-record-susan-rice/", "http://www.cnn.com/2017/12/13/politics/tillerson-trump-north-korea/index.html"], "published": "2018-01-05T17:43:00.000+02:00", "crawled": "2018-01-05T17:16:46.036+02:00", "highlightTitle": ""}