{"organizations": [], "uuid": "68722c9f4a2fee462607437526e3aa70b31777e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/markets-swiss-stocks/swiss-stocks-factors-to-watch-on-jan-9-idUSL8N1P35J1", "country": "US", "domain_rank": 408, "title": "Swiss stocks - Factors to watch on Jan 9", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T08:53:00.000+02:00", "replies_count": 0, "uuid": "68722c9f4a2fee462607437526e3aa70b31777e6"}, "author": "", "url": "https://www.reuters.com/article/markets-swiss-stocks/swiss-stocks-factors-to-watch-on-jan-9-idUSL8N1P35J1", "ord_in_thread": 0, "title": "Swiss stocks - Factors to watch on Jan 9", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 5:41 AM / Updated 9 minutes ago Swiss stocks - Factors to watch on Jan 9 Reuters Staff 3 Min Read \nZURICH, Jan 9 (Reuters) - Here are some of the main factors that may affect Swiss stocks on Tuesday. SWISS NATIONAL BANK \nThe Swiss National Bank expects an annual profit of 54 billion Swiss francs ($55.25 billion) for 2017, the central bank said on Tuesday, the biggest profit in its 110-year history. SIKA \nThe construction chemicals group said it expected record 2017 net profit after ‍sales grew 8.9 percent in local currencies to 6.25 billion Swiss francs; it forecast sales would increase more than 10 percent in 2018 \nFor more news, click on NESTLE \nThe Financial Times, citing unidentified sources, reported that Rhone Capital, the U.S.-based private equity group, has placed a binding offer to acquire Nestle’s U.S. confectionary business, joining a $2.5 billion race that includes Italy’s Ferrero and The Hershey Company. COMPANY STATEMENTS \n* Novartis said it is starting a head-to-head superiority trial of its drug Cosentyx versus AbbVie’s Humira in psoriatic arthritis and a head-to-head superiority trial versus a proposed Humira biosimilar in ankylosing spondylitis. \n* SGS is buying U.S.-based food safety testing group Vanguard Sciences, which had 2017 sales of $11 million \n* Crealogix Holding AG acquires Barcelona-based Innofis \n* DKSH Holding AG started a collaboration with Cheplapharm to renew sales growth of its branded products across Asia \n* Burckhardt Compression Holding AG expects consolidated sales for fiscal year 2017 to reach the prior-year level and the EBIT margin to range between 6 and 9 percent; presents mid-range plan – systems division will maintain its market leadership – growth will come from the services division \n* Alpiq Holding AG and the Swiss hotel association establish partnership \n* Swiss Prime Site AG launches 300 million Swiss franc convertible bonds due 2025 ECONOMY \n* The Swiss unemployment rate rose to a non-seasonally adjusted 3.3 percent in December from 3.1 percent in the previous month. When adjusted for seasonal factors, the unemployment rate stood at 3.0 percent after a revised 3.1 percent in the previous month. \n* The Swiss National Bank is due to release data on its foreign currency reserves at 0800 GMT. \n* Swiss retail sales data for November is expected to be published by the Federal Statistics Office at 0815 GMT. Reporting by Zurich newsroom", "external_links": [], "published": "2018-01-09T08:53:00.000+02:00", "crawled": "2018-01-09T09:42:44.792+02:00", "highlightTitle": ""}