{"organizations": [], "uuid": "d3243504f3f3173d1ee253473eb3ceeb19b281ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219141447&w=1200&r=LYNXMPEE0217M", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-teens-tobacco-ads/click-bait-ads-are-tied-to-teen-smoking-idUKKBN1ES1XH", "country": "US", "domain_rank": 408, "title": "Click bait ads are tied to teen smoking", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T22:53:00.000+02:00", "replies_count": 0, "uuid": "d3243504f3f3173d1ee253473eb3ceeb19b281ba"}, "author": "", "url": "https://uk.reuters.com/article/us-health-teens-tobacco-ads/click-bait-ads-are-tied-to-teen-smoking-idUKKBN1ES1XH", "ord_in_thread": 0, "title": "Click bait ads are tied to teen smoking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 8:57 PM / Updated 9 hours ago Click bait ads are tied to teen smoking Lisa Rapaport 5 Min Read \n(Reuters Health) - - Teens who engage with online tobacco ads are more likely to start smoking than their peers who aren’t lured by digital marketing campaigns, a U.S. study suggests. Smoke rises from a burning cigarette in Bordeaux, France, September 19, 2017. REUTERS/Regis Duvignau \nTwice, about a year apart, almost 12,000 adolescents were surveyed about their online and social media habits as well as their tobacco use. \nAt the start, most of the teens were online and using social media at least once a day. But 78 percent of them had never used tobacco, and 88 percent had not engaged with online tobacco ads by doing things like signing up for emails, watching videos, sharing links on social media or getting coupons. \nOverall, 6 percent of the participants had used one tobacco product in the year leading up to the first survey and 16 percent had sampled more than one, the study found. \nAmong nonsmokers, the few participants who engaged with tobacco ads at the start of the study were 26 percent more likely to have started smoking and vaping by the end, researchers report in Pediatrics. \nAmong study participants who had already tried tobacco, those who also engaged with online ads were 58 percent more likely to become frequent users of cigarettes and other products by the end of the study and 29 percent less likely to attempt quitting. \n“One possible influence of engagement with online tobacco marketing is to make teenagers curious about and wanting to try a tobacco product,” said lead study author Samir Soneji, a researcher at Dartmouth College in Lebanon, New Hampshire. \n“Cigarette ads are not allowed on television, but there are far fewer restrictions that would prevent tobacco marketers from marketing to children and teenagers online,” Soneji said by email. “Until those regulations are in place, parents should educate their children about the dangers of tobacco, including e-cigarettes.” \nAdolescents in the study range in age from 12 to 17, and approximately one in three of them lived with a tobacco user. \nThe most common types of engagement were signing up for email alerts about tobacco products, reading articles online or watching videos, the study found. Some teens also used smartphones to scan quick response (QR) codes to enter a tobacco company sweepstakes or visited tobacco websites. \nThe study wasn’t a controlled experiment designed to prove whether or how engagement with online tobacco ads might influence smoking or vaping habits, the authors note. \nHowever, the results build on an extensive body of research showing that tobacco ads cause young people to start using tobacco products and become heavier users who are less motivated to quit, said Brian King, deputy director for research translation at the Office on Smoking and Health at the U.S. Centers for Disease Control and Prevention in Atlanta. \n“Tobacco products are advertised using themes that can especially resonate with youth, including independence, rebellion, and sex,” King, who wasn’t involved in the study, said by email. “The bottom line is that tobacco product advertising causes young people to start using tobacco products, irrespective of whether that advertising is made by traditional methods or newer methods such as the Internet.” \nOnline marketing may be harder for parents to police than traditional formats like print or television, said John Pierce, a cancer prevention researcher at the University of California, San Diego, who wasn’t involved in the study. \n“A major problem is that parents do not know when their child is being targeted by the tobacco industry advertising algorithms,” Pierce said by email. “Certainly we know that if the child clicks on any element of the ad, then that child will be further targeted by the tobacco industry.” \nTo figure out what their kids are finding online, parents should ask them what type of ads are popping up in their social media accounts, Pierce advised. \n“If they are honest with us, then we can discuss with them what the purpose of the advertising is and what the consequences of clicking on any component of the ad will be,” Pierce said. \nSOURCE: bit.ly/2E3VHMK Pediatrics, online January 2, 2018.", "external_links": [], "published": "2018-01-03T22:53:00.000+02:00", "crawled": "2018-01-04T00:12:20.001+02:00", "highlightTitle": ""}