{"organizations": [], "uuid": "5a012cf615f7ec330f7b479793f99df1e347df26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104941965-GettyImages-902781798.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19832390/device/rss/rss.html", "section_title": "Asia-Pacific News", "url": "https://www.cnbc.com/2018/01/11/asia-markets-china-data-oil-prices-and-currencies-in-focus.html", "country": "US", "domain_rank": 767, "title": "Asia markets: China data, oil prices and currencies in focus", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T02:50:00.000+02:00", "replies_count": 0, "uuid": "5a012cf615f7ec330f7b479793f99df1e347df26"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/11/asia-markets-china-data-oil-prices-and-currencies-in-focus.html", "ord_in_thread": 0, "title": "Asia markets: China data, oil prices and currencies in focus", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "osaka", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "asx", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Major Asian markets clawed back slight gains on Friday after finishing slightly lower in the last session, with most major indexes in the region tracking the strong lead from Wall Street.\nJapan's Nikkei 225 edged down 0.24 percent, or 56.61 points, to close at 23,653.82, with declines seen in major automakers and technology names: Toyota shed 0.67 percent, Honda lost 1.44 percent and Sony fell 1.06 percent by the end of the day. \nSymbol Name Price   Change %Change NIKKEI --- HSI --- ASX 200 --- SHANGHAI --- KOSPI --- CNBC 100 --- Shares of Uniqlo owner Fast Retailing , the most heavily-weighted stock on the index, soared 6 percent after the company announced record profit numbers on Thursday. Operating profit at the company rose 28.6 percent, with international revenues contributing more to total sales than local sales for the first time.\nNomura maintained its buy rating and raised its target price for Fast Retailing from 51,000 yen to 56,500 yen ($507.69) per share following the latest set of results.\n\"We think a catalyst for gains in the share price would be confirmation of earnings growth in the Uniqlo International business every quarter,\" Hidehiko Aoki, research analyst at Nomura, said in a note.\nMeanwhile, South Korea's Kospi advanced 0.34 percent to close at 2,496.42. Still, heavyweight technology names were mostly lower by the end of the day: Samsung Electronics closed off by 0.08 percent, but was off session lows, and LG Electronics lost 0.9 percent. \nSteelmakers and financials, however, notched gains. Posco rose 5.46 percent and Hyundai Steel advanced 1.85 percent by the end of the session.\nCryptocurrency-linked plays in South Korea were mixed after tumbling in the last session when a top official said a bill was being readied to ban cryptocurrency trading within the country. The justice ministry later followed up, saying it would only move ahead after \"careful consideration.\" On Friday, Kakao closed flat and Vidente plunged 8.61 percent. Trade in Omnitel was choppy, with the stock ending higher by 1.36 percent.\nDown Under, the S&P/ASX 200 ended 0.04 percent higher at 6,070.1 as the materials sector outperformed the broader market. Major miners Rio Tinto and BHP saw gains of 1.73 percent and 2.24 percent, respectively.\nChina December trade data mixed Greater China markets were mostly higher. Hong Kong's Hang Seng Index climbed 0.72 percent at 3:23 p.m. HK/SIN after rising for the 13th straight day on Thursday — a record winning streak for the benchmark. \nMainland markets, meanwhile, were narrowly mixed: The Shanghai composite edged up 0.12 percent to close at 3,429.32 and the Shenzhen composite shed 0.22 percent to close at 1,948.93.\nThat followed the release of China trade data on Friday, which showed that December imports in dollar terms rose 4.5 percent compared to the previous year, missing the 13 percent forecast in a Reuters poll. Dollar-denominated December exports, meanwhile, rose 10.9 percent, beating Reuters' 9.1 percent projection.\nFor the entirety of 2017, dollar-denominated exports rose 7.9 percent and imports rose 15.9 percent.\nThe Australian dollar , which tends to be sensitive to China data, was softer after the miss in China December import numbers. The Aussie dollar last traded at $0.7888, compared to the $0.789 handle seen earlier.\nFor their part, Asian markets have had a solid start to the new year, with major indexes, such as the Nikkei 225, climbing more than 2.5 percent in the month. Hong Kong's benchmark Hang Seng Index traded within sight of its all-time high.\nMajor U.S. indexes rose in the previous session after recording slight losses on Wednesday. The Dow Jones industrial average rose 0.81 percent, or 205.60 points, to finish the session with a record close of 25,574.73.\nOther major indexes saw similar gains, with the S&P 500 closing 0.7 percent higher and the Nasdaq composite climbing 0.81 percent by the end of the session.\nAhead, major U.S. banks are due to report quarterly results during the U.S. session as earnings season kicks off.\nEuro jumps The euro extended gains on Friday after rising in the last session on the release of European Central Bank minutes construed as hawkish by markets. At 3:16 p.m. HK/SIN, the common currency traded at $1.2060, above Thursday's close of $1.2029.\nThe dollar index , which tracks the U.S. currency against six major peers, edged down to trade at 91.833, extending losses seen in the last session.\nAgainst the yen, the dollar traded at 111.27.\nThe move lower in the greenback also came after producer prices stateside declined for the first time in more than a year in December. The producer price index declined 0.1 percent last month compared to the month prior, which compared to an increase of 0.2 percent forecast in a Reuters poll.\nU.S. crude futures retreated 0.47 percent to trade at $63.50 per barrel after touching a three-year high overnight. Brent crude was 0.09 percent softer at at $69.20, having scaled the $70 level in the last session before paring some gains to settle at its highest close in three years on Thursday.\nThe broader rise in prices of the commodity have been supported by output cuts led by OPEC and tighter U.S. inventories, but analysts have said it could be hard for prices to rise much further.", "external_links": [], "published": "2018-01-12T02:50:00.000+02:00", "crawled": "2018-01-12T01:58:18.002+02:00", "highlightTitle": ""}