{"organizations": [], "uuid": "18ee5d60e0fe53a55dc322a5074365419488c661", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/15/reuters-america-update-8-oil-hovers-around-70-clouded-by-rise-in-u-s-output.html", "country": "US", "domain_rank": 767, "title": "UPDATE 8-Oil hovers around $70, clouded by rise in U.S. output", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T19:42:00.000+02:00", "replies_count": 0, "uuid": "18ee5d60e0fe53a55dc322a5074365419488c661"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/15/reuters-america-update-8-oil-hovers-around-70-clouded-by-rise-in-u-s-output.html", "ord_in_thread": 0, "title": "UPDATE 8-Oil hovers around $70, clouded by rise in U.S. output", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "calgary", "sentiment": "none"}, {"name": "alberta", "sentiment": "none"}, {"name": "u.s. west", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Oil propped up by OPEC/Russia-led production cuts\n* Rising North American output threatens to undermine cuts\n* Asia remains awash with refined fuel products (Changes dateline, adds new comment, updates prices)\nCALGARY, Alberta, Jan 15 (Reuters) - Oil hovered near a three-year high above $70 a barrel on Monday on signs that production cuts by OPEC and Russia are tightening supplies, although analysts warned of \"red flags\" due to surging U.S. production.\nInternational benchmark Brent crude futures were trading 19 cents higher at $70.06 by 1727 GMT, having risen to a high of $70.19 a barrel earlier in the session.\nU.S. West   futures were up 35 cents at $64.65 a barrel. Both benchmarks hit levels not seen since December 2014, although trading was relatively thin due to a national holiday in the United States.\nA production-cutting pact between the Organization of the Petroleum Exporting Countries, Russia and other producers has given a strong tailwind to oil prices.\nGrowing signs of a tightening market after a three-year rout have bolstered confidence among traders and analysts that prices can be sustained near current levels.\nBank of America Merrill Lynch on Monday raised its 2018 Brent price forecast to $64 a barrel from $56, forecasting a deficit of 430,000 barrels per day (bpd) in oil production compared to demand this year.\nOther factors, including political risk, have also supported crude.\n\"OPEC and non-OPEC producers remain committed to production cuts at the same time world oil demand continues to increase,\" said Andrew Lipow, president of Lipow Oil Associates in Houston.\n\"As we go through 2018 the market is also going to continue to look at geopolitical supply disruptions that could occur in Libya, Nigeria and Venezuela.\"\nRED FLAGS\nStill, a number of analysts have warned that the 13 percent rally since the start of the year could peter out in the short term due to global refinery maintenance and rising North American production.\nU.S. energy companies added 10 oil rigs in the week to Jan. 12, taking the number to 752, energy service firm Baker Hughes said on Friday.\nThat was the biggest increase since June 2017.\nIn Canada, energy firms almost doubled the number of rigs drilling for oil last week to 185, the highest level in 10 months.\nVienna-based consultancy JBC Energy expects U.S. production to grow by 600,000 bpd in the first quarter of 2018 compared to a year earlier.\n\"From a fundamental perspective, the surge in U.S. managed money raises a clear red flag for us. We see the U.S. complex as decidedly bearish over the next two months.\"\nThe surplus in crude is expected \"to widen to levels that will overwhelm the market\", JBC said in a note. Seasonal refinery maintenance will further limit demand for crude, it added.\n(Additional reporting by Ron Bousso in London and Henning Gloystein in Singapore; Editing by Louise Heavens and Bill Trott)", "external_links": [], "published": "2018-01-15T19:42:00.000+02:00", "crawled": "2018-01-16T08:56:40.013+02:00", "highlightTitle": ""}