{"organizations": [], "uuid": "9422fb54dbd91739536ef72aa6351f94411dd516", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/legal", "section_title": "Legal News | Reuters", "url": "https://www.reuters.com/article/us-otc-serial-appealer/the-1st-circuit-has-had-it-with-contemptuous-serial-appealer-idUSKBN1FD31U", "country": "US", "domain_rank": 408, "title": "The 1st Circuit has had it with contemptuous serial appealer", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T05:34:00.000+02:00", "replies_count": 0, "uuid": "9422fb54dbd91739536ef72aa6351f94411dd516"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-otc-serial-appealer/the-1st-circuit-has-had-it-with-contemptuous-serial-appealer-idUSKBN1FD31U", "ord_in_thread": 0, "title": "The 1st Circuit has had it with contemptuous serial appealer", "locations": [], "entities": {"persons": [{"name": "biolitec", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "biolitec", "sentiment": "negative"}, {"name": "1st circuit", "sentiment": "negative"}, {"name": "1st u.s. circuit court of appeals", "sentiment": "none"}, {"name": "griffith firm", "sentiment": "none"}, {"name": "doherty wallace pillsbury & murphy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - For the past five years, the biomedical technology company Biolitec has repeatedly defied and ignored orders from U.S. courts. It has also repeatedly asked the 1st U.S. Circuit Court of Appeals to find that the court orders – and not its defiance – were the problem. On Tuesday, the 1st Circuit issued its fifth and sixth opinions since 2013 in appeals by Biolitec – all stemming from the same issue.\nAnd it sounds like the appeals court has finally had enough. Although the judges denied a motion for sanctions on Biolitec’s lawyers from the Griffith Firm and Doherty Wallace Pillsbury & Murphy , the court said the firms had better not test its patience again. “We have just disposed of the fifth appeal in this case,” the per curiam decision said. “This case is at an end, and we will not be as charitable, and will not expect the district court to be charitable, to any additional attempts at prolonging it. Defendants and their counsel should be on notice that we would view any further arguments … either in this court or the district court, as wholly baseless.”\nAfter all of the appeals, Biolitec remains on the hook for $70 million in contempt sanctions for disregarding a preliminary injunction and for a default judgment of $74 million to AngioDynamics, a company Biolitec had indemnified against patent infringement claims.\nThe litigation in Massachusetts, where Biolitec’s U.S. business is based, began after AngioDynamics won a $23 million judgment in an indemnification suit in federal court in New York. AngioDynamics, represented by Nixon Peabody , sued in federal court in Boston to execute the judgment. When Biolitec’s German parent launched plans to merge with its Austrian subsidiary – allegedly to evade the $23 million judgment for AngioDynamics – AngioDynamics obtained a preliminary injunction blocking the merger from taking place.\nBiolitec appealed to the 1st Circuit, which upheld the injunction in 2013, in its first brush with Biolitec. But while that appeal was under way, Biolitec completed the Austrian merger, in defiance of the injunction.\nU.S. District Judge Michael Ponsor of Boston found Biolitec in contempt in 2013. To coerce the company into undoing the merger he had enjoined, the judge ordered escalating monthly fines. (He also issued an arrest warrant for Biolitec’s CEO, Wolfgang Neuberger, who lives abroad.)\nIn addition to disregarding the preliminary injunction against its merger, Biolitec also thwarted AngioDynamics attempts to obtain discovery. Based on alleged violations of discovery orders, Judge Ponsor ended up entering a default judgment against Biolitec for $74 million – trebling (and then some) the original $23 million indemnification judgment.\nBiolitec appealed both the contempt ruling and the default judgment, in its second and third trips to the 1st Circuit. The same three-judge panel, Sandra Lynch, Norman Stahl and William Kayatta , upheld Judge Ponsor’s rulings against Biolitec in 2015. In Biolitec II , the 1st Circuit agreed with Biolitec that the contempt fines were steep but said the cumulative sanction – more than $70 million – was “in large part defendants' own doing, since they have failed to take steps to undo the merger.”\nIn the companion Biolitec III , the judges rejected the defendants’ jurisdictional arguments and protests of the hefty default judgment. “Facing repeated recalcitrance almost five years after (AngioDynamics) filed the instant action, the district court acted well within its discretion when it concluded that no lesser sanction could address the twin goals of penalty and deterrence,” the court wrote.\nThe 1st Circuit did instruct Judge Ponsor to amend the sanction order to cap the fines. On remand, he set the cap at $70 million. You can probably guess what happened next: Biolitec went to the 1st Circuit, this time arguing that the preliminary injunction was dissolved, under its own terms, when Judge Ponsor entered a default judgment against the company so the trial judge no longer had authority to sanction Biolitec for contempt.\nJudges Lynch and Stahl heard Biolitec’s fourth appeal, this time along with Judge David Barron , in 2016. The company fared no better in its fourth appellate trip than in the previous three. With some snippy asides about the company’s frequent appearances before the 1st Circuit, the court said that Biolitec had waited too long to contest Judge Ponsor’s continuing authority to issue contempt sanctions.\n“Simply put, defendants' window of opportunity to make this argument closed with our twin decisions in Biolitec II and Biolitec III,” the court wrote in Biolitec IV . “It is unclear whether the defendants' failure to raise this argument in their prior appeals was the result of inadvertence or tactical reserve and procedural gamesmanship. Either way, we decline to address their challenge now. During defendants' prior appeals, they simultaneously challenged the contempt order, the entry of default judgment, the final judgment award, and — again — the preliminary injunction itself. All of the ingredients for the present appeal were at hand, and yet defendants declined to make their argument at that time.”\nYou might think that after such a chiding – and after two failed petitions asking the U.S. Supreme Court to review adverse 1st Circuit decisions – Biolitec would come up with a strategy that didn’t involve another appearance before the 1st Circuit.\nNope. The defendants moved in the trial court for relief from Judge Ponsor’s contempt sanctions under Rule 60 of the Federal Rules of Civil Procedure, which allows the correction of a judgment or order in light of changes in the facts or the law. When the trial judge denied the motion, Biolitec headed back to the 1st Circuit.\nIt was not greeted warmly by Judges Lynch, Stahl and Barron. In rejecting this fifth appeal , the court called the company’s arguments a “rehash,” and said it would be “inequitable” to relieve Biolitec of the contempt sanctions. In the companion opinion denying sanctions, the judges gave Biolitec’s lawyers a clear warning not to come back unless they’ve got something new to say.\nI called and emailed the company’s lead outside counsel Edward Griffith, so see if the message penetrated. He didn’t respond to my messages.\nThe views expressed in this article are not those of Reuters News.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T05:34:00.000+02:00", "crawled": "2018-01-25T10:20:32.004+02:00", "highlightTitle": ""}