{"organizations": [], "uuid": "c8c01fb40b0201cf51c396feefaa947983c3ec95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-isc2-board-of-directors-elect-2018-officers.html", "country": "US", "domain_rank": 767, "title": "(ISC)2 Board of Directors Elect 2018 Officers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:00:00.000+02:00", "replies_count": 0, "uuid": "c8c01fb40b0201cf51c396feefaa947983c3ec95"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-isc2-board-of-directors-elect-2018-officers.html", "ord_in_thread": 0, "title": "(ISC)2 Board of Directors Elect 2018 Officers", "locations": [], "entities": {"persons": [{"name": "charest", "sentiment": "none"}, {"name": "kevin charest", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "clearwater", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "isc", "sentiment": "negative"}, {"name": "health care service corporation", "sentiment": "none"}, {"name": "u.s. department of health and human services", "sentiment": "none"}, {"name": "unitedhealth group", "sentiment": "none"}, {"name": "hcsc", "sentiment": "none"}, {"name": "u.s.a.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CLEARWATER, Fla., Jan. 16, 2018 /PRNewswire-USNewswire/ -- (ISC)² ® today announced the newly elected officers for its board of directors. The 13-member board provides governance and oversight for the organization, grants certifications to qualifying candidates, and enforces adherence to the (ISC)² Code of Ethics.\nEffective January 13, 2018, the following individuals assumed board officer positions:\nChairperson: Dr. Kevin Charest, CISSP, (U.S.A.) serves as the DSVP and chief information security officer for Health Care Service Corporation (HCSC). He is responsible for all facets of IT security for the largest member-owned healthcare company in the United States.\nPrior to joining HCSC, Dr. Charest led global cyber defense operations for UnitedHealth Group — the largest healthcare company in the world. He also served as the chief information security officer for the U.S. Department of Health and Human Services (HHS).\nPrior to joining the U.S. federal government, Dr. Charest served in several entrepreneurial and senior executive positions in the private sector. His leadership in technology applications, innovation and security were instrumental to the development of numerous products and services.\nDr. Charest holds a Ph.D. in cybersecurity from Capella University. He also holds a master's degree in business administration from the University of West Georgia and a bachelor's degree in computer science from the University of Central Arkansas.\nDr. Charest is a veteran of the U.S. Marine Corps and U.S. Army. He served as (ISC) 2 Board of Directors Secretary in 2017.\nVice Chairperson: Jennifer Minella, CISSP, (U.S.A.) is currently vice president of engineering and consulting CISO with Carolina Advanced Digital, Inc. With more than 15 years of experience working in the technology industry, Minella's most recent focus is in specialized areas of infrastructure security, including: network access control (NAC) and 802.1X, wireless security technologies, industrial security and SCADA.\nMinella has provided strategic security consulting for government agencies, educational institutions and Fortune 100 corporations.\nIn addition to consulting and client project implementations, Minella is an author, contributor and trusted media resource for information security topics.\nMinella was a contributing author of the (ISC)² Official CISSP Courseware v9 and a co-author of Low Tech Hacking. She is also a consulting faculty member of IANS Research, contributing author of technology publications and a trusted technical advisor to editors and journalists across the U.S.\nMinella served a prior term on the (ISC) 2 Board of Directors from 2014 to 2016. She also served as (ISC) 2 Board of Directors Secretary in 2015 and 2016, and (ISC)² Vice Chairperson in 2017 and 2018.\nTreasurer: Greg Thompson, CISSP, (Canada) is a security and risk executive with extensive experience in industries ranging from telecommunications to financial services. He is currently vice president of global operational risk for Scotiabank. Prior to joining Scotiabank, he was head of global IS security and CISO for Manulife Financial Corporation.\nThompson has been actively involved as a volunteer with (ISC)² for more than 10 years, first serving as a member of the North American Advisory Board and as a contributing member of the Executive Writer's Bureau.\nThis is Thompson's second term on the (ISC)² Board of Directors. He previously served between 2012 and 2014. Thompson also served as (ISC) 2 Board of Directors Treasurer in 2014.\nThompson also currently serves as a trustee for the Center for Cyber Safety and Education (formerly the (ISC)² Foundation).\nSecretary: Wim Remes, CISSP, (Belgium) is the founder of and principal consultant at NRJ Security, based in Belgium. He leverages 15+ years of security leadership experience to advise clients on reducing their risk posture by solving complex security problems and by building resiliency into their organizations.\nBefore starting NRJ Security, Remes was active as manager Global Services EMEA at Rapid7. Previously, he worked as managing consultant at IOActive, as manager of information security for Ernst and Young and as a security consultant for Bull, where he gained valuable experience building security programs for enterprise clients.\nRemes has been engaged in various infosec community initiatives such as the co-development of the Penetration Testing Execution Standard (PTES), InfosecMentors and organizing the BruCON security conference.\nRemes has been a featured speaker at international conferences such as Excaliburcon (China), Black Hat Europe, Source Boston, Source Barcelona and SecZone (Colombia).\nThis is Remes' second term on the (ISC)² Board of Directors. He previously served between 2012 and 2014. Wim also served as the (ISC)² Board of Directors Chairperson in 2014, 2016 and 2017.\n\"I express my sincere gratitude to the outgoing board officers for all of their efforts to strengthen (ISC)²,\" said (ISC)² CEO David Shearer, CISSP. \"I also thank Flemming Faber, Allison Miller, Dr. Meng-Chow Kang and Steven Hernandez, whose board terms ended in December, for their many contributions. I look forward to working with the new officers over the next year as they help us to advance the organization's vision of inspiring a safe and secure cyber world.\"\nMembers of the (ISC)² Board of Directors are elected each year from among the organization's global membership. The board is comprised of (ISC)²-certified volunteers who are industry leaders from around the globe representing business, government and academia. Visit (ISC) 2 's website for a complete list of current board members.\nAbout (ISC)²\n(ISC)² ® is an international nonprofit membership association focused on inspiring a safe and secure cyber world. Best known for the acclaimed Certified Information Systems Security Professional (CISSP ® ) certification, (ISC)² offers a portfolio of credentials that are part of a holistic, programmatic approach to security. Our membership, over 125,000 strong, is made up of certified cyber, information, software and infrastructure security professionals who are making a difference and helping to advance the industry. Our vision is supported by our commitment to educate and reach the public through our charitable foundation – The Center for Cyber Safety and Education TM . For more information about (ISC)² visit www.isc2.org , follow us on Twitter or connect with us on Facebook .\n© 2018 (ISC)² Inc., (ISC)², CISSP, SSCP, CCSP, CAP, CSSLP, HCISPP, CCFP, CISSP-ISSAP, CISSP-ISSEP, CISSP-ISSMP and CBK are registered marks of (ISC)², Inc.\nMedia Contact\nAmanda Tarantino\nManager, Corporate Communications\n(ISC)²\natarantino@isc2.org\n(727) 877-2230\nView original content: http://www.prnewswire.com/news-releases/isc2-board-of-directors-elect-2018-officers-300582767.html\nSOURCE (ISC)2", "external_links": ["https://iamcybersafe.org/", "http://www.isc2.org/", "https://www.isc2.org/About/Board-of-Directors", "https://twitter.com/isc2", "http://www.prnewswire.com/news-releases/isc2-board-of-directors-elect-2018-officers-300582767.html", "https://www.facebook.com/isc2fb"], "published": "2018-01-16T17:00:00.000+02:00", "crawled": "2018-01-16T18:21:35.000+02:00", "highlightTitle": ""}