{"organizations": [], "uuid": "b6d6681739e40c28df0688a0b69013e0c81fe5e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218518237&w=1200&r=LYNXMPEE000MC", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-jordan-palace-princes/jordan-royal-palace-denies-rumours-about-dismissal-of-princes-idUKKBN1EQ0OV", "country": "US", "domain_rank": 408, "title": "Jordan royal palace denies rumours about dismissal of princes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T05:21:00.000+02:00", "replies_count": 0, "uuid": "b6d6681739e40c28df0688a0b69013e0c81fe5e6"}, "author": "", "url": "https://uk.reuters.com/article/uk-jordan-palace-princes/jordan-royal-palace-denies-rumours-about-dismissal-of-princes-idUKKBN1EQ0OV", "ord_in_thread": 0, "title": "Jordan royal palace denies rumours about dismissal of princes", "locations": [], "entities": {"persons": [{"name": "jordan", "sentiment": "negative"}, {"name": "prince ali", "sentiment": "none"}, {"name": "suleiman al-khalidi", "sentiment": "none"}, {"name": "king abdullah", "sentiment": "none"}, {"name": "prince talal", "sentiment": "none"}, {"name": "prince faisal", "sentiment": "none"}, {"name": "talal bin mohammad", "sentiment": "none"}, {"name": "abdullah", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "sandhurst", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "istanbul", "sentiment": "none"}], "organizations": [{"name": "organisation of islamic cooperation", "sentiment": "none"}, {"name": "oic", "sentiment": "none"}, {"name": "min read  amman", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 3:22 AM / Updated 11 hours ago Jordan royal palace denies rumours about dismissal of princes Suleiman Al-Khalidi 3 Min Read \nAMMAN (Reuters) - Jordan’s royal palace warned it would take legal measures against anyone spreading what it said were lies about the ruling family, just days after King Abdullah relieved his brothers from top army posts in a major shakeup. FILE PHOTO: Jordan's King Abdullah speaks during an extraordinary meeting of the Organisation of Islamic Cooperation (OIC) in Istanbul, Turkey, December 13, 2017. REUTERS/Kayhan Ozer/Pool \nThe king, a staunch U.S. ally, said on Tuesday that his brothers Prince Ali and Prince Faisal and his cousin Prince Talal - who all had high military ranks - would be retiring from the armed forces. \nHe said the move was part of a reorganization of the armed forces’ hierarchy and structure. \nPrince Faisal was head of the royal air force and deputy chief of staff, while Prince Ali had for years been in charge of the royal guards responsible for the king’s protection. \nTalal Bin Mohammad, a Sandhurst graduate who was and an officer in the elite special forces, was also sent into retirement. They were all given honorary promotions. \nA palace statement on Sunday said it would pursue legal measures against those who propagated “lies and false claims” in social media and online websites with the goal of driving a wedge between the royal family and ordinary Jordanians. \n“These fabricated news circulated recently are aimed at undermining Jordan and its institutions,” the statement said. \nA Jordanian army source said the move by the king was prompted by a desire to set an example that the Hashemite ruling family was not above the law ahead of an anticipated move to retire dozens of senior army generals. \nThe king, who himself is an elite special forces commander, said the restructuring plan aimed to reorganize the 120,000- strong army by cutting costs and creating a more lean and effective force better equipped to modern warfare against terrorist groups. \nThe kingdom, which borders both Iraq to the east and Syria to the north and Israel to the west, has escaped relatively unscathed from the regional turmoil around it. \nMany of the top army brass are drawn from native Jordanian tribes who form the backbone of the support for the royal family and play a dominant role in the army and government. \nJordanians see the royal family as a unifying force that holds together a country where many of its citizens are Palestinians whose families settled after successive Arab-Israeli wars, placing the kingdom at the heart of the conflict. Reporting by Suleiman Al-Khalidi; Editing by Kim Coghill", "external_links": [], "published": "2018-01-01T05:21:00.000+02:00", "crawled": "2018-01-01T08:11:36.000+02:00", "highlightTitle": ""}