{"organizations": [], "uuid": "a12f95458c3b90e8e421dfd4e511aa9c68320afc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-rich-adcock-promoted-to-chief-executive-officer-of-verity-health-system.html", "country": "US", "domain_rank": 767, "title": "Rich Adcock Promoted to Chief Executive Officer of Verity Health System", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-04T23:49:00.000+02:00", "replies_count": 0, "uuid": "a12f95458c3b90e8e421dfd4e511aa9c68320afc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-rich-adcock-promoted-to-chief-executive-officer-of-verity-health-system.html", "ord_in_thread": 0, "title": "Rich Adcock Promoted to Chief Executive Officer of Verity Health System", "locations": [], "entities": {"persons": [{"name": "busine", "sentiment": "negative"}, {"name": "rich adcock", "sentiment": "negative"}, {"name": "patrick soon-shiong", "sentiment": "none"}, {"name": "richard adcock", "sentiment": "none"}, {"name": "rich", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}], "organizations": [{"name": "physician recruitment", "sentiment": "negative"}, {"name": "verity", "sentiment": "negative"}, {"name": "verity health", "sentiment": "none"}, {"name": "verity health system", "sentiment": "none"}, {"name": "medical foundation", "sentiment": "none"}, {"name": "business wire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "System to Focus on Growth with Physician Recruitment and Service Line Expansion\nLOS ANGELES--(BUSINESS WIRE)-- Verity Health , a nonprofit healthcare system, today announced the promotion of Richard Adcock to chief executive officer of Verity Health System, a chain of six hospitals and a Medical Foundation serving patients and communities in Northern and Southern California.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180104006321/en/\nRichard Adcock, Chief Executive Officer of Verity Health System (Photo: Business Wire)\n“Rich brings expert level leadership and unrivaled experience acquired from some of the most impressive and competitive medical institutions in the world,” said Dr. Patrick Soon-Shiong, Founder and CEO of NantWorks. “His credentials and proven track record of success at Verity Health have established Rich as a leader who can positively drive the organization’s innovation initiatives and execute our global strategy. We’re looking forward to the continued achievements that will take place at Verity Health with Rich as our new Chief Executive Officer.”\nPrior to joining Verity Health, Adcock served as executive vice president and chief innovation officer for Sanford Health. In this role, he was responsible for leading Sanford Health’s growth and innovation, in addition to direct operational oversight of related entities Sanford Research, Sanford Health Plan, Sanford Foundation, Sanford Frontiers, Profile by Sanford and Sanford World Clinic. Adcock began his tenure at Sanford in 2004, serving in various positions including director, vice president and executive vice president for Sanford Clinic, and president of Sanford Frontiers. Earlier, he was director of engineering and a Six Sigma Master Black Belt for GE Medical Systems. He began his career in the medical field as co-owner and vice president of research and development at Micro Medical Systems.\n“Over the last several months, Dr. Soon-Shiong and the board has seen the leadership Rich has provided to the health system,” said Jack Krouskup, chairman Verity Health System board of directors. “As a board, we are confident he is the person to lead the health system through this time of tremendous growth and expansion to provide state-of-the-art healthcare to the communities Verity serves.”\n“In the time I have been with Verity, I have seen first-hand the dedication and commitment of the physicians and the staff at our hospitals,” said Adcock. “There is an amazing opportunity to transform health care delivery for our patients and communities throughout California. We are recruiting physicians and healthcare professionals from across the country to join our team to lead the nation in driving medical research and innovation.”\nVerity Health System\nVerity Health System is a nonprofit healthcare system employing more than 6,000 staff statewide. The hospitals include 1,650 inpatient beds, six active emergency rooms, a trauma center and a host of medical specialties including tertiary and quaternary care. Verity’s two Southern California hospitals are St. Francis Medical Center in Lynwood and St. Vincent Medical Center in Los Angeles. In Northern California, O’Connor Hospital in San Jose, St. Louise Regional Hospital in Gilroy, Seton Medical Center in Daly City and Seton Coastside in Moss Beach are part of Verity Health.\nVerity Health also includes Verity Physician Network and Verity Medical Foundation, encompassing hundreds of physicians across a variety of practice models, independent practice associations, ambulatory surgery centers and urgent care centers.\nSince its creation in December 2015, Verity Health System has worked to revitalize its hospitals in Northern and Southern California and ensure financial sustainability in order to care for patients for generations to come – including the underserved.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104006321/en/\nVerity Health System\nJen Hodson, 562-397-3639\nSource: Verity Health System", "external_links": ["http://www.businesswire.com/news/home/20180104006321/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fverity.org%2F&esheet=51738238&newsitemid=20180104006321&lan=en-US&anchor=Verity+Health&index=1&md5=caa26774d30745669666479c81ae610b"], "published": "2018-01-04T23:49:00.000+02:00", "crawled": "2018-01-05T01:18:44.001+02:00", "highlightTitle": ""}