{"organizations": [], "uuid": "65b84425b3c79691d0fc61c6b6f61021d95eda7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220262580&w=1200&r=LYNXMPEE070R1", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/turkey-politics-election/turkeys-nationalist-opposition-to-back-erdogan-in-2019-election-idINKBN1EX16T", "country": "US", "domain_rank": 408, "title": "Turkey's nationalist opposition to back Erdogan in 2019 election", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:58:00.000+02:00", "replies_count": 0, "uuid": "65b84425b3c79691d0fc61c6b6f61021d95eda7c"}, "author": "", "url": "https://in.reuters.com/article/turkey-politics-election/turkeys-nationalist-opposition-to-back-erdogan-in-2019-election-idINKBN1EX16T", "ord_in_thread": 0, "title": "Turkey's nationalist opposition to back Erdogan in 2019 election", "locations": [], "entities": {"persons": [{"name": "erdogan", "sentiment": "negative"}, {"name": "bahceli", "sentiment": "none"}, {"name": "tayyip erdogan", "sentiment": "none"}, {"name": "recep tayyip erdogan", "sentiment": "none"}, {"name": "devlet bahceli", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "elysee palace", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "nationalist movement party", "sentiment": "none"}, {"name": "mhp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ANKARA (Reuters) - Turkey’s nationalist opposition said on Monday it would back President Tayyip Erdogan in the 2019 election, signalling continued right-wing support crucial to his narrow victory in a constitutional referendum last year.\nTurkish President Recep Tayyip Erdogan speaks during a joint press conference with the French president at the Elysee Palace in Paris, France, January 5, 2018. REUTERS/Ludovic Marin/Pool The Nationalist Movement Party (MHP), the smallest of parliament’s four factions, backed the vote to grant Erdogan sweeping executive powers, helping it squeak by with a margin of 51.4 percent.\n“The MHP will not submit a presidential candidate,” MHP leader Devlet Bahceli told a news conference. “The MHP will take a decision to support Erdogan in the presidential elections.” Turks will vote for both president and parliament next year.\nBahceli has said he wants a reduction in the minimum 10 percent vote required for a party to enter parliament.\nOver the past two decades he has brought the MHP more towards the mainstream and away from its early reputation for ties to rightist street gangs.\nThe party is now looking to fend off a challenge from Meral Aksener, an ex-interior minister and prominent nationalist who last year founded her own party after breaking with the MHP.\nOne recent poll suggested that Aksener’s party could eclipse the MHP and deprive it of the 10 percent threshold.\nBahceli said the MHP would consider an alliance with Erdogan’s AK Party if such a request came from the AKP.\nThe MHP won as much as 18 percent in the 1999 parliamentary election but slipped below the threshold with 9.5 percent in 2002. It has exceeded 10 percent in elections since and took 11.9 percent in the November 2015 vote.\nFounded by an ex-colonel involved in a 1960 military coup, the MHP espouses a mix of Turkish nationalism and scepticism towards the West. It is virulently opposed to autonomy for Turkey’s Kurdish minority.\nThe MHP support base once included sympathisers of the “Grey Wolves”, a nationalist youth group that fought street battles with leftists in the 1970s. Mehmet Ali Agca, who tried to assassinate Pope John Paul II in 1981, was a group member.\nReporting by Ercan Gurses and Ezgi Erkoyun; Editing by David Dolan and Mark Heinrich\n ", "external_links": [], "published": "2018-01-08T14:58:00.000+02:00", "crawled": "2018-01-08T15:21:08.003+02:00", "highlightTitle": ""}