{"organizations": [], "uuid": "409ffe1fdb5ca18224bda6fb3eb23744ef683832", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-end-week-on-cheery-note-after-robust-china-data-idUSL3N1PE36O", "country": "US", "domain_rank": 408, "title": "SE Asia Stocks-End week on cheery note after robust China data", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.059, "site_type": "news", "published": "2018-01-19T18:00:00.000+02:00", "replies_count": 0, "uuid": "409ffe1fdb5ca18224bda6fb3eb23744ef683832"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-end-week-on-cheery-note-after-robust-china-data-idUSL3N1PE36O", "ord_in_thread": 0, "title": "SE Asia Stocks-End week on cheery note after robust China data", "locations": [], "entities": {"persons": [{"name": "devika syamnath", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "mizuho bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Philippines climbs on farm data and revised Q3 GDP * Malaysia marks longest run of weekly gains in 16 years * Singapore climbs for fourth consecutive week By Devika Syamnath Jan 19 (Reuters) - Vietnam briefly hit an over ten-year peak on Friday backed by foreign inflows while other markets in the region notched up weekly gains and finished higher after data showed China's growth accelerated for the first time in seven years. China's better-than-expected economic growth in the fourth quarter of last year was supported by continued strength in the services industry and an expanding agricultural sector, data showed. \"China's good fourth-quarter growth suggests the authorities have executed a calibrated and judicious de-risking in the financial sector, carefully balancing financial stability and keeping the economy on an even keel\" said Mizuho Bank in a note. Vietnam ended 1.1 percent higher, having earlier hit its best level since November 2007, and marked a fifth straight week of gains. Foreign net buying supported the rise but the market might correct slightly in the short-term, said Bui Nguyen Khoa, head of macro research at BIDV Securities Company. However, the index is likely to cross the 2007 peak in the year's first quarter, he added. The Philippine index climbed 1.1 percent, with banks accounting for the majority of gains and top gainer Bank of the Philippine Islands setting a record close. Positive agricultural data and upcoming gross domestic product (GDP) data next week has fed buying sentiment, said Lexter Azurin, an analyst with AB Capital Securities in Manila. Philippines' agricultural output grew 2.2 percent in the fourth quarter, bringing full-year expansion to 3.95 percent. The country's third-quarter GDP growth was revised to 7.0 percent from the earlier announced 6.9 percent. Philippines will release its fourth-quarter GDP data on Jan. 23. Malaysia gained 0.4 percent and closed on a positive note for an eighth straight week, its longest streak of weekly gains since 2002. Utilities and financials led gains with power generator Tenaga Nasional topping the index and Petronas Gas adding 5.1 percent. Singapore ended 0.8 percent higher, rising for a fourth straight week, to mark its longest run of weekly gains since 2012. Indonesian shares finished 0.3 percent higher and gained 1.3 percent this week, its best in three. For Asian Companies click; SOUTHEAST ASIAN STOCK MARKETS Change on day Market Current Previous Pct Move close Singapore 3550.36 3521.31 0.82 Bangkok 1821.34 1819.32 0.11 Manila 8915.92 8820.74 1.08 Jakarta 6490.896 6472.666 0.28 Kuala Lumpur 1828.83 1821.6 0.40 Ho Chi Minh 1062.07 1050.25 1.13 Change on year Market Current End 2017 Pct Move Singapore 3550.36 3402.92 4.33 Bangkok 1821.34 1753.71 3.86 Manila 8915.92 8558.42 4.18 Jakarta 6490.896 6355.654 2.13 Kuala Lumpur 1828.83 1796.81 1.78 Ho Chi Minh 1062.07 984.24 7.91 (Reporting by Devika Syamnath in Bengaluru; Editing by Sunil Nair)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T18:00:00.000+02:00", "crawled": "2018-01-20T17:39:28.000+02:00", "highlightTitle": ""}