{"organizations": [], "uuid": "042292eb50f38b5f1832278a5b3ecd4478dbc44b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-sslj-com-limited-announces-effective-registration-statement-and-pricing-for-the-companys-initial-public-offering-on-nasdaq.html", "country": "US", "domain_rank": 767, "title": "SSLJ.com Limited Announces Effective Registration Statement and Pricing for the Company's Initial Public Offering on NASDAQ", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T21:34:00.000+02:00", "replies_count": 0, "uuid": "042292eb50f38b5f1832278a5b3ecd4478dbc44b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-sslj-com-limited-announces-effective-registration-statement-and-pricing-for-the-companys-initial-public-offering-on-nasdaq.html", "ord_in_thread": 0, "title": "SSLJ.com Limited Announces Effective Registration Statement and Pricing for the Company's Initial Public Offering on NASDAQ", "locations": [], "entities": {"persons": [], "locations": [{"name": "wuhan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "negative"}, {"name": "united states securities and exchange commission", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "boustead securities", "sentiment": "none"}, {"name": "ipo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WUHAN, China, Jan. 3, 2018 /PRNewswire/ -- SSLJ.com Limited (the \"Company\"), a vertically integrated O2O home decoration service and product provider in China, today announced that its registration statement relating to the Company's initial public offering (\"IPO\") was declared effective today by the United States Securities and Exchange Commission.\nThe offering will be sold on a best efforts basis. Boustead Securities, LLC is acting as the sole underwriter for the offering.\nIn its IPO, the Company is offering a minimum of 2,000,000 Class A ordinary shares and a maximum of 4,000,000 Class A ordinary shares at a price to the public of $5.00 per share. The Company expects to raise aggregate gross proceeds of between USD$10,000,000 and USD$20,000,000, before commissions and expenses. Upon closing of the offering, the total number of ordinary shares outstanding will be between 42,000,000 and 44,000,000 shares, as described in the prospectus. In addition, the underwriter has been granted an over-subscription option pursuant to which the Company may sell up to an additional 600,000 Class A ordinary shares for additional gross proceeds of up to $3,000,000 if the maximum number of 4,000,000 Class A ordinary shares are sold.\nThe Class A ordinary shares of the Company are expected to begin trading on The NASDAQ Capital Market following the closing of the IPO under the ticker symbol \"SSLJ.\"\nThe offering of the Company's Class A ordinary shares may only be made by means of a prospectus. An electronic copy of the prospectus may be obtained from the SEC website at www.sec.gov . A copy of the prospectus may also be obtained, upon written request, from Boustead Securities, LLC, Attention: Equity Capital Markets, 6 Venture, Suite 325, Irvine, CA 92618 USA, offerings@boustead1828.com , or by telephone at +1 949 502 4409. Ellenoff Grossman & Schole LLP is acting as counsel to the Company. Sole underwriter Boustead Securities, LLC is being represented by Ortolio Rosenstadt LLP.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy any of the Company's securities, nor shall such securities be offered or sold in the United States absent registration or an applicable exemption from registration, nor shall there be any offer, solicitation or sale of any of the Company's securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such state or jurisdiction.\nAbout SSLJ.com Limited\nSSLJ.com Limited is a pioneer in the vertically integrated O2O home decoration service and product market with one of the largest market shares in China. The Company provides customers with a convenient, full-service, one-stop solution for their homes' interior decoration and improvement needs by offering consulting, design, construction, and furnishing services as well as modern, high-quality and high-tech products. The Company has 9 branch companies and 12 sales offices in 10 cities, which are Beijing, Shanghai, Shenzhen, Wuhan, Suzhou, Hefei, Zhengzhou, Tianjin, Chengdu, Xi'an. For more information, please visit http://www.sslj.com/ .\nAbout Boustead Securities, LLC\nBoustead Securities, LLC (\"Boustead\") is an investment banking firm that executes and advises on IPOs, mergers and acquisitions, capital raises and restructuring assignments in a wide array of industries, geographies and transactions, for a broad client base. Boustead's core value proposition is the ability to create opportunity through innovative solutions and tenacious execution. With experienced professionals in the United States and around the world, Boustead's team moves quickly and provides a broad spectrum of sophisticated financial advice and services. For more information, visit http://www.boustead1828.com/ .\nForward-Looking Statements\nThis announcement contains forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact in this announcement are forward-looking statements, including but not limited to, the Company's proposed IPO. These forward-looking statements involve known and unknown risks and uncertainties and are based on current expectations and projections about future events and financial trends that the Company believes may affect its financial condition, results of operations, business strategy and financial needs, including the expectation that the IPO will be successfully completed. Investors can identify these forward-looking statements by words or phrases such as \"may,\" \"will,\" \"expect,\" \"anticipate,\" \"aim,\" \"estimate,\" \"intend,\" \"plan,\" \"believe,\" \"potential,\" \"continue,\" \"is/are likely to\" or other similar expressions. The Company undertakes no obligation to update forward-looking statements to reflect subsequent occurring events or circumstances, or changes in its expectations, except as may be required by law. Although the Company believes that the expectations expressed in these forward-looking statements are reasonable, it cannot assure you that such expectations will turn out to be correct, and the Company cautions investors that actual results may differ materially from the anticipated results.\nFor more information, please contact:\nSSLJ.com Limited Contact:\nMs. Wing Chuen Rhoda Lau, CFO\nPhone: +8627-8366-8638\nEmail: ir@sslj.com\nInvestor Contact:\nMs. Tina Xiao, President\nAscent Investor Relations LLC\nPhone: +1-917-609-0333\nEmail: tina.xiao@ascent-ir.com\nBoustead Securities, LLC Contact:\nDan McClory, Managing Director, Head of China, and Head of Equity Capital Markets\nPhone: +1 (949) 502-4408\nEmail: dan@boustead1828.com\nView original content: http://www.prnewswire.com/news-releases/ssljcom-limited-announces-effective-registration-statement-and-pricing-for-the-companys-initial-public-offering-on-nasdaq-300577122.html\nSOURCE SSLJ.com Limited", "external_links": ["http://www.boustead1828.com/", "http://www.sec.gov/", "http://www.sslj.com/", "http://www.prnewswire.com/news-releases/ssljcom-limited-announces-effective-registration-statement-and-pricing-for-the-companys-initial-public-offering-on-nasdaq-300577122.html"], "published": "2018-01-03T21:34:00.000+02:00", "crawled": "2018-01-03T22:44:44.001+02:00", "highlightTitle": ""}