{"organizations": [], "uuid": "fcb701f425d2aee787543b5b6a47c1fb910c3ae4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104925782-GettyImages-154769357.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/atkins-reinvents-its-diet-as-a-lifestyle-with-spokesman-rob-lowe.html", "country": "US", "domain_rank": 767, "title": "Atkins reinvents its diet as a lifestyle with spokesman Rob Lowe", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.721, "site_type": "news", "published": "2018-01-03T17:08:00.000+02:00", "replies_count": 0, "uuid": "fcb701f425d2aee787543b5b6a47c1fb910c3ae4"}, "author": "Angelica Lavito", "url": "https://www.cnbc.com/2018/01/03/atkins-reinvents-its-diet-as-a-lifestyle-with-spokesman-rob-lowe.html", "ord_in_thread": 0, "title": "Atkins reinvents its diet as a lifestyle with spokesman Rob Lowe", "locations": [], "entities": {"persons": [{"name": "atkins", "sentiment": "negative"}, {"name": "rob lowe getty images  atkins", "sentiment": "neutral"}, {"name": "rob lowe", "sentiment": "none"}, {"name": "scott parker", "sentiment": "none"}], "locations": [], "organizations": [{"name": "roark capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Atkins wants you to think lifestyle, not diet, this new year.\nThe brand that popularized cutting carbs to lose weight wants to tap the growing number of Americans who say they're focused on improving their health instead of simply shedding pounds. These so-called lifestylers are people who may buy Atkins' shakes and bars but don't necessarily follow the plan, said chief marketing officer Scott Parker.\nAtkins picked actor Rob Lowe, who portrayed health-obsessed Chris Traeger on NBC's \"Parks and Recreation,\" as the face of its latest campaign. He's the first male to represent the brand and someone who has managed his weight with Atkins for years. The ads tout the program as one that's \"not measured in pounds or ounces,\" a departure from traditional diet marketing.\nAtkins, which was acquired last summer by Conyers Park Acquisition to form Simply Good Foods , has already been trying to revamp its image to attract more people. It has added a plan that allowed 40 grams of carbs per day, in addition to the classic 20-grams-per-day regimen. Last month, it introduced a 100-carb-per-day option in its latest book \"Eat Right, Not Less.\"\n\"I think this is the final step, where we bring in Rob as a spokesman who hasn't had a weight issue or hasn't lost weight but will say it's absolutely critical to his energy level and vitality,\" Parker said. \"This is the final bold step, and I think it makes sense with the steps we've taken in the last three years.\"\nAtkins is one of several traditional diet brands that have tried to reinvent themselves. Weight Watchers introduced a program last month called WW FreeStyle that's more flexible than previous programs. Spokeswoman Oprah Winfrey says on the company's website: \"WW Freestyle is not a diet. It's a way of living.\"\nWall Street has rewarded Weight Watchers' efforts. Shares skyrocketed 300 percent last year and received another boost Tuesday when DJ Khaled became its first \"social media ambassador.\"\nJanuary has historically been a rough month for the company even though it's prime health season with people focused on their newly minted New Year's resolutions. Over the past 10 years, Weight Watchers has been one of the worst performers of health and fitness related stocks, seeing an average return of minus 10 percent in January and trading negative 60 percent of the time, according to Kensho.\nYet even as these brands pivot, they still haven't entirely dropped the word \"diet\" and their promises to help customers lose weight. They're still sprinkled into web materials, alongside more on-trend buzzwords.\nNutrisystem 's South Beach Diet website advertises losing weight within weeks. It's packaging takes a slightly different approach, saying it's \"designed for clean eating and optimal health.\"\nAtkins has also redesigned its packaging on its bars and shakes to make the brand imagery \"more contemporary,\" Parker said. Its efforts are all aligned with the goal of casting a wider net beyond dieters.\nDisclosure: NBC and CNBC are owned by Comcast's NBCUniversal unit.\nCorrection: An earlier version misstated who owns Atkins. It is Simply Good Foods.", "external_links": [], "published": "2018-01-03T17:08:00.000+02:00", "crawled": "2018-01-03T17:09:48.023+02:00", "highlightTitle": ""}