{"organizations": [], "uuid": "fe3f1ca921140b003f152b513deb24cee5807a69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 106, "shares": 106, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/ethereum-founder-grow-up-leave-community.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/04/ico-scam/", "country": "US", "domain_rank": 1196, "title": "Ethereum Founder Vitalik Buterin Warns of ICO Scams | Fortune", "performance_score": 1, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.717, "site_type": "news", "published": "2018-01-04T02:00:00.000+02:00", "replies_count": 0, "uuid": "fe3f1ca921140b003f152b513deb24cee5807a69"}, "author": "Jeff John Roberts", "url": "http://fortune.com/2018/01/04/ico-scam/", "ord_in_thread": 0, "title": "Ethereum Founder Vitalik Buterin Warns of ICO Scams | Fortune", "locations": [], "entities": {"persons": [{"name": "vitalik buterin", "sentiment": "negative"}, {"name": "jeff john roberts", "sentiment": "negative"}, {"name": "domhnall barden", "sentiment": "none"}, {"name": "buterin", "sentiment": "none"}, {"name": "othor", "sentiment": "none"}, {"name": "bill wolfhard", "sentiment": "none"}], "locations": [{"name": "reddit", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jeff John Roberts January 4, 2018 \nAs average investors rush into the world of digital currency, scammers are popping up to fleece them with familiar tricks—such as claiming they’re associated with famous figures in the industry like Ethereum founder Vitalik Buterin. \nThe problem has become so acute that Buterin himself took to Twitter on Wednesday to tell people to beware of “initial coin offerings” (ICOs) bearing his name. In a tweet, Buterin posted a screenshot from a good Samaritan on Reddit warning about a fishy coin project, adding that the caution could apply to other ICOs listing him as a partner. This is exactly the correct way to react to an ICO claiming my involvement. pic.twitter.com/v5Sw0N51l3 \n— Vitalik Buterin (@VitalikButerin) January 4, 2018 \nThe suspicious ICO in question is called “Othor,” and it bears other hallmarks of an outright scam. These include a flashy YouTube video (which has since been removed) and a list of executives who may not even exist—there are no traces of Othor’s lawyer “Domhnall Barden” and CFO “Bill Wolfhard” on Google . (The company has deleted most of its marketing material but a promotional article titled “ICO Alert Report,” which I’m not going to link to, is still up on the website Medium). \nFortune sought out members of Othor for a comment for this story, but was unable to find any contact information. \nThis particular hustle is just the latest example suspicious activity tied to an ICO, which involve companies selling digital tokens on the Internet. While the tokens have real world value in the case of some ICOs, they are merely speculative in many other situations—or may not even exist in the first place. \nIn the case of the blatant scams, the promoters typically have no more than a jargon-filled white paper and some marketing material. But thanks to social media, they have an easy way to hype the project and persuade gullible investors to part with their money. \nRegulators like are starting to crack down on ICOs—the SEC in December filed charges against an ICO that had raised $15 million with the promise of 13-fold returns—but the field is hard to police, in part because the scams can be run from anywhere in the world with just a website. \nDespite all the risks surrounding ICOs, they also offer enormous promise in the form of token-based online services, and as a way for startups to raise money outside of venture capital. \nThe most famous ICO may still be Ethereum itself , which Buterin launched in 2015, and whose tokens are today worth nearly $100 billion. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-04T02:00:00.000+02:00", "crawled": "2018-01-05T08:44:28.051+02:00", "highlightTitle": ""}