{"organizations": [], "uuid": "cf0516ba1b224a6f112f8c561412389e727cb437", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104971295-GettyImages-828410634.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/tom-bradys-former-backup-will-out-earn-him-for-super-bowl-lii.html", "country": "US", "domain_rank": 767, "title": "Tom Brady's former backup will out-earn him for Super Bowl LII", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.152, "site_type": "news", "published": "2018-01-26T23:26:00.000+02:00", "replies_count": 0, "uuid": "cf0516ba1b224a6f112f8c561412389e727cb437"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/26/tom-bradys-former-backup-will-out-earn-him-for-super-bowl-lii.html", "ord_in_thread": 0, "title": "Tom Brady's former backup will out-earn him for Super Bowl LII", "locations": [], "entities": {"persons": [{"name": "jimmy g", "sentiment": "negative"}, {"name": "tom brady", "sentiment": "negative"}, {"name": "garoppolo", "sentiment": "none"}, {"name": "jimmy garoppolo", "sentiment": "none"}, {"name": "brady", "sentiment": "none"}, {"name": "robert raiola", "sentiment": "none"}, {"name": "vince lombardi", "sentiment": "none"}, {"name": "michael mccann", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "getty images new england patriots", "sentiment": "negative"}, {"name": "super bowl lii boston globe", "sentiment": "negative"}, {"name": "sports illustrated", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Boston Globe | Getty Images New England Patriots quarterback Tom Brady and his former backup Jimmy Garoppolo \nPatriots quarterback Tom Brady may be bringing home another Vince Lombardi Trophy next Sunday, but his former backup, Jimmy Garoppolo, will bring home more cash. \nGaroppolo, who was traded to the San Francisco 49ers earlier this season, isn't competing in Super Bowl LII. His new team didn't even make the playoffs. Still, as Sports Illustrated points out , the 26-year-old quarterback will take home more (after income taxes) from Sunday night's game than Brady. \nHere's how. \nFor starters, you don't have to be on the current roster to qualify for post-season bonuses. As Michael McCann and Robert Raiola of SI explain: \"For the conference championships and the Super Bowl, the list of qualified players expands to include former players who were on the active or inactive lists for at least eight games that season (or post-season) and are not currently on the roster for another team in the same conference.\" show chapters 3:36 PM ET Wed, 1 Feb 2017 | 00:56 \nGaroppolo happened to be on the Patriots roster for eight games before being traded, just long enough to qualify for bonuses. He already earned $51,000 when the Patriots won the AFC championship game last week, and he could earn another $112,000 if the Patriots clinch the Super Bowl. If they lose, he'll get $56,000. \nHow will Garoppolo take home more than Brady? He, unlike Brady, won't be traveling to Minneapolis (where the Super Bowl is held) for \"work,\" and therefore won't be subject to Minnesota's state income tax of 9.85 percent , one of the highest in the country. As SI explains: \"Each day Brady spends in Minneapolis for the Super Bowl will increase their tax bill to Minnesota. That is not true for Garoppolo.\" \nGaroppolo will still have to pay state taxes on his bonus, but the tax will be based on his state of residency, either Illinois, where he was born and raised, or Massachusetts, where he spent the past few years with the Patriots. Both states have a lower state tax rate than Minnesota. \nIn short, Garoppolo will take home more from Super Bowl LII — no matter the outcome — because he'll pay less in taxes. Of course, the difference of a couple thousands dollars probably won't matter much to Brady. In 2016, he earned $44.1 million , and he and his wife Gisele Bündchen are worth a combined $540 million .", "external_links": [], "published": "2018-01-26T23:26:00.000+02:00", "crawled": "2018-01-26T23:30:29.009+02:00", "highlightTitle": ""}