{"organizations": [], "uuid": "bf2cf3505853ed6d31495f9bfb6157a1b5a7b48b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928184-GettyImages-900584890.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/05/bonds-and-fixed-income-us-jobs-data-politics-on-the-agenda-for-investors.html", "country": "US", "domain_rank": 767, "title": "Bonds and fixed income: US jobs, Data, politics, on the agenda for investors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T13:22:00.000+02:00", "replies_count": 0, "uuid": "bf2cf3505853ed6d31495f9bfb6157a1b5a7b48b"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/05/bonds-and-fixed-income-us-jobs-data-politics-on-the-agenda-for-investors.html", "ord_in_thread": 0, "title": "Bonds and fixed income: US jobs, Data, politics, on the agenda for investors", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "bureau of labor statistics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. government debt yields rose as investors bet on a stronger economy despite a weaker than expected jobs report.\nThe Labor Department reported that the economy added 148,000 jobs in December, missing expectations.\nThe yield on the benchmark 10-year Treasury note rose to 2.473 percent at 11:54 a.m. ET, while the yield on the 30-year Treasury bond rose to 2.81 percent. Bond yields move inversely to prices.\nYields previously dipped in the aftermath of the jobs numbers: The 2-year Treasury yield hit a low of 1.94 percent and the 10-year Treasury neared a session low of 2.438 percent.\nSymbol Yield Change %Change US 3-MO --- US 1-YR --- US 2-YR --- US 5-YR --- US 10-YR --- US 30-YR --- The government reported that the economy added 148,000 jobs in December, missing Wall Street expectations of 190,000, according to Reuters. The unemployment rate held steady at 4.1 percent.\nThe closely-monitored jobs report comes as Wall Street grows more optimistic on economic outlook as GDP numbers improve and the Federal Reserve look to hike interest rates.\n\"I would say all in all, when you take a look at the two-month number, it's still a good jobs report,\" said Michael Materasso, senior vice president of Franklin Templeton's fixed income policy committee. \"Keep in mind that December is a tough month in terms of getting the number right in terms of seasonality.\"\nMaterasso also said that since labor markets are so tight, it may be harder to see robust employment growth each month.\nIn other economic news, non-manufacturing activity slid further in December, with the ISM index coming in it 55.9 . That number missed expectations of 57.6 as predicted by a poll of Reuters economists.\nFed President Patrick Harker argued that the central bank ought to approve just two rate hikes in 2018 at the 2018 ASSA Annual Meeting in Philadelphia. Despite the fact that the central bank is currently expecting to raise its interest rate target three times in the new year, Harker said that weak inflation readings should keep the Fed at bay.\nHarker voted to hike the Fed's benchmark rate a quarter point at the Fed's December meeting.\nThe speech came just days after the U.S. central bank released the minutes from its December meeting, whereby the Fed raised interest rates, but remained concerned over the state of inflation .", "external_links": [], "published": "2018-01-05T13:22:00.000+02:00", "crawled": "2018-01-05T13:11:43.006+02:00", "highlightTitle": ""}