{"organizations": [], "uuid": "4af8bc0fbf75edec67885a5f1065d556d567a90e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222279074&w=1200&r=LYNXMPEE0E1JF", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-pope-chile/pope-francis-arrives-in-chile-idUSKBN1F42P3", "country": "US", "domain_rank": 408, "title": "Pope arrives in Chile to bolster battered Church credibility", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-16T06:28:00.000+02:00", "replies_count": 0, "uuid": "4af8bc0fbf75edec67885a5f1065d556d567a90e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-pope-chile/pope-francis-arrives-in-chile-idUSKBN1F42P3", "ord_in_thread": 0, "title": "Pope arrives in Chile to bolster battered Church credibility", "locations": [], "entities": {"persons": [{"name": "pope", "sentiment": "negative"}, {"name": "pope francis", "sentiment": "negative"}, {"name": "michelle bachelet", "sentiment": "none"}, {"name": "john paul ii", "sentiment": "none"}, {"name": "francis", "sentiment": "none"}, {"name": "bachelet", "sentiment": "none"}, {"name": "augusto pinochet", "sentiment": "none"}], "locations": [{"name": "santiago", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "vatican", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "vatican", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTIAGO (Reuters) - Pope Francis arrived in Chile on Monday to start a trip aimed at bolstering the credibility of a local Church battered by a sexual abuse crisis.\nTens of thousands of people chanting “Viva Papa Francisco” lined the streets of his route from the airport, where he was greeted by President Michelle Bachelet, to the Vatican embassy, his official residence for three days before he moves on to Peru.\nA youth orchestra played on the tarmac at an otherwise low-key arrival ceremony when the pope arrived from Rome on an unusually cool and cloudy austral summer evening.\nBachelet said on social media shortly after greeting Pope Francis that Chilean society was much changed since the visit of Pope John Paul II in 1987, during the dictatorship of the Augusto Pinochet.\n“We are a society more just, more free, and more tolerant,” she said, adding, however, that inequality still persisted.\nHundreds of people, many of them children waving Chilean and Vatican flags, greeted Francis outside the Vatican nunciature, or embassy, chanting “Pope Francis, friend, Chile is with you.”\nDespite the festive atmosphere, Francis faces protests from Catholics upset with his 2015 appointment of Bishop Juan Barros to head the small diocese of Osorno, a city south of the Chilean capital.\nBarros has been accused of protecting his former mentor, Father Fernando Karadima, whom a Vatican investigation in 2011 found guilty of abusing teenage boys over many years. Karadima has denied the allegations and Barros said he was unaware of any wrongdoing.\nThat scandal, which has gripped Chile, and growing secularization, has hurt the Church.\nA poll by Santiago-based think tank Latinobarometro this month showed that the number of Chileans calling themselves Catholics fell to 45 percent last year, from 74 percent in 1995.\nFrancis may speak to it and other problems when he makes his first address on Tuesday morning to national authorities and the diplomatic corps.\nPope Francis waves upon his arrival in Santiago, Chile, January 15, 2018. REUTERS/Ivan Alvarado He then heads to the capital’s sprawling Parque O‘Higgins, to say a Mass expected to attract more than 500,000 people.\nWhile in Chile, Francis will likely also face protests from indigenous Mapuche who accuse the state and private companies of taking their ancestral land.\nBachelet last year asked for forgiveness from the Mapuche community for such “errors and horrors.”\nSlideshow (14 Images) Francis flies south to Temuco in Chile’s Araucania region, home of the Mapuche, on Wednesday.\nSeveral churches were attacked in the capital last week, including one with a homemade bomb where unidentified vandals left a pamphlet reading “Pope Francis, the next bomb will be in your robe.”\nNo one was injured in the attacks and no one has claimed responsibility.\nShortly before the pontiff’s arrival on Monday, a small group of protesters shut down a street in downtown Santiago, but were quickly dispersed by police.\nSpeaking to reporters aboard the papal plane on the 15-hour flight from Italy, Francis expressed concern about the danger of nuclear war, saying that the world now stood at “the very limit.”\nHis comment came after Hawaii issued a false missile alert that provoked panic in the U.S. state and highlighted the risk of possible unintended nuclear war with North Korea.\nAsked if he was worried about the possibility of nuclear war, Pope Francis said: “I think we are at the very limit. I am really afraid of this. One accident is enough to precipitate things.”\nHe did not mention Hawaii or North Korea.\nReporting by Dave Sherwood and Philip Pullella; Editing by Diane Craft and Lisa Shumaker\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T06:28:00.000+02:00", "crawled": "2018-01-16T03:14:56.032+02:00", "highlightTitle": ""}