{"organizations": [], "uuid": "f16e96b625017d43ec63804be099441a397e3ebb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220243872&w=1200&r=LYNXMPEE070ML", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain-mad/misfiring-real-madrid-at-a-loss-to-explain-their-slump-idUKKBN1EX0YU", "country": "US", "domain_rank": 408, "title": "Misfiring Real Madrid at a loss to explain their slump", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T13:34:00.000+02:00", "replies_count": 0, "uuid": "f16e96b625017d43ec63804be099441a397e3ebb"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain-mad/misfiring-real-madrid-at-a-loss-to-explain-their-slump-idUKKBN1EX0YU", "ord_in_thread": 0, "title": "Misfiring Real Madrid at a loss to explain their slump", "locations": [], "entities": {"persons": [{"name": "philippe coutinho", "sentiment": "none"}, {"name": "zinedine zidane", "sentiment": "none"}, {"name": "diego costa", "sentiment": "none"}, {"name": "mark j. rebilas-usa", "sentiment": "none"}, {"name": "marcelo", "sentiment": "none"}, {"name": "marcelo believ", "sentiment": "none"}, {"name": "vitolo", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "il", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "soldier field", "sentiment": "none"}], "organizations": [{"name": "misfiring real madrid", "sentiment": "neutral"}, {"name": "champions league", "sentiment": "none"}, {"name": "paris st germain", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "la liga", "sentiment": "none"}, {"name": "real madrid", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sevilla", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "min read  barcelona", "sentiment": "none"}, {"name": "atletico", "sentiment": "none"}, {"name": "barca", "sentiment": "none"}, {"name": "celta vigo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 11:39 AM / Updated an hour ago Misfiring Real Madrid at a loss to explain their slump 3 Min Read \nBARCELONA (Reuters) - Real Madrid are consistently misfiring and they don’t know what to do about it. Aug 2, 2017; Chicago, IL, USA; Real Madrid defender Marcelo (12) after the 2017 MLS All Star Game at Soldier Field. Mark J. Rebilas-USA TODAY Sports \nThe reigning Spanish and European champions, 16 points behind La Liga leaders Barcelona after a 2-2 draw at Celta Vigo on Sunday, are on the brink of crisis. \nFourth in the table and thrashed 3-0 by arch-rivals Barca before Christmas, Real have virtually no chance of retaining the league title and more trouble lies ahead. \nMadrid’s bid to win the Champions League for a third season running depends on overcoming big-spending Paris St Germain in the last 16, a tall order for a side playing as poorly as Zinedine Zidane’s men. \nBarcelona, meanwhile, have strengthened by signing Philippe Coutinho from Liverpool while Atletico have added Chelsea striker Diego Costa and Sevilla’s Vitolo to their ranks. \nDefender Marcelo believes Madrid are doing everything they can to turn their season around. \n“We started the (Celta Vigo) match running and fighting, but that’s football. We can’t do any more than that,” he told reporters. \n“We’re doing what we can, trying to play good football, score goals, but it is not working out. We have to face this, go out there and run. There’s no other way.” \nZidane acknowledged that his team are in trouble but cannot put his finger on why. \n“I have to detect the problem because I am responsible,” the French coach said. “And I’ll try and we will try.” \nUnusually for a club with such attacking riches, goals have been a major problem this season and no player has scored more than four in La Liga. \nCristiano Ronaldo has 15 netted goals in all competitions but has been a shadow of his former self. \nMadrid’s team is set up around providing the Portuguese forward with chances but in La Liga he has scored a modest four times in 13 appearances. \nGareth Bale has the same tally in seven games and the Welshman netted both Madrid goals against Celta Vigo on a sour night for the champions from which they were lucky to emerge with a point. \nBased on performances there is an argument for Madrid’s tactical approach to be structured around Bale, but Zidane cannot rely on the injury-prone winger to stay fit. \nReal’s squad was weakened in the summer by the departures of striker Alvaro Morata to Chelsea and midfielder James Rodriguez to Bayern Munich while the players brought in have not convinced. \nTheo Hernandez and Dani Ceballos are two of the most promising young players in La Liga but Zidane appears unwilling to rely on them, preferring to stick with the tried and trusted. \nUnfortunately for the coach, the experienced double-winning team of last season looks like it has run out of gas. Reporting by Rik Sharma, editing by Ed Osmond", "external_links": [], "published": "2018-01-08T13:34:00.000+02:00", "crawled": "2018-01-08T13:57:29.000+02:00", "highlightTitle": ""}