{"organizations": [], "uuid": "c275db802ac8d7083c105c03f535044e276b18c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-890663406.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/matt-damon-i-am-really-sorry-for-comments-about-harassment-in-hollywood/", "country": "US", "domain_rank": 1196, "title": "Matt Damon Apologizes for Comments About Sexual Harassment | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.244, "site_type": "news", "published": "2018-01-16T02:00:00.000+02:00", "replies_count": 0, "uuid": "c275db802ac8d7083c105c03f535044e276b18c1"}, "author": "Sarah Gray", "url": "http://fortune.com/2018/01/16/matt-damon-i-am-really-sorry-for-comments-about-harassment-in-hollywood/", "ord_in_thread": 0, "title": "Matt Damon Apologizes for Comments About Sexual Harassment | Fortune", "locations": [], "entities": {"persons": [{"name": "sarah gray", "sentiment": "negative"}, {"name": "matt damon", "sentiment": "negative"}, {"name": "damon", "sentiment": "none"}, {"name": "stella artois", "sentiment": "none"}, {"name": "kathie lee gifford", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "decembe", "sentiment": "none"}], "organizations": [{"name": "abc", "sentiment": "none"}, {"name": "time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Sarah Gray January 16, 2018 \nActor Matt Damon apologized for his recent comments about sexual harassment in Hollywood and the #MeToo campaign on the Today Show on Tuesday following withering criticism that he failed to recognize the seriousness of the problem. \n“I don’t want to further anybody’s pain with anything that I do or say,” he told host Kathie Lee Gifford. “So for that I am really sorry.” \nDamon appeared on the morning show to discuss a Super Bowl ad that he stars in for Stella Artois. The ad promotes the organization Water.org , which works to provide access to clean water for millions around the globe. \nThe conversation eventually shifted to the #MeToo campaign and Time’s Up, an initiative by entertainment industry workers to end sexual harassment in the industry. Damon responded by apologizing for remarks last month about a sexual harassment being a “spectrum of behavior” that shouldn’t be bunched together. \n“There’s a difference between, you know, patting someone on the butt and rape or child molestation, right?” he said on ABC’s Popcorn in Decembe r. “Both of those behaviors need to be confronted and eradicated without question, but they shouldn’t be conflated, right?” \nAt the time, actress Alyssa Milano responded on Twitter, saying: “I have been a victim of each component of the sexual assault spectrum of which you speak. They all hurt. And they are all connected to a patriarchy intertwined with normalized, accepted–even welcomed– misogyny.” Dear Matt Damon, \nIt’s the micro that makes the macro. \n(Thread) \n— Alyssa Milano (@Alyssa_Milano) December 16, 2017 We are in a “culture of outrage” because the magnitude of rage is, in fact, overtly outrageous. And it is righteous. \n— Alyssa Milano (@Alyssa_Milano) December 16, 2017 I have been a victim of each component of the sexual assault spectrum of which you speak. They all hurt. And they are all connected to a patriarchy intertwined with normalized, accepted–even welcomed– misogyny. \n— Alyssa Milano (@Alyssa_Milano) December 16, 2017 We are not outraged because someone grabbed our asses in a picture. We are outraged because we were made to feel this was normal. We are outraged because we have been gaslighted. We are outraged because we were silenced for so long. \n— Alyssa Milano (@Alyssa_Milano) December 16, 2017 There are different stages of cancer. Some more treatable than others. But it’s still cancer. \n— Alyssa Milano (@Alyssa_Milano) December 16, 2017 Sexual harassment, misconduct, assault and violence is a systemic disease. The tumor is being cut out right now with no anesthesia. Please send flowers. #MeToo \n— Alyssa Milano (@Alyssa_Milano) December 16, 2017 \nDamon’s Good Will Hunting co-star Minnie Driver also responded to Damon’s comments. I don’t just speak for myself in this article, I speak for too many friends and co-workers as well. – Minnie Driver: men like Matt Damon 'simply cannot understand what abuse is like' https://t.co/Z9M120C6XZ \n— Minnie Driver (@driverminnie) December 17, 2017 \n“Let women do the speaking up right now,” Driver said in an interview with The Guardian after Damon’s initial comments. “The time right now is for men just to listen and not have an opinion about it for once.” \nOn Tuesday, Damon responded to the criticism by saying, “I really wish I’d listened a lot more before I weighed in on this.” He added: “This whole Time’s Up—a lot of those women are my dear friends, and I love them and respect them, and support what they’re doing, and want to be a part of that change, and want to go along for the ride, but I should get in the back seat and close my mouth for a while.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-16T02:00:00.000+02:00", "crawled": "2018-01-17T05:58:17.000+02:00", "highlightTitle": ""}