{"organizations": [], "uuid": "2b0fa419009c117e3c7651d9a26feebbf9349c8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-charles-river-laboratories-adds-jean-paul-mangeolle-to-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Charles River Laboratories Adds Jean-Paul Mangeolle to Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-16T16:00:00.000+02:00", "replies_count": 0, "uuid": "2b0fa419009c117e3c7651d9a26feebbf9349c8b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-charles-river-laboratories-adds-jean-paul-mangeolle-to-board-of-directors.html", "ord_in_thread": 0, "title": "Charles River Laboratories Adds Jean-Paul Mangeolle to Board of Directors", "locations": [], "entities": {"persons": [{"name": "jean-paul mangeolle", "sentiment": "negative"}, {"name": "charles river", "sentiment": "none"}, {"name": "mangeolle", "sentiment": "none"}, {"name": "james c. foster", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "wilmington", "sentiment": "none"}, {"name": "charles river", "sentiment": "none"}], "organizations": [{"name": "charles river laboratories", "sentiment": "negative"}, {"name": "crl", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "charles river laboratories international, inc.", "sentiment": "neutral"}, {"name": "charles river’s board", "sentiment": "none"}, {"name": "audit and compensation committees", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WILMINGTON, Mass.--(BUSINESS WIRE)-- Charles River Laboratories International, Inc. (NYSE:CRL) today announced the appointment of Jean-Paul Mangeolle, former President of AB SCIEX, to its Board of Directors. Mr. Mangeolle’s extensive experience leading global life science and bioscience companies, with a specific focus on high-end instrumentation, will provide Charles River with a unique combination of expertise. As a member of the Board, he will serve on the Audit and Compensation Committees.\n“Mr. Mangeolle’s background leading global organizations and expanding into key international markets will enhance the expertise of Charles River’s Board and play a valuable role as we strategically expand Charles River’s unique portfolio of early-stage drug research products and services,” said James C. Foster, Chairman, President and Chief Executive Officer of Charles River. “His extensive experience with the conception, design, manufacture, and marketing of high-end instrumentation will be particularly helpful as we continue to build our Microbial Solutions business.”\nMr. Mangeolle has more than 35 years of experience in life science and bioscience on a global scale. He has extensive experience building teams and profitable businesses across the globe in multiple market segments, including biotechnology and pharmaceutical companies, academic research laboratories, microelectronics manufacturing, and OEM companies. He retired recently from AB SCIEX (an operating company of Danaher Corp.), where he had held the position of president since 2014. In that role, he was responsible for Sciex’s and Phenomenex’s global operations. Previously, he was Executive Vice President for the Process Solutions Business Unit of Merck KGaA Millipore. Mr. Mangeolle spent more than 25 years with Millipore in progressively larger roles, culminating in the role of President, Bioprocess Division, where he was also a member of the Corporate Executive Committee and an elected corporate officer.\n“I am pleased to join Charles River’s Board of Directors and look forward to contributing to the future success and growth of this recognized global leader in early-stage drug discovery and development,” said Mr. Mangeolle. “In particular, I am looking forward to providing strategic counsel to Charles River’s Microbial Solutions business, drawing on my manufacturing experience to support its future growth.”\nCaution Concerning Forward-Looking Statements\nThis press release includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as “anticipate,” “believe,” “expect,” “intend,” “will,” “may,” “estimate,” “plan,” “outlook,” and “project,” and other similar expressions that predict or indicate future events or trends or that are not statements of historical matters. Forward looking statements include statements in this press release regarding future demand for drug discovery and development products, as well as growth of the Microbial Solutions business, and the specific contributions of members of Charles River's Board of Directors. Forward-looking statements are based on Charles River’s current expectations and beliefs, and involve a number of risks and uncertainties that are difficult to predict and that could cause actual results to differ materially from those stated or implied by the forward-looking statements. A further description of these risks, uncertainties, and other matters can be found in the Risk Factors detailed in Charles River's Annual Report on Form 10-K as filed on February 14, 2017, as well as other filings we make with the Securities and Exchange Commission. Because forward-looking statements involve risks and uncertainties, actual results and events may differ materially from results and events currently expected by Charles River, and Charles River assumes no obligation and expressly disclaims any duty to update information contained in this news release except as required by law.\nAbout Charles River\nCharles River provides essential products and services to help pharmaceutical and biotechnology companies, government agencies and leading academic institutions around the globe accelerate their research and drug development efforts. Our dedicated employees are focused on providing clients with exactly what they need to improve and expedite the discovery, early-stage development and safe manufacture of new therapies for the patients who need them. To learn more about our unique portfolio and breadth of services, visit www.criver.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005470/en/\nCharles River Laboratories International, Inc.\nInvestor Contact:\nSusan E. Hardy, 781-222-6190\nCorporate Vice President, Investor Relations\nsusan.hardy@crl.com\nor\nMedia Contact:\nAmy Cianciaruso, 781-222-6168\nCorporate Vice President, Public Relations\namy.cianciaruso@crl.com\nSource: Charles River Laboratories International, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.criver.com%2Fproducts-services%2Fdiscovery-services%2Fvitro-biology%2Fgenome-engineering-techniques%2Fshrna-libraries%3Fregion%3D3601&esheet=51743321&newsitemid=20180116005470&lan=en-US&anchor=Charles+River+Laboratories+International%2C+Inc.&index=1&md5=38902caed8ce9faf6d39237917030869", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.criver.com&esheet=51743321&newsitemid=20180116005470&lan=en-US&anchor=www.criver.com&index=2&md5=9e4d082ac92a60a50ce622589fcb6cbc", "http://www.businesswire.com/news/home/20180116005470/en/"], "published": "2018-01-16T16:00:00.000+02:00", "crawled": "2018-01-16T16:29:16.005+02:00", "highlightTitle": ""}