{"organizations": [], "uuid": "bfd56c9b6555d8bc22354cb2dc2b4d8517b757e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-kala-pharms-study/kala-pharma-shares-fall-on-mixed-results-from-dry-eye-drug-trials-idUKKBN1EU17L", "country": "US", "domain_rank": 408, "title": "Kala Pharma shares fall on mixed results from dry eye drug trials", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T14:54:00.000+02:00", "replies_count": 0, "uuid": "bfd56c9b6555d8bc22354cb2dc2b4d8517b757e2"}, "author": "", "url": "https://uk.reuters.com/article/us-kala-pharms-study/kala-pharma-shares-fall-on-mixed-results-from-dry-eye-drug-trials-idUKKBN1EU17L", "ord_in_thread": 0, "title": "Kala Pharma shares fall on mixed results from dry eye drug trials", "locations": [], "entities": {"persons": [{"name": "liana moussatos", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "kala pharma", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "wedbush", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "kala pharmaceuticals inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 12:54 PM / Updated 7 hours ago Future of Kala Pharma's dry eye drug uncertain after mixed results Tamara Mathias , Manas Mishra 3 Min Read \n(Reuters) - Mixed results from two late-stage studies testing Kala Pharmaceuticals Inc’s drug to provide temporary relief from dry eye disease cast doubt on the drug’s path forward and sent shares down 16 percent in early trading on Friday. \nThe trials met three out of four main goals, falling short of showing a statistically significant reduction in discomfort of the eye in one study. \n“The question is will the FDA accept this or make them do another trial before approval?” Wedbush analyst Liana Moussatos told Reuters, dubbing Kala’s first trial “the best results” for dry eye she’d seen in a late-stage study. \nThe company said it had no immediate discussions with the U.S. regulator and would need to conduct further analyses before determining a path forward. \nIf Kala’s drug, KPI-121, were to secure U.S. approval it would be the first treatment to provide rapid relief for acute, episodic dry eye flares. \nThe drug would face no real competition as approved treatments for dry eye such as Allergan Plc’s blockbuster Restasis and Shire Plc’s Xiidra are indicated for chronic patients with continuous symptoms of the disease, rather than flare-ups. \nDry eye is caused by either a lack of tears, or a “poor quality” of tears that cannot lubricate the surface of the eye, resulting in itching and inflammation. \nThe disease affects about 33 million people in the United States, the company said. \nMoussatos called KPI-121 a “clean drug” and pointed to the possibility of it gaining approval for use in severely affected patients, with an FDA-mandated requirement for a post-marketing trial. \nIf approved, the drug could rake in peak sales of $1.9 billion in 2027, she added. \nShares of the Waltham, Massachusetts-based drug developer slumped over 20 percent to about $14 before the bell, but are currently trading at $14.77. \nThe FDA is currently reviewing Kala’s Inveltys, a treatment for inflammation and pain in patients post eye surgery, and is expected to announce its decision by Aug. 24. Reporting by Manas Mishra and Tamara Mathias in Bengaluru; Editing by Martina D'Couto", "external_links": [], "published": "2018-01-05T14:54:00.000+02:00", "crawled": "2018-01-05T15:20:09.013+02:00", "highlightTitle": ""}