{"organizations": [], "uuid": "cc26b9aa831d4663140745ceb222b255821c46f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-chapter-iv-investors-sends-letter-to-board-of-antero-resources-corporation.html", "country": "US", "domain_rank": 767, "title": "Chapter IV Investors Sends Letter to Board of Antero Resources Corporation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:58:00.000+02:00", "replies_count": 0, "uuid": "cc26b9aa831d4663140745ceb222b255821c46f4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-chapter-iv-investors-sends-letter-to-board-of-antero-resources-corporation.html", "ord_in_thread": 0, "title": "Chapter IV Investors Sends Letter to Board of Antero Resources Corporation", "locations": [], "entities": {"persons": [{"name": "antero", "sentiment": "none"}], "locations": [{"name": "charlotte", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}], "organizations": [{"name": "board of antero resources corporation letter encourages antero’s board", "sentiment": "neutral"}, {"name": "antero midstream gp lp", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "antero midstream partners", "sentiment": "none"}, {"name": "board of directors of antero resources corporation", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "amgp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Letter Encourages Antero’s Board to Simplify Its Organizational Structure From Three Entities to Two Entities\nLetter Available at http://www.chapterivinvestors.com\nCHARLOTTE, N.C.--(BUSINESS WIRE)-- On January 24, 2018, Chapter IV Investors, LLC (“Chapter IV”), an investment firm, sent a letter to the Board of Directors of Antero Resources Corporation (“Antero”)(NYSE: AR) encouraging Antero’s Board to simplify its complex current organizational structure from three entities, including: (i) Antero, (ii) Antero Midstream Partners, LP (NYSE: AM) and (iii) Antero Midstream GP LP (NYSE: AMGP) into a two-entity (upstream and midstream) structure in 2018 with the GP-IDR (owned by AMGP) being eliminated. Chapter IV’s letter offers recommendations regarding possible transaction structures to accomplish such simplification and the process to effect such simplification. Chapter IV’s goals are to encourage (i) better alignment of various equity stakeholder interests, (ii) reduced potential for future conflicts of interest and (iii) “best-in-class” corporate governance across the Antero family of entities. In addition, Chapter IV hopes that its suggested organizational simplification will make Antero’s common stock a more attractive risk/reward proposition for investors and contribute to the long-term maximization of the value of Antero’s stock.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180125005591/en/\nThe letter can be downloaded at http://www.chapterivinvestors.com\nLetter to Antero’s Board\nThe full text of the letter is as follows:\nJanuary 24, 2018\nBoard of Directors\nAntero Resources Corporation\n1615 Wynkoop Street\nDenver, CO 80202\nGentlemen:\nAs you are aware, the “Antero family” of entities currently includes three distinct entities: Antero Resources Corporation (“Antero” or the “Company” or “AR”), Antero Midstream Partners (“AM”) and Antero Midstream GP LP (“AMGP”). In my opinion, such organizational structure is fundamentally too complex, and I believe it should be simplified into two entities (i.e. – an upstream entity and a midstream entity) in 2018 with the GP-IDR (owned by AMGP) being eliminated. My opinion stems in part from my recognition that master limited partnership (“MLP”) investors are increasingly demanding the elimination of GP (or GP-related) incentive distribution rights (“IDRs”), and MLP sponsors are increasingly choosing to pursue these simplifications. My opinion also stems from a different issue, namely my investment perspectives of Antero. More specifically, my investment firm, Chapter IV Investors (“Chapter IV”), previously invested in Antero due to my perception of the quality of its resource base. Regrettably, I felt compelled to exit such investment due to my concerns regarding the potential for conflicts of interest within the “Antero family.” As a portfolio manager, I decided that an investment in Antero simply presented an unacceptable risk for my investors.\nThis letter offers recommendations regarding possible transaction structures to accomplish an organizational simplification and the process to effect such simplification. My goals in writing this letter are to encourage (i) better alignment of various equity stakeholder interests, (ii) reduced potential for future conflicts of interest and (iii) “best-in-class” corporate governance across the “Antero family” of entities. In addition, I hope my efforts will lead to an “Antero family” simplification that makes Antero’s common stock a more attractive risk/reward proposition for investors resulting in the long-term maximization of the Company’s value.\nI will begin this letter with a few introductory and well-deserved compliments regarding the Antero management team. Such team:\n1) Has done an outstanding job of acquiring and developing Marcellus “Core” acreage in West Virginia.\n2) Has built an integrated business model, capitalizing on the arbitrage between midstream market values and midstream build-out costs.\n3) Deserves significant additional praise for (i) its foresight in developing an attractive long-term hedge book and (ii) delivering value back to Antero’s original private equity sponsors, led by Warburg Pincus and Yorktown Partners.\n4) Recently conducted an outstanding Analyst Day in terms of providing investors with a detailed look at the Company’s five-year development plan and its related impact on distributions to AM and AMGP investors over such time period.\nGiven the decline in AR’s stock price over the last 3+ years and AR’s stock price malaise immediately following the Company’s recent Analyst Day, something feels wrong to me. My hope is that the Company’s Board, its private equity sponsors (the “PE Sponsors”) and management will do the right thing to address the problem that I see.\nAntero’s Problem (as I See it)\nAs stated above, the organizational structure of the “Antero family” of entities is too complex. Over the past few years, many MLPs have addressed the complexity associated with their GP/LP structures and the related potential conflicts of interest associated with GP-IDRs. More MLPs are poised to do such GP/LP simplifications in 2018. I believe AR, AM and AMGP should simplify from a three-entity structure to a two-entity (upstream and midstream) structure with the GP-IDR (owned by AMGP) being eliminated. In writing this letter, I hope that AR management will offer their views on this issue and their related willingness to address this issue on the Company’s upcoming Q4, 2017 earnings conference call. Additionally, I hope that the Board and AR management will take action to address this problem in 2018.\nDoing the Right Thing (from My Perspective)\nI believe doing the right thing to address the complexity problem involves more than reducing Antero’s entities from three to two. It involves:\n(i) Choosing the right structure to accomplish such simplification.\n(ii) Choosing the right process to effect such simplification.\n(iii) The Company’s Board, PE Sponsors and management acting with the highest standards of integrity in connection with the simplification. This implies (i) acknowledging and fully embracing the inherent conflicts of interest in the current “Antero family” structure, (ii) acting in a manner to better align stakeholder interests and (iii) otherwise demonstrating “best-in-class” corporate governance.\nI explain my views on each of these topics below.\nChoosing the Right Structure\nAntero can explore various transactions to simplify, but from my perspective, the right answer involves selecting one of the following two approaches:\n(i) AMGP buying AM in a stock-for-units swap at some fair premium to AM’s market price, or\n(ii) AMGP buying AR in a stock-for-stock merger at some fair premium to AR’s market price (followed by a drop down of the IDR held by AMGP to AM in exchange for a fair number of new AM units).\nPersonally, I think this latter option is the best path because I believe this would maximize the alignment of AR “insiders” with all public investors, given that such transaction would result in (i) Warburg Pincus, Yorktown Partners, Paul Rady and Glen Warren all increasing their stakes in AR (on a tax-free basis) and (ii) AR increasing its stake in AM with no additional cash investment required.\nWhile, in theory, the acquirer and acquiree in the above mentioned transactions could be reversed, I personally believe that AMGP’s stock price is fundamentally overvalued relative to the publicly traded equity securities of AR and AM and, therefore, is the only “Antero family” entity that could provide a merger premium to another “Antero family” member. Importantly, any fair value swap among “Antero family” members needs to focus on the intrinsic value of each entity, which in my opinion, implies looking at the realistic long-term expected cash flows of each entity (e.g. – 20 years vs. 5 years).\nMy personal conclusion is that AM’s cash flows (and distributions to AM unitholders) will become increasingly challenged in years 6-20 (and have the potential for significant decline over such longer time frame). If my conclusion is correct, of course, the cash flows at AMGP (and the dividends to AMGP stockholders) have far greater vulnerability than those of AM, given the levered nature of GP-IDR cash flow at AMGP. This key issue is addressed further in the section entitled Managing Potential Conflicts That May Arise During the Simplification Process and in Appendix 1 (a very important component of this letter).\nIn making these recommendations, it should be noted that Chapter IV and all affiliates of Chapter IV currently own no securities of AR, AM or AMGP (i.e. – we are not long or short any of these securities). I came to these conclusions objectively given my 30+ year investment banking, private equity and capital markets’ experience and my firm’s acute focus on the Marcellus/Utica, including the “Antero family” of entities.\nChoosing the Right Process\nProcess is critically important to the resolution of Antero’s complexity problem; I cannot state this strongly enough. I believe that a fair process would be particularly important to the public shareholders of AR (i.e. – investors that own approximately 73% of AR’s common stock, but also investors that are represented by a Board still controlled by AR’s PE Sponsors and management).\nWhat does the right process mean to me? It means a process that is not unduly influenced by Antero’s PE Sponsors or management, who collectively own approximately 27% of AR’s common stock (per Antero’s 1/18/18 Analyst Day presentation). While this stake is significant (i.e. – worth about $2 billion), it should not be viewed as a sufficient check and balance against potential conflicts, in my opinion. The reason for this is that the economic interests of Antero’s PE Sponsors and management are different than those of AR’s public shareholders, given (i) such insiders’ much higher (i.e. – 68%) percentage ownership stake in AMGP (worth over $2 billion) and AMGP’s ownership of the IDRs associated with AM and (ii) the fact that AR’s “corporate returns” on its wells are not a particularly important driver of the quarterly distributions at AMGP. Given this structure, I recognize that value could be shifted from AR to AM, and then onto AMGP. It is the differing percentage ownership stakes of AR’s PE Sponsors and management in AMGP vs. AR that creates the potential for conflicts of interest.\nI encourage the independent directors of the Company to (i) form a committee (the “Independent Director Committee”) and (ii) engage independent investment bankers to advise it on the right structure and right pricing for a simplification of the “Antero family” of entities. To further ensure process fairness, two other safeguards feel necessary. The first is - any transaction that involves AR should be subject to the majority vote of AR’s public shareholders (i.e. – excluding AR’s PE Sponsors and management) and any transaction that involves AM should be the subject of a majority vote of AM’s public unitholders (i.e. – excluding AR). The second is - I would encourage the Independent Director Committee to reach out to several of AR’s largest unaffiliated shareholders (and AM’s largest unaffiliated unitholders) to solicit their views as to (i) an optimal two-entity structure and the (ii) the possible fair value pricing that they believe may be appropriate for achieving such structure. I would view such actions as good examples of “best-in-class” corporate governance.\nManaging Potential Conflicts That May Arise During the Simplification Process\nIn my opinion, AR has properly disclosed the existence of the potential for conflicts of interest within the “Antero family” of entities in all of its various SEC filings. Disclosure of potential conflicts does not solve conflicts, however. Accordingly, potential conflicts of interest of AR’s PE Sponsors and management have to be carefully evaluated and understood if Antero is going to get its simplification transaction structure and process right.\nSuch evaluation may (or may not) include looking at the fairness of the current gathering and water handling fees that AM charges AR (vs. the fees paid by other Marcellus producers). In my view, an analysis of the fair intrinsic value of AR, AM and AMGP should include looking at how a totally independent AR Board might want to allocate capital to AR drilling and completion activities over time (without regard to the potential adverse financial impact on AMGP). After all, the Board of AR owes no fiduciary duty to the shareholders of AMGP; rather the AR Board’s duties run to the shareholders of AR. Appendix 1 of this letter provides some important insight into the capital allocation issues (and related potential conflict of interest issues) that may lay ahead at AR.\nUnderstanding the “corporate level” returns of AR’s undrilled well inventory (at various commodity price levels) is critical to understanding how an independent AR should allocate capital (and is critical to the projection of all “Antero family” members’ future cash flow). In addition, a careful review of the “intrinsic value” of each Antero entity should include looking at the composition of AM’s cash flows (and, in particular, the fact that approximately one-third of AM’s current EBITDA is attributable to one-time water handling fees in connection with well completions vs. recurring (albeit declining) gathering fees over the life of a well). The materiality and nature of these one-time water handling fees is one of three differentiating (and collectively unique) characteristics of AM that must be understood by all “Antero family” entity directors and investors (as I believe that AM has no true MLP “comparable” in terms of its cash flow model). Appendix 1 elaborates further on the uniqueness of the “Antero family” structure.\nGiven the cash flow dynamics of water handling services (and, to a lesser extent, gathering services) to each well, I believe the independent directors of AR need to understand the potential for AM’s (and AMGP’s) distribution growth to slow and eventually decline if, and when, AR’s well completions flatten and eventually decline. I believe the independent directors of AR should also recognize that this may well occur (or arguably, should occur) if, and when, (i) AR’s “corporate level” returns do not possess a reasonable premium over AR’s cost of capital or (ii) U.S. natural gas supply/demand otherwise implies that AR should moderate its pace of well completions.\nFinal Observations\nAs certain members of AR’s management team know, Chapter IV has focused on the Marcellus and Utica for many years now. I recognize that the true “Core” of SW Appalachia is a uniquely valuable economic asset. At the same time, I recognize that shareholders of various SW Appalachia producers have suffered as certain producers have chased production growth for various reasons other than attractive “corporate level” returns. Rationales for such behavior include (i) HBP-ing acreage, (ii) creating IPO stories for private equity sponsors, (iii) meeting large (and, in certain cases, excessive) firm transportation pipeline takeaway obligations and/or (iv) propping up MLP distributions (and GP-IDRs). Chapter IV believes that it is time for any/all producers to put such behavior in the rearview mirror. While I am not suggesting that any of the above behavior is necessarily wrong or even applies to Antero, I believe 2018 is a good time for the AR Board to ensure the long run capital allocation integrity of AR , which could (at least hypothetically) suffer from the conflicts of interest associated with the PE Sponsors/AR management ownership stake in AMGP and their effective control of AR’s drilling and completion capital budget.\nA distinctly separate observation I have made relates to AR’s longer-term maximization of value via a possible future significant in-basin merger. AR’s management has noted that M&A consolidation in SW Appalachia makes sense. I agree. Indeed, I believe that 2018-2020 is a time for various SW Appalachia producers to consider further sensible consolidation as Chapter IV publicly encouraged EQT Corporation’s Board of Directors to pursue last January (which was shortly thereafter followed by EQT’s announcement of its highly synergistic acquisition of Rice Energy). In my opinion, AR could reasonably look at a 2019-2020 stock-for-stock business combination with either (i) Range Resources (“Range”) or (ii) EQT Corporation (“EQT”) or EQT’s E&P Division assuming such Division is split off from EQT’s Midstream operations as expected later this year.\nA combination of Antero and Range would create the dominant producer of natural gas liquids in the Appalachian Basin. Alternatively, a combination of Antero and EQT would create the dominant holder of West Virginia “Core” contiguous Marcellus acreage. As a current shareholder of both Range and EQT, I believe either merger option could be attractive, and I would be supportive of either merger if fair terms were involved. My personal belief, however, is that resolution of the “Antero family’s” structural problems would be a prerequisite to an AR negotiated merger with either company. While I can’t speak for Range’s or EQT’s Board, I doubt that such boards would agree to a merger transaction with AR if the potential for conflicts of interest within the “Antero family” had not been satisfactorily addressed. More specifically, such boards might reach a similar investment conclusion to mine (i.e. – that Antero’s potential conflicts are simply too risky). At the same time, I believe a future AR merger with Range or EQT may well be feasible if Antero simplifies and resolves the potential for conflicts of interest within its family of entities.\nBottom line – I believe an “Antero family” simplification transaction in 2018 would make Antero’s common stock a more attractive risk/reward proposition for investors and contribute to the long-term maximization of the value of Antero’s common stock (with or without some future merger). In addition, I believe such simplification would create a better opportunity for Antero to pursue a sensible, negotiated M&A transaction that could provide further value for Antero shareholders.\nIn conclusion, I believe the Board is at a critical juncture where it can choose (i) better alignment of various equity stakeholders’ interests, (ii) reduced potential for future conflicts of interest and (iii) “best-in-class” corporate governance across the “Antero family” of entities. I believe a wise choice will be applauded by Antero stockholders and maximize the long-term value of Antero’s common stock. Thank you for your consideration of my ideas.\nSincerely,\nW. Barnes Hauptfuhrer\nChief Executive Officer\nChapter IV Investors, LLC\nAppendix 1\nManaging Potential Conflicts of Interest That Could Arise with Respect to Antero Resources’ Capital Allocation\nThe Organizational Structure of the “Antero Family”\nUpstream Entity\n(73% Owned by Public)\nMidstream Entity\n(53% Owned by AR;\n47% Owned by Public)\nAn Entity with No Physical Assets\n(68% Owned by PE Sponsors and AR Management)\nAR\nAM\nAMGP\n• Invests capital to drill & complete (“D&C”) wells. • Provides gathering, processing and related services to AR (earns recurring revenues). • Owns the General Partner (“GP”) and the incentive distribution rights (“IDR”) of AM, providing it with up to 50% of AM’s incremental distributions to unitholders. • Provides water handling services to AR (earns short-term (i.e. – one-time) revenue from each well). • Invests no capital. • Invests capital to provide services Note: In general, midstream companies are often thought of as recurring revenue vehicles. In reality, however, MLP cash flow models differ in terms of the predictable and recurring nature of their revenues. MLP-related IDRs have typically been held, directly or indirectly, by a parent operating company who acts as the MLP’s GP and not owned by a separate entity, which is then majority-owned by an operating company’s management and PE Sponsors, as shown above. Such parent companies have adopted IDR mechanisms to capture a disproportionate share of the distributable cash flow of underlying MLPs. Increasingly, the public market has grown weary of the unaligned and mismatched economic incentives of GPs and LPs. Accordingly, incentive distribution rights are steadily being eliminated in the public marketplace.\nThe three features of the “Antero family” structure noted below are collectively unique:\n1) The GP-IDR is not controlled by an Operating Sponsor (spending dollars to enhance the value of such GP-IDR); it is separately controlled (and majority owned) by Antero’s initial private equity sponsors (“PE Sponsors”) and AR management.\n2) Despite AR being a publicly traded entity (~ 73% owned by public shareholders), AR’s PE Sponsors and AR management constitute a majority of the AR Board and effectively control AR’s capital allocation.\n3) The composition of AM’s cash flow model emanates from (i) gathering revenue (and emerging processing revenues), which represent a majority of AM’s EBITDA and reflect recurring (but declining) revenues per well, (ii) revenue tied to AM’s water handling services (which essentially reflect short-term, one-time fees per well that account for approximately one-third of AM’s EBITDA) and (iii) pipeline transmission-like recurring revenue (backed by long-term “take or pay” contracts), which accounts for a very small percentage of AM’s EBITDA.\nProtection of AR’s D&C Returns\nAR possesses an attractive five-year hedge book with significant (~ $1.3 billion) of value. This value exists irrespective of the number of wells drilled by AR (and could be monetized at any time). The hedge book provides AR with good protection against adverse natural gas prices over its life. Given the low F&D and LOE costs associated with Antero’s Core acreage, it largely locks in attractive AR well returns (on a fully hedged basis) over the next five years.\nFocus of this Appendix\nThe focus of this Appendix is to better understand (i) the possible “corporate returns” that might prevail at AR once AR’s five-year hedge book has rolled off and (ii) how potential conflicts of interest could interfere with optimal capital allocation at AR.\nUnderstanding the Potential Timetable of Antero’s “Tier 1” Inventory\nChapter IV’s definition of the “Tier 1” undrilled well inventory life of Antero Resources (“Antero”) is:\nUndrilled locations that possess a (i) fully midstream burdened Half-Cycle Wellhead IRR > 50% and (ii) a Corporate-Level IRR with a reasonable premium above the Company’s cost of capital divided by expected wells to be completed per year.\nUtilizing this definition, approximately 58% of Antero’s “high-grade” inventory reflects Tier 1 inventory based on Antero disclosures from its 1/18/18 Analyst Day presentation. For purposes of this Appendix, IRRs are based on Antero disclosures from its Analyst Day presentation and utilize Antero’s commodity pricing assumptions. The first page after this introduction is slide 26 from Antero’s Analyst Day presentation. It shows that 251 (or approximately 84%) of AR’s 300 expected well completions in 2018-2019 will come from Chapter IV’s definition of Tier 1 inventory. Based on our definition of Tier 1 wells, AR currently has 1,382 Tier 1 undrilled well locations (i.e. – its Marcellus-focused highly-rich gas condensate and highly-rich gas wells). Assuming AR paces its 2020-2022 completions at 160, 165 and 165 wells per year (per slide 11 of Antero’s presentation) and that 84% of these completions meet our definition of Tier 1 inventory, AR would have 719 undrilled Tier 1 locations remaining at the end of 2022. Assuming AR then holds completed Tier 1 wells flat at 165 per year post-2022 (and that 84% of those wells are Tier 1 wells), AR’s Tier 1 wells would be exhausted in approximately 10 years (or early 2028). The second page after this introduction is slide 12 from Antero’s Analyst Day presentation. It shows that when AR’s completions are substantially (i.e. ~ 84%) limited to its Tier 1 inventory (as they are expected to be in 2018-2019), AR’s corporate level returns are ~ 28%. The two slides together pose interesting questions:\nCertain Questions\n1) If AR’s 2018-2019 drilling program (comprised of mostly Tier 1 wells with Half-Cycle wellhead returns between 74%-168%) generates a corporate-level return of ~ 28%, what might the corporate level returns look like for AR’s “high-grade” inventory remaining after 2027?\n2) Stated alternatively, when AR’s second-tier inventory is eventually allocated a higher percentage of capital, will such second-tier wells provide AR shareholders with acceptable returns over AR’s cost of capital?\n3) Irrespective of the answer to (2) above, might a totally independent Antero Board suspend (or otherwise reduce) AR’s future D&C expenditures after 2022 (or 2027), thereby impairing the levered GP-IDR cash flow (and future dividends) to AMGP holders?\n4) If so, what does this imply about the long-term sustainability of AM’s and AMGP’s distributions and AM’s and AMGP’s related “intrinsic value?”\nAntero Analyst Day slides referenced as attached above may be accessed via Antero Resources' website or Chapter IV Investors’ website.\nAdditional Information\nThe views expressed in this press release represent the opinions of Chapter IV Investors, LLC and its affiliates (together, “Chapter IV”) and are based on publicly available information and assumptions that Chapter IV believes to be reasonable. There can be no assurance that the information Chapter IV considered is accurate or complete, nor can there be any assurance that its assumptions are correct. Chapter IV is not under any obligation to correct any inaccuracies in any such information or to provide any updated or additional information. This press release does not purport to be complete or comprehensive or constitute an agreement, offer, a solicitation of an offer, or any advice to any third party to enter into or conclude any transaction or take or refrain from taking any other course of action (whether on the terms presented herein or otherwise). Chapter IV has not sought, nor has it received, permission from any third-party to include information about them in this press release. Nothing in this press release should be viewed as indicating the support of any such third party of the views expressed in this press release. The information presented in this press release may not be relied upon by any person for any purpose and is not, and should not be construed as, investment, financial, legal, tax or other advice. This press release (which includes the materials appended to this press release) does not purport to be complete or comprehensive or constitute an agreement, offer, a solicitation of an offer, or any advice to any third party to enter into or conclude any transaction or take or refrain from taking any other course of action (whether on the terms presented herein or otherwise).\nThis press release contains “ .” Specific can be identified by the fact that they do not relate strictly to historical or current facts and include, without limitation, words such as “will,” “believes,” “suspects,” “opportunity,” “would,” “could” or the negative of such terms or other variations on such terms or comparable terminology. Statements that describe any potential transaction are forward-looking. Any are based on Chapter IV’s current intent, belief, expectations, estimates and projections. These statements are not guarantees of future performance and involve risks, uncertainties, assumptions and other factors that are difficult to predict and that could . Accordingly, no investor should rely upon as a prediction of actual results and actual results may vary materially from what is expressed in or indicated by the .\nAny representation, statement or opinion expressed or implied in this press release is provided in good faith but only on the basis that no reliance will be placed on its contents. Investors should obtain their own professional advice, conduct their own independent evaluation and make their own decisions with respect to the subject matter of this press release and the companies referred to in this press release. Chapter IV expressly disclaims any responsibility or liability for any loss howsoever arising from any use of or reliance on any of the information included in this press release or any of materials included in the referenced website as a whole or in part by any person.\nThe fund managed by Chapter IV currently has no beneficial ownership (long or short), and has no economic interest in, any securities of Antero Resources Corporation, Antero Midstream Partners LP and Antero Midstream GP LP. While Chapter IV’s fund is oriented toward long-term investing, it is in the business of trading, buying and selling securities. It is possible that there will be developments in the future (including changes in price of such securities) that cause such fund from time to time to buy one or more of these securities in open market transactions or otherwise (including via short sales), buy other securities (in open market or privately negotiated transactions or otherwise), or trade in options, puts, calls or other derivative instruments relating to some or all of such securities. To the extent that Chapter IV discloses information about any position or economic interest in these securities, it is subject to change and Chapter IV expressly disclaims any obligation to update such information.\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy any interests in any fund managed by Chapter IV.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005591/en/\nChapter IV Investors, LLC\nW. Barnes Hauptfuhrer, 704-644-4070\nSource: Chapter IV Investors, LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.chapterivinvestors.com%2Fmaterials&esheet=51748596&newsitemid=20180125005591&lan=en-US&anchor=http%3A%2F%2Fwww.chapterivinvestors.com&index=2&md5=a4a7e7f4ef09babaf434b1da0d910eb9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.chapterivinvestors.com&esheet=51748596&lan=en-US&anchor=http%3A%2F%2Fwww.chapterivinvestors.com&index=1&md5=7803eaf0fbc57ddfb7847b4379a2a200", "http://www.businesswire.com/news/home/20180125005591/en/"], "published": "2018-01-25T15:58:00.000+02:00", "crawled": "2018-01-25T17:34:25.028+02:00", "highlightTitle": ""}