{"organizations": [], "uuid": "246f541384575dbe4cfffd6ce230f50e68f1ff39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/16/104111784-IMG_8528-1.1910x1000.JPG", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/16/sam-zell-sees-irrational-exuberance-in-stocks-im-mostly-in-cash.html", "country": "US", "domain_rank": 767, "title": "Sam Zell sees 'irrational exuberance' in stocks: I'm mostly in cash", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-16T16:57:00.000+02:00", "replies_count": 0, "uuid": "246f541384575dbe4cfffd6ce230f50e68f1ff39"}, "author": "Matthew J. Belvedere", "url": "https://www.cnbc.com/2018/01/16/sam-zell-sees-irrational-exuberance-in-stocks-im-mostly-in-cash.html", "ord_in_thread": 0, "title": "Sam Zell sees 'irrational exuberance' in stocks: I'm mostly in cash", "locations": [], "entities": {"persons": [{"name": "sam zell", "sentiment": "negative"}, {"name": "zell", "sentiment": "none"}, {"name": "alan greenspan", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "equity group investments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "7 Hours Ago | 05:05 \nThe seemingly unstoppable rally that's pushed the stock market to record high after record high is based on emotions not fundamentals, billionaire investor Sam Zell told CNBC on Tuesday. \n\"I think the current situation seems like irrational exuberance,\" said the founder and chairman of the property specialist firm Equity Group Investments. Referring to \"irrational exuberance,\" he was echoing a warning that then-Federal Reserve Chairman Alan Greenspan famously issued in 1996 about the market environment. \nZell said on \"Squawk Box\" that tech stocks and other highflyers, which have been largely responsible for the rally, belie the rather tepid returns from \"average companies.\" \nAll assets, including stocks and property values, are too expensive, Zell said, adding he's mostly in cash. On the real estate side, he said he's been \"selling stuff.\" With a dearth of investment opportunities, he argued, the burden of holding cash is not as great as it would be otherwise. \nDespite his rather pessimistic comments, Zell said he does see a path to increased economic growth due to the tax reform and deregulation policies of President Donald Trump . \n\"I think the opportunity for the country to grow at 3 percent is real,\" but whether that happens remains to be seen, said Zell, who has described himself as socially liberal and fiscally conservative. \nEconomists in the latest CNBC/Moody's Analytics Survey upped their median fourth-quarter growth forecast on Friday by 0.4 to 3 percent. \nThat would make three-consecutive quarters of 3 percent growth, a goal of the White House. Trump critics remain skeptical on whether that type of economic activity can take hold long term. \nSince the Great Recession ended in the second quarter of 2009, the recovery has averaged 2.1 percent annual growth, according to the St. Louis Federal Reserve . \nGDP advances in the previous three expansions were more robust. From 1982 to 1990, annual growth averaged 4.2 percent; from 1991 to 2001, growth averaged 3.6 percent; and from 2001 to 2007, growth averaged 2.7 percent. Morning Squawk: CNBC's before the bell news roundup \nSign up to get Morning Squawk each weekday Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Submit", "external_links": ["https://www.stlouisfed.org/publications/regional-economist/july-2016/despite-weakness-economic-expansion-marks-seven-years"], "published": "2018-01-16T16:57:00.000+02:00", "crawled": "2018-01-16T16:08:08.000+02:00", "highlightTitle": ""}