{"organizations": [], "uuid": "4dbdf71834b6e063cadfcdf6420e19acf0be0e01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225575457&w=1200&r=LYNXMPEE0P17O", "site_section": "http://feeds.reuters.com/reuters/UKOddlyEnoughNews/", "section_title": "Reuters: Oddly Enough", "url": "https://uk.reuters.com/article/us-usa-mardigras-new-orleans/new-orleans-pulls-46-tons-of-mardi-gras-beads-from-storm-drains-idUKKBN1FF2KJ", "country": "US", "domain_rank": 408, "title": "New Orleans pulls 46 tons of Mardi Gras beads from storm drains", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T21:34:00.000+02:00", "replies_count": 0, "uuid": "4dbdf71834b6e063cadfcdf6420e19acf0be0e01"}, "author": "", "url": "https://uk.reuters.com/article/us-usa-mardigras-new-orleans/new-orleans-pulls-46-tons-of-mardi-gras-beads-from-storm-drains-idUKKBN1FF2KJ", "ord_in_thread": 0, "title": "New Orleans pulls 46 tons of Mardi Gras beads from storm drains", "locations": [], "entities": {"persons": [{"name": "gina cherelus", "sentiment": "none"}, {"name": "dani galloway", "sentiment": "none"}], "locations": [{"name": "new orleans", "sentiment": "none"}, {"name": "times-picayune", "sentiment": "none"}], "organizations": [{"name": "mardi gras", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "department of public works", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 7:28 PM / Updated 23 minutes ago New Orleans pulls 46 tons of Mardi Gras beads from storm drains Gina Cherelus 3 Min Read \n(Reuters) - The colorful beaded necklaces that are a signature of New Orleans’ annual Mardi Gras celebration have left the city known as “The Big Easy” with a big mess. \nNew Orleans city officials said on Thursday that more than 46 tons - or 93,000 pounds - of Carnival beads were among 7.2 million pounds of trash pulled from clogged catch basins along a five-block stretch of a downtown parade route, the Times-Picayune newspaper reported. \n“Once you hear a number like that, there’s no going back,” Dani Galloway, interim director of the city’s Department of Public Works, said during a news conference on Thursday. “So we’ve got to do better.” \nA representative from the city’s public works department did not immediately respond to a request for comment on Friday. \nThe removal was part of a four-month project in response to heavy flooding in the city in August, the newspaper reported. The effectiveness of the city’s drainage systems came under fire after an Aug. 5 storm dumped up to 6 inches (15 cm) of rain, causing street flooding and underpasses to fill up. FILE PHOTO: Revellers throw beads from a French Quarter balcony on Mardi Gras Day in New Orleans, Louisiana, U.S., March 4, 2014. REUTERS/Jonathan Bachman/File Photo \nThe clean-up effort between late September and late January cleared about 15,000 of the city’s estimated 68,000 storm drains, the newspaper reported. The Mardi Gras beads were found along the St. Charles Avenue parade route. \nMardi Gras is celebrated on Shrove Tuesday, the day before Ash Wednesday, which is the beginning of Lent, a period of reflection and abstinence on the Catholic calendar. \nBy tradition, Mardi Gras, which is French for “Fat Tuesday,” is a day that calls for excessive partying in preparation for the somber season of sacrifice to follow. \nMardi Gras falls on Feb. 13 this year. \nPartygoers are known to wear and toss beads - known as “throws” in New Orleans - from the streets and balconies in the French Quarter, Bourbon Street and other areas where partiers jostle through crowds. \nAt the news conference, Galloway asked residents to help clear catch basins and said the department was considering preventative methods, such as temporarily installing “gutter buddies” to keep the carnival beads from rolling down the drain. Reporting by Gina Cherelus in New York; editing by Colleen Jenkins and G Crosse", "external_links": [], "published": "2018-01-26T21:34:00.000+02:00", "crawled": "2018-01-26T21:58:13.012+02:00", "highlightTitle": ""}