{"organizations": [], "uuid": "a8040b950c3ce99f35e7676ecc9d8dd9b9d2090e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/california-mudslides-real-estate/fires-and-mudslides-have-some-rethinking-the-california-dream-idUSL1N1P62FB", "country": "US", "domain_rank": 408, "title": "Fires and mudslides have some rethinking the California dream", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T13:00:00.000+02:00", "replies_count": 0, "uuid": "a8040b950c3ce99f35e7676ecc9d8dd9b9d2090e"}, "author": "", "url": "https://www.reuters.com/article/california-mudslides-real-estate/fires-and-mudslides-have-some-rethinking-the-california-dream-idUSL1N1P62FB", "ord_in_thread": 0, "title": "Fires and mudslides have some rethinking the California dream", "locations": [], "entities": {"persons": [{"name": "alex dobuzinskis", "sentiment": "none"}, {"name": "hannah troy", "sentiment": "none"}, {"name": "troy", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "montecito", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "santa barbara county", "sentiment": "none"}, {"name": "long island", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "montecito", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "santa barbara", "sentiment": "none"}], "organizations": [{"name": "red cross", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 11:04 AM / Updated 44 minutes ago Fires and mudslides have some rethinking the California dream Alex Dobuzinskis 5 Min Read \nMONTECITO, Calif., Jan 12 (Reuters) - A few who live amid the usually serene beauty and year-round warmth of Santa Barbara County say nature’s recent onslaughts of wildfires and mudslides have dampened their California dreams. \nFor Hannah Troy, the twin blows of the Thomas Fire, which scorched parts of Santa Barbara last month in the biggest wildfire in the state’s history, and this week’s deadly mudslides only deepened her unease about the landscapes around her. \n“California to me feels like it’s just becoming a flourishing tinderbox,” Troy said at a Red Cross shelter at a college in Santa Barbara, a wealthy city a couple hour’s drive up the Pacific coast from Los Angeles. \nTroy, a legal worker in her 50s, was born in New York’s Long Island but moved as a child with her parents to Los Angeles. In 2006, she moved to the Montecito area to live with her sister and brother-in-law on a half-acre property, which survived this week with only some uprooted fences. \n“California is not my favorite place, it never has been,” she said, lamenting the state’s drought and fires and citing Oregon and Canada’s British Columbia as places she would rather live. \nAs the Thomas Fire crept slowly west toward them, Mark Drost, his wife, Zefea Samson, and their two children, Indira, 7, and Ravi, 4, left behind their Montecito rental and moved to Kailua, Hawaii. \nDrost and Samson lead yoga teacher training courses in Hawaii, Florida, New York, Bali and Costa Rica, but the plan for now is to stay in Hawaii for at least six months. \n“For me, it was protection of my family and livelihood,” Drost said by telephone. “So many people want to live in California, but it comes with these huge risks.” \nThe family still loves Santa Barbara County, and will start reassessing whether to move back in the coming months. \n“I‘M IN PARADISE” \nBut for any who have doubts about California as home, there are many more staying put. Local realtors said most people factor in nature’s terrifying fury as a cost of living in an archetypal Californian landscape of sandy beaches and forested mountains. \n“We didn’t see an uptick in sales, we didn’t see a downtick in sales, things just kind of maintained,” Bob Hart, executive officer of the Santa Barbara Association of Realtors, said of the impact of previous natural disasters. “But we never ever had anything this devastating.” \nNevertheless, he was not expecting an exodus. “I‘m looking out the window right now and I‘m in paradise,” Hart said by telephone, describing his view a few miles (km) down the road from the devastation in Montecito. \nRenee Grubb, a realtor in Montecito, said her inbox was filling up with emails from neighbors seeking a place to rent in town while they clean up or rebuild. \n“For most of the people, if you can afford to live in Montecito, you’re going to have great insurance and you’re going to rebuild,” she said by phone. \nAfter previous devastating fires, a few older residents might move from the canyons down to the relatively unperturbed beach-side parts of Santa Barbara, Grubb said. But Montecito’s wealthier residents tended to own multi-acre tracts and were not inclined to give up on their million-dollar views, she said. \nGarrett Speirs, a 54-year-old artist, has been living in Montecito for 20 years. He had to evacuate for the Thomas fire, and the wall of mud came up to his back door, but his family’s 19th-century house was spared further damage. \n“The hiking is amazing here, the beaches, Santa Barbara’s got it all but it’s a little bit of a dangerous element too,” he said. Nevertheless, Speirs said he would stay put. \nPsychologist Betsy Bates Freed and her husband, novelist David Freed, have evacuated twice in the past two months. \nJust days after cleaning the last of the ash from the Thomas fire out of their canyon property near Carpinteria, the couple were again packing a suitcase and grabbing their dog for what is turning out to be another extended stay away from home. \nBut they have no plans to leave the area. “No, no,” said Bates Freed, 59. “We love the canyon. It’s just that being in a serene and beautiful place comes with risks.” Reporting by Alex Dobuzinskis in Montecito, Calif., and Jonathan Allen in New York; Additional reporting by Suzannah Gonzales in Chicago and Sharon Bernstein in Sacramento, Calif.; Editing by Daniel Wallis", "external_links": [], "published": "2018-01-12T13:00:00.000+02:00", "crawled": "2018-01-12T13:52:52.000+02:00", "highlightTitle": ""}