{"organizations": [], "uuid": "230bf96116777b394540af55a5957798ea1beb4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-state-street-reports-fourth-quarter-2017-gaap-basis-eps-of-0-point-89-roe-of-6-point-9-percent-and-revenue-of-2-point-8.html", "country": "US", "domain_rank": 767, "title": "State Street Reports Fourth-Quarter 2017 GAAP-Basis EPS of $0.89, ROE of 6.9% and Revenue of $2.8 Billion; Includes One-Time Net Cost of $270 Million or -$0.72 Per Share Related to Tax Reform (1)", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T15:00:00.000+02:00", "replies_count": 0, "uuid": "230bf96116777b394540af55a5957798ea1beb4a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-state-street-reports-fourth-quarter-2017-gaap-basis-eps-of-0-point-89-roe-of-6-point-9-percent-and-revenue-of-2-point-8.html", "ord_in_thread": 0, "title": "State Street Reports Fourth-Quarter 2017 GAAP-Basis EPS of $0.89, ROE of 6.9% and Revenue of $2.8 Billion; Includes One-Time Net Cost of $270 Million or -$0.72 Per Share Related to Tax Reform (1)", "locations": [], "entities": {"persons": [{"name": "joseph l. hooley", "sentiment": "none"}], "locations": [{"name": "beacon", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "months ahead of schedule assets", "sentiment": "none"}, {"name": "state street", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "4Q17 Operating-Basis Results Include EPS of $1.83, ROE of 14.1%, and Revenue of $3.0 Billion\nExpects Beacon Target Savings of $550 Million to Be Realized by Mid-2019, 18 Months Ahead of Schedule\nAssets under Custody and Administration of $33.1 Trillion and Assets under Management of $2.8 Trillion, Reached Record Levels at Year-End\nAchieved Previously Announced 2017 Financial Objectives (2)\nBOSTON--(BUSINESS WIRE)-- In announcing today’s financial results, Joseph L. Hooley, State Street’s Chairman and Chief Executive Officer, said, \"Our full-year 2017 results reflect strength across our asset servicing and asset management businesses, with record levels of assets under custody and administration and assets under management, and importantly, achievement of our 2017 financial objectives. We also made significant progress with our Beacon program, achieving benefits for our clients while also realizing $150 million in savings. I am pleased that we have already exceeded our Beacon target to achieve an operating-basis pre-tax margin of 31% by 2018, and generated 210 basis points of positive fee operating leverage in 2017.\"\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180123005773/en/\n(1) The effects of the TCJA described in this News Release are estimates. Actual effects of the TCJA may differ from these estimates, among other things, due to additional tax and regulatory guidance and changes in State Street assumptions and interpretations.\n(2) Operating-basis 2017 financial objectives (relative to 2016) consist of: revenue growth of 4-6%; positive fee operating leverage of 100-200 basis points; a 4-6% increase of NII; and a reduction in average interest earning assets of 0-5%.\nHooley added, \"Our strong fourth-quarter results included a 7% increase in servicing fees from the year-ago quarter. Excluding the impact related to the recent tax law changes, we achieved double-digit EPS growth as well as an increase in return on equity. We continue to benefit from our strong market position and our ability to deliver servicing solutions evidenced by the approximately $445 billion of new servicing commitments in the fourth quarter. Our business is well-positioned for growth in 2018 including the further advancement and benefits from Beacon. We now expect to realize Beacon's financial objectives by the middle of 2019.\"\nHooley concluded, \"We’ve maintained a strong capital position, enabling significant return of capital to shareholders. In 4Q17, we purchased approximately $350 million of our common stock and declared a quarterly common stock dividend of $0.42 per share.\"\n4Q17 Highlights\nSelected Results: GAAP-basis (a) (Dollars in millions, except per share data, or where otherwise noted)\n4Q16 GAAP-basis Financial Results\n4Q17 GAAP-basis Financial Results\n% change ex notable items\nAs reported\n4Q16 notable items\n4Q16 ex notable items\nAs reported\nTax law change impact\n4Q17 notable items\nDiluted earnings per share $ 1.43 $ 0.13 $ 1.30 $ 0.89 $ (0.72 ) $ 1.61 24 % Return on average common equity 12.1 % 1.1 % pts 11.0 % 6.9 % (5.5 )% pts 12.4 % 1.4 % pts Total revenue $ 2,530 $ — $ 2,530 $ 2,846 $ (20 ) $ 2,866 13 % Fee revenue 2,014 — 2,014 2,230 (18 ) 2,248 12 % Total expenses 2,183 249 1,934 2,131 — 2,131 10 % Pre-tax operating margin 13.6 % (9.9 )% pts 23.5 % 25.2 % (0.5 )% pts 25.7 % 2.2 % pts Fee Operating Leverage 1.4 % pts Selected Results: Operating-basis (a) (Dollars in millions, except per share data, or where otherwise noted)\n4Q16 Operating-basis Financial Results\n4Q17 Operating-basis Financial Results As reported\n% change ex notable items (Operating-basis)\nAs reported\n4Q16\nnotable items\n4Q16 ex notable items\nDiluted earnings per share $ 1.48 $ 0.13 $ 1.35 $ 1.83 36 % Return on average common equity 12.5 % 1.1 % pts 11.4 % 14.1 % 2.7 % pts Total revenue $ 2,749 — $ 2,749 $ 2,984 9 % Fee revenue 2,200 — 2,200 2,326 6 % Total expenses 2,143 249 1,894 1,998 5 % Pre-tax operating margin 22.0 % (9.0 )% pts 31.0 % 33.1 % 2.1 % pts Fee Operating Leverage 0.2 % pts (a) Notable items referenced in the above GAAP-basis table consist of: 4Q17 estimated one-time net costs of $270 million (-$0.72 per share) related to tax reform of which $250 million is recorded in tax expense and $20 million is recorded as a reduction in revenue; and, in 4Q16, a tax benefit of $211 million ($0.54 per share) and an acceleration of compensation expense of $249 million pre-tax, $161 million after-tax (-$0.41 per share) for a combined net benefit of $0.13 per share. Notable items referenced in the above operating-basis table consist of the foregoing referenced 4Q16 tax benefit ($211 million, or $0.54 per share) and acceleration of compensation expense ($249 million pre-tax, $161 million after-tax, or -$0.41 per share). Our presentation of financial results excluding notable items, as well as our presentation of operating-basis financial results generally, are non-GAAP presentations. The final impact of the recently enacted tax reform, may differ from these estimates due to additional guidance from the taxing authorities and changes in State Street assumptions and interpretations. Refer to the addendum to this News Release for explanations of our non-GAAP financial measures and related reconciliations. AUCA/AUM\nBroad-based business momentum: Record asset servicing AUCA at 4Q17 quarter-end increased 15% from 4Q16 quarter-end due to strength in equity markets, flows, and new business. Record asset management AUM at 4Q17 quarter-end, increased 13% compared to 4Q16 quarter-end, driven by strength in equity markets. New business: New asset servicing mandates during 4Q17 totaled approximately $445 billion. Servicing assets remaining to be installed in future periods totaled approximately $350 billion at quarter-end. In our asset management business, we experienced net inflows of $6 billion during 4Q17.\nRevenue\nFee revenue: Increased in 4Q17 from 4Q16, primarily driven by strength in servicing fees, management fees, securities finance revenue, and the impact of the weaker U.S. dollar, partially offset by lower trading services revenue. Servicing and management fees: Benefiting from higher global equity markets and new business, 4Q17 servicing and management fees increased 7% and 16%, respectively, compared to 4Q16. Net interest income: Increased in 4Q17 from 4Q16, driven by higher market interest rates in the U.S., disciplined liability pricing, and loan portfolio growth, partially offset by a smaller balance sheet.\nExpenses\nExpenses: 4Q16 expenses included $249 million related to the acceleration of compensation expense. Excluding the 4Q16 acceleration of compensation expense, 4Q17 operating-basis expenses increased compared to 4Q16 due to investments to support new business, annual merit increases and performance-based incentives and the impact of the weaker U.S. dollar, partially offset by Beacon savings. Fee operating leverage: Excluding the acceleration of compensation expense, compared to 4Q16, achieved 24 basis points of positive fee operating leverage.\nBeacon\nSolutions and services : Beacon initiatives continue to enhance product development and deliver value-added benefits to clients. Automations and efficiencies : We now expect to realize the previously announced Beacon target savings of $550 million by the middle of 2019, 18 months early. In 2017, we realized $150 million in pre-tax savings toward that goal, including $50 million in 4Q17. GAAP-basis 4Q17: Results included $133 million, $87 million after-tax ( $0.23 per share), in restructuring expenses related to our previously announced Beacon goals.\nTax Law Impact (a)\nTax reform: 4Q17 includes a one-time estimated net impact of $270 million associated with the Tax Cuts and Jobs Act (TCJA). Estimated tax expense of approximately $250 million primarily consisting of a one-time repatriation tax of $454 million, partially offset by a reduction in deferred tax liabilities of $197 million. A one-time reduction of approximately $20 million in revenue, primarily within processing fees and other revenue, due to accelerated amortization expense associated with tax-advantaged investments. A decrease in the 4Q17 common equity tier 1 ratio and supplementary leverage ratio of approximately 30 basis points and 15 basis points, respectively.\nCapital\nKey metrics: Relative to 4Q16, the estimated Basel III common equity tier 1 ratio for 4Q17 was 11.9% and our estimated leverage ratio was 7.3%; up 30 basis points and 80 basis points, respectively.\n(a) The effects of the TCJA described in this News Release are estimates. Actual effects of the TCJA may differ from these estimates, among other things, due to additional tax and regulatory guidance and changes in State Street assumptions and interpretations.\n4Q17 GAAP-Basis Results\n(Table presents summary results, dollars in millions, except per share amounts, or where otherwise noted) 4Q17 3Q17 Increase (Decrease) 4Q16 Increase (Decrease) Total fee revenue $ 2,230 $ 2,242 (0.5 )% $ 2,014 10.7 % Net interest income 616 603 2.2 514 19.8 Total revenue 2,846 2,846 — 2,530 12.5 Provision for loan losses (2 ) 3 nm 2 nm Total expenses 2,131 2,021 5.4 2,183 (2.4 ) Net income available to common shareholders 334 629 (46.9 ) 557 (40.0 ) Earnings per common share: Diluted earnings per share 0.89 1.66 (46.4 ) 1.43 (37.8 ) Financial ratios : Quarterly average total assets 216,348 218,369 (0.9 ) 232,999 (7.1 ) Fee operating leverage (1) (598 ) bps 1,310 bps Operating leverage (1) (544 ) 1,487 Return on average common equity 6.9 % 13.0 % (610 ) 12.1 % (520 ) Return on tangible common equity (2) 16.7 18.0 (130 ) 17.7 (100 ) Pre-tax operating margin 25.2 28.9 (370 ) 13.6 1,160 (1) The financial ratio represents the rate of growth of total revenue (or fee revenue) less the rate of growth of expenses relative to the preceding or prior year period, as applicable.\n(2) Return on tangible common equity is calculated by dividing year-to-date annualized net income available to common shareholders (GAAP-basis) by tangible common equity. For additional information on the Reconciliation of Tangible Common Equity Ratio refer to the addendum included with this News Release.\nnm Not meaningful\n4Q17 Operating-Basis (Non-GAAP) Results\n(Table presents summary results, dollars in millions, except per share amounts, or where otherwise noted) 4Q17 3Q17 Increase (Decrease) 4Q16 Increase (Decrease) Total fee revenue (1) $ 2,326 $ 2,321 0.2 % $ 2,200 5.7 % Net interest income (2) 658 645 2.0 547 20.3 Total revenue (2) 2,984 2,967 0.6 2,749 8.5 Provision for loan losses (2 ) 3 nm 2 nm Total expenses 1,998 1,988 0.5 2,143 (6.8 ) Net income available to common shareholders 687 648 6.0 577 19.1 Earnings per common share: Diluted earnings per share 1.83 1.71 7.0 1.48 23.6 Financial ratios : Fee operating leverage (3) (28 ) bps 1,250 bps Operating leverage (3) 7 1,532 Return on average common equity 14.1 % 13.4 % 70 12.5 % 160 Return on tangible common equity (4) 20.4 19.0 140 18.8 160 Pre-tax operating margin 33.1 32.9 20 22.0 1,110 (1) Beginning with the first quarter of 2017, operating-basis results reflect gains/losses on sales of businesses. The third quarter of 2017 operating-basis results include a pre-tax gain of approximately $26 million on the sale of an alternative trading system.\n(2) Beginning in 1Q17, management no longer presents discount accretion associated with former conduit securities as an operating-basis adjustment. Therefore, 4Q17 and 3Q17 GAAP and operating-basis results both included $4 million of discount accretion. In 4Q16, operating-basis NII excluded $10 million of discount accretion, and such results have not been revised.\n(3) See footnote 1 in the 4Q17 GAAP-Basis Results table above.\n(4) Return on tangible common equity is calculated by dividing year-to-date annualized net income available to common shareholders (operating-basis) by tangible common equity. For additional information on the Reconciliation of Tangible Common Equity Ratio refer to the addendum included with this News Release.\nnm Not meaningful\nOperating-Basis (Non-GAAP) Financial Measures\nIn addition to presenting State Street's financial results in conformity with U.S. generally accepted accounting principles, or GAAP, management has also historically (and in this News Release) presented results on a non-GAAP, or operating-basis. Management believed this presentation would support additional meaningful analysis and comparisons of trends with respect to State Street's business operations from period to period. Management may also provide, as appropriate (and in this News Release has provided) additional non-GAAP measures, including capital ratios calculated under regulatory standards scheduled to be effective in the future or other standards, that management also uses in evaluating State Street’s business and activities. Non-GAAP financial measures should be considered in addition to, and not as a substitute for or superior to, financial measures determined in conformity with GAAP. Summary results presented on a GAAP-basis, descriptions of our non-GAAP financial measures and reconciliations of non-GAAP information to GAAP-basis information are provided in the addendum included with this News Release.\nThe following table reconciles select 4Q17 operating-basis financial information to financial information prepared and reported in conformity with GAAP for the same period. The addendum included with this News Release includes additional reconciliations.\n4Q17 Selected Operating-Basis (Non-GAAP) Reconciliations\n(In millions, except per share amounts) Income Before Income Tax Expense Net Income Available to Common Shareholders Earnings Per\nCommon Share\nGAAP-basis $ 717 $ 334 $ .89 Tax-equivalent non-operating adjustments Tax-advantaged investments (processing fees and other revenue) 78 Tax-exempt investment securities (net interest income) 40 Total 118 Other non-operating adjustments Restructuring costs (expenses) (1) 133 87 .23 Effect on income tax of non-operating adjustments — (4 ) (.01 ) Impact of tax legislation 20 270 .72 Total 153 353 .94 Operating-basis $ 988 $ 687 $ 1.83 (1) Represents a pre-tax charge of $133 million ($87 million after tax or $.23 per share) related to Beacon.\nSelected Financial Information and Metrics\nThe tables below provide a summary of selected financial information and key ratios for the indicated periods.\nThe following table presents AUCA, AUM, market indices and average foreign exchange rates for the periods indicated.\n(Dollars in billions, except market indices and foreign exchange rates) 4Q17 3Q17 Increase (Decrease) 4Q16 Increase (Decrease) Assets under custody and administration (1)(2) $ 33,119 $ 32,110 3.1 % $ 28,771 15.1 % Assets under management (2) 2,782 2,673 4.1 2,468 12.7 Market Indices (3) : S&P 500 ® daily average 2,603 2,467 5.5 2,185 19.1 MSCI EAFE ® daily average 2,005 1,934 3.7 1,660 20.8 MSCI ® Emerging Markets daily average 1,125 1,068 5.3 877 28.3 HFRI Asset Weighted Composite ® monthly average 1,386 1,358 2.1 1,292 7.3 Barclays Capital U.S. Aggregate Bond Index ® period-end 2,046 2,038 0.4 1,976 3.5 Barclays Capital Global Aggregate Bond Index ® period-end 485 480 1.0 451 7.5 Average Foreign Exchange Rate (Euro vs. USD) 1.178 1.175 0.3 1.078 9.3 Average Foreign Exchange Rate (GBP vs. USD) 1.328 1.309 1.5 1.242 6.9 (1) Includes assets under custody of $25,020 billion, $24,240 billion and $21,725 billion, as of 4Q17, 3Q17, and 4Q16, respectively.\n(2) As of period-end.\n(3) The index names listed in the table are service marks of their respective owners.\nAssets Under Management\nThe following table presents 4Q17 activity in AUM by product category.\n(Dollars in billions) Equity Fixed-Income Cash (2) Multi-Asset-Class Solutions Alternative Investments (3) Total Balance as of September 30, 2017 $ 1,640 $ 399 $ 347 $ 134 $ 153 $ 2,673 Long-term institutional inflows (1) 89 28 — 27 3 147 Long-term institutional outflows (1) (102 ) (19 ) — (19 ) (8 ) (148 ) Long-term institutional flows, net (13 ) 9 — 8 (5 ) (1 ) ETF flows, net 26 3 — — (1 ) 28 Cash fund flows, net — — (21 ) — — (21 ) Total flows, net 13 12 (21 ) 8 (6 ) 6 Market appreciation 90 2 4 5 (1 ) 100 Foreign exchange impact 2 1 — — — 3 Total market/foreign exchange impact 92 3 4 5 (1 ) 103 Balance as of December 31, 2017 $ 1,745 $ 414 $ 330 $ 147 $ 146 $ 2,782 (1) Amounts represent long-term portfolios, excluding ETFs.\n(2) Includes both floating and constant-net-asset-value portfolios held in commingled structures or separate accounts.\n(3) Includes real estate investment trusts, currency and commodities, including SPDR ® Gold Shares ETF and SPDR ® Long Dollar Gold Trust ETF. State Street is not the investment manager for the SPDR ® Gold Shares ETF and the SPDR ® Long Dollar Gold Trust ETF, but acts as the marketing agent.\nThe following table presents 2017 activity for the year ended December 31, 2017 in AUM by product category.\n(Dollars in billions) Equity Fixed-Income Cash (2) Multi-Asset-Class Solutions Alternative Investments (3) Total Balance as of December 31, 2016 $ 1,474 $ 378 $ 333 $ 126 $ 157 $ 2,468 Long-term institutional inflows (1) 271 93 — 57 19 440 Long-term institutional outflows (1) (344 ) (92 ) — (52 ) (40 ) (528 ) Long-term institutional flows, net (73 ) 1 — 5 (21 ) (88 ) ETF flows, net 25 11 — — 2 38 Cash fund flows, net — — (8 ) — — (8 ) Total flows, net (48 ) 12 (8 ) 5 (19 ) (58 ) Market appreciation 293 14 2 11 3 323 Foreign exchange impact 26 10 3 5 5 49 Total market/foreign exchange impact 319 24 5 16 8 372 Balance as of December 31, 2017 $ 1,745 $ 414 $ 330 $ 147 $ 146 $ 2,782 (1) Amounts represent long-term portfolios, excluding ETFs.\n(2) Includes both floating and constant-net-asset-value portfolios held in commingled structures or separate accounts.\n(3) Includes real estate investment trusts, currency and commodities, including SPDR ® Gold Shares ETF and SPDR ® Long Dollar Gold Trust ETF. State Street is not the investment manager for the SPDR ® Gold Shares ETF and the SPDR ® Long Dollar Gold Trust ETF, but acts as the marketing agent.\nRevenue\nThe following tables provide the components of our GAAP-basis and operating-basis revenue for the periods noted.\nGAAP-Basis Revenue\n(Dollars in millions) 4Q17 3Q17 Increase (Decrease) 4Q16 Increase (Decrease) Servicing fees $ 1,379 $ 1,351 2.1 % $ 1,289 7.0 % Management fees 418 419 (0.2 ) 361 15.8 Trading services revenue: Foreign exchange trading 149 150 (0.7 ) 182 (18.1 ) Brokerage and other fees 99 109 (9.2 ) 111 (10.8 ) Total trading services revenue 248 259 (4.2 ) 293 (15.4 ) Securities finance revenue 147 147 — 136 8.1 Processing fees and other revenue 38 66 (42.4 ) (65 ) nm Total fee revenue 2,230 2,242 (0.5 ) 2,014 10.7 Net interest income 616 603 2.2 514 19.8 Gains (losses) related to investment securities, net — 1 nm 2 nm Total Revenue $ 2,846 $ 2,846 — $ 2,530 12.5 Net interest margin 1.38 % 1.35 % 3 bps 1.09 % 29 bps nm Not meaningful\nOperating-Basis (Non-GAAP) Revenue\n(Dollars in millions) 4Q17 3Q17 Increase (Decrease) 4Q16 Increase (Decrease) Servicing fees $ 1,379 $ 1,351 2.1 % $ 1,289 7.0 % Management fees 418 419 (0.2 ) 361 15.8 Trading services revenue: Foreign exchange trading 149 150 (0.7 ) 182 (18.1 ) Brokerage and other fees 99 109 (9.2 ) 111 (10.8 ) Total trading services revenue 248 259 (4.2 ) 293 (15.4 ) Securities finance revenue 147 147 — 136 8.1 Processing fees and other revenue 134 145 (7.6 ) 121 10.7 Total fee revenue (1) 2,326 2,321 0.2 2,200 5.7 Net interest income (2) 658 645 2.0 547 20.3 Gains (losses) related to investment securities, net — 1 nm 2 nm Total Revenue (2) $ 2,984 $ 2,967 0.6 $ 2,749 8.5 Net interest margin 1.38 % 1.35 % 4 bps 1.08 % 31 bps (1) Beginning with the first quarter of 2017, operating-basis results reflect gains/losses on sales of businesses. The third quarter of 2017 operating-basis results include a pre-tax gain of approximately $26 million on the sale of an alternative trading system.\n(2) Beginning in 1Q17, management no longer presents discount accretion associated with former conduit securities as an operating-basis adjustment. Therefore, 4Q17 and 3Q17 GAAP and operating-basis results both included $4 million of discount accretion. In 4Q16, operating-basis NII excluded $10 million of discount accretion, and such results have not been revised.\nnm Not meaningful\nThe following highlights primary drivers of changes in our 4Q17 revenue for the noted periods, indicating differences between our GAAP-basis and operating-basis results as appropriate.\nServicing fees increased from 4Q16, primarily due to higher global equity markets, new business and the impact of the weaker U.S. dollar, partially offset by modest hedge fund outflows. Compared to 3Q17, servicing fees increased, primarily due to the impact of higher global equity markets and net new business.\nManagement fees increased from 4Q16, primarily due to higher global equity markets and higher revenue yielding ETF inflows. Compared to 3Q17, management fees were down slightly.\nTrading Services revenue decreased from 4Q16, as strong client volumes were offset by lower foreign exchange volatility, as well as the modest impact of the businesses we exited in 2017. Compared to 3Q17, trading services revenue decreased slightly primarily due to the modest impact of the businesses we exited in 2017.\nSecurities finance revenue increased from 4Q16, reflecting higher client volumes from the agency and enhanced custody businesses, partially offset by spread compression. Compared to 3Q17, securities finance revenue was flat.\nProcessing fees and other revenue on a GAAP-basis increased from 4Q16, primarily due to lower amortization related to tax-advantaged investments. Compared to 3Q17, processing fees and other revenue on a GAAP-basis decreased, reflecting higher amortization expense associated with tax-advantaged investments related to the recently enacted tax law and the impact of a gain related to the sale of an equity trading platform in 3Q17.\nProcessing fees and other revenue increased from 4Q16, reflecting favorable valuation adjustments, partially offset by lower revenue related to tax-advantaged investments. Compared to 3Q17, processing fees and other revenue decreased, primarily reflecting a gain related to the sale of an equity trading platform in 3Q17.\nNet interest income increased from 4Q16, primarily due to higher U.S. market interest rates, disciplined liability pricing, and loan portfolio growth, partially offset by a smaller balance sheet. Compared to 3Q17, NII increased primarily due to central bank rate hikes and a shift toward higher yielding interest earning assets, partially offset by a smaller balance sheet. GAAP-basis NII does not include a taxable-equivalent adjustment for tax-exempt investment securities. Net interest margin, calculated on an operating-basis, increased 31 basis points compared to 4Q16, and increased 4 basis points compared to 3Q17.\nExpenses\nThe following tables provide the components of our GAAP-basis and operating-basis expenses for the periods noted.\nGAAP-Basis Expenses\n(Dollars in millions) 4Q17 3Q17 Increase (Decrease) 4Q16 Increase (Decrease) Compensation and employee benefits $ 1,067 $ 1,090 (2.1 )% $ 1,244 (14.2 )% Information systems and communications 301 296 1.7 278 8.3 Transaction processing services 219 215 1.9 199 10.1 Occupancy 117 118 (0.8 ) 109 7.3 Acquisition and restructuring costs (1) 133 33 303.0 43 209.3 Other 294 269 9.3 310 (5.2 ) Total Expenses $ 2,131 $ 2,021 5.4 $ 2,183 (2.4 ) Effective income tax rate (2) 48.4 % 16.7 % (72.3 )% (1) The 4Q16 acquisition costs associated with the GEAM business acquired on July 1, 2016 was $25 million. In 4Q17, 3Q17 and 4Q16, the restructuring costs associated with Beacon were $133 million, $33 million and $22 million, respectively.\n(2) As a result of the enactment of the Tax Cuts and Jobs Act, the fourth-quarter of 2017 included a one-time estimated net cost of $270 million. The fourth-quarter of 2016 reflected a one-time benefit of $211 million. The impact of each of these items on the GAAP-basis effective tax rate for the fourth-quarter of 2017 and 2016 was 13.2% and 8.5%, respectively.\nOperating-Basis (Non-GAAP) Expenses\n(Dollars in millions) 4Q17 3Q17 Increase (Decrease) 4Q16 Increase (Decrease) Compensation and employee benefits (1) $ 1,067 $ 1,090 (2.1 )% $ 1,246 (14.4 )% Information systems and communications 301 296 1.7 278 8.3 Transaction processing services 219 215 1.9 199 10.1 Occupancy 117 118 (0.8 ) 109 7.3 Other 294 269 9.3 311 (5.5 ) Total Expenses $ 1,998 $ 1,988 0.5 $ 2,143 (6.8 ) Effective income tax rate 26.8 % 27.9 % (1.5 )% (1) Compensation and employee benefits includes $249 million of accelerated compensation expense (-$0.41 per share) for the fourth quarter of 2016.\nThe following highlights primary drivers of changes in our 4Q17 expenses for the noted periods, indicating differences between our GAAP-basis and operating-basis results as appropriate.\nCompensation and employee benefits expenses decreased from 4Q16, primarily due to $249 million related to the acceleration of compensation expense in 4Q16 and Beacon-related savings, partially offset by increased costs to support new business, annual merit and performance-based incentive compensation increases, and the impact of the weaker U.S. dollar. Compared to 3Q17, compensation and employee benefits expenses decreased, primarily due to Beacon savings, partially offset by increased costs to support new business.\nInformation systems and communications expenses increased from both 4Q16 and 3Q17. The increase from both periods is due to higher technology infrastructure costs and Beacon investments.\nTransaction processing services expenses increased from both 4Q16 and 3Q17. The increase from both periods reflects higher client volumes and higher market levels.\nOccupancy expenses increased from 4Q16, primarily reflecting Beacon-related global footprint investments.\nOther expenses decreased from 4Q16, reflecting lower professional services costs. Other expenses increased from 3Q17, primarily due to higher costs to support new business, including marketing.\n4Q17 acquisition and restructuring costs of $133 million increased from $43 million and $33 million in 4Q16 and 3Q17, respectively, related to Beacon.\nThe 4Q17 GAAP-basis effective tax rate was 48.4% compared to (72.3)% in 4Q16 and 16.7% in 3Q17. As a result of the enactment of the TCJA, 4Q17 included a one-time estimated net tax cost of $270 million. (1) 4Q16 reflected a one-time net tax benefit of $211 million. Excluding these items, the 4Q17 and 4Q16 effective tax rates are 13.2% and 8.5%, respectively. The increase in 4Q17 tax rate compared to 4Q16 reflects a decrease in tax-advantaged investments. As compared to 3Q17, the decrease in tax rate is related to an increase in the mix of foreign earnings.\nThe 4Q17 operating-basis effective tax rate was 26.8% compared to (1.5)% in 4Q16 and 27.9% in 3Q17. Excluding a one-time net tax benefit of $211 million, the 4Q16 effective tax rate was 34%. The decrease in the tax rate from 4Q16 is primarily related to a reduction in tax-advantaged investments.\n(1) The effects of the TCJA described in this News Release are estimates. Actual effects of the TCJA may differ from these estimates, among other things, due to additional tax and regulatory guidance and changes in State Street assumptions and interpretations.\nThe following table presents our regulatory capital ratios as of December 31, 2017 and September 30, 2017. The lower of our capital ratios calculated under the Basel III advanced approaches and under the Basel III standardized approach are applied in the assessment of our capital adequacy for regulatory purposes. Also presented is the calculation of State Street's and State Street Bank's supplementary leverage ratio (SLR). Unless otherwise noted, all capital ratios presented in the table and elsewhere in this News Release refer to State Street Corporation and not State Street Bank and Trust Company.\nDecember 31, 2017 (1) Basel III Advanced Approaches (2) Basel III Standardized Approach Basel III Fully Phased-In Advanced Approaches (Estimated) Pro-Forma (2)(3) Basel III Fully Phased-In Standardized Approach (Estimated) Pro-Forma (3) Common equity tier 1 ratio 12.3 % 11.9 % 12.0 % 11.6 % Tier 1 capital ratio 15.5 15.0 15.2 14.7 Total capital ratio 16.5 16.0 16.2 15.7 Tier 1 leverage ratio 7.3 7.3 7.2 7.2 September 30, 2017 Common equity tier 1 ratio 12.6 % 11.6 % 12.3 % 11.3 % Tier 1 capital ratio 15.8 14.5 15.5 14.3 Total capital ratio 16.9 15.6 16.6 15.3 Tier 1 leverage ratio 7.4 7.4 7.3 7.3 State Street State Street Bank As of December 31, 2017\n(Dollars in millions) (1) Transitional SLR Fully Phased-In SLR (4) Transitional SLR Fully Phased-In SLR (4) Tier 1 Capital $ 15,382 $ 15,080 $ 16,531 $ 16,240 Total assets for SLR 236,986 236,708 233,790 233,519 Supplementary Leverage Ratio 6.5 % 6.4 % 7.1 % 7.0 % As of September 30, 2017\n(Dollars in millions) Tier 1 Capital $ 15,606 $ 15,338 $ 16,323 $ 16,067 Total assets for SLR 240,636 240,366 237,579 237,319 Supplementary Leverage Ratio 6.5 % 6.4 % 6.9 % 6.8 % (1) December 31, 2017 capital ratios are preliminary estimates.\n(2) The advanced approaches-based ratios (actual and estimated) included in this presentation reflect calculations and determinations with respect to our capital and related matters, based on State Street and external data, quantitative formulae, statistical models, historical correlations and assumptions, collectively referred to as “advanced systems.” Refer to the addendum included with this News Release for a description of the advanced approaches and a discussion of related risks.\n(3) Estimated pro-forma fully phased-in ratios as of December 31, 2017 and September 30, 2017 (fully phased in as of January 1, 2019, as per Basel III phase-in requirements for capital) reflect capital and total risk-weighted assets calculated under the Basel III final rule. Refer to the addendum included with this News Release for reconciliations of these estimated pro-forma fully phased-in ratios to our capital ratios calculated under the currently applicable regulatory requirements.\n(4) Estimated pro-forma fully phased-in SLRs as of December 31, 2017 and September 30, 2017 (fully phased-in as of January 1, 2018, as per the phase-in requirements of the SLR final rule) are preliminary estimates as calculated under the SLR final rule. Refer to the addendum included with this News Release for reconciliations of these estimated pro-forma fully phased-in SLRs to our SLRs under currently applicable regulatory requirements.\nInvestor Conference Call and Quarterly Website Disclosures\nState Street will webcast an investor conference call today, Tuesday, January 23, 2018, at 9:30 a.m. EST, available at http://investors.statestreet.com/ . The conference call will also be available via telephone, at +1 877-423-4013 inside the U.S. or at +1 706-679-5594 outside of the U.S. The Conference ID is # 7497823.\nRecorded replays of the conference call will be available on the website, and by telephone at +1 855-859-2056 inside the U.S. or at +1 404-537-3406 outside the U.S. beginning approximately two hours after the call's completion. The Conference ID is # 7497823.\nThe telephone replay will be available for approximately two weeks following the conference call. This News Release, presentation materials referred to on the conference call and additional financial information are available on State Street's website, at http://investors.statestreet.com/ under “Investor Relations--Investor News & Events\" and under the title “Events and Presentations.”\nState Street intends to publish updates to its public disclosure regarding regulatory capital, as required by the Basel III final rule, and the liquidity coverage ratio, on a quarterly basis on its website at http://investors.statestreet.com/ , under \"Filings & Reports.\" Those updates will be published each quarter, during the period beginning after State Street's public announcement of its quarterly results of operations and ending on or prior to the due date under applicable bank regulatory requirements (i.e., ordinarily, ending no later than 60 days following year-end or 45 days following each other quarter-end, as applicable). For 4Q17, State Street expects to publish its updates during the period beginning today and ending on or about February 16, 2018.\nState Street Corporation (NYSE: STT) is the world's leading provider of financial services to institutional investors including investment servicing, investment management and investment research and trading. With $33.1 trillion in assets under custody and administration and $2.8 trillion* in assets under management as of December 31, 2017, State Street operates globally in more than 100 geographic markets and employs 36,643 worldwide. For more information, visit State Street's website at www.statestreet.com .\n* Assets under management include the assets of the SPDR® Gold ETF and the SPDR® Long Dollar Gold Trust ETF (approximately $35 billion as of December 31, 2017), for which State Street Global Advisors Funds Distributors, LLC (SSGA FD) serves as marketing agent; SSGA FD and State Street Global Advisors are affiliated.\nAdditional Information\nIn this News Release:\nAll earnings per share amounts represent fully diluted earnings per common share. Return on average common shareholders' equity is determined by dividing annualized net income available to common equity by average common shareholders' equity for the period. Operating-basis return on average common equity utilizes annualized operating-basis net income available to common equity in the calculation. New asset servicing mandates and servicing assets remaining to be installed in future periods exclude new business which has been contracted, but for which the client has not yet provided permission to publicly disclose and is not yet installed. New business in assets to be serviced is reflected in our AUCA after we begin servicing the assets, and new business in assets to be managed is reflected in our AUM after we begin managing the assets. As such, only a portion of any new asset servicing and asset management mandate is reflected in our AUCA and AUM as of December 31, 2017. Distribution fees from the SPDR ® Gold ETF and the SPDR ® Long Dollar Gold Trust ETF are recorded in brokerage and other fee revenue and not in management fee revenue. State Street’s common stock and other stock dividends, including the declaration, timing and amount thereof, remain subject to consideration and approval by its Board of Directors at the relevant times. Stock purchases may be made using various types of mechanisms, including open market purchases under our announced common stock purchase program, accelerated share repurchases, or transactions off market, and may be made under Rule 10b5-1 trading programs. The timing, amount and continuation of stock purchases, types of transactions and number of shares purchased will depend on several factors, including market conditions and State Street’s capital position, its financial performance and acquisition and other investment opportunities. The common stock purchase programs do not have specific price targets and may be suspended at any time.\nForward-Looking Statements\nThis News Release (and the conference call referenced herein) contains forward-looking statements within the meaning of United States securities laws, including statements about our goals and expectations regarding our business, financial and capital condition, results of operations, strategies, the financial and market outlook, dividend and stock purchase programs, governmental and regulatory initiatives and developments, and the business environment. Forward-looking statements are often, but not always, identified by such forward-looking terminology as “outlook,” “expect,” \"priority,\" “objective,” “intend,” “plan,” “forecast,” “believe,” “anticipate,” “estimate,” “seek,” “may,” “will,” “trend,” “target,” “strategy” and “goal,” or similar statements or variations of such terms. These statements are not guarantees of future performance, are inherently uncertain, are based on current assumptions that are difficult to predict and involve a number of risks and uncertainties. Therefore, actual outcomes and results may differ materially from what is expressed in those statements, and those statements should not be relied upon as representing our expectations or beliefs as of any date subsequent to January 23, 2018.\nImportant factors that may affect future results and outcomes include, but are not limited to:\nthe financial strength and continuing viability of the counterparties with which we or our clients do business and to which we have investment, credit or financial exposure, including, for example, the direct and indirect effects on counterparties of the sovereign-debt risks in the U.S., Europe and other regions; increases in the volatility of, or declines in the level of, our NII, changes in the composition or valuation of the assets recorded in our consolidated statement of condition (and our ability to measure the fair value of investment securities) and the possibility that we may change the manner in which we fund those assets; the liquidity of the U.S. and international securities markets, particularly the markets for fixed-income securities and inter-bank credits, and the liquidity requirements of our clients; the level and volatility of interest rates, the valuation of the U.S. dollar relative to other currencies in which we record revenue or accrue expenses and the performance and volatility of securities, credit, currency and other markets in the U.S. and internationally; and the impact of monetary and fiscal policy in the United States and internationally on prevailing rates of interest and currency exchange rates in the markets in which we provide services to our clients; the credit quality, credit-agency ratings and fair values of the securities in our investment securities portfolio, a deterioration or downgrade of which could lead to other-than-temporary impairment of the respective securities and the recognition of an impairment loss in our consolidated statement of income; our ability to attract deposits and other low-cost, short-term funding, our ability to manage levels of such deposits and the relative portion of our deposits that are determined to be operational under regulatory guidelines and our ability to deploy deposits in a profitable manner consistent with our liquidity needs, regulatory requirements and risk profile; the manner and timing with which the Federal Reserve and other U.S. and foreign regulators implement or reevaluate the regulatory framework applicable to our operations (as well as changes to that framework), including implementation or modification of the Dodd-Frank Act and related stress testing and resolution planning requirements, the Basel III final rule and European legislation (such as the AIFMD, UCITS, the Money Market Funds Regulation and MiFID II/MiFIR); among other consequences, these regulatory changes impact the levels of regulatory capital we must maintain, acceptable levels of credit exposure to third parties, margin requirements applicable to derivatives, restrictions on banking and financial activities and the manner in which we structure and implement our global operations and servicing relationships. In addition, our regulatory posture and related expenses have been and will continue to be affected by changes in regulatory expectations for global systemically important financial institutions applicable to, among other things, risk management, liquidity and capital planning, resolution planning, compliance programs, and changes in governmental enforcement approaches to perceived failures to comply with regulatory or legal obligations; adverse changes in the regulatory ratios that we are required or will be required to meet, whether arising under the Dodd-Frank Act or the Basel III final rule, or due to changes in regulatory positions, practices or regulations in jurisdictions in which we engage in banking activities, including changes in internal or external data, formulae, models, assumptions or other advanced systems used in the calculation of our capital ratios that cause changes in those ratios as they are measured from period to period; requirements to obtain the prior approval or non-objection of the Federal Reserve or other U.S. and non-U.S. regulators for the use, allocation or distribution of our capital or other specific capital actions or corporate activities, including, without limitation, acquisitions, investments in subsidiaries, dividends and stock purchases, without which our growth plans, distributions to shareholders, share repurchase programs or other capital or corporate initiatives may be restricted; changes in law or regulation, or the enforcement of law or regulation, that may adversely affect our business activities or those of our clients or our counterparties, and the products or services that we sell, including additional or increased taxes or assessments thereon, capital adequacy requirements, margin requirements and changes that expose us to risks related to the adequacy of our controls or compliance programs; economic or financial market disruptions in the U.S. or internationally, including those which may result from recessions or political instability; for example, the U.K.'s decision to exit from the European Union may continue to disrupt financial markets or economic growth in Europe or, similarly, financial markets may react sharply or abruptly to actions taken by the new administration in the United States; our ability to develop and execute State Street Beacon, our multi-year transformation program to create cost efficiencies through changes in our operational processes and to further digitize our processes and interfaces with our clients, any failure of which, in whole or in part, may among other things, reduce our competitive position, diminish the cost-effectiveness of our systems and processes or provide an insufficient return on our associated investment; our ability to promote a strong culture of risk management, operating controls, compliance oversight, ethical behavior and governance that meets our expectations and those of our clients and our regulators, and the financial, regulatory, reputation and other consequences of our failure to meet such expectations; the impact on our compliance and controls enhancement programs associated with the appointment of a monitor under the deferred prosecution agreement with the DOJ and compliance consultant appointed under a settlement with the SEC, including the potential for such monitor and compliance consultant to require changes to our programs or to identify other issues that require substantial expenditures, changes in our operations, or payments to clients or reporting to U.S. authorities; the results of our review of our billing practices, including additional findings or amounts we may be required to reimburse clients, as well as potential consequences of such review, including damage to our client relationships or our reputation and adverse actions by governmental authorities; the results of, and costs associated with, governmental or regulatory inquiries and investigations, litigation and similar claims, disputes; or civil or criminal proceedings; changes or potential changes in the amount of compensation we receive from clients for our services, and the mix of services provided by us that clients choose; the large institutional clients on which we focus are often able to exert considerable market influence and have diverse investment activities, and this, combined with strong competitive market forces, subjects us to significant pressure to reduce the fees we charge, to potentially significant changes in our assets under custody and administration or our assets under management in the event of the acquisition or loss of a client, in whole or in part, and to potentially significant changes in our fee revenue in the event a client re-balances or changes its investment approach or otherwise re-directs assets to lower- or higher-fee asset classes; the potential for losses arising from our investments in sponsored investment funds; the possibility that our clients will incur substantial losses in investment pools for which we act as agent, and the possibility of significant reductions in the liquidity or valuation of assets underlying those pools; our ability to anticipate and manage the level and timing of redemptions and withdrawals from our collateral pools and other collective investment products; the credit agency ratings of our debt and depositary obligations and investor and client perceptions of our financial strength; adverse publicity, whether specific to State Street or regarding other industry participants or industry-wide factors, or other reputational harm; our ability to control operational risks, data security breach risks and outsourcing risks, our ability to protect our intellectual property rights, the possibility of errors in the quantitative models we use to manage our business and the possibility that our controls will prove insufficient, fail or be circumvented; our ability to expand our use of technology to enhance the efficiency, accuracy and reliability of our operations and our dependencies on information technology and our ability to control related risks, including cyber-crime and other threats to our information technology infrastructure and systems (including those of our third-party service providers) and their effective operation both independently and with external systems, and complexities and costs of protecting the security of such systems and data; our ability to complete acquisitions, joint ventures and divestitures, including the ability to obtain regulatory approvals, the ability to arrange financing as required and the ability to satisfy closing conditions; the risks that our acquired businesses and joint ventures will not achieve their anticipated financial, operational and product innovation benefits or will not be integrated successfully, or that the integration will take longer than anticipated, that expected synergies will not be achieved or unexpected negative synergies or liabilities will be experienced, that client and deposit retention goals will not be met, that other regulatory or operational challenges will be experienced, and that disruptions from the transaction will harm our relationships with our clients, our employees or regulators; our ability to recognize evolving needs of our clients and to develop products that are responsive to such trends and profitable to us, the performance of and demand for the products and services we offer, and the potential for new products and services to impose additional costs on us and expose us to increased operational risk; our ability to grow revenue, manage expenses, attract and retain highly skilled people and raise the capital necessary to achieve our business goals and comply with regulatory requirements and expectations; changes or potential changes to the competitive environment, including changes due to regulatory and technological changes, the effects of industry consolidation and perceptions of State Street as a suitable service provider or counterparty; changes in accounting standards and practices; and changes in tax legislation and in the interpretation of existing tax laws by U.S. and non-U.S. tax authorities that affect the amount of taxes due.\nOther important factors that could cause actual results to differ materially from those indicated by any forward-looking statements are set forth in our 2016 Annual Report on Form 10-K and our subsequent SEC filings. We encourage investors to read these filings, particularly the sections on risk factors, for additional information with respect to any forward-looking statements and prior to making any investment decision. The forward-looking statements contained in this News Release should not by relied on as representing our expectations or beliefs as of any time subsequent to the time this News Release is first issued, and we do not undertake efforts to revise those forward-looking statements to reflect events after that time.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005773/en/\nState Street Corporation\nInvestor Contact:\nIlene Fiszel Bieler, +1 617-664-3477\nor\nMedia Contact:\nJulie Kane, +1 617-664-3001\nSource: State Street Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.statestreet.com&esheet=51747274&newsitemid=20180123005773&lan=en-US&anchor=www.statestreet.com&index=4&md5=915353eaf3c2d784a3941e473af755b5", "http://www.businesswire.com/news/home/20180123005773/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.statestreet.com%2F&esheet=51747274&newsitemid=20180123005773&lan=en-US&anchor=http%3A%2F%2Finvestors.statestreet.com%2F&index=1&md5=ca74cdba86e9ddba3d306b35a3e165d8", "http://investors.statestreet.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.statestreet.com%2F&esheet=51747274&newsitemid=20180123005773&lan=en-US&anchor=http%3A%2F%2Finvestors.statestreet.com%2F&index=2&md5=88d7970627abf45758b99ad4ab3cc840", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.statestreet.com%2F&esheet=51747274&newsitemid=20180123005773&lan=en-US&anchor=http%3A%2F%2Finvestors.statestreet.com%2F&index=3&md5=9a5f8006656e903f1304c428a6a3b2dd"], "published": "2018-01-23T15:00:00.000+02:00", "crawled": "2018-01-23T18:42:04.014+02:00", "highlightTitle": ""}