{"organizations": [], "uuid": "53eba8b66734c46356144cf51d9de29ce14e13ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219628283&w=1200&r=LYNXMPEE040XN", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-deutsche-bank-tax/deutsche-bank-to-post-small-fourth-quarter-loss-on-u-s-tax-reform-weak-markets-idUSKBN1EU1JB", "country": "US", "domain_rank": 408, "title": "Deutsche Bank to post small Q4 loss on U.S. tax reform, weak markets", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T17:24:00.000+02:00", "replies_count": 0, "uuid": "53eba8b66734c46356144cf51d9de29ce14e13ef"}, "author": "", "url": "https://www.reuters.com/article/us-deutsche-bank-tax/deutsche-bank-to-post-small-fourth-quarter-loss-on-u-s-tax-reform-weak-markets-idUSKBN1EU1JB", "ord_in_thread": 0, "title": "Deutsche Bank to post small Q4 loss on U.S. tax reform, weak markets", "locations": [], "entities": {"persons": [{"name": "maria sheahan", "sentiment": "none"}, {"name": "tom sims", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "deutsche bank", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT (Reuters) - Deutsche Bank ( DBKGn.DE ) will post its third-consecutive annual loss in its 2017 results, defying its chief executive’s expectations of a swing to profit and highlighting the difficulty of overhauling Germany’s largest lender.\nThe bank warned on Friday that weak trading, low client activity and a 1.5 billion euro ($1.8 billion) negative impact from a tax overhaul in the United States would result in a “small” loss for the full year.\nCEO John Cryan has cautioned that the bank’s turnaround would be a long, hard slog but said in July he expected a return to profit in 2017.\nThe bank’s announcement took investors by surprise and its shares fell sharply, closing 5.2 percent down.\n“The share price reaction speaks for itself,” said a trader in Frankfurt. “Investors are disappointed.”\nIn March, Deutsche announced an overhaul that included integrating its Postbank retail bank with its in-house consumer bank, as well as the partial sale of its asset management business.\nShareholders said another loss would add pressure on Cryan, who was appointed in 2015 to steer the bank’s return to profit.\n“If the bank performs too poorly compared with its competitors, then one would need to start another debate about the strategy,” Ingo Speich, a fund manager at Union Investment, was Quote: d as saying by Handelsblatt newspaper.\nSpeich, whose fund holds Deutsche stock, said management had about two quarters to show they were delivering an improvement.\nThe company has struggled to keep revenue from shrinking and experienced a 10 percent drop in the third quarter. The bank had warned that the fourth quarter could be rough and confirmed that view on Friday.\n“Trading conditions in the fourth quarter 2017 were characterized by low volatility in financial markets and low levels of client activity in key businesses,” Deutsche Bank said in its statement.\nRevenue at Deutsche’s cash-generating bond-trading division was expected to drop 22 percent in the fourth quarter from a year ago, the bank said.\nThe bank is due to report fourth-quarter and full-year earnings on Feb. 2. It posted a net loss of 1.4 billion euros in 2016 and 6.8 billion euros in 2015.\nThe company has been recovering from multiple legal battles, ranging from its role in the marketing of U.S. mortgage-backed securities to a so-called mirror trading scheme that could be used for money laundering.\nLast year, a looming $14 billion fine from the U.S. Department of Justice had unsettled clients and investors and prompted talk of a government bailout.\nThe bank said the reduction in the U.S. corporate tax rate to 21 percent from 35 percent would translate into an average tax rate for the whole group at the lower end of a range between 30 percent and 35 percent.\nThe lower effective tax rate would require a revision to the valuation of deferred tax assets, causing the negative hit to Deutsche’s fourth-quarter earnings, it said, adding that it would not have any cash impact.\nReporting by Tom Sims; Additional reporting by Andrea Lentz and Andreas Cremer; Editing by David Goodman and Edmund Blair\n ", "external_links": [], "published": "2018-01-05T17:24:00.000+02:00", "crawled": "2018-01-05T17:45:41.007+02:00", "highlightTitle": ""}