{"organizations": [], "uuid": "c390567d49da4ca471c5dfdb9c542974defff2ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/01/104504159-RTX2I8Y7-Travis-Kalanick.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/16/travis-kalanick-discussed-compensating-the-driver-he-berated-in-video.html", "country": "US", "domain_rank": 767, "title": "Travis Kalanick discussed compensating the driver he berated in video", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:48:00.000+02:00", "replies_count": 0, "uuid": "c390567d49da4ca471c5dfdb9c542974defff2ee"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/travis-kalanick-discussed-compensating-the-driver-he-berated-in-video.html", "ord_in_thread": 0, "title": "Travis Kalanick discussed compensating the driver he berated in video", "locations": [], "entities": {"persons": [{"name": "travis kalanick", "sentiment": "negative"}, {"name": "kamel", "sentiment": "none"}, {"name": "kalanick", "sentiment": "none"}, {"name": "fawzi kamel", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In the hours after a video came to light of Uber founder Travis Kalanick arguing with an Uber driver over low fares, Kalanick and a few other executives broached the idea of apologizing and buying the driver's cars to make it up to him.\nIn the now-infamous February 2017 video, the driver, Fawzi Kamel, complained that he bought cars specifically to drive for Uber, but after the company undercut fares, it made it harder for him to make a living. Kalanick claimed that Uber didn't lower the fares on its black-car service.\n\"You know what?\" Kalanick said to Kamel before he swiftly exited the car. \"Some people don't like to take responsibility for their own shit. They blame everything in their life on somebody else.\"\nIn the hours after the video surfaced, Kalanick apologized, and admitted publicly for the first time that he fundamentally needed to grow up. \nLess than 48 hours later, Kalanick faced the driver again. Kalanick got into a long debate with Kamel in that subsequent meeting, which was set up for him to apologize, multiple sources revealed to Recode .\nAhead of the meeting, Kalanick and other Uber executives also discussed the possibility of buying Kamel's two cars to rectify some of the issues he voiced during the video.\nThe meeting with Kamel took place — within two days after the video was published — at San Francisco's luxury NEMA apartments at 10th and Market Street. Kalanick was advised to apologize and immediately leave. Instead, Kalanick spent an hour or so with Kamel, sources say, to express his regret for how he behaved and also to talk through many of the issues they had discussed in the video.\nKamel was naturally upset in the aftermath of his original encounter with Kalanick. But a spokesperson for Kalanick said that the subsequent meeting was not argumentative, and that it ended well. The spokesperson declined to comment on whether Kalanick gave Kamel any money. As we previously reported , Kalanick is represented by CEO advisory firm Teneo.\nRead more: \nSenate Democrats say they're a vote shy of reviving net neutrality. They're doomed to fail anyway. \nHow many aliens exist in the universe? Here's how scientists calculate it. \nAirbnb's CEO is promoting home rentals in places Trump reportedly labeled 'shithole countries' \n\"Travis met with Mr. Kamel following their interaction in Mr. Kamel's car, where he apologized for his behavior and the two had a constructive discussion,\" Kalanick's spokesperson said in a statement. \"Travis appreciated the conversation and thought it led to greater understanding for each person's perspective. The meeting ended on a positive note, and Travis appreciated Mr. Kamel's openness and forgiveness.\"\nBut at least one Uber executive was uncomfortable with the meeting. Kalanick was accompanied to the meeting by Wayne Ting, the general manager of Uber's Northern California operations at the time. After the meeting, Ting told a few executives at Uber that he was unable to get Kalanick to leave. Sources say that Ting also expressed his frustration to leadership in an email.\nTing, who is now the chief of staff to Uber CEO Dara Khosrowshahi, did not respond to a request for comment.\nKalanick had intended to reach a rapprochement with the driver, these sources say. He met with a small group of Uber executives to discuss company issues at the home of Jill Hazelbaker, now Uber's senior vice president of policy and communications, on the evening the video surfaced. Kalanick, along with Rachel Whetstone, Uber's head of comms at the time, Rachel Holt, the company's general manager of U.S. and Canada, former Uber president Jeff Jones and others agreed that he should meet with Kamel to apologize.\nDuring that gathering, Kalanick and some of those in attendance broached the idea of using his own money to buy Kamel's cars. Kamel owns two cars that operate on Uber's platform under a black-car business called West Coast Limos. \nSince Kamel's primary point during his disagreement with Kalanick was that he bought cars to drive for Uber and had been losing money because of lowered fares, they discussed Kalanick possibly buying the cars outright, or covering the depreciated value of the cars.\n\"But people are not trusting you anymore,\" Kamel had said to Kalanick in the video. \"Do you think people will buy cars anymore? ... I lost $97,000 because of you. I'm bankrupt because of you. You keep changing every day. You keep changing every day.\"\nIt's unclear whether Kalanick actually made an offer of money to Kamel. A spokesperson for Kalanick declined to comment.\nAfter the meeting, sources say, the company's former chief legal counsel Salle Yoo acted quickly and made it clear Kalanick had to use his own money and broker a deal with his own legal counsel — not Uber's.\nUber declined to comment, and Kamel did not respond to several requests for comment.\nThe airing of Kalanick's argument with Kamel may have been a watershed moment for the notoriously combative CEO, but to many Uber employees, it was clear that the company's relationship with its drivers was in desperate need of repair long before it surfaced.\nTo former head of driver product Aaron Schildkrout and general manager of U.S. and Canada Rachel Holt, the problem of driver retention was no longer just a moral one, nor was it just about fixing the company's image. It was a business problem, and it was pressing.\nUber had needed to shore up driver trust long before Kalanick painted himself and the company into a corner with this video. The company was grappling with the quickly dwindling supply of new drivers they could recruit or those they could try to poach from other companies — which meant that it couldn't simply replace the sometimes dissatisfied drivers who left the platform with new ones. Of those who did try driving for Uber, only about one-third of drivers operating on the platform in a given month were still driving a year later, several sources told Recode .\nThat's in part why, months before Kalanick stepped down and the video surfaced, the company began working on a campaign to win back its drivers.\n\nCNBC's parent NBCUniversal is an investor in Recode's parent Vox, and the companies have a content-sharing arrangement.", "external_links": [], "published": "2018-01-17T00:48:00.000+02:00", "crawled": "2018-01-17T01:10:52.061+02:00", "highlightTitle": ""}