{"organizations": [], "uuid": "ca2fc4cbb2decfcd731afd65ed0944efb3943e6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-ryan-mollett-to-join-angelo-gordon-as-global-head-of-distressed-debt.html", "country": "US", "domain_rank": 767, "title": "Ryan Mollett to Join Angelo, Gordon as Global Head of Distressed Debt", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:55:00.000+02:00", "replies_count": 0, "uuid": "ca2fc4cbb2decfcd731afd65ed0944efb3943e6d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-ryan-mollett-to-join-angelo-gordon-as-global-head-of-distressed-debt.html", "ord_in_thread": 0, "title": "Ryan Mollett to Join Angelo, Gordon as Global Head of Distressed Debt", "locations": [], "entities": {"persons": [{"name": "angelo", "sentiment": "negative"}, {"name": "join angelo", "sentiment": "negative"}, {"name": "ryan mollett", "sentiment": "negative"}, {"name": "gordon", "sentiment": "negative"}, {"name": "josh baumgarten", "sentiment": "none"}, {"name": "michael gordon", "sentiment": "none"}, {"name": "ryan", "sentiment": "none"}, {"name": "mollett", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "angelo", "sentiment": "none"}], "organizations": [{"name": "gordon & co.", "sentiment": "negative"}, {"name": "gso capital partners lp", "sentiment": "none"}, {"name": "blackstone", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Angelo, Gordon & Co., a $28 billion alternative investment firm focused on credit and real estate investing, today announced that Ryan Mollett will be joining the firm as Global Head of Distressed Debt. Mr. Mollett was most recently a Senior Managing Director of GSO Capital Partners LP, the global credit investment platform of Blackstone, where he focused on distressed and special situation investing. Mr. Mollett will report to Josh Baumgarten, Angelo, Gordon’s co-Chief Investment Officer.\nMichael Gordon, Chief Executive Officer and co-CIO at Angelo, Gordon, stated: “Distressed debt investing has been a core element of Angelo, Gordon’s investment strategy since the firm began nearly 30 years ago. Ryan is a seasoned and talented distressed investor, whose deep understanding of credit and distressed market environments and significant experience executing on highly complex situations, will further bolster our distressed capabilities and deliver for our clients.”\nJosh Baumgarten, co-CIO and Head of Credit at Angelo, Gordon, added: “The credit markets continue to evolve at an accelerated pace and investors can’t expect to generate returns the same way they have over the past 10 to 20 years. Ryan is a proven leader who brings a diverse set of skills that will help navigate where we believe credit markets will move well into the future. Ryan has demonstrated that he can deliver strong risk adjusted returns through credit cycles with both creativity and a deep focus on fundamental analysis and downside protection, which is a great fit with Angelo, Gordon’s own investment principles. We could not be more excited to welcome Ryan aboard and look forward to introducing him to our limited partners.”\nWhile at GSO, Mr. Mollett served as a senior member of GSO’s Global Distressed Investment Team; a Joint Portfolio Manager of GSO’s Capital Solutions Funds, Credit Alpha Funds and the Special Situations Funds; and served on the Investment Committees for these funds. He was also a Portfolio Manager of GSO Community Development Capital Group LP, a fund formed to provide land acquisition and development capital in partnership with residential homebuilders. Prior to joining GSO in 2011, Mr. Mollett was a Director at BlackRock where he was a Portfolio Manager and Senior Research Analyst. Before that, he was a Trader at First New York Securities. Mr. Mollett began his career as a Consultant with Gemini Realty Advisors. Mr. Mollett, 39, received a B.A. in History from Princeton University and an MBA in Finance and Investment Management from Yale University.\nAbout Angelo, Gordon & Co.\nAngelo, Gordon & Co., L.P. is a privately held limited partnership founded in November 1988. The firm currently manages approximately $28 billion with a primary focus on credit and real estate strategies. Angelo, Gordon has over 420 employees, including more than 160 investment professionals, and is headquartered in New York, with associated offices elsewhere in the U.S., Europe and Asia. For more information, visit www.angelogordon.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005584/en/\nMedia\nGasthalter & Co.\nNathaniel Garnick/Amanda Klein, 212-257-4170\nAngeloGordon@Gasthalter.com\nSource: Angelo, Gordon & Co.", "external_links": ["http://www.businesswire.com/news/home/20180125005584/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.angelogordon.com&esheet=51748695&newsitemid=20180125005584&lan=en-US&anchor=www.angelogordon.com&index=1&md5=85acb31c21887a812caa4b010668677d"], "published": "2018-01-25T16:55:00.000+02:00", "crawled": "2018-01-25T18:28:22.017+02:00", "highlightTitle": ""}