{"organizations": [], "uuid": "c5d845be5213ada0299dcf9893142d2796162709", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225378563&w=1200&r=LYNXMPEE0P07J", "site_section": "http://feeds.reuters.com/reuters/politicsNews/", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-trump-speech-response/kennedy-to-give-democratic-response-to-trumps-state-of-the-union-address-idUSKBN1FF0FZ", "country": "US", "domain_rank": 408, "title": "Kennedy to give Democratic response to Trump's State of the Union address", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T07:32:00.000+02:00", "replies_count": 0, "uuid": "c5d845be5213ada0299dcf9893142d2796162709"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-speech-response/kennedy-to-give-democratic-response-to-trumps-state-of-the-union-address-idUSKBN1FF0FZ", "ord_in_thread": 0, "title": "Kennedy to give Democratic response to Trump's State of the Union address", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "kennedy", "sentiment": "negative"}, {"name": "rich mckay", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "nick macfie", "sentiment": "none"}, {"name": "elizabeth guzman", "sentiment": "none"}, {"name": "robert f. kennedy", "sentiment": "none"}, {"name": "joseph kennedy iii", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}], "organizations": [{"name": "democratic", "sentiment": "negative"}, {"name": "trump's state", "sentiment": "neutral"}, {"name": "virginia house of delegates", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}, {"name": "boston globe", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 5:33 AM / Updated 3 hours ago In step to national stage, a young Kennedy to rebut Trump address Scott Malone 3 Min Read \nBOSTON (Reuters) - U.S. Representative Joseph Kennedy III, a politician with a very well-known name but relatively little prominence outside of his home state of Massachusetts, will deliver next week’s Democratic rebuttal to President Donald Trump’s state of the union address. \nThe speech will be the highest profile appearance of the 37-year-old Kennedy’s political career, following his 2016 talk at the Democratic National Convention, where he introduced U.S. Senator Elizabeth Warren. He has been a member of the House of Representatives since 2013. \n“The national audience will get their first opportunity to really get to know him in a way that the people of Massachusetts have come to know him,” said Peter Ubertaccio, a professor of political science at Stonehill College, outside Boston. \nThe major party in opposition traditionally broadcasts a rebuttal speech following the U.S. president’s annual state of the union address, which is delivered to a joint session of Congress and sums up achievements and goals. Trump had just taken office last year, so his address next Tuesday evening will be the Republican president’s first state of the union speech. \n“Congressman Kennedy profoundly understands the challenges facing hard-working men and women across the country,” U.S. House Minority Leader Nancy Pelosi said in a statement naming Kennedy as the rebuttal speaker. “His leadership has been vital in educating a next-generation workforce, in creating good-paying manufacturing jobs and in expanding opportunities for the middle class.” \nKennedy is the grandson of slain Senator Robert F. Kennedy and grand-nephew of the slain U.S. President John F. Kennedy and the late Senator Edward Kennedy, who for 50 years was one of the dominant voices of Democratic politics. \n“From healthcare to economic justice to civil rights, the Democratic agenda stands in powerful contrast to President Trump’s broken promises to American families,” Kennedy told the Boston Globe. \nThe Democratic Party has been criticized for relying too heavily on its oldest leaders since former Secretary of State Hillary Clinton’s stunning loss to businessman-turned-politician Trump in the 2016 presidential election. In picking Kennedy to give the rebuttal speech, the party is bridging that gap with a new face attached to one of the most famous names in American politics. \nBefore his first 2012 run for Congress, Kennedy worked as a Massachusetts prosecutor, served in the Peace Corps - founded by his great-uncle President Kennedy - and worked on the final election campaign of his great-uncle Senator Kennedy, who died in 2009. \n“He’s well aware that his name brings with it privileges, but I don’t get the sense talking to other Congressmen and staffers that he’s resting on that,” Ubertaccio said. Additional reporting by Rich McKay; Editing by Nick Macfie and Frances Kerry", "external_links": [], "published": "2018-01-26T07:32:00.000+02:00", "crawled": "2018-01-26T10:15:02.000+02:00", "highlightTitle": ""}