{"organizations": [], "uuid": "04b518f577ce504bb5cc36bdca2ade7a19882970", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/12/10/103234383-GettyImages-454464350.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/18/japan-in-drivers-seat-for-indian-bullet-train-deals.html", "country": "US", "domain_rank": 767, "title": "Japan in driver's seat for Indian bullet train deals", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:54:00.000+02:00", "replies_count": 0, "uuid": "04b518f577ce504bb5cc36bdca2ade7a19882970"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/japan-in-drivers-seat-for-indian-bullet-train-deals.html", "ord_in_thread": 0, "title": "Japan in driver's seat for Indian bullet train deals", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "none"}, {"name": "modi", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Japanese steel and engineering companies are in the driver's seat to bag major supply contracts for a $17 billion Indian bullet train, several sources said, undermining a key component of Prime Minister Narendra Modi's economic policy - a push to 'Make in India'.\nJapan is funding most of the project, and Japanese companies are likely to supply at least 70 percent of the core components of the rail line, said five sources in New Delhi with direct knowledge of the matter.\nA spokesman for Modi's office declined comment.\nA Japanese transport ministry official involved in the project said the two countries were still working out a strategy for the supply of key components, and would unveil a plan for procurements around July. The official spoke on condition of anonymity.\nThe September 2017 agreement between Japan and India for the bullet train project included two clauses - the promotion of 'Make in India' and 'Transfer of Technology' - through which New Delhi had hoped to set up manufacturing facilities in the country, generate jobs and get a toehold in Japanese technology.\nModi faces a general election in 2019 and is under pressure to provide more jobs to millions of unemployed in India. Critics also say the bullet train is wasteful and that the money could be better used elsewhere.\n\"The Japanese have reservations on certain issues because they have a concern that there is a difference in the culture and systems of Japan from the culture and systems in India,\" said Achal Khare, the managing director of National High Speed Rail Corp Ltd (NHSRCL), the agency tasked to execute the bullet train project.\n\"The work culture is very different,\" he told Reuters.\nKhare did not elaborate but two Indian railways officials, who spoke on condition of anonymity, said their Japanese counterparts had raised questions about efficiency in Indian companies and their ability to meet timelines.\nThe World Bank currently ranks India 100th out of 190 nations on the ease of doing business, giving it relatively low marks for starting a business, enforcing contracts and dealing with construction permits.\nTomoyuki Nakano, director for international engineering affairs in the railway bureau at Japan's transport ministry, said the issue was that Indian companies had no experience or technologies specialising in high-speed railway systems at present.\nJohn W Banagan | Lonely Planet Images | Getty Images \"I don't think Japanese are concerned about a difference in the work culture,\" Nakano said. He and other Japanese officials said efforts were continuing to fulfil the 'Make in India' component of the agreement by promoting collaborations between companies from the two countries.\nStill, several Indian officials said it was by and large accepted that Indian companies would not have a major part to play in the bullet train project.\nJapan will get major leeway because the bullet train is largely funded by a 50-year loan provided by its government, said a close aide of Modi, who spoke on condition of anonymity. \"At this stage to expect Indian companies to have a bigger share in manufacturing appears to be a little difficult,\" said a senior official at the Indian government's policy think-tank, NITI Aayog, who is involved in the negotiations.\nModi's flagship 'Make in India' initiative aims to lift the share of manufacturing in India's $2 trillion economy to 25 percent and create 100 million jobs by 2022.\nHowever, midway through Modi's five-year term, manufacturing was still at 17 percent of India's GDP in the 2016/17 financial year from 15 percent previously.", "external_links": [], "published": "2018-01-18T14:54:00.000+02:00", "crawled": "2018-01-18T14:52:13.000+02:00", "highlightTitle": ""}