{"organizations": [], "uuid": "13d84e334e1527e5cbbdf4ab368e4ac41e51f2e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-first-industrial-realty-trust-reports-tax-treatment-of-common-stock-distributions.html", "country": "US", "domain_rank": 767, "title": "First Industrial Realty Trust Reports Tax Treatment of Common Stock Distributions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-24T03:21:00.000+02:00", "replies_count": 0, "uuid": "13d84e334e1527e5cbbdf4ab368e4ac41e51f2e2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-first-industrial-realty-trust-reports-tax-treatment-of-common-stock-distributions.html", "ord_in_thread": 0, "title": "First Industrial Realty Trust Reports Tax Treatment of Common Stock Distributions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "first industrial realty trust reports tax treatment of common stock distributions chicago", "sentiment": "negative"}, {"name": "first industrial realty trust, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 23, 2018 /PRNewswire/ -- First Industrial Realty Trust, Inc. (NYSE: FR), a leading fully integrated owner, operator and developer of industrial real estate, today reported the tax treatment of its 2017 distributions.\nFor tax purposes, 74% percent of the Company's 2017 common stock distributions represented ordinary dividends and 26% were classified as capital gain distributions. Approximately 22% percent of the common stock distributions with a record date of December 31, 2016 that were paid on January 17, 2017 are allocable to 2017 for federal income tax purposes.\nThis release is based on the preliminary results of work on the Company's tax filings and may be subject to correction or adjustment when the filings are completed. However, no material change in the information reported is expected. Shareholders are encouraged to consult with their tax advisors as to their specific tax treatment.\nThe table below summarizes the income tax treatment of the Company's common stock distributions.\nCommon\nDeclaration\nDate\nRecord\nDate\nPayable\nDate\nTotal\nDistributions Per\nShare\nTotal Distribution\nAllocable to 2017\n2017 Total\nOrdinary\nDividends\n2017\nQualified\nDividends\n(1)\n2017 Total Capital\nGain Distributions\n2017\nUnrecaptured\nSection 1250\nGain (2)\n2017 Return\nof Capital\n(Nondividend\nDistributions)\n11/8/2016\n12/31/2016\n1/17/2017\n$0.19\n$0.04273044\n$0.03171609\n$0.00\n$0.01101435\n$0.00787517\n$0.00\n2/22/2017\n3/31/2017\n4/17/2017\n$0.21\n$0.21\n$0.15586965\n$0.00\n$0.05413035\n$0.03870274\n$0.00\n5/11/2017\n6/30/2017\n7/17/2017\n$0.21\n$0.21\n$0.15586965\n$0.00\n$0.05413035\n$0.03870274\n$0.00\n8/2/2017\n9/29/2017\n10/16/2017\n$0.21\n$0.21\n$0.15586965\n$0.00\n$0.05413035\n$0.03870274\n$0.00\n11/7/2017\n12/29/2017\n1/16/2018\n$0.21\n$0.21\n$0.15586965\n$0.00\n$0.05413035\n$0.03870274\n$0.00\nTotal\n$1.03\n$0.88273044\n$0.65519469\n$0.00\n$0.22753575\n$0.16268613\n$0.00\nForm 1099-DIV Box\n1a\n1b\n2a\n2b\n3\nNote : Shareholders subject to the Federal Alternative Minimum Tax: Alternative Minimum Taxable Income (AMTI) adjustment items under Internal Revenue Code Section 59(d) are apportioned to shareholders. The 2017 AMT preference adjustment is 1 cent per share (resulting in an increase to AMTI). Please consult your tax advisor for the proper treatment of this adjustment item.\n(1)\nQualified Dividends (Box 1b) are a subset of, and are included in, the Total Ordinary Dividends reported in Box 1a.\n(2)\nUnrecaptured Section 1250 Gain (Box 2b) is a subset of, and is included in, the Total Capital Gain Distributions reported in Box 2a.\nAbout First Industrial Realty Trust, Inc.\nFirst Industrial Realty Trust, Inc. (NYSE: FR) is a leading fully-integrated owner, operator, and developer of industrial real estate with a track record of providing industry-leading customer service to multinational corporations and regional customers. Across major markets in the United States, our local market experts manage, lease, buy, (re)develop, and sell bulk and regional distribution centers, light industrial, and other industrial facility types. In total, we own and have under development approximately 65.5 million square feet of industrial space as of September 30, 2017. For more information, please visit us at www.firstindustrial.com .\nForward-Looking Information\nThis press release contains within the meaning of Section 27A of the Securities Act of 1933, and Section 21E of the Securities Exchange Act of 1934. We intend for such to be covered by the safe harbor provisions for contained in the Private Securities Litigation Reform Act of 1995. Forward-looking statements are based on certain assumptions and describe our future plans, strategies and expectations, and are generally identifiable by use of the words \"believe,\" \"expect,\" \"plan,\" \"intend,\" \"anticipate,\" \"estimate,\" \"project,\" \"seek,\" \"target,\" \"potential,\" \"focus,\" \"may,\" \"will,\" \"should\" or similar words. Although we believe the expectations reflected in are based upon reasonable assumptions, we can give no assurance that our expectations will be attained or that results will not materially differ. Factors which could have a materially adverse effect on our operations and future prospects include, but are not limited to: changes in national, international, regional and local economic conditions generally and real estate markets specifically; changes in legislation/regulation (including changes to laws governing the taxation of real estate investment trusts) and actions of regulatory authorities; our ability to qualify and maintain our status as a real estate investment trust; the availability and attractiveness of financing (including both public and private capital) and changes in interest rates; the availability and attractiveness of terms of additional debt repurchases; changes in our credit agency ratings; our ability to comply with applicable financial covenants; our competitive environment; changes in supply, demand and valuation of industrial properties and land in our current and potential market areas; difficulties in identifying and consummating acquisitions and dispositions; our ability to manage the integration of properties we acquire; potential liability relating to environmental matters; defaults on or non-renewal of leases by our tenants; decreased rental rates or increased vacancy rates; higher-than-expected real estate construction costs and delays in development or lease-up schedules; changes in general accounting principles, policies and guidelines applicable to real estate investment trusts; and other risks and uncertainties described under the heading \"Risk Factors\" and elsewhere in our annual report on Form 10-K for the year ended December 31, 2016, as well as those risks and uncertainties discussed from time to time in our other Exchange Act reports and in our other public filings with the SEC. We caution you not to place undue reliance on , which reflect our outlook only and speak only as of the date of this press release or the dates indicated in the statements. We assume no obligation to update or supplement . For further information on these and other factors that could impact us and the statements contained herein, reference should be made to our filings with the SEC.\nView original content with multimedia: http://www.prnewswire.com/news-releases/first-industrial-realty-trust-reports-tax-treatment-of-common-stock-distributions-300587178.html\nSOURCE First Industrial Realty Trust, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/first-industrial-realty-trust-reports-tax-treatment-of-common-stock-distributions-300587178.html", "http://www.firstindustrial.com/"], "published": "2018-01-24T03:21:00.000+02:00", "crawled": "2018-01-24T03:27:42.000+02:00", "highlightTitle": ""}