{"organizations": [], "uuid": "177fb29bd152d4885d502b51920c381a197390ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221658107&w=1200&r=LYNXMPEE0C04I", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-halep/brand-less-slam-less-halep-looks-for-more-in-melbourne-idUKKBN1F2076", "country": "US", "domain_rank": 408, "title": "Brand-less, slam-less Halep looks for more in Melbourne", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T09:49:00.000+02:00", "replies_count": 0, "uuid": "177fb29bd152d4885d502b51920c381a197390ed"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-halep/brand-less-slam-less-halep-looks-for-more-in-melbourne-idUKKBN1F2076", "ord_in_thread": 0, "title": "Brand-less, slam-less Halep looks for more in Melbourne", "locations": [], "entities": {"persons": [{"name": "halep", "sentiment": "negative"}, {"name": "williams", "sentiment": "none"}, {"name": "serena williams", "sentiment": "none"}, {"name": "caroline wozniacki", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}, {"name": "jelena jankovic", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "melbourne ian ransom", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 7:51 AM / Updated 31 minutes ago Brand-less, slam-less Halep looks for more in Melbourne Ian Ransom 3 Min Read \nMELBOURNE (Reuters) - Simona Halep enters the Australian Open with the world number one ranking and a familiar set of doubts over her ability to win a grand slam. Tennis - Australian Open - Melbourne Park, Melbourne, Australia, January 12, 2018. Romania's Simona Halep reacts during a practice session ahead of the Australian Open tennis tournament. REUTERS/David Gray \nWith Serena Williams on maternity leave for most of 2017, the 26-year-old Halep had her best chance for a breakthrough at the majors but ended the year empty-handed again, with a second French Open final defeat after another near miss in 2014. \nThe number one ranking was some consolation after years battling at the top of the game, but Halep will be mindful of the many women before her who have ended up as caretakers at the top during Williams’s absences from the tour. \nA few of them, like second seed Caroline Wozniacki and Jelena Jankovic, held and lost the ranking without ever winning one of the four major trophies. \n“I have one more goal: to win a grand slam,” the Romanian 26-year-old told reporters at Melbourne Park on Saturday. \n“But now I‘m focusing on my game. I really want to get better and to improve in what I had less good.” \nGetting better at Melbourne Park would just be a matter of reaching the second round. \nShe was the first seed dumped out of last year’s tournament, losing in straight sets to unfancied American Shelby Rogers. \nIt was the second successive year of being knocked out at the first hurdle, reinforcing a reputation of mental fragility at the biggest tournaments. \nAs top seed, expectations will be higher this time round and the attention greater, which makes her split with apparel sponsor Adidas all the more mystifying. \nShe will compete at Melbourne Park without a brand after her management were unable to agree to terms on an extension with Adidas. \n“Yeah, my people are working for me on this stuff,” she said. “I have no contract now. I‘m still with no brand clothes.” \nIn a thoroughly modern sourcing arrangement, Halep found a Chinese company on the Internet to make her an outfit and they produced one within 24 hours after she sent them a picture of what she wanted. \nShe wore the red dress to victory at this month’s Shenzhen Open and will wear it again at Melbourne Park. \nThe no-nonsense Romanian, however, dismissed a suggestion that she might start her own clothing line like Serena’s older sister Venus Williams. \n“No. I‘m not that type of person,” she said. Editing by John O'Brien", "external_links": [], "published": "2018-01-13T09:49:00.000+02:00", "crawled": "2018-01-13T10:12:02.049+02:00", "highlightTitle": ""}