{"organizations": [], "uuid": "363b7c027ecfde6db8bc1c991c4927c1e74824ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 20}, "facebook": {"likes": 25, "shares": 25, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/05/103849008-_sites_default_files_images_103849008-GettyImages-168315122.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/05/why-federated-thinks-2018-could-be-the-year-of-the-barbell-stock-market.html", "country": "US", "domain_rank": 767, "title": "Why Federated thinks 2018 could be the year of the barbell stock market", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T00:00:00.000+02:00", "replies_count": 0, "uuid": "363b7c027ecfde6db8bc1c991c4927c1e74824ef"}, "author": "Keris Lahiff", "url": "https://www.cnbc.com/2018/01/05/why-federated-thinks-2018-could-be-the-year-of-the-barbell-stock-market.html", "ord_in_thread": 0, "title": "Why Federated thinks 2018 could be the year of the barbell stock market", "locations": [], "entities": {"persons": [{"name": "federated", "sentiment": "negative"}, {"name": "phil orlando", "sentiment": "none"}], "locations": [{"name": "wall street", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}], "organizations": [{"name": "federated investors", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wall Street brought in the New Year with a bang. The Dow Jones Industrial Average and Nasdaq Composite posted their best first four days of a year in more than a decade, while the S&P 500 hit its best level since 2010.\nAccording to one market watcher, the momentum will continue for the markets — but not without some difficulty.\nA few midyear uncertainties could cause an upset on Wall Street, predicted Phil Orlando, chief equity strategist at Federated Investors, who is targeting 3,000 for the S&P 500 by year's end.\n\"We think potentially there will be a barbell shape to this year,\" Orlando told CNBC's \" Futures Now \" in an interview this week. \"We could hit an air pocket in the summer and then we should end the summer on a high note.\"\nOrlando's \"barbell\" prediction strays from the pattern set in 2017, when markets booked new records on a mostly straight upward track. Last year, Wall Street boasted an impressive list of accomplishments: It was year eight in this bull market, its second-longest in history.\nThe Dow smashed through 20,000 last January, and scored 71 record closes over the next 12 months — its most ever and a level it had not come close to since 1995. Meanwhile, the S&P 500 rose nearly 20 percent and the Nasdaq almost 30 percent, their best annual gains since 2013.\nThe Fed factor Getty Images Chairman of the Federal Reserve nominee Jerome Powell testifies during his confirmation hearing before the Senate Banking, Housing and Urban Affairs Committee November 28, 2017 on Capitol Hill in Washington, DC. The two potential disruptors to the bull market, according to Orlando, are a Federal Reserve in transition and a potential Democratic wave building toward the 2018 midterm elections.\nThe first catalyst is the shakeup in leadership at the Fed, when President Donald Trump 's new chair pick, Jerome Powell , assumes the seat on Feb. 3. Powell takes over from a historically dovish Janet Yellen , who has overseen the steady return to normalized monetary policy over the past two years, after the 2008 crisis saw the central bank pump trillions of dollars into the economy.\n\"How does this leadership transition go?\" Orlando asked rhetorically. \"What will Chairman Powell's transition be in terms of maintaining the same dovish stance [on] quantitative tightening and increases in the funds rate?\"\nUnder Powell, a sudden rise in inflation or too much stimulus from tax reform could force the Fed's hand in raising rates at a pace far quicker than markets anticipate.\nOrlando also pointed to the potential for Democrats to assume the majority in the House and Senate this year, which may put the brakes on Trump's business-friendly agenda. The unraveling of business regulation and cuts to the corporate tax rate provided much of the fuel to markets over the past twelve months.\nThis year, Orlando's prediction for the S&P 500 to end 2018 at 3,000 implies a roughly 12 percent increase from its 2017 close. That's a healthy gain for any normal year of a bull market, but nearly half the gains seen last year.\nAt least for now, U.S. equities are well on track to continue last year's trends. So far this year, the Dow has cleared its never-before-seen 25,000 level and the S&P 500 has surpassed 2,700. This as the S&P has gone 293 days without a 3 percent pullback, its longest streak in history.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nshow chapters Here's why Federated sees a 'barbell' year for stocks 4:18 PM ET Thu, 4 Jan 2018 | 06:48", "external_links": [], "published": "2018-01-07T00:00:00.000+02:00", "crawled": "2018-01-07T00:14:10.001+02:00", "highlightTitle": ""}