{"organizations": [], "uuid": "39701e2de7f2460639705a74bea01f719428acf5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-ericsson-concludes-strategic-review-of-media-solutions-and-red-bee-media.html", "country": "US", "domain_rank": 767, "title": "Ericsson Concludes Strategic Review of Media Solutions and Red Bee Media", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T10:21:00.000+02:00", "replies_count": 0, "uuid": "39701e2de7f2460639705a74bea01f719428acf5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-ericsson-concludes-strategic-review-of-media-solutions-and-red-bee-media.html", "ord_in_thread": 0, "title": "Ericsson Concludes Strategic Review of Media Solutions and Red Bee Media", "locations": [], "entities": {"persons": [], "locations": [{"name": "stockholm", "sentiment": "none"}], "organizations": [{"name": "ericsson concludes strategic review of media solutions", "sentiment": "negative"}, {"name": "ericsson", "sentiment": "negative"}, {"name": "media solutions", "sentiment": "none"}, {"name": "red bee media", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STOCKHOLM, Jan. 31, 2018 /PRNewswire/ -- Ericsson (NASDAQ:ERIC) has concluded the review of strategic opportunities for its Media business – Media Solutions and Red Bee Media – which was initiated in conjunction with the announcement of the company's focused business strategy on March 28, 2017. In the review, Ericsson has evaluated different opportunities for both units, including partnerships, divestments, and a continued in-house development, based on what generates the best long-term value for Ericsson.\nAs a first step in assessing strategic opportunities, Ericsson has implemented substantial performance improvement programs while continuing to invest in the respective business. Both units have made significant progress during 2017.\nBörje Ekholm, President and CEO, Ericsson, says: \"Media Solutions and Red Bee Media are leading providers of media products and services, and with the performance improvements that are currently being implemented, we see future upsides to both businesses. We are confident that the direction we announce today will enable us to create the best long-term value, for both our customers and our shareholders.\"\nMedia Solutions\nEricsson has partnered with One Equity Partners, a private equity firm with deep expertise in media and telecom investments, to further develop Media Solutions. Ericsson will retain 49% of the shares in the company. This structure will establish Media Solutions as a leading independent video technology company with strong and committed financial support driving continued investment in innovation and growth. The terms of the transaction are confidential.\nEricsson and One Equity Partners will form an independent company and will develop the business in line with its new business plan. The performance improvement initiatives initiated in 2017 will continue, and are showing tangible results.\nMedia Solutions employees and contractors, as well as specified assets and liabilities, will transfer to the new company upon closing. Ericsson and OEP are committed to a seamless transition for employees, customers, partners and suppliers.\nThe divestment will not result in significant restructuring charges.\nClosing of the transaction is expected in Q3 2018 and is subject to customary closing conditions, including regulatory approvals.\nAfter the transaction is closed, Ericsson's share of the business will continue to be reported in segment Other.\nFor further details about Media Solutions and the new company, please see separate announcement: Ericsson brings in One Equity Partners as partner in growth of Media Solutions\nRed Bee Media\nDuring 2017, Ericsson has successfully been running a performance improvement program for Red Bee Media (former Broadcast and Media Services), and significant progress has been made, both in operational efficiency and cost savings.\nEricsson will continue to develop Red Bee Media as an independent and focused media services business, with the execution of the performance improvement and legal separation activities, initiated in 2017, as top priorities.\nFull Year 2017 adjusted operating income* for Red Bee Media was SEK -0.3 b. Full year revenues were SEK 2.5 b. Though still negative, the Q4 2017 adjusted operating income for the Red Bee business was significantly improved year on year, driven by cost and efficiency improvements. The Red Bee Media business will continue to be reported in segment Other.\nFor further details about Red Bee Media, please see separate announcement: Ericsson continues in-house development of Red Bee Media\n*Excluding corporate allocations, restructuring charges and certain other items impacting comparability. Please see Ericsson Q4 2017 earnings report.\nFor media kits, backgrounders and high-resolution photos, please visit www.ericsson.com/press\nFOLLOW US:\nwww.twitter.com/ericsson\nwww.facebook.com/ericsson\nwww.linkedin.com/company/ericsson\nwww.youtube.com/ericsson\nMORE INFORMATION AT:\nNews Center\nmedia.relations@ericsson.com\n(+46-10-719-69-92)\ninvestor.relations@ericsson.com\n(+46-10-719-00-00)\nEricsson is a world leader in communications technology and services with headquarters in Stockholm, Sweden. Our organization consists of more than 111,000 experts who provide customers in 180 countries with innovative solutions and services. Together we are building a more connected future where anyone and any industry is empowered to reach their full potential. Net sales in 2016 were SEK 222.6 billion (USD 24.5 billion). The Ericsson stock is listed on Nasdaq Stockholm and on NASDAQ in New York. Read more on www.ericsson.com .\nThis information was brought to you by Cision http://news.cision.com\nhttp://news.cision.com/ericsson/r/ericsson-concludes-strategic-review-of-media-solutions-and-red-bee-media,c2441436\nThe following files are available for download:\nhttp://mb.cision.com/Main/15448/2441436/784490.pdf\nEricsson concludes strategic review of Media Solutions and Red Bee Media\nView original content: http://www.prnewswire.com/news-releases/ericsson-concludes-strategic-review-of-media-solutions-and-red-bee-media-300590921.html\nSOURCE Ericsson", "external_links": ["http://news.cision.com/", "http://www.prnewswire.com/news-releases/ericsson-concludes-strategic-review-of-media-solutions-and-red-bee-media-300590921.html", "http://www.ericsson.com/press", "http://www.linkedin.com/company/ericsson", "https://www.ericsson.com/en/news/2018/1/ericsson-media-solutions", "http://www.youtube.com/ericsson", "http://mb.cision.com/Main/15448/2441436/784490.pdf", "https://www.ericsson.com/en/news/2018/1/ericsson-red-bee-media", "http://www.ericsson.com/", "http://news.cision.com/ericsson/r/ericsson-concludes-strategic-review-of-media-solutions-and-red-bee-media,c2441436", "http://www.twitter.com/ericsson", "http://www.facebook.com/ericsson", "http://www.ericsson.com/news"], "published": "2018-01-31T10:21:00.000+02:00", "crawled": "2018-01-31T11:09:09.010+02:00", "highlightTitle": ""}