{"organizations": [], "uuid": "11e3b1fc33e370daff1bd12be6612fc78d91e9ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-tfs-financial-corporation-earnings-remain-strong-as-housing-market-booms.html", "country": "US", "domain_rank": 767, "title": "TFS Corporation Earnings Remain Strong as Housing Market Booms", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:01:00.000+02:00", "replies_count": 0, "uuid": "11e3b1fc33e370daff1bd12be6612fc78d91e9ec"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-tfs-financial-corporation-earnings-remain-strong-as-housing-market-booms.html", "ord_in_thread": 0, "title": "TFS Corporation Earnings Remain Strong as Housing Market Booms", "locations": [], "entities": {"persons": [{"name": "marc a. stefanski", "sentiment": "none"}], "locations": [{"name": "cleveland", "sentiment": "none"}], "organizations": [{"name": "tfs corporation", "sentiment": "negative"}, {"name": "tfs financial corporation", "sentiment": "negative"}, {"name": "third federal savings and loan association of cleveland", "sentiment": "none"}, {"name": "business wire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND--(BUSINESS WIRE)-- TFS Financial Corporation (NASDAQ: TFSL) (the “Company\"), the holding company for Third Federal Savings and Loan Association of Cleveland (the “Association\"), today announced results for the three month period ended December 31, 2017.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180130006306/en/\nMarc A. Stefanski Chairman and CEO Third Federal Savings and Loan (Photo: Business Wire)\nThe Company reported net income of $19.6 million for both the quarter ended December 31, 2017, and the quarter ended December 31, 2016. While the net income results were very similar between the two periods, an increase in income tax expense as a result of the Tax Cuts and Jobs Act signed into law on December 22, 2017 was essentially offset by an increase in the credit for loan losses.\n“Third Federal finished 2017 on a high note with another quarter of strong earnings thanks to a booming housing market,” said Marc A. Stefanski, chairman and CEO. “Overall asset growth continues to drive our earnings. This was helped by considerable growth in home equity loan originations, which increased 59% compared to the first quarter of 2017. As we celebrate our 80th anniversary in 2018, we look forward to sharing our continuing success with our customers, associates, communities and shareholders.”\nOn December 22, 2017, the President signed into law the Tax Cuts and Jobs Act (H.R. 1) (the “Act”). The Act includes a number of changes in existing tax law impacting businesses including, among other things, a permanent reduction in the maximum corporate income tax rate from 35% to 21%. The rate reduction took effect on January 1, 2018, however as a September 30 fiscal year end entity, the Company is required to use a blended maximum rate for its entire September 30, 2018 fiscal year, which would be approximately 24.5%. In addition, as required by U.S. generally accepted accounting principles, the Company revalued its net deferred tax assets as of December 31, 2017, resulting in a reduction in the value of its net deferred tax asset and the recording of approximately $4.6 million of additional income tax expense in the Company’s statement of income in the three months ended December 31, 2017. The revaluation of the net deferred tax assets is subject to adjustment in future periods.\nNet interest income in the current period increased $1.8 million compared to the prior year quarter, as $9.0 million of additional interest income in the current period more than offset $7.2 million of additional interest expense. Interest income was higher as the average balance of interest-earning assets, mainly loans, and the weighted average yield earned on those assets, both increased from the previous year period. The average cost of interest-bearing liabilities was higher in the current year as a result of increased short-term market interest rates and the use of longer duration funding sources that carried higher costs. Net interest income was $70.0 million for the quarter ended December 31, 2017 and $68.2 million for the quarter ended December 31, 2016. The interest rate spread for the quarter ended December 31, 2017 was 1.95% compared to 2.03% in the same quarter last year. The net interest margin for the quarter ended December 31, 2017 was 2.10% compared to 2.16% in the same quarter last year.\nThe provision for loan losses was a credit of $3.0 million for the three months ended December 31, 2017 compared to no provision for the three months ended December 31, 2016. Continued strong recoveries of loan amounts previously charged off, low levels of current loan charge-offs and reduced exposure from home equity lines of credit coming to the end of the draw period resulted in the loan provision credit. The Company reported $19 thousand of net loan charge-offs for the three months ended December 31, 2017 and $1.3 million of net loan charge-offs for the three months ended December 31, 2016. Gross loan charge-offs were $2.6 million for the three months ended December 31, 2017 and $4.0 million for the three months ended December 31, 2016. while loan recoveries were $2.6 million in the current quarter and $2.7 million in the prior year quarter. In recent years, a large portion of the overall allowance has been allocated to the home equity loans and lines of credit category to address exposure from customers whose lines of credit were originated without amortizing payments during the draw period and who could face potential increased payment shock at the end of the draw period. In general, home equity lines of credit originated prior to June 2010 were characterized by a ten-year draw period, with interest only payments, followed by a ten-year repayment period. However, a large number of those lines of credit approaching the end of draw period have been paid off or refinanced without significant loss. The principal balance of home equity lines of credit originated prior to 2010 without amortizing payments during the draw period that are coming to the end of the draw period through fiscal 2020 was $396.1 million at December 31, 2017, compared to $484.8 at September 30, 2017 and $789.4 million at December 31, 2016. As this exposure decreases without incurring significant loss, the portion of the overall allowance allocated to the home equity loans and lines of credit category has correspondingly decreased. Generally, equity lines of credit originated after June 2010 require an amortizing payment during the draw period and do not face the same end-of-draw increased payment shock risk. The allowance for loan losses was $45.9 million, or 0.36% of total loans receivable, at December 31, 2017, compared to $48.9 million, or 0.39% of total loans receivable, at September 30, 2017 and $60.4 million, or 0.51% of total loans receivable, at December 31, 2016.\nNon-accrual loans decreased $0.5 million to $78.6 million, or 0.62% of total loans, at December 31, 2017 from $79.1 million, or 0.63% of total loans, at September 30, 2017. The $0.5 million decrease in non-accrual loans for the quarter ended December 31, 2017 consisted of a $1.5 million decrease in the residential core portfolio and a $1.3 million decrease in the Home Today portfolio, offset by a $2.3 million increase in the equity loans and lines of credit portfolio.\nTotal loan delinquencies increased $14.0 million to $58.8 million, or 0.47% of total loans receivable, at December 31, 2017 from $44.8 million, or 0.36% of total loans receivable, at September 30, 2017. The increase was mainly a result of borrowers impacted by Hurricane Irma in September, 2017 who elected to accept the Company's offer to defer three months of mortgage payments to lessen any financial strain related to the storm. Most borrowers have resolved their deferrals through repayment plans, term extensions or other loan modifications at December 31, 2017 and the remaining deferrals are expected to be resolved with no material increase in loan losses.\nTotal troubled debt restructurings decreased $3.8 million at December 31, 2017, to $158.3 million from $162.0 million at September 30, 2017. Of the $158.3 million of troubled debt restructurings recorded at December 31, 2017, $83.2 million was in the residential core portfolio, $42.9 million was in the Home Today portfolio, and $32.2 million was in the equity loans and lines of credit portfolio. The portion of total troubled debt restructurings included as part of non-accrual loans was $57.4 million at December 31, 2017 and $58.9 million at September 30, 2017.\nTotal income tax expense increased by $3.7 million, to $12.4 million, for the three months ended December 31, 2017, from $8.7 million for the three months ended December 31, 2016. The increase in the expense was caused mainly by the combination of an increase in income before income taxes and the impact of the Tax Cuts and Jobs Act, which resulted in net deferred tax assets being revalued, which was partially offset by the reduction of the maximum corporate tax rate mentioned above. In addition to those items, income tax expense is increased each period by the amount of any excess tax deficiencies and decreased by the amount of any excess tax benefits related to stock based compensation. Recognized in income tax expense was less than $0.1 million in tax deficiencies for the three months ended December 31, 2017 and $0.9 million in tax benefits for the three months ended December 31, 2016.\nTotal assets increased by $195.3 million, or 1%, to $13.89 billion at December 31, 2017 from $13.69 billion at September 30, 2017. This change was mainly the result of new loan origination levels exceeding the total of loan sales and principal repayments, combined with a net increase in the combination of cash and cash equivalents and investment securities.\nThe combination of cash and cash equivalents and investment securities increased $56.9 million, or 7%, to $862.6 million at December 31, 2017 from $805.7 million at September 30, 2017.\nThe combination of loans held for investment, net and mortgage loans held for sale increased $151.0 million, or 1%, to $12.57 billion at December 31, 2017 from $12.42 billion at September 30, 2017. Residential core mortgage loans, including those held for sale, increased $78.6 million during the three months ended December 31, 2017, while the home equity loans and lines of credit portfolio increased $73.4 million. Total first mortgage loan originations were $540.8 million for the three months ended December 31, 2017 and $708.1 million for the three months ended December 31, 2016. The current period originations were 45% adjustable rate mortgages and 14% fixed-rate mortgages with terms of 10 years or less. Commitments originated for home equity loans and lines of credit were $389.9 million for the three months ended December 31, 2017 and $236.0 million for the three months ended December 31, 2016. During the three months ended December 31, 2017, loan sales of $37.6 million were completed, resulting in net gain of $0.5 million. During the three months ended December 31, 2016, loan sales of $72.5 million were completed, resulting in net gain of $0.9 million.\nDeposits increased 1%, to $8.21 billion at December 31, 2017 from $8.15 billion at September 30, 2017. The increase in deposits was the result of a $37.3 million decrease in our savings accounts, a $3.6 million increase in our checking accounts, and a $88.6 million increase in our certificates of deposit (\"CDs\") for the three months ended December 31, 2017. Total deposits include $664.8 million and $620.7 million of brokered CDs at December 31, 2017 and September 30, 2017, respectively.\nBorrowed funds, all from the FHLB, increased $87.5 million, to $3.76 billion at December 31, 2017 from $3.67 billion at September 30, 2017, as loan growth led to increased cash demands. This increase reflects a combination of an additional $75.0 million of 90 day advances that have an effective duration at inception of five years as a result of interest rate swap contracts and $90.0 million of overnight advances, partially offset by other principal repayments.\nAccrued expenses and other liabilities increased $49.3 million, to $92.7 million at December 31, 2017 from $43.4 million at September 30, 2017. This change primarily reflects the cyclical nature of real estate tax payments that have been collected from borrowers and are in the process of being remitted to various taxing agencies.\nTotal shareholders' equity increased $10.7 million, or 1%, to $1.70 billion at December 31, 2017 from $1.69 billion at September 30, 2017. Activity reflects $19.6 million of net income in the current fiscal year reduced by $7.5 million of repurchases of common stock and a quarterly dividend of $8.4 million and was further impacted by a combination of adjustments related to our stock compensation plan, ESOP and accumulated other comprehensive loss. A total of 492,000 shares of our common stock were repurchased at an average cost of $15.33 per share during the quarter ended December 31, 2017. At December 31, 2017, there were 7,258,890 shares remaining to be purchased under the Company's eighth repurchase program. The Company declared and paid a quarterly dividend of $0.17 per share during the quarter ended December 31, 2017. As a result of a mutual member vote, Third Federal Savings and Loan Association of Cleveland, MHC (the \"MHC\"), the mutual holding company that owns approximately 81% of the outstanding stock of the Company, was able to waive its receipt of its share of the dividend paid. Under current Federal Reserve regulations, the MHC is required to obtain the approval of its members every 12 months for the MHC to waive its right to receive dividends. As a result of a July 19, 2017 member vote and the subsequent non-objection of the Federal Reserve, the MHC has the approval to waive the receipt of up to a total of $0.68 per share of possible dividends to be declared on the Company's common stock, including $0.34 during the two quarters ending March 31, 2018 and June 30, 2018. The MHC has conducted the member vote to approve the dividend waiver each of the past four years under Federal Reserve regulations and for each of those four years, approximately 97% of the votes cast were in favor of the waiver.\nThe Association operates under the capital requirements for the standardized approach of the Basel III capital framework for U.S. banking organizations (“Basel III Rules”), subject to transitional provisions extending through the end of 2018. The Basel III Rules include a Common Equity Tier 1 Capital ratio, with a fully phased-in required minimum Common Equity Tier 1 and Capital Conservation Buffer of 7.00%. At December 31, 2017 all of the Association's capital ratios substantially exceed the amounts required for the Association to be considered \"well capitalized\" for regulatory capital purposes. The Association’s Tier 1 leverage ratio was 10.55%, its Common Equity Tier 1 and Tier 1 ratios, as calculated under the fully phased-in Basel III Rules, were each 19.55% and its total capital ratio was 20.17%. Additionally, the Company's Tier 1 leverage ratio was 12.26%, its Common Equity Tier 1 and Tier 1 ratios were each 22.69% and its total capital ratio was 23.30%. The Association's current capital ratios reflect the dilutive impact of $85 million of dividends that the Association paid to the Company, its sole shareholder, during the quarter ended December 31, 2017. Because of its intercompany nature, these dividends had no impact on the Company's capital ratios or its consolidated statement of condition.\nPresentation slides as of December 31, 2017 will be available on the Company's website, www.thirdfederal.com , under the Investor Relations link under the \"About Us\" table, beginning January 30, 2018. Consistent with our recent history, the Company will not be hosting a conference call to discuss its operating results.\nThird Federal Savings and Loan Association is a leading provider of savings and mortgage products, and operates under the values of love, trust, respect, a commitment to excellence and fun. Founded in Cleveland in 1938 as a mutual association by Ben and Gerome Stefanski, Third Federal’s mission is to help people achieve the dream of home ownership and financial security. It became part of a public company in 2007 and celebrates its 80 th anniversary in May, 2018. Third Federal, which lends in 21 states and the District of Columbia, is dedicated to serving consumers with competitive rates and outstanding service. Third Federal, an equal housing lender, has 21 full service branches in Northeast Ohio, eight lending offices in Central and Southern Ohio, and 17 full service branches throughout Florida. As of December 31, 2017, the Company’s assets totaled $13.9 billion.\nForward Looking Statements\nThis release contains , which can be identified by the use of such words as estimate, project, believe, intend, anticipate, plan, seek, expect and similar expressions. These include, among other things:\nstatements of our goals, intentions and expectations; statements regarding our business plans and prospects and growth and operating strategies; statements concerning trends in our provision for loan losses and charge-offs; statements regarding the trends in factors affecting our financial condition and results of operations, including asset quality of our loan and investment portfolios; and estimates of our risks and future costs and benefits.\nThese are subject to significant risks, assumptions and uncertainties, including, among other things, the following important factors that could affect the actual outcome of future events:\nsignificantly increased competition among depository and other financial institutions; inflation and changes in the interest rate environment that reduce our interest margins or reduce the fair value of financial instruments; general economic conditions, either globally, nationally or in our market areas, including employment prospects, real estate values and conditions that are worse than expected; decreased demand for our products and services and lower revenue and earnings because of a recession or other events; adverse changes and volatility in the securities markets, credit markets or real estate markets; legislative or regulatory changes that adversely affect our business, including changes in regulatory costs and capital requirements and changes related to our ability to pay dividends and the ability of Third Federal Savings, MHC to waive dividends; our ability to enter new markets successfully and take advantage of growth opportunities, and the possible short-term dilutive effect of potential acquisitions or de novo branches, if any; changes in consumer spending, borrowing and savings habits; changes in accounting policies and practices, as may be adopted by the bank regulatory agencies, the Financial Accounting Standards Board or the Public Company Accounting Oversight Board; future adverse developments concerning Fannie Mae or Freddie Mac; changes in monetary and fiscal policy of the U.S. Government, including policies of the U.S. Treasury and the Federal Reserve and changes in the level of government support of housing finance; changes in policy and/or assessment rates of taxing authorities that adversely affect us; changes in our organization, or compensation and benefit plans and changes in expense trends (including, but not limited to trends affecting non-performing assets, charge-offs and provisions for loan losses); the impact of the governmental effort to restructure the U.S. financial and regulatory system, including the extensive reforms enacted in the Dodd-Frank Wall Street Reform and Consumer Protection Act (\"DFA\") and the continuing impact of our coming under the jurisdiction of new federal regulators; the inability of third-party providers to perform their obligations to us; a slowing or failure of the moderate economic recovery; the adoption of implementing regulations by a number of different regulatory bodies under the DFA, and uncertainty in the exact nature, extent and timing of such regulations and the impact they will have on us; changes in accounting and tax estimates; the strength or weakness of the real estate markets and of the consumer and commercial credit sectors and its impact on the credit quality of our loans and other assets, and the ability of the U.S. Government to manage federal debt limits.\nBecause of these and other uncertainties, our actual future results may be materially different from the results indicated by any . Any forward-looking statement made by us in this report speaks only as of the date on which it is made. We undertake no obligation to publicly update any , whether as a result of new information, future developments or otherwise, except as may be required by law.\nTFS FINANCIAL CORPORATION AND SUBSIDIARIES CONSOLIDATED STATEMENTS OF CONDITION (unaudited) (In thousands, except share data) December 31,\n2017\nSeptember 30,\n2017\nASSETS Cash and due from banks $ 34,418 $ 35,243 Interest-earning cash equivalents 289,147 232,975 Cash and cash equivalents 323,565 268,218 Investment securities available for sale (amortized cost $548,087 and $541,964, respectively) 538,991 537,479 Mortgage loans held for sale, at lower of cost or market (none measured at fair value) 1,259 351 Loans held for investment, net: Mortgage loans 12,579,194 12,434,339 Other loans 2,886 3,050 Deferred loan expenses, net 33,251 30,865 Allowance for loan losses (45,929 ) (48,948 ) Loans, net 12,569,402 12,419,306 Mortgage loan servicing assets, net 8,168 8,375 Federal Home Loan Bank stock, at cost 92,111 89,990 Real estate owned 4,290 5,521 Premises, equipment, and software, net 63,144 60,875 Accrued interest receivable 35,622 35,479 Bank owned life insurance contracts 207,426 205,883 Other assets 43,902 61,086 TOTAL ASSETS $ 13,887,880 $ 13,692,563 LIABILITIES AND SHAREHOLDERS’ EQUITY Deposits $ 8,207,351 $ 8,151,625 Borrowed funds 3,758,855 3,671,377 Borrowers’ advances for insurance and taxes 95,398 100,446 Principal, interest, and related escrow owed on loans serviced 32,907 35,766 Accrued expenses and other liabilities 92,691 43,390 Total liabilities 12,187,202 12,002,604 Commitments and contingent liabilities Preferred stock, $0.01 par value, 100,000,000 shares authorized, none issued and outstanding — — Common stock, $0.01 par value, 700,000,000 shares authorized; 332,318,750 shares issued; 281,002,481 and 281,291,750 outstanding at December 31, 2017 and September 30, 2017, respectively 3,323 3,323 Paid-in capital 1,721,067 1,722,672 Treasury stock, at cost; 51,316,269 and 51,027,000 shares at December 31, 2017 and September 30, 2017, respectively (741,034 ) (735,530 ) Unallocated ESOP shares (52,001 ) (53,084 ) Retained earnings—substantially restricted 771,317 760,070 Accumulated other comprehensive loss (1,994 ) (7,492 ) Total shareholders’ equity 1,700,678 1,689,959 TOTAL LIABILITIES AND SHAREHOLDERS’ EQUITY $ 13,887,880 $ 13,692,563 TFS FINANCIAL CORPORATION AND SUBSIDIARIES CONSOLIDATED STATEMENTS OF INCOME (unaudited) (In thousands, except share and per share data) For the Three Months\nEnded December 31,\n2017 2016 INTEREST INCOME: Loans, including fees $ 102,626 $ 95,380 Investment securities available for sale 2,589 1,853 Other interest and dividend earning assets 2,014 981 Total interest and dividend income 107,229 98,214 INTEREST EXPENSE: Deposits 22,994 22,057 Borrowed funds 14,247 7,927 Total interest expense 37,241 29,984 NET INTEREST INCOME 69,988 68,230 PROVISION (CREDIT) FOR LOAN LOSSES (3,000 ) — NET INTEREST INCOME AFTER PROVISION FOR LOAN LOSSES 72,988 68,230 NON-INTEREST INCOME: Fees and service charges, net of amortization 1,760 1,776 Net gain on the sale of loans 478 883 Increase in and death benefits from bank owned life insurance contracts 1,554 1,604 Other 1,052 1,105 Total non-interest income 4,844 5,368 NON-INTEREST EXPENSE: Salaries and employee benefits 23,253 23,755 Marketing services 5,038 4,535 Office property, equipment and software 6,651 5,873 Federal insurance premium and assessments 2,718 2,272 State franchise tax 1,126 1,354 Real estate owned expense, net 583 1,051 Other expenses 6,407 6,422 Total non-interest expense 45,776 45,262 INCOME BEFORE INCOME TAXES 32,056 28,336 INCOME TAX EXPENSE 12,443 8,726 NET INCOME $ 19,613 $ 19,610 Earnings per share—basic and diluted $ 0.07 $ 0.07 Weighted average shares outstanding Basic 275,816,329 277,925,724 Diluted 277,624,291 280,272,455 TFS FINANCIAL CORPORATION AND SUBSIDIARIES AVERAGE BALANCES AND YIELDS (unaudited)\nThree Months Ended December 31, 2017 Three Months Ended December 31, 2016 Average\nBalance Interest\nIncome/\nExpense Yield/\nCost (2) Average\nBalance Interest\nIncome/\nExpense Yield/\nCost (2) (Dollars in thousands) Interest-earning assets: Interest-earning cash equivalents\n$ 239,197 $ 783 1.31 % $ 202,236 $ 279 0.55 % Mortgage-backed securities 538,504 2,589 1.92 % 522,938 1,853 1.42 % Loans (1) 12,486,857 102,626 3.29 % 11,816,778 95,380 3.23 % Federal Home Loan Bank stock 90,401 1,231 5.45 % 71,654 702 3.92 % Total interest-earning assets 13,354,959 107,229 3.21 % 12,613,606 98,214 3.11 % Noninterest-earning assets 377,939 343,064 Total assets $ 13,732,898 $ 12,956,670 Interest-bearing liabilities: Checking accounts $ 969,759 $ 226 0.09 % $ 989,252 $ 230 0.09 % Savings accounts 1,448,273 503 0.14 % 1,520,395 529 0.14 % Certificates of deposit 5,751,520 22,265 1.55 % 5,752,770 21,298 1.48 % Borrowed funds 3,643,213 14,247 1.56 % 2,801,999 7,927 1.13 % Total interest-bearing liabilities 11,812,765 37,241 1.26 % 11,064,416 29,984 1.08 % Noninterest-bearing liabilities 213,684 224,858 Total liabilities 12,026,449 11,289,274 Shareholders’ equity 1,706,449 1,667,396 Total liabilities and shareholders’ equity\n$ 13,732,898 $ 12,956,670 Net interest income $ 69,988 $ 68,230 Interest rate spread (2)(3) 1.95 % 2.03 % Net interest-earning assets (4) $ 1,542,194 $ 1,549,190 Net interest margin (2)(5) 2.10 % 2.16 % Average interest-earning assets to average interest-bearing liabilities\n113.06 % 114.00 % (1) Loans include both mortgage loans held for sale and loans held for investment. (2) Annualized. (3) Interest rate spread represents the difference between the yield on average interest-earning assets and the cost of average interest-bearing liabilities. (4) Net interest-earning assets represent total interest-earning assets less total interest-bearing liabilities. (5) Net interest margin represents net interest income divided by total interest-earning assets.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006306/en/\nTFS Financial Corporation\nDavid Reavis, 216-429-5036\nSource: Third Federal Savings and Loan", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.thirdfederal.com&esheet=51750579&newsitemid=20180130006306&lan=en-US&anchor=www.thirdfederal.com&index=1&md5=75cff1e98218f99798403d52128652d5", "http://www.businesswire.com/news/home/20180130006306/en/"], "published": "2018-01-31T00:01:00.000+02:00", "crawled": "2018-01-31T03:06:04.000+02:00", "highlightTitle": ""}