{"organizations": [], "uuid": "03139e51833d4ed63706658b2c4da833e1ec6d1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-cas-group-delivers-letter-to-the-stockholders-of-aviragen.html", "country": "US", "domain_rank": 767, "title": "CAS Group Delivers Letter to the Stockholders of Aviragen", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T17:00:00.000+02:00", "replies_count": 0, "uuid": "03139e51833d4ed63706658b2c4da833e1ec6d1c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-cas-group-delivers-letter-to-the-stockholders-of-aviragen.html", "ord_in_thread": 0, "title": "CAS Group Delivers Letter to the Stockholders of Aviragen", "locations": [], "entities": {"persons": [{"name": "aviragen", "sentiment": "none"}, {"name": "thomas m. clay", "sentiment": "none"}, {"name": "indi", "sentiment": "none"}, {"name": "vaxart", "sentiment": "none"}], "locations": [{"name": "east hill ma", "sentiment": "none"}, {"name": "n.h.", "sentiment": "none"}, {"name": "ga.", "sentiment": "none"}, {"name": "peterborough", "sentiment": "none"}, {"name": "aviragen suwanee", "sentiment": "none"}, {"name": "aviragen", "sentiment": "none"}, {"name": "vaxart", "sentiment": "none"}, {"name": "delaware", "sentiment": "none"}], "organizations": [{"name": "digirad corporation", "sentiment": "negative"}, {"name": "cas group delivers letter", "sentiment": "negative"}, {"name": "avir", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "aviragen therapeutics, inc.", "sentiment": "none"}, {"name": "vaxart, inc", "sentiment": "none"}, {"name": "nagement company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SUWANEE, Ga. and PETERBOROUGH, N.H., Jan. 24, 2018 /PRNewswire/ -- Digirad Corporation, East Hill Management Company, LLC and Thomas M. Clay (collectively with certain other participants in the solicitation, the \"Concerned Aviragen Shareholders Group\", the \"CAS Group\", \"we\" or \"us\"), are significant stockholders of Aviragen Therapeutics, Inc., a Delaware corporation (\"Aviragen\", \"AVIR\" or the \"Company\") (NASDAQ: AVIR), and collectively beneficially own in the aggregate approximately 8.3% of AVIR's outstanding shares of common stock, delivered a letter to the stockholders of AVIR today setting forth our serious concerns with the proposed merger between Aviragen and Vaxart, Inc. The full text of the letter is set forth below:\nThe Proposed Merger between Aviragen and Vaxart is Not in the Best Interests of Stockholders and We Urge Stockholders to Vote AGAINST the Merger at the Special Meeting\nWe Believe the Incentives of Aviragen's Management and Directors Regarding the Proposed Merger are Not Fully-Aligned with those of Stockholders\nWe Believe Vaxart's True Value is Lower than that Indicated in the Proposed Merger and that Vaxart is Not Ready to be a Public Company\nAviragen Management Has Overseen Disastrous Operational Failures and the Board Has Failed to Take the Necessary Steps to Address these Failures and Enhance Value for all Stockholders\nVOTE THE BLUE PROXY CARD TODAY TO VOTE AGAINST THE PROPOSED MERGER AND SEND A MESSAGE TO THE AVIRAGEN BOARD\nJanuary 24, 2018\nDear Fellow Aviragen Stockholders:\nDigirad Corporation, a Delaware corporation (\"Digirad\"), East Hill Management Company, LLC, a Delaware limited liability company (\"East Hill Management\") and Thomas M. Clay (collectively with certain other participants in the solicitation, the \"Concerned Aviragen Shareholders Group\", the \"CAS Group\", \"we\" or \"us\") are significant stockholders of Aviragen Therapeutics, Inc., a Delaware corporation (\"Aviragen\", \"AVIR\" or the \"Company\"), beneficially owning approximately 8.3% of its outstanding shares of common stock, $0.10 par value per share (the \"Shares\"). The CAS Group is writing to you in connection with the proposed merger (the \"Merger\") between Aviragen and Vaxart, Inc., a Delaware corporation (\"Vaxart\"). The Board of Directors of Aviragen (the \"Board\") has scheduled a special meeting of stockholders for the purpose of approving certain proposals relating to the proposed Merger (the \"Special Meeting\"). The Special Meeting is currently scheduled to be held on February 6, 2018 at 9:00 a.m., local time, at 2500 Northwinds Parkway, Suite 100, Alpharetta, Georgia 30009. In connection with the proposed Merger, Aviragen entered into an Agreement and Plan of Merger and Reorganization, dated as of October 27, 2017 (the \"Merger Agreement\"), with Vaxart and Agora Merger Sub, Inc., a Delaware corporation and a wholly owned subsidiary of Aviragen (\"Merger Sub\").\nWHY WE THINK YOU SHOULD VOTE AGAINST THE MERGER:\nWe believe that the proposed merger between Aviragen and Vaxart is not in the best interests of Aviragen stockholders for numerous reasons:\nWe believe the Process that Led to the Signing of the Merger Agreement was Flawed and that the Incentives of Aviragen's Leadership are Not Fully-Aligned with those of Stockholders\nAviragen Management's Misaligned Incentives\nAviragen's senior management is highly incentivized to complete a transaction in which Aviragen experiences a change of control, which will trigger various enhanced severance obligations to Aviragen's CEO and CFO. The total payments for Dr. Patti are $1,077,196 and for Mr. Colonnese are $556,439 in each case in connection with their termination following a change in control. In addition, while Aviragen has already paid its financial advisor Stifel, Nicolaus & Company, Incorporated (\"Stifel\") $500,000, Stifel also has an incentive in seeing the proposed Merger consummated since it would be entitled to an additional $750,000 payment that is contingent upon the closing of the Merger.\nThere were Potentially Better Options Available\nAs disclosed in the Company's proxy statement/prospectus/information statement on Form S-4, filed with the U.S. Securities and Exchange Commission (the \"SEC\") on December 29, 2017, as amended (the \"Aviragen Merger Proxy Statement\"), in September 2017, Aviragen's transaction committee discussed a nonbinding offer from a \"Party F\" to acquire Aviragen for $0.81 cash per share, which was later increased to $0.84 cash and included contingent value rights payable on approval of any Aviragen program by the FDA. Rather than solicit stockholders' views on the attractiveness of this offer, the Aviragen Board kept this offer confidential and refused to negotiate with Party F unless it agreed to a standstill provision which would prevent it from making a tender offer directly to stockholders. The Board also instructed counsel to begin preparation of a shareholder rights plan (more commonly known as a \"poison pill\"). On the date we filed our joint Schedule 13D, the stock market valued Aviragen's share of the combined company resulting from a merger with Vaxart at $0.57 per share, compared with cash offers of more than $0.80. Furthermore, as an additional measure, the Board agreed to pay a whopping $1.95 million (i.e., 5.7% of the outstanding cash balance as of September 30, 2017) if Aviragen terminated the Merger Agreement with Vaxart and entered into a merger agreement with another company. We believe this is detrimental to Aviragen shareholders and also potential suitors, such as \"Party F.\"\nWe Believe Each of the Valuation Approaches Used by Aviragen are Problematic\nIn our view, the various methods of valuation used by Aviragen to value Aviragen and Vaxart, and as disclosed in the Aviragen Merger Proxy Statement, are extremely subjective and unjustifiably inflate the value of Vaxart and deflate the value of Aviragen. With respect to the comparable and the precedent analysis used by Aviragen and its financial advisor, it is utterly confusing as to why certain companies were included or excluded. For instance, in the comparable analysis we believe that the higher values Stifel attributes to Vaxart's \"vaccine\" comparable company group compared with Aviragen's \"infectious disease\" comparable company group are driven by companies with advanced assets in the cancer vaccine space, in which there is currently large investor interest. In fact, Vaxart's clinical assets all target infectious diseases and its sole program related to cancer is a preclinical asset targeting HPV. We believe it is flawed to value Vaxart based on oncology companies' market valuations when Vaxart's sole oncology program has not yet begun human clinical trials. Removing these companies from Vaxart's comparable group brings down the median and mean of that peer group enormously. Furthermore, the precedent analysis with respect to Aviragen excludes companies acquired for HCV programs, which means that the sale of Inhibitex to Bristol-Myers Squibb was not included, despite the fact that Aviragen's senior management joined the Company from Inhibitex. What's more, the precedent analysis with respect to Vaxart includes companies with approved (even if not yet marketed) products at the time of their acquisition, whereas the Aviragen group was restricted to companies with lead assets in Phase 2. Neither Aviragen nor Vaxart have clinical assets more advanced than Phase 2, though Aviragen enjoys royalties on two marketed products. Incredibly, in the precedent analysis for Vaxart, the Company's financial advisor valued not the acquirers but the targets of precedent vaccine company acquisitions, whose prices obviously include a control premium. While the current Vaxart entity will indeed become a subsidiary of Aviragen, we believe that Vaxart really is the acquirer of Aviragen in the Merger. We also believe the IPO analysis and discounted cash flow analysis were equally flawed.\nVaxart is Not an Attractive Merger Partner in Our View and We Believe the Merger Overvalues Vaxart and Undervalues Aviragen\nIf stockholders do not act now to put a stop to this Merger, the Vaxart-led combined company may be plagued with significant financial issues right out of the gate, which will further diminish value.\nPoor Financial Position\nBased on our review of the Aviragen Merger Proxy Statement, we believe Vaxart's financial situation is precarious, and it is rapidly running out of cash. We believe that the terms of the deal struck between Aviragen's Board and Vaxart are extremely favorable to Vaxart and do not reflect effective bargaining considering Vaxart's extremely weak financial position. Vaxart is being propped up by significant levels of high-interest debt and Vaxart's auditor even expressed substantial doubt about Vaxart's ability to continue as a going concern. In fact, the Aviragen Merger Proxy Statement shows that Vaxart had $5.3 million cash and short term investments at September 30, 2017, compared with cash used in operating activities of $7.8 million over the nine months ended September 30, 2017. Assuming constant cash use of $0.9 million per month, this implies that Vaxart will run out of cash near the end of the first quarter of 2018. In addition, Vaxart reported $44.5 million of liabilities, including $38.4 million of long term debt, on September 30, 2017.\nVaxart's Auditor Questions its Ability to Continue as a Going Concern Citing Material Weaknesses\nVaxart's independent accountant has expressed doubt about Vaxart's ability to continue as a going concern. According to the Aviragen Merger Proxy Statement, Vaxart's auditors identified a material weakness in internal controls over financial reporting in both 2015 and 2016. The material weakness related to Vaxart lacking sufficient qualified resources and adequate processes, thereby impacting Vaxart's ability to appropriately segregate duties and perform effective and timely review of account reconciliations and nonroutine transactions.\nWe Believe Vaxart's True Value is Significantly Lower\nAs discussed above, we believe that the $90 million valuation assigned to Vaxart in the Merger is unrealistically high and the Company and its financial advisor failed to take into account various factors that we believe negatively impact Vaxart's true value. These include the very costly clinical trials and its unexpected announcement that it recently terminated its relationship with its long-time third-party manufacturer and intends to perform these tasks in-house. Indeed, our review of the trends in Vaxart's financing, particularly from raising equity financing, to issuing convertible securities to eventually seeking secured bank financing at a 10.5% effective interest rate plus warrants, reveals to us that the true value of Vaxart is significantly lower than the value attributed to it in the Aviragen Merger Proxy Statement. Furthermore, the implied value assigned to Vaxart by the stock market is vastly lower than that proposed by the Company. Aviragen's current market cap of $22 million implies that the combined company will be worth $55 million (since 40% of $55 million is $22 million). The combined company will have $30 million cash according to the Merger announcement conference call, so the market is valuing the assets of the combined company (including Aviragen's own program BTA074) at $25 million. In our view, this is far from Stifel's valuations.\nIn Our View, the Best Choice Right Now is to Vote AGAINST the Merger\nThe CAS Group believes stockholders should vote against the current proposed Merger with Vaxart given the lack of compelling value delivered versus Aviragen's standalone value, liquidation value or the value of other potential strategic alternatives. We believe that the liquidation and status quo valuations presented in the Aviragen Merger Proxy Statement are unrealistic, inconsistent, and understated to bolster the attractiveness of the Vaxart Merger. For instance, they include costs associated with the Anaconda Pharma contingent payment, but appear to exclude the associated benefits, which, if included, would produce a significant upward swing in the valuation assigned to a standalone scenario.\nWe have Nominated Directors in Connection with the Annual Meeting\nThe Company's last meeting of stockholders to elect directors was well over a year ago. Indeed, we had to file a lawsuit in the Delaware Court of Chancery to compel the Company set a date for such a meeting. The Board has now set a date for an annual meeting for the election of directors as of April 11, 2018 (the \"Annual Meeting\"). Clearly, this is after this Special Meeting, which prevents stockholders from being able to take action to reconstitute the Board prior to the Special Meeting to prevent the Company from following-through with the Merger. The CAS Group believes that the board of directors of a public company should put the company and its stockholders first (rather than management) in reviewing available strategic alternatives. We believe that a new Board will be able to do this more effectively and therefore the CAS Group has nominated a slate of directors at the Annual Meeting who are truly independent and who will fully explore all available strategies to enhance value for Aviragen stockholders. It is the CAS Group's intention to let the new Board come to its own conclusions with respect to the best path for the Company and its stockholders and that is why we are pushing for the Company to hold an Annual Meeting as soon as possible.\nFURTHER CONSIDERATIONS:\nThere are numerous other reasons why we think now is the time for AVIR stockholders to make their voice heard at the Special Meeting by voting AGAINST the Merger:\nManagement Has Overseen Disastrous Operational Failures at Aviragen and the Board has Failed to Take the Necessary Steps to Address these Failures and Enhance Value for all Stockholders\nAviragen Failed to Develop its Most Valuable Asset and Lost its BARDA Contract\nAs of the 2012 year end, Aviragen had a positive outlook. It had two revenue-generating royalty assets, two Phase 2 clinical development programs (laninamivir octanoate for influenza and vapendavir for human rhinovirus), a $231 million contract with the U.S. Office of Biomedical Advanced Research and Development (\"BARDA\") to fund clinical development of laninamivir octanoate, numerous preclinical development programs and $74 million in cash. However, over the next two years, BARDA terminated its contract with Aviragen due to \"product manufacturing, clinical study enrollment pace, costs, and contractor performance\" issues in connection with the project, all of which were Aviragen's responsibility, and despite being successful in Japan, Aviragen was not able to successfully develop laninamivir octanoate. Despite rebranding itself and attempting to develop BTA585, that venture also failed due to similar issues.\nAviragen Has Underperformed its Peers, its Industry and the Market Generally\nIn addition, Aviragen has underperformed its most recent proxy peer group and the general market over the past year. Aviragen's 1-year return is an astounding -53% while the median 1-year return for its proxy peer group is -18.6% and the 1-year return for the Wells Fargo Small Cap Biotech Index and the Russell 2000 Index is approximately 38.3% and 14.9%, respectively.\nThe Board Failed to Remedy Failures and Enhance Value for Stockholders\nIn our opinion, the tremendous failure of laninamivir octanoate and the BARDA contract necessitated CEO Plumb's departure from the CEO role. But, rather than clean house, in September 2014, the Board elevated Plumb to the newly-created role of Executive Chairman, and Dr. Patti became CEO of the Company. It is shocking to us that someone who directly oversaw such disastrous operational results, was not only permitted to remain at the Company, but was moved to a position with even greater power. To add insult to injury, to our knowledge the Company has made no cuts to the base compensation of management or the Board since these catastrophic operational failures. Even after announcing that the Company was seeking strategic alternatives, the Company did not reduce compensation in line with its dramatic reduction of employees, assets, and activities. Instead, on April 3, 2017, the day before the Company announced its review of strategic alternatives, the Board awarded Messrs. Patti and Colonnese a combined 1,050,000 options with exercise prices of $0.656 and which vest over 12 months. What justification is there to pay these individuals the same amount of compensation for significantly less work and poor performance and even reward operational failure with low-priced options over 2.7% of the Company?\nVaxart's Management is Not Credible or Proven\nVaxart's management will be the management of the combined company following the Merger. Given their prior failures in this industry, we believe that they have not shown themselves to be credible or proven managers in this space. Is this really the team that AVIR stockholders want to hire to manage their investment?\nAS STOCKHOLDERS OF AVIRAGEN, ASK YOURSELVES: WHO REALLY BENEFITS FROM THIS MERGER? WE DON'T THINK IT IS AVIR STOCKHOLDERS .\nWE URGE YOU TO VOTE AGAINST THE MERGER ON THE BLUE PROXY CARD\nWe are seeking your support on the BLUE proxy card AGAINST the Merger at Aviragen's annual meeting of stockholders, scheduled for February 6, 2018.\nAs one of AVIR's largest stockholders, our interests are directly aligned with those of all AVIR stockholders. It is up to us, the stockholders of AVIR, to take control of this Company and choose the best strategic options to maximize OUR interests. Protect the value of your investment and vote on the BLUE proxy card at the Special Meeting on February 6, 2018. We look forward to your support at the Special Meeting.\nBest Regards,\nConcerned Aviragen Shareholders Group", "external_links": [], "published": "2018-01-24T17:00:00.000+02:00", "crawled": "2018-01-24T16:57:08.000+02:00", "highlightTitle": ""}