{"organizations": [], "uuid": "f0cdea846fc2c1f28b0b0a8fa1e03fa12e796114", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-dynagas-lng-partners-lp-declares-cash-distribution-on-its-series-a-preferred-units.html", "country": "US", "domain_rank": 767, "title": "Dynagas LNG Partners LP Declares Cash Distribution on Its Series A Preferred Units", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T17:00:00.000+02:00", "replies_count": 0, "uuid": "f0cdea846fc2c1f28b0b0a8fa1e03fa12e796114"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-dynagas-lng-partners-lp-declares-cash-distribution-on-its-series-a-preferred-units.html", "ord_in_thread": 0, "title": "Dynagas LNG Partners LP Declares Cash Distribution on Its Series A Preferred Units", "locations": [], "entities": {"persons": [], "locations": [{"name": "monaco", "sentiment": "none"}], "organizations": [{"name": "dynagas lng partners lp", "sentiment": "negative"}, {"name": "nyse", "sentiment": "none"}, {"name": "dynagas lng partners lp dynagas lng partners lp", "sentiment": "none"}, {"name": "dynagas holding ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONACO, Jan. 24, 2018 (GLOBE NEWSWIRE) -- Dynagas LNG Partners LP (the “Partnership”) (NYSE:DLNG), an owner and operator of LNG carriers, today announced that its Board of Directors has declared a cash distribution of $0.5625 per unit on its Series A Cumulative Redeemable Perpetual Preferred Units (the “Series A Preferred Units”) (NYSE:DLNG PR A) for the period from November 12, 2017 to February 11, 2018.\nThe cash distribution is payable on February 12, 2018 to all preferred unit holders of record as of February 5, 2018.\nDistributions on the Series A Preferred Units will be payable quarterly in arrears on the 12 th day of February, May, August and November of each year, when, as and if declared by our Board of Directors. This is the tenth sequential cash distribution on the Series A Preferred Units since they began trading on the NYSE.\nThe Partnership has 3,000,000 Series A Preferred Units outstanding as of the date of this press release.\nAbout Dynagas LNG Partners LP\nDynagas LNG Partners LP. (NYSE:DLNG) is a growth-oriented master limited partnership formed by Dynagas Holding Ltd., its sponsor, to own and operate liquefied natural gas (LNG) carriers employed on multi-year charters. The Partnership’s current fleet consists of six LNG carriers, with aggregate carrying capacity of approximately 914,000 cubic meters.\nVisit the Partnership’s website at www.dynagaspartners.com\nContact Information:\nDynagas LNG Partners LP\n23, Rue Basse, 98000 Monaco\nAttention: Michael Gregos\nTel. +37799996445\nEmail: management@dynagaspartners.com\nInvestor Relations/ Financial Media:\nNicolas Bornozis\nPresident Capital Link, Inc.\n230 Park Avenue, Suite 1536\nNew York, NY 10169\nTel. (212) 661-7566\nE-mail: dynagas@capitallink.com\nForward-Looking Statements\nMatters discussed in this press release may constitute forward-looking statements. The Private Securities Litigation Reform Act of 1995 provides safe harbor protections for forward-looking statements in order to encourage companies to provide prospective information about their business. Forward-looking statements include statements concerning plans, objectives, goals, strategies, future events or performance, and underlying assumptions and other statements, which are other than statements of historical facts.\nThe Partnership desires to take advantage of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 and is including this cautionary statement in connection with this safe harbor legislation. The words “believe,” “anticipate,” “intends,” “estimate,” “forecast,” “project,” “plan,” “potential,” “may,” “should,” “expect,” “expected,” “pending” and similar expressions identify forward-looking statements.\nThe forward-looking statements in this press release are based upon various assumptions, many of which are based, in turn, upon further assumptions, including without limitation, examination by the Partnership’s management of historical operating trends, data contained in its records and other data available from third parties. Although the Partnership believes that these assumptions were reasonable when made, because these assumptions are inherently subject to significant uncertainties and contingencies which are difficult or impossible to predict and are beyond the Partnership’s control, the Partnership cannot assure you that it will achieve or accomplish these expectations, beliefs or projections.\nIn addition to these important factors, other important factors that, in the Partnership’s view, could cause actual results to differ materially from those discussed in the forward-looking statements include the strength of world economies and currencies, general market conditions, including fluctuations in charter rates and vessel values, changes in demand for Liquefied Natural Gas (LNG) shipping capacity, changes in the Partnership’s operating expenses, including bunker prices, drydocking and insurance costs, the market for the Partnership’s vessels, availability of financing and refinancing, changes in governmental rules and regulations or actions taken by regulatory authorities, potential liability from pending or future litigation, general domestic and international political conditions, potential disruption of shipping routes due to accidents or political events, vessel breakdowns and instances of off-hires and other factors. Please see our filings with the U.S. Securities and Exchange Commission for a more complete discussion of these and other risks and uncertainties. The information set forth herein speaks only as of the date hereof, and the Partnership disclaims any intention or obligation to update any forward-looking statements as a result of developments occurring after the date of this communication.\nSource:Dynagas LNG Partners LP", "external_links": ["https://www.globenewswire.com/Tracker?data=adjHRhwJU0yKQrhooYXJ_-q4o6YZBvO7DRffAD8jd5WcTDZAn7O1_MonwGY9zqQojy51AHCPgLEQcMdg6uCcEinbkISHEtAOB3ESlssugGU=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/15d04c09-a2e8-4e97-8f4b-332c2108802d"], "published": "2018-01-24T17:00:00.000+02:00", "crawled": "2018-01-24T16:57:26.000+02:00", "highlightTitle": ""}