{"organizations": [], "uuid": "20934aa03b0a1ce7e9f1b8f127c3b3ec52ce16cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223754516&w=1200&r=LYNXMPEE0K01S", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-northkorea/north-korean-delegation-arrives-in-south-korea-for-olympics-prep-idUKKBN1FA00R", "country": "US", "domain_rank": 408, "title": "North Korean delegation arrives in South Korea for Olympics prep", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T07:20:00.000+02:00", "replies_count": 0, "uuid": "20934aa03b0a1ce7e9f1b8f127c3b3ec52ce16cc"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-northkorea/north-korean-delegation-arrives-in-south-korea-for-olympics-prep-idUKKBN1FA00R", "ord_in_thread": 0, "title": "North Korean delegation arrives in South Korea for Olympics prep", "locations": [], "entities": {"persons": [{"name": "yuna park", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "gangwon", "sentiment": "none"}, {"name": "gangneung city", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "ytn", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 1:55 AM / Updated 2 hours ago Seoul says North Korea's Olympic participation will aid peace and ease tensions Yuna Park 4 Min Read \nSEOUL (Reuters) - Seoul welcomed confirmation by the International Olympic Committee (IOC) that 22 North Korean athletes would compete in next month’s Winter Olympics, saying on Sunday it would aid peace and the easing of tensions on the Korean peninsula. \nIn the first of a series of preparatory visits, North Korean music and arts officials arrived in South Korea on Sunday to inspect sites for performances during the Olympics. \n“North Korea’s participation in the Olympics will be a catalyst for building peace and easing tensions on the Korean peninsula,” said South Korea’s presidential Blue House in a statement released on Sunday. \nThe visit to the South marks the first by North Koreans since South Korean President Moon Jae-in took office in May last year and sought to re-engage with the North. \n“President Moon has previously stressed that the Pyeongchang Olympics should be an important turning point in solving North Korea’s missile issues,” the Blue House statement said. \nThe seven-member North Korean delegation, led by musician Hyon Song-wol, will check venues for performances by a 140-strong art troupe at the Olympics. \nThe officials are scheduled to spend two days inspecting art centres in Seoul and Gangneung city, which will also host several of the Olympic events. A bus transporting a North Korean team which will inspect an art venue for the 2018 PyeongChang Winter Olympics arrives on the Grand Unification Bridge near the demilitarized zone separating the two Koreas in Paju, South Korea, January 21, 2017. Shin Joon-hee/Yonhap via REUTERS \nSouth Korean broadcaster YTN reported the delegation had arrived in Seoul early Sunday under a heavy police presence, then boarded a train to Gangwon province, where the Olympics will be held from Feb. 9-25. \nThe two sides also agreed on Sunday to plans for another team of North Korean sports officials to inspect Olympic venues and accommodations from Jan. 25-27, South Korea’s unification ministry said. \nIn a diplomatic breakthrough after a year of escalating tension over the North’s nuclear and missile programme, the IOC announced on Saturday that North Korea will send 22 athletes to the Winter Games and compete in three sports and five disciplines. \nNorth Korea’s state-run KCNA news agency released a commentary on Sunday criticising some South Korean politicians and media who have questioned Pyongyang’s motives in reaching out even as it refuses to honour repeated United Nations Security Council resolutions targeting its nuclear weapons and ballistic missile programme. \n“There is no doubt about the sincerity and authenticity of the DPRK to improve the North-South relations and to ensure successful Olympics,” KCNA said, referring to North Korea by its official name, the Democratic People’s Republic of Korea. \nUntil the IOC confirmation, a figure skating pair were the only North Koreans to have secured a spot at the Games through the conventional qualifying competition, although they lost their place after failing to register. \nSunday’s North Korean delegation had been scheduled to visit on Saturday but cancelled just before the visit with no explanation. Officials from both Korea’s used a cross-border hotline to quickly reschedule the visit. \nAlso on Sunday, South Korean officials said Pyongyang had accepted proposals for South Koreans to travel to North Korea for joint athletic training at the Masikryong Ski Resort and a cultural event at Mount Kumgang, a once popular tourist area. Writing by Josh Smith; Editing by Michael Perry", "external_links": [], "published": "2018-01-21T07:20:00.000+02:00", "crawled": "2018-01-21T08:11:19.000+02:00", "highlightTitle": ""}