{"organizations": [], "uuid": "59415a1cf0450392f4ce4f208e335acfcf1c7929", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226323010&w=1200&r=LYNXMPEE0S13I", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews\r", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/usa-trump-5g-fcc/u-s-fcc-chief-says-he-would-oppose-a-national-5g-network-idINKBN1FI1TU", "country": "US", "domain_rank": 408, "title": "U.S. FCC chief says he would oppose a national 5G network", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:40:00.000+02:00", "replies_count": 0, "uuid": "59415a1cf0450392f4ce4f208e335acfcf1c7929"}, "author": "", "url": "https://in.reuters.com/article/usa-trump-5g-fcc/u-s-fcc-chief-says-he-would-oppose-a-national-5g-network-idINKBN1FI1TU", "ord_in_thread": 0, "title": "U.S. FCC chief says he would oppose a national 5G network", "locations": [], "entities": {"persons": [{"name": "susan heavey", "sentiment": "none"}, {"name": "chizu nomiyama", "sentiment": "none"}, {"name": "ajit pai", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "katanga", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. fcc", "sentiment": "negative"}, {"name": "u.s. federal communications commission", "sentiment": "none"}, {"name": "fcc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 2:44 PM / Updated 2 hours ago Trump team idea to nationalize 5G network to counter China is rejected David Shepardson 6 Min Read \nWASHINGTON (Reuters) - The top U.S. communications regulator, wireless companies and some lawmakers oppose an idea by members of President Donald Trump’s national security team for the government to build a 5G wireless network to counter China spying on phone calls. \nThe Trump administration has taken a harder line with China on policies initiated by predecessor President Barack Obama on issues ranging from Beijing’s role in restraining North Korea to Chinese efforts to acquire U.S. strategic industries. \nThe option of a nationalized 5G network was being discussed by Trump’s national security team, an administration official said on Sunday. \nWhite House spokeswoman Sarah Sanders said on Monday that discussions were at “the very earliest stages” to ensure a “secure network,” and “absolutely no decisions” have been made. \nThe government has blocked a string of Chinese acquisitions over national security concerns and the 5G network concept is aimed at addressing what officials see as China’s threat to U.S. cyber security and economic security. \nBut the option was rejected by several of those who would have a say. \n“Any federal effort to construct a nationalized 5G network would be a costly and counterproductive distraction from the policies we need to help the United States win the 5G future,” Federal Communications Commission (FCC) Chairman Ajit Pai, a Republican appointed by Trump, said in a statement on Monday. \nCTIA, the trade group that represents AT&T Inc, Verizon Communications Inc, Apple Inc, Sprint Corp and others, said in a statement on Monday that the “government should pursue the free market policies that enabled the U.S. wireless industry to win the race to 4G.” \nCarriers have already spent billions of dollars acquiring spectrum and beginning to develop and test 5G networks, which are expected to be at least 100 times faster than current 4G networks and cut latency to less than one thousandth of a second from one hundredth of a second in 4G, the FCC said. \nThe more responsive networks could allow, for example, for real-time remote operations such as medical procedures and running large machines. \nA U.S.-built 5G network could in theory be more resilient to Chinese government intrusions. A leaked National Security Council memo published by Axios news website on Sunday said China is the dominant manufacturer of network infrastructure and notes the importance of building the network with “equipment from a trusted supply chain.” Chairman Ajit Pai speaks ahead of the vote on the repeal of so called net neutrality rules at the Federal Communications Commission in Washington, U.S., December 14, 2017. REUTERS/Aaron P. Bernstein/Files \nThe primary suppliers for the 5G networks in the United States are expected to be firms such as Nokia and Ericsson, with networking firms such as Juniper Networks, Cisco Systems and Qualcomm Inc supplying chips and back end equipment. It was unclear whether the option discussed would involve working with those companies. \nThe rules for 5G networks are still being worked out by industry players. The work has been complicated by an effective ban in the United States on two of the largest firms, Chinese suppliers Huawei Technologies Co Ltd and ZTE Corp since a 2012 investigation over links to potential Chinese spying, something the companies have denied. \nEarlier this year, U.S. lawmakers urged AT&T to cut commercial ties with Huawei. \nU.S. Senator Mark Warner, a Democrat and vice chair of the Senate Select Committee on Intelligence, said that while he agreed there were “serious concerns relating to the Chinese government’s influence into network equipment markets” he thought the proposal for the federal government to build a standalone network would be “expensive and duplicative.” A video promotes the 5G mobile wireless standard at the Qualcomm booth during the 2017 CES in Las Vegas, Nevada January 6, 2017. REUTERS/Steve Marcus/Files \nAny 5G nationalisation plan would likely cost hundreds of billions of dollars, wireless carriers said. \nRepresentative Greg Walden, a Republican who chairs the Energy and Commerce Committee, dismissed the idea. \n“We’re not Venezuela. We don’t need to have the government run everything,” Walden said. He noted that government data has been hacked, but said it was important 5G networks are “safe and secure.” \nShares of the biggest U.S. wireless carriers fell at the start of trade on Monday, with Verizon and AT&T down 1 percent. Related Coverage Trump security team sees building U.S. 5G network as option \nThe administration official who spoke to Reuters confirmed the gist of the Axios report and said the option was being debated at a low level in the administration and was six to eight months away from being considered by the president. \n“This has been building for months. I don’t think the White House options papers do justice to the issue. It goes much deeper,” said Michael Wessel, a commissioner on the U.S.-China Economic and Security Review Commission, which works for Congress and follows China issues. \nApart from FCC chairman Pai, three of remaining four FCC commissioners also said on Monday that they opposed nationalizing the 5G network, while the fourth expressed skepticism. \nCommissioner Jessica Rosenworcel, a Democrat, said the memo “correctly diagnoses a real problem. There is a worldwide race to lead in 5G and other nations are poised to win. But the remedy proposed here really misses the mark.” Reporting by Susan Heavey, Katanga Johnson and David Shepardson, additional reporting by Diane Bartz in Washington and Stephen Nellis in San Francisco; Editing by Andrew Hay and Grant McCool", "external_links": [], "published": "2018-01-29T16:40:00.000+02:00", "crawled": "2018-01-29T17:02:16.003+02:00", "highlightTitle": ""}