{"organizations": [], "uuid": "74d8cdc74576666afa1e376426a469b5b376777f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-wolters-kluwer-health-to-divest-provation.html", "country": "US", "domain_rank": 767, "title": "Wolters Kluwer Health to Divest ProVation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-11T10:01:00.000+02:00", "replies_count": 0, "uuid": "74d8cdc74576666afa1e376426a469b5b376777f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-wolters-kluwer-health-to-divest-provation.html", "ord_in_thread": 0, "title": "Wolters Kluwer Health to Divest ProVation", "locations": [], "entities": {"persons": [{"name": "diana nole", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "wolters kluwer health", "sentiment": "negative"}, {"name": "wolters kluwer health to divest provation wolters kluwer health", "sentiment": "negative"}, {"name": "clearlake capital group", "sentiment": "none"}, {"name": "provation medical", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wolters Kluwer Health to Divest ProVation\nJanuary 11, 2018 - Wolters Kluwer Health has signed an agreement to divest ProVation Medical, its procedure documentation and order set management software business, to Clearlake Capital Group, L.P. for $180 million (approximately €150 million) in cash.\nThe divestment reflects the Health division's increasing focus on supporting healthcare providers in delivering improved patient outcomes by offering a broad and cohesive suite of products, from healthcare learning and research, to advanced clinical decision support, terminology management and patient engagement. This broad-based, multispecialty and integrated range of solutions can most effectively help healthcare providers in improving outcomes and reducing variability in care.\nProVation Medical is the U.S. market-leader in gastroenterology procedure documentation software and is also a major supplier of order sets to hospitals and ambulatory surgery centers. The business had revenues of €65 million in 2016 and has approximately 200 employees.\nDiana Nole, CEO of Wolters Kluwer Health, said, \"As we continue to evolve the Wolters Kluwer Health business, we are pleased to have found a buyer for ProVation who has extensive experience in software and technology and is well-positioned to continue delivering superior products to our mutual customers.\"\nBehdad Eghbali, Co-Founder and Managing Partner of Clearlake , and Prashant Mehrotra, Partner of Clearlake, said, \"We are excited to welcome ProVation as a new platform investment into the Clearlake portfolio. The business has a strong reputation among its customer base for providing mission critical software with the highest degree of customer satisfaction. We are committed to investing in the business and partnering with the ProVation team to help drive the next phase of growth.\"\nCompletion of the divestment is subject to customary closing conditions and is expected to take several months. Assuming completion, Wolters Kluwer intends to deploy the proceeds of the divestment towards additional share repurchases in order to mitigate the expected earnings dilution.\nAbout Wolters Kluwer\nWolters Kluwer N.V. (AEX: WKL) is a global leader in information services and solutions for professionals in the health, tax and accounting, finance, risk and compliance, and legal sectors. We help our customers make critical decisions every day by providing expert solutions that combine deep domain knowledge with specialized technology and services.\nWolters Kluwer reported 2016 annual revenues of €4.3 billion. The company, headquartered in Alphen aan den Rijn, the Netherlands, serves customers in over 180 countries, maintains operations in over 40 countries, and employs 19,000 people worldwide.\nWolters Kluwer shares are listed on Euronext Amsterdam (WKL) and are included in the AEX and Euronext 100 indices. Wolters Kluwer has a sponsored Level 1 American Depositary Receipt program. The ADRs are traded on the over-the-counter market in the U.S. (WTKWY).\nFor more information about our solutions and organization, visit www.wolterskluwer.com , follow us on Twitter , Facebook , LinkedIn , and YouTube .\nMedia Annemarije Dérogée-Pikaar Ann Joyal Global Brand & Communications Global Brand & Communications, Health t + 31 172 641 470 781-392-3831 annemarije.pikaar@wolterskluwer.com ann.joyal@wolterskluwer.com Investors/Analysts\nMeg Geldens\nInvestor Relations\nt + 31 172 641 407\nir@wolterskluwer.com\nForward-looking Statements and Other Important Legal Information\nThis report contains forward-looking statements. These statements may be identified by words such as \"expect\", \"should\", \"could\", \"shall\" and similar expressions. Wolters Kluwer cautions that such forward-looking statements are qualified by certain risks and uncertainties that could cause actual results and events to differ materially from what is contemplated by the forward-looking statements. Factors which could cause actual results to differ from these forward-looking statements may include, without limitation, general economic conditions; conditions in the markets in which Wolters Kluwer is engaged; behavior of customers, suppliers, and competitors; technological developments; the implementation and execution of new ICT systems or outsourcing; and legal, tax, and regulatory rules affecting Wolters Kluwer's businesses, as well as risks related to mergers, acquisitions, and divestments. In addition, financial risks such as currency movements, interest rate fluctuations, liquidity, and credit risks could influence future results. The foregoing list of factors should not be construed as exhaustive. Wolters Kluwer disclaims any intention or obligation to publicly update or revise any forward-looking statements, whether as a result of new in formation, future events or otherwise.\nThis press release contains information which is to be made publicly available under Regulation (EU) 596/2014.\nAttachments:\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/643db9f4-608a-4faa-b855-0fa8c8a84b8c\nSource:Wolters Kluwer NV", "external_links": ["https://www.globenewswire.com/Tracker?data=5m6ICzj3wvu0oeRPjiuvS7dcaWqfDKzjTFkuWF9fD_yS-C5DHo-91Vm5ndJrJKqsgBZmMYinf4DMt-9s3NTm-MztUekvAXIkXdy0ixoi1ec=", "https://www.globenewswire.com/Tracker?data=K3t7_FPzPbmk5E8CYTVFNEQAkdKdqUPpj5bFtAcC-vfQdYZTns9SeYukl9GX9-DGybK0Szv8iDlWYQdcrLB8qJ4DDu6Foc6d6NtuseEK2mY=", "https://www.globenewswire.com/Tracker?data=H5H2e9v_1rWRTaN50Rv8mmiJYKQXCP5aX1hV2r1oznp-RhuQvr3wsBI89oQG1QLjOVjYfdtVWg15TQNBdDupLDbcx-eSGDOPiYHDMQV2iS0dhuhmJA-L8mRC8rC1S6tetK6Ruqmuht5H56avhbvxR-6jqveWEVriV-U0leCMu4VHYapmoux-iBUJZXQwzQLYiLCx8QpnZZULh8mJ64244w==", "https://www.globenewswire.com/Tracker?data=zSer2Oipm55C56z13_6360xcBtEnsiSfDxkp6SmiS_Hb3eCaPh5F7HZ1DM6GsIkuAGrIDyJ3nyYDKTQvriv5MA==", "https://www.globenewswire.com/Tracker?data=rfpK-riv__qWMU47fyuzOkQOT8gimbJtMvQS64HodbFMqyI_SX6YkMW4wLHM9s5kkS1fhI5cCR9LD0eyHctpRUEhyaueLb_kjHY09-OWoMn-Pj4jWQMLcT0TKc6xOoga4hBQrVE_u_u4AmxhYyWPQPc7PTGKCardqfcy6lyFkybDVMPetV8GwSUtBoyqsb1XMIcTDbkBYln_IJJ3KjNulGt4Kz5-9DCWzGA1_oDW7yAxAZzhpt0e3crBi0vluiTfcHh7MLDbCpgHfFARlYhflA==", "https://www.globenewswire.com/Tracker?data=SDzDLAHPBKwNMgpUnMpN8Y98yvSz2vW3aUTGemID__YDgVbt_Akkmv3WApM_DH3A_geLeVWuNpvUnefGCpeo4OjcQUanv-hPTlAAZBCn4fI=", "http://www.globenewswire.com/NewsRoom/AttachmentNg/643db9f4-608a-4faa-b855-0fa8c8a84b8c", "https://www.globenewswire.com/Tracker?data=pevWj1ef5_Oi-gnGubLcSedJ_xlNzFDlNjJR0ZSMXhJ9Jhnni3oEaSGMs9lDvEr414blJUcMOMij5b19QZNM9A==", "https://www.globenewswire.com/Tracker?data=ODKlE6NOjrpVR4uzT4RhphAbMFdnKuwZj4IhtddN2Ed1GQXiYSgTbZGhTgBh500ECahxHlO6XlTVYOZhDmeQFT9YDYdNm1banZofh8LHZb4="], "published": "2018-01-11T10:01:00.000+02:00", "crawled": "2018-01-11T11:56:47.031+02:00", "highlightTitle": ""}