{"organizations": [], "uuid": "c011ca7a5b0dcaf3058d5a1185d3831cd8d69fd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-900825708.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/decline-trust-shutdown-workweek-sanofi-bioverativ/", "country": "US", "domain_rank": 1196, "title": "Decline of Trust, Government Shutdown: CEO Daily for January 20, 2018 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-22T07:52:00.000+02:00", "replies_count": 0, "uuid": "c011ca7a5b0dcaf3058d5a1185d3831cd8d69fd9"}, "author": "Alan Murray", "url": "http://fortune.com/2018/01/22/decline-trust-shutdown-workweek-sanofi-bioverativ/", "ord_in_thread": 0, "title": "Decline of Trust, Government Shutdown: CEO Daily for January 20, 2018 | Fortune", "locations": [], "entities": {"persons": [{"name": "richard edelman", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "edelman trust", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "5:52 AM EST \nGood morning. \nThe public’s trust in all institutions—government, business, media and non-government organizations—has taken a nosedive in the U.S. in the last year, according to the annual Edelman Trust survey, released this morning in advance of the World Economic Forum in Davos. The decline in trust in government was greatest, falling 14 percentage points, while trust in business fell 10 points, NGOs 9 points, and media 5 points. Worth noting is the survey was done before the government shutdown, which likely will deepen the public’s mistrust. \nThe survey covers 28 nations, none of which recorded a decline in trust as great as that in the U.S. At the other extreme, Chinese respondents recorded a significant increase in trust in all four types of institutions, with government and business leading the way. \n“The United States is enduring an unprecedented crisis of trust,” said Richard Edelman, president and CEO of the communications firm that conducts the survey. “This is the first time that a massive drop in trust has not been linked to a pressing economic issue or catastrophe like the Fukushima nuclear disaster. In fact, it’s the ultimate irony that it’s happening at a time of prosperity, with the stock market and employment rates in the U.S. at record highs.” \nThe root cause of the fall, says Edelman: lack of objective facts and rational discourse in the U.S. You can read the full report here . \nI’m on my way to Davos this morning, and will be reporting from there all week. News below. Alan Murray Top News \nU.S. Government Shutdown Continues \nModerate senators from the Republicans and Democrats failed to strike a deal that would have ended the U.S. government’s shutdown, which enters its third day on Monday, the start of the working week. The moderates proposed linking a three-week extension of government funding to the consideration of an immigration bill in the Senate, but Democrats saw too many caveats. Washington Post \nSanofi Buys Bioverativ \nFrance’s Sanofi is to spend more than $11.5 billion buying hemophilia drug firm Bioverativ, the company announced today. The deal represents a premium of 63% on Bioverativ’s closing stock price Friday. Sanofi is beefing up its portfolio ahead of the appearance of generic versions of its best-selling Lantus insulin. Wall Street Journal \nTax Reform Hits UBS \nThe Swiss bank UBS has reported a $3 billion write-down of deferred tax assets for the fourth quarter of 2017, thanks to last year’s U.S. tax reform. If it weren’t for that, UBS would have recorded more than $4 billion in profits for the quarter. UBS also said it would buy back $2.1 billion in stock over three years. Financial Times \nGerman Coalition Hope \nGermany may have a new government in a couple months’ time, after the second-biggest party, the Social Democrats (SPD), tentatively voted to formally begin coalition talks with Angela Merkel’s Christian Democrats (CDU). There had been fierce debate within the smaller party over whether another “Grand Coalition” was a good idea. Economist Around the Water Cooler \nAmazon’s Automated Store \nAmazon has opened its fully-automated, employee-free Amazon Go store to the Seattle public, having previously only made it available to employees. Sensors and artificial intelligence tell the store’s systems what people are taking off the shelves, and identify shoppers so they can be charged on their way out. Fortune \nInequality On the Rise \nA whopping 82% of the wealth generated last year went into the pockets of the world’s richest 1%, according to a new report from the charity Oxfam. As for the poorest half of the world’s population, numbering 3.7 billion people, they saw no increase in their wealth. Oxfam released the report just ahead of this week’s Davos gathering. Guardian \nPapal Mega-Mass \nThe Pope ended a tour of South America with an open-air mass for over a million people in Lima, Peru. Pope Francis also described Latin American politics as “more sick than well” because of corruption. He highlighted the case of Brazilian construction firm Odebrecht, which bribed politicians across the region. BBC \nSouth Korea and Bitcoin \nThe South Korean government, whose apparent intention to crack down on cryptocurrency exchanges has added volatility to the bitcoin market, reportedly wants to force the exchanges to share transaction data with banks. It will also reportedly “collect up to 24.2 percent of corporate and local income taxes from South Korea’s cryptocurrency exchanges this year.” Yonhap \nThis edition of CEO Daily was edited by David Meyer . Find previous editions here , and sign up for other Fortune newsletters here . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-22T07:52:00.000+02:00", "crawled": "2018-01-22T16:00:46.004+02:00", "highlightTitle": ""}