{"organizations": [], "uuid": "af3012c20bcf3fd16c0de65e03507d1ee7e36ce4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/EarningsUS", "section_title": "Earnings News &amp; Latest Company Earnings Results | Reuters.com", "url": "https://www.reuters.com/article/us-pearson-outlook/pearson-hit-again-as-weak-u-s-demand-weighs-on-education-group-idUSKBN1F60ZZ", "country": "US", "domain_rank": 408, "title": "Pearson hit again as weak U.S. demand weighs on education group", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:26:00.000+02:00", "replies_count": 0, "uuid": "af3012c20bcf3fd16c0de65e03507d1ee7e36ce4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-pearson-outlook/pearson-hit-again-as-weak-u-s-demand-weighs-on-education-group-idUSKBN1F60ZZ", "ord_in_thread": 0, "title": "Pearson hit again as weak U.S. demand weighs on education group", "locations": [], "entities": {"persons": [{"name": "pearson", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Pearson ( PSON.L ) said it had seen no let up in the pressures weighing on its North American business as retail partners turned increasingly cautious when ordering books, sending its shares down more than 6 percent.\nIn a full-year trading update, Pearson said sales in U.S. higher education course materials fell 3 percent on an underlying basis, in line with the lower end of its revised guidance range.\nHowever, that disappointed some investors as the group had said in October that the pressures were easing.\nFor 2018 it forecast revenues from the U.S. higher education courseware business to be flat to down by a mid-single digit percent. Its shares fell 6.5 percent by 0905 GMT.\nHit by the shift to digital from paper textbooks, Pearson has cut thousands of jobs and launched a rental and online business after students stopped buying expensive text books, forcing a string of profit warnings.\nThe British company said its restructuring had helped to protect profit in 2017 and would enable it to eke out underlying growth in 2018, but investors zeroed in on the latest cautious language around the U.S. business.\n“Our restructuring program is on track and our 2017 performance has set us up well to make further progress against our strategic priorities and grow profit in 2018,” Chief Executive John Fallon said.\nThe group had sold businesses such as the Financial Times newspaper and the Economist magazine to focus on education but has struggled as the market changed.\nIn August, Pearson said it would slash its dividend and cut another 3,000 jobs. By 2020, Fallon will have reduced Pearson’s staff by 10,000 from around 39,000 when he took over in 2013.\nAt the profit level it forecast a 2018 figure of between 520 million to 560 million pounds ($716-772 million) which it said would constitute underlying growth when taking account of asset sales and currency moves.\nAnalysts said the profit forecast was in line with expectations but noted the ongoing problems in the U.S. business.\n“The group does not see a change in trends and highlighted the cautious buying behavior of channel partners in the fourth quarter,” analysts at Liberum said.\nPearson said it now expects 2017 adjusted operating profit of around 570 million to 575 million pounds, lower than previously indicated, reflecting currency changes.($1 = 0.7257 pounds)\nReporting by Kate Holton; editing by Jason Neely and Keith Weir\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T17:26:00.000+02:00", "crawled": "2018-01-17T11:58:11.000+02:00", "highlightTitle": ""}