{"organizations": [], "uuid": "2553a397b4b9b9da965d288a6aaeed285d72f5ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226924746&w=1200&r=LYNXMPEE0U0R4", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-dr-horton-results/homebuilder-d-r-hortons-profit-drops-8-5-percent-idUSKBN1FK1IM", "country": "US", "domain_rank": 408, "title": "Homebuilder D.R. Horton's profit drops 8.5 pct", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T13:35:00.000+02:00", "replies_count": 0, "uuid": "2553a397b4b9b9da965d288a6aaeed285d72f5ca"}, "author": "", "url": "https://www.reuters.com/article/us-dr-horton-results/homebuilder-d-r-hortons-profit-drops-8-5-percent-idUSKBN1FK1IM", "ord_in_thread": 0, "title": "Homebuilder D.R. Horton's profit drops 8.5 pct", "locations": [], "entities": {"persons": [{"name": "min rea", "sentiment": "negative"}, {"name": "d.r. horton", "sentiment": "negative"}, {"name": "arunima banerjee", "sentiment": "none"}, {"name": "arun koyyur", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "d.r. horton inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 11:45 AM / Updated an hour ago Higher home sales drive D.R. Horton's profit, revenue beat Arunima Banerjee 3 Min Read \n(Reuters) - D.R. Horton Inc ( DHI.N ) reported first-quarter profit and revenue on Wednesday above Wall Street estimates as the biggest U.S. homebuilder sold more homes, sending its shares up as much as 5.6 percent in morning trading. \nOrders, an indicator of future revenue for homebuilders, rose 16.4 percent to 10,753 homes in the quarter as job growth fueled demand in spite of higher prices due to rising construction costs. \nD.R. Horton, which mainly sells single-family homes, said it expects fiscal 2018 gross margin to be around 20-21 percent, with some fluctuations in the quarters ahead, compared with its prior forecast of around 20 percent. \nWith the margin forecast, the homebuilder was bucking the trend in the industry, Edward Jones analyst Robin Diedrich wrote in a client note. \nOn Tuesday, smaller rival PulteGroup Inc ( PHM.N ) warned of decline in gross margin this year, citing higher land, labor and raw material costs. \nHowever, Pulte and Lennar Corp ( LEN.N ) remained upbeat on housing demand despite climbing interest rates and changes in U.S. tax laws related to mortgage debts. \nWhile tax cuts will not have a “significant negative impact”, the company expects to benefit from the higher disposable income in the hands of customers, a company executive said in the earnings call. \nD.R. Horton said it expects to sell between 50,500 and 52,500 homes in fiscal 2018 and reaffirmed its revenue forecast to be between $15.5 billion and $16.3 billion. \n“With recent fears around higher rates appearing to ease somewhat, at least temporarily, we expect that DHI shares will perform well today,” MKM Partner analyst Megan McGrath wrote in a note. \nHome prices in 20 metropolitan areas rose 6.4 percent in November and consumer confidence rebounded in January, a set of consumer data released on Tuesday showed. \nD.R. Horton, which also sells townhomes and condominiums, said the number of homes it sold in the quarter rose 14.1 percent to 10,788. \nBut the average selling price slipped 1 percent to $295,200 from a year earlier, as it sold more affordable homes. \nNet income attributable to the company fell 8.5 percent to $189.3 million, or 49 cents per share, in the quarter ended Dec. 31, hurt by a tax-related charge. \nExcluding the charge, it earned 77 cents per share, beating average analysts’ estimate of 49 cents, according to Thomson Reuters I/B/E/S. \nRevenue rose 14.8 percent to $3.33 billion, beating the estimate of $3.26 billion. \nShares of the Fort Worth, Texas-based company partly pared its earlier gains and were trading at $49.39. Up to Tuesday’s close, they have risen 58 percent in the last 12 months. Reporting by Arunima Banerjee in Bengaluru; Editing by Arun Koyyur", "external_links": [], "published": "2018-01-31T13:35:00.000+02:00", "crawled": "2018-01-31T13:55:41.067+02:00", "highlightTitle": ""}