{"organizations": [], "uuid": "3a57564f583c6a093cb273cd0e446d850cbeb4a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222152286&w=1200&r=LYNXMPEE0E0XO", "site_section": "http://feeds.reuters.com/reuters/Lifestyle", "section_title": "Reuters: Lifestyle", "url": "https://www.reuters.com/article/us-germany-refugees/ancient-greek-tragedy-tells-timeless-story-of-syrian-flight-idUSKBN1F41R0", "country": "US", "domain_rank": 408, "title": "Ancient Greek tragedy tells timeless story of Syrian flight", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:52:00.000+02:00", "replies_count": 0, "uuid": "3a57564f583c6a093cb273cd0e446d850cbeb4a1"}, "author": "", "url": "https://www.reuters.com/article/us-germany-refugees/ancient-greek-tragedy-tells-timeless-story-of-syrian-flight-idUSKBN1F41R0", "ord_in_thread": 0, "title": "Ancient Greek tragedy tells timeless story of Syrian flight", "locations": [], "entities": {"persons": [{"name": "sy", "sentiment": "neutral"}, {"name": "hebatullah alabdou", "sentiment": "none"}, {"name": "omar abusaada", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - A group of Syrian women are adapting the Euripides’ tragedy “Iphigenia”, using a a play set during an ancient war to bring Berlin audiences closer to the plight of women driven from their homeland by conflict.\nThe play, staged this month and next in Berlin’s historic Volksbuehne, is an adaptation of Euripides’ 2,500-year-old story of a princess sacrificed by her father, the Greek King Agamemnon, to placate an angry goddess.\nNine Syrian young women living in Germany stood on the stage last Friday, telling their personal stories of escape and of their lives in a new country in this adaptation of a play set on the eve of Agamemnon’s 10-year war to capture the city of Troy.\n“The project, through its different episodes, intends to produce a document of the lives of Syrians in different phases(of the Syrian war), especially from the point of view of women,” said Omar Abusaada, the play’s director.\nHebatullah Alabdou attends a rehearsal for the Greek tragedy 'Iphigenia' with Syrian refugee women at Volksbuehne Theatre in Berlin, Germany January 12, 2018. Picture taken January 12, 2018. REUTERS/Hannibal Hanschke It is the third part of an international theater project aimed at showing the lives of displaced Syrian women, inviting audiences to identify them as individuals rather than as refugees from a war-torn country. The first two episodes were performed in Jordan and Lebanon in 2013 and 2014.\nMore than a million migrants, many of them fleeing conflict in the Middle East, have arrived in Germany since mid-2015, and around a third of them are girls and women.\nSlideshow (4 Images) The adaptation was first performed as stories in September in the echoing halls of the former Tempelhof airport, which now serves as one of Berlin biggest refugee camps.\n“(In the play) we start thinking of their stories not as those of refugees but as individuals who have their rich characters,” said Mohammad Al Attar, author of the adaptation.\n“(Women) who are similar to their German, French, Sudanese or Canadian fellows,” Al Attar said.\nReporting By Riham Alkousaa, editing by Thomas Escritt/Jeremy Gaunt\n ", "external_links": [], "published": "2018-01-15T15:52:00.000+02:00", "crawled": "2018-01-15T16:12:47.001+02:00", "highlightTitle": ""}