{"organizations": [], "uuid": "45579f55a7baa76401d3d76013b3f6647910beac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-sun-hydraulics-announces-preliminary-2017-results.html", "country": "US", "domain_rank": 767, "title": "Sun Hydraulics Announces Preliminary 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:11:00.000+02:00", "replies_count": 0, "uuid": "45579f55a7baa76401d3d76013b3f6647910beac"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-sun-hydraulics-announces-preliminary-2017-results.html", "ord_in_thread": 0, "title": "Sun Hydraulics Announces Preliminary 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "sarasota", "sentiment": "none"}], "organizations": [{"name": "sun hydraulics", "sentiment": "negative"}, {"name": "sun hydraulics corp", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Also Announces Estimated 2018 Federal Tax Rate\nSARASOTA, Fla.--(BUSINESS WIRE)-- Sun Hydraulics Corporation (NASDAQ:SNHY) (“Sun” or the “Company”), a global industrial technology leader that develops and manufactures solutions for both the hydraulics and electronics markets, today announced preliminary results for the fiscal year ended December 31, 2017.\nSun is in the process of preparing its financial results for the year ended December 30, 2017. Set forth below are preliminary estimates of certain results of operations that, based on available information to date, the Company expects to report as of and for the year ended December 30, 2017.\nThe data presented below is preliminary and unaudited, based upon Sun’s estimates, and subject to further internal review by management and compilation of actual results. The Company has provided ranges for this data primarily because its closing procedures for the quarter and year ended December 30, 2017 are not yet complete. Management’s estimates are based upon quarterly and annual information currently available from its business segments. While Sun expects that its results will be within these ranges and/or consistent with these estimates, actual results may differ materially from these preliminary estimates.\nAll of the information presented below has been prepared by and is the responsibility of Sun’s management. Its independent registered public accounting firm, Grant Thornton, LLP, has not audited, reviewed, compiled, or performed any procedures with respect to these accompanying preliminary estimates. Accordingly, the independent registered public accounting firm does not express an opinion or any other form of assurance with respect to this information.\nYear ended December 30, 2017 Preliminary Estimates ($ in millions) Low High Consolidated Revenue $ 341.5 $ 343.5 Hydraulics Segment Revenue 230.0 231.0 Electronics Segment Revenue 111.5 112.5 Adjusted Consolidated Operating Margin (1) 22.4% 22.6% Consolidated Interest Expense $ 3.7 $ 3.8 Effective Tax Rate 32.5% 33.5% Capital Expenditures $ 22.1 $ 22.3 Depreciation 10.7 10.8 Amortization 8.4 8.5 Cash and Cash Equivalents $ 63.0 $ 64.0 Total Debt $ 116.0 $ 116.0 Adjusted Net Income (1) $ 41.7 $ 42.8 Adjusted EBITDA (1) $ 86.9 $ 87.6 (1) Adjusted Consolidated Operating Margin, Adjusted Net Income and Adjusted EBITDA are Non-GAAP Measures. Please see \"Preliminary Estimates of Non-GAAP Measures\" below.\nThe following is a reconciliation of GAAP consolidated operating income to non-GAAP adjusted consolidated operating income ($ in millions):\n2017 Preliminary Estimates\nNet sales $341.5 - 343.5 GAAP Consolidated operating income $61.0 - 61.7 Acquisition-related amortization of intangibles 8.4 - 8.5 Acquisition-related amortization of inventory step-up 1.8 Acquisition and financing-related expenses 1.2 (1) Restructuring charges 1.5 (2) One-time operational items 2.9 (3) Non-GAAP Adjusted consolidated operating income $76.8 - 77.4 GAAP Consolidated operating margin 17.8 - 18.0% Non-GAAP Adjusted consolidated operating margin 22.4 - 22.6% (1) Includes expenses associated with the Company's acquisition and financing activities to support its strategy (2) Includes charges to consolidate the Company's High Country Tek business into its Enovation Controls business (3) Includes standard costing adjustments; temporary workforce, material outsourcing, and freight charges to recover from impact of Hurricane Irma; scrap and inventory issues attributable to the carve-out of Enovation Controls from its former organization; all 2017 preliminary estimates items deemed to be one-time in the fourth quarter The following is a reconciliation of GAAP net income to non-GAAP adjusted net income ($ in millions):\n2017 Preliminary Estimates\nGAAP Net income $29.8 - 30.9 Acquisition-related amortization of inventory step-up 1.8 Acquisition and financing-related expenses 1.2 (1) Restructuring charges 1.5 (2) One-time operational items 2.9 (3) Change in fair value of contingent consideration 9.5 Tax effect (5.5 - 5.7) Impact of tax reform 0.6 - 0.8 Non-GAAP Adjusted net income $41.7 - 42.8 GAAP Net income per diluted share $1.10 - 1.14 Non-GAAP Adjusted net income per diluted share $1.54 - 1.58 (1) Includes expenses associated with the Company's acquisition and financing activities to support its strategy (2) Includes charges to consolidate the Company's High Country Tek business into its Enovation Controls business (3) Includes standard costing adjustments; temporary workforce, material outsourcing, and freight charges to recover from impact of Hurricane Irma; scrap and inventory issues attributable to the carve-out of Enovation Controls from its former organization; all 2017 preliminary estimates items deemed to be one-time in the fourth quarter The following is a reconciliation of GAAP net income to non-GAAP adjusted EBITDA (earnings before interest, taxes, depreciation and amortization) ($ in millions):\n2017 Preliminary Estimates\nNet sales $341.5 - 343.5 Net income $29.8 - 30.9 Net interest expense (income) 3.7 - 3.8 Income taxes 16.1 - 16.6 Depreciation and amortization 19.1 - 19.3 EBITDA 69.9 - 70.6 Acquisition-related amortization of inventory step-up 1.8 Acquisition and financing-related expenses 1.2 (1) Restructuring charges 1.5 (2) One-time operational items 2.9 (3) Change in fair value of contingent consideration 9.5 Adjusted EBITDA $86.9 - 87.6 Adjusted EBITDA margin 25.5 - 26.0% (1) Includes expenses associated with the Company's acquisition and financing activities to support its strategy (2) Includes charges to consolidate the Company's High Country Tek business into its Enovation Controls business (3) Includes standard costing adjustments; temporary workforce, material outsourcing, and freight charges to recover from impact of Hurricane Irma; scrap and inventory issues attributable to the carve-out of Enovation Controls from its former organization; all 2017 preliminary estimates items deemed to be one-time in the fourth quarter Adjusted consolidated operating income, adjusted consolidated operating margin, adjusted net income and adjusted EBITDA are not measures determined in accordance with generally accepted accounting principles in the United States, commonly known as GAAP. Nevertheless, Sun Hydraulics believes that providing non-GAAP information such as adjusted consolidated operating income, adjusted consolidated operating margin, adjusted net income and adjusted EBITDA are important for investors and other readers of Sun Hydraulics’ financial statements, as they are used as analytical indicators by Sun Hydraulics’ management to better understand operating performance. Because adjusted consolidated operating income, adjusted consolidated operating margin, adjusted net income and adjusted EBITDA are non-GAAP measures and are thus susceptible to varying calculations, adjusted consolidated operating income, adjusted consolidated operating margin, adjusted net income and adjusted EBITDA, as presented, may not be directly comparable to other similarly titled measures used by other companies.\nSun estimates that its federal tax rate for the 2018 fiscal year will be between 24.5% to 26.5%. However, this range is a preliminary estimate as Sun is continuing to assess the impact of the recently enacted tax law on Sun’s business and consolidated financial statements.\nSun Hydraulics expects to report its final results for the fourth quarter and full year 2017 on or around February 26, 2018.\nAbout Sun\nSun Hydraulics Corporation is an industrial technology leader that develops and manufactures solutions for both the hydraulics and electronics markets. In the hydraulics market, the Company is a leading manufacturer of high-performance screw-in hydraulic cartridge valves, electro-hydraulics, manifolds, and integrated package solutions for the worldwide industrial and mobile hydraulics markets. In the electronics market, the Company is a global provider of innovative electronic control, display and instrumentation solutions for both recreational and off-highway vehicles, as well as stationary and power generation equipment. For more information about Sun, please visit www.sunhydraulics.com .\nFORWARD-LOOKING INFORMATION\nThis news release contains “forward‐looking statements” within the meaning of Section 21E of the Securities Exchange Act of 1934. Forward‐looking statements involve risks and uncertainties, and actual results may differ materially from those expressed or implied by such statements. They include statements regarding the intent, belief or current expectations, estimates, vision or projections of Sun Hydraulics Corporation (“Sun” or the “Company”), its directors or its officers about the Company and the industry in which it operates, and assumptions made by management, and include among other items, (i) the Company’s strategies regarding growth, including its intention to develop new products and make acquire other businesses; (ii) the Company’s financing plans; (iii) our expectations regarding our sales, expenses, gross margins and other results of operations; (iv) trends affecting the Company’s financial condition or results of operations; (v) the Company’s ability to continue to control costs and to meet its liquidity and other financing needs; (vi) the declaration and payment of dividends; and (vii) the Company’s ability to respond to changes in customer demand domestically and internationally, including as a result of standardization; and (viii) potential challenges relating to changes in and compliance with governmental laws and regulations affecting our U.S. and international businesses. Although the Company believes that its expectations are based on reasonable assumptions, it can give no assurance that the anticipated results will occur. Important factors that could cause the actual results to differ materially from those in the forward‐looking statements include, among other items, (i) the economic cyclicality of the capital goods industry in general and the hydraulic valve and manifold industry in particular, which directly affect customer orders, lead times and sales volume; (ii) fluctuations in global business conditions, including the impact of economic recessions in the U.S. and other parts of the world, (iii) conditions in the capital markets, including the interest rate environment and the availability of capital; (iv) changes in the competitive marketplace that could affect the Company’s revenue and/or costs, such as increased competition, lack of qualified engineering, marketing, management or other personnel, and increased labor and raw materials costs; (v) risks related to the integration of the businesses of the Company and Enovation Controls; (vi) changes in technology or customer requirements, such as standardization of the cavity into which screw‐in cartridge valves must fit, which could render the Company’s products or technologies noncompetitive or obsolete; (vii) new product introductions, product sales mix and the geographic mix of sales nationally and internationally; and (viii) changes relating to the Company’s international sales, including changes in regulatory requirements or tariffs, compliance with anti-corruption laws and trade laws, including export and import compliance, trade or currency restrictions, fluctuations in exchange rates, and tax and collection issues. Further information relating to factors that could cause actual results to differ from those anticipated is included but not limited to information under the headings Item 1. “Business,” Item 1A. “Risk Factors,” and Item 7. “Management’s Discussion and Analysis of Financial Conditions and Results of Operations” in the Company’s Form 10‐K for the year ended December 31, 2016. The Company disclaims any intention or obligation to update or revise forward‐looking statements, whether as a result of new information, future events or otherwise.\nThis news release will discuss some non-GAAP financial measures, which the Company believes are useful in evaluating our performance. You should not consider the inclusion of this additional information in isolation or as a substitute for results prepared in accordance with GAAP. The Company has provided reconciliations of comparable GAAP to non-GAAP measures in tables found in the end of this news release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129006154/en/\nKei Advisors LLC\nKaren L. Howard / Deborah K. Pawlowski\n(716) 843-3942 / (716) 843-3908\nkhoward@keiadvisors.com / dpawlowski@keiadvisors.com\nSource: Sun Hydraulics Corporation", "external_links": ["http://www.businesswire.com/news/home/20180129006154/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sunhydraulics.com&esheet=51750500&newsitemid=20180129006154&lan=en-US&anchor=www.sunhydraulics.com&index=1&md5=a1a79689098f7c66844dbf03ba12b06b"], "published": "2018-01-30T00:11:00.000+02:00", "crawled": "2018-01-30T04:48:21.016+02:00", "highlightTitle": ""}