{"organizations": [], "uuid": "acbf6b59443fce4bea12945c354e692bd143d78d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-young-innovations-announces-acquisition-of-mydent-international.html", "country": "US", "domain_rank": 767, "title": "Young Innovations Announces Acquisition of Mydent International", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.546, "site_type": "news", "published": "2018-01-24T17:39:00.000+02:00", "replies_count": 0, "uuid": "acbf6b59443fce4bea12945c354e692bd143d78d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-young-innovations-announces-acquisition-of-mydent-international.html", "ord_in_thread": 0, "title": "Young Innovations Announces Acquisition of Mydent International", "locations": [], "entities": {"persons": [{"name": "andrew jones", "sentiment": "none"}, {"name": "dave sproat", "sentiment": "none"}], "locations": [{"name": "mydent international algonquin", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "mydent international enterprises corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALGONQUIN, Ill., Jan. 24, 2018 /PRNewswire/ -- Young Innovations, a leading global manufacturer and distributor of dental supplies and equipment, today announced the acquisition of Mydent International Enterprises Corp. (\"Mydent\"). Launched in 1985, Mydent is a leading supplier of infection control products, disposables, preventives, impression material systems, rotary instruments and restoratives, including under the DEFEND brand, in over 45 countries.\n\"We are incredibly proud to lead Mydent through its next phase of growth in partnership with our distributor customers,\" said Dave Sproat, CEO of Young Innovations. \"The DEFEND brand has developed a reputation for high quality at great value that resonates well with clinicians and dental organizations around the world.\"\n\"Our acquisition of Mydent complements our robust infection control, preventive and restorative brand and product portfolio and aligns well with our commercial strategy,\" added Andrew Jones, Vice President of Corporate Development at Young Innovations. \"This also demonstrates our commitment to continuing our focused acquisition strategy as an important pillar of our ongoing growth.\"\n\"We built Mydent and the DEFEND brand over the last 30 years to provide trusted products to dental professionals at a reasonable price,\" said Andy Parker, Founder and CEO of Mydent. \"I am confident that Young is the best partner to steer Mydent toward continued success and the sustained growth of the DEFEND brand.\"\nAndy Parker will serve in an advisory role for a transitional period. There will be no immediate changes to ordering and service procedures for customers or vendors.\nYoung Innovations was represented by Greenberg Traurig, LLP and Mydent was represented by Zukerman Gore Brandeis & Crossman, LLP of New York City.\nYoung Innovations, Inc. is a portfolio company of The Jordan Company.\nAbout Young Innovations, Inc.\nYoung Innovations is a leading global manufacturer and distributor of supplies and equipment used by dentists, hygienists, dental assistants and consumers. Our portfolio of brands includes products that hold leadership positions in the preventive, restorative, orthodontic, endodontic and diagnostic segments. With its mission of Creating Smiles, Creating Possibilities, Young focuses on delivering innovative, high-quality products and solutions to clinicians and their patients. We seek out opportunities to enhance our portfolio of brands and products through organic growth and acquisitions.\nAbout The Jordan Company\nTJC ( www.thejordancompany.com ), founded in 1982, is a middle-market private equity firm with original capital commitments in excess of $8 billion and a 35-year track record of investing in and contributing to the growth of many businesses across a wide range of industries. The senior investment team has been investing together for over 20 years and is supported by the Operations Management Group, which was established in 1988 to initiate and support operational improvements in portfolio companies. Headquartered in New York, NY, TJC also has an office in Chicago, IL.\nView original content: http://www.prnewswire.com/news-releases/young-innovations-announces-acquisition-of-mydent-international-300587494.html\nSOURCE Young Innovations", "external_links": ["http://www.prnewswire.com/news-releases/young-innovations-announces-acquisition-of-mydent-international-300587494.html", "http://www.thejordancompany.com/"], "published": "2018-01-24T17:39:00.000+02:00", "crawled": "2018-01-24T19:17:07.009+02:00", "highlightTitle": ""}