{"organizations": [], "uuid": "d318c0b3052727b8f628f42c1a876b1fd40bd69d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-local-nonprofits-join-forces-to-fight-the-addiction-crisis.html", "country": "US", "domain_rank": 767, "title": "Local Nonprofits Join Forces to Fight the Addiction Crisis", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T20:30:00.000+02:00", "replies_count": 0, "uuid": "d318c0b3052727b8f628f42c1a876b1fd40bd69d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-local-nonprofits-join-forces-to-fight-the-addiction-crisis.html", "ord_in_thread": 0, "title": "Local Nonprofits Join Forces to Fight the Addiction Crisis", "locations": [], "entities": {"persons": [{"name": "clare", "sentiment": "none"}, {"name": "lisa steele", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "san bernardino", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "clare foundation", "sentiment": "none"}, {"name": "clare", "sentiment": "none"}, {"name": "matrix institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 23, 2018 /PRNewswire/ -- After a thorough financial, legal and operational due diligence process, two Los Angeles nonprofits dedicated to recovery from substance misuse – CLARE Foundation and The Matrix Institute on Addictions – have voted to merge. The new nonprofit entity will provide\nDetoxification Prevention Residential and Outpatient Treatment for Substance Misuse Research Behavioral Health Services Training to increase treatment capability\nWith combined locations in Los Angeles and San Bernardino counties, CLARE and Matrix are positioned to deepen and expand their impact with the powerful combination of recovery treatment, prevention, behavioral health support, research and training. The mission remains to ensure everyone has access to these lifesaving services, regardless of ability to pay.\n\"The CLARE and Matrix families truly complement each other,\" says CLARE Foundation CEO, Dr. Lisa Steele. \"Each organization brings vital expertise to treating the whole person in recovery – and their families. CLARE has a 50-year track record of treating substance misuse for thousands of clients. The Matrix Institute has been recognized by the Surgeon General for their internationally-known, evidence-based practices, outpatient treatment, training and research. Together, we can save more lives through recovery with a full spectrum of treatment for clients, research that contributes to our understanding of this devastating disease and training to increase our capacity to treat addiction.\"\n\"We approached CLARE because we admired so much of what they do in the recovery community,\" says Matrix Institute on Addictions Co-Founder Jeanne Obert. \"Both organizations have long and respected histories in the field, locally, nationally and internationally. Together, we look forward to sharing much more about the new programs and the capabilities this merger will bring to the communities we serve.\"\nCLARE Foundation and The Matrix Institute on Addictions will spend the next several months focusing on facilitating a successful integration.\nABOUT CLARE FOUNDATION\nFounded in 1970, CLARE Foundation is a nonprofit organization providing cost-efficient, effective and compassionate treatment, recovery and prevention services for alcoholism, substance abuse, and behavioral health treatment to individuals, families and the community. Each year, CLARE impacts over 10,000 people through assessment, treatment and referral services. On the web at www.clarefoundation.org\nABOUT THE MATRIX INSTITUTE ON ADDICTIONS\nThe Matrix Institute is committed to improving the lives of individuals and families affected by alcohol and other drug use through treatment, education, and research. The treatment model The Matrix Institute developed – The Matrix Model - has been acknowledged by the National Institute on Drug Abuse (NIDA) as an effective and scientifically-based outpatient approach. The Substance Abuse and Mental Health Services Administration (SAMHSA) has listed the model on its National Registry of Evidence-based Programs and Practices (NREPP). On the web at www.matrixinstitute.org\nMedia Contact:\nJennifer Mau\nDirector of Communications & Marketing\njmau@clarefoundation.org\n(310) 314-6200 x3133; cell (310) 702-5706\nView original content: http://www.prnewswire.com/news-releases/local-nonprofits-join-forces-to-fight-the-addiction-crisis-300586512.html\nSOURCE CLARE Foundation", "external_links": ["http://www.prnewswire.com/news-releases/local-nonprofits-join-forces-to-fight-the-addiction-crisis-300586512.html", "http://www.clarefoundation.org/", "http://www.matrixinstitute.org/"], "published": "2018-01-23T20:30:00.000+02:00", "crawled": "2018-01-23T22:29:05.016+02:00", "highlightTitle": ""}