{"organizations": [], "uuid": "663a15d5fac225b2588d8ca7cb558135e77eaf5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "/img/misc/og-default.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/05/bridgewater-ray-dalio-stock-market-bear/", "country": "US", "domain_rank": 1196, "title": "Why Bridgewater's Ray Dalio Is Cautious About the Record Stock Market | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.547, "site_type": "news", "published": "2018-01-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "663a15d5fac225b2588d8ca7cb558135e77eaf5e"}, "author": "Lisa Marie Segarra", "url": "http://fortune.com/2018/01/05/bridgewater-ray-dalio-stock-market-bear/", "ord_in_thread": 0, "title": "Why Bridgewater's Ray Dalio Is Cautious About the Record Stock Market | Fortune", "locations": [], "entities": {"persons": [{"name": "lisa marie segarra", "sentiment": "negative"}, {"name": "ray dalio", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "dalio", "sentiment": "none"}], "locations": [], "organizations": [{"name": "dow jones", "sentiment": "negative"}, {"name": "bridgewater associates", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Lisa Marie Segarra January 5, 2018 \nThe Dow Jones hit another record high Thursday, reaching 25,000, up more than 25% from a year ago. It’s a milestone President Donald Trump was happy to trumpet on Twitter. \nBut not everyone is celebrating unreservedly. Perhaps chief among those preaching caution is Ray Dalio – the founder of Bridgewater Associates, who not only predicted but also profited during the 2008 financial crisis. \nDalio doesn’t believe the stock market is over-valued as such, but he’s worried that some of the underlying fundamentals fueling the soaring prices could drag down growth in the years to come, he told the Wall Street Journal . \nSpecifically, he’s concerned about debt. Americans have more debt than assets – and the payments on that debt are growing. \nIn order to keep the cost of debt service affordable, the Federal Reserve will be forced to keep interest rates low, Dalio told The Journal. \n“It may not be a problem in the next year or two, but the risk of not getting it right increases with time,” he said. \nHe also cautions that the incredible returns of the last 18 months are not the new normal. He believes inflation-adjusted returns on the typical stock and bond portfolio could be near zero in the next decade, thanks to the combination of debt and inflationary pressure. \nDalio – whose Bridewater Associates is the largest hedge fund firm in the world , managing $150 billion – is also concerned about the 60% of Americans who have almost no assets and aren’t directly benefiting from the soaring corporate profits and stock prices. \n“If we do have an economic downturn, I worry we will be at each other’s throats,” he said. \nTrump tweeted about the new stock market records on both Thursday and Friday morning. He also told reporters that the new goal is “30,000,” CNBC reported. Dow goes from 18,589 on November 9, 2016, to 25,075 today, for a new all-time Record. Jumped 1000 points in last 5 weeks, Record fastest 1000 point move in history. This is all about the Make America Great Again agenda! Jobs, Jobs, Jobs. Six trillion dollars in value created! \n— Donald J. Trump (@realDonaldTrump) January 5, 2018 Dow just crashes through 25,000. Congrats! Big cuts in unnecessary regulations continuing. \n— Donald J. Trump (@realDonaldTrump) January 4, 2018 \nBut Dalio isn’t the only one sounding alarm about the big market gains. \nJames Stack, a market historian and president of InvesTech Research, told the New York Times that “this party will eventually come to an end.” \n“A correction would be healthy. The longer we go without one, the greater the risk this will end badly. A lot of people will get hurt. And when it ends, it will end badly, and with high volatility,” Stack told the Times. \nBrad McMillan, chief investment officer for Commonwealth Financial Network, echoed that a correction could be needed for the current market. \n“When markets move up this much and this fast, they often need time to take a break and let fundamentals catch up with the new valuations. So, enjoy the celebration and drink the champagne. But remember this: 25,000 is not necessarily a sign that everything is as good as the headlines suggest,” McMillan told the Washington Post. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-05T02:00:00.000+02:00", "crawled": "2018-01-08T20:30:37.015+02:00", "highlightTitle": ""}