{"organizations": [], "uuid": "17966226b64bbf148647d25626a523259c7aadc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-steady-amid-expectations-for-further-u-s-rate-hikes-idUSL4N1P318J", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold dips as dollar firms on U.S. rate hike views", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-08T11:39:00.000+02:00", "replies_count": 0, "uuid": "17966226b64bbf148647d25626a523259c7aadc0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-steady-amid-expectations-for-further-u-s-rate-hikes-idUSL4N1P318J", "ord_in_thread": 0, "title": "PRECIOUS-Gold dips as dollar firms on U.S. rate hike views", "locations": [], "entities": {"persons": [{"name": "sethuraman n r jan", "sentiment": "none"}, {"name": "stephen innes", "sentiment": "none"}, {"name": "innes", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "oanda", "sentiment": "none"}], "organizations": [{"name": "comex", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "march fed", "sentiment": "none"}, {"name": "apac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Speculators raise COMEX gold net longs in the week to Jan 2 * Holdings of SPDR Gold fell 0.14 pct on Friday * Silver falls back from 1-1/2-month high (Adds comment, updates prices) By Sethuraman N R Jan 8 (Reuters) - Gold prices inched down on Monday after the dollar firmed on expectations of further U.S. interest rate hikes this year. Spot gold was down 0.1 percent at $1,317.60 an ounce at 0711 GMT. Last week, the metal touched its highest since Sept. 15 at $1,325.86. Spot gold posted its fourth consecutive weekly gain last week. U.S. gold futures slipped 0.3 percent on Monday at $1,318.80 an ounce. \"January is usually a good month for gold prices and should remain so on the anticipation of physical demand ahead of the Chinese New Year,\" said Stephen Innes, APAC head of trading, Oanda. \"While there could be some downside pressure from a possible U.S. dollar correction, gold will likely remain firm until a March Fed hike possibility comes on the radar,\" Innes said. The U.S. December non-farm payrolls report on Friday was weaker than expected, but investors reckoned the U.S. Federal Reserve would still raise interest rates multiple times this year, although at a gradual pace. The dollar's index against a basket of six major currencies rose 0.2 percent to 92.155 on Monday, up from its Jan. 2 low of 91.751, which was its weakest level since Sept. 20. Gold is highly sensitive to rising U.S. interest rates, as these increase the opportunity cost of holding non-yielding bullion, while boosting the dollar, in which it is priced. Meanwhile, hedge funds and money managers raised their net long positions in COMEX gold in the week to Jan. 2, U.S. Commodity Futures Trading Commission (CFTC) data showed on Friday. Spot gold may edge up to a resistance at $1,329 per ounce and then start a correction, as suggested by a Fibonacci retracement analysis, according to Reuters technical analyst Wang Tao. The Chinese New Year demand is yet to pick up as the prices are too hard to swallow,\" a Singapore-based trader said. \"Prices should see $1,340 (in the near term) and if it does not breach that gold should look to ease back below $1,300.\" Physical gold demand across Asia remained subdued last week as prices rallied to a three-and-a-half-month high, keeping retail buyers away from the market. Among other precious metals, spot silver inched 0.6 percent lower to $17.12 an ounce, after having hit a 1-1/2-month high on Friday at $17.29. Platinum dipped 0.3 percent to $966.50 an ounce, after hitting a more than 3-1/2-month top at $970.5 earlier in the session. Palladium rose 0.5 percent to $1,096 an ounce. The metal hit a record high of $1,105.70 last week. (Reporting by Nallur Sethuraman in Bengaluru; Editing by Tom Hogue and Sherry Jacob-Phillips)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T11:39:00.000+02:00", "crawled": "2018-01-09T17:07:24.002+02:00", "highlightTitle": ""}