{"organizations": [], "uuid": "500d0fa014a2032b366afdbd646ca7400595b589", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-transforce-inc-acquires-trucking-unlimited-the-operator-of-truckdrivingjobs-com.html", "country": "US", "domain_rank": 767, "title": "TransForce Inc. Acquires Trucking Unlimited, the Operator of Truckdrivingjobs.com", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T23:00:00.000+02:00", "replies_count": 0, "uuid": "500d0fa014a2032b366afdbd646ca7400595b589"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-transforce-inc-acquires-trucking-unlimited-the-operator-of-truckdrivingjobs-com.html", "ord_in_thread": 0, "title": "TransForce Inc. Acquires Trucking Unlimited, the Operator of Truckdrivingjobs.com", "locations": [], "entities": {"persons": [{"name": "mike pourshakori", "sentiment": "none"}, {"name": "serge gorelyshev", "sentiment": "none"}, {"name": "david broome", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "alexandria", "sentiment": "none"}], "organizations": [{"name": "transforce, inc.", "sentiment": "neutral"}, {"name": "transforce inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALEXANDRIA, Va., TransForce, Inc., the nation's leading workforce management solutions firm specializing in commercial truck drivers, has acquired the assets of Trucking Unlimited. Trucking Unlimited operates www.truckdrivingjobs.com as their primary job board matching motor carriers with professional truck drivers.\n\"Trucking Unlimited's portfolio of services is a great addition to our company and a perfect fit in our acquisition strategy to accelerate and expand our full service workforce management program,\" said David Broome, President and CEO of TransForce. \"Trucking Unlimited's service model compliments our core offerings and expands our ability to service our customers' needs with value added capabilities.\"\nTrucking Unlimited was founded in 2012 by co-Founders Serge Gorelyshev and Mike Pourshakori. They are excited about joining TransForce and providing an additional service line under the TransForce umbrella. \"Not only does TransForce mirror our dedication to the transportation industry, TransForce is dedicated to providing our drivers the best opportunities in the industry. Our futures together will be very exciting and our customers are the highest quality carriers in the industry,\" said Serge Gorelyshev, CEO of Trucking Unlimited. \"We will continue to build the best recruiting site for both the professional drivers and the motor carriers,\" said Mike Pourshakori, CIO of Trucking Unlimited.\n\"Future acquisitions are part of our growth strategy. Along with organic growth, we continue to seek acquisitions with like-minded companies such as Trucking Unlimited, that are market leaders in providing high-quality services to the transportation and logistics industry,\" said David Broome, President and CEO of TransForce.\nTrucking Unlimited LLC, a TransForce Company, will continue to operate from its West Hills, California headquarters. \"We are extremely excited that Serge and Mike will continue to have oversight over the valued company that they founded,\" said David Broome, President and CEO of TransForce.\nAbout TransForce\nTransForce was founded in 1991 and has operations across North America. TransForce specializes in providing high-quality commercial truck drivers to the transportation industry, including trucking companies, third party logistics companies and private fleets. TransForce also offers Department of Transportation (DOT) compliance services that include DOT audit preparedness, file qualification services and training, and federal motor carrier regulation education. TransForce is the only national staffing company exclusively devoted to the transportation industry. Accordingly, TransForce provides a high level of expertise with respect to both employing highly-skilled truck drivers and understanding the regulatory requirements that apply to truck drivers. No other national staffing company can provide such an exclusive focus.\nContact:\nDavid Broome, President\n5520 Cherokee Avenue, Suite 200, Alexandria, VA 22312\ndbroome@transforce.com (703) 838-5580\n with multimedia: releases/transforce-inc-acquires-trucking-unlimited-the-operator-of-truckdrivingjobscom-300576559.html\nSOURCE TransForce, Inc.", "external_links": ["http://www.truckdrivingjobs.com/", "http://www.prnewswire.com/news-releases/transforce-inc-acquires-trucking-unlimited-the-operator-of-truckdrivingjobscom-300576559.html"], "published": "2018-01-02T23:00:00.000+02:00", "crawled": "2018-01-03T00:25:26.019+02:00", "highlightTitle": ""}