{"organizations": [], "uuid": "3b22dafff138053f6443ce1a4a4845b38eb3e4e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/04/reuters-america-exclusive-chinas-wanda-mulls-sport-unit-ipo-and-sale-of-overseas-assets--sources.html", "country": "US", "domain_rank": 767, "title": "EXCLUSIVE-China's Wanda mulls sport unit IPO and sale of overseas assets - sources", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T10:45:00.000+02:00", "replies_count": 0, "uuid": "3b22dafff138053f6443ce1a4a4845b38eb3e4e6"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/reuters-america-exclusive-chinas-wanda-mulls-sport-unit-ipo-and-sale-of-overseas-assets--sources.html", "ord_in_thread": 0, "title": "EXCLUSIVE-China's Wanda mulls sport unit IPO and sale of overseas assets - sources", "locations": [], "entities": {"persons": [{"name": "wanda", "sentiment": "negative"}, {"name": "wang jianlin", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "dalian wanda group", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "ipo", "sentiment": "negative"}, {"name": "exclusive-china", "sentiment": "negative"}, {"name": "citic securities", "sentiment": "none"}, {"name": "ipo of wanda", "sentiment": "none"}, {"name": "infront sports & media ag", "sentiment": "none"}, {"name": "world triathlon corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "sources@\nHONG KONG, Jan 4 (Reuters) - China's Dalian Wanda Group is considering a Hong Kong listing for its sports assets as part of efforts to rationalise its portfolio that could also include other sales, according to five people familiar with the situation.\nThe conglomerate last month tapped investment banks for a potential initial public offering of its sports businesses, three of the sources said. Citic Securities, China's largest brokerage, is one of the banks involved, added one of them.\nA spokesman for Citic Securities declined to comment.\nWanda's businesses range from real estate to football and cinemas but it has been rattled in the past year by a government-led crackdown on overseas deals and high leverage. The company is owned by Wang Jianlin, one of China's richest men.\nAn IPO of Wanda's sports assets would include Infront Sports & Media AG, a Swiss sports marketing company and World Triathlon Corp, the organizer and promoter of the Ironman race, according to three of the people.\nThe two were acquired in 2015 for $1.2 billion and $650 million respectively.\nThe share offering would also include Wanda's smaller sports assets in China, such as cycling and basketball leagues, one of them said. The public float would not involve Wanda's 20 percent stake in the Spanish football club Atletico Madrid, valued at 67 million euros after a recent capital raise, the source said.\nThe IPO would most likely take place in Hong Kong, but bankers have also pitched for a U.S. listing, according to the people.\nWanda is separately looking to sell Sunseeker International, a British yacht maker it bought in 2013 for $495 million but whose financial performance it has failed to turn around, two other people said.\nWanda declined to comment. The people could not be named as the plans are confidential.\nWanda's interest in property, sports and entertainment - accounting for more than $13 billion of its deals in the past five years - ran into official opposition last year when Beijing labelled overseas deals in those areas \"irrational\".\nIn addition to sports, its holdings also include the cinema chain AMC Entertainment Holdings and movie studio Legendary Entertainment.\nThe company is also considering the merits of a pre-IPO funding round for the sports unit, according to one of the people. All plans are still at an early stage however as Wanda is seeking a chief financial officer for the sports business to lead the fundraising efforts, said another of the people.\nProperty forms the basis of the Wanda empire - its mixed use Wanda Plaza developments are common across China - but this too has put pressure on Wang's business.\nLast year, Chinese regulators told banks to stop providing funding for several of its overseas acquisitions as Beijing looks to curb the conglomerate's offshore buying spree.\nShortly after, Wanda sold a portfolio of hotels and tourism assets, including 13 theme parks, for $9 billion to Guangzhou R&F Properties and Sunac China. Five flagship overseas developments - in London, Chicago, Los Angeles, Sydney and Australia's Gold Coast - are also available for sale, according to one source. (Reporting Kane Wu and Clare Jim in Hong Kong and Liana Baker in San Francisco; Editing by Jennifer Hughes and Philip McClellan)", "external_links": [], "published": "2018-01-04T10:45:00.000+02:00", "crawled": "2018-01-04T16:13:24.002+02:00", "highlightTitle": ""}