{"organizations": [], "uuid": "f1383ac852617ec372c88a65ebfef7d7319ac7eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 22, "shares": 22, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/19/104907521-GettyImages-887736324.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/epa-chief-scott-pruitt-wont-rule-out-repealing-endangerment-finding.html", "country": "US", "domain_rank": 767, "title": "EPA chief Scott Pruitt won't rule out repealing endangerment finding", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-31T00:33:00.000+02:00", "replies_count": 0, "uuid": "f1383ac852617ec372c88a65ebfef7d7319ac7eb"}, "author": "Getty Images", "url": "https://www.cnbc.com/2018/01/30/epa-chief-scott-pruitt-wont-rule-out-repealing-endangerment-finding.html", "ord_in_thread": 0, "title": "EPA chief Scott Pruitt won't rule out repealing endangerment finding", "locations": [], "entities": {"persons": [{"name": "scott pruitt", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "renewable energy epa", "sentiment": "negative"}, {"name": "epa", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "u.s. environmental protection agency", "sentiment": "none"}, {"name": "getty images environmental protection agency", "sentiment": "none"}, {"name": "environmental protection agency", "sentiment": "none"}, {"name": "house energy and commerce committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Environmental Protection Agency Administrator Scott Pruitt on Tuesday refused to rule out an effort to repeal an EPA finding that empowers the agency to create rules to fight climate change.\nScrapping the determination, known as the endangerment finding, would make it easier for President Donald Trump to wipe the slate clear of Obama-era environmental regulations.\nPruitt's comment came during a combative Senate hearing, his first appearance before the chamber's Environment and Public Works Committee since his confirmation hearing a year ago.\nDuring that 2017 hearing, Pruitt said he had no intention of reviewing the endangerment finding, the EPA's 2009 determination that carbon dioxide and other greenhouse gases are a danger to the public health and welfare of Americans and future generations.\nBut on Tuesday Sen. Tom Carper of Delaware, the ranking Democrat on the committee, asked whether Pruitt would refuse to repeal or replace the endangerment finding. Pruitt said there is \"no decision or determination on that.\"\nA dedicated group of conservative climate change skeptics has pushed Pruitt to scrap the endangerment finding . They believe repeal is the key to permanently unraveling former President Barack Obama 's efforts to control emissions from automobiles, power plants, oil and gas wells, and other sources.\nThe Trump administration has rolled back Obama-era environment regulations , but it must replace many of those rules so long as the endangerment finding stands. Pruitt has so far resisted calls to kill the finding, which would require him to refute a huge body of evidence the EPA cited in making its decision.\nPruitt also said Tuesday that an EPA-sponsored debate between mainstream climate scientists and climate change skeptics, known as the red team-blue team exercise, is still under consideration.\nshow chapters EPA chief Scott Pruitt says carbon dioxide is not a primary contributor to global warming 11:53 AM ET Fri, 10 March 2017 | 01:02 Pruitt has denied the consensus among climate scientists that carbon emissions from human activity are driving global warming. He solicited a list of skeptical scientists from the conservative Heartland Institute to participate in the debate.\n\"That red team-blue team exercise is an exercise to provide an opportunity to the American people to consume information from scientists that have different perspectives on key issues and, frankly, could be used to build consensus in this body,\" Pruitt told the committee.\nSen. Jeff Merkley, D-Ore., said during the hearing that the perception is that Pruitt's intention in hosting the debate is to mislead the American people about the dangers of carbon emissions and to cast doubt on established science.\nDuring the hearing, Democrats often pilloried Pruitt and sought to show that he has weakened pollution regulations during his first year in office.\nAt one point, Sen. Sheldon Whitehouse of Rhode Island read excerpts from a 2016 radio interview released on Tuesday by a watchdog group in which Pruitt said then-candidate Trump would be \"abusive to the Constitution.\"\n@NickSurgey: SCOOP: @EPAScottPruitt called #Trump a threat to constitution in a 2016 interview. #EPA #PollutingPruitt\nAt another point, Sen. Tammy Duckworth of Illinois asked if Pruitt thought Morocco, a North African country, was a \"s---hole\" when he visited last year, referring to Trump's use of the obscenity to describe African countries. Republican committee Chairman John Barrasso told Duckworth her time had expired before Pruitt could answer.\nPruitt got respite from Republicans, who mostly cast his tenure as a welcome relief from regulatory excess under the Obama EPA and claimed Trump's rollback of environment rules had contributed to economic growth and lower unemployment.\n\"Administrator Pruitt has led the agency fairly. He has balanced the need to prioritize environmental protection with the desires of Americans to have thriving and economically sustainable communities,\" Barrasso said.\n\"During the last administration, the EPA created broad and legally questionable new regulations that undermined the American people's faith in the agency.\"\nWATCH: Scott Pruitt confronted about past comments regarding Trump show chapters Senator Whitehouse confronts EPA chief Scott Pruitt over past comments about Trump 20 Hours Ago | 03:25", "external_links": [], "published": "2018-01-31T00:33:00.000+02:00", "crawled": "2018-01-31T00:33:07.009+02:00", "highlightTitle": ""}