{"organizations": [], "uuid": "02e1b8cc848e806e56e5f96b996f218a3b82a19c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/fox-reaches-5-year-deal-with-the-nfl-to-broadcast-thursday-night-football.html", "country": "US", "domain_rank": 767, "title": "Fox reaches 5-year deal with the NFL to broadcast Thursday Night Football", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.115, "site_type": "news", "published": "2018-01-31T17:05:00.000+02:00", "replies_count": 0, "uuid": "02e1b8cc848e806e56e5f96b996f218a3b82a19c"}, "author": "", "url": "https://www.cnbc.com/2018/01/31/fox-reaches-5-year-deal-with-the-nfl-to-broadcast-thursday-night-football.html", "ord_in_thread": 0, "title": "Fox reaches 5-year deal with the NFL to broadcast Thursday Night Football", "locations": [], "entities": {"persons": [{"name": "fox", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "nfl", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fox Sports has agreed to pay more than $3 billion to broadcast the National Football League's \"Thursday Night Football\" for the next five seasons, a source familiar with the situation told Reuters on Wednesday.\nThe agreement, which was announced on Wednesday without financial terms, demonstrates how 21st Century Fox is aiming to be a leader in sports after it closes its deal with Walt Disney .\nIn December, Disney announced a $52.4 billion agreement to buy the bulk of Fox's assets, leaving sports and news to the remaining Fox company.\n\"These opportunities come very infrequently,\" said Peter Rice, president of 21st Century Fox, on a media call Wednesday. \"You either have the rights to the most watched content in media and if you lose that action and don't take that opportunity, this won't come up for another five years.\"\nFox shares were down 2.52 percent or 97 cents at $37.49 in late morning trade.\nUnder the five-year deal, Fox will be paying about $60 million per game, up from the $45 million per game CBS and Comcast's NBC was paying for broadcast rights this season, according to the source.\nThe source was not permitted to speak to the media and so wished to remain anonymous.\nExecutives at Fox and the NFL declined to comment on financial terms of the deal in a call Wednesday.\nThe NFL and Fox are looking for a digital partner to livestream the games, NFL Commissioner Roger Goodell said on the call, noting that the league had received multiple bids and expects an announcement soon.\nThe NFL has not yet decided on how long a digital deal would be, he said.\nFox is taking on Thursday night football at a time of declining ratings and advertising.\nAdvertising revenue declined 1.2 percent during the 2017 regular NFL season, according to Standard Media Index.\nDespite this, Fox is optimistic Thursday night football will help Fox grow its business, Rice said on the call.\n\"Every deal we have done, people have said that we overpaid and every single point we have built up our business,\" Rice said. \"I think we get tremendous value here.\"\nThe five-year deal allows Fox Sports to broadcast 11 games between weeks 4 and 15 (excluding Thanksgiving night). It will be simultaneously broadcast via NFL Network and will be distributed in Spanish on FOX Deportes.\nIn addition, NFL Network will exclusively broadcast seven games next season, with FOX producing the full slate of 18 games.\nDisclosure: Comcast is the owner of NBCUniversal, parent company of CNBC and CNBC.com.", "external_links": [], "published": "2018-01-31T17:05:00.000+02:00", "crawled": "2018-01-31T17:06:26.012+02:00", "highlightTitle": ""}