{"organizations": [], "uuid": "2cae385ab904a6424e927db12b14738fc957d646", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-the-chefsa-warehouse-inc-reaches-cooperation-agreement-with-legion-partners-asset-management.html", "country": "US", "domain_rank": 767, "title": "The Chefs’ Warehouse, Inc. Reaches Cooperation Agreement with Legion Partners Asset Management", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.995, "site_type": "news", "published": "2018-01-16T16:30:00.000+02:00", "replies_count": 0, "uuid": "2cae385ab904a6424e927db12b14738fc957d646"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-the-chefsa-warehouse-inc-reaches-cooperation-agreement-with-legion-partners-asset-management.html", "ord_in_thread": 0, "title": "The Chefs’ Warehouse, Inc. Reaches Cooperation Agreement with Legion Partners Asset Management", "locations": [], "entities": {"persons": [{"name": "nas", "sentiment": "negative"}, {"name": "david e. schreibman", "sentiment": "none"}, {"name": "schreibman", "sentiment": "none"}, {"name": "christina carroll", "sentiment": "none"}, {"name": "carroll", "sentiment": "none"}], "locations": [{"name": "ridgefield", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "legion partners asset management", "sentiment": "negative"}, {"name": "the chefs’ warehouse, inc.", "sentiment": "neutral"}, {"name": "chefs’ warehouse, inc", "sentiment": "neutral"}, {"name": "llc", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "board’s nominating", "sentiment": "none"}, {"name": "legion partners", "sentiment": "none"}, {"name": "board’s compensation and human capital committee", "sentiment": "none"}, {"name": "board’s audit committee", "sentiment": "none"}, {"name": "corporate governance committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RIDGEFIELD, Conn., Jan. 16, 2018 (GLOBE NEWSWIRE) -- The Chefs’ Warehouse, Inc. (the “Company”) (Nasdaq:CHEF), a premier distributor of specialty food products in the United States and Canada, announced today that it has entered into an agreement (the “Cooperation Agreement”) with Legion Partners Asset Management, LLC and certain of its affiliates (collectively, “Legion Partners”). Legion Partners beneficially owns approximately 6.0% of the Company’s outstanding common stock.\nPursuant to the Cooperation Agreement, the Company has agreed to appoint two new independent directors, Christina Carroll and David E. Schreibman, to the Company’s Board of Directors on or prior to February 18, 2018, and to nominate Ms. Carroll and Mr. Schreibman at the Company’s 2018 and 2019 annual meetings of stockholders. In addition, Mr. Schreibman will join the Board’s Compensation and Human Capital Committee, Ms. Carroll will join the Board’s Audit Committee and one of the new directors will join the Board’s Nominating and Corporate Governance Committee. The Company has also agreed to reduce the size of the Board by one director at each of the 2018 and 2019 annual meetings of stockholders so that immediately following the 2019 annual meeting of stockholders, the Board will be fixed at 10 directors.\nIn addition, pursuant to the Cooperation Agreement, Legion Partners has agreed to vote its shares in support of any director nominated and recommended by the Board at the Company’s 2018 and 2019 annual meetings of stockholders, in addition to certain customary standstill provisions and other voting agreements. The parties have also agreed to certain mutual non-disparagement obligations.\n“We are pleased to welcome Christina and David to the Chefs’ family. I am excited for us all to work together to maximize our future prospects and increase shareholder value,” said Christopher Pappas, chairman and chief executive officer of The Chefs’ Warehouse, Inc.\nChristopher Kiper, Managing Director of Legion Partners, said, \"The Chefs’ Warehouse has done a great job growing the business into what it is now and has a very exciting future ahead. We believe that Christina and David’s skills and expertise will enhance the already very talented Board and management team.”\nAbout Christina Carroll\nChristina Carroll is currently Managing Director, valuation advisory and financial opinions at Stout Risius Ross, LLC (“Stout”) where she is responsible for originating and executing valuations, fairness opinions and other transaction related financial advisory services across industries. Prior to Stout Ms. Carroll was director, financial advisory services at Houlihan Lokey, Inc. Ms. Carroll also previously held managerial positions at Ernst & Young LLP including partner in valuation and transaction advisory services.\nAbout David E. Schreibman\nDavid Schreibman is currently a consultant at Walgreens Boots Alliance and is the Rite Aid acquisition integration management officer leader. Prior to that he held roles at US Foods including executive vice president of strategy and senior vice president of business development. Prior to US Foods he held roles at Specialty Foods Corporation including vice president, secretary and general counsel.\nThe complete agreement will be included as an exhibit to a Current Report on Form 8-K filed by the Company with the Securities and Exchange Commission.\nShearman & Sterling LLP is serving as legal counsel to the Company.\nAbout The Chefs’ Warehouse\nThe Chefs’ Warehouse, Inc. is a premier distributor of specialty food products in the United States and Canada focused on serving the specific needs of chefs who own and/or operate some of the nation’s leading menu-driven independent restaurants, fine dining establishments, country clubs, hotels, caterers, culinary schools, bakeries, patisseries, chocolatiers, cruise lines, casinos and specialty food stores. The Chefs’ Warehouse, Inc. carries and distributes more than 43,000 products to more than 28,000 customer locations throughout the United States and Canada.\nForward-Looking Statements\nSafe Harbor Statement under the Private Securities Litigation Reform Act of 1995: Statements in this press release regarding the Company’s business that are not historical facts are “forward-looking statements” that involve risks and uncertainties and are based on current expectations and management estimates; actual results may differ materially. Forward-looking statements in this news release may address the following subjects among others: the Company’s strategic plans and the effectiveness of the Company’s Board in overseeing the execution of the Company’s strategic plans. Any forward-looking statements are made pursuant to the Private Securities Litigation Reform Act of 1995 and, as such, speak only as of the date made. A more detailed description of these and other risk factors is contained in the Company’s most recent annual report on Form 10-K filed with the Securities and Exchange Commission on March 10, 2017 and other reports filed by the Company with the Securities and Exchange Commission since that date. The Company is not undertaking to update any information in the foregoing report until the effective date of its future reports required by applicable laws. Any projections of future results of operations are based on a number of assumptions, many of which are outside the Company’s control and should not be construed in any manner as a guarantee that such results will in fact occur. These projections are subject to change and could differ materially from final reported results. The Company may from time to time update these publicly announced projections, but it is not obligated to do so.\nContact:\nInvestor Relations:\nJim Leddy, CFO, (718) 684-8415\nSource:The Chefs' Warehouse, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/245438f8-9b06-40ce-b478-38e27b01b422"], "published": "2018-01-16T16:30:00.000+02:00", "crawled": "2018-01-16T19:38:13.004+02:00", "highlightTitle": ""}