{"organizations": [], "uuid": "c2ecaca9f390c84488a88fbc9f64425acd1838a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 67, "shares": 67, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WU987_DIAGEO_SOC_20180102163831.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7014.xml", "section_title": "WSJ.com: US Business", "url": "https://www.wsj.com/articles/diageo-halts-snapchat-ads-over-age-targeting-concerns-1514937661", "country": "US", "domain_rank": 387, "title": "Diageo Halts Snapchat Ads Over Age-Targeting Concerns", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T02:01:00.000+02:00", "replies_count": 0, "uuid": "c2ecaca9f390c84488a88fbc9f64425acd1838a9"}, "author": "Lara O’Reilly", "url": "https://www.wsj.com/articles/diageo-halts-snapchat-ads-over-age-targeting-concerns-1514937661", "ord_in_thread": 0, "title": "Diageo Halts Snapchat Ads Over Age-Targeting Concerns", "locations": [], "entities": {"persons": [{"name": "morgan", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "diageo deo", "sentiment": "negative"}, {"name": "diageo", "sentiment": "negative"}, {"name": "sponsored lens", "sentiment": "none"}, {"name": "snap inc.", "sentiment": "none"}, {"name": "advertising standards authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS LONDON— Diageo DEO 0.27% PLC is suspending all of its advertising on Snapchat after the U.K. advertising watchdog ruled that the alcohol giant didn’t take sufficient care to ensure that a campaign from its Captain Morgan rum brand wasn’t seen by users under the U.K.’s legal drinking age of 18.\nIn June, Captain Morgan ran a “Sponsored Lens” on Snap Inc.’s SNAP 2.34% Snapchat that let users alter pictures of their faces, in this case to look like the brand’s pirate mascot alongside two glasses clinking together.\nThe Advertising Standards Authority (ASA) said on Wednesday in London that the lens breached the U.K. advertising code because it was likely to appeal to users under the age of 18 and was “inappropriately targeted.” While Diageo only directed the ad at people over 18, the targeting data was based on unverified age information that users supply when they register for an account. \nIn a statement, a Diageo spokeswoman said the company “took all reasonable steps” to ensure the ad wasn’t directed at users under 18, using data provided by Snapchat and applying an age filter. \nBut the ad watchdog called into question the accuracy of Snapchat’s data since users self-report their age.\nThe Advertising Standards Authority ruled that this Snapchat lens sponsored by Captain Morgan was in breach of the U.K. rules surrounding advertising to children. Photo: Advertising Standards Authority The U.K. ad code states that no media outlet should be used to advertise alcoholic drinks if more than 25% of its audience is under 18. According to the ruling, Diageo said that data provided from Snap in 2016 showed 77% of U.K. Snapchat users were registered as 18 or older.\nHowever, the ASA referenced 2016 research from U.K. communications regulator Ofcom that indicated that while the minimum age to sign up for Snapchat is 13, 34% of a group of 104 social media users between the ages of 8 and 11 were on the app. And 58% of a group of 12- to 15-year-olds said they were on Snapchat.\nThe data “called into question the adequacy of self-reported age as the sole means of targeting,” the ASA wrote, concluding Captain Morgan hadn’t taken “sufficient care” to ensure the ad wasn’t directed at children. The ASA also concluded that the “child-like cartoon image” for the interactive and augmented features of the lens were likely to appeal to kids.\n“We have now stopped all advertising on Snapchat globally whilst we assess the incremental age verification safeguards that Snapchat are implementing,” Diageo said in its statement.\nWhile the ASA’s ruling is limited to a single campaign, it could potentially encourage more alcohol marketers to put in tougher targeting safeguards when running campaigns on apps popular among young people. The issue also could be relevant on other big social media platforms, including Facebook and Twitter, that ask people to self-report their age.\nSince the Captain Morgan campaign ran, Snap has launched “Audience Lenses,” a version of “Sponsored Lenses” that allow advertisers to not only direct their ads at certain age groups, but to supplement that targeting with “lifestyle categories,” which are based on users’ interests and activity within the app.\nCMO Today Newsletter Get your daily dose of media and advertising news with WSJ’s CMO Today newsletter. Sign up here .\nGuidance from the Committee of Advertising Practice, which writes the U.K. advertising code, states that “where possible,” marketers placing age-restricted ads should aim to support their targeting with behavioral data that excludes people with interests strongly associated with younger people—a teen music festival, for example.\nIn a statement, a Snap spokeswoman said the company was “disappointed” with the ASA’s decision and disagrees Captain Morgan intentionally directed its ad to an underage audience because it applied the accurate age-targeting methods made available at the time. The spokeswoman also said Snapchat uses its own data, plus that of third-party measurement services such as Nielsen, to validate users’ real ages.\n“Snapchat now offers among the most sophisticated targeting in the industry and by introducing new tools such as Audience Lenses and incorporating additional signals into our targeting, advertisers have a reliable and flexible way to ensure their ads reach the right audience,” the statement continued.\nHaving an advertiser pull spending, even temporarily, is a blow to Snap at a time when it is struggling to grow its 178 million daily users and meet Wall Street’s expectations for ad revenue growth . Snap’s third-quarter revenue rose 62% to $207.9 million, but analysts had expected $236.9 million.\nDiageo declined to comment about the company’s Snapchat advertising budget. The company said in filings that it spent about £1.8 billion ($2.4 billion) on marketing in the year ended June 30, up from about £1.6 billion in its previous financial year. \nThe Snapchat campaign isn’t the first time in recent years the Captain Morgan brand has run afoul of the ASA. In 2016, the watchdog banned a Captain Morgan TV ad for implying that alcohol could give you confidence. And in 2014, the Diageo brand was ordered to pull a Facebook ad after the ASA ruled the ad broke the rules for suggesting that alcohol could help people overcome boredom . \nWrite to Lara O’Reilly at lara.o'reilly@wsj.com", "external_links": [], "published": "2018-01-03T02:01:00.000+02:00", "crawled": "2018-01-03T02:29:54.000+02:00", "highlightTitle": ""}