{"organizations": [], "uuid": "853c8c47d16e707e71ee3262a0bdd5f078b11acc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218752714&w=1200&r=LYNXMPEE0107I", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-leeco-debt/leeco-founder-defies-china-return-order-stays-in-u-s-for-car-fundraising-idUKKBN1ER0DS", "country": "US", "domain_rank": 408, "title": "LeEco founder defies China return order, stays in U.S. for car fundraising", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T09:30:00.000+02:00", "replies_count": 0, "uuid": "853c8c47d16e707e71ee3262a0bdd5f078b11acc"}, "author": "", "url": "https://uk.reuters.com/article/us-leeco-debt/leeco-founder-defies-china-return-order-stays-in-u-s-for-car-fundraising-idUKKBN1ER0DS", "ord_in_thread": 0, "title": "LeEco founder defies China return order, stays in U.S. for car fundraising", "locations": [], "entities": {"persons": [{"name": "jia yuemin", "sentiment": "none"}, {"name": "jia", "sentiment": "none"}, {"name": "jia yueting", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "leeco", "sentiment": "negative"}, {"name": "min read  shanghai", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "china securities regulatory commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "csrc", "sentiment": "none"}, {"name": "le holdings co ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 7:34 AM / Updated 36 minutes ago LeEco founder defies China return order, stays in U.S. for car fundraising Reuters Staff 3 Min Read \nSHANGHAI (Reuters) - The founder of debt-laden tech conglomerate LeEco has defied orders from Chinese regulators to return to the country before end-2017, saying he needed to stay in the United States as a fundraising for his electric car startup was making progress. FILE PHOTO: Jia Yueting, co-founder and head of Le Holdings Co Ltd, also known as LeEco and formerly as LeTV, poses for a photo in front of a logo of his company after a Reuters interview at LeEco headquarters in Beijing, China April 22, 2016. REUTERS/Jason Le/File Photo \nThe Beijing branch of the China Securities Regulatory Commission (CSRC) issued a notice last week ordering LeEco CEO Jia Yueting to return to China to sort out a mounting debt pile linked to his firms and protect investors’ rights. \nJia said in a statement that he had asked his brother, Jia Yuemin, to meet the regulator face-to-face last Friday to provide a report after the notice was issued. \n“I am deeply sorry and blame myself for the negative impact of LeEco’s debt crisis,” he said in the statement that was posted on his official WeChat account on Tuesday. \n“The fundraising for Faraday Future in the United States is making significant progress and there are many tasks I need to push forward in order to ensure the production and timely delivery of the FF91,” he said, referring to a luxury electric vehicle (EV) that LeEco is developing with Faraday Future. \nQuestions have been raised about the outlook for the FF91, given LeEco’s spiraling cash problems as well as its decision to pull out of a joint project with British sports carmaker Aston Martin to develop RapidE electric car. \nLeEco, an entertainment, electronics and electric vehicles group, has struggled to pay its debts after rapid expansion into multiple sectors sparked a cash crunch, a plunge in the shares of a listed unit and led to multiple defaults. At its peak LeEco owed creditors 10 billion yuan ($1.54 billion). \nStruggling to support goals that included beating Elon Musk’s Tesla Motors ( TSLA.O ) in premium EV making, Jia has been trying to ride out the cash crunch by taking measures such cutting staff numbers and selling assets. \nJia said he had asked his wife, Gan Wei, and brother to represent him at Leshi Internet Information & Technology Corp ( 300104.SZ ) in exercising shareholder rights and handling the sale of assets. Jia stepped down as CEO of the group’s main listed unit in May last year. \nHe also cited a single late payment in July as being one of the key causes of LeEco’s cash-flow problems, saying it led to the freezing of his assets and prompted a slew of early loan recoveries. He said “false and malicious” reports had impacted the business. \nJia was placed on an official blacklist of debt defaulters in early December, a move taken by Chinese courts to put pressure on people and entities to repay debts. Reporting by Brenda Goh; Editing by Himani Sarkar", "external_links": [], "published": "2018-01-02T09:30:00.000+02:00", "crawled": "2018-01-02T09:53:47.040+02:00", "highlightTitle": ""}