{"organizations": [], "uuid": "8aee9369dfe3cf494c3b7a873425460db56dfdc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-paychex--ihs-markit-small-business-employment-watch-small-business-job-growth-slows-to-end-2017-hourly-earnings-average.html", "country": "US", "domain_rank": 767, "title": "Paychex | IHS Markit Small Business Employment Watch: Small Business Job Growth Slows to End 2017; Hourly Earnings Average Increase of 2.85 Percent for the Year", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:30:00.000+02:00", "replies_count": 0, "uuid": "8aee9369dfe3cf494c3b7a873425460db56dfdc7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-paychex--ihs-markit-small-business-employment-watch-small-business-job-growth-slows-to-end-2017-hourly-earnings-average.html", "ord_in_thread": 0, "title": "Paychex | IHS Markit Small Business Employment Watch: Small Business Job Growth Slows to End 2017; Hourly Earnings Average Increase of 2.85 Percent for the Year", "locations": [], "entities": {"persons": [{"name": "james diffley", "sentiment": "none"}, {"name": "martin mucci", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "rochester", "sentiment": "none"}], "organizations": [{"name": "paychex", "sentiment": "neutral"}, {"name": "ihs markit small business employment wat", "sentiment": "neutral"}, {"name": "ihs markit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROCHESTER, N.Y., Jan. 2, 2018 /PRNewswire/ -- The Paychex | IHS Markit Small Business Employment Watch closed the year with a decline in small business job growth and wages up over the previous year. The Small Business Jobs Index stands at 99.70 in December, down 0.16 percent for the month and 0.78 percent for the year. At $26.14, hourly earnings in December gained 2.76 percent ($0.70) YOY and averaged a growth rate of 2.85 percent for 2017, up from the 2016 average of 2.75 percent.\n\"Small business job growth has slowed in 2017, even as the rest of the economy accelerated,\" said James Diffley, chief regional economist at IHS Markit.\n\"While small business jobs growth slowed this year, it's important to recall that small businesses led the hiring surge coming out of the recession and maintained high levels of growth for quite some time,\" said Martin Mucci , Paychex president and CEO. \"It will be interesting to see the impact tax reform makes on job and wage growth in the months ahead.\"\nNational Jobs Index\nAt 99.70 in December, the Paychex | IHS Market Small Business Jobs Index has fallen a full percentage point from its February level, 100.78. After moderating just below 100 for several months, the national index dropped more in December (0.16 percent) than the past four months combined (0.12 percent).\nNational Wage Report\nSlowing slightly to 2.76 percent annual growth in December, hourly earnings averaged 2.85 percent in 2017, a slight increase from 2.75 percent in 2016. At 3.14 percent, weekly earnings annual growth remains strong, but decelerated month-over-month for the first time in several years.\nRegional Jobs Index\nAt 100.37, the South is the only region with an index above 100, and has ranked first every month in 2017. All four regions declined from last month and last year. At the division level, only the West South Central, with the oil recovery, and New England improved the pace of small business job growth year-over-year.\nNote: Percentages displayed in the regional heat map reflect 12-month changes.\nRegional Wage Report\nAt 3.51 percent, the West continues to be the strongest region for hourly earnings growth, nearly a full percentage point ahead of the second-ranked South (2.64 percent). The Midwest ranks last in both earnings and hours worked growth, while the West leads both categories.\nNote: Percentages displayed in the regional heat map reflect 12-month changes.\nState Jobs Index\nTennessee, Washington, and Florida lead the states with a strong level of small business job growth, despite all three decreasing approximately one percent from a year ago. Remaining in last place among states and falling further to 97.43, Missouri had its third consecutive steep decline in December, and is down 2.45 percent during the past quarter.\nNote: Analysis is provided for the 20 largest states based on U.S. population.\nState Wage Report\nArizona accelerated further in December to 5.26 percent hourly earnings growth, a year-over-year increase of $1.23. Tennessee, ranked first in small business growth for employment and hours worked, is ranked near the bottom for hourly earnings at less than two percent. Ohio and Illinois also have hourly earnings growth at less than two percent year-over-year in December.\nNote: Analysis is provided for the 20 largest states based on U.S. population\nMetropolitan Jobs Index\nImproving 1.24 percent during the past quarter to 102.00, Seattle's index ranks first among metros for the second consecutive month. Still down two percent from last year with an index level below 98, San Francisco had the best one-month gain in December, 0.47 percent. Small business employment gains in the Washington metro continue to slow, falling 0.68 percent in December and 2.44 percent from last year.\nNote: Analysis is provided for the 20 largest metro areas based on U.S. population.\nMetropolitan Wage Report\nWith growth rates less than two percent and three-month annualized rates less than one percent, Chicago, Boston, and Dallas saw hourly earnings growth decelerate as the year closed. Phoenix and San Diego widened their lead among all metros for hourly earnings growth.\nNote: Analysis is provided for the 20 largest metro areas based on U.S. population.\nIndustry Jobs Index\nWith its eighth decrease in the last nine months, Leisure and Hospitality has dropped 2.73 percent since March, from 101.79 to 99.01. While all other industries slowed or remained unchanged from last year, Manufacturing grew 1.61 percent and climbed a spot in the rankings for the third month in a row.\nNote: Analysis is provided for seven major industry sectors.\nIndustry Wage Report\nGrowth in weekly earnings picked up in Construction during 2017, climbing from 2.94 percent last December to 3.58 percent this December. Weekly earnings slowed markedly to end the year in Manufacturing and Professional and Business Services.\nNote: Analysis is provided for seven major industry sectors.\nFor more information about the Paychex | IHS Markit Small Business Employment Watch, including interactive charts detailing all data at a national, regional, state, metro, and industry level, visit www.paychex.com/employment-watch and sign up to receive monthly Employment Watch alerts.\n*Information regarding the professions included in the industry data can be found at the Bureau of Labor Statistics website .\nAbout the Paychex | IHS Markit Small Business Employment Watch\nThe Paychex | IHS Markit Small Business Employment Watch is released each month by Paychex, Inc., a leading provider of payroll, human resource, insurance, and benefits outsourcing solutions for small-to medium-sized businesses, and IHS Markit, a world leader in critical information, analytics, and expertise. Focused exclusively on small business, the monthly report offers analysis of national employment and wage trends, as well as examines regional, state, metro, and industry sector activity. Drawing from the payroll data of approximately 350,000 Paychex clients, this powerful tool delivers real-time insights into the small business trends driving the U.S. economy.\nAbout Paychex\nPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for payroll, HR, retirement, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by 45 years of industry expertise, Paychex serves approximately 605,000 payroll clients as of May 31, 2017 across more than 100 locations and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com , and stay connected on Twitter and LinkedIn .\nAbout IHS Markit ( www.ihsmarkit.com )\nIHS Markit (Nasdaq: INFO) is a world leader in critical information, analytics and expertise for the major industries and markets that drive economies worldwide. The company delivers next-generation information, analytics and solutions to customers in business, finance and government, improving their operational efficiency and providing deep i", "external_links": ["https://www.paychex.com/employment-watch/?utm_source=December%202017&utm_medium=press%20release&utm_campaign=employmentwatch#!/", "http://www.bls.gov/iag/tgs/iag_index_naics.htm", "http://media.paychex.com/martin-mucci?utm_source=December%202017&utm_medium=press%20release&utm_campaign=employmentwatch", "http://www.prnewswire.com/news-releases/paychex--ihs-markit-small-business-employment-watch-small-business-job-growth-slows-to-end-2017-hourly-earnings-average-increase-of-285-percent-for-the-year-300576310.html", "http://www.twitter.com/paychexnews", "https://www.paychex.com/employment-watch/?utm_source=December%202017&utm_medium=press%20release&utm_campaign=employmentwatch", "http://www.paychex.com/", "https://www.paychex.com/employment-watch/subscribe/?utm_source=December%202017&utm_medium=press%20release&utm_campaign=employmentwatch", "http://www.twitter.com/paychex", "http://www.ihsmarkit.com/", "https://www.linkedin.com/company/4255/"], "published": "2018-01-02T16:30:00.000+02:00", "crawled": "2018-01-02T16:32:58.062+02:00", "highlightTitle": ""}