{"organizations": [], "uuid": "af6e73e4398198a3721300f7c77dd657f71de95d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XA121_WEIGHT_SOC_20180116124026.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7201.xml", "section_title": "WSJ.com: Lifestyle", "url": "https://www.wsj.com/articles/weight-watchers-never-wants-to-say-goodbye-1516199456", "country": "US", "domain_rank": 387, "title": "Weight Watchers Never Wants to Say Goodbye", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:14:00.000+02:00", "replies_count": 0, "uuid": "af6e73e4398198a3721300f7c77dd657f71de95d"}, "author": "Ellen Byron", "url": "https://www.wsj.com/articles/weight-watchers-never-wants-to-say-goodbye-1516199456", "ord_in_thread": 0, "title": "Weight Watchers Never Wants to Say Goodbye", "locations": [], "entities": {"persons": [{"name": "mindy grossman", "sentiment": "none"}], "locations": [], "organizations": [{"name": "weight watchers never wants to say goodbye", "sentiment": "negative"}, {"name": "weight watchers international inc.", "sentiment": "neutral"}, {"name": "weight watchers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Sick of dieting? Weight Watchers International Inc. wants you to stick around forever.\nChief Executive Mindy Grossman is transforming Weight Watchers into a long-term life coach rather than a short-term buddy while shedding pounds. “We’re moving beyond a diet to a holistic way of helping people have better habits,” she says. “You should think of us as your daily partner to inspire you to be healthier.” \nAhead of the New Year’s resolution season—Weight Watchers’ biggest recruitment period—the company revamped its eating plan to make it easier to follow. In a major shift, members now have more than 200 foods that they can eat in unlimited quantities, including eggs, skinless chicken breast and shellfish. Other foods and drinks are assigned points, which members track to remain beneath an assigned daily maximum. Having more zero-point foods means less measuring and less tracking, which Weight Watchers believes will keep members on the plan longer, executives say. \n“To be the antithesis of dieting, we needed to create a plan that nudges positive changes in behavior, but in a way that feels like you can do it for a long time,” says Gary Foster, Weight Watchers’ chief scientific officer. “This doesn’t have that dieter’s prison mentality that I just have to leave my life for X number of weeks or months, and then I can get back to what I used to do.”\nWeight Watchers says longer subscriptions mean members lose more pounds and shareholders gain more returns. It is more lucrative for Weight Watchers to keep members on a plan longer because the costs of attracting new members are so high, analysts say. “Weight Watchers has to go find a whole new set of subscribers almost every year, so it’s very hard to grow,” says John Tomlinson, head of consumer research at M Science, an investment research firm. “Lower churn is extremely important and leads to long-term growth for the company because you have less of a burden to continually spend to attract new members.”\nThe changes at Weight Watchers build on its “Beyond the Scale” program, started about two years ago. To recast itself as a wellness service, the company scrapped the word “diet” from marketing materials and began promoting ways to boost mental well-being. “Think about life getting in the way, all the possible detours that happen on a weight-loss journey,” Dr. Foster says. “Happier people make healthier choices.”\n\n\nOprah Winfrey owns a stake in Weight Watchers , sits on its board and acts as its spokeswoman. She films inspirational videos in her kitchen for members, focusing on topics like gratitude, forgiveness and mindfulness. “Let’s look at all the other benefits this program, this new way of being in the world, this lifestyle change, is bringing into your life,” Ms. Winfrey says in one video. “This is not a marathon, it is not a sprint, it is a way of being in life, forever.”\nOprah Winfrey, seen in November, in West Hollywood, Calif., owns a stake in Weight Watchers and sits on the company’s board. Photo: FilmMagic/Getty Images The entire industry has shifted in the past two years, says Linda Bolton Weiser, senior analyst at D.A. Davidson & Co. Even companies that market quick weight loss, including Nutrisystem Inc., Jenny Craig and Medifast Inc., now are emphasizing well-being. “It’s now about healthiness rather than vanity, and that provides a big driver for the business,” Ms. Weiser says. “Wanting to be healthy for your family, instead of just looking great in a swimsuit, gives women—that’s the main customer here—permission to take some of their family’s disposable income and spend it on these plans.” \nWeight Watchers aims to hook users with more extensive mental well-being resources. “We have a whole mindset team that’s working on more of that and what we can own in that space,” says Deb Benovitz, Weight Watchers’ senior vice president of global insights.\nIn its most recent quarterly results, Weight Watchers reported that the average length of a member’s subscription surpassed nine months, up from an average of eight to nine months. The company chalks up some of the gain to its improved social-media platform, Connect. Members turn to Connect to swap personal stories and advice on subjects that range beyond weight loss. Once attached to the Connect community, they tend to remain Weight Watchers members longer. \nWeight Watchers reported 3.4 million end-of-period subscribers in the quarter ended September 30, 2017, up 18% over the year-earlier period. More members and longer tenures have boosted Weight Watchers’ sales and profit after years of declines.\nPatty Wedge, a retired information-technology specialist in Tulsa, Okla., joined Weight Watchers this month—her fourth time on the plan. Ms. Wedge was drawn to having more zero-point foods, which will make eating at restaurants with her husband much easier, she says. Before, Ms. Wedge would give herself about six months to reach a weight-loss goal and then quit, but this time she’s not committing to a time frame to lose the 63 pounds she wants to shed. “I’m going to stay on forever,” she says. “I need this structure because I now know I can’t do this on my own.” \nA Weight Watchers member consults the company’s app in December to learn more about the expanded list of ‘zero points’ foods. Photo: AP/Weight Watchers Ms. Wedge pays $19.95 a month for her digital membership but is considering upgrading to the plan that includes in-person meetings, which costs $44.95 a month. “I’m turning 50 this year and want to get healthy and stay healthy,” she says.\nWeight Watchers says longer adherence translates to more weight loss. On its new plan, 13.2% of members lost 10% of their body weight after three months, and 33% of people lost 10% of their body weight at six months, the company says. “This suggests that it’s not a flash-in-the-pan diet, or that people grunt their way through it,” Dr. Foster says.\nMarion Nestle , professor emerita of nutrition, food studies and public health at New York University, says keeping people on long-term weight-loss programs has benefits. “It’s easy to get weight off, but what’s really hard is keeping it off because you have to change lifetime eating habits, and that’s very difficult,” she says. Weight Watchers’ longer list of zero-point foods isn’t a blank check, however. “If you eat too much, you can gain weight on anything,” Dr. Nestle says. “It’s so difficult to get across the concept that larger portions mean more calories.”\n“It has been demonstrated that the longer that people stay in contact with a weight-loss program, the better the results,” says Donald Hensrud, medical director of the Mayo Clinic Healthy Living Program and editor of the Mayo Clinic Diet, which also encourages adherents to follow its plan indefinitely. “The same habits that help people lose weight help them keep it off.” \nRegina Schroer, a church secretary in Fairfield, Ohio, paid the monthly meeting membership for the past year as she shed 22 pounds and plans to pay for all of 2018, hoping to lose 20 more. “If I wasn’t spending this money on Weight Watchers, I’d be spending it going out to eat or on blood-pressure medication,” she says.\nCurrently, Weight Watchers offers free “lifetime” membership to people who meet their target weight within a healthy range and maintain it for at least six weeks, as long as they weigh in at a Weight Watchers meeting center every month and stay at least two pounds within their target weight. The company is e", "external_links": [], "published": "2018-01-17T17:14:00.000+02:00", "crawled": "2018-01-17T18:32:02.031+02:00", "highlightTitle": ""}