{"organizations": [], "uuid": "a5443b2956e15665835872f8850650df03fa88b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221230116&w=1200&r=LYNXMPEE0A178", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-trade-nafta-canada/chances-of-u-s-leaving-nafta-must-be-taken-seriously-canada-idUKKBN1F01Y9", "country": "US", "domain_rank": 408, "title": "Canada taking U.S. NAFTA threat seriously, seeks to end logjam", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T22:04:00.000+02:00", "replies_count": 0, "uuid": "a5443b2956e15665835872f8850650df03fa88b4"}, "author": "", "url": "https://uk.reuters.com/article/uk-trade-nafta-canada/chances-of-u-s-leaving-nafta-must-be-taken-seriously-canada-idUKKBN1F01Y9", "ord_in_thread": 0, "title": "Canada taking U.S. NAFTA threat seriously, seeks to end logjam", "locations": [], "entities": {"persons": [{"name": "rex tillerson", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "reuters/blair gable  chrystia freeland", "sentiment": "none"}, {"name": "david ljunggren", "sentiment": "none"}, {"name": "chrystia freeland", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "parliament hill", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 2:38 PM / Updated an hour ago Canada taking U.S. NAFTA threat seriously, seeks to end logjam David Ljunggren 3 Min Read \nLONDON, Ontario (Reuters) - The threat of the United States quitting NAFTA has to be taken seriously, Canada’s foreign minister said on Thursday, even as Ottawa prepares creative ideas to unblock talks to update the tri-nation treaty. FILE PHOTO - Canada's Foreign Minister Chrystia Freeland takes part in a news conference with U.S. Secretary of State Rex Tillerson (not shown) on Parliament Hill in Ottawa, Ontario, Canada, December 19, 2017. REUTERS/Blair Gable \nChrystia Freeland said the U.S. administration had repeatedly stated it could walk away from the 1994 pact between the United States, Canada and Mexico. President Donald Trump has insisted it must be reworked in favour of his country. \nCanadian government sources told Reuters on Wednesday they were increasingly convinced the United States plans to announce it intends to pull out of NAFTA. \n“The United States has been very clear since before the talks started that (a pull out) was a possibility,” Freeland told reporters. “I think we need to take our neighbours at their word, take them seriously, and so Canada is prepared for every eventuality.” \nA White House spokesman said on Wednesday there had been no change in Trump’s position on NAFTA. In any case, Trump may have trouble persuading Congress to scrap the treaty, which could be required under U.S. law. \nBut even the prospect of disruption to the heavily-integrated North American economy knocked the Canadian and Mexican currencies as well as some stocks of firms that rely heavily on North America’s integrated economy. \nOfficials are due to meet for a sixth and second-last round of scheduled negotiations on updating NAFTA in Montreal from Jan. 23-28, but the talks are in trouble. \nCanada and Mexico are unhappy about U.S. demands to establish rules of origin for NAFTA goods that would set minimum levels of U.S. content for autos, a sunset clause that would terminate the trade deal if it is not renegotiated every five years and ending the so-called Chapter 19 dispute mechanism. \nStill, Freeland said it was “absolutely possible to have a positive outcome” in Montreal if all three sides showed good will. \n“When it comes to the more unconventional U.S. proposals, we have been doing some creative thinking,” she said. \n“We have some new ideas,” she added, but declined to give details. One person familiar with government thinking said some of the ideas related to auto content. \nThe Canadian dollar steadied against the greenback on Thursday after hitting a nearly two-week low earlier in the session as investors weighed chances of a Bank of Canada interest rate hike next week and worried about NAFTA. Stocks also recovered. \nBut the Mexican peso fell by the most in nearly three weeks on Thursday, extending Wednesday’s slide, on worries over NAFTA. Mexican officials told Reuters that if Trump triggered the withdrawal process then Mexico would break off NAFTA negotiations. Reporting by David Ljunggren; Editing by Chizu Nomiyama, Andrea Ricci and Susan Thomas", "external_links": [], "published": "2018-01-11T22:04:00.000+02:00", "crawled": "2018-01-11T22:23:58.000+02:00", "highlightTitle": ""}