{"organizations": [], "uuid": "59422df9e2345c6fa672aabd0aefd9c179e58056", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-phi-group-sets-up-subsidiary-to-invest-in-broadband-communications-company.html", "country": "US", "domain_rank": 767, "title": "PHI Group Sets Up Subsidiary to Invest in Broadband Communications Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:30:00.000+02:00", "replies_count": 0, "uuid": "59422df9e2345c6fa672aabd0aefd9c179e58056"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-phi-group-sets-up-subsidiary-to-invest-in-broadband-communications-company.html", "ord_in_thread": 0, "title": "PHI Group Sets Up Subsidiary to Invest in Broadband Communications Company", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "phi group sets up subsidiary to invest in broadband communications company", "sentiment": "negative"}, {"name": "phi group, inc.", "sentiment": "neutral"}, {"name": "matrix communications", "sentiment": "none"}, {"name": "common stock", "sentiment": "none"}, {"name": "phi group", "sentiment": "none"}, {"name": "matrix communications, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New York, Jan. 09, 2018 (GLOBE NEWSWIRE) -- PHI Group, Inc., ( www.phiglobal.com ) ( OTCQB : PHIL ), a company focused on mergers and acquisitions and investments in natural resources, energy, agriculture and special situations, announced today that it has signed an Investment Agreement to acquire a high-speed broadband communications company (“Investee”) and is in the process of forming a special purpose vehicle (“SPV”) under the name of Matrix Communications, Inc., as the holding company to finance and implement this undertaking.\nAccording to the Investment Agreement, Matrix Communications will acquire all ownership and rights of the Investee in connection with high-speed broadband networks and related supporting assets to serve government, commercial and consumer telephony, data and video needs in a pre-designated West Central African country as the first point of entry into the African Continent. Matrix Communications’ authorized capital will include 600 million shares of Common Stock and 300 million shares of Preferred Stock. PHI Group will be the sole holder of Common Stock in the SPV initially and will retain fifteen percent equity interest thereof following the capitalization plan.\nThe Investment Agreement is scheduled to close on or before January 15, 2018, unless extended by mutual consent of both parties to the Agreement.\nThe principals in the Investee have decades of experience in all facets of designing, implementing, installing and operating commercial grade high-speed broadband networks, integrating wireless and wireline technologies to serve telecommunications and internet demands in a variety of geographies. The Investee also has innovative BPL (broadband-over-powerline) technologies that can be integrated into any network or used to create a true smart grid, which enhances the integration of renewable energy sources. The Investee is also working on significant telecom opportunities in Europe and the US.\nHenry Fahman, Chairman and CEO of PHI Group, Inc., stated: “We are pleased to engage in this opportunity to provide much needed high-speed broadband services to serve government, commercial and consumer telephony, data and video needs in Africa and believe that our program will not only help improve the quality of life in this continent but also provide meaningful economic returns to our investors and shareholders.”\nAbout PHI Group\nPHI Group ( www.phiglobal.com ) primarily focuses on mergers and acquisitions and invests in select industries and special situations that may substantially enhance shareholder value. PHI Group also provides M&A and consulting services through its wholly owned subsidiary, PHI Capital Holdings, Inc. ( www.phicapitalholdings.com )\nSafe Harbor\nThis news release contains forward-looking statements that are subject to certain risks and uncertainties that may cause actual results to differ materially from those projected on the basis of such forward-looking statements pursuant to the “safe-harbor” provisions of the Private Securities Litigation Reform Act of 1995.\nContact: Henry Fahman Chairman & CEO PHI Group, Inc. +1-702-475-5430 henry@phiglobal.com\nSource: PHI Group, Inc.", "external_links": ["http://www.phiglobal.com/"], "published": "2018-01-09T16:30:00.000+02:00", "crawled": "2018-01-09T18:50:56.006+02:00", "highlightTitle": ""}