{"organizations": [], "uuid": "590e96cb9dc05ca4234f9c2ecc3fb09b08aea16c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-epazz-acquires-cryptofolio-android-app-for-tracking-bitcoin-and-altcoin-portfolios-expands-into-the-investment-fintech.html", "country": "US", "domain_rank": 767, "title": "Epazz Acquires CryptoFolio Android App for Tracking Bitcoin and Altcoin Portfolios, Expands into the Investment FinTech Software Space", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:00:00.000+02:00", "replies_count": 0, "uuid": "590e96cb9dc05ca4234f9c2ecc3fb09b08aea16c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-epazz-acquires-cryptofolio-android-app-for-tracking-bitcoin-and-altcoin-portfolios-expands-into-the-investment-fintech.html", "ord_in_thread": 0, "title": "Epazz Acquires CryptoFolio Android App for Tracking Bitcoin and Altcoin Portfolios, Expands into the Investment FinTech Software Space", "locations": [], "entities": {"persons": [], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "il.", "sentiment": "none"}], "organizations": [{"name": "epazz inc", "sentiment": "negative"}, {"name": "globe newswire", "sentiment": "negative"}, {"name": "epazz inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, IL., Jan. 24, 2018 (GLOBE NEWSWIRE) -- Epazz Inc . (OTC: EPAZ), a leading provider of blockchain cryptocurrency mobile apps and cloud-based business software solutions, announced today that the company has acquired the android app CryptoFolio. The app tracks and manages your Bitcoin and Altcoin portfolios and allows you to fully control your cryptocurrency portfolio. CryptoFolio was designed to make it simple and practical to track cryptocurrency investments. Epazz Inc. acquired the software rights, source code and user base. The app has been installed over 2,900 times.\nThe CryptoFolio business model provides free features to attract users and then allows users to purchase additional features from $1.99 to $5.99 each. CryptoFolio is a great add-on app for ZenaPay, and future versions of CryptoFolio will include an option to download ZenaPay. The company will add cryptocurrencies and languages to CryptoFolio to attract more users and will also develop an IOS version of the app.\nCryptoFolio has great potential to become a leader in crypto tracking apps. Several similar apps have an installed base of over a million unique users. Epazz Inc. will evaluate the other apps to determine what additional features it should add.\n“The synergies with ZenaPay and CryptoFolio are clear,” said Shaun Passley, PhD, CEO of Epazz Inc. “CryptoFolio users will benefit from ZenaPay. We will add mobile apps through acquisition or internal development over the next few months. We believe blockchain is a very large industry, and we will use our skills to expand into this market.”\nAbout ZenaPay ( www.zenapay.com )\nZenaPay is being developed to solve a major problem in high-risk industries: getting paid. Traditional banking systems do not allow high-risk industries to access their payment systems. ZenaPay Bitcoin wallet has been download more than 10,000 times since its launch on the Android Play Store. ZenaPay offers a cutting-edge payment solution that gives consumers a way to buy items online or in stores using Bitcoin. The new Bitcoin payment software will allow consumers to use digital currency to make online or in-store purchases with ease. The process will also be anonymous because all transaction details are encrypted through Bitcoin, which will enable stores to accept digital currency instead of only cash. ZenaPay is available on the App Store and Play Store.\nAbout Epazz, Inc. ( www.epazz.com )\nEpazz, Inc. specializes in enterprise cryptocurrency blockchain mobile apps and cloud business process software, with more than 500 repeat customers. The new Bitcoin Mobile app is a financial technology company that offers unique software that allows consumers to acquire Bitcoin at the point of sale. The consumer can then use the cryptocurrency or digital currency to make a purchase at the store with ease. Epazz technology makes it easy to convert legacy systems into cloud business process software, for which the company then charges an annual subscription fee. Epazz has acquired 11 software companies that have converted or are in the process of converting their legacy software products to cloud software using Epazz technology. Epazz then markets the new cloud-based solutions to new and existing customers.\nSAFE HARBOR\n“Safe Harbor” statement under the Private Securities Litigation Reform Act of 1995: Certain statements contained in this press release are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can generally be identified by their use of forward-looking terminology such as “may,” “expect,” “intend,” “estimate,” “anticipate,” “believe” and “continue” (or the negative forms thereof) or similar terminology. Such forward-looking statements are subject to risks, uncertainties and other factors that could cause actual results to differ materially from future results or those implied by such forward-looking statements. Investors are cautioned that any forward-looking statements are not guarantees of future performance and that actual results may differ materially from those contemplated by such forward-looking statements. Epazz, Inc. assumes no obligation and has no intention of updating these forward-looking statements, and it has no obligation to update or correct information prepared by third parties that is not paid for by Epazz, Inc. Investors are encouraged to review Epazz, Inc.’s public filings on SEC.gov and otcmarkets.com , including its unaudited and audited financial statements and its OTC markets filings, which contain general business information about the company’s operations, results of operations and risks associated with the company and its operations.\nContact: Investor Relations mailto: investors@epazz.net (312) 955-8161 www.epazz.com\nSource:Epazz, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=SevgFdWCzDAPFovCFp4WZIZXCxLuJQd13_aEz5ppVd7-ofHjCB_EaYtMq0sBg8yA5n-FwL-qvKbrf1V8K_PWKg==", "https://www.globenewswire.com/Tracker?data=MGwT5zLB9xjhkI-6GYAv_xv0RUnTxkz0330TCYHbdoqnBBidTQz-Lo-iIjNmACJvSTK1d29cf65eP-b8m9lVStOOifj6Fc8WeGLe8mgtH2o=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2c972a3f-9790-4cf4-b122-a9122fe23384", "https://www.globenewswire.com/Tracker?data=WOJGbxlwm4PCr5to1ZC7WWoSbK5DV_4GP5FSWSQQMu6b688g6Obk5nPHzMwhCXasepjshDvnDxYWIVTRb1-SZQ==", "https://www.globenewswire.com/Tracker?data=VFd7bDT7G9z9q0O_hFNLh1YhYXOd_7fki6jX_IjPvpePln-zsrhlqJh3RBExayFFKHFQH83e1I1rqE3d00AhSg=="], "published": "2018-01-24T16:00:00.000+02:00", "crawled": "2018-01-24T19:13:30.021+02:00", "highlightTitle": ""}