{"organizations": [], "uuid": "fa94e7d225c74ad8fbaf1ae344ca64b29c5fb822", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220220891&w=1200&r=LYNXMPEE070ID", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-eurozone-businesssentiment/global-economic-upturn-boosts-euro-zone-investor-mood-in-january-survey-idUKKBN1EX0QJ", "country": "US", "domain_rank": 408, "title": "Global economic upturn boosts euro zone investor mood in January - survey", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T11:35:00.000+02:00", "replies_count": 0, "uuid": "fa94e7d225c74ad8fbaf1ae344ca64b29c5fb822"}, "author": "", "url": "https://uk.reuters.com/article/uk-eurozone-businesssentiment/global-economic-upturn-boosts-euro-zone-investor-mood-in-january-survey-idUKKBN1EX0QJ", "ord_in_thread": 0, "title": "Global economic upturn boosts euro zone investor mood in January - survey", "locations": [], "entities": {"persons": [{"name": "sentix", "sentiment": "none"}], "locations": [{"name": "vienna", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "global", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "muenze oesterreich", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 9:36 AM / Updated 42 minutes ago Global economic upturn boosts euro zone investor mood in January - survey Reuters Staff 3 Min Read \nBERLIN (Reuters) - Investors in the euro zone felt more upbeat in January as they shrugged off the lack of a new government in Germany and the global economy picked up, a survey showed on Monday, but research group Sentix warned there was a risk of overheating. FILE PHOTO: Two Euro coins are seen after being minted in the Austrian Mint (Muenze Oesterreich) headquarters in Vienna June 20, 2013. EUTERS/Leonhard Foeger /File Photo \nSentix’s index for the euro zone, based on a survey of 929 investors, rose to 32.9 in January from 31.1 in December. That beat the Reuters consensus forecast for a reading of 31.5 and came after a hefty fall at the end of last year. \nA subindex tracking the current situation hit its highest level since August 2007. \n“The economy in all regions of the world is looking stable and positive and is showing moderate improvements,” the Frankfurt-based research firm said, adding that this applied to regions including the euro zone, eastern Europe and Latin America. \n“The upturn is therefore broad and synchronous. The likelihood of possible overheating is rising,” Sentix added. \nIt said businesses did not seem to be bothered by the absence of a new coalition in Germany, Europe’s largest economy, which has been managed by a caretaker government since a September election. \nChancellor Angela Merkel’s attempts to form a three-way coalition last year failed but she began talks with the Social Democrats (SPD) on Sunday and said she was optimistic they could agree to form a coalition government. \nThe parties, which are likely to clash on immigration, tax, healthcare and Europe, expect to announce on Thursday whether they will open full-blown coalition talks. \nAn index tracking Germany increased to 40.1 in January from 39.1 the previous month. \nRather than focussing on the lack of a new government, investors are beginning to assess the impact of U.S. President Donald Trump’s tax reforms, which is enhancing companies’ profits and is likely to boost demand for capital goods, Sentix said. \nU.S. President Donald Trump signed a tax reform into law in December which slashes the U.S. corporate tax rate to 21 percent for 35 percent. Sentix said that was pushing up U.S. economic expectations. Reporting by Michelle Martin, editing by Thomas Escritt", "external_links": [], "published": "2018-01-08T11:35:00.000+02:00", "crawled": "2018-01-08T11:53:42.002+02:00", "highlightTitle": ""}