{"organizations": [], "uuid": "ab5ef3c6e68942e4e188fe2b84818158214d3c05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220219098&w=1200&r=LYNXMPEE070HX", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/thailand-king/thai-king-orders-history-themed-festival-paying-homage-to-past-monarchs-idINKBN1EX0P8", "country": "US", "domain_rank": 408, "title": "Thai king orders history-themed festival paying homage to past monarchs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T11:24:00.000+02:00", "replies_count": 0, "uuid": "ab5ef3c6e68942e4e188fe2b84818158214d3c05"}, "author": "", "url": "https://in.reuters.com/article/thailand-king/thai-king-orders-history-themed-festival-paying-homage-to-past-monarchs-idINKBN1EX0P8", "ord_in_thread": 0, "title": "Thai king orders history-themed festival paying homage to past monarchs", "locations": [], "entities": {"persons": [{"name": "king bhumibol", "sentiment": "none"}, {"name": "maha vajiralongkorn bodindradebayavarangkun", "sentiment": "none"}, {"name": "maha vajiralongkorn", "sentiment": "none"}, {"name": "bhumibol adulyadej", "sentiment": "none"}, {"name": "vajiralongkorn", "sentiment": "none"}], "locations": [{"name": "southeast asian", "sentiment": "none"}, {"name": "bangkok", "sentiment": "none"}, {"name": "royal plaza", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "bangkok", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 9:25 AM / in an hour Thai king orders history-themed festival paying homage to past monarchs Reuters Staff 3 Min Read \nBANGKOK (Reuters) - Thailand’s King Maha Vajiralongkorn has ordered a history-themed festival for the public, a government spokesman said on Monday, as the Southeast Asian nation emerges from a year of mourning for his revered father. Thailand's King Maha Vajiralongkorn Bodindradebayavarangkun watches the annual Royal Ploughing Ceremony in central Bangkok, Thailand, May 12, 2017. REUTERS/Athit Perawongmetha/Files \nThe king’s father, the late King Bhumibol Adulyadej, whose reign spanned seven decades, was cremated in Bangkok in October. \nThe late king, who died in October 2016, commanded the devotion of millions and helped shape Thailand for decades after World War Two. King Vajiralongkorn does not have the same level of devotion. \nThe festival, which will take place at the Royal Plaza, a public square in Bangkok, from February 8 to March 11, will feature exhibitions showcasing the life and work of his late father King Bhumibol and his great grandfather, King Chulalongkorn, who reigned from 1868 to 1910. \nThe festival will include gardens, fountains, and historic-looking structures. \n“The king wants Thai people to be happy by reminiscing about the past, that’s why the festival has a historical theme,” government spokesman Sansern Kaewkamnerd told Reuters on Monday. Thailand's King Maha Vajiralongkorn marches with the royal cremation procession of late King Bhumibol Adulyadej at the Grand Palace in Bangkok, Thailand, October 26, 2017. REUTERS/Soe Zeya Tun/Files \nHe added that the public will be encouraged to wear traditional Thai clothes and 19th century Thai fashions. \nKing Vajiralongkorn, who ascended the throne after his father’s death, quickly asserted his authority by requiring changes to a new constitution to make his powers clear and he also set about reorganising the palace. A portrait of Thai King Maha Vajiralongkorn is seen on a building on the eve of his 65th birthday in Bangkok, Thailand July 27, 2017. REUTERS/Jorge Silva/Files \nHe has issued a number of royal decrees in recent months pertaining to the promotion and dismissal of palace officials. \nHe has also been given full control of the agency that manages the multi-billion dollar holdings of the monarchy. \nOutside of the palace, the king has ordered the organisation of public events such as weekend music concerts aimed at “bringing happiness to the people”. \nKing Vajiralongkorn’s formal coronation is expected to take place later this year and could signal the start of politics following a year of mourning and the late king’s funeral. \nThai laws protecting members of the royal family from insult limit what all news organisations, including Reuters, can report from Thailand. Reporting by Panu Wongcha-um; Editing by Amy Sawitta Lefevre and Matthew Tostevin; Editing by Neil Fullick", "external_links": [], "published": "2018-01-08T11:24:00.000+02:00", "crawled": "2018-01-08T12:04:26.003+02:00", "highlightTitle": ""}