{"organizations": [], "uuid": "2a3729357528d190450d9adc661ffa01f168ba9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/25/reuters-america-update-3-in-bleak-forecast-puerto-rico-sees-no-debt-payment-ability-until-2022.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-In bleak forecast, Puerto Rico sees no debt payment ability until 2022", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T23:44:00.000+02:00", "replies_count": 0, "uuid": "2a3729357528d190450d9adc661ffa01f168ba9f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/reuters-america-update-3-in-bleak-forecast-puerto-rico-sees-no-debt-payment-ability-until-2022.html", "ord_in_thread": 0, "title": "UPDATE 3-In bleak forecast, Puerto Rico sees no debt payment ability until 2022", "locations": [], "entities": {"persons": [{"name": "ricardo rossello", "sentiment": "none"}, {"name": "rossello", "sentiment": "none"}], "locations": [{"name": "puerto rico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "prepa", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fema", "sentiment": "none"}, {"name": "u.s. federal emergency management agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2022@ (Adds comment from source familiar with board's thinking)\nJan 25 (Reuters) - Puerto Rico's governor has projected his bankrupt, hurricane-ravaged U.S. territory will run a budget deficit for the next four fiscal years, requiring new financing while leaving nothing to repay the island's $72 billion debt until 2022.\nGovernor Ricardo Rossello issued revised fiscal turnaround plans in early Thursday, painting a bleak picture of an island struggling after its worst natural disaster in 90 years while navigating the largest government bankruptcy in U.S. history.\nThe plans add detail on Rossello's vision for privatizing the debt-laden power utility, PREPA, and assumes a minimum of $35.3 billion in federal aid to help recover from Hurricane Maria which devastated Puerto Rico in September.\nA spokesman for the U.S. Federal Emergency Management Agency (FEMA) said it was too early to tell what Puerto Rico might get in so-called public assistance funding.\nPuerto Rico will need \"external liquidity support\" to maintain basic services, the plan said, and it is unclear how the projected budget deficit of $3.4 billion will be financed.\nThe oversight board, appointed to manage the island's finances and economic recovery, can request changes to the plan, which it must certify by February 23.\nA source familiar with the board's thinking said \"there is no agreement yet on the size of the fiscal gap, nor the manner of covering the gap.\"\n\"There are several choices, (including) fiscal measures to increase revenues, fiscal measures to decrease expenditures, structural reforms to increase growth ... or liquidity financing,\" the source said.\nSURPLUS TO GAP\nA previous turnaround plan, approved by Puerto Rico's federally appointed financial oversight board last April, had projected $800 million a year for debt repayment over the next decade but even that was just a quarter of what the island owed.\nBut that plan was before Hurricane Maria hit Puerto Rico, killing dozens of people, cutting power to all 3.4 million residents, and destroying tens of billions of dollars in housing.\nThe new plan projects that Maria's impact will spur increased inflation and nearly triple a contraction in gross national product this fiscal year, as well as drive some 600,000 more people from the island in the next five years.\nThe outlook turns what was formerly a projected $3.7 billion surplus through 2021 into a $3.4 billion gap in the same period, even after accounting for proposed cuts in subsidies to towns and the University of Puerto Rico, measures to boost tax collection, and the streamlining of public agencies.\nBose George, a municipal bond insurer analyst at KBW Inc, said in a note on Thursday the five-year debt moratorium was \"not surprising.\"\nA source familiar with the restructuring told Reuters late Wednesday that \"it would be a mistake to put any stock in\" the governor's projections, which \"will undoubtedly be revised again.\"\nU.S. FEDERAL AID\nThe $35.3 billion minimum projection by Rossello for federal disaster aid is derived from the FEMA public assistance program, which provides money to governments for public repair projects.\nIn a press conference on Wednesday, Rossello said the number was based on FEMA's own estimates and that the program \"has been legislated and has never been underfunded.\"\nBut Daniel Llargues, a spokesman for FEMA in Puerto Rico, said any estimate was premature.\n\"We're still working with municipalities to identify the public projects that are needed,\" he said. \"We don't know who's going to apply, who's going to qualify, and for how much.\"\nFEMA has approved $503 million in public assistance so far, Llargues said.\nFEMA assistance is only a small part of what Puerto Rico is seeking from Washington. The governor in November asked for a total of $94 billion in various sources of federal aid.\nThe latest overall aid package under discussion in the U.S. Congress is $81 billion, to be split between states and territories hit by several hurricanes last year and the California wildfires.\nSenator Kirsten Gillibrand called on Thursday for a new Marshall Plan to help the island, referring to the U.S. program that helped rebuild Western Europe after World War Two.\n\"Congress has done the bare minimum expected of us,\" the New York Democrat said at an event in Washington. \"We must forge the political will that is necessary to stand with the families\" in Puerto Rico, she said.\nENERGY OVERHAUL\nEven before Hurricane Maria, Puerto Rico was reeling under $120 billion in combined bond and pension debt and a poverty rate around 46 percent after filing the largest municipal bankruptcy in U.S. history last May.\nThe public power utility PREPA is bankrupt with $9 billion of debt.\nOn Monday, Rossello surprised Wall Street by announcing plans to privatize PREPA over the next 18 months, an endeavor that will need approval of Puerto Rico's bankruptcy judge.\nIn a separate fiscal plan for PREPA released on Thursday, Rossello called for selling PREPA's current plants to \"one or more\" private operators, and for public-private-partnerships for the construction of new plants.\nIt envisions a 25-year concession model for PREPA's transmission and distribution system, which would continue to be owned by Puerto Rico but operated by \"a single private concessionaire.\"\nA new public service commission, to regulate rates and set performance standards, would replace PREPA's current regulator, the Puerto Rico Energy Commission.\n(Reporting by Nick Brown; Additional reporting by David Alexander; Editing by Daniel Bases and Frances Kerry)", "external_links": [], "published": "2018-01-25T23:44:00.000+02:00", "crawled": "2018-01-26T11:22:46.007+02:00", "highlightTitle": ""}