{"organizations": [], "uuid": "fae8b3028c767dfe1a38fe69ed3fb3684c187c26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220520199&w=1200&r=LYNXMPEE080QF", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-eu-poland/polands-president-dismisses-several-top-ministers-idUKKBN1EY180", "country": "US", "domain_rank": 408, "title": "Poland's president dismisses several top ministers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T13:43:00.000+02:00", "replies_count": 0, "uuid": "fae8b3028c767dfe1a38fe69ed3fb3684c187c26"}, "author": "", "url": "https://uk.reuters.com/article/uk-eu-poland/polands-president-dismisses-several-top-ministers-idUKKBN1EY180", "ord_in_thread": 0, "title": "Poland's president dismisses several top ministers", "locations": [], "entities": {"persons": [{"name": "min rea", "sentiment": "negative"}, {"name": "jan szyszko", "sentiment": "none"}, {"name": "witold waszczykowski", "sentiment": "none"}, {"name": "pawel sobczak", "sentiment": "none"}, {"name": "andrzej duda", "sentiment": "none"}, {"name": "antoni macierewicz", "sentiment": "none"}, {"name": "lidia kelly", "sentiment": "none"}, {"name": "reuters/kacper pempel  duda", "sentiment": "none"}], "locations": [{"name": "poland", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "presidential palace", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 11:45 AM / Updated 40 minutes ago New Polish PM fires top ministers to reduce tensions with EU Pawel Sobczak , Lidia Kelly 5 Min Read \nWARSAW (Reuters) - Poland’s ruling conservatives fired several senior government ministers on Tuesday in an apparent move to patch up relations with the European Union strained over accusations that Warsaw is subverting rule of law standards. Mariusz Blaszczak Minister of Defence and President Andrzej Duda attend a government swearing-in ceremony at the Presidential Palace in Warsaw, Poland January 9, 2018. REUTERS/Kacper Pempel \nFacing unprecedented EU legal action over the alleged politicisation of Poland’s judiciary, the Law and Justice (PiS) party may want to defuse tensions in other areas such as environment policy and defence, analysts say. \nThe changes also came with the EU about to embark on negotiations on a new seven-year budget that will decide which member states get what out of the bloc’s coffers - with Poland currently the biggest net recipient. \nPresident Andrzej Duda, acting on recommendations of Prime Minister Mateusz Morawiecki, dismissed Environment Minister Jan Szyszko, who has spearheaded far-reaching logging in an ancient forest that prompted action by the European Court of Justice. \nAlso losing their job were Defence Minister Antoni Macierewicz, a former anti-communist crusader facing criticism over delays in modernising the army as well as conflicts with top generals, as well as Foreign Minister Witold Waszczykowski, seen in Brussels as an ineffective diplomat. \nThe reshuffle removed ministers seen from the EU perspective as combative or ill-informed. It followed the appointment of former bank CEO and finance minister Morawiecki as prime minister, replacing Beata Szydlo, last month at the midpoint of the parliamentary term. PiS faces local elections in late 2018 and legislative and presidential ballots in 2019 and 2020. \n“The new (government) should help us build a sovereign Poland within a strong Europe, a Europe of homelands,” Morawiecki said after the new appointments were announced. \nThe feud between Brussels and Warsaw’s eurosceptic government has emerged as a central element of mounting tensions between wealthier western EU members and the ex-communist east amid a wider debate over the bloc’s future. \nMany westerners are keen for EU countries to integrate further in the wake of Britain’s shock decision to leave the bloc, but this is strongly opposed by nationalist-minded politicians dominating eastern EU countries such as Poland and Hungary. QUESTIONS WHETHER GESTURE WILL WORK Poland's Prime Minister Mateusz Morawiecki speaks during a swearing-in ceremony at the Presidential Palace in Warsaw, Poland January 9, 2018. REUTERS/Kacper Pempel \nIt remains to be seen whether Morawiecki will improve Warsaw’s relations with EU headquarters in Brussels. He travels there later on Tuesday to meet top EU officials. \nPoland could face the suspension of its EU voting rights if it fails to strike a compromise on democracy and rule of law issues with Brussels, although Hungary’s like-minded government has threatened to veto such a move. \nJudicial reforms at the heart of the dispute with Brussels are seen by PiS as a fundamental element of its efforts to overhaul Poland’s democratic institutions. Slideshow (4 Images) \n“The president has already signed judiciary legislation into law so it seems the conflict is irresolvable here,” said Piotr Buras, head of the Warsaw office of the European Council on Foreign Relations think tank. \nIn a sign that policy is unlikely to change, Justice Minister Zbigniew Ziobro kept his job. New rules had given Ziobro powers to appoint the heads of lower-level courts as well as exercise oversight over prosecutors. \nThe PiS believes reforms are needed because the country has lost sight of its Catholic soul and is steeped in mentality and power structures dating to the post-war communist era. Critics say that the government’s efforts to wield control over courts and public media are tilting Poland towards authoritarian rule. \nSzyszko had attracted widespread criticism domestically over moves to lift limits on hunting and felling of trees on private property - which led to massive logging in areas of Poland. \nRadziwill has struggled to contain widespread protests by medical residents in recent months over working conditions, which have exacerbated staffing shortages in some notoriously underfunded hospitals. \nThe outgoing defence minister has been the PiS investigator into the 2010 plane crash over Russia that killed President Lech Kaczynski - the twin brother of current PiS leader Jaroslaw Kaczynski - and dozens of senior officials. \nKaczynski and Macierewicz believe the crash may have been caused by foul play and not pilot error, which was the official cause returned by an investigation by the previous centrist government and is believed by the majority of Poles. Reporting by Pawel Sobczak and Lidia Kelly; editing by Mark Heinrich", "external_links": [], "published": "2018-01-09T13:43:00.000+02:00", "crawled": "2018-01-09T13:59:10.000+02:00", "highlightTitle": ""}