{"organizations": [], "uuid": "4902a1c07c70e69f438b90d7339ba45427cbe312", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 29}, "facebook": {"likes": 39, "shares": 39, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1220985035&w=1200&r=LYNXMPEE0A02P", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-hyundai-motor-grab/hyundai-motor-invests-in-ride-hailing-firm-grab-idUSKBN1F003A", "country": "US", "domain_rank": 408, "title": "Hyundai Motor invests in ride-hailing firm Grab", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T03:24:00.000+02:00", "replies_count": 0, "uuid": "4902a1c07c70e69f438b90d7339ba45427cbe312"}, "author": "", "url": "https://www.reuters.com/article/us-hyundai-motor-grab/hyundai-motor-invests-in-ride-hailing-firm-grab-idUSKBN1F003A", "ord_in_thread": 0, "title": "Hyundai Motor invests in ride-hailing firm Grab", "locations": [], "entities": {"persons": [{"name": "didi chuxing", "sentiment": "none"}], "locations": [{"name": "southeast asian", "sentiment": "none"}, {"name": "southeast asia", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "hyundai motor", "sentiment": "negative"}, {"name": "grab reuters staff", "sentiment": "negative"}, {"name": "grab  24 am / updated", "sentiment": "neutral"}, {"name": "softbank", "sentiment": "none"}, {"name": "hyundai motor co", "sentiment": "none"}, {"name": "toyota tsusho", "sentiment": "none"}, {"name": "ioniq electric", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "hyundai", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - South Korea’s Hyundai Motor Co ( 005380.KS ) said on Thursday it had invested in Southeast Asian ride-hailing firm Grab, as it seeks to expand into the region to reduce its reliance on China following a damaging diplomatic row between Seoul and Beijing.\nHyundai’s first direct investment in a ride-hailing firm gives it a “foothold” in the world’s third-biggest ride-hailing market after China and the United States, it said.\nSingapore-based Grab, the biggest operator in the region’s third-party taxi hailing and private-vehicle hailing sector, has expanded to eight Southeast Asian countries.\n“The deal should help raise the exposure of Hyundai Motor in the region, while responding to the future mobility market,” said Lee Sang-hyun, an analyst at IBK Securities.\nHyundai’s interest in Southeast Asia has grown since South Korean companies were targeted last year in a Chinese backlash over Seoul’s decision to deploy a U.S. missile defense system against Beijing’s objections.\nThe region of about 500 million people is dominated by Japanese carmakers, while Hyundai has focused on China and the United States.\nFILE PHOTO: A Grab motorbike helmet is displayed during Grab's fifth anniversary news conference in Singapore June 6, 2017. REUTERS/Edgar Su/File Photo CATCH-UP Hyundai is also looking to catch up with its peers in future mobility, the personal transport innovations from ride-sharing to self-driving cars that are expected to reshape the auto industry.\nWhile it does offer car-sharing services in the United States and Europe, until now it has watched from the sidelines as competitors like GM ( GM.N ) and Toyota ( 7203.T ) have allied with ride-sharing partners.\nHyundai and Grab said they would jointly develop services in Southeast Asia, including one utilizing Hyundai’s eco-friendly models such as the IONIQ Electric. They did not disclose the value of Hyundai’s investment.\nHyundai last week announced for the first time a self-driving technology partnership with Silicon Valley start-up Aurora, a shift from its usual preference for developing technology itself.\nThe Hyundai tie-up is part of Grab’s latest financing round that raised $2.5 billion and included Chinese peer Didi Chuxing, Japan’s SoftBank Group Corp ( 9984.T ) and Toyota Tsusho ( 8015.T ), a Grab spokeswoman said.\nHyundai Motor vice chairman Chung Eui-sun said on Wednesday it is considering building a car plant in Southeast Asia, possibly in Indonesia or Vietnam.\nReporting by Joyce Lee and Hyunjoo Jin; Additional reporting by Aradhana Aravindan in SINGAPORE; Editing by Stephen Coates\n ", "external_links": [], "published": "2018-01-11T03:24:00.000+02:00", "crawled": "2018-01-11T03:40:32.000+02:00", "highlightTitle": ""}