{"organizations": [], "uuid": "1484b5709f53d5ffa453c04d0f475ece3518fe73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221416342&w=1200&r=LYNXMPEE0B0NH", "site_section": "http://feeds.reuters.com/reuters/INhealth\r", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/usa-trump-medical/trump-to-get-first-presidential-medical-exam-amid-questions-about-fitness-idINKBN1F1162", "country": "US", "domain_rank": 408, "title": "Trump to get first presidential medical exam amid questions about fitness", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:03:00.000+02:00", "replies_count": 0, "uuid": "1484b5709f53d5ffa453c04d0f475ece3518fe73"}, "author": "", "url": "https://in.reuters.com/article/usa-trump-medical/trump-to-get-first-presidential-medical-exam-amid-questions-about-fitness-idINKBN1F1162", "ord_in_thread": 0, "title": "Trump to get first presidential medical exam amid questions about fitness", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ronny jackso", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "bethesda", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "walter reed national military medical center", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 11:07 AM / Updated 5 hours ago Trump to get first presidential medical exam amid questions about fitness Reuters Staff 3 Min Read \nWASHINGTON (Reuters) - Donald Trump has his first medical exam as U.S. president on Friday after a week in which his mental fitness for the job has come under intense scrutiny. \nA new best-selling book portrays Trump, 71, as unfocused and childlike. The White House has faced a barrage of questions over his contradictory messages on key policies and an incident last month where he slurred some words while giving a speech. \nTrump, who has been openly exasperated with the coverage, told reporters on Thursday he expected his exam would go well. “It better go well, otherwise the stock market will not be happy,” Trump said with a smile. [nL1N1P61S0] \nThe White House will determine what data will be released from the exam, which will take place at the Walter Reed National Military Medical Center in nearby Bethesda, Maryland. \nTrump is not compelled to release any information, though the White House said the presidential physician, Ronny Jackson, will provide a statement on Friday and take questions from reporters on Tuesday. \nThere is no set template for the presidential exam. Past presidents are not known to have been tested for mental acuity while in office - including Ronald Reagan, who five years after leaving the White House was diagnosed with Alzheimer’s disease. U.S. President Donald Trump answers a question during a joint news conference with Norwegian Prime Minister Erna Solberg at the White House in Washington, U.S., January 10, 2018. REUTERS/Carlos Barria \nTrump’s examination will not include a psychiatric exam, a White House spokesman said this week. Results of past presidential physicals have included basic data like weight, blood pressure and cholesterol levels. \nThere is a long history of the White House picking and choosing what to reveal about the commander in chief’s health, said Barbara Perry, director of presidential studies at the University of Virginia’s Miller Center. \nFor example, John F. Kennedy disclosed war injuries but not the fact that he suffered from Addison’s disease, a degenerative condition. \nPerry said she believes presidents should be subject to a raft of tests to establish they are fit to serve. \nWhen he was running for office, Trump released a glowing report from his personal physician in New York, who said Trump would be “the healthiest individual ever elected to the presidency.” \nThe public report from Trump’s upcoming exam is also likely to be short and sweet, said George Annas, head of the Center for Health Law, Ethics and Human Rights at Boston University School of Public Health. \n“I don’t think you could expect to see anything else, unless it’s something that makes him look good,” Annas said. Reporting by Roberta Rampton; Editing by Jonathan Oatis", "external_links": [], "published": "2018-01-12T15:03:00.000+02:00", "crawled": "2018-01-12T21:01:55.018+02:00", "highlightTitle": ""}