{"organizations": [], "uuid": "7d68d08f67146ea727cff1e31babbcc1969f1db6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/israel-cenbank-rates-minutes/update-1-low-israel-inflation-might-warrant-central-bank-policy-tweak-minutes-idUSL8N1PJ3PF", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Low Israel inflation might warrant central bank policy tweak -minutes", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T21:58:00.000+02:00", "replies_count": 0, "uuid": "7d68d08f67146ea727cff1e31babbcc1969f1db6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/israel-cenbank-rates-minutes/update-1-low-israel-inflation-might-warrant-central-bank-policy-tweak-minutes-idUSL8N1PJ3PF", "ord_in_thread": 0, "title": "UPDATE 1-Low Israel inflation might warrant central bank policy tweak -minutes", "locations": [], "entities": {"persons": [{"name": "steven scheer jerusalem", "sentiment": "negative"}], "locations": [{"name": "israel", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "mpc", "sentiment": "none"}, {"name": "bank of israel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts, adds details, comments)\nBy Steven Scheer\nJERUSALEM, Jan 24 (Reuters) - Israel’s central bank should consider tweaking its policy brief to help better manage the economy, given how entrenched low domestic inflation has become, two ratesetters said, according to policy meeting minutes released on Wednesday.\nAll six members of its monetary policy committee (MPC) voted on Jan. 10 to hold the benchmark interest rate at 0.1 percent, where it has been for three years, the minutes showed.\nThey cited “the low inflation environment, monetary policy in major economies, and developments in the exchange rate” as factors, and the committee agreed policy should stay loose for as long as needed to establish inflation within the bank’s 1-3 percent target range.\nAmid higher wages, Bank of Israel economists believe inflation will reach 1.1 percent by the end of 2018, versus a 0.4 percent rate in 2017, triggering a 15 basis point rate hike to 0.25 percent by year-end.\nMany economists see that as optimistic and, with the local shekel currency appreciating fast, project a rate increase only in 2019.\nOne MPC member said inflation was being kept low by domestic prices that were high relative to global levels, while the government was also working to reduce the cost of living and demand was good.\n“Therefore, it would not be correct for the committee to condition a change in monetary policy only on developments in inflation.”\nThe bank should take account of additional considerations, “including the manner in which the continued low interest rate affects asset prices and savings,” the minutes Quote: d the member as saying.\nAnother MPC member noted that given persistently low inflation, the committee should consider “monetary accommodation through the use of additional policy tools”.\nEasing policy further would put the bank at odds with counterparts in much of the developed world, which are moving towards or have already embarked on monetary tightening cycles.\nPolicymakers also expressed concern over the strong shekel, for which they blamed the weak dollar. The shekel is up about 12 percent versus the greenback in the past year, hitting multi-year highs.\n“A continuation of this trend will delay the return of inflation to the target range,” the minutes said.\nThe bank’s next rates decision is scheduled for Feb. 26.\nIts main objective, enshrined in law, it to maintain price stability. But it must also support economic growth, employment and the stability of the financial system.\nIsrael’s economy grew 3 percent in 2017 and the bank sees annual growth of around 3.5 percent in the next two years.\nReporting by Steven Scheer; editing by John Stonestreet\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T21:58:00.000+02:00", "crawled": "2018-01-24T21:30:50.000+02:00", "highlightTitle": ""}