{"organizations": [], "uuid": "ba50b114cd9814926a5177aae54856fc07191c9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222424926&w=1200&r=LYNXMPEE0F0VP", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/mideast-crisis-syria-opposition/syrian-opposition-calls-on-trump-and-eu-to-up-pressure-on-russia-and-iran-idINKBN1F51J2", "country": "US", "domain_rank": 408, "title": "Syrian opposition calls on Trump and EU to up pressure on Russia and Iran", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:17:00.000+02:00", "replies_count": 0, "uuid": "ba50b114cd9814926a5177aae54856fc07191c9c"}, "author": "", "url": "https://in.reuters.com/article/mideast-crisis-syria-opposition/syrian-opposition-calls-on-trump-and-eu-to-up-pressure-on-russia-and-iran-idINKBN1F51J2", "ord_in_thread": 0, "title": "Syrian opposition calls on Trump and EU to up pressure on Russia and Iran", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "merkel", "sentiment": "none"}, {"name": "nasr hariri", "sentiment": "none"}, {"name": "angela) merkel", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "reuters/simon dawson", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "assad", "sentiment": "none"}, {"name": "hariri", "sentiment": "none"}, {"name": "bashar al-assad", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "iran reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - U.S. President Donald Trump and European Union leaders should increase pressure on President Bashar al-Assad and his allies Russia and Iran to return to talks to end Syria’s civil war, Syria’s chief opposition negotiator said on Monday.\nNasr Hariri, chief negotiator for Syria's main opposition, poses for a photograph in central London, Britain January 16, 2018. REUTERS/Simon Dawson Nasr Hariri said that unless the West forced Assad and his big power allies to seek peace then Syrian civilians would continue to be killed.\n“I would like to ask all those countries that promised they would support the Syrian people and their aspirations for democracy and peace: why didn’t they fulfil their promises?” Hariri, speaking in English, told Reuters in London.\nThe chief negotiator for Syria’s main opposition grouping, Hariri called for Trump and EU leaders such as German Chancellor Angela Merkel, French President Emmanuel Macron and British Prime Minister Theresa May to get tougher with Assad.\nAll diplomatic initiatives have so far failed to yield progress in ending the war, which is now entering its eighth year having killed hundreds of thousands of people and driven 11 million from their homes.\nThe map of Syria’s conflict has been decisively redrawn in favour of Assad and his Russian and Iranian allies during the past two years. They have recaptured major population centres in western Syria from rebels seeking to overthrow him and pushed back Islamic State in the east.\nIn the face of the collapse of rebel-held territory, most Western countries have quietly softened their positions that Assad must leave power as part of any peace deal. But the opposition entered the last formal talks last month without softening its demand Assad go, prompting the government to declare the talks pointless.\nNevertheless, Hariri suggested Western powers still had enough influence to push the government to negotiate.\n“It is time for President Trump, Chancellor Merkel and Prime Minister May to say: ‘Stop’,” the former cardiologist said.\n“It is time for Trump, Merkel and May to increase pressure and bring the international community together to get a genuine and just political situation in Syria.”\nNasr Hariri, chief negotiator for Syria's main opposition, poses for a photograph in central London, Britain January 16, 2018. REUTERS/Simon Dawson Hariri represents the Saudi-backed umbrella group of Syrian opposition groups which are opposed to Assad and supported by the West. He said the next round of the so-called “Geneva talks” on the fate of Syria would take place in late January, probably around Jan. 24-26 in Vienna.\nA spokesman for Hariri said the opposition would attend those talks.\nMORE TALKS? Hariri said discussions in Washington, including with White House national security adviser H.R. McMaster, had been positive and that the Trump administration understood the situation.\n”Iran and Russia are trying to deprioritise the transition,“ he said. ”We need the international community’s help to put pressure on the regime and their backers, Russia and Iran.\n“The Americans want to test the Russians and the regime in the next round of talks. They want to move the Geneva process forward,” Hariri said.\nWhen asked about U.S. plans to help support a 30,000-strong force dominated by the mainly Kurdish-led Syrian Democratic Forces (SDF), he said it could lead to Syria’s partition.\n“What are the benefits of establishing such an army?” he asked. “It will open the door wide for a future struggle in the region. It could open the door to the future partition of Syria.”\nAssad has responded to the plan by vowing to drive U.S. troops from Syria. Turkey has called the force a terrorist army and vowed to crush it. Iran said on Tuesday creation of the SDF force would “fan the flames of war”, echoing the vehement response of Syria, Turkey and Russia.\nHariri said it was very unlikely that the Syrian opposition would attend a meeting on Syria organised by Russia in the Black Sea resort of Sochi. The opposition had received no invitation so far, and no final decision on attendance had been made.\n“We have not been invited yet,” he said. “The general mood is not to go to Sochi. My personal view is that in its current shape, it is unacceptable to attend Sochi.”\nWriting by Guy Faulconbridge; Editing by Michael Holden and Peter Graff\n ", "external_links": [], "published": "2018-01-16T15:17:00.000+02:00", "crawled": "2018-01-16T15:31:56.002+02:00", "highlightTitle": ""}