{"organizations": [], "uuid": "defefc960927163a4b39359f81d3d8c48c016a13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-travelers-reports-fourth-quarter-net-income-and-core-income-per-diluted-share-of-1-point-98-and-2-point-28-respectively.html", "country": "US", "domain_rank": 767, "title": "Travelers Reports Fourth Quarter Net Income and Core Income per Diluted Share of $1.98 and $2.28, Respectively, Including Catastrophe Losses of $1.17 per Diluted Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T14:57:00.000+02:00", "replies_count": 0, "uuid": "defefc960927163a4b39359f81d3d8c48c016a13"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-travelers-reports-fourth-quarter-net-income-and-core-income-per-diluted-share-of-1-point-98-and-2-point-28-respectively.html", "ord_in_thread": 0, "title": "Travelers Reports Fourth Quarter Net Income and Core Income per Diluted Share of $1.98 and $2.28, Respectively, Including Catastrophe Losses of $1.17 per Diluted Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "respectively", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth Quarter Return on Equity and Core Return on Equity of 9.3% and 11.1%, Respectively\nFull Year Net Income and Core Income of $2.056 Billion and $2.043 Billion, Respectively, Including Catastrophe Losses of $1.949 Billion Pre-Tax ($1.267 Billion After-Tax)\nFull Year Return on Equity and Core Return on Equity of 8.7% and 9.0%, Respectively\nFourth quarter net income of $551 million and core income of $633 million, including $499 million pre-tax ($324 million after-tax) of catastrophe losses. Fourth quarter net income also included a charge of $129 million related to the passage of the Tax Cuts and Jobs Act of 2017. Fourth quarter consolidated combined ratio of 95.5%; underlying combined ratio remained strong at 92.4%. Fourth quarter net written premium growth of 6%; record full year net written premiums of $26.219 billion, up 5%. Total capital returned to shareholders of $549 million in the quarter, including $351 million of share repurchases. Full year total capital returned to shareholders of $2.229 billion, including $1.440 billion of share repurchases. Book value per share of $87.46 and adjusted book value per share of $83.36, up 5% and 4%, respectively, from year-end 2016. Board of Directors declared quarterly dividend per share of $0.72.\nNEW YORK--(BUSINESS WIRE)-- The Travelers Companies, Inc. today reported net income of $551 million, or $1.98 per diluted share, for the quarter ended December 31, 2017, compared to $943 million, or $3.28 per diluted share, in the prior year quarter. Net income in the quarter included a charge of $129 million related to the passage of the Tax Cuts and Jobs Act of 2017 (TCJA). Net income in the quarter also included net realized investment gains of $70 million pre-tax ($47 million after-tax), as compared to $35 million pre-tax ($24 million after-tax) in the prior year quarter. Core income in the current quarter was $633 million, or $2.28 per diluted share, compared to $919 million, or $3.20 per diluted share, in the prior year quarter. The decrease in core income was primarily driven by significantly higher catastrophe losses and a benefit in the prior year quarter of $126 million pre-tax ($82 million after-tax) from the settlement of a reinsurance dispute. These impacts to core income were partially offset by higher net favorable prior year reserve development in the current quarter. Per diluted share amounts benefited from the impact of share repurchases.\nConsolidated Highlights\n($ in millions, except for per share amounts, and after-tax, Three Months Ended December 31,\nTwelve Months Ended December 31,\nexcept for premiums & revenues) 2017 2016 Change 2017 2016 Change Net written premiums $ 6,424 $ 6,058 6 % $ 26,219 $ 24,958 5 % Total revenues $ 7,451 $ 7,193 4 $ 28,902 $ 27,625 5 Net income $ 551 $ 943 (42 ) $ 2,056 $ 3,014 (32 ) per diluted share $ 1.98 $ 3.28 (40 ) $ 7.33 $ 10.28 (29 ) Core income $ 633 $ 919 (31 ) $ 2,043 $ 2,967 (31 ) per diluted share $ 2.28 $ 3.20 (29 ) $ 7.28 $ 10.12 (28 ) Diluted weighted average 275.7 285.1 (3 ) 278.6 291.0 (4 ) shares outstanding Combined ratio 95.5 % 90.0 % 5.5 pts 97.9 % 92.0 % 5.9 pts Underlying combined ratio 92.4 % 92.0 % 0.4 pts 92.6 % 91.6 % 1.0 pts Return on equity 9.3 % 15.8 % (6.5 ) pts 8.7 % 12.5 % (3.8 ) pts Core return on equity 11.1 % 16.4 % (5.3 ) pts 9.0 % 13.3 % (4.3 ) pts As of December 31, 2017 2016 Change Book value per share $ 87.46 $ 83.05 5 % Adjusted book value per share $ 83.36 $ 80.44 4 % See Glossary of Financial Measures for definitions and the statistical supplement for additional financial data. “We were pleased to report fourth quarter core income of $633 million and core return on equity of 11.1%, particularly in light of the high level of catastrophe losses arising out of the California wildfires,” commented Alan Schnitzer, Chairman and Chief Executive Officer. “The consolidated underlying combined ratio remained strong at 92.4% as our commercial business continued to perform well and results in our personal auto business improved meaningfully due to the successful execution of the pricing and underwriting actions we began implementing a year ago. Our high-quality investment portfolio generated net investment income of $467 million after-tax, benefiting once again from strong private equity returns. These results, together with our strong balance sheet, enabled us to return $549 million of excess capital to shareholders this quarter, including $351 million of share repurchases. For the full year, we returned over $2.2 billion to shareholders, including over $1.4 billion in share repurchases.\n“We grew net written premiums by 6% in the quarter, including 5% in our commercial businesses and 8% in Personal Insurance, as we successfully executed our marketplace strategies in an improving pricing environment. In Business Insurance, domestic renewal premium change was 4%, the highest level in three years. We achieved rate increases more broadly across our product portfolio while maintaining retention at historically high levels, and we increased new business levels over the prior year quarter. In Bond & Specialty Insurance, domestic surety premiums increased 13% and retention in our domestic management liability business remained at record highs. In Personal Insurance, we achieved our dual objectives of double-digit renewal premium change in auto and continued growth in our industry-leading homeowners business.\n“In a year of extremely high catastrophe losses for the industry, our ability to generate full year core income of $2.043 billion and core return on equity of 9.0% demonstrates the value of our franchise and our consistent capital management strategy. From a position of strength, we continue to invest in our competitive advantages, focusing on extending our lead in risk expertise, improving the experience for customers, agents and brokers, and enhancing productivity and efficiency. We are encouraged by the pricing environment, the opportunities afforded by a more level playing field for domestic insurers as a result of corporate tax reform and the prospect of a strengthening economy. We remain well positioned to continue to deliver shareholder value.”\nConsolidated Results\n($ in millions and pre-tax, unless noted otherwise) Three Months Ended December 31, Twelve Months Ended December 31, 2017 2016 Change 2017 2016 Change Underwriting gain: $ 266 $ 590 $ (324 ) $ 404 $ 1,814 $ (1,410 ) Underwriting gain includes:\nNet favorable prior year reserve development 293 264 29 592 771 (179 ) Catastrophes, net of reinsurance (499 ) (137 ) (362 ) (1,949 ) (877 ) (1,072 ) Net investment income 601 627 (26 ) 2,397 2,302 95 Other income/(expense), including interest expense (77 ) 50 (127 ) (287 ) (131 ) (156 ) Core income before income taxes 790 1,267 (477 ) 2,514 3,985 (1,471 ) Income tax expense 157 348 (191 ) 471 1,018 (547 ) Core income 633 919 (286 ) 2,043 2,967 (924 ) Net realized investment gains after income taxes 47 24 23 142 47 95 Impact of TCJA at enactment (129 ) - (129 ) (129 ) - (129 ) Net income $ 551 $ 943 $ (392 ) $ 2,056 $ 3,014 $ (958 ) Combined ratio 95.5 % 90.0 % 5.5 pts 97.9 % 92.0 % 5.9 pts Impact on combined ratio\nNet favorable prior year reserve development (4.4 ) pts (4.2 ) pts (0.2 ) pts (2.3 ) pts (3.2 ) pts 0.9 pts Catastrophes, net of reinsurance 7.5 pts 2.2 pts 5.3 pts 7.6 pts 3.6 pts 4.0 pts Underlying combined ratio 92.4 % 92.0 % 0.4 pts 92.6 % 91.6 % 1.0 pts Net written premiums Business Insurance $ 3,437 $ 3,280 5 % $ 14,270 $ 13,900 3 % Bond & Specialty Insurance 606 579 5 2,359 2,271 4 Personal Insurance 2,381 2,199 8 9,590 8,787 9 Total $ 6,424 $ 6,058 6 % $ 26,219 $ 24,958 5 % Fourth Quarter 2017 Results\n(All comparisons vs. fourth quarter 2016, unless noted otherwise)\nNet income of $551 million after-tax decreased $392 million due to lower core income and a charge of $129 million related to the passage of the TCJA, partially offset by higher net realized investment gains. Net realized investment gains were $70 million pre-tax ($47 million after-tax), as compared to $35 million pre-tax ($24 million after-tax) in the prior year quarter. Core income of $633 million after-tax decreased $286 million, primarily due to the impact of significantly higher catastrophe losses and a benefit in the prior year quarter of $126 million pre-tax ($82 million after-tax) from the settlement of a reinsurance dispute. These impacts to core income were partially offset by higher net favorable prior year reserve development.\nUnderwriting results:\nThe combined ratio of 95.5% increased 5.5 points due to higher catastrophe losses (5.3 points) and a higher underlying combined ratio (0.4 points), partially offset by higher net favorable prior year reserve development (0.2 points). The underlying combined ratio remained strong at 92.4%. Net favorable prior year reserve development occurred in all segments. Catastrophe losses in the fourth quarter of 2017 included $656 million pre-tax ($426 million after-tax) arising out of wildfires in California, partially offset by favorable development of $157 million pre-tax ($102 million after-tax) primarily related to the third quarter 2017 hurricanes.\nNet investment income of $601 million pre-tax ($467 million after-tax) decreased 4%. Private equity returns remained strong but were lower than the prior year quarter, while fixed income returns declined in line with our expectations due to lower reinvestment rates available in the market.\nNet written premiums of $6.424 billion increased 6%, reflecting growth in all segments. Retention remained high and renewal premium change improved across all segments, while new business increased in our commercial businesses.\nFull Year 2017 Results\n(All comparisons vs. full year 2016, unless noted otherwise)\nNet income of $2.056 billion after-tax decreased $958 million due to lower core income and a $129 million charge related to the passage of the TCJA, partially offset by higher net realized investment gains. Net realized investment gains were $216 million pre-tax ($142 million after-tax) in the current year, as compared to $68 million pre-tax ($47 million after-tax) in the prior year. Core income of $2.043 billion after-tax decreased $924 million, primarily due to the impact of significantly higher catastrophe losses, lower net favorable prior year reserve development, a lower underlying underwriting gain (i.e., excluding net favorable prior year reserve development and catastrophe losses) and a benefit in the prior year of $126 million pre-tax ($82 million after-tax) from the settlement of a reinsurance dispute. These impacts to core income were partially offset by higher net investment income. In addition, income tax expense in the current year was reduced by $39 million as a result of the resolution of prior year tax matters.\nUnderwriting results:\nThe combined ratio of 97.9% increased 5.9 points due to higher catastrophe losses (4.0 points), a higher underlying combined ratio (1.0 point), and lower net favorable prior year reserve development (0.9 points). The underlying combined ratio of 92.6% increased 1.0 point, primarily driven by loss cost trends that modestly exceeded earned pricing in Business Insurance, a high level of non-catastrophe fire-related losses in Business Insurance and higher non-catastrophe weather-related losses in Personal Insurance, partially offset by a lower expense ratio. Net favorable prior year reserve development occurred in all segments. Catastrophe losses in 2017 primarily resulted from wildfires in California, Hurricanes Harvey, Irma and Maria, and several winter, wind and hail storms throughout the United States.\nNet investment income of $2.397 billion pre-tax ($1.872 billion after-tax) increased 4% driven by higher private equity returns, partially offset by fixed income returns that declined in line with our expectations due to lower reinvestment rates available in the market.\nRecord net written premiums of $26.219 billion increased 5% due to the same factors described above for fourth quarter 2017.\nShareholders’ Equity\nShareholders’ equity of $23.731 billion increased 2% from year-end 2016. Net unrealized investment gains included in shareholders’ equity were $1.414 billion pre-tax ($1.112 billion after-tax), compared to $1.112 billion pre-tax ($730 million after-tax) at year-end 2016. Book value per share of $87.46 and adjusted book value per share of $83.36 increased 5% and 4%, respectively, from year-end 2016.\nThe Company repurchased 2.6 million shares during the fourth quarter at an average price of $133.69 per share for a total cost of $351 million. Capacity remaining under the existing share repurchase authorization was $4.556 billion at the end of the quarter. At the end of fourth quarter 2017, statutory capital and surplus was $20.448 billion and the ratio of debt-to-capital was 21.7%. The ratio of debt-to-capital excluding after-tax net unrealized investment gains included in shareholders’ equity was 22.5%, within the Company’s target range of 15% to 25%.\nThe Board of Directors today declared a quarterly dividend of $0.72 per share. This dividend is payable on March 30, 2018, to shareholders of record as of the close of business on March 9, 2018.\nBusiness Insurance Segment Financial Results\n($ in millions and pre-tax, unless noted otherwise) Three Months Ended December 31, Twelve Months Ended December 31, 2017 2016 Change 2017 2016 Change Underwriting gain: $ 399 $ 386 $ 13 $ 251 $ 769 $ (518 ) Underwriting gain includes:\nNet favorable prior year reserve development 244 221 23 439 424 15 Catastrophes, net of reinsurance (53 ) (74 ) 21 (858 ) (463 ) (395 ) Net investment income 449 467 (18 ) 1,786 1,701 85 Other income 2 123 (121 ) 24 168 (144 ) Segment income before income taxes 850 976 (126 ) 2,061 2,638 (577 ) Income tax expense 213 275 (62 ) 448 656 (208 ) Segment income $ 637 $ 701 $ (64 ) $ 1,613 $ 1,982 $ (369 ) Combined ratio 88.6 % 88.6 % - pts 97.8 % 94.1 % 3.7 pts Impact on combined ratio\nNet favorable prior year reserve development (6.7 ) pts (6.3 ) pts (0.4 ) pts (3.1 ) pts (3.1 ) pts - pts Catastrophes, net of reinsurance 1.4 pts 2.1 pts (0.7 ) pts 6.0 pts 3.4 pts 2.6 pts Underlying combined ratio 93.9 % 92.8 % 1.1 pts 94.9 % 93.8 % 1.1 pts Net written premiums by market Domestic Select Accounts $ 661 $ 639 3 % $ 2,800 $ 2,729 3 % Middle Market 1,863 1,751 6 7,756 7,379 5 National Accounts 259 259 - 1,010 1,058 (5 ) National Property and Other 381 394 (3 ) 1,691 1,779 (5 ) Total Domestic 3,164 3,043 4 13,257 12,945 2 International 273 237 15 1,013 955 6 Total $ 3,437 $ 3,280 5 % $ 14,270 $ 13,900 3 % Fourth Quarter 2017 Results\n(All comparisons vs. fourth quarter 2016, unless noted otherwise)\nSegment income for Business Insurance was $637 million after-tax, a decrease of $64 million, primarily driven by lower other income due to a benefit in the prior year quarter of $126 million pre-tax ($82 million after-tax) from the settlement of a reinsurance dispute.\nUnderwriting results:\nThe combined ratio of 88.6% was consistent with the prior year quarter. The underlying combined ratio of 93.9% increased 1.1 points, primarily driven by the impact of loss cost trends that modestly exceeded earned pricing. Net favorable prior year reserve development primarily resulted from better than expected loss experience in the segment’s domestic operations in (i) the workers’ compensation product line for multiple accident years and (ii) the commercial multi-peril product line for multiple accident years, partially offset by (iii) higher than expected loss experience in the commercial automobile product line for recent accident years.\nNet written premiums of $3.437 billion increased 5% and benefited from higher renewal premium change, continued strong retention and an increase in new business.\nFull Year 2017 Results\n(All comparisons vs. full year 2016, unless noted otherwise)\nSegment income for Business Insurance was $1.613 billion after-tax, a decrease of $369 million, primarily driven by significantly higher catastrophe losses, lower other income due to a benefit in the prior year of $126 million pre-tax ($82 million after-tax) from the settlement of a reinsurance dispute and a lower underlying underwriting gain, partially offset by higher net investment income. In addition, income tax expense in the current year was reduced by $15 million as a result of the resolution of prior year tax matters.\nUnderwriting results:\nThe combined ratio of 97.8% increased 3.7 points due to higher catastrophe losses (2.6 points) and a higher underlying combined ratio (1.1 points). The underlying combined ratio of 94.9% increased 1.1 points, primarily driven by the impact of loss cost trends that modestly exceeded earned pricing and a high level of non-catastrophe fire-related losses, partially offset by a lower expense ratio. Net favorable prior year reserve development primarily resulted from better than expected loss experience in the domestic (i) workers’ compensation product line for multiple accident years, (ii) the general liability product line (excluding an increase to asbestos and environmental reserves) for both primary and excess coverages for multiple accident years, (iii) the commercial multi-peril product line for liability coverages for multiple accident years, partially offset by (iv) a $225 million increase to asbestos reserves, (v) the impact of higher than expected loss experience in the commercial automobile product line for recent accident years and (vi) a $65 million increase to environmental reserves. Net unfavorable prior year reserve development in the segment’s international operations in Europe primarily resulted from the UK Ministry of Justice’s “Ogden” discount rate adjustment applied to lump sum bodily injury payouts.\nOther income in the prior year included a $126 million pre-tax ($82 million after-tax) benefit from the settlement of a reinsurance dispute and the favorable settlement of a claims-related legal matter.\nNet written premiums of $14.270 billion increased 3% and benefited from the same factors as described above for fourth quarter 2017.\nBond & Specialty Insurance Segment Financial Results\n($ in millions and pre-tax, unless noted otherwise) Three Months Ended December 31, Twelve Months Ended December 31, 2017 2016 Change 2017 2016 Change Underwriting gain: $ 94 $ 178 $ (84 ) $ 512 $ 761 $ (249 ) Underwriting gain includes:\nNet favorable prior year reserve development 42 79 (37 ) 140 350 (210 ) Catastrophes, net of reinsurance 2 (1 ) 3 (6 ) (6 ) - Net investment income 54 62 (8 ) 228 239 (11 ) Other income 8 7 1 24 21 3 Segment income before income taxes 156 247 (91 ) 764 1,021 (257 ) Income tax expense 44 75 (31 ) 208 309 (101 ) Segment income $ 112 $ 172 $ (60 ) $ 556 $ 712 $ (156 ) Combined ratio 83.7 % 67.8 % 15.9 pts 77.4 % 65.7 % 11.7 pts Impact on combined ratio\nNet favorable prior year reserve development (7.2 ) pts (13.7 ) pts 6.5 pts (6.1 ) pts (15.5 ) pts 9.4 pts Catastrophes, net of reinsurance (0.2 ) pts 0.2 pts (0.4 ) pts 0.3 pts 0.3 pts - pts Underlying combined ratio 91.1 % 81.3 % 9.8 pts 83.2 % 80.9 % 2.3 pts Net written premiums Domestic Management Liability $ 337 $ 332 2 % $ 1,367 $ 1,342 2 % Surety 196 173 13 793 757 5 Total Domestic 533 505 6 2,160 2,099 3 International 73 74 (1 ) 199 172 16 Total $ 606 $ 579 5 % $ 2,359 $ 2,271 4 % Fourth Quarter 2017 Results\n(All comparisons vs. fourth quarter 2016, unless noted otherwise)\nSegment income for Bond & Specialty Insurance was $112 million after-tax, a decrease of $60 million, primarily driven by a lower underlying underwriting gain and lower net favorable prior year reserve development.\nUnderwriting results:\nThe combined ratio of 83.7% increased 15.9 points due to a higher underlying combined ratio (9.8 points) and lower net favorable prior year reserve development (6.5 points), partially offset by favorable development on catastrophe losses that occurred earlier in 2017 (0.4 points). The underlying combined ratio of 91.1% increased 9.8 points, primarily due to a charge for a single international surety loss. Net favorable prior year reserve development resulted from better than expected loss experience in the segment’s domestic operations in the general liability product line for management liability coverages for multiple accident years.\nNet written premiums of $606 million increased 5%, reflecting an increase in domestic surety premiums, continued strong retention, improved renewal premium change and an increase in new business in domestic management liability.\nFull Year 2017 Results\n(All comparisons vs. full year 2016, unless noted otherwise)\nSegment income for Bond & Specialty Insurance was $556 million after-tax, a decrease of $156 million, primarily driven by lower net favorable prior year reserve development and a lower underlying underwriting gain. In addition, income tax expense in the current year was reduced by $17 million as a result of the resolution of prior year tax matters.\nUnderwriting results:\nThe combined ratio of 77.4% increased 11.7 points due to lower net favorable prior year reserve development (9.4 points) and a higher underlying combined ratio (2.3 points). The underlying combined ratio remained strong at 83.2% and increased 2.3 points, primarily due to a charge for a single international surety loss. Net favorable prior year reserve development resulted from better than expected loss experience in the segment’s domestic operations in the general liability product line for management liability coverages for multiple accident years.\nNet written premiums of $2.359 billion increased 4% and benefited from the same factors as described above for fourth quarter 2017.\nPersonal Insurance Segment Financial Results\n($ in millions and pre-tax, unless noted otherwise) Three Months Ended December 31, Twelve Months Ended December 31, 2017 2016 Change 2017 2016 Change Underwriting gain/(loss): $ (227 )\n$ 26 $ (253 ) $ (359 ) $ 284 $ (643 ) Underwriting gain/(loss) includes:\nNet favorable/(unfavorable) prior year reserve development 7 (36 ) 43 13 (3 ) 16 Catastrophes, net of reinsurance (448 ) (62 ) (386 ) (1,085 ) (408 ) (677 ) Net investment income 98 98 - 383 362 21 Other income 15 16 (1 ) 60 63 (3 ) Segment income/(loss) before income taxes (114 ) 140 (254 ) 84 709 (625 ) Income tax expense/(benefit) (64 ) 33 (97 ) (44 ) 192 (236 ) Segment income/(loss) $ (50 ) $ 107 $ (157 ) $ 128 $ 517 $ (389 ) Combined ratio 108.7 % 98.0 % 10.7 pts 103.1 % 95.8 % 7.3 pts Impact on combined ratio\nNet (favorable)/unfavorable prior year reserve development (0.3 ) pts 1.6 pts (1.9 ) pts (0.1 ) pts - pts (0.1 ) pts Catastrophes, net of reinsurance 18.6 pts 2.8 pts 15.8 pts 11.7 pts 4.9 pts 6.8 pts Underlying combined ratio 90.4 % 93.6 % (3.2 ) pts 91.5 % 90.9 % 0.6 pts Net written premiums Domestic Agency 1 Automobile $ 1,172 $ 1,058 11 % $ 4,646 $ 4,103 13 % Homeowners & Other 955 918 4 3,933 3,772 4 Total Agency 2,127 1,976 8 8,579 7,875 9 Direct to Consumer 90 79 14 361 309 17 Total Domestic 2,217 2,055 8 8,940 8,184 9 International 164 144 14 650 603 8 Total $ 2,381 $ 2,199 8 % $ 9,590 $ 8,787 9 % 1 Represents business sold through agents, brokers and other intermediaries, and excludes direct to consumer. Fourth Quarter 2017 Results\n(All comparisons vs. fourth quarter 2016, unless noted otherwise)\nSegment loss for Personal Insurance of $50 million after-tax compared to segment income of $107 million in the prior year quarter. The change was due to significantly higher catastrophe losses, partially offset by a higher underlying underwriting gain and net favorable prior year reserve development compared to net unfavorable prior year reserve development in the prior year quarter.\nUnderwriting results:\nThe combined ratio of 108.7% increased 10.7 points due to higher catastrophe losses (15.8 points), partially offset by a lower underlying combined ratio (3.2 points) and net favorable prior year reserve development compared to net unfavorable prior year reserve development in the prior year quarter (1.9 points). The underlying combined ratio of 90.4% improved 3.2 points, primarily driven by the timing impact in the prior year quarter of higher loss estimates for auto bodily injury liability coverages and earned pricing that exceeded loss cost trends in the current quarter, partially offset by higher non-catastrophe weather-related losses. The underlying combined ratio also benefited from a lower expense ratio.\nNet written premiums of $2.381 billion increased 8%. Agency Automobile net written premiums grew 11%, driven by renewal premium change of 11%. Agency Homeowners & Other net written premiums grew 4%, benefiting from policies in force growth of 5% year-over-year and positive renewal premium change.\nFull Year 2017 Results\n(All comparisons vs. full year 2016, unless noted otherwise)\nSegment income for Personal Insurance was $128 million after-tax, a decrease of $389 million, primarily driven by significantly higher catastrophe losses, partially offset by higher net investment income, a higher underlying underwriting gain and net favorable prior year reserve development compared to net unfavorable prior year reserve development in the prior year. In addition, income tax expense in the current year was reduced by $7 million as a result of the resolution of prior year tax matters.\nUnderwriting results:\nThe combined ratio of 103.1% increased 7.3 points due to higher catastrophe losses (6.8 points) and a higher underlying combined ratio (0.6 points), partially offset by net favorable prior year reserve development (0.1 points). The underlying combined ratio of 91.5% increased 0.6 points, primarily driven by an increase in non-catastrophe weather-related losses and the tenure impact of higher levels of new business in auto, partially offset by earned pricing that modestly exceeded loss cost trends and a lower expense ratio.\nNet written premiums of $9.590 billion increased 9%, benefiting from the same factors as described above for the fourth quarter 2017.\nFinancial Supplement and Conference Call\nThe information in this press release should be read in conjunction with a financial supplement that is available on our website at www.travelers.com . Travelers management will discuss the contents of this release and other relevant topics via webcast at 9 a.m. Eastern (8 a.m. Central) on Tuesday, January 23, 2018. Investors can access the call via webcast at http://investor.travelers.com or by dialing 1-800-410-5148 within the U.S. and 1-303-223-4378 outside the U.S. Prior to the webcast, a slide presentation pertaining to the quarterly earnings will be available on the Company’s website.\nFollowing the live event, an audio playback of the webcast and the slide presentation will be available on the same website. An audio playback can also be accessed by phone at 1-800-633-8284 within the U.S. and 1-402-977-9140 outside the U.S. (use reservation 21875486 for both the U.S. and international calls).\nAbout Travelers\nThe Travelers Companies, Inc. (NYSE: TRV) is a leading provider of property casualty insurance for auto , home and business . A component of the Dow Jones Industrial Average, Travelers has approximately 30,000 employees and generated revenues of approximately $29 billion in 2017. For more information, visit www.travelers.com .\nTravelers may use its website and/or social media outlets, such as Facebook and Twitter, as distribution channels of material Company information. Financial and other important information regarding the Company is routinely accessible through and posted on our website at http://investor.travelers.com , our Facebook page at https://www.facebook.com/travelers and our Twitter account (@Travelers) at https://twitter.com/travelers . In addition, you may automatically receive email alerts and other information about Travelers when you enroll your email address by visiting the Email Notifications section at http://investor.travelers.com .\nTravelers is organized into the following reportable business segments:\nEffective April 1, 2017, the Company’s results are reported in the following three business segments – Business Insurance, Bond & Specialty Insurance and Personal Insurance, reflecting a change in the manner in which the Company’s businesses were being managed as of that date, as well as the aggregation of products and services based on the type of customer, how the business is marketed and the manner in which risks are underwritten. While the segmentation of the Company’s domestic businesses was unchanged, the Company’s international businesses, which were previously managed and reported in total within the Business and International Insurance segment, were disaggregated by product type among the three newly aligned reportable business segments. All prior periods presented have been reclassified to conform to this presentation. In connection with these changes, the Company revised the names and descriptions of certain businesses comprising the Company’s segments and has reflected other related changes.\nBusiness Insurance – Business Insurance offers a broad array of property and casualty insurance and insurance related services to its customers, primarily in the United States, as well as in Canada, the United Kingdom, the Republic of Ireland, Brazil and throughout other parts of the world as a corporate member of Lloyd’s.\nBond & Specialty Insurance – Bond & Specialty Insurance provides surety, fidelity, management liability, professional liability, and other property and casualty coverages and related risk management services to its customers in the United States, and certain specialty insurance products in Canada, the United Kingdom, the Republic of Ireland and Brazil, utilizing various degrees of financially-based underwriting approaches.\nPersonal Insurance – Personal Insurance writes a broad range of property and casualty insurance covering individuals’ personal risks, primarily in the United States, as well as in Canada. The primary products of automobile and homeowners insurance are complemented by a broad suite of related coverages.\n* * * * *\nForward-Looking Statements\nThis press release contains, and management may make, certain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. All statements, other than statements of historical facts, may be forward-looking statements. Words such as “may,” “will,” “should,” “likely,” “anticipates,” “expects,” “intends,” “plans,” “projects,” “believes,” “estimates” and similar expressions are used to identify these forward-looking statements. These statements include, among other things, the Company’s statements about:\nthe Company’s outlook and its future results of operations and financial condition (including, among other things, anticipated premium volume, premium rates, margins, net and core income, investment income and performance, loss costs, return on equity, core return on equity and expected current returns and combined ratios); share repurchase plans; future pension plan contributions; the sufficiency of the Company’s asbestos and other reserves; the impact of emerging claims issues as well as other insurance and non-insurance litigation; the cost and availability of reinsurance coverage; catastrophe losses; the impact of investment, economic (including inflation, recent changes in tax law, rapid changes in commodity prices, and fluctuations in foreign currency exchange rates) and underwriting market conditions; strategic and operational initiatives to improve profitability and competitiveness, and competitive advantages; new product offerings; and the impact of the Company’s acquisition of Simply Business.\nThe Company cautions investors that such statements are subject to risks and uncertainties, many of which are difficult to predict and generally beyond the Company’s control, that could cause actual results to differ materially from those expressed in, or implied or projected by, the forward-looking information and statements.\nSome of the factors that could cause actual results to differ include, but are not limited to, the following:\ncatastrophe losses could materially and adversely affect the Company’s results of operations, its financial position and/or liquidity, and could adversely impact the Company’s ratings, the Company’s ability to raise capital and the availability and cost of reinsurance; if actual claims exceed the Company’s claims and claim adjustment expense reserves, or if changes in the estimated level of claims and claim adjustment expense reserves are necessary, including as a result of, among other things, changes in the legal, regulatory and economic environments in which the Company operates, the Company’s financial results could be materially and adversely affected; during or following a period of financial market disruption or an economic downturn, the Company’s business could be materially and adversely affected; the Company’s investment portfolio is subject to credit risk, and may suffer material realized or unrealized losses. The Company’s investment portfolio may also suffer reduced or low returns, particularly if interest rates remain at historically low levels for a prolonged period of time or decline further as a result of actions taken by central banks (a risk which potentially could be increased by, among other things, the United Kingdom’s withdrawal from the European Union); the Company’s business could be harmed because of its potential exposure to asbestos and environmental claims and related litigation; the intense competition that the Company faces, and the impact of innovation, technological change and changing customer preferences on the insurance industry and the markets in which it operates, could harm its ability to maintain or increase its business volumes and its profitability; disruptions to the Company’s relationships with its independent agents and brokers or the Company’s inability to manage effectively a changing distribution landscape could adversely affect the Company; the Company is exposed to, and may face adverse developments involving, mass tort claims such as those relating to exposure to potentially harmful products or substances; the effects of emerging claim and coverage issues on the Company’s business are uncertain; the Company may not be able to collect all amounts due to it from reinsurers, reinsurance coverage may not be available to the Company in the future at commercially reasonable rates or at all and we are exposed to credit risk related to our structured settlements; the Company is also exposed to credit risk in certain of its insurance operations and with respect to certain guarantee or indemnification arrangements that we have with third parties; within the United States, the Company’s businesses are heavily regulated by the states in which it conducts business, including licensing, market conduct and financial supervision, and changes in regulation may reduce the Company’s profitability and limit its growth; a downgrade in the Company’s claims-paying and financial strength ratings could adversely impact the Company’s business volumes, adversely impact the Company’s ability to access the capital markets and increase the Company’s borrowing costs; the inability of the Company’s insurance subsidiaries to pay dividends to the Company’s holding company in sufficient amounts would harm the Company’s ability to meet its obligations, pay future shareholder dividends and/or make future share repurchases; the Company’s efforts to develop new products, expand in targeted markets, or improve business processes and workflows may not be successful and may create enhanced risks; the Company may be adversely affected if its pricing and capital models provide materially different indications than actual results; the Company’s business success and profitability depend, in part, on effective information technology systems and on continuing to develop and implement improvements in technology, particularly as our business processes become more digital; if the Company experiences difficulties with technology, data and network security (including as a result of cyber attacks), outsourcing relationships, or cloud-based technology, the Company’s ability to conduct its business could be negatively impacted; the Company is also subject to a number of additional risks associated with its business outside the United States, including foreign currency exchange fluctuations and restrictive regulations, as well as the risks and uncertainties associated with the United Kingdom’s withdrawal from the European Union; regulatory changes outside of the United States, including in Canada, the United Kingdom and the European Union, could adversely impact the Company’s results of operations and limit its growth; loss of or significant restrictions on the use of particular types of underwriting criteria, such as credit scoring, or other data or methodologies, in the pricing and underwriting of the Company’s products could reduce the Company’s future profitability; acquisitions and integration of acquired businesses may result in operating difficulties and other unintended consequences; the Company could be adversely affected if its controls designed to ensure compliance with guidelines, policies and legal and regulatory standards are not effective; the Company’s businesses may be adversely affected if it is unable to hire and retain qualified employees; intellectual property is important to the Company’s business, and the Company may be unable to protect and enforce its own intellectual property or the Company may be subject to claims for infringing the intellectual property of others; changes in federal regulation could impose significant burdens on the Company and otherwise adversely impact the Company’s results; changes to existing U.S. accounting standards may adversely impact the Company’s reported results; changes in U.S. tax laws or in the tax laws of other jurisdictions in which the Company operates could adversely impact the Company; and the Company’s share repurchase plans depend on a variety of factors, including the Company’s financial position, earnings, share price, catastrophe losses, maintaining capital levels commensurate with the Company’s desired ratings from independent rating agencies, funding of the Company’s qualified pension plan, capital requirements of the Company’s operating subsidiaries, legal requirements, regulatory constraints, other investment opportunities (including mergers and acquisitions and related financings), market conditions and other factors.\nOur forward-looking statements speak only as of the date of this press release or as of the date they are made, and we undertake no obligation to update forward-looking statements. For a more detailed discussion of these factors, see the information under the captions “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our most recent annual report on Form 10-K filed with the Securities and Exchange Commission (SEC) on February 16, 2017, as updated by our periodic filings with the SEC.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.travelers.com%2Fpersonal-insurance%2Fauto-insurance%2Findex.aspx&esheet=51746357&newsitemid=20180123005789&lan=en-US&anchor=auto&index=3&md5=f46ad244c26a328419e086d5c837861f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.travelers.com&esheet=51746357&newsitemid=20180123005789&lan=en-US&anchor=www.travelers.com&index=6&md5=79d70bc5ac500c8e4f019ab8736ab71a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.travelers.com%2F&esheet=51746357&newsitemid=20180123005789&lan=en-US&anchor=http%3A%2F%2Finvestor.travelers.com&index=2&md5=c8aa80ec068fb62a921967b65e66a261", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2Ftravelers&esheet=51746357&newsitemid=20180123005789&lan=en-US&anchor=https%3A%2F%2Fwww.facebook.com%2Ftravelers&index=8&md5=e869dfb5528e39cf55c62d28cdf091b4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.travelers.com&esheet=51746357&newsitemid=20180123005789&lan=en-US&anchor=http%3A%2F%2Finvestor.travelers.com&index=10&md5=8f224dfd234b8cd7507ac0db21b8fff2", "https://www.facebook.com/travelers", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Ftravelers&esheet=51746357&newsitemid=20180123005789&lan=en-US&anchor=https%3A%2F%2Ftwitter.com%2Ftravelers&index=9&md5=d5e44327cdc609b443797bd4c20677c5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.travelers.com&esheet=51746357&newsitemid=20180123005789&lan=en-US&anchor=http%3A%2F%2Finvestor.travelers.com&index=7&md5=c37cdb74f3ff1fc4c6f06496aab8080a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.travelers.com%2Fbusiness-insurance%2Findex.aspx&esheet=51746357&newsitemid=20180123005789&lan=en-US&anchor=business&index=5&md5=c79f451074a45bf170fea8962292d03c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.travelers.com&esheet=51746357&newsitemid=20180123005789&lan=en-US&anchor=www.travelers.com&index=1&md5=e3c21dcfa718496b7e1b742056a33a71", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.travelers.com%2Fpersonal-insurance%2Fhome-insurance%2Findex.aspx&esheet=51746357&newsitemid=20180123005789&lan=en-US&anchor=home&index=4&md5=81c49193d339357ea53ce092e5ca2e06", "https://twitter.com/travelers"], "published": "2018-01-23T14:57:00.000+02:00", "crawled": "2018-01-23T18:03:56.006+02:00", "highlightTitle": ""}