{"organizations": [], "uuid": "12e58c61ede50d6786d9a97e31017fd81799b70c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-scientific-games-announces-selected-preliminary-fourth-quarter-2017-results-in-connection-with-the-opportunity-to-refinance-a.html", "country": "US", "domain_rank": 767, "title": "Scientific Games Announces Selected Preliminary Fourth Quarter 2017 Results in Connection with the Opportunity to Refinance a Portion of Its Debt", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T14:55:00.000+02:00", "replies_count": 0, "uuid": "12e58c61ede50d6786d9a97e31017fd81799b70c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-scientific-games-announces-selected-preliminary-fourth-quarter-2017-results-in-connection-with-the-opportunity-to-refinance-a.html", "ord_in_thread": 0, "title": "Scientific Games Announces Selected Preliminary Fourth Quarter 2017 Results in Connection with the Opportunity to Refinance a Portion of Its Debt", "locations": [], "entities": {"persons": [], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "scientific games corporation", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "operations the company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 24, 2018 /PRNewswire/ -- Scientific Games Corporation (NASDAQ: SGMS) (\"Scientific Games\" or the \"Company\") today announced selected preliminary financial results for the fourth quarter and full year ended December 31, 2017, in connection with the opportunity to refinance a portion of its debt to take advantage of favorable market conditions to lower its cost of debt and extend maturities.\nResults of Operations\nThe Company currently expects consolidated revenue to increase approximately nine percent to a range of approximately $820-to-$825 million for the three month period ended December 31, 2017, and full year 2017 revenue to grow approximately seven percent and be in a range of approximately $3,081-to-$3,086 million compared to $752 million and $2,883 million for the fourth quarter and full year 2016, respectively.\nThe Company further expects that its net loss for the fourth quarter 2017 will be in a range of approximately $40-to-$50 million, inclusive of a projected $28 million of restructuring and other charges, which primarily includes M&A costs associated with the NYX Gaming Group transaction that was completed on January 5, 2018. Full year 2017 net loss is expected to be in a range of approximately $238-to-$248 million. Fourth quarter 2016 net loss was $111 million and full year 2016 net loss was $354 million.\nFourth quarter 2017 Attributable EBITDA (\"AEBITDA\"), a non-GAAP financial measure defined below, is expected to be approximately $320-to-$325 million with full year 2017 AEBITDA of approximately $1,220-to-$1,225 million. Fourth quarter 2016 AEBITDA was $294 million and full year 2016 AEBITDA was $1,104 million.\n\"Our preliminary results for the fourth quarter 2017 reflect our focus on generating top-line growth and ongoing improvements across our gaming, lottery and interactive operations,\" said Kevin Sheehan, CEO and President of Scientific Games . \"I am proud of the dedication and success achieved by the collaborative efforts of our Scientific Games colleagues around the globe who continue to empower our customers and deliver success for all our stakeholders.\"\nThe preliminary unaudited results noted in this release are derived from preliminary internal financial reports and are subject to revision based on the Company's procedures and controls associated with the completion of its year-end financial reporting, including all the customary reviews and approvals, and completion by the Company's independent registered public accounting firm of its audit of such financial statements for the year ended December 31, 2017. Accordingly, actual results may differ from these preliminary results and such differences may be material. The Company currently anticipates releasing its fourth quarter results and full year 2017 results on February 28, 2018 after market close.\nThe Company is sharing these preliminary financial results with its prospective lenders in connection with a potential refinancing transaction, in which it would take advantage of favorable market conditions to refinance approximately $1,400 million of its outstanding 7.000% senior secured notes due 2022 and approximately $185 million of borrowings under its revolving credit facility with a combination of new senior secured term loans and new senior secured notes, as well as approximately $300 million of new senior unsecured notes. The Company has not committed to engage in any refinancing transaction, the terms of the potential refinancing transaction described above is subject to change, and the pursuit of any refinancing transaction is subject to market conditions.\nAbout Scientific Games\nScientific Games Corporation (NASDAQ: SGMS) is a world leader in gaming entertainment offering the industry's broadest and most integrated portfolio of game content, advanced systems, cutting-edge platforms and professional services. The company is #1 in technology-based gaming systems, digital real-money gaming and sports betting platforms, casino table games and utility products and lottery instant games, and a leading provider of games, systems and services for casino, lottery and social gaming. Committed to responsible gaming, Scientific Games delivers what customers and players value most: trusted security, engaging entertainment content, operating efficiencies and innovative technology. For more information, please visit www.scientificgames.com , which is updated regularly with financial and other information about the Company.\nCOMPANY CONTACTS\nInvestor Relations:\nMichael Quartieri +1 702-532-7658\nExecutive Vice President and Chief Financial Officer\nMedia Relations:\nSusan Cartwright +1 702-532-7981\nVice President, Corporate Communications\nsusan.cartwright@scientificgames.com\nForward-Looking Statements\nIn this press release, Scientific Games makes \"forward-looking statements\" within the meaning of the U.S. Private Securities Litigation Reform Act of 1995, including statements regarding the Company's unaudited preliminary financial and operational results for the fourth quarter and full year 2017. Forward-looking statements describe future expectations, plans, results or strategies and can often be identified by the use of terminology such as \"may,\" \"will,\" \"estimate,\" \"intend,\" \"plan,\" \"continue,\" \"believe,\" \"expect,\" \"anticipate,\" \"target,\" \"should,\" \"could,\" \"potential,\" \"opportunity,\" \"goal,\" \"preliminary\" or similar terminology. These statements are based upon management's current expectations, assumptions and estimates and are not guarantees of timing, future results or performance. Therefore, you should not rely on any of these forward-looking statements as predictions of future events. Actual results may differ materially from those contemplated in these statements due to a variety of risks and uncertainties and other factors, including, among other things: competition; U.S. and international economic and industry conditions; slow growth of new gaming jurisdictions, slow addition of casinos in existing jurisdictions and declines in the replacement cycle of gaming machines; ownership changes and consolidation in the gaming industry; opposition to legalized gaming or the expansion thereof; inability to adapt to, and offer products that keep pace with, evolving technology, including any failure of our investment of significant resources in our research and development efforts; inability to develop successful products and services and capitalize on trends and changes in our industries, including the expansion of internet and other forms of interactive gaming; laws and government regulations, including those relating to gaming licenses and environmental laws; legislative interpretation, regulatory perception and regulatory risks with respect to gaming and sports wagering; reliance on technological blocking systems; expectations of shift to regulated online gaming or sports wagering; dependence upon key providers in our Interactive social gaming business; inability to retain or renew, or unfavorable revisions of, existing contracts, and the inability to enter into new contracts; protection of our intellectual property, inability to license third-party intellectual property, and the intellectual property rights of others; security and integrity of our products and systems and reliance on or failures in information technology and other systems; challenges or disruptions relating to the implementation of a new global enterprise resource planning system; failure to maintain adequate internal control over financial reporting; natural events that disrupt our operations or those of our customers, suppliers or regulators; inability to benefit from, and risks associated with, strategic equity investments and relationships; failure to achieve the intended benefits of our acquisitions, including the acquisition of NYX Gaming Group Limited (\"NYX\"); the ability to successfully integrate our acquisitions, including the acquisition of NYX; incurrence of restructuring costs; implementation of complex revenue recognition standards or other new accounting standards; changes in estimates or judgments related to our impairment analysis of goodwill or other intangible assets; fluctuations in our results due to seasonality and other factors; dependence on suppliers and manufacturers; risks relating to foreign operations, including fluctuations in foreign currency exchange rates, restrictions on the payment of dividends from earnings, restrictions on the import of products and financial instability, including the potential impact to our business resulting from the affirmative vote in the U.K. to withdraw from the European Union and the potential impact to our instant lottery game concession or video lottery terminal lease arrangements resulting from the economic and political conditions in Greece; changes in tax laws or tax rulings, or the examination of our tax positions; dependence on key employees; litigation and other liabilities relating to our business, including litigation and liabilities relating to our contracts and licenses, our products and systems, our employees (including labor disputes), intellectual property, environmental laws and our strategic relationships; level of our indebtedness, higher interest rates, availability or adequacy of cash flows and liquidity to satisfy indebtedness, other obligations or future cash needs; inability to consummate the potential refinancing transactions described herein or otherwise reduce or refinance our indebtedness; restrictions and covenants in debt agreements, including those that could result in acceleration of the maturity of our indebtedness; influence of certain stockholders, including decisions that may conflict with the interests of other stockholders; and stock price volatility.\nAdditional information regarding risks and uncertainties and other factors that could cause actual results to differ materially from those contemplated in forward-looking statements is included from time to time in our filings with the SEC, including the Company's current reports on Form 8-K, quarterly reports on Form 10-Q and its latest annual report on Form 10-K filed with the SEC on March 3, 2017 (including under the headings \"Forward Looking Statements\" and \"Risk Factors\"). Forward-looking statements speak only as of the date they are made and, except for our ongoing obligations under the U.S. federal securities laws, we undertake no obligation to publicly update any forward-looking statements whether as a result of new information, future events or otherwise.\nThe notes, if any, to be offered in connection with any refinancing transactions will not be registered under the Securities Act of 1933, as amended (the \"Securities Act\") or any state securities laws and, unless so registered, may not be offered or sold in the United States except pursuant to an applicable exemption from the registration requirements of the Securities Act and applicable state securities laws. Any such notes will be offered only to qualified institutional buyers in accordance with Rule 144A and to non-U.S. Persons under Regulation S under the Securities Act. This press release does not and will not constitute an offer to sell or the solicitation of an offer to buy any such notes, nor will there be any sale of any such notes in any state in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state.\nNon-GAAP Financial Measures\nThe Company's management uses AEBITDA, among other things, to: (i) monitor and evaluate performance of the Company's business operations; (ii) facilitate management's internal comparisons of the Company's historical operating performance; and (iii) analyze and evaluate financial and strategic planning decisions regarding future operating investments and operating budgets. In addition, the Company's management uses AEBITDA to facilitate management's external comparisons of the Company's results to the historical operating performance of other companies that may have different capital structures and debt levels.\nThe Company's management believes that AEBITDA, a non-GAAP financial measure, is useful as it provides investors with information regarding the Company's operating performance that is an integral part of management's reporting and planning processes. In particular, the Company's management believes that AEBITDA is helpful because this non-GAAP financial measure eliminates the effects of restructuring, transaction, integration or other items that management believes have less bearing on the Company's ongoing underlying operating performance. Moreover, management believes AEBITDA is useful to investors because the Company's lottery business is also conducted through a number of equity investments, and those measures eliminate financial items from the equity investees' earnings that management believes have less bearing on the equity investees' performance.\nAEBITDA\nAEBITDA, as used herein, is a non-GAAP financial measure that is presented as supplemental disclosure and is reconciled to net income (loss) as the most directly comparable GAAP measure, as set forth in the schedule below. AEBITDA should not be considered in isolation of, as a substitute for, or superior to, the financial information prepared in accordance with GAAP, and should be read in conjunction with the Company's financial statements filed with the SEC. AEBITDA may differ from similarly titled measures presented by other companies.\nAEBITDA, as used herein, is reconciled to net income (loss) in the following table and includes our net loss with the following adjustments: (1) income tax provision (benefit); (2) depreciation and amortization expense and impairment charges (including goodwill impairment charges); (3) interest expense; (4) restructuring and other, which includes charges or expenses attributable to: (i) employee severance; (ii) management changes; (iii) restructuring and integration; (iv) cost savings initiatives; (v) M&A and other, which includes: (a) M&A transaction costs, (b) purchase accounting, (c) unusual items (including legal settlements), and (d) other non-cash items; (5) stock-based compensation; (6) loss (gain) on debt financing transactions; and (7) change in fair value of investments (included in other expense, net). In addition to the preceding adjustments, \"Equity investments\" in the table below excludes earnings from equity method investments and adds (without duplication) our pro rata share of the EBITDA of our equity investments.\nReconciliation of Net Loss to AEBITDA\nNon-GAAP Reconciliation\n($ in millions)\nCondensed Reconciliation of Net Loss to Attributable EBITDA\n(Preliminary and Unaudited)\n(Unaudited)\nQ4-2017\n2017\nQ4-2016\n2016\nNet loss (1)\n$ (40)\n-\n$ (50)\n$ (238)\n-\n$ (248)\n$ (110.8)\n$ (353.7)\nIncome tax (benefit) provision\n(7)\n-\n(2)\n10\n-\n15\n(66.5)\n(125.0)\nDepreciation, amortization and impairments (1)\n170\n683\n242.3\n807.7\nInterest expense\n150\n610\n165.0\n661.4\nRestructuring and other\n28\n46\n36.3\n54.8\nStock-based compensation and other expense, net\n11\n36\n7.8\n26.4\nLoss (gain) on debt financing transactions\n-\n38\n-\n(25.2)\nEquity investments\n13\n40\n19.4\n57.2\nAttributable EBITDA\n$ 325\n-\n$ 320\n$ 1,225\n-\n$ 1,220\n$ 293.5\n$ 1,103.6\n(1) Includes a $69 million goodwill impairment charge in the fourth quarter and full-year 2016 results.\nView original content with multimedia: http://www.prnewswire.com/news-releases/scientific-games-announces-selected-preliminary-fourth-quarter-2017-results-in-connection-with-the-opportunity-to-refinance-a-portion-of-its-debt-300587228.html\nSOURCE Scientific Games Corporation", "external_links": ["http://www.prnewswire.com/news-releases/scientific-games-announces-selected-preliminary-fourth-quarter-2017-results-in-connection-with-the-opportunity-to-refinance-a-portion-of-its-debt-300587228.html", "http://www.scientificgames.com/"], "published": "2018-01-24T14:55:00.000+02:00", "crawled": "2018-01-24T14:58:24.023+02:00", "highlightTitle": ""}