{"organizations": [], "uuid": "27e25716e86375572556da744f39791e8ead0093", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/canada-ipo/canadian-ipo-activity-seen-accelerating-in-2018-idUSL1N1OY0VF", "country": "US", "domain_rank": 408, "title": "Canadian IPO activity seen accelerating in 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T14:00:00.000+02:00", "replies_count": 0, "uuid": "27e25716e86375572556da744f39791e8ead0093"}, "author": "", "url": "https://www.reuters.com/article/canada-ipo/canadian-ipo-activity-seen-accelerating-in-2018-idUSL1N1OY0VF", "ord_in_thread": 0, "title": "Canadian IPO activity seen accelerating in 2018", "locations": [], "entities": {"persons": [{"name": "john tilak", "sentiment": "none"}, {"name": "matt scuffham", "sentiment": "none"}, {"name": "peter miller", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "ipo", "sentiment": "negative"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 12:01 PM / Updated 20 minutes ago Canadian IPO activity seen accelerating in 2018 John Tilak , Matt Scuffham 3 Min Read \nTORONTO, Jan 4 (Reuters) - Initial public offerings by Canadian companies are expected to increase in 2018, driven by activity in industrials, alternative energy and base metals sectors, banking advisers said. \nCompanies raised C$4.6 billion ($3.7 billion) through IPOs in Canada in 2017, marking a surge in activity following a lull the previous year, according to numbers from Thomson Reuters that were released on Thursday. There were 22 IPOs, the highest for Canada since 2013. \nGlobal equity markets have been climbing, generating a positive climate for company flotations, despite uncertainty around trade deals and the political environment. \n“The markets are very much shrugging off all of these risks right now and maintaining quite a bit of calm and optimism,” said Peter Miller, co-head of global equity capital markets at BMO. “The IPO market looks more attractive versus the M&A alternative.” \nWith asset valuations at elevated levels, private equity firms are looking to monetize their investments, often choosing between an IPO and a sale. \nReuters has reported that private equity-owned Canadian waste management company GFL Environmental Inc is looking to raise as much as C$1 billion in an IPO this year and Onex Corp-backed wood pellets producer Pinnacle Renewable Energy Inc is set to list in Toronto. \nKirby Gavelin, head of equity capital markets at RBC, said he was bullish on Canadian equities activity in 2018. \nGavelin said he expects to see companies in the energy and mining sectors file to go public if prices hold up, following last year’s IPO from oil pipeline operator Kinder Morgan Canada Ltd that raised C$1.75 billion. \n“The environment is right, the volatility is low, and there is a good supply of quality names,” said Benoit Lauzé, head of equity capital markets at CIBC, who was an advisor on the wildly successful Canada Goose offering in 2017. “I feel really good about the IPO market.” \nSome bankers said there was a scarcity value for quality private Canadian companies with a potential to tap the market. \n“Canadian investors continue to look for opportunities and high-growth companies,” said Darin Deschamps, co-head of Wells Fargo Securities Canada. “They are on the lookout for new stories.” ($1 = 1.2529 Canadian dollars) (Reporting by John Tilak and Matt Scuffham; Editing by Jim Finkle and Rosalba O‘Brien)", "external_links": [], "published": "2018-01-04T14:00:00.000+02:00", "crawled": "2018-01-04T14:27:54.004+02:00", "highlightTitle": ""}