{"organizations": [], "uuid": "61d246cb11d277b25658497b61984fb3a9756575", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-mars-petcare-acquisition-of-genoscoper-to-accelerate-discovery-of-genetic-health-markers-for-companion-animals.html", "country": "US", "domain_rank": 767, "title": "Mars Petcare Acquisition of Genoscoper to Accelerate Discovery of Genetic Health Markers for Companion Animals", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T13:00:00.000+02:00", "replies_count": 0, "uuid": "61d246cb11d277b25658497b61984fb3a9756575"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-mars-petcare-acquisition-of-genoscoper-to-accelerate-discovery-of-genetic-health-markers-for-companion-animals.html", "ord_in_thread": 0, "title": "Mars Petcare Acquisition of Genoscoper to Accelerate Discovery of Genetic Health Markers for Companion Animals", "locations": [], "entities": {"persons": [{"name": "genoscoper", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "genoscoper laboratories", "sentiment": "none"}, {"name": "university of helsinki", "sentiment": "none"}, {"name": "wisdom health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS, January 11, 2018 /PRNewswire/ --\nDynamic partnership is longstanding, with duo newly launching WISDOM PANEL™ Health\nMars Petcare acquired Genoscoper Laboratories, a specialist in molecular diagnostics for companion animals. The acquisition will accelerate the pace of discoveries in genetics, to form the basis for future practical applications in enabling precision healthcare for pets.\nMars Petcare's genetic testing unit Wisdom Health is a pioneer in this field with its market leading breed detection test WISDOM PANEL [ TM ] . Finland-based Genoscoper, in close partnership with University of Helsinki, created the genetic health testing platform MyDogDNA . Since 2015, Genoscoper and Wisdom Health have partnered to discover new genetic health markers for companion animals and have recently launched a new product for dogs, WISDOM PANEL™ Health , combining breed ancestry with detection of potential inherited health conditions.\n\"Our world-class genetics research is focused on helping pet owners and veterinarians improve the health of pets with tools that define their genetic predispositions for health and disease. Ultimately this will enable targeted and preventive veterinary care with pets getting individualized nutrition, exercise and treatment,\" said Leonid Sudakov, President, Connected Solutions, Mars Petcare. \"This is a critical time in the development of genetic testing for pets, which we believe is poised to expand dramatically as breeders, veterinarians and pet owners increasingly understand its benefits, exactly as it is currently happening for humans.\"\n\"Through Genoscoper's strong research expertise in companion animal genomics, we developed a unique concept that brings top level academic discoveries into practice enabling even further advances; not only scientifically speaking, but for the benefit of entire animal populations,\" said Professor Hannes Lohi, Chairman of Genoscoper and leader of the University of Helsinki canine genetics research group. \"Our long-term vision has been to adopt the biggest advances in canine genetics research to improve animal welfare, and that exactly is where I see this partnership leading.\"\nThe acquisition was finalized on 27 December 2017, and the companies will manage the transition over the course of 2018.\nA few of the benefits of genetic testing include:\nGenetic tests can detect which animals might be carriers for specific diseases, so breeders can avoid mating them with another carrier. Genetic testing can also identify mixed-breed dogs at risk for developing a genetic condition that may otherwise go undiagnosed; allowing the owner to be counselled as to how to best manage the condition. WISDOM PANEL™ canine DNA tests can also provide details about a dog's breed ancestry fulfilling many owners' curiosities about their dog's heritage, but it may be especially revealing for dogs who work with the emergency services or as support animals. There is also a new test, OPTIMAL SELECTION™ Feline, developed by Wisdom Health and Genoscoper for cat breeders to identify more than 40 genetically associated conditions, over 20 traits, and genetic diversity information which can help identify potential mates through genetic compatibility.\nAbout Genoscoper Laboratories\nGenoscoper Laboratories is a Finland-based animal diagnostics company established in 1995. Its testing concept helps explore inherited characteristics in companion animals with the world's first commercially available genome-wide DNA analysis. The technology uses a comprehensive panel approach to test for known mutations, while simultaneously recording thousands of neutral chromosomal markers that can be used to measure genetic diversity and even locate new mutations associated with other genetic disorders. For further information, please visit http://www.mydogdna.com/ .\nAbout Wisdom Health\nWisdom Health is a business unit of Mars Petcare, the U.S. operations of the world's largest pet care company at the privately-held Mars, Incorporated. Its mission is facilitating responsible pet care by enhancing the well-being and relationship between pets, pet owners, breeders, shelters and veterinarians through valuable insights into pets as individuals. For more than a decade, Wisdom Health has researched and developed state-of-the-art genetic tests for companion animals, revolutionizing personalized pet care. By unlocking the secrets of their dog or cat's DNA, owners and veterinarians can work together to tailor wellness programs that fit the one-of-a-kind needs of their unique pet. For more information, visit http://www.wisdompanel.com or join the conversation on Facebook, Twitter, Instagram and YouTube.\nAbout Mars Petcare\nMars Petcare is the world's leading pet nutrition and health care business that strives to make A Better World for Pets every day. Mars Petcare believes that pets make our lives better and that pet ownership brings joy and benefits which should be accessible to everyone. Mars Petcare has a total of 41 brands in our portfolio, including billion dollar brands PEDIGREE®, WHISKAS®, ROYAL CANIN® and BANFIELD®. Other leading brands include: IAMS®, CESAR®, SHEBA®, NUTRO®, DREAMIES®, EUKANUBA®, BLUEPEARL® and PET PARTNERS [ TM ] and the WALTHAM Centre for Pet Nutrition, a leading scientific authority on pet nutrition and well-being. Mars Petcare has more than 40,000 Associates worldwide.\nFor more information about Mars Petcare, please visit http://www.mars.com/global/brands/petcare . Join us on Instagram and LinkedIn .\nAbout Mars, Incorporated\nMars is a family-owned business with more than a century of history making diverse products and offering services for people and the pets people love. With almost $35 billion in sales, the company is a global business that produces some of the world's best-loved brands: M&M's®, SNICKERS®, TWIX®, MILKY WAY®, DOVE®, PEDIGREE®, ROYAL CANIN®, WHISKAS®, EXTRA®, ORBIT®, 5™, SKITTLES®, UNCLE BEN'S®, MARS DRINKS and COCOAVIA®. Mars also provides veterinary health services that include BANFIELD® Pet Hospitals, Blue Pearl®, VCA® and Pet Partners™. Headquartered in McLean, VA, Mars operates in more than 80 countries. The Mars Five Principles - Quality, Responsibility, Mutuality, Efficiency and Freedom - inspire its more than 100,000 Associates to create value for all its partners and deliver growth they are proud of every day.\nFor more information about Mars, please visit http://www.mars.com . Join us on Facebook , Twitter , LinkedIn , Instagram and YouTube .\nSOURCE Mars Petcare", "external_links": ["http://www.mars.com/global/brands/petcare", "https://www.instagram.com/marsglobal/", "https://www.wisdompanel.com/about_wp/", "https://twitter.com/MarsGlobal", "http://mydogdna.com/", "http://www.mars.com/", "https://www.facebook.com/Mars/", "https://www.youtube.com/user/Mars", "https://www.instagram.com/mars_petcare/", "https://www.optimal-selection.com/optimal_selection_cats/", "https://www.wisdompanel.com/wisdom-panel-health/", "https://www.linkedin.com/showcase/7794150/", "http://www.mydogdna.com/", "https://www.linkedin.com/company-beta/1544/"], "published": "2018-01-11T13:00:00.000+02:00", "crawled": "2018-01-11T15:12:02.030+02:00", "highlightTitle": ""}