{"organizations": [], "uuid": "1e20bc59eb08edc61a601b293628fb52583e76d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104924412-GettyImages-125205561.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/02/vice-suspends-2-top-execs-after-sexual-misconduct-report.html", "country": "US", "domain_rank": 767, "title": "Vice suspends 2 top execs after sexual misconduct report", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T22:13:00.000+02:00", "replies_count": 0, "uuid": "1e20bc59eb08edc61a601b293628fb52583e76d8"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/vice-suspends-2-top-execs-after-sexual-misconduct-report.html", "ord_in_thread": 0, "title": "Vice suspends 2 top execs after sexual misconduct report", "locations": [], "entities": {"persons": [{"name": "andrew creighton", "sentiment": "none"}, {"name": "suroosh alvi", "sentiment": "none"}, {"name": "creighton", "sentiment": "none"}, {"name": "germano", "sentiment": "none"}, {"name": "shane smith", "sentiment": "none"}, {"name": "sarah broderick", "sentiment": "none"}, {"name": "mike germano", "sentiment": "none"}], "locations": [], "organizations": [{"name": "new york times", "sentiment": "negative"}, {"name": "times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Vice has suspended two top executives after a New York Times report on sexual misconduct at the digital media company.\nVice Media put its president, Andrew Creighton, and chief digital officer Mike Germano on leave as it investigates allegations against them, according to a company memo sent to employees Tuesday. A Vice spokesman declined to comment.\nThe Times had reported in late December that it found four settlements involving allegations of sexual harassment or defamation against Vice employees, including Creighton. The newspaper talked with more than two dozen women who say they experienced or witnessed sexual misconduct, including groping and forced kisses.\nVice Media co-founders Shane Smith and Suroosh Alvi have apologized for the \"boy's club\" culture.\nVice has grown from a Canadian magazine to a dominant online video company, expanding into TV around the world.\nThe memo, from Vice's chief operating officer and CFO Sarah Broderick, said that Creighton and Germano were the only two people named in the Times story with allegations against them who were still employed at Vice.\nThe Times reported that Vice paid a former female employee a $135,000 settlement in 2016 after she said she was fired when she rejected Creighton's advances. The Vice memo says her claims were found to lack merit at the time after a review by law firm, but a special committee of its board is looking at the matter now. It will make a recommendation on what to do before a Jan. 11 board meeting.\nAs for Germano, the memo says Vice's human-resources department and an external investigator are looking into the allegations. One woman told the Times that he had told her he didn't want to hire her because he wanted to have sex with her. Another woman said he pulled her on to his lap at a work event at a bar.\nThe Associated Press was not immediately able to reach Germano and Creighton for comment.\nVice's memo also laid out how the company is trying to change its culture. It said the company will require mandatory sexual harassment training for all employees starting later this month and that the company was \"committed\" to having half of employees be female \"at every level across the organization\" by 2020. Broderick said \"pay parity\" would come by the end of this year.\nThe reports of sexual misconduct at Vice are part of a wave of allegations of bad behavior in media, entertainment and other industries, as well as politics, that have come in the aftermath of articles detailing Harvey Weinstein's decades of alleged rape and harassment this fall.", "external_links": [], "published": "2018-01-02T22:13:00.000+02:00", "crawled": "2018-01-02T22:54:19.000+02:00", "highlightTitle": ""}