{"organizations": [], "uuid": "d95b1942f15abcb95ffc13281e17d4c98e299db7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/09/reuters-america-update-5-huaweis-att-u-s-smartphone-deal-collapses.html", "country": "US", "domain_rank": 767, "title": "UPDATE 5-Huawei's AT&T U.S. smartphone deal collapses", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:59:00.000+02:00", "replies_count": 0, "uuid": "d95b1942f15abcb95ffc13281e17d4c98e299db7"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/reuters-america-update-5-huaweis-att-u-s-smartphone-deal-collapses.html", "ord_in_thread": 0, "title": "UPDATE 5-Huawei's AT&T U.S. smartphone deal collapses", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "huawei", "sentiment": "negative"}, {"name": "at&t", "sentiment": "negative"}, {"name": "at&t inc", "sentiment": "none"}, {"name": "federal communications commission", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "huawei technologies co ltd", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Huawei was close to announcing a partnership with AT&T - sources\n* Huawei says flagship Mate 10 Pro will not be sold by US carrier\n* AT&T walked away from deal due to political pressure - media\n* Huawei has only 0.5 pct share of US smartphone mkt - Canalys (Adds context about growing U.S. skepticism of Chinese investment)\nHONG KONG, Jan 9 (Reuters) - Huawei Technologies Co Ltd's planned deal with U.S. carrier AT&T Inc to sell its smartphones in the United States has collapsed at the eleventh hour, people with knowledge of the matter said, in a blow to the Chinese firm's global ambitions.\nA separate person familiar with the discussions said that security concerns had arisen, without elaborating further.\nAT&T was pressured to drop the deal after members of the U.S. Senate and House intelligence committees sent a letter on Dec. 20 to the Federal Communications Commission citing concerns about Huawei's plans to launch consumer products through a major U.S. telecom carrier, online tech news site The Information reported.\nHuawei said in a statement to Reuters on Tuesday that its flagship premium smartphone Mate 10 Pro - Huawei's challenger to the iPhone - will be sold in the United States only through open channels.\n\"The U.S. market presents unique challenges for Huawei, and while the HUAWEI Mate 10 Pro will not be sold by U.S. carriers, we remain committed to this market now and in the future,\" it said.\nHuawei is the world's third largest smartphone vendor by volume after Samsung Electronics and Apple Inc , but it has a mere 0.5 percent share of the U.S. smartphone market, compared with 39 percent for Apple and 18 percent for Samsung, according to industry tracker Canalys.\nThe United States has viewed Chinese investment skeptically, fearing Chinese companies could provide U.S. technological know-how to their country's government and military. Washington began to have concerns about Chinese investment before President Donald Trump became president last year, and those concerns have heightened.\nBecause of this skepticism, including the U.S. government's rejection of several Chinese deals, Chinese investment in the United States fell from $50 billion in 2016 to $25 billion last year, according to Derek Scissors, a China expert at the American Enterprise Institute.\nDeals killed recently by the multi-agency Committee on Foreign Investment in the United States (CFIUS) include Ant Financial's plan to buy U.S. money transfer company MoneyGram International Inc, the purchase by China-backed Canyon Bridge Capital Partners LLC of a U.S. chip maker and plans by Zhongwang USA, backed by a Chinese aluminum tycoon, to buy a U.S. aluminum maker.\nA bipartisan group of lawmakers in the U.S. Senate and House of Representatives introduced bills in November to toughen U.S. foreign investment rules amid concern about Chinese efforts to buy U.S. high-tech companies as well as companies with data like personal information about American citizens.\nIn 2012, Huawei and ZTE Corp were the subject of a U.S. investigation into whether the companies' equipment provided an opportunity for foreign espionage and threatened critical U.S. infrastructure - a link that Huawei has consistently denied.\nIn the United States, where telecom carriers dominate the distribution channel by typically providing subsidies and special package deals, Huawei had been unable to make any significant inroads due to national security concerns.\nAT&T declined to comment.\nThe flagship Mate 10 Pro that was to be introduced is Huawei's most high end product to date, equipped with its own AI-powered chips that Huawei says process data much faster than those used by Apple and Samsung. It was launched in Europe in October with a price tag of 799 euros ($955).\nHuawei's smartphone chief Richard Yu flagged Huawei's ambition to become a truly global smartphone brand in 2018 in his New Year address to staff, and also told The Information in an interview in late December that it planned to spend $100 million to raise brand awareness in the United States.\n\"This makes it very difficult for Huawei to get significant in the US as the open channels account for only about 10-11 percent of the market,\" said Canalys analyst Mo Jia, referring to sales channels outside telecom carriers and vendors' own stores.\nHe said Huawei's proprietary mobile chips may have presented a bigger regulatory hurdle for its U.S. market entry in the current political climate, compared with other Chinese vendors' entry strategy that relies on U.S. chip suppliers. ($1 = 0.8363 euros) (Reporting by Sijia Jiang in Hong Kong; Additional reporting by Stephen Nellis in San Francisco, Anjali Athavaley in New York, David Shepardson and Diane Bartz in Washington, D.C. and Sonam Rai in Bengaluru; Editing by Muralikumar Anantharaman and Andrew Hay)", "external_links": [], "published": "2018-01-09T20:59:00.000+02:00", "crawled": "2018-01-09T23:26:54.002+02:00", "highlightTitle": ""}