{"organizations": [], "uuid": "9ba4258efb08728ec01d352549a21f2a5abd00f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2016/11/arizona-sheriff-defea_ode.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/09/joe-arpaio-senate/", "country": "US", "domain_rank": 1196, "title": "Sheriff Joe Arpaio Wants to Replace Jeff Flake in U.S. Senate | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.522, "site_type": "news", "published": "2018-01-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "9ba4258efb08728ec01d352549a21f2a5abd00f2"}, "author": "Chris Morris", "url": "http://fortune.com/2018/01/09/joe-arpaio-senate/", "ord_in_thread": 0, "title": "Sheriff Joe Arpaio Wants to Replace Jeff Flake in U.S. Senate | Fortune", "locations": [], "entities": {"persons": [{"name": "jeff flake", "sentiment": "negative"}, {"name": "chris morris", "sentiment": "negative"}, {"name": "joe arpaio", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "arpaio", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "make america great again", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "maricopa county sheriff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Joe Arpaio, Controversial Sheriff President Trump Pardoned, Is Running for U.S. Senate in Arizona Ross D. Franklin/AP January 09, 2018 12:58 PM This story originally appeared on Fortune \nControversial former Arizona sheriff Joe Arpaio says he plans to run for the U.S. Senate, just four-and-a-half months after receiving a presidential pardon . \nMaking the announcement via Twitter, Arpaio said he’s running “to support the agenda and policies of President Donald Trump in his mission to Make America Great Again.” I am running for the U.S. Senate from the Great State of Arizona, for one unwavering reason: to support the agenda and policies of President Donald Trump in his mission to Make America Great Again. https://t.co/ANppBdDOtp \n— Sheriff Joe Arpaio (@RealSheriffJoe) January 9, 2018 \nArpaio is seeking to fill the vacancy being created by Sen. Jeff Flake’s announcement that he would not seek re-election , a decision he says he made because of the current political environment and Trump. \nThe former Maricopa County Sheriff was convicted in 2017 for violating a 2011 court order to stop traffic patrols aimed at immigrants. He faced a maximum of six years in prison. Arpaio also once referred to his outdoor “tent city” jail as a “concentration camp.” A Department of Justice expert said at the time that Arpaio oversaw the worst pattern of racial profiling in U.S. history . \nRELATED VIDEO: PEOPLE Writer Natasha Stoynoff Breaks Silence, Accuses Donald Trump of Sexual Attack \nTrump, though, said Arpaio was a “patriot” and “protected our borders.” He also accused President Obama of treating the 85-year-old Arpaio unfairly. \n“Sheriff Joe was very unfairly treated by the Obama administration, especially right before an election that he would have won,” Trump said after the pardon . “And he was elected many times. So I stand by my pardon of Sheriff Joe. And I think the people of Arizona who really know him best would agree with me.” \nArizona, while a fiercely Republican state, could be an uphill battle for Arpaio. His last run for public office in 2016 fell short, resulting in him leaving the Maricopa County Sheriff’s office. You May Like Get your People daily dose Subscribe to the daily newsletter for the latest celebrity news. ", "external_links": [], "published": "2018-01-09T02:00:00.000+02:00", "crawled": "2018-01-10T03:01:31.059+02:00", "highlightTitle": ""}