{"organizations": [], "uuid": "9dcb294d79593d29b0e795096537d22944087529", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-postmedia-reports-first-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Postmedia Reports First Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.383, "site_type": "news", "published": "2018-01-11T18:45:00.000+02:00", "replies_count": 0, "uuid": "9dcb294d79593d29b0e795096537d22944087529"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-postmedia-reports-first-quarter-results.html", "ord_in_thread": 0, "title": "Postmedia Reports First Quarter Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "postmedia network canada corp.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO--(BUSINESS WIRE)-- Postmedia Network Canada Corp. (“Postmedia” or the “Company”) today released financial information for the three months ended November 30, 2017.\nFirst Quarter Operating Results\nRevenue for the quarter was $189.0 million as compared to $210.8 million in the same period in the prior year, a decrease of $21.8 million or 10.3%. The revenue decline was primarily due to decreases in print advertising revenue of $19.9 million or 17.9% and decreases in print circulation revenue of $3.8 million or 6.1%. Digital revenue increased by $4.0 million or 14.5% in the quarter with digital advertising revenue up 17.3%.\nTotal operating expenses excluding depreciation, amortization, impairment and restructuring decreased $26.0 million or 13.6% for the quarter, relative to the same period in the prior year. The decrease was primarily related to cost reduction initiatives.\nOperating income before depreciation, amortization, impairment and restructuring of $23.9 million in the quarter represents an increase of $4.2 million or 21.2% relative to the same period in the prior year. The increase is due to operating cost savings related to cost saving initiatives, partially offset by a decrease in total revenues.\nNet earnings in the quarter ended November 30, 2017 was $5.8 million, as compared to $17.8 million in the same period in the prior year. The change was primarily the result of a gain on debt settlement and impairments in the three months ended November 30, 2016 as well as a decrease in restructuring expense.\nDebt Repayment\nDuring the three months ended November 30, 2017, the Company redeemed $79.4 million aggregate principal amount of First-Lien Notes with the proceeds from various asset sales and its required annual repayment.\nBusiness Transformation Initiatives\nDuring the three months ended November 30, 2017, the Company implemented initiatives which are expected to result in approximately $14 million of net annualized cost savings.\nThe Company will continue to identify and undertake ongoing cost reduction initiatives in an effort to address revenue declination in the legacy print business.\nCommunity Newspaper Transaction\nOn November 27, 2017, the Company’s subsidiary, Postmedia Network Inc. entered into an asset purchase agreement with Metroland Media Group and Free Daily News Group Inc., both subsidiaries of Torstar Corporation, (collectively, “Torstar”) to acquire 22 of Torstar’s community newspaper properties and two free daily commuter newspapers and to sell 15 of its community newspapers and two free daily commuter newspapers to Torstar. The transaction was effectively a non-cash transaction as the properties had approximately similar fair values. During the three months ended November 30, 2017, the Company recognized a gain of $4.7 million on disposal of operations which represents the difference between the fair value of the assets acquired and the carrying value of the net liabilities sold, and in addition, incurred restructuring and acquisition expenses of $5.1 million related to the Torstar Transaction.\nManagement Commentary\n“We have a strategy and it is working,” said Paul Godfrey, Executive Chairman and Chief Executive Officer, Postmedia. “The strongest validation that our strategy is working is growth in digital advertising revenue – up for the fourth straight quarter by double-digit percentage increases. While this growth is very promising, digital revenue remains much smaller than our legacy print revenue and as such it needs time to grow. Therefore, we must remain vigilant in aligning our cost structure to the industry-wide declines in our legacy business in order to extend our runway to provide sufficient time to transform our business.”\nAdditional Information\nAdditional information, including financial statements and management’s discussion and analysis can be found on the Company’s website at www.postmedia.com/investors/financial-reports or on SEDAR at www.sedar.com .\nNote: All dollar amounts are expressed in Canadian dollars unless otherwise specified.\nAbout Postmedia Network Canada Corp.\nPostmedia Network Canada Corp. (TSX:PNC.A, PNC.B) is the holding company that owns Postmedia Network Inc., a Canadian newsmedia company representing more than 160 brands across multiple print, online, and mobile platforms. Award-winning journalists and innovative product development teams bring engaging content to millions of people every week whenever and wherever they want it. This exceptional content, reach and scope offers advertisers and marketers compelling solutions to effectively reach target audiences. For more information, visit www.postmedia.com .\nForward-Looking Information\nThis news release may include information that is “forward-looking information” under applicable Canadian securities laws. The Company has tried, where possible, to identify such information and statements by using words such as “believe,” “expect,” “intend,” “estimate,” “anticipate,” “may,” “will,” “could,” “would,” “should” and similar expressions and derivations thereof in connection with any discussion of future events, trends or prospects or future operating or financial performance. Forward-looking statements in this news release include statements with respect to the implementation and results of the Company’s transformation initiatives, the realization of anticipated cost savings and the identification and undertaking of ongoing cost savings initiatives. By their nature, forward-looking information and statements involve risks and uncertainties because they relate to events and depend on circumstances that may or may not occur in the future. These risks and uncertainties include, among others: competition from digital and other forms of media; the effect of economic conditions on advertising revenue; the ability of the Company to build out its digital media and online businesses; the failure to maintain current print and online newspaper readership and circulation levels; the realization of anticipated cost savings; possible damage to the reputation of the Company’s brands or trademarks; possible labour disruptions; possible environmental liabilities, litigation and pension plan obligations; fluctuations in foreign exchange rates and the prices of newsprint and other commodities. For a complete list of our risk factors please refer to the section entitled “Risk Factors” contained in our annual management’s discussion and analysis for the years ended August 31, 2017 and 2016. Although the Company bases such information and statements on assumptions believed to be reasonable when made, they are not guarantees of future performance and actual results of operations, financial condition and liquidity, and developments in the industry in which the Company operates, may differ materially from any such information and statements in this press release. Given these risks and uncertainties, undue reliance should not be placed on any forward-looking information or forward-looking statements, which speak only as of the date of such information or statements. Other than as required by law, the Company does not undertake, and specifically declines, any obligation to update such information or statements or to publicly announce the results of any revisions to any such information or statements.\nPostmedia Network Canada Corp.\nConsolidate", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sedar.com&esheet=51741858&newsitemid=20180111005708&lan=en-US&anchor=www.sedar.com&index=2&md5=fc2ddb1534ff6ffab2a0539457d1dcc6", "http://www.businesswire.com/news/home/20180111005708/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.postmedia.com%2Finvestors%2Ffinancial-reports&esheet=51741858&newsitemid=20180111005708&lan=en-US&anchor=www.postmedia.com%2Finvestors%2Ffinancial-reports&index=1&md5=765fd45e01f7357d55ab00e81292209b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.postmedia.com&esheet=51741858&newsitemid=20180111005708&lan=en-US&anchor=www.postmedia.com&index=3&md5=45ccd040d020b5b08e5c164684e01f69"], "published": "2018-01-11T18:45:00.000+02:00", "crawled": "2018-01-11T21:48:40.052+02:00", "highlightTitle": ""}