{"organizations": [], "uuid": "984fbacd24cbdbda450f003c7ab8dba89401d53c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-turkey-security/turkey-detains-42-people-over-syrian-operation-social-media-comments-agency-idUKKBN1FC0WB", "country": "US", "domain_rank": 408, "title": "Turkey detains 42 people over Syrian operation social media comments - agency", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T10:59:00.000+02:00", "replies_count": 0, "uuid": "984fbacd24cbdbda450f003c7ab8dba89401d53c"}, "author": "", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-turkey-security/turkey-detains-42-people-over-syrian-operation-social-media-comments-agency-idUKKBN1FC0WB", "ord_in_thread": 0, "title": "Turkey detains 42 people over Syrian operation social media comments - agency", "locations": [], "entities": {"persons": [{"name": "anadolu", "sentiment": "none"}, {"name": "denizli", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "manisa", "sentiment": "none"}, {"name": "istanbul", "sentiment": "none"}, {"name": "izmir", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "pkk", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "kurdistan workers party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "pro-kurdish peoples’ democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 9:04 AM / Updated 5 hours ago Turkey detains 91, including politicians, journalists, over Syria comments Daren Butler 4 Min Read \nISTANBUL (Reuters) - Turkey arrested dozens of people overnight for “spreading terrorist propaganda” about its Syrian incursion, state media said on Tuesday, raising to nearly 100 the number of such detainees, including politicians, journalists and activists. \nThe latest police raids focused on the western province of Izmir, but people have been detained across Turkey over their social media posts since Operation Olive Branch began in Syria’s Afrin region at the weekend, state-run Anadolu agency said. \nThe incursion targets the U.S.-backed Syrian Kurdish YPG, viewed by Ankara as a terrorist group and an extension of the Kurdistan Workers Party (PKK), which has fought an insurgency in Turkey’s largely Kurdish southeast since 1984. \nAmong those detained were the provincial heads in the cities of Izmir and Aydin of the pro-Kurdish Peoples’ Democratic Party (HDP), the second biggest opposition party in parliament. Ankara accuses the HDP of being linked to the PKK, a charge it denies. \nHDP spokesman Ayhan Bilgen named four journalists among those arrested in the investigation into social media postings. He said the probe was targeting “those who side with peace”. \n“Journalists are having their doors rammed down without anyone knocking and they are being detained as if there were an army or ammunition inside,” he told a news conference. \n“This shows how people are afraid of keyboards, pens, words and writing,” he said. \n“BLACK PROPAGANDA” FILE PHOTO: Turkish Prime Minister Binali Yildirim meets with Chief of the General Staff Hulusi Akar at the armed forces' headquarters in Ankara, Turkey January 20, 2018. Ali Balikci/Prime Minister's Press Office/Handout via REUTERS \nPrime Minister Binali Yildirim said social media posts criticising Turkey’s operation or portraying it as an attack on Kurds were “the biggest villainy”. \n“Social media does not mean irresponsible media, we started holding those accountable for the crimes being committed here. We will never allow those who try to smear the operation that serves peace,” Yildirim said at a conference in Ankara. \nAnadolu said 91 people had been detained so far in raids against “black propaganda” across 13 provinces, with 17 detained in southeast Turkey’s Diyarbakir province. Three of the detainees have been remanded in custody pending trial, it added. \nSix of the 23 suspects arrested in Izmir were accused of spreading propaganda on the streets, which amounted to “harassing people”, the agency said, adding that they were planning to hold a protest in a park. \nAmong the detainees was Leyla Guven, co-leader of the pro-Kurdish NGO Democratic Society Congress, said HDP lawmaker Bedia Ozgokce Ertan, adding that other HDP officials and senior members of the IHD human rights association were also held. \nAnkara has enforced a crackdown since a failed coup in 2016 that critics say has unjustly targeted pro-Kurdish politicians. Some HDP lawmakers have been jailed on terrorism charges, which they deny. \nIn total, more than 50,000 people have been jailed and face trial since the attempted putsch and 150,000 have been sacked or suspended from their jobs. The government says the moves were necessary given the security threats Turkey faces. \nOn Monday, authorities in the capital Ankara banned all rallies, protests, meetings and concerts in the city for as long as the Afrin operation in Syria continues. Additional reporting by Ali Kucukgocmen and Tuvan Gumrukcu; Writing by Daren Butler; Editing by Dominic Evans and Catherine Evans", "external_links": [], "published": "2018-01-23T10:59:00.000+02:00", "crawled": "2018-01-23T11:19:35.012+02:00", "highlightTitle": ""}