{"organizations": [], "uuid": "e3b3c0182eb0e5dd8634e04ec1c7c9ac52c96faf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-nanostring-appoints-thomas-bailey-as-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "NanoString Appoints Thomas Bailey as Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.107, "site_type": "news", "published": "2018-01-16T17:00:00.000+02:00", "replies_count": 0, "uuid": "e3b3c0182eb0e5dd8634e04ec1c7c9ac52c96faf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-nanostring-appoints-thomas-bailey-as-chief-financial-officer.html", "ord_in_thread": 0, "title": "NanoString Appoints Thomas Bailey as Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "thomas bailey", "sentiment": "negative"}, {"name": "bailey", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}], "organizations": [{"name": "nanostring technologies, inc.", "sentiment": "neutral"}, {"name": "angiotech pharmaceuticals", "sentiment": "none"}, {"name": "angiotech", "sentiment": "none"}, {"name": "agamatrix holdings llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE, Jan. 16, 2018 (GLOBE NEWSWIRE) -- NanoString Technologies, Inc. (NASDAQ:NSTG), a provider of life science tools for translational research and molecular diagnostic products, today announced that Thomas Bailey has been appointed chief financial officer, effective January 16, 2018.\nMr. Bailey brings to NanoString more than 20 years of experience in life sciences and health care organizations, as an executive and board director. Prior to joining NanoString, Mr. Bailey was with AgaMatrix Holdings LLC, a developer, manufacturer and marketer of medical technologies for diabetes care, where he was chief financial officer from 2014 to 2018. Before joining AgaMatrix, Mr. Bailey was an executive at Angiotech Pharmaceuticals, a developer, manufacturer and marketer of drug delivery and medical device technologies, where he served as chief financial officer from 2005 to 2011, and then as chief executive officer from 2011 to 2013. During his tenure at Angiotech, Mr. Bailey led the company through a period of rapid change, including operational changes that led to improved revenue growth and profitability, and multiple transactions that realized significant value for Angiotech’s shareholders and creditors.\nMr. Bailey began his career with over a decade of experience in investment banking and private equity, including at Credit Suisse First Boston and Donaldson, Lufkin & Jenrette, where he led the biotechnology practice, directed the successful execution of over 20 transactions, including a range of equity and debt financings, mergers and acquisitions, and advised companies in the private equity portfolio. Mr. Bailey received an A.B. in economics from Harvard University in 1990 and an M.B.A. from Harvard Business School in 1995.\n“NanoString has built a global business driven by a unique combination of research tools and a powerful diagnostic platform, as well as a pipeline of potentially transformative new products,” said Mr. Bailey. “I am excited to be joining the company at a time of major innovation and a new technology cycle that opens up significant new avenues of growth.”\n“I’m excited to have Tom join the team,” said president and chief executive officer, Brad Gray. “Tom’s experience in both operating and growing life sciences companies, as well as developing strategy and executing transactions, should prove invaluable as we expand our portfolio of platforms and scale our operations. He has an ideal profile for the next stage of growth at NanoString.”\nAbout NanoString Technologies, Inc.\nNanoString Technologies provides life science tools for translational research and molecular diagnostic products. The company's nCounter ® Analysis System has been employed in life sciences research since it was first introduced in 2008 and has been cited in more than 1,820 peer-reviewed publications. The nCounter Analysis System offers a cost-effective way to easily profile the expression of hundreds of genes, proteins, miRNAs, or copy number variations, simultaneously with high sensitivity and precision, facilitating a wide variety of basic research and translational medicine applications, including biomarker discovery and validation. The company's technology is also being used in diagnostics. The Prosigna ® Breast Cancer Prognostic Gene Signature Assay together with the nCounter Dx Analysis System is FDA 510(k) cleared for use as a prognostic indicator for distant recurrence of breast cancer. In addition, the company collaborates with biopharmaceutical companies in the development of companion diagnostic tests for various cancer therapies, helping to realize the promise of precision oncology.\nFor more information, please visit www.nanostring.com .\nNanoString, NanoString Technologies, the NanoString logo, nCounter and Prosigna are trademarks or registered trademarks of NanoString Technologies, Inc. in various jurisdictions.\nForward-Looking Statements\nThis news release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 and the Private Securities Litigation Reform Act of 1995. These forward-looking statements include statements regarding the potential of our pipeline of products and expectations for continuing growth in our business. Such statements are based on current assumptions that involve risks and uncertainties that could cause actual outcomes and results to differ materially. These risks and uncertainties, many of which are beyond our control, include market acceptance of our products; delays or denials of regulatory approvals or clearances for products or applications; delays or denials of reimbursement for diagnostic products; the impact of competition; delays or other unforeseen problems with respect to manufacturing, product development or clinical studies; adverse conditions in the general domestic and global economic markets; as well as the other risks set forth in our filings with the Securities and Exchange Commission. These forward-looking statements speak only as of the date hereof. NanoString Technologies disclaims any obligation to update these forward-looking statements.\nContact:\nDoug Farrell\nVice President, Investor Relations & Corporate Communications\ndfarrell@nanostring.com\nPhone: 206-602-1768\nSource:NanoString Technologies, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=mjDtjl6l_Zh4ao_wDm7VGzFbj3htJPrxbEJd-D3ROTdaXY5nmQb7IqjNb8biBF696eUj212JW9Ozgs1g4w0HxGtp9oY_3DRP9YPrQ5yIrbC1qX4POHqltbv5Gr25kg6zo5rSAObt85obssh12kYlmbjUF1lNkkbJlq-gkzF68Nv6BvHTryMjwzu4XEArF8P-a8UUtcOMhCwhy7hgbYy_I6qCF5YiNn9S1EjSps6hqvAeICu25_07RGpB5T8cNnAO", "https://www.globenewswire.com/NewsRoom/AttachmentNg/1f7c76cb-0f9e-47cc-bd8d-06ff234856fb", "https://www.globenewswire.com/Tracker?data=KHpbV5evJFjEIgkqG8SbBmpJwkKjGnrCoQkLJf7zNW4m1IFhVb1DIt0S6anOkliuaniwghzD4YSwvasgRP6YUjoK9W3D0Gi-T5BLlPghf9U="], "published": "2018-01-16T17:00:00.000+02:00", "crawled": "2018-01-16T18:21:32.003+02:00", "highlightTitle": ""}