{"organizations": [], "uuid": "ded6b9fea267a2f4432d95ff2c25980abd9cb3c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-canbridge-life-sciences-appoints-vice-president-of-regulatory-affairs-and-quality.html", "country": "US", "domain_rank": 767, "title": "CANbridge Life Sciences Appoints Vice President of Regulatory Affairs and Quality", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.983, "site_type": "news", "published": "2018-01-16T16:40:00.000+02:00", "replies_count": 0, "uuid": "ded6b9fea267a2f4432d95ff2c25980abd9cb3c0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-canbridge-life-sciences-appoints-vice-president-of-regulatory-affairs-and-quality.html", "ord_in_thread": 0, "title": "CANbridge Life Sciences Appoints Vice President of Regulatory Affairs and Quality", "locations": [], "entities": {"persons": [{"name": "sunny zhang", "sentiment": "none"}, {"name": "zhang", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "north asia", "sentiment": "none"}], "organizations": [{"name": "canbridge life sciences appoints vice president of regulatory affairs", "sentiment": "negative"}, {"name": "canbridge life sciences", "sentiment": "negative"}, {"name": "novartis oncology china", "sentiment": "none"}, {"name": "head of regulatory affairs", "sentiment": "none"}, {"name": "nda", "sentiment": "none"}, {"name": "novartis oncology", "sentiment": "none"}, {"name": "cfda", "sentiment": "none"}, {"name": "novartis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING, China, Jan. 16, 2018 /PRNewswire/ -- CANbridge Life Sciences, a biopharmaceutical company focused on developing Western drug candidates in China and North Asia, announced that Sunny Zhang joined the company as Vice President of Regulatory Affairs and Quality, on January 15, 2018. She will focus on the oncology and rare disease programs. The position is a new one, as CANbridge ramps up its leadership in anticipation of upcoming regulatory filings expected for several of its programs.\nMs. Zhang brings to the position considerable regulatory experience in China in oncology and rare diseases. Prior to joining CANbridge, she was the Head of Regulatory Affairs at Novartis Oncology China, where she focused on hematology, solid tumors, and rare diseases. Under her leadership, Novartis Oncology secured six New Drug Applications (NDA) from the China FDA (CFDA). Additionally, Ms. Zhang provided regulatory support for the maintenance and growth of 15 oncology products, and grew the team from 5-to-14 people. She was also a key contributor to the Novartis oncology pipeline development and regulatory strategy in China. From 2012-to-2017, Ms. Zhang served on the R&D-based Pharmaceutical Association Committee (RDPAC), a key Chinese pharmaceutical industry association, as Chair of the Orphan Drug Task Force, where she worked closely with the CFDA on regulation development for orphan drugs. In 2015 and 2017, Ms. Zhang was a speaker at China Rare Disease Summit.\nPrior to Novartis, Ms. Zhang was Associate Director of Regulatory Affairs at Genzyme China, where she headed the regulatory affairs group and focused on rare diseases. Before then, she worked in regulatory affairs at several companies, including Shanghai Roche and Sanofi China. Ms. Zhang started her career as a researcher in the Department of Pharmaceutical Analysis, National Institutes of Pharmaceutical Research & Development, SFDA. Ms. Zhang holds a MA in Clinical Pharmacology from Hebei Medical University in Shijiazhuang City, China, and a BS in Pharmaceutics from China Pharmaceutical University, in Nanjing, China. She is also a licensed pharmacist.\n\"Sunny brings to CANbridge considerable experience in guiding oncology and orphan drug candidates through the regulatory process in China,\" said James Xue, PhD, MBA, CANbridge Chairman, President and CEO. \"In many of these cases, she set an unprecedented example in the industry, which, combined with the close working ties she developed with the Chinese regulatory authorities as an expert and advocate on orphan drug and rare disease, makes her the ideal person to head the CANbridge regulatory team at this crucial and exciting juncture.\"\n\"I am very excited to join CANbridge, where my passion for cancer and rare disease patients in China aligns with those of CANbridge very well,\" said Sunny Zhang. \"The CANbridge drug development business strategy in China is in accord with the reform that China's health authorities are now pursuing to accelerate the accessibility of innovative drugs to Chinese patients, including those for rare disease patients.\"\nAbout CANbridge Life Sciences\nCANbridge Life Sciences, Ltd. is a clinical-staged bio-pharmaceutical company accelerating development and commercialization of specialty healthcare products for serious and critical medical conditions in China and North Asia (Korea and Taiwan). CANbridge develops partnerships with Western bio-pharmaceutical companies with clinical-stage pharmaceutical, medical device or diagnostic products that are either unavailable in China/North Asia or address medical needs that are underserved in the region. CANbridge also licenses, or obtains exclusive rights to commercialize, drug and device products that are approved in their home markets for commercialization in China and North Asia. CANbridge has a license with Apogenix to develop, manufacture and commercialize immune-oncology therapy, APG101, for the treatment of glioblastoma multiforme in China, Macao, Hong Kong and Taiwan, where it is being developed as CAN008, and a world-wide license (ex-North America) with AVEO Oncology to develop, manufacture and commercialize clinical-stage ErbB3 (HER3) inhibitory antibody candidate AV203, renamed by CANbridge as CAN017. CANbridge also has an agreement with EUSA Pharma to commercialize Caphosol® in China for the prevention and treatment of oral mucositis caused by cancer treatments.\nLed and backed by a highly-seasoned executive team, with extensive Chinese drug development experience, CANbridge has the capability to select, acquire, develop and commercialize future therapeutics and diagnostics targeting the unmet medical needs of Chinese and East Asian patients with serious or critical conditions.\nCANbridge is privately-held and headquartered in Beijing, China. For more on CANbridge Life Sciences, please go to www.canbridgepharma.com .\nContact:\nCANbridge Life Sciences\nJames Xue\nCEO\n+8610.8414.8018\n781.995.0074\nMedia\nDeanne Eagle\nPlanet Communications\n188784@email4pr.com\n917.837.5866\nView original content with multimedia: http://www.prnewswire.com/news-releases/canbridge-life-sciences-appoints-vice-president-of-regulatory-affairs-and-quality-300582968.html\nSOURCE CANbridge Life Sciences", "external_links": ["http://www.canbridgepharma.com/", "http://www.prnewswire.com/news-releases/canbridge-life-sciences-appoints-vice-president-of-regulatory-affairs-and-quality-300582968.html"], "published": "2018-01-16T16:40:00.000+02:00", "crawled": "2018-01-16T19:39:07.015+02:00", "highlightTitle": ""}