{"organizations": [], "uuid": "97272662a5aeec61c39c62defbc5698fd0d21c6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221636120&w=1200&r=LYNXMPEE0C031", "site_section": "http://feeds.reuters.com/reuters/INformulaOne", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/tennis-ausopen-wawrinka/tennis-stan-wawrinka-feared-for-career-during-long-layoff-idINKBN1F204M", "country": "US", "domain_rank": 408, "title": "Tennis: Stan Wawrinka feared for career during long layoff", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T07:05:00.000+02:00", "replies_count": 0, "uuid": "97272662a5aeec61c39c62defbc5698fd0d21c6e"}, "author": "", "url": "https://in.reuters.com/article/tennis-ausopen-wawrinka/tennis-stan-wawrinka-feared-for-career-during-long-layoff-idINKBN1F204M", "ord_in_thread": 0, "title": "Tennis: Stan Wawrinka feared for career during long layoff", "locations": [], "entities": {"persons": [{"name": "stan wawrinka", "sentiment": "negative"}, {"name": "ian ransom", "sentiment": "none"}, {"name": "magnus norman", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 5:08 AM / Updated 11 hours ago Tennis: Stan Wawrinka feared for career during long layoff Ian Ransom 3 Min Read \nMELBOURNE (Reuters) - Stan Wawrinka feared his debilitating knee injury might be the end of a glittering tennis career boasting three grand slam titles and said he had only been cleared to play the Australian Open two days before the tournament. Tennis - Australian Open - Melbourne, Australia, January 13, 2018. Stan Wawrinka of Switzerland reacts during a news conference before the Australian Open tennis tournament. REUTERS/Thomas Peter \nThe 32-year-old Swiss also spoke on Saturday of his former coach Magnus Norman’s decision to end their partnership while he was injured, another sting in the tail during his battle through rehab. \nThe 2014 champion will bid for his second title at Melbourne Park but goes in with low expectations, having only decided he was fit enough to play after training on Saturday. \nWhile not taking pain-killing injections, he said the knee was still painful and admitted he was far from his best level of tennis ahead of his first round match against unseeded Lithuanian Ricardas Berankis on Tuesday. \nHowever, being cleared to play still felt like a “victory”, said Wawrinka, given personal doubts about his future following his knee surgery. \n“For sure I was worrying a lot because I had eight weeks on crutches,” Wawrinka told reporters at Melbourne Park. \n”I started my first fitness by just walking. The thing is, it’s always complicated when you’re like at that level before, you get (an) injury, you can get through pain mentally also, (you‘re) feeling lonely, not feeling good. \n”It’s tough to explain because some people will always \nthink, ‘C‘mon, you have an amazing life, why do you \ncomplain, why do you complain about feeling not great?'” Tennis - Australian Open - Melbourne, Australia, January 13, 2018. Stan Wawrinka of Switzerland reacts during a news conference ahead of the Australian Open tennis tournament. REUTERS/Thomas Peter \nHis former mentor Norman, who helped transform Wawrinka into a grand slam-winning force, ended their four-year partnership in October, citing personal reasons in another major blow. \n“For sure, it was already a tough, tough, tough moment for myself, to be out, to get surgery, to know that it will take at least six months to be back at a place where I can play tennis again,” said Wawrinka, who has not played a competitive match since being knocked out of the first round at Wimbledon. \n”When you are in a tough place like that as an athlete, you want the people who know you the best to stay around you, to stick with you. Tennis - Australian Open - Melbourne, Australia, January 13, 2018. Stan Wawrinka of Switzerland reacts during a news conference before the Australian Open tennis tournament. REUTERS/Thomas Peter \n”You want your team, your family to be here. \n“For me, Magnus, he was my coach, but he was a friend, even closer than a friend. It was tough to know that he will not be here to start again with me. I was more sad than angry at him.” \nWawrinka, seeded ninth in Melbourne, said he had practised for more hours in the week leading into the grand slam than he had in months but still needed to be “careful” about his knee. \n“I practised with Rafa (Nadal), I practised with Novak (Djokovic), with (Tomas) Berdych, with (Gael) Monfils, with (Grigor) Dimitrov,” he said. \n”I didn’t win many sets, but that’s not the most important. \n”There’s always a little risk, for sure, especially starting after six months in a match, you (are) going to get more tight, to get nervous, you’re not going to feel as comfortable in match as in practice. \n“But the knee is staying there, so that’s the most important.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-13T07:05:00.000+02:00", "crawled": "2018-01-13T07:33:48.001+02:00", "highlightTitle": ""}