{"organizations": [], "uuid": "30deadaf9e58c803dff0f65e9eac2d29c287cc75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-gtcr-announces-acquisition-of-eaglepicher-technologies.html", "country": "US", "domain_rank": 767, "title": "GTCR Announces Acquisition of EaglePicher Technologies", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.804, "site_type": "news", "published": "2018-01-24T01:12:00.000+02:00", "replies_count": 0, "uuid": "30deadaf9e58c803dff0f65e9eac2d29c287cc75"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-gtcr-announces-acquisition-of-eaglepicher-technologies.html", "ord_in_thread": 0, "title": "GTCR Announces Acquisition of EaglePicher Technologies", "locations": [], "entities": {"persons": [{"name": "gordon walker", "sentiment": "none"}], "locations": [{"name": "missouri", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}], "organizations": [{"name": "gtcr announces acquisition of eaglepicher technologies chicago", "sentiment": "negative"}, {"name": "gtcr", "sentiment": "negative"}, {"name": "eaglepicher", "sentiment": "none"}, {"name": "eaglepicher technologies", "sentiment": "none"}, {"name": "vectra corporation", "sentiment": "none"}, {"name": "apollo global management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 23, 2018 /PRNewswire/ -- GTCR, a leading private equity firm, announced today that it has signed a definitive agreement to acquire EaglePicher Technologies, LLC (\"EaglePicher\" or the \"Company\") from certain funds affiliated with affiliates of Apollo Global Management, LLC. EaglePicher is a premier provider of mission-critical power solutions for customers in the defense, aerospace and medical end markets.\nGTCR will partner with CEO Gordon Walker and the current management team to separate EaglePicher from the other subsidiaries of its parent company, Vectra Corporation, and create a standalone business that will allow management to focus on driving continued growth and operational improvement initiatives.\nFounded in 1843 and headquartered in St. Louis, Missouri, EaglePicher develops specialized batteries and advanced power management systems for a diverse range of defense, aerospace and medical applications. The Company has entrenched sole-supplier relationships with many of its customers in support of high priority programs. EaglePicher has approximately 800 full-time employees and a robust portfolio of over 100 United States patents.\n\"EaglePicher has a storied legacy and is a recognized leader in providing high performance energy solutions to its demanding end markets,\" said GTCR Managing Director Craig Bondy. \"Gordon and his team have done an extraordinary job driving strong operational performance while continuing to extend the Company's reach into new applications. We are excited to be partnering with the Company to support its next phase of growth.\"\n\"The management team at EaglePicher is tremendously excited to partner with GTCR,\" said Gordon Walker. \"We have an exceptional opportunity to accelerate growth and make investments in technology and products to provide leading energy solutions for our customers. GTCR's reputation and track record for investing in and growing businesses built on technology is impressive. This makes them an ideal partner for EaglePicher and I am very excited to collaborate with them on this opportunity.\"\n\"The combination of EaglePicher's best-in-class product portfolio and reputation for reliability makes this an exciting platform investment,\" added Neil Willis, Vice President at GTCR. \"We look forward to leveraging our experience in government services and healthcare to help expand the Company's capabilities and accelerate growth.\"\nThe transaction is expected to close during the first quarter of 2018.\nPricewaterhouseCoopers served as accounting advisor and Kirkland & Ellis LLP provided legal counsel to GTCR.\nAbout GTCR\nFounded in 1980, GTCR is a leading private equity firm focused on investing in growth companies in the Growth Business Services, Technology, Media & Telecommunications, Healthcare and Financial Services & Technology industries. The Chicago-based firm pioneered The Leaders Strategy™ – finding and partnering with management leaders in core domains to identify, acquire and build market–leading companies through transformational acquisitions and organic growth. Since its inception, GTCR has invested more than $15 billion in over 200 companies. For more information, please visit www.gtcr.com .\nAbout EaglePicher\nEaglePicher Technologies, LLC is a leading provider of mission–critical power solutions. The Company has been serving the highly demanding defense, aerospace, and medical battery markets for over 75 years. EaglePicher's battery systems are a key enabler of the U.S. space program, including providing the emergency power that successfully brought the Apollo 13 crew home. EaglePicher powers a multitude of key U.S. Department of Defense platforms for missile defense, portable power and directed energy, among many others, in addition to a large number of aerospace programs and a variety of implantable medical devices. For more information, please visit www.eaglepicher.com .\nMedia Inquiries\nEileen Rochford\n+1 (312) 953-3305\neileenr@theharbingergroup.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/gtcr-announces-acquisition-of-eaglepicher-technologies-300587054.html\nSOURCE GTCR", "external_links": ["http://www.prnewswire.com/news-releases/gtcr-announces-acquisition-of-eaglepicher-technologies-300587054.html"], "published": "2018-01-24T01:12:00.000+02:00", "crawled": "2018-01-24T01:23:12.001+02:00", "highlightTitle": ""}