{"organizations": [], "uuid": "4d571df0f02f76af994bb1f4af0e06549a64b87c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-isoray-announces-preliminary-second-quarter-f2018-revenue-of-1-point-54-million-50-percent-year-over-year-increase.html", "country": "US", "domain_rank": 767, "title": "IsoRay Announces Preliminary Second Quarter F2018 Revenue of $1.54 Million, 50% Year-over-Year Increase", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.207, "site_type": "news", "published": "2018-01-24T16:00:00.000+02:00", "replies_count": 0, "uuid": "4d571df0f02f76af994bb1f4af0e06549a64b87c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-isoray-announces-preliminary-second-quarter-f2018-revenue-of-1-point-54-million-50-percent-year-over-year-increase.html", "ord_in_thread": 0, "title": "IsoRay Announces Preliminary Second Quarter F2018 Revenue of $1.54 Million, 50% Year-over-Year Increase", "locations": [], "entities": {"persons": [], "locations": [{"name": "richland", "sentiment": "none"}], "organizations": [{"name": "inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RICHLAND, Wash, Jan. 24, 2018 (GLOBE NEWSWIRE) -- -- IsoRay, Inc. (NYSE American: ISR), a medical technology company and innovator in seed brachytherapy and medical radioisotope applications for the treatment of prostate, brain, lung, head and neck and gynecological cancers, today announced preliminary unaudited revenue and gross profit results for the second quarter of fiscal 2018 ended December 31, 2017.\nPreliminary revenue and gross profit for the second quarter of fiscal 2018:\nPreliminary revenue for the three months ended December 31, 2017, was $1.54 million compared to $1.03 million for the same period last year and $1.21 million in the first quarter of fiscal 2018. This represents increases of 50% year-over-year and 27% from the previous quarter. Preliminary gross profit for the three months ended December 31, 2017 was $0.53 million compared to a loss of $0.01 million in the prior year period and $0.27 million in the first quarter of fiscal 2018. Gross profit margin was 35% in the current period, negative in the second quarter of fiscal 2017 and 22% in the first quarter of fiscal 2018. Prostate brachytherapy represented 86% of total revenue for the second quarter of fiscal 2018 compared to 86% in the second quarter of fiscal 2017.\nPreliminary revenue and gross profit for the first six-month period of fiscal 2018 ended December 31, 2017:\nPreliminary revenue for the six months ended December 31, 2017, was $2.75 million, compared to $2.11 million for the first six months of fiscal 2017, an increase of 30% year-over-year. Preliminary gross profit of $0.80 million compared to $0.05 million in the prior year quarter ended December 31, 2016, a 16-fold increase. Prostate brachytherapy represented 87% of total revenue for the first half of fiscal 2018 compared to 88% in the first half of fiscal 2017.\n“IsoRay had a great second quarter, with revenue increasing 50% from the same period last year. This is the fourth consecutive quarter of year-over-year revenue increases, and is indicative of the increasing traction of our new sales strategies in the prostate brachytherapy market,” said Tom LaVoy, Chairman and CEO of IsoRay. “Our sales message, delivered by our highly experienced sales team, is resonating with an increasing number of practioners. These messages are further supported by the growing number of peer-reviewed published studies that demonstrate the unique qualities and resulting high effectiveness of Cesium-131. Gross profit improvement was driven by the revenue increase and our continuing focus on cost reductions and manufacturing and process improvements. We remain comfortable with the guidance we issued last quarter projecting that revenue would grow by not less than 20% in fiscal 2018, and reach approximately $5.8 million for the full year. We look forward to discussing full details of the second quarter results on our earnings conference call in mid-February.”\nUnaudited interim financial information will be released with the filing of IsoRay's Quarterly Report on Form 10-Q, which will be filed with the U.S. Securities and Exchange Commission before the Company's mid-February 2018 deadline.\nAbout IsoRay, Inc.\nIsoRay, Inc., through its subsidiary, IsoRay Medical, Inc., is the sole producer of Cesium-131 brachytherapy seeds, which are expanding brachytherapy options throughout the body. Learn more about this innovative Richland, Washington company and explore the many benefits and uses of Cesium-131 by visiting www.isoray.com . Join us on Facebook/IsoRay. Follow us on Twitter@IsoRay.\nSafe Harbor Statement\nStatements in this news release about IsoRay's future expectations, including: our preliminary financial results for the second quarter of fiscal 2018, the positive industry data fueling renewed interest in brachytherapy, strong patient results, whether interest in and use of our products will increase or continue, whether revenue will increase or will reach approximately $5.8 million in fiscal 2018 and costs decrease in the upcoming quarters, the perception by patients of quality of life outcomes, and all other statements in this release, other than historical facts, are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 (\"PSLRA\"). This statement is included for the express purpose of availing IsoRay, Inc. of the protections of the safe harbor provisions of the PSLRA. It is important to note that actual results and ultimate corporate actions could differ materially from those in such forward-looking statements based on such factors as an audit of our financial results which may change our preliminary numbers, physician acceptance, training and use of our products, our ability to successfully manufacture, market and sell our products, our ability to manufacture our products in sufficient quantities to meet demand within required delivery time periods while meeting our quality control standards, our ability to enforce our intellectual property rights, whether additional studies are released and support the conclusions of past studies, whether ongoing patient quality of life results with our products are favorable and in line with the conclusions of clinical studies and initial patient results, patient results achieved when our products are used for the treatment of cancers and malignant diseases whether or not used in conjunction with other treatments, successful completion of future research and development activities, whether we, our distributors and our customers will successfully obtain and maintain all required regulatory approvals and licenses to market, sell and use our products in its various forms, continued compliance with ISO standards as audited by BSI, the success of our sales and marketing efforts, the procedures and regulatory requirements mandated by the FDA for 510(k) approval, changes in laws and regulations applicable to our products, the scheduling of physicians who either delay or do not schedule patients in the periods anticipated, the use of competitors' products, less favorable reimbursement rates, and other risks detailed from time to time in IsoRay's reports filed with the SEC. Unless required to do so by law, we undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nContacts: IsoRay Inc. info@isoray.com (509) 375-1202 Investors: Stephanie Prince, Managing Director PCG Advisory Group sprince@pcgadvisory.com (646) 762-4518\nSource:Isoray, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/6aa47a54-0d7f-4029-8866-72bcd5714e0d"], "published": "2018-01-24T16:00:00.000+02:00", "crawled": "2018-01-24T19:12:48.012+02:00", "highlightTitle": ""}