{"organizations": [], "uuid": "2142863df8effe841b3dedf1e93e57ca892917b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-thursday/tennis-sharapova-gets-patience-test-with-melbourne-set-to-sizzle-idUKL3N1PC37P", "country": "US", "domain_rank": 408, "title": "Tennis-Sharapova gets patience test with Melbourne set to sizzle", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:00:00.000+02:00", "replies_count": 0, "uuid": "2142863df8effe841b3dedf1e93e57ca892917b4"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-thursday/tennis-sharapova-gets-patience-test-with-melbourne-set-to-sizzle-idUKL3N1PC37P", "ord_in_thread": 0, "title": "Tennis-Sharapova gets patience test with Melbourne set to sizzle", "locations": [], "entities": {"persons": [{"name": "tennis-sharapova", "sentiment": "negative"}, {"name": "melbour", "sentiment": "negative"}, {"name": "maria sharapova", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "anastasija sevastova", "sentiment": "none"}, {"name": "sharapova", "sentiment": "none"}], "locations": [{"name": "tennis-sharapova", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "sevastova", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 2:03 PM / Updated 16 minutes ago Tennis-Sharapova gets patience test with Melbourne set to sizzle Reuters Staff 3 Min Read \nMELBOURNE, Jan 18 (Reuters) - Maria Sharapova returns to Rod Laver Arena for the first time since her drug ban for a second round match against Anastasija Sevastova on Thursday as players, officials and fans alike prepare for sweltering heat at the Australian Open. \nThe former world number one, who missed last year’s tournament because of her ban for the use of a banned substance, takes on the Latvian 14th seed in the first match on the main showcourt so should escape the worst of the heat. \nTemperatures are forecast to reach 40 degrees Celsius on Thursday and Friday but it is those on the more exposed outer courts who usually suffer most during the annual scorcher at Melbourne Park. \nSharapova lost a fourth round match in three sets to Sevastova on her return to grand slam tennis at the U.S. Open last year but got a measure of revenge in another tight clash at the China Open. \nAustralian Open champion a decade ago, Sharapova said she would not be looking to race through their third match in five months. \n“It’s not an easy match, not an easy match for anyone, especially for an aggressive player like I am,” she said. \n“You know, she’s an opponent that tests my patience, and I‘m willing to be there and out there for as long as it takes.” \nAnother former champion, Novak Djokovic, is also likely to have his patience tested in his second match on the same court later in the day with mercurial Frenchman Gael Monfils having made something of a speciality of producing the unexpected. \nAlthough six-times Melbourne champion Djokovic has won all 14 of their meetings at the elite level, his near contemporary is sure to fully test the fitness of the elbow that kept the Serbian on the sidelines for the second half of last year. \nThe meeting between Simona Halep and Eugenie Bouchard might bring a little frost to a hot day as the top seed and world number one said last year she did not talk to the Canadian, who beat her in the 2014 Wimbledon semi-finals. \nHalep, who turned her ankle in her opening victory over local Destanee Aiava on Tuesday, will face Bouchard in the evening on Margaret Court Arena before Stan Wawrinka continues his comeback against Tennys Sandgren. \nWawrinka’s fellow Swiss Roger Federer resumes his title defence against German Jan-Lennard Struff with top five seeds Alexander Zverev and Dominic Thiem also in action on day four. \nTop seed Rafa Nadal, who will play his third round match against Bosnian 28th seed Damir Dzumhur on another scorcher on Friday, urged organisers close the roofs of the showcourts if the heat became extreme, to preserve players and fans. \n“I think it’s a health issue ... When it’s too much, (it) becomes dangerous for the health,” he said. \n“I would not like to see here retirements. Conditions that create a bad show for the crowd. The crowd is suffering, too, there.” \nOrder of Play: (Reporting by Nick Mulvenney in Sydney, editing by Amlan Chakraborty)", "external_links": [], "published": "2018-01-17T16:00:00.000+02:00", "crawled": "2018-01-17T16:22:12.021+02:00", "highlightTitle": ""}