{"organizations": [], "uuid": "0b8fc0b4093c2d0bee9449c97923024fa3d75875", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-midland-states-bancorp-inc-announces-2017-fourth-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Midland States Bancorp, Inc. Announces 2017 Fourth Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:05:00.000+02:00", "replies_count": 0, "uuid": "0b8fc0b4093c2d0bee9449c97923024fa3d75875"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-midland-states-bancorp-inc-announces-2017-fourth-quarter-results.html", "ord_in_thread": 0, "title": "Midland States Bancorp, Inc. Announces 2017 Fourth Quarter Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "effingham", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "midland states bancorp, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "acquisition of alpine bancorporation", "sentiment": "none"}, {"name": "midland states bancorp, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Highlights\n• Net income of $2.0 million, or $0.10 diluted earnings per share, included the following significant items\n$0.23 per diluted share in tax expense due to the revaluation of deferred tax assets\n$0.08 per diluted share of integration and acquisition expenses\n• Two charge-offs drive $4.6 million increase in provision for loan losses compared to prior quarter, impacting EPS by $0.14 per diluted share\n• Total loans increase at 9% annualized rate\n• Efficiency ratio improves to 64.6% from 69.0% in third quarter 2017\n• Acquisition of Alpine Bancorporation expected to close by the end of February 2018\nEFFINGHAM, Ill., Midland States Bancorp, Inc. (NASDAQ:MSBI) (the “Company”) today reported financial results for the fourth quarter of 2017, which included $2.7 million, or $0.08 per diluted share, in integration and acquisition expenses, and $4.5 million, or $0.23 per diluted share, in tax expense related to the revaluation of the Company’s net deferred tax assets as a result of the decrease in the federal corporate tax rate. Inclusive of these expenses, Midland reported net income of $2.0 million, or $0.10 diluted earnings per share, for the fourth quarter of 2017. This compares to net income of $2.0 million, or $0.10 diluted earnings per share, for the third quarter of 2017, and net income of $11.6 million, or $0.72 diluted earnings per share, for the fourth quarter of 2016.\n“While our fourth quarter results were negatively impacted by the revaluation of our deferred tax assets, our level of profitability will benefit from a lower effective tax rate going forward,” said Leon J. Holschbach, President and Chief Executive Officer of the Company. “During the fourth quarter, we saw an improvement in balance sheet growth driven by strong loan production across our portfolio and solid inflows of core deposits. We had 9% annualized loan growth in the quarter with strong increases coming in our commercial, construction and consumer loan portfolios. As we continue to realize the synergies from the Centrue acquisition, we are also seeing an improvement in our efficiency ratio.\n“In 2018, we will be focused on integrating our acquisition of Alpine Bancorporation, capturing the synergies we project from this transaction, and expanding our core community banking and wealth management businesses. With the higher earnings resulting from the lowering of our effective tax rate, we intend to strengthen our capital base following the Alpine acquisition, as well as continue to deliver strong dividend growth to our shareholders. Over the past 15 years, we have increased our dividend at an annual rate of more than 10%. With the greater earnings power we are projecting following the Alpine acquisition and the lower effective tax rate, we believe we will maintain our strong track record of returning capital to our shareholders.”\nAdjusted Earnings\nFinancial results for the fourth quarter of 2017 included $4.5 million of additional tax expense related to the revaluation of the Company’s net deferred tax assets, $2.7 million in integration and acquisition-related expenses, and $0.4 million in loss on mortgage servicing rights (“MSRs”) held-for-sale. Financial results for the third quarter of 2017 included $8.3 million in integration and acquisition-related expenses and $3.6 million in loss on MSRs held-for-sale.\nExcluding these expenses, adjusted earnings were $8.4 million, or $0.42 diluted earnings per share, for the fourth quarter of 2017, compared with adjusted earnings of $9.2 million, or $0.46 diluted earnings per share, for the third quarter of 2017. The decline in adjusted earnings per share is primarily attributable to an increase in the provision for loan losses. Adjusted pre-tax pre-provision earnings were $16.9 million for the fourth quarter of 2017, compared with $15.6 million for the third quarter of 2017. A reconciliation of adjusted earnings and adjusted pre-tax pre-provision earnings to net income according to generally accepted accounting principles (“GAAP”) is provided in the financial tables at the end of this press release.\nNet Interest Income\nNet interest income for the fourth quarter of 2017 was $36.0 million, a decrease of 2.0% from $36.8 million for the third quarter of 2017. The decrease in net interest income was primarily attributable to a decline in net interest margin.\nThe Company’s net interest income benefits from accretion income associated with purchased loan portfolios. Accretion income totaled $2.7 million for the fourth quarter of 2017, compared with $3.0 million for the third quarter of 2017.\nRelative to the fourth quarter of 2016, net interest income increased $10.1 million, or 38.8%. Accretion income for the fourth quarter of 2016 was $2.2 million. The increase in net interest income resulted from a $12.5 million increase in interest income on loans due primarily to growth in the average balance of loans. This increase was offset in part by a $3.4 million increase in interest expense primarily due to interest-bearing deposits from Centrue combined with increased usage of FHLB advances and subordinated debt.\nNet Interest Margin\nNet interest margin for the fourth quarter of 2017 was 3.73%, compared to 3.78% for the third quarter of 2017. The Company’s net interest margin benefits from accretion income on purchased loan portfolios, which contributed 26 and 27 basis points to net interest margin in the fourth and third quarters of 2017, respectively. Excluding the impact of accretion income, the decrease in net interest margin was attributable to the addition of $40 million of subordinated debt issued in preparation for the acquisition of Alpine Bancorporation.\nRelative to the fourth quarter of 2016, the net interest margin increased from 3.70%. Accretion income on purchased loan portfolios contributed 28 basis points to net interest margin in the fourth quarter of 2016. Excluding the impact of accretion income, the increase in net interest margin was primarily driven by higher average loans yields.\nNoninterest Income\nNoninterest income for the fourth quarter of 2017 was $14.0 million, a decrease of 9.1% from $15.4 million for the third quarter of 2017. This decrease was primarily attributable to lower commercial FHA and residential mortgage banking revenue.\nWealth management revenue for the fourth quarter of 2017 was $3.6 million, an increase of 3.2% from $3.5 million in the third quarter of 2017. Compared to the fourth quarter of 2016, wealth management revenue increased 43.8%, which was attributable to 12% organic growth in assets under management and the acquisition of CedarPoint Investment Advisors in March 2017.\nCommercial FHA revenue for the fourth quarter of 2017 was $3.1 million, a decrease of 17.2% from $3.8 million in the third quarter of 2017. The Company originated $98.5 million in rate lock commitments during the fourth quarter of 2017, compared to $112.5 million in the prior quarter. Compared to the fourth quarter of 2016, commercial FHA revenue decreased 15.6%.\nResidential mortgage banking revenue for the fourth quarter of 2017 was $1.6 million, a decrease of 32.8% from $2.3 million in the third quarter of 2017. Compared to the fourth quarter of 2016, residential mortgage banking revenue decreased 75.1%, primarily due to the recapture of previously recorded mortgage servicing rights impairment totaling $3.6 million during the fourth quarter of 2016.\nRelative to the fourth quarter of 2016, noninterest income decreased 54.1% from $30.5 million. During the fourth quarter of 2016, the Company recognized a gain of $14.4 million related to the sale of collateralized mortgage obligations (“CMOs”).\nNoninterest Expense\nNoninterest expense for the fourth quarter of 2017 was $36.2 million, compared with $48.4 million for the third quarter of 2017. Noninterest expense for the fourth and third quarters of 2017 included $2.7 million and $8.3 million in integration and acquisition-related expenses, respectively, and $0.4 million and $3.6 million losses on MSRs held-for-sale, respectively. Excluding these expenses, noninterest expense decreased $3.4 million, or 9.3%, from the prior quarter. The decrease was attributable to a decline in salaries and employee benefits expense due to a 5.7% decrease in FTEs resulting from the continued integration of Centrue, as well as reduced variable compensation in the commercial FHA and residential mortgage businesses.\nRelative to the fourth quarter of 2016, noninterest expense excluding integration and acquisition-related expenses, branch network optimization plan charges, loss share agreement termination expenses, and the loss on mortgage servicing rights held-for-sale increased 8.6% from $30.4 million. The increase was primarily due to personnel and facilities added in the two acquisitions completed over the past year, partially offset by cost savings resulting from the Company’s Operational Excellence initiative.\nIncome Tax Expense\nIncome tax expense was $5.8 million for the fourth quarter of 2017, compared to $0.3 million for the third quarter of 2017.\nOn December 22, 2017, “H.R.1”, formerly known as the “Tax Cuts and Jobs Act”, was signed into law. Among other items, H.R.1 reduces the federal corporate tax rate to 21% effective January 1, 2018. As a result, Midland concluded that the reduction in the federal corporate tax rate required the revaluation of the Company’s net deferred tax assets. The Company’s net deferred tax assets represents net operating loss carryforwards that will be used to reduce corporate taxes expected to be paid in the future as well as differences between the carrying amounts and tax bases of assets and liabilities carried on the Company’s balance sheet. The Company performed an analysis and determined that the value of the deferred tax assets had declined by $4.5 million. To reflect the decline in the value of the deferred tax assets, the Company recorded additional tax expense of $4.5 million during the fourth quarter of 2017.\nFor 2018, the Company expects its effective tax rate to be approximately 23%.\nLoan Portfolio\nTotal loans outstanding were $3.23 billion at December 31, 2017, compared with $3.16 billion at September 30, 2017 and $2.32 billion at December 31, 2016. The increase in total loans from September 30, 2017 was primarily attributable to increases in the commercial, construction and consumer loan portfolios. The increase in total loans from December 31, 2016, was due to 9.8% organic growth and the addition of $679.9 million of loans from Centrue.\nDeposits\nTotal deposits were $3.13 billion at December 31, 2017, compared with $3.11 billion at September 30, 2017, and $2.40 billion at December 31, 2016. The increase in total deposits from September 30, 2017 was primarily attributable to growth throughout the commercial, retail and servicing portfolios, which was partially offset by the continued reduction of brokered deposits.\nAsset Quality\nNon-performing loans totaled $26.8 million, or 0.83% of total loans, at December 31, 2017, compared with $33.4 million, or 1.06% of total loans, at September 30, 2017, and $31.6 million, or 1.36% of total loans, at December 31, 2016. The decrease in non-performing loans during the fourth quarter of 2017 was primarily driven by charge-offs.\nNet charge-offs for the fourth quarter of 2017 were $6.5 million, or 0.81% of average loans on an annualized basis. The net charge-offs were primarily related to two commercial real estate loans.\nThe Company recorded a provision for loan losses of $6.1 million for the fourth quarter of 2017, which was driven by the growth in total loans outstanding and the net charge-offs taken in the quarter. The Company’s allowance for loan losses was 0.51% of total loans and 61.4% of non-performing loans at December 31, 2017, compared with 0.53% of total loans and 50.4% of non-performing loans at September 30, 2017. Fair market value discounts recorded in connection with acquired loan portfolios represented 0.51% of total loans at December 31, 2017, compared with 0.45% at September 30, 2017.\nCapital\nAt December 31, 2017, the Company exceeded all regulatory capital requirements under Basel III and was considered to be a ‘‘well-capitalized’’ financial institution, as summarized in the following table:\nDecember 31, 2017 Well Capitalized\nRegulatory Requirements Total capital to risk-weighted assets 13.26% 10.00% Tier 1 capital to risk-weighted assets 10.19% 8.00% Tier 1 leverage ratio 8.63% 5.00% Common equity Tier 1 capital 8.45% 6.50% Tangible common equity to tangible assets 7.70% NA Conference Call, Webcast and Slide Presentation\nThe Company will host a conference call and webcast at 7:30 a.m. Central Time on Friday, January 26, 2018 to discuss its financial results. The call can be accessed via telephone at (877) 516-3531 (passcode: 5699319). A recorded replay can be accessed through February 2, 2018 by dialing (855) 859-2056; passcode: 5699319.\nA slide presentation relating to the fourth quarter 2017 results will be accessible prior to the scheduled conference call. The slide presentation and webcast of the conference call can be accessed on the Webcasts and Presentations page of the Company’s investor relations website.\nAbout Midland States Bancorp, Inc.\nMidland States Bancorp, Inc. is a community-based financial holding company headquartered in Effingham, Illinois, and is the sole shareholder of Midland States Bank. As of December 31, 2017, the Company had total assets of $4.4 billion and its Wealth Management Group had assets under administration of approximately $2.1 billion. Midland provides a full range of commercial and consumer banking products and services, merchant credit card services, trust and investment management, and insurance and financial planning services. In addition, commercial equipment financing is provided through Midland Equipment Finance, and multi-family and healthcare facility FHA financing is provided through Love Funding. For additional information, visit www.midlandsb.com or follow Midland on LinkedIn at https://www.linkedin.com/company/midland-states-bank .\nNon-GAAP Financial Measures\nSome of the financial measures included in this press release are not measures of financial performance recognized in accordance with accounting principles generally accepted in the United States (“GAAP”). These non-GAAP financial measures include “Adjusted Earnings,” “Adjusted Diluted Earnings Per Share,” “Adjusted Return on Average Assets,” “Adjusted Return on Average Shareholders’ Equity,” “Adjusted Return on Average Tangible Common Equity,” “Adjusted Pre-Tax, Pre-Provision Earnings,” “Efficiency Ratio,” “Tangible Common Equity to Tangible Assets,” “Tangible Book Value Per Share” and “Return on Average Tangible Common Equity.” The Company believes that these non-GAAP financial measures provide both management and investors a more complete understanding of the Company’s funding profile and profitability. These non-GAAP financial measures are supplemental and are not a substitute for any analysis based on GAAP financial measures. Not all companies use the same calculation of these measures; therefore this presentation may not be comparable to other similarly titled measures as presented by other companies.\nForward-Looking Statements\nReaders should note that in addition to the historical information contained herein, this press release includes \"forward-looking statements,\" including but not limited to statements about the Company’s expected loan production, operating expenses and future earnings levels. These statements are subject to many risks and uncertainties, including changes in interest rates and other general economic, business and political conditions, including changes in the financial markets; changes in business plans as circumstances warrant; and other risks detailed from time to time in filings made by the Company with the Securities and Exchange Commission. Readers should note that the forward-looking statements included in this press release are not a guarantee of future events, and that actual events may differ materially from those made in or suggested by the forward-looking statements. Forward-looking statements generally can be identified by the use of forward-looking terminology such as \"will,\" \"propose,\" \"may,\" \"plan,\" \"seek,\" \"expect,\" \"intend,\" \"estimate,\" \"anticipate,\" \"believe\" or \"continue,\" or similar terminology. Any forward-looking statements presented herein are made only as of the date of this press release, and we do not undertake any obligation to update or revise any forward-looking statements to reflect changes in assumptions, the occurrence of unanticipated events, or otherwise.\nCONTACTS:\nJeffrey G. Ludwig, Chief Financial Officer, at jludwig@midlandsb.com or (217) 342-7321\nDouglas J. Tucker, Sr. V.P., Corporate Counsel, at dtucker@midlandsb.com or (217) 342-7321\nMIDLAND STATES BANCORP, INC. CONSOLIDATED FINANCIAL SUMMARY (unaudited) For the Quarter Ended December 31, September 30, June 30, March 31, December 31, (dollars in thousands, except per share data) 2017 2017 2017 2017 2016 Earnings Summary Net interest income $ 36,036 $ 36,765 $ 29,400 $ 27,461 $ 25,959 Provision for loan losses 6,076 1,489 458 1,533 2,445 Noninterest income 13,998 15,403 13,619 16,342 30,486 Noninterest expense 36,192 48,363 37,645 30,797 34,090 Income before income taxes 7,766 2,316 4,916 11,473 19,910 Income taxes 5,775 280 1,377 2,983 8,327 Net income $ 1,991 $ 2,036 $ 3,539 $ 8,490 $ 11,583 Diluted earnings per common share $ 0.10 $ 0.10 $ 0.20 $ 0.52 $ 0.72 Weighted average shares outstanding - diluted 19,741,833 19,704,217 17,320,089 16,351,637 16,032,016 Return on average assets 0.18 % 0.18 % 0.39 % 1.05 % 1.44 % Return on average shareholders' equity 1.74 % 1.78 % 3.93 % 10.58 % 14.05 % Return on average tangible common shareholders' equity 2.33 % 2.39 % 4.91 % 12.78 % 16.84 % Net interest margin 3.73 % 3.78 % 3.70 % 3.87 % 3.70 % Efficiency ratio 64.64 % 69.00 % 66.54 % 66.34 % 76.64 % Adjusted Earnings Performance Summary Adjusted earnings $ 8,403 $ 9,173 $ 8,076 $ 9,243 $ 6,302 Adjusted diluted earnings per common share $ 0.42 $ 0.46 $ 0.46 $ 0.56 $ 0.39 Adjusted return on average assets 0.76 % 0.82 % 0.89 % 1.14 % 0.78 % Adjusted return on average shareholders' equity 7.34 % 8.03 % 8.97 % 11.52 % 7.64 % Adjusted return on average tangible common shareholders' equity 9.83 % 10.77 % 11.21 % 13.91 % 9.16 %\nMIDLAND STATES BANCORP, INC. CONSOLIDATED FINANCIAL SUMMARY (unaudited) (continued) For the Quarter Ended December 31, September 30, June 30, March 31, December 31, (in thousands, except per share data) 2017 2017 2017 2017 2016 Net interest income: Total interest income $ 43,500 $ 43,246 $ 34,528 $ 31,839 $ 29,981 Total interest expense 7,464 6,481 5,128 4,378 4,022 Net interest income 36,036 36,765 29,400 27,461 25,959 Provision for loan losses 6,076 1,489 458 1,533 2,445 Net interest income after provision for loan losses 29,960 35,276 28,942 25,928 23,514 Noninterest income: Commercial FHA revenue 3,127 3,777 4,153 6,695 3,704 Residential mortgage banking revenue 1,556 2,317 2,330 2,916 6,241 Wealth management revenue 3,587 3,475 3,406 2,872 2,495 Service charges on deposit accounts 1,828 2,133 1,122 892 988 Interchange revenue 1,538 1,724 1,114 977 921 Gain on sales of investment securities, net 2 98 55 67 14,387 Other income 2,360 1,879 1,439 1,923 1,750 Total noninterest income 13,998 15,403 13,619 16,342 30,486 Noninterest expense: Salaries and employee benefits 17,344 22,411 21,842 17,115 17,326 Occupancy and equipment 3,859 4,144 3,472 3,184 3,266 Data processing 3,640 5,786 2,949 2,796 2,828 Professional 3,611 4,151 3,142 2,992 2,898 Amortization of intangible assets 1,035 1,187 579 525 534 Loss on mortgage servicing rights held for sale 442 3,617 - - - Other 6,261 7,067 5,661 4,185 7,238 Total noninterest expense 36,192 48,363 37,645 30,797 34,090 Income before income taxes 7,766 2,316 4,916 11,473 19,910 Income taxes 5,775 280 1,377 2,983 8,327 Net income $ 1,991 $ 2,036 $ 3,539 $ 8,490 $ 11,583 Basic earnings per common share $ 0.10 $ 0.10 $ 0.21 $ 0.54 $ 0.74 Diluted earnings per common share $ 0.10 $ 0.10 $ 0.20 $ 0.52 $ 0.72\nMIDLAND STATES BANCORP, INC. CONSOLIDATED FINANCIAL SUMMARY (unaudited) (continued) At Quarter Ended December 31, September 30, June 30, March 31, December 31, (in thousands) 2017 2017 2017 2017 2016 Assets Cash and cash equivalents $ 215,202 $ 183,572 $ 334,356 $ 218,096 $ 190,716 Investment securities available-for-sale at fair value 450,525 396,985 385,340 259,332 246,339 Investment securities held to maturity at amortized cost - 70,867 75,371 76,276 78,672 Loans 3,226,678 3,157,972 3,184,063 2,454,950 2,319,976 Allowance for loan losses (16,431 ) (16,861 ) (15,424 ) (15,805 ) (14,862 ) Total loans, net 3,210,247 3,141,111 3,168,639 2,439,145 2,305,114 Loans held for sale at fair value 50,089 35,874 41,689 39,900 70,565 Premises and equipment, net 76,162 80,941 76,598 66,914 66,692 Other real estate owned 5,708 6,379 7,036 3,680 3,560 Mortgage servicing rights at lower of cost or market 56,352 56,299 70,277 68,557 68,008 Mortgage servicing rights held for sale 10,176 10,618 - - - Intangible assets 16,932 17,966 18,459 8,633 7,187 Goodwill 98,624 97,351 96,940 50,807 48,836 Cash surrender value of life insurance policies 113,366 112,591 111,802 74,806 74,226 Other assets 109,318 137,207 105,135 67,431 73,808 Total assets $ 4,412,701 $ 4,347,761 $ 4,491,642 $ 3,373,577 $ 3,233,723 Liabilities and Shareholders' Equity Noninterest bearing deposits $ 724,443 $ 674,118 $ 780,803 $ 528,021 $ 562,333 Interest bearing deposits 2,406,646 2,440,349 2,552,228 1,999,455 1,842,033 Total deposits 3,131,089 3,114,467 3,333,031 2,527,476 2,404,366 Short-term borrowings 156,126 153,443 170,629 124,035 131,557 FHLB advances and other borrowings 496,436 488,870 400,304 250,353 237,518 Subordinated debt 93,972 54,581 54,556 54,532 54,508 Trust preferred debentures 45,379 45,267 45,156 37,496 37,405 Other liabilities 40,154 40,444 36,014 45,352 46,599 Total liabilities 3,963,156 3,897,072 4,039,690 3,039,244 2,911,953 Total shareholders’ equity 449,545 450,689 451,952 334,333 321,770 Total liabilities and shareholders’ equity $ 4,412,701 $ 4,347,761 $ 4,491,642 $ 3,373,577 $ 3,233,723\nMIDLAND STATES BANCORP, INC. CONSOLIDATED FINANCIAL SUMMARY (unaudited) (continued) As of December 31, September 30, June 30, March 31, December 31, (in thousands) 2017 2017 2017 2017 2016 Loan Portfolio Commercial loans $ 555,930 $ 513,544 $ 571,111 $ 475,408 $ 457,827 Commercial real estate loans 1,440,011 1,472,284 1,470,487 997,200 969,615 Construction and land development loans 200,587 182,513 176,098 171,047 177,325 Residential real estate loans 453,552 445,747 428,464 277,402 253,713 Consumer loans 371,455 343,038 335,902 337,081 270,017 Lease financing loans 205,143 200,846 202,001 196,812 191,479 Total loans $ 3,226,678 $ 3,157,972 $ 3,184,063 $ 2,454,950 $ 2,319,976 Deposit Portfolio Noninterest-bearing demand deposits $ 724,443 $ 674,118 $ 780,803 $ 528,021 $ 562,333 Checking accounts 785,935 800,649 841,640 751,193 656,248 Money market accounts 646,426 633,844 578,077 415,322 399,851 Savings accounts 281,212 278,977 291,912 169,715 166,910 Time deposits 502,810 493,777 525,647 394,508 400,304 Brokered deposits 190,263 233,102 314,952 268,717 218,720 Total deposits $ 3,131,089 $ 3,114,467 $ 3,333,031 $ 2,527,476 $ 2,404,366\nMIDLAND STATES BANCORP, INC. CONSOLIDATED FINANCIAL SUMMARY (unaudited) (continued) For the Quarter Ended December 31, September 30, June 30, March 31, December 31, (in thousands) 2017 2017 2017 2017 2016 Average Balance Sheets Cash and cash equivalents $ 173,540 $ 202,407 $ 192,483 $ 163,595 $ 140,439 Investment securities 461,475 474,216 362,268 328,880 315,511 Loans 3,198,036 3,173,027 2,620,875 2,361,380 2,299,115 Loans held for sale 40,615 46,441 61,759 73,914 86,665 Nonmarketable equity securities 33,703 31,224 22,246 20,047 18,927 Total interest-earning assets 3,907,369 3,927,315 3,259,631 2,947,816 2,860,657 Non-earning assets 497,502 498,364 372,525 336,761 337,566 Total assets $ 4,404,871 $ 4,425,679 $ 3,632,156 $ 3,284,577 $ 3,198,223 Interest-bearing deposits $ 2,433,461 $ 2,527,490 $ 2,116,564 $ 1,896,569 $ 1,838,760 Short-term borrowings 181,480 182,015 146,144 143,583 151,191 FHLB advances and other borrowings 472,709 434,860 290,401 248,045 183,614 Subordinated debt 88,832 54,570 54,542 54,518 54,495 Trust preferred debentures 45,312 45,201 39,179 37,443 37,357 Total interest-bearing liabilities 3,221,794 3,244,136 2,646,830 2,380,158 2,265,417 Noninterest-bearing deposits 684,907 688,986 579,977 525,868 562,958 Other noninterest-bearing liabilities 44,202 39,240 44,014 53,109 41,962 Shareholders' equity 453,968 453,317 361,335 325,442 327,886 Total liabilities and shareholders' equity $ 4,404,871 $ 4,425,679 $ 3,632,156 $ 3,284,577 $ 3,198,223 Yields Cash and cash equivalents 1.28 % 1.19 % 1.02 % 0.77 % 0.53 % Investment securities 3.01 % 2.86 % 3.33 % 3.21 % 3.10 % Loans 4.88 % 4.90 % 4.71 % 4.91 % 4.65 % Loans held for sale 3.62 % 3.74 % 4.67 % 4.22 % 4.22 % Nonmarketable equity securities 4.78 % 4.20 % 4.31 % 4.41 % 3.85 % Total interest-earning assets 4.48 % 4.44 % 4.33 % 4.47 % 4.26 % Interest-bearing deposits 0.58 % 0.53 % 0.53 % 0.51 % 0.48 % Short-term borrowings 0.26 % 0.22 % 0.23 % 0.23 % 0.22 % FHLB advances and other borrowings 1.42 % 1.36 % 1.16 % 0.93 % 0.78 % Subordinated debt 6.46 % 6.40 % 6.40 % 6.40 % 6.41 % Trust preferred debentures 5.75 % 5.60 % 5.37 % 5.12 % 4.99 % Total interest-bearing liabilities 0.92 % 0.79 % 0.78 % 0.75 % 0.71 % Net interest margin 3.73 % 3.78 % 3.70 % 3.87 % 3.70 %\nMIDLAND STATES BANCORP, INC. CONSOLIDATED FINANCIAL SUMMARY (unaudited) (continued) As of and for the Quarter Ended December 31, September 30, June 30, March 31, December 31, (dollars in thousands, except per share data) 2017 2017 2017 2017 2016 Asset Quality Loans 30-89 days past due $ 15,405 $ 13,526 $ 13,566 $ 14,075 $ 10,767 Nonperforming loans 26,760 33,431 27,615 28,933 31,603 Nonperforming assets 30,894 38,109 33,150 31,684 34,550 Net charge-offs 6,506 52 839 590 3,142 Loans 30-89 days past due to total loans 0.48 % 0.43 % 0.43 % 0.57 % 0.46 % Nonperforming loans to total loans 0.83 % 1.06 % 0.87 % 1.18 % 1.36 % Nonperforming assets to total assets 0.70 % 0.88 % 0.74 % 0.94 % 1.07 % Allowance for loan losses to total loans 0.51 % 0.53 % 0.48 % 0.64 % 0.64 % Allowance for loan losses to nonperforming loans 61.40 % 50.43 % 55.81 % 54.62 % 47.03 % Net charge-offs to average loans 0.81 % 0.01 % 0.13 % 0.10 % 0.54 % Wealth Management Trust assets under administration $ 2,051,249 $ 2,001,106 $ 1,929,513 $ 1,869,314 $ 1,658,235 Market Data Book value per share at period end $ 23.35 $ 23.45 $ 23.51 $ 21.19 $ 20.78 Tangible book value per share at period end $ 17.31 $ 17.41 $ 17.47 $ 17.42 $ 17.16 Market price at period end $ 32.48 $ 31.68 $ 33.52 $ 34.39 $ 36.18 Shares outstanding at period end 19,122,049 19,093,153 19,087,409 15,780,651 15,483,499 Capital Total capital to risk-weighted assets 13.26 % 12.21 % 11.98 % 13.48 % 13.85 % Tier 1 capital to risk-weighted assets 10.19 % 10.20 % 10.05 % 10.97 % 11.27 % Tier 1 leverage ratio 8.63 % 8.54 % 10.45 % 9.61 % 9.76 % Common equity Tier 1 capital ratio 8.45 % 8.50 % 8.36 % 9.10 % 9.35 % Tangible common equity to tangible assets 7.70 % 7.85 % 7.62 % 8.29 % 8.36 %\nMIDLAND STATES BANCORP, INC. RECONCILIATIONS OF NON-GAAP FINANCIAL MEASURES Adjusted Earnings Reconciliation For the Quarter Ended December 31, September 30, June 30, March 31, December 31, (in thousands, except per share data) 2017 2017 2017 2017 2016 Income before income taxes - GAAP $ 7,766 $ 2,316 $ 4,916 $ 11,473 $ 19,910 Adjustments to noninterest income: Gain on sales of investment securities, net 2 98 55 67 14,387 Gain (loss) on sale of other assets 37 45 (91 ) (58 ) - Total adjustments to noninterest income 39 143 (36 ) 9 14,387 Adjustments to noninterest expense: Net expense from loss share termination agreement - - - - 351 Branch network optimization plan charges 371 336 1,236 9 2,099 Loss on mortgage servicing rights held for sale 442 3,617 - - - Integration and acquisition expenses 2,315 7,967 6,214 1,242 1,200 Total adjustments to noninterest expense 3,128 11,920 7,450 1,251 3,650 Adjusted earnings pre tax 10,855 14,093 12,402 12,715 9,173 Adjusted earnings tax (a) 6,992 4,920 4,326 3,472 2,871 Revaluation of net deferred tax assets (4,540 ) - - - - Adjusted earnings - non-GAAP $ 8,403 $ 9,173 $ 8,076 $ 9,243 $ 6,302 Adjusted diluted EPS $ 0.42 $ 0.46 $ 0.46 $ 0.56 $ 0.39 Adjusted return on average assets 0.76 % 0.82 % 0.89 % 1.14 % 0.78 % Adjusted return on average shareholders' equity 7.34 % 8.03 % 8.97 % 11.52 % 7.64 % Adjusted return on average tangible common equity 9.83 % 10.77 % 11.21 % 13.91 % 9.16 % (a) Tax rate applied to adjustments changed for prior 2017 quarters to statutory tax rate for fiscal 2017. Adjusted Pre-Tax, Pre-Provision Earnings Reconciliation For the Quarter Ended December 31, September 30, June 30, March 31, December 31, (in thousands) 2017 2017 2017 2017 2016 Adjusted earnings pre tax $ 10,855 $ 14,093 $ 12,402 $ 12,715 $ 9,173 Provision for loan losses 6,076 1,489 458 1,533 2,445 Adjusted pre-tax, pre-provision earnings - non-GAAP $ 16,931 $ 15,582 $ 12,860 $ 14,248 $ 11,618\nMIDLAND STATES BANCORP, INC. RECONCILIATIONS OF NON-GAAP FINANCIAL MEASURES Efficiency Ratio Reconciliation For the Quarter Ended December 31, September 30, June 30, March 31, December 31, (in thousands) 2017 2017 2017 2017 2016 Noninterest expense - GAAP $ 36,192 $ 48,364 $ 37,644 $ 30,798 $ 34,090 Net expense from loss-share termination agreement - - - - (351 ) Branch network optimization plan charges (371 ) (336 ) (1,236 ) (9 ) (2,099 ) Loss on mortgage servicing rights held for sale (442 ) (3,617 ) - - - Integration and acquisition expenses (2,315 ) (7,967 ) (6,214 ) (1,242 ) (1,200 ) Adjusted noninterest expense $ 33,064 $ 36,444 $ 30,194 $ 29,547 $ 30,440 Net interest income - GAAP $ 36,036 $ 36,765 $ 29,400 $ 27,461 $ 25,959 Effect of tax-exempt income 659 687 674 671 620 Adjusted net interest income 36,695 37,452 30,074 28,132 26,579 Noninterest income - GAAP $ 13,998 $ 15,403 $ 13,619 $ 16,342 $ 30,485 Mortgage servicing rights impairment (recovery) 494 104 1,650 76 (2,958 ) Gain on sales of investment securities, net (2 ) (98 ) (55 ) (67 ) (14,387 ) Other income (37 ) (45 ) 91 58 - Adjusted noninterest income 14,453 15,364 15,305 16,409 13,140 Adjusted total revenue $ 51,148 $ 52,816 $ 45,379 $ 44,541 $ 39,719 Efficiency ratio 64.64 % 69.00 % 66.54 % 66.34 % 76.64 %\nMIDLAND STATES BANCORP, INC. RECONCILIATIONS OF NON-GAAP FINANCIAL MEASURES Tangible Common Equity to Tangible Assets Ratio and Tangible Book Value Per Share As of December 31, September 30, June 30, March 31, December 31, (dollars in thousands, except per share data) 2017 2017 2017 2017 2016 Shareholders' Equity to Tangible Common Equity Total shareholders' equity—GAAP $ 449,545 $ 450,689 $ 451,952 $ 334,333 $ 321,770 Adjustments: Preferred stock (2,970 ) (3,015 ) (3,134 ) - - Goodwill (98,624 ) (97,351 ) (96,940 ) (50,807 ) (48,836 ) Other intangibles (16,932 ) (17,966 ) (18,459 ) (8,633 ) (7,187 ) Tangible common equity $ 331,019 $ 332,357 $ 333,419 $ 274,893 $ 265,747 Total Assets to Tangible Assets: Total assets—GAAP 4,412,701 4,347,761 4,491,642 3,373,577 3,233,723 Adjustments: Goodwill (98,624 ) (97,351 ) (96,940 ) (50,807 ) (48,836 ) Other intangibles (16,932 ) (17,966 ) (18,459 ) (8,633 ) (7,187 ) Tangible assets $ 4,297,145 $ 4,232,444 $ 4,376,243 $ 3,314,137 $ 3,177,700 Common Shares Outstanding 19,122,049 19,093,153 19,087,409 15,780,651 15,483,499 Tangible Common Equity to Tangible Assets 7.70 % 7.85 % 7.62 % 8.29 % 8.36 % Tangible Book Value Per Share $ 17.31 $ 17.41 $ 17.47 $ 17.42 $ 17.16 Return on Average Tangible Common Equity (ROATCE) As of December 31, September 30, June 30, March 31, December 31, (in thousands) 2017 2017 2017 2017 2016 Net Income $ 1,991 $ 2,036 $ 3,539 $ 8,490 $ 11,583 Average total shareholders' equity—GAAP $ 453,968 $ 453,317 $ 361,335 $ 325,442 $ 327,886 Adjustments: Goodwill (97,406 ) (97,129 ) (61,424 ) (48,836 ) (46,594 ) Other intangibles (17,495 ) (18,153 ) (10,812 ) (7,144 ) (7,718 ) Average tangible common equity $ 339,067 $ 338,035 $ 289,099 $ 269,462 $ 273,574 ROATCE 2.33 % 2.39 % 4.91 % 12.78 % 16.84 %\nSource:Midland States Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=6J50jJMEl85proUEak9LnKpnTAIrf3-Q_AqFnYrMSigeTCBMbDzMY7BbHjmkcWIdxGyBHfI5Pnhk7E095saj0JPVrZrJiEiZHUztPwF9RC0=", "https://www.globenewswire.com/Tracker?data=N6AAjmKDc9BZTybRU22VO5YLT6u2IWZHkzzTW3fy1hYyKUQ_cuX9QT3bxju_rNQ54J7TZUlp2kKJnlUu2JXxXw==", "https://www.linkedin.com/company/midland-states-bank", "https://www.globenewswire.com/Tracker?data=KQzqavRWBr7lF8zZUz1ryEv8yJJQxbWBY1F3FGvE5CttQYt3JE4kKrA0C1llKLNoB8cFFEDhS8GUG-wHM_Qhx1oZCtCNJQzc2ZjO32NWubU=", "https://www.globenewswire.com/Tracker?data=TOQfC-YjvGELYuZhu0xAfp9w1o5dmvSFJ3tbYkKpycS4nMnwHgf5dTFuM8OA1jMNQMtE4iExf2wFrmjUNkNuM-GOwh9jZPrdfpkx_qiBUjRe5zVnXXGL2m6VTbdVK84XfZ3_Pg0C8FiU1Axbt6J3_H48KrIy04yIT2GktEOxnwo=", "https://www.globenewswire.com/Tracker?data=Ozg4NJQm4SevrBHfKNKMhChvBiimCe2-w-43rh0er-G7O1PRKpvKXfrqqBge7-_NEZOE_tcOVFT98Vqzt2OvrId4cEImF8nerSOpUgfbEkG2FceosAkb0ZXBCbs9IB6TxhpGciBBH_z8WFHkxMY2mesl75ATSR-2t4kUy7yUL_k=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/c23ea7fd-a346-4531-a814-5ff25e8f32d4"], "published": "2018-01-26T00:05:00.000+02:00", "crawled": "2018-01-26T02:55:22.035+02:00", "highlightTitle": ""}