{"organizations": [], "uuid": "5b24ae44ad3aff7cf06f5cc4174462ea2ee07deb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-silgan-announces-record-2017-earnings-positioned-for-growth-and-significant-improvement-in-cash-generation-in-2018.html", "country": "US", "domain_rank": 767, "title": "Silgan Announces Record 2017 Earnings; Positioned for Growth and Significant Improvement in Cash Generation in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-31T01:00:00.000+02:00", "replies_count": 0, "uuid": "5b24ae44ad3aff7cf06f5cc4174462ea2ee07deb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-silgan-announces-record-2017-earnings-positioned-for-growth-and-significant-improvement-in-cash-generation-in-2018.html", "ord_in_thread": 0, "title": "Silgan Announces Record 2017 Earnings; Positioned for Growth and Significant Improvement in Cash Generation in 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}, {"name": "stamford", "sentiment": "none"}], "organizations": [{"name": "silgan", "sentiment": "negative"}, {"name": "silgan holdings inc.", "sentiment": "none"}, {"name": "dispensing systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Highlights\nRecord net income of $2.42 per diluted share Record adjusted net income of $1.65 per diluted share Cash from operations of $389.7 million, or $3.50 per diluted share Free cash flow of $224.1 million, or $2.01 per diluted share Enhanced the scope and growth opportunities of the Company with the Dispensing Systems acquisition Delivered significant improvement in the plastic container business Initiated construction on two new manufacturing facilities to support growth in the pet food market Recognized $110.9 million net reduction in future cash tax obligations primarily due to the recently enacted U.S. Tax Cuts and Jobs Act Refinanced debt portfolio to extend maturities, increase flexibility and increase long-term fixed rate debt at attractive interest rates Completed third 2-for-1 stock split Increased cash dividend per share by approximately 6 percent\nSTAMFORD, Conn.--(BUSINESS WIRE)-- Silgan Holdings Inc. (Nasdaq:SLGN), a leading supplier of rigid packaging for consumer goods products, today reported full year 2017 record net income of $269.7 million, or $2.42 per diluted share, as compared to full year 2016 net income of $153.4 million, or $1.27 per diluted share.\n“In 2017, we posted record adjusted net income per diluted share of $1.65, an increase of approximately 20 percent over the prior year, and an increase of approximately 25 percent in free cash flow to $224.1 million,” said Tony Allott, President and CEO. “We successfully integrated the Dispensing Systems operations, which we acquired in April 2017, and are very pleased with its performance and opportunities to further grow our closures portfolio. As expected, our metal and plastic container businesses benefitted from lower manufacturing costs and improved efficiencies throughout the year as a result of our footprint optimization programs completed in 2016,” continued Mr. Allott. “Lastly, at the end of 2017, the U.S. passed tax reform that will significantly benefit Silgan, which had been operating with comparative tax rate disadvantages to many of its competitors. This new tax reform will reduce our future cash obligations for existing net deferred tax liabilities, reduce our tax rates on future U.S. earnings and allow us greater flexibility to utilize global cash to invest in the most optimal locations. We believe Silgan is well positioned for another year of double digit earnings growth, with adjusted net income per diluted share for 2018 estimated to be in a range of $2.03 to $2.13, and for further growth investment in the coming years. As a result, we expect to continue to improve free cash flow, which we estimate to be approximately $300 million in 2018,” concluded Mr. Allott.\nAdjusted net income per diluted share was $1.65 for the full year 2017, after adjustments decreasing net income per diluted share by $0.77, including $1.00 in net tax adjustments reflecting reduced future cash tax obligations. Adjusted net income per diluted share was $1.38 for the full year 2016, after adjustments increasing net income per diluted share by $0.11. A reconciliation of net income per diluted share to “adjusted net income per diluted share,” a Non-GAAP financial measure used by the Company which adjusts net income per diluted share for certain items, can be found in Tables A and B at the back of this press release.\nAll per share amounts for prior periods have been adjusted for the two-for-one stock split that occurred on May 26, 2017.\nThe Company reported net cash provided by operating activities of $389.7 million in 2017 as compared to $394.6 million in 2016. Free cash flow improved $44.2 million to $224.1 million in 2017 as compared to $179.9 million in 2016 primarily as a result of lower capital expenditures and improved operating performance, partially offset by costs attributable to announced acquisitions. The Company is providing a reconciliation in Table C of this press release of net cash provided by operating activities to “free cash flow,” a Non-GAAP financial measure which adjusts net cash provided by operating activities for capital expenditures and changes in outstanding checks.\nNet sales for the full year of 2017 were $4.09 billion, an increase of $477.0 million, or 13.2 percent, as compared to 2016. This increase was the result of the acquisition of the Dispensing Systems operations in April 2017 and higher net sales across all businesses.\nIncome from operations for 2017 was $357.0 million, an increase of $57.3 million, or 19.1 percent, as compared to $299.7 million for 2016, and operating margin increased to 8.7 percent from 8.3 percent over the same periods. The increase in income from operations was the result of higher income from operations in the closures business due to the acquisition of Dispensing Systems and higher income from operations in the metal and plastic container businesses. Rationalization charges were $5.8 million and $19.1 million in 2017 and 2016, respectively. Costs attributed to announced acquisitions were $24.7 million and $1.4 million in 2017 and 2016, respectively.\nInterest and other debt expense before loss on early extinguishment of debt for 2017 was $110.2 million, an increase of $42.4 million as compared to 2016 due primarily to higher average outstanding borrowings principally as a result of additional borrowings for the acquisition of Dispensing Systems in April 2017 and higher weighted average interest rates, including the impact from increasing long-term fixed rate debt through the issuance in February 2017 of the 4 3/4% senior notes due 2025 and the 3 1/4% senior notes due 2025. Loss on early extinguishment of debt of $7.1 million in 2017 was a result of the prepayment of outstanding U.S. term loans and Euro term loans under the previous senior secured credit facility in conjunction with the issuance of the new senior notes and the partial redemption in April 2017 of the 5% senior notes due 2020.\nThe effective tax rate for 2017 was a negative 12.5 percent as compared to a provision of 33.9 percent for 2016. The effective tax rate for 2017 was favorably impacted by the benefit from effective tax rate adjustments totaling $110.9 million, or $1.00 per diluted share, primarily related to the revaluation of net deferred tax liabilities to reflect lower future cash tax obligations as a result of the reduction in U.S. corporate income tax rates under the recently enacted U.S. Tax Cuts and Jobs Act of 2017. The tax rate calculated under the recently enacted U.S. Tax Cuts and Jobs Act reflects the Company’s best provisional estimate of the new legislation’s impact. As new information becomes available, including the issuance of interpretations by regulatory bodies, the Company may update this estimate. The tax rate in 2017, exclusive of these effective tax rate adjustments, would have been a provision of 33.8 percent.\nMetal Containers\nNet sales of the metal container business were $2.28 billion in 2017, an increase of $6.2 million, or 0.3 percent, as compared to 2016. This increase was primarily a result of the pass through of higher raw material costs and the impact of favorable foreign currency translation, partially offset by lower unit volumes of approximately two percent principally attributable to lower soup volumes and a less favorable fruit and tomato pack on the west coast of the United States.\nIncome from operations of the metal container business in 2017 was $230.2 million, an increase of $15.5 million as compared to $214.7 million in 2016, and operating margin increased to 10.1 percent in 2017 from 9.5 percent in the prior year. The increase in income from operations was primarily attributable to lower manufacturing costs, lower rationalization charges and the favorable impact from an increase in inventories in the current year as compared to a decrease in inventories in the prior year, partially offset by the impact of lower unit volumes, the unfavorable impact from the contractual pass through to customers of indexed deflation, an increase in depreciation expense, the unfavorable impact of a charge related to the resolution of a past non-commercial legal dispute and foreign currency transaction losses in the current year period as compared to foreign currency transaction gains in the prior year period. Rationalization charges were $3.3 million and $12.1 million in 2017 and 2016, respectively.\nClosures\nNet sales of the closures business were $1.25 billion in 2017, an increase of $449.6 million, or 56.4 percent, as compared to $797.1 million in 2016. This increase was primarily the result of the inclusion of the Dispensing Systems operations, the pass through of higher raw material costs and the impact of favorable foreign currency translation, partially offset by lower unit volumes of approximately three percent in the legacy closures operations as compared to record volumes in the prior year period principally as a result of a decline in single-serve beverages due to cooler weather conditions in major markets served.\nIncome from operations of the closures business for 2017 increased $42.2 million to $142.0 million as compared to $99.8 million in 2016, while operating margin decreased to 11.4 percent from 12.5 percent over the same periods. The increase in income from operations was primarily due to the inclusion of Dispensing Systems and lower manufacturing costs, partially offset by the impact from a decrease in unit volumes in the legacy closures operations. Operating margin was unfavorably impacted primarily due to the write-up of inventory of Dispensing Systems for purchase accounting.\nPlastic Containers\nNet sales of the plastic container business were $565.1 million in 2017, an increase of $21.2 million, or 3.9 percent, as compared to $543.9 million in 2016. This increase was principally due to the pass through of higher raw material costs, higher volumes of approximately two percent and the impact of favorable foreign currency translation, partially offset by a less favorable mix of products sold.\nIncome from operations of the plastic container business in 2017 was $27.8 million, an increase of $22.6 million as compared to $5.2 million in 2016, and operating margin increased to 4.9 percent from 1.0 percent over the same periods. The increase in income from operations was primarily attributable to lower manufacturing costs, higher volumes and lower rationalization charges, partially offset by higher depreciation expense and the unfavorable impact from the lagged pass through of increases in resin costs. Rationalization charges were $1.5 million and $6.4 million in 2017 and 2016, respectively.\nFourth Quarter\nThe Company reported record net income for the fourth quarter of 2017 of $146.1 million, or $1.31 per diluted share, as compared to net income for the fourth quarter of 2016 of $23.7 million, or $0.20 per diluted share. Adjusted net income per diluted share for the fourth quarter of 2017 was a record $0.32, after adjustments decreasing net income per diluted share by $0.99, including $1.00 in net tax adjustments reflecting reduced future cash tax obligations. Adjusted net income per diluted share for the fourth quarter of 2016 was $0.24, after adjustments increasing net income per diluted share by $0.04.\nNet sales for the fourth quarter of 2017 increased $189.8 million, or 23.6 percent, to $995.7 million as compared to $805.9 million for the fourth quarter of 2016. This increase was primarily due to the inclusion of the Dispensing Systems operations, the pass through of higher raw material costs, the impact of favorable foreign currency translation and an increase in volumes of approximately four percent in the plastic container business, partially offset by a decrease in unit volumes in the legacy closures operations and metal container business of approximately four percent and one percent, respectively.\nIncome from operations for the fourth quarter of 2017 was $86.4 million, an increase of $34.2 million as compared to $52.2 million for the fourth quarter of 2016, and operating margin increased to 8.7 percent from 6.5 percent over the same periods. The increase in income from operations was primarily due to the inclusion of the Dispensing Systems operations, manufacturing efficiencies and lower costs in each of the businesses, the favorable impact in the metal container business of an increase in inventories in the fourth quarter of 2017 as compared to a decrease in inventories in the prior year period, lower rationalization charges and higher volumes in the plastic container business. These increases were partially offset by lower unit volumes in the legacy closures operations and metal container business and the unfavorable impact from the contractual pass through to customers of indexed deflation in the metal container business. Rationalization charges were $1.3 million and $5.1 million in the fourth quarters of 2017 and 2016, respectively. Costs attributed to announced acquisitions were $0.9 million and $1.4 million in the fourth quarters of 2017 and 2016, respectively.\nInterest and other debt expense for the fourth quarter of 2017 was $30.0 million, an increase of $12.9 million as compared to the fourth quarter of 2016. This increase was primarily due to higher average outstanding borrowings principally as a result of additional borrowings for the acquisition of Dispensing Systems and higher weighted average interest rates, including the impact from increasing long-term fixed rate debt through the issuance in February 2017 of the 4 3/4% senior notes due 2025 and the 3 1/4% senior notes due 2025 and rising interest rates.\nThe effective tax rate for the fourth quarter of 2017 was a negative 159.2 percent as compared to a provision of 32.4 percent for the fourth quarter of 2016. The effective tax rate for the fourth quarter of 2017 was favorably impacted by the benefit from effective tax rate adjustments totaling $110.9 million, or $1.00 per diluted share, primarily related to the revaluation of net deferred tax liabilities to reflect lower future cash tax obligations as a result of the reduction in U.S. corporate income tax rates under the recently enacted U.S. Tax Cuts and Jobs Act of 2017. The tax rate in the fourth quarter of 2017, exclusive of these effective tax rate adjustments, would have been a provision of 37.6 percent primarily due to the negative impact of the settlement of certain tax disputes, partially offset by higher income in more favorable tax jurisdictions.\nNew Manufacturing Facilities\nThe Company has initiated construction of a metal container manufacturing facility in Allentown, Pennsylvania to serve a major pet food customer. In addition, the Company has initiated construction of a thermoformed plastic container manufacturing facility in Fort Smith, Arkansas in support of continued growth.\nOutlook for 2018\nThe Company currently estimates that its adjusted net income per diluted share for the full year 2018 will be in the range of $2.03 to $2.13, as compared to adjusted net income per diluted share for the full year of 2017 of $1.65. Adjusted net income per diluted share excludes rationalization charges, loss on early extinguishment of debt, costs attributed to announced acquisitions and the net impact of certain effective tax rate adjustments in the fourth quarter of 2017.\nNet sales in the metal container business are expected to increase in 2018 as compared to 2017 primarily due to the pass through of higher raw material and other manufacturing costs and the impact from anticipated favorable foreign currency rates. Unit volumes in the metal container business are expected to be flat as an anticipated normal fruit and vegetable pack on the west coast of the U.S. and continued growth in pet food are offset by potential declines in certain other can markets. Income from operations in the metal container business is expected to benefit from continued manufacturing efficiencies and the lagged contractual pass through to customers of indexed inflation. However, much of this improvement is expected to be offset by the impact from unfavorable overhead absorption from a significant planned reduction in inventories in the U.S. as the Company generates additional cash and realizes supply chain benefits arising from its footprint optimization program. Net sales in the closures business are expected to increase in 2018 as compared to 2017 primarily as a result of the benefit of a full year of Dispensing Systems, the pass through of higher raw material and other manufacturing costs, the impact from anticipated favorable foreign currency rates and improved unit volumes. Income from operations in the closures business is expected to increase in 2018 primarily as a result of the benefit of a full year of Dispensing Systems, including expected synergies and the absence of the prior year unfavorable impact from the inventory write-up for purchase accounting, continued manufacturing efficiencies and higher unit volumes. Net sales in the plastic container business are expected to increase in 2018 as compared to the prior year as a result of volume growth and the pass through of higher raw material costs. Income from operations in the plastic container business is expected to benefit from continued manufacturing efficiencies and volume growth, partially offset by costs associated with the start-up of the new plant in Fort Smith, Arkansas.\nThe Company expects interest expense to increase in 2018 due to higher average outstanding borrowings as a result of additional borrowings for the acquisition of Dispensing Systems in April 2017 and higher weighted average interest rates due primarily to market rate increases on variable rate debt.\nThe Company expects its effective tax rate for 2018 to be approximately 24 percent, as compared to the effective tax rate for 2017 of 33.8 percent excluding certain effective tax rate adjustments. The effective tax rate for 2018 reflects the current estimate of the impact from the recently enacted U.S. Tax Cuts and Jobs Act of 2017.\nThe Company currently estimates that free cash flow in 2018 will increase approximately 34 percent to approximately $300 million as compared to $224.1 million in 2017. The expected increase in free cash flow is primarily the result of operating income improvement in each of the businesses, including the impact from a full year of Dispensing Systems, improvements in working capital principally as a result of a significant planned reduction in inventories in the metal container business and the benefit of a lower effective tax rate, partially offset by an increase in interest payments and capital expenditures.\nFor the first quarter of 2018, the Company is providing an estimate of adjusted net income per diluted share in the range of $0.32 to $0.36, as compared to $0.31 in the first quarter of 2017. The increase over the prior year is due primarily to the inclusion of the Dispensing Systems operations in the first quarter of 2018 and the benefit of a lower effective tax rate, partially offset by higher interest expense, the unfavorable impact of a significantly lower seasonal inventory build than in the prior year period in the metal container business and the unfavorable impact from the lagged pass through of increases in resin costs. Adjusted net income per diluted share excludes rationalization charges, loss on early extinguishment of debt and costs attributed to announced acquisitions.\nConference Call\nSilgan Holdings Inc. will hold a conference call to discuss the Company’s results for the fourth quarter and full year 2017 at 11:00 a.m. eastern time on January 31, 2018. The toll free number for those in the U.S. and Canada is 800-239-9838 and the number for international callers is 323-794-2551. For those unable to listen to the live call, a taped rebroadcast will be available through February 14, 2018. To access the rebroadcast, U.S. and Canadian callers should dial 888-203-1112 and international callers should dial 719-457-0820. The pass code is 8955953.\nSilgan is a leading supplier of rigid packaging for consumer goods products with annual net sales of approximately $4.1 billion in 2017. Silgan operates 100 manufacturing facilities in North and South America, Europe and Asia. The Company is a leading supplier of metal containers in North America and Europe for food and general line products. The Company is also a leading worldwide supplier of metal and plastic closures and dispensing systems for food, beverage, health care, garden, home and beauty products. In addition, the Company is a leading supplier of plastic containers for shelf-stable food and personal care products in North America.\nStatements included in this press release which are not historical facts are forward looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 and the Securities Exchange Act of 1934, as amended. Such forward looking statements are made based upon management’s expectations and beliefs concerning future events impacting the Company and therefore involve a number of uncertainties and risks, including, but not limited to, those described in the Company’s Annual Report on Form 10-K for 2016 and other filings with the Securities and Exchange Commission. Therefore, the actual results of operations or financial condition of the Company could differ materially from those expressed or implied in such forward looking statements.\nSILGAN HOLDINGS INC. CONDENSED CONSOLIDATED STATEMENTS OF INCOME (UNAUDITED) For the quarter and year ended December 31,\n(Dollars in millions, except per share amounts)\nFourth Quarter\nYear Ended\n2017\n2016\n2017\n2016\nNet sales $ 995.7 $ 805.9 $ 4,089.9 $ 3,612.9 Cost of goods sold 836.9 695.9 3,428.8 3,079.4 Gross profit 158.8 110.0 661.1 533.5 Selling, general and administrative expenses 71.1 52.7 298.3 214.7 Rationalization charges 1.3 5.1 5.8 19.1 Income from operations 86.4 52.2 357.0 299.7 Interest and other debt expense before loss on early extinguishment of debt\n30.0 17.1 110.2 67.8 Loss on early extinguishment of debt\n- - 7.1 -\nInterest and other debt expense 30.0 17.1 117.3 67.8 Income before income taxes 56.4 35.1 239.7 231.9 (Benefit) provision for income taxes (89.7 ) 11.4 (30.0 ) 78.5 Net income $ 146.1 $ 23.7 $ 269.7 $ 153.4 Earnings per share: (1) Basic net income per share $ 1.32 $ 0.20 $ 2.44 $ 1.28 Diluted net income per share $ 1.31 $ 0.20 $ 2.42 $ 1.27 Cash dividends per share (1) $ 0.09 $ 0.09 $ 0.36 $ 0.34 Weighted average shares (000’s): (1) Basic 110,429 116,155 110,353 119,732 Diluted 111,480 116,993 111,363 120,498 (1)\nPer share and share amounts have been adjusted for the two-for-one stock split that occurred on May 26, 2017. SILGAN HOLDINGS INC. CONSOLIDATED SUPPLEMENTAL FINANCIAL DATA (UNAUDITED) For the quarter and year ended December 31,\n(Dollars in millions)\nFourth Quarter\nYear Ended\n2017\n2016\n2017\n2016\nNet sales: Metal containers $ 509.7 $ 491.5 $ 2,278.1 $ 2,271.9 Closures 342.6 182.5 1,246.7 797.1 Plastic containers 143.4 131.9 565.1 543.9 Consolidated $ 995.7 $ 805.9 $ 4,089.9 $ 3,612.9 Income from operations: Metal containers (a) $ 44.7 $ 33.2 $ 230.2 $ 214.7 Closures (b) 39.1 21.6 142.0 99.8 Plastic containers (c) 7.8 3.4 27.8 5.2 Corporate (d) (5.2 ) (6.0 ) (43.0 ) (20.0 ) Consolidated $ 86.4 $ 52.2 $ 357.0 $ 299.7 SILGAN HOLDINGS INC. CONDENSED CONSOLIDATED BALANCE SHEETS (UNAUDITED) December 31,\n(Dollars in millions)\n2017\n2016\nAssets: Cash and cash equivalents $ 53.5 $ 24.7 Trade accounts receivable, net 454.6 288.2 Inventories 721.3 603.0 Other current assets 62.5 46.3 Property, plant and equipment, net 1,489.9 1,157.0 Other assets, net 1,863.6 1,030.2 Total assets $ 4,645.4 $ 3,149.4 Liabilities and stockholders’ equity: Current liabilities, excluding debt $ 849.4 $ 644.7 Current and long-term debt 2,547.3 1,561.6 Other liabilities 482.6 473.7 Stockholders’ equity 766.1 469.4 Total liabilities and stockholders’ equity $ 4,645.4 $ 3,149.4 (a) Includes rationalization charges of $3.7 million for the fourth quarter of 2016 and $3.3 million and $12.1 million for the years ended December 31, 2017 and 2016, respectively. (b) Includes rationalization charges of $0.5 million and $0.1 million for the fourth quarters of 2017 and 2016, respectively, and $1.0 million and $0.6 million for the years ended December 31, 2017 and 2016, respectively. (c) Includes rationalization charges of $0.8 million and $1.3 million for the fourth quarters of 2017 and 2016, respectively, and $1.5 million and $6.4 million for the years ended December 31, 2017 and 2016, respectively. (d) Includes costs attributed to announced acquisitions of $0.9 million and $1.4 million for the fourth quarters of 2017 and 2016, respectively, and $24.7 million and $1.4 million for the years ended December 31, 2017 and 2016, respectively. SILGAN HOLDINGS INC. CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (UNAUDITED) For the year ended December 31,\n(Dollars in millions)\n2017\n2016\nCash flows provided by (used in) operating activities: Net income $ 269.7 $ 153.4 Adjustments to reconcile net income to net cash provided by (used in) operating activities:\nDepreciation and amortization\n178.3\n147.2\nRationalization charges 5.8 19.1 Loss on early extinguishment of debt 7.1 - Stock compensation expense 14.6 13.0 Deferred income tax (benefit) provision (115.0 ) 45.0 Other changes that provided (used) cash, net of effects from acquisition:\nTrade accounts receivable, net (37.1 ) (10.9 ) Inventories (17.2 ) 20.0 Trade accounts payable and other changes, net 83.5 7.8 Net cash provided by operating activities 389.7 394.6 Cash flows provided by (used in) investing activities: Purchase of business, net of cash acquired (1,023.8 ) - Capital expenditures (174.5 ) (191.9 ) Proceeds from asset sales 0.6 11.6 Net cash used in investing activities (1,197.7 ) (180.3 ) Cash flows provided by (used in) financing activities: Dividends paid on common stock (40.5 ) (40.9 ) Changes in outstanding checks - principally vendors 8.9 (22.8 ) Shares repurchased under authorized repurchase program - (277.3 ) Net borrowings and other financing activities 868.4 51.5 Net cash provided by (used in) financing activities 836.8 (289.5 ) Cash and cash equivalents: Net increase (decrease) 28.8 (75.2 ) Balance at beginning of year 24.7 99.9 Balance at end of year $ 53.5 $ 24.7 Interest paid, net $ 97.6 $ 65.5 Income taxes paid, net of refunds 70.2 58.1 SILGAN HOLDINGS INC. RECONCILIATION OF ADJUSTED NET INCOME PER DILUTED SHARE (1) (2)\n(UNAUDITED)\nFor the quarter and year ended December 31,\nTable A\nFourth Quarter\nYear Ended\n2017\n2016\n2017\n2016\nNet income per diluted share as reported $ 1.31 $ 0.20 $ 2.42 $ 1.27 Adjustments: Rationalization charges 0.01 0.03 0.04 0.10 Loss on early extinguishment of debt - - 0.04 - Costs attributed to announced acquisitions - 0.01 0.15 0.01 Effective tax rate adjustments (1.00 ) - (1.00 ) - Adjusted net income per diluted share $ 0.32 $ 0.24 $ 1.65 $ 1.38 SILGAN HOLDINGS INC. RECONCILIATION OF ADJUSTED NET INCOME PER DILUTED SHARE (1) (2)\n(UNAUDITED)\nFor the quarter and year ended,\nTable B\nFirst Quarter\nYear Ended\nMarch 31,\nDecember 31,\nEstimated\nActual\nEstimated\nActual\nLow\n2018\nHigh\n2018\n2017\nLow\n2018\nHigh\n2018\n2017\nNet income per diluted share as estimated for 2018 and as reported for 2017\n$\n0.32\n$\n0.36\n$\n0.21\n$\n2.03\n$\n2.13\n$\n2.42\nAdjustments: Rationalization charges - - - - - 0.04 Loss on early extinguishment of debt - - 0.02 - - 0.04 Costs attributed to announced acquisitions - - 0.08 - - 0.15 Effective tax rate adjustments - - - - - (1.00 ) Adjusted net income per diluted share as estimated for 2018 and presented for 2017\n$\n0.32\n$\n0.36\n$\n0.31\n$\n2.03\n$\n2.13\n$\n1.65\nSILGAN HOLDINGS INC. RECONCILIATION OF FREE CASH FLOW (2) (3) (UNAUDITED) For the year ended December 31, (Dollars in millions, except per share data) Table C\n2017\n2016\nNet cash provided by operating activities $ 389.7 $ 394.6 Capital expenditures (174.5 ) (191.9 ) Changes in outstanding checks 8.9 (22.8 ) Free cash flow $ 224.1 $ 179.9 Net cash provided by operating activities per diluted share $ 3.50 $ 3.27 Free cash flow per diluted share $ 2.01 $ 1.49 Weighted average diluted shares (000’s) 111,363 120,498 (1) The Company has presented adjusted net income per diluted share for the periods covered by this press release, which measure is a Non-GAAP financial measure. The Company’s management believes it is useful to exclude rationalization charges, costs attributed to announced acquisitions, the loss on early extinguishment of debt and the effective tax rate adjustments primarily due to the recently enacted U.S. Tax Cuts and Jobs Act of 2017 from its net income per diluted share as calculated under U.S. generally accepted accounting principles because such Non-GAAP financial measure allows for a more appropriate evaluation of its operating results. While rationalization costs are incurred on a regular basis, management views these costs more as an investment to generate savings rather than period costs. Costs attributed to announced acquisitions consist of third party fees and expenses that are viewed by management as part of the acquisition and not indicative of the on-going cost structure of the Company. The loss on early extinguishment of debt consists of third party fees and expenses incurred or debt costs written off that are viewed by management as part of the cost of prepayment of debt and not indicative of the on-going cost structure of the Company. The effective tax rate adjustments are primarily a result of the impact of the recently enacted U.S. Tax Cuts and Jobs Act of 2017 principally as a result of the revaluation of the net deferred tax liabilities at the new lower estimated corporate tax rate and is viewed by the Company as a period adjustment that is not indicative of the effective tax rate of the Company. Such Non-GAAP financial measure is not in accordance with U.S. generally accepted accounting principles and should not be considered in isolation but should be read in conjunction with the unaudited condensed consolidated statements of income and the other information presented herein. Additionally, such Non-GAAP financial measure should not be considered a substitute for net income per diluted share as calculated under U.S. generally accepted accounting principles and may not be comparable to similarly titled measures of other companies. (2) Per share and share amounts have been adjusted for the two-for-one stock split that occurred on May 26, 2017. (3) The Company has presented free cash flow in this press release, which is a Non-GAAP financial measure. The Company’s management believes that free cash flow is important to support its stated business strategy of investing in internal growth and acquisitions. Free cash flow is defined as net cash provided by operating activities adjusted for changes in outstanding checks and reduced by capital expenditures. At times, there may be other unusual cash items that will be excluded from free cash flow. Net cash provided by operating activities is the most comparable financial measure under U.S. generally accepted accounting principles to free cash flow, and it should not be inferred that the entire free cash flow amount is available for discretionary expenditures. Such Non-GAAP financial measure is not in accordance with U.S. generally accepted accounting principles and should not be considered in isolation but should be read in conjunction with the unaudited condensed consolidated statements of cash flows and the other information presented herein. Additionally, such Non-GAAP financial measure should not be considered a substitute for net cash provided by operating activities as calculated under U.S. generally accepted accounting principles and may not be comparable to similarly titled measures of other companies.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006398/en/\nSilgan Holdings Inc.\nRobert B. Lewis, 203-406-3160\nSource: Silgan Holdings Inc.", "external_links": ["http://www.businesswire.com/news/home/20180130006398/en/"], "published": "2018-01-31T01:00:00.000+02:00", "crawled": "2018-01-31T02:16:03.000+02:00", "highlightTitle": ""}