{"organizations": [], "uuid": "5c1012fe64c24cd000caeaa3d6a5321b9a6ad332", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224930564&w=1200&r=LYNXMPEE0N248", "site_section": "http://feeds.reuters.com/reuters/INhealth\r", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/us-health-tobacco-pmi/philip-morris-sees-six-million-u-s-smokers-switching-to-iqos-device-if-cleared-idINKBN1FD2Z1", "country": "US", "domain_rank": 408, "title": "Philip Morris sees six million U.S. smokers switching to iQOS device if cleared", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:17:00.000+02:00", "replies_count": 0, "uuid": "5c1012fe64c24cd000caeaa3d6a5321b9a6ad332"}, "author": "", "url": "https://in.reuters.com/article/us-health-tobacco-pmi/philip-morris-sees-six-million-u-s-smokers-switching-to-iqos-device-if-cleared-idINKBN1FD2Z1", "ord_in_thread": 0, "title": "Philip Morris sees six million U.S. smokers switching to iQOS device if cleared", "locations": [], "entities": {"persons": [{"name": "toni clarke", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "philip morris", "sentiment": "negative"}, {"name": "fda", "sentiment": "none"}, {"name": "philip morris international inc", "sentiment": "none"}, {"name": "u.s. food and drug administration", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 8:54 PM / Updated 6 hours ago Philip Morris sees six million U.S. smokers switching to iQOS device if cleared Toni Clarke 4 Min Read \nWASHINGTON (Reuters) - Philip Morris International Inc told a U.S. advisory panel on Wednesday that it expects around 6 million smokers to switch completely to its iQOS electronic tobacco device if the company is allowed to claim it is less risky than cigarettes. \nThe sleek, penlike iQOS device heats tobacco but does not burn it. The company hopes to convince the U.S. Food and Drug Administration advisory panel that the product contains fewer harmful chemicals than cigarettes and reduces the risk of smoking-related diseases for smokers who switch. \nThe panel will discuss the company’s application for two days and on Thursday will vote on whether the company’s data supports one of three potential “modified risk” claims that would be used on the product’s label and in marketing. \nThe vote is not binding but will influence the FDA’s decision. \nElectronic cigarettes currently on the market use a nicotine-laced liquid. Most toxic chemicals in cigarette smoke are produced when tobacco combusts. \nIQOS is used by nearly 4 million people in 30 markets outside the United States but needs FDA authorization to be marketed in America. \n(Last month, a Reuters investigation described irregularities in the clinical trials that supported Philip Morris' iQOS application to the FDA. ( here ) and ( here ) ) \nPhilip Morris says iQOS produces up to 95 percent fewer potentially harmful chemicals than regular cigarettes. The company said if 15 percent of U.S. daily smokers switched completely to iQOS it would translate to about 6 million smokers over seven to 10 years. The figure does not include smokers who might use iQOS in addition to cigarettes. \nMoira Gilchrist, Philip Morris’ vice president of scientific and public communications, estimated that 90,000 smoking-related deaths could have been averted over 20 years based on an assumed switch rate of 15 percent. \nThe panel’s discussion comes amid an intense debate over the potential risks and benefits associated with e-cigarettes. On Tuesday, the National Academies of Sciences, Engineering and Medicine, summarizing data from hundreds of scientific studies, said e-cigarettes are safer than cigarettes and help smokers quit. But the report also found “substantial evidence” that youths who use e-cigarettes are more likely to try traditional cigarettes. \nFDA staff in a preliminary review of Philip Morris’ application said that iQOS contains fewer harmful chemicals than cigarettes but that it was unclear whether reduced exposure translates into reduced risk of disease. \nResults of a study in mice that could shed additional light on additional cancer risk are expected in June. \nThe advisory panel will recommend whether the company should be allowed to claim that iQOS “can reduce the risks of tobacco-related diseases” or that it “presents less risk of harm than continuing to smoke cigarettes.” \nA third, easier-to-prove claim would state that iQOS “significantly reduces your body’s exposure to harmful or potentially harmful chemicals.” \nThe FDA is expected to decide whether Philip Morris can sell iQOS within the next few months. It will decide separately whether to authorize the modified-risk claims. If cleared, iQOS would be sold in the United States by Philip Morris’ partner Altria Group Inc. Reporting by Toni Clarke; Editing by Michele Gershberg and Matthew Lewis", "external_links": [], "published": "2018-01-25T16:17:00.000+02:00", "crawled": "2018-01-25T16:34:27.004+02:00", "highlightTitle": ""}