{"organizations": [], "uuid": "8a6b1b8035fc5c3497953f3a97764ca89092f9b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220424209&w=1200&r=LYNXMPEE0805O", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-australians/australia-impatient-for-home-champion-at-melbourne-park-idUSKBN1EY08V", "country": "US", "domain_rank": 408, "title": "Australia impatient for home champion at Melbourne Park", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T05:07:00.000+02:00", "replies_count": 0, "uuid": "8a6b1b8035fc5c3497953f3a97764ca89092f9b1"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-australians/australia-impatient-for-home-champion-at-melbourne-park-idUSKBN1EY08V", "ord_in_thread": 0, "title": "Australia impatient for home champion at Melbourne Park", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - For a tournament branded the “happy slam” by Roger Federer, the Australian Open has given little cheer to home players.\nForty years have passed since Chris O‘Neil held the Daphne Akhurst Memorial Cup aloft as the last Australian women’s champion in 1978. Add another two years for Mark Edmondson’s 1976 title on the men’s side.\nThe ensuing decades have seen Australia’s assembly line of grand slam winners slow to a crawl but still produce a host of would-be contenders.\nTo the consternation of home fans, only a couple have shone, with most falling flat on the national stage.\nTwice grand slam champion Lleyton Hewitt was the last to tease, his run to the 2005 final whipping crowds into a frenzy before they were silenced by an inspired Marat Safin.\nFormer Wimbledon champion Pat Cash was also stopped at the last hurdle in the 1980s, twice in successive years by Swedes Stefan Edberg and Mats Wilander.\nThe past decade has seen few Australian flags flapping in the second week of the tournament, however.\nThe country’s last grand slam champion Sam Stosur has been a maddening under-achiever, never passing the fourth round in 15 attempts.\nWith Stosur now 33 and long since written off as a title threat, men’s hope Nick Kyrgios now carries the burden of Australia’s expectations.\nBoasting a temper the equal of his prodigious talent, Kyrgios reached the 2015 quarter-finals, a breakthrough hailed by some as a milestone on the path to greatness.\nHis tantrum-laden second-round exit last year was less well-received, with one Australian tabloid advising him to “Nick off!” and get a coach in its front page headline.\nAll would be forgiven if Kyrgios flirts with a place in the second week, in what might seem a formality for a player who has beaten Federer, and twice upset Novak Djokovic and Rafa Nadal.\nHis form is encouraging too, having won the Brisbane title last week to start his year with a bang.\nYet few players have set themselves up to fail quite like the complicated 22-year-old.\nHe has spoken of his hatred of the Tour grind, cares little for training and would probably dream more of an NBA championship than raising the trophy at Wimbledon.\nSCREAMS SUCCESS Tennis - Australian Open - Melbourne Park, Australia - 17/1/14 Women's Singles - Australia's Sam Stosur in action during her third round match Mandatory Credit: Action Images / Jason O'Brien Livepic Along with his propensity to suddenly stop trying in matches, it is hardly a mindset that screams success.\nKyrgios’s biggest obstacle may be physical rather than mental, however, the right hip that has troubled him for much of the past two seasons vulnerable in a two-week slam.\nHe cut short his last year’s campaign to have time to recuperate, and even said he would spend less time playing basketball to avoid developing new niggles.\nThe comments will feed into hopes that Kyrgios is just a late developer and will ultimately embrace the game with a Federer-like passion, rather than end up derided like his compatriot Bernard Tomic.\nMany local tennis fans will remain sceptical, however, particularly those put off by Kyrgios’s regular controversies.\nThe goodwill Kyrgios lost now envelops the nation’s top women’s contender Ashleigh Barty.\nA year Kyrgios’s junior, Barty has dislodged Stosur as Australia’s number one woman after a meteoric rise.\nSince winning her maiden title in Malaysia in March, the former Wimbledon girls champion has humbled some of the tour’s biggest names and will be seeded in Melbourne.\nThe stellar run has stunned Barty herself, given she quit the tour three years ago as a disillusioned teenager.\nShe spent part of her hiatus playing elite cricket, securing one of only 14 professional contracts handed to women in her home state of Queensland.\nHer new-found love for tennis put paid to the promising cricket career but bodes well for her chances of making an impression at Melbourne Park.\n“I love it. I love our fans. I love their passion. And I love playing for Australia,” she told local media after winning the Newcombe Medal in November, the country’s top tennis honor.\n“Of course there’s pressure, but pressure is a privilege.”\nAustralian fans would clamor for such enthusiasm from Kyrgios at Melbourne Park.\n“The Australian public are crying out for a tennis hero,” her junior coach Jim Joyce told Fairfax Media.\n“And she’s a born and bred Aussie with the attitude and the talent and the spark.”\nReporting by Ian Ransom; Editing by ....\n ", "external_links": [], "published": "2018-01-09T05:07:00.000+02:00", "crawled": "2018-01-09T09:57:47.009+02:00", "highlightTitle": ""}