{"organizations": [], "uuid": "0ac994fa54b3de6c16fc285ff5bf43c9c3445394", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/16/the-associated-press-the-latest-house-gop-looking-to-delay-taxes-for-budget-bill.html", "country": "US", "domain_rank": 767, "title": "The Latest: House GOP looking to delay taxes for budget bill", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T01:25:00.000+02:00", "replies_count": 0, "uuid": "0ac994fa54b3de6c16fc285ff5bf43c9c3445394"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/the-associated-press-the-latest-house-gop-looking-to-delay-taxes-for-budget-bill.html", "ord_in_thread": 0, "title": "The Latest: House GOP looking to delay taxes for budget bill", "locations": [], "entities": {"persons": [{"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "andrew taylor", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "house gop", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "associated press", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The Latest on Congress' battle over the budget (all times local):\n6:25 p.m.\nHouse GOP leaders are looking to delay implementation of unpopular taxes on medical devices and generous employer-subsidized health care taxes as sweeteners for a stopgap spending bill that's needed to avert a government shutdown this weekend.\nThat's according to GOP aides briefed on the measure before its planned introduction Tuesday night.\nRepeal of the taxes, part of former President Barack Obama's marquee health law, could ease the way for the stopgap measure among some GOP conservatives.\nThe aides spoke on condition of anonymity to discuss a plan that wasn't yet public. They also predicted the measure would include a long-delayed renewal of a popular health insurance program for children.\nDemocrats are pressing to attach protections from deportation for younger immigrants who were brought to the country illegally as children.\n— By Associated Press writer Andrew Taylor\n4 p.m.\nA deal between President Donald Trump and Congress to protect young immigrants from deportation remains distant. House GOP leaders are discussing plans for a bill temporarily keeping federal agencies open in hopes of avoiding an election-year shutdown this weekend.\nThe continuing firestorm over Trump's incendiary remarks about countries in Africa is roiling partisan relations. The comments were reported by participants and others and denied by Trump. Either way, they're complicating efforts to craft a bipartisan agreement protecting younger immigrants brought to the country illegally as children, plus toughening border security with steps including funds to start building Trump's long-promised border wall.\nFederal agencies would begin closing if Congress can't enact legislation temporarily financing government by midnight Friday.\nHouse Republicans were meeting privately late Tuesday to discuss their plans.", "external_links": [], "published": "2018-01-17T01:25:00.000+02:00", "crawled": "2018-01-17T01:34:22.009+02:00", "highlightTitle": ""}