{"organizations": [], "uuid": "a4cb0c1a32d44a04c27cdad0c4b8103fc33e83af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226008184&w=1200&r=LYNXMPEE0R0D0", "site_section": "https://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "https://www.reuters.com/article/us-tennis-ausopen-men/federer-fights-off-cilic-to-win-sixth-australian-open-title-idUSKBN1FH0EY", "country": "US", "domain_rank": 408, "title": "Federer fights off Cilic to win sixth Australian Open title", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T19:49:00.000+02:00", "replies_count": 0, "uuid": "a4cb0c1a32d44a04c27cdad0c4b8103fc33e83af"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tennis-ausopen-men/federer-fights-off-cilic-to-win-sixth-australian-open-title-idUSKBN1FH0EY", "ord_in_thread": 0, "title": "Federer fights off Cilic to win sixth Australian Open title", "locations": [], "entities": {"persons": [{"name": "roger federer", "sentiment": "negative"}, {"name": "federer", "sentiment": "negative"}, {"name": "martyn herman", "sentiment": "none"}, {"name": "pritha sarkar", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "croatia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "marin cilic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 11:49 AM / Updated 3 hours ago Federer fights off Cilic to win sixth Australian Open Martyn Herman 4 Min Read \nMELBOURNE (Reuters) - Roger Federer survived a second set ‘freeze’ and an onslaught from Croatia’s Marin Cilic to claim a record-equaling sixth Australian Open title on Rod Laver Arena on Sunday. \nThe Swiss maestro wobbled at times in the face of some fierce resistance before winning 6-2 6-7(5) 6-3 3-6 6-1. \nWith the stadium roof closed to keep out the withering Melbourne heat, the 36-year-old grabbed the first set in 24 minutes as a 20th grand slam title looked a formality. \nBut Cilic, who suffered a nightmare in last year’s Wimbledon final against Federer when blisters wrecked his chances, was not going to let his first Australian Open final slide by. \nAt times it seemed he was taking on Federer and crowd but when he reeled off five consecutive games to extend the champion into a deciding set, the match hung in the balance. \nFederer recovered his mojo after saving two break points at the start of the fifth and was roared home to victory. \nDespite all his titles and accolades, Federer was overcome with emotion during his victory speech. FAIRYTALE CONTINUES \n“The fairytale continues for us, for me, it’s incredible,” Federer, who equaled Novak Djokovic and Roy Emerson’s Australian Open haul, said on court as wife Mirka and Australian great Rod Laver recorded to the moment with their mobile phones. \n”I got off to a flyer but I froze in the tiebreak and lost that second set and lost control of the match. \n“I got a bit lucky tonight I think.” \nAfter enduring a five-year grand slam drought that had many people writing him off, Federer has enjoyed a glorious renaissance over the past 12 months by winning three of the past five majors. \n“Getting number six here and number 20 overall, it’s just a very special moment,” he said. \nCilic, who will rise to a career-high three in the rankings, won four points in the first four games, but despite a shamelessly pro-Federer crowd, he stuck to his guns. Tennis - Australian Open - Men's singles final - Rod Laver Arena, Melbourne, Australia, January 28, 2018. Switzerland's Roger Federer celebrates with the trophy after winning the final against Croatia's Marin Cilic. REUTERS/Issei Kato \n“It was an amazing journey for me. It could have been the best two weeks of my life,” Cilic said. \n“I had the chance at the beginning of the fifth but he played a great match.” \nTemperatures in Melbourne had hovered in the high 30s Celsius all day but the humidity felt less suffocating than during Saturday’s humdinger of a women’s final. \nSo it was a surprise when the match started with the roof shut, a decision tournament organizers defended by issuing a statement saying “wet bulb globe temperature” readings had triggered the “extreme heat policy”. \nWhile Melbourne Park cooked, Federer was as cool as a cucumber in the relatively benign conditions on court. Slideshow (16 Images) \nHe broke in the first game when he hoisted a lob towards the roof and Cilic framed a smash into the net. \nThe 29-year-old Cilic dropped serve again two games later and gained sympathetic cheers when he finally registered on the scoreboard in the fifth game. \nCilic began to settle but still had to fend off break points in the second set at 1-1, 2-2 and 4-4. \nHe had a glorious chance to level the match against the run of play when Federer double-faulted at 30-30 in the 10th game, but he buried a routine backhand into the net. \nFederer began the tiebreak with a couple of aces and broke with a forehand but Cilic ratcheted up the power to move 6-4 ahead with thundering forehand and leveled the match with another beefy winner from his favorite wing. Related Coverage", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-28T19:49:00.000+02:00", "crawled": "2018-01-28T14:06:10.017+02:00", "highlightTitle": ""}