{"organizations": [], "uuid": "02be9ef5943fe2c39da4bd4fb889497edbdc8771", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226295601&w=1200&r=LYNXMPEE0S0W8", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-dr-pepper-snapp-m-a-keurig/dr-pepper-snapple-and-keurig-green-mountain-to-merge-idUKKBN1FI1IC", "country": "US", "domain_rank": 408, "title": "Dr Pepper Snapple and Keurig Green Mountain to merge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T14:54:00.000+02:00", "replies_count": 0, "uuid": "02be9ef5943fe2c39da4bd4fb889497edbdc8771"}, "author": "", "url": "https://uk.reuters.com/article/uk-dr-pepper-snapp-m-a-keurig/dr-pepper-snapple-and-keurig-green-mountain-to-merge-idUKKBN1FI1IC", "ord_in_thread": 0, "title": "Dr Pepper Snapple and Keurig Green Mountain to merge", "locations": [], "entities": {"persons": [{"name": "sangameswaran", "sentiment": "none"}, {"name": "savio d'souza", "sentiment": "none"}], "locations": [{"name": "keurig green mountain", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "dr pepper snapple", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "keurig green mountain inc", "sentiment": "none"}, {"name": "dr pepper snapple group inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "keurig dr pepper", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 44 PM / Updated 17 minutes ago Keurig coffee, Dr Pepper Snapple combine in $21 billion-plus deal Siddharth Cavale , Martinne Geller 4 Min Read \n(Reuters) - Keurig Green Mountain has struck a deal worth more than $21 billion (14.93 billion pounds)to combine with soda maker Dr Pepper Snapple Group Inc ( DPS.N ) to form a North American drinks company with brands like Green Mountain Coffee, 7UP, Snapple and Sunkist. \nThe latest in a five-year string of acquisitions by Keurig’s owner, JAB Holding Co, creates an enlarged group with a wide range of hot and cold beverages and different ways to access customers. \n“We have a really wide portfolio of brands, we’re able to address almost every consumer need in every format and ... to reach every point of sale,” Keurig Chief Executive Bob Gamgort told Reuters. \n“If you want to win in the beverage industry you need a portion of your portfolio that gives you significant scale and then you need to be able to layer in higher growth segments,” he said. \nKeurig will pay a special dividend of $103.75 per share to Dr Pepper Snapple shareholders, resulting in a cash payment of $18.7 billion. Those shareholders will also retain a 13 percent stake in the combined company to be called ‘Keurig Dr Pepper’. \nA 13 percent stake in Dr Pepper Snapple was worth more than $2.2 billion before the deal was announced. Dr Pepper’s shares were up 24 percent at $118.82 in New York. \n“From DPS’ perspective at this time it makes a lot of sense,” said Josh Blechman, director of capital markets at Exponential ETFs, which owns shares of Dr Pepper Snapple. “They needed to diversify their business line from sugary drinks, so I think that this is a really good deal.” \nThe companies expect $600 million in cost-savings, and see opportunities to expand the business such as by selling coffee in bottles and in vending machines. Slideshow (2 Images) DELIVERY OPTIONS \nJAB, the private holding company of the German Reimann family, took Keurig owner Green Mountain Coffee Roasters private in 2016, swallowed a part of Mondelez’s international coffee business a year earlier and has bought restaurant chains Krispy Kreme and Panera Bread Co. \nMondelez International ( MDLZ.O ), a major Keurig shareholder, will own about 13 percent of the combined company. \nKeurig CEO Gamgort and Chief Financial Officer Ozan Dokmecioglu will continue in the same roles at the combined company. \nThe companies said the deal would merge Dr Pepper Snapple’s direct-to-store delivery model, known as DSD, which services smaller stores, with Keurig’s strong relationships with online players and major supermarket and national chains. \nThe new company expects total net debt at closing, scheduled for the second quarter, to be about $16.6 billion. \nKeurig Green Mountain was taken private by a JAB-led investor group that included Mondelez for about $13.9 billion in 2016. That deal created a global coffee giant that set its sights to take on industry leader Nestle ( NESN.S ). \nGoldman Sachs was the lead financial adviser to Keurig and Credit Suisse advised Dr Pepper Snapple on the deal. Reporting by Siddharth Cavale and Sangameswaran S in Bengaluru; Editing by Patrick Graham and Bill Rigby", "external_links": [], "published": "2018-01-29T14:54:00.000+02:00", "crawled": "2018-01-29T15:09:54.001+02:00", "highlightTitle": ""}