{"organizations": [], "uuid": "19486a1e94a7c657bbbf03778fbb5f3a615513fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220681914&w=1200&r=LYNXMPEE0900M", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-china-aluminum/u-s-producers-seek-to-block-chinese-aluminum-shipped-via-vietnam-idUSKBN1EZ01E", "country": "US", "domain_rank": 408, "title": "U.S. producers seek to block Chinese aluminum shipped via Vietnam", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-10T08:46:00.000+02:00", "replies_count": 0, "uuid": "19486a1e94a7c657bbbf03778fbb5f3a615513fe"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-china-aluminum/u-s-producers-seek-to-block-chinese-aluminum-shipped-via-vietnam-idUSKBN1EZ01E", "ord_in_thread": 0, "title": "U.S. producers seek to block Chinese aluminum shipped via Vietnam", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "vietnam washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "zhongwang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "global vietnam aluminum co", "sentiment": "none"}, {"name": "aluminum extruders council", "sentiment": "none"}, {"name": "commerce department", "sentiment": "none"}, {"name": "china zhongwang holdings ltd", "sentiment": "none"}, {"name": "u.s. commerce department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. aluminum products makers sought new trade protections against Chinese imports on Tuesday, accusing China Zhongwang Holdings Ltd and its affiliates of evading U.S. anti-dumping and anti-subsidy duties by shipping aluminum products through Vietnam.\nIn a filing with the U.S. Commerce Department, the Aluminum Extruders Council said that aluminum extrusions from Zhongwang were being shipped to affiliate Global Vietnam Aluminum Co Ltd for conversion work before being exported to the United States.\nDuties on Chinese extrusions are currently a combined 106 percent, according to the Commerce Department.\nIn response, Zhongwang told Reuters that the “allegations made are without grounds”.\nThe anti-circumvention petition follows a number of U.S. actions to raise barriers to Chinese aluminum, including Commerce Department preliminary duties on Chinese aluminum foil and a rare U.S. government-initiated investigation into imports of Chinese aluminum alloy sheet products.\nIt also comes as the administration of U.S. President Donald Trump is considering much broader global restrictions on aluminum imports on national security grounds.\nThe Commerce Department is due to issue recommendations to Trump from its “Section 232” investigation into aluminum imports on Jan 22. Recommendations from a similar probe into steel imports are due on Jan. 16, but it is not clear whether either report will immediately be made public.\nChina’s excess production capacity of both metals has emerged as a major trade irritant for the United States and Europe, prompting them to consider new steps to protect domestic industries and jobs from a flood of Chinese imports.\nIn the Vietnam petition, the Aluminum Extruders Council said it provided evidence that Zhongwang’s affiliate in Vietnam was changing the shape and form of Chinese extrusions in minor ways but claiming their origin as Vietnamese.\n“These blatant attempts to evade duties and flood the market with unfairly traded Chinese aluminum extrusions must be halted,” the trade group’s president, Jeff Henderson, said in a statement.\nIn June, the Commerce Department ordered that fabricated aluminum pallets imported from China should be subject to the U.S. duties after determining that they were part of a duty evasion scheme. The Aluminum Extruders Council argued that these products are being shipped through Vietnam with minor changes.\nThe Commerce Department has shown receptiveness to similar anti-circumvention cases in the steel sector. In December, the agency slapped steep duties on steel products from Vietnam that originated as Chinese made hot-rolled steel.\nReporting by David Lawder; additional reporting by Tom Daly in BEIJING; Editing by Lisa Shumaker and Richard Pullin\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T08:46:00.000+02:00", "crawled": "2018-01-10T02:52:33.004+02:00", "highlightTitle": ""}