{"organizations": [], "uuid": "910b78f16e78631ecb0c28a65aa12561d2ac2888", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-gulf-moves-little-egypt-rises-on-presidential-election-date-idUSL8N1P41FT", "country": "US", "domain_rank": 408, "title": "MIDEAST STOCKS-Gulf moves little, Egypt rises on presidential election date", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:58:00.000+02:00", "replies_count": 0, "uuid": "910b78f16e78631ecb0c28a65aa12561d2ac2888"}, "author": "", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-gulf-moves-little-egypt-rises-on-presidential-election-date-idUSL8N1P41FT", "ord_in_thread": 0, "title": "MIDEAST STOCKS-Gulf moves little, Egypt rises on presidential election date", "locations": [], "entities": {"persons": [{"name": "andrew torchia", "sentiment": "none"}, {"name": "sisi", "sentiment": "none"}], "locations": [{"name": "egypt", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "air arabia", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "aamal co", "sentiment": "none"}, {"name": "doha bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "el sewedy electric co", "sentiment": "none"}, {"name": "dubai islamic bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 2:00 PM / Updated 30 minutes ago MIDEAST STOCKS-Gulf moves little, Egypt rises on presidential election date Reuters Staff \n* Qatar slows after surge on dividend-hunting \n* Aamal Co rises on industrial plans \n* PetroRabigh surges again in Saudi Arabia \n* Dubai’s Air Arabia, Dubai Islamic Bank strong \n* Egypt market anticipates Sisi win in March 26-28 poll \nBy Andrew Torchia \nDUBAI, Jan 9 (Reuters) - Gulf stock markets were mostly sluggish on Tuesday as Qatar slowed after surging for two days, but Egypt’s bourse rose after authorities announced a date for presidential elections. \nThe Qatari stock index closed 0.3 percent higher, well off early lows, as trading volume shrank by nearly a third. The index had gained 2.6 percent on Monday as investors positioned for annual dividend announcements in a few weeks. \nSome of the best performers of the past two days pulled back, with Doha Bank losing 1.5 percent. \nBut Aamal Co rose 2.4 percent after announcing plans for an affiliate which it owns 50-50 with Egypt’s El Sewedy Electric Co to build three factories to produce copper wires, aluminium bars and drums for cables -- the country’s first such factories. \nIn Saudi Arabia, the index fell 0.3 percent as petrochemical giant Saudi Basic Industries dropped 0.5 percent. But PetroRabigh gained a further 3.9 percent in the wake of the opening of facilities in its Phase II petrochemical complex. \nDubai’s index rose 0.4 percent as Air Arabia climbed 3.2 percent to its highest level since early February 2017, in its heaviest trade since mid-October. Dubai Islamic Bank rose 1.7 percent to its highest since August 2015. \nBut builder Drake & Scull dropped a further 3.5 percent on further profit-taking after big gains since November. \nAfter the close, Dubai Financial Market released a list of the first 19 stocks for which it will permit regulated short-selling. They include Air Arabia and Drake & Scull as well as blue chips such as Emaar Properties. \nIn Egypt, the index gained 1.4 percent to a record high in its heaviest trade since November after the presidential elections were scheduled for March 26-28. \nIncumbent Abdel Fattah al-Sisi has yet to announce his candidacy but is widely expected to run and win, which could extend a period of relative political stability and provide more time for Egypt’s economic reforms to bear fruit. HIGHLIGHTS \n* The index fell 0.3 percent to 7,291 points. DUBAI \n* The index rose 0.4 percent to 3,505 points. ABU DHABI \n* The index was flat at 4,586 points. QATAR \n* The index rose 0.3 percent to 9,002 points. EGYPT \n* The index gained 1.4 percent to 15,159 points. KUWAIT \n* The index rose 0.3 percent to 6,519 points. BAHRAIN \n* The index fell 0.4 percent to 1,315 points. OMAN", "external_links": [], "published": "2018-01-09T15:58:00.000+02:00", "crawled": "2018-01-09T16:35:49.012+02:00", "highlightTitle": ""}