{"organizations": [], "uuid": "1551da447d0b8e3caecb4400184435ef5f76f91c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220195974&w=1200&r=LYNXMPEE070DC", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-novo-nordisk-m-a-ablynx/denmarks-novo-nordisk-offers-3-1-billion-for-belgian-biotech-group-ablynx-idUKKBN1EX0HT", "country": "US", "domain_rank": 408, "title": "Denmark's Novo Nordisk offers $3.1 billion for Belgian biotech group Ablynx", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T09:31:00.000+02:00", "replies_count": 0, "uuid": "1551da447d0b8e3caecb4400184435ef5f76f91c"}, "author": "", "url": "https://uk.reuters.com/article/uk-novo-nordisk-m-a-ablynx/denmarks-novo-nordisk-offers-3-1-billion-for-belgian-biotech-group-ablynx-idUKKBN1EX0HT", "ord_in_thread": 0, "title": "Denmark's Novo Nordisk offers $3.1 billion for Belgian biotech group Ablynx", "locations": [], "entities": {"persons": [], "locations": [{"name": "denmark", "sentiment": "none"}, {"name": "copenhagen", "sentiment": "none"}, {"name": "bagsvaerd", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "novo nordisk", "sentiment": "negative"}, {"name": "sabroe", "sentiment": "none"}, {"name": "reuters  ablynx", "sentiment": "none"}, {"name": "ablynx", "sentiment": "none"}, {"name": "ablynx reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 7:14 AM / Updated 36 minutes ago Ablynx shares soar after rejects Novo Nordisk's $3.1 billion bid Jacob Gronholt-Pedersen , Robert-Jan Bartunek 6 Min Read \nCOPENHAGEN/BRUSSELS (Reuters) - Denmark’s Novo Nordisk ( NOVOb.CO ), the world’s biggest insulin maker, went public with a 2.6 billion euro (2.30 billion pounds) bid for Belgian biotech group Ablynx ( ABLX.BR ) on Monday as it seeks a new source of growth by bolstering its treatments for rare blood disorders. Novo Nordisk logo is seen in Bagsvaerd outside of Copenhagen, Denmark February 1, 2017. Scanpix Denmark/Liselotte Sabroe via REUTERS \nAblynx rejected Novo’s latest takeover approach and analysts predict the Danish group, whose new chief executive is trying to expand by buying drugs developed by competitors, might face counterbidders and would need to raise its bid. \nAblynx shares jumped 45 percent to 30.80 euros by 1520 GMT as trading resumed on Monday after the stock was initially suspended by Belgium’s market regulator. \nNovo has offered up to 30.50 euros per share for Ablynx, which represents a 60 percent premium to the Belgian company’s Dec. 6 share price, before its first approach. \nThe approach comes at a time of renewed interest by large drugmakers in smaller biotech firms, with U.S.-based Celgene ( CELG.O ) clinching a deal to buy Impact Biomedicines for up to $7 billion on Sunday and Japan’s Takeda Pharmaceutical ( 4502.T ) agreeing last week to buy another Belgian biotech group TiGenix ( G9U.BR ) for $630 million. \nAblynx said in a statement that its board “unanimously concluded that the proposal fundamentally undervalues Ablynx and its strong prospects for continued growth and value creation”. \nThe Belgian group specialises in the research of novel drugs based on nano-bodies found in the immune systems of llamas and alpacas, for which it partners with several of the world’s largest pharmaceutical companies. \nThe main attraction for Novo is Ablynx’s experimental drug caplacizumab for the rare bleeding disorder acquired thrombotic thrombocytopenic purpura, which would complement Novo’s line-up of blood products focused on haemophilia. \nThe $11 billion haemophilia market is facing upheaval and Novo stands to lose sales following approval of a new Roche ( ROG.S ) drug Hemlibra. \nBiopharmaceutical treatments, led by haemophilia, make up around 20 percent of Novo’s sales, with diabetes and obesity products accounting for the remaining 80 percent. \n“We have solid growth in our diabetes and obesity business but we are struggling a little bit to maintain the same level of growth momentum in biopharma,” Novo’s Chief Financial Officer Jesper Brandgaard said. NEW NOVO CEO ACTS \nThe Danish company said it would pay 28.00 euros per share in cash for Ablynx and an additional 2.50 euros in a so-called contingent value right (CVR) if certain conditions related to other drugs in Ablynx’s research portfolio were met. \nAn acquisition would be the first by Novo Nordisk CEO Lars Fruergaard Jorgensen, who took over a year ago. He has said the firm needs external innovation to broaden its product line-up. \nUnder previous chief executive Lars Rebien Sorensen, Novo sat out a spate of deal-making across the drugs industry and instead focused on its market-leading position making insulin and other diabetes treatments. FILE PHOTO: The logo of Danish multinational pharmaceutical company Novo Nordisk is pictured on the facade of a production plant in Chartres, north-central France, April 21, 2016. REUTERS/Guillaume Souvant/Pool/File Photo \nBut in March, the company approached Global Blood Therapeutics ( GBT.O ), a U.S. biotech company focused on serious blood disorders, to discuss a potential takeover, people familiar with the situation said. \nFinance chief Brandgaard said the current bid could be revised if Ablynx agreed to engage in talks. \n“I think it would be natural to update the bid following a detailed discussion with the board of directors of Ablynx,” he said on a conference call, adding that it would be premature to speculate on any increase. \nBrandgaard also played down the threat of an interloper, saying: “In terms of counter proposals it is not our understanding that any other bidder is pursuing the target.” \nBELGIUM‘S THRIVING BIOTECH SCENE \nAblynx had already rejected an offer by the Danish group on Dec. 14 and Novo Nordisk said the new bid, made on Dec. 22, was some 14 percent higher. \n(Graphic for Ablynx share price, click reut.rs/2CDOfaI ) \n“Novo Nordisk regrets that the board of directors of Ablynx has so far declined to engage in any discussions, despite the proposals which have been put forward,” it said in a statement. \nAnalysts at Jefferies said they had a fair value of Ablynx at 29 euros per share, rising to 36 euros under a long term upside scenario. \n“We envisage Novo needing to hike the offer and could see counterbids,” the analysts said. \nTax breaks and other incentives have created a thriving biotech industry in Belgium, with many companies spun off from university projects now listed on its stock exchange. \nAblynx’s shares have almost doubled in price in the past 12 months, buoyed by successful clinical trial data. \nIts products, which are all still undergoing medical trials, target many different diseases such as rheumatoid arthritis, psoriasis or cancer. \nEvercore is advising Novo, while JP Morgan is working for Ablynx. Additional reporting by Stine Jacobsen in Copenhagen, Ben Hirschler in London and Abinaya Vijayaraghavan in Bengaluru; Editing by Edmund Blair/Keith Weir/Alexander Smith", "external_links": [], "published": "2018-01-08T09:31:00.000+02:00", "crawled": "2018-01-08T10:15:25.003+02:00", "highlightTitle": ""}