{"organizations": [], "uuid": "74eca3018a379c79416ccdd8676c0993b1a45c14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-firm-as-dollar-sinks-further-idUSL4N1PJ0M2", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold firm as dollar sinks further", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T09:12:00.000+02:00", "replies_count": 0, "uuid": "74eca3018a379c79416ccdd8676c0993b1a45c14"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-firm-as-dollar-sinks-further-idUSL4N1PJ0M2", "ord_in_thread": 0, "title": "PRECIOUS-Gold firm as dollar sinks further", "locations": [], "entities": {"persons": [{"name": "jerome powell", "sentiment": "none"}, {"name": "janet yellen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 24 (Reuters) - Gold prices held steady early Wednesday, drifting around four-month highs hit last week, as the U.S. dollar fell to fresh three-year lows. FUNDAMENTALS * Spot gold was nearly unchanged at $1,340.63 per ounce at 0100 GMT. * U.S. gold futures for February delivery rose 0.3 percent to $1,340.20 per ounce. * Asian shares scaled record peaks as strong corporate earnings and optimism on global growth outweighed concerns over trade tensions. * The dollar extended recent weakness against a basket of major currencies to hit a fresh three-year low on Tuesday, after the euro surged on consumer confidence data indicating strong momentum in the region's economy. * The U.S. Senate on Tuesday confirmed Federal Reserve Governor Jerome Powell as the next head of the central bank, succeeding Janet Yellen, a move likely to provide continuity in U.S. monetary policy with the economy growing now for nine years straight. * The Bank of Japan kept monetary settings unchanged as expected on Tuesday and its chief hosed down market speculation of a shift away from ultra-easy policy later this year as inflation remained stubbornly shy of the central bank's target. * U.S. Treasury debt yields weakened on Tuesday in quiet trading, moving in tandem with Japanese government bond yields, after the Bank of Japan kept interest rate targets unchanged and its top official quashed speculation of a move away from an easy monetary policy. * North Korea said on Tuesday it had a \"powerful and reliable\" nuclear deterrent to thwart any attack and accused the United States of deploying military assets nearby under the pretext of ensuring security at the Pyeongchang Winter Olympics. * The World Gold Council (WGC) is studying the creation of a global standard for gold kilobars so they can be deployed as collateral in futures markets and potentially encourage demand, sources close to the matter said. * The U.S. economy is likely to grow in 2018 at its fastest pace in three years, fuelled by the biggest tax overhaul since the 1980s, a majority of economists said in a Reuters poll that also showed they expected the boost to be short-lived. DATA AHEAD (GMT) 0800 France Markit manufacturing flash PMI Jan 0830 Germany Markit manufacturing flash PMI Jan 0900 Euro zone Markit manufacturing flash PMI Jan 1400 U.S. Monthly home price index Nov 1445 U.S. Markit manufacturing flash PMI Jan 1500 U.S. Existing home sales Dec (Reporting by Nithin Prasad in Bengaluru; editing by Richard Pullin)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T09:12:00.000+02:00", "crawled": "2018-01-24T15:22:43.000+02:00", "highlightTitle": ""}