{"organizations": [], "uuid": "d22d4a69ca068fcd5a95e74fee7abbfba7679306", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223151984&w=1200&r=LYNXMPEE0H21T", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-filmfestival-sundance/buyers-jockey-for-indie-films-at-sundance-without-weinstein-idUSKBN1F7351", "country": "US", "domain_rank": 408, "title": "Buyers jockey for indie films at Sundance without Weinstein", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:44:00.000+02:00", "replies_count": 0, "uuid": "d22d4a69ca068fcd5a95e74fee7abbfba7679306"}, "author": "", "url": "https://www.reuters.com/article/us-filmfestival-sundance/buyers-jockey-for-indie-films-at-sundance-without-weinstein-idUSKBN1F7351", "ord_in_thread": 0, "title": "Buyers jockey for indie films at Sundance without Weinstein", "locations": [], "entities": {"persons": [{"name": "weinstein", "sentiment": "none"}, {"name": "ian bricke", "sentiment": "none"}, {"name": "harvey weinstein", "sentiment": "none"}, {"name": "weinstein piya sinha-roy", "sentiment": "none"}, {"name": "lisa richwine", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "park city", "sentiment": "none"}, {"name": "park city", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "sundance", "sentiment": "none"}, {"name": "netflix inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 9:56 PM / Updated 17 hours ago Buyers jockey for indie films at Sundance without Weinstein Piya Sinha-Roy , Lisa Richwine 5 Min Read \nPARK CITY, Utah / LOS ANGELES (Reuters) - For the first time in three decades, producer Harvey Weinstein will not be trudging down Park City’s snowy Main Street when the Sundance Film Festival opens Thursday, leaving the independent movie festival marketplace without its most-watched tastemaker. \nHis absence will be filled by streaming services, upstart studios and veteran production houses scrambling to buy the most buzzed-about films at the festival in an industry undergoing dramatic change. \n“Some of the old guard, the usual suspects at Sundance, have stepped aside or have fallen back a bit,” said Ian Bricke, director of content acquisition for Netflix Inc ( NFLX.O ). \n“There’s a whole range of new players,” he added. “It creates excitement and some degree of chaos in the marketplace.” \nWeinstein was an unmissable presence in previous years, at times loudly negotiating deals in the foyers of theaters just after movie premieres. The producer built a career on finding awards-worthy gems at Sundance. Competitors watched his picks closely, often launching bidding wars and driving up prices. \nThis year, Weinstein is out of the mix, fired as chief executive of the Weinstein Co after more than 70 women accused him of sexual harassment or assault, allegations that spanned three decades. He has denied having non-consensual sex with anyone. \nSundance, founded by Robert Redford’s Sundance Institute and now in its 33rd year, has become the independent film industry’s premiere U.S. gathering. \nEvolving movie-watching habits have brought new buyers in recent years, with Netflix and Amazon.com Inc ( AMZN.O ) leading the march of digital outlets to Sundance. \nThe streaming services had started to outbid Weinstein Co for standout films. Filmmakers prospered as Amazon paid $12 million for “The Big Sick” and Netflix paid $12.5 million for “Mudbound” in 2017. \nThis year, it was unclear whether those outlets will replace Weinstein as the pacesetters. FILE PHOTO: Kevin Kane prepares the stage at an opening day news conference for the Sundance Film Festival in Park City, Utah, U.S. January 22, 2015. REUTERS/Jim Urquhart/File Photo \nAmazon plans to shift some resources from independent films to projects with more commercial potential, sources told Reuters. Netflix also is investing in bigger-budget movies, although Bricke said it remained interested in independent films. \nThe traditional studio stalwarts owned by media giants, such as Fox Searchlight ( FOXA.O ), Sony Pictures Classics ( 6758.T ) and Focus Features ( CMCSA.O ), all will be on the hunt at Sundance, with competition from newer independent studios such as The Orchard and A24, distributor of last year‘s Oscar-winning “Moonlight.” CHANGING THE DISTRIBUTION CONVERSATION \nTechnology companies Hulu, Alphabet Inc’s ( GOOGL.O ) YouTube and Apple Inc ( AAPL.O ) also will be searching for hits. \nWith so many options, filmmakers will consider more than just the size of the check because digital players offer different ways to get films in front of audiences. Netflix focuses on streaming movies simultaneously to members in more than 190 countries with only limited theatrical runs. \n“Netflix has completely changed the conversation and the way we think about distribution,” said Hannah Fidell, co-writer and director of “The Long Dumb Road,” debuting at Sundance this year. “It requires knowing what you want out of the movie before the sale.” \nAnticipated films at Sundance this year include Thursday’s opening night feature “Blindspotting,” about a pair of Oakland men navigating their changing friendship; actor Paul Dano’s directorial debut “Wildlife” starring Carey Mulligan and Jake Gyllenhaal; and music documentary “Matangi/Maya/M.I.A.” \nIndependent films will remain a key part Netflix’s slate of 80 original films this year, Bricke said. The company will look for possible acquisitions at Sundance as well as new talent to work with. \nAmazon has set up its own distribution arm to debut movies in theaters. It also offered to pay up to $200,000 plus royalties per stream to all filmmakers with movies in competition at Sundance this year, to acquire content for an exclusive period for its online library. \nYouTube also will look for possible additions to its programming lineup and will consider a variety of distribution options, said Susanne Daniels, YouTube’s global head of original programming. That could include limited or full theatrical runs, or sales through video-on demand, she said. “We are open to a lot of different models,” Daniels said. Reporting by Piya Sinha-Roy and Lisa Richwine; Editing by David Gregorio", "external_links": [], "published": "2018-01-18T23:44:00.000+02:00", "crawled": "2018-01-19T00:02:57.014+02:00", "highlightTitle": ""}