{"organizations": [], "uuid": "24156ec34ca1db4714078b0f4e2cc1dd019181f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-904310702.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/china-oil-spill/", "country": "US", "domain_rank": 1196, "title": "What The China Oil Spill Means For Your Next Seafood Dinner | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.667, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "24156ec34ca1db4714078b0f4e2cc1dd019181f0"}, "author": "Grace Donnelly", "url": "http://fortune.com/2018/01/18/china-oil-spill/", "ord_in_thread": 0, "title": "What The China Oil Spill Means For Your Next Seafood Dinner | Fortune", "locations": [], "entities": {"persons": [{"name": "jessica meeuwig", "sentiment": "none"}, {"name": "grace donnelly", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "hong kong-registered", "sentiment": "none"}], "organizations": [{"name": "china oil spill means for seafood rescuers", "sentiment": "negative"}, {"name": "china oil spill", "sentiment": "negative"}, {"name": "cnn", "sentiment": "none"}, {"name": "university of western australia", "sentiment": "none"}, {"name": "xinhua news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil What The China Oil Spill Means For Seafood Rescuers spray foam to extinguish flames on the stricken oil tanker SANCHI off the coast of east China's Shanghai, Jan. 12, 2018. Xinhua News Agency/Getty Images By Grace Donnelly January 18, 2018 \nAn oil spill off the coast of China could impact meals across the country along with Japan and South Korea. \nExperts warn that millions of fish are likely to have been contaminated by carcinogens after an Iranian oil tanker carrying 136,000 tons, about one million barrels, of light oil collided with a Hong Kong-registered cargo ship off the coast of China on Jan. 6. \nMuch of the oil will evaporate or burn, but scientists warn that populations of mackerel, croaker, cuttlefish, herring, shrimp, and crabs closer to the sunken wreckage where oil may still be leaking could be poisoned . \n“The critical thing is to understand that when we put hydrocarbons into the oceans through events like this, it’s going to affect a wide range of animals,” Jessica Meeuwig, a professor of biological sciences at the University of Western Australia told CNN . \nAll 32 members of the Sanchi oil tanker’s crew were presumed dead when the vessel burst into flames and sank eight days later. Now the oil spilled in the collision, an ultra light type of crude oil used to make products like jet fuel, has spread to cover 39 square miles (101 square km), or roughly the size of Paris , of the East China Sea. \n— Cmcc (@CmccClimate) January 17, 2018 \nThe oil spill has split into four separate slicks and doubled in size since the tanker sank on Sunday, according to figures reported by the Chinese State Oceanic Administration on Wednesday. \nIt’s difficult to gauge the severity of the pollution to the environment due to the properties of the condensate oil that’s been spilled. Unlike thick black oil slicks commonly associated with environmental disasters, like BP’s oil spill in 2010 or the Exxon Valdez spill in 1989 , this type of oil is colorless, partially soluble in water, and only liquid under certain conditions . This makes it more difficult to both detect and remove from the ocean. Oil spill from the submerged Iranian oil tanker off East China coast is expanding, and will spread northward due to wind and sea currents, a statement from China’s State Oceanic Administration warns on Monday (Photo via Xinhua) pic.twitter.com/7kF0Elo1wq \n— CGTN (@CGTNOfficial) January 16, 2018 \n“Until there is a clear steer on monitoring, I wouldn’t touch any fish that might have passed through this area because it might be contaminated,” Simon Boxall of the University of Southampton told the Guardian . “China and Japan need to sit down together, recognize they have a problem and put public safety first.” \nChina’s State Oceanic Administration found that five of the 19 spill sites where they collected samples had petroleum levels that exceeded standards, according to the Wednesday report. \n“We still need to keep an eye on how these contaminants might be carried by the ocean flow to have the impact on the fishing ground,” said Meeuwig. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-19T19:53:12.011+02:00", "highlightTitle": ""}