{"organizations": [], "uuid": "29126c9dadb124564d2aaa2bfdc64f8aaa2b8929", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-iradimed-corporation-to-hold-2017-fourth-quarter-financial-results-conference-call-on-february-6th.html", "country": "US", "domain_rank": 767, "title": "IRADIMED CORPORATION to Hold 2017 Fourth Quarter Financial Results Conference Call on February 6th", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-26T15:00:00.000+02:00", "replies_count": 0, "uuid": "29126c9dadb124564d2aaa2bfdc64f8aaa2b8929"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-iradimed-corporation-to-hold-2017-fourth-quarter-financial-results-conference-call-on-february-6th.html", "ord_in_thread": 0, "title": "IRADIMED CORPORATION to Hold 2017 Fourth Quarter Financial Results Conference Call on February 6th", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WINTER SPRINGS, Fla., Jan. 26, 2018 (GLOBE NEWSWIRE) -- IRADIMED CORPORATION (NASDAQ:IRMD) announced today that the Company will release its 2017 fourth quarter financial results before the market opens on Tuesday, February 6 th . IRADIMED management will host a conference call the same day beginning at 11:00 a.m. Eastern Time to discuss those results and to answer questions.\nIndividuals interested in listening to the conference call may do so by dialing 1-844-413-1781 for domestic callers, or 1-716-247-5767 for international callers, and entering reservation code 5097406.\nThe conference call will also be available real-time via the Internet at http://www.iradimed.com/en-us/investors/events/ . A recording of the call will be available on the Company’s website for 90 days following completion of the call.\nAbout IRADIMED CORPORATION\nIRADIMED CORPORATION is a leader in the development of innovative magnetic resonance imaging (MRI) compatible medical devices. We are the only known provider of non-magnetic intravenous (IV) infusion pump system that is specifically designed to be safe for use during MRI procedures. We were the first to develop an infusion delivery system that largely eliminates many of the dangers and problems present during MRI procedures. Standard infusion pumps contain magnetic and electronic components which can create radio frequency interference and are dangerous to operate in the presence of the powerful magnet that drives an MRI system. Our patented MRidium® MRI compatible IV infusion pump system has been designed with a non-magnetic ultrasonic motor, uniquely-designed non-ferrous parts and other special features in order to safely and predictably deliver anesthesia and other IV fluids during various MRI procedures. Our pump solution provides a seamless approach that enables accurate, safe and dependable fluid delivery before, during and after an MRI scan, which is important to critically-ill patients who cannot be removed from their vital medications, and children and infants who must generally be sedated in order to remain immobile during an MRI scan.\nOur 3880 MRI compatible patient vital signs monitoring system has been designed with non-magnetic components and other special features in order to safely and accurately monitor a patient’s vital signs during various MRI procedures. The IRADIMED 3880 system operates dependably in magnetic fields up to 30,000 gauss, which means it can operate virtually anywhere in the MRI scanner room. The IRADIMED 3880 has a compact, lightweight design allowing it to travel with the patient from their critical care unit, to the MRI and back, resulting in increased patient safety through uninterrupted vital signs monitoring and decreasing the amount of time critically ill patients are away from critical care units. The features of the IRADIMED 3880 include: wireless ECG with dynamic gradient filtering; wireless SpO2 using Masimo® algorithms; non-magnetic respiratory CO2; non-invasive blood pressure; patient temperature, and; optional advanced multi-gas anesthetic agent unit featuring continuous Minimum Alveolar Concentration measurements. The IRADIMED 3880 MRI compatible patient vital signs monitoring system has an easy-to-use design and allows for the effective communication of patient vital signs information to clinicians.\nFor more information please visit www.iradimed.com .\nMedia Contact:\nChris Scott\nChief Financial Officer\nIRADIMED CORPORATION\n(407) 677-8022\nInvestorRelations@iradimed.com\nSource:iRadimed Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=cap0l-eLGPIWQK6RkFIjElo4pNGokRD8kk25r8wmKWwHSgFIa5hC02ENqSHxmtEbxXwcHWKAk6rHIRLQTXJE_A==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f353c867-559d-43a8-935c-ab497045e743", "http://www.iradimed.com/en-us/investors/events/", "https://www.globenewswire.com/Tracker?data=bWDTFRgODq656WY8Q66d-69DWtvC917VbDTcjcrkv9tFhzer7DP3Hvbgr2qmKfGPRP3IPH3wa6MtdJ4QOaeUvFdO6dbclSUUr3pNDfmCKjqDqctDkZc8VVBbJGho0jzQIqb6FH2jk4e5g5w0c7V4173Yeo-P635tJnXTtByldkE=", "https://www.globenewswire.com/Tracker?data=cZswDfPMFPxxtkgr1M8nRO-P3CcaZyKmlw2to1VgTcetEpf_yhd9XCfopQz6RMxj5pku8XaRbZS9bIwpu994dw0uM9nfdkNpdMuCwdpZeFPB9ewaWQX5BSSVJk6QBXYs"], "published": "2018-01-26T15:00:00.000+02:00", "crawled": "2018-01-26T16:43:31.007+02:00", "highlightTitle": ""}