{"organizations": [], "uuid": "efcfe1c249d5e68673fbdcb3814723966406ec75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XA362_youtub_TOP_20180116171554.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/cmo-today-youtube-tightens-ad-rules-connected-tvs-frequency-cap-problem-mcdonalds-sustainability-drive-1516193820", "country": "US", "domain_rank": 387, "title": "CMO Today: YouTube Tightens Ad Rules; Connected TV’s Frequency Cap Problem; McDonald’s Sustainability Drive", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.059, "site_type": "news", "published": "2018-01-17T15:57:00.000+02:00", "replies_count": 0, "uuid": "efcfe1c249d5e68673fbdcb3814723966406ec75"}, "author": "Lara O’Reilly", "url": "https://www.wsj.com/articles/cmo-today-youtube-tightens-ad-rules-connected-tvs-frequency-cap-problem-mcdonalds-sustainability-drive-1516193820", "ord_in_thread": 0, "title": "CMO Today: YouTube Tightens Ad Rules; Connected TV’s Frequency Cap Problem; McDonald’s Sustainability Drive", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "tostitos", "sentiment": "neutral"}, {"name": "mcdonald’s sustainability drive", "sentiment": "neutral"}, {"name": "google", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Good morning. Planning on hosting a Super Bowl party next month? Tostitos has just the ad for you. While the chip brand won’t be purchasing a big game TV spot, it’s getting in on the action early with a digital campaign that allows you to create your own ad to jazz up your Super Bowl party invites. Visitors to the “ My Super Bowl Ad ” website enter their party’s details, which are then incorporated into a video, complete with plenty of Super Bowl ad clichés. And yes, of course I checked: The marketing team at Tostitos have clearly learned from other brands’ social media campaign fails, as the website doesn’t seem to allow you to enter rude words (although this *is* the internet and where there’s a will, there’s a way.)\nCleanin’ Out My Closet After its brand safety brouhaha surfaced last year, YouTube promised to clean up the platform and rebuild trust with the marketing community. Its latest move: YouTube confirmed on Tuesday human reviewers will be required to vet every second of every video that appears on its Google Preferred curated bundle of popular channels, which marketers pay a premium to advertise on, WSJ reports. Meanwhile, YouTube is now requiring that channels looking to carry ads must have notched up 4,000 hours of watch time in the past 12 months and 1,000 subscribers. YouTube said while a “significant” number of channels will be affected, nearly all of those made less than $100 a year from ads. The announcement may assuage marketers’ brand safety concerns, but for some content creators, it’s a sign the hellfires of the “Adpocalypse” are spreading.\n–The Winter of Our Discontent–\nMight YouTube’s stricter monetization guidelines push some YouTubers to other platforms? And could the changes encourage some content creators to make more sensational—yet still family-friendly—videos in order to reach the required ad quotas? Will YouTube creators seek to do more direct sponsorships and product placement deals with brands? ( A good Twitter discussion examining those points here .)\nOn Repeat When people watch streaming services on connected TV platforms and apps, the commercial breaks can feel like Groundhog Day, as viewers are subjected to the same ad over and over again. AdExchanger takes a look at the connected TV frequency capping problem . Connected TV is a relatively new advertising channel, so supply can often outweigh demand. Another issue is the lack of a universal identifier that can track users as they switch between different on-demand TV services and streaming platforms. Not everyone in the ecosystem is willing to share their viewership data with each other, either. The tech to address some of these issues is currently being worked on. That might reduce the total number of connected TV impressions available in the market, but that’s surely a more desirable outcome than repeating ads that make viewers think their TV sets are on the blink.\nI’m Recyclin’ It Sustainability issues have shot up the priority list for brands as companies assess the positive impact changes to their products and manufacturing processes can have on the environment. Being perceived as a responsible corporate citizen is an important marketing KPI. On Tuesday, McDonald’s set out two sustainabiblity commitments : Recycling will be an option at all its restaurants and all its packaging will come from renewable, recycled materials or sources certified by environmental organizations by 2025, Reuters reported. “We have a responsibility to use our scale for good to make changes that will have a meaningful impact across the globe,” said Francesca DeBiase, McDonald’s chief supply chain and sustainability officer. (Early call for “meaningful” being the Marketing Word of 2018™, by the way.) Given McDonald’s scale, brand, and position among its competitor set (and because it’s patently the right thing to do), it’s likely similar commitments, perhaps with shorter timeframes, will be announced by other restaurant chains in the not-too-distant future.\nCulture Eats Strategy for Breakfast Who’d be a marketer, hey? Marketing Week’s annual career and salary survey found that while the majority of U.K. marketers it polled are definitely or very likely to stay in marketing roles for the next five years, many respondents are planning to ditch their current jobs . Marketers, particularly chief marketers, are notorious for having short tenures in their roles . So, what’s up? The top three reasons that marketers surveyed said they are considering a job switch aren’t too dissimilar from other professions: wanting more money; seeking a new challenge; and feeling the opportunities at their current companies are limited. Desires for a better workplace culture and better ways of working were also oft-cited grounds for giving a recruiter a call. Key Quote: from Pete Markey, marketing director at U.K. bank TSB: “The danger in some marketing departments is that they can become a bit machine-like. You’re put in a job and you end up being a cog in a machine of execution.”\nCorrection\nTiffany Haddish’s funny yarn on “Jimmy Kimmel Live!” about her Groupon outing with Jada Pinkett Smith and Will Smith was aired last year. Yesterday’s newsletter incorrectly stated that the appearance took place this year. Apologies for the error.\nBest of the rest Facebook’s big algorithm change could lead to publishers increasingly using traffic resellers to make up for the shortfall in referral traffic, which could expose them to more ad fraud... [ Digiday ]\n...But influencers could emerge as the winners from the news feed update as Facebook prioritizes user-generated content that sparks conversations between friends. [ Digiday ]\nStella Artois has released its Super Bowl ad. The spot stars Matt Damon and promotes its partnership with Water.org. [ Adweek ]\nApple and HBO are reportedly in the running for an as-yet-untitled J.J. Abrams “space-set” drama. [ Hollywood Reporter ]\nThe Awl and sister site The Hairpin are shutting down at the end of January. The Awl Network’s publisher Michael Macher said the closures were due in part to it getting harder to secure big advertising deals without increasing the size of its audience. [ CMO Today ]\nState attorneys general and a number of internet activist groups filed legal challenges to the Federal Communications Commission’s plan to dismantle net-neutrality regulations. [ WSJ ]\nAbout Us Follow us on Twitter: @wsjCMO , @larakiara , @VranicaWSJ , @alexbruell , @BenMullin , @srabil , @asharma\nSubscribe to our morning newsletter, delivered straight to your inbox, at http://on.wsj.com/CMOTodaySignup .\nWrite to Lara O’Reilly at lara.oreilly@wsj.com", "external_links": ["https://www.hollywoodreporter.com/live-feed/jj-abrams-shopping-tv-space-drama-script-1075163", "https://adexchanger.com/digital-tv/frequency-capping-far-solved-connected-tv/", "https://twitter.com/VranicaWSJ", "https://digiday.com/marketing/awesome-dynamic-influencer-marketing-gets-boost-facebook-changes/", "http://www.adweek.com/brand-marketing/stella-artois-teams-with-matt-damon-and-water-org-for-first-super-bowl-appearance-since-2011/", "https://twitter.com/larakiara", "https://www.marketingweek.com/2018/01/16/salary-survey-2018-why-marketers-want-to-leave-their-job/", "https://digiday.com/media/facebooks-feed-purge-expose-publishers-fraud/", "https://twitter.com/wsjCMO", "https://twitter.com/srabil", "https://twitter.com/alexbruell", "https://twitter.com/BenMullin", "https://twitter.com/problogger/status/953496058826448896", "https://twitter.com/asharma", "https://uk.reuters.com/article/us-mcdonalds-recycling/mcdonalds-sets-recycling-goals-for-packaging-restaurants-idUKKBN1F50VP"], "published": "2018-01-17T15:57:00.000+02:00", "crawled": "2018-01-18T01:41:47.004+02:00", "highlightTitle": ""}