{"organizations": [], "uuid": "bbfbe4d48025d6bab7e3fa5fc081d6c97a49d7dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220931493&w=1200&r=LYNXMPEE0915X", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-shareholders-breakingviews/breakingviews-wells-fargo-under-armour-may-attract-activists-idUSKBN1EZ25T", "country": "US", "domain_rank": 408, "title": "Breakingviews - Wells Fargo, Under Armour may attract activists", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T00:40:00.000+02:00", "replies_count": 0, "uuid": "bbfbe4d48025d6bab7e3fa5fc081d6c97a49d7dd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-shareholders-breakingviews/breakingviews-wells-fargo-under-armour-may-attract-activists-idUSKBN1EZ25T", "ord_in_thread": 0, "title": "Breakingviews - Wells Fargo, Under Armour may attract activists", "locations": [], "entities": {"persons": [{"name": "armour", "sentiment": "none"}, {"name": "nelson peltz", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "reuters breakingviews", "sentiment": "negative"}, {"name": "wells fargo", "sentiment": "negative"}, {"name": "procter & gamble", "sentiment": "none"}, {"name": "harley-davidson", "sentiment": "none"}, {"name": "trian management", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "lazard", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK Activist investors deployed a record $62 billion campaigning for corporate change in 2017, according to Lazard – more than double the amount a year earlier. They’ll still be at it this year, and among possible targets could be Wells Fargo and Under Armour, according to two informal Breakingviews polls on Tuesday.\nIn a webcast with over 1,000 participants and later during an on-stage interview with Trian Management founder Nelson Peltz – whose proxy fight with Procter & Gamble was one of the most high-profile campaigns of 2017 – audience members were asked which companies were most likely to attract activist attention. The names they had to choose from were Goldman Sachs, Under Armour, AT&T, Wells Fargo and Harley-Davidson.\nIn both surveys, the athletics brand and the California-based lender easily came out on top. Wells Fargo, with its nearly $2 trillion balance sheet, is still suffering from the fallout from the fake-accounts scandal which erupted in 2016. Internal investigations have brought other peccadilloes to light. And it’s the only giant U.S. bank whose retail-related revenue declined in the third quarter of 2017. Chief Executive Tim Sloan, a veteran of the company, still needs to prove he can turn things around.\nUnder Armour, meanwhile, was just about the worst investment in the S&P 500 Index in 2017. Its shares lost half their value as the market surged nearly 20 percent. That’s enough to ensure the company would show up in anyone’s screen for underperformance.\nFor Peltz, though, both would have drawbacks as targets. Trian isn’t interested, he told Breakingviews, in trying to understand big lenders’ balance sheets. He prefers companies where the income statement is the key to the business. This stretches to service-oriented financial firms like Bank of New York Mellon, but keeps the likes of Wells Fargo off his list.\nAs for Under Armour, it’s a company with three classes of stock which carry one, 10 and no votes per share. Going up against investors with supervoting stock is “too much of a disadvantage,” Peltz said. “One share one vote is what it really should be; anything other than that is just wrong.”\nOther activists may be willing to take on the challenge, though. Both Wells Fargo’s Sloan and Under Armour CEO and controlling shareholder Kevin Plank may need to watch their backs.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.reuters.tv/l/5xW", "https://www.breakingviews.com/trial"], "published": "2018-01-11T00:40:00.000+02:00", "crawled": "2018-01-11T03:44:44.024+02:00", "highlightTitle": ""}