{"organizations": [], "uuid": "aa38145614793c2fcf3577c9acf93462f3600651", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-invitae-more-than-doubles-annual-volume-exceeds-full-year-2017-guidance-and-projects-momentum-to-continue-in-2018.html", "country": "US", "domain_rank": 767, "title": "Invitae more than doubles annual volume, exceeds full-year 2017 guidance, and projects momentum to continue in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.499, "site_type": "news", "published": "2018-01-08T15:30:00.000+02:00", "replies_count": 0, "uuid": "aa38145614793c2fcf3577c9acf93462f3600651"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-invitae-more-than-doubles-annual-volume-exceeds-full-year-2017-guidance-and-projects-momentum-to-continue-in-2018.html", "ord_in_thread": 0, "title": "Invitae more than doubles annual volume, exceeds full-year 2017 guidance, and projects momentum to continue in 2018", "locations": [], "entities": {"persons": [{"name": "invitae", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "invitae corporation", "sentiment": "negative"}, {"name": "nvta", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "good start genetics", "sentiment": "none"}, {"name": "combimatrix", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 8, 2018 /PRNewswire/ -- Invitae Corporation (NYSE: NVTA), one of the fastest growing genetic information companies, announced preliminary full-year 2017 results that demonstrate continued strong momentum, with volume and revenue more than doubling compared to 2016 results. Preliminary financial results for 2017 include:\n127% year-over-year growth in volume for the base business, excluding acquisitions, to more than 134,000 samples accessioned compared to approximately 59,000 in 2016. The results exceeded the high end of the company's previously increased projected range of 120,000-130,000 samples. 136% growth in revenue in the base business to approximately $59 million, excluding acquisitions. Results were within the company's $55-$65 million revenue guidance. Including results from acquisitions, the company expects to report full-year 2017 accessioned volume totalling approximately 150,000 samples generating approximately $67 million in total revenue. Invitae's acquisition of Good Start Genetics closed in early August 2017, and its acquisition of CombiMatrix closed in mid-November 2017.\nFor 2018, the company announced it anticipates accessioning at least 250,000 samples and generating at least $120 million in revenue for the combined organization.\n\"Our business continued to accelerate rapidly throughout 2017, a pace which we expect to continue delivering in 2018 and beyond,\" said Sean George, chief executive officer of Invitae. \"The strength of our adult inherited genetics business and our newly acquired reproductive and family health genetics business positions us to launch an integrated platform in 2018 that supports the use of genetic information throughout mainstream medical care and across all stages of life.\"\nThe company will present at the 36th Annual J.P. Morgan Healthcare Conference on Wednesday, January 10, 2018 at 2:00 p.m. Pacific at The Westin St. Francis in San Francisco. A live, listen-only webcast of the presentation and breakout session can be accessed by visiting the events section of Invitae's website at ir.invitae.com .\nInvitae has not completed preparation of its financial statements for the fourth quarter or full year of 2017. The preliminary, unaudited results presented in this news release for the quarter and year ended Dec. 31, 2017 are based on current expectations and are subject to year-end closing adjustments. Actual results may differ.\nInvitae will report its full financial results and other metrics during its fourth quarter and year-end 2017 conference call in February.\nAbout Invitae\nInvitae Corporation's ( NYSE: NVTA ) mission is to bring comprehensive genetic information into mainstream medical practice to improve the quality of healthcare for billions of people. Specializing in genetic diagnostics in clinical areas across all stages of life, Invitae is aggregating the world's genetic tests into a single service with better quality, faster turnaround time, and lower prices. The company provides a variety of diagnostic tests with clinical utility in preimplantation and carrier screening for inherited disorders, miscarriage analysis, pediatric and developmental disorders, neurological disorders, cardiovascular disorders, metabolic disorders, and hereditary cancers. For more information, visit our website at invitae.com .\nSafe Harbor Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including the company's preliminary financial results for 2017, including volume and revenue; the company's expectation that it will exceed its guidance for 2017; the company's expectations regarding continued growth in 2018, including volume and revenue levels; the company's belief regarding the momentum of its business; and the company's ability to launch an integrated platform in 2018.. Forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially, and reported results should not be considered as an indication of future performance. These risks and uncertainties include, but are not limited to: the company's history of losses; the company's need to scale its infrastructure in advance of demand for its tests and to increase demand for its tests; the company's ability to compete; the company's ability to develop and commercialize new tests and expand into new markets; risks associated with the company's ability to use rapidly changing genetic data to interpret test results accurately, consistently, and quickly; the risk that the company may not obtain or maintain sufficient levels of reimbursement for its tests; the company's ability to successfully integrate acquired businesses; laws and regulations applicable to the company's business; and the other risks set forth in the company's filings with the Securities and Exchange Commission, including the risks set forth in the company's Quarterly Report on Form 10-Q for the quarter ended September 30, 2017. These forward-looking statements speak only as of the date hereof, and Invitae Corporation disclaims any obligation to update these forward-looking statements.\nContact:\nKate McNeil\nir@invitae.com\n347-204-4226\nView original content with multimedia: http://www.prnewswire.com/news-releases/invitae-more-than-doubles-annual-volume-exceeds-full-year-2017-guidance-and-projects-momentum-to-continue-in-2018-300578746.html\nSOURCE Invitae Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.invitae.com%2Fen%2F&esheet=51384701&newsitemid=20160720005410&lan=en-US&anchor=invitae.com&index=10&md5=5438ebf782d41ed9eef726e0442c0b97", "http://www.prnewswire.com/news-releases/invitae-more-than-doubles-annual-volume-exceeds-full-year-2017-guidance-and-projects-momentum-to-continue-in-2018-300578746.html", "https://www.invitae.com/en/", "https://ir.invitae.com/stock-info/quote-and-chart/default.aspx"], "published": "2018-01-08T15:30:00.000+02:00", "crawled": "2018-01-08T19:20:22.022+02:00", "highlightTitle": ""}