{"organizations": [], "uuid": "1efb201e6ad8a9fdb9da463efd5eba43f8378a29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 794, "shares": 794, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/diet-coke-portfolio-2-rendition-932-636.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/diet-coke-relaunch-sweetener-ingredient/", "country": "US", "domain_rank": 1196, "title": "New Diet Coke Flavors Will Include a New Ingredient, Sweetener | Fortune", "performance_score": 7, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.228, "site_type": "news", "published": "2018-01-10T02:00:00.000+02:00", "replies_count": 0, "uuid": "1efb201e6ad8a9fdb9da463efd5eba43f8378a29"}, "author": "Beth Kowitt", "url": "http://fortune.com/2018/01/10/diet-coke-relaunch-sweetener-ingredient/", "ord_in_thread": 0, "title": "New Diet Coke Flavors Will Include a New Ingredient, Sweetener | Fortune", "locations": [], "entities": {"persons": [{"name": "beth kowitt", "sentiment": "negative"}, {"name": "michael", "sentiment": "none"}], "locations": [], "organizations": [{"name": "coca-cola", "sentiment": "negative"}, {"name": "diet coke", "sentiment": "negative"}, {"name": "u.s. food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Beth Kowitt January 10, 2018 \nWhen Coca-Cola’s new Diet Coke flavors hit store shelves in mid-January, serious soda aficionados may notice a new ingredient on the product’s label—acesulfame potassium, or Ace-K. \nThe artificial sweetener will be included in Coca-Cola’s new Diet Coke in ginger lime, feisty cherry, twisted mango, and zesty blood orange varieties. The company’s relaunched regular Diet Coke, which will now be sold in a taller and skinnier can, will continue to be made with aspartame as the sole sweetener. \nAce-K, like aspartame, is what’s known as a high-intensity sweetener : It’s 200 times sweeter than sugar, meaning a very small amount is needed to reach the same level of sweetness as sucrose. The sweetener was discovered in the 1960s and is often paired with aspartame, especially in diet sodas. \nThe U.S. Food and Drug Administration approved the use of Ace-K in 1988 and says that more than 90 studies “support its safety.” Some critics, however, feel that not enough research has been conducted on the sweetener. “It’s a sleeper that no one pays attention to,” Michael Jacobson, president of the Center for Science in the Public Interest, told Fortune earlier this year. “I don’t think either side can say definitively it’s safe or dangerous.” \nCoca-Cola, however, has historically only used aspartame in Diet Coke, which gives the soda a very crisp taste, says Rafael Acevedo, Coca-Cola North America’s group director for the product. \nBut when the company decided to try these new flavors to target millennial consumers, the R&D team found that the product tasted a little bit sourer. The addition of the Ace-K was able to mask that sour flavor. “We wanted to make sure we maintain that crispness,” Acevedo tells Fortune. \nCoca-Cola already uses a blend of aspartame and Ace-K in Coke Zero Sugar, which is designed to taste more like regular Coke than Diet Coke. Acevedo, however, says that Ace-K and aspartame are blended together very differently in the two brands. “The final taste of the products are very different,” he says. \nThe relaunch of Diet Coke comes amid a period declining sales volumes as shoppers have increasingly eschewed artificial sweeteners—part of a bigger consumer trend away from processed fare to what they view as natural ingredients. Simultaneously, consumers are trying to cut back on their sugar intake. Research firm NPD Group has found that sugar is now the No. 1 substance they are trying to cut or eliminate from their diets. \nAs a result, companies have been on a quest to find the perfect natural sugar substitute . For example, Coca-Cola works with a company called Chromocell, which is working on enhancing the sweetness of sugar so formulators can use less of it to achieve the same taste. \nAcevedo, however, doesn’t believe that the inclusion of Ace-K on the label will be off-putting to millennials. “They are open to the category,” he says. “We feel very comfortable this sweetener mix is going to connect with them.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-10T02:00:00.000+02:00", "crawled": "2018-01-11T05:22:11.000+02:00", "highlightTitle": ""}