{"organizations": [], "uuid": "ecc0af311575899ee0a4539dbe8ec707fe1408b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225743404&w=1200&r=LYNXMPEE0Q09B", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/ireland-abortion/irish-prime-minister-says-he-will-campaign-for-liberalisation-of-abortion-laws-idINKBN1FG0D5", "country": "US", "domain_rank": 408, "title": "Irish Prime Minister says he will campaign for liberalisation of abortion laws", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T12:33:00.000+02:00", "replies_count": 0, "uuid": "ecc0af311575899ee0a4539dbe8ec707fe1408b4"}, "author": "", "url": "https://in.reuters.com/article/ireland-abortion/irish-prime-minister-says-he-will-campaign-for-liberalisation-of-abortion-laws-idINKBN1FG0D5", "ord_in_thread": 0, "title": "Irish Prime Minister says he will campaign for liberalisation of abortion laws", "locations": [], "entities": {"persons": [{"name": "gael", "sentiment": "none"}, {"name": "leo varadkar", "sentiment": "none"}, {"name": "varadkar", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}], "organizations": [{"name": "catholic", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Irish Prime Minister Leo Varadkar said on Saturday that he would campaign for a liberalisation of the country’s restrictive abortion laws ahead of a referendum in the coming months, adding that his views on the issue had evolved.\nVaradkar’s government plans to hold the referendum as soon as May to loosen some of the most restrictive abortion laws in the world. His Fine Gael party has agreed to let individual members campaign on either side of the debate.\nWhile the country remains overwhelmingly Catholic - a complete ban on abortion was only lifted in 2013 - public opinion has become far more socially liberal in recent years.\nVaradkar, a medical doctor by training, in 2014 described himself as pro-life, but also said that the rules in Ireland, where terminations are only allowed in cases where the mother’s life is in danger, were too tight.\n“I believe Ireland’s abortion laws are too restrictive and need to be liberalised,” Varadkar said in an interview with BBC radio on Saturday. “I’ll be campaigning for them to be changed.”\nMISUNDERSTOOD Asked about his previous position, Varadkar said that his views had evolved in recent years.\n“I think sometimes that pro-life and pro-choice can be misunderstood ... I think even people who are in favour of abortion in certain circumstances are pro-life,” he said.\n“These terms pro-life and pro-choice don’t really comprehend the complexity of this issue, which is a very private and personal one and one, I think, that contains a lot of grey areas.”\nIreland has yet to decide the exact wording of the referendum. A cross-party parliamentary committee last month recommended that the state legislate to allow terminations with no restrictions up to 12 weeks into a pregnancy, a more liberal position than some had anticipated.\nAn opinion poll on Friday found that a majority of Irish voters would support a proposal to allow abortion up to 12 weeks into a pregnancy, but that many older voters opposed the change.\nReporting by James Davey; Writing by Conor Humphries; Editing by Andrew Bolton\n ", "external_links": [], "published": "2018-01-27T12:33:00.000+02:00", "crawled": "2018-01-27T12:52:06.002+02:00", "highlightTitle": ""}