{"organizations": [], "uuid": "94f6cbd7706de3001574283218bc7be0230c5556", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 37}, "facebook": {"likes": 99, "shares": 99, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/target-store.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/09/target-holiday-sales/", "country": "US", "domain_rank": 1196, "title": "Target: Major Sales Surge During the Holiday Season | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.903, "site_type": "news", "published": "2018-01-09T10:28:00.000+02:00", "replies_count": 0, "uuid": "94f6cbd7706de3001574283218bc7be0230c5556"}, "author": "Phil Wahba", "url": "http://fortune.com/2018/01/09/target-holiday-sales/", "ord_in_thread": 0, "title": "Target: Major Sales Surge During the Holiday Season | Fortune", "locations": [], "entities": {"persons": [{"name": "j.c. penney", "sentiment": "none"}, {"name": "kohl", "sentiment": "none"}], "locations": [], "organizations": [{"name": "walmart", "sentiment": "none"}, {"name": "amazon.com", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8:28 AM EST \nTarget’s (tgt) $7 billion plan to fix its business paid off handsomely during the holiday season. \nThe discount chain said on Tuesday that comparable sales, a gauge that strips out the impact of new and recently closed stores, rose 3.4% in November and December , well above its own forecasts and Wall Street’s expectations. Target also lifted its full year profit forecast and said it expects sales growth to continue in the new fiscal year that starts in February. Crucially, Target continued to get more customers into its stores. \nThe news sent Target shares up 4% in premarket trading, continuing the tear they’ve been on since July. \nWhile Target is benefitting from a “rising tide lifting all boats” phenomenon that has seen many other chains, including Kohl’s (kss) and J.C. Penney (jcp) post good holiday numbers , the Christmas period results are providing some validation to Target’s expensive plan to improve stores, delivery logistics, and customer service to better fight Walmart (wmt) and Amazon.com (amzn) , among others. \nLast February, Target investors were spooked by the chain’s $7 billion multi-year project, which included plans to remodel hundreds of stores and continue the roll-out of its successful small format urban stores, as well as to speed up fixes to its supply chain. Wall Street’s mood was further soured in November, when the company gave a profit forecast below analyst projections. \nOn Tuesday, however Target forecast fourth-quarter adjusted earnings of $1.30 to $1.40 per share, compared with the previous forecast of $1.05 to $1.25. \nIn addition to remodels and pay hikes, Target made clear it would fight hard on price during the holidays, something that was evident in its seasonal campaigns, and also hired 100,000 temp workers for the period. While those likely pinched profits, they did drum up sales. \nBeyond that, Target continued to get a boost from the launch of new in-house brands, notably kids’ wear line Cat & Jack. And some 70% of online orders were filled at least partially by a store, something that speeds up delivery and makes more efficient use of store inventory—thus showing the importance of fully integrating stores and e-commerce. (Target recently bought delivery start-up Shipt to improve its same-day firepower.) \n“Our holiday season performance reflects meaningful investments in our team, increasing wages, staffing and training to deliver elevated service and expertise,” Target CEO Brian Cornell said in a blog post . \nFor 2018, Target expects comparable sales to again rise and will continue its investments. As previously announced, Target intends to open 30 more small-format stores of the kind its been rolling out in urban centers rather than its traditional suburban strongholds, and tripling the number of store remodels to 325 (out of 1,800) as it plans to have updated 1,000 stores by 2020. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T10:28:00.000+02:00", "crawled": "2018-01-09T16:59:25.001+02:00", "highlightTitle": ""}