{"organizations": [], "uuid": "a9a242423e5d41a2c71f888a56793410b086adff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 53, "shares": 53, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-163555748.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/donald-trump-lawyers-robert-mueller-interview/", "country": "US", "domain_rank": 1196, "title": "Retired FBI Agent: Why Trump’s Lawyers Don’t Want a Mueller Interview | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.779, "site_type": "news", "published": "2018-01-11T15:05:00.000+02:00", "replies_count": 0, "uuid": "a9a242423e5d41a2c71f888a56793410b086adff"}, "author": "James A. Gagliano", "url": "http://fortune.com/2018/01/10/donald-trump-lawyers-robert-mueller-interview/", "ord_in_thread": 0, "title": "Retired FBI Agent: Why Trump’s Lawyers Don’t Want a Mueller Interview | Fortune", "locations": [], "entities": {"persons": [{"name": "james a. gagliano", "sentiment": "negative"}, {"name": "robert mueller", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "frank figliuzzi", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "fbi", "sentiment": "negative"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By James A. Gagliano January 10, 2018 \nReports indicate that Robert Mueller, the special counsel leading the Russia collusion investigation, will soon formally notify the White House legal team of his intent to seek an interview with the president. And it’s no secret that legal advisers to Donald Trump are privately advocating for any talks to be limited in scope , obviating potential exposure for the president. \nSome, as former FBI assistant director for counterintelligence Frank Figliuzzi has mused, speculate that an in-person interview could be employed to “push some buttons.” The Trump legal team would predictably counter with a request to submit written answers to proffered questions—a typical ploy to ensure that hired legal minds craft infallible responses. \nBut if the president is innocent of collusion with the Russians to influence the 2016 election, as he has repeatedly and demonstratively proclaimed, why should an interview be of any concern? \nFrom the perspective of an experienced FBI investigator, someone familiar with these legal processes and chess-like maneuverings, I think Trump’s attorneys are acutely aware of this. And Mueller’s team has much to gain from the interview. If it is proven that Trump lies to the FBI or lies under oath, he can be criminally charged. He may also inadvertently provide additional leads to the investigative team, or assist the prosecution in shoring up potential “weak” portions of their case. He may also unwittingly provide details of a heretofore unforeseen crime, or implicate family members or associates in same. \nAs the investigation has mechanically churned forward to this point, many in the media have remained intractably fixated on the proceedings, confident that, right around the corner, the final and most damning piece of footwear is inevitably about to drop on 1600 Pennsylvania Avenue. \nBut, I share the view of a growing chorus of bipartisan legal experts who have begun to voice their consensus that we may have seen the best available hand already played by the special prosecutor. What we have so far is a criminal information filed against Trump’s short-lived campaign manager, Paul Manafort, and an associate, Rick Gates. The charges included allegations of conspiracy and money laundering, and were unrelated to the short time Manafort worked within the Trump campaign. \nThen there were the guilty pleas of one-time national security adviser Michael Flynn and peripheral campaign consultant, George Papadopoulos . Both pled guilty to lying to the FBI. \nSo, for those keeping score—no guilty pleas to an underlying scheme. That’s critically important. Manafort and Gates may be shady businessmen and guilty of a slew of loathsome white-collar criminal activities. But from what we know now, none of it was related to the president. Flynn and Papadopoulos only pled guilty to lying to FBI agents—not to an actual crime itself. \nIf there was collusion, I believe that Mueller would have had two of Trump’s highest-level inner-circle folks (Manafort and Flynn) plead guilty to something with more exposure. To what end would the special prosecutor plead out those closest to the president to unrelated crimes and process crimes (criminal conduct related to the investigation of a crime), which makes someone considerably less appealing to use as a witness down the road? Trial judges will then instruct juries that they may question the credibility of witness testimony from anyone who has already pled guilty to lying. \nSpeculation that Manafort and Papadopoulos are cooperating with the investigation may be accurate. But you typically plead guilty to a top charge. They didn’t. And there’s no evidence to indicate Mueller has yet detected one. \nBut Trump’s potential exposure goes beyond collusion. And even if his attorneys limit any line of questioning, this doesn’t preclude the special prosecutor from prying into Trump’s finances and digging into his real estate holdings—things that have nothing to do with the Russia case. \n\nCould it be conceivable that after Trump meets with the special prosecutor team, he may ultimately be charged with some form of obstruction of justice—as broadly defined as that statute can be—or maybe even a violation of tax laws related to business dealings from a bygone era? \nAbsolutely. But in my humble opinion, he won’t be indicted on charges related to conspiring with the Kremlin to tilt an election. \nIf Trump elects to talk to Mueller’s team, the best advice Trump’s attorneys could provide him would be, of course, to tell the truth. And then, he should demand to be treated in the exact same irregular manner as was Hillary Clinton during the 2015-2016 investigation into her private server by the FBI and the Obama administration’s DOJ. \nUltimately, that may prove to be his best “insurance policy.” \nJames A. Gagliano, a retired FBI Supervisory Special Agent, is a professor at St. John’s University and serves as a CNN Law Enforcement Analyst. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-11T15:05:00.000+02:00", "crawled": "2018-01-11T01:45:19.024+02:00", "highlightTitle": ""}