{"organizations": [], "uuid": "0ce70ec55dcd6a4bd9335f2aab4fab0a874495ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/26/the-associated-press-cost-of-crisis-at-tallest-us-dam-reaches-870m-in-california.html", "country": "US", "domain_rank": 767, "title": "Cost of crisis at tallest US dam reaches $870M in California", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T23:57:00.000+02:00", "replies_count": 0, "uuid": "0ce70ec55dcd6a4bd9335f2aab4fab0a874495ba"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/26/the-associated-press-cost-of-crisis-at-tallest-us-dam-reaches-870m-in-california.html", "ord_in_thread": 0, "title": "Cost of crisis at tallest US dam reaches $870M in California", "locations": [], "entities": {"persons": [{"name": "erin mellon", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "california san francisco", "sentiment": "none"}, {"name": "oroville dam", "sentiment": "none"}, {"name": "northern california", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "mellon", "sentiment": "none"}, {"name": "state department of water resources", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO (AP) — The costs of dealing with last year's near-disaster at the nation's tallest dam have reached $870 million, California officials said Friday.\nThe figure for emergency response and repairs following the crisis at Northern California's Oroville Dam should stand, said Erin Mellon, spokeswoman for the state Department of Water Resources. The total was pegged at $660 million in October.\nBoth spillways at the 770-foot (230-meter) earthen dam collapsed in February, forcing evacuation orders for nearly 200,000 people downstream. Officials feared massive, uncontrolled releases of water, but they did not materialize, and residents were allowed to return to their homes within days.\nA report by independent dam-safety experts blamed the crisis on state operators' and regulators' \"long-term systemic failure\" to recognize built-in design and construction flaws in the half-century-old dam.\nMellon says California still hopes federal emergency funds will cover three-fourths of the cost, which includes about a half-billion dollars the state is spending to repair and improve both spillways.\nFriday's jump in the overall price tag comes from expenses that include the removal of massive amounts of debris left by the torrents of water released from Oroville's reservoir during the crisis, Mellon said.\nOther new costs in the total include moving power lines connected to the dam's hydroelectric system and building access roads for repair crews.\nThe price tag does not include more than $1 billion in legal claims filed by property owners downstream, Mellon said.\nThe water behind Oroville Dam is part of a complex north-south delivery system that serves millions in central and Southern California. The state still intends for water contractors who draw supplies from that system to pay any emergency costs refused by the Federal Emergency Management Agency, Mellon said.\nConstruction crews had worked early morning to late night to make both damaged spillways operable again before California's winter rainy season started.\nThe Department of Water Resources has noted three flaws in the rush repair job so far, deputy director Ted Craddock said, and is evaluating the seriousness of the problems and how to handle them with a team of consulting dam experts.\nOfficials said problems in the new repairs include \"surface imperfections\" in three of the 234 concrete slabs laid so far to repair the 3,000-foot (900-meter) spillway, whose failure in February left deep canyons of rock and earth gouged through the concrete and surrounding hillside.\nDam operators said the kind of strong, searing winds that drove record-setting wildfires in California late last year had made the concrete set too fast.", "external_links": [], "published": "2018-01-26T23:57:00.000+02:00", "crawled": "2018-01-27T07:46:02.004+02:00", "highlightTitle": ""}