{"organizations": [], "uuid": "f5d375640215af0688a29d9f3b66a9b0940535a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1219936386&w=1200&r=LYNXMPEE06011", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-cricket-ashes/marsh-brothers-score-centuries-as-australia-pile-on-runs-idUKKBN1EW014", "country": "US", "domain_rank": 408, "title": "Marsh brothers score centuries as Australia pile on runs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T04:01:00.000+02:00", "replies_count": 0, "uuid": "f5d375640215af0688a29d9f3b66a9b0940535a0"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-ashes/marsh-brothers-score-centuries-as-australia-pile-on-runs-idUKKBN1EW014", "ord_in_thread": 0, "title": "Marsh brothers score centuries as Australia pile on runs", "locations": [], "entities": {"persons": [{"name": "marsh", "sentiment": "negative"}, {"name": "mitchell marsh", "sentiment": "none"}, {"name": "shaun", "sentiment": "none"}, {"name": "tom curran", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}, {"name": "shaun marsh", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "scg", "sentiment": "none"}, {"name": "min read  sydney", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 2:02 AM / Updated 12 hours ago Australia close on victory in Sydney test Nick Mulvenney 4 Min Read \nSYDNEY (Reuters) - Australia were closing on an innings victory with England fighting a desperate rearguard on 93 for four at stumps on the fourth day of the fifth Ashes test on Sunday, still 210 runs from forcing their hosts to bat again. Cricket - Ashes test match - Australia v England - SCG, Sydney, Australia, January 7, 2018. England's captain Joe Root reacts after Australia's Nathan Lyon appealed successfully for LBW to dimiss Dawid Malan during the fourth day of the fifth Ashes cricket test match. REUTERS/David Gray \nBrothers Shaun and Mitchell Marsh had earlier both scored centuries on a scorching morning at the Sydney Cricket Ground to put Australia in a position where they could declare on 649-7 in the second session. \nEngland, already 3-0 down in the series with the urn relinquished, had toiled in the field in temperatures in excess of 40 degrees Celsius with little success and their luck did not change when they came out to bat. \nOpeners Alastair Cook and Mark Stoneman went cheaply inside the first six overs of their second innings with James Vince (18) and Dawid Malan (five) following in the final session. \nSkipper Joe Root, who made an unbeaten 42 despite playing with an injured finger, and Jonny Bairstow (17 not out) will take England’s fight to save the test into the final day. \nThe Marsh brothers had earlier joined the Chappell siblings Ian and Greg (1972) and the Waugh twins Mark and Steve (2001) in scoring centuries in the same innings in an Ashes test. \nShaun Marsh made 156 from 291 balls before being run out by a Stoneman direct hit just after lunch, with Mitchell having departed for 101 on the delivery after securing his second century when Tom Curran took out his off stump. \nThe brothers both scored their second centuries of the series in a brilliant 169-run partnership that built on the mammoth 171 Usman Khawaja scored on Saturday. \nIt was a particularly sweet partnership given Shaun was a controversial selection for the series, his eighth recall to the test line-up being met with disbelief in some quarters, and Mitchell was only brought in for the third test in Perth. \nMitchell was the second to reach the milestone about an hour into the morning with two runs past point and Shaun was in such a hurry to congratulate his little brother that he almost ran him out. Cricket - Ashes test match - Australia v England - SCG, Sydney, Australia, January 7, 2018. Australia's Nathan Lyon celebrates after bowling England's Alastair Cook during the fourth day of the fifth Ashes cricket test match. REUTERS/David Gray \n“Emotions got the better of me and I wanted to give him a hug,” 34-year-old Shaun told reporters. \n“To be out there with Mitch, to both score our test centuries today for Australia, being out there and sharing each other’s emotions when we got to our hundreds, was an extremely happy moment. It’ll certainly be a day that we won’t forget.” \nShaun had started the day on 98 with Australia 479 for four and took just five balls to secure his sixth test century by crunching Moeen Ali through the covers for one of the 18 fours he scored in his 403-minute knock. Slideshow (3 Images) \nWhile Australia flourished with the bat, England continued to struggle. \nCook did become the sixth batsman to score 12,000 runs in tests but the ovation had barely been completed before Stoneman was dismissed for a duck by pace spearhead Mitchell Starc, the batsman reviewing the lbw decision to no avail. \nFormer skipper Cook was dismissed for 10 rocking back in his crease to a superb delivery from spinner Nathan Lyon that removed the bail from his off stump. \nVince enjoyed a rare England success with the DRS to reverse a caught behind verdict on 15 but he made just three more runs before offering up another poor shot to a Pat Cummins delivery which caught a nick which Steve Smith juggled to take at slip. \nRoot needed lengthy treatment on his right index finger after taking a rap on the digit from a Starc delivery before Malan was trapped lbw on his back foot by Lyon for five, the review system again failing England. \n“In many ways the last few days have summed up our trip,” said England assistant coach Paul Farbrace. \n“It’s been exceptionally tough, we’ve come up against a team that’s playing very good cricket but the one thing that we’ve been talking about is making sure we keep on fighting and battling.” Editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-07T04:01:00.000+02:00", "crawled": "2018-01-07T04:18:36.026+02:00", "highlightTitle": ""}