{"organizations": [], "uuid": "dc6ab8261741ca44f76c4dc0471de3be697b43e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220521024&w=1200&r=LYNXMPEE080P8", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/uk-britain-eu-davis/british-brexit-minister-complains-about-eus-planning-for-no-deal-idUSKBN1EY15J", "country": "US", "domain_rank": 408, "title": "British Brexit minister complains about EU's planning for no-deal", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T19:53:00.000+02:00", "replies_count": 0, "uuid": "dc6ab8261741ca44f76c4dc0471de3be697b43e6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-eu-davis/british-brexit-minister-complains-about-eus-planning-for-no-deal-idUSKBN1EY15J", "ord_in_thread": 0, "title": "British Brexit minister complains about EU's planning for no-deal", "locations": [], "entities": {"persons": [{"name": "david davis", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "financial times", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Brexit minister David Davis has complained in a letter to the prime minister that Brussels is damaging British interests by talking up the threat to companies if the UK leaves the European Union without a deal.\nThe letter showed that Davis had sought legal advice over whether Brussels was breaching Britain’s rights as a member state by advising companies of the risk to trading in the event of a “no deal”. It was first published by the Financial Times and confirmed as genuine by the Brexit department.\n“The EU has adopted a number of measures that put agreements or contracts at risk of being terminated in the event of a ‘no deal’ scenario and/or would require UK companies to relocate to another Member State,” the letter said.\nAn aide from the Department for Exiting the EU confirmed that the letter, dated December 2017, from Davis to Prime Minister Theresa May was genuine.\n“It’s clear there have been a number of instances where the (European Commission), by treating the UK differently despite still being a member of the EU, have not acted in good faith,” the aide said.\n“It should be no surprise that if the commission attempt to stoke fears about worst-case scenarios we will correct them and reassure our firms.”\nExamples given by Davis included EU agencies advising business that the UK would become a third country when it leaves the EU in March 2019 without referring to Britain’s aim to agree a transition period and future trading deal first.\nThe advice, Davis said, also implied companies would need to be based in the EU or European Economic Area in order to maintain compliance with regulatory rules.\nBritain and the EU struck a divorce deal in December that paved the way for talks on the future trade ties which are likely to prove more difficult.\nMay’s government has said it is preparing for any outcome, including the chance that Britain could crash out of the bloc, and has set aside an extra 3 billion pounds ($4.1 billion)to prepare for the move.\nEurope’s Brexit negotiator Michel Barnier has repeatedly warned that a no-deal scenario would have a damaging impact on people, companies and trade.\nBritish opposition politicians attacked Davis’ stance.\nNicola Sturgeon, Scotland’s first minister, who campaigned to stay in the EU, said the letter was extraordinary.\n“A government intent on leaving EU & continually talking about prospect of ‘no deal’ moaning about EU preparing to treat UK as a non member and for the possibility of ‘no deal’. Unbelievable - or rather, increasingly believable from this inept UK government,” she said on Twitter.\nDavis said in the letter that legal and policy advice suggested the chances of a successful legal challenge were slim. He said he had instructed his department to increase its engagement with the Commission - the EU’s executive -- and companies to reassure them.\n($1 = 0.7392 pounds)\nReporting by Kate Holton; Editing by Catherine Evans\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T19:53:00.000+02:00", "crawled": "2018-01-09T14:56:37.009+02:00", "highlightTitle": ""}