{"organizations": [], "uuid": "2e4ade4d8b5180d828447e3e2a9e636a9e3969e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 60, "shares": 60, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226269315&w=1200&r=LYNXMPEE0S0Q2", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-apple-iphonex/apple-set-to-halve-first-quarter-iphone-x-production-target-nikkei-idUSKBN1FI176", "country": "US", "domain_rank": 408, "title": "Apple set to halve Q1 iPhone X production target - Nikkei", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T13:05:00.000+02:00", "replies_count": 0, "uuid": "2e4ade4d8b5180d828447e3e2a9e636a9e3969e2"}, "author": "", "url": "https://www.reuters.com/article/us-apple-iphonex/apple-set-to-halve-first-quarter-iphone-x-production-target-nikkei-idUSKBN1FI176", "ord_in_thread": 0, "title": "Apple set to halve Q1 iPhone X production target - Nikkei", "locations": [], "entities": {"persons": [{"name": "saumyadeb chakrabarty", "sentiment": "none"}, {"name": "muvija", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "nikkei reuters", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nikkei", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 11:07 AM / Updated 2 hours ago Apple shares skid on report of iPhone X production cut Muvija M , Stephen Nellis 4 Min Read \n(Reuters) - Apple Inc ( AAPL.O ) will halve its iPhone X production target for the first three months of the year to around 20 million units, Nikkei reported on Monday, sending its shares down 1.6 percent. \nThe report added to growing concerns about weak sales of the $999 phone, making investors jittery about the company’s financial outlook when it reports first-quarter results on Thursday. \nApple’s shares fell to their lowest level in 2018, knocking off $14 billion from the company’s market value. The company declined to comment. \nAnalyst Toni Sacconaghi of Bernstein cut both his second-quarter and full-year forecasts for iPhones but said he did not expect Apple’s 2018 profit to fall steeply because of changes to U.S. tax law that will bring the company’s rate down to 18 percent. \n“Apple earnings should handily beat December quarter expectations, but March guidance could moderately disappoint,” UBS analysts said. \nThe production cut was prompted by slower-than-expected sales in the holiday shopping season in Europe, the United States and China, the Japanese newspaper reported, without citing a source. ( s.nikkei.com/2BASQZU ) \nThe iPhone X was the first phone to sport a new design since the launch of the iPhone 6 in 2015 and many expected it to lead to blockbuster sales, dubbed by Wall Street analysts as a “supercycle.” \n“This was supposed to be the supercycle year and if Apple hasn’t been able to drive substantial unit growth this year, then that makes you a little cautious on future iPhone cycles,” Atlantic Equities analyst James Cordwell said. FILE PHOTO: The new iPhone X is pictured at the Apple Store Marche Saint-Germain in Paris, France, November 3, 2017. REUTERS/Benoit Tessier/File Photo \nSeveral analysts have lowered their estimates for iPhone X shipments in the past few weeks, citing the high price of the device and other factors, with at least three downgrading their rating on the stock. \nSacconaghi of Bernstein had originally predicted that Apple would outpace Wall Street expectations of 62 million iPhones by selling 66 million units, but on Monday he cut that figure to 53 million units, a nearly 20-percent cut. He also cut his full year iPhone unit forecast 11 percent to 220 million units. \nBut he only slightly revised his full-year earnings per share estimate for 2018 to $11.80 from $11.87, citing the positive effects of U.S. tax law changes. \nAdding to the concerns, Verizon Communications Inc ( VZ.N ) said last week its postpaid device activations were lower than last year as people were keeping phones longer. \nA survey of people planning to buy the iPhone showed that the percentage of them looking to buy the iPhone X has dropped to 37 percent from 43 percent in an earlier survey, UBS analysts wrote in a note on Monday. \nThe iPhone X, which features an edge-to-edge display and facial recognition technology to unlock the phone, went on sale in November in the United States. \nAsian supply chain checks suggest that iPhone X orders have been weakening recently, with first-quarter production likely to be about 20 million units, JP Morgan analysts wrote in a note dated Jan. 24. \nA few of Apple’s iPhone parts suppliers are based in Asia. Shares of Foxconn, one of Apple’s main suppliers and formally known as Hon Hai Precision Industry Co Ltd ( 2317.TW ), fell 0.7 percent on Monday. \nShares of U.S.-listed Apple suppliers such as Micron Technology Inc ( MU.O ) edged lower following Nikkei’s report. Reporting by Muvija M in Bengaluru and Stephen Nellis in San Francisco; Editing by Saumyadeb Chakrabarty", "external_links": [], "published": "2018-01-29T13:05:00.000+02:00", "crawled": "2018-01-29T13:15:50.000+02:00", "highlightTitle": ""}