{"organizations": [], "uuid": "db45265da81855e3ed9de49a8df1562ca90362da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-quotidian-technical-highlights-on-selected-reit-stocks--national-storage-affiliates-trust-prologis-qts-realty-trust-and.html", "country": "US", "domain_rank": 767, "title": "Quotidian Technical Highlights on Selected REIT Stocks -- National Storage Affiliates Trust, Prologis, QTS Realty Trust, and Rexford Industrial Realty", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.027, "site_type": "news", "published": "2018-01-25T14:25:00.000+02:00", "replies_count": 0, "uuid": "db45265da81855e3ed9de49a8df1562ca90362da"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-quotidian-technical-highlights-on-selected-reit-stocks--national-storage-affiliates-trust-prologis-qts-realty-trust-and.html", "ord_in_thread": 0, "title": "Quotidian Technical Highlights on Selected REIT Stocks -- National Storage Affiliates Trust, Prologis, QTS Realty Trust, and Rexford Industrial Realty", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "national storage affiliates trust", "sentiment": "neutral"}, {"name": "rexford industrial realty new york", "sentiment": "neutral"}, {"name": "prologis", "sentiment": "neutral"}, {"name": "qts realty trust", "sentiment": "neutral"}, {"name": "qts realty trust inc.", "sentiment": "none"}, {"name": "national storage affiliates trust on wednesday", "sentiment": "none"}, {"name": "wallstequities.com", "sentiment": "none"}, {"name": "prologis inc.", "sentiment": "none"}, {"name": "rexford industrial realty inc.", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "nsa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, January 25, 2018 /PRNewswire/ --\nWallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on NSA, PLD, QTS, and REXR which can be accessed for free by signing up to http://www.wallstequities.com/registration . This morning, WallStEquities.com monitors the following Industrial REIT equities: National Storage Affiliates Trust (NYSE: NSA), Prologis Inc. (NYSE: PLD), QTS Realty Trust Inc. (NYSE: QTS), and Rexford Industrial Realty Inc. (NYSE: REXR). According to an article on National Real Estate Investor, Deutsche Bank predicts 2018 to be another \"muted\" year for REITs as a whole, but it notes that Industrial and Data Center REITs will be likely \"winners\" again this year. All you have to do is sign up today for this free limited time offer by clicking the link below. http://www.wallstequities.com/registration\nNational Storage Affiliates Trust\nOn Wednesday, shares in National Storage Affiliates Trust recorded a trading volume of 307,939 shares. The stock ended at $26.18, declining slightly by 0.53% from the last trading session. The Company's shares have gained 5.01% over the previous three months and 13.24% over the past year. The stock is trading above its 200-day moving average by 7.73%. Furthermore, shares of the Company, which focuses on the ownership, operation and acquisition of self-storage properties located within the top 100 metropolitan statistical areas throughout the US, have a Relative Strength Index (RSI) of 47.10.\nOn January 19 th , 2018, National Storage Affiliates Trust announced that it will release its financial results for the three months and full year ended December 31 st , 2017 on February 26 th , 2018, before market open. The Company will host a conference call at 1:00 p.m. ET that same day to discuss the quarterly results, current market conditions, and future outlook. This call may be accessed on the Company's website. Get the full research report on NSA for free by clicking below at: http://www.wallstequities.com/registration/?symbol=NSA\nPrologis\nPrologis Inc.'s stock finished yesterday's session 0.75% lower at $64.48. A total volume of 3.17 million shares was traded, which was above their three months average volume of 2.05 million shares. The Company's shares have gained 2.33% in the last month, 0.03% over the previous three months, and 24.41% over the past year. The stock is trading above its 200-day moving average by 5.41%. Furthermore, shares of Prologis, which focus on high-barrier, high-growth markets, have an RSI of 54.74.\nOn January 09 th , 2018, Prologis announced that it completed 13 build-to-suit development projects in the second half of 2017, totaling more than 4.7 million square feet with a total expected investment of approximately $350 million on a Prologis' share basis. For the full year, the Company completed 33 build-to-suit projects, totaling more than 12 million square feet, and started 38 build-to-suits. The free technical report on PLD can be accessed at: http://www.wallstequities.com/registration/?symbol=PLD\nQTS Realty Trust\nAt the close of trading on Wednesday, shares in QTS Realty Trust Inc. saw a decline of 1.41%, ending the day at $50.51. The stock recorded a trading volume of 404,091 shares. The Company's shares are trading 5.70% below their 200-day moving average. Moreover, shares of the Company, which provides flexible, scalable, secure IT solutions for web and IT applications, have an RSI of 36.13.\nOn January 17 th , 2018, research firm Credit Suisse downgraded the Company's stock rating from 'Neutral' to 'Underperform'.\nOn January 22 nd , 2018, QTS Realty Trust announced that it will issue its financial results for the quarter ended December 31 st , 2017 after market close on February 20 th , 2018. The Company will conduct a conference call and webcast on February 21 st , 2018, at 8:30 a.m. ET. The live broadcast will be available under the Investors tab of the Company's website. Sign up for free on Wall St. Equities and claim the latest report on QTS at: http://www.wallstequities.com/registration/?symbol=QTS\nRexford Industrial Realty\nRexford Industrial Realty Inc.'s shares ended the day 0.71% lower at $29.57 with a total trading volume of 271,243 shares. The stock has gained 1.62% in the last month and 22.90% over the past year. The Company's shares are trading 4.05% above their 200-day moving average. Additionally, shares of the Company have an RSI of 52.87.\nOn January 22 nd , 2018, Rexford Industrial Realty announced that it will release its Q4 2017 financial results after the market closes on February 13 th , 2018. A conference call will be held on February 14 th , 2018, at 1:00 p.m. ET to review these results, discuss recent events, and conduct a question-and-answer period. The conference call will be available under the investor page of the Company's website. See the free research coverage on REXR at: http://www.wallstequities.com/registration/?symbol=REXR\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither WSE nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit https://wallstequities.com/legal-disclaimer/\nCONTACT\nFor any questions, inquiries, or comments reach out to us directly. If you ' re a company, we are covering and wish to no longer feature on our coverage list contact us via email and/or phone between 09:30 EDT to 16:00 EDT from Monday to Friday at:\nEmail: info@wallstequities.com\nPhone number: +21-32-044-483\nOffice Address: 1 Scotts Road #24-10, Shaw Center Singapore 228\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\nSOURCE Wall St. Equities", "external_links": ["http://www.wallstequities.com/registration/?symbol=PLD", "http://www.wallstequities.com/registration/?symbol=QTS", "https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration/?symbol=REXR", "http://www.wallstequities.com/registration/?symbol=NSA", "http://www.wallstequities.com/registration"], "published": "2018-01-25T14:25:00.000+02:00", "crawled": "2018-01-25T14:16:29.000+02:00", "highlightTitle": ""}