{"organizations": [], "uuid": "fe02060b216239c88cd2efda1317b778bcade8d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-xplore-technologies-appoints-wilkinson-ceo.html", "country": "US", "domain_rank": 767, "title": "Xplore Technologies Appoints Wilkinson CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:00:00.000+02:00", "replies_count": 0, "uuid": "fe02060b216239c88cd2efda1317b778bcade8d7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-xplore-technologies-appoints-wilkinson-ceo.html", "ord_in_thread": 0, "title": "Xplore Technologies Appoints Wilkinson CEO", "locations": [], "entities": {"persons": [{"name": "mark holleran", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "xplore", "sentiment": "none"}, {"name": "tom pickens", "sentiment": "none"}, {"name": "said wilkinson", "sentiment": "none"}, {"name": "wilkinson", "sentiment": "none"}, {"name": "tom wilkinson", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "xplore technologies corp.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Xplore Technologies Corp. (NASDAQ:XPLR), a global leader in rugged computing, today announced the appointment of Tom Wilkinson as its Chief Executive Officer. Wilkinson has served as the company’s acting CEO since the October 31, 2017 resignation of previous CEO Mark Holleran and continues to serve as the company’s Chief Financial Officer.\n“Tom is a proven leader executing on a clear plan to expand Xplore’s addressable markets, increase revenue and grow profitability,\" said Tom Pickens, Chairman of Xplore Technologies. “During his tenure as CFO, Tom was instrumental to Xplore’s transformation into a more efficient, profitable company. Since being appointed acting CEO, he has deepened customer and supplier relationships, advanced our transition to a rugged mobility platform company and expanded Xplore’s total addressable market. We are confident in his ability to lead Xplore forward and deliver results for our stockholders.”\nSaid Wilkinson: “Xplore is in its best operating position since I joined the company. Demand for our tablets is strong, backlog remains high and the entire team at Xplore is motivated by our transformation into a rugged mobility company. We recently updated our revenue outlook to approximately $85 million for the full year, the top end of our guidance range. This reflects solid third quarter sales and an expected above-seasonal fourth quarter as we continue to win new accounts. Perhaps most importantly, we are delivering significant operating expense leverage as revenue continues to grow, ensuring Xplore is not only consistently profitable, but also increasingly profitable as we conclude Fiscal 2018 and enter Fiscal 2019.\n“Expansion of our addressable market with a larger range of rugged mobility devices is being executed in a much less costly manner than prior product development. We are doing this by leveraging the existing technology that we have developed and our ever-improving relationships with ODM suppliers. We will be able to bring products to market swiftly, and leverage both our existing channel and existing customer relationships to drive revenue growth. We are excited to see that some of these new products are already showing demand as adjacent offerings to current customers to expand the efficiency of their workforce.”\nA highly respected executive, Wilkinson brings 25 years of experience to his new position with the company. He joined Xplore in 2015 as Chief Financial Officer. He previously served as Chief Financial Officer for Amherst Holdings and as Managing Partner of a regional public accounting and marketing firm. His prior experience also includes business development for a subsidiary of Credit Suisse First Boston and work at both Dell and KPMG.\nAbout Xplore Technologies\nXplore is The Rugged Tablet Authority™, exclusively manufacturing powerful, long-lasting, and customer-defined rugged tablet PCs since 1996. Today, Xplore offers the broadest portfolio of genuinely rugged tablets – and the most complete lineup of rugged tablet accessories – on Earth. Its mobility solutions are purpose-built for the energy, utilities, telecommunications, military and defense, manufacturing, distribution, public safety, healthcare, government, and field service sectors. The company’s award-winning military-grade computers are also among the most powerful and longest lasting in their class, built to withstand nearly any hazardous condition or environmental extreme for years without fail. Visit www.xploretech.com for more information on how Xplore and its global channel partners engineer complete mobility solutions to meet specialized workflow demands. Follow us on Twitter , Facebook , LinkedIn , and YouTube .\nForward Looking Statements\nThis news release contains forward-looking statements that involve risks and uncertainties, which may cause actual results to differ materially from the statements made. When used in this document, the words “may”, “would”, “could”, “will”, “intend”, “plan”, “anticipate”, “believe”, “estimate”, “expect” and similar expressions are intended to identify forward-looking statements. Such statements reflect Xplore’s current views with respect to future events and are subject to such risks and uncertainties. Many factors could cause actual results to differ materially from the statements made including those factors detailed from time to time in filings made by Xplore with securities regulatory authorities. Should one or more of these risks or uncertainties materialize, or should assumptions underlying the forward looking statements prove incorrect, actual results may vary materially from those described herein as intended, planned, anticipated or expected. Xplore does not intend and does not assume any obligation to update these forward-looking statements.\nContact Information:\nMatt Kreps, Darrow Associates Investor Relations\n(214) 597-8200\nmkreps@darrowir.com\nTom Wilkinson\nChief Executive Officer\n(512) 637-1162\nSource:Xplore Technologies Corp", "external_links": ["https://www.globenewswire.com/Tracker?data=dygf2LdLwbjVXznxCGLbYo3AxSgo4j-U2tiuDF8QkS6hDN5T7gazaGMeOIJRUdl8fh57DZE7mc9xeM4xWZ9AjHzYHmGnnBeAFzv4jRit3d8=", "https://www.globenewswire.com/Tracker?data=291NiMoCWzLMCDF2YW3tUjyfn0dBGRMxx5OCn6xaJQ4lZk43CnvcYB5ayRbyCc87qjw805lajlqv10m7ZGLFG0a6ohEnDTTvEaSlBm2gcxK5MFjfQK8E4o3tzN37RAg4ajWXUrxnsw2nPRaPYNrN0w==", "https://www.globenewswire.com/Tracker?data=_zwPn18IcQtX1XB2mTH08kK4w7DQjFWoWQ-NyeXcw-J5AI5Q741sGcn-3wrgJwy5IPD8annTMT9OsTNUpBdSUnQ_zcoGgDdGz5Sx3vR7Tl8=", "https://www.globenewswire.com/Tracker?data=f91Zp0vExQqY2oBamdT0lAawRS4lEPFCc5HaSnUg-Rl5X_bqA2TzApYaouGgLt4l9k7Wyda2wQCJiuMwWhNODyLEjCxD4G-kO8TEv5-xJbY=", "https://www.globenewswire.com/Tracker?data=KTAXoeHbnvmzPEJbuIZKvwaKiZiixoy-6Z8zkvsVu2FLX-pT_5z9DdNyTsaDtRRGbGk0qWKkV7iwH-TysxX96lU5-BMe86qpSjaZIh27Gsw=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/1d193d6e-6332-4e59-928e-9d84d945fc22", "https://www.globenewswire.com/Tracker?data=keZ-iEnxwZIqIiWGLqfAQYT8J3FEvcO8pOZMw1iC8n2iWysdo0-EsJrIz-FEWtpiTYOnakgVmFEevL139w6slQ=="], "published": "2018-01-25T17:00:00.000+02:00", "crawled": "2018-01-25T18:33:42.004+02:00", "highlightTitle": ""}