{"organizations": [], "uuid": "7f77a1ca7497d8a3b1d64bcdc7c177ab26dc03d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219283379&w=1200&r=LYNXMPEE030J3", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-china-lng-prices/chinas-lng-prices-drop-as-industrial-users-curbed-supply-crunch-eases-idUSKBN1ET10M", "country": "US", "domain_rank": 408, "title": "China's LNG prices drop as industrial users curbed, supply crunch eases", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.054, "site_type": "news", "published": "2018-01-04T18:17:00.000+02:00", "replies_count": 0, "uuid": "7f77a1ca7497d8a3b1d64bcdc7c177ab26dc03d7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-lng-prices/chinas-lng-prices-drop-as-industrial-users-curbed-supply-crunch-eases-idUSKBN1ET10M", "ord_in_thread": 0, "title": "China's LNG prices drop as industrial users curbed, supply crunch eases", "locations": [], "entities": {"persons": [{"name": "li ruipeng", "sentiment": "none"}, {"name": "li", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "inner mongolia", "sentiment": "none"}, {"name": "shaanxi", "sentiment": "none"}, {"name": "tangshan", "sentiment": "none"}, {"name": "hebei", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "tangshan huapu gas co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - Liquefied natural gas (LNG) prices in northern China have dropped more than 40 percent from record highs reached less than two weeks ago as a supply crunch has eased and curbs have been enacted on industrial users of the fuel.\nEx-plant LNG prices were Quote: d at 5,700 yuan ($877) per ton in the Inner Mongolia region, compared to 9,750 yuan on Dec. 24, industry publication www.yeslng.com reported on Thursday. Prices in Shaanxi province fell 46 percent during the same period to 5,520 yuan.\n“Some industrial users were cut off gas supply or couldn’t afford it,” said Li Ruipeng, a manager at trucked-LNG dealer Tangshan Huapu Gas Co based in the city of Tangshan in the northern Chinese province of Hebei.\n“Supplies have increased as more gas has been diverted from the south to north,” said Li.\nChinese demand for natural gas has surged this winter after the government required residential and industrial users to switch to the fuel for heating to reduce the emissions produced by coal heating. Under the plan, industrial users could have their gas shut off in the event of supply shortages.\nLast month’s record high prices forced some industrial and even some residential users to switch away from natural gas to liquefied petroleum gas or coal, said Diao Zhouwei, an analyst at IHS Markit.\nSome steel mills in Tangshan, China’s biggest steel producing city, were forced to stop operations as the fuel became too costly, said another LNG trucking dealer, who asked to remain unidentified.\n“Some may only resume after the heating season is over,” said the dealer.\nOn Dec. 18, amid the surge in gas prices, China’s economic planner the National Development and Reform Commission (NDRC) ordered state-owned energy companies to cut gas supply to industry by about 15 million cubic meters per day.\nHowever, the industrial curtailments have not caused imported LNG prices to drop as much the ex-plant prices of domestically produced fuel.\nEx-terminal Quote: s for PetroChina’s Caofeidian receiving terminal were down 22 percent over the past ten days to 5,130 yuan per ton, yeslng.com reported.\nEx-terminal prices at Sinopec Corp’s Qingdao terminal were little changed during the period and were at 7,400 yuan per ton on Thursday, the website reported.\nSupply to northern China has been bolstered by diversions of gas from the south. Last month, the NDRC said 14 million cubic meters a day of gas was being moved from the south to the north.\nReporting by Chen Aizhu; Editing by Christian Schmollinger\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T18:17:00.000+02:00", "crawled": "2018-01-04T21:08:01.011+02:00", "highlightTitle": ""}