{"organizations": [], "uuid": "0fc42efae1f9aa42db2151f9ffed0b7b0933eff2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104943344-GettyImages-476795104.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/12/electric-vehicle-tax-credit-survives-but-gm-and-tesla-arent-cheering.html", "country": "US", "domain_rank": 767, "title": "Electric vehicle tax credit survives, but GM and Tesla aren’t cheering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:25:00.000+02:00", "replies_count": 0, "uuid": "0fc42efae1f9aa42db2151f9ffed0b7b0933eff2"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/12/electric-vehicle-tax-credit-survives-but-gm-and-tesla-arent-cheering.html", "ord_in_thread": 0, "title": "Electric vehicle tax credit survives, but GM and Tesla aren’t cheering", "locations": [], "entities": {"persons": [{"name": "tesla", "sentiment": "negative"}, {"name": "paul d. ryan", "sentiment": "negative"}, {"name": "scott pruitt", "sentiment": "none"}, {"name": "donald j. trump", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "gm", "sentiment": "negative"}, {"name": "house", "sentiment": "negative"}, {"name": "new york times", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "environmental protection agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "House Speaker Paul D. Ryan called electric vehicle tax credits \"money wasted on losers.\" The head of the Environmental Protection Agency, Scott Pruitt, said he'd \"do away\" with renewable energy subsidies .\nDuring the presidential election campaign, Donald J. Trump disparaged renewable energy as \"very, very expensive\" and \"not working on a large scale.\" He said a wind farm in California looked like a \"junk yard\" and claimed wind power killed birds in vast numbers. As president, he pulled the United States out of the Paris climate change accord.\nSo it's no wonder that hardly anyone expected renewable energy subsidies to survive Republican tax reform. In the legislation the House of Representatives passed in November, Republicans drastically curtailed solar and wind power subsidies and put a stake in the heart of the tax credit for buyers of electric vehicles — all while preserving billions in subsidies for fossil fuels.\nRead more from The New York Times:\nAfter Dow 25,000, the party has to end. But when?\nHoliday windows brighten a bleak retail scene, but how long will they last?\nThe Disney-Fox deal has friends in high places\nYet in the final tax bill Mr. Trump signed in December, there they are: the full panoply of tax incentives for renewable energy, as well as the $7,500 electric vehicle tax credit.\nAdam Jonas, an auto industry analyst for Morgan Stanley, called it a \"surprise move\" that suggests there may be deeper but little-recognized congressional support for electric vehicles and the infrastructure needed to support them.\nGiven that Tesla and General Motors are by far the top producers of electric vehicles, you'd expect their executives to be thrilled. G.M. has made a huge commitment to an electric vehicle future, and has pledged to have 20 new models on sale by 2023. It lobbied to preserve the incentives.\nBut Tesla has been conspicuously silent on the law. And G.M.'s response has been qualified. A company spokesman, Patrick E. Morrissey, said G.M. supports continuing the electric vehicle credit \"as an important customer benefit that can help accelerate the acceptance of electric vehicles,\" but added, \"We believe additional reform to the E.V. tax credit would help grow the market for of electric vehicles even more.\"\nThat's because as now structured, the tax credit puts Tesla and G.M. at a competitive disadvantage, especially compared with foreign rivals who are just starting to ramp up electric vehicle sales in the United States. The tax credit begins to phase out after a company sells 200,000 electric vehicles — a threshold both Tesla and G.M. are expected to reach this year.\nMeanwhile, buyers of electric BMW s, Volkswagens and Volvos will continue to get the full $7,500 credit. All of those manufacturers have announced aggressive sales plans for electric vehicles in the United States but so far have sold relatively few of them\nThe 200,000 limit on the tax credit was added in 2009 when Congress extended incentives for plug-in vehicles passed during the George W. Bush administration, as a way to move the nation toward energy independence. Tesla and G.M., far ahead of their rivals in investing in and promoting electric vehicles, have benefited from the tax credit in the intervening years, but will lose it soon, just as the market is becoming more competitive — in effect, penalizing them for being ahead of the curve.\nTesla's chief executive, Elon Musk , has been railing against the way the credit is structured, saying the perception that Tesla benefits from federal tax handouts \"drives me crazy.\"\n\"What matters is whether we have a relative advantage in the market,\" Mr. Musk said during an earnings conference call last year. \"And in fact the incentives give us a relative disadvantage,\" since, at Tesla's current sales rate, Tesla customers will soon see their tax credit disappear.\nHe noted that \"Tesla's competitive advantage improves as the incentives go away.\" (A Tesla spokeswoman declined to comment further.)\nMr. Jonas, in a note to Morgan Stanley clients, agreed that the provision would help foreign rivals, but may not have much impact on Tesla. Tesla's high-end S and X models sell on average for close to $100,000, and the average price for its mass-market 3 model is expected to be about $50,000.\nSo the $7,500 credit \"as a percentage of the purchase price is relatively lower for Tesla than for the makers of other E.V.s in the market,\" such as the Chevrolet Bolt and Nissan Leaf, Mr. Jonas said. (The Bolt costs $37,500, and prices for the Leaf start at just under $31,000.)\nHe said the credit was \"more important for other players who are much further away from the 200,000 United States sales mark.\"\nIn theory, the problem shouldn't be difficult for Congress to fix. One approach would be to lift the 200,000 vehicle cap and continue the credit indefinitely, a move that would most likely be welcomed by makers and consumers of electric vehicles and has the support of green energy lobbying groups. But the price tag for the government could become prohibitive if electric car sales surge.\nOr Congress could phase out the incentives beginning at a target date that would apply to all manufacturers, or after total industry sales hit a level that suggests a move to electric vehicles is sustainable. Depending on the time or level of sales chosen, that could address concerns about the impact of the tax credit on the deficit.\nTesla and G.M. have not proposed a specific fix.\nMany countries have far more robust subsidies for electric cars than the United States, including most of Europe. Norway has by far the highest percentage of electric car ownership in the world (about one-third of the vehicles sold there last year were electric or hybrid), along with the most lavish subsidies, which include sharply reduced sales taxes as well as free parking and use of uncongested bus lanes. The country has set a goal of zero auto emissions by 2025.\nWhile no one expects the United States to go to such an extreme, revising the electric vehicle tax credit and bolstering other incentives for renewable energy could be a rare source of bipartisan agreement. When it comes to jobs, a top priority for both Congress and the Trump administration, the Department of Energy reported that in 2016, 3.38 million Americans were employed in the clean energy sector, 10 percent more than the 2.99 million employed in fossil fuels.\nHow the renewable energy subsidies managed to survive to be part of the tax law remains a subject of debate, but nearly every explanation points in part to Senator Charles Grassley of Iowa, the powerful Republican chairman of the Judiciary Committee and a staunch supporter of renewable energy, especially wind. Iowa is a leader in wind power, which generates 36 percent of the state's electricity. The wind power industry employs 9,000 people in the state, according to the Iowa Wind Energy Association. (Senator Grassley did not respond to requests for comment.)\nTrying to tamper with the renewable energy subsidies and the electric vehicle credit, as the House version of the tax bill did, \"was asking for trouble,\" said Dean Zerbe, former tax counsel for the Senate Finan", "external_links": ["http://www.desertsun.com/story/news/politics/elections/2016/10/25/trump-palm-springs-looks-like-poor-mans-disneyland/92734208/", "https://www.nytimes.com/2017/12/21/business/holiday-windows.html?rref=collection/column/Common", "https://www.nytimes.com/2018/01/04/business/market-dow-2018.html?rref=collection/column/Common", "https://www.alliantgroup.com/", "https://insideevs.com/trump-eliminate-ev-tax-credits/", "http://www.eesi.org/papers/view/fact-sheet-jobs-in-renewable-energy-and-energy-efficiency-2017", "https://www.nytimes.com/2017/12/14/business/media/antitrust-disney-fox.html?rref=collection/column/Common", "https://www.nytimes.com/2017/12/07/climate/tax-overhaul-energy-wind-solar.html"], "published": "2018-01-12T18:25:00.000+02:00", "crawled": "2018-01-12T18:04:18.000+02:00", "highlightTitle": ""}