{"organizations": [], "uuid": "f40032695a36213f09daf3adf346cf671b9cfa27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-dow-futures-fall-nearly-200-pts-as-bond-yields-heath-stocks-weigh-idUSL4N1PP4WK", "country": "US", "domain_rank": 408, "title": "US STOCKS-Dow futures fall nearly 200 pts as bond yields, heath stocks weigh", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T22:13:00.000+02:00", "replies_count": 0, "uuid": "f40032695a36213f09daf3adf346cf671b9cfa27"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-dow-futures-fall-nearly-200-pts-as-bond-yields-heath-stocks-weigh-idUSL4N1PP4WK", "ord_in_thread": 0, "title": "US STOCKS-Dow futures fall nearly 200 pts as bond yields, heath stocks weigh", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}, {"name": "tanya agrawal", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "berkshire", "sentiment": "negative"}, {"name": "amazon", "sentiment": "negative"}, {"name": "apple", "sentiment": "negative"}, {"name": "jpmorgan", "sentiment": "negative"}, {"name": "cvs", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "pfizer", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mckesson", "sentiment": "none"}, {"name": "centene", "sentiment": "none"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "humana", "sentiment": "none"}, {"name": "cigna", "sentiment": "none"}, {"name": "amazon.com", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}, {"name": "unitedhealth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Health stocks hit after Amazon, JPMorgan, Berkshire team-up\n* Bond yield rise again, while Apple continues to drop\n* VIX climbs above 14 for the first time since Dec. 1\n* Futures down: Dow 196 pts, S&P 14.50 pts, Nasdaq 37 pts\n* Trump’s State of Union address, start of Fed meeting eyed (Adds details, comment, updates prices)\nBy Tanya Agrawal\nJan 30 (Reuters) - U.S. stocks were set to open lower for a second straight day on Tuesday, with Dow futures down about 200 points, weighed down by a rise in bond yields and a drop in shares of healthcare companies.\nShares of healthcare-related companies tumbled after Amazon.com, Berkshire Hathaway and JPMorgan said they plan to form a venture aimed at lowering healthcare costs for their U.S. employees.\nThe seven biggest percentage losers among the S&P 500 components trading premarket were health stocks. Express Scripts , McKesson, Humana, Cigna, UnitedHealth, CVS Health and Centene were down between 5.3 percent and 7.2 percent.\nPfizer shares were lower by 1.6 percent. They has risen about 2 percent earlier after the company’s quarterly results and full-year forecasts beat expectations.\nU.S. Treasury yields surged to more than three-year highs on expectations that central banks globally will reduce stimulus as the economic outlook improves. A rise in yields makes borrowing cash more expensive.\nMore than the rise in bond yields, the pace of the increase is what could hurt equity markets, said Hussein Sayed, chief market strategist at FXTM.\n“A simple question that may come to investors mind, is ‘why would I remain in equities when two-year U.S. treasury bills can provide the same divided yield return of the S&P 500?'.”\nAt 8:30 a.m. ET (1330 GMT), Dow e-minis were down 196 points, or 0.74 percent, with 65,458 contracts changing hands.\nS&P 500 e-minis were down 14.5 points, or 0.51 percent, with 288,208 contracts traded.\nNasdaq 100 e-minis were down 37 points, or 0.53 percent, on volume of 70,629 contracts.\nThe CBOE Volatility Index, the most widely followed barometer of expected near-term stock volatility, topped 14 for the first time since Dec. 1. It hit a high of 14.53.\nAmong earnings, shares of Harley-Davidson dropped 5.4 percent after the motorcycle maker forecast a drop in shipments this year.\nMetLife dropped 5.5 percent after saying the U.S. financial regulator is looking into the insurer’s failure to pay some workers’ pensions.\nThe rising yields and a slide in Apple’s shares on Monday pushed the bluechip Dow Jones Industrial Average and the benchmark S&P to their biggest one-day percentage declines in about five months.\nApple was down another 1.1 percent in premarket trading on Tuesday, still feeling the effects of news that the company will halve production of its $999 iPhone X smartphone.\nApple is among the list of companies due to report results on Thursday in what is a very event-heavy week.\nPresident Donald Trump’s State of the Union speech later in the day will be monitored for comments on trade. The Federal Reserve’s two-day meeting, starting Tuesday, will be watched for comments that could increase the likelihood of interest rates being raised four times this year, instead of three. (Reporting by Tanya Agrawal in Bengaluru; Editing by Savio D‘Souza)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T22:13:00.000+02:00", "crawled": "2018-01-31T16:21:51.001+02:00", "highlightTitle": ""}