{"organizations": [], "uuid": "13caacaa1cf42302e1e298ea8fb1482bbdfb7c83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-impartner-continues-expansion-of-leadership-team-to-capitalize-on-soaring-demand-in-partner-relationship-management-market.html", "country": "US", "domain_rank": 767, "title": "Impartner Continues Expansion of Leadership Team to Capitalize on Soaring Demand in Partner Relationship Management Market", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.556, "site_type": "news", "published": "2018-01-26T00:43:00.000+02:00", "replies_count": 0, "uuid": "13caacaa1cf42302e1e298ea8fb1482bbdfb7c83"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-impartner-continues-expansion-of-leadership-team-to-capitalize-on-soaring-demand-in-partner-relationship-management-market.html", "ord_in_thread": 0, "title": "Impartner Continues Expansion of Leadership Team to Capitalize on Soaring Demand in Partner Relationship Management Market", "locations": [], "entities": {"persons": [{"name": "joe wang", "sentiment": "none"}, {"name": "john mccurdy", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "mccurdy", "sentiment": "none"}, {"name": "mark", "sentiment": "none"}], "locations": [{"name": "utah", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}], "organizations": [{"name": "impartner continues expansion of leadership team", "sentiment": "negative"}, {"name": "akamai mark rogers", "sentiment": "none"}, {"name": "cisco", "sentiment": "none"}, {"name": "prm", "sentiment": "none"}, {"name": "global security sales organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SILICON SLOPES, Utah, Jan 25, 2018 /PRNewswire/ -- Impartner, the world's largest and fastest-growing pure-play Partner Relationship Management (PRM) company, today announced the appointment of John McCurdy, former Cisco VP of Americas, Global Security Sales Organization, as chief revenue officer. With McCurdy's appointment, current CRO and former Channel Chief of Akamai Mark Rogers shifts focus to strategic customer relationships and building the company's strategic alliances and fast-growing global network of channel partners.\n\"In much the same way as CRM has transformed direct sales, PRM is cementing its place as a mainstream technology for its power to transform indirect sales,\" said Impartner CEO Joe Wang. \"We couldn't be more excited to have someone with John's depth of enterprise sales experience broaden our leadership team and capitalize on this market demand, and at the same time, have Mark focus his channel experience on increasing our market penetration through building strategic partnerships and our indirect sales channel — a critical path to market.\"\nPrior to his role with Cisco, McCurdy, a tech industry veteran of more than 25 years, was vice president, Western North America Sales for Sourcefire, Inc. Under McCurdy's 11-year leadership, his team attained partnerships with hundreds of Fortune 1000, commercial and public-sector accounts throughout Western North America, growing sales from $5,000 per quarter to $46 million per quarter. Their security solutions are an integral part of operations for organizations in financial services, transportation and logistics, healthcare, retail, online services, communications, high tech, energy industries, state and local government and higher education.\n\"Having spent the bulk of my career selling to corporations that generate most, if not all, of their revenue through the indirect channel, I fully appreciate the power of working with companies to optimize their channel performance and accelerate indirect sales,\" said McCurdy. \"The power of contemporary PRM solutions to give channel managers the same visibility into their indirect channel performance that they have into their direct sales, makes PRM the next core enterprise solution, that's as critical as a CRM or an ERP. I'm more than looking forward to joining this leadership team and helping continue Impartner's extraordinary market trajectory.\"\n\"The market demand from potential alliance partners for Impartner is tremendous and the time to further expand our own partner network to capture this market opportunity is now,\" adds Rogers. \"As PRM has become a core go-to-market technology for any company that sells through indirect channels, it has become a must have technology for software and solution integrators and consultants worldwide to have in their arsenal of solutions­­.\"\nThe expansion of Impartner's leadership team is the latest in a continual string of news from the company that has been on a rapid growth trajectory since Impartner's (formerly known as TreeHouse Interactive) acquisition in 2015 by CEO Joe Wang and Kennet Partners, a growth equity firm. In under three years, the company has nearly quadrupled in size, moved offices twice, won countless national and international awards, closed two additional rounds of funding, the latest from VC cloud leader Emergence Capital, and continually added to its blue-chip roster of some of the world's most prestigious companies from Samsung and Zendesk to FireEye and Fortinet and Ingersoll Rand.\nAbout Impartner\nImpartner delivers the industry's most advanced SaaS-based Partner Relationship Management (PRM) solution, helping companies worldwide manage their partner relationships and accelerate revenue and profitability through indirect sales channels. Impartner PRM is the industry's most award-winning PRM technology and one of the industry's only turnkey solutions that can deploy a world-class Partner Portal in as few as 14 days, using the company's highly engineered Velocity™ onboarding process, which is guided by an individually customized Customer Success Portal.\nFor more information on Impartner, which is based in Utah's tech hotbed, the Silicon Slopes, visit www.impartner.com , or in the United States call +1 801 501 7000, for EMEA general call +33 1 40 90 31 20, for London call +44 0 20 3283 4465, and for LATAM call +1 954 364 7883.\nContact:\nKerry Desberg\nImpartner\n425-231-9529\nKerry.desberg@impartner.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/impartner-continues-expansion-of-leadership-team-to-capitalize-on-soaring-demand-in-partner-relationship-management-market-300588592.html\nSOURCE Impartner", "external_links": ["http://www.prnewswire.com/news-releases/impartner-continues-expansion-of-leadership-team-to-capitalize-on-soaring-demand-in-partner-relationship-management-market-300588592.html", "http://www.impartner.com/"], "published": "2018-01-26T00:43:00.000+02:00", "crawled": "2018-01-26T01:41:19.004+02:00", "highlightTitle": ""}