{"organizations": [], "uuid": "e94dbe7121fa11a7211f2c08dae7c2aa09e89d39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/globe-newswire-tamarack-valley-energy-ltd-announces-2018-guidance-operational-update-and-record-fourth-quarter-2017-production.html", "country": "US", "domain_rank": 767, "title": "Tamarack Valley Energy Ltd. Announces 2018 Guidance, Operational Update and Record Fourth Quarter 2017 Production", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:00:00.000+02:00", "replies_count": 0, "uuid": "e94dbe7121fa11a7211f2c08dae7c2aa09e89d39"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/globe-newswire-tamarack-valley-energy-ltd-announces-2018-guidance-operational-update-and-record-fourth-quarter-2017-production.html", "ord_in_thread": 0, "title": "Tamarack Valley Energy Ltd. Announces 2018 Guidance, Operational Update and Record Fourth Quarter 2017 Production", "locations": [], "entities": {"persons": [], "locations": [{"name": "calgary", "sentiment": "none"}, {"name": "alberta", "sentiment": "none"}, {"name": "tamarack", "sentiment": "none"}], "organizations": [{"name": "tve", "sentiment": "negative"}, {"name": "tamarack valley energy ltd", "sentiment": "negative"}, {"name": "tamarack valley energy ltd.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "redwater / penny", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CALGARY, Alberta, Jan. 15, 2018 (GLOBE NEWSWIRE) -- Tamarack Valley Energy Ltd. (TSX:TVE) (“ Tamarack ” or the “ Company ”) is pleased to announce its 2018 capital budget and full year guidance, along with an operational update, including record fourth quarter production volumes and a meaningful increase in oil weighting which is expected to continue through 2018. Based on December field numbers, the Company estimates its Q4/17 production averaged over 22,600 boe/d with an oil and liquids weighting of 62%, higher than its previously forecast exit rate of 22,000 boe/d (59% oil and liquids).\n2018 Capital Program Highlights\nTamarack’s strategy over the past several years has been focused on achieving self-sustainability at low oil prices while generating debt-adjusted per share growth. Since 2015, the Company completed two major acquisitions: the Redwater / Penny acquisition in 2016 and the Spur Resources acquisition in 2017. Both of these asset packages are situated near strategic infrastructure and offer an inventory of future potential well locations that can payout in 1.5 years or less under current commodity prices. As a result of the last two years of acquisitions combined with a continued focus on organic growth, Tamarack expects the Company to be fully self-funded in 2018 and generate an annual estimated 12-15% debt-adjusted production per share growth relative to 2017 assuming a US$56.75/bbl WTI price.\nTamarack’s 2018 capital budget is set between $195 and $205 million, which is anticipated to approximate cash flow levels expected to be generated based on Tamarack’s commodity price assumptions outlined below. The budget reflects the strength of the Company’s asset base, its higher oil and liquids weighting in 2018 relative to 2017, and a continued focus on efficiencies and cost control. Tamarack’s increased oil and liquids weighting is expected to improve netbacks and provide support for cash flows through periods of prolonged weakness in natural gas prices. To further mitigate against gas price weakness and reduce Tamarack’s exposure to pricing at AECO, the Company diversified the gas markets it sells to commencing in November of 2017 with further capacity coming on stream in April, 2018. As of April 1, 2018, approximately 40% of Tamarack’s natural gas production will receive pricing from various markets that have historically outperformed AECO pricing. Tamarack will receive 16% of its natural gas production from Malin daily index pricing, and 8% from each of Dawn, Chicago and Mich Con, less transportation tolls. Tamarack continues to consider additional transportation options that could be implemented in 2019.\n2018 Guidance\nThe Company's 2018 guidance is outlined below:\nAnnual average production between 22,500 – 23,500 boe/d (64-66% oil and liquids), with 2018 exit production estimated between 24,000 – 24,500 boe/d (65-67% oil and liquids);\nCapital expenditure range of $195 to $205 million, weighted approximately equally between the first and second halves;\nEstimated year end 2018 debt to fourth quarter annualized cash flow ratio of less than 1.0 times with an estimated $100 million of liquidity on the Company's existing credit facilities; and\nAssumed 2018 commodity prices averaging approximately: WTI US$56.75/bbl, Edmonton Par price averaging C$64.60/bbl, AECO averaging $1.65/GJ and a Canadian/US dollar exchange rate of $0.79. Tamarack has also assumed an interest rate increase of 0.5% in 2018.\nTamarack’s 2018 budget anticipates the drilling of 120 (116.4 net) wells in 2018, including 68 (66.7 net) Alberta Viking light oil wells; 23 (20.7 net) Saskatchewan Viking light oil wells; 20 (17.3 net) Cardium light oil wells; six (5.7 net) wells at Redwater; three net wells at Penny and three net heavy oil wells. The capital program is expected to be evenly spent in the first half and second half of 2018.\nDuring the first quarter of 2018, Tamarack expects to have four to five rigs in operation. The Company anticipates drilling nine (8.5 net) Cardium wells at Wilson Creek; 27 (26.0 net) Alberta Viking wells at Veteran; and six (5.7 net) wells at Redwater which are expected to be drilled toward the end of March and have little to no impact on Q1/18 production, but positively impact Q2/18 volumes. In addition, the Company is undertaking a second expansion of its Veteran oil battery to increase capacity to 10,000 to 12,000 bbls/d of oil from its current 5,000 bbls/d capacity.\nOperational Update\nBased on field estimates for December of 2017, Tamarack’s production was slightly higher than the upper end of its full year guidance range of 19,000 to 20,000 boe/d. On this basis, the Company estimates its Q4/17 production averaged over 22,600 boe/d with an estimated oil weighting of 56% and an overall liquids weighting of 62%, higher than its previously forecast exit rate of 22,000 boe/d with 52% oil weighting. In response to the prevailing weakness in Canadian natural gas pricing, Tamarack made a conscious decision through most of 2017 to allocate capital to drilling locations and other projects that have a higher oil and liquids weighting, which positively impacted its production profile and operating netbacks. This is expected to continue through 2018, driving a 12-17% increase in oil weighting for 2018 over 2017 based on the budget and capital program outlined above. Tamarack expects to increase its operating netback by approximately 12-15% in 2018 compared to 2017, when applying forecasted 2018 prices to 2017 actual production. The Company’s strong production performance through 2017 represents a record for Tamarack, and is a direct result of its successful second half drilling and completions program coupled with continued enhancements to operational efficiencies and cost control.\nAs previously announced, in response to favorable rates for completions crews and to avoid challenges accessing service crews in Q1/18, the Company accelerated approximately $10 to $15 million of its Q1/18 capital into 2017. The base and accelerated Q4/17 program resulted in the drilling of 20 (18.7 net) horizontal wells, 15 of which were drilled in Veteran and not yet on production as of December 31, 2017. Tamarack elected to proceed with completing nine of the 15 wells in December, including four wells on the Company’s 8-25 pad and five wells on the 12-29 pad. These wells are expected to come on stream later in January and contribute to strong first quarter 2018 production.\nAbout Tamarack Valley Energy Ltd.\nTamarack is an oil and gas exploration and production company committed to long-term growth and the identification, evaluation and operation of resource plays in the Western Canadian Sedimentary Basin. Tamarack’s strategic direction is focused on two key principles – targeting repeatable and relatively predictable plays that provide long-life reserves, and using a rigorous, proven modeling process to carefully manage risk and identify opportunities. The Company has an extensive inventory of low-risk, oil development drilling locations focused primarily in the Cardium and Viking fairways in Alberta that are economic over a range of oil and natural gas prices. Wi", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/c973da29-66ac-4501-9a17-bcd793de2ab7"], "published": "2018-01-15T15:00:00.000+02:00", "crawled": "2018-01-15T16:27:42.002+02:00", "highlightTitle": ""}