{"organizations": [], "uuid": "598dd373b346ea7cfdd71e8be6e73841eee5e8db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225280247&w=1200&r=LYNXMPEE0O1OM", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-airlines-results/u-s-airline-shares-fall-again-as-investors-worry-about-capacity-price-wars-idUSKBN1FE32Y", "country": "US", "domain_rank": 408, "title": "U.S. airline shares fall again as investors worry about capacity, price wars", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T05:44:00.000+02:00", "replies_count": 0, "uuid": "598dd373b346ea7cfdd71e8be6e73841eee5e8db"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-airlines-results/u-s-airline-shares-fall-again-as-investors-worry-about-capacity-price-wars-idUSKBN1FE32Y", "ord_in_thread": 0, "title": "U.S. airline shares fall again as investors worry about capacity, price wars", "locations": [], "entities": {"persons": [{"name": "savanthi syth", "sentiment": "none"}, {"name": "raymond james", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "southwest", "sentiment": "none"}, {"name": "delta air lines inc", "sentiment": "none"}, {"name": "southwest airlines", "sentiment": "none"}, {"name": "nyse arca airline index", "sentiment": "none"}, {"name": "united continental holdings inc", "sentiment": "none"}, {"name": "united", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 9:44 PM / in 8 minutes U.S. airline shares fall again as investors worry about capacity, price wars Alana Wise 4 Min Read \nNEW YORK (Reuters) - U.S. airline shares sunk further on Thursday as quarterly reports from American Airlines ( AAL.O ) and Southwest Airlines ( LUV.N ) did nothing to quell investors’ fears that carriers’ plans to expand capacity will lead to lower fares just as the industry faces rising costs. \nFears about the resulting hit to bottom lines sent the NYSE Arca Airline Index .XAL down 2.4 percent. It is down more than 5 percent since Tuesday, when United Continental Holdings Inc ( UAL.N ) surprised the market with unexpectedly aggressive expansion plans through 2020. \n“The planned elevated capacity growth in 2019/20 will raise concerns about supply and destructive competitive response,” said Raymond James analyst Savanthi Syth in a research note. \nShares of American and Southwest both ended down more than 3 percent, even after reporting fourth-quarter profits that beat Wall Street’s projections. Shares of Delta Air Lines Inc ( DAL.N ) and United also fell. \nMore competition and cheaper fares are a boon for travelers, but represent a worst-case-scenario for airlines and their shareholders as carriers have only recently begun improving unit revenues after a two-year decline. \nFuel prices are at nearly a three-year high and relatively rich labor contracts agreed with pilots and flight attendants have dramatically increased airlines’ unit costs. FILE PHOTO: A Southwest Airlines plane is seen at Los Angeles International Airport (LAX) in the Greater Los Angeles Area, California, U.S., April 10, 2017. REUTERS/Lucy Nicholson/File Photo \nThe three largest U.S. carriers - American, Delta and United - have all shelled out for pricey pay increases to employees after fractious and public negotiations. \nAmerican, which on Thursday reported a 9.8 percent increase in quarterly operating expenses to $9.9 billion, stunned investors last year by offering its pilots and flight attendants a mid-contract pay increase that is set to cost $350 million a year in both 2018 and in 2019. \nUnited and Delta, in filings earlier this month, reported significant operating expense spikes as well. \nAt the same time, legacy airline executives are defending their hard-earned hubs from encroachment by low-cost U.S. and transatlantic rivals, which have crept into their territory and are starting to shave down their bigger, more established competitors’ market share through no-frill, cheap airfares. \nChicago-based United is battling low-cost competitors in several of its U.S. hubs and has already slashed fares on some of its routes and has said it will continue to compete against scrappy budget airlines, a move unpopular with most investors. \nThat is a risky gamble, given the relatively high operating expenses of United and other legacy carriers. United, for example, posted a third-quarter cost per available seat mile of 12.54 cents. Southwest, the No. 4 U.S. carrier, measured a unit cost for the same period of 11.36 cents. Smaller rival budget carrier Spirit Airlines Inc ( SAVE.N ) had a unit cost of just 7.59 cents. Reporting by Alana Wise; Editing by Bill Rigby", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T05:44:00.000+02:00", "crawled": "2018-01-25T23:50:41.000+02:00", "highlightTitle": ""}