{"organizations": [], "uuid": "9d2f235cc070dd42e74385576c50afd111f2614d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220815513&w=1200&r=LYNXMPEE090PQ", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-stocks/futures-sink-on-report-china-may-slow-u-s-bond-purchases-idUSKBN1EZ1DU", "country": "US", "domain_rank": 408, "title": "Futures sink on report China may slow U.S. bond purchases", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:30:00.000+02:00", "replies_count": 0, "uuid": "9d2f235cc070dd42e74385576c50afd111f2614d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-stocks/futures-sink-on-report-china-may-slow-u-s-bond-purchases-idUSKBN1EZ1DU", "ord_in_thread": 0, "title": "Futures sink on report China may slow U.S. bond purchases", "locations": [], "entities": {"persons": [{"name": "peter cardillo", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "first standard financial", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - The three major U.S. stock indexes ended lower on Wednesday after a choppy trading session as investors worried that China would slow U.S. government bond purchases and that U.S. President Donald Trump would end a key trade agreement. \nThe S&P and the Nasdaq snapped a six-day rally after Bloomberg reported that China, the world’s biggest holder of U.S. Treasuries, could slow or stop buying the government bonds. The report sent Treasury yields to a 10-month high. \nThe S&P 500 pared some losses as yields backed away from their intraday peaks and investors digested the China report. But the index lost ground again in mid-afternoon trading after Reuters reported that Canada is increasingly convinced Trump will soon announce a U.S. exit from the North American Free Trade Agreement. It cited two unnamed government sources. \n“It’s a fairly light week for economic and financial data. In a week like this, political headlines can have a bigger impact than they normally would,” said Jon Mackay, investment strategist at Schroders Investment Management in New York. \nWhile Mackay said the selloff was overblown, he noted that a change to NAFTA could hurt corporate earnings. \n“If that news is true, you’d expect a higher dollar price and a negative impact to earnings,” said Mackay. \nThe Dow Jones Industrial Average .DJI fell 16.67 points, or 0.07 percent, to 25,369.13, the S&P 500 .SPX lost 3.06 points, or 0.11 percent, to 2,748.23 and the Nasdaq Composite .IXIC dropped 10.01 points, or 0.14 percent, to 7,153.57. \nInvestors were particularly skittish about the China report as they worried that the market was overdue for a correction. \n“It’s a reflection of investor weariness and awareness that the market has risen for four straight months without seeing a major pullback,” said Robert Pavlik, chief investment strategist, SlateStone Wealth in New York. \n“As the day wore on, Treasury yields started to move lower on the realization the story doesn’t have any legs,” he said. “There’s no way on earth the Chinese stop buying U.S. Treasuries.” \nThe S&P financial index .SPSY was the best performer among the S&P 500’s 11 major sectors with a 0.9 percent rise, helped by gains in Berkshire Hathaway ( BRKa.N ), JPMorgan ( JPM.N ) and Wells Fargo ( WFC.N ). \nBanks and insurance companies often rise with bond yields as investors expect a profit boost from higher interest rates. \nRate-sensitive sectors such as utilities .SPLRCU and real estate .SPLRCREC were the biggest losers with declines of 1.1 percent and 1.5 percent. \nInvestors started 2018 with high hopes for strong U.S. earnings growth. Banks will kick off earnings season on Friday. \nEarnings for S&P 500 companies are expected to increase by 11.8 percent, with the biggest contribution from the energy sector, according to Thomson Reuters I/B/E/S. \nBerkshire Hathaway ( BRKb.N ) rose 1.3 percent after the conglomerate promoted two top executives, cementing their status as the most likely successors to Warren Buffett. \nDeclining issues outnumbered advancing ones on the NYSE by a 1.59-to-1 ratio; on Nasdaq, a 1.09-to-1 ratio favored decliners. \nThe S&P 500 posted 74 new 52-week highs and 7 new lows; the Nasdaq Composite recorded 98 new highs and 24 new lows. \nVolume on U.S. exchanges was 6.93 billion shares, above the 6.38 billion average for the full session over the last 20 trading days. \nReporting By Sinead Carew; Editing by Nick Zieminski\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T20:30:00.000+02:00", "crawled": "2018-01-10T14:37:34.014+02:00", "highlightTitle": ""}