{"organizations": [], "uuid": "3178fd38a12ff79ed62afacd53253aacf74e7e45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 11}, "facebook": {"likes": 112, "shares": 112, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222885875&w=1200&r=LYNXMPEE0H02T", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-global-oil/oil-edges-up-on-falling-u-s-crude-inventories-but-supply-remains-ample-idUSKBN1F7053", "country": "US", "domain_rank": 408, "title": "Oil up on threats of rebel attacks in Nigeria, falling US crude stocks", "performance_score": 1, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T09:22:00.000+02:00", "replies_count": 0, "uuid": "3178fd38a12ff79ed62afacd53253aacf74e7e45"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-oil/oil-edges-up-on-falling-u-s-crude-inventories-but-supply-remains-ample-idUSKBN1F7053", "ord_in_thread": 0, "title": "Oil up on threats of rebel attacks in Nigeria, falling US crude stocks", "locations": [], "entities": {"persons": [{"name": "fawad razaqzada", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "niger delta avengers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 1:22 AM / Updated an hour ago Oil little changed after record crude draw at U.S. hub Jessica Resnick-Ault 3 Min Read \nNEW YORK (Reuters) - Oil was little changed on Thursday, as prices eased early in the session, but were supported by a record drawdown of U.S. crude stockpiles at the Cushing, Oklahoma delivery hub. \nThe market remains wary that OPEC-led output cuts will trigger price hikes that will increase supply from the United States. \nCrude is just below its highest price since December 2014, supported by supply cuts led by the Organization of the Petroleum Exporting Countries and concern that unrest in producer nations such as Nigeria could further curb output. \nU.S. crude inventories fell 6.9 million barrels last week, compared with forecasts for a 3.5 million-barrel draw, the U.S. Energy Information Administration said. [EIA/S] Crude supplies at the Cushing, Oklahoma delivery hub for U.S. crude futures fell 4.2 million barrels in the week, the largest draw since at least 2004. \nAfter falling the previous week due to cold weather, U.S. crude production rose to 9.75 million barrels per day last week. \nOPEC’s monthly report on Thursday raised its forecast for oil supply from non-members in 2018. [API/S] \n“Higher oil prices are bringing more supply to the market, particularly in North America and specifically tight oil,” OPEC said in the report, using another term for shale. \nBrent crude, the global benchmark, settled down 7 cents at $69.31 a barrel. On Monday it touched $70.37, the highest since December 2014. U.S. crude was down 2 cents at $63.95, having hit its highest since December 2014 on Tuesday. \nBrent has risen from $61 a barrel in early December and some analysts say the rally may be about to run out of steam. \n“The upside is now limited for oil prices,” said Fawad Razaqzada, market analyst at brokerage Forex.com. “U.S. oil producers will ramp up production in the coming months.” \nOPEC’s report follows a forecast from the EIA on Tuesday that it expects U.S. oil output to continue to rise in February with production from shale increasing by 111,000 bpd. \nThe agency previously said U.S. output could reach 10 million bpd in February and 11 million bpd in 2019. \nEven so, traders said prices were unlikely to fall far due to the OPEC-led curbs and the risk of further disruptions. \nNigerian militants threatened to attack the country’s oil sector in the next few days, potentially hampering supplies in Africa’s largest exporter. \n“The impact of such a threat, if carried out, would be significant on the global supply and demand balance,” said Tamas Varga of oil broker PVM. “The market is still sensitive to geopolitical developments.” Additional reporting by Henning Gloystein in Singapore and Alex Lawler in London; Editing by Dale Hudson and Marguerita Choy", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T09:22:00.000+02:00", "crawled": "2018-01-18T05:43:01.013+02:00", "highlightTitle": ""}