{"organizations": [], "uuid": "8ba78389050323f7f1b5c983e409516e08823cd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-juno-m-a-celgene/celgene-to-buy-remaining-stake-in-juno-for-9-billion-idUSKBN1FB1DB", "country": "US", "domain_rank": 408, "title": "Celgene to buy remaining stake in Juno for $9 billion", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T13:39:00.000+02:00", "replies_count": 0, "uuid": "8ba78389050323f7f1b5c983e409516e08823cd9"}, "author": "", "url": "https://www.reuters.com/article/us-juno-m-a-celgene/celgene-to-buy-remaining-stake-in-juno-for-9-billion-idUSKBN1FB1DB", "ord_in_thread": 0, "title": "Celgene to buy remaining stake in Juno for $9 billion", "locations": [], "entities": {"persons": [{"name": "arun koyyur", "sentiment": "none"}, {"name": "tamara mathias", "sentiment": "none"}, {"name": "juno", "sentiment": "none"}], "locations": [{"name": "juno", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "celgene", "sentiment": "negative"}, {"name": "juno therapeutics inc", "sentiment": "none"}, {"name": "celgene corp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Celgene Corp will pay $9 billion in cash to buy experimental cancer drugmaker Juno Therapeutics Inc, bulking up its developmental pipeline as it works to reduce reliance on its own cancer treatment Revlimid.\nCelgene said on Monday it would pay $87 per share for the roughly 90 percent of Juno it does not already own.\nJuno focuses on chimeric antigen receptor T-cell therapy, known as CAR-T, which harnesses the body’s own immune cells to recognize and attack malignant cells. These types of gene therapies have been pegged by many in the pharmaceutical industry as a new frontier in cancer treatment.\nCelgene’s bid represents a nearly 29 percent premium to Juno’s closing price of $67.81 on Friday, and the company’s shares were trading just below the bid at $86.12 on Monday morning. Juno’s stock was worth less than $46 as recently as last week, before the Wall Street Journal reported that the two companies were working on a deal.\nCelgene has lost nearly 30 percent of its value since October, as investors sold off shares on concerns over patent challenges to its long-time cash cow Revlimid, weak sales of its key psoriasis drug Otezla and the failure of an experimental Crohn’s disease drug that had been touted as a potential blockbuster.\n“Celgene is in a desperate situation,” said Brad Loncar, chief executive of Loncar Investments, which runs the Loncar Cancer Immunotherapy ETF. “Their revenue growth is running out of gas and they needed to fix this immediately.”\nShares of Celgene were at $102.61 on Monday.\nThe two companies have been working together since 2015, when Celgene picked up 9.3 percent of Juno for $93 a share.\nJuno is yet to get an approval for a CAR-T drug, unlike its rivals Kite Pharma, bought by Gilead Sciences Inc for nearly $12 billion in 2017, and Novartis AG.\nJuno’s closest drug to approval is its JCAR017 treatment for a type of blood cancer. The companies said they expect it to be approved in 2019 and could bring in peak sales of about $3 billion worldwide.\nIt has had previous setbacks in developing the treatments, and shut down development of one leukemia treatment due to severe neurotoxicity that led to five patient deaths.\nAnalysts said new treatments from Juno should help diversify Celgene’s revenue base. Revlimid currently accounts for more than 60 percent of its sales.\nThe deal is the second Celgene Chief Executive Mark Alles has struck in January, after agreeing to pay $1.1 billion - and as much as $7 billion if certain milestones are reached - for privately-held Impact Biomedicines.\nThe Summit, New Jersey-based company also has partnerships with bluebird bio Inc and Agios Pharmaceuticals Inc, both of which are developing cancer treatments.\nCelgene said the latest acquisition is expected to add to its 2020 target net revenue incrementally, but will not affect adjusted earnings forecast of more than $13 per share.\nThe deal was one of two large biotech deals on Monday morning, as French drugmaker Sanofi also agreed to buy U.S. hemophilia expert Bioverativ for $11.6 billion, its biggest deal for seven years.\nJ.P. Morgan Securities LLC is the financial adviser for Celgene and Morgan Stanley & Co for Juno.\nProskauer Rose LLP and Hogan Lovells will be the legal counsel for Celgene and Skadden, Arps, Slate, Meagher and Flom LLP for Juno.\nReporting by Michael Erman in New York and Tamara Mathias in Bengaluru; Additional reporting by , Manas Mishra and Akankshita Mukhopadhyay in Bengaluru; Editing by Arun Koyyur and Andrew Hay\n ", "external_links": [], "published": "2018-01-22T13:39:00.000+02:00", "crawled": "2018-01-22T13:56:27.034+02:00", "highlightTitle": ""}