{"organizations": [], "uuid": "32ffe8f7ac5f68e6bb1d75e1697aefed22680a78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-trianz-acquires-cbig-consulting-and-strengthens-analytics-practice.html", "country": "US", "domain_rank": 767, "title": "Trianz Acquires CBIG Consulting and Strengthens Analytics Practice", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:00:00.000+02:00", "replies_count": 0, "uuid": "32ffe8f7ac5f68e6bb1d75e1697aefed22680a78"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-trianz-acquires-cbig-consulting-and-strengthens-analytics-practice.html", "ord_in_thread": 0, "title": "Trianz Acquires CBIG Consulting and Strengthens Analytics Practice", "locations": [], "entities": {"persons": [{"name": "trianz", "sentiment": "negative"}], "locations": [{"name": "santa clara", "sentiment": "none"}, {"name": "washington d.c", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "big data analytics", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "cbig consulting", "sentiment": "none"}, {"name": "analytics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA CLARA, Calif. and CHICAGO and WASHINGTON D.C, January 10, 2018 /PRNewswire/ --\nTrianz , a global digital transformation consulting and technology services firm today announced its acquisition of CBIG Consulting (CBIG), a leading Business Intelligence and Big Data Analytics consulting firm based out of Chicago.\n(Logo: http://mma.prnewswire.com/media/626944/Trianz_Logo.jpg )\nIn 2013, Trianz made a commitment to focus exclusively in the areas of Cloud , Analytics , Digital , Infrastructure and Security -related services to help clients transition to digital enterprises. Trianz has grown steadily for the past 5 years, developing capabilities research, strategy, process and technology consulting and managed services capabilities. The addition is part of Trianz' ongoing strategy to scale its digital transformation services portfolio comprising of Cloud, Analytics, Digitalization, Infrastructure and Security services. Trianz has also built strong technology partnerships in these areas, emerging as a Managed Services Partner of both AWS & Microsoft Azure . Trianz is rated #1 by clients for business impact, quality of services and commitment - for 2 years in a row.\nFounded in 2002, CBIG is headquartered in Chicago and is present in several locations across the U.S. CBIG offers a full array of analytics and information management services - from strategy and planning to full stack technology implementations for leading enterprises that help them make intelligent business decisions. CBIG's project teams comprise of leading strategic business consultants, data scientists and analysts, data engineers and architects. The collective knowledge of these teams in over 500 engagements has helped CBIG increase enterprises' value and competitive edge. In 2017, CBIG was named as one of 'America's Best Management Consulting Firms.'\nSpeaking on this occasion, Sri Manchala , President and CEO at Trianz, said, \"Trianz has established itself as a strong player in the digital evolution space enabling business and IT leaders drive transitions to a digital enterprise. Our goal is to continue to scale our portfolio and capabilities in Cloud, Analytics, Digitalization, Infrastructure and Security to emerge as a leading firm by 2020. CBIG brings experience in multiple industries, depth in analytics and carries strong client centricity and a commitment to their success. Trianz and CBIG clients now have access to a large practice with end-to-end capabilities from strategy to implementation and managed services. We look forward to continued client success as one team going forward.\"\nTodd Nash , a founding Principal of CBIG expressed his views, \"The hallmark of our success was built on quality teams, value delivery, client satisfaction and lasting partnerships. Being part of Trianz will help us amplify this success to our clients by offering a wider breadth of services, global scale and technology depth. We are excited about joining forces with Trianz and look forward to the opportunity ahead.\"\nAbout CBIG Consulting\nCBIG Consulting is a leader in Business Intelligence, Big Data Analytics, Data Warehousing, and Cloud-based Analytics platforms. Named a top BI and Big Data consulting firm by independent research organizations and publications, CBIG's management consultants, business analysts, data scientists, architects and engineers are seasoned professionals dedicated to the analytics space. CBIG works with global enterprises, mid-size businesses, and non-profit organizations in solving mission-critical reporting and analytical needs. CBIG is headquartered in the Chicago area and has additional offices in San Francisco, Boston, Denver, Austin, Raleigh, Irvine and Seattle. http://www.cbigconsulting.com\nAbout Trianz\nTrianz simplifies digital evolutions through effective strategies and excellence in execution. Collaborating with business and technology leaders, we help formulate and execute operational strategies to achieve intended business outcomes by bringing the best of consulting, technology experiences and execution models. Powered by knowledge, research, and perspectives, we enable clients to transition to a digital enterprise by leveraging Infrastructure, Cloud, Analytics, Digital and Security paradigms. With offices in Silicon Valley, Washington DC Metro, Jersey City, Bangalore, Hyderabad, and Chennai, we serve Fortune 1000 and emerging organizations across industries globally. http://www.trianz.com\nMedia Contact\nPrashant Bhavaraju\nVice President - Marketing\nreach@trianz.com\n+1-408-387-5800\nhttp://www.trianz.com\nSOURCE Trianz", "external_links": ["https://www.trianz.com/about-us/team", "https://www.trianz.com/cloud/microsoft", "https://www.trianz.com/cloud/aws", "https://www.trianz.com/technology/infrastructure", "http://www.cbigconsulting.com/", "https://www.trianz.com/technology/security", "https://www.trianz.com/technology/cloud", "https://www.trianz.com/technology/analytics", "https://www.trianz.com/technology/digital", "http://www.cbigconsulting.com/todd_nash/", "http://trianz.com/"], "published": "2018-01-10T17:00:00.000+02:00", "crawled": "2018-01-10T18:52:13.022+02:00", "highlightTitle": ""}