{"organizations": [], "uuid": "66ef1bf7a9347ce66f97d266771916f0da7589c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-corporate-partner-joins-norton-rose-fulbright-in-houston.html", "country": "US", "domain_rank": 767, "title": "Corporate Partner Joins Norton Rose Fulbright in Houston", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-04T20:00:00.000+02:00", "replies_count": 0, "uuid": "66ef1bf7a9347ce66f97d266771916f0da7589c8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-corporate-partner-joins-norton-rose-fulbright-in-houston.html", "ord_in_thread": 0, "title": "Corporate Partner Joins Norton Rose Fulbright in Houston", "locations": [], "entities": {"persons": [{"name": "william d. davis ii", "sentiment": "negative"}, {"name": "norton rose fulbright", "sentiment": "negative"}, {"name": "norton rose fulbrigh", "sentiment": "none"}, {"name": "daryl lansdale", "sentiment": "none"}, {"name": "gene lewis", "sentiment": "none"}, {"name": "william davis", "sentiment": "none"}, {"name": "baker mckenzie", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "houston houston", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "us securities and exchange commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON--(BUSINESS WIRE)-- Norton Rose Fulbright today announced that William D. Davis II, an accomplished corporate, M&A and securities lawyer, has joined the global law firm as a partner in its Houston office. He comes to Norton Rose Fulbright from Baker McKenzie.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180104005939/en/\nWilliam Davis, Norton Rose Fulbright (Photo: Business Wire)\nDavis focuses on a wide range of corporate and transactional matters, including securities offerings, US Securities and Exchange Commission reporting obligations, mergers and acquisitions, corporate governance issues, corporate restructurings, redomestications, capital financings as well as general corporate and securities law matters.\nDaryl Lansdale, Norton Rose Fulbright’s US Managing Partner, said:\n“Will’s corporate knowledge and client-first mindset complement our approach of providing superior service. His experience across a broad range of industries enhances to our transactional offerings in Houston.”\nGene Lewis, Norton Rose Fulbright’s US Head of Business Practice, commented:\n“Will is an exceptional deal lawyer who bolsters our impressive corporate group. He is highly respected for his M&A and securities work, especially in the energy and healthcare sectors.”\nDavis, who is admitted to practice in Texas, Maryland and New York, said:\n“Norton Rose Fulbright offers a wonderful opportunity to collaborate with some of the finest corporate lawyers in the world. I have always been impressed with their corporate team, and I look forward to introducing my clients to the firm’s tremendous global reach.”\nDavis received his LLM from the Georgetown University Law Center, his JD from the University of Tulsa College of Law and his BA from Franklin & Marshall College.\nNotes for editors:\nNorton Rose Fulbright\nNorton Rose Fulbright is a global law firm providing the world’s preeminent corporations and financial institutions with a full business law service. The firm has more than 4,000 lawyers and other legal staff based in Europe, the United States, Canada, Latin America, Asia, Australia, Africa and the Middle East.\nRecognized for its industry focus, Norton Rose Fulbright is strong across all the key industry sectors: financial institutions; energy; infrastructure, mining and commodities; transport; technology and innovation; and life sciences and healthcare. Through its global risk advisory group, the firm leverages its industry experience with its knowledge of legal, regulatory, compliance and governance issues to provide clients with practical solutions to the legal and regulatory risks facing their businesses.\nNorton Rose Fulbright operates in accordance with its global business principles of quality, unity and integrity, aiming to provide the highest possible standard of legal service in each of its offices and to maintain that level of quality at every point of contact.\nNorton Rose Fulbright Verein, a Swiss verein, helps coordinate the activities of Norton Rose Fulbright members but does not itself provide legal services to clients. Norton Rose Fulbright has offices in more than 50 cities worldwide, including London, Houston, New York, Toronto, Mexico City, Hong Kong, Sydney and Johannesburg. For more information, see nortonrosefulbright.com/legal-notices .\nLaw around the world\nnortonrosefulbright.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005939/en/\nNorton Rose Fulbright\nDan McKenna, +1 713 651 3576\nNational Director of Communications\ndan.mckenna@nortonrosefulbright.com\nSource: Norton Rose Fulbright", "external_links": ["http://www.businesswire.com/news/home/20180104005939/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fnortonrosefulbright.com%2Flegal-notices&esheet=51737972&newsitemid=20180104005939&lan=en-US&anchor=nortonrosefulbright.com%2Flegal-notices&index=1&md5=55d5f887d38bdc09b50077a43eddbfcf", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.nortonrosefulbright.com%2F&esheet=51737972&newsitemid=20180104005939&lan=en-US&anchor=nortonrosefulbright.com&index=2&md5=0949560319824c23eb211407f74ae119"], "published": "2018-01-04T20:00:00.000+02:00", "crawled": "2018-01-04T20:32:17.030+02:00", "highlightTitle": ""}