{"organizations": [], "uuid": "8a91945011ef12626b5ca5eee8c952d9f9f142c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-judy-d-olian-appointed-quinnipiac-universitys-ninth-president.html", "country": "US", "domain_rank": 767, "title": "Judy D. Olian appointed Quinnipiac University's ninth president", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-30T00:00:00.000+02:00", "replies_count": 0, "uuid": "8a91945011ef12626b5ca5eee8c952d9f9f142c6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-judy-d-olian-appointed-quinnipiac-universitys-ninth-president.html", "ord_in_thread": 0, "title": "Judy D. Olian appointed Quinnipiac University's ninth president", "locations": [], "entities": {"persons": [{"name": "john e. anderson cha", "sentiment": "negative"}, {"name": "judy d. olian", "sentiment": "negative"}, {"name": "weldon", "sentiment": "none"}, {"name": "olian", "sentiment": "none"}, {"name": "judy", "sentiment": "none"}, {"name": "william weldon", "sentiment": "none"}, {"name": "john l. lahey", "sentiment": "none"}, {"name": "judy olian", "sentiment": "none"}], "locations": [{"name": "conn.", "sentiment": "none"}, {"name": "hamden", "sentiment": "none"}, {"name": "lahey", "sentiment": "none"}], "organizations": [{"name": "quinnipiac university", "sentiment": "negative"}, {"name": "board of trustees", "sentiment": "none"}, {"name": "quinnipiac", "sentiment": "none"}, {"name": "ucla", "sentiment": "none"}, {"name": "ucla anderson school of management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HAMDEN, Conn., Jan. 29, 2018 /PRNewswire-USNewswire/ -- Judy D. Olian, dean and John E. Anderson Chair of Management at the UCLA Anderson School of Management, has been appointed the ninth president of Quinnipiac University. The announcement was made by Chairman of the Board of Trustees William Weldon '71 following the trustees' meeting on Jan. 29.\n\"Judy Olian brings a rich combination of academic and intellectual expertise, an innovative and student-centered focus, fundraising successes and leadership qualities at a global level to Quinnipiac University,\" Weldon said. \"Her ability to lead an internationally renowned business school, together with her demonstrated success in shaping a global strategy for the entire UCLA community, make her uniquely qualified to lead Quinnipiac to even greater heights. The board and I look forward to working with Judy to continue building on the incredible success that is Quinnipiac today.\"\nOlian officially will succeed Quinnipiac President John L. Lahey on July 1, 2018, and will visit the university periodically to prepare for the transition. Lahey, who has been president of Quinnipiac since 1987, announced his plans to retire last April, and the board of trustees conducted a national search for his replacement.\n\"The opportunity to lead Quinnipiac University is especially gratifying,\" Olian said. \"Quinnipiac achieves strong alignment between learning and market needs and impacts a broad mix of students and professionals through life-changing development and career opportunities. Quinnipiac is a very nimble, bold and creative institution. I believe that Quinnipiac can be a model for higher education, preparing young people and professionals for work, life and citizenry in the 21 st century.\"\n\"This is an exciting time for Quinnipiac University,\" Lahey said. \"We wish Dr. Judy Olian the best of luck as she builds on the success forged by our students, faculty and staff, working with the Quinnipiac community to move our institution to even greater levels of achievement.\"\nWeldon said, \"Quinnipiac sought a visionary leader energized by the opportunity of leading our university at a pivotal moment in its history. That leader is Judy Olian. She will develop and articulate a vision for the future of the university with stakeholders, including an entrepreneurial board and engaged community of faculty, students, staff and alumni that embraces new ideas and innovative educational programs. We are confident she will build on the university's current momentum and strong foundation and will lead Quinnipiac to further impact and national recognition.\"\nOlian was recommended to the full board of trustees by a search committee of trustees that included Weldon, Vice Chairman Carlton Highsmith, Vice Chairman David Nelson '81, Trustee William Ayers '70, and Trustee Marybeth Noonan '82. The search committee was guided in its efforts by the global search firm of Spencer Stuart, which helps the world's preeminent academic institutions identify and recruit leaders with the talent and credentials to thrive in today's complex academic landscape.\nThe initial phase of the search included significant input from all campus constituencies, including trustees, faculty, staff, alumni and students, followed by open sessions with those same groups. The next phase included the establishment of a 14-member advisory committee that was widely representative of the university community. The advisory committee reviewed the candidates, assisted the search committee in its deliberations and interviewed the finalists.\nAs dean and John E. Anderson Chair in Management at UCLA since 2006, Olian directs a graduate business school that is universally regarded as a leader and innovator in higher education, annually providing management education across master's and doctoral programs, and to more than 2,000 working professionals through executive education programs. The school has several internationally recognized research centers and a global alumni network of more than 38,000 graduates.\n\"During her time here, more than half of Anderson's current faculty were hired, bringing outstanding new scholars and content into the research and teaching programs,\" said Scott L. Waugh, executive vice chancellor and provost at UCLA. \"Four new research centers, the social impact initiative and the Anderson Venture Accelerator were launched; degree programs were introduced and expanded; hybrid coursework combining online and face-to-face learning became part of the school's portfolio; and gender diversity among faculty and students increased significantly. Chancellor Block and I agree that Judy has shown extraordinary skill in increasing Anderson's global reputation and through her tireless efforts, she has created a loyal, engaged and effective alumni network.\n\"Also during Judy's tenure, UCLA Anderson created an innovative, self-supporting financial model that is unique for the University of California. As a dedicated and highly successful fundraiser, Judy and her team attracted $400 million in philanthropic support.\"\nThe Anderson School's Board of Advisors also has expanded, attracting many prominent business leaders who represent diverse functional and global perspectives. Olian served as the 2008 chairman of the Association to Advance Collegiate Schools of Business (AACSB International), the premier business accrediting and management thought leadership organization in the world.\n\"She has been vital in attracting an influential set of board members around the school and its centers,\" Waugh said, \"enabling the naming of three research centers, 13 term and endowed professorships, numerous student fellowships and programming, and the new Marion Anderson Hall, which is currently under construction.\"\nAt UCLA, Olian was known for her commitment to academic and teaching excellence as well as her work as a consensus-building leader and a strong advocate for gender equity.\n\"Judy's impact has been felt across the university. She is a global thinker, advancing the campus's global strategic priorities alongside Anderson's expanding international footprint,\" Waugh said. \"She served for 10 years as chair of UCLA's Council of Professional School Deans, is a member of the board of UCLA's Technology Development Corporation, and was involved in many campus-wide strategic initiatives, committees and advisory groups. She is also a close friend to many of us on the UCLA leadership team.\"\nOlian earned her bachelor's degree in psychology from Hebrew University in Jerusalem, and her master's degree and PhD in industrial relations at the University of Wisconsin, Madison.\nView original content with multimedia: http://www.prnewswire.com/news-releases/judy-d-olian-appointed-quinnipiac-universitys-ninth-president-300589649.html\nSOURCE Quinnipiac University", "external_links": ["http://www.prnewswire.com/news-releases/judy-d-olian-appointed-quinnipiac-universitys-ninth-president-300589649.html"], "published": "2018-01-30T00:00:00.000+02:00", "crawled": "2018-01-30T04:13:59.023+02:00", "highlightTitle": ""}