{"organizations": [], "uuid": "db3d3cb6e15898c6d31a6f5e7d676c9c1e7267c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INcricketNews\r", "section_title": "Reuters: Cricket News", "url": "https://in.reuters.com/article/cricket-test-zaf-ind/cricket-india-weather-early-storm-from-south-african-quicks-in-third-test-idINL8N1PJ2K9", "country": "US", "domain_rank": 408, "title": "Cricket-India weather early storm from South African quicks in third test", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T12:30:00.000+02:00", "replies_count": 0, "uuid": "db3d3cb6e15898c6d31a6f5e7d676c9c1e7267c3"}, "author": "", "url": "https://in.reuters.com/article/cricket-test-zaf-ind/cricket-india-weather-early-storm-from-south-african-quicks-in-third-test-idINL8N1PJ2K9", "ord_in_thread": 0, "title": "Cricket-India weather early storm from South African quicks in third test", "locations": [], "entities": {"persons": [{"name": "virat kohli", "sentiment": "none"}, {"name": "kohli", "sentiment": "none"}, {"name": "lokesh rahul", "sentiment": "none"}, {"name": "cheteshwar pujara", "sentiment": "none"}, {"name": "vernon philander", "sentiment": "none"}, {"name": "quinton de kock", "sentiment": "none"}], "locations": [{"name": "south afri", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 10:31 AM / Updated 19 hours ago Cricket-India weather early storm from South African quicks in third test Reuters Staff 3 Min Read \nJOHANNESBURG, Jan 24 (Reuters) - India weathered a pace barrage from South Africa to go to lunch on 45 for two on the opening day of the third and final test at The Wanderers in Johannesburg on Wednesday. \nThe tourists won the toss and opted to bat on a wicket with plenty of grass and the home bowlers exploited the conditions superbly, beating the bat on numerous occasions, but also spurning a couple of key opportunities. \nIndia captain Virat Kohli will resume after the interval on 24 not out, along with the patient Cheteshwar Pujara, who took an astonishing 54 balls to get off the mark, and is five not out. \nBoth sides have picked an all-seam attack for the game and it was a brave decision of Kohli to bat first under heavy skies. \nThey lost opener Lokesh Rahul (zero) early when he edged the excellent Vernon Philander (1-1 in eight overs), playing in his 50th test, to wicketkeeper Quinton De Kock. \nIndia’s openers have struggled in this series against the new ball, averaging just 12.30 before losing their first wicket, and it was soon two down as Murali Vijay (seven) also edged to De Kock, this time off Kagiso Rabada (1-15). \nIndia were battling to stay in the game at that point against the seaming ball, but had two pieces of luck before lunch. \nPhilander spilled the opportunity to grab the big wicket of Kohli when the latter top-edged a pull off Rabada to mid-off, but the South African failed to hang on to what looked a simple chance. \nLungi Ngidi had, three balls earlier, struck the back leg of Pujara with a delivery that cut in. Umpire Ian Gould turned down the appeal and South Africa did not review the decision. \nHad they done so, replays showed the ball was crashing into leg-stump and Gould would have been forced to overturn his decision. \nSouth Africa have made just one change for the match with all-rounder Andile Phehlukwayo replacing spinner Keshav Maharaj. India have made two changes as batsman Ajinkya Rahane and seamer Bhuvneshwar Kumar take over from Rohit Sharma and Ravichandran Ashwin respectively. \nThe home side have already claimed the series with an unassailable 2-0 lead, but are chasing a first ever clean-sweep against India. (Reporting By Nick Said; Editing by Christian Radnedge)", "external_links": [], "published": "2018-01-24T12:30:00.000+02:00", "crawled": "2018-01-25T06:23:12.005+02:00", "highlightTitle": ""}