{"organizations": [], "uuid": "3be280bde42656a877a269af59866455b0bd1aa1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220271548&w=1200&r=LYNXMPEE070TQ", "site_section": "http://feeds.reuters.com/reuters/technologyNews\r", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-israel-antitrust-internet/israels-anti-trust-regulator-to-look-at-internet-giants-idUSKBN1EX1AQ", "country": "US", "domain_rank": 408, "title": "Israel's anti-trust regulator to look at internet giants", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:40:00.000+02:00", "replies_count": 0, "uuid": "3be280bde42656a877a269af59866455b0bd1aa1"}, "author": "", "url": "https://www.reuters.com/article/us-israel-antitrust-internet/israels-anti-trust-regulator-to-look-at-internet-giants-idUSKBN1EX1AQ", "ord_in_thread": 0, "title": "Israel's anti-trust regulator to look at internet giants", "locations": [], "entities": {"persons": [{"name": "michal halperin", "sentiment": "none"}, {"name": "halperin", "sentiment": "none"}, {"name": "maayan lubell", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "economic affairs committee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  jerusalem", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "anti-trust authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JERUSALEM (Reuters) - Israel’s anti-trust regulator said it will look at the business practices of internet giants such as Facebook and Google to make sure they are not stifling competition.\n“We will look closely at the activity of the internet giants to see whether they are abusing their power and breaching the Anti-Trust Authority’s rules,” the head of the authority, Michal Halperin, told parliament’s Economic Affairs Committee.\n“The big internet companies, such as Google and Facebook have a sufficient presence in Israel in terms of anti-trust laws ... the law applies to them even if they are not registered in Israel,” Halperin said.\nThe authority would examine whether such companies were misusing their advantages in order to push other players out and monopolize the market, she said.\nRepresentatives for Facebook and Google who were at the meeting said they were law abiding and provided a platform for Israeli businesses to thrive.\nAs in other countries, Israel’s traditional media market faces a crisis in the digital age as advertising shrinks and revenues fall.\nGoogle and Facebook take an estimated 80 percent of advertising revenues in Israel of between 1.5 billion shekel and 1.7 billion shekels ($436 mln-$494 mln) a year.\n“The problems in the Israeli advertising market did not start with Google,” Noa Elefant, Google’s head of public policy in Israel, told the meeting.\nHalperin told Reuters she expected the regulator to complete its work in 2018.\nIn November the head of Israel’s Tax Authority said Israel was joining efforts by the European Union and several countries to get the internet giants to pay more tax. [nL8N1NL3GY]\nCorporate taxation has become a hot topic in the wake of revelations of tax avoidance schemes by multinationals, leading to calls for companies to pay more tax.\nFacebook said in December it would start booking advertising revenue locally instead of re-routing it via its international headquarters in Dublin. [nL8N1OC516]\n“We’ll pay tax in Israel for revenue that comes from Israel,” said Jordana Cutler, head of policy and communications at Facebook Israel, without elaborating.\n($1 = 3.4388 shekels)\nReporting by Maayan Lubell; Editing by Susan Fenton\n ", "external_links": [], "published": "2018-01-08T15:40:00.000+02:00", "crawled": "2018-01-08T16:04:06.024+02:00", "highlightTitle": ""}