{"organizations": [], "uuid": "0ec14b8aabb504a20955018df3fa5cc3c995b33c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/india-morningcall/morning-news-call-india-january-31-idUSL4N1PQ1R0", "country": "US", "domain_rank": 408, "title": "Morning News Call - India, January 31", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T05:36:00.000+02:00", "replies_count": 0, "uuid": "0ec14b8aabb504a20955018df3fa5cc3c995b33c"}, "author": "", "url": "https://www.reuters.com/article/india-morningcall/morning-news-call-india-january-31-idUSL4N1PQ1R0", "ord_in_thread": 0, "title": "Morning News Call - India, January 31", "locations": [], "entities": {"persons": [{"name": "kiran koteshwar", "sentiment": "none"}, {"name": "jayant sinha", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}], "organizations": [{"name": "reuters sta", "sentiment": "neutral"}, {"name": "dabur india", "sentiment": "none"}, {"name": "spicejet", "sentiment": "none"}, {"name": "rewa ultra mega solar", "sentiment": "none"}, {"name": "icici bank", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "indian renewable energy development agency", "sentiment": "none"}, {"name": "hindustan construction", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "To access the newsletter, click on the link: here If you would like to receive this newsletter via email, please register at: here FACTORS TO WATCH 9:30 am: Junior Aviation Minister Jayant Sinha, SpiceJet CFO Kiran Koteshwar and other aviation industry officials at CAPA event in Mumbai. 11:30 am: Manpasand Beverages post-earnings analyst conference call in Mumbai. 12:00 pm: Indian Renewable Energy Development Agency and Rewa Ultra Mega Solar to sign sub loan agreement in New Delhi. 12:30 pm: M&M Chief of Sales & Marketing at launch of its digital platform in Mumbai. 12:30 pm: Ford’s global preview of its Compact Utility Vehicle in New Delhi. 3:00 pm: Engineers India post-earnings analyst conference call in Mumbai. 4:00 pm: Dabur India post-earnings analyst conference call in Mumbai. 4:30 pm: Arvind post-earnings analyst conference call in Mumbai. 4:30 pm: Hindustan Construction post-earnings analyst conference call in Mumbai. 5:00 pm: ICICI Bank post-earnings conference call in Mumbai. 6:30 pm: Vedanta post-earnings analyst conference call in Mumbai. LIVE CHAT-LUXURY GOODS An outlook for the luxury goods market with Scilla Huang Sun, Portfolio Manager, GAM at 1530 IST. To join the conversation, click on the link: here INDIA TOP NEWS • IOC Q3 profit beats estimates on higher inventory gains Indian Oil Corp said its third-quarter profit nearly doubled, handily beating estimates, as the company booked higher inventory gains due to a sharp rise in global oil prices. • Indian gold demand wanes as jewellers expect import tax cut in budget Gold prices in India, the world's second-biggest user of the precious metal, were at discounts as jewellers were postponing purchases on the expectation that the government will announce an import tax cut in its annual budget on Thursday. • Walmart in talks to buy minority stake in Flipkart-report U.S. retailer Wal-Mart Stores is in advanced talks to buy a minority stake in e-commerce firm Flipkart, Indian financial daily the Economic Times reported on Tuesday. • Saudi Aramco considering expansion to India- Nikkei Saudi Aramco, the state oil company of Saudi Arabia, is considering entering India as part of its Asian expansion, Nikkei said on Tuesday, citing Aramco's CEO who said that plans for an Indian refinery are crystallising. • Airtel sees little value in acquiring Nigeria's 9mobile –sources India's largest telecoms operator, Bharti Airtel does not see much value in buying debt-laden Nigerian rival 9mobile and withdrew from submitting a firm bid before the deadline, two industry sources with knowledge of the deal told Reuters. • TVS Motor Q3 profit rises about 16 pct, misses estimates TVS Motor Company reported about 16 percent rise in quarterly profit on Tuesday, helped by higher sales in the motorcycles segment. • Ola eyes Australia market in tussle with global rival Uber Indian ride-hailing company Ola announced plans on Tuesday to enter Australia, marking its first foray outside its home market and intensifying its tussle with U.S. rival Uber Technologies. • Low-cost, long-haul flights from India to boost leisure travel – report The launch of low-cost, long-haul flights by Indian airlines will boost outbound leisure travel and open a multi-billion dollar opportunity for carriers, a report released showed. GLOBAL TOP NEWS • After year of bitter feuds, Trump urges bipartisan cooperation President Donald Trump on Tuesday urged bitterly divided Republicans and Democrats to work toward compromises on immigration and infrastructure after a bruising year of partisan battles that centered on Trump's leadership. • China January factory growth dips to 8-month low as pollution war bites Growth in China's manufacturing sector slowed more than expected in January to an 8-month low in the face of a cooling property market and tighter pollution rules that have curtailed factory output. • Samsung Electronics unveils stock split, record profit as chips sizzle Samsung Electronics said it expects demand for memory chips to remain strong in 2018, as it reported record annual profit driven by a so-called memory chip \"super-cycle\" and announced a 50:1 stock split. LOCAL MARKETS OUTLOOK (As reported by NewsRise) • The SGX Nifty Futures were trading at 11,036.00, trading down 0.27 percent from its previous close. • The Indian rupee will likely open lower against the dollar, weighed down by a global sell-off in equities, which may also impact the local shares today, dealers said. • Indian government bonds are likely to gain in early session as crude oil prices continue to fall while investors await tomorrow’s federal budget for further cues. The yield on the 7.17 percent bond maturing in 2028 is likely to trade in a 7.41 percent - 7.45 percent band today. GLOBAL MARKETS • U.S. stocks fell for a second straight day on Tuesday, with the Dow registering its biggest two-day drop since September 2016, pressured by healthcare stocks and rising bond yields. • Asia stocks eased, pulling further back from record highs, as the recent rise in global bond yields weighed on equities. • The dollar held steady against a basket of major rivals, as investors awaited the U.S. Federal Reserve's policy decision and U.S. President Donald Trump's State of the Union address. • U.S. Treasury long-dated yields rose on Tuesday ahead of a slew of events this week such as a Federal Reserve monetary policy decision which could help shed more light on the outlook for interest rates this year. • Oil prices fell for a third day after data from an industry body showed crude stocks rose more than expected last week, while a selloff in other commodities, stocks and bonds added to investors' bearish mood. • Gold marked time early amid a firm dollar and rising bond yields as markets waited for U.S. President Donald Trump's annual State of the Union address and the outcome of the Federal Reserve's two-day meeting. CLOSE FII INVESTMENTS EQUITIES DEBT PNDF spot 63.71/63.74 January 30 $16.49 mln $153.93 mln 10-yr bond yield 7.54 pct Month-to-date $2.08 bln $1.43 bln Year-to-date $2.08 bln $1.43 bln For additional data: India govt bond market volumes Stock market reports Non-deliverable forwards data Corporate debt stories [IN CORPD] Local market closing/intraday levels [IN SNAPSHOT] Monthly inflows [INFLOWS RTRS TABLE IN] ($1 = 63.6800 Indian rupees) (Compiled by Yoganand K N in Bengaluru)\n ", "external_links": [], "published": "2018-01-31T05:36:00.000+02:00", "crawled": "2018-01-31T05:52:30.018+02:00", "highlightTitle": ""}