{"organizations": [], "uuid": "7e869648ce3179cda404cce780970a721e62aec4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223467088&w=1200&r=LYNXMPEE0I1RE", "site_section": "http://feeds.reuters.com/reuters/entertainment", "section_title": "Reuters: Entertainment News", "url": "https://www.reuters.com/article/us-usa-misconduct-producers/hollywood-producers-issue-anti-harassment-guidelines-idUSKBN1F82TB", "country": "US", "domain_rank": 408, "title": "Hollywood producers issue anti-harassment guidelines", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T01:00:00.000+02:00", "replies_count": 0, "uuid": "7e869648ce3179cda404cce780970a721e62aec4"}, "author": "", "url": "https://www.reuters.com/article/us-usa-misconduct-producers/hollywood-producers-issue-anti-harassment-guidelines-idUSKBN1F82TB", "ord_in_thread": 0, "title": "Hollywood producers issue anti-harassment guidelines", "locations": [], "entities": {"persons": [{"name": "lisa", "sentiment": "negative"}, {"name": "lori mccreary", "sentiment": "none"}, {"name": "gary lucchesi", "sentiment": "none"}, {"name": "richwine", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "min read  los angeles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "pga", "sentiment": "none"}, {"name": "producers guild of america", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 11:01 PM / Updated 19 hours ago Hollywood producers issue anti-harassment guidelines Lisa Richwine 3 Min Read \nLOS ANGELES (Reuters) - Hollywood producers on Friday outlined steps aimed at preventing sexual harassment on and off television and movie sets in a response to revelations of misconduct that have shaken the entertainment industry in recent months. \nThe voluntary guidelines from the Producers Guild of America (PGA) recommend that all productions provide in-person anti-sexual harassment training for all cast and crew before the start of each season. \nThey also urge producers to conduct meetings and casting sessions in a “professional, safe and comfortable” environment, among other steps. \n“As producers, we provide key leadership in creating and sustaining work environments built on mutual respect, so it is our obligation to change our culture and eradicate this abuse,” PGA Co-Presidents Gary Lucchesi and Lori McCreary said in a statement. \nThe guidelines are initial recommendations from a task force the PGA created in October after allegations of misconduct against entertainment industry figures including producer Harvey Weinstein, who has been accused by more than 70 women of sexual misconduct, including rape. \nMany of the accusations against Weinstein stemmed from actresses who said they were sent to meetings with him alone in hotel rooms. Weinstein has denied having non-consensual sex with anyone. \nThe PGA expelled Weinstein from the group in October. \nThe new guidelines are especially important for independent productions that are not being done at a movie or TV studio with a human resources department, McCreary said in an interview. \nLucchesi said the steps, which were unanimously ratified by the PGA’s board of directors, are meant to serve as “best practices” for the PGA’s 8,200 members. \n“It’s really about setting the right tone and having the proper behavior,” he said. “You don’t want people to be insensitive anymore.” \nThe recommendations also offer advice to victims of harassment, starting with going to authorities if they believe a crime was committed, and taking notes shortly after an incident. Reporting by Lisa Richwine; editing by Clive McKeef", "external_links": [], "published": "2018-01-20T01:00:00.000+02:00", "crawled": "2018-01-20T01:18:35.018+02:00", "highlightTitle": ""}