{"organizations": [], "uuid": "98dfc2747d22d1f6a2136623906844b265603e45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225077096&w=1200&r=LYNXMPEE0O0E0", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/uk-europe-view-thursday/daily-briefing-talking-down-the-euro-idUKKBN1FE0UX", "country": "US", "domain_rank": 408, "title": "Daily Briefing: Talking down the euro", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T10:37:00.000+02:00", "replies_count": 0, "uuid": "98dfc2747d22d1f6a2136623906844b265603e45"}, "author": "", "url": "https://uk.reuters.com/article/uk-europe-view-thursday/daily-briefing-talking-down-the-euro-idUKKBN1FE0UX", "ord_in_thread": 0, "title": "Daily Briefing: Talking down the euro", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "mario draghi", "sentiment": "none"}, {"name": "draghi", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters st", "sentiment": "negative"}, {"name": "ecb", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 8:40 AM / Updated 7 hours ago Daily Briefing: Talking down the euro Reuters Staff 9 Min Read \nLONDON (Reuters) - With no policy action or change to the bank's guidance expected from the ECB today, the focus will instead be on how its president Mario Draghi deals with the rapidly strengthening euro , a fruit of the region's solid recovery but also a hindrance to the return of a healthy dose of inflation. “The euro area economy is blowing consensus forecasts out of the water” JPMorgan economist Greg Fuzesi \nOne way might be to talk down any speculation that the bank is anywhere near an interest rate hike, but the messaging is particularly delicate given the strength of the underlying economy. As usual, the ECB announces its rate decision at 1245 GMT, with Draghi’s news conference at 1330 GMT. \nGermany's Angela Merkel and France's Emmanuel Macron choreographed a joint warning of the dangers of rising nationalism yesterday at Davos. \nToday it is British PM Theresa May's turn to take to the stage with what is being trailed as a call for investors to push internet firms to be more proactive in stopping militants and paedophiles from using their platforms . May has repeatedly called on the likes of Facebook and Twitter to engage more; by effectively going over their heads now to appeal to their shareholders, she is going one step further in what is currently one of the big battle lines in the debate over corporate responsibility. \nFor years, a row with Greece over the name of Macedonia has prevented the small southeastern country fulfilling its ambitions to be part of NATO and the EU. Macedonia took that name when it declared independence from Yugoslavia in 1991, but Greece has disputed it since, saying it implies territorial claims to a Greek province of the same name. \nNow there seems to be signs of movement, with Macedonia saying it will change the name of its airport: its current title, Skopje Alexander the Great Airport, particularly riles Athens because Macedonia is also the name of the ancient Greek kingdom ruled by Alexander. \nThat could help find a compromise over the name of the country itself. Greek PM Alexis Tsipras is keen to include solving the stand-off as part of his legacy but mass demonstrations in Greece this weekend against concessions to Skopje show how delicate a topic this is for him ahead of next year’s elections. \nMARKETS \nThe U.S. dollar’s accelerating slide this year, cheered on by the U.S. Treasury Secretary Mnuchin in Davos on Wednesday, has taken centre stage in world markets. \nThe dollar index against the most traded world currencies lost more than 1 percent yesterday - its biggest one-day drop since last June to a three-year low. And it continues to slip early on Thursday, with euro/dollar pushing above $1.24 for the first time since December 2014, dollar/yen dipping below $109 for the first time since September and sterling popping briefly above $1.43 for the first time since the immediate aftermath 2016 Brexit referendum. China’s yuan hit its strongest level since November 2015. German Chancellor Angela Merkel gives a speech during the World Economic Forum annual meeting in Davos, January 24, 2018 “Trade war has been in place for quite a little while, the difference is the U.S. troops are now coming to the ramparts” U.S. Commerce Secretary Wilbur Ross \nThe impact of a falling dollar plays out in many ways. On one hand, the resulting surge in euro and yen and its dampening effect on already low inflation in those countries may well stay the hands of the   and Bank of Japan in any attempt to tightening ultra-loose monetary policy – a major anxiety in the first few weeks of this year. \nToday’s ECB meeting is Thursday’s main focus in that regard as many market players have mulled a possible change of guidance from ECB chief Draghi. What’s more, the falling dollar may also supercharge this year’s tax-related upward earnings revisions for the U.S. multinationals with big overseas markets. What’s more, it also lifts the oil price and energy sector and Brent crude topped $71 for the first time since 2014 overnight. \nOn the other hand, it crimps European and Japanese earnings and exports, possibly rattles the cage of the Federal Reserve’s inflation watchers and – to the extent the Trump administration is welcoming its decline as a boost U.S. trade competitiveness – underscores the rising risk of a protectionist push by Washington. \nTariffs on solar panels and washing machines this month are one move but there is growing anxiety about how the U.S. will react to investigations into Chinese intellectual property practices and steel imports. That puts this week’s visit by Trump to Davos in the frame and next week’s State of the Union address. \nWall St wobbled a bit on Wednesday as Commerce Secretary Ross warned China on IP and trade . Asia bourses were mostly lower overnight too, with Europe opening in the red. \nDAVOS", "external_links": [], "published": "2018-01-25T10:37:00.000+02:00", "crawled": "2018-01-25T11:17:33.004+02:00", "highlightTitle": ""}