{"organizations": [], "uuid": "24849739cce9e9d461bb0b86fdf99024a5ad97ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-leading-retail-auto-industry-law-firm-rebrands-as-scali-rasmussen.html", "country": "US", "domain_rank": 767, "title": "Leading Retail Auto Industry Law Firm Rebrands As \"Scali Rasmussen\"", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.48, "site_type": "news", "published": "2018-01-16T21:00:00.000+02:00", "replies_count": 0, "uuid": "24849739cce9e9d461bb0b86fdf99024a5ad97ba"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-leading-retail-auto-industry-law-firm-rebrands-as-scali-rasmussen.html", "ord_in_thread": 0, "title": "Leading Retail Auto Industry Law Firm Rebrands As \"Scali Rasmussen\"", "locations": [], "entities": {"persons": [{"name": "scali rasmussen", "sentiment": "negative"}, {"name": "halbert", "sentiment": "negative"}, {"name": "bert\" rasmussen", "sentiment": "neutral"}, {"name": "rasmussen", "sentiment": "none"}, {"name": "bert", "sentiment": "none"}, {"name": "scali", "sentiment": "none"}, {"name": "christian j. scali", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "manning, leaver, bruder & berberich", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 16, 2018 /PRNewswire/ -- Auto industry expert Halbert \"Bert\" Rasmussen , who joined The Scali Law Firm in 2017, will share the firm's title, the firm announced today.\nThe change to Scali Rasmussen is a major milestone in the development of the firm Christian J. Scali founded in 2013 to bring to dealerships and other clients a deep understanding of the automotive industry and relevant state and federal laws and regulations.\nScali says the name change was appropriate because, \"We want to recognize Bert's incredible contribution to our firm and to the collective retail automotive industry.\" He and Rasmussen have been colleagues and close allies and peers for many years. They worked together for over a decade at Manning, Leaver, Bruder & Berberich.\nThe name change is the latest advancement in the expansion of the firm's practice, which now includes 17 lawyers in five offices.\n\"Our clients are all over the country and include mom and pop auto dealerships, dealer groups and publicly held dealer companies, as well as international advertising, technology and retail companies. It's time to reflect that footprint in our name,\" Scali continued.\n\"I'm honored to be such a significant part of the firm's expansion,\" added Rasmussen, previously a partner at Arent Fox LLP.\n\"I have seen many law firms that purport to be auto dealer firms, but they fall down in failing to have that deep bench of knowledge and experience in franchise, regulatory, transactional and labor and employment law, in addition to being top notch litigators and trial attorneys,\" Rasmussen said.\nRasmussen has a broad history working with the firm's attorneys. At Manning Leaver, he worked with Scali and Robert Daniels ; at Arent Fox, he worked with Melanie Joo . Rasmussen worked with Monica Baumann during her tenure as the California New Car Dealers Association 's Director of Legal and Regulatory Affairs.\nRasmussen has delivered critical wins for clients in litigation, franchising, and corporate transactions. For example, he successfully tried a case to victory for a purchaser of a multi-million dollar new car dealership against claims that another dealer group had already purchased the business. Among his noteworthy successes in franchise protests on behalf of dealer clients, he prevailed against a determined manufacturer's efforts to terminate a dealer who allegedly deliberately exported new vehicles and fraudulently covered up that conduct. Rasmussen represents clients in virtually all forms of corporate, business and real estate transactions in the automotive dealership business and has handled some of the first significant equity growth investments by family offices and private equity groups in dealership groups.\nThe firm's Regulatory and Licensing Practice Chair, Melanie S. Cliff (Joo), has managed 50-state regulatory reviews for start-up and tech clients, helping them navigate the regulatory maze and compliantly build or modify their platforms and successfully handled dealer licensing for national and regional dealer groups coming into California.\nAnother recent arrival to the growing firm is Labor and Employment Practice Co-Chair, Jack Schaedel , who has successfully tried and arbitrated numerous employment cases and even obtained a staggering $1M reverse fee award for a company for whom he defensed an employment case. Schaedel brings over 20 years of experience advising and representing California employers to the dealerships and other entities he and the Firm now serve together.\nScali Rasmussen's Proposition 65 Practice Chair, Bruce Nye , has tried over fifty jury and bench cases, including the landmark Proposition 65 case, Baxter Healthcare Corporation v. Denton (2004) 120 Cal.App.4th 333. Baxter Healthcare stands for the propositions that there is no obligation to provide a warning of exposures to chemicals when a company can prove that they are not toxic to humans, and that a company can establish the absence of a duty to warn in a declaratory judgment action.\nScali, the firm's Managing Partner, has tried and arbitrated numerous complex business and franchise cases, including successfully defensing consumer and employee class action lawsuits. As Defense Steering Counsel in the infamous Trygar case brought against the entire retail auto dealer industry in the late 1990s, he and Bruce Nye developed the strategy that resulted in a dismissal of all but the four named defendant dealerships in that case. Scali was also instrumental in the joint effort to obtain disciplinary action against the Trevor Law Group, a notorious law firm that preyed on small businesses, including auto dealers, auto body shops, nail salons and small restaurants, seeking compensation for technical regulatory violations where their clients had not suffered injury.\nScali is enthusiastic about the firm's future. \"We've assembled a strong team in under five years. We think the next five will bring even more success for our clients. We are tackling cutting-edge issues affecting the auto distribution and financing network, advising clients on cryptocurrency, ride-sharing platforms, and digital sales and finance models.\"\nScali and Rasmussen are prolific authors on issues of importance to business. They have authored books, published by the National Automobile Dealer Association (NADA) and the California New Car Dealers Association, including Rasmussen's \"A Dealer Guide to the FTC Red Flags and Address Discrepancy Rule.\" They have also has been published in many dealer and professional publications and have contributed to the California New Car Dealers Association's Advertising Law Manual and Franchise Law Manual, respectively. Rasmussen has received the AV ® Peer-Review Rating by Martindale-Hubbell.\nFor more information, visit ScaliRasmussen.com .\nView original content: http://www.prnewswire.com/news-releases/leading-retail-auto-industry-law-firm-rebrands-as-scali-rasmussen-300583229.html\nSOURCE Scali Rasmussen", "external_links": ["http://scalilaw.com/attorneys/halbert-rasmussen", "http://scalilaw.com/attorneys/melanie-joo", "http://scalilaw.com/attorneys/monica-baumann", "http://scalilaw.com/attorneys/bruce-nye", "http://scalirasmussen.com/", "http://scalilaw.com/attorneys/jack-schaedel", "http://scalilaw.com/", "http://scalilaw.com/attorneys/christian-scali", "http://www.prnewswire.com/news-releases/leading-retail-auto-industry-law-firm-rebrands-as-scali-rasmussen-300583229.html", "http://www.cncda.org/", "http://scalilaw.com/attorneys/robert-daniels"], "published": "2018-01-16T21:00:00.000+02:00", "crawled": "2018-01-16T21:03:28.023+02:00", "highlightTitle": ""}