{"organizations": [], "uuid": "c083736846791f0eefd1150adc779060e26e881a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-900773838.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/03/protests-in-iran/", "country": "US", "domain_rank": 1196, "title": "Here's What the Protests in Iran Are About | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.799, "site_type": "news", "published": "2018-01-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "c083736846791f0eefd1150adc779060e26e881a"}, "author": "Grace Donnelly", "url": "http://fortune.com/2018/01/03/protests-in-iran/", "ord_in_thread": 0, "title": "Here's What the Protests in Iran Are About | Fortune", "locations": [], "entities": {"persons": [{"name": "mahmoud ahmadenijad", "sentiment": "none"}, {"name": "hassan rouhani", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "mashhad", "sentiment": "none"}], "organizations": [{"name": "washington post", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "green movement", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Grace Donnelly January 3, 2018 \nTens of thousands of people have taken to the streets in protest in Iran, which has resulted in at least 21 deaths and hundreds arrested. \nThis is the third major uprising in the country in the last two decades. Student protests in July 1999 led to demonstrations over free speech and public dispute over the re-election of then-President Mahmoud Ahmadenijad began the Green Movement in June 2009 . \nThe current demonstrations by the Iranian people , which have continued now for six days, are different. What are the protests in Iran about? \nDemonstrations began in the northern city of Mashhad on Dec. 28, largely driven by economic concerns . The country’s unemployment rate for young people, who make up half the population, is at 40%, according to the New York Times . Even basic goods are expensive — eggs saw a 40% increase in price. \nThe Washington Post reported that President Hassan Rouhani’s leak of a government budget proposal sparked the protests. The plan includes unpopular measures like cuts to subsidies for the poor and raising fuel prices to lower debt. \nProtesters are predominantly young Iranian men demanding solutions to unemployment and the rising cost of living . Inflation has decreased slightly and GDP has risen under President Rouhani, but economic improvement is slow. Protesters gather at a demonstration in support of the Iranian people amid a wave of protests spreading throughout Iran, on January 3, 2018, in Brussels. Violent demonstrations have rocked Iran since December 28, 2017, leaving at least 21 people dead, with protests that started over the economy turning against the Islamic regime as a whole. The wave of demonstrations, that kicked off in second city Mashhad on December 28 and quickly spread, is the biggest in the tightly controlled country since unrest over a disputed election in 2009. Emmanuel Dunand/AFP/Getty Images \nInequality and corruption in the country are also driving this wave of protests. Chants of “No to inflation!” and “Down with embezzlers!” make this uprising more focused on economic grievances than issues like freedom of speech and women’s’ rights, which dominated the demands of protesters in the past, according to the New York Times . \nThere is limited data on the income of Iranian families, but in 2014 it was estimated that between 20% and 35% of Iranians lived below the poverty line — a measure the government set at $720 a month for a family of four. \nMeanwhile Iran’s super rich have been able to afford mulitmillion-dollar luxury apartments and Maseratis. The U.S. response and Iranian sanctions \nPresident Donald Trump has signaled support for the Iranian people over the last week, sending tweets about Iran on New Year’s Eve. Iran, the Number One State of Sponsored Terror with numerous violations of Human Rights occurring on an hourly basis, has now closed down the Internet so that peaceful demonstrators cannot communicate. Not good! \n— Donald J. Trump (@realDonaldTrump) December 31, 2017 Iran is failing at every level despite the terrible deal made with them by the Obama Administration. The great Iranian people have been repressed for many years. They are hungry for food & for freedom. Along with human rights, the wealth of Iran is being looted. TIME FOR CHANGE! \nHe tweeted about the protests several times, calling out the government for blocking social media and messaging apps like Instagram and Telegram this week. The people of Iran are finally acting against the brutal and corrupt Iranian regime. All of the money that President Obama so foolishly gave them went into terrorism and into their “pockets.” The people have little food, big inflation and no human rights. The U.S. is watching! \n— Donald J. Trump (@realDonaldTrump) January 2, 2018 Such respect for the people of Iran as they try to take back their corrupt government. You will see great support from the United States at the appropriate time! \n— Donald J. Trump (@realDonaldTrump) January 3, 2018 \n“We want to help amplify the voices of the Iranian people,” U.S. ambassador to the United Nations Nikki Haley said , though it’s unclear what the U.S. can do practically to support the people of the Islamic Republic. Haley sought a Security Council meeting to show support for the protestors . \nPresident Trump has until mid-January to make a decision about economic sanctions in Iran. \nUnder the Obama administration, sanctions on the oil industry in Tehran were lifted in exchange for limits on the country’s nuclear program as part of the 2015 Iran nuclear deal. \nTrump has been a vocal critic of the Iran nuclear deal and imposing new sanctions would put economic pressure on Iranian leadership, but analysts say it could also send the wrong message to the country’s people who are in the midst of challenging their rulers in the most significant uprising Iran has seen since 2009. Next steps for Iran \nThe protests have now gone on for six days and don’t seem to be losing momentum. \nIran’s Supreme Leader Ayatollah Ali Khamenei, who serves as both the head of state and the highest-ranking religious figure in the country, condemned the protests Tuesday. \nA 2013 investigation by Reuters revealed that some of the organizations Ayatollah Khamenei controls have allowed him to amass a fortune. Setad, a foundation meant to help the poor and run by the supreme leader reportedly without oversight, was worth $95 billion at the time. In recent events, enemies of #Iran have allied & used the various means they possess, including money, weapons, politics &intelligence services, to trouble the Islamic Republic. The enemy is always looking for an opportunity & any crevice to infiltrate &strike the Iranian nation. pic.twitter.com/HIXtudRAue \n— Khamenei.ir (@khamenei_ir) January 2, 2018 \nIranian officials blamed the U.S. and other “outside agitators” for the rise of political actions over the last week. \nPro-government protests in Tehran on Wednesday drew thousands to march chanting “Death to America” to show support, according to state TV IRIB . An Iranian woman raises her fist amid the smoke of tear gas at the University of Tehran during a protest driven by anger over economic problems, in the capital Tehran on December 30, 2017. Students protested in a third day of demonstrations sparked by anger over Iran's economic problems, videos on social media showed, but were outnumbered by counter-demonstrators. STR/AFP/Getty Images \nIn the past, Iran has responded to anti-government demonstrations by using force against protesters. The 2009 uprising was met by the Revolutionary Guard and the Basij militia . This wave of unrest has been different because the protests seem spontaneous and there have so far been no identifiable leaders who could be rounded up by authorities . \nOfficials are urging people to avoid violence and, as of Wednesday afternoon, state security forces have not been called in to control protesters. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T02:00:00.000+02:00", "crawled": "2018-01-04T02:31:13.004+02:00", "highlightTitle": ""}