{"organizations": [], "uuid": "ec26bf74364f06e5c8be8fed4df0262a4b353ebf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-micronet-enertec-technologies-signs-definitive-agreement-to-sell-its-defense-and-aerospace-subsidiary-enertec-systems.html", "country": "US", "domain_rank": 767, "title": "Micronet Enertec Technologies Signs Definitive Agreement to Sell its Defense and Aerospace Subsidiary, Enertec Systems", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.238, "site_type": "news", "published": "2018-01-02T16:13:00.000+02:00", "replies_count": 0, "uuid": "ec26bf74364f06e5c8be8fed4df0262a4b353ebf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-micronet-enertec-technologies-signs-definitive-agreement-to-sell-its-defense-and-aerospace-subsidiary-enertec-systems.html", "ord_in_thread": 0, "title": "Micronet Enertec Technologies Signs Definitive Agreement to Sell its Defense and Aerospace Subsidiary, Enertec Systems", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "montvale", "sentiment": "none"}], "organizations": [{"name": "enertec systems", "sentiment": "negative"}, {"name": "micronet enertec technologies signs definitive agreement", "sentiment": "negative"}, {"name": "micronet enertec technologies, inc.", "sentiment": "neutral"}, {"name": "coolisys", "sentiment": "none"}, {"name": "coolisys technologies, inc.", "sentiment": "none"}, {"name": "enertec system", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "enertec systems 2001 ltd", "sentiment": "none"}, {"name": "dpw", "sentiment": "none"}, {"name": "enertec", "sentiment": "none"}, {"name": "dpw holdings, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONTVALE, N.J., Jan. 2, 2018 /PRNewswire/ -- Micronet Enertec Technologies, Inc. (NASDAQCM: MICT), (the \"Company\"), announced today that it has entered into a definitive agreement with Coolisys Technologies, Inc., a subsidiary of DPW Holdings, Inc. (NYSE American: DPW), to sell its wholly owned subsidiary, Enertec Systems 2001 Ltd. Pursuant to the terms of the agreement, Coolisys will pay the Company $5,250,000 in cash upon closing (of which 10% will be held in escrow for up to 14 months after the Closing to satisfy certain potential indemnification claims) and assume $4,000,000 in Enertec bank debt, paying effectively a total of $9,250,000 for all of Enertec's assets and liabilities. The transaction is scheduled to close the later of 60 days as of signing or 15 days after delivery of Enertec System's audited financial statements.\n\"We are extremely excited to enter into this agreement, which strongly supports and fully aligns with our roadmap to increase the value of our Company by focusing all our resources on the MRM space. As the second phase of the Electronic Logging Device (ELD) mandate is now in effect, we believe 2018 will produce an even greater market demand, which we believe may increase the revenues and profitability of our MRM business in the coming years,\" said David Lucatz, Chief Executive Officer of Micronet Enertec Technologies.\n\"This transaction fortifies our balance sheet by increasing our cash position and significantly reducing debt, while improving our income statement by eliminating all General and Administrative costs associated with Enertec. In addition, we believe our improved cash position will enable us to expand our MRM offerings,\" continued David Lucatz.\n\"The sale of Enertec to Coolisys empowers the Company to grow its MRM business more aggressively both organically and through acquisition. As our MRM revenues continue to increase each quarter, we aim to use this momentum and further invest all our focus and efforts to become a leader in the MRM space,\" Lucatz added.\nAbout Micronet Enertec Technologies, Inc.\nMicronet Enertec Technologies, Inc. (NASDAQCM: MICT) provides high tech solutions for severe environments and the battlefield, including missile defense technologies for Aerospace & Defense and rugged mobile devices for the growing commercial Mobile Resource Management (MRM) market. MICT designs, develops, manufactures and supplies customized military computer-based systems, simulators, automatic test equipment and electronic instruments, addressing a multi-billion-dollar defense industry. Solutions and systems are integrated into critical systems such as command and control, missile fire control, maintenance of military aircraft and missiles for the Israeli Air Force, Israeli Navy and by foreign defense entities. MICT's MRM division develops, manufactures and provides mobile computing platforms for the multibillion dollar mobile logistics management market in the U.S., Europe and Israel. American-manufactured systems are designed for outdoor and challenging work environments in trucking, distribution, logistics, public safety and construction.\nForward-looking Statements\nThis press release contains express or implied within the Private Securities Litigation Reform Act of 1995 and other U.S. Federal securities laws. These include, but are not limited to, those statements regarding the expected closing of the sale of Enertec to Coolisys, the Company's belief that 2018 will produce greater MRM market demand that may increase the revenues and profitability of the Company's MRM division in the coming years, the Company's intention to focus its resources on the MRM division and markets and increase its MRM offerings and, as a result of the sale of Enertec to Coolysis, grow its MRM business more aggressively both organically and through acquisition in an effort. to become a leader in the MRM space. Such and their implications involve known and unknown risks, uncertainties and other factors that may cause actual results or performance to differ materially from those projected. The contained in this press release are subject to other risks and uncertainties, including those discussed in the \"Risk Factors\" section and elsewhere in the Company's annual report on Form 10-K for the year ended December 31, 2016 and in subsequent filings with the Securities and Exchange Commission. Except as otherwise required by law, the Company is under no obligation to (and expressly disclaims any such obligation to) update or alter its whether as a result of new information, future events or otherwise.\nView original content: http://www.prnewswire.com/news-releases/micronet-enertec-technologies-signs-definitive-agreement-to-sell-its-defense-and-aerospace-subsidiary-enertec-systems-300576376.html\nSOURCE Micronet Enertec Technologies, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/micronet-enertec-technologies-signs-definitive-agreement-to-sell-its-defense-and-aerospace-subsidiary-enertec-systems-300576376.html"], "published": "2018-01-02T16:13:00.000+02:00", "crawled": "2018-01-02T16:29:56.003+02:00", "highlightTitle": ""}