{"organizations": [], "uuid": "fbd451ee42be657a90891113babc893bc0d8f7dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-pcm-acquires-epoch-universal-a-technology-leader-in-collaboration-solutions.html", "country": "US", "domain_rank": 767, "title": "PCM Acquires Epoch Universal, a Technology Leader in Collaboration Solutions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T17:00:00.000+02:00", "replies_count": 0, "uuid": "fbd451ee42be657a90891113babc893bc0d8f7dd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-pcm-acquires-epoch-universal-a-technology-leader-in-collaboration-solutions.html", "ord_in_thread": 0, "title": "PCM Acquires Epoch Universal, a Technology Leader in Collaboration Solutions", "locations": [], "entities": {"persons": [{"name": "jay miley", "sentiment": "none"}], "locations": [{"name": "el segundo", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "pcm", "sentiment": "negative"}, {"name": "vmware", "sentiment": "none"}, {"name": "pcm, inc.", "sentiment": "none"}, {"name": "epoch universal, inc", "sentiment": "none"}, {"name": "cisco", "sentiment": "none"}, {"name": "epoch universal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EL SEGUNDO, Calif.--(BUSINESS WIRE)-- PCM, Inc. (PCMI), a leading technology solutions provider, today announced that it has acquired certain assets of Epoch Universal, Inc. Based in Southern California, Epoch Universal is an end-to-end IT solutions provider that is highly regarded in its expertise across a wide range of solutions including Unified Collaboration, Networking and Security, Wireless, Data Center and Virtualization, Cloud and other advanced technologies. Epoch Universal employees hold advanced Cisco and VMWare certifications enabling fully integrated enterprise solutions, including managed and professional services, to customers across the United States.\nJay Miley, President of PCM, Inc., stated, “The acquisition of Epoch Universal highlights our strategy of strengthening our services and solutions portfolio through high-end advanced technology solutions such as those offered by Cisco, VMWare and NetApp. Not only does the acquisition increase our capabilities of delivering such solutions to our existing customer base in the United States, but it also deepens our relationships with key manufacturer partners.”\nAs part of the acquisition, Epoch Universal’s President and CEO, Paul Harrold, is joining PCM as its Vice President of Collaboration reporting to Herb Hogue, Senior Vice President of Hybrid Data Center, Security, and Microsoft. In addition, the Epoch Universal operational leadership team, including Ryan Heath, Chief Technology Officer, Dena Colombo, Vice President of Sales, and Lee Edmonson, Vice President of Operations, have agreed to positions with PCM, as has each of the professional and managed service engineers and experts who are well known for their superior work in the marketplace.\nPaul Harrold, Epoch Universal’s President and CEO remarked, “I cannot be more delighted to be joining a team with the breadth of talent and expertise as PCM. The combination of Epoch’s advanced technology solutions and PCM’s vast sales and solutions footprint should enable a win-win for each of our respective customer bases. I look forward to leading PCM’s collaboration practice to new heights in the coming months and years.”\nAbout PCM\nPCM, Inc., through its wholly-owned subsidiaries, is a leading multi-vendor provider of technology solutions, including hardware, software and services to small, medium and enterprise businesses, state, local and federal governments and educational institutions across the United States, Canada and the UK. We generated net sales of $2.2 billion in the twelve months ended September 30, 2017. For more information, please visit investor.pcm.com or call (310) 354-5600.\nForward-looking Statements\nThis press release may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Such forward-looking statements include statements regarding our expectations, hopes or intentions regarding the future, including but not limited to, statements related to our ability to strengthen our services and solutions portfolio through high-end advanced technology solutions, our increased capability of delivering advanced solutions to our existing customer base, and our ability to achieve new heights in our collaboration practice in the coming months and years. Forward-looking statements involve certain risks and uncertainties, and actual results may differ materially from those discussed in any such statement. Factors that could cause our actual results to differ materially include without limitation risks and uncertainties related to the following: risks associated with acquisitions and investments, including the challenges and costs of closing, integration, and achieving anticipated synergies or expected leverage from the acquisition; our ability to attract and retain key employees; our ability to receive expected returns on changes in our sales and services organizations or strategic investments, including without limit, investments in advanced technology solutions and services, our call centers and our international expansion; decreased sales, including but not limited to, potential decreases in sales resulting from the loss of or a reduction in purchases from significant customers; our ability to maintain or integrate our vendor relationships and risks related to changes in vendor programs, warranties and indemnities we may be required to provide to third parties through our commercial contracts; and data security. Additional factors that could cause our actual results to differ are discussed under the heading \"Risk Factors\" in Item 1A, Part II of our Form 10-Q for the year ended September 30, 2017, on file with the Securities and Exchange Commission, and in our other reports filed from time to time with the SEC. All forward-looking statements in this document are made as of the date hereof, based on information available to us as of the date hereof, and we assume no obligation to update any forward-looking statements.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005306/en/\nInvestor Relations:\nHayden IR\nBrett Maas\n(646) 536-7331\nbrett@haydenir.com\nSource: PCM, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.globenewswire.com%2FTracker%3Fdata%3D_6__2IwCHuwprNynxnKfxaeyu4hES0v5pi7QjTZa3loPlHv2VQJFimx54spFvIXi80yUG3YCvo2MTZ4OlmoTdIUkhNcSpcMZHuu4F_QuZbc%3D&esheet=51747855&newsitemid=20180124005306&lan=en-US&anchor=investor.pcm.com&index=1&md5=7ea06a9758f10f6b2ff91d2af622a5d7", "http://www.businesswire.com/news/home/20180124005306/en/"], "published": "2018-01-24T17:00:00.000+02:00", "crawled": "2018-01-24T16:54:13.001+02:00", "highlightTitle": ""}