{"organizations": [], "uuid": "3b55ed9606b8b3cbc51bfcc915eb1e07a78de80f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104973995-IMG_2131.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/under-pressure-from-us-airlines-qatar-airways-agrees-to-open-its-books.html", "country": "US", "domain_rank": 767, "title": "Under pressure from US airlines, Qatar Airways agrees to open its books", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.127, "site_type": "news", "published": "2018-01-30T19:36:00.000+02:00", "replies_count": 0, "uuid": "3b55ed9606b8b3cbc51bfcc915eb1e07a78de80f"}, "author": "Leslie Josephs", "url": "https://www.cnbc.com/2018/01/30/under-pressure-from-us-airlines-qatar-airways-agrees-to-open-its-books.html", "ord_in_thread": 0, "title": "Under pressure from US airlines, Qatar Airways agrees to open its books", "locations": [], "entities": {"persons": [{"name": "leslie josephs", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "persian gulf", "sentiment": "none"}], "organizations": [{"name": "qatar airways", "sentiment": "negative"}, {"name": "delta air lines", "sentiment": "none"}, {"name": "united airlines", "sentiment": "none"}, {"name": "cnbc a qatar airways boeing", "sentiment": "none"}, {"name": "american airlines", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "State-controlled Qatar Airways has agreed to disclose financial information within a year, a victory for big U.S. airlines that have complained over the last three years that some Persian Gulf-based carriers benefit from unfair government subsidies.\nUnder the memorandum of understanding between the Qatari and U.S. governments, Qatar Airways \"should issue public annual reports with financial statements audited externally in accordance with internationally-recognized accounting standards, to the extent they are not already doing so,\" the State Department said on Tuesday.\nDelta Air Lines , United Airlines and American Airlines have lobbied for a harder line against certain Persian Gulf airlines, including Qatar, for more than three years.\nIn a January 2015 paper, the Partnership for Open and Fair Skies, a lobbying group representing the three U.S. airlines, said three Middle Eastern carriers — Qatar Airways, Dubai-based Emirates and Abu Dhabi-based Etihad — have received more than $40 billion in government subsidies and other \"unfair advantages in the last decade alone.\"\nDelta, which has been vocal against its Middle East rivals, indicated the fight won't end with the agreement with Qatar.\n\"Today's agreement by the State of Qatar is a strong first step in a process for commercial transparency and accountability, and we remain committed to working with the administration to address the harmful trade violations by the United Arab Emirates as well,\" Delta's CEO Ed Bastian said in a statement.\nThe State Department said Qatar Airways should disclose that new financial transactions are \"based on commercial terms.\"\nThe Partnership for Open and Fair Skies said under the agreement Qatar Airways would refrain from introducing any \"fifth-freedom\" flights, routes to the U.S. from cities other than its base in Qatar. Emirates operates such flights from the New York area to Milan and Athens.\nQatar Airways declined to comment.\nSome U.S. carriers don't agree with their domestic rivals on the issue. U.S. Airlines for Open Skies, a group that represents JetBlue and FedEx and others, had called rivals' claims a \"political ploy to protect themselves from competition and limit choice for U.S. travelers\" last month when the State Department met with U.S. airlines about the issue.\nIt applauded the Trump administration on Tuesday for maintaining so-called Open Skies agreements that give airlines access to the U.S. market.", "external_links": [], "published": "2018-01-30T19:36:00.000+02:00", "crawled": "2018-01-30T19:36:03.005+02:00", "highlightTitle": ""}