{"organizations": [], "uuid": "a43fa514cf01f3ee62162a5594d63be06e49b98d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-final-tcap-alert-johnson-fistel-reminds-investors-of-january-22-2018-deadline-in-the-class-action-lawsuit-against-triangle.html", "country": "US", "domain_rank": 767, "title": "Final (TCAP) Alert: Johnson Fistel Reminds Investors of January 22, 2018 Deadline in the Class Action Lawsuit Against Triangle Capital Corporation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:43:00.000+02:00", "replies_count": 0, "uuid": "a43fa514cf01f3ee62162a5594d63be06e49b98d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-final-tcap-alert-johnson-fistel-reminds-investors-of-january-22-2018-deadline-in-the-class-action-lawsuit-against-triangle.html", "ord_in_thread": 0, "title": "Final (TCAP) Alert: Johnson Fistel Reminds Investors of January 22, 2018 Deadline in the Class Action Lawsuit Against Triangle Capital Corporation", "locations": [], "entities": {"persons": [{"name": "johnson fistel", "sentiment": "neutral"}, {"name": "jim baker", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "llp", "sentiment": "neutral"}, {"name": "class action lawsuit against triangle capital corporation", "sentiment": "neutral"}, {"name": "tcap", "sentiment": "neutral"}, {"name": "triangle capital corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 18, 2018 /PRNewswire/ -- Shareholder rights law firm Johnson Fistel, LLP reminds investors that a class action lawsuit has been filed against Triangle Capital Corporation (\"Triangle\") (NYSE: TCAP) on behalf of all purchasers of common stock during the period between May 7, 2014 and November 1, 2017, inclusive (the \"Class Period\").\nIf you wish to serve as a lead plaintiff, you must move the Court no later than January 22, 2018. If you wish to discuss this action, have any questions concerning this notice, or your rights or interests, please contact lead analyst Jim Baker ( jimb@johnsonfistel.com ) at 619-814-4471. If you email, please include your phone number. If you are a member of this class, you can view a copy of the complaint as filed or join this class action online at http://www.johnsonfistel.com . Any member of the putative class may move the Court to serve as lead plaintiff through counsel of their choice or may choose to do nothing and remain an absent class member.\nThe complaint alleges that during the Class Period, defendants made false and misleading statements and failed to disclose adverse information regarding Triangle's business and prospects. Specifically, the complaint alleges that defendants failed to disclose that, as early as 2013, Triangle's investment professionals had internally recommended moving away from mezzanine loan deals due to changes in the market that no longer made these investments attractive risk-reward opportunities. As a result, the Company's entire vintage of 2014 and 2015 investments were at substantial risk of non-accrual because of the poor quality of the investments and deficient underwriting practices in place at the time of the investments. As a consequence, Triangle's business, prospects and ability to maintain its dividend level were materially impaired. As a result of defendants' false statements and omissions during the Class Period, the price of Triangle stock was artificially inflated, reaching a high of more than $28 per share.\nOn August 2, 2017, Triangle announced its financial results for the quarter ended June 30, 2017, revealing that the amount of full non-accrual assets in the Company's portfolio had increased to 5.4% and 2.5% as a percentage of the Company's total portfolio at cost and at fair value, respectively. Moreover, the Company disclosed that it had moved two investments to payment-in-kind non-accrual status during the quarter. On this news, the price of Triangle stock declined nearly 15%, or $2.56 per share, to close at $14.63 per share by August 4, 2017.\nThen, on November 1, 2017, Triangle announced its financial results for the quarter ended September 30, 2017, revealing that the fair value of the Company's investment portfolio had declined nearly 7% from the prior quarter and that it had suffered $8.9 million in net realized losses and $65.8 million in net unrealized depreciation to its portfolio during the quarter. The Company also disclosed that it had moved seven investments to full non-accrual status during the quarter and that the amount of investments on non-accrual had ballooned to 13.4% and 4.7% of the Company's total portfolio at cost and fair value, respectively. On this news, the price of Triangle stock declined nearly 21%, or $2.57 per share, to close at $9.68 per share by November 2, 2017.\nPlaintiff seeks to recover damages on behalf of all purchasers of Triangle common stock during the Class Period.\nAbout Johnson Fistel, LLP:\nJohnson Fistel, LLP is a nationally recognized shareholder rights law firm with offices in California, New York and Georgia. The firm represents individual and institutional investors in shareholder derivative and securities class action lawsuits. For more information about the firm and its attorneys, please visit http://www.johnsonfistel.com . Attorney advertising. Past results do not guarantee future outcomes.\nContact:\nJohnson Fistel, LLP\nJim Baker, 619-814-4471\njimb@johnsonfistel.com\nView original content: http://www.prnewswire.com/news-releases/final-tcap-alert-johnson-fistel-reminds-investors-of-january-22-2018-deadline-in-the-class-action-lawsuit-against-triangle-capital-corporation-300584577.html\nSOURCE Johnson Fistel, LLP", "external_links": ["http://www.prnewswire.com/news-releases/final-tcap-alert-johnson-fistel-reminds-investors-of-january-22-2018-deadline-in-the-class-action-lawsuit-against-triangle-capital-corporation-300584577.html", "http://www.johnsonfistel.com/"], "published": "2018-01-18T16:43:00.000+02:00", "crawled": "2018-01-18T16:23:35.000+02:00", "highlightTitle": ""}