{"organizations": [], "uuid": "82af5ce90b36924591d846b86631d3d91a15d34f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221557341&w=1200&r=LYNXMPEE0B1JD", "site_section": "http://feeds.reuters.com/reuters/entertainment", "section_title": "Reuters: Entertainment News", "url": "https://www.reuters.com/article/us-florida-whale/captive-orca-lolita-can-stay-at-miami-aquarium-u-s-appeals-court-idUSKBN1F12MR", "country": "US", "domain_rank": 408, "title": "Captive orca Lolita can stay at Miami aquarium: U.S. appeals court", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T23:19:00.000+02:00", "replies_count": 0, "uuid": "82af5ce90b36924591d846b86631d3d91a15d34f"}, "author": "", "url": "https://www.reuters.com/article/us-florida-whale/captive-orca-lolita-can-stay-at-miami-aquarium-u-s-appeals-court-idUSKBN1F12MR", "ord_in_thread": 0, "title": "Captive orca Lolita can stay at Miami aquarium: U.S. appeals court", "locations": [], "entities": {"persons": [{"name": "lolita", "sentiment": "none"}, {"name": "jonathan stempel", "sentiment": "none"}], "locations": [{"name": "lolita", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "miami seaquarium", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "national marine fisheries service", "sentiment": "none"}, {"name": "11th u.s. circuit court of appeals", "sentiment": "none"}, {"name": "ethical treatment of animals", "sentiment": "none"}, {"name": "peta", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 9:24 PM / Updated 15 minutes ago Captive orca Lolita can stay at Miami aquarium: U.S. appeals court Jonathan Stempel 3 Min Read \n(Reuters) - A federal appeals court on Friday rejected efforts by animal rights advocates to force the Miami Seaquarium in Florida to release Lolita, a killer whale it has held in captivity for nearly half a century. \nBy a 3-0 vote, the 11th U.S. Circuit Court of Appeals in Miami rejected claims by People for the Ethical Treatment of Animals (PETA) and others that keeping Lolita in captivity violated the federal Endangered Species Act. \n“The evidence, construed in the light most favorable to PETA, does not support the conclusion that the conditions of her captivity pose a threat of serious harm to Lolita,” the court said. \nFriday’s decision upheld a lower court ruling. The lawsuit began in July 2015, two months after the National Marine Fisheries Service recognized whales such as Lolita as an endangered species. \nPETA said it may appeal, and that the decision ignores current public sentiment about the suffering of captive orcas. \n“This ruling sentences this highly intelligent, deeply lonely, and distressed orca to a lifetime of physical and psychological harm, confined to a tiny concrete cell without family, friends, or freedom,” Jared Goodman, director of animal law at the PETA Foundation, said in a statement. \nThe Seaquarium and its lawyer did not immediately respond to requests for comment. \nLolita, captured in 1970, is roughly 20 feet (6 meters) long and weighs about 8,000 pounds (3.6 tonnes), and has long been one the Seaquarium’s top attractions. \nCritics raised 13 objections to her captivity, including the small size of Lolita’s tank, her lack of an orca companion since the death 38 years ago of her tank mate Hugo, stress and injuries caused by the white-sided dolphins she now lives with, and inadequate treatment by Seaquarium personnel. \nBut the appeals court said accepting critics’“expansive” conception of illegal harm and harassment could upset the U.S. Department of Agriculture’s regulatory scheme to help ensure the humane treatment of captive animals used for exhibitions and research. \nThe Seaquarium kept Lolita after SeaWorld Entertainment Inc decided in 2016 to end its orca breeding programs and phase out killer whale shows. \nA 2013 documentary, “Blackfish,” had depicted the captivity and exhibition of killer whales as cruel. \nThe appeals court ruled nine days after Bob Barker, the former host of “The Price Is Right” game show and animal rights advocate, called for Lolita’s release in a video posted on PETA’s Twitter account. Reporting by Jonathan Stempel in New York; Editing by Sandra Maler", "external_links": [], "published": "2018-01-12T23:19:00.000+02:00", "crawled": "2018-01-12T23:35:45.015+02:00", "highlightTitle": ""}