{"organizations": [], "uuid": "f50841f0fd1500b467de8316fa0115133006c0f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/20/104909306-GettyImages-869087600.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/obamacare-health-insurers-see-improved-financial-performance-in-2017.html", "country": "US", "domain_rank": 767, "title": "Obamacare health insurers see improved financial performance in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.222, "site_type": "news", "published": "2018-01-04T21:21:00.000+02:00", "replies_count": 0, "uuid": "f50841f0fd1500b467de8316fa0115133006c0f7"}, "author": "Dan Mangan", "url": "https://www.cnbc.com/2018/01/04/obamacare-health-insurers-see-improved-financial-performance-in-2017.html", "ord_in_thread": 0, "title": "Obamacare health insurers see improved financial performance in 2017", "locations": [], "entities": {"persons": [{"name": "kais", "sentiment": "none"}, {"name": "kaiser", "sentiment": "none"}], "locations": [], "organizations": [{"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The administration so far has failed to undo the law, although it won effective repeal, starting in 2019, of the mandate that most people have some form of health insurance or pay a tax penalty. The repeal was part of the new tax law passed by Congress in December. \nAnd only about 500,000 fewer people signed up on the federal Obamacare exchange than did last year, with 8.7 million people in 39 states enrolling. Sign-ups in the remaining states not served by HealthCare.gov are as a group seeing significantly higher enrollment for 2018. \nKaiser's report noted that the financial performance of insurers who sell individual health plans like those on Obamacare exchanges worsened in 2014 and 2015, the first two years that exchange-sold coverage was in effect. Those were the first years that the Affordable Care Act barred insurers from charging less-healthy people higher premiums, or denying them coverage altogether. \nBut that financial performance \"showed signs of improving in 2016 and stabilizing in 2017 as insurers began to regain profitability,\" the report said. \nFor its analysis, Kaiser's staff looked at recently released data through the end of the third fiscal quarter of 2017. \nIn 2017, Kaiser said, insurers' so-called medical loss ratios saw \"significant improvement.\" \nA medical loss ratio compares the amount of spending on health claims for customers to the premiums paid by customers. \nIn the third quarter of 2015, Obamacare insurers on average reported medical loss ratios of 97 percent — meaning they were spending 97 cents for every $1 of premium they collected to cover customers' health costs. \nThat dropped to 91 percent in the third quarter of 2016. \nAnd it dropped again to 81 percent in the third quarter of 2017, Kaiser said. \nThe report noted that overall annual loss ratios for 2017 are likely to be affected by the Trump administration's decision to stop paying, as of the fourth quarter, billions of dollars worth of reimbursements to insurers to offset discounts insurers give customers for out-of-pocket health charges. \nThe report also looked at the average gross margins per Obamacare customer per month. \nBy that metric, \"insurer financial performance improved dramatically through the third quarter of 2017,\" the report found. \nAs of that quarter, the average gross margin was $79 per enrollee. That compares to just $10 per enrollee in the third quarter of 2015. \nThe Kaiser report said that the sharply higher premium increases seen in 2017 are driving the improved financial performance among insurers. \nWhile premiums rose by an average of 17 percent per enrollee last year, per person medical claims grew by just 4 percent. \nAnd those higher premiums do not appear, as some had feared, to have driven significant numbers of healthy customers from Obamacare plans, according to the report. \nKaiser said the average number of days Obamacare customers spent in a hospital through the third quarter of 2017 was similar to the numbers seen through the third quarters of the prior two years. \nWhile the overall financial performance of Obamacare insurers is improving, Kaiser's analysts said \"there remain some areas of the country that are more fragile.\" \n\"In addition, policy uncertainty has the potential to destabilize the individual market generally,\" the report said. WATCH: Congress deals two big blows to Obamacare show chapters", "external_links": [], "published": "2018-01-04T21:21:00.000+02:00", "crawled": "2018-01-04T21:20:56.013+02:00", "highlightTitle": ""}