{"organizations": [], "uuid": "997631af47a6777a6ce0601564f141917e5d099b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-icims-acquires-mobile-recruiting-platform-textrecruit.html", "country": "US", "domain_rank": 767, "title": "iCIMS Acquires Mobile Recruiting Platform TextRecruit", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T20:00:00.000+02:00", "replies_count": 0, "uuid": "997631af47a6777a6ce0601564f141917e5d099b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-icims-acquires-mobile-recruiting-platform-textrecruit.html", "ord_in_thread": 0, "title": "iCIMS Acquires Mobile Recruiting Platform TextRecruit", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "holmdel", "sentiment": "none"}], "organizations": [{"name": "icims inc.", "sentiment": "negative"}, {"name": "textrecruit", "sentiment": "none"}, {"name": "unifi", "sentiment": "none"}, {"name": "textrecruit inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOLMDEL, N.J., Jan. 08, 2018 (GLOBE NEWSWIRE) -- iCIMS Inc. , a leading provider of cloud-based talent acquisition solutions , announces the acquisition of TextRecruit Inc., a candidate engagement platform that uses text message, live chat, and artificial intelligence (AI) to help organizations hire better people, faster.\nTextRecruit has built a rapidly growing business by recognizing today’s candidates prefer to communicate via text message and mobile apps, rather than email. The company introduced its first product in 2015, and used iCIMS’ UNIFi platform to create a seamless integration between TextRecruit messaging applications and iCIMS’ talent acquisition suite. Since then, TextRecruit has expanded its portfolio and partner network to become the leading real-time messaging application for recruiters.\n“The first time I met the founders of TextRecruit, I was impressed with their passion for improving the candidate experience by enabling candidates, recruiters and hiring managers to communicate via text during the hiring and onboarding process,” stated iCIMS Senior Vice President of Strategy and Corporate Development, Michael Wilczak. “After integrating the product via UNIFi and launching it in our marketplace, our customers immediately recognized the value of TextRecruit and began to rapidly purchase it as an add-on to the iCIMS Talent Acquisition Suite,” Wilczak added. “The strong product capabilities, growing customer base, and mutual commitment to customer success made TextRecruit a logical acquisition for iCIMS.”\nTextRecruit will continue to operate as a wholly owned subsidiary of iCIMS, servicing and integrating with other systems based on their clients’ needs. Today, the company has more than 400 customers using its solutions, including a large number of iCIMS customers such as Banner Health, Cracker Barrel, Aramark, Enterprise Holdings, and other enterprise organizations.\n\"I started by texting candidates on my own phone, and when 50-60% responded I knew I needed to systemize it,\" stated Heather Thomas, Recruitment Manager at Sodexo. \"We started a TextRecruit pilot thinking we would just use it for sourcing, but it became a communication tool integrated into our recruiters’ entire workday. We had 100% positive responses from our candidates, and decided to expand from 10 to 40 recruiters.\"\nTextRecruit will extend the capabilities of the iCIMS Talent Acquisition Suite with deeper integrations and solutions that will simplify the recruiting process for candidates and recruiters. In addition, TextRecruit will bring iCIMS customers “ARI,” its configurable Automated Recruiter Interface, which leverages natural language processing and AI to automate communication with candidates via chatbots.\nTextRecruit Co-Founder and Chief Executive Officer Erik Kostelnik stated, “This couldn’t be a better fit. TextRecruit and iCIMS share the same vision for transforming the recruiting technology market. We serve many of the same customers and partners, offer complementary products, and most importantly, have the same deep values that drive our respective cultures. I’m thrilled to see what we can accomplish as part of the iCIMS team.”\n“The most exciting part of this acquisition is the potential for iCIMS and TextRecruit to work together to bring even greater value to our customers by expanding the TextRecruit product into a full communications platform, and by leveraging TextRecruit’s AI capabilities to automate other parts of the recruiting process. TextRecruit will continue to operate independently and integrate with iCIMS Recruit, Connect and Onboard products, but over time, we’ll make TextRecruit a core component of our product suite, offering new candidate engagement and automation capabilities to the market,” concluded iCIMS Chairman and Chief Executive Officer, Colin Day.\nIn 2017, iCIMS was recognized on the Hot 100 list for private software companies by JMP Securities, leading software provider by G2 Crowd in their Winter 2017 ATS Grid report, and was named to Forbes Cloud 100 list for the second consecutive year, alongside Stripe, Dropbox, Slack, and Squarespace. Company CEO, Colin Day, was also named one of The SaaS Report’s Top 50 SaaS CEOs of 2017. In 2016, iCIMS was named a Top Rated Recruiting Software Platform by users on TrustRadius, a consumer review site for software.\nTextRecruit was named “Most Innovative Mobile Product” by TA Tech, one of the “Top HR Technology and Recruiting Tools” by RecruitingDaily, “Start-up of the Year” by American Business Awards and Best in Biz, and “Best Mobile Engagement Platform” by Mobile Recruitment Awards. In addition, Erik Kostelnik, TextRecruit’s Co-Founder and CEO, was named one of Silicon Valley’s “Upstart 50 Inventors” by BizJournals.\nAbout iCIMS Inc.\niCIMS is the leading provider of talent acquisition solutions that help businesses win the war for top talent. iCIMS empowers companies to manage their entire hiring process within the industry’s most robust Platform-as-a-Service (PaaS). Built on the foundation of a best-to-market talent acquisition software suite, iCIMS’ PaaS framework, UNIFi , allows employers to expand the capabilities of their core talent acquisition technology by integrating with the largest partner ecosystem in talent acquisition to help them attract, find, screen, and manage candidates. Offering scalable, easy-to-use solutions that are backed by award-winning customer service, iCIMS supports more than 3,500 contracted customers and is one of the largest and fastest-growing talent acquisition solution providers.\nAbout TextRecruit\nTextRecruit is a candidate and employee engagement platform that uses text message, live chat, and artificial intelligence to help companies hire better people, faster. It's the first and only platform to centralize all talent communication, allowing recruiters and HR to manage relationships with their talent throughout the entire employee lifecycle. With customized, integrated solutions for large teams, TextRecruit consolidates consumer messaging applications and turns them into enterprise communication platforms. Over 400 employers trust TextRecruit to connect with the talent they need. For more information, follow us at @TextRecruit or visit us at TextRecruit.com .\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/2f9af8f2-0830-4ba8-bb7a-a3eda9fdaebd\nKelly Cordrey iCIMS, Inc. 7325207411 kelly.cordrey@icims.com\nSource: iCIMS, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=QTx_i03TuL1Fm4-_pGmzuVlFWafg0wAswCsQTmfdPaik4o7uu22Q8v4hbXsRWxWNMxNGLHKYWaXwPRbtw4oLHJ3UguzLB70AQqAJf7PPLxKi36NsxHT8Vi4X8zKZ-Z66DfW6yvr11sm40MFfnYxRwpu49PlbnVMS1DKRmROPrhxNbFlHksqyg-kfPFRvXNMiREDd2u2X_j1fWM4a0PLl4A==", "https://www.globenewswire.com/Tracker?data=v6UDdSytnch8N_FGLLmZ_k1clCQY6_aqrLC4vr-AlTur7vEjTD0SXXwcG1eIEIzSk_vq8yNG_zikattns5vKefucKvtGElg5d2yD_8pMWsJHIWzt93w6_pb1UvvXMkpJYJqeRRr3w1DQTUWdgZPXvQ==", "https://www.globenewswire.com/Tracker?data=dPvcJSPkusAaaiIn5_1kh2JMRhvsnxofnDBZwKtapMuLy-rAE6rUqL0n9dyZ9Rhetk8-qUmfHTAl-NYUW_zRVFAuulzBaCrjL1rAN3Bq-0gBH1GQeYTObpJHMuGoCvaJYIpLERbMCQWMh9EXISmMUGSEdgT02g_9NAQbGCvttx_JQXqLvEE6hhSU2FvGd7FrnlZT_hJJ1cEtqWjTcnl3Jg==", "https://www.globenewswire.com/Tracker?data=4YqoVSwDgk6cf6BiSrOEMZJzvC3arj6CZOBCPf9ZyjVE1Q0kEG4Q_d6pXa3VVy-5itLfiV9RLDIfHC3e6G9REcB-HW0hEVy9SUVKWj_LaE1GF1nCWGI3MjIgx1I5T2uz", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2f9af8f2-0830-4ba8-bb7a-a3eda9fdaebd/en", "http://www.globenewswire.com/NewsRoom/AttachmentNg/2f9af8f2-0830-4ba8-bb7a-a3eda9fdaebd", "https://www.globenewswire.com/Tracker?data=OGyS2c8Dll0XkN9ECGHqkO0LliXfvkpUZcKIp3XxT-tF2Ynh2hg5kdkn-VYEK24abihecY3Zaa_m8h76k0yplGGNQ4bQSNlRxAoule2iMYzz8-7a5w3CLeVbipszdqmjZB74MKT7HDUmcDvwmpBh8jBNeT51YLbYRo6UaFHsTRRXRMBJV1EGzi-ZZyLWYKN1WXPKoPZ9GXjZktHGt4dWpQ==", "https://www.globenewswire.com/Tracker?data=v6UDdSytnch8N_FGLLmZ_k1clCQY6_aqrLC4vr-AlTtgjWhwggEJjQxluZIGb90yOrwNxvfIAPeBeVc72xKPfvzENsrK_G5qOlTmb-mKEBjMhNA9DW0fzGfxhz6pfgRnHBDGwVNqUk9lyfzkra9EMw==", "https://www.globenewswire.com/Tracker?data=SEDC8dSsgdRHGZdfkvQs0p_YR7c2pMvyxUS8ONzJ0Ieyc364DZKSK7ifR38p6DHR7zu9K5PnLePm3YsEjUdkSUYVNuTaPCvcbm-h0vjr3arOtc6_RyWuUKhhT1tcez2MhWPO1apE5FdpiIytnwsU2B3XBUWPJMW-rk55pfhJ9XWgB5pXcToFF0KXF9bOmyUs", "https://www.globenewswire.com/Tracker?data=odOPtMq-_WoHcUJXw6uafU6jbbDqvyytpSiKkXQBWg2QwkHKBbVBCLQJJ0z7z3s1tV7V56OME8jcT4LgQOGKGA5nVGI1VHv6W_3M1a3ENdIYpeOmT5q2l60YsGfyCDp7WAgsZKCYkWNA2cMpgbn-pwIqMQbhxzdWHDUPrp8ir9qykEwzykHEjZehDcB5fsgC3Gp5XKzP7djsaFGausHI_F-2jdMesRrwhI1_y97tIObbhoK-ugnd47eoNdDtVIve", "https://www.globenewswire.com/Tracker?data=BHmFGcQQzTLwL7sODY2M6WXfxJNjmyGg8IQSSU_gb01Dn-cCxijuSxYB3c4VWHW436_YjGqyXEuMSju21YJaQA==", "https://www.globenewswire.com/Tracker?data=EdtSHPTKiulOFaMsuPURYS86zEGi8W2DSd4yDEuFbewZGwk6F7Ovf2NXAEXAJT3s_x2peRhTQ5Q9sawo-V5VHzXDL0zn_KQvX4kS7XO2o1GCkCxIIVHYTGfbCtffuJQ5PD2R1VBz-5X5canpUYL4-qXMvNKjqYO7XlDjtyC00faZgJlrSt0fuWkCLktDGDUd8LkGnvMLig7hOXxuc-xxfdvyVNl5Ll6YHp29cMXCtWZmjVtC46sXg8lCQR0ZRkM7Z2c9Ntj1Wr6G9y1R_n9-ug==", "https://www.globenewswire.com/Tracker?data=TtaIiEZGJmmCz-dWvtdzIsw5slWxIChXqIY7fLEiNtvNSClIE0eOgPKZOAn55pUpAP-IXT6wTxMp2ItTXtlW1bkiVi5WyV4JdnBk-fwLPK8="], "published": "2018-01-08T20:00:00.000+02:00", "crawled": "2018-01-08T21:04:38.004+02:00", "highlightTitle": ""}