{"organizations": [], "uuid": "d6fdf5e744299df46c6b3add5baecc44d390fce6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-natgas-constitution-ferc/u-s-upholds-new-york-denial-of-constitution-natgas-pipe-idUSKBN1F1211", "country": "US", "domain_rank": 408, "title": "U.S. upholds New York denial of Constitution natgas pipe", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T00:24:00.000+02:00", "replies_count": 0, "uuid": "d6fdf5e744299df46c6b3add5baecc44d390fce6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-natgas-constitution-ferc/u-s-upholds-new-york-denial-of-constitution-natgas-pipe-idUSKBN1F1211", "ord_in_thread": 0, "title": "U.S. upholds New York denial of Constitution natgas pipe", "locations": [], "entities": {"persons": [{"name": "williams", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "williams cos inc", "sentiment": "negative"}, {"name": "ferc", "sentiment": "none"}, {"name": "u.s. federal energy regulatory commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - U.S. energy regulators rejected Williams Cos Inc’s request to overturn New York’s denial of a water permit for the company’s proposed Constitution natural gas pipeline from Pennsylvania to New York, according to a filing on Thursday. \nWilliams said in a statement it was disappointed with the U.S. Federal Energy Regulatory Commission’s (FERC) decision and said it would seek a rehearing and, if necessary, appeal of this decision. \n“Constitution remains committed to constructing and placing into operation this critical piece of energy infrastructure,” Williams said. \nIf built, the 125-mile (201 kilometer) pipeline would transport up to 0.65 billion cubic feet per day (bcfd) of shale gas from Pennsylvania to New York. New York does not allow fracking. \nNew York uses on average about 3.6 bcfd of gas. One bcfd is enough to fuel about five million U.S. homes. \nIn October, Constitution said the pipe could enter service as early as the first half of 2019 if it gets the necessary regulatory approvals. \nOfficials at Williams were not immediately available to discuss their latest timing or cost estimates for the project. \nWhen Williams proposed to build Constitution in 2013, it was estimated it would cost about $683 million and enter service in 2016. The delays, however, boosted that estimate to as high as $875 million, according to Upstate New York newspapers. \nWilliams asked FERC in October to find that New York waived its authority to issue the water certification for the project by failing to act within a “reasonable period of time.” \nWilliams filed with FERC to build the project in June 2013. FERC first approved construction of the project in December 2014 and then again in November 2016, conditioned on receipt of other required approvals. \nWilliams filed for water quality certification from the New York Department of Environmental Conservation (DEC) in August 2013. The company withdrew and resubmitted that application twice, first in May 2014 and then again in April 2015, both times at the DEC’s request. \nIn April 2016, the DEC denied Williams application, saying the company failed to provide sufficient information to determine whether the project would comply with the state’s water quality standards. \nWilliams appealed that New York denial to a federal appeals court, but the court in August 2017 concluded it lacked jurisdiction and upheld the state’s decision. \nConstitution is owned by subsidiaries of Williams, Cabot Oil & Gas Corp, Duke Energy Corp and WGL Holdings Inc. \nReporting by Scott DiSavino; Editing by Andrew Hay\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T00:24:00.000+02:00", "crawled": "2018-01-12T18:25:45.002+02:00", "highlightTitle": ""}