{"organizations": [], "uuid": "a883e0e835f0060e36cf8c15a33ece104b6301f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/asia", "section_title": "Asian Stock Market News | Reuters.com", "url": "https://www.reuters.com/article/china-stocks-close/china-stocks-fall-from-two-year-highs-developers-weigh-idUSZZN2R7Q00", "country": "US", "domain_rank": 408, "title": "China fall from two-year highs, developers weigh", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:19:00.000+02:00", "replies_count": 0, "uuid": "a883e0e835f0060e36cf8c15a33ece104b6301f5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-stocks-close/china-stocks-fall-from-two-year-highs-developers-weigh-idUSZZN2R7Q00", "ord_in_thread": 0, "title": "China fall from two-year highs, developers weigh", "locations": [], "entities": {"persons": [{"name": "guizhou redst", "sentiment": "negative"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "shenzhen", "sentiment": "none"}], "organizations": [{"name": "developing co ltd", "sentiment": "none"}, {"name": "nanjing textiles import & export corp ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Shanghai stocks lower, blue-chip CSI300 index down\n* Gains in Shanghai stocks led by Guizhou Redstar Developing Co Ltd and losses by Nanjing Textiles Import & Export Corp Ltd\n* China’s A-shares are at a 29.45 percent premium over H-shares\nSHANGHAI, Jan 25 (Reuters) - China stocks weakened from two-year highs on Thursday, with the benchmark Shanghai index snapping a seven-session winning streak, led down by property and healthcare firms, as investors pocketed gains after recent strong rally.\n** At the close, the Shanghai Composite index was down 11.16 points or 0.31 percent at 3,548.30. ** The blue-chip CSI300 index was down 0.57 percent, with its financial sector sub-index lower by 1.35 percent, the consumer staples sector down 0.65 percent, the real estate index down 1.77 percent and healthcare sub-index down 1.28 percent. ** The smaller Shenzhen index ended down 0.39 percent and the start-up board ChiNext Composite index was weaker by 0.13 percent. ** Around the region, MSCI’s Asia ex-Japan stock index was firmer by 0.15 percent while Japan’s Nikkei index closed down 1.13 percent. ** At 07:02 GMT, the yuan was Quote: d at 6.3365 per U.S. dollar, 0.35 percent firmer than the previous close of 6.359. ** The largest percentage gainers in the main Shanghai Composite index were Guizhou Redstar Developing Co Ltd up 10.04 percent, followed by Fujian Dongbai Group Co Ltd gaining 10.01 percent and Shandong Lubei Chemical Co Ltd up by 10 percent. ** The largest percentage losses in the Shanghai index were Nanjing Textiles Import & Export Corp Ltd down 9.99 percent, followed by Bright Real Estate Group Co Ltd losing 5.5 percent and Changchun Sinoenergy Corp down by 5.43 percent. ** So far this year, the Shanghai stock index is up 7.63 percent, the CSI300 is up 8.3 percent this year, while China’s H-share index listed in Hong Kong is up 16.3 percent. Shanghai stocks have risen 7.63 percent this month. ** About 24.34 billion shares were traded on the Shanghai exchange, roughly 133.4 percent of the market’s 30-day moving average of 18.25 billion shares a day. The volume in the previous trading session was 25.30 billion. ** As of 07:03 GMT, China’s A-shares were trading at a premium of 29.46 percent over the Hong Kong-listed H-shares. ** The Shanghai stock index is above its 50-day moving average and above its 200-day moving average. ** The price-to-earnings ratio of the Shanghai index was 16.18 as of the last full trading day while the dividend yield was 1.8 percent. ** So far this week, the market capitalisation of the Shanghai stock index has risen by 2.14 percent to 31.29 trillion yuan. (Reporting by Shanghai Newsroom; Editing by Sam Holmes)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T15:19:00.000+02:00", "crawled": "2018-01-25T10:20:06.028+02:00", "highlightTitle": ""}