{"organizations": [], "uuid": "5601fe49742a8d4a1009ea8751a52c6ad9b69de5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-livestock/livestock-cme-live-cattle-futures-extend-climb-to-five-sessions-idUSL1N1PD1YX", "country": "US", "domain_rank": 408, "title": "LIVESTOCK-CME live cattle futures extend climb to five sessions", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-19T07:01:00.000+02:00", "replies_count": 0, "uuid": "5601fe49742a8d4a1009ea8751a52c6ad9b69de5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-livestock/livestock-cme-live-cattle-futures-extend-climb-to-five-sessions-idUSL1N1PD1YX", "ord_in_thread": 0, "title": "LIVESTOCK-CME live cattle futures extend climb to five sessions", "locations": [], "entities": {"persons": [{"name": "julie ingwersen", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "chicago mercantile exchange", "sentiment": "negative"}, {"name": "cme", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Julie Ingwersen CHICAGO, Jan 18 (Reuters) - Chicago Mercantile Exchange cattle futures rose on Thursday for a fifth straight session, buoyed by higher wholesale beef prices and technical buying including short-covering, traders said. Retailers are buying beef to feature during the second half of the month, when consumers may have paid off year-end holiday debt and have more to spend. Choice-grade wholesale beef prices rose 39 cents to $205.69 per cwt. Cash cattle prices could draw support this week from respectable packer profits, along with week-over-week cattle weight slippage due to colder weather in the Plains that slows animal weight gains, making cattle less available to packers. However, market bears noted that the specter of increased cattle supplies ahead may limit how much packers pay in the near term. CME February live cattle futures finished up 0.975 cent per pound at 121.950 cents after nearing chart resistance at the contract's 50-day moving average. April ended up 0.700 cent at 123.475 cents. Buy-stops and higher live cattle futures boosted CME feeder cattle. Most-active March feeder cattle closed 1.200 cents per pound higher at 147.175 cents. LEAN HOG FUTURES RISE CME hogs ended firmer, rallying from early declines on short-covering and buy-stops, traders said. Packers paid less for hogs in order to improve their margins. Lean hogs in the top cash market of Iowa and southern Minnesota were down 75 cents per cwt from a day earlier, according to U.S. Department of Agriculture data. But a blast of cold air earlier this week forced some Midwest farmers to keep swine buildings closed an effort to retain heat, tightening supplies for packers. And icy conditions in the eastern United States disrupted the flow of livestock to packing plants. February hogs settled up 0.325 cent per pound at 73.050 cents. April ended 0.375 cent higher at 75.900 cents. (Additional reporting by Theopolis Waters)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T07:01:00.000+02:00", "crawled": "2018-01-19T12:07:30.000+02:00", "highlightTitle": ""}