{"organizations": [], "uuid": "ceb62aa73e9a168f6f08d5a4c9ffbb303bfbe593", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-students-sleepy-driving/college-students-see-drowsy-driving-as-legally-safe-idUKKBN1EZ221", "country": "US", "domain_rank": 408, "title": "College students see drowsy driving as legally safe", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T18:00:00.000+02:00", "replies_count": 0, "uuid": "ceb62aa73e9a168f6f08d5a4c9ffbb303bfbe593"}, "author": "", "url": "https://uk.reuters.com/article/us-health-students-sleepy-driving/college-students-see-drowsy-driving-as-legally-safe-idUKKBN1EZ221", "ord_in_thread": 0, "title": "College students see drowsy driving as legally safe", "locations": [], "entities": {"persons": [{"name": "carolyn crist", "sentiment": "none"}, {"name": "beck", "sentiment": "none"}, {"name": "kenneth beck", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "university of maryland in college park", "sentiment": "none"}, {"name": "aaa foundation for traffic safety", "sentiment": "none"}, {"name": "min read  reuters health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 4:02 PM / Updated an hour ago College students see drowsy driving as legally safe Carolyn Crist 5 Min Read \nReuters Health - Although driving while sleepy is as dangerous as driving while intoxicated, college students may see it as unavoidable and not legally risky, a small study suggests. \nIn the U.S. alone, drowsy drivers are involved in nearly 300,000 car crashes each year, including 6,400 that result in deaths, according to the AAA Foundation for Traffic Safety. \n“Drowsy driving is increasingly being recognized as a source of crashes and deaths on highways,” said study leader Dr. Kenneth Beck of the University of Maryland in College Park. \nBeck and colleagues conducted four focus groups with 26 undergraduate college students in 2016. Students were surveyed about their driving habits, perceptions about risky driving behaviors (such as driving while drunk or using a phone), and strategies to improve traffic safety around drowsy driving in particular. \nOverall, participants considered themselves safe drivers, especially with passengers in the car. \nAt the same time, they viewed drowsy driving as less risky from a legal perspective than drunk driving or driving while under the influence of drugs or medications. Many participants acknowledged the crash risks associated with drowsy driving but felt relatively immune to legal risks and were unaware of laws against drowsy driving. They also questioned the enforceability of these laws. Without a biochemical test (such as one used for drunk driving, for example), they felt it would be difficult to validate drowsiness. \n“You can do a test and say . . . they were drunk, or when you’re texting and driving . . . you can see that they just sent this last text message at this time,” one student said. “But when you’re drowsy . . . it’s kinda hard to tell.” \nMost students had experienced drowsy driving incidents, including crashes or near-misses, most often while driving alone and in the early morning or late at night. They described times they woke themselves up by opening the window to get fresh air, playing the radio loudly, chewing gum and talking along with the radio. \nTo improve messaging about drowsy driving, the students said depicting graphic consequences would be effective for young drivers, similar to campaigns against drunk driving. They said particularly gruesome, emotional and realistic depictions of crashes would get their attention and motivate them to change their behaviors. In addition, clever billboards or rotating LED signs that tell drivers to avoid drowsiness at night could be effective. \n“In Maryland, signs have promoted the nearest rest stop with a free cup of coffee after certain hours at night,” Beck said in a phone interview. “It may be time to evaluate these and promote them in light of the growing awareness of this problem.” \n“No one approach will be as effective as many approaches together,” Beck said. “We need to ramp up both publicity and enforcement, and we need to establish a culture for young drivers that drowsy driving is the equivalent of drunk driving.” \n“Think of the three ‘D’s’ - drunk, drowsy and distracted driving - that are the big causes of auto fatalities in the U.S., and they’re all largely preventable,” he said. \nIn 2007, a Massachusetts driver-licensing program imposed strict penalties for violating a law that prohibited unsupervised driving at night, which included a drowsy driving education program. A 2015 study of the program, published in Health Affairs ( bit.ly/2Fn2faJ ), found that crash rates fell 19 percent for drivers ages 16-17 and 7 percent for ages 18-19. \n“We’ve found that legislation targeting the hazards of drowsy driving can reduce the risk of drowsy driving crashes among teen drivers,” said Dr. Charles Czeisler of Harvard Medical School in Boston, Massachusetts, who worked on the 2015 study. \n“The most important message is that drowsy driving is dangerous,” he told Reuters Health by email. “Young drivers are at the greatest risk of drowsy driving crashes.” \nSOURCE: bit.ly/2FpOJDd Sleep Health, online December 1, 2017.", "external_links": [], "published": "2018-01-10T18:00:00.000+02:00", "crawled": "2018-01-10T18:37:40.002+02:00", "highlightTitle": ""}