{"organizations": [], "uuid": "2898bf06de97cd0faa32d507accb74e2b0c2e190", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/21/104957737-GettyImages-908157286.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/21/womens-march-shows-big-turn-out-in-both-blue-red-states.html", "country": "US", "domain_rank": 767, "title": "Women's march shows big turn out in both blue, red states", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.211, "site_type": "news", "published": "2018-01-21T21:50:00.000+02:00", "replies_count": 0, "uuid": "2898bf06de97cd0faa32d507accb74e2b0c2e190"}, "author": "Michelle Fox", "url": "https://www.cnbc.com/2018/01/21/womens-march-shows-big-turn-out-in-both-blue-red-states.html", "ord_in_thread": 0, "title": "Women's march shows big turn out in both blue, red states", "locations": [], "entities": {"persons": [{"name": "chelsea guglielmino", "sentiment": "neutral"}, {"name": "eric garcetti", "sentiment": "none"}, {"name": "joel sheakoski", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill de blasio", "sentiment": "none"}, {"name": "de blasio", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A second day of demonstrations in support of women's right got underway on Sunday, after protesters flooded the streets in cities across the world during the previous day to mark the anniversary of President Donald Trump 's inauguration.\nOrganizers are expecting thousands of women and their supporters to come to Las Vegas on Sunday for a \"Power to the Polls\" event that will kick off a national voter registration drive.\nThe location was chosen because Nevada is a swing state and \"has recent experience with some of the most pressing issues facing women in our nation today, from gun violence to politicians accused of sexual assault,\" according to the Women's March website.\nDuring Saturday's protests, the crowd swelled to 600,000 in Los Angeles, according to Mayor Eric Garcetti. In Chicago, local media reported that 300,000 women and their male supporters took to the street, while New York City saw 200,000 people demonstrating, according to Mayor Bill de Blasio.\nde Blasio tweet \nJoel Sheakoski | Barcroft Images | Getty Images While crowds were expected in blue states, protesters also turned out in red states, albeit in smaller numbers.\nIn Texas, marches were held in Houston, Austin, Dallas and Fort Worth, with Houston having the the largest estimated turnout. While crowd reports varied, Police Chief Art Acevedo estimated about 12,000 people attended , the Houston Press reported.\nThe crowd in Dallas hit an estimated 7,000 , while about 5,000 marched in Fort Worth and approximately 2,000 protested in Austin , according to local media reports.\nIn Tennessee, which President Donald Trump won in 2016, more than 15,000 people turned out in Nashville, according to local media.\nOrganizers hope to build on the energy felt by Trump opponents after his surprise election victory in 2016 and channel it into gains for progressive candidates in November's midterm elections.\nActivists want to register 1 million new voters and get more strong advocates for women's rights into office.\nHowever, while the nationwide protests were coordinated, they were not all organized by a single group. In fact, there is a rift emerging between two organizations, the New York Times recently reported .\nWomen's March Inc., which organized the protest in Washington in 2017, has spent much of the last year creating more social justice protests, the paper said. A newer group, March On, thinks focusing on winning elections, particularly in red states, should be the primary goal.\n\"We can march and take to the streets and yell about all the stuff we want to change, but unless we're getting people elected to office who are going to make those changes, we're not really doing anything,\" Lindsey Kanaly, a March On board member, told the Times.\n—Reuters contributed to this report.", "external_links": [], "published": "2018-01-21T21:50:00.000+02:00", "crawled": "2018-01-21T21:52:55.058+02:00", "highlightTitle": ""}