{"organizations": [], "uuid": "4d66a3b19667679cf4635b0e2eb8ad1d016a04f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/germany-wages/update-1-germans-seek-labour-deal-by-early-next-month-as-car-workers-strike-idUSL8N1P724Y", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Germans seek labour deal by early next month as car workers strike", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T13:48:00.000+02:00", "replies_count": 0, "uuid": "4d66a3b19667679cf4635b0e2eb8ad1d016a04f8"}, "author": "", "url": "https://www.reuters.com/article/germany-wages/update-1-germans-seek-labour-deal-by-early-next-month-as-car-workers-strike-idUSL8N1P724Y", "ord_in_thread": 0, "title": "UPDATE 1-Germans seek labour deal by early next month as car workers strike", "locations": [], "entities": {"persons": [{"name": "jan schwartz", "sentiment": "none"}], "locations": [{"name": "hamburg", "sentiment": "none"}, {"name": "baden-wuerttemberg", "sentiment": "none"}], "organizations": [{"name": "audi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}, {"name": "ig metall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 49 AM / Updated 13 minutes ago UPDATE 1-Germans seek labour deal by early next month as car workers strike Reuters Staff \n* Union, IG Metall in negotiations over pay, working hours \n* Demand for right to shorter hours is sticking point \n* Deal could come for Baden-Wuerttemberg on Jan. 24 - sources (Recasts, changes dateline, adds information from sources) \nBy Jan Schwartz \nHAMBURG, Jan 12 (Reuters) - Workers at carmakers Audi and BMW staged further strikes on Friday but German labour leaders and employers are aiming for a deal on wages and working hours by early February, representatives of both sides told Reuters. \nSome 160,000 workers had already joined industrial action this week to support IG Metall’s wage claims and the union has threatened to call for 24-hour walkouts if talks fail to make progress. \nSpurred on by the fastest economic growth in six years and record low unemployment, IG Metall is demanding a 6 percent rise for 3.9 million metals and engineering workers. \nIt has also launched its first major campaign for shorter working hours in more than three decades. It is demanding that workers gain the right to cut their weekly hours to 28 from 35 to care for children or elderly or sick relatives and then return to full-time employment after two years. \nEmployers have offered 2 percent plus a one-off 200-euro ($239) payment in the first quarter. They have rejected demands for a shorter working week unless hours could also be increased temporarily as well to maintain output. \nLabour bosses and industrial employers took a small step toward a deal in third-round regional talks in southwestern Baden-Wuerttemberg on Thursday, agreeing to appoint experts to look into the issue of working hours. \nAny deal in Baden-Wuerttemberg would typically be applied in other states as well. \nAs well as the differences over lengthening hours, employers have also rejected the idea that they should help make up for the pay shortfall for some workers who do cut their hours. \nTalks will resume in the region on Jan. 24, although sources on the employers’ side said it was unclear whether there would be a “long night” to conclude negotiations at that time or whether a fifth round of talks would be scheduled. \nAnalysts at Barclays said they expected an agreement on a wage increase of around 3.2 percent, based on an analysis of past labour deals by IG Metall. Typically, they said, a deal is achieved after five rounds of negotiations. \nGerman inflation hit its highest level in five years in 2017 when prices rose an average 1.7 percent over the year. \nTalks in the southern German state of Bavaria, home to industrial companies including engineering firm Siemens and truckmaker MAN, are due to enter a third round on Monday. \nLower Saxony will follow on Tuesday and North Rhine-Westphalia, Germany’s industrial heartland, on Thursday. ($1 = 0.8365 euros) (Writing by Maria Sheahan; editing by Jason Neely and Keith Weir)", "external_links": [], "published": "2018-01-12T13:48:00.000+02:00", "crawled": "2018-01-12T14:02:52.001+02:00", "highlightTitle": ""}