{"organizations": [], "uuid": "e30e4c831ee9135ba19c062c2a4f983946e61840", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/dmgt-equity/daily-mail-general-trust-a-media-stock-no-more-idUSL8N1P43LX", "country": "US", "domain_rank": 408, "title": "Daily Mail & General Trust: a media stock no more", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:57:00.000+02:00", "replies_count": 0, "uuid": "e30e4c831ee9135ba19c062c2a4f983946e61840"}, "author": "", "url": "https://www.reuters.com/article/dmgt-equity/daily-mail-general-trust-a-media-stock-no-more-idUSL8N1P43LX", "ord_in_thread": 0, "title": "Daily Mail & General Trust: a media stock no more", "locations": [], "entities": {"persons": [{"name": "tricia wright", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "daily mail & general trust", "sentiment": "negative"}, {"name": "dmgt", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "zoopla property group", "sentiment": "none"}, {"name": "euromoney institutional investor", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 2:59 PM / Updated 18 minutes ago Daily Mail & General Trust: a media stock no more Reuters Staff \n* DMGT had worst day in 30 years after annual results \n* Investec UK Equity Income Fund topped up holdings \nBy Tricia Wright \nLONDON, Jan 10 (Reuters) - Is Daily Mail & General Trust (DMGT) a newspaper company struggling to diversify away from a declining industry? Or a kind of private equity fund whose investments may soon start to pay off? \nGrim headlines last year culminated in a 24 percent share price fall on its annual results day in November. But some market players think that was an over-reaction, and showed investors are struggling to keep track of DMGT’s sprawling portfolio of assets. \nThe company operates in areas including events, insurance risk modelling and property data. It is also the largest shareholder of Euromoney Institutional Investor, which provides information for global finance, and ZPG, formerly Zoopla Property Group, a property search portal. \nIts sheer complexity is a deterrent. Some DMGT businesses are in cyclical industries and results can be volatile. And despite its dwindling reliance on newspapers, many investors still associate DMGT mostly with its Daily Mail title. \nThe big sell-off in DMGT shares in November, its worst daily performance in 30 years, was partly driven by asset writedowns. \nBut some market players believe DMGT’s investment into the business will start paying off. \nDMGT is pivoting from a shrinking physical newspaper business to a growing B2B (business to business) data subscription business, said Blake Hutchins, who manages the 84 million pound ($113 million) Investec UK Equity Income Fund. \n“That comes with complications - in any reporting period that can be volatile, but the transition and the long-term prospects for that company are very, very good,” he said. He flagged the high quality of the company’s data businesses. \nHutchins, who invests in capital-light, cash generative businesses that can grow their cashflows, added to a long-term holding in DMGT during 2017 and bought more shares after the post-results slump. \nChief Executive Paul Zwillenberg, a former management consultant who took charge in 2016, has been trying to tighten oversight of DMGT’s divisions. \nHe has moved to strengthen the balance sheet, and the stock achieves a 3.8 percent dividend yield. The stock has partly recovered, but is still about 15 percent below its level prior to November’s results. M&A IN PROSPECT? \nDMGT has a 2-billion-pound market capitalisation but is not included in the stock market’s FTSE indices because of rules around voting rights of the shares. This means tracker funds will not buy them and affects liquidity in the stock. \nDMGT Chairman Jonathan Harmsworth, a descendent of the company’s founders, and related parties own all the voting shares in the business, as well as about a fifth of the listed non-voting shares. \nDMGT’s many businesses are at different stages of development. Mail Online only recently turned a profit. In Risk Management Solutions (RMS), which models catastrophes for insurers, investments in its RMS(one) product have hit profits. DMGT recently shut its U.S. property data business Xceligent. \nBerenberg says DMGT’s stakes in Euromoney and ZPG alone account for around 55 percent of its market value - and can be viewed as a source of funds for acquisitions - while print advertising now makes up just 12 percent of its revenue. \nNick Train, who runs the CF Lindsell Train UK Equity Fund, the fund with the largest shareholding in DMGT, said after the annual results that it still saw the company as “notably undervalued” on a sum-of-the-parts basis. \nPremier Asset Management’s head of UK equities, Chris White, holds DMGT and also backs a “sum-of-the-parts” approach. \nHe said the closure of loss-making Xceligent should be quite accretive to profits from 2019, and believes DMGT management is going through “a bit of a rethink” that could involve M&A. \n“They have been looking at businesses. Nothing has been bought under the reign of Paul Zwillenberg because they obviously haven’t found the right thing at the right price,” White said. \nBerenberg, which has a “buy” rating on DMGT shares, lifted its target price for the stock this week, to 725 pence from 700 pence. The stock is currently trading around 600 pence. $1 = 0.7409 pounds Reporting by Tricia Wright; Editing by Tom Pfeiffer and Mark Potter", "external_links": [], "published": "2018-01-10T16:57:00.000+02:00", "crawled": "2018-01-10T17:26:11.005+02:00", "highlightTitle": ""}