{"organizations": [], "uuid": "06c7aff4a45c7ac4716cd818118870eea3e8278b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226169985&w=1200&r=LYNXMPEE0S052", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/global-markets/asia-shares-seek-to-extend-rally-dollar-at-mercy-of-bears-idINKBN1FI07F", "country": "US", "domain_rank": 408, "title": "Asia shares extend bull run, dollar crawls off lows", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T04:52:00.000+02:00", "replies_count": 0, "uuid": "06c7aff4a45c7ac4716cd818118870eea3e8278b"}, "author": "", "url": "https://in.reuters.com/article/global-markets/asia-shares-seek-to-extend-rally-dollar-at-mercy-of-bears-idINKBN1FI07F", "ord_in_thread": 0, "title": "Asia shares extend bull run, dollar crawls off lows", "locations": [], "entities": {"persons": [{"name": "thomso", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "min read  sydney", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 2:49 AM / Updated 29 minutes ago Global stocks slip as Treasury yields hit three-year highs Herbert Lash 4 Min Read \nNEW YORK (Reuters) - Global equity markets eased on Monday and U.S. Treasury yields surged to more than three-year highs after remarks by a European Central Bank official added to expectations that central banks globally will reduce stimulus as the economic outlook improves. \nU.S. stocks fell on news that Apple will halve the production target for its flagship iPhone X this quarter. \nThe report from Nikkei added to growing concerns about weak sales of the $999 phone ahead of Apple’s quarterly results slated for Thursday. Apple shares fell 1.9 percent and were the biggest weight on the benchmark S&P 500 index. \nFacebook, Broadcom and other technology shares also fell, but the biggest decliners were utilities and real estate, both down more than 1.0 percent as U.S. 10-year Treasury yields hit their highest since 2014. \nA break of technical support levels added to bearish sentiment as 10-year yields rose above a trendline that has marked a bull run dating back to the 1980s. \n“Key levels were taken out, the trend is broken,” said Tom di Galoma, a managing director at Seaport Global Holdings in New York. “It’s probably a realization that the global economy is moving ahead and has quite a bit of steam.” \nIn Europe, the pan-European FTSEurofirst 300 index closed down 0.20 percent at 1,570.85 and MSCI’s gauge of stocks around the globe shed 0.38 percent. \nWall Street pared some losses, with the Dow Jones Industrial Average off 81.87 points, or 0.31 percent, to 26,534.84. The S&P 500 lost 8.6 points, or 0.30 percent, to 2,864.27 and the Nasdaq Composite dropped 16.51 points, or 0.22 percent, to 7,489.27. \nFive-year German bond yields provided a positive return for the first time since late 2015 and yields across the euro area hit fresh highs after Dutch central bank chief Klaas Knot said the ECB should end its bond purchases this year. \nKnot said on Sunday the ECB should make it clear that asset purchases stop after the current bond-buying program ends in September. “There is no reason whatsoever to continue the program,” he said. The German share price index, DAX board, is seen at the stock exchange in Frankfurt, Germany, January 25, 2018. REUTERS/Staff/Remote \nGermany’s 10-year bond yield rose to its highest in more than two-years at 0.625 percent. \nComments from the Bank of Japan governor on Friday that inflation is finally close to reaching its target added to a sense of a policy shift among the major central banks. \nThe rise in government bond rates could stall the equity market rally and lead the U.S. Federal Open Market Committee to raise interest rates faster than expected this year, said Mike Terwilliger, portfolio manager of Resource Liquid Alternatives for the Resource Credit Income Fund. \n“If Treasuries cross the psychologically significant 3.0-percent threshold in the coming weeks, I would expect the broader equity markets to begin considering the risk of an acceleration in the pace of FOMC hikes,” Terwilliger said. FILE PHOTO: People walk past an electronic stock quotation board outside a brokerage in Tokyo, Japan, September 22, 2017. REUTERS/Toru Hanai/File Photo \nReuters data point to market expectations of about three more Fed rate hikes this year, starting in March, although some analysts, including at Goldman Sachs and JP Morgan Asset Management, expect the Fed to raise four times. \nThe benchmark 10-year Treasury note fell 10/32 in price to yield 2.6992 percent, up from 2.662 percent late on Friday. \nThe dollar rose against a basket of currencies as bond yields climbed. The dollar index rose 0.29 percent, with the euro down 0.27 percent to $1.2386. The Japanese yen eased 0.23 percent versus the greenback at 108.95. \nOil prices slipped 1.5 percent, pressured by a strengthening dollar and rising U.S. crude output, but prices remained on track for the biggest January increase in five years. \nBrent crude futures fell $1.06 to settle down at $69.46 a barrel. U.S. West Texas Intermediate (WTI) crude futures settled down 58 cents at $65.56 a barrel. \nGold prices fell as a rebounding U.S. dollar and rising government bond yields prompted investors to cash in bullion after its sixth weekly price rise in seven weeks. \nU.S. gold futures for February delivery settled down $11.80 an ounce at $1,340.30. Reporting by Herbert Lash; Editing by Bernadette Baum and Nick Zieminski", "external_links": [], "published": "2018-01-29T04:52:00.000+02:00", "crawled": "2018-01-29T05:12:02.010+02:00", "highlightTitle": ""}