{"organizations": [], "uuid": "9a1602f4bf2d8d15789b7ce53b0995680aff46ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-albania-greece-ww2graves/albania-starts-exhuming-greeces-wwii-unburied-fallen-idUSKBN1FI23Z", "country": "US", "domain_rank": 408, "title": "Albania starts exhuming Greece's WWII unburied fallen", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T19:27:00.000+02:00", "replies_count": 0, "uuid": "9a1602f4bf2d8d15789b7ce53b0995680aff46ab"}, "author": "", "url": "https://www.reuters.com/article/us-albania-greece-ww2graves/albania-starts-exhuming-greeces-wwii-unburied-fallen-idUSKBN1FI23Z", "ord_in_thread": 0, "title": "Albania starts exhuming Greece's WWII unburied fallen", "locations": [], "entities": {"persons": [{"name": "benet koleka", "sentiment": "none"}], "locations": [{"name": "greece", "sentiment": "none"}, {"name": "albania", "sentiment": "none"}, {"name": "tirana", "sentiment": "none"}, {"name": "athens", "sentiment": "none"}, {"name": "himare", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 5:27 PM / Updated 10 minutes ago Albania starts exhuming Greece's WWII unburied fallen Benet Koleka 3 Min Read \nHIMARE, Albania (Reuters) - The six Greek soldiers buried under the Brigo family’s olive trees near Himare, a town in southern Albania, have a shrine marking their resting place. \nScattered in the nearby valleys, however, others don‘t. Their remains lie where they fell in 1941, fighting in hot pursuit of the Italian fascist troops they chased out of Greece. \nThe Italians swept from Albania and were held back for a while until German troops had to step in. The Greek prime minister famously said one word - ochi, or no - when asked to surrender, still marked in Greece as Ochi Day. \nGreek families come to Albania to pay their respects on Ochi Day every year, but have no real graves to stand by. \nHaving tried in fits and starts to exhume and rebury the Greek fallen since Albania ditched communism in 1992, Athens and Tirana have finally started to exhume 7,976 fallen soldiers to re-inter them in cemeteries across Albania. \nThe first remains have already been exhumed in Sajmola Valley in central southern Albania. Greece’s foreign ministry described them as “the last unburied fallen of World War Two”. \nAt the foot of Mount Skutara, in an olive grove overlooking Greece’s Corfu island, six dead soldiers were less forgotten. They were killed by Italian artillery shortly after celebrating Orthodox Easter at Jani Brigo’s home. \n“My father’s dying wish was that I preserve Andreas Provatas’s wallet and watch over the graves,” Ermioni Brigo, 85, told Reuters as she swept away olives from the memorial. “I did, although helping them (impacted) us like gangrene.” \nHer father was jailed for 11 months by the Italians, accused of being a “philhellene”, and was then arrested by the communists, only to be saved by an Albanian deserter from the Italian army he had sheltered and who has since become a partisan commander. \nIn Sajmola Valley, Italians were once buried, but the plot is now empty because Italy repatriated them. \nThe Greeks want their dead to be buried here, something that has caused some political grumbling by Albanians who worry about Greek nationalists’ claims on southern Albania, home also to the ethnic Greek community. \nHence some of the delay. \nA short ride east, at the Church of Saint Nicholas near Kelcyre, the bones of 257 unidentified Greeks have been stored in white bags inside aluminum and wooden caskets for four years. \nOutside, the graves for them are empty. \n“They are dead and do no harm, the evil is amongst us, the living,” the church’s warden Kristo Koci, 75, told Reuters. Reporting by Benet Koleka Editing by Jeremy Gaunt", "external_links": [], "published": "2018-01-29T19:27:00.000+02:00", "crawled": "2018-01-29T19:39:21.015+02:00", "highlightTitle": ""}