{"organizations": [], "uuid": "a8dedafeab6502a584544a39fe929d1c20c78f18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-first-financial-bankshares-inc-completes-acquisition-of-commercial-bancshares-inc-kingwood-texas.html", "country": "US", "domain_rank": 767, "title": "First Financial Bankshares, Inc. Completes Acquisition Of Commercial Bancshares, Inc., Kingwood, Texas", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-02T20:03:00.000+02:00", "replies_count": 0, "uuid": "a8dedafeab6502a584544a39fe929d1c20c78f18"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-first-financial-bankshares-inc-completes-acquisition-of-commercial-bancshares-inc-kingwood-texas.html", "ord_in_thread": 0, "title": "First Financial Bankshares, Inc. Completes Acquisition Of Commercial Bancshares, Inc., Kingwood, Texas", "locations": [], "entities": {"persons": [], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "kingwood", "sentiment": "none"}, {"name": "texas abilene", "sentiment": "none"}, {"name": "panhandle", "sentiment": "none"}, {"name": "hereford", "sentiment": "none"}], "organizations": [{"name": "completes acquisition of commercial bancshares, inc.", "sentiment": "neutral"}, {"name": "first financial bankshares, inc", "sentiment": "neutral"}, {"name": "first financial bankshares, inc.", "sentiment": "neutral"}, {"name": "commercial bankshares, inc.", "sentiment": "none"}, {"name": "commercial bancshares, inc", "sentiment": "none"}, {"name": "commercial bancshares, inc.", "sentiment": "none"}, {"name": "first financial", "sentiment": "none"}, {"name": "commercial state bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ABILENE, Texas, Jan. 2, 2018 /PRNewswire/ -- First Financial Bankshares, Inc. (NASDAQ: FFIN) (\"First Financial\" or the \"Company\") announced today that it has completed the acquisition of Commercial Bancshares, Inc. and its wholly-owned subsidiary, Commercial State Bank, Kingwood, Texas, effective January 1, 2018. First Financial's banking operations now include 73 locations that span from Hereford in the Panhandle to Orange in southeast Texas.\nIn accordance with the terms of the definitive agreement, First Financial issued 1,289,371 shares of First Financial common stock, with an approximate value of $59.4 million, to the shareholders of Commercial Bancshares, Inc. In addition, prior to closing, Commercial Bankshares, Inc. paid a special dividend to its shareholders totaling $22.3 million in accordance with the definitive agreement. As of December 31, 2017, Commercial State Bank had total assets of approximately $390.2 million, total loans of approximately $271.5 million and total deposits of approximately $345.9 million.\n\"We are excited to welcome the Commercial State Bank team into the First Financial family,\" said F. Scott Dueser, Chairman, President and CEO of First Financial. \"We are most impressed with the employees, officers, management and board of this quality bank, who share our same values, philosophies and commitment to outstanding customer service. They are an excellent addition to our footprint especially in the high growth area around Houston.\"\n\"With its larger size and successful track record, First Financial offers our customers new and expanded services and creates more opportunity for our employees,\" said Harry J. Brooks, Chairman and CEO of Commercial State Bank. \"Our customers will continue to see the same friendly, local employees and the same strong commitment to the local community. At the same time, we will be able to offer a broader range of banking products and services including expanded depository products, state-of-the-art mobile banking and treasury management services, a larger lending capacity and trust services.\"\nAbout First Financial\nHeadquartered in Abilene, Texas, First Financial is a financial holding company that through its subsidiary, First Financial Bank, N.A., operates multiple banking regions with 73 locations in Texas, following the close of this acquisition, including Abilene, Acton, Albany, Aledo, Alvarado, Beaumont, Boyd, Bridgeport, Brock, Burleson, Cisco, Cleburne, Clyde, Conroe, Cut and Shoot, Decatur, Eastland, El Campo, Fort Worth, Fulshear, Glen Rose, Granbury, Grapevine, Hereford, Huntsville, Keller, Kingwood, Magnolia, Mauriceville, Merkel, Midlothian, Mineral Wells, Montgomery, Moran, New Waverly, Newton, Odessa, Orange, Palacios, Port Arthur, Ranger, Rising Star, Roby, San Angelo, Southlake, Stephenville, Sweetwater, Tomball, Trent, Trophy Club, Vidor, Waxahachie, Weatherford, Willis, and Willow Park. The Company also operates First Financial Trust & Asset Management Company, N.A., with seven locations and First Technology Services, Inc., a technology operating company.\nThe Company is listed on The NASDAQ Global Select Market under the trading symbol FFIN. For more information about First Financial, please visit our website at http://www.ffin.com .\nCertain statements contained herein may be considered \"forward-looking statements\" as defined in the Private Securities Litigation Reform Act of 1995. These statements are based upon the belief of the Company's management, as well as assumptions made beyond information currently available to the Company's management, and may be, but not necessarily are, identified by such words as \"expect\", \"plan\", \"anticipate\", \"target\", \"forecast\" and \"goal\". Because such \"forward-looking statements\" are subject to risks and uncertainties, actual results may differ materially from those expressed or implied by such forward-looking statements. Factors that could cause actual results to differ materially from the Company's expectations include competition from other financial institutions and financial holding companies; the effects of and changes in trade, monetary and fiscal policies and laws, including interest rate policies of the Federal Reserve Board; changes in the demand for loans; fluctuations in value of collateral and loan reserves; inflation, interest rate, market and monetary fluctuations; changes in consumer spending, borrowing and savings habits; and acquisitions and integration of acquired businesses, and similar variables. Other key risks are described in the Company's reports filed with the Securities and Exchange Commission, which may be obtained under \"Investor Relations-Documents/Filings\" on the Company's Web site or by writing or calling the Company at 325.627.7155. Except as otherwise stated in this news announcement, the Company does not undertake any obligation to update publicly or revise any forward-looking statements because of new information, future events or otherwise.\nView original content: http://www.prnewswire.com/news-releases/first-financial-bankshares-inc-completes-acquisition-of-commercial-bancshares-inc-kingwood-texas-300576489.html\nSOURCE First Financial Bankshares, Inc.", "external_links": ["http://www.ffin.com/", "http://www.prnewswire.com/news-releases/first-financial-bankshares-inc-completes-acquisition-of-commercial-bancshares-inc-kingwood-texas-300576489.html"], "published": "2018-01-02T20:03:00.000+02:00", "crawled": "2018-01-02T21:33:50.002+02:00", "highlightTitle": ""}