{"organizations": [], "uuid": "cfd3eaeff4b74aa709c38579d43938953c6fe507", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223080178&w=1200&r=LYNXMPEE0H1FE", "site_section": "http://feeds.reuters.com/news/wealth?format=xml", "section_title": "Reuters: Money", "url": "https://www.reuters.com/article/us-hedgefunds-blackstone-exclusive/exclusive-blackstones-hill-hands-hedge-fund-reins-to-mccormick-idUSKBN1F72D6", "country": "US", "domain_rank": 408, "title": "Exclusive: Blackstone's Hill hands hedge fund reins to McCormick", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:51:00.000+02:00", "replies_count": 0, "uuid": "cfd3eaeff4b74aa709c38579d43938953c6fe507"}, "author": "", "url": "https://www.reuters.com/article/us-hedgefunds-blackstone-exclusive/exclusive-blackstones-hill-hands-hedge-fund-reins-to-mccormick-idUSKBN1F72D6", "ord_in_thread": 0, "title": "Exclusive: Blackstone's Hill hands hedge fund reins to McCormick", "locations": [], "entities": {"persons": [{"name": "mccormick", "sentiment": "negative"}, {"name": "hill", "sentiment": "negative"}, {"name": "j. tomilson hill", "sentiment": "none"}, {"name": "john mccormick", "sentiment": "none"}, {"name": "mccormick svea", "sentiment": "none"}, {"name": "bill rigby", "sentiment": "none"}, {"name": "carmel crimmins", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "blackstone", "sentiment": "negative"}, {"name": "blackstone group", "sentiment": "none"}, {"name": "blackstone alternative asset management", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 4:53 PM / Updated 4 hours ago Exclusive: Blackstone's Hill hands hedge fund reins to McCormick Svea Herbst-Bayliss 5 Min Read \nBOSTON (Reuters) - After nearly two decades of growing Blackstone Group into the world’s biggest hedge fund investor with some $74 billion in assets, J. Tomilson Hill is passing the baton. \nBlackstone has promoted John McCormick to president and chief executive of hedge fund unit Blackstone Alternative Asset Management (BAAM) and Hill will become its chairman, the company told Reuters on Thursday. The change is effective immediately. \nHill, the face of hedge fund investing at the private equity giant since he was tapped to help put the partners’ money to work in 2000, plans to stay at Blackstone for now. He will remain on Blackstone’s board and its 11-person management committee. \nBy installing a younger chief at the hedge fund unit, which makes up roughly one-fifth of the company’s assets, Blackstone is laying the groundwork for a generational shift in an industry where many firms have struggled to move beyond their founders. \n“There will be a lot of continuity but that doesn’t mean it will be boring,” McCormick, 50, told Reuters. He added that Hill, who turn 70 this year and has mentored him during his 13 years at the firm, urged him to continue shaking things up. \nFor a quarter of a century, Hill, who came to Blackstone after being ousted as co-chief executive at Lehman Brothers, has added foreign governments, sovereign wealth funds and pensions to the firm’s growing client roster. \nWhen his clients complained about hedge funds’ hefty fees, he pushed for cuts, and when they worried about being lumped into investment pools he pushed managers to create separately managed accounts. When big data crept into investing, he was among the first to make big bets on so-called quant funds like Two Sigma and Peter Muller’s PDT. \nHe has established strong ties with some of the industry’s best talents, including Paul Singer’s Elliott Management and Paul Tudor Jones’ Tudor Investment Corp. \nThere have been some setbacks, including the shuttering of Senfina, Blackstone’s “big bet” hedge fund, amid mounting double-digit losses in 2016. TRANSITION IN FOCUS \nWhile the hedge fund industry has suffered record outflows in recent years due to high fees and sub-par performance, BAAM has pulled in billions in fresh money and manages more than twice as much as its nearest rival, UBS Hedge Fund Solutions. \nIn the 17 years since its launch, BAAM’s Principal Solutions Business has delivered an annualized net return of 6 percent, beating the S&P 500 Total Return and MSCI World Total Return Indices. It has done so with approximately 30 percent of the volatility, the firm said in a filing. John McCormick, President and CEO of Blackstone Alternative Asset Management, poses for a portrait in New York, U.S., January 18, 2018. REUTERS/Lucas Jackson \nBut Hill has watched fund managers big and small struggle with leadership transition and vowed to do better. It is a key topic in an industry where investors often lock up money for years. \n“Succession planning has been on my mind for years,” he said. \nHill has worked closely with McCormick, who has been instrumental in creating and selling many of BAAM’s new products, including taking stakes in established hedge funds, which helped boost revenue. \nAs head of global strategy for the group, McCormick was instrumental in creating hedge fund products aimed at retail clients. Slideshow (10 Images) \nA plan to make these “liquid alts” widely available in employer sponsored, tax-deferred 401(k) retirement plans, however, has yet to pan out. \nHILL‘S NEXT CHAPTER \nA trained lawyer who worked at U.S. Treasury and management consultancy McKinsey & Co before joining what he calls a “a rocket ship poised for great things”, McCormick cuts a different figure from Hill, a billionaire art collector often seen on the Manhattan social circuit. \nBefitting the secretive hedge fund industry, McCormick keeps a relatively low profile. He gets to the office by 7:30 a.m. and often stays to 8:00 p.m. or later. He recently learned Spanish and accompanies his in-laws to Cuba, he said, which has meant a lot of foreign language radio for his three children as he ferries them to soccer games. \n“He is very orderly, thoughtful and very, very smart,” Blackstone Chief Executive Stephen Schwarzman said. \nWhile Hill is stepping back from the day-to-day business, he will remain integrally involved. \n“Tom has been at the table for all the major developments and he has done a fantastic job of developing BAAM,” said Schwarzman, who met Hill in the Army Reserves decades ago. \nHill, who is working on plans to build a museum to exhibit some of his Warhols, Lichtensteins and Bacons, has been captivated by using data to make investment decisions. \n“I am looking down the road, I am not a looking in the rear-view mirror kind of guy.” Reporting by Svea Herbst-Bayliss, editing by Carmel Crimmins and Bill Rigby", "external_links": [], "published": "2018-01-18T18:51:00.000+02:00", "crawled": "2018-01-18T19:00:42.028+02:00", "highlightTitle": ""}