{"organizations": [], "uuid": "fd768a82adc57f35c15981883bcc2ee83b93282f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 88, "shares": 88, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220848602&w=1200&r=LYNXMPEE090XQ", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-women-farming/denied-land-indian-women-stake-claims-in-collectives-idUSKBN1EZ1TD", "country": "US", "domain_rank": 408, "title": "Denied land, women stake claims in collectives", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T22:41:00.000+02:00", "replies_count": 0, "uuid": "fd768a82adc57f35c15981883bcc2ee83b93282f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-women-farming/denied-land-indian-women-stake-claims-in-collectives-idUSKBN1EZ1TD", "ord_in_thread": 0, "title": "Denied land, women stake claims in collectives", "locations": [], "entities": {"persons": [{"name": "shakila kalaiselvan", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "pallur", "sentiment": "none"}, {"name": "tamil nadu", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation) - fed", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALLUR, India (Thomson Reuters Foundation) - Fed up with local officials denying their demand for land, 40 women decided to form a collective and simply start farming a plot near their village of Pallur, in India’s southern state of Tamil Nadu.\nThe women are Dalits, a social caste that has traditionally suffered discrimination. Indian laws ban the persecution of Dalits, and states including Tamil Nadu have passed legislation to make them eligible for land distribution.\nHowever, prejudice against Dalits persists and officials routinely refuse to provide them with farmland. About two-thirds remain landless.\n“We have worked as farm laborers most of our lives - why can’t we own land?” asked Shakila Kalaiselvan, leader of the women’s collective.\nMembers of the group faced additional discrimination due to their gender. Despite laws granting equal inheritance rights, women own just 13 percent of land in India although they do about two-thirds of all farm work.\nA year ago, they took over an unused 2.5-acre (1 hectare) plot, which was dry and overgrown with weeds. Even though it was common land owned by the state, they faced strong resistance as they cleared it to grow beans, corn and millet.\n“The higher-caste men opposed it, but we did not give in,” Kalaiselvan told the Thomson Reuters Foundation. “We should have at least 40 acres for 40 women, but this is a start. We can be independent, earn the respect of the community.”\nAcross India, women are increasingly taking the law into their own hands when local officials and male community leaders prevent them from obtaining land legally, activists say.\n“These women cannot buy or inherit land, and they have not got any land from the government, so what is the option?” asked Fatima Burnad, founder of the Society for Rural Education and Development.\n“I tell them, occupy land where you can - like the Occupy Wall Street movement, it is an act of resistance,” said Burnad, whose organization supports the Pallur collective with the loan of a tractor and training in organic farming techniques.\nPOLITICALLY EMPOWERED More than half of India’s 1.3 billion population depends on land for a living. Conflicts have increased over the past two decades as land is increasingly sought for industrial use and development projects in a rapidly growing economy.\nIn response to shrinking farmland combined with increased demand, a handful of states have adopted collective farming models for women and Dalits.\nPerhaps the most successful of these is in the small southern state of Kerala, where a government initiative has benefited tens of thousands of women.\nKudumbashree, which the government launched in 1998, gives cheap loans to women’s groups, enabling them to lease private land.\nA group of Dalit women of a farming collective walking on the land that they took over for cultivation in Pallur, India. December 26, 2017. Thomson Reuters Foundation/Rina Chandran As of March 2017, about 300,000 women were farming more than 51,000 hectares of land in collectives, according to Kudumbashree. They grow rice, pineapple and other crops, helped by state benefits such as insurance.\nThe model has lasted because “these farms have higher productivity than individual farms, which means higher incomes for the women,” said Dimple Abraham, a research associate at the Centre for Women’s Development Studies think tank.\nThe women have also become politically engaged, with more than 11,000 members of Kudumbashree contesting village council elections in recent years. Nearly half won, she said.\nREDUCE VULNERABILITY In nearby Andhra Pradesh state, the government leases 3-5 acres of land to collectives of five to 10 women each, and gives cheap loans for other livelihood options such as poultry and goat rearing.\nA group of Dalit women of a farming collective walking on the land that they took over for cultivation in Pallur, India. December 26, 2017. Thomson Reuters Foundation/Rina Chandran The government of Tamil Nadu is encouraging small farmers to pool their lands and form collectives in order to reduce their vulnerability to drought and unseasonal rain, and price swings.\nA pilot of 2,000 collectives of about 100 farmers each is being launched, and the scheme will eventually benefit about 4 million farmers, according to the 2017-18 budget.\nIn the western state of Punjab, where a feudal system has denied Dalits their right to a third of village common farmland - more than 50,000 acres - Dalits have formed collectives over the past decade.\nMany of the collectives are led by women, and they have taken over more than 200 acres of land, often clashing violently with high-caste landlords, said Ish Mishra, a political science professor at Delhi University.\n“The movement is led by educated Dalit youth, who know they have been cheated of land that is rightfully theirs,” he said.\nCONSTANT STRUGGLE In Pallur, a second collective of 40 women plans to clear another 2.5 acres of common land, according to Kalaiselvan.\nIn the meantime, the group she leads is fighting a bureaucratic battle with the local revenue office to obtain a title for joint ownership of its land.\nThe revenue officer did not return calls seeking comment.\n“It’s a constant struggle; it doesn’t stop with getting the land. They have to go against their husbands, the landlords,” said Burnad, of the Society for Rural Education and Development.\n“But all Dalits, especially the women, must own some land,” she said. “That is how they will be empowered, and challenge the caste bias, and they can do this better as a collective.”\nReporting by Rina Chandran @rinachandran, Editing by Jared Ferrie. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T22:41:00.000+02:00", "crawled": "2018-01-11T03:49:52.000+02:00", "highlightTitle": ""}