{"organizations": [], "uuid": "d09bbcb1f4b20023aac3855acd8510c85b286450", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-blame-game-but-no-agreement-after-trump-schumer-meet.html", "country": "US", "domain_rank": 767, "title": "Blame game, but no agreement after Trump, Schumer meet", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T08:08:00.000+02:00", "replies_count": 0, "uuid": "d09bbcb1f4b20023aac3855acd8510c85b286450"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-blame-game-but-no-agreement-after-trump-schumer-meet.html", "ord_in_thread": 0, "title": "Blame game, but no agreement after Trump, Schumer meet", "locations": [], "entities": {"persons": [{"name": "schumer", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — President Donald Trump and Senate Democratic leader Chuck Schumer met Friday afternoon in an eleventh-hour effort to avert a government shutdown, with a bitterly divided Washington locked in partisan stare-down over politically fraught legislation to protect about 700,000 younger immigrants from being deported.\nRepublicans and Democrats in Congress and the White House traded blame for the possible shutdown just hours before the midnight deadline. And Trump phoned the New York lawmaker to invite him to the White House to try to reach some sort of accord.\n\"We made some progress, but we still have a good number of disagreements,\" Schumer told reporters upon returning to Capitol Hill.\nAs news of the Schumer meeting spread, the White House sought to reassure Republican congressional leaders that Trump would not make any major policy concessions, said a person familiar with the conversations but not authorized to be quoted by name.\nDemocrats in the Senate have served notice they will filibuster a four-week, government-wide funding bill that cleared the House Thursday evening. That could expose them to charges that they are responsible for a shutdown, but they point the finger at Republicans instead.\n\"They're in charge,\" Schumer said Friday as he entered his Capitol office. \"They're not talking to us. They're totally paralyzed and inept. There's no one to negotiate with.\"\nRepublicans controlling the narrowly split chamber argue that it's the Democrats who are holding the government hostage over demands to protect \"dreamer\" immigrants brought to the country as children and now here illegally.\nAnd the White House piled on, trying to paint the impending action as the \"Schumer shutdown.\" Still, officials said the president has been working the phones trying to avert one. The White House said Trump would not leave for a planned weekend trip to Florida if there was no agreement. The president had been set to leave Friday afternoon to attend a fundraiser at his Palm Beach estate marking the one-year anniversary of his inauguration.\nThe impact of the potential shutdown on the planned trip by Trump and much of his Cabinet to the World Economic Forum in Davos, Switzerland, next week was still undetermined.\nTrump entered the fray early Friday morning, mentioning the House-approved bill on Twitter, adding: \"Democrats are needed if it is to pass in the Senate — but they want illegal immigration and weak borders. Shutdown coming? We need more Republican victories in 2018!\"\nTrump has given Congress until March 5 to save the Obama-era Deferred Action for Childhood Arrivals program protecting young immigrants, so \"there is absolutely no reason to tie those things together right now,\" Budget Director Mick Mulvaney said at the White House.\nOn Capitol Hill, Senate Majority Leader Mitch McConnell, R-Ky., said he hoped to vote on the House-passed bill \"soon,\" and he said Americans at home would be watching to see \"which senators make the patriotic decision\" and which \"vote to shove aside veterans, military families and vulnerable children to hold the entire country hostage... until we pass an immigration bill.\" A Senate GOP aide said McConnell was not attending the White House meeting because Trump had only issued the invitation to Schumer.\nIn the House, Republicans muscled the measure through on a mostly party-line 230-197 vote after making modest concessions to chamber conservatives and defense hawks.\nThe chamber backed away from a plan to adjourn for a one-week recess Friday afternoon, meaning the GOP-controlled House could wait to see if a last-minute compromise would be reached requiring a new vote.\nA test vote on a filibuster by Senate Democrats appeared likely before the shutdown deadline. Schumer was rebuffed in an attempt to vote Thursday night.\n\"We can't keep kicking the can down the road,\" said Schumer, insisting on more urgency in talks on immigration. \"In another month, we'll be right back here, at this moment, with the same web of problems at our feet, in no better position to solve them.\"\nThe short-term measure would be the fourth stopgap spending bill since the current budget year started in October. A pile of unfinished Capitol Hill business has been on hold, first as Republicans ironed out last fall's tax bill and now as Democrats insist on progress on immigration. Talks on a budget deal to ease tight spending limits on both the Pentagon and domestic agencies are on hold, as is progress on a huge $80 billion-plus disaster aid bill.\nHouse GOP leaders sweetened the pending stopgap measure with legislation to extend for six years a popular health care program for children from low-income families and two-year delays in unpopular \"Obamacare\" taxes on medical devices and generous employer-provided health plans.\nA shutdown would be the first since 2013, when tea party Republicans — in a strategy not unlike the one Schumer is employing now — sought to use a must-pass funding bill to try to force then-President Barack Obama into delaying implementation of his marquee health care law. At the time, Trump told Fox & Friends that the ultimate blame for a shutdown lies at the top. \"I really think the pressure is on the president,\" he said.\nArguing that Trump's predecessors \"weaponized\" that shutdown, Mulvaney said Friday the budget office would direct agencies to work to mitigate the impact of a potential lapse in funding.\n\"The difference between now and 2013 is that the president is standing in the way of a bipartisan agreement,\" Schumer said, referring to a proposal forged by Sens. Lindsey Graham, R-S.C., and Dick Durbin, D-Ill., among others, that would provide protections to dreamer immigrants, fund border security, and eliminate an immigration lottery aimed at promoting diversity.\nDemocrats want a deal to protect around 700,000 immigrants from deportation who arrived in the U.S. as children and have stayed here illegally. Trump has ended an Obama-era program providing those protections and given Congress until March to restore them, and he and Republicans want any immigration deal to include money for the president's promised wall along the Mexican border and other security measures.\nCongress must act by midnight Friday or the government will begin immediately locking its doors. Though the impact would initially be spotty — since most agencies would be closed until Monday — the story would be certain to dominate weekend news coverage, and each party would be gambling the public would blame the other.\nIn the event of a shutdown, food inspections, federal law enforcement, airport security checks, and other vital services would continue, as would Social Security, other federal benefit programs and military operations. But most federal workers wouldn't be paid.\nAssociated Press writers Jill Colvin and Catherine Lucey contributed to this report.", "external_links": [], "published": "2018-01-19T08:08:00.000+02:00", "crawled": "2018-01-20T00:25:35.007+02:00", "highlightTitle": ""}