{"organizations": [], "uuid": "0f50415267953edc1e12a5de8406b8e318cf25f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 10}, "facebook": {"likes": 43, "shares": 43, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221117400&w=1200&r=LYNXMPEE0A0TP", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-delta-air-results/delta-air-lines-quarterly-profit-falls-8-percent-idUSKBN1F01GN", "country": "US", "domain_rank": 408, "title": "Delta Air Lines quarterly profit falls 8 pct", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T14:00:00.000+02:00", "replies_count": 0, "uuid": "0f50415267953edc1e12a5de8406b8e318cf25f2"}, "author": "", "url": "https://www.reuters.com/article/us-delta-air-results/delta-air-lines-quarterly-profit-falls-8-percent-idUSKBN1F01GN", "ord_in_thread": 0, "title": "Delta Air Lines quarterly profit falls 8 pct", "locations": [], "entities": {"persons": [{"name": "reut", "sentiment": "negative"}, {"name": "arun koyyur", "sentiment": "none"}, {"name": "alana wise", "sentiment": "none"}, {"name": "bill rigby", "sentiment": "none"}], "locations": [{"name": "ankit ajmera", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "delta air lines", "sentiment": "negative"}, {"name": "delta air lines inc", "sentiment": "none"}, {"name": "delta", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Delta Air Lines Inc ( DAL.N ) is anticipating a double benefit from the U.S. corporate tax cut this year as it saves money on its own bill and expects an uptick in business travel as companies use tax savings to invest in generating new business. \n“We’re very excited about the potential for increased business demand with the tax cuts,” Delta President Glen Hauenstein told analysts in a conference call after quarterly earnings on Thursday. \n“We haven’t seen that materialize yet, but we expect that to materialize in the first quarter.” \nThe No. 2 U.S. carrier reported better-than-expected fourth-quarter profit on Thursday, helped by higher business fares and a busy holiday travel season, and forecast even better performance this quarter as demand for travel remains strong across the board. \nIts shares rose 2.7 percent to $57.37 on the New York Stock Exchange, helping the NYSE Arca airline index .XAL up 2.3 percent, on track for its best day since Nov. 29. \nAtlanta-based Delta forecast total unit revenue, a measurement closely watched by investors, to increase by 2.5 percent to 4.5 percent in the first quarter of 2018, not including any benefit from increased travel that may result from the tax cut. \nIn December, U.S. Congress passed a sweeping tax law designed to kick-start economic growth that slashed the corporate rate to 21 percent from 35 percent. \nSeveral U.S. companies have already said they will make more investments in their businesses and raise pay or bonuses for workers because of the new tax law, both of which could lead to an uptick in air travel. \nDelta said on Thursday the law would cut its own tax rate to between 22 percent and 24 percent in 2018. Partly due to those savings, Delta raised its full-year profit outlook to between $6.35 and $6.70 per share, well ahead of Wall Street estimates. \n\nSlideshow (4 Images) Delta said it would not use tax savings to pay any U.S. tariffs slapped on its order of 75 CSeries jets from Canadian planemaker Bombardier Inc ( BBDb.TO ) as a result of an unresolved trade spat. A ruling on the matter is expected later this month. \nFIRST OUT OF THE GATE Delta is the first to report earnings after a broadly positive quarter, where airlines managed to hike fares to partially offset growth in fuel prices and other costs. \nEarlier this week United Airlines ( UAL.N ) and American Airlines ( AAL.O ) forecast higher unit revenue, followed by JetBlue Airways Corp ( JBLU.O ) on Thursday. \nDelta’s quarterly net profit fell as it took a combined hit of $60 million from December’s power outage at Atlanta’s Hartsfield-Jackson Airport and Winter Storm Benji. It also took a one-time charge of $150 million due to the tax code change. \nIncluding those items, Delta’s fourth-quarter net income dipped to $572 million, or 80 cents per share, compared with $622 million, or 84 cents per share, a year earlier. \nExcluding the tax charge and other one-time items, Delta earned 96 cents per share, above the average 88 cents per share expected by analysts, according to Thomson Reuters I/B/E/S. \nTotal operating revenue rose 8.3 percent to $10.25 billion from $9.46 billion. Analysts on average had expected revenue of $10.13 billion. \n“Stronger than expected revenues, good unit revenue momentum and raised 2018 guidance aided by benefits of tax reform would be the major takeaways,” said CFRA Research analyst Jim Corridore on the increase in Delta shares. \nYear over year, Delta’s costs, excluding fuel and special items, increased 5.6 percent, driven by higher labor expenses and accelerated depreciation from aircraft retirements. \nReporting by Alana Wise in New York and Ankit Ajmera in Bengaluru; Additional reporting by Chuck Mikolajczak; Editing by Bill Rigby and Arun Koyyur\n ", "external_links": [], "published": "2018-01-11T14:00:00.000+02:00", "crawled": "2018-01-11T14:11:39.036+02:00", "highlightTitle": ""}