{"organizations": [], "uuid": "15588ea564c6fefcbdbe000bc4726657504139d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/africa-factors/african-markets-factors-to-watch-on-jan-24-idUSL8N1PJ0GN", "country": "US", "domain_rank": 408, "title": "African Markets - Factors to watch on Jan. 24", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-24T13:28:00.000+02:00", "replies_count": 0, "uuid": "15588ea564c6fefcbdbe000bc4726657504139d5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/africa-factors/african-markets-factors-to-watch-on-jan-24-idUSL8N1PJ0GN", "ord_in_thread": 0, "title": "African Markets - Factors to watch on Jan. 24", "locations": [], "entities": {"persons": [{"name": "jacob zuma", "sentiment": "none"}], "locations": [{"name": "nigeria", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "ghana", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}], "organizations": [{"name": "african national congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The following company announcements, scheduled economic indicators, debt and currency market moves and political events may affect African markets on Wednesday. - - - - - EVENTS: * Ghana releases producer price inflation. GLOBAL MARKETS Asian share markets took a time out on Wednesday as investors were left breathless at the breakneck pace of recent gains, while a fresh burst of speculative selling took the U.S. dollar to three-year lows. WORLD OIL PRICES Oil prices fell on Wednesday, weighed down by data that showed an increase in U.S. crude oil and gasoline inventories. EMERGING MARKETS For the top emerging markets news, double click on AFRICA STOCKS For the latest news on African stocks, click on SOUTH AFRICA MARKETS South Africa's rand drifted lower on Tuesday as investors waited for more clues from the new leader of the ruling African National Congress on how he plans to rejuvenate the economy and when President Jacob Zuma might step down. NIGERIA CENTRAL BANK A standoff between Nigeria's presidency and parliament over confirmation of new members of the central bank's interest rate committee is threatening the bank's independence and damaging fragile investor confidence in Africa's biggest economy. NIGERIA MARKETS Nigerian stocks fell 2.7 pct to a one-week low on Tuesday after the central bank called off an interest rate meeting scheduled for Jan. 22-23 because a backlog of appointments to the Monetary Policy Committee (MPC) meant it would not be quorate. KENYA MARKETS The Kenyan shilling KES= strengthened to an 11-month high against the dollar on Tuesday due to inflows from offshore investors buying government debt and tightening money market liquidity, traders said. KENYA CENTRAL BANK Kenya's central bank governor forecast on Tuesday that the East African nation's economy would grow by 6.2 per cent in 2018. EGYPT POLITICS The last challenger seen as a potential threat to the re-election of Egyptian President Abdel Fattah al-Sisi was detained on Tuesday, and halted his campaign after the army accused him of breaking the law by running for office without permission. ZIMBABWE POLITICS Zimbabwe has given cabinet ministers and senior government officials until the end of February to declare their assets as new President Emmerson Mnangagwa seeks to foster transparency and fight corruption. ANGOLA OIL Angolan state oil firm Sonangol has issued its first public tender to buy refined products to widen its import base, market sources who have seen the tender said, in a sign the country is committed to reforming its oil industry. For the latest precious metals report click on For the latest base metals report click on For the latest crude oil report click on\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T13:28:00.000+02:00", "crawled": "2018-01-25T13:25:13.012+02:00", "highlightTitle": ""}