{"organizations": [], "uuid": "9ac10142d7bf422a5dc47baf86029babc677f455", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 25, "shares": 25, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/trump-threatens-to-cut-off-us-aid-to-palestinian-authority.html", "country": "US", "domain_rank": 767, "title": "Trump threatens to cut off US aid to Palestinian Authority", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-03T09:33:00.000+02:00", "replies_count": 0, "uuid": "9ac10142d7bf422a5dc47baf86029babc677f455"}, "author": "Getty Images", "url": "https://www.cnbc.com/2018/01/03/trump-threatens-to-cut-off-us-aid-to-palestinian-authority.html", "ord_in_thread": 0, "title": "Trump threatens to cut off US aid to Palestinian Authority", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "neutral"}, {"name": "trum", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "palestinian authority u.s. news trump", "sentiment": "neutral"}, {"name": "palestinian authority", "sentiment": "neutral"}, {"name": "palestinian authority trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Acknowledging his push to broker peace in the Middle East has stalled, President Donald Trump on Tuesday appeared to threaten to cut off U.S. aid money to the Palestinian Authority, asking why the U.S. should make \"any of these massive future payments\" when the Palestinians are \"no longer willing to talk peace.\"\nTrump, in a pair of tweets, said the U.S. pays \"the Palestinians HUNDRED OF MILLIONS OF DOLLARS a year and get no appreciation or respect.\"\n\"They don't even want to negotiate a long overdue ... peace treaty with Israel,\" he wrote.\nTrump infuriated Palestinians and Muslims across the Middle East when he announced late last year that the U.S. would consider Jerusalem the capital of Israel and move its embassy there, upending decades of U.S. policy and igniting protests.\nWhile the Palestinians haven't closed the door to a potential deal with Israel, Palestinian leader Mahmoud Abbas said the announcement had destroyed Trump's credibility as a Mideast peace broker, calling the decision \"a declaration of withdrawal from the role it has played in the peace process.\"\nTuesday's tweets mark a tacit admission by Trump that his decision to move the U.S. embassy in Israel from Tel Aviv to Jerusalem has thrown a wrench into his administration's plans to restart the peace process between Israelis and Palestinians, which he had dubbed \"the ultimate deal.\"\nTrump tasked son-in-law Jared Kushner to restart the effort, and brought his former attorney, Jason Greenblatt, into the White House to lead the negotiations. Trump's Mideast peace team had held meetings with Israeli, Palestinian and Arab leaders for nearly a year ahead of an expected peace proposal.\nBut by recognizing Israel's claim to Jerusalem, Trump was seen by the Palestinians as siding with Israel on the most sensitive issue in the conflict. The Palestinians seek east Jerusalem — which Israel captured in 1967 — for their capital.\nTrump said his decision merely recognized the reality that Jerusalem already serves as Israel's capital and wasn't meant to prejudge the final borders of the city.\nIn his tweets, Trump argued his decision had taken \"Jerusalem, the toughest part of the negotiation, off the table, but Israel, for that, would have had to pay more.\"\nWhen Trump declared Jerusalem to be Israel's capital, he insisted, counterintuitively, that the move would improve, not hurt, prospects for clinching a peace deal.\nIn the days after the decision, Trump administration officials said the strategy was based on the notion that Israel had lost faith in the U.S. as a committed partner during the Obama administration. With trust in Washington restored, Netanyahu's government would be more inclined going forward to make tough concessions that would ultimately be needed for a peace deal, the U.S. officials argued at the time, and Israeli officials quietly indicated that they could potentially do so.\nNo one spelled out, however, what the Palestinians would receive in return.\nTrump on Tuesday also issued a threat to cut off foreign aid dollars to an unspecified list of countries that don't reciprocate.\n\"It's not only Pakistan that we pay billions of dollars to for nothing, but also many other countries, and others,\" Trump wrote, appearing to reference a Jan. 1 tweet lambasting Pakistan for failing to do enough to combat terror groups while taking U.S. aid. \"No more!\" Trump had tweeted Monday.\nTrump's language marks a striking departure from decades of bipartisan American practice and reflects Trump's transactional view of global affairs. U.S. leaders of both parties have long utilized foreign assistance dollars — a minor percentage of the overall budget — to promote American interests abroad, alleviate humanitarian crises and support oppressed peoples .\nTrump's envoy to the United Nations, U.S. Ambassador Nikki Haley, foreshadowed Trump's warning earlier Tuesday at the U.N. Security Council. Haley said the president doesn't want to give more funds \"until the Palestinians are willing to come back to the negotiation table.\"\n\"We still very much want to have a peace process. Nothing changes with that. The Palestinians now have to show they want to come to the table,\" Haley said. \"As of now, they're not coming to the table, but they ask for aid. We're not giving the aid. We're going to make sure that they come to the table.\"\nSince a Dec. 21 U.N. vote condemning Trump's Jerusalem decision, U.S. officials have been weighing various options for retaliating against the Palestinians for pushing the resolution, which passed by a 128-9 margin.\nThose options, which were to be discussed by Trump's top national security aides at a meeting next week, included several involving cutting off some or all aid to the Palestinian Authority. Another option would cut funding to the U.N. agency that provides services to the Palestinians in places like Gaza, Jordan and Lebanon.\nThe talks are in their very early stages, with no determination yet of a fixed amount or percentage of assistance to be cut, according to officials familiar with the discussions.\nHowever, the officials noted that only a relatively small amount of the more than $220 million that the U.S. was planning on sending to the Palestinians in the current budget year actually goes to the Palestinian Authority. Most of that assistance flows to non-governmental groups that are involved in building civic organizations that promote good governance, anti-corruption efforts, and health and education projects.\nThe officials said one possibility would be to redirect aid from the Palestinian Authority to those groups. Similar proposals were envisioned for the U.N. relief agency for Palestinians, the officials said, noting that Palestinian children in Gaza, Jordan and Lebanon would be disproportionally affected by an immediate and complete cut-off.\nChris Gunness, a spokesperson for the U.N. Relief and Works Agency for Palestinian Refugees in the Near East, said it had not been informed of any changes to U.S. funding at this time.\nOne basket of money that is unlikely to be affected is security assistance that helps the Palestinian Authority coordinate police cooperation with Israel, the officials said. They spoke on conditions of anonymity because they were not authorized to speak publicly about internal deliberations.", "external_links": [], "published": "2018-01-03T09:33:00.000+02:00", "crawled": "2018-01-03T09:32:32.003+02:00", "highlightTitle": ""}