{"organizations": [], "uuid": "8e2d3aaf0293b0f697e60b866fd2695d8c41e93e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222825698&w=1200&r=LYNXMPEE0G1QU", "site_section": "http://feeds.reuters.com/reuters/INformulaOne\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/us-usa-trump-trade-exclusive/exclusive-trump-considers-big-fine-over-china-intellectual-property-theft-idINKBN1F62SR", "country": "US", "domain_rank": 408, "title": "Exclusive: Trump considers big 'fine' over China intellectual property theft", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T22:32:00.000+02:00", "replies_count": 0, "uuid": "8e2d3aaf0293b0f697e60b866fd2695d8c41e93e"}, "author": "", "url": "https://in.reuters.com/article/us-usa-trump-trade-exclusive/exclusive-trump-considers-big-fine-over-china-intellectual-property-theft-idINKBN1F62SR", "ord_in_thread": 0, "title": "Exclusive: Trump considers big 'fine' over China intellectual property theft", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "gary cohn", "sentiment": "none"}, {"name": "cohn", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jeff mason", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "united states trade representative", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 8:26 PM / Updated 12 minutes ago Exclusive: Trump considers big 'fine' over China intellectual property theft Jeff Mason 3 Min Read \nWASHINGTON (Reuters) - President Donald Trump said on Wednesday the United States was considering a big “fine” as part of a probe into China’s alleged theft of intellectual property, the clearest indication yet that his administration will take retaliatory trade action against China. \nIn an interview with Reuters, Trump and his economic adviser Gary Cohn said China had forced U.S. companies to transfer their intellectual property to China as a cost of doing business there. \nThe United States has started a trade investigation into the issue, and Cohn said the United States Trade Representative would be making recommendations about it soon. \n“We have a very big intellectual property potential fine going, which is going to come out soon,” Trump said in the interview. \nWhile Trump did not specify what he meant by a “fine” against China, the 1974 trade law that authorized an investigation into China’s alleged theft of U.S. intellectual property allows him to impose retaliatory tariffs on Chinese goods or other trade sanctions until China changes its policies. \nTrump said the damages could be high, without elaborating on how the numbers were reached or how the costs would be imposed. \n“We’re talking about big damages. We’re talking about numbers that you haven’t even thought about,” Trump said. \nU.S. businesses say they lose hundreds of billions of dollars in technology and millions of jobs to Chinese firms which have stolen ideas and software or forced them to turn over intellectual property as part of the price of doing business in China. U.S. President Donald Trump speaks during an interview with Reuters at the White House in Washington, U.S., January 17, 2018. REUTERS/Kevin Lamarque \nThe president said he wanted the United States to have a good relationship with China, but Beijing needed to treat the United States fairly. \nTrump said he would be announcing some kind of action against China over trade and said he would discuss the issue during his State of the Union address on Jan. 30. Slideshow (4 Images) \nAsked about the potential for a trade war depending on potential U.S. action over steel, aluminum and solar panels, Trump said he hoped a trade war would not ensue. \n“I don’t think so, I hope not. But if there is, there is,” he said. \nThe president also said he and Chinese President Xi Jinping had not discussed China’s plans with regard to purchases of U.S. Treasury bonds. \nBloomberg reported earlier this month that Chinese officials reviewing the country’s foreign exchange holdings had recommended slowing or halting purchases of U.S. Treasury bonds. \nTrump said he was not concerned such a move would hurt the U.S. economy. \n“We never talked about it. They have to do what they do,” he said. Reporting by Jeff Mason, Steve Holland, Roberta Rampton, Ayesha Rascoe and James Oliphant; Editing by Alistair Bell", "external_links": [], "published": "2018-01-17T22:32:00.000+02:00", "crawled": "2018-01-17T23:13:03.027+02:00", "highlightTitle": ""}