{"organizations": [], "uuid": "177b37a61e9a581b9ba6e664a9c16a3e21f16ee1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 26, "shares": 26, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219037128&w=1200&r=LYNXMPEE020LI", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-environment-norway-autos/more-than-half-of-new-norway-car-sales-now-electric-or-hybrid-idUSKBN1ES0WC", "country": "US", "domain_rank": 408, "title": "More than half of new Norway car sales now electric or hybrid", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T14:12:00.000+02:00", "replies_count": 0, "uuid": "177b37a61e9a581b9ba6e664a9c16a3e21f16ee1"}, "author": "", "url": "https://www.reuters.com/article/us-environment-norway-autos/more-than-half-of-new-norway-car-sales-now-electric-or-hybrid-idUSKBN1ES0WC", "ord_in_thread": 0, "title": "More than half of new Norway car sales now electric or hybrid", "locations": [], "entities": {"persons": [{"name": "oeyvind solberg thorsen", "sentiment": "none"}, {"name": "alister doyle", "sentiment": "none"}, {"name": "camilla knudsen", "sentiment": "none"}], "locations": [{"name": "norway", "sentiment": "none"}], "organizations": [{"name": "min read  oslo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "road federation", "sentiment": "none"}, {"name": "ofv", "sentiment": "none"}, {"name": "international energy agenc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 12:12 PM / Updated 5 hours ago Norway powers ahead (electrically): over half new car sales now electric or hybrid Camilla Knudsen , Alister Doyle 5 Min Read \nOSLO (Reuters) - Sales of electric and hybrid cars rose above half of new registrations in Norway in 2017, a record aided by generous subsidies that extended the country’s lead in shifting from fossil-fuel engines, data showed on Wednesday. \nPure electric cars and hybrids, which have both battery power and a diesel or petrol motor, accounted for 52 percent of all new car sales last year in Norway against 40 percent in 2016, the independent Norwegian Road Federation (OFV) said. \n“No one else is close” in terms of a national share of electric cars, OFV chief Oeyvind Solberg Thorsen said. “For the first time we have a fossil-fuel market share below 50 percent.” \nNorway exempts new electric cars from almost all taxes and grants perks that can be worth thousands of dollars a year in terms of free or subsidized parking, re-charging and use of toll roads, ferries and tunnels. \nIt also generates almost all its electricity from hydropower, so the shift helps to reduce air pollution and climate change. \nLast year, the International Energy Agency (IEA) said Norway was far ahead of other nations such as the Netherlands, Sweden, China, France and Britain in electric car sales. \nBy the IEA yardstick, which excludes hybrid cars with only a small electric motor that cannot be plugged in, electric car sales in Norway rose to 39 percent in 2017 from 29 in 2016, when the Netherlands was in second on 6.4 percent. \nNorwegian car sales in 2017 were topped by the Volkswagen Golf ( VOWG_p.DE ), BMWi3 ( BMWG.DE ), Toyota Rav4 ( 7203.T ) and Tesla Model X ( TSLA.O ). The Tesla is pure electric and others have electric or hybrid versions. \nIn many countries, high prices of battery-driven cars, limited ranges between recharging and long charging times discourage buyers. Car makers say the disadvantages are dwindling over time with new models. \n“We view Norway as a role model for how electric mobility can be promoted through smart incentives,” a spokesman at BMW’s Munich HQ said. “The situation would probably be different if these incentives were dropped.” \nOther “good examples” of policies to spur electric-car demand include Britain, California and the Netherlands, he said. ZERO GOAL \nLast year, Norway’s parliament set a non-binding goal that by 2025 all cars sold should be zero emissions. Among other nations, France and Britain plan to ban sales of petrol and diesel cars by 2040. \nChristina Bu, head of the Norwegian Electric Vehicle Association which represents owners, said the 2025 goal meant that Norway should stick with its incentives for electric cars. \n“It’s an ambitious goal only seven years away,” she told Reuters. Overall, sales of zero emissions cars in Norway rose in 2017 to 21 percent from 16 in 2016. \nElectric cars have widespread support among Norway’s 5.3 million people. A plan last year by the right-wing government to trim electric car incentives, dubbed a “Tesla Tax”, was dropped in negotiations on the 2018 budget. \nSales of diesel cars fell most in 2017, to 23 percent from 31 in 2016. Some regions in Norway have started to charge higher road tolls for diesel cars than for petrol-driven vehicles. \nNorway’s electric car policies are hard to imitate. Norway can be generous because high revenues from oil and gas production have helped it amass the world’s biggest sovereign wealth fund, worth $1 trillion. \nIllustrating the supportive benefits, a Volkswagen e-Golf electric car sells for 262,000 crowns ($32,300) in Norway, just fractionally above the import price of 260,000, according to the Norwegian Electric Vehicle Association. \nBut a comparable gasoline-powered Golf, which costs just 180,000 crowns to import, ends up selling for 298,000 crowns after charges including value added tax, carbon tax, and another tax based on the weight of the vehicle. \nEven in Norway, the benefits strain finances. Norway’s 1.3 trillion Norwegian crown budget projects a loss of tax revenues of 3 billion crowns a year because of electric cars. \n($1 = 8.1026 Norwegian crowns) Reporting By Alister Doyle and Camilla Knudsen in Oslo, Andreas Cremer in Berlin, Editing by Jeremy Gaunt", "external_links": [], "published": "2018-01-03T14:12:00.000+02:00", "crawled": "2018-01-03T14:26:04.010+02:00", "highlightTitle": ""}