{"organizations": [], "uuid": "95eb57a69a112b6fef13a897997878cb063d28f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-intervale-capital-acquires-a-majority-stake-in-pdc-logic.html", "country": "US", "domain_rank": 767, "title": "Intervale Capital Acquires a Majority Stake in PDC Logic", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:00:00.000+02:00", "replies_count": 0, "uuid": "95eb57a69a112b6fef13a897997878cb063d28f4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-intervale-capital-acquires-a-majority-stake-in-pdc-logic.html", "ord_in_thread": 0, "title": "Intervale Capital Acquires a Majority Stake in PDC Logic", "locations": [], "entities": {"persons": [{"name": "ronnie thompson", "sentiment": "none"}, {"name": "tom waitman", "sentiment": "none"}, {"name": "thompson", "sentiment": "none"}], "locations": [{"name": "pdc logic houston", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "permian basin", "sentiment": "none"}], "organizations": [{"name": "intervale capital acquires", "sentiment": "negative"}, {"name": "intervale capital", "sentiment": "negative"}, {"name": "eagle ford", "sentiment": "none"}, {"name": "intervale", "sentiment": "none"}, {"name": "pdc logic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 16, 2018 /PRNewswire/ -- Intervale Capital (\"Intervale\"), an energy-focused private equity firm, announced today that it has acquired a majority stake in PDC Logic (the \"Company\"), a manufacturer of highly engineered drilling and completion bits with U.S. service locations in the Permian Basin, Mid-Continent, Eagle Ford and DJ Basin.\nTom Waitman, Founder of PDC Logic, commented, \"Given Intervale's deep experience investing in the space, they are uniquely positioned to drive rapid growth of the business as we look to enter additional territories and commercialize new bit products. We are thrilled to embark on this next chapter of strategic expansion with Intervale as our growth capital partner.\"\nRonnie Thompson, the Company's President since 2016, has more than 10 years of oilfield service experience managing manufactured products and services businesses. Mr. Thompson commented, \"We believe there is great opportunity to quickly grow PDC Logic into a leading independent drilling and completions bit company servicing operators in every North American basin. We are committed to providing our customers rapid turnaround of the highest performing application-specific bits utilizing the latest cutter technologies.\"\nTuan Tran, Partner at Intervale, added, \"We are proud to partner with the Waitmans, Ronnie Thompson, and the Company's excellent management team. Given Intervale's history in the drill bit market and management's experience building PDC Logic, we are poised for a successful partnership. The Company benefits from several secular growth trends, including increasing drilling intensity, longer laterals, completion intensity, and higher stage counts. We see attractive opportunities to expand PDC Logic's addressable market by introducing new bit designs and entering new markets.\"\nTransaction terms were not disclosed. Wheeler, Morgan & Brown, PLLC provided legal counsel to PDC Logic. Baker Botts LLP provided legal counsel to Intervale. PNC Business Credit provided a working capital line and term loan to support the Company's expansion plans.\nAbout Intervale Capital:\nFounded in 2006, Intervale Capital is a specialized energy-focused investment firm. Intervale invests primarily in middle-market energy services and manufacturing companies. The firm has raised $1.3 billion of committed capital since its inception, and is currently investing from its third fund.\nAbout PDC Logic:\nHeadquartered in Norman, Oklahoma, the Company designs, manufactures, rents, and sells matrix Poly Diamond Crystalline (PDC) bits and Roller-cone bits, used in drilling and completion operations. The Company was founded in 2007 by the Waitmans and has operations in the Permian, Mid-Continent, Eagle Ford and DJ Basins.\nContacts:\nFor PDC Logic:\nRonnie Thompson\nPresident\n(405) 321-8850\nrthompson@pdclogic.com\nwww.pdclogic.com\nFor Intervale Capital:\nJason Arnoldy\nVice President\n(281) 605-3905\njarnoldy@intervalecapital.com\nSource: Intervale Capital http://www.intervalecapital.com\nView original content: http://www.prnewswire.com/news-releases/intervale-capital-acquires-a-majority-stake-in-pdc-logic-300582527.html\nSOURCE Intervale Capital", "external_links": ["http://www.prnewswire.com/news-releases/intervale-capital-acquires-a-majority-stake-in-pdc-logic-300582527.html", "http://www.intervalecapital.com/", "http://www.pdclogic.com/"], "published": "2018-01-16T14:00:00.000+02:00", "crawled": "2018-01-16T16:40:41.016+02:00", "highlightTitle": ""}