{"organizations": [], "uuid": "0ea124827f4a63e97e810d44b37b04e6cd30ffa5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/25/104794792-GettyImages-823198710.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/09/the-burning-questions-that-investors-need-to-answer-for-2018.html", "country": "US", "domain_rank": 767, "title": "The burning questions that investors need to answer for 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T08:47:00.000+02:00", "replies_count": 0, "uuid": "0ea124827f4a63e97e810d44b37b04e6cd30ffa5"}, "author": "Joumanna Bercetche", "url": "https://www.cnbc.com/2018/01/09/the-burning-questions-that-investors-need-to-answer-for-2018.html", "ord_in_thread": 0, "title": "The burning questions that investors need to answer for 2018", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The past year has proved to be an ideal environment for U.S. stock markets and for global growth. But what are going to be the drivers of investment decisions in 2018? Here I lay out just a couple of the questions that might shape some of the discussions for the coming year:\n1. Can the US dollar stage a turnaround? 2017 proved to be a poor year for the greenback , with the currency staging its weakest performance since 2003. This with a backdrop of three interest rate hikes, a tax reform bill that encourages repatriation of U.S. dollars held overseas, a strengthening U.S. economy and a soaring stock market. The justification has been that while the Federal Reserve may have been in tightening mode, they were no longer the only players in the room. 2017 also saw the first hike in a decade out of the Bank of England and even the ever-accommodative European Central Bank starting to scale back its stimulus. However, according to the latest CFTC Commitment of Traders Report, dollar positioning is starting the year quite short particularly against the euro (+$19.3 billion overall) which is the longest it has been since 2007. Furthermore, the bond market is still only pricing in around two further rate hikes from the Fed this year, even though Fed projections suggest three. Not to forget the changing composition of the Fed members and the slight hawkish tilt to minutes suggesting an upside to growth.\n2. With various volatility measures at multi-year lows, when do politics and geopolitics start impacting risk aversion? 2018 is certainly shaping up to be a tense year politically: Germany does not yet have a government, all polls for Italian elections are pointing to a hung parliament. And Brexit negotiations are now in phase two with still very little clarity from the government on what the shape of the final trading arrangement might look like. This uncertainty clouds investment decisions and is one of the reasons the Bank of England and the U.K. statistics office have revised down growth projections. Meanwhile in the U.S., while President Donald Trump can tick off passing tax reform from his list of first year achievements, the discourse has now shifted on to the state of his mental health as well as the mid-term elections with a possible comeback by the Democrats. Finally, the threat of the \"bigger nuclear button\" is still very much in the background.\nSpencer Platt | Getty Images News | Getty Images Other questions for 2018: Can FAANGs ( Facebook , Apple , Amazon , Netflix , and Alphabet 's Google) repeat their 50 percent-plus performance of last year? Have we witnessed the full extent of \"Amazonfication\" yet (answer is probably not)? What valuation will the Saudi Aramco IPO (initial public offering) secure when/if it comes to the market? And lastly, what cryptocurrency will prove to be the \"fairest of them all\"? Let's wait and see.\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-09T08:47:00.000+02:00", "crawled": "2018-01-09T09:47:03.337+02:00", "highlightTitle": ""}