{"organizations": [], "uuid": "9f37879069312b79295581253eb39857040ed08e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 26, "shares": 26, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225132947&w=1200&r=LYNXMPEE0O0V8", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-economy-performance/leader-to-laggard-uk-economy-loses-ground-after-brexit-vote-idUKKBN1FE1LD", "country": "US", "domain_rank": 408, "title": "Leader to laggard - UK economy loses ground after Brexit vote", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:15:00.000+02:00", "replies_count": 0, "uuid": "9f37879069312b79295581253eb39857040ed08e"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-economy-performance/leader-to-laggard-uk-economy-loses-ground-after-brexit-vote-idUKKBN1FE1LD", "ord_in_thread": 0, "title": "Leader to laggard - UK economy loses ground after Brexit vote", "locations": [], "entities": {"persons": [{"name": "andy bruce", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "organisation for economic cooperation and development", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}, {"name": "group of seven nations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 12:16 PM / Updated 3 hours ago Leader to laggard - UK economy loses ground after Brexit vote Andy Bruce 5 Min Read \nLONDON (Reuters) - Britain’s economy has fared better than the gloomy expectations made at the time of the 2016 Brexit vote, but it has been helped mainly by a strong pick-up in global growth and many of its peers are growing more quickly. \nBritain is at risk, along with Japan and Italy, of being the slowest growing economy among the Group of Seven nations in 2018, Reuters polls of economists showed last week. \nFollowing is a summary of how Britain’s economic performance compares with that of other rich nations. GROWTH \nBritain grew more slowly than every other G7 country over the first three quarters of 2017. It looks likely to lag behind both France and Germany in the next few years, according to Reuters polls, the International Monetary Fund and the Organisation for Economic Cooperation and Development. \nThat would represent a reversal of Britain’s outperformance of its peers since the early 1990s, barring a couple of years after the global financial crisis. \nOfficial figures due on Friday are likely to show Britain’s economy grew by a quarterly 0.4 percent in the last three months of 2017, repeating the July-September performance, according to a Reuters poll. \nThat would probably leave average annual growth for 2017 as a whole at around 1.6 percent -- much better than the 1.2 percent Reuters poll forecast from this time last year, but compared with around 2.5 percent for Germany, 2.3 percent for the United States, and 1.8 percent for France. \nThe Reuters poll pegs growth for this year at around 1.4 percent ahead of Brexit in March 2019, compared with 2.6 percent for the United States, 2.4 percent for Germany, 2.0 percent for France and 1.3 percent for Japan. \nFor a graphic on G7 economic growth over first three quarters of 2017, click reut.rs/2E4cqR2 EXPORTS \nExport volumes from Britain have jumped over the last 18 months but much of the increase is probably linked to the recovery in the global economy, rather than any increase in British competitiveness. \nBritain’s recent export performance is average compared with other European countries, offering no clear sign of any edge gained from the weak pound. \nFor a graphic on European exports, click reut.rs/2E3S3mX CONSUMER CONFIDENCE \nWhile consumer morale in the euro zone has hit a 17-1/2-year high, the British public is more sombre, particularly about the economic outlook. \nHigher inflation has hurt the spending power of consumers, especially since wages have failed to keep pace with prices. \nConsumer confidence in Britain was weaker in December than in all other large European economies, according to European Commission data. \nThe Thomson Reuters/Ipsos consumer sentiment survey shows Britain was the only G7 country where confidence fell over 2017. \nFor a graphic on European consumer confidence compared, click reut.rs/2E4dTXy \nFor a graphic on UK and euro zone consumer confidence compared, click reut.rs/2DxfJz2 INFLATION \nBritish inflation hit its highest level in nearly six years in November at 3.1 percent, topping rates of consumer price growth in each of the other G7 countries for an eighth month. It edged down to 3.0 percent in December. \nThe BoE and many economists think inflation has peaked. But surveys of businesses by the Confederation of British Industry and British Chambers of Commerce have suggested inflation pressures could persist. \nFor a graphic on G7 inflation rates, click reut.rs/2E5re21 INVESTMENT \nBusiness investment did not contract as the BoE forecast after the Brexit vote and has grown since mid-2016, albeit at around half its average pace since the financial crisis. \nBusiness surveys suggest Brexit uncertainty has had a tangible impact on companies’ investment plans. \nLast year JPMorgan said business investment ought to be rising at an annual pace of around 7 percent, given the global growth backdrop, instead of the rates of around 1.5 to 2.5 percent seen during the first three quarters of 2017. \nBritain underperformed its peers for investment in the first three quarters of 2017, according to an internationally-comparable measure of gross fixed capital formation (GFCF) that includes spending in businesses, government and dwellings. \nGFCF in Britain grew at a slower rate during the first three quarters of 2017 than all of its G7 peers. \nHowever, Martin Beck, economist at Oxford Economics, notes that Britain’s business investment performance looks similar to other countries when excluding the oil and gas sector, which in Britain has struggled of late. \nFor a graphic on Investment in G7 economies, click reut.rs/2E6dMed Graphics by Andy Bruce; Editing by Catherine Evans", "external_links": [], "published": "2018-01-25T14:15:00.000+02:00", "crawled": "2018-01-25T14:45:42.010+02:00", "highlightTitle": ""}