{"organizations": [], "uuid": "b7f036c3982bfacc8b07341183034ba8bf190a55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WZ172_WORKFA_SOC_20180112120819.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7201.xml", "section_title": "WSJ.com: Lifestyle", "url": "https://www.wsj.com/articles/is-your-child-social-media-savvy-1516111365", "country": "US", "domain_rank": 387, "title": "How Tech Experts Monitor Their Teens on Social Media", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T18:03:00.000+02:00", "replies_count": 0, "uuid": "b7f036c3982bfacc8b07341183034ba8bf190a55"}, "author": "Sue Shellenbarger", "url": "https://www.wsj.com/articles/is-your-child-social-media-savvy-1516111365", "ord_in_thread": 0, "title": "How Tech Experts Monitor Their Teens on Social Media", "locations": [], "entities": {"persons": [{"name": "robert neubecker", "sentiment": "negative"}, {"name": "aldrich", "sentiment": "none"}, {"name": "steven aldrich", "sentiment": "none"}, {"name": "jackson", "sentiment": "none"}], "locations": [{"name": "ariz.", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "scottsdale", "sentiment": "none"}], "organizations": [{"name": "social media", "sentiment": "negative"}, {"name": "godaddy inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "3 COMMENTS Illustration: Robert Neubecker While investor protests about smartphones’ harmful social effects began making headlines only recently, Silicon Valley parents have struggled with the issue for a long time.\nTech executives with children share many of the same concerns other parents have about tweens’ and teens’ social-media use —that it will disrupt sleep, homework or face-to-face socializing, or expose their children to bullies or predators.\n\n\nThose who are experts on the internet and information security also wonder: What hidden security threats lurk in the latest social-media app? Which of many possible paths might hackers take to invade their children’s privacy?\nThe routes tech-savvy executives choose to protect their tweens and teens online vary, from close monitoring to guiding them in managing the hazards themselves.\nTeaching Decision-Making Steven Aldrich foresees his 16-year-old son Jackson constantly surrounded by apps and devices designed to grab his attention.\nMr. Aldrich, chief product officer at GoDaddy Inc., a Scottsdale, Ariz., provider of ​internet domains and websites to businesses, and his wife, Allison, shun the parental-control apps and filters with which some parents control their children’s internet and social-media use. “No amount of monitoring is going to teach responsibility or judgment,” Mr. Aldrich says. “The kids have to learn to live in a world where that’s the reality.” Instead, he and his wife “focus on, how do we create an environment where Jackson has the chance to learn judgment, by participating in setting limits and creating boundaries for himself?”\nSteven Aldrich, GoDaddy's chief product officer, says ‘No amount of monitoring is going to teach responsibility or judgment.’ Photo: GoDaddy They started early, letting Jackson decide as a child, with parental coaching, how much candy to eat from the pantry. This has evolved to teaching him to finish a homework assignment before checking social media. Mrs. Aldrich sometimes asks Jackson to let her know when he takes breaks from homework, Jackson says, making him aware of whether he’s diverting his attention too often.​\nThey’re helping him learn time management, such as scheduling homework, sports practice, dinner and sleep in advance so that social media doesn’t crowd them out. “We’ve seen it start to pay off in how he prepares for tests or projects,” Mr. Aldrich says.\nHe and his wife also encourage Jackson to think about everything he posts as part of his permanent personal brand, Mr. Aldrich says, asking him: “Think about what you might have chosen if you’d gotten a tattoo when you were 3? What if you got a Barney tattoo, and now you’re in middle school? Would you want to be walking around with a Barney tattoo?’”\nThey’ve used examples from Snapchat of mistakes other teens made in oversharing, and asked Jackson to imagine how the sender felt afterward.\nJackson, who uses Snapchat and Instagram and also has a YouTube channel of his own ​about​ videogames and soccer, says he has learned to ask himself before posting anything to consider how it might affect his image. “Would I want the principal, a future employer, my teachers to see this?” he says. “Once you post something, it will be out there forever.” \nQuiz: Are You a Media-Savvy Parent? Robert Neubecker Keeping a Watchful Eye The powerful allure social media holds for teens has led Michelle Dennedy to take a hands-on approach to monitoring its use by her two daughters, 11 and 16. “Once you hand that phone to your child, that is the beginning of a million micro-decisions for you as a parent, and for the child,” says Ms. Dennedy, chief privacy officer at Cisco Systems Inc., the San Jose, Calif., networking company.\n\nJoin Us Can families learn to live in harmony with technology? Join our new Facebook group: Parenting in the Age of Tech .\n\nShe checks privacy settings every six months on all the apps she and her daughters use on their smartphones. If social media distracts them from homework, “the Wi-Fi goes off and the books come out,” Ms. Dennedy says.\nShe teaches them how marketers use free apps to get personal information. “Do you know the difference between free and paid music?” she recently asked her younger daughter. “What do you think an advertiser would want to know about 11-year-old kids?”\nShe refrains from making judgments about teens’ social-media habits. “Apparently if you don’t respond with a selfie fast enough, people get upset. I respect their culture. I can’t just say, ‘That’s dumb, these people are ridiculous,’ and walk away,” Ms. Dennedy says. Instead, she asks, “What is this doing to your self-esteem?’ And I have to be quiet and listen. It’s an ongoing struggle.”\nShe also requires her daughters to get permission before downloading apps. “Sometimes they’ll send me an app that is just ridiculous. My older daughter asked for a celebrity app, with a lot of pictures of body parts,” Ms. Dennedy says. “ I asked her, ‘Write me a memo about what this will do to improve your life, and then we’ll have a conversation.’ She wrote the memo, tongue-in-cheek, with a lot of eye-rolling, saying, ‘I like the Kardashians because they annoy my mom.’ She still didn’t get the app.”\nMichelle Dennedy, chief privacy officer at Cisco Systems, checks privacy settings every six months on the apps she and her daughters use on their smartphones. Photo: Cisco She steps in when social media ignites too much teen drama. “One problem for my older daughter a couple of years ago was when friends were using FaceTime while doing homework,” she says. “Walking into her room, I’d see another student talking about how stressed out she was, how hopeless it was, how awful parents were to force them to get good grades.\n“I had a long conversation with my daughter later: I know you want to help your friends, but some of these students may need professional help. And I ask her, is this helping you get the grades you could get and want to get?”\nShe encouraged her daughter to talk with her friend and tell her: “I’m worried that this conversation isn’t productive. What can we do about this?” Or, “My weirdo mother is going to call your weirdo mother. Maybe we should stop.” Ms. Dennedy does sometimes call other parents in such situations. “That can be an awkward conversation, but it’s one you have to try to have.”\nMonitoring Closely Eight-year-old Jack Arkin’s online activity so far is limited to watching children’s videos on YouTube and sending email. But his father, Brad, who is chief security officer for Adobe, the San Jose, Calif., cloud-software company, has already begun shaping his attitude toward social media.\nAdobe’s chief security officer Brad Arkin says, ‘I try to teach my kids to understand the tech concepts behind what they’re doing.’ Photo: Adobe Mr. Arkin and his wife, Carolyn, closely monitor everything Jack does online. They restrict screen time for Jack to 30 to 60 minutes on most days. They read Jack’s emails over his shoulder and stream his children’s videos on the family TV, setting YouTube on restricted mode and keeping an eye on content. “He gets zero privacy and zero expectations of privacy,” Mr. A", "external_links": [], "published": "2018-01-16T18:03:00.000+02:00", "crawled": "2018-01-16T20:34:57.002+02:00", "highlightTitle": ""}