{"organizations": [], "uuid": "a9145fce0388fbe92ec96489037324a9d24eccb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://www.reuters.com/investigates/special-report/assets/usa-bodies-funeral/mastheads/share-hess2.jpg?v=451215110118", "site_section": "http://whatreallyhappened.com/rss.xml", "section_title": "WHAT REALLY HAPPENED", "url": "http://www.reuters.com/investigates/special-report/usa-bodies-funeral/", "country": "US", "domain_rank": 408, "title": "FBI scrutinizes funeral home running a side business: selling human body parts", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T17:19:00.000+02:00", "replies_count": 0, "uuid": "a9145fce0388fbe92ec96489037324a9d24eccb0"}, "author": "Mike Rivero", "url": "http://www.reuters.com/investigates/special-report/usa-bodies-funeral/", "ord_in_thread": 0, "title": "FBI scrutinizes funeral home running a side business: selling human body parts", "locations": [], "entities": {"persons": [{"name": "alan koch", "sentiment": "none"}, {"name": "megan hess", "sentiment": "none"}, {"name": "shirley koch", "sentiment": "none"}, {"name": "brian", "sentiment": "none"}], "locations": [{"name": "montrose", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}], "organizations": [{"name": "fbi", "sentiment": "negative"}, {"name": "federal bureau of investigation", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A REUTERS SERIES FBI scrutinizes funeral home running a side business: selling human body parts Part 8: Former workers describe troubling practices at this mortuary-body broker, including allegations of deceptive marketing and an account of how gold dental work was removed from corpses and sold. Authorities are now investigating. By BRIAN GROW Filed Jan. 11, 2018, 3 p.m. GMT FAMILY BUSINESS: Megan Hess has described Donor Services as a small, family business. In 2016, she said she and her mother, Shirley Koch, handled about 10 cadavers a month in the back room. Her father, Alan Koch, ran the crematory, she said. REUTERS/Mike Wood MONTROSE, Colorado – The Federal Bureau of Investigation is interviewing former employees of a funeral home whose owner runs a side business on the same premises selling human body parts. An agent with the FBI has interviewed at least four former employees who worked for funeral director and body broker Megan Hess, seeking information about how she operates her businesses, the former workers told Reuters. The federal inquiry began several months ago, shortly after Reuters interviewed a half-dozen workers who formerly worked for Hess. One ex-employee, Kari Escher, said she was especially troubled by the practices of Hess’s mother, Shirley Koch, who works at the facility. Escher said Koch, who embalmed and dismembered bodies, pulled teeth from some of the corpses to extract the gold in crowns or fillings. Related content \nDonating bodies, selling the parts: Frequently asked questions “She showed me her collection of gold teeth one day,” said Escher, who helped manage a former cremation-marketing business owned by Hess. Koch said “she had sold a different batch a year prior, and they took the whole family to Disneyland in California on the gold that they cashed in,” Escher said. Reached by phone at Sunset Mesa, Koch said she did not wish to talk with a Reuters reporter. “I’m not interested. Thank you,” she said before ending the call. The news agency had also sent written questions to Hess and her attorney about Koch’s alleged handling of gold teeth. Neither addressed the issue about the teeth. No federal law prohibits the buying and selling of human body parts to be used in research and education. In Colorado and most other states, it also is legal for funeral homes to sell items recovered from dead bodies, such as gold dental work. And it is not against the law to operate a so-called body broker firm from the same facility that houses a funeral home and crematory. But the business arrangement is highly unusual. Reuters could find no other operation active in the United States that houses a funeral home, crematory and body broker in the same facility and under the same ownership. Such multipurpose operations raise ethical concerns, several funeral industry veterans said. A funeral director who also works as a body broker could have a financial incentive to sell a body for its valuable parts rather than provide an inexpensive burial, for instance. “The conflict of interest of having a side business in body parts just leads to problems,” said Steve Palmer, a funeral director in Cottonwood, Arizona, and former member of the policy board at the National Funeral Directors Association. “There are no ethics there when you do that. You are not looking at the full disposition (of a body). You are looking at how to make money.” GOLD TEETH: Former employee Kari Escher said she was especially troubled by the practices of Megan Hess’s mother, Shirley Koch, who Escher said pulled teeth from some of the corpses so she could sell the gold in crowns or fillings. REUTERS/Rick Wilking Hess runs Sunset Mesa, a funeral home, and Donor Services, a body broker operation from the same building in Montrose. Some former staff members of Sunset Mesa said they never heard Hess disclose to donors that the bodies would be sold for profit. “The fact that now the business is also making money from the sale of body parts – if that is not being told to the family, it is unethical and probably illegal, if only as deception,” said Robert Fells, general counsel of the International Cemetery, Cremation and Funeral Association, an industry trade group. Fells called running such a multifaceted operation “a new frontier.” Through the attorney, Hess declined to comment for this story and didn’t address questions about the FBI probe, her business practices, and the allegations by former employees. The attorney, Carol Viner, asked Reuters to “refrain from contacting” Hess employees “for any reason.” The focus and extent of the federal probe into the Hess operation is unclear, and the FBI also declined to comment. Separate from the FBI inquiry, Reuters has learned that Colorado state funeral regulators are investigating Hess’s funeral home, Sunset Mesa. The state’s Department of Regulatory Agencies said it has nine open complaints about Sunset Mesa – “higher than average” for funeral homes in the state, said spokesman Lee Rasizer. He would not discuss the nature of those complaints or any action it may be taking. Reuters began examining the Hess companies more than a year ago as part of the news agency’s exploration of the human body trade, a virtually unregulated industry that largely operates in the shadows. “ADD TO CART” Before referring questions to a lawyer, Hess spoke extensively with Reuters about her body broker company. In an interview in 2016, she described Donor Services as a small, family business. She took orders for body parts via Hotmail, email records show. She said she and her mother, Koch, handled about 10 cadavers a month in the back room. Her father, Alan Koch, ran the crematory, Hess said. Hess made donating a body online easy. On her cremation marketing website, a donor could simply select from a drop-down menu, fill out a few forms, click “Add to Cart,” and enter a credit card number. Her funeral home site listed her credentials, including a PhD in mortuary science. After a reporter asked questions about the website and her background, Hess removed the “Add to Cart” donation pages from her cremation website and cut the mention of the mortuary science degree from her online biography. No such degree exists in the United States for morticians, veteran funeral directors say. Her revised online biography cited her high school degree and “a love of veterinary medicine.” MYSTERY DEGREE: The website for Megan Hess’s funeral home once listed her credentials as including a PhD in mortuary science. After a reporter asked about her background, Hess removed the mention of the mortuary science degree from her online biography. No such degree exists in the United States for morticians, veteran funeral directors say. REUTERS/Mike Wood When Reuters visited her facility in 2016, Hess said Donor Services represented just 15 percent or so of her total business. But it provided an important public service, she said. “It’s for the good of the world, and I like to help people,” Hess said. Body brokers like Donor Services are also known as non-transplant tissue banks. They are distinct from the organ and tissue transplant in", "external_links": [], "published": "2018-01-12T17:19:00.000+02:00", "crawled": "2018-01-12T19:42:31.050+02:00", "highlightTitle": ""}