{"organizations": [], "uuid": "dd1bd2571dedc9c199e8338e96a04b8314ca4cd7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-australia-environment-reef/starfish-eating-australias-great-barrier-reef-alarm-scientists-idUSKBN1ET2K4", "country": "US", "domain_rank": 408, "title": "Starfish eating Australia's Great Barrier Reef alarm scientists", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T01:35:00.000+02:00", "replies_count": 0, "uuid": "dd1bd2571dedc9c199e8338e96a04b8314ca4cd7"}, "author": "", "url": "https://www.reuters.com/article/us-australia-environment-reef/starfish-eating-australias-great-barrier-reef-alarm-scientists-idUSKBN1ET2K4", "ord_in_thread": 0, "title": "Starfish eating Australia's Great Barrier Reef alarm scientists", "locations": [], "entities": {"persons": [{"name": "hugh sweatman", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "abc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "australian institute of marine science", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "australian broadcasting corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SYDNEY (Reuters) - A major outbreak of coral-eating crown of thorns starfish has been found munching Australia’s world heritage-listed Great Barrier Reef, scientists said on Friday, prompting the government to begin culling the spiky marine animals.\nThe predator starfish feeds on corals by spreading its stomach over them and using digestive enzymes to liquefy tissue, and the outbreak hits as the reef is still reeling from two consecutive years of major coral bleaching.\n“Each starfish eats about its body diameter a night, and so over time that mounts up very significantly,” Hugh Sweatman, a senior research scientist at the Australian Institute of Marine Science told Australian Broadcasting Corporation (ABC) radio.\n“A lot of coral will be lost,” he said.\nThat would mean a blow for both the ecosystem and the lucrative tourism industry which it supports.\nThe crown of thorns were found in plague proportions last month in the Swains Reefs, at the southern edge of the Great Barrier Reef, by researchers from the reef’s Marine Park Authority, a spokeswoman for the authority told Reuters by phone.\nCoral-eating crown of thorns starfish are seen on Swain Reef, part of the Great Barrier Reef, in this undated handout photo released January 5, 2018. Joint Field Management Program/Great Barrier Reef Marine Park Authority/Handout via REUTERS The remote reefs, about 200km (120 miles) offshore from Yeppoon, a holiday and fishing town some 500km north of Queensland state capital, Brisbane, are well south of the most-visited sections of the Great Barrier Reef, where most culling efforts are focused.\nBut the government’s Great Barrier Reef Marine Park Authority already killed some starfish at Swains Reefs in December and will mount another mission this month, a director at the authority, Fred Nucifora, told the ABC.\n“The complexity with the Swains Reef location is ... they are logistically difficult to access and it is actually quite a hostile environment to work in,” Nucifora said.\nThere have been four major crown of thorns outbreaks since the 1960s in the Great Barrier Reef but it recovered each time because there were always healthy populations of herbivorous fish. The outbreaks are usually triggered by extra nutrients in the water but the reason for the current outbreak was unclear, Sweatman said.\nThe reef is still recovering from damage wrought by the worst-ever coral bleaching on record, which in 2016 killed two-thirds of a 700km stretch of reef.\nOn Friday a report published in the journal Science found that high ocean temperatures are harming tropical corals much more often than a generation ago, putting reefs under pressure.\nThe Great Barrier Reef, covering 348,000 square kilometers, was world heritage listed in 1981 as the most extensive and spectacular coral reef ecosystem on the planet, according to the UNESCO website.\nReporting by Tom Westbrook, Editing by Rosalba O'Brien\n ", "external_links": [], "published": "2018-01-05T01:35:00.000+02:00", "crawled": "2018-01-05T01:49:08.003+02:00", "highlightTitle": ""}