{"organizations": [], "uuid": "7e91cfb8f79ba14018a2ecead54b2b6165272af6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/12/104581849-RTX3B56S-christopher-wray.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/trump-news-fbi-director-christopher-wray-threatened-to-resign.html", "country": "US", "domain_rank": 767, "title": "Trump news: FBI Director Christopher Wray threatened to resign", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-23T05:32:00.000+02:00", "replies_count": 0, "uuid": "7e91cfb8f79ba14018a2ecead54b2b6165272af6"}, "author": "Mike Calia", "url": "https://www.cnbc.com/2018/01/22/trump-news-fbi-director-christopher-wray-threatened-to-resign.html", "ord_in_thread": 0, "title": "Trump news: FBI Director Christopher Wray threatened to resign", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "wray", "sentiment": "negative"}, {"name": "direc", "sentiment": "negative"}, {"name": "christopher wray", "sentiment": "negative"}, {"name": "jeff sessions", "sentiment": "none"}, {"name": "don mcgahn", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "andrew mccabe", "sentiment": "none"}, {"name": "mccabe", "sentiment": "none"}, {"name": "carlos barria", "sentiment": "none"}, {"name": "mcgahn", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "fbi", "sentiment": "negative"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "mccabe fbi", "sentiment": "none"}, {"name": "senate judiciary committee", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FBI Director Christopher Wray, who took over the job just under six months ago , threatened to resign if deputy FBI director Andrew McCabe – a frequent target of President Donald Trump 's – were forced out, Axios reported late Monday, citing sources .\nThe outlet said that Attorney General Jeff Sessions had been pressuring Wray to fire McCabe. The attorney general then told White House counsel Don McGahn that Wray was upset over the pressure to fire McCabe, and, in turn, McGahn told Sessions that it wasn't worth risking Wray's resignation over the issue, Axios reported, citing a source.\nWhite House spokesman Raj Shah issued a statement late Monday:\nAs we've said, the president has enormous respect for the thousands of rank and file FBI agents who make up the world's most professional and talented law enforcement agency. He believes politically-motivated senior leaders including former Director Comey and others he empowered have tainted the agency's reputation for unbiased pursuit of justice. The president appointed Chris Wray because he is a man of true character and integrity and the right choice to clean up the misconduct at the highest levels of the FBI and give the rank and file confidence in their leadership.\nAxios' latest story comes on the heels of its Sunday report saying that Sessions had \"adamantly\" urged Wray to start anew with senior FBI leadership , including the removal of McCabe.\nMcCabe served as the bureau's acting director before Wray took the reins in August. Trump appointed Wray to the role after he fired James Comey from the position in May.\nTrump has repeatedly targeted McCabe on Twitter , suggesting partisan bias in favor of his Democratic rival in the 2016 election, Hillary Clinton. In July, Trump took to Twitter to question why Sessions hadn't replaced McCabe.\nTrump tweet\nMcCabe is reportedly expected to retire from the FBI early this year.\nWray, during his Senate confirmation proceedings, vowed that the FBI would strive for independence under his watch.\n\"If I am given the honor of leading this agency, I will never allow the FBI's work to be driven by anything other than the facts, the law and the impartial pursuit of justice. Period. Full stop,\" Wray said in July.\nAfter Trump fired him, Comey told lawmakers that he felt pressure from the president to drop his investigation of former national security advisor Michael Flynn .\nTrump's firing of Comey is widely considered to be one of the focal points of special counsel Robert Mueller's investigation into Russian election meddling, potential Trump ties to the Kremlin, and possible obstruction of justice. Flynn eventually pleaded guilty to lying to the FBI and agreed to cooperate with Mueller's investigation.\nA Justice Department spokesman declined to comment to CNBC, and an FBI representative wasn't immediately reachable.\nRead the full Axios report here.", "external_links": [], "published": "2018-01-23T05:32:00.000+02:00", "crawled": "2018-01-23T05:32:47.079+02:00", "highlightTitle": ""}