{"organizations": [], "uuid": "8a5e72eeab8544a75bbc4e8d28690d9d03c479e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/lifestyle\r", "section_title": "Reuters: Lifestyle", "url": "https://www.reuters.com/article/us-costarica-lgbt/costa-ricas-first-gay-marriage-suffers-bureaucratic-hitch-idUSKBN1F82O0", "country": "US", "domain_rank": 408, "title": "Costa Rica's first gay marriage suffers bureaucratic hitch", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T23:38:00.000+02:00", "replies_count": 0, "uuid": "8a5e72eeab8544a75bbc4e8d28690d9d03c479e3"}, "author": "", "url": "https://www.reuters.com/article/us-costarica-lgbt/costa-ricas-first-gay-marriage-suffers-bureaucratic-hitch-idUSKBN1F82O0", "ord_in_thread": 0, "title": "Costa Rica's first gay marriage suffers bureaucratic hitch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE (Reuters) - Costa Rica’s first same-sex wedding has been blocked by notaries who are refusing to recognize it until laws forbidding gay marriage are changed, setting them at odds with the president.\nThe marriage between two men was set for this Saturday after a top Latin American human rights court earlier this month ruled that countries in the region should legalize same-sex unions, pushing back against opposition from the Roman Catholic church.\nThe Inter-American Court, based in Costa Rica’s capital San Jose, recommended that those rights be upheld via temporary decrees while governments pursue permanent laws.\nCosta Rican President Luis Guillermo Solis then directed government agencies to apply the ruling until lawmakers or the constitutional court formally adopt new laws.\nHowever, the notary council of the Central American country said on Friday it would only authorize such unions if the local legislature or the court annul laws outlawing gay marriage.\n“The rules that regulate marriage in Costa Rica ... remain in force,” the council said, telling notaries to abide by them.\nRoberth Castillo (R) and Mario Arias speak next to their lawyer Marianella Mora before a news conference to announce the suspension of their wedding scheduled for this Saturday, after notaries refused to recognize same-sex marriage, at La Sabana park in San Jose, Costa Rica, January 19, 2018. REUTERS/Juan Carlos Ulate The court’s decision has triggered debate ahead of Costa Rica’s presidential election on Feb. 4, with some candidates vowing to fight it.\nSolis is barred by law from seeking a second consecutive term.\nSlideshow (5 Images) Several Latin American countries, including predominantly Roman Catholic Costa Rica, still do not allow same-sex marriage.\nHowever, that is changing, and in recent years same-sex couples have been allowed to marry in Argentina, Brazil, Colombia, Uruguay and some parts of Mexico.\n“There’s nothing stopping the road to equality, but the truth is we don’t know how long it will take to get there,” said Larissa Arroyo, an attorney representing the couple in Costa Rica who planned to marry on Saturday.\nThe country’s Justice Minister Marco Feoli said in a statement that the notary council’s stance went against both the executive branch and the Inter-American Court.\nWriting by Daina Beth Solomon; Editing by Dave Graham and Grant McCool\n ", "external_links": [], "published": "2018-01-19T23:38:00.000+02:00", "crawled": "2018-01-20T00:05:16.008+02:00", "highlightTitle": ""}