{"organizations": [], "uuid": "d439da11d4ab9ae472c5bced00e1ba07b9113df4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-shambaugh-son-project-for-dairy-farmers-of-america-named-2018-sustainable-plant-of-the-year.html", "country": "US", "domain_rank": 767, "title": "Shambaugh & Son Project for Dairy Farmers of America Named 2018 Sustainable Plant of the Year", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:30:00.000+02:00", "replies_count": 0, "uuid": "d439da11d4ab9ae472c5bced00e1ba07b9113df4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-shambaugh-son-project-for-dairy-farmers-of-america-named-2018-sustainable-plant-of-the-year.html", "ord_in_thread": 0, "title": "Shambaugh & Son Project for Dairy Farmers of America Named 2018 Sustainable Plant of the Year", "locations": [], "entities": {"persons": [{"name": "paul meyers", "sentiment": "none"}], "locations": [{"name": "north america", "sentiment": "none"}, {"name": "garden city", "sentiment": "none"}, {"name": "kansas", "sentiment": "none"}, {"name": "ind.", "sentiment": "none"}, {"name": "wayne", "sentiment": "none"}], "organizations": [{"name": "shambaugh & son project for dairy farmers of america", "sentiment": "negative"}, {"name": "emcor", "sentiment": "negative"}, {"name": "dairy farmers of america", "sentiment": "none"}, {"name": "food engineering", "sentiment": "none"}, {"name": "shambaugh & son, l.p", "sentiment": "none"}, {"name": "dairy farmers of america garden city", "sentiment": "none"}, {"name": "dfa", "sentiment": "none"}, {"name": "shambaugh & son", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EMCOR State-of-the-Art Project - Largest Single Milk Dryer in North America Receives Prestigious Industry Award for Vertically Integrated Project Delivery\nFORT WAYNE, Ind.--(BUSINESS WIRE)-- The Dairy Farmers of America (DFA) milk plant in Garden City, Kansas has recently been named “Sustainable Plant of the Year” by Food Engineering magazine for its new state-of-the-art, 267,000 square foot whole and skim milk powder drying facility, the largest single milk dryer in North America. The award recognizes the plant’s outstanding sustainable engineering features that go above and beyond industry standards, designed and built by Shambaugh & Son, L.P . utilizing the company’s vertically integrated project delivery model.\n\"We are delighted that the Dairy Farmers of America Garden City plant was selected as 2018 Sustainable Plant of the Year by Food Engineering magazine. It is a tremendous honor and a testament to the entire Shambaugh team’s ability to design and complete a highly complex and demanding project,” stated Paul Meyers, Jr., CEO, Shambaugh & Son.\nThe 156-acre greenfield site in Garden City, Kansas fulfills a key sustainable strategy by providing a local home for farmers’ milk in Southwest Kansas; many local farms were previously sending their milk to other areas of the country. From the moment a tanker truck enters the plant, it takes less than 68 minutes to off-load the milk, clean the truck, and test the milk (while in the past a tanker may be gone for days, now the same tanker returns to the dairy in the same day, thereby drastically reducing hauling and trucking costs, as well as conserving energy and resources).\nThe highly automated, energy- and water-efficient facility was designed to operate 24/7. Unique features include:\nAdvanced bio security, eliminating potential risks through implementation of varying hygiene zones, HEPA filters within the plant, and minimal manual contact with the product. Numerous environmental safeguards designed into the system, such as a diffusion tank which allows trace emissions from the relief valve to be captured to ensure no contaminants are released into the atmosphere. Onsite waste water treatment plant where water is treated and recycled for irrigation. Built-in redundancies that allow the plant to operate continuously.\nAbout EMCOR Group, Inc.\nA Fortune 500 company with estimated 2017 revenues of ~$7.6B, EMCOR Group, Inc. (NYSE: EME) is a leader in mechanical and electrical construction, industrial and energy infrastructure, and building services. A provider of critical infrastructure systems, EMCOR gives life to new structures and sustains life in existing ones by its planning, installing, operating, maintaining, and protecting the sophisticated and dynamic systems that create facility environments---such as electrical, mechanical, lighting, air conditioning, heating, security, fire protection, and power generation systems---in virtually every sector of the economy and for a diverse range of businesses, organizations and government entities. EMCOR represents a rare combination of broad reach with local execution, combining the strength of an industry leader with the knowledge and care of 170 locations. The 33,000+ skilled employees of EMCOR have made the Company, in the eyes of leading business publications, amongst the “World’s Most Admired” and “Best Managed”. EMCOR’s diversity---in terms of the services it provides, the industries it serves and the geography it spans---has enabled it to create a stable platform for sustained results. The Company’s strong financial position has enabled it to attract and retain among the best local and regional talent, to undertake and complete the most ambitious projects, and to redefine and shape the future of the construction and facilities services industry. Additional information on EMCOR can be found at www.EMCORGroup.com .\nThis release may contain certain forward-looking statements within the meaning of the Private Securities Reform Act of 1995. Any such comments are based upon information available to EMCOR management and its perception thereof, as of this date, and EMCOR assumes no obligation to update any such forward-looking growth, gross profit, backlog mix, projects with varying profit margins, and selling, general and administrative expenses. These forward-looking statements involve risks and uncertainties that could cause actual results to differ materially from the forward-looking statements. Accordingly these statements are no guarantee of future performance. Such risk and uncertainties include, but are not limited to, adverse effects of general economic conditions, changes in the political environment, changes in the specific markets for EMCOR’s services, adverse business conditions, availability of adequate levels of surety bonding, increased competition, unfavorable labor productivity and mix of business. Certain of the risk factors associated with EMCOR's business are also discussed in the Company's 2016 Form 10-K and in other reports filed from time to time with the Securities and Exchange Commission. All these risk factors should be taken into account in evaluating any forward-looking statements.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110005392/en/\nEMCOR Group, Inc.\nMava Heffler, 203-849-7814\nVice President, Marketing & Communications\nor\nLAK Public Relations, Inc., 212-899-4745\nMedia:\nDavid Simpson, 646-338-2436\ndsimpson@lakpr.com\nSource: EMCOR Group, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180110005392/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.shambaugh.com%2F&esheet=51740590&newsitemid=20180110005392&lan=en-US&anchor=Shambaugh+%26+Son%2C+L.P&index=1&md5=9658f2d224dbec2cfc68649fa47e47e5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.emcorgroup.com%2F&esheet=51740590&newsitemid=20180110005392&lan=en-US&anchor=www.EMCORGroup.com&index=2&md5=b599c4855237d6ae2c51fccd87da8fb6"], "published": "2018-01-10T15:30:00.000+02:00", "crawled": "2018-01-10T16:19:26.000+02:00", "highlightTitle": ""}