{"organizations": [], "uuid": "55428ea4b0a05e99e464ef20efb46241a807347d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-brinkas-to-acquire-cash-handling-operations-in-brazil.html", "country": "US", "domain_rank": 767, "title": "Brink’s to Acquire Cash Handling Operations in Brazil", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-11T00:10:00.000+02:00", "replies_count": 0, "uuid": "55428ea4b0a05e99e464ef20efb46241a807347d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-brinkas-to-acquire-cash-handling-operations-in-brazil.html", "ord_in_thread": 0, "title": "Brink’s to Acquire Cash Handling Operations in Brazil", "locations": [], "entities": {"persons": [{"name": "rodoban", "sentiment": "none"}, {"name": "doug pertz", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "brazil richmond", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "brink’s company", "sentiment": "neutral"}, {"name": "minas gerais", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RICHMOND, Va., Jan. 10, 2018 (GLOBE NEWSWIRE) -- The Brink’s Company (NYSE:BCO), the global leader in cash management, secure logistics and security solutions, today announced that it has agreed to purchase Brazil-based Rodoban for approximately $145 million in cash. The acquisition, which is subject to customary closing conditions including approval by the Brazilian antitrust authority, is expected to close in the second quarter of 2018.\nBased in the state of Minas Gerais, Rodoban provides cash-in-transit, money processing and ATM services primarily to customers in southeastern Brazil. The company generates annual revenue of approximately $80 million.\nDoug Pertz, Brink’s president and chief executive officer, said: “The Rodoban acquisition is another demonstration of our commitment to accelerating profitable growth by making acquisitions in core businesses in existing markets. Once completed, we expect this transaction to be accretive to net income within 12 months. We have a strong pipeline of additional targets, and plan to invest approximately $400 million per year to acquire similar businesses in 2018 and 2019.\n“The integration of Rodoban with our current operations will expand our service reach, improve route density and yield other significant cost synergies. We will move quickly to achieve these cost and operational efficiencies, which we expect to result in a post-synergy purchase multiple of approximately six times.”\nUpon completion, Rodoban will be the seventh acquisition for Brink’s since March of 2017 for a total expenditure of approximately $515 million. In 2019, these acquisitions are expected to generate total adjusted EBITDA of approximately $90 million, reflecting a post-synergy purchase multiple of less than six.\nAbout The Brink’s Company\nThe Brink’s Company (NYSE:BCO) is the global leader in cash management, secure logistics and security solutions including cash-in-transit, ATM services, cash management services (including vault outsourcing, money processing and intelligent safe services), international transportation of valuables, and payment services. Our customers include financial institutions, retailers, government agencies, mints, jewelers and other commercial operations. Our global network of operations in 41 countries serve customers in more than 100 countries. For more information, please visit our website at www.Brinks.com or call 804-289-9709.\nForward Looking Statements\nThis release contains forward-looking information. Words such as \"anticipate,\" \"assume,\" \"estimate,\" \"expect,\" “target” \"project,\" \"predict,\" \"intend,\" \"plan,\" \"believe,\" \"potential,\" \"may,\" \"should\" and similar expressions may identify forward-looking information. Forward-looking information in these materials includes, but is not limited to the acquisition of Rodoban and the impact of the Rodoban and other acquisitions on the Company’s results. Forward-looking information in this document is subject to known and unknown risks, uncertainties and contingencies, which are difficult to predict or quantify, and which could cause actual results, performance or achievements to differ materially from those that are anticipated. These risks, uncertainties and contingencies, many of which are beyond our control, include, but are not limited to: our ability to improve profitability and execute further cost and operational improvement and efficiencies in our core businesses; our ability to improve service levels and quality in our core businesses; market volatility and commodity price fluctuations; seasonality, pricing and other competitive industry factors; our ability to maintain an effective IT infrastructure and safeguard confidential information; risks associated with operating in foreign countries, including changing political, labor and economic conditions, regulatory issues, currency restrictions and devaluations, restrictions on and cost of repatriating earnings and capital, and restrictive government actions, including nationalization; labor issues, including negotiations with organized labor and work stoppages; the strength of the U.S. dollar relative to foreign currencies and foreign currency exchange rates; our ability to identify, evaluate and complete acquisitions (including Rodoban and any other pending acquisitions to date) and other strategic transactions and to successfully integrate acquired companies, achieve expected synergies and successfully integrate the businesses; our ability to obtain appropriate insurance coverage, positions taken by insurers relative to claims and the financial condition of insurers; safety and security performance and loss experience; the nature of hedging relationships and counterparty risk; access to the capital and credit markets; the outcome of pending and future claims, litigation, and administrative proceedings; public perception of our business and reputation; changes in estimates and assumptions underlying critical accounting policies; the promulgation and adoption of new accounting standards, new government regulations and interpretation of existing standards and regulations.\nThis list of risks, uncertainties and contingencies is not intended to be exhaustive. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found under \"Risk Factors\" in Item 1A of our Annual Report on Form 10-K for the period ended December 31, 2016, and in our other public filings with the Securities and Exchange Commission. The forward-looking information included in this document is representative only as of the date of this document and The Brink's Company undertakes no obligation to update any information contained in this document.\nContact: Investor Relations and Corporate Communications\n804.289.9709\nSource: The Brink’s Company", "external_links": ["https://www.globenewswire.com/Tracker?data=CBNX_dPANh1J8DWa5228jgZ07EPmytwTwmJs43li94EANygvg0JkzGTlu42e-RzytWMU0wjcpqfYLIM6F3Py_A==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/5c8ffe8d-f4bc-486e-babc-02068c20f59e"], "published": "2018-01-11T00:10:00.000+02:00", "crawled": "2018-01-11T01:30:48.041+02:00", "highlightTitle": ""}