{"organizations": [], "uuid": "7b88c79f53887660504f3f93b9ae57898ad97e7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-pultegroup-reports-fourth-quarter-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "PulteGroup Reports Fourth Quarter 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T14:30:00.000+02:00", "replies_count": 0, "uuid": "7b88c79f53887660504f3f93b9ae57898ad97e7a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-pultegroup-reports-fourth-quarter-2017-financial-results.html", "ord_in_thread": 0, "title": "PulteGroup Reports Fourth Quarter 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "company", "sentiment": "none"}, {"name": "pultegroup, inc.", "sentiment": "none"}, {"name": "phm", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "homes company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reported Net Income of $0.26 Per Share Inclusive of Income Tax and Land Charges Partially Offset By Favorable Insurance Adjustments Adjusted Net Income of $0.85 Per Share Increased 27% Over Prior Year Q4 Adjusted Net Income of $0.67 Per Share Home Sale Revenues Increased 12% to $2.7 Billion Value of Net New Orders Increased 22% to $2.0 Billion; Net New Orders Gained 14% to 4,805 Homes Backlog Value Increased 35% to $4.0 Billion; Unit Backlog Increased 21% to 8,996 Homes Company Repurchased 7.6 Million Shares of Stock During the Quarter for $251 Million Company Announces $500 Million Increase to Share Repurchase Plan\nATLANTA, Jan. 30, 2018 (GLOBE NEWSWIRE) -- PulteGroup, Inc. (NYSE:PHM) announced today financial results for its fourth quarter ended December 31, 2017. For the quarter, the Company’s reported net income was $77 million, or $0.26 per share. Adjusted net income for the period was $253 million, or $0.85 per share, after excluding a $66 million pre-tax benefit associated with insurance related adjustments, a $57 million pre-tax charge relating to land adjustments, and $181 million of income tax charges primarily relating to the revaluation of the Company’s deferred tax assets following newly enacted federal tax legislation.\nReported net income for the prior year fourth quarter was $273 million, or $0.83 per share. Adjusted net income for the prior year fourth quarter was $223 million, or $0.67 per share, after excluding $0.16 per share of insurance and income tax benefits.\n“Reflecting the continued strength of housing demand, the value of new orders in the quarter increased 22% over the prior year, helping to grow our year-end backlog to a 12-year high of $4.0 billion,” said Ryan Marshall, President and CEO of PulteGroup. “Consistent with our strategic objectives, we leveraged a 12% increase in quarterly revenues into a 27% increase in adjusted earnings per share.”\n“Ongoing gains in profitability and cash flow generation, which allowed us to reinvest in our business while repurchasing 11% of our outstanding common shares in 2017, also gave our Board the confidence to announce today a $500 million increase to our share repurchase plan,” added Marshall. “Given expectations for further expansion in the economy, along with ongoing gains in employment and buyer demand, we remain highly constructive on the industry. With our large backlog and robust land pipeline, we are well positioned to continue growing our business and building even greater value for our shareholders.”\nFourth Quarter Results\nHome sale revenues for the fourth quarter increased 12% over the prior year to $2.7 billion. Higher revenues for the period were driven by a 7% increase in closings to 6,632 homes, combined with a 5%, or $19,000, increase in average sales price to $410,000.\nThe Company’s fourth quarter adjusted home sale gross margin, which excludes the $57 million land charge, was 23.8%. Inclusive of this charge, the Company’s reported gross margin for the fourth quarter was 21.6%. Prior year adjusted and reported gross margins were 24.9% and 24.8%, respectively.\nThe Company’s fourth quarter adjusted homebuilding SG&A expense, which excludes the $66 million insurance-related benefit, was $268 million, or 9.8% of home sale revenues. The comparable prior year adjusted SG&A expense of $263 million, or 10.8% of home sale revenues, excludes a $55 million benefit associated with an insurance-related adjustment recorded in that quarter. Reported SG&A expense in the current quarter was $202 million, or 7.4% of home sale revenues, compared with fourth quarter 2016 reported SG&A expense of $208 million, or 8.6% of home sale revenues.\nThe value of fourth quarter net new orders increased 22% over the prior year to $2.0 billion, while the number of orders increased 14% to 4,805 homes. For the fourth quarter, the Company operated out of 790 communities, which is up 9% over the fourth quarter of 2016.\nBacklog value at the end of the fourth quarter was $4.0 billion, which is up 35% over the prior year and is the Company’s highest year-end backlog in over a decade. On a unit basis, backlog for the quarter was up 21% over last year to 8,996 homes. The average price of homes in backlog increased 12% over the prior year to $442,000.\nThe Company's financial services operations reported fourth quarter pre-tax income of $23 million compared with $25 million in the prior year. The decrease in pre-tax income was primarily the result of a more competitive operating environment which impacted pricing during the period. Mortgage capture rate for the quarter was 81%, compared with 82% in the prior year.\nFor the quarter, the Company’s adjusted income tax expense, which excludes the $181 million income tax charge relating primarily to the revaluation of its deferred tax assets resulting from the Tax Cuts and Jobs Act enacted in December 2017, was $147 million. The Company’s adjusted effective tax rate for the fourth quarter was 36.8%.\nDuring the quarter, the Company repurchased 7.6 million common shares for $251 million, or an average price of $33.09 per share. For the year, the Company repurchased a total of 35.4 million common shares, or 11% of its outstanding shares, for $910 million, or an average price of $25.70 per share. The Company also used available cash to retire $123 million of notes that matured in the fourth quarter.\nShare Repurchase Plan Increased by $500 Million\nIn a separate press release issued today, the Company announced that its Board of Directors approved an increase to its existing share repurchase plan of $500 million. As of December 31, 2017, the Company had $94 million of authorization remaining in its share repurchase plan. The Company expects that share repurchases will be made from time to time in the open market, through privately negotiated transactions or otherwise subject to market conditions, applicable legal requirements, and other relevant factors.\nA conference call discussing PulteGroup's fourth quarter 2017 results is scheduled for Tuesday, January 30, 2018, at 8:30 a.m. Eastern Time. Interested investors can access the live webcast via PulteGroup's corporate website at www.pultegroupinc.com .\nForward-Looking Statements\nThis press release includes \" .\" These statements are subject to a number of risks, uncertainties and other factors that could cause our actual results, performance, prospects or opportunities, as well as those of the markets we serve or intend to serve, to differ materially from those expressed in, or implied by, these statements. You can identify these statements by the fact that they do not relate to matters of a strictly factual or historical nature and generally discuss or relate to forecasts, estimates or other expectations regarding future events. Generally, the words “believe,” “expect,” “intend,” “estimate,” “anticipate,” “plan,” “project,” “may,” “can,” “could,” “might,” \"should\", “will” and similar expressions identify , including statements related to the impairment charge with respect to certain land parcels and the impacts or effects thereof, expected operating and performing results, planned transactions, planned objectives of management, future developments or conditions in the industries in which we participate and other trends, developments and uncertainties that may affect our business in the future.\nSuch risks, uncertainties and other factors include, among other things: interest rate changes and the availability of mortgage financing; competition within the industries in which we operate; the availability and cost of land and other raw materials used by us in our homebuilding operations; the impact of any changes to our strategy in responding to the cyclical nature of the industry, including any changes regarding our land positions and the levels of our land spend; the availability and cost of insurance covering risks associated with our businesses; shortages and the cost of labor; weather related slowdowns; slow growth initiatives and/or local building moratoria; governmental regulation directed at or affecting the housing market, the homebuilding industry or construction activities; uncertainty in the mortgage lending industry, including revisions to underwriting standards and repurchase requirements associated with the sale of mortgage loans; the interpretation of or changes to tax, labor and environmental laws, including, but not limited to the Tax Cuts and Jobs Act which could have a greater impact on our effective tax rate or the value of our deferred tax assets than we anticipate; economic changes nationally or in our local markets, including inflation, deflation, changes in consumer confidence and preferences and the state of the market for homes in general; legal or regulatory proceedings or claims; our ability to generate sufficient cash flow in order to successfully implement our capital allocation priorities; required accounting changes; terrorist acts and other acts of war; and other factors of national, regional and global scale, including those of a political, economic, business and competitive nature. See PulteGroup's Annual Report on Form 10-K for the fiscal year ended December 31, 2016, and other public filings with the Securities and Exchange Commission (the \"SEC\") for a further discussion of these and other risks and uncertainties applicable to our businesses. PulteGroup undertakes no duty to update any forward-looking statement, whether as a result of new information, future events or changes in PulteGroup's expectations.\nAbout PulteGroup\nPulteGroup, Inc. (NYSE:PHM), based in Atlanta, Georgia, is one of America's largest homebuilding companies with operations in approximately 50 markets throughout the country. Through its brand portfolio that includes Centex, Pulte Homes, Del Webb, DiVosta Homes and John Wieland Homes and Neighborhoods, the Company is one of the industry's most versatile homebuilders able to meet the needs of multiple buyer groups and respond to changing consumer demand. PulteGroup conducts extensive research to provide homebuyers with innovative solutions and consumer inspired homes and communities to make lives better.\nFor more information about PulteGroup, Inc. and PulteGroup brands, go to www.pultegroupinc.com ; www.pulte.com ; www.centex.com ; www.delwebb.com ; www.divosta.com and www.jwhomes.com .\nCompany Contact\nInvestors: Jim Zeumer\n(404) 978-6434\nEmail: jim.zeumer@pultegroup.com\nPulteGroup, Inc.\nConsolidated Results of Operations\n($000's omitted, except per share data)\n(Unaudited) Three Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Revenues: Homebuilding Home sale revenues $ 2,717,031 $ 2,423,472 $ 8,323,984 $ 7,451,315 Land sale revenues 20,360 15,431 57,106 36,035 2,737,391 2,438,903 8,381,090 7,487,350 Financial Services 56,166 54,175 192,160 181,126 Total revenues 2,793,557 2,493,078 8,573,250 7,668,476 Homebuilding Cost of Revenues: Home sale cost of revenues (2,128,931 ) (1,821,672 ) (6,461,152 ) (5,587,974 ) Land sale cost of revenues (18,500 ) (14,256 ) (134,449 ) (32,115 ) (2,147,431 ) (1,835,928 ) (6,595,601 ) (5,620,089 ) Financial Services expenses (33,139 ) (29,370 ) (119,289 ) (108,573 ) Selling, general, and administrative expenses (201,607 ) (207,647 ) (891,581 ) (957,150 ) Other expense, net (2,613 ) (6,412 ) (27,951 ) (48,814 ) Income before income taxes 408,767 413,721 938,828 933,850 Income tax expense (331,352 ) (140,549 ) (491,607 ) (331,147 ) Net income $ 77,415 $ 273,172 $ 447,221 $ 602,703 Net income per share: Basic $ 0.26 $ 0.83 $ 1.45 $ 1.76 Diluted $ 0.26 $ 0.83 $ 1.44 $ 1.75 Cash dividends declared $ 0.09 $ 0.09 $ 0.36 $ 0.36 Number of shares used in calculation: Basic 292,174 325,975 305,089 339,747 Effect of dilutive securities 1,318 1,834 1,725 2,376 Diluted 293,492 327,809 306,814 342,123\nPulteGroup, Inc.\nCondensed Consolidated Balance Sheets\n($000's omitted)\n(Unaudited) December 31,\n2017 December 31,\n2016 ASSETS Cash and equivalents $ 272,683 $ 698,882 Restricted cash 33,485 24,366 Total cash, cash equivalents, and restricted cash 306,168 723,248 House and land inventory 7,147,130 6,770,655 Land held for sale 68,384 31,728 Residential mortgage loans available-for-sale 570,600 539,496 Investments in unconsolidated entities 62,957 51,447 Other assets 745,123 857,426 Intangible assets 140,992 154,792 Deferred tax assets, net 645,295 1,049,408 $ 9,686,649 $ 10,178,200 LIABILITIES AND SHAREHOLDERS’ EQUITY Liabilities: Accounts payable $ 393,815 $ 405,455 Customer deposits 250,779 187,891 Accrued and other liabilities 1,356,333 1,429,712 Income tax liabilities 86,925 34,860 Financial Services debt 437,804 331,621 Notes payable 3,006,967 3,129,298 Total liabilities 5,532,623 5,518,837 Shareholders' equity 4,154,026 4,659,363 $ 9,686,649 $ 10,178,200\nPulteGroup, Inc.\nConsolidated Statements of Cash Flows\n($000's omitted)\n(Unaudited) Year Ended December 31, 2017\n2016 Cash flows from operating activities: Net income $ 447,221 $ 602,703 Adjustments to reconcile net income to net cash from operating activities: Deferred income tax expense 422,307 334,787 Land-related charges 191,913 19,357 Depreciation and amortization 50,998 54,007 Share-based compensation expense 33,683 22,228 Loss on debt retirements — 657 Other, net (1,789 ) 1,614 Increase (decrease) in cash due to: Inventories (569,030 ) (897,092 ) Residential mortgage loans available-for-sale (33,009 ) (99,527 ) Other assets 55,099 (45,721 ) Accounts payable, accrued and other liabilities 65,684 75,257 Net cash provided by (used in) operating activities 663,077 68,270 Cash flows from investing activities: Capital expenditures (32,051 ) (39,295 ) Investment in unconsolidated subsidiaries (23,037 ) (14,539 ) Cash used for business acquisition — (430,458 ) Other investing activities, net 4,846 13,100 Net cash used in investing activities (50,242 ) (471,192 ) Cash flows from financing activities: Proceeds from debt issuance — 1,995,937 Repayments of debt (134,747 ) (986,919 ) Borrowings under revolving credit facility 2,720,000 619,000 Repayments under revolving credit facility (2,720,000 ) (619,000 ) Financial Services borrowings, net 106,183 63,744 Stock option exercises 27,720 5,845 Share repurchases (916,323 ) (603,206 ) Dividends paid (112,748 ) (124,666 ) Net cash provided by (used in) financing activities (1,029,915 ) 350,735 Net increase (decrease) (417,080 ) (52,187 ) Cash, cash equivalents, and restricted cash at beginning of period 723,248 775,435 Cash, cash equivalents, and restricted cash at end of period $ 306,168 $ 723,248 Supplemental Cash Flow Information: Interest paid (capitalized), net $ (942 ) $ (26,538 ) Income taxes paid (refunded), net $ 14,875 $ 2,743\nPulteGroup, Inc.\nSegment Data\n($000's omitted)\n(Unaudited) Three Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 HOMEBUILDING: Home sale revenues $ 2,717,031 $ 2,423,472 $ 8,323,984 $ 7,451,315 Land sale revenues 20,360 15,431 57,106 36,035 Total Homebuilding revenues 2,737,391 2,438,903 8,381,090 7,487,350 Home sale cost of revenues (2,128,931 ) (1,821,672 ) (6,461,152 ) (5,587,974 ) Land sale cost of revenues (18,500 ) (14,256 ) (134,449 ) (32,115 ) Selling, general, and administrative expenses (201,607 ) (207,647 ) (891,581 ) (957,150 ) Other income (expense), net (2,845 ) (6,604 ) (28,576 ) (49,345 ) Income before income taxes $ 385,508 $ 388,724 $ 865,332 $ 860,766 FINANCIAL SERVICES: Income before income taxes $ 23,259 $ 24,997 $ 73,496 $ 73,084 CONSOLIDATED: Income before income taxes $ 408,767 $ 413,721 $ 938,828 $ 933,850\nPulteGroup, Inc.\nSegment Data, continued\n($000's omitted)\n(Unaudited) Three Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Home sale revenues $ 2,717,031 $ 2,423,472 $ 8,323,984 $ 7,451,315 Closings - units Northeast 489 529 1,335 1,418 Southeast 1,137 1,102 3,888 3,901 Florida 1,222 1,093 3,861 3,441 Midwest 1,120 1,142 3,696 3,418 Texas 1,298 1,080 4,107 3,726 West 1,366 1,251 4,165 4,047 6,632 6,197 21,052 19,951 Average selling price $ 410 $ 391 $ 395 $ 373 Net new orders - units Northeast 357 306 1,460 1,361 Southeast 919 804 4,233 3,810 Florida 1,000 705 4,121 3,585 Midwest 757 766 3,876 3,636 Texas 840 784 4,121 3,793 West 932 837 4,815 4,141 4,805 4,202 22,626 20,326 Net new orders - dollars $ 2,030,223 $ 1,666,066 $ 9,361,534 $ 7,753,399 December 31, 2017 2016 Unit backlog Northeast 512 387 Southeast 1,716 1,371 Florida 1,678 1,418 Midwest 1,487 1,307 Texas 1,426 1,412 West 2,177 1,527 8,996 7,422 Dollars in backlog $ 3,979,064 $ 2,941,512\nPulteGroup, Inc.\nSegment Data, continued\n($000's omitted)\n(Unaudited) Three Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 MORTGAGE ORIGINATIONS: Origination volume 4,521 4,250 14,152 13,373 Origination principal $ 1,348,933 $ 1,225,568 $ 4,127,084 $ 3,706,745 Capture rate 80.6 % 81.8 % 79.9 % 81.2 %\nSupplemental Data\n($000's omitted)\n(Unaudited) Three Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Interest in inventory, beginning of period $ 222,545 $ 176,661 $ 186,097 $ 149,498 Interest capitalized 45,771 44,961 181,719 160,506 Interest expensed (41,705 ) (35,525 ) (141,205 ) (123,907 ) Interest in inventory, end of period $ 226,611 $ 186,097 $ 226,611 $ 186,097\nPulteGroup, Inc.\nReconciliation of Non-GAAP Financial Measures\n(Unaudited)\nThis report contains information about our operating results reflecting certain adjustments, including adjustments to cost of revenues, selling general, and administrative expenses, income before income taxes, income tax expense, net income, diluted earnings per share, and operating margin. These measures are considered non-GAAP financial measures under the SEC's rules and should be considered in addition to, rather than as a substitute for, the comparable GAAP financial measures as measures of our profitability. We believe that reflecting these adjustments provides investors relevant and useful information for evaluating the comparability of financial information presented and comparing our profitability to other companies in the homebuilding industry. Although other companies in the homebuilding industry report similar information, the methods used may differ. We urge investors to understand the methods used by other companies in the homebuilding industry to calculate these measures and any adjustments thereto before comparing our measures to those of such other companies.\nThe following tables set forth a reconciliation of the non-GAAP financial measures to the GAAP financial measures that management believes to be most directly comparable ($000's omitted):\nThree Months Ended Three Months Ended December 31, 2017 December 31, 2016 As Reported Adjustments (a) Adjusted As Reported Adjustments (b) Adjusted Revenues: Homebuilding Home sale revenues $ 2,717,031 $ — $ 2,717,031 $ 2,423,472 $ — $ 2,423,472 Land sale revenues 20,360 — 20,360 15,431 — 15,431 2,737,391 — 2,737,391 2,438,903 — 2,438,903 Financial Services 56,166 — 56,166 54,175 — 54,175 Total revenues 2,793,557 — 2,793,557 2,493,078 — 2,493,078 Homebuilding Cost of Revenues: Home sale cost of revenues (2,128,931 ) 57,466 (2,071,465 ) (1,821,672 ) 1,074 (1,820,598 ) Land sale cost of revenues (18,500 ) — (18,500 ) (14,256 ) — (14,256 ) (2,147,431 ) 57,466 (2,089,965 ) (1,835,928 ) 1,074 (1,834,854 ) Financial Services expenses (33,139 ) — (33,139 ) (29,370 ) — (29,370 ) Selling, general, and administrative expenses (SG&A) (201,607 ) (66,009 ) (267,616 ) (207,647 ) (55,243 ) (262,890 ) Other expense, net (2,613 ) — (2,613 ) (6,412 ) — (6,412 ) Income before income taxes 408,767 (8,543 ) 400,224 413,721 (54,169 ) 359,552 Income tax expense (331,352 ) 183,871 (147,481 ) (140,549 ) 3,865 (136,684 ) Net income $ 77,415 $ 175,328 $ 252,743 $ 273,172 $ (50,304 ) $ 222,868 Earnings per share (diluted) $ 0.26 $ 0.85 $ 0.83 $ 0.67 Home sale gross margin 21.6 % 23.8 % 24.8 % 24.9 % SG&A as a percentage of sales 7.4 % 9.8 % 8.6 % 10.8 % Operating margin 14.2 % 13.9 % 16.3 % 14.0 % Effective tax rate 81.1 % 36.8 % 34.0 % 38.0 % (a) Includes land inventory impairments, an insurance-related benefit, and income tax charges primarily related to the revaluation of deferred tax assets resulting from the Tax Cuts and Jobs Act enacted in December 2017\n(b) Includes land inventory impairments, an insurance-related benefit, and net income tax benefits primarily related to energy efficient home credits and a deferred tax benefit related to a legal entity restructuring\nTwelve Months Ended Twelve Months Ended December 31, 2017 December 31, 2016 As Reported Adjustments (a) Adjusted As Reported Adjustments (b) Adjusted Revenues: Homebuilding Home sale revenues $ 8,323,984 $ — $ 8,323,984 $ 7,451,315 $ — $ 7,451,315 Land sale revenues 57,106 — 57,106 36,035 — 36,035 8,381,090 — 8,381,090 7,487,350 — 7,487,350 Financial Services 192,160 — 192,160 181,126 — 181,126 Total revenues 8,573,250 — 8,573,250 7,668,476 — 7,668,476 Homebuilding Cost of Revenues: Home sale cost of revenues (6,461,152 ) 101,058 (6,360,094 ) (5,587,974 ) 1,074 (5,586,900 ) Land sale cost of revenues (134,449 ) 81,006 (53,443 ) (32,115 ) — (32,115 ) (6,595,601 ) 182,064 (6,413,537 ) (5,620,089 ) 1,074 (5,619,015 ) Financial Services expenses (119,289 ) — (119,289 ) (108,573 ) — (108,573 ) Selling, general, and administrative expenses (SG&A) (891,581 ) (65,496 ) (957,077 ) (957,150 ) (45,213 ) (1,002,363 ) Other expense, net (27,951 ) 8,017 (19,934 ) (48,814 ) 26,643 (22,171 ) Income before income taxes 938,828 124,585 1,063,413 933,850 (17,496 ) 916,354 Income tax expense (491,607 ) 107,661 (383,946 ) (331,147 ) (17,596 ) (348,743 ) Net income $ 447,221 $ 232,246 $ 679,467 $ 602,703 $ (35,092 ) $ 567,611 Earnings per share (diluted) $ 1.44 $ 2.19 $ 1.75 $ 1.66 Home sale gross margin 22.4 % 23.6 % 25.0 % 25.0 % SG&A as a percentage of sales 10.7 % 11.5 % 12.8 % 13.5 % Operating margin 11.7 % 12.1 % 12.2 % 11.6 % Effective tax rate 52.4 % 36.1 % 35.5 % 38.1 % (a) Includes land inventory impairments, net realizable value adjustments on land held for sale, net insurance-related benefits, an impairment of an investment in an unconsolidated subsidiary, and income tax charges primarily related to the revaluation of deferred tax assets resulting from the Tax Cuts and Jobs Act enacted in December 2017\n(b) Includes land inventory impairments, net insurance-related benefits, restructuring costs associated with a plan to reduce overhead expenses, costs relating to shareholder activities, a charge resulting from the settlement of a disputed land transaction, and net income tax benefits primarily related to energy efficient home credits and a deferred tax benefit related to a legal entity restructuring\nSource:PulteGroup, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=_LY3Yp4jjIVGpe-XbloZuGf7BX-CbAnSrZAbUDrncIUISiOVHXHXhtHr9578GOw1T9ugv5WBULzpMORH-AAhzw==", "https://www.globenewswire.com/Tracker?data=TV6HfPfFgzXuLxnNv4kNu2TaO2JFCHnbo2QdTuiPDo4eUy194kWh-twjHGIowE32ERIWzTMyyAmx6pbQa-PnRA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0211ee65-8fde-46b4-88b0-d3d52c75e475", "https://www.globenewswire.com/Tracker?data=GlXopoLl5QT1QFLkMPOutWWe6bFfFtJ5556YSzolxVfrAQT9dE4bDs8rlvF9uF7AehF7uuPoODo9f1vqjNOjDQ==", "https://www.globenewswire.com/Tracker?data=H5VPsL87xwkqyPoMT2t3QKEX7uemV7kiR91BoFfj6yHylJZAOq_rgX6HdBHDNXerj3alLf5ivZ8xhjQKSlPzQQ==", "https://www.globenewswire.com/Tracker?data=TV6HfPfFgzXuLxnNv4kNu9Z4sRP7JqnR2Y3fFP_NLkaCAkQd-u7vswfIELbXIO8RHyuA3DYsnmFJ8xI2MEwsrlEt93m4vNz5QOa4Slujyq4=", "https://www.globenewswire.com/Tracker?data=TV6HfPfFgzXuLxnNv4kNu9Z4sRP7JqnR2Y3fFP_NLkaqACmF_w-axq9hBDZViAygpp0x9TUwefSGEXFwfsTddv0IdCK2vS6k_v3Wv8LhyU4=", "https://www.globenewswire.com/Tracker?data=Vb_UVQCEEed-KaZAtAEjQZjoPngakbq0Qtuysz77UbIulmJ5YrsXUIqPLY9fJ-F4fJw6Y92oJyLjDfYl0dk7Vz9k2LvGvvjXlVM8U58lQEw=", "https://www.globenewswire.com/Tracker?data=Ht-psSdqaKVz6QA_Sitc77ONy1oLXLpbgZVeVtHyFREOluHen48wYmCBX2D5XLkmd2e9QI2xwmtFHH52zBdqGw=="], "published": "2018-01-30T14:30:00.000+02:00", "crawled": "2018-01-30T15:35:42.002+02:00", "highlightTitle": ""}