{"organizations": [], "uuid": "0f7bd2aca6c03ea0ea49b11a42c2f3843164a9e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/10/26/104051715-RTX2QJEW.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/norway-where-the-electric-tesla-has-become-the-budget-option.html", "country": "US", "domain_rank": 767, "title": "Norway, where the electric Tesla has become the budget option", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.572, "site_type": "news", "published": "2018-01-30T08:27:00.000+02:00", "replies_count": 0, "uuid": "0f7bd2aca6c03ea0ea49b11a42c2f3843164a9e5"}, "author": "David Reid", "url": "https://www.cnbc.com/2018/01/30/norway-where-the-electric-tesla-has-become-the-budget-option.html", "ord_in_thread": 0, "title": "Norway, where the electric Tesla has become the budget option", "locations": [], "entities": {"persons": [{"name": "tesla", "sentiment": "negative"}, {"name": "allgot", "sentiment": "none"}, {"name": "marte skogstad allgot", "sentiment": "none"}], "locations": [{"name": "norway", "sentiment": "none"}, {"name": "oslo", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Marte Skogstad Allgot moved back to Oslo, Norway, from London two years ago and soon found that running a car on gas was prohibitively expensive.\nTo her surprise, Allgot discovered it was cheaper to run a fully-electric Tesla Model S car than it was to drive a hybrid Toyota Prius.\n\"When we added up how much we were spending on tolls and fuel it was the equivalent of buying a Model S,\" she told CNBC. \"I still can't believe that buying what I consider to be an expensive, luxury car makes more economic sense than owning a Prius.\"\nOnly full-electric vehicles in Norway don't pay tolls erected on city boundaries, and Allgot said the costs soon add up.\n\"The toll system is electronic so you don't notice the 54 Norwegian crowns ($7) every time, but when you see that bill at the end of the month you have to ask whether it is worth it,\" she said.\nAllgot's solution was to buy a Tesla Model S, which retails for the equivalent of $80,000 in Norway. Incredibly, the country's fourth most popular car is the more expensive Model X, with a list price of $125,000.\nTesla isn't the only popular electric or hybrid vehicle in the northern European country. Across 2017, and for the first time ever, electric and hybrid cars accounted for more than half of all new vehicle sales in Norway.\nStephen Lam | Reuters Tesla Motors CEO Elon Musk introduces the \"falcon wing\" door on the Model X electric sports-utility vehicle during a presentation in Fremont, California, on September 29, 2015. The shift away from pure fossil-fuel engines has been so fast that 2017 sales of cars using some form of electric battery power topped out at 52 percent, according to the Norwegian Road Federation (OFV).\nNorway is an oil-rich economy that does allow for high wages, but the real push toward luxury electric vehicles (EVs) has been made possible by a huge sales tax exemption.\nBent Erik Bakken, a senior principal scientist at the global assurance and risk management company DNV GL, told CNBC via telephone that Norwegian taxes on full petrol cars are about 100 percent, thus doubling the showroom price.\n\"So then you just take that away for electric vehicles and suddenly EVs in Norway are, on average, cheaper,\" he said.\nBakken is a co-author of a global forecast on energy that predicts almost all new sales of cars across Europe to be electric or hybrid within 20 years. The report, titled the Energy Transition Outlook , says for the United States, the report estimated a similar situation will be in place by the 2040s.\nSource: DNV GL Market share of electric vehicles in new light vehicle sales Rapid uptake in North America and India is also expected while sub-Saharan Africa, Middle East and North Africa, Latin America and North East Eurasia are identified as laggards.\nDenmark illustrates why subsidies are not only important to EV growth but also retain existing market appetite. For a long time, electric car buyers were spared the 180 percent import tax that Denmark applies to vehicles fueled by an internal combustion engine.\nUnder pressure from traditional manufacturers, those tax breaks were originally set to be phased out from 2016 to 2020. But as soon as the new regime was introduced in the first three months of 2016, sales of electric vehicles dropped from nearly 2,500 units to just over 200.\nShocked by the drop-off, Denmark reversed course but said it would usher in a new post-subsidy era from 2019. The ultimate aim is to have a 100 percent tax on electric vehicles by 2022.\nBakken claimed the cost barrier of electric vehicles is melting away fast and that meant subsidies would lose their importance. He said he expected EVs to reach lifecycle cost parity with traditional light vehicles by 2022.\nThe scientist also predicted that recharging infrastructure would not prove a barrier as it was no more expensive to install than traditional gas stations.\nHe did, however, concede that even in pro-electric Norway there are cultural barriers.\n\"For example, when it is minus 20 degrees, it is said that the battery does not perform so well as the chemicals freeze. And there are many stories. I hear people say that they heard of someone who thought they had lots of battery charge and then two kilometers down the road, the car has no power.\"\nOn concerns about power use, Bakken said his personal electricity bill had risen 5 percent from charging his car at home and fears of surge demand were overblown.\n\"In households, you will find that there will be a demand response pricing mechanism so people will charge when it is cheaper,\" he said.", "external_links": [], "published": "2018-01-30T08:27:00.000+02:00", "crawled": "2018-01-30T08:27:14.011+02:00", "highlightTitle": ""}