{"organizations": [], "uuid": "42832f7894d074bbc3b5f65f7f75a3495c63627e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-mexichem-receives-from-the-brazilian-antitrust-authority-approval-for-the-acquisition-of-netafim.html", "country": "US", "domain_rank": 767, "title": "Mexichem Receives from the Brazilian Antitrust Authority Approval for the Acquisition of Netafim", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-23T07:09:00.000+02:00", "replies_count": 0, "uuid": "42832f7894d074bbc3b5f65f7f75a3495c63627e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-mexichem-receives-from-the-brazilian-antitrust-authority-approval-for-the-acquisition-of-netafim.html", "ord_in_thread": 0, "title": "Mexichem Receives from the Brazilian Antitrust Authority Approval for the Acquisition of Netafim", "locations": [], "entities": {"persons": [{"name": "s.a.b. de c.v.", "sentiment": "negative"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "brazilian antitrust authority approval for the acquisition of netafim tlalnepantla", "sentiment": "negative"}, {"name": "netafim, ltd", "sentiment": "none"}, {"name": "administrative council of economic defense", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TLALNEPANTLA DE BAZ, Mexico--(BUSINESS WIRE)-- Mexichem, S.A.B. de C.V. (BMV: MEXCHEM*) (“The Company” or “Mexichem”) announced that on January 19, 2018 it received the approval of the antitrust authority in Brazil CADE (Administrative Council of Economic Defense) for the acquisition of Netafim, Ltd in that country. The General-Superintendence’s decision was published on January 22, 2018 in the Brazilian Official Gazette.\nFollowing the expiration of a 15-day waiting period (from the date of the publication in the Brazilian Official Gazette) with confirmation from CADE that no appeal has been filed, this will be one of the relevant approvals for the transaction to be completed. Closing of the transaction is subject to the satisfaction of customary closing conditions, including any remaining required regulatory approvals.\"\nABOUT MEXICHEM\nMexichem is a global leader in plastic piping and one of the world’s largest chemical and petrochemical companies. It has more than 50 years of experience. The Company contributes to global development by delivering an extended portfolio of products to high growth sectors such as infrastructure, housing, datacom and water management, among others. With operations in 37 countries, 120 facilities worldwide and more than 18,000 employees, Mexichem has the rights to produce fluorspar in two mines in Mexico, as well as 8 formation academies and 15 R&D labs. Operations are divided into two value chains and three business units: Ethylene Chain: Vinyl and Fluent Business and Fluor Value Chain, which includes Fluor business group. Mexichem has annual revenues of US$5.4 billion and has been traded on the Mexican Stock Exchange for more than 30 years. The company is member of the Mexican Stock Exchange Sustainability Index and the sustainability emerging markets index FTSE4Good.\nForward-looking Statements\nIn addition to historical information, this press release contains \"forward-looking\" statements that reflect management's expectations for the future. The words “anticipate,” “believe,” “expect,” “hope,” “have the intention of,” “might,” “plan,” “should” and similar expressions generally indicate comments on expectations. The final results may be materially different from current expectations due to several factors, which include, but are not limited to, global and local changes in politics, the economy, business, competition, market and regulatory factors, cyclical trends in relevant sectors; as well as other factors that are highlighted under the title “Risk Factors” on the annual report submitted by Mexichem to the Mexican National Banking and Securities Commission (CNBV). The forward-looking statements included herein represent Mexichem’s views as of the date of this press release. Mexichem undertakes no obligation to revise or update publicly any forward-looking statement for any reason unless required by law.”\nMexichem has implemented a new Code of Ethics that rules its relationships with its employees, clients, suppliers and general groups. Mexichem’s Code of Ethics is available for consulting in the following link: http://www.mexichem.com/Codigo_de_etica.html Additionally, according to the terms contained in the Securities Exchange Act No 42, Mexichem Audit Committee established a mechanism of contact, which allows that any person that knows the unfulfilment of operational and accounting records guidelines and lack of internal controls of the Code of Ethics, from the Company itself or from the subsidiaries that this controls, file a complaint which is anonymously guaranteed. The whistleblower program is facilitated by a third party. The telephone number in Mexico is 01-800-062-12-03. The website is http://www.ethic-line.com/mexichem and contact e-mail is mexichem@ethic-line.com . Mexichem’s Audit Committee will be notified of all complaints for immediate investigation.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006739/en/\nInvestor Relations\nMexichem, S.A.B. de C.V.\nFabiola Molina del Valle , + (52) 55.5366.4050\nfabiola.molina@mexichem.com\nwww.mexichem.com\nSource: Mexichem, S.A.B. de C.V.", "external_links": ["http://www.ethic-line.com/mexichem", "http://www.businesswire.com/news/home/20180122006739/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mexichem.com%2FCodigo_de_etica.html&esheet=51747315&newsitemid=20180122006739&lan=en-US&anchor=http%3A%2F%2Fwww.mexichem.com%2FCodigo_de_etica.html&index=1&md5=ce50e7a6bb1ba95bf2e01b6863c28c17", "http://www.mexichem.com/Codigo_de_etica.html", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mexichem.com&esheet=51747315&lan=en-US&anchor=www.mexichem.com&index=3&md5=6c047319aefd6a230aefb5b736e20413", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ethic-line.com%2Fmexichem&esheet=51747315&newsitemid=20180122006739&lan=en-US&anchor=http%3A%2F%2Fwww.ethic-line.com%2Fmexichem&index=2&md5=548f202e3a4c5a132e589a01de9c2cf9"], "published": "2018-01-23T07:09:00.000+02:00", "crawled": "2018-01-23T10:31:39.020+02:00", "highlightTitle": ""}