{"organizations": [], "uuid": "c493d277f8d7017a37a696d0a13f005d570334b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104960321-GettyImages-683262962.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/china-invites-latin-america-to-take-part-in-one-belt-one-road.html", "country": "US", "domain_rank": 767, "title": "China invites Latin America to take part in One Belt, One Road", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.22, "site_type": "news", "published": "2018-01-23T04:38:00.000+02:00", "replies_count": 0, "uuid": "c493d277f8d7017a37a696d0a13f005d570334b4"}, "author": "Jason Lee", "url": "https://www.cnbc.com/2018/01/22/china-invites-latin-america-to-take-part-in-one-belt-one-road.html", "ord_in_thread": 0, "title": "China invites Latin America to take part in One Belt, One Road", "locations": [], "entities": {"persons": [{"name": "xi jinping", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jason lee", "sentiment": "none"}, {"name": "wang yi", "sentiment": "none"}], "locations": [{"name": "one belt", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "one road china", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GDP outlook China invites Latin America to take part in One Belt, One Road China invited Latin American and Caribbean countries to join its \"One Belt, One Road\" initiative as part of an agreement to deepen economic and political cooperation in a region where U.S. influence is historically strong The agreement is part of an evolving and more aggressive Chinese foreign policy in Latin America as the United States, under President Donald Trump, has taken a more protectionist stance Published 13 Hours Ago SHARES Jason Lee | Pool | Getty Images Chinese President Xi Jinping attends a conference at the Belt and Road Forum for International Cooperation on May 15, 2017. \nChina invited Latin American and Caribbean countries to join its \"One Belt, One Road\" initiative on Monday, as part of an agreement to deepen economic and political cooperation in a region where U.S. influence is historically strong. \nChinese Foreign Minister Wang Yi said the region was a natural fit for the initiative, which China has leveraged to deepen economic and financial cooperation with developing nations. \n\"China will always stay committed to the path of peaceful development and the win-win strategy of opening up and stands ready to share development dividends with all countries,\" Wang said at a meeting between China and 33 members of the Community of Latin American and Caribbean States (CELAC). \nRepresentatives from China and CELAC signed a broad agreement to expand ties in the second time China has met with CELAC — a bloc formed in Venezuela in 2011 that does not include the United States or Canada. \nThough it had few specific details, the agreement is part of an evolving and more aggressive Chinese foreign policy in Latin America as the United States, under President Donald Trump, has taken a more protectionist stance. \nThe \"One Belt, One Road\" initiative, proposed in 2013 by Chinese President Xi Jinping, promotes expanding links between Asia, Africa and Europe, with billions of dollars in infrastructure investment. \nWang emphasized projects to improve connectivity between land and sea, and cited the need to jointly build \"logistic, electricity and information pathways.\" \nThe so-called Santiago declaration, signed by China and CELAC delegates, also calls for bolstering trade and taking action on climate change. \nChile Foreign Minister Heraldo Munoz, who has criticized Trump in the past, said the agreement marked an \"historic\" new era of dialogue between the region and China. \n\"China said something that is very important, that it wants to be our must trustworthy partner in Latin America and the Caribbean and we greatly value that,\" said Munoz. \"This meeting represents a categoric repudiation of protectionism and unilateralism.\" \nChina has sought a bigger role overseas since Trump was elected, presenting its Regional Comprehensive Economic Partnership trade agreement as an alternative to the Trans-Pacific Partnership, which the United States has abandoned. \nThe country is already testing U.S. dominance in Latin America, offering the region $250 billion in investment over the next decade. It is the top trading partner of many countries in the region, including Brazil, Chile and Argentina. \nStill, Wang played down the idea of a race for influence. \n\"It has nothing to do with geopolitical competition. It follows the principle of achieving shared growth through discussion and collaboration,\" Wang said in his remarks. \"It is nothing like a zero sum game.\" \nIn recent years, Chinese companies have moved away from merely buying Latin American raw materials and are diversifying into sectors such as auto manufacturing, e-commerce and even technology businesses such as car-hailing services. \n\"Our relations with China are very broad, this (CELAC) is one more pathway for Brazil to work with China. Together we identified more areas of cooperation,\" said Brazil's Vice Foreign Minister Marcos Galvao.", "external_links": [], "published": "2018-01-23T04:38:00.000+02:00", "crawled": "2018-01-23T04:38:29.000+02:00", "highlightTitle": ""}