{"organizations": [], "uuid": "c88d39d9cc2892123c19a4999dfe213b3cbad1a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-interactive-brokers-group-announces-4q2017-results.html", "country": "US", "domain_rank": 767, "title": "Interactive Brokers Group Announces 4Q2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.103, "site_type": "news", "published": "2018-01-17T00:01:00.000+02:00", "replies_count": 0, "uuid": "c88d39d9cc2892123c19a4999dfe213b3cbad1a6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-interactive-brokers-group-announces-4q2017-results.html", "ord_in_thread": 0, "title": "Interactive Brokers Group Announces 4Q2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "greenwich", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}], "organizations": [{"name": "interactive brokers group", "sentiment": "negative"}, {"name": "interactive brokers group, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reports Comprehensive Loss Per Share of $0.02, Income before Taxes of $364 Million on $515 Million in Net Revenues, and Loss Per Share on Net Income of $0.02.\nDeclares Quarterly Dividend of $0.10 Per Share.\nGREENWICH, Conn.--(BUSINESS WIRE)-- Interactive Brokers Group, Inc. (NASDAQ GS: IBKR) an automated global electronic broker and market maker, today reported a diluted loss per share on a comprehensive basis of $0.02 for the quarter ended December 31, 2017, compared to a diluted loss per share on a comprehensive basis of $0.05 for the same period in 2016. Excluding other comprehensive income, the Company reported a diluted loss per share of $0.02 for the quarter, compared to diluted earnings per share of $0.07 for the same period in 2016. The results for the quarter were negatively impacted by the effects of the Tax Cuts and Jobs Act (the “Tax Act”), enacted on December 22, 2017, which decreased diluted earnings per share by $0.45.\nNet revenues were $515 million and income before income taxes was $364 million this quarter, compared to net revenues of $193 million and income before income taxes of $28 million for the same period in 2016. The results for the quarter were positively impacted by strong growth in net interest income, which increased $66 million, or 48%, and higher commissions, which increased $20 million, or 13% from the year-ago quarter. Trading gains decreased 64% from the year-ago quarter on lower market making trading volumes as we completed the transfer of our U.S. options market making business to Two Sigma Securities, LLC in the third quarter of 2017.\nIn addition, the results for the quarter include a $6 million gain on our currency diversification strategy, compared to a $152 million loss in the same period in 2016; and a $9 million net mark-to-market loss on our U.S. government securities portfolio, compared to an $11 million net mark-to-market loss in the same period in 2016.\nThe Tax Act significantly revised U.S. corporate income tax law by, among other things, reducing the corporate income tax rate to 21% and implementing a modified territorial tax system that includes a one-time transition tax on deemed repatriated earnings of foreign subsidiaries. As a result of the Tax Act, this quarter includes a net reduction in consolidated earnings of approximately $84 million, of which $62 million is due to the one-time repatriation tax and a net $22 million is related to the remeasurement of U.S. deferred tax assets at lower enacted corporate tax rates. The impact of the Tax Act recognized this quarter may materially differ due to, among other things, changes in interpretations and assumptions the Company has made, guidance that may be issued and actions the Company may take as a result of the Tax Act.\nFor the year ended December 31, 2017, comprehensive diluted earnings per share were $1.22, compared to comprehensive diluted earnings per share of $1.19 in 2016. Excluding other comprehensive income, the Company reported diluted earnings per share of $1.07 for 2017, compared to diluted earnings per share of $1.25 in 2016. The results for 2017 were negatively impacted by the effects of the Tax Act, which decreased diluted earnings per share by $0.46. Net revenues were $1,702 million and income before income taxes was $1,049 million for 2017, compared to net revenues of $1,396 million and income before income taxes of $761 million in 2016.\nThe Interactive Brokers Group, Inc. Board of Directors declared a quarterly cash dividend of $0.10 per share. This dividend is payable on March 14, 2018 to shareholders of record as of March 1, 2018.\nBusiness Highlights\nFourth Quarter 2017:\n71% pretax profit margin for this quarter, up from 15% in the year-ago quarter. 65% Electronic Brokerage pretax profit margin for this quarter, up from 57% in the year-ago quarter. Customer equity grew 46% from the year-ago quarter to $124.8 billion and customer debits increased 52% to $29.5 billion. Customer accounts increased 25% from the year-ago quarter to 483 thousand. Total DARTs 1 increased 14% from the year-ago quarter to 730 thousand. Brokerage segment equity was $4.9 billion. Total equity was $6.4 billion.\nFull Year 2017:\n62% pretax profit margin for 2017, up from 55% in 2016. 61% Electronic Brokerage pretax profit margin for 2017, unchanged from 2016. Total DARTs increased 4% from 2016 to 688 thousand.\n1 Daily average revenue trades (DARTs) are based on customer orders.\nSegment Overview\nElectronic Brokerage\nElectronic brokerage segment income before income taxes increased 50%, to $252 million in the quarter ended December 31, 2017, compared to the same period last year. Net revenues increased 33% to $390 million on higher net interest income and commissions revenue.\nNet interest income increased 51% as average customer credit and margin loan balances and benchmark interest rates increased from the year-ago quarter. Commissions revenue increased 13% from the year-ago quarter on higher customer volumes in options and stocks, which increased 15% and 43%, respectively, from the year-ago quarter. Pretax profit margin was 65% for the quarter ended December 31, 2017, up from 57% in the same period last year.\nCustomer accounts grew 25% to 483 thousand and customer equity increased 46% from the year-ago quarter to $124.8 billion. Total DARTs for cleared and execution-only customers increased 14% to 730 thousand from the year-ago quarter. Cleared DARTs were 681 thousand, 15% higher than in the same period last year.\nMarket Making\nMarket making segment income before income taxes decreased to $8 million in the quarter ended December 31, 2017, due to lower trading gains, partially offset by lower operating costs, as we completed the transfer of our U.S. options market making business to Two Sigma Securities, LLC in the third quarter of 2017.\nEffects of Foreign Currency Diversification\nIn connection with our currency diversification strategy, we have determined to base our net worth in GLOBALs, a basket of 14 major currencies in which we hold our equity. In this quarter, our currency diversification strategy increased our comprehensive earnings by $5 million, as the U.S. dollar value of the GLOBAL increased by approximately 0.14%. In 2017, our currency diversification strategy increased our comprehensive earnings by $175 million, as the U.S. dollar value of the GLOBAL increased by approximately 3.06%. The effects of the currency diversification strategy are reported as components of (1) Other Income in the corporate segment and (2) Other Comprehensive Income (“OCI”).\nConference Call Information:\nInteractive Brokers Group will hold a conference call with investors today, January 16, 2018, at 4:30 p.m. ET to discuss its quarterly results. Investors who would like to listen to the conference call live should dial 877-324-1965 (U.S. domestic) and 631-291-4512 (international). The number should be dialed approximately ten minutes prior to the start of the conference call. Ask for the “Interactive Brokers Conference Call.”\nThe conference call will also", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.interactivebrokers.com%2Fir&esheet=51743922&newsitemid=20180116006670&lan=en-US&anchor=www.interactivebrokers.com%2Fir&index=1&md5=432693305178051f8e85e35f6187ad06"], "published": "2018-01-17T00:01:00.000+02:00", "crawled": "2018-01-17T02:05:34.000+02:00", "highlightTitle": ""}