{"organizations": [], "uuid": "aa92254458fd23d324298c070f3c932b1533538a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220231714&w=1200&r=LYNXMPEE070KG", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/pope-diplomats/pope-calls-for-dialogue-in-korea-ban-on-nuclear-weapons-idINKBN1EX0UY", "country": "US", "domain_rank": 408, "title": "Pope calls for dialogue in Korea, ban on nuclear weapons", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T12:34:00.000+02:00", "replies_count": 0, "uuid": "aa92254458fd23d324298c070f3c932b1533538a"}, "author": "", "url": "https://in.reuters.com/article/pope-diplomats/pope-calls-for-dialogue-in-korea-ban-on-nuclear-weapons-idINKBN1EX0UY", "ord_in_thread": 0, "title": "Pope calls for dialogue in Korea, ban on nuclear weapons", "locations": [], "entities": {"persons": [{"name": "pope", "sentiment": "negative"}, {"name": "pope francis", "sentiment": "none"}, {"name": "francis", "sentiment": "none"}, {"name": "philip pullella", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "korean peninsula", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "vatican city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 10:35 AM / Updated 3 hours ago Pope, in \"state of world\" speech, urges dialogue in Korea, nuclear ban Philip Pullella 3 Min Read \nVATICAN CITY (Reuters) - Pope Francis, in his annual “state of the world” address called on Monday for all nations to support dialogue to ease tensions on the Korean peninsula and to work for a legally binding ban on nuclear weapons. \nIn the speech, Francis also repeated his call for a two-state-solution between Israelis and Palestinians and respect for the “status quo” of Jerusalem following U.S. President Donald Trump’s decision to recognise the city as Israel’s capital. \n“It is of paramount importance to support every effort at dialogue on the Korean peninsula, in order to find new ways of overcoming the current disputes, increasing mutual trust and ensuring a peaceful future for the Korean people and the entire world,” Francis said. \nThe pope addressed envoys from more than 180 countries a day before North Korea and South Korea are due to hold talks expected to address North Korea’s participation in the Pyeongchang Winter Olympics, which some diplomats see as a possible opening for discussions on other topics such as humanitarian issues and divided families. \nEarlier this month, after North Korean leader Kim Jong Un asserted that he had a nuclear button at the ready, Trump tweeted that the U.S. button was bigger and more powerful. \n“Nuclear weapons must be banned,” Francis said, quoting a document issued by Pope John XXIII at the height of the Cold War and adding that there is “no denying that the conflagration could be started by some chance and unforeseen circumstance”. \nNoting that the Holy See was among 122 states that last year agreed a United Nations treaty to ban nuclear weapons, he called for a “serene and wide-ranging debate” on disarmament. Pope Francis makes his speech during an audience with the diplomatic corps accredited to the Holy See for the traditional exchange of New Year greetings at the Vatican January 9, 2017. REUTERS/Alberto Pizzoli/Pool \nThe United States, Britain, France and others boycotted the talks that led to the treaty, instead pledging commitment to a decades-old Non-Proliferation Treaty. \nAt the individual greetings after the speech, Francis spent more time chatting with South Korea’s envoy, Jonghyu Jeong, than with most other diplomats. Slideshow (2 Images) \nWashington’s new ambassador to the Vatican, Callista Gingrich, attended along with her husband, former speaker of the U.S. House of Representatives, Newt Gingrich. \nAddressing climate change, Francis called for a “united effort” to remain committed to the 2015 Paris accord on reducing carbon emissions. French President Emmanuel Macron is trying to breathe new life in the agreement after Trump announced that the United States would withdraw.. \nFrancis, who has made defence of migrants and refugees a major plank of his pontificate, warned against “stirring up primal fears” of newcomers. \n“There is a need, then, to abandon the familiar rhetoric and start from the essential consideration that we are dealing, above all, with persons,” he said. \nMigration has become a top political issue in countries including the United States, Italy and Germany. Reporting by Philip Pullella; Editing by Robin Pomeroy", "external_links": [], "published": "2018-01-08T12:34:00.000+02:00", "crawled": "2018-01-08T12:56:22.112+02:00", "highlightTitle": ""}