{"organizations": [], "uuid": "99e081ac3ceeba5dd96b204ee393452a21def9e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222981869&w=1200&r=LYNXMPEE0H0NY", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-india-budget-health-exclusive/india-plans-to-raise-health-spending-by-11-percent-in-budget-less-than-requested-idUSKBN1F711N", "country": "US", "domain_rank": 408, "title": "India plans to raise health spending by 11 percent in budget; less than requested", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T11:35:00.000+02:00", "replies_count": 0, "uuid": "99e081ac3ceeba5dd96b204ee393452a21def9e6"}, "author": "", "url": "https://www.reuters.com/article/us-india-budget-health-exclusive/india-plans-to-raise-health-spending-by-11-percent-in-budget-less-than-requested-idUSKBN1F711N", "ord_in_thread": 0, "title": "India plans to raise health spending by 11 percent in budget; less than requested", "locations": [], "entities": {"persons": [{"name": "nadda", "sentiment": "none"}, {"name": "j.p. nadda", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "min read  new delhi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "aditya kalra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 9:39 AM / in 7 hours India plans to raise health spending by 11 percent in budget; less than requested Aditya Kalra 5 Min Read \nNEW DELHI (Reuters) - India is poised to raise its public health spending by 11 percent in the annual budget next month, after rejecting the health minister’s demand for a much bigger increase to ramp up disease control, according to government sources and documents. \nHealth Minister J.P. Nadda sought a “bare minimum” budget of nearly $10 billion for 2018-19 - 33 percent higher than last year - in a letter to the finance minister on Nov. 26, which Reuters has reviewed. \nNadda argued the funds were needed for expanding vaccination coverage and free drugs distribution, and also to ward off a growing threat of non-communicable diseases, such as cancer and diabetes, which killed 6 million people in India in 2016. \nHis request was not approved: the health budget is expected to rise by 11 percent to $8.2 billion, three government officials told Reuters. They declined to be named or be identified further as the discussions were confidential. \nPrime Minister Narendra Modi’s government last year set a target of raising annual health spending to 2.5 percent of India’s GDP by 2025, from 1.15 percent now - one of the lowest proportions in the world. \nThe health budget this year will put that pledge at risk. \n“What’s the point of having a (2025) GDP target? With this funding, it still looks like a herculean task,” said one of the officials interviewed. \nThe finance ministry declined comment, while the health ministry did not respond to requests seeking comment. The budget for the financial year ending March 2019 will be presented on Feb. 1. \nShamika Ravi, a member of Modi’s economic advisory council, said she wasn’t privy to the final budget numbers, but described a $8.2 billion annual health budget as “not sufficient”. \n“If we underspend on health, it will impact India’s overall GDP by lowering productivity in the long term,” said Ravi, who is also a research director at Brookings India. FILE PHOTO: A government health worker collects blood sample from a patient at a dengue detention centre in Kolkata, India November 4, 2017. REUTERS/Rupak De Chowdhuri/File Photo \nRavi however said she would continue to advise the government to allocate more funds for healthcare to achieve its 2025 GDP target. ECONOMY VS HEALTH \nLast year, the government intensified efforts to overhaul the public healthcare system. It capped prices of several medical devices to help the poor, ramped up screening of non-communicable diseases and, on top of that, also raised the federal health budget by more than a quarter. \nBut the health budget increase for 2018-19 will be lower as the government’s finances are stretched by slowing economic growth and tax collections that have lagged under a new sales tax regime, the officials said. \nIt was difficult to get the 11 percent hike approved, according to one of the officials, who said that it took many rounds of discussions between the health ministry and the finance ministry. Initially, the finance ministry had earmarked only a five percent increase in the budget, but that was increased after fresh representations by the health ministry, the official said. \nCollections under the new national goods and services tax system stood at $12.6 billion in November, the lowest since its launch in July, which finance officials say have upset the goverment’s overall revenues and their budget calculations. \nIn recent months, the finance ministry has said it wants to boost spending on sectors such as infrastructure, including ports and roads, to boost economic growth. That, along with the need to stick to fiscal targets, means that the budget for other sectors will be squeezed. \nIn his letter, Health Minister Nadda made a case for a significant increase in his ministry’s allocation, saying investments in public health would eventually result in a “tenfold return for the economy”. \nLow public health spending leads to “catastrophic” medical expenses for people, he wrote. \nIndia’s overburdened health system remains plagued with an acute shortage of government hospitals in rural areas. In 2016, more than 1 million children died before turning five, the highest number for any nation in the world, a United Nations report said last year. Reporting by Aditya Kalra, additional reporting by Manoj Kumar; Editing by Tom Lasseter and Raju Gopalakrishnan", "external_links": [], "published": "2018-01-18T11:35:00.000+02:00", "crawled": "2018-01-18T11:50:50.011+02:00", "highlightTitle": ""}