{"organizations": [], "uuid": "324e64058f036544aec000bccb6758bb35cac2c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 24, "shares": 24, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221074625&w=1200&r=LYNXMPEE0A0IJ", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-tunisia-protests/tunisia-deploys-army-in-several-cities-as-violent-protests-intensify-idUKKBN1F00VG", "country": "US", "domain_rank": 408, "title": "Tunisia deploys army in several cities as violent protests intensify", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T10:48:00.000+02:00", "replies_count": 0, "uuid": "324e64058f036544aec000bccb6758bb35cac2c9"}, "author": "", "url": "https://uk.reuters.com/article/uk-tunisia-protests/tunisia-deploys-army-in-several-cities-as-violent-protests-intensify-idUKKBN1F00VG", "ord_in_thread": 0, "title": "Tunisia deploys army in several cities as violent protests intensify", "locations": [], "entities": {"persons": [{"name": "tarek amara", "sentiment": "none"}], "locations": [{"name": "tunisia", "sentiment": "none"}, {"name": "tunis", "sentiment": "none"}, {"name": "tunis", "sentiment": "none"}, {"name": "thala", "sentiment": "none"}, {"name": "sousse", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 8:48 AM / Updated 36 minutes ago Tunisia deploys army in several cities as violent protests intensify Tarek Amara 2 Min Read \nTUNIS (Reuters) - Over 300 protesters were arrested overnight and the army was deployed in several Tunisian cities in violent demonstrations over prices, taxes and unemployment that have swept the country. Riot police clash with protesters during demonstrations against rising prices and tax increases, in Tunis, Tunisia, January 10, 2018. REUTERS/Zoubeir Souissi \nIn Thala, near the Algerian border, troops were sent in after protesters burned down the national security building forcing police to retreat from the town, witnesses told Reuters. \nViolent anti-government protests have raged in other towns in the North African country since Monday, among them the tourist resort of Sousse, against price and tax rises imposed by government to cut a ballooning deficit and satisfy international lenders. \nWhile Tunisia is widely seen as the only democratic success story among “Arab Spring” nations, it has also had nine governments since the overthrow of authoritarian leader Zine El-Abidine Ben Ali, none of which have been able to deal with growing economic problems. Riot police clash with protesters during demonstrations against rising prices and tax increases, in Tunis, Tunisia, January 10, 2018. REUTERS/Zoubeir Souissi \n“Three hundred and thirty people involved in acts of sabotage and robbery were arrested last night,” interior Ministry spokesman Khelifa Chibani said bringing the number of detainees since the protests began to around 600. \nThe army was also deployed in several other cities, including Sousse, Kebeli and Bizert to protect government buildings that have become a target for protesters. \nUprisings in 2011 and two major militant attacks in 2015 damaged foreign investment and tourism, which accounts for eight percent of Tunisia’s economic activity. \nPrime Minister Youssef Chahed on Wednesday accused the opposition of fuelling dissent by calling for more protests. \nOn Tuesday, petrol bombs were hurled at a Jewish school on the southern tourist island of Djerba, home to an ancient Jewish community. Reporting By Tarek Amara", "external_links": [], "published": "2018-01-11T10:48:00.000+02:00", "crawled": "2018-01-11T11:09:55.000+02:00", "highlightTitle": ""}