{"organizations": [], "uuid": "7aea2c08bb635b6f02cfdcbab099c3abf6e21a0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/10/07/104000630-GettyImages-507228806.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/24/south-africa-is-seeing-renewed-optimism-from-business-central-bank-chief-says.html", "country": "US", "domain_rank": 767, "title": "South Africa is seeing renewed optimism from business, central bank chief says", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T10:44:00.000+02:00", "replies_count": 0, "uuid": "7aea2c08bb635b6f02cfdcbab099c3abf6e21a0f"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/24/south-africa-is-seeing-renewed-optimism-from-business-central-bank-chief-says.html", "ord_in_thread": 0, "title": "South Africa is seeing renewed optimism from business, central bank chief says", "locations": [], "entities": {"persons": [{"name": "lesetja kganyago", "sentiment": "none"}, {"name": "cyril ramaphosa", "sentiment": "none"}, {"name": "jacob zuma", "sentiment": "none"}, {"name": "kganyago", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "anc", "sentiment": "none"}, {"name": "african national congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "South Africa is seeing renewed optimism from business, central bank chief says South African has gained renewed optimism among investors, reserve bank governor Lesetja Kganyago told CNBC Wednesday South Africa has been at the center of fresh international attention as it attempts to transition away from years of corruption and economic decay Ramaphosa is expected to take over from incumbent president Jacob Zuma by 2019, but a departure date for Zuma has not been confirmed 6 Hours Ago | 03:35 \nSouth Africa has gained renewed optimism among investors and the international community, the country's reserve bank governor Lesetja Kganyago told CNBC Wednesday. \n\"Last year we had to reassure people that things will be okay in South Africa,\" Kganyago said from the World Economic Forum at Davos. \"What we've seen now is there have been decisive steps taken by the government to deal with the reform agenda, renewed optimism about South Africa, and I found my agenda packed with people who would like to talk to us because they now see South Africa as the big opportunity in 2018.\" \nSouth Africa has been at the center of fresh international attention as it attempts to transition away from years of corruption and economic decay. The election of businessman-turned-politician Cyril Ramaphosa as leader of the country's ruling African National Congress (ANC), over incumbent president Jacob Zuma, in December was an indictment of the current state of affairs. \nThe ANC, which freed the country from apartheid in the 1990s, has lost substantial popularity thanks to its reputation for endemic corruption and graft. Though only a slim win, Ramaphosa's victory represents the desire of many in the party to pursue change and reform. Waldo Swiegers/Bloomberg via Getty Images Lesetja Kganyago, governor of the South African Reserve Bank. \n\"It's not just the IMF (International Monetary Fund) and business community that wants the structural reform to take place. Mr. Ramaphosa as deputy president of the country has moved with speed to (make) changes,\" Kganyago said, citing Ramaphosa's move last week to overhaul the country's beleaguered state electricity utility Eskom. \"As deputy president, he has executive power.\" \n\"Business confidence is returning. In the previous year, businesses almost had to beg to meet with government,\" he went on. \"Now you see government reaching out to business.\" \nObservers nonetheless question the viability of a sweeping reform agenda. Ramaphosa, who is expected to be elected president by 2019, must take on a entrenched network of patronage and bribery built over the nine years of Zuma's rule. \nAny further confidence from the business community may be dependent on when Ramaphosa actually takes over from Zuma, a date which has yet to be confirmed. ANC members have been discussing removing Zuma but have not settled on a departure date.South Africa ranks 82 out of 190 in the World Bank's 2018 \"Ease of Doing Business\" ranking, coming in several spots behind Ukraine, Uzbekistan and Albania. Its unemployment rate stands at nearly 28 percent. show chapters ", "external_links": [], "published": "2018-01-24T10:44:00.000+02:00", "crawled": "2018-01-24T12:49:48.000+02:00", "highlightTitle": ""}