{"organizations": [], "uuid": "43c7170f9525136b2ef9f741a2b9968e9b5a99e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WV339_booksh_SOC_20180103150341.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7201.xml", "section_title": "WSJ.com: Lifestyle", "url": "https://www.wsj.com/articles/three-books-that-prove-timing-actually-is-everything-1515166460", "country": "US", "domain_rank": 387, "title": "Three Books That Prove Timing Actually Is Everything", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T17:34:00.000+02:00", "replies_count": 0, "uuid": "43c7170f9525136b2ef9f741a2b9968e9b5a99e5"}, "author": "Jason Diamond", "url": "https://www.wsj.com/articles/three-books-that-prove-timing-actually-is-everything-1515166460", "ord_in_thread": 0, "title": "Three Books That Prove Timing Actually Is Everything", "locations": [], "entities": {"persons": [{"name": "matthew hranek", "sentiment": "negative"}, {"name": "tom sachs", "sentiment": "none"}, {"name": "paul newman", "sentiment": "none"}], "locations": [{"name": "rolex daytona", "sentiment": "none"}], "organizations": [{"name": "casio", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2 COMMENTS Photo: Joshua Scott for The Wall Street Journal A Man and His Watch By Matthew Hranek \nElevator pitch: From the $40 Casio G-Shock worn for decades by sculptor Tom Sachs to the Rolex Daytona that Paul Newman wore behind the wheel (on which his wife inscribed the warning “Drive Slowly”), Matthew Hranek reminds us that timepieces are more than just instruments with which we watch the hours slip by; each has its own tale. \nVery brief excerpt: “I used to cut out my favorite watches from magazines, tape them around my wrist, and wear them in the privacy of my own room. With a little imagination I could have any watch I wanted—as long as I could find a picture of it.” \nSurprising factoid: One of the modest watches featured, a glow-in-the-dark Timex, was given to a Hollywood maître d’ by Bill Murray (from his own wrist) when he noticed the man’s classic Baume & Mercier watch was ”no good in the dark.” \nPhoto: Joshua Scott for The Wall Street Journal When: The Scientific Secrets of Perfect Timing By Daniel H. Pink \nElevator pitch: Minutes are precious—and easier than ever to waste. Daniel H. Pink’s deeply researched but never boring study could be a turning point. College students and business managers alike may find new ways to organize their schedules and ease difficult decisions by using the “hidden pattern” of time to their advantage. \nVery brief excerpt: “Our lives present a never-ending stream of when decisions—when to change careers, deliver bad news...or get serious about a project or person. But most of these decisions emanate from a steamy bog of intuition and guesswork.”\nSurprising factoid: Someone who gets married at 25 years old is 11 percent less likely to get divorced than someone married at age 24. But after age 32, the odds of divorce increase by 5 percent each year “for at least the next decade.” \nPhoto: Joshua Scott for The Wall Street Journal Why Time Flies: A Mostly Scientific Investigation By Alan Burdick \nElevator pitch: Ever wondered why time seems to move so fast? In this witty, relatable exploration, New Yorker writer Alan Burdick probes for scientific answers but settles for the philosophical: Time is an enigma even the brightest of us may never comprehend. Still, he gives us reason to think deeply about how this precious resource tick away. \nVery brief excerpt: “The most commonly used noun in American English is time. But if you ask a scientist who studies time to explain what time is, he or she invariably will turn the question on you: ‘What do you mean by time?’”\nSurprising factoid: Every country has a “master clock” at the International Bureau of Weights and Measures in Paris. Some clocks don’t exactly agree, but these discrepancies are a matter of a few nanoseconds—or billionths of a second.\nMore in Gear & Gadgets \nWhy You Don’t Actually Need All That Camera Gear January 4, 2018 New Year’s Fitness Resolutions: The Smartest Way to Keep Them January 3, 2018 An Open-Office Survival Plan December 28, 2017 How to Streamline the 6,714 Photos Cluttering Your Phone December 13, 2017 We Tried It: Instant Coffee for Coffee Snobs December 11, 2017", "external_links": [], "published": "2018-01-05T17:34:00.000+02:00", "crawled": "2018-01-05T21:05:39.015+02:00", "highlightTitle": ""}