{"organizations": [], "uuid": "1c76171199f0092022c55c90dc5e451fcbaade6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/venezuela-politics-perez/venezuelan-authorities-surround-self-identified-rogue-helicopter-pilot-idINKBN1F41TG", "country": "US", "domain_rank": 408, "title": "Venezuelan authorities surround self-identified rogue helicopter pilot", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:19:00.000+02:00", "replies_count": 0, "uuid": "1c76171199f0092022c55c90dc5e451fcbaade6a"}, "author": "", "url": "https://in.reuters.com/article/venezuela-politics-perez/venezuelan-authorities-surround-self-identified-rogue-helicopter-pilot-idINKBN1F41TG", "ord_in_thread": 0, "title": "Venezuelan authorities surround self-identified rogue helicopter pilot", "locations": [], "entities": {"persons": [{"name": "oscar perez", "sentiment": "none"}, {"name": "perez", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "caracas", "sentiment": "none"}, {"name": "el junquito", "sentiment": "none"}, {"name": "caracas", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "national guard", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CARACAS (Reuters) - Venezuelan authorities on Monday arrested five members of a “terrorist cell” linked to self-proclaimed rogue Venezuelan helicopter pilot Oscar Perez, and killed several other militants during a shootout in a poor area outside Caracas.\nPerez appeared with a bloody face in nearly a dozen dramatic Instagram videos early on Monday, saying that he was surrounded by authorities shooting at him with grenade launchers.\nState television later read out an official statement that said two police officers were gunned down in the clashes but did not specify Perez’ fate.\nA former police pilot, Perez is wanted for using a stolen helicopter to lob grenades and shoot at government buildings in June as well as for breaking into a National Guard unit in December to steal weapons.\nPresident Nicolas Maduro’s leftist government has described him as a “fanatic, extremist terrorist” and a manhunt has been under way for months. Some Maduro critics have questioned whether Perez’ attacks were staged in cahoots with the government to justify a further crackdown on the opposition.\nAuthorities finally tracked Perez down in the poor hillside neighborhood of El Junquito on Monday.\n“We’re wounded ... they’re killing us!” said Perez in one video, seemingly wearing a bulletproof vest as he crouched in what appeared to be a small house. Gunshots were heard in the background.\n“Venezuela, don’t lose hope... Now only you have power so that we can all be free,” he said in an earlier video, staring into the camera and telling his children he loves them and hopes to see them again.\nHis last video was posted about 10:30 am (0230 GMT). A Reuters witness in the area later saw an ambulance speed by and said gunshots were no longer heard.\n‘CAUGHT LIKE A RAT’\nThe Information Ministry did not immediately respond to a request for comment.\nMembers of Maduro’s government scoffed at Perez on Monday.\n“What a coward now that he’s caught like a rat!” tweeted Prisons Minister Iris Varela. “Where is the courage he had to attack military units, kill and injure officials and steal weapons?”\nPerez, who also has been an action film star and portrays himself as a James Bond or Rambo-like figure on social media, has added surreal twists to Venezuela’s long-running political drama.\nHe rose to fame in June after allegedly hijacking a police helicopter, flying over Caracas’ center and firing shots at and lobbing grenades on the Interior Ministry and the Supreme Court.\nPerez claimed responsibility for the attack, saying it was to fight what he said was a tyrannical government. He went into hiding afterward, only to pop up two weeks later at an opposition vigil for anti-government protesters killed during demonstrations that rocked the country last year.\nIn December, a video posted on Perez’s YouTube account shows armed, masked men taking control of military barracks under cover of night.\nThey smashed photos of Maduro and his predecessor, the late Hugo Chavez, handcuffed about a dozen soldiers and berated them for supporting “dictatorship” in Venezuela. Perez says his team stole about 26 AK-103’s and more than 3,000 munitions for the rifles, as well as pistols.\nOpposition politicians called for due process on Monday.\n“There is no death penalty in Venezuela,” tweeted opposition lawmaker Yajaira Forero. “We demand that Mr. Oscar Perez’ right to life be respected. If he committed a crime he must be judged by a court, as the law establishes.”\nAdditional reporting by Christian Veron, Marco Bello, Corina Pons and Eyanir Chinea; Writing by Alexandra Ulmer; Editing by Frances Kerry and Bill Trott\n ", "external_links": [], "published": "2018-01-15T16:19:00.000+02:00", "crawled": "2018-01-15T16:53:57.003+02:00", "highlightTitle": ""}