{"organizations": [], "uuid": "de4e1fe382f30f5ba5ca5b0e4951dc73eeee9abe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219389105&w=1200&r=LYNXMPEE0319M", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-cuba-eu-mogherini/top-eu-and-cuban-diplomats-herald-opening-to-closer-economic-ties-idUKKBN1ET25T", "country": "US", "domain_rank": 408, "title": "Top EU and Cuban diplomats herald opening to closer economic ties", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T20:35:00.000+02:00", "replies_count": 0, "uuid": "de4e1fe382f30f5ba5ca5b0e4951dc73eeee9abe"}, "author": "", "url": "https://uk.reuters.com/article/uk-cuba-eu-mogherini/top-eu-and-cuban-diplomats-herald-opening-to-closer-economic-ties-idUKKBN1ET25T", "ord_in_thread": 0, "title": "Top EU and Cuban diplomats herald opening to closer economic ties", "locations": [], "entities": {"persons": [{"name": "mogherini", "sentiment": "none"}, {"name": "bruno rodriguez", "sentiment": "none"}, {"name": "marc frank", "sentiment": "none"}, {"name": "federica mogherini", "sentiment": "none"}, {"name": "meneghini  rodriguez", "sentiment": "none"}], "locations": [{"name": "cuba", "sentiment": "none"}, {"name": "havana", "sentiment": "none"}, {"name": "havana", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 6:38 PM / Updated an hour ago Top EU and Cuban diplomats herald opening to closer economic ties Marc Frank 3 Min Read \nHAVANA (Reuters) - The European Union’s top diplomat met with Cuban Foreign Minister Bruno Rodriguez on Thursday, saying a landmark accord ratified in November had opened the door to broader economic ties between the Communist-ruled island and 28-nation bloc. EU foreign policy chief Federica Mogherini shakes hands with Cuba's Foreign Minister Bruno Rodriguez in Havana, Cuba, January 4, 2018. REUTERS/Alexandre Meneghini \nRodriguez and the EU’s Federica Mogherini called the provisional Political Dialogue and Cooperation Agreement a new chapter in their relations. \n“The agreement provides new potential in the fields of cooperation, trade, investment and also political dialogue,” Mogherini said in brief comments to journalists before the meeting began. \nThe officials, who have met several times over the last four years, appeared relaxed and positive in brief comments to journalists before the meeting began. \n”This is an example of goodwill and mutual respect that will lead to understanding and mutually beneficial progress in all areas despite our differences,” Rodriguez said. \nAs the U.S.-Cuba rapprochement unfolded in 2015-2016 the EU dropped all sanctions and negotiated the agreement, the first between Cuba and the EU. \nMogherini’s visit contrasts with the Trump administration’s partial rollback of a fragile detente between the old Cold War foes begun by former U.S. President Barack Obama. European Union’s diplomat Federica Mogherini speaks during a conference at the San Geronimo University in Havana, Cuba, January 3, 2018. REUTERS/Alexandre Meneghini \n“I want to express my appreciation for the very constructive dialogue we have managed to establish at the informal level so far, based on mutual respect, on human rights,” she said. \nDiplomats said the EU appeared to sense opportunity with President Raul Castro expected to retire in April and market-oriented reforms already underway. \n“I believe that Europe has the potential and interest to take an independent agenda in Cuba in economic and political matters for strategic purposes,” said a senior Latin American diplomat, who asked not to be identified. \n“Cuba does not cost so much and is very symbolic worldwide. At the same time it balances the growing Russian and Chinese influence,” he said. \nEU member countries have emerged as the most important investors in Cuba, led by Spain, France and Italy, and the bloc is the second trading partner. EU countries also account for around 30 percent of tourists who visit the country. \n“Today, Cuban commerce is so spread around the world that no single country accounts for more than 20 percent of total merchandise trade.” Richard Feinberg, an economist and expert on Latin America and Cuba at the Brookings Institution, said. \n“Strong relations with Europe fits into their international diversification strategy so as not to be dependent on anyone,” he said. Reporting by Marc Frank; Addiitonal reporting by Nelson Acosta in Havana; Editing by Frank Jack Daniel and Tom Brown", "external_links": [], "published": "2018-01-04T20:35:00.000+02:00", "crawled": "2018-01-04T20:56:39.001+02:00", "highlightTitle": ""}