{"organizations": [], "uuid": "70bd16d23a6417a5b8efb20cc7c24899ee5976ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-ssb-bank-completes-mutual-holding-company-reorganization-and-ssb-bancorp-inc-completes-related-common-stock-offering.html", "country": "US", "domain_rank": 767, "title": "SSB Bank Completes Mutual Holding Company Reorganization, and SSB Bancorp, Inc. Completes Related Common Stock Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T16:37:00.000+02:00", "replies_count": 0, "uuid": "70bd16d23a6417a5b8efb20cc7c24899ee5976ef"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-ssb-bank-completes-mutual-holding-company-reorganization-and-ssb-bancorp-inc-completes-related-common-stock-offering.html", "ord_in_thread": 0, "title": "SSB Bank Completes Mutual Holding Company Reorganization, and SSB Bancorp, Inc. Completes Related Common Stock Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "ssb bank completes mutual holding company reorganization", "sentiment": "negative"}, {"name": "ssb bank", "sentiment": "negative"}, {"name": "ssb bancorp, inc", "sentiment": "neutral"}, {"name": "ssb bank employee stock ownership plan", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "ssb bancorp", "sentiment": "none"}, {"name": "otc pink marketplace", "sentiment": "none"}, {"name": "mhc", "sentiment": "none"}, {"name": "ssb bancorp, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH, Jan. 26, 2018 /PRNewswire/ -- SSB Bank announced today that it completed its mutual holding company reorganization, and its holding company, SSB Bancorp, Inc. (the \"Company\"), completed its related common stock offering, after the close of business on January 24, 2018. As a result of the reorganization and stock offering, SSB Bank is now the wholly-owned, stock savings bank subsidiary of the Company and the Company is the 55% majority-owned subsidiary holding company of SSB Bancorp, MHC, a mutual holding company.\nThe Company's common shares are expected to begin quotation on the OTC Pink Marketplace (OTCPK) under the symbol \"SSBP\" on or about January 26, 2018.\nIn a subscription offering to depositors of SSB Bank and to the SSB Bank Employee Stock Ownership Plan, the Company sold a total of 1,011,712 shares of common stock at a price of $10.00 per share. Subscription orders submitted by supplemental eligible account holders of SSB Bank were allocated according to the allocation procedures disclosed in the Company's prospectus dated November 13, 2017. In addition, the Company issued 1,236,538 shares of its common stock to SSB Bancorp, MHC. Upon the closing of the reorganization and subscription offering, a total of 2,248,250 shares of the Company's common stock are outstanding.\nSubscribers may confirm their stock purchases by calling the Stock Information Center at 1-(877) 821-5778 (toll-free) between 10:00 a.m. and 4:00 p.m., Eastern Time, Monday through Friday, except on bank holidays. Subscribers may also confirm their stock purchases online at https://allocations.kbw.com .\nOn or about January 25, 2018, the Company's transfer agent, Continental Stock Transfer & Trust Company, intends to mail Direct Registration System (DRS) statements to subscribers who purchased shares and interest checks to subscribers who paid for their shares by check or money order.\nLuse Gorman, PC acted as legal counsel to SSB Bancorp, MHC, the Company and SSB Bank. Keefe, Bruyette & Woods, Inc. acted as marketing agent for the Company in connection with the stock offering. Kilpatrick Townsend & Stockton LLP acted as legal counsel to Keefe, Bruyette & Woods, Inc.\nAbout SSB Bank\nSSB Bank is a Pennsylvania-chartered stock savings bank and the wholly-owned subsidiary of SSB Bancorp, Inc. SSB Bank serves individuals and small businesses in Allegheny County and adjacent areas from its main office and branch office located in Pittsburgh.\nDisclosures Concerning Forward Looking Statements\nThis press release contains certain forward-looking statements about the reorganization and stock offering. Forward-looking statements include statements regarding anticipated future events and can be identified by the fact that they do not relate strictly to historical or current facts. They often include words such as \"believe,\" \"expect,\" \"anticipate,\" \"estimate,\" and \"intend\" or future or conditional verbs such as \"will,\" \"would,\" \"should,\" \"could,\" or \"may\". Forward-looking statements, by their nature, are subject to risks and uncertainties. Certain factors that could cause actual results to differ materially from expected results may include unforeseen delays in delivering DRS statements or interest checks and/or delays in the commencement of trading due to market disruptions or otherwise.\nThe shares of common stock of SSB Bancorp, Inc. are not savings accounts or savings deposits and are not insured by the Federal Deposit Insurance Corporation or any other government agency.\nView original content: http://www.prnewswire.com/news-releases/ssb-bank-completes-mutual-holding-company-reorganization-and-ssb-bancorp-inc-completes-related-common-stock-offering-300588770.html\nSOURCE SSB Bancorp, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/ssb-bank-completes-mutual-holding-company-reorganization-and-ssb-bancorp-inc-completes-related-common-stock-offering-300588770.html", "https://allocations.kbw.com/"], "published": "2018-01-26T16:37:00.000+02:00", "crawled": "2018-01-26T18:15:07.011+02:00", "highlightTitle": ""}