{"organizations": [], "uuid": "7b603fa269e9ca102efd66add42076fe48a53165", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/china", "section_title": "China | Reuters.com", "url": "https://www.reuters.com/article/us-asia-environment-waste-plastic/southeast-asian-plastic-recyclers-hope-to-clean-up-after-china-ban-idUSKBN1F504K", "country": "US", "domain_rank": 408, "title": "Southeast Asian plastic recyclers hope to clean up after China ban", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T10:10:00.000+02:00", "replies_count": 0, "uuid": "7b603fa269e9ca102efd66add42076fe48a53165"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-asia-environment-waste-plastic/southeast-asian-plastic-recyclers-hope-to-clean-up-after-china-ban-idUSKBN1F504K", "ord_in_thread": 0, "title": "Southeast Asian plastic recyclers hope to clean up after China ban", "locations": [], "entities": {"persons": [{"name": "seah kian hoe", "sentiment": "negative"}, {"name": "seah", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "johor", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "kuala lumpur", "sentiment": "negative"}, {"name": "heng hiap industries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Thomson Reuters Foundation) - When Seah Kian Hoe was just 10 years old, he would jump on the back of his parent’s small truck during school holidays and help them collect scrap, going door-to-door around neighborhoods in Malaysia’s southern state of Johor.\nTaking their haul back to the family yard, they would spend hours separating the glass bottles, aluminum cans, discarded newspapers and metal.\nSeah now employs 350 people to help him run Heng Hiap Industries, one of Malaysia’s top five plastic recycling businesses which processes about 40,000 tonnes of waste per year from both domestic and overseas suppliers.\n“Thirty five years ago, it was just scavenging - a very different era compared to now,” Seah told the Thomson Reuters Foundation. “I wanted to get into the recycling business and do it differently.”\nHeng Hiap Industries is just one of the Southeast Asian plastics recycling companies gearing up to benefit from China’s decision to ban imports of plastic waste from the start of 2018.\nBefore the ban, which shocked many in the industry, China was the world’s dominant importer of such waste. In 2016, it imported 7.3 million tonnes of waste plastics, valued at $3.7 billion, accounting for 56 percent of world imports.\nOver the past two decades, China was keen to suck in as much plastic waste as possible, helping feed its manufacturing expansion. But policy makers took action after a string of scandals involving unscrupulous players in the waste market.\nMisdemeanors included stuffing containers with mixed or toxic rubbish rather than the specific types labeled for recycling, and illegal smuggling of waste that was simply dumped in landfill.\n“Plastic China”, an award-winning documentary released in late 2016, ignited further public outrage by highlighting the human and environmental costs of the under-regulated, Wild West-style recycling industry.\nAs part of efforts to clean up China’s environment, including promoting electric cars and cutting coal use, Beijing launched a campaign against harmful “foreign garbage” last year.\nSome of the worst-hit exporters of plastic waste are based in the United States and Britain - leaving those two countries scrambling to find alternative places to take their rubbish.\n“The industry was not prepared for it,” said Surendra Patawari Borad, a businessman who runs a recycling company in Belgium and the United States and chairs the plastics committee at the Brussels-based Bureau of International Recycling (BIR).\n“I used to say about Europe and the U.S., if China gets a cold, we get a fever, and if China gets a fever, we get pneumonia,” he added.\n“NO COMPLAINING”\nUnable to send their plastic waste to China, Britain and the United States are now likely to increase their domestic recycling capacities in an effort to reduce exports.\nBut industry officials say this could take years and may still not be enough.\n“If anyone has a problem selling their scrap plastic right now, they should not be complaining - they should be looking at themselves because this ... has been on the cards for quite a while,” said Damien van Leuven, founder of Vanden Global, an international plastics recycling company based in Hong Kong.\nFaced with growing stockpiles of plastic waste, many British and U.S. companies are either burning some plastics for energy recovery or sending the materials to landfill, several industry researchers told the Thomson Reuters Foundation.\nBoth of these methods will have a catastrophic impact on the environment, they warned.\n“Do they (China) care about the global environment or only their own environment because we are land-filling perfectly good materials now because of the actions that they’re taking,” said Adina Renee Adler, senior director for international relations at the Institute for Scrap Recycling Industries in Washington.\nThe labor-intensive job of taking bales of plastic waste to be broken down, cleaned, separated into different plastic resins and finally made into pellets ready to be reshaped into new products is now expected to fall to Southeast Asian countries.\nMalaysia, Vietnam, Indonesia and Thailand are among the Southeast Asian countries that have attracted Chinese investors in the plastics recycling sector over the past year, keen to fill the void left in China, industry officials said.\nMost have yet to develop their own domestic recycling collection and public awareness about the issue, but their access to cheap labor and close proximity to China’s manufacturing industries work in their favor.\nTIME TO REGULATE Preliminary data from the BIR, shared with the Thomson Reuters Foundation, showed imports of plastic waste into Southeast Asia are already rising fast.\nDue partly to a ramp-up in shipments in the final quarter of last year, the BIR estimates that annual imports of plastic scrap into Malaysia jumped to 450,000-500,000 tonnes in 2017 from 288,000 tonnes in 2016.\nVietnam’s imports rose by 62 percent to 500,000-550,000 tonnes for 2017, while Thailand and Indonesia showed increases of up to 117 percent and 65 percent respectively.\nThe industry fears, however, that a flood of unregulated plastic waste to these countries could lead to similar problems as those experienced in China, resulting in copy-cat bans.\nTo avoid this, industry officials urged Southeast Asian nations to tighten health and safety regulations, so that they can properly monitor what plastics enter their countries, and stop illegal practices.\nGreenpeace East Asia plastics campaigner Liu Hua wants to see companies use less plastic packaging in the longer-term, but for now, Southeast Asian governments should strengthen environmental controls to limit the spread of hazardous chemical waste and any negative impact on human health, he said.\nSteve Wong, executive president of the China Scrap Plastics Association, called for stronger controls on imports, license issuance and environmental inspections of factories.\nTo date, the world has produced more than 8 billion tonnes of plastic, said Borad at the BIR. Only 9 percent has been recycled, while just under 80 percent has been treated as waste - sent to landfill sites or dumped in the oceans.\nAs awareness rises over the dangers of allowing plastic waste to end up in the sea where it poisons fish and can enter the human food chain, recycling capacity will need to grow considerably worldwide.\nIn Malaysia, Seah remembers how his parents were once ashamed they made a living from collecting and reusing scrap, believing it to be a profession that was not respected.\nBut when his recycling company received an international award for environmental leadership in 2013, it helped change their minds. Southeast Asian nations now face a similar battle to shift perceptions of the recycling industry.\n“I don’t believe there is a global plastics pollution problem - there is a global plastics ignorance problem,” said Seah. “It is a substance with a lot of hidden values.”\nReporting by Michael Taylor, editing by Megan Rowling; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T10:10:00.000+02:00", "crawled": "2018-01-16T10:13:33.024+02:00", "highlightTitle": ""}