{"organizations": [], "uuid": "10ef2256cbd552b035557a40a1dfc3ef4b5dbe3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-hilltop-holdings-relocates-consolidates-corporate-headquarters-within-dallas.html", "country": "US", "domain_rank": 767, "title": "Hilltop Holdings Relocates, Consolidates Corporate Headquarters within Dallas", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "10ef2256cbd552b035557a40a1dfc3ef4b5dbe3b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-hilltop-holdings-relocates-consolidates-corporate-headquarters-within-dallas.html", "ord_in_thread": 0, "title": "Hilltop Holdings Relocates, Consolidates Corporate Headquarters within Dallas", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas dallas", "sentiment": "none"}, {"name": "dallas uptown", "sentiment": "none"}, {"name": "victory park", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "hilltop holdings inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "crescent court", "sentiment": "none"}, {"name": "hilltop holdings", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS--(BUSINESS WIRE)-- Dallas-based Hilltop Holdings Inc. (NYSE: HTH) announced that it has relocated its corporate headquarters from 200 Crescent Court in the Dallas Uptown area to a larger office space at One Victory Park, just northwest of downtown Dallas. The financial holding company also has consolidated its executive team and many of its corporate support functions at the new location.\nHilltop Holdings has experienced substantial growth in recent years, completing extensive acquisitions and operational integrations, as well as an organization-wide restructuring. Growth at the corporate level has coincided with the expansion of the company’s operations to ensure an appropriate and scalable holding company structure to effectively manage an organization of Hilltop Holding’s size. Since early 2013, the company has grown by 39 percent to approximately 5,500 employees nationwide. For the same period, headcount at the holding company increased by 93 percent to 145 employees, as staffing needs have grown in key functional areas such as human resources, accounting, information technology, and risk management.\nAccording to Jeremy B. Ford, Hilltop Holdings president and co-CEO, the decision to relocate the corporate headquarters best serves the company’s employees and shareholders.\n“The benefit in relocating and consolidating many of our corporate operations at a single, larger location is the ability to improve communication, collaboration, and efficiency,” said Ford. “The location at One Victory Park allows us increased space to accommodate our growth.”\nThe 29,000-square-foot headquarters was existing space leased by the company. Additionally, one of Hilltop Holding’s subsidiaries, PlainsCapital Bank—a regional, Texas-based commercial bank—currently occupies approximately 20,000-square-feet of office space in the same building, including a branch location. Hilltop Holding’s top management had operated at its previous headquarters location since 2007.\n“This move was really designed to help further our efforts to build a common corporate culture and execute a common strategy,” said Hilltop Holdings Vice Chairman and Co-CEO Alan B. White. “This is simply one more step in our drive to be a more competitive player in the financial markets we serve, focused on profitable and successful operations.”\nHilltop Holdings is ranked No. 34 on the Forbes 2017 Best Banks in America listing of the top 100 largest publicly traded banks and thrifts and ranks No. 4 among Texas-based banks.\nAbout Hilltop Holdings Inc.\nHilltop Holdings is a Dallas-based financial holding company. Its primary line of business is to provide business and consumer banking services from offices located throughout Texas through PlainsCapital Bank. PlainsCapital Bank’s wholly owned subsidiary, PrimeLending, provides residential mortgage lending throughout the United States. Hilltop Holdings’ broker-dealer subsidiaries, Hilltop Securities Inc. and Hilltop Securities Independent Network Inc., provide a full complement of securities brokerage, institutional and investment banking services in addition to clearing services and retail financial advisory. Through Hilltop Holdings’ other wholly owned subsidiary, National Lloyds Corporation, it provides property and casualty insurance through two insurance companies, National Lloyds Insurance Company and American Summit Insurance Company. At September 30, 2017, Hilltop employed approximately 5,500 people and operated approximately 475 locations in 44 states. Hilltop Holdings' common stock is listed on the New York Stock Exchange under the symbol \"HTH.\" Find more information at Hilltop-Holdings.com , PlainsCapital.com , PrimeLending.com , NationalLloydsInsurance.com and HilltopSecurities.com .\nFORWARD-LOOKING STATEMENTS\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements anticipated in such statements. Forward-looking statements speak only as of the date they are made and, except as required by law, we do not assume any duty to update forward-looking statements. Such forward-looking statements include, but are not limited to, statements concerning such things as our plans, objectives, strategies, expectations and intentions and other statements that are not statements of historical fact, and may be identified by words such as “anticipates,” “approximately,” “believes,” “could,” “estimates,” “expects,” “focused,” “forecasts,” “goal,” “intends,” “may,” “might,” “plan,” “probable,” “projects,” “seeks,” “should,” “target,” “view” or “would” or the negative of these words and phrases or similar words or phrases. For a discussion of certain factors that could cause our actual results to differ materially from those described in the forward-looking statements, please see the risk factors discussed in our most recent Annual Report on Form 10-K and subsequent Quarterly Reports on Form 10-Q and other reports that are filed with the Securities and Exchange Commission. All forward-looking statements are qualified in their entirety by this cautionary statement.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005195/en/\nHilltop Holdings Inc.\nBen Brooks, 214-252-4047\nben.brooks@hilltop-holdings.com\nSource: Hilltop Holdings Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fplainscapital.com%2F&esheet=51738873&newsitemid=20180108005195&lan=en-US&anchor=PlainsCapital.com&index=3&md5=52f5d79761990ce995d8e9b6cd8e1a61", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.primelending.com%2F&esheet=51738873&newsitemid=20180108005195&lan=en-US&anchor=PrimeLending.com&index=4&md5=14c34b64b3f9c0483443d02682db3279", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.nationallloydsinsurance.com%2F&esheet=51738873&newsitemid=20180108005195&lan=en-US&anchor=NationalLloydsInsurance.com&index=5&md5=542f0988066fb35cfe0231f373e8e8e7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.hilltop-holdings.com%2F&esheet=51738873&newsitemid=20180108005195&lan=en-US&anchor=Hilltop-Holdings.com&index=2&md5=c9e012730d632aaa39fb2e8739a6ff10", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.forbes.com%2Fsites%2Fkurtbadenhausen%2F2017%2F01%2F10%2Ffull-list-ranking-americas-100-largest-banks%2F%23320a773f4c5a&esheet=51738873&newsitemid=20180108005195&lan=en-US&anchor=Forbes+2017+Best+Banks+in+America&index=1&md5=fa0d2d042620cdbc6ba39f6f8c0c2380", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.hilltopsecurities.com%2F&esheet=51738873&newsitemid=20180108005195&lan=en-US&anchor=HilltopSecurities.com&index=6&md5=ab448ca208448efe53d4d35ac3e399bc", "http://www.businesswire.com/news/home/20180108005195/en/"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:07:03.010+02:00", "highlightTitle": ""}