{"organizations": [], "uuid": "88e075c923288bad3feecd8b746de2be68426079", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-seattle-based-maven-to-acquire-oakland-based-hubpages-digital-media-deal-to-dramatically-accelerate-mavenas-growth.html", "country": "US", "domain_rank": 767, "title": "Seattle-Based Maven to Acquire Oakland-Based HubPages: Digital Media Deal to Dramatically Accelerate Maven’s Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-05T18:30:00.000+02:00", "replies_count": 0, "uuid": "88e075c923288bad3feecd8b746de2be68426079"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-seattle-based-maven-to-acquire-oakland-based-hubpages-digital-media-deal-to-dramatically-accelerate-mavenas-growth.html", "ord_in_thread": 0, "title": "Seattle-Based Maven to Acquire Oakland-Based HubPages: Digital Media Deal to Dramatically Accelerate Maven’s Growth", "locations": [], "entities": {"persons": [{"name": "james heckman", "sentiment": "none"}, {"name": "josh jacobs", "sentiment": "none"}, {"name": "paul edmondson", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}], "organizations": [{"name": "mven", "sentiment": "negative"}, {"name": "maven inc.", "sentiment": "negative"}, {"name": "sec", "sentiment": "none"}, {"name": "hubpages", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE--(BUSINESS WIRE)-- Maven Inc. (ticker symbol MVEN ) agreed to acquire HubPages in a union that will bring together more than 40 million monthly unique users together in a single premium digital media network, the two companies announced after signing a letter of intent. The transaction is expected to close within 90 days.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180105005535/en/\nMaven CEO James Heckman (top left); HubPages CEO Paul Edmondson (right); and Maven executive co-chair Josh Jacobs (bottom left). (Graphic: Business Wire)\nHubPages’ network will be migrated to Maven’s publishing and community platform, relaunched as part of a single premium network, on one platform for advertisers.\nMaven will acquire HubPages for a combination of stock, short-term debt and cash, with the stock based on a valuation of $2.50 per common share. The acquisition is subject to final documentation and fulfilling a number of conditions including SEC requirements.\nIn addition to the acquisition of HubPages, Maven today announced it separately reached agreement on a private placement of its common stock, accepting a subscription for 1.2 million shares at $2.50 per share, for total gross proceeds of $3 million. The shares are restricted and may be registered at a later date. Net proceeds after issuance costs will be approximately $2.95 million.\nWHY UNITE AND WHY NOW?\nMoving the network to Maven, a market-tested, state-of-the-art platform is expected to improve traffic, engagement, and monetization. This represents an instant acceleration of growth within Maven’s existing model, adding thousands of content creators and tens of millions of users. The two companies’ missions, vision and culture align perfectly. Two veteran leadership teams have long track records architecting global scale, digital media products, still used today by hundreds of millions and the two founding teams have, respectively, worked 20 years together -- each with tenure in senior executive and engineering roles at MSFT, Yahoo!, Fox, Myspace, Google, Omnicom and various startups as founders. A unified network of 40+ million, 100% organic unique users, on a single platform architected on a pristine canvas of high quality content, creates a world class setting for top brands and marketers.\nWHAT IS THE TIMELINE FOR INTEGRATION OF HUBPAGES INTO MAVEN?\nThe companies plan to cooperate and interoperate immediately on advertising. Migration of the 27 premium channels to Maven’s platform will happen one at a time, over the next year, after testing and developing the migration plan. HubPages will remain an important “cultivating” network, at HubPages.com .\nKEY COMPONENTS OF THE AGREEMENT\nAn acquisition through a combination of stock, short-term debt and cash. Stock valued at $2.50/share, for equity grants to HubPages management. For founders and key personnel, the majority of the payout comes in stock,earned over 36 months, weighed exclusively on the last 24 months.\nCOMPATIBILITY\nMaven is invite-only and HubPages is a fully-owned, tightly controlled network. Both networks remain committed to premium, professional, passion-based niche channels operating efficiently on a single platform.\nWHAT DOES THIS MEAN FOR MAVEN’S STRATEGY?\nThis acquisition of HubPages is perfectly aligned with Maven’s existing strategy and moves it forward at least two years from a scale and content contributor standpoint. This move increases our current scale by 800%, offering consumers, as well as marketers, an exciting, broad offering of professional content and a massive community.\nWHAT ARE THE KEY NUMBERS THAT HUBPAGES BRINGS TO MAVEN?\nOver 35 million monthly UU's through 27 domains 6,000 monthly contributors 655,000 published articles within the network\nSince launching last summer, Maven’s network monthly unique users climbed from zero to 5 million on 34 live channels, without marketing investment or Traffic Acquisition Costs (TAC) -- with publishers experiencing an average uplift in audience engagement of 71%, after migrating to Maven’s platform.\nQuote: FROM PAUL EDMONDSON, HUBPAGES CEO:\n“The HubPages team is thrilled to be joining Maven. We are combining decades of experience creating platforms and services that allow passionate people to discover, create and connect across an integrated set of state-of-the-art technologies with monetization capabilities only accessible to the most sophisticated publishers. Maven's innovative technology includes native mobile apps, integrated video, subscription management and community engagement tools. We're talking about scalable architecture that is truly unique. This is a huge step in our evolution to combine Maven's focus on elite, independent publishers with the passionate experts from HubPages Network.”\nQuote: FROM JAMES HECKMAN, MAVEN CEO\n“The long-term excellence of, and audience loyalty to, HubPages’ content channels speaks to the value of the company and why we are aligned so well. Maven is an engineering company at its core and our founders are key architects of digital products that continue to reach hundreds of millions of users. The culture and history of our two companies match perfectly: long-term commitments to each other and a passion for creating tools that empower elite, passionate content producers.”\nQuote: FROM JOSH JACOBS, MAVEN EXECUTIVE CO-CHAIRMAN\n“Real content, and real, passionate, organic audiences are more important than ever to delivering effective advertising. HubPages adds true organic, massive scale and topical coverage to Maven’s core strategy of aggregating independent, niche, passion-based content channels, on a single modern advertising platform. With this acquisition, Maven is ready to offer the authentic content and real consumer engagement that is so attractive to advertisers.”\nFurther Details of Private Placement Subscription for 1.2 million Shares at $2.50 per Share\nOn January 4, 2018, theMaven, Inc. accepted a subscription on a securities purchase agreement with a purchaser, for the sale by the Company of an aggregate of 1,200,000 shares of common stock of the Company, par value $0.01 per share, at a price of $2.50 per share. The net proceeds after estimated issuance costs are approximately $2,950,000.\nThe stock chart above shows the Company’s monthly high trading price and the prices at which the Company has sold stock in private placements in April 2017 ($1.0 per share), October 2017 ($1.15 per share) and January 2018 ($2.50 per share), after an initial merger price of 16 cents, October 2016.\nABOUT MAVEN\nThe Platform\nThe Maven platform is the product of tens of thousands of hours of focused work by a team of experienced engineers from Google, Yahoo!, Microsoft, Scout, Comcast, aQuantive, Apple and Amazon, with a deep commitment to the needs of digital publishers, offering:\nCompetitive tools to publish stories and video Distribution via social media and search, also supporting Facebook Instant Articles, Google Accelerated", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.bloomberg.com%2Fquote%2FMVEN%3AUS&esheet=51738492&newsitemid=20180105005535&lan=en-US&anchor=MVEN&index=1&md5=3b1bf1b3e4560c1b68e60d840b218fe0", "http://www.businesswire.com/news/home/20180105005535/en/"], "published": "2018-01-05T18:30:00.000+02:00", "crawled": "2018-01-05T20:22:52.009+02:00", "highlightTitle": ""}