{"organizations": [], "uuid": "3d5f729f4b9e74c6b7c5105d12c24a230711689e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 223, "shares": 223, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/20/104909329-black_and_white.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/cinespace-film-studios-is-revitalizing-downtown-chicago.html", "country": "US", "domain_rank": 767, "title": "Cinespace Film Studios is revitalizing downtown Chicago", "performance_score": 2, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.181, "site_type": "news", "published": "2018-01-03T16:24:00.000+02:00", "replies_count": 0, "uuid": "3d5f729f4b9e74c6b7c5105d12c24a230711689e"}, "author": "Susan Caminiti", "url": "https://www.cnbc.com/2018/01/03/cinespace-film-studios-is-revitalizing-downtown-chicago.html", "ord_in_thread": 0, "title": "Cinespace Film Studios is revitalizing downtown Chicago", "locations": [], "entities": {"persons": [{"name": "alex pissios", "sentiment": "none"}, {"name": "pissios", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "windy city", "sentiment": "none"}], "organizations": [{"name": "cinespace film studios", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com SHARES \nSometimes failure can lead to unexpected business success. That was the impetus that led to the founding of Cinespace Film Studios in Chicago , a facility owned and operated by an immigrant Greek family that has helped turn around a depressed neighborhood in the Windy City. \nThe story began in 2007 when Alex Pissios — a real estate developer — was in a bad place. The portfolio of homes and apartment buildings he had acquired throughout Chicago was suddenly worth nothing, thanks to the real estate implosion that helped usher in the financial crisis. With a wife, four young children and $11 million in debt, Pissios was facing bankruptcy and an eviction from his home. \n\"I was pretty much suicidal,\" he says matter-of-factly of that dark time in his life. Against such odds, he barely noticed the wedding invitation that arrived in the mail. A cousin in Canada was getting married, and Pissios and his family were invited. He didn't have the money to travel, but another cousin insisted he attend. \"I told my wife, 'Let's just go and get out of here for a while,'\" he recalls. \nThey say that in every life, there is a turning point, a juncture where the old ends and a new path begins. For Pissios it was his cousin's wedding. There, he struck up a conversation with Nick Mirkopoulos, an uncle he barely knew, but the man who would set his life on a course he could have never foreseen. Together they started Cinespace Film Studios in Chicago. \nNearly 20 years earlier, Mirkopoulos had started Cinespace Film Studios in Toronto, now a major studio with four locations in the city. It is known for filming many hit TV series and films, including \"Chicago,\" which won an Oscar for best picture, and \"Handmaid's Tale,\" a Hulu series that won a 2018 Golden Globe nomination for best actress. At this point, Mirkopoulos was looking to replicate that success in the United States. \nToday, Cinespace Chicago is the biggest independent movie studio outside of Hollywood. The 70-acre film campus opened for business in 2011 and is located on the site formerly occupied by the Ryerson Steel plant in Chicago's Lawndale neighborhood. This full-service studio offers 30 soundstages, production offices and more than a dozen on-lot businesses, including lighting, camera, animation, casting and post-production companies. \nCinespace is also the engine that helped put Chicago back on the map for film and TV makers after a more than 20-year absence. As a result of his uncle Nick's vision, Pissios claims Cinespace has helped create 7,500 film-related jobs since it opened and has contributed millions of dollars to the local economy. In fact, according to the Illinois Film Office, the state's film industry generated nearly $500 million in spending last year, a 51 percent increase over 2015. Much of that spending has taken place at Cinespace. \nTwo years ago it launched an incubator for filmmakers called Stage 18 to provide workspace, programming and event space to help develop the local filmmaking community. Its goal is to keep local talent from leaving for opportunities in Los Angeles and New York City. Stage 18 also organizes events such as script feedback for budding filmmakers, plus the opportunity to pitch projects to investors. Attracting Hollywood moguls \nThe studio captured the attention of Hollywood movie makers and network executives from its earliest days. A big reason was Mirkopoulos' sterling reputation. He ran Cinespace Toronto as a client-focused studio, making sure productions had what they needed at all times. But perhaps the bigger draw was the Chicago facility's size. With the explosive growth in digital platforms, the competition for studio space was becoming fierce, and Cinespace Chicago answered that need. \n\"We've become the Midwest extension of Hollywood,\" explains Steve Mirkopoulos, who took over as president and CEO of Cinespace Toronto when his brother Nick died in 2013. \"With all the increased volume coming from players like Netflix, Amazon and Hulu, they need large facilities like ours that operate in places with competitive tax rates.\" Indeed, the state of Illinois offers filmmakers a 30 percent tax credit on money spent on state goods and services, including the salaries paid to state residents. This provides enough of an incentive to draw more production to Chicago, while helping local businesses in the film industry grow. \nCinespace is now home to producer Dick Wolf's successful \"Chicago\" franchise — Chicago Med, Chicago Fire and Chicago PD all film here — as well as TV shows Empire and Shameless , and productions from Netflix, Amazon and Hulu. And since the sprawling complex launched, several feature films have been produced here, including Divergent and Batman v Superman: Dawn of Justice . NBC On set of Chicago PD at Chicago Film Studios. \nThough the Chicago and Toronto Cinespace studios are run separately, there's no question that this is a family business with deep roots. Several generations are now actively involved, and Mirkopoulos' wish before he died was that more would follow. For instance, Pissios' two brothers, Nick and Dean, are operations managers in Chicago. In Toronto, Steve has two of his adult children working in the business, as does another brother, Larry. One of his sons, Jim, is vice president of operations, and another, Mike, is head of construction. \nOf course, operating the studio as a family business creates its own challenges. Pissios says those are kept to a minimum with a strong dose of honesty, respect and clear lines of command. \"There always has to be a general, someone in charge,\" he says. \"When Nick was alive, it was him. Now it's Steve.\" \nMore from iCONIC: How this mom turned a $2,000 loan into a $260 million fortune \nTo keep things running smoothly, the company has an advisory council and established a management structure where responsibilities are clearly stated for each family member involved. The entire family has monthly management meetings and gets together to create a strategic plan each year. \"There is mutual respect, and everyone is hardworking,\" says Steve. \"We talk everything through and resolve any issues as they arise.\" A family empire begins \nOddly enough, the family's start in the film business was never planned. Mirkopoulos and his brothers arrived in Toronto from Greece in the late 1960s. Nick was an electrician and a decade later joined forces with his brothers to buy and repurpose old commercial and industrial buildings. In the mid-1980s — while Toronto's film industry was still in its infancy — Nick saw an opportunity to convert some of these old buildings to film studios. The Canadian government, recognizing the economic benefit of attracting more filmmakers to the country, began offering tax incentives to folks willing to film here. In 1988, Cinespace Toronto opened. NBC On the set of Chicago MD. \nMiles Dale is a TV and movie producer who filmed the first RoboCop television show at Cinespace Toronto in the early 1990s and recalls the brothers' positive attitude: \"I needed lots of space to shoot the series, but I didn't have a lot of money back then,\" he says. None of that mattered to Nick. \"He said, 'OK, let's do it. I want to know yo", "external_links": [], "published": "2018-01-03T16:24:00.000+02:00", "crawled": "2018-01-03T16:23:25.005+02:00", "highlightTitle": ""}