{"organizations": [], "uuid": "10e2cc56206da6a54e840aa3e4e662728a3aa442", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-highland-capital-management-expands-business-development-team-ahead-of-growth-in-distressed-credit-opportunities.html", "country": "US", "domain_rank": 767, "title": "Highland Capital Management Expands Business Development Team Ahead of Growth in Distressed Credit Opportunities", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T15:00:00.000+02:00", "replies_count": 0, "uuid": "10e2cc56206da6a54e840aa3e4e662728a3aa442"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-highland-capital-management-expands-business-development-team-ahead-of-growth-in-distressed-credit-opportunities.html", "ord_in_thread": 0, "title": "Highland Capital Management Expands Business Development Team Ahead of Growth in Distressed Credit Opportunities", "locations": [], "entities": {"persons": [{"name": "kieran brennan", "sentiment": "none"}, {"name": "laurie whetstone", "sentiment": "none"}, {"name": "highland", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}, {"name": "highland", "sentiment": "none"}], "organizations": [{"name": "highland capital management", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 26, 2018 /PRNewswire/ -- Highland Capital Management, L.P. , a global alternative investment manager, announced today the hire of two institutional business development professionals. With the additions of Laurie Whetstone, managing director, and Kieran Brennan, director, the firm expands its business development team in anticipation of increased opportunities in distressed credit, one of Highland's core competencies.\nThe firm currently operates stressed and distressed credit strategies within various portfolios across the platform. Highland established a dedicated distressed private equity fund during the last credit cycle, focusing on control-oriented investments in senior secured loans of companies in complex distressed situations. Capitalizing on opportunities that arose from the aggressive issuance of non-investment grade debt in the years prior, and employing Highland's turnaround and restructuring expertise, the fund has generated a MoC of 2.3x, ranking in the top quartile of distressed funds of a similar vintage. 1\n\"Given the size of the high yield credit market today, even minor disruptions could create considerable opportunities in the distressed space, which is one of Highland's biggest strengths,\" said Trey Parker, Highland's co-chief investment officer. \"The expanded team will connect us to the investors and allocators who understand this dynamic and recognize the need to position capital in anticipation of this opportunity.\"\nMs. Whetstone joins Highland from Bernstein Private Wealth Management, an integrated investment arm of AllianceBernstein. She brings to the role nearly two decades of experience as a trusted advisor to institutional investors and high net worth individuals. Additionally, Ms. Whetstone offers unique perspective on the needs of allocators, having served on the Affiliate Committee of the State Association of California County Retirement Systems (SACRS).\nShe is based in San Francisco.\n\"The opportunity to join Highland came at an ideal time,\" said Ms. Whetstone. \"With the vast expansion of debt markets post-crisis, we are entering an environment where Highland's deep credit and workout expertise will be invaluable.\"\nPrior to her career in the asset management industry, Ms. Whetstone served in the United States Army. During her three years of service, she earned numerous awards, including the Army Achievement Medal. She received a Bachelor of Science in applied economics from the University of San Francisco.\nMs. Whetstone is a long-standing member of both the Financial Women's Association of San Francisco and 100 Women in Finance.\nMr. Brennan joins Highland as a director in the firm's New York office. He comes to Highland from Connor, Clark & Lunn Financial Group where he served as vice president on the U.S. institutional sales team of the Canadian-based asset manager. Mr. Brennan started his career in the institutional sales and marketing group at First Eagle Investment Management. He earned a bachelor's degree in economics and English from Williams College.\n1. As of 9/30/2017. Adjusted MoC (\"Multiple of Capital\") is calculated by dividing (i) the aggregate amount of the realized and unrealized value generated by the investment less Reinvested Capital by (ii) the original Invested Capital less Reinvested Capital. Although the elimination of Reinvested Capital from the numerator and denominator in the calculation of Adjusted MoC yields a higher return figure than the calculation of MoC, the Fund believes that Adjusted MoC more accurately reflects the compounding effect on investment return of reinvesting investment capital than does the MoC, the amounts have been reinvested per the terms of the Partnership Agreement. Ranking is based on net multiples of a limited sample size of 2008 vintage distressed private equity funds that elected to be included in Preqin Private Equity Performance Benchmarks. Past performance does not guarantee future results. The multiple shown represents that of one fund and performance of other funds can differ materially.\nAbout Highland Capital Management, L.P.\nHighland Capital Management, L.P. is a multibillion-dollar global alternative investment manager founded in 1993 by Jim Dondero and Mark Okada . A pioneer in leveraged lending, the firm has evolved over 25 years, building on its credit expertise and value-based approach to expand into other asset classes. Today, Highland's diverse investment platform spans the alternatives landscape, serving both institutional and retail investors worldwide. In addition to high yield credit, Highland's investment capabilities include public equities, real estate, private equity and special situations, structured credit, and sector- and geography-specific verticals built around specialized teams. Highland is headquartered in Dallas, Texas and maintains offices in New York, Buenos Aires, São Paulo, Singapore, and Seoul. For more information visit highlandcapital.com .\nCONTACT:\nLucy Bannon | lbannon@highlandcapital.com | +1 972 419 6272\nView original content with multimedia: http://www.prnewswire.com/news-releases/highland-capital-management-expands-business-development-team-ahead-of-growth-in-distressed-credit-opportunities-300588419.html\nSOURCE Highland Capital Management, L.P.", "external_links": ["http://www.prnewswire.com/news-releases/highland-capital-management-expands-business-development-team-ahead-of-growth-in-distressed-credit-opportunities-300588419.html", "https://www.highlandcapital.com/about-us/our-leadership/", "https://www.highlandcapital.com/"], "published": "2018-01-26T15:00:00.000+02:00", "crawled": "2018-01-26T16:42:50.001+02:00", "highlightTitle": ""}