{"organizations": [], "uuid": "104219c956c3d9fde07ca508bc95ce29517e0b28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223026300&w=1200&r=LYNXMPEE0H0ZT", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-iceh-nhl/beijing-games-could-help-end-nhl-ioc-standoff-idUKKBN1F71O0", "country": "US", "domain_rank": 408, "title": "Beijing Games could help end NHL/IOC standoff", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:04:00.000+02:00", "replies_count": 0, "uuid": "104219c956c3d9fde07ca508bc95ce29517e0b28"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-iceh-nhl/beijing-games-could-help-end-nhl-ioc-standoff-idUKKBN1F71O0", "ord_in_thread": 0, "title": "Beijing Games could help end NHL/IOC standoff", "locations": [], "entities": {"persons": [{"name": "steve keating", "sentiment": "negative"}, {"name": "gary bettman", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "national hockey league", "sentiment": "none"}, {"name": "nhl", "sentiment": "none"}, {"name": "international olympic committee", "sentiment": "none"}, {"name": "ioc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 1:04 PM / Updated 6 minutes ago Beijing Games could help end NHL/IOC standoff Steve Keating 5 Min Read \n(Reuters) - Since saying “I do” to the International Olympic Committee in 1998 the National Hockey League and Winter Games have endured an often tumultuous relationship, one that ended last year in an acrimonious separation. \nIn sporting terms this had been an arranged marriage and after five consecutive Winter Games together the NHL, feeling unappreciated and taken advantage of, told the IOC their players would not compete in Pyeongchang. \nDuring protracted negotiations to get the world’s best ice hockey players to the Olympics there had been plenty of finger pointing and take-it-or-leave-it ultimatums. \nThe NHL, already convinced it could get by just fine without the exposure offered by the Olympics, relaunched its World Cup of Hockey in 2016 and made that tournament its top international commitment. \nThe jilted IOC huffed and warned NHL Commissioner Gary Bettman not to come knocking in four years time when the 2022 Olympics will be in Beijing, a market that every major sports league covets. \nWhile NHL players will not be in South Korea for the Feb. 9-25 Olympics the league has already begun flirting with China having staged their first exhibition games there last September. \nInternational Ice Hockey Federation president Rene Fasel said this month it is his mission to get the NHL back on Olympic ice while NHL Players Association head Donald Fehr said the players want to return to the Winter Games. \n“The Olympics is a unique event and it provides not only an opportunity to play at an elite level but there’s a real element of patriotism and national pride that’s involved and it matters a lot,” Fehr told Reuters. “I think that it is very likely as we go forward that getting back into the Olympics will be something the players will want to pursue.” \n“It will be a significant issue.” COLLECTIVE BARGAINING \nSignificant enough that the Olympics will be a carrot dangled when players and owners negotiate a new collective bargaining agreement sometime between now and 2022. \nIt remains to be seen what the players might be willing to give up to get back on the global stage that is offered by the Winter Games. FILE PHOTO: Donald Fehr, executive director of the National Hockey League Players Association, speaks at a news conference in New York September 12, 2012. REUTERS/Eric Thayer \nWhen the NHL dangled Pyeongchang participation in front of the NHLPA in exchange for an extension of the current CBA the proposal was flatly rejected. \n“From my personal standpoint not only do the players want to participate in it but I think that participation in the Olympic Games, if it is handled right, is a very significant potential marketing and exposure opportunity for NHL players and therefore NHL hockey,” said Fehr. “I would hope that we get to the point where that is recognised.” \nWhile the NHL saw little upside in shutting down operations for almost three weeks to accommodate Olympic participation, the 2022 Beijing Games represent a gateway into the Chinese market. \nTo grow hockey in China the NHL will need infrastructure and the Chinese government and businesses have already displayed a keen interest in helping the cause by building ice rinks. \n”I guess they (NHL) are a little late to the (China) party but better to do it right than do it fast,“ David Carter, executive director at the USC Sports Business Institute and a member of the Los Angeles Kings advisory board, told Reuters. ”They would more likely look back and rue the day they didn’t figure this thing out than looking back and saying it was a wise move to forego the Games. \n”It is a big market to penetrate and it is something that has captivated people in sport business for awhile. \n“But that doesn’t get you anywhere unless the home country is willing to spend time, money and invest capital in it.” \nThe key to getting the NHL back on board for the 2022 Games will not be as simple as the lure of tapping into a new market. \nThe NHL has long bristled at paying for the privilege of competing at the Olympics while, in their view, getting very little in return beyond the prestige and a two-week global platform for their product. \n”China is a completely different economic opportunity than South Korea,“ Neal Pilson, head of Pilson Communications and former president of CBS Sports, told Reuters. ”There was really no way to figure out any possible benefit for the NHL allowing its players to play in South Korea but the league could negotiate a much better deal for its ownership when you are talking about teams, the league, the sport growing in \nChina. \n”I know they are thinking about how they can develop hockey in that nation. \n“China is a huge opportunity for the NHL.” Editing by Frank Pingue", "external_links": [], "published": "2018-01-18T15:04:00.000+02:00", "crawled": "2018-01-18T15:13:15.000+02:00", "highlightTitle": ""}