{"organizations": [], "uuid": "42fe575ac4bb9188e9816bcd2e1853147a7825a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223407896&w=1200&r=LYNXMPEE0I1FT", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-usa-fed-quarles/u-s-regulators-have-begun-work-to-streamline-volcker-rule-fed-official-idUSKBN1F82B8", "country": "US", "domain_rank": 408, "title": "U.S. regulators have begun work to 'streamline' Volcker Rule -Fed official", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T20:10:00.000+02:00", "replies_count": 0, "uuid": "42fe575ac4bb9188e9816bcd2e1853147a7825a5"}, "author": "", "url": "https://www.reuters.com/article/us-usa-fed-quarles/u-s-regulators-have-begun-work-to-streamline-volcker-rule-fed-official-idUSKBN1F82B8", "ord_in_thread": 0, "title": "U.S. regulators have begun work to 'streamline' Volcker Rule -Fed official", "locations": [], "entities": {"persons": [{"name": "michelle price", "sentiment": "none"}, {"name": "randal quarles", "sentiment": "none"}, {"name": "lisa von ahn", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 6:16 PM / Updated 32 minutes ago Fed's Quarles details steps to ease rules from Volcker to stress tests Michelle Price 4 Min Read \nWASHINGTON (Reuters) - A top bank regulator at the U.S. Federal Reserve is planning several imminent changes that Wall Street has wanted involving capital rules, proprietary trading and a process known as “living wills” that aims to prevent taxpayer bailouts. \nDuring a speech in Washington on Friday, Randal Quarles, the Fed’s vice chair of supervision, outlined for the first time a comprehensive vision for how the Fed can go about easing rules introduced following the 2007-2009 financial crisis. \nQuarles, who was appointed to his role in October, struck a much more industry-friendly tone than his predecessor. But the former Wall Street lawyer said none of his envisaged changes would fundamentally unravel core reforms that have made the financial system more resilient. \n“Now is an eminently natural and expected time to step back and assess those efforts,” Quarles said. “It is our responsibility to ensure that they are working as intended and - given the breadth and complexity of this new body of regulation - it is inevitable that we will be able to improve them, especially with the benefit of experience and hindsight.” \nQuarles, 60, is one of several regulators appointed by Republican President Donald Trump to cut red tape in Washington with a goal of stimulating economic growth. \nThe changes include simplifying the Volcker rule, a controversial restriction on federally regulated banks using their own money to make market bets. \nThe industry complained loudly and often about the rule, which bankers say is overly burdensome and restricted activities that had little to do with causing the crisis. \nBut advocates of the Volcker rule say banks that benefit from taxpayer support through deposit insurance protections should not be making risky gambles on Wall Street. \nThe five agencies overseeing the rule are working on a proposal to “streamline” it and “create something that people can comply with and will not be excessively burdensome,” Quarles said. \nHe did not provide details of the proposal or a potential timeline and warned that simplifying the rule, which is hundreds of pages long and took nearly four years to write, represented a “substantial undertaking” that would take some work. \nRegulators are also looking at a rule known as the supplemental leverage ratio, Quarles said. The rule imposes tougher capital requirements on certain large banks based on the kinds of risks they take in their businesses. \nQuarles said a proposal to alter the ratio’s requirements should be published “relatively soon” and that he was working with the Fed board to simplify other capital requirements that deal with absorbing losses. \nHe also signaled that banks that operate primarily in the United States should get easier treatment when it comes to liquidity ratios and that annual bank stress tests should become more transparent. \nThose Fed exams, designed to gauge how a bank would cope with a sudden market shock, assess not only whether banks are adequately capitalized but whether they can devote more capital to dividends and stock buybacks. Bankers have long complained that the tests are too opaque, especially concerning the models the Fed uses. \nBut Quarles stopped short of advocating for a full disclosure of the models. \nCombined, the changes would mark a win for Wall Street, as well as smaller banks, by reducing operating and compliance costs and by potentially freeing up capital. \nThe Fed has also recently told on-the-ground bank examiners not to treat 2013 guidelines outlining restrictions on leveraged lending as a hard-and-fast rule - a subject of contention among bankers, who say examiners have imposed the guidelines as though they were the letter of the law. Reporting by Michelle Price; Writing by Lauren Tara LaCapra; Editing by Lisa Von Ahn and Cynthia Osterman", "external_links": [], "published": "2018-01-19T20:10:00.000+02:00", "crawled": "2018-01-19T20:29:00.000+02:00", "highlightTitle": ""}