{"organizations": [], "uuid": "e6bdf4e6c9b7f2705889b1be9a8df4ae0f361c84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-golden-star-achieves-2017-production-guidance-and-provides-guidance-for-2018.html", "country": "US", "domain_rank": 767, "title": "Golden Star Achieves 2017 Production Guidance and Provides Guidance for 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.45, "site_type": "news", "published": "2018-01-11T14:55:00.000+02:00", "replies_count": 0, "uuid": "e6bdf4e6c9b7f2705889b1be9a8df4ae0f361c84"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-golden-star-achieves-2017-production-guidance-and-provides-guidance-for-2018.html", "ord_in_thread": 0, "title": "Golden Star Achieves 2017 Production Guidance and Provides Guidance for 2018", "locations": [], "entities": {"persons": [{"name": "golde", "sentiment": "negative"}], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "wassa", "sentiment": "none"}, {"name": "wassa underground", "sentiment": "none"}], "organizations": [{"name": "gss", "sentiment": "none"}, {"name": "gsc", "sentiment": "none"}, {"name": "tsx", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "38% increase in gold production in 2017 compared to 2016\nTORONTO, Jan. 11, 2018 /PRNewswire/ - Golden Star Resources (NYSE American: GSS; TSX: GSC; GSE: GSR) (\"Golden Star\" or the \"Company\") is pleased to announce its production results for the fourth quarter and full year (\"FY\") of 2017 and its guidance for FY 2018.\nHIGHLIGHTS\nQ4 and FY 2017 Production Results\n38% increase in consolidated gold production in FY 2017 to 267,565 ounces compared to FY 2016 Gold production by asset in FY 2017, as follows: Wassa Main Pit: 75,736 ounces Wassa Underground Gold Mine (\"Wassa Underground\"): 61,498 ounces Prestea Open Pits: 121,757 ounces Prestea Underground Gold Mine (\"Prestea Underground\"): 8,574 ounces 34% increase in consolidated gold production in the fourth quarter of 2017 to 71,769 ounces compared to the fourth quarter of 2016. Other highlights of the fourth quarter of 2017 included: 55% increase in Wassa Underground's head grade to 4.04 grams per tonne (\"g/t\") of gold (\"Au\") compared to the third quarter of 2017 and a 78% increase compared to the fourth quarter of 2016 57% increase in gold production from Prestea Underground compared to the third quarter of 2017 Processing of ore from the Prestea Open Pits expected to continue until the end of the first half of 2018 Consolidated cash balance of $27.8 million as at December 31, 2017\nFY 2018 Guidance\nFY 2018 consolidated guidance for gold production of 230,000-255,000 ounces, focusing on higher margin ore Significant decrease in operating cost per ounce expected in 2018: FY 2018 consolidated cash operating cost per ounce 1 expected to be 11-21% lower than the midpoint of the 2017 guidance range ($820) at $650-730 FY 2018 consolidated All-In Sustaining Cost (\"AISC\") 1 per ounce expected to be 7-17% lower than the midpoint of the 2017 guidance range ($1,020) at $850-$950\nNotes:\n1. See \"Non-GAAP Financial Measures\".\nSam Coetzer, President and Chief Executive Officer of Golden Star, commented:\n\"Achieving our 2017 production guidance while simultaneously operating two underground mines in the early stages of production is a great achievement and I would like to thank our teams at both operations for their hard work and commitment. I'm particularly pleased to see the strong results from Wassa Underground in the fourth quarter of 2017, including a 55% increase in grade compared to the third quarter, and I look forward to stronger production in 2018 as we increase the mining rate further. In 2018 our primary focus will be high grade, high margin underground ounces. Although production in 2018 is anticipated to be lower than in 2017, our operating cost guidance is also significantly reduced and thus we believe this strategy delivers the best value for all of our stakeholders. We will also continue with our exploration strategy, which seeks to increase the mine lives of both Wassa and Prestea and to find additional high margin ore sources to fully utilize the excess capacity at both of our processing plants.\"\n2017 PRODUCTION RESULTS AND OPERATIONS UPDATE\nGolden Star produced 267,565 ounces of gold in FY 2017, achieving the middle of the FY 2017 consolidated production guidance range of 255,000-280,000 ounces. Consolidated gold production in the fourth quarter of 2017 increased by 34% to 71,769 ounces, compared to the same period in 2016.\nAs at December 31, 2017, Golden Star had a consolidated cash balance of $27.8 million.\nWassa Gold Mine\nGold production from the Wassa complex increased by 31% in FY 2017 to 137,234 ounces, compared to FY 2016. In the fourth quarter of 2017, gold production was 42,001 ounces, an increase of 43% compared to the fourth quarter of 2016.\nThe total ore processed by the Wassa processing plant during FY 2017 was 2.6 million tonnes at a blended grade of 1.73 g/t Au and with a metallurgical recovery of 95%.\nWassa Main Pit\nGold production from Wassa Main Pit was 75,736 ounces in FY 2017 and 21,149 ounces in the fourth quarter of 2017. As previously announced, Golden Star took the decision during the third quarter of 2017 to defer the next pushback of Wassa Main Pit, Cut 3. This followed an internal study to assess capital expenditure requirements and margins in light of the current gold price. The purpose of this change is to focus on the higher grade, higher margin underground ounces. Wassa is expected to become an underground-only operation by the end of January 2018, although 341,000 tonnes of lower grade, stockpiled ore will continue to be fed to the processing plant during the first nine months of 2018.\nWassa Underground\nGold production from Wassa Underground increased by 456% in FY 2017 to 61,498 ounces, compared to FY 2016 1 . In the fourth quarter of 2017, gold production was 20,852 ounces, representing a 165% increase compared to the fourth quarter of 2016 1 and a 31% increase compared to the third quarter of 2017. Mining rates at Wassa Underground continued to be strong in the fourth quarter of 2017 at approximately 1,900 tonnes per day (\"tpd\"), which represents a 36% outperformance compared to the planned mining rate for 2017 of 1,400 tpd. The head grade of Wassa Underground's ore being delivered to the processing plant increased by 55% in the fourth quarter of 2017 to 4.04 g/t Au, compared to the third quarter of 2017, and by 78% compared to the fourth quarter of 2016 1 .\nThe targeted mining rate for Wassa Underground in 2018 is 2,700-3,000 tpd, with the potential to expand further in time. The mining team is well-positioned to increase the tonnage profile in 2018, with the mining sequence working well and an increasing number of stopes prepared and developed. Additionally, four new underground haulage trucks were purchased and arrived on site early in the fourth quarter of 2017 and a new stope drill has been commissioned. Golden Star will provide further details of the new mine plan for the Wassa complex later in the first quarter of 2018.\nFrom the commencement of development of Wassa Underground to December 31, 2017, 8,900 metres of development had been completed and the mining operations had accessed 25 stopes.\nNotes\n1. Wassa Underground was in pre-commercial production until December 31, 2016.\nPrestea Gold Mine\nGold production from the Prestea complex was 130,331 ounces in FY 2017, which represents a 45% increase compared to FY 2016, primarily as a result of the contribution from the high grade Mampon deposit and Prestea Underground. The Prestea complex also exceeded the top end of its upwardly revised FY 2017 production guidance of 120,000-130,000 ounces. Gold production in the fourth quarter of 2017 increased by 23% to 29,768 ounces compared to the same period in 2016.\nThe total ore processed by the Prestea processing plant during FY 2017 was 1.6 million tonnes at a grade of 2.85 g/t Au, and with a metallurgical recovery of 86%.\nPrestea Open Pits\nGold production from the Prestea Open Pits increased by 36% to 121,757 ounces in FY 2017, compared to FY 2016. This represents a 74% outperformance compared to the top end of the Company's original 2017 guidance for these assets. In the fourth quarter of 2017 the mine delivered 24,723 ounces, which is a 2% increase compared to the same period in 2016.\nThe Prestea Open Pits were expected to complete gold production at the end of 2017 but it is now anticipated that mining will continue until late in the first quarter of 2018 and process", "external_links": ["http://www.sedar.com/"], "published": "2018-01-11T14:55:00.000+02:00", "crawled": "2018-01-11T15:01:30.000+02:00", "highlightTitle": ""}