{"organizations": [], "uuid": "886d605c0124fc6e2655fc21d80ea7f093f468f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-trinseo-provides-preliminary-fourth-quarter-and-full-year-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Trinseo Provides Preliminary Fourth Quarter and Full Year 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:15:00.000+02:00", "replies_count": 0, "uuid": "886d605c0124fc6e2655fc21d80ea7f093f468f0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-trinseo-provides-preliminary-fourth-quarter-and-full-year-2017-financial-results.html", "ord_in_thread": 0, "title": "Trinseo Provides Preliminary Fourth Quarter and Full Year 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "pa.", "sentiment": "none"}, {"name": "berwyn", "sentiment": "none"}], "organizations": [{"name": "performance plastics", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "adjusted ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERWYN, Pa.--(BUSINESS WIRE)-- Trinseo (NYSE: TSE), a global materials company and manufacturer of plastics, latex binders and synthetic rubber, today announced that fourth quarter and full year 2017 results are expected to exceed previously issued guidance. Net income is expected to exceed previously issued guidance by approximately $45 million with about $25 million from better than expected operating performance, primarily from higher margins and favorable net timing, and about a $20 million one-time gain in the fourth quarter related to changes made to certain Company pension plans. In addition, Adjusted EBITDA is expected to exceed previously issued guidance by approximately $35 million.\nFourth quarter 2017 net income is estimated to be between $117 million and $121 million; Adjusted EBITDA is estimated to be between $167 million and $172 million. These fourth quarter estimates are above previous guidance due primarily to higher than expected results in the Performance Plastics, Latex Binders, and Basic Plastics segments, partly offset by lower than expected performance in the Synthetic Rubber segment. In addition, the fourth quarter benefited from a favorable pre-tax net timing impact of approximately $15 million versus the minimal expected net timing impact estimate that was previously communicated.\n“We are pleased with the strong finish to 2017 and the momentum carrying us into 2018 across most of our businesses,” said Chris Pappas, Trinseo’s President and Chief Executive Officer. “Our cash generation was in line with previously communicated guidance allowing us to continue to fund growth initiatives as well as return cash to shareholders through both dividends and share repurchases.”\nFull year 2017 net income is estimated to be between $327 and $331 million; Adjusted EBITDA is estimated to be between $641 million and $646 million. Full year estimates include an approximately $30 million favorable impact from unplanned styrene monomer outages, and an approximately $25 million favorable impact from raw materials in the Latex Binders segment, both on a pre-tax basis. These impacts were partially offset by unfavorable impacts of about $15 million for an extended outage at Americas Styrenics and $10 million unfavorable net timing, both on a pre-tax basis.\nFull year 2017 cash from operations is expected to be between $387 million and $392 million and Free Cash Flow is expected to be between $240 million and $245 million. In addition, the Company used cash of approximately $89 million to repurchase nearly 1.4 million shares during the year, and approximately $24 million to repurchase 329,000 shares during the fourth quarter.\nPreviously issued guidance for the fourth quarter 2017 was net income of $68 million to $77 million and Adjusted EBITDA of $130 million to $140 million; full year guidance was net income of $280 million to $288 million and Adjusted EBITDA of $605 million to $615 million. The Company had previously expected a minimal net timing impact in the fourth quarter and an approximately $25 million unfavorable pre-tax net timing impact for the full year.\nFurther details will be communicated on Trinseo’s fourth quarter and full year financial results conference call on February 20, 2018 at 10 am eastern time.\nUnaudited financial data for the fiscal quarter and full year ended December 31, 2017 presented above are preliminary, based upon our good faith estimates and subject to completion of our financial closing procedures. We have provided ranges for our expectations described above because our fiscal quarter closing procedures are not yet complete. While we expect that our final financial results for the quarterly and full year periods ended December 31, 2017, following the completion of our financial closing procedures, will be within the ranges described above, our actual results may differ materially from these estimates as a result of the completion of our financial closing procedures as well as final adjustments and other developments that may arise between now and the time that our financial results for this quarterly and full year period are finalized. All of the data presented above has been prepared by and is the responsibility of management. This summary is not a comprehensive statement of our financial results for the quarterly period.\nNote 1: Reconciliation of Non-GAAP Performance Measures to Net income\nWe present Adjusted EBITDA as a non-GAAP financial performance measure, which we define as income from continuing operations before interest expense, net; income tax provision; depreciation and amortization expense; loss on extinguishment of long-term debt; asset impairment charges; gains or losses on the dispositions of businesses and assets; restructuring; acquisition related costs and other items. In doing so, we are providing management, investors, and credit rating agencies with an indicator of our ongoing performance and business trends, removing the impact of transactions and events that we would not consider a part of our core operations.\nLastly, we present Adjusted Net Income and Adjusted EPS as additional performance measures. Adjusted Net Income is calculated as Adjusted EBITDA (defined beginning with net income, above), less interest expense, less the provision for income taxes and depreciation and amortization, tax affected for various discrete items, as appropriate. Adjusted EPS is calculated as Adjusted Net Income per weighted average diluted shares outstanding for a given period. We believe that Adjusted Net Income and Adjusted EPS provide transparent and useful information to management, investors, analysts and other stakeholders in evaluating and assessing our operating results from period-to-period after removing the impact of certain transactions and activities that affect comparability and that are not considered part of our core operations.\nThere are limitations to using the financial performance measures noted above. These performance measures are not intended to represent net income or other measures of financial performance. As such, they should not be used as alternatives to net income as indicators of operating performance. Other companies in our industry may define these performance measures differently than we do. As a result, it may be difficult to use these or similarly-named financial measures that other companies may use, to compare the performance of those companies to our performance. We compensate for these limitations by providing reconciliations of these performance measures to our net income, which is determined in accordance with GAAP.\nFor the reasons discussed above, we are providing the following reconciliations of expected net income to Adjusted EBITDA and Adjusted EPS for the three months ended December 31, 2017, and for the full year ended December 31, 2017. See “Note on Forward-Looking Statements” below for a discussion of the limitations of these estimates. Amounts below may not sum due to rounding.\nThree Months Ended Year Ended (In millions, except per share data) December 31,\n2017\nDecember 31,\n2017\nAdjusted EBITDA $ 167 - 172 $ 641 – 646 Interest expense, net (15) (70) Provision for income taxes (26) - (27) (82) - (83) Depreciation and amortization (30) (111) Reconciling items to Adjusted EBITDA (a) 20 (51) Net Income 117 - 121 327 - 331 Reconciling items to Adjusted Net Income (a) (23) 37 Adjusted Net Income 94 - 98 364 - 368 Weighted average shares- diluted (b) 44.7 45.0 EPS (Diluted) $ 2.61 - 2.70 $ 7.28 - 7.37 Adjusted EPS $ 2.10 - 2.18 $ 8.10 - 8.18", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.trinseo.com%2Finvestor-relations%2Foverview%2Fdefault.aspx&esheet=51750485&newsitemid=20180129006101&lan=en-US&anchor=Trinseo&index=1&md5=42213e8231ac492d667ee1a905a2148d"], "published": "2018-01-30T00:15:00.000+02:00", "crawled": "2018-01-30T04:47:59.009+02:00", "highlightTitle": ""}