{"organizations": [], "uuid": "902785cf0b4fba9bc8415accb494189573abd031", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-janney-welcomes-four-new-hires-and-promotes-three-employees-in-fixed-income.html", "country": "US", "domain_rank": 767, "title": "Janney Welcomes Four New Hires and Promotes Three Employees in Fixed Income", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-04T18:00:00.000+02:00", "replies_count": 0, "uuid": "902785cf0b4fba9bc8415accb494189573abd031"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-janney-welcomes-four-new-hires-and-promotes-three-employees-in-fixed-income.html", "ord_in_thread": 0, "title": "Janney Welcomes Four New Hires and Promotes Three Employees in Fixed Income", "locations": [], "entities": {"persons": [{"name": "janney montgomery scott llc", "sentiment": "negative"}, {"name": "altman", "sentiment": "none"}, {"name": "brandon holton", "sentiment": "none"}, {"name": "holton", "sentiment": "none"}, {"name": "vivian altman", "sentiment": "none"}, {"name": "janney", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "pa", "sentiment": "none"}, {"name": "public finance", "sentiment": "none"}, {"name": "university of pennsylvania", "sentiment": "none"}, {"name": "head of public finance", "sentiment": "none"}, {"name": "barnard college", "sentiment": "none"}, {"name": "taxable fixed income group", "sentiment": "none"}, {"name": "national strategy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA--(BUSINESS WIRE)-- Janney Montgomery Scott LLC (“Janney”), a leading full-service wealth management, financial services, and investment banking firm headquartered in Philadelphia, PA, announced today that there were three promotions and four new employees hired in the firm’s Taxable Fixed Income Group in the fourth quarter of 2017.\nVivian Altman , a Managing Director, was promoted to Head of Public Finance. In this role, she will be responsible for banking, strategic planning, coordinating execution with underwriting and sales, and expanding Janney’s Public Finance presence. Ms. Altman, who previously held the role of Head of Origination and National Strategy, has been with Janney since 2009 and has over 30 years of experience in public finance. Ms. Altman earned an MA degree in Economics from the University of Pennsylvania and received a BA in Economics from Barnard College.\nBrandon Holton has been promoted to Head of CD/Structured Products Trading. Mr. Holton has been with Janney for five years, building the firm’s structured products business and overseeing the risk side of the CD/Structured business. He received his MS degree from the Georgia Institute of Technology and a BS from The University of Georgia.\nJames McCann joined Janney’s Fixed Income team as a Director on the CD/Structured Note Sales team from PMC Treasury, where he was a Derivatives Advisor and Risk Management Consultant. Prior to PMC, Mr. McCann worked at Thomson Reuters as a Director in FX, Rates and Credit. He began his career at HSBC (Hong Kong and NYC), where he held a variety of positions in Debt Capital Markets, Fixed Income Strategy and Derivatives/Structured product Sales. Mr. McCann holds a Master’s degree of Engineering (Mechanical & Manufacturing) from the Queen’s University of Belfast, Ireland.\nMark Plansky joined Janney’s Securitized Sales Group in Boston as Managing Director. He previously worked at Jefferies, where he worked in Sales while managing their Boston Sales desk. Prior to Jefferies, Mr. Plansky worked at Barclays and Lehman Brothers in their Securitized sales units. He earned his degree in Electrical Engineering from Villanova University.\nKaren Whitby joined Janney’s Fixed Income Sales team as a Managing Director on the Municipal Sales team in the New York City office. Ms. Whitby joins Janney from Citigroup, where she worked in Municipal Sales, was a member of the Diversity Committee, and received the firm’s Annual Citizenship Award. Before Citi, Ms. Whitby worked at Nuveen, where she underwrote and marketed Auction Rate Securities. She earned her degree from Temple University.\nMichael Witten has been promoted to Municipal Operations Coordinator in Janney’s Institutional Municipal Sales Group. He was previously a Middle Office Associate in the Capital Markets Operations team. He is a graduate of Penn State and has a MBA from Syracuse University.\nThomas Wren joined Janney’s Fixed Income sales team in New York City as Vice President. He formerly worked at First Southwest/Hilltop and is a graduate of University of Saint Thomas in Minnesota.\n“Janney continues to make great strides in growing its Fixed Income presence and strengthening the leadership of our already strong platform,” said Tom Bajus, Managing Director and Head of Fixed Income. “I am delighted to welcome this talented and seasoned group of industry professionals to our team. Their additions, coupled with the promotions of Vivian, Brandon and Michael, will further advance Janney’s position in the market and ensure that clients receive the highest level of service, advice, and guidance.”\nAbout Janney Montgomery Scott LLC\nJanney provides advice to individual, corporate, and institutional clients. Our expertise includes guidance about asset management, corporate and public finance, equity and fixed income investing, equity research, institutional equity and fixed income sales and trading, investment strategy, financial planning, mergers and acquisitions, public and private capital raising, portfolio management, retirement and income planning, and wealth management. Janney is an independently-operated subsidiary of The Penn Mutual Life Insurance Company, and is a member of the Financial Industry Regulatory Authority (FINRA) and Securities Investor Protection Corporation (SIPC). Additional company information is available at www.janney.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005169/en/\nJanney Montgomery Scott LLC\nAllison McDaniel, 215-665-6595\namcdaniel@janney.com\nSource: Janney Montgomery Scott LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.janney.com&esheet=51737559&newsitemid=20180104005169&lan=en-US&anchor=www.janney.com&index=2&md5=8ae4ccd7650ec7f2d60008fd11deba8e", "http://www.businesswire.com/news/home/20180104005169/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.janney.com&esheet=51737559&newsitemid=20180104005169&lan=en-US&anchor=Janney+Montgomery+Scott+LLC&index=1&md5=8ba68b56d0ddc026d30cd7a70252a611"], "published": "2018-01-04T18:00:00.000+02:00", "crawled": "2018-01-04T19:19:04.006+02:00", "highlightTitle": ""}