{"organizations": [], "uuid": "5b76a72e22a787d898951815f178da899c8a1381", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219284299&w=1200&r=LYNXMPEE030JH", "site_section": "http://feeds.reuters.com/reuters/topNews/", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-weather/blizzard-pounds-u-s-northeast-as-snow-sweeps-across-south-idUSKBN1ET11E", "country": "US", "domain_rank": 408, "title": "Blizzard pounds U.S. Northeast as snow sweeps across South", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T12:21:00.000+02:00", "replies_count": 0, "uuid": "5b76a72e22a787d898951815f178da899c8a1381"}, "author": "", "url": "https://www.reuters.com/article/us-usa-weather/blizzard-pounds-u-s-northeast-as-snow-sweeps-across-south-idUSKBN1ET11E", "ord_in_thread": 0, "title": "Blizzard pounds U.S. Northeast as snow sweeps across South", "locations": [], "entities": {"persons": [{"name": "harriet mcleod", "sentiment": "none"}, {"name": "scott malone", "sentiment": "none"}], "locations": [{"name": "u.s. northeast", "sentiment": "none"}, {"name": "s.c.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "charleston", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "tallahassee", "sentiment": "none"}, {"name": "niagara falls", "sentiment": "none"}, {"name": "u.s. east coast", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 10:22 AM / in an hour Blizzard wallops U.S. Northeast, knocks out power, snarls travel Scott Malone , Jonathan Allen 5 Min Read \nBOSTON/NEW YORK (Reuters) - A powerful blizzard battered the Northeast on Thursday, knocking out power for tens of thousands of people and snarling travel amid a long cold snap that has gripped much of the United States for more than a week and killed more than a dozen people. \nThousands of flights were canceled, firefighters scrambled to rescue motorists from flooded streets in Boston, snow plows and salt trucks rumbled along roads and highways, and New York City’s two main airports halted flights due to whiteout conditions. \nCommuters who braved the storm worried that they could be stranded later in the day. \n“I don’t know where I’ll stay tonight if I get stuck, probably with my boss,” said Ran Richardson, 55, of Malden, Massachusetts, as he waited for a Boston subway to take him to training for his job as a Chinese-English translator. \nSchools were closed through much of the region, and Boston Mayor Marty Walsh said schools in his city would remain closed on Friday. \nBlizzard warnings were in effect along the East Coast from North Carolina to Maine. The National Weather Service forecast winds up to 70 miles per hour (113 km per hour), which downed power lines. \nAlmost 80,000 homes and businesses in the Northeast and Southeast, where the storm struck on Wednesday, were without power. \nUp to 18 inches (46 cm) of snow was forecast for Boston and coastal areas of northern New England. Officials feared fast-dropping temperatures after the storm passed would turn remaining snow on roadways to ice. \nThe storm was powered by a rapid plunge in barometric pressure that some weather forecasters were referring to as bombogenesis or a “bomb cyclone” and which brought high winds and swift, heavy snowfall. \nThe wintry weather has been blamed for at least 14 deaths in the past few days, including four fatalities in North Carolina traffic accidents and three in Texas due to cold. TRAVEL WOES \nNearly 5,000 U.S. airline flights were canceled. New York’s John F. Kennedy International Airport and LaGuardia Airport temporarily halted all flights due to whiteout conditions, the Federal Aviation Administration said. A pedestrian walks through blinding snow across the Brooklyn Bridge during Storm Grayson in New York City, U.S., January 4, 2018. REUTERS/Darren Ornitz \nAt those airports, the metropolitan area’s third major airport in Newark, New Jersey, and Boston’s Logan International Airport, as many as three out of four flights were called off, according to tracking service FlightAware.com. \nPassenger train operator Amtrak ran reduced service in the Northeast. Sporadic delays were reported on transit systems, including New York state’s Long Island Rail Road and Metro-North commuter lines, as well as the Boston area’s Massachusetts Bay Transportation Authority system. \n“Years of Band-Aid solutions create nightmare situations when storm damage occurs,” said Joseph Schwieterman, a professor of public policy and specialist in transportation systems at DePaul University in Chicago. “Replacement parts are tough to find and maintenance process turns into major headache.” \nIn New York’s Fort Greene neighborhood, Mohammed Farid Khan, said his morning commute took three times as long as usual due to train woes. Slideshow (20 Images) \n“There were only local trains, no express,” Khan, 30, said as he hunched with an electric drill trying to fix the handle of his snow shovel inside the convenience store where he works. There were few customers to disturb with the noise, Khan added, saying, “It’s very slow.” ICY RESCUES \nA 3-foot (0.9-meter) tidal surge flooded the area around Boston’s historic Long Wharf with icy seawater, prompting a massive response by emergency vehicles. Firefighters used an inflatable raft to rescue one motorist from a car surrounded by water up to its door handles, Boston Fire Commissioner Joseph Finn told reporters. \nThe flooding tied a 40-year record, the National Weather Service said. \n“It’s dangerous,” Walsh said, adding that Boston officials briefly thought they would need to a evacuate a shelter near the flooded areas. “We’re keeping an eye on all those different floodings.” \nOfficials reported traffic accidents throughout the Northeast, including in Manchester, New Hampshire, where a 32-year-old woman crashed a vehicle through the wall of a nursing home, according to police. No one was injured. \nThe storm’s impact extended to eastern Canada. \nThe same storm brought historic cities in the southeastern United States their heaviest snowfall in three decades on Wednesday. Additional reporting by Colleen Jenkins in Winston-Salem, North Carolina, Brian Snyder in Boston, Brendan O'Brien in Milwaukee and Gina Cherelus and Scott DiSavino in New York; Editing by Bernadette Baum and Jonathan Oatis", "external_links": [], "published": "2018-01-04T12:21:00.000+02:00", "crawled": "2018-01-04T12:31:55.021+02:00", "highlightTitle": ""}