{"organizations": [], "uuid": "e2fb2f2ae6de5957fb375d1517eaefefba9daa67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223255137&w=1200&r=LYNXMPEE0I08Y", "site_section": "http://feeds.reuters.com/reuters/INformulaOne\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/india-economy-poll/benefit-from-gst-probably-wont-show-up-next-year-reuters-poll-idINKBN1F80HI", "country": "US", "domain_rank": 408, "title": "Benefit from GST probably won't show up next year: Reuters poll", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T08:19:00.000+02:00", "replies_count": 0, "uuid": "e2fb2f2ae6de5957fb375d1517eaefefba9daa67"}, "author": "", "url": "https://in.reuters.com/article/india-economy-poll/benefit-from-gst-probably-wont-show-up-next-year-reuters-poll-idINKBN1F80HI", "ord_in_thread": 0, "title": "Benefit from GST probably won't show up next year: Reuters poll", "locations": [], "entities": {"persons": [{"name": "shaloo shrivastava", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "gst", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 6:22 AM / Updated 15 hours ago Benefit from GST probably won't show up next year: Reuters poll Shaloo Shrivastava 3 Min Read \nBENGALURU (Reuters) - India’s economy won’t significantly benefit from a goods and services tax until after next fiscal year, according to a slim majority of economists polled by Reuters, but almost half said rewards might come sooner. \nEconomic growth is probably at its weakest pace this fiscal year since before a new calculation methodology was introduced in 2014-15, the Jan. 10-18 poll of about 30 economists found. \nDisruptions from the goods and services tax and a ban on high currency notes in November 2016 curtailed growth and manufacturing, services and consumer spending. Consequently, 15 of 28 economists said benefits from the tax wouldn’t be felt until at least the fiscal year starting April 2019. \nBut signs of a recovery in activity are appearing, and 13 of the 28 said benefits may show up next year. \nThe poll also forecast the economy would grow 6.6 percent this fiscal year and 7.3 percent next year. \n“Disruptions from the GST and demonetization are expected to start receding from Q218 (April-June quarter) and a pick-up in consumption, investment and growth shall commence,” said KK Mital, investment advisor at Venus India. \nThe latest consensus was lower than the forecast three months ago. \nAn early realisation of the benefits would bring some relief to the Reserve Bank of India, which will need to deal with higher inflation over the coming years, the poll showed. \nAfter averaging 3.7 percent this fiscal year, consumer price inflation is now expected to exceed the RBI’s medium-term target of 4 percent each quarter through mid-2019, the end of the forecast horizon. It is expected to average 4.6 percent next year. \n“Upside risks (to inflation) stem from higher oil and food prices, currency depreciation, an accelerating economy and fiscal slippage,” said Arjen van Dijkhuizen, senior economist at ABN AMRO. \nEven so, the RBI is forecast to leave interest rates unchanged until at least the middle of next year. At its last meeting in December, the central bank said inflation risks were “evenly balanced”. \nHowever, high growth and inflation numbers might prompt a change in the RBI’s neutral policy stance. The consensus forecast among 24 economists was that an inflation level of 5.5 percent would prompt the central bank to consider raising rates. \n“As long as various gauges of underlying inflation track sub-5 percent, the RBI should stay pat,” said Abhishek Upadhyay, economist at ICICI Securities PD. “A worsening of other macro stability indicators on account of higher crude prices can make the RBI cautious.” Polling by Khushboo Mittal, editing by Larry King", "external_links": [], "published": "2018-01-19T08:19:00.000+02:00", "crawled": "2018-01-19T08:53:30.000+02:00", "highlightTitle": ""}