{"organizations": [], "uuid": "d88025bcd27f3714bae9aa3b8fb93ad89d9c1ba3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-future-farm-acquires-10-acres-operating-greenhouse-in-florida-generating-2-point-8-million-in-revenue.html", "country": "US", "domain_rank": 767, "title": "Future Farm Acquires 10-acres Operating Greenhouse in Florida Generating $2.8 Million in Revenue", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-05T16:00:00.000+02:00", "replies_count": 0, "uuid": "d88025bcd27f3714bae9aa3b8fb93ad89d9c1ba3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-future-farm-acquires-10-acres-operating-greenhouse-in-florida-generating-2-point-8-million-in-revenue.html", "ord_in_thread": 0, "title": "Future Farm Acquires 10-acres Operating Greenhouse in Florida Generating $2.8 Million in Revenue", "locations": [], "entities": {"persons": [{"name": "william gildea", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}], "organizations": [{"name": "future farm technologies inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "future farm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, British Columbia, January 5, 2018 /PRNewswire/ --\nFuture Farm Technologies Inc. (the \"Company\" or \"Future Farm\") ( CSE: FFT ) ( OTCQB: FFRMF ) is pleased to announce that it has closed on the previously announced 10-acre operating greenhouse acquisition, which generated approximately $2,800,000 USD in revenue and $400,000 USD in EBITDA for 2017*. The purchase price was $3,000,000 or 1.07X revenue. The closing of this acquisition represents a major milestone for the Company as it provides substantial revenue and cash flow while positioning the Company in the emerging Florida cannabis market.\nThe business and associated 10-acre property have been approved at the county level for cultivation and processing of cannabis. \"This revenue-generating acquisition is a major milestone for Future Farm and its shareholders. Florida is the third most populous state in the USA with 20,984,000 residents and one of the fastest growing cannabis and hemp markets in the country,\" says William Gildea, Future Farm's CEO and Chairman.\nThe greenhouse is in a designated legal grow zone with proximity to Orlando, which has a local population of almost 2.5 million and attracts over 62 million visitors annually, making it a prime location. Shareholders will be excited to know that the farm is much more than a 'zoned for cannabis' piece of land, but also a fully operational greenhouse business already in full production. The greenhouse property, which has been family operated since 1959, currently grows ornamental plants sold in big-box stores throughout North America.\nThe Company intends to continue operating the greenhouse as is while it applies for licensing as a cannabis cultivator with the State of Florida. The Company is also exploring the possibility of growing hemp on the remaining acreage of farmland. A report by the Brightfield Group projects that hemp cannabis products will have $1 billion in annual sales by 2020.\nAs part of this acquisition, the Company will pay a 6% finder fee to Atlas Capital Advisors, LLC.\n* The Company cautions that the above figures for revenue and earnings are estimates only and have not been audited. Actual results may differ materially from those reported in this release.\nOn behalf of the Board,\nFuture Farm Technologies Inc.\nWilliam Gildea, CEO & Chairman\nAbout Future Farm\nFuture Farm Technologies Inc. is a Canadian company with projects throughout North America including California, Florida and Maryland. The Company's business model includes developing and acquiring technologies that will position it as a leader in the evolution of Controlled Environment Agriculture (CEA) for the global production of various types of plants, with a focus on cannabis. Future Farm provides scalable, indoor CEA systems that utilize minimal land, water and energy regardless of climate, location or time of year and are customized to grow an abundance of crops close to consumers, therefore minimizing food miles and its impact to the environment. The Company holds an exclusive, worldwide license to use a patented vertical farming technology that, when compared to traditional plant production methods, generates yields up to 10 times greater per square foot of land. The contained system provides many other benefits including 90% less water, fertilizer and land used, less travel costs, seed to sale security, scalability, consistency due to year-round production, cost control, product safety and purity by eliminating environmental variability. The Company also utilizes a leading cannabis oil extraction technology, which enables the Company to process 20lbs/hour of cannabis plant to yield approximately 908 grams/hour of oil.\nThe Company is also in the business of designing and distributing LED lighting solutions utilizing the COB and MCOB technology. The Company is focused on delivering cost efficient lighting to North America via advanced e-commerce sites the Company owns and operates. LEDCanada.com , which caters to B2B customers, is a supplier of the newest and highest demand LED solutions. The Company also owns and operates COBGrowlights.com , which caters to both large and small agriculture green houses and controlled cultivation centers.\nThe Company recently acquired the exclusive right to use a patented, augmented reality (AR) technology in the cannabis industry. As described in more detail above, the Company has decided to spin this asset off to its shareholders.\nNeither the Canadian Securities Exchange nor its Market Regulator (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release. The Canadian Securities Exchange has not in any way passed upon the merits of the proposed transaction and has neither approved nor disapproved the contents of this press release.\nThis news release may include forward-looking statements that are subject to risks and uncertainties. All statements within, other than statements of historical fact, are to be considered forward looking. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include market prices, exploitation and exploration successes, continued availability of capital and financing, and general economic, market or business conditions. There can be no assurances that such statements will prove accurate and, therefore, readers are advised to rely on their own evaluation of such uncertainties. We do not assume any obligation to update any forward-looking statements except as required under the applicable laws.\nFor further information, contact:\nWilliam Gildea,\nDirector\n+1-617-834-9467\nSOURCE Future Farm Technologies Inc.", "external_links": ["https://www.brightfieldgroup.com/"], "published": "2018-01-05T16:00:00.000+02:00", "crawled": "2018-01-05T18:03:16.001+02:00", "highlightTitle": ""}