{"organizations": [], "uuid": "1409ee946e06d046172ca2d4c479d86a32cd157b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-lisa-crutchfield-elected-to-the-main-street-america-groupas-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Lisa Crutchfield Elected to The Main Street America Group’s Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:00:00.000+02:00", "replies_count": 0, "uuid": "1409ee946e06d046172ca2d4c479d86a32cd157b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-lisa-crutchfield-elected-to-the-main-street-america-groupas-board-of-directors.html", "ord_in_thread": 0, "title": "Lisa Crutchfield Elected to The Main Street America Group’s Board of Directors", "locations": [], "entities": {"persons": [{"name": "lisa crutchfield", "sentiment": "negative"}, {"name": "tom van berkel", "sentiment": "none"}, {"name": "crutchfield", "sentiment": "none"}, {"name": "lisa", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}, {"name": "hudson", "sentiment": "none"}, {"name": "main street america", "sentiment": "none"}], "organizations": [{"name": "main street america group", "sentiment": "negative"}, {"name": "main street america group’s board of directors", "sentiment": "neutral"}, {"name": "hudson strategic advisers llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JACKSONVILLE, Fla.--(BUSINESS WIRE)-- The Main Street America Group announced today that its board of directors has elected Lisa Crutchfield as a director of the super regional property/casualty insurance carrier’s board.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180122006102/en/\nLisa Crutchfield has been elected to The Main Street America Group's board of directors. (Photo: Business Wire)\nCrutchfield is the managing principal of Hudson Strategic Advisers LLC (“Hudson”), an economic analysis and strategic advisory firm to energy companies, financial services companies and governmental agencies.\n“Lisa is a distinguished business executive and key addition to our board,” said Tom Van Berkel, Main Street America’s chairman, president and chief executive officer. “Her extensive experience leading corporate teams and providing strategic advice and guidance to the financial services industry will be an invaluable asset to Main Street America’s board of directors and our entire organization.”\nAt Hudson, Crutchfield served as the executive director and senior advisor to the CEO Council for Growth providing guidance on policy, strategy and legislative matters. Prior to leading Hudson, she served as an executive vice president of regulation and pricing for National Grid USA, an international electric and gas company in Waltham, Mass. Prior to joining National Grid, she served as senior vice president for regulatory and external affairs for PECO Energy Company, an Exelon Corporation company.\nIn addition to serving on Main Street America’s board, Crutchfield is a board director for Fulton Financial Corporation and Unitil Corporation. She has also served on numerous corporate, civic and professional association boards, including: National Grid USA, TransLink Development Corporation, the Board of Trustees for the University of Pennsylvania, the University of North Carolina at Charlotte Board of Trustees, Carolinas Healthcare System, United Way of Southeastern Pennsylvania, and the Urban League of Philadelphia.\nCrutchfield earned her bachelor’s degree in economics and political science from Yale University, New Haven, Conn., as well as her master’s degree in business administration from Harvard Business School, Boston.\nAbout The Main Street America Group\nWith roots dating back to 1923, The Main Street America Group is a mutual insurance holding company which writes business through its eight property/casualty insurance carriers: NGM Insurance Company, Old Dominion Insurance Company, Main Street America Assurance Company, MSA Insurance Company, Grain Dealers Mutual Insurance Company, Main Street America Protection Insurance Company, Spring Valley Mutual Insurance Company and Austin Mutual Insurance Company. Based in Jacksonville, Fla., Main Street America offers a wide range of commercial and personal insurance, as well as fidelity and surety bond products, to individuals, families and businesses throughout the United States.\nWith more than $1 billion in premium (sales) written exclusively by 3,000 independent insurance agents, the 94-year-old company issues over 600,000 policies in 37 states and writes more than 50,000 bonds in 47 states and the District of Columbia. A.M. Best Company rates The Main Street America Group with an \"A\" (Excellent) financial strength rating and “a+” issuer credit rating. The company has $1.13 billion in surplus (capital) and $2.7 billion in total assets.\nMain Street America is the founding company partner of Trusted Choice ® , the global branding program of the Independent Insurance Agents & Brokers of America. Main Street America is also a founding company partner of the TrustedChoice.com consumer insurance site and the Insurance Institute for Business & Home Safety (IBHS) Research Center. For more information about Main Street America, please visit our newsroom at news.msagroup.com or connect with us on Facebook at www.facebook.com/MainStreetAmerica .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006102/en/\nThe Main Street America Group\nDave Medvidofsky, 904-380-7410\nmedvidod@msagroup.com\nSource: The Main Street America Group", "external_links": ["http://www.businesswire.com/news/home/20180122006102/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.facebook.com%2FMainStreetAmerica&esheet=51746716&newsitemid=20180122006102&lan=en-US&anchor=www.facebook.com%2FMainStreetAmerica&index=1&md5=196dd1486abbd2b5f90f269a135de050"], "published": "2018-01-22T21:00:00.000+02:00", "crawled": "2018-01-22T23:35:00.037+02:00", "highlightTitle": ""}