{"organizations": [], "uuid": "32bf2304cc24e1b8da2911c2fe1e83307c881f68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-crown-holdings-announces-senior-notes-offerings.html", "country": "US", "domain_rank": 767, "title": "Crown Holdings Announces Senior Notes Offerings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2018-01-16T15:40:00.000+02:00", "replies_count": 0, "uuid": "32bf2304cc24e1b8da2911c2fe1e83307c881f68"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-crown-holdings-announces-senior-notes-offerings.html", "ord_in_thread": 0, "title": "Crown Holdings Announces Senior Notes Offerings", "locations": [], "entities": {"persons": [], "locations": [{"name": "philadelphia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "crown holdings, inc.", "sentiment": "neutral"}, {"name": "crown americas capital corp", "sentiment": "none"}, {"name": "signode industrial group holdings", "sentiment": "none"}, {"name": "crown european holdings", "sentiment": "none"}, {"name": "crown americas llc", "sentiment": "none"}, {"name": "bermuda) ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, Jan. 16, 2018 /PRNewswire/ -- Crown Holdings, Inc. (NYSE: CCK) announced today that it intends to offer aggregate principal amounts of senior unsecured notes of €600 million due 2023 and €335 million due 2026 issued by its subsidiary Crown European Holdings, and $750 million due 2026 issued by its subsidiaries Crown Americas LLC and Crown Americas Capital Corp. VI, subject to market conditions.\nCrown intends to use the net proceeds from the offerings, together with other available funds, to pay the cash consideration for its acquisition of Signode Industrial Group Holdings (Bermuda) Ltd., refinance the existing indebtedness of Signode, and pay costs and expenses related to these transactions.\nThe notes would be issued through a private placement and resold by initial purchasers to persons reasonably believed to be qualified institutional buyers under Rule 144A under the Securities Act of 1933, as amended, and to non-U.S. persons outside the United States under Regulation S of the Securities Act. The notes would not be registered under the Securities Act and could not be offered or sold in the United States absent registration or an applicable exemption from the registration requirements. This press release does not constitute an offer to sell or the solicitation of an offer to buy any security in any jurisdiction in which such offer or sale would be unlawful.\nCautionary Note Regarding Forward-Looking Statements\nExcept for historical information, all other information in this press release consists of forward-looking statements within the meaning of the federal securities laws. These forward-looking statements involve a number of risks, uncertainties and other factors, including regarding the contemplated size of the note offerings, possible completion of the note offerings, the interest rates, maturity dates and other terms of any notes that may be issued, the prospective impact of the note offerings, and plans to repay certain indebtedness which may cause the actual results to be materially different from those expressed or implied in the forward-looking statements. Other important factors that could cause the statements made in this press release to differ include, without limitation, that the note offerings are subject to a number of conditions and approvals and the final terms may vary substantially as a result of market and other conditions. There can be no assurance that the note offerings will be completed as described herein or at all. Other important factors are discussed under the caption \"Forward-Looking Statements\" in Crown's Form 10-K Annual Report for the year ended December 31, 2016 and in subsequent filings. Crown does not intend to review or revise any particular forward-looking statement in light of future events. Dechert LLP is counsel to Crown Holdings, Inc.\nMiFID II professionals/ECPs-only/No PRIIPs KID\nManufacturer target market (MIFID II product governance) is eligible counterparties and professional clients only (all distribution channels). No PRIIPs key information document (KID) has been prepared as not available to retail in EEA.\nAbout Crown Holdings, Inc.\nHeadquartered in Philadelphia, PA, Crown Holdings, Inc. is a leading manufacturer of packaging products for consumer marketing companies around the world. Crown makes a wide range of metal packaging for food, beverage, household and personal care and industrial products and metal vacuum closures and caps. For more information, visit www.crowncork.com .\nFor more information, contact: Thomas T. Fischer, Vice President, Investor Relations and Corporate Affairs, (215) 552-3720.\nView original content: http://www.prnewswire.com/news-releases/crown-holdings-announces-senior-notes-offerings-300583072.html\nSOURCE Crown Holdings, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/crown-holdings-announces-senior-notes-offerings-300583072.html", "http://www.crowncork.com/"], "published": "2018-01-16T15:40:00.000+02:00", "crawled": "2018-01-16T16:16:22.019+02:00", "highlightTitle": ""}