{"organizations": [], "uuid": "70bb70d3dd2a19414efb87eb709cbec83154eea0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/usa-fed-politics-bonds/shrinking-balance-sheet-may-protect-federal-reserve-from-losses-and-political-criticism-fed-study-idUSL1N1P31NI", "country": "US", "domain_rank": 408, "title": "Shrinking balance sheet may protect Federal Reserve from losses and political criticism - Fed study", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T07:09:00.000+02:00", "replies_count": 0, "uuid": "70bb70d3dd2a19414efb87eb709cbec83154eea0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-fed-politics-bonds/shrinking-balance-sheet-may-protect-federal-reserve-from-losses-and-political-criticism-fed-study-idUSL1N1P31NI", "ord_in_thread": 0, "title": "Shrinking balance sheet may protect Federal Reserve from losses and political criticism - Fed study", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan 8 (Reuters) - The Federal Reserve has begun shrinking its $4.4-trillion balance sheet because the U.S. economy’s recovery from the 2008 financial crisis means less need for central bank support and the Fed wants to keep its powder dry for the next recession.\nBut Fed research published on Monday says a smaller portfolio would also insulate the central bank from potential future losses on its bond holdings and any political criticism that might result from losses to the taxpayer.\nThe research by five central bank economists and an independent professor finds there would be about a 30 percent chance that the Fed would log losses on its holdings in the years ahead were it to hang on to all of its current assets.\nBut that probability falls to less than 5.0 percent if it sheds $1.3 trillion or more of so-called reserve balances, the paper found.\n“The central bank may have to deal with political economy concerns during the transition related to the volatility of remittances to the Treasury, including the possibility of experiencing net losses,” the authors wrote in the paper, which does not necessarily represent the views of senior policymakers but may provide a window into Fed thinking.\nIn each year since 2012, the Fed has sent between $79 billion and $97 billion in remittances to the U.S. Treasury. The payments are derived from profits on its bond holdings and, while they are projected to decline, they represent a quiet windfall for taxpayers thanks to the central bank’s unprecedented crisis-era decisions to prop up the economy by buying bonds.\nThe Fed had only about $900 billion in assets before the 2007-2009 financial crisis and recession, but in response it snapped up some $3.5 trillion in Treasury and mortgage bonds to encourage U.S. investment, hiring and economic growth.\nIt started gradually and passively shedding those securities in October last year as the bonds matured but policymakers have not said how far they plan to wind down the portfolio.\nIn June incoming Fed Chair Jerome Powell pointed to studies suggesting the portfolio could ultimately shrink to between $2.4 trillion and $2.9 trillion after several years.\nThe study sheds light on possible motivations as the top holder of U.S. government debt edges away from the world’s largest and most liquid market. The possibility that a big balance sheet could lead to politically-risky future net losses was one of several concerns articulated by Fed policymakers as they debated the third round of bond-buying in 2012, according to newly-released transcripts from meetings.\nThe research paper published on Monday analyzed three possibilities under the Fed’s current plan: letting a portion of assets run off until 2021 before stabilizing the portfolio; doing the same until 2022, or until 2023 when the portfolio would return to pre-crisis levels.\nAs more bonds are shed, the Fed earns less profit that can be delivered to the U.S. Treasury, but it also has to pay banks less interest on excess reserves stored at the central bank.\nOn the flip side, the more assets the Fed ultimately retains the smaller the U.S. debt-to-GDP ratio, the paper found, though it noted that depends on policy decisions by central bankers.\nThe U.S. debt-to-GDP ratio currently stands at about 106 percent, up from about 62 percent in 2006. (Reporting by Jonathan Spicer; Additional reporting by Ann Saphir; editing by Clive McKeef)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T07:09:00.000+02:00", "crawled": "2018-01-09T09:40:38.220+02:00", "highlightTitle": ""}