{"organizations": [], "uuid": "8919bd4d0935899e4bdb330cfef35e16b820b94a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/13/the-associated-press-youtube-suspends-star-over-suicide-video-doesnt-shut-door.html", "country": "US", "domain_rank": 767, "title": "YouTube suspends star over suicide video, doesn't shut door", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T21:13:00.000+02:00", "replies_count": 0, "uuid": "8919bd4d0935899e4bdb330cfef35e16b820b94a"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/13/the-associated-press-youtube-suspends-star-over-suicide-video-doesnt-shut-door.html", "ord_in_thread": 0, "title": "YouTube suspends star over suicide video, doesn't shut door", "locations": [], "entities": {"persons": [{"name": "robert kyncl", "sentiment": "none"}, {"name": "kyncl", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}], "locations": [{"name": "pasadena", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "mount fuji", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "logan paul", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PASADENA, Calif. (AP) — YouTube has suspended a star who posted video images of what appeared to be a suicide victim but said Saturday that doesn't mean it won't work with him in the future.\nThe video service announced this week that it had pulled Logan Paul's channel from its ad-supported Google Preferred platform and put two other projects on hold.\nYouTube chief business officer Robert Kyncl said Saturday there's no timetable for when Paul's future will be addressed again. Kyncl didn't shut YouTube's door on Paul.\n\"Everything is evolving so fast,\" Kyncl said. \"The best thing we can do is put all projects on hold indefinitely, and there's no date or plan for him in the future.\"\nPaul apologized for posting video of him in a forest near Mount Fuji in Japan near what seemed to be a body hanging from a tree. The location is known in Japan as a frequent site for suicides.\nYouTube said the images violated its policies. Paul pulled the images from his channel on his own.\nYouTube was criticized for moving slowly in response, taking nearly two weeks to take action. YouTube said on Twitter this week that critics were right to be frustrated by its initial lack of response.\nKyncl said Paul recognizes that he has made serious missteps and has expressed remorse for them.\n\"The most important thing to focus on is that actions speak louder than words and Logan has the opportunity to prove that,\" he said.\nRemoving Paul's work from the Google Preferred platform cuts off a significant route to advertising revenue through YouTube. YouTube also said it would not feature Paul in the fourth season of its series \"Foursome\" and would put other work on hold. Paul is one of the platform's biggest stars, with Forbes magazine estimating he earned $12.5 million last year.\nYouTube said it would soon announce steps to protect advertisers from having their products connected to controversial material.", "external_links": [], "published": "2018-01-13T21:13:00.000+02:00", "crawled": "2018-01-14T20:06:14.012+02:00", "highlightTitle": ""}