{"organizations": [], "uuid": "b5c626ba382804d9b606485dea685c2859922d8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 148, "shares": 148, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223005630&w=1200&r=LYNXMPEE0H0TN", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-backstory-alerts/how-reuters-breaks-news-by-mobile-alerts-idUSKBN1F71AX", "country": "US", "domain_rank": 408, "title": "How Reuters breaks news by mobile alerts", "performance_score": 1, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.032, "site_type": "news", "published": "2018-01-18T19:09:00.000+02:00", "replies_count": 0, "uuid": "b5c626ba382804d9b606485dea685c2859922d8e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-backstory-alerts/how-reuters-breaks-news-by-mobile-alerts-idUSKBN1F71AX", "ord_in_thread": 0, "title": "How Reuters breaks news by mobile alerts", "locations": [], "entities": {"persons": [], "locations": [{"name": "hawaii", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "hawaii emergency management agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - “EMERGENCY ALERT BALLISTIC MISSILE THREAT INBOUND TO HAWAII. SEEK IMMEDIATE SHELTER. THIS IS NOT A DRILL,” read the alert from Hawaii Emergency Management Agency shortly after 8 a.m. on Jan. 14.\nThe false alert landed on mobile phones across the state’s islands and led to nearly an hour of panic and confusion before it was corrected.\nIn our connected world, alerts sent directly to people’s phones or computers are part of everyday life. For news publishers, alerts are a major competitive battleground, presenting an opportunity to be first to break news, but Reuters did not publish the Hawaii alert, after realizing it was sent in error by an employee.\nWhen we send text messages to customers about breaking news, we first confirm the information with a primary source, such as police, fire or federal agencies. Once the news is authenticated, an editor from the Reuters web team writes a suggested headline, which is then vetted by a group of editors for clarity and brevity.\nIn the minute-to-minute news cycle, it is crucial that our alerts convey what has happened quickly, but also accurately.\nA combination photograph shows screenshots from a cell phone displaying an alert for a ballistic missile launch and the subsequent false alarm message in Hawaii January 13, 2018. REUTERS/Hugh Gentry For example, when an attack occurred in London last June, it was a Saturday evening in Britain. Reuters saw other news outlets reporting that a car mowed down pedestrians on London Bridge with loud bangs heard as well as reports of casualties in Borough Market, but we waited to send out mobile alerts until one of our journalists at the scene confirmed what he saw.\nBackstory To our readers, from the Editor-in-Chief Read about Reuters Backstory and the Trust Principles Another important decision is deciding what news is worthy of a mobile alert. It could be a massive fire, crucial economic or business data, a tsunami warning or even an exclusive story of major significance.\nDistilling a complex story to its most vital details so it can be read quickly can be challenging, especially since the alerts are one sentence.\nWhen the U.S. Congressional Budget Office released its review of a proposal to terminate payments to health insurers on Aug. 15, the report contained many datapoints, including information about the impact on insurers as well as estimates about uninsured Americans.\nReuters published an alert that we thought would have particular resonance with consumers. It said ‘Premiums for many would rise 20 percent in 2018 if Trump stops federal payments to health insurers: CBO report.’\nReporting By Lauren Young\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T19:09:00.000+02:00", "crawled": "2018-01-18T15:57:06.011+02:00", "highlightTitle": ""}