{"organizations": [], "uuid": "233208292f62987ce9a0395bf178ec66b96600f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936375-GettyImages-614543700.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/10/loreal-ceo-jean-paul-agon-on-working-for-the-company-and-how-its-embracing-digital.html", "country": "US", "domain_rank": 767, "title": "L’Oreal CEO Jean-Paul Agon on 40 years at the company, how it’s embracing digital and what’s next", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:31:00.000+02:00", "replies_count": 0, "uuid": "233208292f62987ce9a0395bf178ec66b96600f5"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/10/loreal-ceo-jean-paul-agon-on-working-for-the-company-and-how-its-embracing-digital.html", "ord_in_thread": 0, "title": "L’Oreal CEO Jean-Paul Agon on 40 years at the company, how it’s embracing digital and what’s next", "locations": [], "entities": {"persons": [{"name": "jean-paul agon", "sentiment": "negative"}, {"name": "jason alden", "sentiment": "none"}, {"name": "agon", "sentiment": "none"}], "locations": [], "organizations": [{"name": "l’oreal", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}, {"name": "l'oreal sa", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "l'oreal group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "For Jean-Paul Agon, 2018 is set to be a milestone year. Not only does it mark his 12th year as chief executive of L'Oreal Group, it is also his 40th anniversary working at the cosmetics conglomerate.\nEven after four decades, the CEO and chairman can still remember his first day \"very well,\" telling CNBC that he knew almost straightaway that the company was the right fit for him — and continues to be to this day.\n\"The great thing is that immediately I felt home in this company, after a few weeks, a few months, I felt that this company was really made for me, or I was made for this company,\" Agon told \" The CNBC Conversation .\"\n\"I've never been disappointed. It has always been an exciting journey. The most interesting thing, I believe, is that… these past two, three years have been the most exciting of all.\"\nJason Alden | Bloomberg | Getty Images Jean-Paul Agon, chief executive officer of L'Oreal SA \"The world is changing so fast and so hugely that the task of transforming the company to adapt to this new world is a fantastic task,\" he said. \"And I have to say that the company has been changing more in this past four, five years, than the 35 years before. So I find my job absolutely thrilling.\"\nL'Oreal was founded in 1909 by a chemist called Eugene Schueller , when he was formulating and manufacturing hair dyes. Fast forward to the present day and it has transformed into an international conglomerate behind such brands as Lancome, Maybelline and Garnier.\nSince 2000, L'Oreal has been focusing more and more on emerging technologies, has acquired brands including YSL Beaute and Urban Decay, and has promoted key topics such as sustainable development and diversity.\nMore than 14,000 of its 89,300 employees worldwide received digital training in 2016.\nAgon regards the fast change of pace of the digital revolution as \"fantastic\" and an era that he is finds exciting and is optimistic about.\n\"I think that we're entering into a new world and it's going to be fascinating,\" he told CNBC. \"And it's true that at L'Oreal we really want to be the pioneers of this new age, this new world. So in terms of digital, in terms of artificial intelligence, in terms of fast prototyping, in terms of everything, we want to be leading, leading the front.\"\nKristy Sparow | Getty Images Entertainment | Getty Images Details of make up products backstage prior Le Defile L'Oreal Paris as part of Paris Fashion Week Womenswear Spring/Summer 2018 at Avenue Des Champs Elysees on October 1, 2017 Even though L'Oreal is more than 100 years old, Agon is committed to it embracing the technological age in the manner of a start-up.\n\"My obsession is really to make the company ready for tomorrow. I always, since I became a CEO in 2006, I think I contributed to change many things to make L'Oreal at the forefront of sustainability, of ethics, of all this digital transformation,\" he said.\n\"So my obsession is to make sure that this company… is younger than ever. I want to run L'Oreal, it's a big company, but I want it to have the spirit of a start-up. It's a leader but I want it to have the spirit of a challenger.\n\"So it's always to be on the edge and getting ready for the future.\"\nLike this story? Like CNBC Make It on Facebook . \nDon't miss: \nWho is likely to make the headlines in 2018 \nThe incredible rags-to-riches rise of self-made billionaire Oprah Winfrey \nGwyneth Paltrow on keeping yourself grounded, and other advice for new careers", "external_links": ["http://www.loreal.com/group/history/1909-1956", "https://www.facebook.com/CNBCMakeIt/"], "published": "2018-01-10T16:31:00.000+02:00", "crawled": "2018-01-10T16:09:07.053+02:00", "highlightTitle": ""}