{"organizations": [], "uuid": "5a48c04f3992595ea41cebc1a653ff4b0992c013", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-spectrum-m-a-energizer/energizer-to-buy-spectrum-brands-unit-for-2-billion-idUSKBN1F517T", "country": "US", "domain_rank": 408, "title": "Energizer to buy Spectrum Brands unit for $2 bln", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:10:00.000+02:00", "replies_count": 0, "uuid": "5a48c04f3992595ea41cebc1a653ff4b0992c013"}, "author": "", "url": "https://www.reuters.com/article/us-spectrum-m-a-energizer/energizer-to-buy-spectrum-brands-unit-for-2-billion-idUSKBN1F517T", "ord_in_thread": 0, "title": "Energizer to buy Spectrum Brands unit for $2 bln", "locations": [], "entities": {"persons": [{"name": "munsif vengattil", "sentiment": "none"}, {"name": "saumyadeb chakrabarty", "sentiment": "none"}], "locations": [{"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "energizer", "sentiment": "negative"}, {"name": "spectrum brands", "sentiment": "negative"}, {"name": "energizer holdings inc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Battery maker Energizer Holdings Inc ( ENR.N ) said on Tuesday it would buy the battery and portable lighting business of Spectrum Brands ( SPB.N ) in a $2 billion cash deal, adding brands such as Rayovac and Varta to its lineup.\nThe deal comes two weeks after Spectrum said it was exploring strategic options, including a sale, for its global batteries and appliances businesses.\nSpectrum said it was still “actively marketing” its appliances business, which includes brands such as George Foreman cookware and Remington grooming products.\nThe deal will add heft to Energizer’s battery unit and give it more pricing power, while also expanding its international business.\nShares of Energizer, known for the Energizer and Eveready batteries, were up 15 percent in early trading on Tuesday, despite regulatory concerns given the deal will significantly increase the company’s marketshare. Spectrum’s shares were up 3.6 percent.\nSunTrust analyst William Chappell said Energizer will control more than 40 percent of the U.S. market and over 85 percent of the total market following the deal, helping it gain from improved pricing and margins in the sector.\n“We believe having the category controlled by two rational players as a ‘functional duopoly’ should yield pricing and margin benefits for both companies for years to come.”\nThe deal is expected to generate annual savings of $80 million to $100 million, and the combined company will have greater presence in EMEA and Latin America, Energizer said on a conference call.\nSpectrum’s battery and portable lighting business generated revenue of $866 million in 2017, accounting for 17 percent of the total revenue. The unit posted earnings before interest tax, depreciation and amortization (EBITDA) of $169 million.\nThe sale will allow the company to focus on its remaining businesses - hardware, auto care and pet and gardening products.\nSpectrum said it expects to use proceeds to pay down debt, reinvest in its core businesses both organically and through bolt-on acquisitions, and repurchase shares.\nBarclays was the financial adviser to Energizer, while RBC Capital Markets advised Spectrum Brands. King & Spalding was legal counsel to Energizer, while Kirkland & Ellis LLP was the legal adviser for Spectrum Brands.\nThe deal is expected to close before the end of this year, the companies said.\nReporting by Munsif Vengattil and Sanjana Shivdas in Bengaluru; Editing by Saumyadeb Chakrabarty\n ", "external_links": [], "published": "2018-01-16T13:10:00.000+02:00", "crawled": "2018-01-16T13:28:46.000+02:00", "highlightTitle": ""}