{"organizations": [], "uuid": "a9f7aa864f18fb43ac864fcf1863346f286057f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/eric2.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/03/eric-hippeau-lerer-hippeau-ventures/", "country": "US", "domain_rank": 1196, "title": "Eric Hippeau Says U.S Investors Are 'Too Conservative' | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2018-01-04T11:52:00.000+02:00", "replies_count": 0, "uuid": "a9f7aa864f18fb43ac864fcf1863346f286057f0"}, "author": "Polina Marinova", "url": "http://fortune.com/2018/01/03/eric-hippeau-lerer-hippeau-ventures/", "ord_in_thread": 0, "title": "Eric Hippeau Says U.S Investors Are 'Too Conservative' | Fortune", "locations": [], "entities": {"persons": [{"name": "eric hippeau", "sentiment": "negative"}, {"name": "masayoshi son", "sentiment": "none"}, {"name": "hippeau", "sentiment": "none"}, {"name": "lerer hippeau", "sentiment": "none"}, {"name": "warby parker", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "west coast", "sentiment": "none"}], "organizations": [{"name": "u.s investors are 'too conservative", "sentiment": "neutral"}, {"name": "birchbox", "sentiment": "none"}, {"name": "ziff-davis", "sentiment": "none"}, {"name": "lerer hippeau ventures", "sentiment": "none"}, {"name": "huffington post", "sentiment": "none"}, {"name": "softbank capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9:52 AM EST \nThis article originally ran in Term Sheet, Fortune’s newsletter about deals and dealmakers. Sign up here. \nEric Hippeau, a managing partner at Lerer Hippeau Ventures , is well-known in the venture community for his firm’s blockbuster investments including Birchbox, BuzzFeed, Casper, and Warby Parker. Two thirds of Lerer Hippeau portfolio companies are based in New York. Why? \n“New York is a center of innovation and technology, but it doesn’t have the VC support that you find on the West Coast,” he said. “There are few early-stage funds such as ours that dedicate the majority of their investment to New York, so we felt that was a very good way to build a portfolio.” \nHippeau has had a remarkable career path. Prior to Lerer Hippeau, he served as CEO of The Huffington Post, a managing partner at SoftBank Capital, and the chief executive of Ziff-Davis. \nIn a conversation with Term Sheet, Hippeau discussed how New York’s landscape has changed, why he thinks Masayoshi Son is not a bubble-maker, and what companies can do about “superstar harassers.” \nThe following has been edited for length and clarity. \nTERM SHEET: The majority of your investments are in New York. How has the NYC tech ecosystem changed in the last few years? \nHIPPEAU: Our portfolio is a really good indication of what New York is good at. It is by and large software — anything that is built on cloud computing, open-source, easy to deploy and relatively asset-light technology. About half of our portfolio is enterprise software businesses, and the other half is consumer-facing companies. The two largest buckets are direct-to-consumer e-commerce companies such as Casper and Warby Parker, and media properties such as Axios and BuzzFeed. Those themes have been very stable and consistent since we started investing in 2010. \nA new category for us that we’re very excited about is robotics. Paradoxically, you wouldn’t normally think of New York as a place for robotics but it actually has a well-established community that came from the 3D printing world. The people coming from that world are starting to develop robotic products that use 3D printing or hardware products as the basis for these robots. \nLerer Hippeau recently led an investment in a cannabis media company out of Canada. What areas of opportunity do you see in that industry? \nHIPPEAU: We have two investments in the cannabis field. Cannabis is a sector that’s soon to be a large market — probably a $20 billion market within two to five years. It’s a market that came from scratch. In other words, you do not find participants coming in from other industries to enter the cannabis ecosystem. It’s an exciting market to invest in, but also in a very eyes-wide-open, cautious way. We obviously want to invest in companies that operate where the market is fully legal. \nSecondly, we made a decision that we don’t want to invest in companies that grow or touch the product. We’ve got two investments so far — Herb, a cannabis-focused media company, and LeafLink, a wholesale order management platform for the cannabis industry. We’re excited about the market, but we’re approaching it in a relatively cautious way. \nAre you looking at blockchain companies at all? What are your thoughts on crypto and the blockchain? \nHIPPEAU: We’ve been very cautious about crypto. We will only invest when we understand the sector very well, and this is a sector that we are still learning about. We do have one investment in a company called Abra, which is a peer-to-peer money transfer network using the blockchain to transfer funds. We are very much looking at the sector because we believe there’s something important going on, particularly with the infrastructure — the blockchain. \nWe are very wary of ICOs, however. Our investors expect us to buy equity. In a lot of crypto-type investments, you are buying tokens — therefore, you do not own any equity in the company. That’s not something we feel is part of our mission. \nYou were the CEO of Ziff Davis when SoftBank acquired the media company in 2000. You then joined SoftBank Capital as a managing partner. (Softbank Capital was SoftBank’s corporate venture capital practice, which invested in Yahoo , Alibaba and The Huffington Post). What can you tell me about SoftBank’s investment strategy? \nHIPPEAU: As you can tell from what’s going on, SoftBank is a big vision investor and has been very, very successful. The first investment I was involved with was Yahoo. Masayoshi Son has a real knack for what’s going to happen in 10 years or 20 years and he makes big bets. Some of those big bets have paid off really nicely. Probably the largest return of any VC investment from what I can tell has been his investment in Alibaba. So I think the Vision Fund is just a continuation of how the world is being transformed in radical fashion because of technology and some big bets. I think it’s courageous, and he has a good track record of success doing that. \nSon has been called a one-man bubble-maker . Do you think that’s a fair characterization? \nHIPPEAU: I don’t think that’s right. I think bubble-maker means you’re hyping or making investments without any real thought. I don’t think so. I think that we, in the United State, are a little too conservative at times. All you have to do is look at how every day there’s a new investment made in Asia where it’s not uncommon for a bike-sharing company to raise $300 million. So you say, “Wow, how is that possible?” And then you look at the market, where there’s no legacy infrastructure in many cases, and see that it’s a lot easier to build these markets because they’re building them from scratch. Then you begin to realize, “Well, $300 million probably makes a lot of sense if someone wants to dominate that particular market and they’re making a big bet.” \nI’m not sure that as a community we’re embracing those sorts of large bets here in the United States. We’ve done it with Uber and some of these other large companies, but I think it happens more frequently in Asia. \nYou and a lot of the firm’s investors have more of an operating background. How does that affected the way you make investment decisions? \nHIPPEAU: All of our partners, myself included, have an operating background. And we believe that’s very important. It grounds you in reality and gives you a sense of what’s real and what’s possible. We obviously understand technology and the market forces, but what we collectively do is provide realistic, concrete, and actionable advice on how to build a company. \nSexual harassment allegations have recently come to the forefront in the venture community. How can people address and solve this problem? \nHIPPEAU: There’s a number of ways. One, is obviously, a no-tolerance policy whether that’s sexual harassment or any kind of bullying or any kind of discrimination. None of that should be tolerated in an organization. \nYou address the issue through education, culture, and awareness of what is inappropriate. You have to be aware of what’s going on. You can’t just sweep things under the rug. The New York Times published a story about “superstar harassers ,” the likes of Harvey Weinstein, and how companies over the years have looked the other way because they want to protect", "external_links": [], "published": "2018-01-04T11:52:00.000+02:00", "crawled": "2018-01-04T01:00:50.002+02:00", "highlightTitle": ""}