{"organizations": [], "uuid": "a4bb359dc0c3e382f1c21b950d1f6e7a42b557b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-one-horizon-group-announces-acquisition-of-123wish.html", "country": "US", "domain_rank": 767, "title": "One Horizon Group Announces Acquisition of 123Wish", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.97, "site_type": "news", "published": "2018-01-24T16:30:00.000+02:00", "replies_count": 0, "uuid": "a4bb359dc0c3e382f1c21b950d1f6e7a42b557b8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-one-horizon-group-announces-acquisition-of-123wish.html", "ord_in_thread": 0, "title": "One Horizon Group Announces Acquisition of 123Wish", "locations": [], "entities": {"persons": [{"name": "jake paul", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "horizon group, inc.", "sentiment": "neutral"}, {"name": "google", "sentiment": "none"}, {"name": "lifetime llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, One Horizon Group, Inc. (NASDAQ:OHGI) today announced that it has entered into an Exchange Agreement to acquire a majority interest in ONCE IN A LIFETIME LLC, d/b/a 123Wish.\n123Wish, available in the Apple App Store, Google Play and www.123wish.com , is a subscription-based, experience marketplace that focuses on providing users with exclusive opportunities to enjoy personalized, dream experiences with some of the world’s most renowned social media influencers including Super Influencer Jake Paul and Team 10 as well as celebrities, professional athletes, fashion designers, and artists while supporting a diverse range of charities.\nThe influencer or celebrity for each 123Wish experience selects a philanthropic cause to benefit or is randomly matched to a non-profit organization. Once the charitable contribution goal for an experience has been met and the designated timeframe for entry has expired, 123Wish randomly selects the winner who receives exclusive access to interact with the influencer or celebrity. Yet, everyone who enters wins a specialized gift for participation, which may include limited edition merchandise, gift cards or personalized video or voice messages from experience contributors.\nEach 123Wish subscriber will soon have a digital wallet and will receive four digital coins each month that his or her subscription remains active, which the subscriber may contribute to charity. OHGI and 123Wish are committed to making at least $1,000,000 in digital coin value available for charitable contribution premised on the number of subscribers. Development for inclusion of the coin technology is underway and OHGI will be providing blockchain integration.\nIn order to deliver authentic and unique lifestyle experiences, 123Wish will launch experiences with social media influencers, music artists and other celebrities that have been embraced by Generation Z. TGZ Capital, L.P., the Gen Z focused venture capital fund, owned five percent of 123Wish pre-acquisition and becomes an OHGI shareholder pursuant to this transaction.\n“We executed the Exchange Agreement ahead of schedule based on the commitment of everyone involved and we are grateful to have the opportunity to welcome 123Wish founders Natalia Diaz, Andrew Resnick and TGZ Capital as OHGI stakeholders,” said One Horizon Group’s Founder, President and CEO, Mark White. “Subscribers, fans and likes have become a new form of currency and advertising spend is usually driven by perceived reach rather than fixed-costs. Thus, in addition to the importance of verifiable charitable giving, we see future opportunities in the use of digital coins for media buying.”\nOHGI has entered into a multi-year Employment Agreement with Natalia Diaz, who will remain the President and CEO of 123Wish. Natalia Diaz is an expert in mobile, social media, gaming and web platform development and has provided services to several Fortune 500 and other innovative company clients that rely on social-media monetization.\n“After getting to know Mark White and the team at One Horizon Group, it quickly became clear that we are aligned philosophically,” said 123Wish Co-Founder, President and CEO, Natalia Diaz. “As part of a NASDAQ-listed technology company with access to the capital markets, we believe that we can deliver the high-value experiences desired by Gen-Zers and Millennials and move at the fast pace of the new brand landscape driven by social media influencers underpinning Web 3.0 and the proliferation of social media through a marketplace of experiences.”\n“After spending years developing web properties that reach tens of millions of unique visitors on a monthly basis, I realized that social media is not only an incredible platform for advertising and sales; it is the new framework for contribution,” said 123Wish Co-Founder, technology entrepreneur and real estate mogul, Andrew Resnick. “I also believe that digital coins, which allow for efficient and transparent transactions, provide the means for a generational shift in charitable giving. Given access to OHGI innovation and its commitment to development of digital coin technology that makes a social impact, I am confident that this transaction will deliver measurable value on many fronts.”\n“Beyond business, 123Wish enables me to fulfill my personal goal to give back and empower our youth through contribution,” added 123Wish Co-Founder, President and CEO, Natalia Diaz. “This is very important for me as I recognize the power of influencers to make a real difference and teach the next generations that by including giving in their lives, dreams do come true.”\n“Based on the detailed financial models we have analyzed, we remain confident that the acquisition will be accretive in 2018 and we expect 123Wish will generate significant revenue in 2018 commencing with the expected launch of scheduled experiences in the first and second quarters of 2018,” added One Horizon Group’s Founder, President and CEO, Mark White. “We remain focused on our commitment to deliver substantial value to OHGI shareholders.”\nAbout One Horizon Group, Inc.\nOne Horizon Group, Inc. (NASDAQ:OHGI) is a reseller of secure messaging software for the growing gaming, security and education markets including in China and Hong Kong. For more information on the Company please visit http://www.onehorizongroup.com/investors-overview/ .\nDarrow Associates Contacts for OHGI Bernie Kilkelly (516) 236-7007 bkilkelly@darrowir.com Jordan Darrow (512) 551-9296 jdarrow@darrowir.com\nSource:One Horizon Group, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=z2_QVpgUbjA257RZf5l8T4jVJ1J5dnsXK-UYJNQf7xgTuFQ4207iA8BhGzR1BwjePtazPpYGM-YSLr7-th1Jbs_FaS92Qg8nfggJdcamU6G7gt3cjW3Lh7X9AIi_Z5H-YYnwJ9sn54Gda31mG-TbBW9WmTGmhQ1Yw_So4vYwq2s=", "http://www.onehorizongroup.com/investors-overview/", "https://www.globenewswire.com/NewsRoom/AttachmentNg/c52bd945-f330-45ed-b37e-72212cb9905b", "https://www.globenewswire.com/Tracker?data=6tn92zmbAdlEjKlYK36rr5oM6NhtyufYB7JcqQx_bl0lPPVTq5YYZ7PTEbSw4zyY4tHsefpZp11UVCqBjnjvFg=="], "published": "2018-01-24T16:30:00.000+02:00", "crawled": "2018-01-24T16:51:43.008+02:00", "highlightTitle": ""}