{"organizations": [], "uuid": "ae2bf13b00b469613f5ef45ab610c2ff9ff8b888", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-wellesley-bancorp-inc-reports-record-results-for-the-year-ended-december-31-2017.html", "country": "US", "domain_rank": 767, "title": "Wellesley Bancorp, Inc. Reports Record Results for the Year Ended December 31, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:30:00.000+02:00", "replies_count": 0, "uuid": "ae2bf13b00b469613f5ef45ab610c2ff9ff8b888"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-wellesley-bancorp-inc-reports-record-results-for-the-year-ended-december-31-2017.html", "ord_in_thread": 0, "title": "Wellesley Bancorp, Inc. Reports Record Results for the Year Ended December 31, 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "wellesley", "sentiment": "none"}], "organizations": [{"name": "wellesley bancorp, inc", "sentiment": "neutral"}, {"name": "wellesley bancorp, inc.", "sentiment": "neutral"}, {"name": "tcja", "sentiment": "none"}, {"name": "wellesley bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WELLESLEY, Mass., Jan. 25, 2018 /PRNewswire/ -- Wellesley Bancorp, Inc. (Nasdaq Capital Market: WEBK) (the \"Company\"), the holding company for Wellesley Bank (the \"Bank\"), reported net income of $201 thousand and $3.2 million for the quarter and year ended December 31, 2017, respectively. These results compare to net income of $722 thousand and $2.9 million for the quarter and year ended December 31, 2016, respectively. The results for the quarter represent a decrease of 72.2% as compared to the prior year fourth quarter results and the results for the year were higher than 2016 by 8.5%. As a result of the Tax Cuts and Jobs Act (\"TCJA\"), the Company was required to re-value the net deferred tax asset, which resulted in $979 thousand additional tax expense in the fourth quarter 2017. Excluding the impact of TCJA, net income in the fourth quarter would have been $1.2 million, up 63.4% and for the year would have been $4.2 million, up 41.8% compared to 2016. (See Non-GAAP footnote 2).\nDiluted earnings per share were $0.08 and $1.30 for the quarter and year ended December 31, 2017, respectively. Total assets were $805.4 million at December 31, 2017, an increase of $110.1 million, or 15.8%, from December 31, 2016 as total gross loans increased $110.9 million, funded primarily by an increase in core deposits and short-term debt.\nThomas J. Fontaine, President and Chief Executive Officer, said, \"The year 2017 was a record for earnings, even including the impact of recent tax reform. Excluding the effect of TCJA, earnings were up 42% from year to year. We are pleased with our continued growth and progress toward our performance targets.\"\nFourth Quarter Earnings\nNet income totaled $201 thousand for the quarter ended December 31, 2017; a decrease of 72.2%, as compared to $722 thousand for the quarter ended December 31, 2016. The TCJA required a reevaluation of the Company's net deferred tax asset in December 2017 at the lower tax rate, which resulted in an additional $979 thousand tax expense to write down deferred tax assets. Excluding the impact of TCJA, net income would have been $1.2 million, or up 63.4% when compared to the same quarter 2016. Net interest income and non-interest income increased, partially offset by an increase in the provision for loan losses and non-interest expenses.\nNet interest income increased $975 thousand, or 19.0%, to $6.1 million for the quarter ended December 31, 2017, as compared to the quarter ended December 31, 2016. This increase was driven primarily by the growth of our loan portfolio, partially offset by higher interest expense from the increases in borrowings and deposits. The yield on earning assets for the fourth quarter ended December 31, 2017 was 3.98%, an increase of ten basis points from the comparable quarter in 2016. Deposit and borrowing costs were 1.03% for the fourth quarter 2017, compared to 0.95% for the fourth quarter 2016. The net interest margin was 3.15% for the 2017 fourth quarter, compared to 3.11% for the 2016 fourth quarter, reflecting the increase in earning asset yields partially offset by the increase in deposit and borrowing costs between the two periods.\nNon-interest income totaled $513 thousand for the quarter ended December 31, 2017, an increase of $73 thousand, or 16.6%, compared to the prior year period. Wealth management fees increased $67 thousand, or 24.5%, compared to the quarter ended December 31, 2016, primarily due to an increase in assets under management. Total assets under management at Wellesley Investment Partners, including the Bank's investment portfolio, were $367.6 million at the end of 2017, as compared to $307.1 million at the end of 2016. Income from mortgage banking activities decreased $57 thousand, primarily due to lower sales of fixed rate mortgage loans from the previous year. All other non-interest income increased $63 thousand due to an increase in fees on customer interest rate swaps and increases in ATM network interchange fees.\nTotal non-interest expenses were $4.4 million in the quarter ended December 31 2017, an increase of $129 thousand, or 3.0%. Salaries and benefits remained flat at $2.6 million for the quarter ended December 31, 2017 as compared to same period ended December 31, 2016. FDIC insurance costs increased $39 thousand, or 31.7%, due to new quarterly assessment rates and growth related to higher assessment balances. Data processing costs increased $37 thousand and professional fees increased $43 thousand due mainly to growing business volumes and loan underwriting expenses.\nYear to Date Earnings\nNet income for the year ended December 31, 2017 increased $249 thousand, or 8.5%, compared to net income for the year ended December 31, 2016. The enactment of TCJA resulted in the re-valuation of deferred tax assets and additional tax expense of $979 thousand. Excluding the impact of TCJA, as detailed above, net income would have been $4.2 million, an increase of $1.2 million or 41.8% from the year to date period 2016.\nNet interest income increased $2.8 million, or 13.9%, to $22.7 million for the year ended December 31, 2017, as compared to $19.9 million in the comparable 2016 period. The increase was largely due to increased loan interest income resulting from growth in our loan portfolio. Our earning asset yield was 3.95% in both the years ended December 31, 2017 and 2016. Deposit and borrowing costs increased two basis points to 0.98% in the current period from 0.96% for the 2016 period. Our net interest margin was 3.16% for 2017, compared to 3.17% for the 2016 period.\nNon-interest income totaled $2.0 million, an increase of $277 thousand, or 16.2%, as income from wealth management fees in 2017 increased $275 thousand, or 28.0% compared to 2016 due to an increase in assets under management. Income from mortgage banking activities decreased $176 thousand as compared to the comparable 2016 period due to a lower volume of mortgage sales. All other non-interest income increased $178 thousand due to increases in fees on customer interest rate swaps and ATM network interchange fees.\nFor the year ended December 31, 2017, non-interest expenses increased $777 thousand, or 4.7%, to $17.2 million. Factors that contributed to the increase in non-interest expense during the 2017 period include increased salaries and employee benefits of $403 thousand, or 4.2%. The compensation increase is attributable to the recognition of a full year of expenses related to our Newton Centre office, several strategic hires in late 2016, and employee merit increases that typically occur late in the year. FDIC insurance costs increased $205 thousand, or 50.7%, due to new quarterly assessment rates and growth-related higher assessment balances. Data processing expense was higher by $114 thousand from the prior year due to increasing business volumes. Advertising expenses increased by $46 thousand, largely associated with our efforts to generate deposits. Professional fees decreased mainly due to one-time charges in 2016 for recruiting and staffing searches. Occupancy and equipment expense remained flat at $2.8 million for the year ended December 31, 2017 as compared to the year ended December 31, 2016.\nBalance Sheet Growth\nTotal assets were $805.4 million at December 31, 2017, representing an increase of $110.1 million compared to $695.3 million at December 31, 2016. The increase was primarily related to growth in the loan portfolio. Total liabilities increased $106.0 million due to deposits increasing $93.9 million and long-term debt and short-term borrowings increasing $10.9 million, as compared to December 31, 2016.\nGross loans totaled $692.5 million at December 31, 2017, an increase of $110.9 million, or 19.1%, as compared to December 31, 2016. Residential mortgage loans increased $61.0 million to $329.0 million at December 31, 2017, primarily due to growth in our adjustable-rate mortgage portfolio. Commercial and industrial loans increased $18.6 million to $68.0 million, continuing our efforts to diversify the loan portfolio. Commercial real estate loans increased $17.6 million to $138.8 million. Construction loans increased $9.6 million to $120.0 million at December 31, 2017, compared to $110.4 million at December 31, 2016.\nDeposits increased $93.9 million to $616.7 million at December 31, 2017. Money market accounts increased $43.1 million, or 43.1% due to our success in attracting new deposit relationships. Certificates of deposit increased $38.3 million, which included $36 million of new brokered deposits used to diversify our funding for liquidity and cash needs. Demand deposits and NOW accounts increased $11.3 million, or 8.7%, to $141.8 million as growth was realized in both retail and commercial accounts. Savings accounts increased $1.3 million to $98.6 million. Long-term debt and short-term borrowings, consisting entirely of advances from the FHLB, increased $10.9 million as compared to December 31, 2016.\nStockholders' equity increased $4.0 million to $59.2 million, primarily due to earnings and an increase in the fair values of available-for-sale securities during the twelve month period, partially offset by dividends paid. At December 31, 2017, the Company's ratio of stockholders' equity-to-total assets was 7.36%, compared to 7.94% at December 31, 2016.\nAbout Wellesley Bancorp\nWellesley Bank and its wholly-owned wealth management company, Wellesley Investment Partners, LLC, are subsidiaries of Wellesley Bancorp, Inc.\nWellesley Bank provides personal, customized, premier banking services to successful people, families, businesses and Non-profit organizations. The bank has six full-service banking offices in Wellesley, Newton and Boston. Wellesley Investment Partners, a subsidiary of Wellesley Bank, provides wealth management services to individuals and families, private foundations and endowments. Wellesley Bank has been serving the Greater Boston Area for over 105 years.\nForward Looking Statements\nThis press release contains certain forward-looking statements about the Company and the Bank. Forward-looking statements include statements regarding anticipated future events and can be identified by the fact that they do not relate strictly to historical or current facts. They often include words such as \"believe,\" \"expect,\" \"anticipate,\" \"estimate,\" and \"intend\" or future or conditional verbs such as \"will,\" \"would,\" \"should,\" \"could,\" or \"may.\" Forward-looking statements, by their nature, are subject to risks and uncertainties. Certain factors that could cause actual results to differ materially from expected results include increased competitive pressures, changes in the interest rate environment, general economic conditions or conditions within the securities markets, and legislative and regulatory changes that could adversely affect the business in which the Company and the Bank are engaged.\nThe Company's summary income statements and other data follow:\nWellesley Bancorp, Inc. and Subsidiary\nConsolidated Statements of Net Income\n(Dollars in thousands, except per share data)\n(Unaudited)\nThree Months Ended\nDecember 31,\nYears Ended\nDecember 31,\n2017\n2016\n2017\n2016\nInterest and dividend income:\nInterest and fees on loans and loans held for sale\n$ 7,172\n$ 5,929\n$ 26,251\n$ 22,938\nOther interest and dividend income\n537\n480\n2,115\n1,866\nTotal interest and dividend income\n7,709\n6,409\n28,366\n24,804\nInterest expense\n1,598\n1,273\n5,688\n4,899\nNet interest income\n6,111\n5,136\n22,678\n19,905\nProvision for loan losses\n363\n125\n735\n437\nNet interest income, after provision for loan losses\n5,748\n5,011\n21,943\n19,468\nTotal non-interest income\n513\n440\n1,987\n1,710\nNon-interest expenses:\nSalaries and employee benefits\n2,576\n2,572\n10,094\n9,691\nOccupancy and equipment\n698\n686\n2,785\n2,744\nData processing\n241\n204\n892\n778\nFDIC Insurance\n162\n123\n609\n404\nProfessional fees\n214\n171\n761\n884\nOther general and administrative\n508\n514\n2,040\n1,903\nTotal non-interest expenses\n4,399\n4,270\n17,181\n16,404\nIncome before income taxes\n1,862\n1,181\n6,749\n4,774\nProvision for income taxes\n1,661\n459\n3,564\n1,838\nNet income\n$ 201\n$ 722\n$ 3,185\n$ 2,936\nOther Data:\nReturn on average assets (1)\n0.10%\n0.42%\n0.43%\n0.45%\nReturn on average equity (1)\n1.33%\n5.13%\n5.47%\n5.37%\nNet interest margin (1)\n3.15%\n3.11%\n3.16%\n3.17%\nEarnings per common share:\nBasic\n$0.08\n$0.31\n$1.34\n$1.26\nDiluted\n$0.08\n$0.30\n$1.30\n$1.24\nWeighted average shares outstanding:\nBasic\n2,384,409\n2,356,863\n2,369,466\n2,329,645\nDiluted\n2,472,538\n2,416,547\n2,454,580\n2,367,038\nStockholders' equity to total assets at end of period\n7.36%\n7.94%\n7.36%\n7.94%\nBook value per common share at end of period\n$23.66\n$22.22\n$23.66\n$22.22\nNonperforming loans to total loans at end of period\n0.08%\n0.10%\n0.08%\n0.10%\n(1) Three month periods annualized\n(2) Wellesley Bancorp, Inc. and Subsidiary\nConsolidated Statements of Net Income\nNet income Adjusted for TCJA (Non-GAAP)\n(Dollars in thousands)\n(Unaudited)\nReconciliation of Certain GAAP and Non-GAAP Financial Measures (unaudited)\nWhile net income is a financial measure that is recorded in accordance with U.S. general accepted accounting principles (\"GAAP\"), \"adjusted net income\" is not. Nevertheless, management uses this non-GAAP measure in its analysis of our performance, and believes that this non-GAAP measure should be disclosed in our earnings releases and other investor communications to give investors a better understanding of the effect of this one-time, $979 thousand, write-down of the Company's net deferred-tax assets caused by the enactment of TCJA on December 22, 2017.\nThe following table presents the reconciliation of our net income (GAAP) and our adjusted net income (non-GAAP) for the three months ended December 31, 2017 and 2016, and for the years ended December 31, 2017 and 2016.\nThree Months Ended\nDecember 31,\nYears Ended\nDecember 31,\n2017\n2016\n2017\n2016\nNet income (GAAP)\n$ 201\n$ 722\n$ 3,185\n$ 2,936\nTCJA additional tax provision\n979\n--\n979\n--\nAdjusted net income (Non-GAAP)\n$ 1,180\n$ 722\n$ 4,164\n$ 2,936\nThe Company's summary balance sheets follow:\nWellesley Bancorp, Inc. and Subsidiary\nConsolidated Balance Sheets\n(Dollars in thousands)\n(Unaudited)\nDecember 31,\n2017\nDecember 31,\n2016\nAssets\nCash and cash equivalents\n$ 28,562\n$ 28,525\nSecurities available for sale, at fair value\n66,486\n64,648\nFederal Home Loan Bank of Boston stock, at cost\n5,937\n5,758\nLoans held for sale\n--\n1,454\nLoans\n692,455\n581,563\nLess allowance for loan losses\n(6,153)\n(5,432)\nLoans, net\n686,302\n576,131\nBank-owned life insurance\n7,535\n7,303\nPremises and equipment, net\n3,470\n3,876\nOther assets\n7,103\n7,588\nTotal assets\n$ 805,395\n$ 695,283\nLiabilities and Stockholders' Equity\nDeposits:\nNon-interest-bearing\n$ 104,346\n$ 94,946\nInterest-bearing\n512,396\n427,864\nTotal Deposits\n616,742\n522,810\nShort-term borrowings\n38,000\n21,250\nLong-term debt\n77,174\n83,020\nSubordinated debt\n9,802\n9,769\nAccrued expenses and other liabilities\n4,432\n3,220\nTotal liabilities\n746,150\n640,069\nStockholders' equity\n59,245\n55,214\nTotal liabilities and stockholders' equity\n$ 805,395\n$ 695,283\nView original content with multimedia: http://www.prnewswire.com/news-releases/wellesley-bancorp-inc-reports-record-results-for-the-year-ended-december-31-2017-300588427.html\nSOURCE Wellesley Bancorp, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/wellesley-bancorp-inc-reports-record-results-for-the-year-ended-december-31-2017-300588427.html"], "published": "2018-01-26T00:30:00.000+02:00", "crawled": "2018-01-26T01:41:01.012+02:00", "highlightTitle": ""}