{"organizations": [], "uuid": "12185e2846a086a95d1f2deeb1bd6b040920c8a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 14, "shares": 14, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/news/wealth\r", "section_title": "Reuters: Money", "url": "https://www.reuters.com/article/us-column-miller-medicare/nursing-home-study-raises-questions-on-medicare-managed-care-networks-idUSKBN1F71NS", "country": "US", "domain_rank": 408, "title": "Nursing home study raises questions on Medicare managed care networks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:59:00.000+02:00", "replies_count": 0, "uuid": "12185e2846a086a95d1f2deeb1bd6b040920c8a5"}, "author": "", "url": "https://www.reuters.com/article/us-column-miller-medicare/nursing-home-study-raises-questions-on-medicare-managed-care-networks-idUSKBN1F71NS", "ord_in_thread": 0, "title": "Nursing home study raises questions on Medicare managed care networks", "locations": [], "entities": {"persons": [{"name": "mark miller", "sentiment": "none"}], "locations": [], "organizations": [{"name": "medicare", "sentiment": "negative"}, {"name": "medicare advantage", "sentiment": "none"}, {"name": "medica", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 1:02 PM / Updated 4 hours ago Nursing home study raises questions on Medicare managed care networks Mark Miller 6 Min Read \nCHICAGO (Reuters) - Managed care is the hot trend in Medicare, with the number of seniors enrolled in Medicare Advantage plans projected to soar over the coming decade. These plans offer simplicity by combining all the different parts of Medicare into a single buying decision - and they can save you money. \nBut before you sign up, ask this question: What happens if I get really sick? \nMost Medicare Advantage plans are HMOs or PPOs. When you join, Medicare provides a fixed payment to the plan to cover Part A (hospitalization) and Part B (outpatient services). Advantage is growing quickly, fueled by its value proposition of savings and simplicity - the plans bundle together prescription drug coverage and the out-of-pocket protection of Medigap plans. \nBut like any type of managed care coverage, there is a trade-off: you must use in-network healthcare providers. For example, one recent study found shortcomings in the quality of providers in some Medicare Advantage provider networks - one out of every five plans did not include a regional academic medical center - institutions that usually offer the highest-quality care and specialists ( reut.rs/2DGIvhy ). \nNow, a new study raises questions about the quality of skilled nursing facilities (SNFs) that are included in Medicare Advantage provider networks. \nResearchers at Brown University’s School of Public Health examined Medicare beneficiaries entering skilled nursing facilities (SNFs) from 2012 to 2014. The yardsticks for quality were Nursing Home Compare - Medicare’s own database of nursing home quality ratings - and rates of hospital readmission for those admitted to SNFs. Their key finding: Medicare Advantage enrollees appear more likely to enter lower-quality skilled nursing facilities than people enrolled in traditional fee-for-service Medicare. \nMedicare Advantage plans also are subject to a quality rating system, but the researchers found that enrollees in both lower- and higher-quality plans were admitted to SNFs with significantly lower quality ratings. \nThe SNF quality gaps could impact a large group of people, considering the large - and growing - Medicare population. David Meyers, one of the Brown University study authors, calculates that about 315,000 patients from lower-rated Advantage plans need to use an SNF annually. “If those people had used fee-for-service Medicare, up to 13,000 more of them might have gone to a higher-quality nursing home,” he said. UNCLEAR HEALTH OUTCOMES \nThe study does not conclude that healthcare outcomes are necessarily worse for Medicare Advantage enrollees - that was outside the scope of the research. Some researchers have correlated NHC star ratings with patient outcomes, but the jury really is out on this question - partly because of the shortcomings of NHC itself. Much of the data that determines ratings is self-reported by nursing homes, and reviews of this system have found numerous cases of facilities attempting to “game” the system to inflate their ratings. \nA large trade group representing the private companies that sponsor Advantage plans - America’s Health Insurance Plans (AHIP) - argues that actual outcomes are better. The group points to another study that found MA enrollees had shorter lengths of stay and were less likely to be readmitted to a hospital and more likely to return home within 90 days of admission than FFS beneficiaries. \nBut the Brown researchers found that patients from lower-rated Advantage plans tended to go to SNFs with higher readmission rates than fee-for-service patients. \nAnd a review by the Kaiser Family Foundation in 2014 of a large body of research comparing the quality of care provided by Advantage plans and traditional Medicare concluded that the available research is unsatisfying, and that better evidence is needed. \nEven if current research is inconclusive, this much is clear: we need much greater transparency to help consumers understand at the point when they are shopping for Medicare Advantage plans using the online Medicare plan finder ( bit.ly/2DKlL0o ). “It’s not very clear what SNFs are part of any given Advantage plan,\" said Meyers. \nGoing beyond information in the plan finder also presents challenges, said Tricia Neuman, senior vice president and director of the program on Medicare policy at Kaiser. “You would need to get the provider directory from every Advantage plan she is considering - and those are not available in a uniform format,” she said. \n”Then, you’d have to go compare the different nursing home providers online for their quality ratings.” No one - including AHIP - is even tracking data on how many SNFs are offered by the typical Advantage plan. \nMeyers doubts that even a good research tool would help. “Most people don’t think about a nursing facility until they need one - and it’s really difficult to make decisions about this at a time of crisis,” he said. \nGaining a better understanding of quality in Medicare Advantage plans is going to be urgent as the aging of the nation accelerates. Overall Medicare enrollment will jump nearly 30 percent by 2027 according to projections by the Congressional Budget Office. And Advantage plan enrollment will increase from 19 million to 31 million, which would represent 44 percent of eligible Medicare beneficiaries. \nAnd the need for greater consumer vigilance in choosing SNFs will increase as the Trump administration moves aggressively to deregulate the industry. ( reut.rs/2Fv5LQd ). \nThe opinions expressed here are those of the author, a columnist for Reuters. Editing by Matthew Lewis", "external_links": [], "published": "2018-01-18T14:59:00.000+02:00", "crawled": "2018-01-18T15:18:43.021+02:00", "highlightTitle": ""}