{"organizations": [], "uuid": "1e5726207977765ecd8486930e187ff51eeedfe2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104941602-GettyImages-854009492.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/12/beijings-new-landing-ship-could-be-used-to-help-invade-taiwan.html", "country": "US", "domain_rank": 767, "title": "Beijing's new 'landing ship' could be used to help invade Taiwan", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T10:43:00.000+02:00", "replies_count": 0, "uuid": "1e5726207977765ecd8486930e187ff51eeedfe2"}, "author": "Jeff Daniels", "url": "https://www.cnbc.com/2018/01/12/beijings-new-landing-ship-could-be-used-to-help-invade-taiwan.html", "ord_in_thread": 0, "title": "Beijing's new 'landing ship' could be used to help invade Taiwan", "locations": [], "entities": {"persons": [{"name": "yuri smityuk", "sentiment": "neutral"}, {"name": "song zhongping", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "tass", "sentiment": "neutral"}, {"name": "global times", "sentiment": "none"}, {"name": "chinese people's liberation army", "sentiment": "none"}, {"name": "chinamilitary online", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Yuri Smityuk | TASS | Getty Images Chinese servicemen. Beijing has developed a new \"landing ship\" that could be used in future wars involving islands, Chinese media reported Thursday.\nThat news follows a Reuters report last month that a Chinese official threatened the communist nation would invade Taiwan if a U.S. warship visited the self-ruling island. Also, Chinese state media recently have played up coverage of \"island encirclement\" exercises near the democratic island, including showing a Chinese bomber.\n\"China is developing Type 071 ships to meet requirements of possible wars involved with islands in the future, which could help it gain advantages in solving disputes on islands as well as questions involved with Taiwan,\" Song Zhongping, a Chinese military expert, was quoted as telling the Beijing-controlled Global Times newspaper this week.\nThe report about the new amphibious warship was republished Thursday on ChinaMilitary Online , the news website of the Chinese People's Liberation Army.\n\"It could also deliver the navy and the army to the target island,\" Song added. \"The expanding number of this type of ships could greatly enhance the PLA Navy's amphibious warfare capability.\"\nReuters also reported last month that the Chinese military had conducted at least 16 rounds of exercises close to Taiwan in roughly the past year. \n\"I think they are looking realistically to get Taiwan back in the near future,\" Denny Roy, an Asia Pacific security expert and senior fellow at the East-West Center in Honolulu told CNBC Thursday. The think tank's defense expert said Beijing's strategy may be to effectively \"frighten Taiwan into submitting without a fight.\"\nThe Chinese military is believed to have at least four amphibious ships as well as two aircraft carriers, including the domestically-built Liaoning that launched last year. By comparison, the U.S. has 10 carriers in its fleet and around 16 of the largest class of amphibious assault ships.\nLate last year, Beijing announced it planned to quadruple the size of its naval fighting force.\n\"If you're going to multiply the size of your naval infantry force by four, it follows that you're going to have a lot more amphibious ships,\" said Dean Cheng, a defense expert and senior research fellow at the Heritage Foundation, a Washington-based conservative think tank.\nCheng also told CNBC that Beijing's naval buildup could put Taiwan at risk.\nBeyond those increases, China is also spending more on its air force, including developing advanced fighters. The air force and navy forces could potentially be used to conduct a blockade of Taiwan.\n\"They keep saying that, 'we have to be prepared to retake Taiwan,'\" said Cheng. \"But they've never really invested in the naval infantry, over-the-shore capabilities that would be required. Now we're seeing them do it as almost the last block being put in place.\"\nAt the same time, there have been reports of Chinese military movements near Japan and South Korea in the past month, including five Chinese military planes moving off the coast of South Korea.\nAlso, a Chinese submarine was reported off Japan this week, according to Japanese reports. One of the locations where the submarine was tracked was near the disputed Senkaku Islands in the East China Sea.\nThe so-called Type 071 landing ship the Chinese developed is believed to be just under 30,000 tons and could carry helicopters as well as troops from the People's Liberation Army. Attack helicopters also could be used to as part of an invasion scenario in Taiwan.\nAccording to Roy, Beijing is believed to have the capability today with its existing ships to send about 20,000 troops to Taiwan.\nThen again, experts said the amphibious ships also could be use for peaceful purposes by the Chinese, including to evacuate people during disaster response situations. Indeed, the U.S. has used amphibious ships in the past year for hurricane and flooding relief missions.", "external_links": [], "published": "2018-01-12T10:43:00.000+02:00", "crawled": "2018-01-12T11:02:50.009+02:00", "highlightTitle": ""}