{"organizations": [], "uuid": "9c4ae6e8c5827860e59c4de074d5618bcdc49f36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/uk-palladium-rally/graphic-new-year-bounce-extends-palladiums-rally-to-record-high-idUKKBN1ES18M", "country": "US", "domain_rank": 408, "title": "Graphic - New Year bounce extends palladium's rally to record high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T17:33:00.000+02:00", "replies_count": 0, "uuid": "9c4ae6e8c5827860e59c4de074d5618bcdc49f36"}, "author": "", "url": "https://uk.reuters.com/article/uk-palladium-rally/graphic-new-year-bounce-extends-palladiums-rally-to-record-high-idUKKBN1ES18M", "ord_in_thread": 0, "title": "Graphic - New Year bounce extends palladium's rally to record high", "locations": [], "entities": {"persons": [{"name": "jan harvey", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 3:02 PM / Updated 17 hours ago Graphic - New Year bounce extends palladium's rally to record high Jan Harvey 5   Palladium extended last year’s more than 50 percent surge to hit record highs on Tuesday, as Chinese car sales growth, tightening emissions controls and a swing away from diesel cars in Europe fuelled fears of a metal shortage after years of market deficit. \nSpot palladium XPD= hit a peak of $1,096.50 an ounce on Tuesday, just above its 2001 high of $1,095 an ounce. \nA switch to gasoline-powered and hybrid cars, which use more palladium in their autocatalysts, has fuelled fears that market tightness could lead to a shortage of supply. The market has been in deficit in six out of the last seven years for which data is available. \nThat shortfall has led to a draw-down of available stocks. Holdings of palladium-backed exchange-traded funds fell to their lowest since 2010 last year, with some analysts citing market tightness, which they say drew physical metal out of the funds. \nPalladium, some three-quarters of which is used in catalytic converters, chiefly for gasoline engines, hit a series of 17-year highs in 2017 on expectations that automotive demand would continue to improve. \n“Underlying the speculative investment flows is a very strong fundamental picture,” ICBC Standard Bank analyst Tom Kendall said. “Palladium is one of the few metals markets that is genuinely tight and looks like it will continue to tighten.” \n“When you overlay the growth in car sales in China, which is a gasoline market, with the ongoing switch away from diesel in Europe, it adds up to a much better demand story for palladium than for platinum,” he said. “That is drawing down inventories, and there is no easy supply response.” \nDiesel market share in Europe has been under pressure since carmaker Volkswagen admitted in 2015 that it had used illegal software to cheat U.S. emissions tests, slipping below 50 percent the following year for the first time since 2009. \nMeanwhile, Chinese car sales growth held firm in 2017. \nWhile there are solid reasons for palladium’s move, analysts said the strength of its recent gains suggests it may be overstretched in the near term. The metal eased 1 percent on Wednesday, though it remains at elevated levels. \n“The fundamentals are strong, it’s true, and this is spilling over into continued tight physical availability which is reflected in the outright price and a deeply backwardated forward market,” Mitsubishi analyst Jonathan Butler said, referring to the higher price of palladium contracts for imminent delivery versus the more distant future. \n“But this has the mark of a spec squeeze especially given (Tuesday‘s) thin trading, right at the start of the year with many market participants still enjoying holidays.” \nIn the longer term, there are clear risks to the rally. Palladium’s heavy reliance on car sales for demand - unlike platinum, its jewellery market is small - could make it vulnerable to a sharp retracement if signs emerge that sales are slowing. \nA move towards vehicle electrification would also cut down demand for catalytic converters. However, that is too far off to pose a significant risk the market at present, Kendall said. “I don’t think it is within anyone’s ability to take a commodities investment position on e-vehicles yet,” he said. “There are so many unknowns.” \nIn the meantime, market tightness has sent the metal back to levels not seen since 2001, a time when U.S. carmakers were panicking over the U.S. authorities’ shift in emphasis to tackling unburned hydrocarbon emissions, GFMS’ head of research and forecasts Rhona O‘Connell said. This rally looks more solid, she said. \n“This time around it’s genuine fundamentals (that are driving the rally), and some spec activity, in the belief that the pressure on diesel will favour gasoline,” she said. \nFor the graphic 'Palladium market balance vs price', click - reut.rs/2CbLOvG \nFor the graphic 'Palladium automotive demand vs price', click - reut.rs/2CFs4BF \nFor the graphic 'Chinese car sales vs palladium', click - reut.rs/2CJgJRa \nFor the graphic 'Metals performance 2017', click - reut.rs/2CipuUw Reporting by Jan Harvey; Editing by Veronica Brown and Mark Potter", "external_links": [], "published": "2018-01-03T17:33:00.000+02:00", "crawled": "2018-01-04T10:59:21.008+02:00", "highlightTitle": ""}