{"organizations": [], "uuid": "c50ded89d44a074c091fbe67c0ba88616565095c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-nordstrom-rack-president-karen-mckibbin-to-retire.html", "country": "US", "domain_rank": 767, "title": "Nordstrom Rack President Karen McKibbin to Retire", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T01:02:00.000+02:00", "replies_count": 0, "uuid": "c50ded89d44a074c091fbe67c0ba88616565095c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-nordstrom-rack-president-karen-mckibbin-to-retire.html", "ord_in_thread": 0, "title": "Nordstrom Rack President Karen McKibbin to Retire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE, Jan. 8, 2018 /PRNewswire/ -- After three decades marked by expansion and success, Karen McKibbin, president of Nordstrom Rack, will be retiring from Nordstrom in March. Karen joined Nordstrom in 1985 and has held many leadership roles within the company, including president of Nordstrom Canada, where she led the first-ever international expansion of Nordstrom's full line stores.\n\"We are indebted to Karen for the many contributions she's made over her more than 30-year career with Nordstrom,\" said Blake Nordstrom, co-president of Nordstrom, Inc. \"During her long tenure, Karen brought great depth of experience to her various roles including president of Canada, president of Nordstrom Rack, and a member of the Executive Team. Her leadership will be missed across the company and we wish her all the best in her next endeavor.\"\n\"I feel fortunate to be part of this company and to have built a career from which I garnered so much personal and professional fulfillment. I have a great passion for the team and the business,\" said Karen McKibbin. \"Nordstrom has a strong legacy that I've been honored to be part of. It is an incredible brand that will continue to evolve— fueled by the best talent in the business.\"\nGeevy Thomas, chief innovation officer, will succeed Karen. Geevy, who joined Nordstrom in 1983, has held numerous senior leadership positions throughout the organization and served as president of Nordstrom Rack from 2010 to January 2017.\n\"Over the last year, Geevy and the Innovation team have established an approach to leveraging our local assets of people, product, and place – and evolve our physical stores. With this foundation in place, we will begin integrating the team, learnings and processes across various aspects of our business,\" said Blake Nordstrom. \"We're fortunate to be able to leverage Geevy's knowledge of our Nordstrom Rack business, which continues to be one of our most productive channels, a driver of innovation and our biggest source of new customers to Nordstrom. Geevy will continue to support innovation as we make that transition.\"\nAbout Nordstrom\nNordstrom, Inc. is a leading fashion retailer based in the U.S. Founded in 1901 as a shoe store in Seattle, today Nordstrom operates 366 stores in 40 states, including 122 full-line stores in the United States, Canada and Puerto Rico; 232 Nordstrom Rack stores; two Jeffrey boutiques; two clearance stores; seven Trunk Club clubhouses; and its Nordstrom Local service concept. Additionally, customers are served online through Nordstrom.com , Nordstromrack.com , HauteLook and TrunkClub.com . Nordstrom, Inc.'s common stock is publicly traded on the NYSE under the symbol JWN.\nMEDIA CONTACTS:\nGigi Ganatra Duff\nNordstrom, Inc.\n877-746-6228\nnordstrompr@nordstrom.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/nordstrom-rack-president-karen-mckibbin-to-retire-300579427.html\nSOURCE Nordstrom, Inc.", "external_links": ["http://nordstrom.com/", "http://nordstromrack.com/", "http://www.prnewswire.com/news-releases/nordstrom-rack-president-karen-mckibbin-to-retire-300579427.html", "http://trunkclub.com/"], "published": "2018-01-09T01:02:00.000+02:00", "crawled": "2018-01-09T09:40:58.127+02:00", "highlightTitle": ""}