{"organizations": [], "uuid": "5135d64623df27f6fc7dbbc26b665e45cb4c4459", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/09/the-associated-press-vancouver-officials-deal-blow-to-proposed-oil-terminal.html", "country": "US", "domain_rank": 767, "title": "Vancouver officials deal blow to proposed oil terminal", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T22:44:00.000+02:00", "replies_count": 0, "uuid": "5135d64623df27f6fc7dbbc26b665e45cb4c4459"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/the-associated-press-vancouver-officials-deal-blow-to-proposed-oil-terminal.html", "ord_in_thread": 0, "title": "Vancouver officials deal blow to proposed oil terminal", "locations": [], "entities": {"persons": [{"name": "eric labrant", "sentiment": "none"}, {"name": "jay inslee", "sentiment": "none"}, {"name": "inslee", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "wash.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "board of commissioners", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "vancouver energy", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "tesoro corp.", "sentiment": "none"}, {"name": "energy facility site evaluation council", "sentiment": "none"}, {"name": "savage companies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, Wash. (AP) — The port of Vancouver's Board of Commissioners voted unanimously Tuesday to terminate a rolling lease on property that would hold the nation's largest rail-to-marine oil terminal if the project's backers don't provide all the necessary permits by March.\nThe 3-0 vote is another blow to the Vancouver Energy terminal. A key state energy council recommended in November that Washington Gov. Jay Inslee deny the project, meaning that it will be almost impossible for the backers to meet the deadline on the lease.\nInslee has until the end of February to decide whether to accept the recommendation of the Energy Facility Site Evaluation Council.\n\"It's gratifying to have our commission be united in its vision for the future of the port and community,\" said Commission President Eric LaBrant said in an emailed statement. \"We still await the Governor's decision on the project and we continue to be focused on supporting businesses, growing jobs and providing benefit to our community.\"\nThe joint venture of Tesoro Corp. and Savage Companies would receive about 360,000 barrels of North American crude oil a day by trains at the port of Vancouver, in southwest Washington state. The oil would then be loaded onto tankers and ships for transport to oil refineries up and down the West Coast.\nThe lease had automatically renewed every three months until Tuesday's action.\nDevelopers have said the terminal is needed to bring crude oil from North Dakota and other areas to a western U.S. port to meet growing fuel demands and future energy needs. They've argued that it could be built safely and would secure a reliable supply of energy for the state.\nTribes, environmental groups and municipalities such as the city of Vancouver lined up against the project.\nOpponents argued that the terminal would mostly benefit the energy needs of California — and potentially overseas markets in the future — while exposing Washington communities to all the public safety and environmental risks.\nAn environmental study released last year found the proposed project included risks to health and safety that could not be entirely mitigated.\nThose four risks were identified as train accidents, emergency response delays, negative impacts on low-income communities and the possibility that an earthquake would damage the facility's dock and cause an oil spill.\nInformation from: The Columbian, http://www.columbian.com", "external_links": [], "published": "2018-01-09T22:44:00.000+02:00", "crawled": "2018-01-10T00:44:45.001+02:00", "highlightTitle": ""}