{"organizations": [], "uuid": "a6fa12be3aa22b53ae48e96d68f1a0f250c22ae9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-allant-group-names-marty-shepard-as-svp-of-sales.html", "country": "US", "domain_rank": 767, "title": "Allant Group Names Marty Shepard as SVP of Sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:00:00.000+02:00", "replies_count": 0, "uuid": "a6fa12be3aa22b53ae48e96d68f1a0f250c22ae9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-allant-group-names-marty-shepard-as-svp-of-sales.html", "ord_in_thread": 0, "title": "Allant Group Names Marty Shepard as SVP of Sales", "locations": [], "entities": {"persons": [{"name": "marty shepard", "sentiment": "negative"}, {"name": "shepard", "sentiment": "none"}, {"name": "allant", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "allant group", "sentiment": "negative"}, {"name": "svp", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 17, 2018 /PRNewswire/ -- Allant Group, a nationally recognized marketing technology services provider, announced the recent appointment of Marty Shepard to Senior Vice President of Sales. In this role, Shepard assumes responsibility for all aspects of Allant Group's sales and business development strategy.\n\"I am thrilled and honored to join the Allant Group team,\" said Shepard. \"This is a once-in-a-lifetime opportunity to work with an exceptional team that is all working toward a common goal of providing leading-edge solutions for marketers.\"\n\"Job number one is to keep our focus on customer success,\" said Shepard. \"I look forward to taking Allant to a new level as we expand our customer base in established and emerging verticals.\"\nAn accomplished sales executive with over 25 years of experience delivering solid, scalable revenue growth, Shepard is known for building high-performing teams that focus on consultative customer relationships. He has also built strong partnerships with agencies and marketing services providers by bringing unique skills and creativity that add value to their solutions.\nPrior to joining Allant, Shepard served as SVP of Sales and Business Development at Alterian, a leading provider of cross-channel campaign and real-time interaction management software. He previously was AVP Sales at Teradata, a billion-dollar international provider of analytic data platforms and marketing applications. Shepard also held sales leadership roles at Quantivo, Protagona (now part of Doubleclick) and Interelate. Shepard received a BS/MIS degree from the University of Arizona.\n\"I'm delighted that Marty has joined our executive team,\" said Gaurav Issar, Chief Executive Officer, Allant Group. \"We have built a solid track record over the years of partnering with our customers to help them achieve or surpass their marketing goals. Marty's experience building world-class sales organizations will be a great asset to Allant as we focus on growth based and our commitment to being a leading marketing technology firm that delivers faster, better solutions to our customers.\"\nAbout Allant Group\nAllant is a marketing technology services provider that delivers end-to-end omni-channel marketing services. Allant's expertise and market knowledge enables the delivery through faster customer and 3rd party data integration, improved analytical insights, easy to understand data visualizations, and effective campaign management execution to enable personalized communication by marketers to acquire, retain and win back customers. Allant is a privately held company headquartered in the Chicago area. For more information, call 800.367.7311 or visit www.allantgroup.com .\nCONTACT:\nTim Finnigan\n1-630-778-2758\ntfinnigan@allantgroup.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/allant-group-names-marty-shepard-as-svp-of-sales-300583561.html\nSOURCE Allant Group", "external_links": ["http://www.allantgroup.com/", "http://www.prnewswire.com/news-releases/allant-group-names-marty-shepard-as-svp-of-sales-300583561.html"], "published": "2018-01-17T16:00:00.000+02:00", "crawled": "2018-01-17T16:33:47.002+02:00", "highlightTitle": ""}