{"organizations": [], "uuid": "5ddf8408c33bb140e25f81ce439cf0fe0ecfd560", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-metals/metals-china-metals-mixed-upbeat-data-propels-lme-copper-idUSL3N1PD2LL", "country": "US", "domain_rank": 408, "title": "METALS-China metals mixed; upbeat data propels LME copper", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:04:00.000+02:00", "replies_count": 0, "uuid": "5ddf8408c33bb140e25f81ce439cf0fe0ecfd560"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-metals/metals-china-metals-mixed-upbeat-data-propels-lme-copper-idUSL3N1PD2LL", "ord_in_thread": 0, "title": "METALS-China metals mixed; upbeat data propels LME copper", "locations": [], "entities": {"persons": [{"name": "james regan", "sentiment": "negative"}, {"name": "oyu tolgoi", "sentiment": "none"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "gobi desert", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "lme", "sentiment": "negative"}, {"name": "london metal exchange", "sentiment": "none"}, {"name": "shanghai futures exchange", "sentiment": "none"}, {"name": "turquoise hill resources", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 04 AM / in 23 minutes METALS-China metals mixed; upbeat data propels LME copper Reuters Staff \n(Adds details, updates prices) \nBy James Regan \nSYDNEY, Jan 18 (Reuters) - Shanghai base metals futures turned mixed in late Asian hours on Thursday with better-than-expected China economic data coming in just before the market close, which pushed up LME copper. \nThe fourth-quarter data underpinned a rally in London Metal Exchange copper, though failed to push the Shanghai contract into positive territory. \n* SHFE COPPER: The most-traded copper contract on the Shanghai Futures Exchange closed down 0.24 percent at 53,670 yuan ($8,340.46) a tonne. \n* LME COPPER: Three-month copper on the LME gained 0.36 percent to $7,060 a tonne, reversing losses from the previous session. \n* CHINA GROWTH: China Q4 GDP 6.8 percent year-on-year compared with a forecast of 6.7 percent. Analysts polled by Reuters expected the world’s second-largest economy to have grown 6.7 percent in the October-December quarter from a year ago. \n* FORCE MAJEURE: Turquoise Hill Resources said Oyu Tolgoi, a copper and gold mine in the southern Gobi Desert, has declared force majeure in connection with customer contracts for concentrate due to a protest by Chinese coal transporters in the Ganqimaodu Border Zone. \n* BHP: BHP’s copper output jumped 20 percent to 429,000 tonnes in the quarter to end-December helped by a rise in production from its Escondida copper mine in Chile. * SHFE ALUMINIUM: ShFE aluminium finished down 0.10 percent at 14,620 a tonne. LME aluminium was showing a modest loss at $2,191 a tonne. \n* ALCOA: Aluminium producer Alcoa Corp reported a bigger quarterly loss on Wednesday, hurt by the closure and divestiture of some smelting assets. \n* COPPER BOOST: Chile’s state copper commission, Cochilco, on Wednesday raised its estimated 2018 average price for the metal to $3.06 per pound from its previous forecast of $2.95 per pound, pointing to the potential for global supply disruptions in the coming year. \n* LEAD SURPLUS: The global lead market showed a surplus of 15,600 tonnes in November after a deficit of 11,100 tonnes in October, data from the Lisbon-based International Lead and Zinc Study Group (ILZSG) showed on Wednesday. \n: LEAD PRICES: Despite the shift to a surplus, ShFE lead closed 1.20 percent firmer at 19,330 yuan a tonne, while LME lead was 0.3 percent stronger at $2,556. \n* For the top stories in metals and other news, click or PRICES", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T16:04:00.000+02:00", "crawled": "2018-01-18T10:23:55.000+02:00", "highlightTitle": ""}