{"organizations": [], "uuid": "0206e57b28f101a96d51d93effc1eddae9e9a3b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220503863&w=1200&r=LYNXMPEE080M1", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/china-shipping-accident-oil/iranian-oil-tanker-burns-for-third-day-after-collision-off-china-coast-idUKKBN1EY0DA", "country": "US", "domain_rank": 408, "title": "East China Sea oil tanker burns for third day as winds, high waves lash rescuers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T13:45:00.000+02:00", "replies_count": 0, "uuid": "0206e57b28f101a96d51d93effc1eddae9e9a3b5"}, "author": "", "url": "https://uk.reuters.com/article/china-shipping-accident-oil/iranian-oil-tanker-burns-for-third-day-after-collision-off-china-coast-idUKKBN1EY0DA", "ord_in_thread": 0, "title": "East China Sea oil tanker burns for third day as winds, high waves lash rescuers", "locations": [], "entities": {"persons": [{"name": "yuna park", "sentiment": "none"}], "locations": [{"name": "east china sea", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "sanchi", "sentiment": "none"}], "organizations": [{"name": "josephine mason", "sentiment": "none"}, {"name": "south korean coast guard", "sentiment": "none"}, {"name": "ministry of transport", "sentiment": "none"}, {"name": "ministry of transport/handout", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 4:40 AM / Updated 28 minutes ago East China Sea oil tanker burns for third day as winds, high waves lash rescuers Josephine Mason , Yuna Park 5 Min Read \nBEIJING/SEOUL (Reuters) - Strong winds, high waves and toxic gases are hindering dozens of rescue boats struggling to locate missing sailors from a stricken oil tanker in the East China Sea and to extinguish a fire that has burned for the past three days on the ship. Smoke is seen from Panama-registered Sanchi tanker carrying Iranian oil that caught ablaze after it collided with a Chinese freight ship in the East China Sea, in this January 9, 2018 handout picture released by China's Ministry of Transport. China's Ministry of Transport/Handout via REUTERS \nThe poor conditions, with rain and waves as high as 3 metres (10 feet), frustrated efforts to tame the fire and search for the 31 remaining tanker crew members, China’s Ministry of Transport said in a statement on Tuesday. \nThe flames were forcing the South Korean Coast Guard’s search and rescue team to stay as far as 3 miles (4.8 km) away from the tanker, two South Korean officials told Reuters. \nThe Chinese government said late on Tuesday it had not found a“large-scale” oil leak, and the ultra light oil, known as condensate, was burning off or evaporating so quickly it would leave little residue - less than 1 percent - within five hours of a spill. That reduces the chances of a crude-style oil slick. \nStill, condensate is highly volatile when exposed to air and water and concerns were growing the tanker could explode and sink while a flotilla of 13 search and rescue vessels comb a 900-square-nautical-mile (3,100 sq km) area for the crew. \nThe tanker Sanchi (IMO:9356608), run by Iran’s top oil shipping operator, National Iranian Tanker Co, collided on Saturday with the CF Crystal (IMO:9497050), carrying grain from the United States, about 160 nautical miles (300 km) off China’s coast near Shanghai and the mouth of the Yangtze River Delta. \nThe Sanchi was carrying 136,000 tonnes of condensate to South Korea, equivalent to about 1 million barrels and worth about $60 million. \nChinese state media CCTV showed footage on Monday of boats dousing the flames with water as plumes of thick dark smoke continued to billow from the tanker. \nThe size of the oil spill from the ship and the extent of the environmental harm were not known, but the disaster has the potential to be the worst since 1991 when 260,000 tonnes of oil leaked off the Angolan coast. \n“We can’t grasp the level of oil contamination at this moment. The cargo is still on fire, so it is hard to figure out if oil is being spilled,” Park Sung-dong, an official from South Korea’s Ministry of Oceans and Fisheries, told Reuters. \nThe body of a crew member was found on Monday in the water near the tanker, China’s transport ministry said. It had been handed over to the civil affairs bureau. \nThe crew of the Sanchi are all Iranian nationals except for two Bangladeshi citizens. Smoke and fire is seen from Panama-registered tanker SANCHI carrying Iranian oil after it collided with a Chinese freight ship in the East China Sea. China Central Television via REUTERS TV TANKER ON THE MOVE \nSatellite imagery of the ship showed the blaze has weakened since the weekend, although the strong winds are dragging the tanker away from the Chinese coast, according to Greenpeace. \nBetween Sunday and Monday, the floating inferno travelled some 50 kilometres (31 miles) south east, according to Rashid Kang, campaigner at Greenpeace East Asia. \nAnother major concern is damage to the region’s rich fish reserves. The Zhoushan fishing ground where the crash occurred is known as one of the biggest in the East China Sea, particularly for mackerel and croaker, according to Greenpeace. FISHERMEN TO THE RESCUE \nThe CF Crystal suffered limited damage and the 21 crew members, all Chinese nationals, were rescued by a passing fishing trawler on Saturday night, according to a report posted by state-owned Xinhua News to its Twitter account on Tuesday. \n“The fire was so fierce. It kept exploding like bombs. So loud,” said Zhu Tingwen, a sailor on the fishing boat. \nThe trawler from Zhejiang province scoured for survivors on the tanker, but could not get close enough because of the fire, Xinhua said. \n“Anyone will go for a rescue in this case,” said the fishing boat captain Zheng Lei. “It just happened to be me.” \nThe freighter has been taken to a port near Shanghai where investigators will start work on assessing the cause of the disaster, the government said. \nChina’s transport ministry warned toxic gas from the tanker was harmful to the rescue workers and that protective clothing and gas testing equipment was being dispatched to the emergency teams. \nTrying to contain a spill of condensate, which is extremely low in density, highly toxic and much more explosive than normal crude oil, may be difficult. \n“We’re not going to see a slick like with crude, but it’s soluble, toxic and flammable, which is why we’re seeing the fire. A lot of it is burning off or evaporating,” said Greenpeace’s Kang. Reporting by Josephine Mason, Beijing News Monitoring and Meng Meng in BEIJING; Jane Chung and Yuna Park in SEOUL; Editing by Christian Schmollinger and Mark Potter", "external_links": [], "published": "2018-01-09T13:45:00.000+02:00", "crawled": "2018-01-09T13:59:11.005+02:00", "highlightTitle": ""}