{"organizations": [], "uuid": "59879a268c48d3523da1bd92c233882c75aafb0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-lendingpoint-acquires-loanhero-to-accelerate-expansion-to-point-of-sale-and-point-of-need-financing.html", "country": "US", "domain_rank": 767, "title": "LendingPoint Acquires LoanHero to Accelerate Expansion to Point-of-Sale and Point-of-Need Financing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.462, "site_type": "news", "published": "2018-01-11T15:00:00.000+02:00", "replies_count": 0, "uuid": "59879a268c48d3523da1bd92c233882c75aafb0d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-lendingpoint-acquires-loanhero-to-accelerate-expansion-to-point-of-sale-and-point-of-need-financing.html", "ord_in_thread": 0, "title": "LendingPoint Acquires LoanHero to Accelerate Expansion to Point-of-Sale and Point-of-Need Financing", "locations": [], "entities": {"persons": [{"name": "loanhero", "sentiment": "none"}], "locations": [{"name": "point-of-need financing kennesaw", "sentiment": "none"}, {"name": "ga.", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KENNESAW, Ga. & SAN DIEGO--(BUSINESS WIRE)-- LendingPoint , the company working to revolutionize access to consumer credit, today announced that it has acquired LoanHero , a leading fintech platform for point of sale finance.\nLoanHero’s retail financing technology allows merchants to close more transactions while providing consumers more payment options. Combined with LendingPoint’s industry-leading credit underwriting and risk management expertise, LoanHero will help accelerate LendingPoint’s expansion into point-of-need and point-of-sale financing, with its comprehensive and innovative merchant onboarding and reporting tools and installed merchant base. Terms of the deal were not disclosed.\nFounded in 2014, LoanHero’s team and platform lets merchants offer traditional and promotional loans to their customers. Through one convenient application, merchants provide the best possible financing option for their customers, with credit decisions in real time. Where other lenders can’t fund, LoanHero offers its own products to fill the gap. Hundreds of merchants use the LoanHero platform across industries including medical, dental, home improvement, and many others.\n“LoanHero’s merchant platform is the perfect complement to our consumer portfolio. The combination of the two companies doubles our origination channels and current customer base and triples the number of consumers we can serve, with credit and payment solutions for folks with credit scores from 450 all the way to 850,” said Tom Burnside, co-founder and CEO of LendingPoint. “We’ve been so impressed by the energy and talent of the LoanHero team, and we look forward to working with them to dramatically improve access to credit for a large and underserved segment of consumers and merchants, whenever they need it.”\n“Backed by LendingPoint’s powerful technology and expertise, we look forward to helping practices, contractors, retailers and many other businesses grow by providing innovative credit solutions for their customers,” said Zalman Vitenson, Chairman and CEO of LoanHero. “We join one of the best teams in the industry, with unparalleled knowledge in risk management, credit and underwriting across consumer and merchant finance.”\nLendingPoint is a balance-sheet lender that uses data and technology in a proprietary model to paint a more complete financial picture of a customer. This model allows LendingPoint to approve loans for more people who may be passed over by traditional FICO results. Loans range from $2,000 to $26,500, with terms from 24 to 48 months. LendingPoint responds to customers in a matter of seconds with an approval decision, creating loan offers aligned with the customer’s financial profile and transparent terms that take the guesswork out of repayment.\nLendingPoint and LoanHero both were formed in 2014 and to date have issued almost 70,000 loans, totaling nearly $500 million in consumer loans.\n“Access to credit creates financial inclusion and upward mobility for consumers, and it’s also been proven to increase conversion and sales for merchants,” said Juan Tavares, co-founder and Chief Strategy Officer of LendingPoint. “Our vision is to improve financial access for all consumers at the point they need it -- whether that’s an unexpected home repair or an important medical procedure. LoanHero gives us access to hundreds of product and service providers, accelerating our ability to serve even more consumers who deserve better access to affordable credit.”\nAbout LendingPoint\nLendingPoint is a balance sheet lender with a vision to revolutionize access to credit. The company is creating a better lending environment by looking for more reasons to say “yes” -- helping NearPrime consumers unlock access to affordable loans and live better financial lives. Its award-winning leadership team brings unmatched experience in FinTech and credit. LendingPoint is a privately-held company with headquarters in Kennesaw, Ga.\nFICO is a trademark of Fair Isaacs Corporation.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111005165/en/\nfor LendingPoint\nLeah Schmerl\nleah@justdrivemedia.com\nSource: LendingPoint", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.loanhero.com&esheet=51741546&newsitemid=20180111005165&lan=en-US&anchor=LoanHero&index=2&md5=496e9f2a8dd40b26475a3a0cfb961306", "http://www.businesswire.com/news/home/20180111005165/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.lendingpoint.com&esheet=51741546&newsitemid=20180111005165&lan=en-US&anchor=LendingPoint&index=1&md5=2d70514c88422508c2d9afd6d7049ccd"], "published": "2018-01-11T15:00:00.000+02:00", "crawled": "2018-01-11T15:01:42.000+02:00", "highlightTitle": ""}