{"organizations": [], "uuid": "420465d7a80687c143c37093293c0eeaeb9614ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-nuface-set-to-revolutionize-at-home-anti-aging-category.html", "country": "US", "domain_rank": 767, "title": "NuFACE Set to Revolutionize At-Home, Anti-Aging Category", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:04:00.000+02:00", "replies_count": 0, "uuid": "420465d7a80687c143c37093293c0eeaeb9614ce"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-nuface-set-to-revolutionize-at-home-anti-aging-category.html", "ord_in_thread": 0, "title": "NuFACE Set to Revolutionize At-Home, Anti-Aging Category", "locations": [], "entities": {"persons": [], "locations": [{"name": "vista", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VISTA, Calif., Jan. 8, 2018 /PRNewswire/ -- 2018 is the year that quality facial skincare technology can, for the first time, deliver the same great results in body care. NuFACE®, pioneer in innovative, at-home, anti-aging solutions is proud to announce the launch of NuBODY, the first-ever, FDA-cleared microcurrent beauty device for the body.\nHow does NuBODY work? The microcurrent's unparalleled technology is in the front seat, giving women the power to take body confidence into their own hands (literally) and turn the anti-aging industry on its head. The device is specially engineered with four treatment spheres that synergistically work together to deliver a powerful, yet gentle flow of targeted microcurrent to the larger, denser areas of the body. The first-to-market device's exclusive Micro-4 Technology targets stubborn areas, such as arms, stomach, thighs and more, to help smooth away the look of dimpled, uneven skin. Best of all, NuBODY's energizing hum feels like a gentle massage with no pain, only gain.\nNo matter what (or where) the problem area may be, the clinically tested and scientifically proven results speak for themselves.\nClinically Tested + Proven Results\n92% of women showed an increase in skin tone* 84% of women said their skin appeared firmer* 80% of women's skin appeared smoother* 74% of women felt their overall skin appearance improved*\n\"Clients are super engaged and educated in a way I've never seen before, especially when it comes to beauty. After seeing the incredible success of the NuFACE, we are thrilled to expand the innovative microcurrent technology to the body. NuBODY truly breaks the mold by letting the busy, modern woman achieve a more firm, youthful looking appearance and physique with no downtime,\" says Founder and CEO, Tera Valdez-Peterson. \"We have taken a concept, which began as facial-specific technology that could only be found in a professional skincare office, and have evolved it into a head-to-toe at-home anti-aging solution. It's safe to say, the future of beauty has arrived.\"\nNuFACE is currently available in over 2,000 doors worldwide and in 18 international markets. NuBODY retails for $399, and is now available at MyNuFACE.com , select Neiman Marcus and Nordstrom stores as well as online, Revolve.com , Sephora.com , and select spas and professional skincare offices nationwide.\nAbout NuFACE\nThe NuFACE brand was launched by aesthetician Carol Cole and her daughters Tera Peterson and Kimberly Morales in 2005 to provide clients with a home-care version of the microcurrent treatments Carol had provided to her clients for over 30 years. Behind the scenes of every red-carpet event and used by celebrity makeup artists and aestheticians, NuFACE devices remain the secret weapon of everyone who aspires to look their best. NuFACE offers the NuFACE Trinity Device with two treatment attachments, NuFACE Trinity Pro, NuFACE mini, as well as a skincare product line comprised of eight SKUs. NuFACE is available at Neiman Marcus, Nordstrom, Bloomingdale's, Barneys, Bergdorf Goodman, Ulta Beauty, Sephora.com , SpaceNK, QVC and top spas and medical offices.\n*NuBODY Clinical Study. A single center, non-randomized, single-arm trial to evaluate the performance of NuBODY for the treatment of mild to moderate cellulite conditions on thighs and buttocks. Study Number C17-D012.\nFor more information, visit www.mynuface.com or contact Heather Arnold ( harnold@behrmanpr.com ) or Gianna Cesa ( gcesa@behrmanpr.com ) of Behrman Communications.\nView original content with multimedia: http://www.prnewswire.com/news-releases/nuface-set-to-revolutionize-at-home-anti-aging-category-300578722.html\nSOURCE NuFACE", "external_links": ["http://www.mynuface.com/", "http://www.prnewswire.com/news-releases/nuface-set-to-revolutionize-at-home-anti-aging-category-300578722.html"], "published": "2018-01-08T15:04:00.000+02:00", "crawled": "2018-01-08T15:20:27.000+02:00", "highlightTitle": ""}