{"organizations": [], "uuid": "fb084d3b1e6a8ee89ef49c0e48f89cdb1a181812", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/06/103284633-20141005--1867.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/15837362/device/rss/rss.html", "section_title": "U.S. News", "url": "https://www.cnbc.com/2018/01/01/18-stocks-that-could-rise-25-percent-in-2018.html", "country": "US", "domain_rank": 767, "title": "18 stocks that could rise 25% in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.053, "site_type": "news", "published": "2018-01-01T20:06:00.000+02:00", "replies_count": 0, "uuid": "fb084d3b1e6a8ee89ef49c0e48f89cdb1a181812"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/01/18-stocks-that-could-rise-25-percent-in-2018.html", "ord_in_thread": 0, "title": "18 stocks that could rise 25% in 2018", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "s&p global market intelligence", "sentiment": "none"}, {"name": "standard & poor", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If Bitcoin's too crazy a ride for you, here are 18 stocks that analysts say could enjoy their own personal bull runs in 2018.\nThe \"18 stocks for '18\" list includes oil and natural gas drillers and drug makers. It also spotlights an internet travel company and high-tech firms that make the digital computing world go.\nThis lineup of potential stars (shown below) is based on a simple methodology: They're the companies in the Standard & Poor's 500 with the biggest potential to rise when you compare their closing share price on Dec. 15 to the higher projected price targets of Wall Street analysts, using data from S&P Global Market Intelligence.\nAside from strong-performing tech names, many of these stocks are considered good deals or \"value plays,\" because their prices were beaten down in 2017 despite a nearly 20% gain for the broader market.\nEnergy companies, which fell more than 3% in 2017 and were among the worst stock market performers, dominate the list.\nRead more from USA Today:\n401(k) savers: Where the stock market is headed in 2018\n401(k) savers: Hot industries for stock investors in 2018\nInvestors: 5 market milestones that mattered in 2017\nThe industry — which includes companies that drill for oil as well as ones that provide services and storage facilities to energy customers — is seen bouncing back in 2018. Analysts expect them to benefit from stronger prices, bigger earnings gains following government tax cuts and a global economy that is growing virtually everywhere.\nTech companies, which enjoyed the biggest gains of all industry groups in 2017, are expected to fare well again. A strong economy and cash windfalls from tax cuts could fuel a rebound in corporate spending on equipment and a continued push into emerging technologies like the cloud, artificial intelligence and robotics.\n18 stocks to consider for 2018 All of the names are seen rising 25% or more, according to analysts.\n1. Range Resources ( RRC )\nPrice on Dec. 15: $15.63 Target price: $28.98 Percent change: +85.4% Independent natural gas and oil company is one of the most active drillers in Pennsylvania, including Marcellus Shale.\n2. Incyte ( INCY )\nPrice on Dec. 15: $96.41 Target price: $145.76 Percent change: +51.2% Biotech firm engages in discovery, development and sale of drugs, including profitable JAKAFI, a treatment for patients with myelofibrosis, a rare bone marrow disorder. Recent stock drop to a 52-week low marks good entry point for company given its robust drug pipeline.\n3. Dish Network ( DISH )\nPrice on Dec. 15: $48.57 Target price: $72.76 Percent change: +49.8% Pay-TV service provides television entertainment to millions of customers with its satellite DISH TV and streaming Sling TV services. Dish could be acquisition target amid more M&A-friendly Trump administration as trove of wireless spectrum licenses have value.\n4. Alexion Pharmaceuticals ( ALXN )\nPrice on Dec. 15: $115.76 Target price: $164.18 Percent change: +41.8% Global biopharmaceutical company serves patients affected by rare diseases through the innovation, development and sale of life-changing therapies. Alexion has strong balance sheet and several new drugs in development.\n5. Western Digital ( WDC )\nPrice on Dec. 15: $81.62 Target price: $114.80 Percent change: +40.7% American computer data-storage company and one of the largest computer hard disk drive makers in the world. Stock's price-to-earnings ratio of 17 gives it a cheaper valuation than the S&P 500.\n6. EQT (EQT)\nPrice on Dec. 15: $54.71 Target price: $76.08 Percent change: +39.1% Natural gas producer and horizontal driller in the Appalachia area that has developed \"cleaner\" drilling technologies.\n7. Noble Energy (NBL)\nPrice on Dec. 15: $25.66 Target price: $35.68 Percent change: +39.0% Founded in 1932 after the Great Depression, engages in oil and natural gas exploration and production in the U.S. and offshore assets that span three continents.\n8. Advanced Micro Devices (AMD)\nPrice on Dec. 15: $10.29 Target price: $14.24 Percent change: +38.4% Semiconductor company designs and integrates technology that powers intelligent devices, including personal computers, game consoles and cloud servers. AMD products also power mining for fast-rising and increasingly popular cryptocurrencies.\n9. Allergan (AGN)\nPrice on Dec. 15: $171.68 Target price: $229.23 Percent change: +33.5% Pharmaceutical company, known for its Botox skin-aging treatment, offers portfolio of generic, hospital and over-the counter (OTC) medicines. After stock lost a fifth of its value in 2017, rebound odds rise.\n10. Anadarko Petroleum (APC)\nPrice on Dec. 15: $47.52 Target price: $62.28 Percent change: +31.1% One of world's largest independent oil and gas exploration and production companies with approximately 1.72 billion barrels-equivalent of proved reserves at start of year.\n11. Newfield Exploration (NFX)\nPrice on Dec. 15: $27.81 Target price: $36.22 Percent change: +30.3% Focused on unconventional U.S. resource plays, located primarily in the Anadarko and Arkoma basins of Oklahoma, the Williston Basin of North Dakota and the Uinta Basin of Utah.\n12. Chesapeake Energy (CHK)\nPrice on Dec. 15: $3.51 Target price: $4.46 Percent change: +27.0% Founded in 1989 by the late Aubrey McClendon, Oklahoma City energy firm's portfolio includes unconventional oil and natural gas assets in U.S. onshore wells.\n13. Applied Materials (AMAT)\nPrice on Dec. 15: $52.54 Target price: $66.50 Percent change: +26.6% Maker of semiconductor manufacturing gear, including memory chips and display production equipment, is exposed to growing areas of the economy. CEO Gary Dickerson recently said the company is \"confident\" in delivering \"strong double-digit growth\" in 2018.\n14. Expedia (EXPE)\nPrice on Dec. 15: $120.88 Target price: $152.76 Percent change: +26.4% Online travel firm provides a full range of travel and advertising services to worldwide customers through brands including Expedia.com, Orbitz, HomeAway and Hotels.com. A stronger economy, lower taxes and higher wages could mean more travelers and profits for Expedia.\n15. Skyworks Solutions (SWKS)\nPrice on Dec. 15: $94.63 Target price: $119.00 Percent change: +25.8% Chip maker, which supplies Apple with iPhone components, is play on wireless networking with new apps that include autos, the connected home and wearables. Tech play is alternative to so-called FAANG stocks and has much lower valuation.\n16. Baker Hughes (BHGE)\nPrice on Dec. 15: $30.26 Target price: $38.04 Percent change: +25.7% This GE company has operations in over 120 companies and provides oilfield products, services and digital solutions to its energy customers.\n17. Micron Technology (MU)\nPrice on Dec. 15: $42.40 Target price: $53.07 Percent change: +25.2% Designs semiconductor memory and storage technologies used in the cloud server space, mobile devices, and auto, connected home and consumer electronics markets. After stock nearly doubled in 2017, outlook remains bright as chip pricing is strong and opportunities in servers and artificial intelligence is still robust.\n18. Kinder Morgan (KMI)\nPrice on Dec. 15: $17.93 Target price: $22.39 Percent change: +24.9% North America energy infrastructure company owns an interest in or operates approximately 84,000 miles of pipelines and 155 terminals.", "external_links": ["https://www.usatoday.com/story/money/2017/12/15/investors-5-market-milestones-mattered-2017/952963001/", "https://www.usatoday.com/story/money/2017/12/21/401-k-savers-hot-industries-watch-2018-biggest-upside-potential/953364001/", "https://www.usatoday.com/story/money/2017/12/27/401-k-savers-where-stock-market-headed-2018/954898001/"], "published": "2018-01-01T20:06:00.000+02:00", "crawled": "2018-01-01T21:22:50.004+02:00", "highlightTitle": ""}