{"organizations": [], "uuid": "64b3ab3368ad21651cc13317f111b7a61dde8fa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/india-morningcall/morning-news-call-india-january-19-idUSL3N1PE18W", "country": "US", "domain_rank": 408, "title": "Morning News Call - India, January 19", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T05:31:00.000+02:00", "replies_count": 0, "uuid": "64b3ab3368ad21651cc13317f111b7a61dde8fa9"}, "author": "", "url": "https://www.reuters.com/article/india-morningcall/morning-news-call-india-january-19-idUSL3N1PE18W", "ord_in_thread": 0, "title": "Morning News Call - India, January 19", "locations": [], "entities": {"persons": [{"name": "arijit basu", "sentiment": "none"}, {"name": "v.k. sharma", "sentiment": "none"}, {"name": "arun jaitley", "sentiment": "none"}, {"name": "sandeep bakhshi", "sentiment": "none"}, {"name": "t.s. vijayan", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "wipro", "sentiment": "none"}, {"name": "hdfc standard life ceo amitabh chaudhry", "sentiment": "none"}, {"name": "sbi life insurance", "sentiment": "none"}, {"name": "icici prudential", "sentiment": "none"}, {"name": "lic", "sentiment": "none"}, {"name": "kotak mahindra bank", "sentiment": "none"}, {"name": "national csr data portal and corporate data portal", "sentiment": "none"}, {"name": "hdfc bank", "sentiment": "none"}, {"name": "idfc bank", "sentiment": "none"}, {"name": "icici prudential life insurance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "To access the newsletter, click on the link: here If you would like to receive this newsletter via email, please register at: here FACTORS TO WATCH 10:00 am: IRDAI Chairman T.S. Vijayan, LIC Chairman V.K. Sharma, HDFC Standard Life CEO Amitabh Chaudhry, SBI Life Insurance CEO Arijit Basu, ICICI Prudential CEO Sandeep Bakhshi at Fincon-2018 in Mumbai. 10:30 am: Finance Minister Arun Jaitley at launch of National CSR Data Portal and Corporate Data Portal in New Delhi. 1:00 pm: HDFC Bank post-earnings press conference in Mumbai. 3:00 pm: ICICI Prudential Life Insurance post-earnings analyst conference call in Mumbai. 3:15 pm: Kotak Mahindra Bank post-earnings press conference in Mumbai. 4:30 pm: Jubiliant FoodWorks post-earnings analyst conference call in Mumbai. 5:00 pm: IDFC Bank post-earnings analyst conference call in Mumbai. 5:00 pm: Wipro post-earnings press conference in Bengaluru. 5:00 pm: RBI to release weekly foreign exchange data in Mumbai. 5:30 pm: HDFC Bank post-earnings analyst conference call in Mumbai. 6:30 pm: Reliance Industries post-earnings press conference in Mumbai. 7:00 pm: HDFC Standard Life Insurance post-earnings analyst conference call in Mumbai. GMF:LIVECHAT-WEEKAHEAD Reuters EMEA markets editor Mike Dolan discusses the upcoming week's main market inflection points at 04:30 pm IST.To join the conversation, click on the link: here INDIA TOP NEWS • EXCLUSIVE-India plans to raise health spending by 11 percent in budget; less than requested India is poised to raise its public health spending by 11 percent in the annual budget next month, after rejecting the health minister's demand for a much bigger increase to ramp up disease control, according to government sources and documents. • India to cut tax rates on some goods, services from Jan 25 India will cut rates on some products and services under the new Goods and Services Tax (GST), the finance minister said on Thursday, in a bid to encourage greater compliance as revenues have dipped since the landmark reform was announced in July. • Bharti Airtel Q3 profit misses forecasts India's biggest mobile carrier Bharti Airtel Ltd reported a smaller-than-expected quarterly net profit after the country's telecoms regulator more than halved interconnection fees last year. • Yes Bank Q3 profit rises 22 percent Indian private sector lender Yes Bank Ltd reported a 22 percent rise in third-quarter net profit, slightly above analysts' estimates. • Newgen Software $67 million IPO subscribed 8 times Indian IT services provider Newgen Software Technologies Ltd's initial public offering (IPO) of shares to raise up to 4.25 billion rupees ($66.6 million) was subscribed more than eight times on the last day of the sale on Thursday. • Ultratech Cement Q3 profit falls 23 percent on raw material price rise India's UltraTech Cement Ltd, part of the Aditya Birla Group, on Thursday posted a 23 percent drop in third-quarter profit, hurt by rising pet coke and coal prices. • Hindustan Zinc Q3 profit slips about 4 percent India's Hindustan Zinc Ltd, a unit of Vedanta Ltd, posted a nearly 4 percent fall in third-quarter net profit on Thursday. • HCL Technologies posts lower-than-expected Q3 profit India's HCL Technologies Ltd posted a marginal rise in quarterly profit, but missed estimates, hurt by higher expenses. GLOBAL TOP NEWS • U.S. House passes short-term spending bill; sends to Senate Legislation to avoid a U.S. government shutdown at midnight on Friday advanced in Congress, as the House of Representatives on Thursday night approved an extension of federal funds through Feb. 16, although the bill faced uncertain prospects in the Senate. • SoftBank is now Uber's largest shareholder as deal closes A group of investors led by SoftBank Group Corp closed a deal with Uber Technologies Inc on Thursday, making SoftBank the largest stakeholder in the ride-services firm and providing a much-needed boost to controversy-ridden Uber. • Outback Australians grounded as pilot crisis worsens A recruitment drive by Australia's Qantas Airways Ltd after a seven-year hiatus is exacerbating shortages of pilots at regional air services that provide a lifeline to remote communities in the country's sparsely populated Outback. LOCAL MARKETS OUTLOOK (As reported by NewsRise) • The SGX Nifty Futures were trading at 10,823.00, trading up 0.1 pct from its previous close. • The Indian rupee will likely trade higher against the dollar in early session, tracking gains in most Asian currencies and a fall in global crude oil prices, even as the U.S. Congress passed a short-term spending bill to avoid government closure. • Indian government bonds are likely to fall in early trade ahead of a weekly auction of notes and tracking overnight gains in U.S. Treasury yields. The yield on the benchmark 6.79 pct bond maturing in 2027 is likely to trade in a 7.45 pct-7.50 pct band today. GLOBAL MARKETS • Wall Street fell on Thursday as losses in industrials and interest-rate sensitive sectors offset marginal gains in tech stocks. • Asia stocks edged higher and were within reach of record highs, although losses on Wall Street slowed the advance, while worries over a possible U.S. government shutdown weighed on the dollar. • The U.S. dollar was lodged near a three-year low against a basket of currencies with fears over a possible U.S. government shutdown adding to its underlying woes stemming from its eroding yield advantage. • Yields on U.S. 10-year notes reached a 10-month high on Thursday after China reported fourth-quarter growth that accelerated for the first time in seven years. • Oil prices fell on a bounce-back in U.S. production, but ongoing declines in crude inventories curbed losses in the market. • Gold prices edged up, supported by a weaker dollar and worries about a possible U.S. government shutdown, but the precious metal was still on track for its first weekly drop in six weeks. CLOSE FII INVESTMENTS EQUITIES DEBT PNDF spot 63.81/63.84 January 18 $296.59mln $64.06mln 10-yr bond yield 7.47 pct Month-to-date $522.03mln $615.17mln Year-to-date $522.03mln $615.17mln For additional data: India govt bond market volumes Stock market reports Non-deliverable forwards data Corporate debt stories [IN CORPD] Local market closing/intraday levels [IN SNAPSHOT] Monthly inflows [INFLOWS RTRS TABLE IN] ($1 = 63.86 Indian rupees) (Compiled by Nishit Kunal in Bengaluru)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-19T05:31:00.000+02:00", "crawled": "2018-01-19T06:01:25.054+02:00", "highlightTitle": ""}