{"organizations": [], "uuid": "03cbe2b22a12fd2d8edf24e04352abe6e08e939a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-wheeler-real-estate-investment-trust-inc-announces-launch-of-series-d-preferred-stock-follow-on-offering.html", "country": "US", "domain_rank": 767, "title": "Wheeler Real Estate Investment Trust, Inc. Announces Launch of Series D Preferred Stock Follow-On Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.029, "site_type": "news", "published": "2018-01-09T16:20:00.000+02:00", "replies_count": 0, "uuid": "03cbe2b22a12fd2d8edf24e04352abe6e08e939a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-wheeler-real-estate-investment-trust-inc-announces-launch-of-series-d-preferred-stock-follow-on-offering.html", "ord_in_thread": 0, "title": "Wheeler Real Estate Investment Trust, Inc. Announces Launch of Series D Preferred Stock Follow-On Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "virginia", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "norfolk", "sentiment": "none"}], "organizations": [{"name": "wheeler real estate investment trust, inc", "sentiment": "neutral"}, {"name": "wheeler real estate investment trust, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "inc.", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "nasdaq capital market", "sentiment": "none"}, {"name": "janaf", "sentiment": "none"}, {"name": "ladenburg thalmann & co", "sentiment": "none"}, {"name": "btig", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VIRGINIA BEACH, Va., Jan. 09, 2018 (GLOBE NEWSWIRE) -- Wheeler Real Estate Investment Trust, Inc. (NASDAQ:WHLR) (“Wheeler” or the “Company”), a company specializing in owning, acquiring, financing, developing, renovating, leasing and managing income-producing assets, such as community centers, neighborhood centers, strip centers and free­standing retail properties, announced today that it has commenced a follow-on public offering of Series D Cumulative Convertible Preferred Stock (“Series D Preferred Stock”), subject to market and other conditions. The Company expects to grant the underwriters a 30-day option to purchase additional shares to cover overallotments, if any. The Series D Preferred Stock trades on the Nasdaq Capital Market under the symbol \"WHLRD.”\nThe Company intends to use the net proceeds from this offering to fund a portion of the acquisition price for a retail shopping center located in Norfolk, Virginia known as JANAF.\nLadenburg Thalmann & Co. Inc. and BTIG, LLC are serving as joint-book-running managers for the offering.\nThe offering is being made pursuant to the Company’s shelf registration statement on Form S-3 (Registration No. 333-213294), which was declared effective by the U.S. Securities and Exchange Commission (“SEC”) on September 6, 2016. A preliminary prospectus supplement related to the offering has been filed with the SEC and is available on the SEC's website located at http://www.sec.gov . Copies of the preliminary prospectus supplement and the accompanying prospectus may also be obtained from: Ladenburg Thalmann & Co. Inc., Attention: Equity Syndicate, 570 Lexington Avenue, 12th Floor, New York, NY 10022 or by email: syndicate@ladenburg.com or BTIG, LLC, Attention: Equity Capital Markets, 825 3 rd Avenue, 6 th Floor, New York, NY 10022 or by email: equitycapitalmarkets@btig.com .\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such state or jurisdiction.\nAbout Wheeler Real Estate Investment Trust, Inc.\nHeadquartered in Virginia Beach, VA, Wheeler Real Estate Investment Trust, Inc. specializes in owning, acquiring, financing, developing, renovating, leasing and managing income-producing assets, such as community centers, neighborhood centers, strip centers and free-standing retail properties. Wheeler’s portfolio contains strategically selected properties, primarily leased by nationally and regionally recognized retailers of consumer goods and located in the Northeast, Mid-Atlantic, Southeast and Southwest regions of the United States.\nForward-looking Statements\nThis press release contains “forward-looking” statements as defined in the Private Securities Litigation Reform Act of 1995. When the Company uses words such as “may,” “will,” “intend,” “should,” “believe,” “expect,” “anticipate,” “project,” “estimate” or similar expressions that do not relate solely to historical matters, it is making forward-looking statements. Forward-looking statements are not guarantees of future performance and involve risks and uncertainties that may cause the actual results to differ materially from the Company’s expectations discussed in the forward-looking statements. The Company’s expected results may not be achieved, and actual results may differ materially from expectations. Specifically, the Company’s statements regarding the completion of the proposed follow-on public offering of Series D Preferred Stock on the terms described, or at all, and the Company's proposed use of net proceeds are forward-looking statements. These statements are not guarantees of future performance and are subject to risks, uncertainties and other factors, some of which are beyond our control, are difficult to predict and could cause actual results to differ materially from those expressed or forecasted in the forward-looking statements. For these reasons, among others, investors are cautioned not to place undue reliance upon any forward-looking statements in this press release. Additional factors that could cause actual results to differ materially from those expressed or forecasted in the forward-looking statements are discussed in the Company's filings with the SEC, which are available for review at www.sec.gov . The Company undertakes no obligation to publicly revise these forward‐looking statements to reflect events or circumstances that arise after the date hereof.\nCONTACT:\nWheeler Real Estate Investment Trust, Inc.\nWilkes Graham\nChief Financial Officer\n(757) 627-9088\nwilkes@whlr.us\nLaura Nguyen\nDirector of Investor Relations\n(757) 627-9088\nlaura@whlr.us\nSource:Wheeler Real Estate Investment Trust, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=06fJd1UT41xSGQrG9qxhtbLGLBk4L4XUChA3bB43iuzarGx_r7yJ5-JYf73vtgAVjRJAmy0byLiV7HCqZZEYwbDSKMpJdl55ZFI8jFM4bIQ=", "https://www.globenewswire.com/Tracker?data=UhkM3iTCsyy7LTpaOTacvwpyQMAhRr6zoNUKZsc1L-82s6as0xuUYOzDidrCEkSbSHyFEIHVQ3pZfZyUzdB0MA==", "https://www.globenewswire.com/Tracker?data=FL1BWXwP8W2M7-b_YfLa3bZ9_HMludTb4y8gLHpeygke7qFVVK-bNy7lUYsk6dfoi0FJW9pp0rYmzZWqrvn1bQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/ff2a7382-3289-4942-8a44-a5adfe2c37df", "https://www.globenewswire.com/Tracker?data=Zo6JxhVCzCqmlOtjCa_9OlJfvYLzwBXLkkB9bsgdGkzEWO7nX5ExMieFQbc2SIS3cwKlo84AWiNllwZeH3SQnA==", "https://www.globenewswire.com/Tracker?data=r_4QnXS643cZF1Gsm8BnVaq356aPlRjQyztv5R5N8Fx4LHDA1_EXOxMS188uequtlT5dW__5mEUGMaL5ZPx1vA=="], "published": "2018-01-09T16:20:00.000+02:00", "crawled": "2018-01-09T17:39:58.004+02:00", "highlightTitle": ""}