{"organizations": [], "uuid": "8a0763cff780ec05ed4f413b5bb36157d1e444a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-todd-weld-expands-adding-four-accomplished-trial-lawyers.html", "country": "US", "domain_rank": 767, "title": "Todd & Weld Expands, Adding Four Accomplished Trial Lawyers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.47, "site_type": "news", "published": "2018-01-09T15:00:00.000+02:00", "replies_count": 0, "uuid": "8a0763cff780ec05ed4f413b5bb36157d1e444a4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-todd-weld-expands-adding-four-accomplished-trial-lawyers.html", "ord_in_thread": 0, "title": "Todd & Weld Expands, Adding Four Accomplished Trial Lawyers", "locations": [], "entities": {"persons": [{"name": "weld", "sentiment": "negative"}, {"name": "todd", "sentiment": "negative"}, {"name": "cirel", "sentiment": "none"}, {"name": "paul cirel", "sentiment": "none"}, {"name": "cloherty", "sentiment": "none"}, {"name": "daniel cloherty", "sentiment": "none"}, {"name": "steinberg", "sentiment": "none"}, {"name": "hogan lovells", "sentiment": "none"}, {"name": "ingrid martin", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "victoria steinberg", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "weld llp", "sentiment": "none"}, {"name": "collora llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON--(BUSINESS WIRE)-- Four highly accomplished trial attorneys have joined Boston law firm Todd & Weld LLP as partners, significantly expanding its capabilities in white-collar defense, government investigations, complex business disputes, employment law, and other litigation practice areas.\nAttorneys Paul Cirel , Ingrid Martin , Daniel Cloherty and Victoria Steinberg join Todd & Weld after many years as partners at Collora LLP, a Boston boutique litigation firm, which recently combined with the global firm, Hogan Lovells.\nThe addition of Cirel, Martin, Cloherty and Steinberg further enhances Todd & Weld’s ability to provide clients with the trial experience and courtroom skills to take on any type of white collar matter, regulatory investigation or prosecution, and business dispute.\nCirel and Martin practice at the intersection of criminal defense and health care law, providing organizations and individuals with all-encompassing expertise for their legal needs. Both former prosecutors, Cirel and Martin represent medical practices and a wide breadth of health care professionals and companies, including clinical laboratories, medical device companies, home health agencies, and pharmacies.\nCloherty’s federal criminal defense expertise extends to representing businesses and individuals in government investigations and enforcement matters involving allegations of securities fraud, health care fraud, bank and mail fraud, and embezzlement, among other offenses.\nWith the addition of Cirel, Martin and Cloherty to the firm’s already robust team of white collar criminal defense attorneys – including partners Howard Cooper, David Meier, Max Stern, Melinda Thompson, and J. Owen Todd – Todd & Weld offers clients deep knowledge and understanding of a diverse range of regulatory issues, investigations, enforcement proceedings, and litigation.\nCloherty and Steinberg bring more than three decades of combined experience litigating complex business disputes and employment matters in federal and state courts. In the employment arena, they represent clients in wage and hour disputes, defend businesses and individuals against claims of discrimination, retaliation and wrongful termination, and litigate disputes relating to non-competition, non-solicitation and confidentiality agreements.\nThey also regularly represent educational institutions in significant civil matters, including Title IX-related investigations and litigation. Cloherty and Steinberg join Todd & Weld's already strong group of trial lawyers to form one of the most well-recognized and experienced business and employment litigation teams in New England.\n“Paul and Ingrid are go-to lawyers for their committed and successful representation of individuals and companies in the health care industry in high-stakes matters,” said Christopher Weld Jr. , Todd & Weld's Managing Partner. “Danny and Vicky bring complimentary civil litigation and criminal defense practices that align with Todd & Weld’s longstanding reputation as a leader in successful, results-oriented commercial, business, and employment litigation in federal and state court.”\nAbout Todd & Weld LLP\nHeadquartered in Boston, the firm's 43 attorneys (20 partners) appear regularly in federal and state courts in Massachusetts, New England, and other jurisdictions throughout the country, as well as before various administrative agencies. The firm is widely recognized as providing its clients with litigation excellence and organizational efficiency.\nIn 1992, Todd & Weld founders established a firm of trial lawyers committed to achieving the highest level of trial advocacy. Their mission is to apply the lessons learned from years of litigation practice and courtroom battles to establish a cutting edge, creative, and focused trial firm employing state of the art technology, enthusiastic staff, and creative and driven attorneys. With uncompromising dedication to its mission, Todd & Weld has grown into a preeminent trial firm through a steady stream of referrals from individuals, companies, and attorneys from all over the world.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109005299/en/\nTodd & Weld LLP\nPaul D. Boynton, Esq., 617-624-4742\npboynton@toddweld.com\nSource: Todd & Weld LLP", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.toddweld.com%2Fvictoria-l-steinberg&esheet=51739733&newsitemid=20180109005299&lan=en-US&anchor=Victoria+Steinberg&index=5&md5=36825382f248b5729f9a330b68425f3e", "http://www.businesswire.com/news/home/20180109005299/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.toddweld.com%2F&esheet=51739733&newsitemid=20180109005299&lan=en-US&anchor=Todd+%26+Weld+LLP&index=1&md5=44a410bcb71df302446d2b47eaeb2afe", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.toddweld.com%2Fchristopher-weld&esheet=51739733&newsitemid=20180109005299&lan=en-US&anchor=Christopher+Weld+Jr.&index=6&md5=ed1776e5ef838406c397894e8f481f8a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.toddweld.com%2Fpaul-cirel&esheet=51739733&newsitemid=20180109005299&lan=en-US&anchor=Paul+Cirel&index=2&md5=ef45d417fcbc7f4185c74e1996993ce2", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.toddweld.com%2Fdaniel-j-cloherty&esheet=51739733&newsitemid=20180109005299&lan=en-US&anchor=Daniel+Cloherty&index=4&md5=70d2e018a5cd1e1ee17e2bcd1abc79e4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.toddweld.com%2Fingrid-s-martin&esheet=51739733&newsitemid=20180109005299&lan=en-US&anchor=Ingrid+Martin&index=3&md5=a4ef81abfb6e3ded4a4a02e0c4b6cc30"], "published": "2018-01-09T15:00:00.000+02:00", "crawled": "2018-01-09T15:40:32.024+02:00", "highlightTitle": ""}