{"organizations": [], "uuid": "0a1bad64b88769929530682154939d410ddb2317", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222464472&w=1200&r=LYNXMPEE0F157", "site_section": "http://feeds.reuters.com/reuters/politicsNews/", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-trump-russia-manafort/u-s-judge-delays-setting-trial-date-for-trump-ex-aide-manafort-idUSKBN1F520D", "country": "US", "domain_rank": 408, "title": "U.S. judge delays setting trial date for Trump ex-aide Manafort", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T18:05:00.000+02:00", "replies_count": 0, "uuid": "0a1bad64b88769929530682154939d410ddb2317"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-russia-manafort/u-s-judge-delays-setting-trial-date-for-trump-ex-aide-manafort-idUSKBN1F520D", "ord_in_thread": 0, "title": "U.S. judge delays setting trial date for Trump ex-aide Manafort", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "manafort", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "chizu nomiyama", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}, {"name": "rod rosenstein", "sentiment": "none"}, {"name": "paul manafort", "sentiment": "none"}, {"name": "sarah n. lynch", "sentiment": "none"}, {"name": "susan heaveyediting", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "u.s. special counsel’s office", "sentiment": "none"}, {"name": "manafort reuters", "sentiment": "none"}, {"name": "u.s. district court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - A federal judge on Tuesday delayed setting a trial date for President Donald Trump’s former campaign manager Paul Manafort, who faces charges stemming from a special counsel’s probe of allegations of Russian interference in the U.S. presidential election.\nDefense lawyers said the government had not produced all the evidence it gathered and they needed more time to study it and file motions.\n“We have limited resources,” Manafort attorney Kevin Downing said. “We’re not big law firms.”\nThe government had sought a May start to the trial. But Judge Amy Berman Jackson said at Tuesday’s hearing in the U.S. District Court for the District of Columbia that a trial for Manafort and his business partner Richard Gates might not start until the fall.\nShe admonished Gates and his lawyers for violating a gag order that prohibited discussing the case with the press after journalists were invited to attend a December legal defense fundraiser.\nShe also agreed to release Gates from home confinement.\nIn exchange, he agreed to post a $5 million bond, stay in the Richmond, Virginia area, abide by a curfew and wear an electronic monitoring device.\nManafort and Gates face charges that include failing to register as foreign agents for political work they did for a pro-Russia Ukrainian political party, as well as conspiracy to launder money and conspiracy against the United States.\nFederal prosecutors said on Tuesday they expect to need at least three weeks to present their case to a jury. This will ensure continuing news coverage of the investigation by Special Counsel Robert Mueller, which the Trump administration has repeatedly sought to discredit.\nTrump has denied there was any collusion, and Russia has denied meddling in the election.\nManafort has also denied any wrongdoing.\nEarlier this month, his lawyers took the unusual step of filing a civil lawsuit against Mueller, Deputy Attorney General Rod Rosenstein and the Justice Department, accusing them of legal overreach. The suit asks that the indictment be dismissed because it alleges conduct that falls outside the bounds of what Mueller is permitted to investigate.\nProsecutors said Tuesday they intend to file a motion by Feb. 2 to have that civil case dismissed on the grounds that the issues it raises should be addressed in the criminal case.\nMeanwhile, the judge gave Manafort and Gates until Feb. 23 to file motions that seek to address alleged defects in the criminal case.\nThe next status conference in the case will be on Feb. 14, and motions will be argued in a hearing April 17.\nBerman Jackson urged lawyers for Gates and Manafort to use “common sense” and refrain from conducting outreach to the press, after learning reporters were invited to a Dec. 19 legal defense fundraiser for Gates held by lobbyist Jack Burkman.\nDuring the event, Burkman reportedly said Gates was the victim of “an unfair prosecution” and he played a video clip of Gates, who thanked Burkman and his other supporters.\nThis marks the second time the judge has warned the defendants not to discuss the case in the press.\nEarlier, she was irked after Manafort helped ghostwrite an opinion piece that put a positive spin on the political work he did for Ukraine.\nAlthough the judge previously agreed to release Manafort from home confinement, he has remained homebound amid wrangling over whether he can satisfy the conditions she required.\nOn Tuesday, Downing claimed that the judge inadvertently set the bond at $17 million, instead of the agreed upon $10 million.\n“I don’t think I did that,” she quipped, adding that if she did, he has had a month to point out the error.\n“The keys to his release lie with him,” she said.\nReporting by Sarah N. Lynch; Writing by Susan Heavey; Editing by David Gregorio and Cynthia Osterman\n ", "external_links": [], "published": "2018-01-16T18:05:00.000+02:00", "crawled": "2018-01-16T18:22:31.000+02:00", "highlightTitle": ""}