{"organizations": [], "uuid": "236b42fec1c76bca4794a291089f75e357ebd3aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/sainsburys-outlook/update-1-sainsburys-cautious-on-2018-as-christmas-sales-just-beat-forecasts-idUSL8N1P50XM", "country": "US", "domain_rank": 408, "title": "UPDATE 2-General merchandise warning overshadows Sainsbury's Christmas sales beat", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:53:00.000+02:00", "replies_count": 0, "uuid": "236b42fec1c76bca4794a291089f75e357ebd3aa"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/sainsburys-outlook/update-1-sainsburys-cautious-on-2018-as-christmas-sales-just-beat-forecasts-idUSL8N1P50XM", "ord_in_thread": 0, "title": "UPDATE 2-General merchandise warning overshadows Sainsbury's Christmas sales beat", "locations": [], "entities": {"persons": [{"name": "james davey", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "sainsbury", "sentiment": "negative"}, {"name": "argos", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Beats sales growth forecasts for Christmas quarter\n* General merchandise sales fall, clothing sales growth slows\n* Profit guidance raised on faster Argos synergies\n* Shares up 1.4 pct (Adds detail, CEO, analyst comment, shares)\nBy James Davey\nLONDON, Jan 10 (Reuters) - British supermarket group Sainsbury’s cautioned on Wednesday that the market for general merchandise and clothing would be tough in 2018, taking the shine off a slight upgrade to its forecast for annual profit.\nWith Britons under pressure from slow wage growth compounded by higher inflation, company updates and survey data this month show they cut back on almost everything other than food purchases in the run-up to Christmas.\nSainsbury‘s, which extended its product range when it bought toys and electricals retailer Argos for 1.1 billion pounds ($1.5 billion) in 2016, indicated that trend would continue this year.\n“We have to acknowledge the fact that the (non-food) market is challenging and there’s certainly a little bit of a squeeze on consumer disposable income and where people are able to defer purchases they do,” Chief Executive Mike Coupe told reporters.\n“We have to be slightly cautious in our outlook because it’s reflective of the current consumer environment.”\nSainsbury‘s, the UK’s second biggest supermarket group, said its general merchandise sales fell 1.4 percent in the 15 weeks to Jan. 6, its fiscal third quarter, having fallen 1.6 percent in the previous quarter. Clothing sales rose 1 percent, a sharp slowdown from second quarter growth of 6.3 percent.\nCoupe said Sainsbury’s still won market share in general merchandise and clothing despite the “challenging conditions”.\nHe said UK consumers tightening their belts could in fact benefit Sainsbury’s food business since “people eat out less and tend to eat in.”\nHowever, competition is intense in that part of the business where Lidl and rival German discounter Aldi UK have both said they will step-up investment in 2018, keeping up the pressure on Britain’s established big four supermarkets.\nCHRISTMAS CHEER Sainsbury’s said third quarter retail like-for-like sales, excluding fuel, rose 1.1 percent - ahead of analysts’ average forecast of 0.9 percent and growth of 0.6 percent in the previous quarter.\nIts shares, down 3 percent over the last year, were up 1.4 percent at 1120 GMT.\nTotal grocery sales grew 2.3 percent with groceries online and convenience store sales up 8.2 percent and 7.3 percent respectively. Online accounted for a fifth of the group’s sales during the quarter.\nCoupe said grocery sales volumes “went backwards slightly” in the quarter but predicted food price inflation would fall out of the sector over the next six to eight months.\nOn Tuesday Britain’s fourth ranked supermarket chain Morrisons beat Christmas sales growth forecasts while industry data indicated market leader Tesco outperformed its listed rivals during the festive quarter. Tesco will update on Thursday.\nOn Wednesday discounter Lidl UK said its total sales grew 16 percent in the Christmas period.\nSainsbury’s said it now expected to achieve 80-85 million pounds ($108-115 million) of earnings synergies from Argos by March 2018, ahead of previous guidance of 65 million pounds.\nAs a consequence underlying pretax profit for the full 2017-18 year would be moderately ahead of the published analysts’ consensus - an underlying pretax profit of 559 million pounds ($755.77 million), down from 581 million in 2016-17.\n“The improved profit outlook is essentially through bringing forward synergies (of which the ultimate total has not changed) – rather than the company’s own underlying expectations having changed materially,” said analysts at Barclays. ($1 = 0.7409 pounds)\nEditing by Keith Weir\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T15:53:00.000+02:00", "crawled": "2018-01-11T12:41:58.020+02:00", "highlightTitle": ""}