{"organizations": [], "uuid": "e2f9d456c145c0992f82858a7a87d4fc04ca3279", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/02/reuters-america-update-7-oil-hits-highest-since-mid-2015-then-dips-on-output-restarts.html", "country": "US", "domain_rank": 767, "title": "UPDATE 7-Oil hits highest since mid-2015, then dips on output restarts", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T20:34:00.000+02:00", "replies_count": 0, "uuid": "e2f9d456c145c0992f82858a7a87d4fc04ca3279"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/reuters-america-update-7-oil-hits-highest-since-mid-2015-then-dips-on-output-restarts.html", "ord_in_thread": 0, "title": "UPDATE 7-Oil hits highest since mid-2015, then dips on output restarts", "locations": [], "entities": {"persons": [], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "uk north sea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Anti-government protests have rocked Iran\n* Brent, WTI crude begin year above $60, 1st time since 2014\n* Libyan, UK North Sea oil pipelines restart\n* OPEC supply cuts have lifted crude prices (Updates prices)\nLONDON, Jan 2 (Reuters) - Oil prices eased on Tuesday after hitting mid-2015 highs in early trading, as major pipelines in Libya and the UK restarted and U.S production soared to the highest level in more than four decades.\nIt was the first time since January 2014 that the two crude oil benchmarks opened the year above $60 per barrel, buoyed by large anti-government rallies in Iran and supply cuts led by OPEC and Russia.\nU.S. West Texas Intermediate (WTI) crude futures traded 16 cents lower at $60.26 a barrel by 1:23 p.m. EST (1823 GMT). In early trading WTI hit $60.74, the highest level since June 2015.\nBrent crude futures, the international benchmark, were down 45 cents, or 0.7 percent at $66.42 a barrel. The session high of $67.29 was the highest since May 2015.\nThe spread between U.S. crude and Brent <WTCLc1-LCoc1> hit the narrowest in nearly two weeks.\nThe 450,000 barrel per day (bpd) capacity Forties pipeline system in the North Sea returned to full operations on Dec. 30 after an unplanned shutdown.\nRepairs have been completed on a Libyan oil pipeline damaged in a suspected attack last week and production is restarting gradually, engineers said.\n\"The resolution of the North Sea pipeline issue is having the expected result that the Brent-WTI spread is narrowing today,\" David Thompson, executive vice-president at Powerhouse, an energy-specialized commodities broker in Washington.\nThompson added that traders have been returning to work from the holidays, boosting volumes.\n\"Despite the day's price weakness, both Brent and WTI remain in solid, long-term bullish trends - $58.95 is nearby support on WTI front-month futures and $65.60 is the corresponding support on front-month Brent futures.\"\nIran's Supreme Leader on Tuesday accused the country's enemies of stirring unrest, as the death toll rose to 21 from anti-government demonstrations that began last week.\nIran is OPEC's third-largest crude producer. Iranian oil industry and shipping sources said protests have had no impact so far on oil production or exports.\n\"Geopolitical risks are clearly back on the crude oil agenda after having been absent almost entirely since the oil market ran into a surplus in the second half of 2014,\" Bjarne Schieldrop, chief commodities analyst at SEB, said, also citing Kurdistan and Libya.\nOil markets have been supported by a year of production cuts led by the Middle East-dominated Organization of the Petroleum Exporting Countries and Russia. The cuts started in January 2017 and are scheduled to cover all of 2018.\nU.S. commercial crude oil inventories have fallen by almost 20 percent from their historic highs last March, to 431.9 million barrels.\nStrong demand growth, especially from China, has also been supporting crude.\nHowever, rising U.S. production, which is on the verge of breaking through 10 million bpd, has tempered the bullish outlook.\n\"We think U.S. tight oil production growth warrants close monitoring as it could spoil OPEC's market-balancing efforts, pushing the market into surplus in 2018,\" Barclays bank said.\nOctober U.S crude production rose 167,000 barrels per day to 9.64 million bpd, according to the EIA's monthly production report. If the figure is not revised next month, it would be the highest monthly level since May 1971.\n(Additional reporting by Henning Gloystein in Singapore; editing by David Gregorio and Susan Thomas)", "external_links": [], "published": "2018-01-02T20:34:00.000+02:00", "crawled": "2018-01-03T04:33:18.003+02:00", "highlightTitle": ""}