{"organizations": [], "uuid": "e58cbe52459bb4f01615b6d1cfa3f6780b05e561", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223141900&w=1200&r=LYNXMPEE0H1ZK", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-gm-ignition/judge-tosses-gm-settlement-on-ignition-switch-idUSKBN1F731W", "country": "US", "domain_rank": 408, "title": "Judge tosses GM settlement on ignition switch", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:11:00.000+02:00", "replies_count": 0, "uuid": "e58cbe52459bb4f01615b6d1cfa3f6780b05e561"}, "author": "", "url": "https://www.reuters.com/article/us-gm-ignition/judge-tosses-gm-settlement-on-ignition-switch-idUSKBN1F731W", "ord_in_thread": 0, "title": "Judge tosses GM settlement on ignition switch", "locations": [], "entities": {"persons": [{"name": "martin glenn", "sentiment": "none"}, {"name": "tina bellon", "sentiment": "none"}, {"name": "leslie adler", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "gm", "sentiment": "negative"}, {"name": "general motors co", "sentiment": "none"}, {"name": "u.s. bankruptcy court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 9:13 PM / Updated 17 minutes ago Judge tosses GM settlement on ignition switch Tina Bellon 3 Min Read \nNEW YORK (Reuters) - A federal bankruptcy judge on Thursday said a settlement agreement that would require General Motors Co ( GM.N ) to pay $1 billion in stock to car owners suing the company over faulty ignition switches was not enforceable. \nJudge Martin Glenn of the U.S. Bankruptcy Court in New York said the agreement that car owners had reached with a trust that holds many GM liabilities from before its 2009 bankruptcy was not valid without signatures. \nThe claims stem from GM’s 2014 recall of 2.6 million vehicles with defective ignition switches, including one linked to 124 deaths. \nLawyers for the car owners and the trust had agreed to a deal in August, but never signed the agreement. The trust walked away several days later, instead accepting GM’s offer to help pay for the trust’s defense against the car owners’ claims. \nGlenn blasted the lawyers of the trust in his Thursday order, saying their “dishonesty, or bad faith, was not lost” on him. But he said that despite the trust’s last-minute turnabout, applicable law did not allow the enforcement of an unexecuted agreement. \nSteve Berman, one of the lawyers representing the car owners, in a statement said his side was disappointed but saw a victory in the ruling nevertheless. \n“Judge Glenn clearly thought the trustee and (law firm) Gibson Dunn acted in bad faith and we see therefore they both must be removed as trustee,” Berman said, adding that plaintiffs would take up settlement talks with a new trustee. \nGM declined to comment. A lawyer for the trust did not immediately respond to a request for comment. \nUnder the deal the plaintiffs lawyers worked out, GM would have been required to contribute $1 billion in stock to compensate car owners. \nThe settlement called for the trust to accept $10 billion in claims to resolve about 11.9 million allegations over economic loss and between 400 and 500 personal injury and wrongful death claims. \nAbout 2.4 million claims, involving vehicles sold after GM’s bankruptcy, would have remained pending in another court. \nGM has already paid roughly $2.5 billion to settle ignition switch-related claims, including $900 million to settle a criminal probe by the U.S. Justice Department. Reporting by Tina Bellon; Editing by Leslie Adler", "external_links": [], "published": "2018-01-18T23:11:00.000+02:00", "crawled": "2018-01-18T23:28:04.011+02:00", "highlightTitle": ""}