{"organizations": [], "uuid": "67778e10ded2acfb71bdf2b9e81d73100dc61a6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-natus-medical-announces-2018-annual-and-first-quarter-financial-guidance.html", "country": "US", "domain_rank": 767, "title": "Natus Medical Announces 2018 Annual and First Quarter Financial Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.22, "site_type": "news", "published": "2018-01-08T14:50:00.000+02:00", "replies_count": 0, "uuid": "67778e10ded2acfb71bdf2b9e81d73100dc61a6c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-natus-medical-announces-2018-annual-and-first-quarter-financial-guidance.html", "ord_in_thread": 0, "title": "Natus Medical Announces 2018 Annual and First Quarter Financial Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "pleasanton", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}, {"name": "natus medical incorporated", "sentiment": "none"}, {"name": "non-gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Announces Fourth Quarter preliminary revenue results Announces Fourth Quarter 2017 Financial Results Conference Call Date\nPLEASANTON, Calif., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Natus Medical Incorporated (NASDAQ:BABY) today announced its financial guidance for the first quarter and full year 2018.\nFor the full year 2018, the Company expects to report revenue of $535.0 to $540.0 million and non-GAAP earnings per share of $1.60 to $1.65. For the first quarter of 2018, the Company expects to report revenue of $125.0 to $127.0 million and non-GAAP earnings per share of $0.23 to $0.24. The first quarter and full year of 2017 included approximately $10.0 million in revenue from a non-recurring contract with Venezuela that is not expected to reoccur in 2018.\nThe full year and first quarter 2018 non-GAAP guidance does not include expenses for the U.S. medical device tax, which is expected to be repealed or suspended early in 2018. If not repealed or suspended, the medical device tax will have an annual after tax cost of approximately $3.0 million.\nThe Company expects to report revenue of approximately $131.0 to $132.0 million for the fourth quarter of 2017, and full year 2017 of $500.5 to $501.5 million.\n“Revenue in the fourth quarter was lower than expected due to weakness in our U.S. Neurodiagnostic business. In addition, due in part to disruption from the integration of computer systems, fourth quarter revenue was also lower than expected at Otometrics. Revenue from our recently acquired neurosurgery business was slightly above our expectations. Newborn Care revenue performed as expected,” said Jim Hawkins, President and Chief Executive Officer of Natus.\n“We are increasing investments in key product areas in 2018, including Otoscan and certain Newborn Care and Neuro products which will drive future organic growth opportunities and maintain Natus' leading position in these important markets,” Hawkins said.\n“Our planned launch of Otoscan early in the year will provide minimal revenue in the first half of 2018 and we will incur additional development and product launch expenses related to its introduction. We expect Otoscan revenues to ramp in the second half of 2018. We believe Otoscan is a game changing product that will revolutionize the hearing aid fitting market,” Hawkins said.\n“Many of these investments started in 2017 and will continue throughout 2018. We believe the return on this additional investment will be rewarded with greater long term organic revenue growth and operating margin expansion,” Hawkins continued.\nThe Company will release its 2017 fourth quarter financial results before the market opens on February 7, 2018.\nUse of Non-GAAP Financial Guidance\nThe Company’s non-GAAP earnings per share guidance excludes non-cash charges for amortization expense associated with intangible assets from prior acquisitions, which the Company expects to be approximately $30.0 million and $7.5 million for the full year and first quarter 2018, respectively, and which the Company expects will reduce GAAP earnings per share by approximately $0.72 and $0.18 for the respective periods. Non-GAAP earnings per share guidance also excludes certain remediation costs related to the Company's FDA warning letter and the U.S. medical device tax. The company expects the excluded remediation costs will reduce GAAP earnings per share by approximately $0.14 and $0.03 for the respective periods. The medical device tax, if retained, is expected to reduce GAAP earnings per share by approximately $0.07 and $0.01 for the respective periods.\nThe Company believes that the presentation of financial guidance excluding these charges provides meaningful information to both management and investors that is indicative of the Company's core operating results.\nAbout Natus Medical\nNatus is a leading provider of healthcare products and services used in the screening, detection, treatment, monitoring and tracking of common medical ailments in newborn care, hearing impairment, neurological dysfunction, neurosurgery, epilepsy, sleep disorders, and balance and mobility disorders.\nForward Looking Statements\nThis press release contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, particularly statements regarding the expectations, beliefs, plans, intentions and strategies of Natus. These forward-looking statements include statements regarding the anticipated revenue of the fourth quarter of 2017 and the revenue and non-GAAP earnings per share for the first quarter and full year 2018 and the impact of amortization expense associated with acquisition-related intangible assets. These statements relate to current estimates and assumptions of our management as of the date of this press release and involve known and unknown risks, uncertainties and other factors that may cause actual results, levels of activity, performance, or achievements to differ materially from those expressed or implied by the forward-looking statements. Forward-looking statements are only predictions and the actual events or results may differ materially. Natus cannot provide any assurance that its future results or the results implied by the forward-looking statements will meet expectations. Our future results could differ materially due to a number of factors, including the effects of competition, changes in U.S. and foreign tax laws, our ability to meet government regulations on medical devices, the successful integration of the Otometrics acquisition and achieving our profitability goals for Otometrics, the demand for our products and services, the impact of adverse global economic conditions, including foreign exchange rate changes, on our target markets, our ability to expand our sales in international markets, our ability to maintain current sales levels in a mature domestic market, our ability to control costs, risks associated with bringing new products to market and integrating acquired businesses and our ability to fulfill product orders on a timely basis. Natus disclaims any obligation to update information contained in any forward looking statement.\nMore information about potential risk factors that could affect the business and financial results of Natus is included in Natus' annual report on Form 10-K for the year ended December 31, 2016, and its subsequent quarterly reports on Form 10-Q, and in other reports filed from time to time by Natus with the U.S. Securities and Exchange Commission.\nAdditional information about Natus Medical can be found at www.natus.com .\nCOMPANY CONTACT:\nNatus Medical Incorporated\nJonathan A. Kennedy\nExecutive Vice President and Chief Financial Officer\n(925) 223-6700\nInvestorRelations@Natus.com\nSource:Natus Medical Incorporated", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/ef749ae4-603e-422d-87ba-6d231cefb70a"], "published": "2018-01-08T14:50:00.000+02:00", "crawled": "2018-01-08T15:34:36.009+02:00", "highlightTitle": ""}