{"organizations": [], "uuid": "a32f8a34852809287ab44f8c829625ad03b04207", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-chicago-bonds/chicago-postpones-898-million-bond-sale-eyes-new-structure-idUSKBN1F62S4", "country": "US", "domain_rank": 408, "title": "Chicago postpones $898 million bond sale, eyes new structure", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T04:18:00.000+02:00", "replies_count": 0, "uuid": "a32f8a34852809287ab44f8c829625ad03b04207"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-chicago-bonds/chicago-postpones-898-million-bond-sale-eyes-new-structure-idUSKBN1F62S4", "ord_in_thread": 0, "title": "Chicago postpones $898 million bond sale, eyes new structure", "locations": [], "entities": {"persons": [{"name": "carole brown", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "sales tax securitization corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO (Reuters) - Chicago on Wednesday postponed an $898 million bond sale until next week at the earliest, citing weaker market conditions and the possibility of restructuring the deal to include taxable debt.\nThe revenue bond issue, which topped this week’s $3.45 billion supply calendar in the U.S. municipal market, was aimed at refinancing some of Chicago’s outstanding general obligation debt through a newly created Sales Tax Securitization Corporation.\nChicago Chief Financial Officer Carole Brown pointed to a weaker market tone and the fact that ratios between yields on tax-exempt muni bonds and comparable taxable U.S. Treasuries have risen since the city sold the first $743.7 million of bonds through the corporation in early December to refinance outstanding sales tax revenue debt. The ratios gauge the expensiveness or cheapness of munis versus Treasuries.\n“We have the flexibility and the time to possibly evaluate some alternative structuring options and make sure we are offering the appropriate deal to the market given the current market environment,” she said in a telephone interview.\nWhile the deal was meant to refund outstanding GO bonds callable within 90 days, the city could add a taxable component to refund debt callable beyond 90 days, according to Brown. The new federal tax law eliminated tax exemption for advance-refunded munis.\nThe tax-exempt bond deal was initially structured with serial maturities from 2031 through 2039 and a term maturity in 2042.\nChicago created the sales tax securitization corporation last year to refinance up to $3 billion of its sales tax revenue and GO bonds, and produce an initial $94 million in savings for the city’s fiscal 2018 budget.\nA chronic structural budget deficit, as well as a huge unfunded pension liability that totaled $35.76 billion at the end of 2016, have led to low credit ratings and increased borrowing costs for the nation’s third-largest city.\nThe corporation is pledging Chicago’s state-collected sales tax revenue to pay off the new bonds. Investors will get a statutory lien shielding the debt from municipal bankruptcy, which is not allowed under Illinois law.\nThe bonds are rated AAA by Fitch Ratings and AA by S&P Global Ratings, both of which are several notches higher than the city’s GO ratings of BBB-minus by Fitch and BBB-plus by S&P.\nReporting by Karen Pierog; Editing by Matthew Lewis\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T04:18:00.000+02:00", "crawled": "2018-01-18T16:14:36.004+02:00", "highlightTitle": ""}