{"organizations": [], "uuid": "9a195117cf00c34d32408654e4e13a210be6bc29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-resume-ascent-on-earnings-hopes-euro-gets-lift-from-ecb-idUSL4N1P71P0", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Stocks resume ascent on earnings hopes, euro gets lift from ECB", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-12T11:03:00.000+02:00", "replies_count": 0, "uuid": "9a195117cf00c34d32408654e4e13a210be6bc29"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-resume-ascent-on-earnings-hopes-euro-gets-lift-from-ecb-idUSL4N1P71P0", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Stocks resume ascent on earnings hopes, euro gets lift from ECB", "locations": [], "entities": {"persons": [{"name": "hideyuki sano", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Asia ex-Japan up 0.5 pct, Nikkei down 0.1 pct\n* World stocks at record high on earnings optimism\n* Euro gains as ECB could signal end of stimulus\n* Oil at 3-year high on tight supply\nBy Hideyuki Sano\nTOKYO, Jan 12 (Reuters) - Asian stocks resumed their ascent on Friday, supported by U.S. earnings optimism and a rise in oil prices while the euro edged higher as the European Central Bank signalled an end to its massive stimulus.\nMSCI’s broadest index of Asia-Pacific shares outside Japan rose 0.5 percent, following two straight sessions of decline. Japan’s Nikkei dipped 0.1 percent.\nChina’s custom-cleared trade data showed brisk growth in exports and imports in 2017, underscoring a global economy that continues to hum along nicely.\nWall Street’s three major stock indexes hit record highs with earnings for S&P 500 companies expected to have increased by 11.8 percent in the recently-ended quarter, according to Thomson Reuters I/B/E/S.\nMSCI’s broadest gauge of the world’s stock markets also hit a record high on Thursday, having risen in seven of the eight business days so far this year for a total increase of 3.3 percent.\nThe energy sector led the gains as oil prices rose to three-year highs while interest rate sensitive-sectors, such as utilities and real estate companies, underperformed.\nU.S. Treasury yields fell on Thursday after China disputed a media report that its government officials had recommended the country slow or halt its purchases of U.S. bonds.\nChina’s currency regulator dismissed the report but said it is diversifying its foreign exchange reserves in order to safeguard their value.\n“China is starting to rebuild its forex reserves so it does not make sense economically that China would want to stop buying U.S. Treasuries,” said Shuji Shirota, head of macro economics strategy group at HSBC in Tokyo.\nThe 10-year Treasuries yield stood at 2.550 percent , off Wednesday’s ten-month high of 2.597 percent.\nOn the other hand, the benchmark German 10-year Bunds yield hit a five-month high of 0.532 percent after accounts of the ECB’s December meeting showed it thinks it should revisit its communication stance in early 2018.\nWith the euro zone seeing its best growth in a decade, the ECB should gradually shift its stance to avoid a more disruptive move later and look at a broader revision of its policy guidance to reduce the focus on bond purchases and raise the emphasis on interest rates, they showed.\n“I would imagine the ECB is dying to give it a try to end negative interest rates after September. If that doesn’t go down well in markets, the bank will modify its message but it should want to at least test the water,” said Yoshinori Shigemi, global market strategist at JPMorgan Asset Management.\nThe ECB has pledged to continue its bond purchase programme at least until September and investors expect any rate hike to take place next year.\nThe euro’s overnight index swap rates have risen sharply this week as traders price in higher chance of a rate hike early next year.\nThe euro rose back above $1.2 and last traded at $1.2048, near its three-month high of $1.2089 touched last week.\nOn the other hand, the dollar was broadly weak after U.S. wholesale price dipped in December from November, reinforcing investors’ expectations of a tame inflation.\nThe U.S. currency slipped to a six-week low of 111.05 yen on Thursday and last stood at 111.21 yen.\nBitcoin flirted with this year’s low, having fallen 11.1 percent on Thursday after the government in South Korea, a major source of digital currency demand, unveiled plans to ban cryptocurrency trading.\nOn the Bitstamp Exchange, it traded at $13,431, up 1.6 percent but not far from Thursday’s low of $12,800, which was its lowest level since Dec. 31.\nOil prices retreated from big gains the previous day but still traded near three-year highs on signs of tightening supply in the United States.\nU.S. West Texas Intermediate (WTI) crude futures changed hands at $63.58, down 0.3 percent on the day. The day before they hit its strongest since late 2014 at $64.77 a barrel.\nBrent crude futures were little changed for day at $69.28 a barrel after hitting $70.05 a barrel during the previous session, its highest level since November 2014. (Editing by Sam Holmes)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T11:03:00.000+02:00", "crawled": "2018-01-12T18:38:35.000+02:00", "highlightTitle": ""}