{"organizations": [], "uuid": "6a8a197e990ad77b31e5d52b095d34b474e07f41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-pellepharm-appoints-sanuj-k-ravindran-m-d-as-president-and-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "PellePharm Appoints Sanuj K. Ravindran, M.D., as President and Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:00:00.000+02:00", "replies_count": 0, "uuid": "6a8a197e990ad77b31e5d52b095d34b474e07f41"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-pellepharm-appoints-sanuj-k-ravindran-m-d-as-president-and-chief-executive-officer.html", "ord_in_thread": 0, "title": "PellePharm Appoints Sanuj K. Ravindran, M.D., as President and Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "sanuj k. ravindran", "sentiment": "negative"}, {"name": "ravindran", "sentiment": "none"}, {"name": "ervin epstein", "sentiment": "none"}], "locations": [{"name": "mid-2018 menlo park", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "pellepharm leadership team strengthens operational and regulatory capabilities", "sentiment": "negative"}, {"name": "pellepharm", "sentiment": "none"}, {"name": "bridgebio pharma", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Expanded PellePharm Leadership Team Strengthens Operational and Regulatory Capabilities\nPellePharm on Track for a Phase 3 Clinical Trial in Mid-2018\nMENLO PARK, Calif.--(BUSINESS WIRE)-- PellePharm, a clinical-stage biopharmaceutical company committed to targeting rare genetic dermatological conditions at the source, today announced the appointment of Sanuj K. Ravindran, M.D., to the position of president and chief executive officer. In parallel, Dr. Ravindran will join BridgeBio Pharma, PellePharm’s lead investor, as CEO-in-Residence, to advance its broader orphan dermatology portfolio.\n“Dr. Ravindran’s biopharma industry experience and rare disease expertise will offer enormous strategic benefit to PellePharm as we move into our next stage of development,” said Ervin Epstein, M.D., chief medical officer and co-founder of PellePharm. “Having been successful with the management and growth of multiple biopharma companies, Dr. Ravindran brings the right experience to PellePharm so that we may offer topical patidegib to patients as swiftly as possible.”\nDr. Ravindran brings more than 15 years of strategic and operational biopharma experience to PellePharm. Most recently, he was chief business officer at aTyr Pharma (“LIFE”), a clinical stage rare disease-focused biotechnology company, where he led corporate and financial strategy, business development, and investor relations. Prior to that, Dr. Ravindran was senior vice president of corporate development for The Medicines Company (“MDCO”), where he worked to execute multiple transactions totaling more than $2 billion in potential aggregate value. Previously a practicing physician, Dr. Ravindran began his industry career as a venture capitalist for 10 years with Burrill & Company, Radius Ventures, and Asian Healthcare Fund. Dr. Ravindran is trained in Internal Medicine and completed his residency training at Thomas Jefferson University Hospital. Dr. Ravindran received his B.A. from Northwestern University, his M.D. from Jefferson Medical College and his MBA from the Kellogg School of Management.\n“I am thrilled to join PellePharm at such an important juncture, as the Company prepares to advance topical patidegib one step closer to patients with Gorlin Syndrome. With PellePharm’s scientific premise, clinical progress, and recently strengthened leadership team, the company is well on its way to meeting its mission of delivering therapies for rare genetic dermatological conditions,” said Dr. Ravindran.\nPellePharm today also announced that it has expanded its executive team to enhance regulatory and operational capabilities. Alix Alderman is now vice president of regulatory affairs at PellePharm, and Gerd Kochendoerfer, Ph.D., is vice president of technical operations and program management. Both Ms. Alderman and Dr. Kochendoerfer bring many years of experience in drug development, quality management and global regulatory affairs.\n“We are pleased to welcome Dr. Ravindran, Dr. Kochendoerfer and Ms. Alderman,” said Neil Kumar, CEO and co-founder of BridgeBio Pharma. “At this inflection point, having the right team in place, with the collective experience this group brings, enables PellePharm to more ably achieve its goal of helping patients with serious unmet dermatologic conditions.”\nAbout Patidegib\nTopical patidegib gel has shown early promise in a Phase 2 clinical study in Gorlin Syndrome by blocking the disease at its source within the hedgehog signaling pathway. Topical patidegib was developed to provide the efficacy previously demonstrated by oral patidegib in Phase 1 trials, but without the adverse systemic side effects of oral hedgehog inhibitors. Patidegib’s gel formulation is stable at room temperature for at least two years, making it a viable potential therapy for ongoing, at-home management of Gorlin Syndrome. Topical patidegib currently is being studied in a United States-based Phase 2 clinical trial for the treatment of sporadic basal cell carcinomas (BCCs).\nAbout Gorlin Syndrome\nGorlin Syndrome is a rare, genetic disease characterized by mutations in the tumor suppressor gene encoding Patched1 (PTCH1), which acts as the primary inhibitor of the hedgehog signaling pathway. This leads to hundreds of basal cell carcinomas, especially on the face and sun-exposed areas.\nWith no FDA-approved drugs available for Gorlin Syndrome, also known as Basal Cell Carcinoma Nevus Syndrome (BCCNS), the standard of care is surgery. People with severe Gorlin Syndrome may have as many as 30 surgeries per year, which can be repetitive and scarring. Approximately 10,000 people in the United States, or one in 31,000, are believed to be affected by Gorlin Syndrome. Gorlin Syndrome is known by several names, including BCCNS, Gorlin-Goltz Syndrome, Basal Cell Nevus Syndrome, or Nevoid Basal Cell Carcinoma Syndrome.\nAbout PellePharm\nFounded by world leaders in hedgehog signaling, PellePharm, a BridgeBio company, is committed to targeting rare genetic dermatological conditions, including Gorlin Syndrome and BCCs at the source. PellePharm is committed to improving the quality of life for those suffering from Gorlin Syndrome and BCCs by providing an easy-to-use topical solution that eliminates the need for regular, painful surgeries. Topical patidegib is a first-in-class topical gel formulation of a proprietary hedgehog inhibitor.\nAbout BridgeBio Pharma\nBridgeBio is a clinical-stage biotech company developing novel, genetically targeted therapies to improve the lives of patients. The BridgeBio approach combines a traditional focus on drug development with a unique corporate model, allowing rapid translation of early stage science into medicines that treat disease at its source. Founded in 2015 by a team of industry veterans, the company has built a robust portfolio of ten transformative drugs ranging from pre-clinical to late stage development in multiple therapeutic areas including oncology, cardiology, dermatology and endocrinology. The company's focus on scientific excellence and rapid execution aims to translate today's discoveries into tomorrow's medicines.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005482/en/\nPure Communications\nKatie Engleman, 910-509-3977\nkengleman@w2ogroup.com\nSource: PellePharm", "external_links": ["http://www.businesswire.com/news/home/20180104005482/en/"], "published": "2018-01-04T16:00:00.000+02:00", "crawled": "2018-01-04T16:35:18.000+02:00", "highlightTitle": ""}