{"organizations": [], "uuid": "ae18c7bd567fe5711cdf31447101a6c3119f4655", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/901287072.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/09/stocks-2018-forward-earnings/", "country": "US", "domain_rank": 1196, "title": "Stocks: Beware of Wall Street Math on Corporate Earnings | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.643, "site_type": "news", "published": "2018-01-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "ae18c7bd567fe5711cdf31447101a6c3119f4655"}, "author": "Shawn Tully", "url": "http://fortune.com/2018/01/09/stocks-2018-forward-earnings/", "ord_in_thread": 0, "title": "Stocks: Beware of Wall Street Math on Corporate Earnings | Fortune", "locations": [], "entities": {"persons": [{"name": "shawn tully", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Shawn Tully January 9, 2018 \nAt a time when the stock market seems to set new records every day, Wall Street is sending a counterintuitive message to investors: By some measures, the cheerleaders say, stocks are actually cheap. But beware of bulls bearing forward earnings projections. \nFor market strategists and pundits arguing that stocks are still a buy, it’s a major challenge to prove that today’s lofty, even seemingly excessive, valuations aren’t really so lofty. That’s where forward earnings come in. This much-favored metric involves taking analysts’ consensus estimates for the S&P 500’s earnings-per-share, as predicted for the next four quarters, and dividing that number by the S&P’s current price. Those future-earnings estimates skew bluebird optimistic, almost invariably pointing to big increases in profits. Put it all together, and that methodology establishes a “forward” price-to-earnings multiple (P/E) that’s virtually always far lower, and a lot more fetching, than the P/E based on results already on the books—in other words, the actual earnings recorded over the past four quarters. \nIn an interview with CNBC on Dec. 27, Jonathan Golub, chief market strategist for Credit Suisse, cited the forward P/E to justify his prediction that the S&P 500 would reach 3000 by the close of 2018 (a 12.2% increase from where prices stood that day). “Let’s look at multiples the way most investors do on a forward basis,” declared Golub. “We were looking before the tax plan at an 18-and-a-quarter multiple for stocks. For every dollar you earn you’re willing to pay 18 or more dollars to buy that company. If earnings go up as much as I expect, the multiple gets cheaper, so I think that you’re probably on the actual earnings paying something like 17 forward.” \nTo the ears of most investors, the prospect of P/Es well below 20 are comforting. But the reasonable-sounding forward numbers are highly misleading. To understand why, let’s examine two factors. First, let’s look at how today’s forward P/E compares not with trailing P/Es, but with its own species, forward P/Es over long periods. And second, we should ask: What kind of earnings projections are required to arrive at a sub-20 P/E, and are they reasonable? Historically high prices—backward or forward \nIt’s important to emphasize that the current stock multiple, based on trailing, four-quarter GAAP earnings, is a daunting 24. That’s 26% higher than the average of 19 since 1990, and 44% above the figure of 16.7 since 1888. The CAPE P/E developed by Yale economist Robert Shiller is even more forbidding at 33.3, a number surpassed only by valuations during the tech bubble of the early 2000s. \nIn the CNBC interview, Golub appears to be referring to forward P/Es based on operating earnings. But the forward estimates using GAAP earnings, though slightly lower, follow a similar pattern. Which brings us to the first point: How do today’s forward estimates compare with past projections? Is the forward P/E low or high by historical standards? \nAccording to S&P Global Market Intelligence, the analysts’ consensus estimate of four-quarter forward P/E based on GAAP profits stood at 19.25 as of Monday, Jan. 8. Makes stocks sound reasonably priced, right? Not necessarily. Since early 2003, the average forward forecast for Jan. 8 of each year was 15.7. So the current estimate of 19.25 is 22% higher than the sixteen-year average. Even if we include the gigantic forecasts from 2000 to 2002, when the tech craze was still inflating projections, the current number is 13% above average. \nSecond, it’s instructive to answer this question: Just how much are profits expected to surge in order to push the forward P/E below 20? As of Q3 2016, the last full quarter of reported earnings for the S&P 500, GAAP trailing 12-month earnings per share (EPS), in the aggregate, totaled $107.08. By the end of Q4 2018, analysts predict total, four-quarter trailing EPS of $136.75. That would be a rise of almost 28%. \nAnd remember, that epic result would only lower the forward P/E to 19.25, still much higher than the average for that figure. That hardly tags stocks as a bargain. Will it happen? Unlikely. As of Q3, S&P 500 operating margins stood at 10.7%, the highest level of seven years, and one of the most elevated figures in S&P history. Even in the wake of the huge tax cut passed late last year, boosting that operating-margin figure by 28% would require almost unprecedented performance. \nTo judge whether stocks are extremely expensive or reasonably valued, trust the stalwarts, like the trailing, GAAP numbers, or even better, the Shiller P/E or CAPE. Following forward multiples is a trip to fantasyland. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T02:00:00.000+02:00", "crawled": "2018-01-10T02:37:32.008+02:00", "highlightTitle": ""}