{"organizations": [], "uuid": "682757119757b0c09c5111f5b2a6adee7b9a9f94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-bancorpsouth-insurance-services-announces-rebrand-new-name.html", "country": "US", "domain_rank": 767, "title": "BancorpSouth Insurance Services Announces Rebrand, New Name", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T00:35:00.000+02:00", "replies_count": 0, "uuid": "682757119757b0c09c5111f5b2a6adee7b9a9f94"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-bancorpsouth-insurance-services-announces-rebrand-new-name.html", "ord_in_thread": 0, "title": "BancorpSouth Insurance Services Announces Rebrand, New Name", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TUPELO, Miss., Jan. 2, 2018 /PRNewswire/ -- BancorpSouth Bank (NYSE: BXS) announced today BancorpSouth Insurance Services, Inc., a subsidiary of BancorpSouth Bank, is undergoing a name change. Effective January 1, 2018, the insurance group is now BXS Insurance.\nAccording to BXS Insurance President Markham McKnight, the change is being made to unite the agency's 630 teammates across nine states as one organization to better assist its clients in achieving their personal and business objectives.\n\"BancorpSouth Insurance Services traces our roots to 1882,\" McKnight said. \"Its growth was the result of local and regional agencies becoming part of a larger entity. That growth continues today. While we will always be mindful of the legacies these agencies have, now is the time to ensure we are building a collective brand and legacy with one vision while still providing our clients the best service possible.\"\nBXS Insurance's visual identity features many elements identical to the current look, including color palette, fonts and design elements. McKnight added that the new name will allow colleagues to promote BXS Insurance with one voice, regardless of what office or state they call home.\n\"We are committed, as one organization, to providing our clients with every resource at our disposal to make certain their needs are met,\" McKnight said. \"For more than 130 years we have focused on forming relationships to understand our clients' risks and design plans that address those risks. We will continue to build our legacy by helping to protect the legacies of others.\"\nAbout BXS Insurance\nBXS Insurance, a wholly-owned subsidiary of BancorpSouth Bank, is licensed in all 50 states and ranks as the nation's 38th largest insurance firm based on the latest rankings available for top insurance brokerage firms in America by Business Insurance. BXS Insurance currently operates 31 offices, with 630 insurance and risk management professionals ready to provide local expertise backed by worldwide resources. For more information, visit www.bxsi.com . \"Like\" us on Facebook at BXS Insurance; follow us on Twitter @MyBXSI; or join us on LinkedIn through our BXS Insurance page.\nView original content with multimedia: http://www.prnewswire.com/news-releases/bancorpsouth-insurance-services-announces-rebrand-new-name-300576550.html\nSOURCE BancorpSouth Bank", "external_links": ["http://www.prnewswire.com/news-releases/bancorpsouth-insurance-services-announces-rebrand-new-name-300576550.html"], "published": "2018-01-03T00:35:00.000+02:00", "crawled": "2018-01-03T02:09:17.011+02:00", "highlightTitle": ""}