{"organizations": [], "uuid": "c3fcccebff6c0e7afaec6abe95f061335cb94991", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-glacier-bancorp-inc-announces-fourth-quarter-earnings-release-and-conference-call.html", "country": "US", "domain_rank": 767, "title": "Glacier Bancorp, Inc. Announces Fourth Quarter Earnings Release and Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:30:00.000+02:00", "replies_count": 0, "uuid": "c3fcccebff6c0e7afaec6abe95f061335cb94991"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-glacier-bancorp-inc-announces-fourth-quarter-earnings-release-and-conference-call.html", "ord_in_thread": 0, "title": "Glacier Bancorp, Inc. Announces Fourth Quarter Earnings Release and Conference Call", "locations": [], "entities": {"persons": [], "locations": [{"name": "mont.", "sentiment": "none"}, {"name": "kalispell", "sentiment": "none"}], "organizations": [{"name": "glacier bancorp, inc", "sentiment": "neutral"}, {"name": "glacier bancorp, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KALISPELL, Mont., Jan. 04, 2018 (GLOBE NEWSWIRE) -- Glacier Bancorp, Inc. (Nasdaq:GBCI) will report fourth quarter financial results after the market closes on January 25, 2018. A conference call for investors is scheduled for 11:00 a.m. Eastern Time on Friday, January 26, 2018.\nThe conference call will be accessible by telephone and through the internet. Interested individuals are invited to listen to the call by dialing 877-561-2748 and conference ID 5089588. To participate on the webcast, log on to: https://edge.media-server.com/m6/p/oqu7ruzu .\nIf you are unable to participate during the live webcast, the call will be archived on our website, www.glacierbancorp.com , or by calling 855-859-2056 with the ID 5089588 by February 9, 2018.\nThis presentation will include forward looking statements which describe management’s expectations regarding future events and developments such as future operating results, growth in loans and deposits, continued success of the Company’s style of banking and the strength of the local economies in which it operates. Future events are difficult to predict, and the expectations described above are necessarily subject to risk and uncertainty that may cause actual results to differ materially and adversely. In addition to discussions about risks and uncertainties set forth from time to time in the Company’s public filings, factors that may cause actual results to differ materially from those contemplated by such forward looking statements include, among others, the following possibilities: (1) local, national and international economic conditions are less favorable than expected or have a more direct and pronounced effect on the Company than expected and adversely affect the Company’s ability to continue its internal growth at historical rates and maintain the quality of its earning assets; (2) changes in interest rates reduce interest margins more than expected and negatively affect funding sources; (3) projected business increases following strategic expansion or opening or acquiring new banks and/or branches are lower than expected; (4) costs or difficulties related to the integration of acquisitions are greater than expected; (5) competitive pressure among financial institutions increases significantly; (6) legislation or regulatory requirements or changes adversely affect the businesses in which the Company is engaged.\nGlacier Bancorp, Inc. is the parent company for Glacier Bank, Kalispell and its bank divisions: First Security Bank of Missoula; Valley Bank of Helena; Big Sky Western Bank, Bozeman; Western Security Bank, Billings; and First Bank of Montana, Lewistown, all located in Montana; as well as Mountain West Bank, Coeur d’Alene, operating in Idaho, Utah and Washington; First Bank, Powell, operating in Wyoming and Utah; Citizens Community Bank, Pocatello, operating in Idaho; Bank of the San Juans, Durango, operating in Colorado; First State Bank, Wheatland, operating in Wyoming; North Cascades Bank, Chelan, operating in Washington; and The Foothills Bank, Yuma, operating in Arizona.\nRandall M. Chesler, CEO\n(406) 751-4722\nRon J. Copher, CFO\n(406) 751-7706\nSource:Glacier Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=DejM6dGTupxWMVCMGtTNNMEQ6QCR9Z62m7K9n9sxczCC7CCzEHU0L2dCD3pYkXPxVOVotTYMqlGVPEmn4lA2H1qL_QwjUOIcncZLvo-N2sdfxh_Go4diV9z6DkjUus0nM-g_Ka7HzzbkMGxlELTG4g==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/cf6bf9cb-d9aa-4c1a-a9a9-7cf4b3f2670b", "https://edge.media-server.com/m6/p/oqu7ruzu", "https://www.globenewswire.com/Tracker?data=IvSzxSKaRONxT5iviRAUYbi5chmHL8sH85rtHz-5eQBQ0s0Hr5AVRvFgl0zg_RIvIArd4LYKBf4h_-nL0XxilTB3GAsmKyxiQYo-4V7xXOY="], "published": "2018-01-05T00:30:00.000+02:00", "crawled": "2018-01-05T01:22:09.027+02:00", "highlightTitle": ""}