{"organizations": [], "uuid": "6995a33457ac14bd9704aa1f1cb19da512d4892f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 19}, "facebook": {"likes": 82, "shares": 82, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/22/104914185-RTX3WHWE.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/10/dean-of-valuation-buffett-paints-cryptocurrency-with-too-broad-a-brush.html", "country": "US", "domain_rank": 767, "title": "Dean of Valuation: Buffett paints cryptocurrency with 'too broad a brush'", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T00:16:00.000+02:00", "replies_count": 0, "uuid": "6995a33457ac14bd9704aa1f1cb19da512d4892f"}, "author": "Chloe Aiello", "url": "https://www.cnbc.com/2018/01/10/dean-of-valuation-buffett-paints-cryptocurrency-with-too-broad-a-brush.html", "ord_in_thread": 0, "title": "Dean of Valuation: Buffett paints cryptocurrency with 'too broad a brush'", "locations": [], "entities": {"persons": [{"name": "buffett", "sentiment": "negative"}, {"name": "aswath damodaran", "sentiment": "negative"}, {"name": "bitc", "sentiment": "none"}, {"name": "warren buffett", "sentiment": "none"}, {"name": "damodaran", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "new york university's stern school of business", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The problem with bitcoin, \"Dean of Valuation\" Aswath Damodaran says, is that investors don't know why they're paying so much for it. That doesn't mean it will all end badly for cryptocurrency, as billionaire investor Warren Buffett projected.\nBuffet made headlines Wednesday for sharing some apocalyptic words about the future of cryptocurrency.\n\"In terms of cryptocurrencies, generally, I can say almost with certainty that they will come to a bad ending,\" Buffett said during a CNBC exclusive interview. \nDamodaran, who teaches finance at New York University's Stern School of Business, called out Buffet for \"brushing the entire sector with too broad a brush.\" \nDamodaran told CNBC's \"Fast Money\" on Wednesday: \"If you ask people why they're paying what they are for any of these cryptocurrency investments, you don't get a logical answer. You get an answer like, 'I think I can make more money on this.'\"\n\"I think every single crypto asset is being priced right now, it's not being valued,\" he added.\nTo assign valuation to cryptocurrency assets, he first divided them into three categories. Bitcoin falls into the first bucket, currency: \"Cryptocurrencies, like bitcoin, cannot be valued because they're currencies.\"\nCommodities are the second, into which ethereum falls, he said. \n\"It's marketed as a lubricant for smart contracts. Smart contracts are what the fin-tech — the blockchain — revolution is going to deliver. Ethereum can become a significant part of that business and you can value it as a commodity,\" Damodaran said. \"There are commodities that can be valued as slices of businesses to view them all as worthless and useless is wrong.\"\nThen there are ICOs. Those, he said, can be valued as slices of businesses.\n\"To put them all together in one big bucket and throw them over the edge doesn't make sense to me,\" Damodaran said.\nDamodaran tied valuation for cryptocurrencies such as ethereum to founders creating business models.\n\"I think that will be the next phase in the crypto investment market. You'll start to see people pushing these crypto investments to come up with business models, to show how they'll make money,\" he said.\nWhile the \"Dean of Valuation's\" view is much more optimistic than the \"Oracle of Omaha's,\" he issued a word of caution to bandwagon investors.\n\"Will it end badly for some of the people involved? Absolutely. For those people who got on the bandwagon late and are playing the pricing game, for some of them, it's going to end badly,\" he said.\nWATCH: Charlie Munger says bitcoin a bubble show chapters Charlie Munger: Bitcoin and other cryptocurrencies are also bubbles      16 Hours Ago | 00:57", "external_links": [], "published": "2018-01-11T00:16:00.000+02:00", "crawled": "2018-01-11T02:22:27.010+02:00", "highlightTitle": ""}