{"organizations": [], "uuid": "8dc25337ccc11fcc11a33be3e9bf36f37a280916", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224266473&w=1200&r=LYNXMPEE0L20Y", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-japan-economy-boj/boj-to-sound-cautious-optimism-on-inflation-keep-policy-unchanged-idUSKBN1FB2VK", "country": "US", "domain_rank": 408, "title": "UPDATE 2-BOJ keeps policy unchanged, slightly more upbeat on inflation outlook", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T06:40:00.000+02:00", "replies_count": 0, "uuid": "8dc25337ccc11fcc11a33be3e9bf36f37a280916"}, "author": "", "url": "https://www.reuters.com/article/us-japan-economy-boj/boj-to-sound-cautious-optimism-on-inflation-keep-policy-unchanged-idUSKBN1FB2VK", "ord_in_thread": 0, "title": "UPDATE 2-BOJ keeps policy unchanged, slightly more upbeat on inflation outlook", "locations": [], "entities": {"persons": [{"name": "haruhiko kuroda", "sentiment": "none"}, {"name": "stanley white", "sentiment": "none"}, {"name": "leika kihara", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "boj", "sentiment": "negative"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 9:08 PM / in 19 minutes Japan's central bank keeps policy unchanged, talks down prospect of near-term stimulus end Leika Kihara , Stanley White 5 Min Read \nTOKYO (Reuters) - The Bank of Japan kept monetary settings unchanged as expected on Tuesday and its chief hosed down market speculation of a shift away from ultra-easy policy later this year as inflation remained stubbornly shy of the central bank’s target. \nBOJ Governor Haruhiko Kuroda said he saw no immediate need to raise interest rates or slow the bank’s regular purchases of exchange-traded funds - one of its stimulus measures - despite criticism the buying was artificially inflating Tokyo stock prices, which hit a 26-year peak on Tuesday. \nThe recent strengthening in Japan’s economic recovery had prompted many analysts to call the BOJ’s next move to be a withdrawal, rather than an expansion, of stimulus, although there was divergence in views on the timing of such a shift. \nKuroda’s comments served a fresh reminder to investors that the BOJ was in no rush to follow the footsteps of its U.S. and European peers in ending crisis-mode policies. That prompted the yen to erase gains made earlier in the day. \n“There is still some distance to 2 percent inflation, so we’re in no condition yet to debate the timing and method of an exit from ultra-easy monetary policy,” Kuroda told a briefing. \nAs widely expected, the BOJ maintained a pledge to guide short-term interest rates at minus 0.1 percent and 10-year bond yields around zero percent at its two-day rate review that ended on Tuesday. \nIn a quarterly review of its projections, the central bank left unchanged its economic and price estimates, as well as its view inflation will hit its 2 percent target during the fiscal year ending in March 2020. \nBut the BOJ offered a more upbeat view on inflation expectations, saying they were “moving sideways recently.” In October, it described them as being on a weak note. \nSoft inflation expectations, or public perception of future price rises, have hampered the BOJ’s efforts to use its huge money printing to eradicate Japan’s sticky deflationary mindset and nudge households into boosting spending. \nWhile the yen briefly rose against the dollar on the tweak in statement language, Kuroda later put to rest any expectations of a near-term policy tightening. \n“There is absolutely no need to adjust our yield targets just because we revised up our assessment on inflation expectations,” he said. “For Japan’s economy, it’s important for the BOJ to patiently continue with powerful monetary easing.” \nThe yen weakened to 111.15 yen to the dollar .JPY, down 0.2 percent from late U.S. levels, after Kuroda reiterated his commitment to strong monetary easing. A man walks past the Bank of Japan building in Tokyo, Japan January 15, 2018. REUTERS/Kim Kyung-Hoon \n“The fact the BOJ kept its growth and price projections unchanged suggests it is in no mood to normalize policy, despite rising market speculation it could do so,” said Naomi Muguruma, senior market economist at Mitsubishi UFJ Morgan Stanley. NO COMPLACENCY \nJapan’s economy expanded for the seventh straight quarter in July-September, its longest uninterrupted stretch of growth since 1994. Stock prices are also at their highest in 26 years. \nSuch brightening global growth prospects pose fresh communication challenges for policymakers. The BOJ, the Federal Reserve and the European Central Bank are all grappling with how to exit extraordinary policy steps, without scaring investors accustomed to years of massive cheap money. \nJapan got a taste of the challenge when a cut in the BOJ’s bond buying pushed up global yields, and Kuroda’s positive remarks on the economy drove up the yen. \nKuroda said the BOJ’s daily market operations would contain no signals on future monetary policy and won’t be affected by any concern of triggering a yen rise. \nHe also said wage hikes were crucial for inflation to hit the BOJ’s target, and that there were promising signs firms were finally ready to pass on their record profits to employees. \nCore consumer prices rose for the 11th straight month in November and the percentage of households expecting inflation to accelerate hit a nearly two-year high in January, adding to signs Japan may be emerging from two decades of deflation. Related Coverage BOJ Governor Kuroda comments at news conference \nBut BOJ policymakers warn that an index of consumer inflation that strips away the effect of fresh food and energy - still at 0.3 percent - must accelerate more before any debate on withdrawing stimulus could begin. \nStill, some analysts expect the BOJ to raise its yield targets this year as more central banks head toward an exit from crisis-mode policies, driving up global bond yields. \n“If rates are rising in the United States and Japan’s economy is doing well, there will be some upward pressure on rates. It would be impossible to contain this,” said Hiroaki Muto, an economist at Tokai Tokyo Research Center. \n“The BOJ is on hold for the first half of this year but could start to shift gear in the second half of this year.” \n($1 = 110.8000 yen)", "external_links": [], "published": "2018-01-23T06:40:00.000+02:00", "crawled": "2018-01-23T07:03:08.000+02:00", "highlightTitle": ""}