{"organizations": [], "uuid": "ef1764a667f47484b4daf30c48c7ebf4b4e01a07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-thc-therapeutics-becomes-millennium-blockchain.html", "country": "US", "domain_rank": 767, "title": "THC Therapeutics becomes Millennium Blockchain", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:00:00.000+02:00", "replies_count": 0, "uuid": "ef1764a667f47484b4daf30c48c7ebf4b4e01a07"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-thc-therapeutics-becomes-millennium-blockchain.html", "ord_in_thread": 0, "title": "THC Therapeutics becomes Millennium Blockchain", "locations": [], "entities": {"persons": [{"name": "vi", "sentiment": "none"}, {"name": "enzo villani", "sentiment": "none"}, {"name": "brandon romanek", "sentiment": "none"}], "locations": [{"name": "millennium blockchain las vegas", "sentiment": "none"}, {"name": "millennium blockchain", "sentiment": "none"}], "organizations": [{"name": "thc therapeutics, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "transform group international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 18, 2018 (GLOBE NEWSWIRE) -- THC Therapeutics, Inc. (“THCT” or the “Company,”) (OTC:THCT) is pleased to announce that it is changing its direction to blockchain technology. The Company is changing its name to Millennium Blockchain ( www.mblockchain.io ) and has brought on key executives to partner with current CEO Brandon Romanek to shepherd the Company in its new direction.\nMillennium Blockchain is being formed as a holding company investing and developing in decentralized systems and distributed ledger technologies. As part of the transition, the Company is in preliminary discussions for legacy cannabis-related assets to be sold or spun-out.\nAdditionally, Millennium Blockchain is forming a new board of directors and has elected a new Chairman of the Board of Directors, Enzo Villani, who has acquired a significant stake in Millennium Blockchain to become the second-largest shareholder in the Company. He is currently the Managing Director for the prestigious blockchain advisory and communications company, Transform Group International ( www.transformgroup.io ). Mr. Villani is the former Managing Director of Nasdaq and was co-founder of Nasdaq Global Corporate Solutions and has completed over $500 million in mergers and acquisitions in the technology and communications sectors. Mr. Villani was also CEO and Board Member of Equities.com .\nBrandon Romanek will continue as CEO and remain a member of the Board of Directors. An experienced equities and commodities trader, Mr. Romanek will focus on leading the organization, strategy, and execution. He has over 25 years of experience managing a significant healthcare business and over 20 years of experience in financial markets including money management, trading/investing of equities, options and commodities, and he was a broker/dealer in the precious metals market. A significant portion of Mr. Romanek’s net worth is held in physical precious metals.\n“We are excited about the new direction and the opportunity that blockchain technology will bring to our shareholders. Millennium Blockchain will focus on investing in blockchain technologies and crypto-assets focused on financial markets, healthcare, crypto-mining and high-technology,” said Brandon Romanek, CEO.\nEnzo Villani commented, “Our approach will be disciplined and focus on the best-of-breed companies with excellent management teams in verticals that demonstrate promise from decentralization and frictionless markets.”\nMillennium Blockchain will be in attendance at the North American Bitcoin Conference in Miami, Florida from January 18 th to the 19 th .\nAbout Millennium Blockchain\nThe Company is an international holding company focused on investing in blockchain technologies and crypto-assets focused on financial markets, healthcare, crypto-mining and high-technology. The Company filed an amendment to change its name from “THC Therapeutics, Inc.” to “Millennium Blockchain, Inc.” on January 17, 2018, and filed a corporate action notification form with FINRA thereafter. http://www.mblockchain.io/\nThe Company has historically been focused on developing their patent-pending product, the dHydronator®, a sanitizing herb dryer. The main function of the dHydronator is to greatly accelerate the drying time of a herb while sanitizing it. The dHydronator can be used to dry a variety of herbs, and it has been specifically tested for use with cannabis, and it will reduce the drying time for cannabis from 10-14 days to less than 14 hours. For more information, visit THCTherapeutics.com .\nSafe Harbor Statement\nThis press release may contain “forward-looking statements” within the meaning of the federal securities laws. In this context, forward-looking statements may address the Company’s expected future business and financial performance, and often contain words such as “anticipates”, “beliefs”, “estimates”, “expects”, “intends”, “plans”, “seeks”, “will”, and other terms with similar meaning. These forward-looking statements by their nature address matters that are, to different degrees, uncertain. Although the Company believes that the assumptions upon which its forward-looking statements based are reasonable, it can provide no assurances that these assumptions will prove to be correct. All forward-looking statements in this press release are expressly qualified by such cautionary statements, risk, and uncertainties, and by reference to the underlying assumptions.\nMedia/Investors contact:\n(702) 602-8422\ninfo@mblockchain.io\nSource: THC Therapeutics", "external_links": ["https://www.globenewswire.com/Tracker?data=KZyzN9q6GJQmmMDqf9LHtdRjYZeqKW2X7Z-4En36tv74WLH5tbt4Cz9MY1GvFLBJ7We1pO-vHO8dq35OX5g5yuCfT62JS9ijPVfuxwgfJ98=", "http://www.mblockchain.io/", "https://www.globenewswire.com/Tracker?data=cPD_RPqIOZu4Usn_kSGDW7GFhcrbYNDH4izl8FtyAkW0a4Xz2tif6ahbRPEnaNlWIDgjhO1U4NyWDG5PTtuak3gMGjY0UAVhzfUUoj_xmWE=", "https://www.globenewswire.com/Tracker?data=lOtCRMpkrm35a6hZ4f4UTFOWQtaEEwJ8g5x7q9s4Q55A70G-2E2AvgebvvRPRO8EE5PPyjFxg12XH-ggufZdvBgC7BacIS_ZZWkIGXwcdIM=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0f47281f-4799-4952-a403-b82bee0092c1", "https://www.globenewswire.com/Tracker?data=dmJcgb6pcRcS-vKoRVE73xxGsq7Wuw3y5m-pbhcOOhS_DrF7Q8csc91y4baJPQkSK631KGviMzlNoQ-KhPr2MzDPQya6GSuJg3rJSMfGDak=", "https://www.globenewswire.com/Tracker?data=DJsIRr5svjK3LXPMo_CzgXoW8bheRCPznJ0aw1iF5fUfp5BxDvpXGXcuQSKqA-mH0axaRdtULcENCVE6XZxeZfraWQgvl-GR-PcvBIRKZL0="], "published": "2018-01-18T15:00:00.000+02:00", "crawled": "2018-01-18T16:19:41.021+02:00", "highlightTitle": ""}