{"organizations": [], "uuid": "332ab90b8128355ac13465ed1fbd9fa936355229", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-td-bank-group-acquires-artificial-intelligence-innovator-layer-6.html", "country": "US", "domain_rank": 767, "title": "TD Bank Group acquires artificial intelligence innovator Layer 6", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:50:00.000+02:00", "replies_count": 0, "uuid": "332ab90b8128355ac13465ed1fbd9fa936355229"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-td-bank-group-acquires-artificial-intelligence-innovator-layer-6.html", "ord_in_thread": 0, "title": "TD Bank Group acquires artificial intelligence innovator Layer 6", "locations": [], "entities": {"persons": [{"name": "jordan jacobs", "sentiment": "none"}, {"name": "michael rhodes", "sentiment": "none"}, {"name": "tomi poutanen", "sentiment": "none"}, {"name": "bharat masrani", "sentiment": "none"}], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "td bank group", "sentiment": "negative"}, {"name": "inc.", "sentiment": "none"}, {"name": "tsx", "sentiment": "none"}, {"name": "vector institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Predictive and personalized customer experiences at the centre of TD transformation strategy\nTORONTO, Jan. 9, 2018 /PRNewswire/ - TD Bank Group (TD) (TSX and NYSE: TD) today announced the acquisition of Layer 6 Inc. (\"Layer 6\"), a world-renowned artificial intelligence (AI) company based in Toronto, Ontario.\nLayer 6 has emerged as a global thought-leader and pioneer in the delivery of responsive, personalized and insight-driven experiences for the financial services industry. Layer 6 founders Tomi Poutanen and Jordan Jacobs are also co-founders of the Vector Institute, a world leader in AI research and education that TD also supports.\nQuote: s\nBharat Masrani, Group President and CEO, TD Bank Group:\n\"Anticipating and meeting customer needs are at the heart of our promise, and we are excited to further accelerate our innovation agenda to deliver well into the future. As we deploy new solutions, we will extend our deep relationship with customers across all of our platforms and offer personalized, connected and legendary experiences for our customers in the digital age.\"\nMichael Rhodes, Group Head, Innovation, Technology and Shared Services, TD Bank Group:\n\"Layer 6 adds new capabilities to TD's growing base of innovation talent and know-how. Artificial Intelligence has the potential to power a new generation of data-driven applications from personalized and real-time advice to predictive analytics that will shape the future of banking for millions of individuals.\"\nJordan Jacobs, Co-CEO & Co-Founder, Layer 6:\n\"TD is committed to leading the market with new innovation and superior customer experiences. Layer 6 was founded to help organizations harness the power of artificial intelligence, and we are excited to join TD and help them build for the future.\"\nToday's announcement builds on an impressive track record of accomplishment as TD harnesses the potential of artificial intelligence:\nTD is collaborating with the Vector Institute for Artificial Intelligence, which is developing the next generation of AI technologies. TD recently announced an agreement with leading conversational AI provider, Kasisto to integrate the company's KAI Banking platform into TD's top-ranked mobile app. TD recently collaborated with Amazon to introduce new voice banking \"skills\" on Alexa. TD was the first financial institution in Canada to offer a chatbot on Twitter to empower our customers to get instant help on select general inquiries. Committed to the future development of data and analytics talent – a critical and foundational need for successful AI solutions – TD is funding new initiatives at both Western University in London, Ontario and the University of Toronto's Rotman School of Management.\nThe acquisition of Layer 6 is not expected to have a meaningful impact on TD's Common Equity Tier 1 Capital ratio.\nAbout TD Bank Group\nThe Toronto-Dominion Bank and its subsidiaries are collectively known as TD Bank Group (\"TD\" or the \"Bank\"). TD is the sixth largest bank in North America by branches and serves more than 25 million customers in three key businesses operating in a number of locations in financial centres around the globe: Canadian Retail, including TD Canada Trust, TD Auto Finance Canada, TD Wealth (Canada), TD Direct Investing, and TD Insurance; U.S. Retail, including TD Bank, America's Most Convenient Bank®, TD Auto Finance U.S., TD Wealth (U.S.), and an investment in TD Ameritrade; and Wholesale Banking, including TD Securities. TD also ranks among the world's leading online financial services firms, with approximately 11.5 million active online and mobile customers. TD had CDN$1.3 trillion in assets on October 31, 2017. The Toronto-Dominion Bank trades under the symbol \"TD\" on the Toronto and New York Stock Exchanges.\nAbout Layer 6 Inc.\nLayer 6 enables a financial institution to deploy the most advanced Machine Learning solutions through a world leading Artificial Intelligence prediction engine for enterprise data. The platform helps anticipate how to provide each customer with a better, more personalized experience in real-time. Layer 6 was founded by Jordan Jacobs, Tomi Poutanen and Maks Volkovs in Toronto, and launched publicly in late 2016. The company has been recognized for its leading accuracy in real-time personalization and prediction through engagements with global companies and as winner of the 2017 RecSys Challenge by a wide margin over top international AI labs. The Layer 6 data science team led by Maks Volkovs does ground-breaking machine learning research which is regularly published and presented at top AI conferences, including NIPS, ICML and RecSys. Jordan Jacobs and Tomi Poutanen are also co-founders of the Vector Institute, a concept they initiated with Geoffrey Hinton and Richard Zemel. Vector launched in 2017 with $230 Million of backing from over 30 companies including TD, and the governments of Canada and Ontario.\nCaution Regarding Forward Looking Information\nFrom time to time, the Bank (as defined in this document) makes written and/or oral forward-looking statements, including in this document, in other filings with Canadian regulators or the United States (U.S.) Securities and Exchange Commission (SEC), and in other communications. In addition, representatives of the Bank may make forward-looking statements orally to analysts, investors, the media, and others. All such statements are made pursuant to the \"safe harbour\" provisions of, and are intended to be forward-looking statements under, applicable Canadian and U.S. securities legislation, including the U.S. Private Securities Litigation Reform Act of 1995.\nForward-looking statements include, but are not limited to, statements made in this document regarding the Bank's objectives and priorities for 2018 and beyond and strategies to achieve them, the regulatory environment in which the Bank operates, and the Bank's anticipated financial performance. Forward-looking statements are typically identified by words such as \"will\", \"would\", \"should\", \"believe\", \"expect\", \"anticipate\", \"intend\", \"estimate\", \"plan\", \"goal\", \"target\", \"may\", and \"could\". By their very nature, these forward-looking statements require the Bank to make assumptions and are subject to inherent risks and uncertainties, general and specific. Especially in light of the uncertainty related to the physical, financial, economic, political, and regulatory environments, such risks and uncertainties – many of which are beyond the Bank's control and the effects of which can be difficult to predict – may cause actual results to differ materially from the expectations expressed in the forward-looking statements. Risk factors that could cause, individually or in the aggregate, such differences include: credit, market (including equity, commodity, foreign exchange, interest rate, and credit spreads), liquidity, operational (including technology and infrastructure), reputational, insurance, strategic, regulatory, legal, environmental, capital adequacy, and other risks. Examples of such risk factors include the general business and economic conditi", "external_links": ["https://newsroom.td.com/insights/td-is-using-artificial-intelligence-to-shape-the-future-of-banking", "https://newsroom.td.com/featured-news/amazon-alexa-a-digital-concierge-financial-fitness-and-fresh-research-how-td-shaped-a-novel-november", "https://newsroom.td.com/featured-news/td-s-christian-nelissen-how-data-is-driving-the-future-of-banking", "https://newsroom.td.com/featured-news/117", "https://newsroom.td.com/featured-news/artificial-intelligence-in-banking-starts-now-td-in-forbes-report"], "published": "2018-01-09T14:50:00.000+02:00", "crawled": "2018-01-09T15:42:09.057+02:00", "highlightTitle": ""}