{"organizations": [], "uuid": "ff0df9979456e9b060a5211571d59b39738aada1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/30/104499761-boomers.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/4-tips-for-wisely-managing-retirement-savings.html", "country": "US", "domain_rank": 767, "title": "4 tips for wisely managing retirement savings", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.272, "site_type": "news", "published": "2018-01-31T15:04:00.000+02:00", "replies_count": 0, "uuid": "ff0df9979456e9b060a5211571d59b39738aada1"}, "author": "Marilyn Timbers", "url": "https://www.cnbc.com/2018/01/31/4-tips-for-wisely-managing-retirement-savings.html", "ord_in_thread": 0, "title": "4 tips for wisely managing retirement savings", "locations": [], "entities": {"persons": [{"name": "marilyn timbers", "sentiment": "none"}, {"name": "pascal broze", "sentiment": "none"}], "locations": [], "organizations": [{"name": "voya financial advisors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Most people spend much of their working lives saving for their future. Yet, after so many years of being disciplined about saving, many of my clients are uncertain how to allocate their hard-earned nest eggs once in retirement. As a financial advisor, I have found that there are two primary reasons for this.\nPascal Broze | Getty Images Allocating expenses into needs, goals and aspirations can help provide a better framework for managing your cash flow and living comfortably. First, they are concerned they will run out of money. Second, they are suddenly transformed into spenders of assets, while no longer bringing in additional earnings from a paycheck. Both of these factors can certainly require some adjustment. To help you get there, here are four tips that can help you wisely manage your savings in retirement.\nCreate a realistic spending plan. I work with my clients to create plans to help them reach retirement, but it's just as important to establish a plan for living through retirement. There's a balance to strike here — you don't want to run out of your savings too quickly, but you also don't want to miss out on the opportunity to enjoy this time in your life. It's important to be realistic about how you spend, as you'll want to be able to manage it properly. At other phases in life, you might think of this concept as a budget, but, in retirement, try to think about it as a spending plan. The difference here is that you no longer have a steady paycheck to support your expenses.\nAllocating your expenses into needs, goals and aspirations can help to provide a better framework for managing your cash flow and living comfortably. To do this, itemizing is an important step. No different than what you would do at other phases of your life, you'll need to budget your daily living expenses such as housing, utilities, food and health care. Next, consider goals and aspirations, which might include travel, family visits, hobbies or even larger purchases such as new automobiles or a second home. You might also wish to make charitable donations or leave a legacy for your family. Be sure to prioritize according to what is most important to you.\nDetermine a withdrawal strategy that's right for you. Once you have your spending plan, you'll want to figure out how to draw down from your assets. This is where it can get a little more tactical. To start, I find it's helpful for many of my clients to have a \"bucket\" of guaranteed income consisting of Social Security, pensions or annuities. This could cover needs such as housing, food and utilities. Allocating your funds to these necessitates can provide a sense of financial security knowing that you'll still be able to pay for life's basic necessities, even if you spend money for travel or non-essential items.\nWhy some fear is good for investors\nAdvisors turn to life coaches and counselors\nRetirees leave $100B in Social Security benefits on table\nThe amount you withdraw can also vary at different stages of your retirement. For example, you may want to withdraw more early on when you're more active and perhaps want to travel or enjoy leisure activities. Later, when you're less inclined to be active, you may need a smaller income to support your lifestyle. You can also do just the opposite — take it easy on the withdrawals in your early years and maybe even supplement your income with a part-time job. Then, as you feel more comfortable about your income stream, gradually increase your withdrawals. As medical expenses tend to increase with age, this can also be a smart approach for many people. The beauty of a flexible withdrawal strategy is that you can adjust based on your personality and individual goals.\nBe mindful of the unexpected. While it's important to map out a strategy for a spending plan and withdrawal approach, it's just as important to prepare for the unexpected. With life expectancy increasing and health-care costs rising, medical expenses are also critical to a retirement planning strategy. A survey by Voya Financial found 77 percent of baby boomers and 75 percent of retirees have never estimated the amount of health-care expenses they expect to incur throughout retirement. But how do you know how long your retirement will last? Life expectancy charts can tell you how long the average man or woman in the U.S. might live, but understanding the health status of family relatives — whether it's chronic illness, long-term issues or memory impairment later in life — provides a more personalized way to financially prepare.\nWhen it comes to your investment portfolio, you also want to make sure your plan is diversified, having elements of guaranteed income and growth, including emergency savings funds. Achieving your long-term goals requires balancing risk and rewards along with choosing the right mix of investments. This is where working with an advisor can help you create a strategy that can help truly make a difference in your outcome.\nYour Wealth: Weekly advice on managing your money Sign up to get Your Wealth\nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Submit Please enter a valid email address Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Protect your legacy. If you plan on leaving a legacy, you also want to make sure your wealth will be used in a way that corresponds to your core values. This might mean setting up a 529 college savings account for your grandchildren. Or, if you want to see your loved ones enjoy the benefits of your savings while you are still able to watch, you could consider setting up an annual gift-giving account for them.\nRemember, your estate consists of everything you own — including cash, investments, life insurance policies and personal property. Having a will and perhaps a living trust that are regularly updated give you more control and makes it easier for those involved to manage your legacy. Working with an attorney can help determine whether a will or a trust makes sense for you. As part of this process, it's also a good idea to confirm your beneficiaries. These designations on your accounts can supersede your will, so make sure those who are noted are the ones you want to inherit your trust.\nThe transition from working and saving to retiring and spending can certainly be a challenge. Take the time to keep assessing and adjusting your plan as you move through life. This can help create greater peace of mind so you can truly enjoy your golden years to their fullest.\n— By Marilyn Timbers, financial advisor at Voya Financial Advisor", "external_links": [], "published": "2018-01-31T15:04:00.000+02:00", "crawled": "2018-01-31T15:11:53.008+02:00", "highlightTitle": ""}