{"organizations": [], "uuid": "305ee564b885af0113ee2520bf0eb0acbdca3049", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-adomani-completes-11-million-secondary-equity-offering-boustead-securities-underwrites-and-places-first-form-s-1-fundraise.html", "country": "US", "domain_rank": 767, "title": "ADOMANI Completes $11 Million Secondary Equity Offering; Boustead Securities Underwrites and Places First Form S-1 Fundraise for a NASDAQ-Listed Regulation A+ IPO Issuer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-11T22:49:00.000+02:00", "replies_count": 0, "uuid": "305ee564b885af0113ee2520bf0eb0acbdca3049"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-adomani-completes-11-million-secondary-equity-offering-boustead-securities-underwrites-and-places-first-form-s-1-fundraise.html", "ord_in_thread": 0, "title": "ADOMANI Completes $11 Million Secondary Equity Offering; Boustead Securities Underwrites and Places First Form S-1 Fundraise for a NASDAQ-Listed Regulation A+ IPO Issuer", "locations": [], "entities": {"persons": [], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}], "organizations": [{"name": "adom", "sentiment": "neutral"}, {"name": "llc", "sentiment": "none"}, {"name": "boustead securities", "sentiment": "none"}, {"name": "roth capital partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Los Angeles, CA , Jan. 11, 2018 (GLOBE NEWSWIRE) -- ADOMANI, Inc. (NASDAQ: ADOM) , a provider of advanced zero-emission and hybrid vehicle drivetrain solutions and purpose-built electric vehicles, today announced the closing of an S-1 registered public offering of 3,666,667 Units at $3.00 per Unit. Each Unit consists of one share of common stock and a warrant to purchase 1.5 shares of common stock at an exercise price of $4.50 (the “Offering”). The gross proceeds to ADOMANI from the Offering will be $11.0 million, before payment of placement agent fees and other offering expenses.\nBoustead Securities, LLC, the underwriter of ADOM’s Regulation A+ IPO in June 2017, which was the first ever on NASDAQ, was the exclusive placement agent for the Offering, while Roth Capital Partners served as a financial advisor to ADOMANI.\nWith this closing, ADOMANI is the first Regulation A+ Issuer on NASDAQ to conduct an S-1 registered secondary offering.\n“ADOMANI has, once again, demonstrated its leadership in pioneering a progression of equity offerings from Regulation A+ and Form 1-A for its NASDAQ IPO; to now completing a full S-1 Registration Statement offering,” said Dan McClory, Boustead Securities’ Head of Equity Capital Markets. “In our opinion, this is precisely what the SEC intended by enabling emerging growth companies to utilize the JOBS Act and access capital on a more efficient basis,” he continued. “ADOM has now raised more than $25 million through the public capital markets, ranking as the second-largest amount of gross funding proceeds for a Regulation A+ issuer,” McClory concluded.\nADOMANI intends to use the net proceeds from the offering primarily for the prepayment of its outstanding secured 9% notes payable and working capital or other general corporate purposes.\nThe Units will be issued pursuant to an effective registration statement on Form S-1 that was previously filed with the Securities and Exchange Commission (“SEC”). A preliminary prospectus has been filed with the SEC and is available on the SEC’s website at www.sec.gov . Copies of the prospectus relating to the offering may be obtained, when available, from Boustead Securities, LLC, 6 Venture, Suite 325, Irvine, CA 92618, by telephone at +1 (949) 502-4409 or by e-mail at offerings@boustead1828.com\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of, any security in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or other jurisdiction.\nAbout Boustead Securities, LLC\nBoustead Securities, LLC (“Boustead”) is an investment banking firm that executes and advises on IPOs, mergers and acquisitions, capital raises and restructuring assignments in a wide array of industries, geographies and transactions, for a broad client base. Boustead’s core value proposition is the ability to create opportunity through innovative solutions and tenacious execution. With experienced professionals in the United States and around the world, Boustead's team moves quickly and provides a broad spectrum of sophisticated financial advice and services.\nAbout ADOMANI, Inc.\nADOMANI, Inc. is a provider of zero-emission electric and hybrid vehicles and replacement drivetrains that is focused on reducing the total cost of vehicle ownership. ADOMANI’s drivetrain systems are designed to help fleet operators unlock the benefits of green technology and address the challenges of traditional fuel price cost instability and local, state and federal environmental regulatory compliance. ADOMANI designs advanced zero-emission electric and hybrid drivetrain systems for integration in new school buses and medium to heavy-duty commercial fleet vehicles.\nForward-Looking Statements\nStatements made in this press release that relate to future plans, events, financial results, prospectus or performance, including with respect to the proposed offering and the intended use of the proceeds of the offering, are forward-looking statements as defined under the Private Securities Litigation Reform Act of 1995. While they are based on the current expectations and beliefs of management, such forward-looking statements are subject to a number of risks, uncertainties, assumptions and other factors that could cause actual results to differ materially from the expectations expressed in this press release, including the risks and uncertainties disclosed in ADOMANI’s reports filed with the SEC and the “Risk Factors” section of its registration statement on Form S-1, all of which are available online at www.sec.gov . All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including statements containing the words “planned,” “expects,” “believes,” “strategy,” “opportunity,” “anticipates,” “outlook,” “designed,” and similar words. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. Except as required by law, ADOMANI undertakes no obligation to update or revise any forward-looking statements to reflect new information, changed circumstances or unanticipated events.\nContact Information: Boustead Securities, LLC: Dan McClory, Managing Director and Head of Equity Capital Markets +1 (949) 502-4408 dan@boustead1828.com\nSource:Boustead Securities", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/94a468f9-71a0-4c18-84d7-e7e139ef151a"], "published": "2018-01-11T22:49:00.000+02:00", "crawled": "2018-01-11T23:31:59.000+02:00", "highlightTitle": ""}