{"organizations": [], "uuid": "cb8790424a515a4871cb3fe3d3ee8e6395fb1be1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/11/06/102160867-echo2.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/14/effect-of-smart-assistants-like-amazon-echo-google-home-on-kids.html", "country": "US", "domain_rank": 767, "title": "Effect of smart assistants like Amazon Echo Google Home on kids", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.13, "site_type": "news", "published": "2018-01-14T18:04:00.000+02:00", "replies_count": 0, "uuid": "cb8790424a515a4871cb3fe3d3ee8e6395fb1be1"}, "author": "Jillian D'Onfro", "url": "https://www.cnbc.com/2018/01/14/effect-of-smart-assistants-like-amazon-echo-google-home-on-kids.html", "ord_in_thread": 0, "title": "Effect of smart assistants like Amazon Echo Google Home on kids", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "apple", "sentiment": "negative"}, {"name": "amazon echo google", "sentiment": "negative"}, {"name": "solace shen", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "cornell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "While investors pressure Apple to address youth phone addiction, experts are more optimistic about the voice-enabled smart speakers that Google and Amazon want to plunk into your living room.\nAt their most ambitious, Amazon's Echo and Google's Home devices are meant to transform the way you manage your life and control your home, using artificial intelligence to put an ever-increasing range of capabilities at your command . But at their most basic, they simply allow you to spend less time tapping away on a screen. And as Apple's current scrutiny underscores , that can be particularly important when it comes to kids.\nSolace Shen, a researcher at Cornell who has studied children's interactions with intelligent technology, says she sees a big opportunity for educational and entertainment content on these devices that doesn't suck kids in in the same way that a smartphone would.\n\"Playing a game with an adult or another child using a voice-enabled device, you're not focused on a screen, so the interaction encourages you to look at each other and pay attention to each other,\" Shen explains. \"That's a unique advantage of these voice enabled systems. If they're designed right, they can be unobtrusive, but speak up when needed.\"\nMichael Short | Bloomberg | Getty Images Both Google and Amazon already have a wide range of children's content available, including trivia games, stories, and interactive question sessions with characters from the likes of Sesame Street or Disney. They also both have ways to set up profiles for young children with parental controls to easily monitor usage and what a kid has access to. And both companies have plans to keep expanding their offerings in the coming year.\n\"You're going to see us invest heavily in expanding both the experiences and the content we produce for kids and families in 2018,\" Raunaq Shah, a Google Home product manager, told late last year. \"The reception to the features that we've launched so far has been tremendous and there's really a huge opportunity for us to make the experience for kids and families even better.\"\nHe highlights how the communal and public nature of these devices can allow parents to feel better about letting kids get comfortable with them — it's hard to have secrets when everything you ask gets logged in a mutually accessible search history or can be heard out loud when you ask it. Plus, kids can be entertained or informed without the dopamine hit of notifications that come when you fire up a phone.\n\"If you watch a kid with the smartphone, all the bells and whistles are just so seductive and addictive,\" says Marika Lindholm, sociologist and founder of ESME , a site for single moms. \"With the Echo or the Home, there is the opportunity for much more listening and interaction.\"\nThe barrage of notifications and social applications on a phone can cause anxiety and encourage a kind of digital relationship that just isn't possible with smart speakers as we know them now. And there are early signs that when people use smart speakers, their usage becomes a substitute for time on smartphones: Two-thirds of people who use digital voice assistants use their phones less often, according to a new survey published by tech consultancy Accenture .\nIn the end, parents must take control\nLindholm has heard fears that kids could end up thinking of the assistants as real people and looking to them for things that they'd otherwise talk about with a parent. An amusing example of this can be seen in a short video by Brett Gaylor that documents his five-year-old's son's obsession with Google's voice commands .\nWhile Google's Shah said that that video made him feel \"warm and fuzzy\" inside, some may see it as portending a slightly disturbing future. The idea that children could be taught so much by these new devices — especially when these assistants have so far proven that they often get information wrong — is a little scary. Meanwhile, studies have shown that young children see these assistants as \"semi-animate\" and some parents have complained that because you don't need \"please\" or \"thank you\" to control the devices , it encourages bad manners.\nPlus, YouTube's struggles last year to keep disturbing content out of its children's feeds could make some parents wary of placing trust in kid settings.\nUltimately, though, as with any other technology, the onus is on the parent to instruct their child on etiquette, set limits and moderate usage.\n\"You should model them to kids not as a toy or a reward or a god-given right to have,\" says Michael Rich, director of the Center on Media and Child Health at Harvard University . \"You say, 'This is a tool, this is what it does, here's how you use it, and here's how and when you don't use it.'\"\nLike the other experts CNBC talked to, Rich feels hopeful about the future of smart assistant technologies and how children will interact with them. His 11-year-old son recently bought one of Google's Home devices with his own money and Rich likes how the device can assist with random questions without always being in his son's clutches, like a smartphone. Still, he acknowledges that, unlike with smartphones, there haven't been any real studies yet to see what impacts these smart speakers could have on children.\n\"They haven't been out long enough yet — I think the jury's still out on them,\" concludes Dr. David Greenfield, assistant clinical professor of psychiatry and founder of the Center for Internet and Technology Addiction, \"But I do think the screened versions of them have potential to be addictive. So far, any internet based technology does appear to have addictive potential.\"", "external_links": [], "published": "2018-01-14T18:04:00.000+02:00", "crawled": "2018-01-14T18:04:47.000+02:00", "highlightTitle": ""}