{"organizations": [], "uuid": "807ca98072e77108cc46b0ac45df297c1ae0b11b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220512766&w=1200&r=LYNXMPEE080ON", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-ghouta/talks-with-rebels-in-no-mans-land-as-russia-eyes-post-war-role-in-syria-idUKKBN1EY14G", "country": "US", "domain_rank": 408, "title": "Talks with rebels in no-man's land as Russia eyes post-war role in Syria", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T13:22:00.000+02:00", "replies_count": 0, "uuid": "807ca98072e77108cc46b0ac45df297c1ae0b11b"}, "author": "", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-ghouta/talks-with-rebels-in-no-mans-land-as-russia-eyes-post-war-role-in-syria-idUKKBN1EY14G", "ord_in_thread": 0, "title": "Talks with rebels in no-man's land as Russia eyes post-war role in Syria", "locations": [], "entities": {"persons": [{"name": "jaysh al-islam", "sentiment": "none"}, {"name": "ellen francis", "sentiment": "none"}], "locations": [{"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "ghouta", "sentiment": "none"}, {"name": "beirut", "sentiment": "none"}, {"name": "damascus", "sentiment": "none"}, {"name": "tal farzat", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 11:10 AM / Updated 2 hours ago Talks with rebels in no-man's land as Russia eyes post-war role in Syria Ellen Francis 7 Min Read \nBEIRUT (Reuters) - Syrian rebels under siege near Damascus have resorted to talks with the government’s ally Russia, sometimes meeting in no-man’s land, as they seek to hang on to their enclave. FILE PHOTO: Rebel fighters of Jaysh al-Islam gather in Tal Farzat in the besieged rebel-held eastern Ghouta area of Damascus, Syria February 2, 2017. REUTERS/Bassam Khabieh/File Photo \nThe meetings on eastern Ghouta - the only major rebel bastion around the capital - underline Moscow’s deepening role in trying to shape Syria’s future after the conflict, which broke out in 2011. \nThe rebels have won almost nothing from the negotiations so far, but they say they have little choice. \nThey believe the Russians, whose air force all but won the war for the government, will have the final say on Syria’s fate. \nThe two main rebel forces in the suburbs signed ceasefires with Russia in the summer, but fighting has carried on. Both said they have been talking to Russian officials regularly for several months. \n“It’s better to negotiate with the one calling the shots, which is Russia, than with the regime,” said Wael Olwan, spokesman for the Failaq al-Rahman insurgents. “So the factions are forced to sit down with them. This is the reality.” \nThe Russian defence and foreign ministries did not respond to requests for comment on the talks. Moscow says the reconciliation centre at its air base in Syria routinely holds peace talks with armed factions across the country. \nThe Syrian government’s minister for national reconciliation has said the state intends to get all militants out of eastern Ghouta and restore its full control. \nBut the insurgents want their enemies to observe the truce, which they say includes lifting the siege, opening crossings, and letting dying patients out. It would also involve evacuating the few hundred fighters of al Qaeda’s former Syria branch. \nBoth factions accuse Moscow of not honouring the deals, or turning a blind eye to Syrian army violations. \nDamascus and Moscow say they only target militants. \n“We send them documentation of how the aircraft drops missiles on residential areas,” said Hamza Birqdar, a military spokesman for the Jaish al-Islam rebels. \n“Either there is silence ... or baseless excuses,” he said. “They say government authorities denied bombing. Then these planes flying over the Ghouta, who do they belong to?” TRUCE PROCESS \nThe conflict has killed hundreds of thousands of people and created the world’s worst refugee crisis. Monitors and opposition activists blame Russian bombing for thousands of civilian deaths and much of the destruction - allegations Moscow denies. \nAfter turning the war in favour of Syrian President Bashar al-Assad, Russia has seized the reins of international diplomacy in the past year. It has sought to build a political process outside of failed U.N. peace talks in Geneva. \nOther countries including the United States, meanwhile, have wound down support for the array of mostly Sunni rebels. \nRussian President Vladimir Putin, who first sent warplanes to help Assad in 2015, is pushing for a congress of national dialogue between Syria’s many combatants. \nWith the map of Syria’s conflict redrawn, Russia wants to convert military gains into a settlement that stabilises the shattered nation and secures its interests in the region. \nTo this end, Moscow has been negotiating behind the scenes with armed factions across Syria. FILE PHOTO: A man is seen near rubble of damaged buildings after an airstrike on the Eastern Ghouta town of Misraba, Syria, January 4, 2018. REUTERS/Bassam Khabieh/File Photo \n“We communicate exclusively with them,” said Birqdar. “Because in reality, when it comes to Assad and his government, they have become toys in the hands of the Russians. They make no decisions ... except under Russian orders.” \nWith official and secret talks, Russia has built ties to local groups partly to gain influence on the ground, said Yury Barmin, an expert with the Russian International Affairs Council, a think-tank close to the foreign ministry. \n“There’s one goal. Their inclusion in the truce process,” he said. “All this is done with the aim of populating these Russian processes, ones led by Russia, with such opposition groups.” \nNO MAN‘S LAND \nSince 2013, Syrian government forces and their allies have blockaded eastern Ghouta, a densely populated pocket of satellite towns and farms. \nThe military has suppressed opposition enclaves across western Syria, with the help of Russian air power and Iran-backed Shi‘ite militias. Nearly seven years into the war, Assad has repeatedly vowed to take back every inch of Syria. \nThe Ghouta remains the only big rebel enclave near the heavily fortified capital. Slideshow (2 Images) \n“Our communications with the Russian side are through (their) official in Damascus in charge of this file, by phone and in meetings,” said Yasser Delwan, a local Jaish al-Islam political official. \nThey meet Russian forces in no-man’s land, the abandoned farmland between rebel and government territory, at the edge of the nearby Wafideen camp. \n“We talk about the deal we signed ... implementing it from paper into something practical,” he said. \nBoth rebel forces said Russia instigated the talks. They said Russian officials sometimes blame Iran-backed forces for breaking the truce or use jihadists as a pretext for attacks against the Ghouta. \nFailaq al-Rahman only negotiates with Russian officials outside Syria, said Olwan, their spokesman. \n“In reality, Russia has never been honest in its support of the political track,” he said. “But with the failure of the international community ... the factions were forced to negotiate with the enemy.” DE-ESCALATION DEALS \nEastern Ghouta falls under ceasefire plans for rebel territory that Russia has brokered across Syria in the past year, with help from Turkey and Iran. \nWhen the insurgents signed the “de-escalation” deal with Russia last summer, residents and aid workers hoped food would flow into the suburbs, home to around 400,000 people. But they say it has brought no relief. \nDespite lulls in air strikes, the siege got harsher. In some frontline districts, fierce battles rage on. Food, fuel, and medicine have dwindled, especially after the shutdown of smuggling tunnels. \nA Syrian official in Damascus said the army has only retaliated to militants in the suburbs shelling districts of the capital. “As for the Russian allies, every action takes place on Syrian land in full and total coordination with the Syrian government,” the official said. “They have a big role.” \nThe Ghouta’s rebel factions, which have long been at odds, say they have no direct contacts with Assad’s government. \n“In its communications, Russia has always tried to present itself as the solution,” Olwan said. “We don’t see them as mediators. We see them as the final commander in the regime’s ranks.” \nThe Damascus government mostly does not play a role in the talks, said Barmin, the Russia analyst. “Damascus is presented with a fait accompli and must either accept it or not.” Additional reporting by Moscow bureau; Editing by Giles Elgood and Anna Willard", "external_links": [], "published": "2018-01-09T13:22:00.000+02:00", "crawled": "2018-01-09T13:42:47.070+02:00", "highlightTitle": ""}