{"organizations": [], "uuid": "9c673eb4169919f7984651a7a87406157c62f940", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220163989&w=1200&r=LYNXMPEE0706T", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-injuries/tennis-walking-wounded-make-opening-slam-hard-to-predict-idUKKBN1EX084", "country": "US", "domain_rank": 408, "title": "Tennis: Walking wounded make opening slam hard to predict", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T06:16:00.000+02:00", "replies_count": 0, "uuid": "9c673eb4169919f7984651a7a87406157c62f940"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-injuries/tennis-walking-wounded-make-opening-slam-hard-to-predict-idUKKBN1EX084", "ord_in_thread": 0, "title": "Tennis: Walking wounded make opening slam hard to predict", "locations": [], "entities": {"persons": [{"name": "martyn herman", "sentiment": "none"}, {"name": "federer", "sentiment": "none"}, {"name": "kei nishi", "sentiment": "none"}, {"name": "andy murray", "sentiment": "none"}, {"name": "alexander zverev", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "uniprix stadium", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "quebec", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 4:18 AM / Updated an hour ago Walking wounded make opening slam hard to predict Martyn Herman 4 Min Read \n(Reuters) - For good reason a two-week grand slam can be described as a ‘last man standing’ marathon of mental and physical endurance, which makes Roger Federer’s haul of 19 all the more incredible. FILE PHOTO - Aug 13, 2017; Montreal, Quebec, Canada; Roger Federer of Switzerland looks at the award ceremony as Alexander Zverev of Germany (not pictured) won during the Rogers Cup tennis tournament at Uniprix Stadium. Jean-Yves Ahern-USA TODAY Sports \nDefending champion Federer will be back sniffing a 20th major at the Australian Open but the build-up to the men’s tournament has been more about who will even make the start line in Melbourne next Monday, rather than who will last the course. \nRarely have so many top players begun the season either carrying injuries or taking the early steps back from lengthy absences. \nAll eyes will be on the medical bulletins as much as the on-court duels next week. \nFive-times runner-up Andy Murray and Japan’s Kei Nishikori will take no part, with Murray’s hip injury casting a huge cloud over the former world number one’s career. \nLast year’s runner-up Rafael Nadal missed the Brisbane warm-up event with the knee injury that struck at the end of last season still nagging him. \nSix-times champion Novak Djokovic has not played a competitive match since last year’s Wimbledon because of an elbow problem that flared up again recently, forcing him to skip the season-opening Qatar Open. \nFormer champion Stan Wawrinka and Canadian Milos Raonic are also still getting up to speed after injury breaks. \nThey will all take heart from 12 months ago when Federer, just back from a six-month layoff, claimed the title by beating Nadal, who has also fought off injury demons, to reach the final. That duo went on to dominate the year. \nWith so much uncertainty about so many contenders, this year’s men’s event is one of the hardest to predict for years, although three-times former champion Mats Wilander believes returning from an injury can make players especially dangerous. \n“It can free up the mind because you’re coming in with lower expectations maybe,” the Swede, who will be hosting his Game, Set and Mats show for Eurosport during the Open, told Reuters. \nFederer displayed that freedom last year and Wilander believes that fellow Swiss Wawrinka, who ended last season in August with a knee complaint, could arrive with a similar attitude this time around at Melbourne Park. \n”Wawrinka is the perfect player for a major,“ Wilander said. ”He has won three, won the Aussie Open. \n“Stan can be up and down in the season but delivers at the majors. If he comes back with the joy of fighting and the joy of playing and his confidence is high, he is as dangerous as all the other guys.” \nWith so many injuries, questions have been raised about the demands of the men’s game, but Wilander does not subscribe to the theory that it is anything sinister. \n”What it shows is that the top guys are staying at the top longer, for whatever reason that is,“ he said. ”Now going past 30 is not that important because they look after themselves. \n”But they have more miles on the clock and that results in injuries. With Novak the elbow, Rafa the knee, Federer the knee and now Murray the hip, it’s just wear and tear eventually. \n”The other thing is that the younger guys have not taken their places. That means we focus more on the old guys. \n“If Federer was 15 in the world and Rafa 20 and (Alexander) Zverev and (Nick) Kyrgios were one and two and winning majors we wouldn’t even be talking about the older guys.” \nWilander also said that even though they are older and more creaky, Federer and Nadal still possess an aura that means they win matches before leaving the locker room. \n“Even when less than 100 percent they are still intimidating,” he said. Reporting by Martyn Herman, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-08T06:16:00.000+02:00", "crawled": "2018-01-08T06:35:47.022+02:00", "highlightTitle": ""}