{"organizations": [], "uuid": "47be44d8b28a41f3fe840a343274f3425f83d259", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-morning-technical-insight-on-these-it-services-stocks--jianpu-technology-ncr-corp-servicenow-and-qudian.html", "country": "US", "domain_rank": 767, "title": "Morning Technical Insight on These IT Services Stocks -- Jianpu Technology, NCR Corp., ServiceNow, and Qudian", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-29T14:05:00.000+02:00", "replies_count": 0, "uuid": "47be44d8b28a41f3fe840a343274f3425f83d259"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-morning-technical-insight-on-these-it-services-stocks--jianpu-technology-ncr-corp-servicenow-and-qudian.html", "ord_in_thread": 0, "title": "Morning Technical Insight on These IT Services Stocks -- Jianpu Technology, NCR Corp., ServiceNow, and Qudian", "locations": [], "entities": {"persons": [], "locations": [{"name": "qudian new york", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "jianpu technology", "sentiment": "negative"}, {"name": "ncr corp.", "sentiment": "negative"}, {"name": "jianpu technology inc.", "sentiment": "none"}, {"name": "qudian inc.", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "wallstequities.com", "sentiment": "none"}, {"name": "servicenow inc.", "sentiment": "none"}, {"name": "information technology services", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "ncr", "sentiment": "none"}, {"name": "jianpu technology shares", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK,\nWallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on JT, NCR, NOW, and QD which can be accessed for free by signing up to www.wallstequities.com/registration . WallStEquities.com has initiated research coverage on Jianpu Technology Inc. (NYSE: JT), NCR Corp. (NYSE: NCR), ServiceNow Inc. (NYSE: NOW), and Qudian Inc. (NYSE: QD). Companies in the Information Technology Services industry provide services such as software support, computer systems design, and data processing facilities management. All you have to do is sign up today for this free limited time offer by clicking the link below.\nwww.wallstequities.com/registration\nJianpu Technology\nShares in Beijing, China headquartered Jianpu Technology Inc. ended Friday's session 4.99% lower at $8.38 with a total trading volume of 461,386 shares. The stock has advanced 28.73% in the last month. The Company's shares are trading 25.60% above their 50-day moving average. Moreover, shares of Jianpu Technology, which operates a platform that provides online discovery and recommendation services for financial products in China, have a Relative Strength Index (RSI) of 66.56. Get the full research report on JT for free by clicking below at: www.wallstequities.com/registration/?symbol=JT\nNCR Corp.\nDuluth, Georgia headquartered NCR Corp.'s shares rose 1.61%, closing the day at $37.89. A total volume of 655,998 shares was traded. The stock has advanced 12.67% in the last month and 18.37% in the previous three months. The Company's shares are trading 13.90% and 2.48% above their 50-day and 200-day moving averages, respectively. Additionally, shares of NCR Corp., which provides omni-channel technology solutions that enable businesses connect, interact, and transact with their customers worldwide, have an RSI of 76.25.\nOn January 19 th , 2018, NCR Corp. was recognized as a 2018 Top 100 Global Technology Leader by Thomson Reuters. The inaugural program identifies the Tech industry's most operationally sound and financially successful organizations. The study, the industry's first holistic assessment of today's leading tech companies, utilizes a 28-point, data-driven algorithm to objectively identify organizations with the fortitude for the future in today's complex business environment. To experience our free membership services anytime/ anywhere and access the free report on NCR, click to register at: www.wallstequities.com/registration/?symbol=NCR\nServiceNow\nLast Friday, shares in Santa Clara, California headquartered ServiceNow Inc. gained 2.89%, closing the session at $149.74. The stock recorded a trading volume of 1.47 million shares. The Company's shares have advanced 15.79% in the last month, 20.16% over the previous three months, and 67.34% over the past year. The stock is trading 15.20% above its 50-day moving average and 31.02% above its 200-day moving average. Furthermore, shares of ServiceNow, which provides enterprise cloud computing solutions that define, structure, manage, and automate services for enterprises worldwide, have an RSI of 84.84.\nOn January 02 nd , 2018, ServiceNow announced that it will release financial results for Q4 and FY17 ended December 31 st , 2017, on January 31 st , 2018, following the close of market. The Company will host a conference call and live webcast at 2:00 p.m. PT that same day to discuss the results. An audio replay of the conference call and webcast will be available under the investor relations section of the Company's website.\nOn January 22 nd , 2018, research firm Mizuho reiterated its 'Buy' rating on the Company's stock with an increase of the target price from $140 a share to $160 a share. Join our big investor community at Wall St. Equities today and get your free report on NOW at: www.wallstequities.com/registration/?symbol=NOW\nQudian\nBeijing, China headquartered Qudian Inc.'s stock finished the session 7.81% lower at $13.34. A total volume of 6.46 million shares was traded, which was above their three months average volume of 5.86 million shares. The Company's shares have advanced 8.02% in the last month. The stock is trading below its 50-day moving average by 6.74%. Additionally, shares of Qudian, which provides online small consumer credit in China, have an RSI of 53.89.\nOn January 15 th , 2018, Qudian announced \"Dabai Auto,\" its new business initiative in budget auto financing. Launched in late November 2017, Dabai Auto aims to capture the significant opportunity in China' s new vehicle transaction market and enable new car sales by providing financial leasing solutions to car buyers, who were previously underserved by traditional financing providers.\nOn January 26 th , 2018, research firm Stifel downgraded the Company's stock rating from 'Buy' to 'Hold' while revising its previous target price from $19 a share to $15 a share. Know more about QD in our free research coverage at: www.wallstequities.com/registration/?symbol=QD\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither WSE nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit https://wallstequities.com/legal-disclaimer/\nCONTACT\nFor any questions, inquiries, or comments reach out to us directly. If you're a company, we are covering and wish to no longer feature on our coverage list contact us via email and/or phone between 09:30 EDT to 16:00 EDT from Monday to Friday at:\nEmail: info@wallstequities.com\nPhone number: +21-32-044-483\nOffice Address: 1 Scotts Road #24-10, Shaw Center Singapore 228\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n : releases/morning-technical-insight-on-these-it-services-stocks----jianpu-technology-ncr-corp-servicenow-and-qudian-300589361.html\nSOURCE Wall St. Equities", "external_links": ["http://www.wallstequities.com/registration/?symbol=QD", "https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration/?symbol=NOW", "http://www.wallstequities.com/registration/?symbol=JT", "http://www.prnewswire.com/news-releases/morning-technical-insight-on-these-it-services-stocks----jianpu-technology-ncr-corp-servicenow-and-qudian-300589361.html", "http://www.wallstequities.com/registration/?symbol=NCR", "http://www.wallstequities.com/registration"], "published": "2018-01-29T14:05:00.000+02:00", "crawled": "2018-01-29T16:49:35.000+02:00", "highlightTitle": ""}