{"organizations": [], "uuid": "4f86879ec97f09d5e2ed3a95832cb1014b87c4fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-resource-credit-income-fund-rciax-announces-quarterly-distribution.html", "country": "US", "domain_rank": 767, "title": "Resource Credit Income Fund (RCIAX) Announces Quarterly Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:11:00.000+02:00", "replies_count": 0, "uuid": "4f86879ec97f09d5e2ed3a95832cb1014b87c4fc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-resource-credit-income-fund-rciax-announces-quarterly-distribution.html", "ord_in_thread": 0, "title": "Resource Credit Income Fund (RCIAX) Announces Quarterly Distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA--(BUSINESS WIRE)-- Today, Resource Credit Income Fund (the “Fund,” ticker RCIAX ) announced its quarterly distribution of $0.175* per share as of December 31, 2017. This represents a 6.3 percent distribution and is the seventh consecutive quarterly distribution. The Fund began trading on April 17, 2015 and closed the quarter as of December 31, 2017 with an inception-to-date cumulative total return of 24.3 percent.\nThe Fund is a closed-end interval fund that seeks current income, risk diversification, and capital preservation by investing in direct credit, private credit, and traded business development companies.\nPer Annum Fund Performance as of 12/31/17.\nAs of 12/31/17 1-year 3-year 5-year Since Inception (4/17/15) The Fund 11.8% N/A N/A 8.4% The Fund with MOP** 4.6% N/A N/A 5.7% Performance data Quote: d represents past performance. Past performance is no guarantee of future results and investment returns and principal value of the Fund will fluctuate so that shares, when redeemed, may be worth more or less than their original cost. Current performance may be lower or higher than the performance data Quote: d above. Performance information is reported net of the Fund’s fees and expenses. The Fund’s gross expenses are 20.65% and net expenses are 3.64%. Net fees are based on a contractual fee waiver and reimbursement agreement of 17.01% through at least September 9, 2018. Please review the Fund’s prospectus for more information regarding the Fund’s fees and expenses. Performance and expenses shown are for Class A shares (please see the Fund’s prospectus for information about other share classes). For performance information current to the most recent month-end, please call toll-free (866) 773-4120 or visit www.ResourceCreditIncome.com .\n* To calculate the quarterly distribution, the Fund takes the income received from the Fund’s portfolio, subtracts expenses, and divides the result by the total number of shares owned by the Fund’s shareholders. Distributions are not guaranteed.\n** Maximum Offering Price (MOP) for Class A shares includes the Fund’s maximum sales charge of 5.75%.\nAn interval fund is a continuously-offered closed-end fund that periodically offers to repurchase its shares from shareholders. This feature allows the Fund greater opportunities to invest in less liquid assets, which may result in higher risk-adjusted returns. Through the interval structure, the Fund offers a liquidity feature of quarterly redemptions at NAV of no less than 5% of the shares outstanding made available, redeeming more frequently than other real estate and private equity investments. Regardless of how the Fund performs, there is no guarantee that shareholders will be able to sell all of the shares they desire in a quarterly repurchase offer.\nA portion of the distributions consists of a return of capital based on the character of the distributions received from the underlying holdings. The final determination of the source and tax characteristics of all distributions in 2017 will be made after the end of the year. Shareholders should note that a return of capital will reduce the tax basis of their shares and potentially increase the taxable gain, if any, upon disposition of their shares. Resource Alternative Advisor, LLC, the Fund’s investment advisor, and ALPS Distributors, Inc. are not tax experts and do not offer legal or tax advice. It is recommended that shareholders consult with an accountant, tax advisor and/or lawyer. There is no assurance that the Fund will continue to declare distributions or that distributions will continue at these rates. There can be no assurance that any investment by the Fund will be effective in achieving the Fund’s investment objectives, delivering positive returns or avoiding losses.\nThis distribution policy is subject to change. The Fund may make distributions that are treated as a return of capital. A return of capital may occur, for example, when some or all of the money that you invested in the Fund is paid back to you. A return of capital distribution does not necessarily reflect the Fund’s investment performance and should not be confused with “yield,” “income,” or “profit.” The Fund’s distribution amounts were calculated based on the ordinary income received from the underlying investments, including net investment income. Shareholders should not assume that the source of a distribution from the Fund is net profit.\nAn investor should consider the investment objectives, risks, charges and expenses of the Fund carefully before investing. To obtain a prospectus containing this and other information, please call (866) 773-4120 or download the file from www.ResourceCreditIncome.com . Read the prospectus carefully before you invest.\nThe Fund is distributed by ALPS Distributors, Inc. (ALPS Distributors, Inc. 1290 Broadway, Suite 1100, Denver, CO 80203). Resource Alternative Advisor, LLC is a subsidiary of Resource America, Inc. Resource Alternative Advisor, LLC is not affiliated with ALPS Distributors, Inc.\nInvesting involves risk. Investment return and principal value of an investment will fluctuate, and an investor’s shares, when redeemed, may be worth more or less than their original cost. Alternative investment funds, ETFs, interval funds, and closed-end funds are subject to management and other expenses, which will be indirectly paid by the Fund. Debt instruments are subject to credit risk and interest rate risk and may be subordinated to more senior debt instruments. BDCs often use leverage to enhance returns and are subject to interest rate risk, credit risk, and liquidity risk. CLOs are debt instruments but also carry additional risks related to the complexity and leverage inherent in the CLO structure. The use of leverage, such as borrowing money to purchase securities, will cause the Fund to incur additional expenses and magnify the Fund’s gains or losses.\nThere currently is no secondary market for the Fund’s shares and the Fund expects that no secondary market will develop. Shares of the Fund will not be listed on any securities exchange, which makes them inherently illiquid. Limited liquidity is provided to shareholders only through the Fund’s quarterly repurchase offers, regardless of how the Fund performs. Investments in lesser-known, small and medium capitalization companies may be more vulnerable than larger, more established organizations. The sales of securities to fund repurchases could reduce the market price of those securities, which in turn would reduce the Fund’s NAV.\nAbout Resource America, Inc.\nResource America, Inc. (“Resource”), the parent company of Resource Alternative Advisor, LLC, the Fund’s investment advisor, is an asset management company that specializes in real estate and credit investments. Resource’s main objective is to be a best-in-class asset manager as measured by risk-adjusted returns to investors and the quality of the funds and businesses it manages. The company’s investments emphasize consistent value and long-term returns with an income orientation. Resource is a wholly-owned subsidiary of C-III ", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ResourceCreditIncome.com&esheet=51745593&newsitemid=20180118006309&lan=en-US&anchor=www.ResourceCreditIncome.com&index=2&md5=fab21b3007443cb590c3a26042c67858", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ResourceCreditIncome.com&esheet=51745593&newsitemid=20180118006309&lan=en-US&anchor=www.ResourceCreditIncome.com&index=3&md5=b3d8ab401e1203d9db5c29054b4f7c1d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.resourcecreditincome.com&esheet=51745593&newsitemid=20180118006309&lan=en-US&anchor=RCIAX&index=1&md5=aa69656669499149a5acaf1140f55021", "http://www.businesswire.com/news/home/20180118006309/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.resourceamerica.com%2F&esheet=51745593&newsitemid=20180118006309&lan=en-US&anchor=Resource+America%2C+Inc.&index=4&md5=9f7c5b544540b26627ce1e8c6f6ff2ba"], "published": "2018-01-18T23:11:00.000+02:00", "crawled": "2018-01-19T01:22:40.014+02:00", "highlightTitle": ""}