{"organizations": [], "uuid": "14bd6af83d6a59b14baf2f1790d9590a063f1e9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219395383&w=1200&r=LYNXMPEE031AU", "site_section": "https://www.reuters.com/news/us", "section_title": "U.S. News | Reuters", "url": "https://www.reuters.com/article/us-usa-puertorico-storm-death/puerto-rico-sets-90-day-target-for-review-of-hurricane-deaths-idUSKBN1ET27D", "country": "US", "domain_rank": 408, "title": "Puerto Rico sets 90-day target for review of hurricane deaths", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T03:08:00.000+02:00", "replies_count": 0, "uuid": "14bd6af83d6a59b14baf2f1790d9590a063f1e9b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-puertorico-storm-death/puerto-rico-sets-90-day-target-for-review-of-hurricane-deaths-idUSKBN1ET27D", "ord_in_thread": 0, "title": "Puerto Rico sets 90-day target for review of hurricane deaths", "locations": [], "entities": {"persons": [{"name": "hurricane maria", "sentiment": "none"}, {"name": "ricardo rossello", "sentiment": "none"}, {"name": "rossello", "sentiment": "none"}, {"name": "hector pesquera", "sentiment": "none"}, {"name": "pesquera", "sentiment": "none"}], "locations": [{"name": "puerto rico", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "public safety", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Facing mounting criticism that his administration understated the death toll from September’s Hurricane Maria, Puerto Rico Governor Ricardo Rossello on Thursday established a 90-day process to review the causes of thousands of recent deaths.\nRossello, through an executive order, directed Public Safety Secretary Hector Pesquera to lead an analysis of thousands of deaths that have occurred since Hurricane Maria hit Puerto Rico in September. Pesquera’s team is to present findings within 90 days, according to a statement issued in Spanish from Rossello’s office.\n“As part of the recovery process, it is important to guarantee transparency in the damages caused to the lives and safety of our citizens,” Rossello said.\nHis administration’s official death toll from the storm sits at 64. Maria - the most powerful hurricane to hit Puerto Rico in nearly 90 years - decimated local infrastructure, and nearly half the island’s 3.4 million residents remain without power three-and-a-half months later.\nThe governor came under fire as families and nursing home officials complained that the death toll did not match anecdotal evidence of an increase in deaths as vulnerable residents struggled to get timely medical care.\nA November study by a Pennsylvania State University researcher found the toll could be 10 times higher than the government’s figure. A December study by the New York Times, which compared recent mortality data with historical averages, found that Maria may be responsible for as many as 1,052 deaths.\nUnder Rossello’s executive order, Pesquera is to work with Puerto Rico’s demographic registry and bureau of forensic sciences to establish procedures for the analysis.\nMaria was a major blow to an already-woebegone island, whose $120 billion in combined bond and pension debt triggered the largest-ever U.S. government bankruptcy filing last May.\nPuerto Rico’s benchmark general obligation bond price, which already trading at a steep discount, cratered in Maria’s wake, dipping to around 20 cents on the dollar. The bonds, which trade in default and carry no yield, have since edged higher to 24.995 cents on the dollar on Thursday, according to Thomson Reuters data.\nReporting by Nick Brown; Editing by Daniel Bases and Alistair Bell\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T03:08:00.000+02:00", "crawled": "2018-01-04T21:25:08.045+02:00", "highlightTitle": ""}