{"organizations": [], "uuid": "316517ba47eae560080fb0ed564dad91d082a250", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-craig-t-castille-named-managing-director-of-hwcg-llc.html", "country": "US", "domain_rank": 767, "title": "Craig T. Castille Named Managing Director of HWCG LLC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T17:00:00.000+02:00", "replies_count": 0, "uuid": "316517ba47eae560080fb0ed564dad91d082a250"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-craig-t-castille-named-managing-director-of-hwcg-llc.html", "ord_in_thread": 0, "title": "Craig T. Castille Named Managing Director of HWCG LLC", "locations": [], "entities": {"persons": [{"name": "craig t. castille", "sentiment": "negative"}, {"name": "hwcg", "sentiment": "none"}, {"name": "castille", "sentiment": "none"}, {"name": "michael noel", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "hwcg", "sentiment": "negative"}, {"name": "hwcg board and steering committee", "sentiment": "none"}, {"name": "hwcg board", "sentiment": "none"}, {"name": "drilling for stone energy corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON--(BUSINESS WIRE)-- HWCG recently announced that Craig T. Castille has been appointed as the Managing Director effective January 1, 2018.\nWhile employed as the Director of Drilling for Stone Energy Corporation, a member of HWCG, he served on the HWCG Board since its inception, and as Chairman of the HWCG Board and Steering Committee from 2015 to 2017. In his new position, Castille is well positioned to provide leadership for the organization into the future.\n“We are committed to achieving the response needs of our members today and into the future. HWCG continues to bring together the industry’s brightest and most experienced deepwater personnel and is looking forward to adding Castille’s extensive experience to our team,” said Michael Noel, Commercial Director of HWCG.\nAs the Managing Director, Castille will be responsible for overseeing operations for the organization. Castille aims to provide excellent service to Members, engage regulatory, state and federal stakeholders and grow membership.\nCastille has over 30 years of international and diverse experience in offshore rig operations involving drilling, completions, well testing and abandonments on platform rigs, jack ups and floaters since graduating in petroleum engineering from the University of Louisiana in 1985. Castille concluded his over 7-year tenure at Stone Energy during which time he participated on the API Joint Industry Task Force post Macondo, drilled 6 deepwater wells, participated in two unannounced containment drills as the Source Control Section Chief and helped implement two announced containment spill drills.\n“HWCG will continuously maximize collaborative efforts amongst our members, service providers and the industry’s regulators to ensure we have access to assets which can be uniquely equipped for a deepwater well containment event,” said Castille. “I’m looking forward to leading HWCG and furthering our commitment to safe and responsible offshore drilling and the prevention of a deepwater incident.”\nAbout HWCG LLC\nHWCG LLC is a consortium of 18 deepwater operators in the Gulf of Mexico who have come together with the common goal of maintaining capabilities to quickly and comprehensively respond to a subsea well containment event to protect people, property and the environment. Bringing together the technical expertise and resources from this diverse group of operators, and building upon equipment tested and proven in the Deepwater Horizon response, HWCG has developed a deepwater well containment response system and mutual aid agreement capable of immediate activation and deployment. For more information, visit: hwcg.org\nHWCG Members\nCobalt International Energy, L.P.\nNoble Energy, Inc. Deep Gulf Energy LP\nPetrobras America Inc. ENI US Operating Co. Inc.\nRed Willow Offshore, LLC EnVen Energy Ventures, LLC\nRepsol Services Company Energy Resource Technology GOM, LLC\nRidgewood Energy WCG Member, LLC LLOG Exploration Company, LLC\nStone Energy Corporation Marathon Oil Company\nTOTAL E&P USA, INC. Marubeni Oil & Gas (USA) Inc.\nWalter Oil & Gas Corporation Murphy Exploration & Production Company - USA\nW&T Offshore, Inc.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005490/en/\nBrandExtract LLC\nMary Becker, 713.942.7959\nSource: HWCG LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.hwcg.org%2F%3Futm_source%3Dbusinesswire%26utm_medium%3Dpress_release%26utm_campaign%3Dmanaging_director_2018&esheet=51750601&newsitemid=20180130005490&lan=en-US&anchor=hwcg.org&index=1&md5=229bdc26cab1fa79de8da634ba812ca9", "http://www.businesswire.com/news/home/20180130005490/en/"], "published": "2018-01-30T17:00:00.000+02:00", "crawled": "2018-01-30T18:43:04.007+02:00", "highlightTitle": ""}