{"organizations": [], "uuid": "1632f48cd070c526500c96fdba214b6440b6a689", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/05/02/103597695-GettyImages-474385724.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/05/some-cryptocurrency-backed-cards-dropped-from-visa-network.html", "country": "US", "domain_rank": 767, "title": "Some cryptocurrency-backed cards dropped from Visa network", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T21:29:00.000+02:00", "replies_count": 0, "uuid": "1632f48cd070c526500c96fdba214b6440b6a689"}, "author": "Annie Nova", "url": "https://www.cnbc.com/2018/01/05/some-cryptocurrency-backed-cards-dropped-from-visa-network.html", "ord_in_thread": 0, "title": "Some cryptocurrency-backed cards dropped from Visa network", "locations": [], "entities": {"persons": [{"name": "wirex", "sentiment": "none"}], "locations": [{"name": "cryptopay", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "bitwala", "sentiment": "none"}], "organizations": [{"name": "visa network visa", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Visa ended its relationship with a large cryptocurrency card provider on Friday, causing thousands of people's transactions to be declined and scrambling to figure out how to access their money. \nThe card provider, WaveCrest, confirmed in an email to CNBC that it was required \"to immediately close all Visa cards.\" \n\"As a licensed E-Money Institution, WaveCrest is required to safeguard funds to cover all of its issued electronic money and we can confirm that these funds are safe and available for redemption through other channels,\" the statement read. \nVisa said in a statement that \"it recently terminated a single prepaid card issuer in Europe from our network for violating Visa's operating regulations. That issuer, WaveCrest, was required to close its Visa card products, some of which were linked to cryptocurrency wallets.\"\nWavecrest provided its services to a number of crypto-card companies, including Bitwala, Cryptopay, Wirex and TenX. These companies convert people's cryptocurrencies into cash that is loaded on to a prepaid card, allowing people to use the currency for everyday transactions. \nNow these cards are invalid. \nDmitry Lazarichev, co-founder of cryptocurrency card company Wirex, said he's received thousands of calls from frantic customers. He said his company has issued some 500,000 cryptocurrency debit cards to people across the world, although not in the United States. \n\"All the cards were shut down in one second,\" Lazarichev said, adding that WaveCrest hasn't been responsive. \"We asked for more information, but they haven't provided any.\"\nTenX, another cryptocurrency card company affected, tried to reassure users.\nTweet 2 \nCardholders took to social media for answers. \nTweet 1 \nAlexander T., the man in the above tweet, who declined to give his last name, said he uses his cryptocurrency card to book hotels and pay for groceries. Thursday, he had been traveling from Spain to Switzerland, when he stopped in at a bar. His card was declined. \nHe's afraid he'll lose the money on his card.\n\"The problem is, I went on vacation,\" he said. \"I put a lot of money on this card.\"\nHe also worries that this mainstream way of using bitcoin will vanish. \n\"For all people who use bitcoin for their day-to-day expenses, it was the only way to do that,\" he said. \n\"Our actions were not specific to cryptocurrency,\" Visa said in the statement, \"but rather reflect the issuer's failure to comply with Visa's policies that ensure the safety and integrity of our payment system.\"\n(Update: This story has been updated to include comment from Visa.) \nMore from Personal Finance: \nAdvisors: Here's what you need to know before investing in bitcoin \nBitcoin is too risky to treat as a 'serious' investment, financial advisers say \nStart the new year with a financial plan", "external_links": [], "published": "2018-01-05T21:29:00.000+02:00", "crawled": "2018-01-06T06:57:38.129+02:00", "highlightTitle": ""}