{"organizations": [], "uuid": "9d0840e627299c90574125cc0502b1a3bafada5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-saudi-up-on-purge-progress-qatar-down-after-fighter-jet-report-idUSL8N1PA3O6", "country": "US", "domain_rank": 408, "title": "MIDEAST STOCKS-Saudi up on purge progress, Qatar down after fighter jet report", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:07:00.000+02:00", "replies_count": 0, "uuid": "9d0840e627299c90574125cc0502b1a3bafada5d"}, "author": "", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-saudi-up-on-purge-progress-qatar-down-after-fighter-jet-report-idUSL8N1PA3O6", "ord_in_thread": 0, "title": "MIDEAST STOCKS-Saudi up on purge progress, Qatar down after fighter jet report", "locations": [], "entities": {"persons": [{"name": "andrew torchia", "sentiment": "none"}, {"name": "alwaleed", "sentiment": "none"}, {"name": "deyaar", "sentiment": "none"}], "locations": [{"name": "qatar", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "emaar properties", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 2:09 PM / Updated 13 minutes ago MIDEAST STOCKS-Saudi up on purge progress, Qatar down after fighter jet report Reuters Staff \n* Riyadh hotel used as prison may soon reopen \n* Kingdom Holding continues rise on hope for Alwaleed settlement \n* SABIC, PetroRabigh strong among Saudi petchems \n* Qatar denies UAE allegation that it intercepted plane \n* Dubai’s Emaar Properties falls but Deyaar up in heavy trade \nBy Andrew Torchia \nDUBAI, Jan 15 (Reuters) - Saudi Arabian stocks continued rising on Monday on signs that Riyadh’s crackdown on corruption is nearing completion, while Qatar’s bourse fell steeply after the United Arab Emirates said Qatari fighter jets intercepted an Emirati civilian aircraft. \nThe Saudi index rose 0.6 percent, outperforming the rest of the region, after surging 1.4 percent on the previous day. \nThe luxury Riyadh hotel used as a prison during the corruption purge will reopen for business on Feb. 14, according to a company employee and its website, suggesting authorities are close to settling the cases of many of the dozens of detained princes, officials and businessmen. \nThis would reduce uncertainty for the stock market. Shares in Kingdom Holding rose 2.7 percent on Monday after jumping 7.0 percent on Sunday, when a Saudi official told Reuters that its detained chairman and owner, Prince Alwaleed bin Talal, was negotiating a settlement. \nPetrochemical blue chip Saudi Basic Industries climbed 2.6 percent, buoyed by high oil prices. PetroRabigh , which has been aided by the start-up of its Phase II petrochemical complex, soared 9.1 percent to its highest level since August 2015 in its heaviest trade since last May. \nBut Bank Albilad fell 2.4 percent after proposing a 0.4 riyal dividend for the second half of 2017, up from 0.3 riyal for the first half; the stock had risen sharply in recent weeks in anticipation of such news. \nQatar’s index tumbled 2.5 percent on heavy selling in the final half-hour of trade, ending a seven-day rising streak. It had soared 19 percent from its November low as investors chased dividends and data showed the economic damage to Qatar of a boycott by other Arab nations has been less than feared. \nStocks dropped after the UAE, one of the boycotting nations, said Qatari fighter jets had intercepted an Emirati civilian aircraft during a routine flight to Bahrain. Qatar denied this, but the accusation appeared to add to regional tensions. \nAmong major losers, Islamic bank Masraf Al Rayan plunged 4.9 percent and Gulf Warehousing tumbled 6.1 percent after saying its annual net profit rose to ‍​215.4 million riyals ($58.7 million) from 205.0 million, and proposing a dividend of 1.70 riyals for 2017 after 1.60 riyals for 2016. \nDubai’s index fell 0.5 percent as blue chip Emaar Properties dropped 1.4 percent. But smaller real estate developer Deyaar was the most heavily traded stock and added 1.2 percent. \nDespite strength in emerging markets globally, Egypt’s index dropped 0.8 percent as the biggest bank, Commercial International Bank, retreated 1.8 percent. HIGHLIGHTS \n* The index rose 0.6 percent to 7,483 points. DUBAI \n* The index fell 0.5 percent to 3,496 points. ABU DHABI \n* The index gained 0.4 percent to 4,602 points. QATAR \n* The index sank 2.5 percent to 8,947 points. EGYPT \n* The index dropped 0.8 percent to 15,128 points. KUWAIT \n* The index added 0.3 percent to 6,627 points. BAHRAIN \n* The index rose 0.4 percent to 1,324 points. OMAN", "external_links": [], "published": "2018-01-15T16:07:00.000+02:00", "crawled": "2018-01-15T16:23:48.014+02:00", "highlightTitle": ""}