{"organizations": [], "uuid": "6ea7077fd89b906fc5f1518270ee61b5927a779d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-chart-acquires-skaff-cryogenics.html", "country": "US", "domain_rank": 767, "title": "Chart Acquires Skaff Cryogenics", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.958, "site_type": "news", "published": "2018-01-03T00:01:00.000+02:00", "replies_count": 0, "uuid": "6ea7077fd89b906fc5f1518270ee61b5927a779d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-chart-acquires-skaff-cryogenics.html", "ord_in_thread": 0, "title": "Chart Acquires Skaff Cryogenics", "locations": [], "entities": {"persons": [{"name": "bob", "sentiment": "none"}, {"name": "skaff", "sentiment": "none"}, {"name": "steve prefontaine", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "northeast united states", "sentiment": "none"}, {"name": "brentwood", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "chart industries", "sentiment": "negative"}, {"name": "skaff cryogenics & cryo-lease", "sentiment": "none"}, {"name": "distribution & storage", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Chart Industries, Inc. (“Chart”) (Nasdaq:GTLS) announced today the acquisition of Skaff Cryogenics & Cryo-Lease, LLC (together “Skaff”).\nFounded in 1979, Skaff provides quality repair service and remanufacturing of cryogenic and liquefied natural gas storage tanks and trailers. Skaff is headquartered in Brentwood, New Hampshire and provides services and equipment to customers in North America. Skaff also maintains a portfolio of cryogenic storage equipment that is leased to customers for temporary and permanent needs. Customers include major gas suppliers, as well as a variety of smaller distributors and end users. Skaff will report through the Distribution & Storage (“D&S”) segment within Chart.\n“The acquisition of Skaff expands Chart’s direct regional presence for service and aftermarket support in the Northeast United States. This is a very strategic expansion for us as we drive to bring more value to our customers. The former owners, Bob and Steve Prefontaine, have built a business focused on the customer, quality and commitment,” stated Bill Johnson, Chart’s President and CEO.\n“I am very excited about the opportunities ahead,” commented Steven Prefontaine. “Chart’s philosophies, customer commitment and attention to quality makes this a great fit. We are very proud of the growth we’ve achieved over the years and are ready to take Skaff to the next level as part of Chart.”\nCertain statements made in this press release are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include statements concerning Chart’s plans, objectives, future orders, revenues, earnings or performance, liquidity and cash flow, capital expenditures, business trends, and other information that is not historical in nature. Forward-looking statements may be identified by terminology such as \"may,\" \"will,\" \"should,\" \"could,\" \"expects,\" \"anticipates,\" \"believes,\" \"projects,\" \"forecasts,\" “outlook,” “guidance,” \"continue,\" or the negative of such terms or comparable terminology.\nForward-looking statements contained in this press release or in other statements made by Chart are made based on management's expectations and beliefs concerning future events impacting Chart and are subject to uncertainties and factors relating to Chart’s operations and business environment, all of which are difficult to predict and many of which are beyond Chart’s control, that could cause Chart’s actual results to differ materially from those matters expressed or implied by forward-looking statements. Factors that could cause the Company’s actual results to differ materially from those described in the forward-looking statements include those found in Item 1A (Risk Factors) in the Company’s most recent Annual Report on Form 10-K filed with the SEC, which should be reviewed carefully. The Company undertakes no obligation to update or revise any forward-looking statement.\nChart is a leading independent global manufacturer of highly engineered equipment for the industrial gas, energy, and biomedical industries. The majority of Chart's products are used throughout the liquid gas supply chain for purification, liquefaction, distribution, storage and end-use applications, a large portion of which are energy-related. Chart has domestic operations located across the United States and an international presence in Asia, Australia, Europe and South America. For more information, visit: http://www.chartindustries.com .\nContact:\nJillian Evanko\nVice President, Chief Financial Officer, Chief Accounting Officer and Treasurer\n(770) 721-7739\nJillian.Evanko@chartindustries.com\nSource:Chart Industries, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/96526b88-1a8e-4960-8002-36ebe343fcd1"], "published": "2018-01-03T00:01:00.000+02:00", "crawled": "2018-01-03T02:06:50.007+02:00", "highlightTitle": ""}