{"organizations": [], "uuid": "ddd0a84df6e76f853b81aa31e6d2bd0ab64adcf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/13/104525789-GettyImages-688615534.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19794221/device/rss", "section_title": "Europe News", "url": "https://www.cnbc.com/2018/01/18/europe-stocks-seen-slightly-higher-after-wall-street-rally.html", "country": "US", "domain_rank": 767, "title": "Europe stocks seen slightly higher after Wall Street rally", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T10:02:00.000+02:00", "replies_count": 0, "uuid": "ddd0a84df6e76f853b81aa31e6d2bd0ab64adcf1"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/18/europe-stocks-seen-slightly-higher-after-wall-street-rally.html", "ord_in_thread": 0, "title": "Europe stocks seen slightly higher after Wall Street rally", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "ibex", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "European markets closed slightly higher on Thursday, as investors monitored recent gains from Wall Street.\nSymbol Name Price Change %Change Volume FTSE --- DAX --- CAC --- IBEX 35 --- The pan-European Stoxx 600 closed provisionally almost 0.2 percent higher, with most sectors and major indexes in positive territory.\nTechnology stocks were among the gainers Thursday, up 1.4 percent amid corporate earnings news. A flurry of brokerages upgraded their stock recommendation for Dutch chip equipment maker ASML on Thursday after the firm published stronger-than-anticipated fourth-quarter results. Its shares were more than 3 percent higher.\nLooking at individual stocks, Geberit surged to the top of the European benchmark on Thursday after the Swiss firm reported annual sales data in line with analysts' expectations. The plumbing products maker had been struggling in recent months amid a slowdown of fitters in Germany. Its shares were more than 6 percent higher.\nMeanwhile, Rightmove slumped towards the bottom of the index as J.P. Morgan downgraded its stock recommendation to \"underweight\" from \"normal.\" Shares of Britain's biggest property website were down 3.7 percent.\nDow at 26,000 On Wall Street, stocks traded lower as investors digested the sharp gains made in the previous session.\nThe Dow Jones industrial average closed above 26,000 for the first time Wednesday. Optimism over prospects for sustained global growth and expectations for robust corporate earnings lifted stocks across sectors.\nElsewhere, Theresa May and Emmanuel Macron met to agree on moves regarding counter-terrorism and defense co-operation Thursday. U.K. prime minister will offer France £44.5 million ($62 million) to improve fencing, CCTV and technology, it was announced .\nOn the data front, OPEC 's monthly oil market report on Thursday raised its forecast for oil supply from non-members in 2018, driven by higher growth expectations for the U.S. and Canada.\nIn commodities, oil prices hovered near multi-year highs amid threats of an attack on Nigeria's petroleum industry. Brent crude was 0.09 percent lower at around $69.32 a barrel on Thursday morning, while U.S. West Texas Intermediate (WTI) crude was down 0.03 percent at $63.95.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.", "external_links": [], "published": "2018-01-18T10:02:00.000+02:00", "crawled": "2018-01-18T10:22:09.009+02:00", "highlightTitle": ""}