{"organizations": [], "uuid": "609fd882ab4054decc7594d9fb23aa55e6624e4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-rexahn-pharmaceuticals-announces-the-appointment-of-douglas-j-swirsky-as-president-and-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Rexahn Pharmaceuticals Announces the Appointment of Douglas J. Swirsky as President and Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.351, "site_type": "news", "published": "2018-01-04T17:00:00.000+02:00", "replies_count": 0, "uuid": "609fd882ab4054decc7594d9fb23aa55e6624e4c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-rexahn-pharmaceuticals-announces-the-appointment-of-douglas-j-swirsky-as-president-and-chief-financial-officer.html", "ord_in_thread": 0, "title": "Rexahn Pharmaceuticals Announces the Appointment of Douglas J. Swirsky as President and Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "douglas j. swirsky", "sentiment": "negative"}, {"name": "peter suzdak", "sentiment": "none"}, {"name": "rexahn", "sentiment": "none"}, {"name": "swirsky", "sentiment": "none"}, {"name": "doug", "sentiment": "none"}], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "rockville", "sentiment": "none"}], "organizations": [{"name": "rexahn pharmaceuticals", "sentiment": "negative"}, {"name": "rexahn pharmaceuticals, inc.", "sentiment": "neutral"}, {"name": "genvec, inc.", "sentiment": "none"}, {"name": "genvec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROCKVILLE, Md., Jan. 04, 2018 (GLOBE NEWSWIRE) -- Rexahn Pharmaceuticals, Inc. (NYSE MKT:RNN), a clinical stage biopharmaceutical company developing innovative, targeted therapeutics for the treatment of cancer, today announced the appointment of Douglas J. Swirsky as its President and Chief Financial Officer, effective today.\n“Doug’s extensive leadership, corporate finance and strategy experience make him a strong addition to the Rexahn team,” said Dr. Peter Suzdak, Chief Executive Officer for Rexahn Pharmaceuticals. “We look forward to Doug’s contributions as we progress our clinical programs through proof of concept studies to later stage clinical development.”\n“I am excited to join Rexahn and look forward to helping the team grow the company and deliver enhanced shareholder value,” said Mr. Swirsky.\nMr. Swirsky was most recently President, CEO and a director of GenVec, Inc., a publicly-traded biotechnology company, a position he held from 2013 through the sale of the company in 2017. He joined GenVec in 2006 as Chief Financial Officer. Prior to joining GenVec, Mr. Swirsky was a Managing Director and the Head of Life Sciences Investment Banking at Stifel Nicolaus from 2005 to 2006 and held investment banking positions at Legg Mason from 2002 until Stifel Financial's acquisition of the Legg Mason Capital Markets business in 2005. He has also previously held investment banking positions at UBS, PaineWebber and Morgan Stanley. Mr. Swirsky is on the board of directors of Fibrocell Science, Inc., Cellectar Biosciences, Inc., and Pernix Therapeutics Holdings, Inc. Mr. Swirsky is a certified public accountant and a CFA ® charter holder. He received his B.S. in Business Administration from Boston University and his M.B.A. from the Kellogg School of Management at Northwestern University.\nMr. Swirsky replaces Dr. Tae Heum “Ted” Jeong, Sr. Vice President of Finance, Chief Financial Officer, and Secretary, who informed the Company of his resignation in December to pursue another opportunity. “Ted made a very significant contribution to Rexahn over the last fifteen years and we wish him the best of luck in his new endeavor,” commented Dr. Suzdak.\nAbout Rexahn Pharmaceuticals, Inc.\nRexahn Pharmaceuticals Inc. (NYSE MKT:RNN) is a clinical stage biopharmaceutical company dedicated to developing novel, best-in-class therapeutics for the treatment of cancer. The Company's mission is to improve the lives of cancer patients by developing next generation cancer therapies that are designed to maximize efficacy while minimizing the toxicity and side effects traditionally associated with cancer treatment. The Company has a broad oncology pipeline that includes three anti-cancer compounds currently in Phase II clinical development: RX-3117, Supinoxin™ and Archexin®. For more information about the Company and its oncology programs, please visit www.rexahn.com .\nSafe Harbor\nTo the extent any statements made in this press release deal with information that is not historical, these are forward looking statements under the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about Rexahn's plans, objectives, expectations and intentions with respect to growth, the path of clinical trials and development activities, and other statements identified by words such as \"will,\" \"potential,\" \"could,\" \"can,\" \"believe,\" \"intends,\" \"continue,\" \"plans,\" \"expects,\" \"anticipates,\" \"estimates,\" \"may,\" other words of similar meaning or the use of future dates. Forward-looking statements by their nature address matters that are, to different degrees, uncertain. Uncertainties and risks may cause Rexahn's actual results to be materially different than those expressed in or implied by Rexahn's forward-looking statements. For Rexahn, particular uncertainties and risks include, among others, understandings and beliefs regarding the role of certain biological mechanisms and processes in cancer; drug candidates being in early stages of clinical development; the timing of completion of clinical trials; the ability to initially develop drug candidates for orphan indications to reduce the time-to-market and take advantage of certain incentives provided by the U.S. Food and Drug Administration; and the ability to transition from our initial focus on developing drug candidates for orphan indications to candidates for more highly prevalent indications. More detailed information on these and additional factors that could affect Rexahn's actual results are described in Rexahn's filings with the Securities and Exchange Commission, including its most recent annual report on Form 10-K and subsequent quarterly reports on Form 10-Q. All forward-looking statements in this news release speak only as of the date of this news release. Rexahn undertakes no obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise.\nCONTACT :\nLifeSci Advisors, LLC\nAshley Robinson\narr@lifesciadvisors.com\n(617) 535-7742\nSource:Rexahn Pharmaceuticals", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/74cbf3b2-fc05-405a-bdae-80c84dd0164b", "https://www.globenewswire.com/Tracker?data=pJC_9XtxvxOjG-0uENbMQWnR2x87Nj6ILgkhMcptrIecaDKTLX1t4XycpegO70QVD6LB7oaqdd13xL18_thWBg=="], "published": "2018-01-04T17:00:00.000+02:00", "crawled": "2018-01-04T16:38:42.007+02:00", "highlightTitle": ""}