{"organizations": [], "uuid": "4ed6133c5d5b99f23aab6aa47895a7fd94efc07a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/14/104281761-IMG_0581.1910x1000.JPG", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/intel-ceo-reportedly-sold-shares-after-the-company-already-knew-about-massive-security-flaws.html", "country": "US", "domain_rank": 767, "title": "Intel CEO reportedly sold shares after the company already knew about massive security flaws", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-04T10:04:00.000+02:00", "replies_count": 0, "uuid": "4ed6133c5d5b99f23aab6aa47895a7fd94efc07a"}, "author": "Saheli Roy Choudhury", "url": "https://www.cnbc.com/2018/01/04/intel-ceo-reportedly-sold-shares-after-the-company-already-knew-about-massive-security-flaws.html", "ord_in_thread": 0, "title": "Intel CEO reportedly sold shares after the company already knew about massive security flaws", "locations": [], "entities": {"persons": [{"name": "brian krzanich", "sentiment": "negative"}, {"name": "krzanich", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "intel", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "motley fool", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Intel CEO Brian Krzanich sold off a large chunk of his stake in the company last year — after the chipmaker was already aware of serious security flaws in its computer processors, according to multiple reports.\nThe chipmaker did not immediately respond to CNBC's emailed request for comments sent outside U.S. office hours.\nOther outlets have reported an Intel spokeswoman said Krzanich's decision to sell the shares was unrelated to the security vulnerability disclosed this week.\nAccording to a Securities and Exchange Commission filing in late November, Krzanich acquired and sold 644,135 shares at a weighted average price of $44.05 by exercising his options. Those options let him purchase the shares at prices between $12.985 and $26.795, significantly lower than where Intel was trading at the time.\nHe sold another 245,743 shares that he already owned at a weighted average of $44.55. That brought down the total number of shares he owns to 250,000 — which is the minimum number of shares that the CEO of Intel is required to own, according to a Motley Fool report. Krzanich sold all of those shares for a little over $39 million, apparently netting about $25 million.\nThe filing showed that the sales were part of a 10b5-1 plan, which was created on Oct. 30, just a month before Krzanich sold the shares. The 10b5-1 is a trading plan that company executives set up to sell stocks they own at a pre-determined time so that they are not accused of insider trading.\nMultiple outlets, however, have reported that Intel and other chip makers were notified of the security vulnerabilities in June. \nSecurity researchers released documentation this week of critical vulnerabilities in modern processors used on almost every computer around the world. The hardware bugs — known as Meltdown and Spectre could allow programs to steal data including \"passwords stored in a password manager or browser, your personal photos, emails, instant messages and even business-critical documents.\"\nWhile Meltdown is specific to Intel processors, and can be patched, Spectre affects Intel, AMD and ARM processors — meaning almost every device that uses a chip — and is harder to fix. That sent the computer industry scrambling to patch those vulnerabilities. Though there are no known exploits for the problem yet, what is alarming is the fact that it can potentially affect millions of devices. \nshow chapters Intel CEO: Google researchers identified security issue      22 Hours Ago | 03:17 On Wednesday, Krzanich told CNBC's \"Closing Bell\" that the company is working on fixes that could start next week. He also said he's \"relatively confident\" that the security issue has not been exploited and that the industry has been working together for a couple of months to address it. \n\"I mean, it's very hard — we can't go out and check every system out there,\" he added. \"But when you take a look at the difficulty it is to actually go and execute this exploit — you have to get access to the systems, and then access to the memory and operating system — we're fairly confident, given the checks we've done, that we haven't been able to identify an exploit yet.\"\nKrzanich said the entire industry was planning to publish the data security issue once the fix was in place — but the problem leaked early. \n\"Why did it leak ahead of time? Somebody was doing some updates on a Linux kernel and they improperly posted that this was due to this flaw,\" Krzanich said. \"That's why we're responding to it today.\"\n— CNBC's Matt Rosoff and Anita Balakrishnan contributed to this report.", "external_links": [], "published": "2018-01-04T10:04:00.000+02:00", "crawled": "2018-01-04T10:06:27.002+02:00", "highlightTitle": ""}