{"organizations": [], "uuid": "7f90306f435b9efd7cbf24036c6819da84e3ee80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104944188-Steve_Kraus_300x300px.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/why-apple-can-succeed-in-building-a-personal-health-record-commentary.html", "country": "US", "domain_rank": 767, "title": "Why Apple can succeed in building a personal health record: commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-29T21:02:00.000+02:00", "replies_count": 0, "uuid": "7f90306f435b9efd7cbf24036c6819da84e3ee80"}, "author": "Steve Kraus", "url": "https://www.cnbc.com/2018/01/29/why-apple-can-succeed-in-building-a-personal-health-record-commentary.html", "ord_in_thread": 0, "title": "Why Apple can succeed in building a personal health record: commentary", "locations": [], "entities": {"persons": [{"name": "steve kraus", "sentiment": "none"}, {"name": "steve kraus  apple", "sentiment": "none"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "bessemer venture partners published", "sentiment": "none"}, {"name": "apple health", "sentiment": "none"}, {"name": "mins ago cnbc.com health-tech", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Apple made a big splash in health care circles this past week when it announced that the company is entering the personal health record space with Apple Health, a new feature that will interface with electronic health records at a dozen hospitals. \nFor the past two years, Apple has been making under-the-radar moves to bolster its health care efforts, starting with its 2016 acquisition of a personal health record start-up called Gliimpse Health.\nIn the wake of the announcement, my Twitter lit up with many proclamations that Apple's moves would bolster consumer engagement in health care. But I noticed an equal number of skeptics who argued that this time would be no different than a decade ago when technology players like Microsoft and Google tried, and struggled, to push this personal health record idea forward. \nhttps://twitter.com/stephenkraus/status/956568919451602944 \nAs you can see from my exchange with a fellow venture capitalist, I hold the view that Apple's entry into the space could be a game-changed for the industry. And I don't say that lightly. In fact, I believe that when we look back on this moment a decade from now, it will be viewed as a landmark day in the history of this still-nascent health care IT market. \nSo why is this time different? \nThe health -technology landscape has dramatically changed \nTen years ago, when Microsoft and Google were battling to make the personal health record idea resonate with consumers, much of the basic infrastructure needed to spur adoption did not exist. In 2007, less than a third of all doctors and other health care providers used an electronic medical record.\nThe passage of the HITECH Act, another key health care IT event, would take place two years later and would spur on widespread adoption of EMRs. Without the mandate and accompanying incentives to finally capture health data in digital form, developing personal health record systems would be a fruitless effort. On top of this, there were few interoperability standards, so even if you had health data, it was a huge challenge to share it with anyone else, including the patient. \nApple's arrival changes the game Another important piece of technology that had only just hit the market a decade ago? You guessed it. It's the iPhone. Apple released the first version of the iPhone in the summer of 2007, and today it has grown its user base to over 500 million people.\nMost of us love our iPhone, as evidenced by the fact that we use our iPhone a LOT. A recent study shows the average U.S. consumer now spends 5 hours per day on their mobile device. With such incredible penetration into our daily lives, it should come as little surprise that the mobile phone you currently have in your hand is still the \"most valuable piece of real estate in the entire world,\" to borrow a phrase from my investment partner Byron Deeter.\nSome health care experts in my network have wondered why established medical record vendors, like Epic or Cerner, are better positioned to succeed. After all, these companies already have personal health portals built out and deployed. In my view, vendors like Epic and Cerner put the health care provider first -- and rightfully so as they are the ones who pay the bills -- when designing these products. Apple, on the other hand, is incentivized to put the consumer first.\nThe era of the health care consumer is here Apple's skeptics have also pointed out to me that the company will run into an inevitable stumbling block: Getting consumers to engage in their health. I agree with them that consumer or patient engagement has been a notoriously tough nut for health technology providers to crack.\nBut, here again, I think this time may be different. Why? With the rise of high deductible health plans, consumers are bearing a much larger share of health care costs these days. Ten years ago, only 10 percent of consumers had a deductible of $1,000 or more. Today that number is hovering around 50 percent of all consumers.\nAs consumers reach into their wallets to pay for health care services, I believe they will become\nmuch more active in decision-making. And what better place to start than to engage with personal health data.\nThe brilliance of Apple's approach thus far is to open up their software and services to developers to build apps for consumers, and allow the consumer to push their data to these apps. I believe the same paradigm will exist in health care, where consumers will push their personal health records to apps to open up a much more personalized and engaging product experience.\nIf I were an Apple health developer, the first place I would look to build an app is any area of health care cost that hits the consumer's wallet and where personal health data can be leveraged. Take, for example, building a digital prescription medicine discount card app that features personalized targeting and dynamic pricing based on the patient's drug history data from their health record.\nIt has always struck me that we as consumers use our phones to purchase many things in our life but almost nothing when it comes to health care. With arrival of Apple on the scene, I believe\nthis will finally change. And this time, it will truly be different.", "external_links": [], "published": "2018-01-29T21:02:00.000+02:00", "crawled": "2018-01-29T21:05:47.010+02:00", "highlightTitle": ""}