{"organizations": [], "uuid": "830437c7a18add9298189a99d484fc6f6365c29a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-insperity-announces-upcoming-retirement-of-president-richard-g-rawson-and-appointment-of-james-d-allison-as-senior-vice.html", "country": "US", "domain_rank": 767, "title": "Insperity Announces Upcoming Retirement of President Richard G. Rawson and Appointment of James D. Allison as Senior Vice President of Gross Profit Operations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "830437c7a18add9298189a99d484fc6f6365c29a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-insperity-announces-upcoming-retirement-of-president-richard-g-rawson-and-appointment-of-james-d-allison-as-senior-vice.html", "ord_in_thread": 0, "title": "Insperity Announces Upcoming Retirement of President Richard G. Rawson and Appointment of James D. Allison as Senior Vice President of Gross Profit Operations", "locations": [], "entities": {"persons": [{"name": "richard g. rawson", "sentiment": "negative"}, {"name": "james d. allison", "sentiment": "negative"}, {"name": "rawson", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "paul j. sarvadi", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "insperity", "sentiment": "none"}], "organizations": [{"name": "nsp", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}, {"name": "insperity, inc", "sentiment": "neutral"}, {"name": "insperity", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON--(BUSINESS WIRE)-- Insperity, Inc . (NYSE: NSP), a leading provider of human resources and business performance solutions for America’s best businesses, today announced that its president, Richard G. Rawson, has elected to retire on May 18, 2018, after having served as an executive officer of Insperity for over 28 years. As president, Mr. Rawson has led the company’s gross profit enhancement division and managed the company’s relationships with insurance carriers. Mr. Rawson will continue to serve as a member of Insperity’s board of directors.\n“For over a quarter century, Richard’s leadership and contributions have been significant to the growth and profitability of Insperity,” said Paul J. Sarvadi, the company’s chairman and chief executive officer. “On behalf of the Board of Directors, I want to extend our deep appreciation to Richard for his commitment and contributions to the success of Insperity over these many years, and we wish him the very best in his well-earned retirement. We also look forward to Richard’s continued service as a member of the board of directors.”\nInsperity also announced the appointment of James D. Allison as senior vice president of gross profit operations, which will also be effective on May 18, 2018, at which time he will begin reporting directly to Mr. Sarvadi. Mr. Allison, who is 49 years old, joined Insperity in 1997 and has served as Insperity’s senior vice president of pricing and cost analysis since 2011. Prior to his current position, Mr. Allison, a certified public accountant, held various senior positions in Insperity’s finance department.\n“Jim has had a distinguished career here at Insperity,” said Mr. Rawson. “For the last seven years, Jim has been a key member of our gross profit enhancement division, and he has done an outstanding job in his current role of leading the company’s pricing and direct cost analysis teams. In this new role, Jim will assume my current responsibilities over the company’s gross profit drivers, which include the company’s pricing, benefits plans, and workers compensation and other insurance programs. I look forward to continuing to work with Jim over the next several months as he transitions into this expanded role and thereafter as a board member offering him support in the management of Insperity’s strategic insurance relationships.”\nInsperity, a trusted advisor to America’s best businesses for more than 31 years, provides an array of human resources and business solutions designed to help improve business performance. Insperity ® Business Performance Advisors offer the most comprehensive suite of products and services available in the marketplace. Insperity delivers administrative relief, better benefits, reduced liabilities and a systematic way to improve productivity through its premier Workforce Optimization ® solution. Additional company offerings include Human Capital Management, Payroll Services, Time and Attendance, Performance Management, Organizational Planning, Recruiting Services, Employment Screening, Financial Services, Expense Management, Retirement Services and Insurance Services. Insperity business performance solutions support more than 100,000 businesses with over 2 million employees. With 2016 revenues of $2.9 billion, Insperity operates in 62 offices throughout the United States. For more information, visit http://www.insperity.com .\nThe statements contained herein that are not historical facts are forward-looking statements within the meaning of the federal securities laws (Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934). You can identify such forward-looking statements by the words “expects,” “intends,” “plans,” “projects,” “believes,” “estimates,” “likely,” “possibly,” “probably,” “goal,” “opportunity,” “objective,” “target,” “assume,” “outlook,” “guidance,” “predicts,” “appears,” “indicator” and similar expressions. Forward-looking statements involve a number of risks and uncertainties. In the normal course of business, Insperity, Inc., in an effort to help keep our stockholders and the public informed about our operations, may from time to time issue such forward-looking statements, either orally or in writing. Generally, these statements relate to business plans or strategies, projected or anticipated benefits or other consequences of such plans or strategies, or projections involving anticipated revenues, earnings, unit growth, profit per worksite employee, pricing, operating expenses or other aspects of operating results. We base the forward-looking statements on our expectations, estimates and projections at the time such statements are made. These statements are not guarantees of future performance and involve risks and uncertainties that we cannot predict. In addition, we have based many of these forward-looking statements on assumptions about future events that may prove to be inaccurate. Therefore, the actual results of the future events described in such forward-looking statements could differ materially from those stated in such forward-looking statements. Among the factors that could cause actual results to differ materially are: (i) adverse economic conditions; (ii) regulatory and tax developments and possible adverse application of various federal, state and local regulations; (iii) the ability to secure competitive replacement contracts for health insurance and workers’ compensation insurance at expiration of current contracts; (iv) cancellation of client contracts on short notice, or the inability to renew client contracts or attract new clients; (v) vulnerability to regional economic factors because of our geographic market concentration; (vi) increases in health insurance costs and workers’ compensation rates and underlying claims trends, health care reform, financial solvency of workers’ compensation carriers, other insurers or financial institutions, state unemployment tax rates, liabilities for employee and client actions or payroll-related claims; (vii) failure to manage growth of our operations and the effectiveness of our sales and marketing efforts; (viii) the impact of the competitive environment in the PEO industry on our growth and/or profitability; (ix) our liability for worksite employee payroll, payroll taxes and benefits costs; (x) our liability for disclosure of sensitive or private information; (xi) our ability to integrate or realize expected returns on our acquisitions; (xii) failure of our information technology systems; (xiii) an adverse final judgment or settlement of claims against Insperity; and (xiv) disruptions to our business resulting from the actions of certain stockholders. These factors are discussed in further detail in Insperity’s filings with the U.S. Securities and Exchange Commission. Any of these factors, or a combination of such factors, could materially affect the results of our operations and whether forward-looking statements we make ultimately prove to be accurate.\nExcept to the extent otherwise required by federal securities law, we do not undertake any obligation to update our forward-looking statemen", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.insperity.com&esheet=51739014&newsitemid=20180108005460&lan=en-US&anchor=http%3A%2F%2Fwww.insperity.com&index=3&md5=e9611ac3484cbc168fca8367dc678d72", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.insperity.com%2Fsolutions%2F&esheet=51739014&newsitemid=20180108005460&lan=en-US&anchor=human+resources+and+business+performance+solutions&index=2&md5=b1cd00d6c11f205e10d33c73aebd25fd", "http://www.businesswire.com/news/home/20180108005460/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.insperity.com%2F&esheet=51739014&newsitemid=20180108005460&lan=en-US&anchor=Insperity%2C+Inc&index=1&md5=fb30beecd5fb86c035870215033edd52"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:08:43.032+02:00", "highlightTitle": ""}