{"organizations": [], "uuid": "26fd09a3213f83c3eb91dc15714acfb3597a3aa0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-first-financial-northwest-inc-announces-quarterly-cash-dividend-of-0-point-07-per-share.html", "country": "US", "domain_rank": 767, "title": "First Financial Northwest, Inc. Announces Quarterly Cash Dividend of $0.07 per Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:20:00.000+02:00", "replies_count": 0, "uuid": "26fd09a3213f83c3eb91dc15714acfb3597a3aa0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-first-financial-northwest-inc-announces-quarterly-cash-dividend-of-0-point-07-per-share.html", "ord_in_thread": 0, "title": "First Financial Northwest, Inc. Announces Quarterly Cash Dividend of $0.07 per Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "renton", "sentiment": "none"}, {"name": "wash.", "sentiment": "none"}, {"name": "renton", "sentiment": "none"}, {"name": "puget sound region", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "first financial northwest, inc", "sentiment": "neutral"}, {"name": "first financial northwest, inc.", "sentiment": "neutral"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "fdic", "sentiment": "none"}, {"name": "first financial northwest bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RENTON, Wash., Jan. 25, 2018 (GLOBE NEWSWIRE) -- First Financial Northwest, Inc. (the “Company”) (NASDAQ:FFNW), the holding company for First Financial Northwest Bank today announced that its Board of Directors has declared a quarterly cash dividend of $0.07 per share on the Company’s outstanding common stock. The cash dividend will be payable on March 23, 2018, to shareholders of record as of the close of business on March 9, 2018.\nFirst Financial Northwest, Inc. is the parent company of First Financial Northwest Bank, an FDIC insured Washington State-chartered commercial bank headquartered in Renton, Washington, serving the Puget Sound Region through nine full-service banking offices. We are a part of the ABA NASDAQ Community Bank Index and the Russell 3000 Index. For additional information about us, please visit our website at ffnwb.com and click on the “Investor Relations” link at the bottom of the page.\nForward Looking Statements:\nWhen used in this press release and in other documents filed with or furnished to the Securities and Exchange Commission (the “SEC”), in press releases or other public stockholder communications, or in oral statements made with the approval of an authorized executive officer, the words or phrases “believe,” “will,” “will likely result,” “are expected to,” “will continue,” “is anticipated,” “estimate,” “project,” “plans,” or similar expressions are intended to identify “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are not historical facts but instead represent management's current expectations and forecasts regarding future events many of which are inherently uncertain and outside of our control. Actual results may differ, possibly materially from those currently expected or projected in these forward-looking statements. Factors that could cause our actual results to differ materially from those described in the forward-looking statements, include, but are not limited to, the following: increased competitive pressures; changes in the interest rate environment; changes in general economic conditions and conditions within the securities markets; legislative and regulatory changes; and other factors described in the Company’s latest Annual Report on Form 10-K and Quarterly Reports on Form 10-Q and other filings with the Securities and Exchange Commission – that are available on our website at www.ffnwb.com and on the SEC's website at www.sec.gov .\nAny of the forward-looking statements that we make in this Press Release and in the other public statements are based upon management's beliefs and assumptions at the time they are made and may turn out to be wrong because of the inaccurate assumptions we might make, because of the factors illustrated above or because of other factors that we cannot foresee. Therefore, these factors should be considered in evaluating the forward-looking statements, and undue reliance should not be placed on such statements. We do not undertake and specifically disclaim any obligation to revise any forward-looking statements to reflect the occurrence of anticipated or unanticipated events or circumstances after the date of such statements. These risks could cause our actual results for 2018 and beyond to differ materially from those expressed in any forward-looking statements made by, or on behalf of, us and could negatively affect our operating and stock performance\nFor more information, contact:\nJoseph W. Kiley III, President and Chief Executive Officer\nRich Jacobson, Executive Vice President and Chief Financial Officer\n(425) 255-4400\nSource:First Financial Northwest, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=heGcr-Jzk-73mv0R8SCVW5Hf8GLJa0SuX7JYP_QvKHdN7EaSZflOiarD4xPsIeQqg2alO-VIMD7yjIZm_iM-Xg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/9cf91d7c-a2a1-44d6-b01a-3d03a57baa53", "https://www.globenewswire.com/Tracker?data=75E8y8oOK-5pL5DC9pXkDkVLCNztjL-9JhU41rZye0uc2FI4kWdCIwG_dmtd8bpGb_4FXryjXkQXRqMhp3xb_Q==", "https://www.globenewswire.com/Tracker?data=8a37uEaEtfmTTImLAFoadOX_Mu-eRMS451x609yWfxc3m_3_hJ84RRCP5YB-7xBi1ZYqwbbz4MCxQIoQbP5z-Q=="], "published": "2018-01-25T17:20:00.000+02:00", "crawled": "2018-01-25T18:17:30.001+02:00", "highlightTitle": ""}