{"organizations": [], "uuid": "ea20cac69fddffc438a01728f61e8dcc4c9fcd85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/us", "section_title": "US Stock Market News - Dow Jones, Nasdaq, S&amp;P 500 | Reuters.com", "url": "https://www.reuters.com/article/nigeria-stocks/update-1-nigerian-stocks-rise-to-9-year-high-as-foreign-funds-buy-traders-idUSL8N1P64E7", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Nigerian stocks rise to 9 year high as foreign funds buy -traders", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T23:00:00.000+02:00", "replies_count": 0, "uuid": "ea20cac69fddffc438a01728f61e8dcc4c9fcd85"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/nigeria-stocks/update-1-nigerian-stocks-rise-to-9-year-high-as-foreign-funds-buy-traders-idUSL8N1P64E7", "ord_in_thread": 0, "title": "UPDATE 1-Nigerian stocks rise to 9 year high as foreign funds buy -traders", "locations": [], "entities": {"persons": [], "locations": [{"name": "lagos", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 3:00 PM / Updated 10 minutes ago UPDATE 2-Nigerian stocks rise to 9-year high as funds buy shares Reuters Staff \n(Adds analyst’s comment, background) \nBy Chijioke Ohuocha \nLAGOS, Jan 11 (Reuters) - Nigeria’s main stock index rose to above 43,000 points on Thursday, a level last seen in October 2008, after local and foreign funds bought shares across several sectors. \nStocks have gained strongly in January, extending 2017’s 43 percent rise. Equities rallied for the sixth day on Thursday, climbing 2.9 percent, to take the rise since the start of the year to 12.3 percent. \nLast year’s gain was the biggest since 2013, and traders had said they expected further advances fuelled by hopes of lower interest rates and a more stable currency. \nOn Wednesday stocks posted their biggest one-day gain in seven months. \n“Quite a few frontier funds missed Nigeria last year,” said Africa equity sales manager at Stanbic IBTC Stockbrokers. \n“With Brent (oil price) comfortable above $65 per barrel and foreign reserves above $40 billion ... banks are still cheap ... but global emerging and frontier market fund are now comfortable with Nigeria.” \nForeign funds have been skewed towards a local debt market yielding as high as 18 percent last year and equity is just catching up, traders say. \nThey added that funds have been taking positions in consumer goods while locals are snapping up shares in mid-tier banks in a switch from bonds, where the outlook for yields is negative as government seeks to lower its borrowing costs. \nYear-end results due in March are also helping lift sentiment towards equities, traders said, especially after data showed that Nigeria’s forex reserves had started to increase after a currency crisis, a sign of support for the naira. \nHowever, weaker-than-expected profits might curtail the rally, and the run-up to presidential elections due in 2019 may create uncertainty as political risks rise. \nConsumer spending is still under pressure as Nigeria has only recently emerged from recession and lenders are not growing their loan books. But investors are now buying for the long-term, analysts say. \nForeign investors have been buying Nigerian assets in trickles after the central bank last year lifted currency controls in a bid to attract inflows and support the naira. \nThe index of Nigeria’s top 10 lenders led the stocks charge, rallying 4.4 percent. The oil and consumer sectors rose more than 2 percent each. \nFidelity Bank, Honeywell Flour Mills , CCNN and Champion Brewery each rose more than 9 percent. (Reporting by Chijioke Ohuocha; Editing by Toby Chopra)", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T23:00:00.000+02:00", "crawled": "2018-01-11T17:03:27.003+02:00", "highlightTitle": ""}