{"organizations": [], "uuid": "f0fdd22898f36d2e690caf9842aea49c0e8e28f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/romania-rates/update-1-romania-central-bank-delivers-surprise-key-rate-hike-to-2-0-pct-idUSL8N1P32NQ", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Romania central bank delivers surprise rate increase to 2.0 pct", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T20:23:00.000+02:00", "replies_count": 0, "uuid": "f0fdd22898f36d2e690caf9842aea49c0e8e28f5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/romania-rates/update-1-romania-central-bank-delivers-surprise-key-rate-hike-to-2-0-pct-idUSL8N1P32NQ", "ord_in_thread": 0, "title": "UPDATE 2-Romania central bank delivers surprise rate increase to 2.0 pct", "locations": [], "entities": {"persons": [{"name": "isarescu", "sentiment": "none"}, {"name": "mugur isarescu", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "bucharest", "sentiment": "none"}, {"name": "czech republic", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds central bank comments)\nBUCHAREST, Jan 8 (Reuters) - Romania’s central bank began raising interest rates for the first time in a decade on Monday, in an effort to curb inflation, now above its 2017 forecast.\nThe bank raised its benchmark rate by a quarter point to 2.0 percent, becoming the second of the European Union’s central and eastern states to start tightening from record low levels, after the Czech Republic.\n“The (monetary policy rate) shows the central bank is reacting, and it is important because we are working with inflationary expectations,” Governor Mugur Isarescu said.\nThe central bank will consider swings of 5 to 6 percent in the value of Romania’s currency, the leu, to be “sustainable”, Isarescu said.\nThe leu, which underperformed regional peers last year largely on concerns over fiscal loosening, rose against the euro after the decision but lost 0.1 percent after Isarescu’s comments.\nThe bank has left its key rate unchanged since May 2015. Five analysts polled by Reuters had expected policymakers to hold fire; four expected the quarter-point increase.\nAnnual inflation rose 3.2 percent in November, above the bank’s end-of-year forecast of 2.7 percent.\n“There is no room left for shyness as reality sharply surpassed the inflation forecast,” said Ionut Dumitru, chief economist at Raiffeisen Bank in Bucharest.\nIn November, the central bank said it expected inflation to exceed its 1.5 to 3.5 percent target range in the first part of 2018, then fall back to 3.2 percent at the end of the year.\nOn Monday, Isarescu said there were now more uncertainties regarding the inflation outlook. New forecasts will be released in mid-February.\nMonday’s move will also raise the bank’s deposit and lending facility rates to 1.0 percent and 3.0 percent, from 0.75 and 2.75 percent.\nLast year, the bank narrowed the corridor between its deposit and lending rates and switched to “firm” liquidity management from “adequate”, to ensure interbank rates stayed close to the benchmark rate.\nIsarescu said the new rates were enough to handle swings in market liquidity for the moment, but said policymakers were considering more moves.\n“Should interest rates go significantly over 2 percent, we have yet to decide how to intervene on the interest rate to calm down money market rates,” he said.\n“We feel that the current 2 percent level, with market rates gravitating around it, meets current needs. We will probably reach a decision at the next meeting. The direction is the one we have already announced: a greater stability of interest rates and a slightly larger flexibility of the exchange rate.” (Reporting by Luiza Ilie, editing by Larry King)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T20:23:00.000+02:00", "crawled": "2018-01-09T16:57:31.105+02:00", "highlightTitle": ""}