{"organizations": [], "uuid": "d18e3de65d78f497203760421fbfcca0f325178a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/685329542.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/12/shitty-media-men-me-too/", "country": "US", "domain_rank": 1196, "title": "Shitty Media Men: Why Lists Like Moira Donegan's Are Made | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.19, "site_type": "news", "published": "2018-01-06T02:00:00.000+02:00", "replies_count": 0, "uuid": "d18e3de65d78f497203760421fbfcca0f325178a"}, "author": "Valentina Zarya", "url": "http://fortune.com/2018/01/12/shitty-media-men-me-too/", "ord_in_thread": 0, "title": "Shitty Media Men: Why Lists Like Moira Donegan's Are Made | Fortune", "locations": [], "entities": {"persons": [{"name": "moira donegan", "sentiment": "negative"}, {"name": "valentina zarya january", "sentiment": "negative"}, {"name": "karen kelsky", "sentiment": "none"}], "locations": [{"name": "new york magazine", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Valentina Zarya January 12, 2018 \nTalk of two lists of has been dominating the headlines this week. The first is the original “Shitty Media Men” Google document that went viral last October and the whose author, 20-something Moira Donegan, wrote a poignant editorial published in New York Magazine yesterday. The list contained the names of about 70 alleged harassers and rapists before it was taken down; it was live for less than 24 hours. The second document lays out a litany of female academics’ descriptions of their experiences of sexual harassment. It contains more than 2,000 anecdotes—though no names—and has been online for about six weeks. Its author, former anthropology professor Karen Kelsky, tells The Wall Street Journal that she hasn’t received any requests to take it down. \nIt’s an interesting dichotomy: On the one hand, you have a simple Google doc, put together by a young woman and shared with her friends. On the other, you have the much more formal “Sexual Harassment In the Academy: A Crowdsourced Survey.” And yet, only the former has (so far) yielded real results. Media companies conducted investigations into employees who appeared on Donegan’s spreadsheet and at least four powerful men, including the publishers of The New Republic and Paris Review, left their jobs or were fired. Meanwhile, academia has been far slower in responding to Kelsky’s project. A spokeswoman for Berkeley—which was named more than two dozen times—tells WSJ that while the school is “saddened and unsettled” by the allegations, it would need to know the accusers’ identities to determine possible next steps. \nObservers’ main qualm with the media list is that it names names without giving the included men an opportunity to defend themselves in the court of public opinion. The New Yorker ‘s Masha Gessen writes, “There are men who know that they are on the list, but have no idea who accused them or why. They have been in a kind of Kafkaesque, Koestleresque hell for months, and they have no way of knowing when or if the clouds will clear.” And yet what is the alternative? To keep all allegations anonymous so that institutions can be “unsettled” while keeping abusive men in power and free to keep committing more violence? \nNeither of these tools is perfect. Indeed, they serve as a vivid illustration of just how sorely we lack proper reporting mechanisms for abuse and harassment in the workplace. \nAccording to an October ABC News-Washington Post poll , more than half of all American women—54%—have experienced “unwanted and inappropriate sexual advances” at some point in their lives. However, a different study by Cosmpolitan found that the overwhelming number (71%) do not report it. That’s staggering until one takes a closer look.The reasons for not reporting harassment are multifold: Women are afraid of retribution, of losing their jobs , of not being believed, of having to deal with the bureaucracy of filing a formal complaint. Donegan created her list with these things in mind and tried to circumvent them by creating a tool that was meant to be the exact opposite of a formal complaint. She writes: \n“When a reporting channel has enforcement power, like an HR department or the police, it also has an obligation to presume innocence. In contrast, the value of the spreadsheet was that it had no enforcement mechanisms: Without legal authority or professional power, it offered an impartial, rather than adversarial, tool to those who used it.” \nOf course, it eventually became adversarial—not because those who contributed to it were out to destroy the men’s careers or reputations (though some of them may have been), but because no system currently exists in which they are able to talk about abuse without strings attached. Until that happens, we’ll likely be seeing many more such lists. \nA version of this essay first appeared in The Broadsheet , Fortune ‘s newsletter for and about the world’s most powerful women. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-06T02:00:00.000+02:00", "crawled": "2018-01-13T07:07:33.003+02:00", "highlightTitle": ""}