{"organizations": [], "uuid": "99b87ff9c1cc893cb2e2ac0916da72151d0c2a75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/lootcrate-funding/loot-crate-taps-dendera-as-it-seeks-new-funding-sources-idUSL1N1P5230", "country": "US", "domain_rank": 408, "title": "Loot Crate taps Dendera as it seeks new funding -sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T22:30:00.000+02:00", "replies_count": 0, "uuid": "99b87ff9c1cc893cb2e2ac0916da72151d0c2a75"}, "author": "", "url": "https://www.reuters.com/article/lootcrate-funding/loot-crate-taps-dendera-as-it-seeks-new-funding-sources-idUSL1N1P5230", "ord_in_thread": 0, "title": "Loot Crate taps Dendera as it seeks new funding -sources", "locations": [], "entities": {"persons": [{"name": "dendera", "sentiment": "negative"}, {"name": "paresh dave", "sentiment": "none"}, {"name": "jessica dinapoli", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}], "organizations": [{"name": "loot crate", "sentiment": "negative"}, {"name": "loot crate inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "dendera advisory llc", "sentiment": "none"}, {"name": "inc magazine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 8:30 PM / in an hour Loot Crate taps Dendera as it seeks new funding -sources Paresh Dave , Jessica DiNapoli 4 Min Read \nJan 25 (Reuters) - Loot Crate Inc, a monthly subscription service that sends video game and sci-fi paraphernalia to customers, has hired strategic consulting firm Dendera Advisory LLC as it seeks to raise new funds, people familiar with the matter said. \nLoot Crate, a startup which Inc Magazine called America’s fastest growing company in a 2016 cover story, has lost three non-executive board members in recent weeks, the sources said this week. It also faces a lawsuit, filed in January, by a former inhouse accountant accusing her manager of sexual harassment, court documents show. \nDendera is helping Loot Crate improve operations and manage finances, as it strives to boost profitability following a spat with vendors that led to late customer deliveries, said the sources. They requested anonymity to discuss the confidential matter. \nLoot Crate and Dendera declined to comment. \nDendera, which has an affiliate that invests in distressed companies, is also considering investing in Loot Crate, the sources added. The affiliate has invested in Performance Sports Group, the maker of Bauer ice hockey gear that filed for bankruptcy in 2016, according to a 2017 letter to its investors. \nAnother potential investor is U.S. semiconductor company Qualcomm Inc’s Chief Financial Officer George Davis, the father of Chief Executive Chris Davis, who founded Loot Crate in 2012, the sources said. \nGeorge Davis declined to comment. \nDendera has advised Sports Direct International Plc in its acquisition of bankrupt outdoor retailer Eastern Mountain Sports, and worked with an ad hoc committee of unsecured noteholders in the bankruptcy of oil and gas explorer Energy XXI. \nThe three directors who quit Loot Crate’s board in recent weeks, according to the sources, are Ynon Kreiz, former CEO of YouTube video producer Maker Studios Inc, Mark Suster, managing partner at venture capital firm Upfront Ventures, and Terry Boyle, president of Nordstrom Rack’s online businesses. \nKreiz and Suster declined to comment. Boyle did not respond to a request for comment. \nThe former Loot Crate accountant filed a lawsuit as “Jane Doe” in Los Angeles County Superior Court against the company and her manager, Assistant Corporate Controller Steven Raby, for wrongful termination last autumn after reporting Raby had sexually harassed her. \nThe lawsuit, which seeks $10 million in damages, alleges that Loot Crate had a “fraternity-like” culture with “instances of harassment (that) could be seen everywhere.” It contends that Raby’s alleged actions were condoned by managers, officers and directors at Loot Crate. \nAmy Jensen, an attorney representing Raby, said he denied the allegations against him and intended to vigorously defend himself. Raby is no longer employed by Loot Crate, she added. \nLoot Crate’s woes reflect some of the challenges facing startups seeking the success of companies such as online apparel retailer Stitch Fix Inc, which helped popularize the subscription delivery model among e-commerce companies. \nLoot Crate gained an early loyal following among its fans, dubbed “Looters,” for its monthly boxes themed around Japanese cartoons called anime, videogames “Halo” and “Minecraft” and sci-fi media franchise “Star Trek.” In 2016, Loot Crate had about 650,000 subscribers. \nInvestors including venture capital firm Upfront Ventures, Breakwater Investment Management and Time Inc put $18.5 million into the startup at that time. (Reporting by Paresh Dave in San Francisco and Jessica DiNapoli in New York; Editing by Richard Chang)", "external_links": [], "published": "2018-01-25T22:30:00.000+02:00", "crawled": "2018-01-25T22:48:22.010+02:00", "highlightTitle": ""}