{"organizations": [], "uuid": "7d15b2116e82938ddc3fb81c1e75dca9ef5fe481", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219333220&w=1200&r=LYNXMPEE030VP", "site_section": "http://feeds.reuters.com/reuters/UKEntertainment", "section_title": "Reuters: Entertainment News", "url": "https://uk.reuters.com/article/uk-awards-goldenglobes-preview/party-or-not-golden-globes-proves-test-for-hollywood-sex-scandal-idUKKBN1ET1KS", "country": "US", "domain_rank": 408, "title": "Party or not? Golden Globes proves test for Hollywood sex scandal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:22:00.000+02:00", "replies_count": 0, "uuid": "7d15b2116e82938ddc3fb81c1e75dca9ef5fe481"}, "author": "", "url": "https://uk.reuters.com/article/uk-awards-goldenglobes-preview/party-or-not-golden-globes-proves-test-for-hollywood-sex-scandal-idUKKBN1ET1KS", "ord_in_thread": 0, "title": "Party or not? Golden Globes proves test for Hollywood sex scandal", "locations": [], "entities": {"persons": [{"name": "holly", "sentiment": "negative"}, {"name": "judy dench", "sentiment": "none"}, {"name": "tom o‘neil", "sentiment": "none"}, {"name": "saoirse ronan", "sentiment": "none"}, {"name": "helen mirren", "sentiment": "none"}, {"name": "jill serjeant", "sentiment": "none"}, {"name": "margot robbie", "sentiment": "none"}, {"name": "emma stone", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "party", "sentiment": "negative"}, {"name": "hollywood", "sentiment": "none"}, {"name": "min read  los angeles", "sentiment": "none"}, {"name": "golden globe", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 2:07 PM / Updated 7 hours ago Party or not? Golden Globes proves test for Hollywood sex scandal Jill Serjeant 4 Min Read \nLOS ANGELES (Reuters) - The red carpet is rolling out, the champagne is on ice and the statuettes are about to be handed over. Nominees forBest Performance by an Actress in a Motion Picture, Musical or Comedy category, (L-R) Judy Dench, Margot Robbie, Saoirse Ronan, Emma Stone, and Helen Mirren. REUTERS/File Photos \nBut with the cloud of sexual harassment hanging over Hollywood’s annual round of self-congratulations, the Golden Globe ceremony on Sunday marks the first test of how the industry will handle live on the world’s stage a scandal that has rocked show business. \n“This is an issue that is centre stage in Hollywood and is playing out at the award shows,” said Tom O‘Neil, founder of awards website GoldDerby.com. \nCelebrities and filmmakers who were once major players during awards season have been shunned, written out of shows or snubbed in nominations. \nWomen are planning to wear black on the Golden Globes red carpet to signal support of sexual harassment victims; a major talent agency has cancelled its annual Golden Globes party to instead fund legal defence for victims; and the Screen Actors Guild Awards later in January will feature all female presenters. \nThe mood ahead of the Oscars on March 4 ranges from nervousness to eagerness to take a stand. \n“Everyone I have been talking to is relishing the opportunity to make this kind of visibility and attention more meaningful than simply about the glorification of a single profession,” actress Michelle Williams, who is Golden Globe nominated for “All the Money in the World,” told Reuters. \nMore than 30 men have accused Kevin Spacey of sexual misconduct and more than 70 women have made allegations against film producer Harvey Weinstein. \nDustin Hoffman, comedian Louis C.K. and Jeffrey Tambor are among dozens of other celebrities, politicians and businessmen who have been accused of sexual impropriety. \nReuters is unable to independently verify any of the accusations. Weinstein has denied having any non-consensual sex with anyone, Spacey apologised to one of his accusers but was erased from “All the Money in the World” and written out of his TV series “House of Cards.” \nHoffman and Tambor have denied any wrongdoing. C.K. admitted past misconduct and his movie and TV projects have been dropped. \n“I always saw this awards season as a perfect little bubble where everything is magical and beautiful because it’s movies. I think what we’re realizing now is that it has its own issues that it has to work on,” Emily Gordon, screenwriter for movie “The Big Sick,” told Reuters \nOn Sunday, all eyes will be on Golden Globes host Seth Meyers and how he navigates what is traditionally a boozy celebration and the elephant in the room. \n“He’s got an impossible job. He can’t ignore the hot button issue in Hollywood. He’s expected to lead a jokathon but it’s not a laughing matter,” said O‘Neil. \nHollywood is also at odds with itself. Matt Damon was slammed in December for suggesting that allegations of rape and inappropriate touching should not be conflated. Talk show host James Corden was criticised for joking about Weinstein at a Beverly Hills event in October, and Rose McGowan accused Meryl Streep of remaining silent about Weinstein’s alleged behaviour. Streep denied the accusation and called for women to unite. \n“This is getting to be a whole internecine battle in Hollywood. I think they are all very nervous,” said Pete Hammond, awards columnist for Deadline.com. \nThe Golden Globe awards for film and television will be televised live from Beverly Hills on NBC on Sunday Jan. 7, starting at 8 p.m. ET/5 p.m. PT (0100 GMT on Monday). Additional reporting by Rollo Ross; Editing by Sandra Maler", "external_links": [], "published": "2018-01-04T16:22:00.000+02:00", "crawled": "2018-01-04T16:41:57.010+02:00", "highlightTitle": ""}