{"organizations": [], "uuid": "fc474c72f48e0e6e7a71b4df9c5ebd113f37ecb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-trump-solar/rpt-trump-says-solar-tariff-decision-coming-soon-stakes-huge-for-industry-idUSL1N1PD02U", "country": "US", "domain_rank": 408, "title": "RPT-Trump says solar tariff decision coming soon, stakes huge for industry", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:00:00.000+02:00", "replies_count": 0, "uuid": "fc474c72f48e0e6e7a71b4df9c5ebd113f37ecb3"}, "author": "", "url": "https://www.reuters.com/article/usa-trump-solar/rpt-trump-says-solar-tariff-decision-coming-soon-stakes-huge-for-industry-idUSL1N1PD02U", "ord_in_thread": 0, "title": "RPT-Trump says solar tariff decision coming soon, stakes huge for industry", "locations": [], "entities": {"persons": [{"name": "rpt-trump", "sentiment": "negative"}, {"name": "steve holland", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "nichola groom", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "rpt-trump", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:00 PM / Updated 12 minutes ago RPT-Trump says solar tariff decision coming soon, stakes huge for industry Reuters Staff \n(Repeats with no change in text) \nBy Nichola Groom and Steve Holland \nLOS ANGELES/WASHINGTON, Jan 17 (Reuters) - U.S. President Donald Trump said on Wednesday he would announce a decision soon on whether to slap tariffs on imported solar panels, and quipped that when countries dump subsidized panels in the United States, “Everybody goes out of business.” \nThe solar industry is anxiously awaiting the decision, which will have wide-reaching implications for the sector. Domestic panel producers opposed to cheap imports would benefit from a tariff. But installers that have relied on the lower-cost hardware for their recent breakneck growth would suffer. \nIn an interview with Reuters, Trump declined to say how he would land on the case - which was triggered last year by a domestic manufacturer’s trade grievance - but complained about the effect of imports on U.S. panel makers. \n“You know, they dump ‘em - government-subsidized, lots of things happening - they dump the panels, then everybody goes out of business,” he said. \nAsked when the decision would be announced, he said: “Pretty soon. Honestly, pretty soon.” \nAccording to a process governed by the International Trade Commission, Trump has until Jan. 26 to make his decision. \nBankrupt domestic panel producer Suniva triggered Trump’s consideration of tariffs last year when it filed a trade case arguing it could not compete with cheap imports. About 95 percent of the solar cells and panels sold in the United States are made abroad, with most coming from China, Malaysia and the Philippines, according to SPV Market Research. \nSuniva was later joined in the case by the U.S. arm of German manufacturer SolarWorld AG. \nIn October, Trump received a range of options from members of the U.S. International Trade Commission to protect domestic producers, but he has broad leeway to come up with his own alternative or do nothing at all. \nSuniva is seeking strong measures. \n“A robust tariff will allow Suniva to restart its factories and rehire employees,” Suniva spokesman Mark Paustenbach said. JOBS AT STAKE \nOnly about 14 percent of the solar industry’s 260,000 jobs are in manufacturing. The trade case has fueled anxiety among installers that make up most of the rest of the industry and rely on low-priced imports. \nThe installation sector’s trade group, the Solar Energy Industries Association, has campaigned against tariffs, saying they would drive up the price of solar and cripple demand, eliminating tens of thousands of jobs and ultimately hurting the manufacturers that sought them in the first place. \n“I‘m staying optimistic that the business aspect of this will come through in the end,” said George Hershman, president of Swinerton Renewable Energy, a privately held firm that constructs large-scale solar projects. \nHershman said Swinerton employed 2,000 full-time employees and up to 8,000 temporary workers, but added several of its projects had been placed on hold pending Trump’s decision. \n“If you add 50 percent to the cost of the job, it may not be economic,” Hershman said. \nSolaria Corp, a U.S. company that produces panels in both California and South Korea, also opposes tariffs, according to Chief Executive Suvi Sharma. The company said a recent $23 million financing round took months longer than it should have partly because of investor jitters about the case. \n“The best thing would be to have this whole thing go away,” Sharma said. (Reporting by Nichola Groom; Editing by Richard Valdmanis and Peter Cooney)", "external_links": [], "published": "2018-01-18T14:00:00.000+02:00", "crawled": "2018-01-18T14:17:42.006+02:00", "highlightTitle": ""}