{"organizations": [], "uuid": "5e1eb2f58d776f100db85b30bda5861e69f9aefd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-taiho-oncology-names-timothy-whitten-president.html", "country": "US", "domain_rank": 767, "title": "Taiho Oncology Names Timothy Whitten President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "5e1eb2f58d776f100db85b30bda5861e69f9aefd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-taiho-oncology-names-timothy-whitten-president.html", "ord_in_thread": 0, "title": "Taiho Oncology Names Timothy Whitten President", "locations": [], "entities": {"persons": [{"name": "timothy whitten", "sentiment": "negative"}, {"name": "taiho pha", "sentiment": "negative"}, {"name": "whitten", "sentiment": "none"}, {"name": "eric c. benn", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}, {"name": "masayuki kobayashi", "sentiment": "none"}, {"name": "taiho", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "princeton", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "taiho oncology", "sentiment": "negative"}, {"name": "taiho oncology, inc.", "sentiment": "neutral"}, {"name": "taiho pharmaceutical co., ltd.", "sentiment": "none"}, {"name": "rmaceutical co., ltd.", "sentiment": "none"}, {"name": "taiho pharma canada, inc.", "sentiment": "none"}, {"name": "taiho pharma europe, ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRINCETON, N.J., Taiho Oncology, Inc. (U.S.), a subsidiary of Taiho Pharmaceutical Co., Ltd. (Japan), today announced the promotion of Timothy Whitten from Senior Vice President and Chief Operating Officer to President, effective January 1, 2018. In his new role, Mr. Whitten will assume leadership responsibility for corporate, commercial and clinical development-related functions at Taiho Oncology, as well as hold operational responsibility for Taiho Pharma Canada, Inc. and Taiho Pharma Europe, Ltd.\nMr. Whitten will continue to report to Taiho Oncology's departing president, Eric C. Benn, who will remain Chief Executive Officer until his retirement on April 1, at which time Mr. Whitten also will be named CEO. At that time Mr. Whitten will report directly to Masayuki Kobayashi, President and Representative Director, Taiho Pharmaceutical Co., Ltd., headquartered in Tokyo, Japan.\n\"As I planned my retirement after nearly a decade at Taiho and 40 years in the pharmaceutical industry, Tim was an obvious choice to take our company to the next level of clinical development and commercial excellence in the West, and to support our quest to become a top 10 oncology company globally,\" said Mr. Benn. \"Under Tim's leadership, we have made great strides in establishing our global presence in the oncology pharmaceutical arena, and we have an exciting future ahead of us as we continue to focus on patients with cancer through the development of our robust global pipeline and product commercialization.\"\nMr. Whitten joined Taiho Oncology in 2013 as Senior Vice President and Chief Commercial Officer to oversee the company's commercial functions and build Taiho Pharmaceutical's first commercial business unit in the West. Mr. Whitten also was responsible for development and execution of the company's strategy for the successful launch of Lonsurf® (trifluridine and tipiracil) Tablets, Taiho Oncology's first approved product in the United States. Mr. Whitten was promoted to Senior Vice President and Chief Operating Officer in 2017, adding human resources to his responsibilities, as well as operations of Taiho Pharma Canada, Inc.\n\"It is an honor to take on the role of president at Taiho Oncology and build on the remarkable accomplishments that Eric has made to the company over the last nine years,\" said Mr. Whitten. \"Eric leaves behind an extraordinary legacy at Taiho Oncology and our employees owe him a debt of gratitude and wish him and his wonderful family well as he starts the next chapter of his life. I look forward to working with my colleagues at Taiho to ensure that patients continue to benefit from our products now and in the future.\"\nAbout Timothy Whitten\nTimothy Whitten joined Taiho Oncology in 2013 as the Senior Vice President and CCO to build the first commercial business unit in the West for Taiho and to oversee the company's commercial functions. In 2017, Mr. Whitten was promoted to Senior Vice President and COO, adding to his responsibility human resources, as well as operations of Taiho Pharma Canada, Inc. Prior to joining Taiho Oncology, Inc., Mr. Whitten served as President and CEO of Transave/lnsmed from 2006 to 2012. During this time, he guided the company's lead product from the preclinical stage into a global phase 3 program. In 2010, he took the private company, Transave, into the public marketplace via a business combination with lnsmed. From 2001 to 2006, Mr. Whitten was employed by Pharmacyclics, where he served in various roles, including Senior Vice President, Marketing & Sales, and Business Development. Mr. Whitten spent 17 years at Bristol-Myers Squibb, where he served in various sales, marketing, and strategic planning roles, including Vice President, Marketing, for the U.S. Oncology and Immunology Franchise and Vice President, Global Marketing, Oncology, Immunology, and Pulmonary Diseases. Among his accomplishments, including several product launches, he directed the successful introduction of Taxol® into the U.S. oncology market. Mr. Whitten graduated from West Virginia University with a Bachelor of Science in Pharmacy and from the University of Virginia with a Master of Business Administration.\nAbout Taiho Pharmaceutical Co., Ltd. (Japan)\nTaiho Pharmaceutical, a subsidiary of Otsuka Holdings Co., Ltd., is an R&D-driven specialty pharma focusing on the three fields of oncology, allergy and immunology, and urology. Its corporate philosophy takes the form of a pledge: \"We strive to improve human health and contribute to a society enriched by smiles.\" In the field of oncology in particular, Taiho Pharmaceutical is known as a leading company in Japan that develops innovative medicines for the treatment of cancer, and is promoting business globally. In areas other than oncology, as well, the company creates quality products that effectively treat medical conditions and can help improve people's quality of life. Always putting customers first, Taiho Pharmaceutical aims to also offer over-the-counter medicinal products that support people's efforts to lead fulfilling and rewarding lives.\nFor more information about Taiho Pharmaceutical Company, please visit https://www.taiho.co.jp/en/ .\nAbout Taiho Oncology, Inc. (U.S.)\nTaiho Oncology, Inc., a subsidiary of Taiho Pharmaceutical Co., Ltd. and Otsuka Holdings Co., Ltd., has established a world class clinical development organization that works urgently to develop innovative cancer treatments and has built a commercial business in the U.S. Taiho has an oral oncology pipeline consisting of both novel antimetabolic agents and selectively targeted agents. Advanced technology, dedicated researchers, and state of the art facilities are helping us to define the way the world treats cancer. It's our work; it's our passion; it's our legacy.\nFor more information about Taiho Oncology, please visit https://www.taihooncology.com .\nAbout Otsuka Holdings Co., Ltd. (Japan)\nThe Otsuka group of companies is a total-healthcare enterprise that aims to contribute to the health of people around the world under the corporate philosophy, \"Otsuka-people creating new products for better health worldwide\".\nHealthcare is broadly and holistically addressed through the two main pillars – the pharmaceutical business for the diagnosis and treatment of diseases and the nutraceutical *1 business to support the maintenance and promotion of everyday health. Our 45,000 *2 employees across 180 companies in 28 countries and regions take on challenges across various fields and themes to help fulfill the universal wish of people to be healthy. Our pursuit of these challenges is motivated by the Otsuka' s corporate culture, articulated as \"Ryukan-godo\" (by sweat we recognize the way), \"Jissho\" (actualization) and \"Sozosei\" (creativity), and fostered by successive generations of Otsuka leaders. By striving to provide unique products and services, we seek to achieve sustainable growth and be an indispensable contributor to the world.\nFor more information, please visit the company's website at http://www.otsuka.com/en/ .\n*1 . Nutraceuticals: nutrition + pharmaceuticals *2 . As of end of December, 2016\nFor more information, please contact:\nCraig Heit\nGCI Health on behalf of Taiho Oncology\nTaihooncology@gcihealth.com\n212-798-9919\nView original content with multimedia: releases/taiho-oncology-names-timothy-whitten-president-300576719.html\nSOURCE Taiho Oncology, Inc.", "external_links": ["http://www.otsuka.com/en/", "http://www.prnewswire.com/news-releases/taiho-oncology-names-timothy-whitten-president-300576719.html", "https://www.taihooncology.com/us/", "https://www.taiho.co.jp/en/"], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T16:49:29.015+02:00", "highlightTitle": ""}