{"organizations": [], "uuid": "03c83353a301325038263a6440d04c4f6702a8d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hong-kong-stocks-rise-for-11th-straight-day-reach-a-decade-high-idUSZZN2N7A00", "country": "US", "domain_rank": 408, "title": "Hong Kong stocks rise for 11th straight day, reach a decade-high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T10:38:00.000+02:00", "replies_count": 0, "uuid": "03c83353a301325038263a6440d04c4f6702a8d7"}, "author": "", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hong-kong-stocks-rise-for-11th-straight-day-reach-a-decade-high-idUSZZN2N7A00", "ord_in_thread": 0, "title": "Hong Kong stocks rise for 11th straight day, reach a decade-high", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 9 (Reuters) - Hong Kong stocks rose for the 11th straight session to a fresh 10-year high on Tuesday, aided by inbound money flows from China and strength in index heavyweight Tencent Holdings.\n** Chinese investors continued to pile money into Hong Kong stocks, using up nearly a quarter of the daily quota under the Shanghai-Hong Kong Stock Connect. Tencent rose for the sixth straight session, and hit a record. ** At close of trade, the Hang Seng index was up 111.88 points or 0.36 percent at 31,011.41. The Hang Seng China Enterprises index rose 0.17 percent to 12,255.68. **The sub-index of the Hang Seng tracking energy shares rose 0.5 percent while the IT sector rose 1 percent, the financial sector was 0.36 percent higher and property sector rose 0.56 percent. ** The top gainer on Hang Seng was Sands China Ltd up 4.89 percent, while the biggest loser was Hengan International Group Company Ltd, down 2.96 percent. ** China’s main Shanghai Composite index closed up 0.16 percent at 3,414.8339 points while its blue-chip CSI300 index ended up 0.71 weaker by 0.11 percent while Japan’s Nikkei index closed up 0.57 percent. ** The yuan was Quote: d at 6.5216 per U.S. dollar at 08:28 GMT, 0.36 6.4984. ** The top gainers among H-shares were Ping An Insurance Group Co of China Ltd up 2.49 percent, followed by Dongfeng Motor Group Co Ltd gaining 1.8 percent and New China Life Insurance Co Ltd up by 1.59 percent. ** The three biggest H-shares percentage decliners were Anhui Conch Cement Co Ltd which was down 2.62 percent, CRRC Corp Ltd which fell 2.6 percent and Air China Ltd down by 1.9 percent. ** About 2.07 billion Hang Seng index shares were traded, roughly 117.1 1.77 billion shares a day. The volume traded in the previous trading session was 2.07 billion. ** At close, China’s 26.93 ** The price-to-earnings ratio of the Hang Seng index was 14.09 as of the last full trading day while the dividend yield was 2.8 percent. ** So far this week, the market capitalisation of the Hang Seng index has risen by 0.48 percent to HK$20.33 trillion. (Reporting by the Shanghai Newsroom; Editing by Richard Borsuk)\n ", "external_links": [], "published": "2018-01-09T10:38:00.000+02:00", "crawled": "2018-01-09T11:04:01.001+02:00", "highlightTitle": ""}