{"organizations": [], "uuid": "afea12c98be9a23274685911559f7d56b9f28f3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-transocean-ltd-closes-the-acquisition-of-songa-offshore-se.html", "country": "US", "domain_rank": 767, "title": "Transocean Ltd. Closes the Acquisition of Songa Offshore SE", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-31T00:39:00.000+02:00", "replies_count": 0, "uuid": "afea12c98be9a23274685911559f7d56b9f28f3b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-transocean-ltd-closes-the-acquisition-of-songa-offshore-se.html", "ord_in_thread": 0, "title": "Transocean Ltd. Closes the Acquisition of Songa Offshore SE", "locations": [], "entities": {"persons": [], "locations": [{"name": "switzerland", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "transocean ltd", "sentiment": "negative"}, {"name": "globe newswire", "sentiment": "negative"}, {"name": "transocean ltd.", "sentiment": "negative"}, {"name": "cyprus securities and exchange commission", "sentiment": "none"}, {"name": "transocean transocean", "sentiment": "none"}, {"name": "songa offshore se", "sentiment": "none"}, {"name": "transocean", "sentiment": "none"}, {"name": "songa offshore", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STEINHAUSEN, Switzerland, Jan. 30, 2018 (GLOBE NEWSWIRE) -- Transocean Ltd. (NYSE:RIG) announced today that it has closed the acquisition of Songa Offshore SE (“Songa Offshore”). Transocean currently owns 187,390,391 Songa Offshore shares representing approximately 97.5% of the total shares in Songa Offshore on a fully diluted basis.\nTransocean intends to promptly initiate a compulsory acquisition of the remaining outstanding shares of Songa Offshore in accordance with the procedures set out in the combined prospectus and offer document and applicable laws. The compulsory acquisition is subject to approval by the Cyprus Securities and Exchange Commission (“CySEC”) and compliance with applicable requirements of U.S. and Norwegian securities law.\nTransocean expects to complete the compulsory acquisition by the end of the first quarter 2018.\nAbout Transocean\nTransocean is a leading international provider of offshore contract drilling services for oil and gas wells. The company specializes in technically demanding sectors of the global offshore drilling business with a particular focus on deepwater and harsh environment drilling services, and believes that it operates one of the most versatile offshore drilling fleets in the world.\nTransocean owns or has partial ownership interests in, and operates a fleet of 39 mobile offshore drilling units consisting of 26 ultra-deepwater floaters, seven harsh environment floaters, two deepwater floaters and four midwater floaters. In addition, Transocean has three ultra-deepwater drillships under construction or under contract to be constructed. The company also operates two high-specification jackups that were under drilling contracts when the rigs were sold, and the company continues to operate these jackups until completion or novation of the drilling contracts.\nFor more information about Transocean, please visit: www.deepwater.com .\nForward-Looking Statements\nAny statements in this release that are not historical facts may be forward-looking statements that involve certain risks, uncertainties and assumptions. All forward-looking statements included in this release are based on information available to the company as of the date of this communication and current expectations, forecasts and assumptions. Forward-looking statements involve risks and uncertainties which could cause actual results to differ materially from those anticipated. These risks and uncertainties include the timing, receipt and terms and conditions of any required governmental and regulatory approvals for the compulsory acquisition; difficulties that may be encountered in integrating the combined businesses and realizing the potential synergies of the combination; and the other risks and uncertainties included in the Registration Statement on Form S-4 filed by the company on December 20, 2017 or in the company’s most recent Form 10-K, Forms 10-Q and other filings with the U.S. Securities and Exchange Commission (the “SEC”). No forward-looking statements in this release should be relied upon as representing the company’s views or expectations as of any subsequent date, and the company does not undertake any obligation to revise or update any such forward-looking statement to reflect events or circumstances that may arise after the statement was made.\nAdditional Information\nIn connection with the compulsory acquisition, Transocean Ltd. and Transocean Inc. (the “Offerors”) will file with the SEC a Registration Statement on Form S-4 (the “Registration Statement”) containing a prospectus with respect to the shares and exchangeable bonds to be issued in the compulsory acquisition (the “Prospectus”). When available, the Offerors will distribute the Prospectus to certain securityholders of Songa in the United States in connection with the compulsory acquisition. The Offerors are also expected to file an offer document with the Financial Supervisory Authority of Norway (the “Norwegian FSA”).\nINVESTORS AND SECURITYHOLDERS ARE URGED TO READ CAREFULLY THE PROSPECTUS REGARDING THE COMPULSORY ACQUISITION IN ITS ENTIRETY WHEN IT BECOMES AVAILABLE (INCLUDING ANY AMENDMENTS OR SUPPLEMENTS THERETO) OR ANY DOCUMENTS WHICH ARE INCORPORATED BY REFERENCE, BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT THE COMPULSORY ACQUISITION. You may obtain, free of charge, copies of the Prospectus and Registration Statement, when available, and other relevant documents filed by the Offerors with the SEC, at the SEC’s website at: www.sec.gov . In addition, shareholders may obtain free copies of the Prospectus and other relevant documents filed by the Offerors with the SEC from the company’s website at: www.deepwater.com .\nThis communication does not constitute an offer to buy or exchange, or the solicitation of an offer to sell or exchange, any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, sale or exchange would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. This communication is not a substitute for any prospectus, proxy statement or any other document that the Offerors may file with the SEC in connection with the compulsory acquisition. The final terms and further provisions regarding the compulsory acquisition will be disclosed in the offer document after the publication has been approved by the Norwegian FSA and in documents that will be filed by the Offerors with the SEC. No money, securities or other consideration is being solicited, and, if sent in response to the information contained herein, will not be accepted.\nNo offering of securities shall be made except by means of a prospectus meeting the requirements of the U.S. Securities Act of 1933, as amended, and any applicable European and Norwegian regulations. The compulsory acquisition and distribution of this document may be restricted by law in certain jurisdictions and persons into whose possession any document or other information referred to herein should inform themselves about and observe any such restrictions. Any failure to comply with these restrictions may constitute a violation of the securities laws of any such jurisdiction. No offering of securities will be made directly or indirectly, in or into any jurisdiction where to do so would be inconsistent with the laws of such jurisdiction.\nAnalyst Contacts:\nBradley Alexander\n+1 713-232-7515\nDiane Vento\n+1 713-232-8015\nMedia Contact :\nPam Easton\n+1 713-232-7647\nSource:Transocean Ltd.", "external_links": [], "published": "2018-01-31T00:39:00.000+02:00", "crawled": "2018-01-31T02:13:50.001+02:00", "highlightTitle": ""}