{"organizations": [], "uuid": "33841af9b74fba942d607bb1609107a2d55e65dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/monopoly-cheaters-hasbro-twitter.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/31/monopoly-cheaters-edition/", "country": "US", "domain_rank": 1196, "title": "Hasbro Introduces Monopoly Game Geared Towards Cheaters | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.792, "site_type": "news", "published": "2018-01-31T14:20:00.000+02:00", "replies_count": 0, "uuid": "33841af9b74fba942d607bb1609107a2d55e65dd"}, "author": "Chris Morris", "url": "http://fortune.com/2018/01/31/monopoly-cheaters-edition/", "ord_in_thread": 0, "title": "Hasbro Introduces Monopoly Game Geared Towards Cheaters | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Newest Monopoly Game Is Made for Cheaters Courtesy of Hasbro By Chris Morris 12:20 PM EST \nIf you’ve ever played Monopoly, odds are you’ve cheated at least once. It’s a long game and there’s lots of temptation along the way. Hasbro (has) gets that—and it’s finally giving its blessing to the rule breakers. \nMonopoly: Cheaters Edition is due out this fall . It’s a new version of the classic game that not only condones stealing money from the bank or not paying rent when you land on someone else’s property, but rewards you for it. Of course, the risks are even greater as well. \nHere’s how it works: Beyond the Chance and Community Chest, there are also 15 Cheat Cards in the game. Five will be placed in the middle of the board, which are player goals. Courtesy of Hasbro \nThe Cheat Cards range from stealing money, to removing a hotel from someone’s property, to moving another player’s token instead of your own. Get away with it and you’ll get extra money or property. Get caught and you could go to jail—or worse. The harshest of the punishments for getting caught cheating requires players to don a handcuff that attaches them to the game. \nThere are a few other things that differentiate this version of the game. There’s no designated banker and some properties are free. Courtesy of Hasbro \n“We’ve finally decided to embrace our less-than-honest fans by encouraging them to partake in those iconic (yet sometimes unspoken) Monopoly moments that occur during family game nights,” says Jonathan Berkowitz, senior vice president of Hasbro gaming. “We’re excited to see what fans can get away with and how they’ll react to the new sneaky twists in the game.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-31T14:20:00.000+02:00", "crawled": "2018-01-31T20:31:04.380+02:00", "highlightTitle": ""}