{"organizations": [], "uuid": "8c97dbf5e52c9934191bc19497dbe2f6cced8992", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF384_WALMAR_SOC_20180129173534.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7014.xml", "section_title": "WSJ.com: US Business", "url": "https://www.wsj.com/articles/wal-mart-tightens-delivery-windows-for-suppliers-1517266620", "country": "US", "domain_rank": 387, "title": "Wal-Mart Tightens Delivery Windows for Suppliers", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T02:18:00.000+02:00", "replies_count": 0, "uuid": "8c97dbf5e52c9934191bc19497dbe2f6cced8992"}, "author": "Sarah Nassauer", "url": "https://www.wsj.com/articles/wal-mart-tightens-delivery-windows-for-suppliers-1517266620", "ord_in_thread": 0, "title": "Wal-Mart Tightens Delivery Windows for Suppliers", "locations": [], "entities": {"persons": [{"name": "bratspies", "sentiment": "none"}, {"name": "steve bratspies", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "wal-mart", "sentiment": "negative"}, {"name": "wal-mart stores inc", "sentiment": "negative"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "kraft", "sentiment": "none"}, {"name": "kroger co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "20 COMMENTS Wal-Mart Stores Inc. WMT -1.88% plans to ask suppliers to deliver more goods to warehouses exactly on time or face fines, another step in the retailer’s efforts to keep inventory low and shelves stocked as it battles with Amazon.com Inc. \nAt an annual conference for suppliers this week, Wal-Mart executives plan to announce that large suppliers need to deliver full orders within a specified one- or two-day window 85% of the time or face a fine of 3% of the cost of delayed goods, said Steve Bratspies chief merchandising officer for Wal-Mart U.S., in an interview Monday. Previously, suppliers had to hit a 75% threshold to avoid fines. For smaller suppliers the on-time threshold will move to 50%, up from 33%. The change will take effect in April.\n“This is not a ‘Hey, let’s see how unreasonable we can be,’” said Mr. Bratspies. “We need the product that the customer wants when they want it.” Wal-Mart would rather have the products on-time than fine suppliers, said a spokesman.\nAs Wal-Mart, Kroger Co. and other retailers demand tighter delivery windows , suppliers including Kraft Heinz Co. and Procter & Gamble Co. have invested heavily to meet those requirements and make their supply chains more flexible for online buyers. Last February, Wal-Mart executives told suppliers more accurate delivery times would be a focus going forward and first introduced fines for inaccurate deliveries last year. \nA more precise delivery window helps Wal-Mart keep shelves stocked and the flow of products more predictable, while reducing inventory, say executives. That goal has become increasingly important to the world’s largest retailer as it pushes to make stores more profitable so it can marshal funds to boost online efforts. In addition, accurate inventory data is more important to retailers as they offer shoppers more ways to buy online and pick up in store.\n“They’re trying to get as much inventory as possible off the books,” said Adrian Gonzalez, a supply-chain analyst and president of research firm Adelante SCM. “They want to order more frequently and in smaller quantities, and kind of accelerate that whole process.”\nThat strategy also increases the risk of products being out of stock, and consumer disappointment, Mr. Gonzalez said. “Wal-Mart is trying to balance that…while still making sure the product is on the shelf.”\nEmpty shelves or otherwise unsaleable products add up to some $75 billion in lost sales a year, according to the Food Marketing Institute, a trade organization.\nNearly 4,000 suppliers are expected to attend the meeting in Bentonville, Ark., where Wal-Mart will outline plans to for the first time widely share with suppliers data on which precise products are on shelves at any given time and why products are out of stock, as well as what products Wal-Mart plans to stock in each store. The additional data, which will become available throughout the year, will help with on-time delivery and “help our suppliers become more efficient and help solve problems,” Mr. Bratspies said.\nThe tightened delivery window comes as freight costs are soaring for manufacturers and retailers. Many companies are scrambling to book transportation, particularly for time-sensitive deliveries, because demand has outstripped the supply of available trucks. Prices on the spot market, where shippers arrange last-minute transportation, are up more than 20% compared with this time last year. Fuel prices are also rising, adding to costs.\n“Trying to find a truck in today’s environment is next to impossible,” said Cathy Roberson, an analyst with Logistics Trends & Insights LLC. “Fuel surcharges are going up and the suppliers are going to have to pay all of this.”\nWrite to Sarah Nassauer at sarah.nassauer@wsj.com and Jennifer Smith at jennifer.smith@wsj.com", "external_links": [], "published": "2018-01-30T02:18:00.000+02:00", "crawled": "2018-01-30T02:55:04.008+02:00", "highlightTitle": ""}