{"organizations": [], "uuid": "5c25395b156dcd85801924cc4e79c7ddbf11915f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hong-kongs-hang-seng-rises-for-14th-day-to-record-closing-high-idUSZZN2N7D00", "country": "US", "domain_rank": 408, "title": "Hong Kong's Hang Seng rises for 14th day to record closing high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T10:35:00.000+02:00", "replies_count": 0, "uuid": "5c25395b156dcd85801924cc4e79c7ddbf11915f"}, "author": "", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hong-kongs-hang-seng-rises-for-14th-day-to-record-closing-high-idUSZZN2N7D00", "ord_in_thread": 0, "title": "Hong Kong's Hang Seng rises for 14th day to record closing high", "locations": [], "entities": {"persons": [], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "tencent", "sentiment": "none"}, {"name": "hang seng china enterprises", "sentiment": "none"}, {"name": "ping an insurance group co of china ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "wharf real estate investment company ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 12 (Reuters) - Hong Kong’s Hang Seng Index ended trading at a record high on Friday, after rising for 14 consecutive days in the longest ever winning streak that reflects sustained investor optimism even after a bumper 2017. ** Market sentiment was buoyed by signs of concerted global economic recovery, as well as a resurgence in index heavyweight Tencent, which jumped about 3 percent. ** At close of trade, the Hang Seng index was up 292.15 points or 0.94 percent at 31,412.54. The Hang Seng China Enterprises index rose 1.41 percent to 12,468.93. **The sub-index of the Hang Seng tracking energy shares rose 1.8 percent while the IT sector rose 2.27 percent, the financial sector was 1.07 percent higher and property sector dipped 0.19 percent . ** The top gainer on the Hang Seng was Ping An Insurance Group Co of China Ltd up 3.41 percent, while the biggest loser was Wharf Real Estate Investment Company Ltd which was down 3.14 percent. ** China’s main Shanghai Composite index closed up 0.12 percent at 3,429.3152 points while its blue-chip CSI300 index ended up 0.47 percent. ** Around the region, MSCI’s Asia ex-Japan stock index was firmer by 0.66 percent while Japan’s Nikkei index closed down 0.24 percent . ** The yuan was Quote: d at 6.4672 per U.S. dollar at 08:24 GMT, 0.47 percent firmer than the previous close of 6.4978. ** The top gainers among H-shares were Air China Ltd up 5.81 percent, followed by Ping An Insurance Group Co of China Ltd gaining 3.41 percent and Byd Co Ltd up by 3.13 percent. ** The three biggest H-shares percentage decliners were Zhuzhou CRRC Times Electric Co Ltd which was down 1.84 percent, CRRC Corp Ltd which fell 1.6 percent and China Galaxy Securities Co Ltd down by 1.2 percent. ** About 2.40 billion Hang Seng index shares were traded, roughly 133.9 percent of the market’s 30- 1.79 billion shares a day. The volume traded in the previous trading session was 1.85 billion. ** At close, China’s A-shares were trading at a premium of 27.30 percent over the Hong Kong-listed H-shares. ** The price-to-earnings ratio of the Hang Seng Index was 14.19 as of the last full trading day while the dividend yield was 2.8 percent. ** So far this week, the market capitalisation of the Hang Seng index has risen by 0.88 percent to HK$20.41 trillion. (Reporting by the Shanghai Newsroom; Editing by Jacqueline Wong)\n ", "external_links": [], "published": "2018-01-12T10:35:00.000+02:00", "crawled": "2018-01-12T11:08:17.005+02:00", "highlightTitle": ""}