{"organizations": [], "uuid": "5009c32d6db52149dcfb74559e774c7b2038c586", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/safrica-eskom/update-1-s-africas-eskom-looks-to-borrow-1-7-bln-to-ease-financial-crisis-idUSL8N1PH2ME", "country": "US", "domain_rank": 408, "title": "UPDATE 2-S.Africa's Eskom looks to borrow $1.7 bln to ease financial crisis", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T19:57:00.000+02:00", "replies_count": 0, "uuid": "5009c32d6db52149dcfb74559e774c7b2038c586"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/safrica-eskom/update-1-s-africas-eskom-looks-to-borrow-1-7-bln-to-ease-financial-crisis-idUSL8N1PH2ME", "ord_in_thread": 0, "title": "UPDATE 2-S.Africa's Eskom looks to borrow $1.7 bln to ease financial crisis", "locations": [], "entities": {"persons": [{"name": "khulu phasiwe", "sentiment": "none"}, {"name": "tanisha heiberg", "sentiment": "none"}], "locations": [{"name": "africa", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "national treasury", "sentiment": "negative"}, {"name": "eskom", "sentiment": "negative"}, {"name": "johannesburg stock exchange", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "jse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* National Treasury to support Eskom’s bid to persuade local banks\n* Utility may approach international banks at later stage\n* Eskom to meet JSE’s deadline to submit interim results\n* Suspended CFO Singh resigns with immediate effect (Adds resignation of CFO)\nBy Tanisha Heiberg\nJOHANNESBURG, Jan 22 (Reuters) - South Africa’s Eskom will ask local banks to reopen lending facilities that were suspended last year, its spokesman said on Monday, as the state utility seeks to drag itself out of a crisis that poses a risk to the country’s financial stability.\nNational Treasury will support Eskom’s bid to persuade South African banks to lend the utility 20 billion rand ($1.66 billion), spokesman Khulu Phasiwe told Reuters.\n“We are going to the market to try to see if we can raise that 20 billion rand we generally need as a company,” said Eskom spokesman Khulu Phasiwe, adding that they would approach the international market at a later stage.\nTreasury could not be reached for comment.\nThe Johannesburg Stock Exchange (JSE) last week gave Eskom until the end of the month to submit its interim results or it would suspend trading of the power utility’s debt.\nPhasiwe said Eskom would meet the JSE’s deadline. He said the delay in submitting results was partly because Eskom needed to reassure auditors about its liquidity position.\nSouth Africa’s parliament is investigating Eskom over allegations executives at the utility were involved in unduly awarding contracts to friends of President Jacob Zuma.\nOne of those executives, suspended chief financial officer Anoj Singh, tendered his resignation through his attorneys on Monday, Eskom said in a statement.\n“The board of Eskom, through the Chairman, has accepted the resignation and communicated the acceptance through Mr Singh’s attorneys,” said Eskom, adding that his resignation would take immediate effect.\nEskom suspended Singh in July last year pending an investigation into allegations that he granted preferential treatment to bidders supplying coal to the state-owned firm.\nThe government named a new Eskom board on Saturday, ending a power vacuum that dates back to mid-2017 when then chairman Ben Ngubane resigned and government reversed Eskom’s decision to reinstate Brian Molefe as chief executive.\nThe new board has been directed to immediately remove all Eskom executives who are facing allegations of “serious corruption and other acts of impropriety”, including former acting chief executive Matshela Koko and Singh, the presidency said on Saturday.\nLast year the board of Eskom said it would take disciplinary action against Koko for violating procurement rules by giving contracts to a firm where his stepdaughter was a director.\nFinance Minister Malusi Gigaba said last week that Treasury cannot afford to bail out Eskom but would take action to tackle the company’s challenges. ($1 = 12.0308 rand) (Additional reporting by Nqobile Dludla; Editing by Joe Brock and Adrian Croft)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T19:57:00.000+02:00", "crawled": "2018-01-23T18:04:17.000+02:00", "highlightTitle": ""}