{"organizations": [], "uuid": "5b675b41c104d18b459b54a046cf7c66248eb81d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-cgg-launches-its-share-capital-increase-with-preferential-subscription-rights-for-an-amount-of-approximately-a112-point-2.html", "country": "US", "domain_rank": 767, "title": "CGG: launches its share capital increase with preferential subscription rights for an amount of approximately €112.2 million through the issuance of new shares, each with one warrant attached", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T09:31:00.000+02:00", "replies_count": 0, "uuid": "5b675b41c104d18b459b54a046cf7c66248eb81d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-cgg-launches-its-share-capital-increase-with-preferential-subscription-rights-for-an-amount-of-approximately-a112-point-2.html", "ord_in_thread": 0, "title": "CGG: launches its share capital increase with preferential subscription rights for an amount of approximately €112.2 million through the issuance of new shares, each with one warrant attached", "locations": [], "entities": {"persons": [], "locations": [{"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "cgg", "sentiment": "none"}, {"name": "rights subscription", "sentiment": "none"}, {"name": "dnca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CGG launches its share capital increase with preferential subscription rights for an amount of approximately €112.2 million through the issuance of new shares, each with one warrant attached\nSubscription price : €1.56 per new share, each with one warrant attached Subscription ratio : 13 ABSAs for 4 Rights Subscription period : from January 22, 2018 to February 2, 2018 inclusive Trading period for Rights : from January 18, 2018 to January 31, 2018 inclusive The transaction is part of CGG's financial restructuring plan and allows the subscribers to take part in the recovery of the sector through the Warrants #2 The transaction is backstopped by DNCA (in cash) for up to approximately €71.39 million and by the Senior Note holders for the remaining unsubscribed portion (by way of set-off against claims)\nParis, France - January 17, 2018\nCGG (the \" Company \") announces today the terms of its share capital increase with preferential subscription rights (the \" Rights \") for an amount of approximately €112.2 million (including share premium) (the \" Rights Issue \"), by way of an issuance of shares of the Company (the \" New Shares \") each with one warrant attached (the \" Warrants #2 \" and together with the New Shares, the \" ABSAs \").\nMain terms of the Rights Issue\nThe Rights Issue will result in the creation of 71,932,731 ABSAs, at a subscription price of €1.56 per share (i.e. €0.01 nominal and €1.55 share premium) representing a maximum gross product (including share premium) of €112,215,060.36 (assuming that the Rights Issue is fully subscribed in cash).\nEach shareholder of CGG will receive one Right for each share recorded in its securities account (enregistrement comptable) at the end of the fiscal day on January 17, 2018. The ABSA subscription will be made at the subscription price of €1.56 per ABSA (i.e. €0.01 nominal and €1.55 share premium), four Rights allowing their holder to subscribe for 13 ABSAs irreducibly.\nSubscriptions on a reducible basis will be admitted but may be reduced in the event of oversubscription of the Rights Issue in excess of 71,932,731 ABSAs. The ABSAs not subscribed on an irreducible basis will be allocated to holders of Rights who have placed orders on a reducible basis and allocated among them subject to such reduction.\nThe Rights Issue will be open to the public in France only and in private placements to institutional investors outside of France.\nKey characteristics of the Warrants #2\nThe Warrants #2 will be securities giving access to the share capital within the meaning of articles L. 228-91 et seq. of the French Code de commerce. The exercise of Warrants #2 allows the subscribers of the ABSAs (or their transferees) to take part in the recovery of the sector if CGG's share price exceeds €4.02 per share.\nOne (1) Warrant #2 will be attached to each New Share. Upon issuance, each Warrant #2 will be detached from the New Share to which it was originally attached.\nThe Warrants #2 will be listed on Euronext Paris separately from the existing shares of the Company, under the ISIN code FR0013309622.\nThree (3) Warrants #2 will entitle their holder to subscribe to two (2) new shares (the \" Exercise Ratio \"), for a subscription price of €4.02 per new share (the holders having to exercise their Warrants #2 by multiples of three) during a period of five years from the date on which all of the transactions involved in the Company's financial restructuring are implemented. This date will be the subject of a press release.\nThe Exercise Ratio may be adjusted as a result of transactions that the Company implements following the issuance of the Warrants #2 (scheduled for February 21, 2018), in accordance with applicable French laws and regulations and in compliance with contractual provisions, to protect the rights of holders of Warrants #2 (no adjustment will be made as a consequence of the securities issuances contemplated in the financial restructuring plan).\nThe new shares issued upon the exercise of the Warrants #2 will be ordinary shares of the Company of the same class as the existing shares. They will entitle their holders to all rights attached to them from their date of issue and to all distributions decided by the Company after that date and applications will be submitted periodically to have them admitted to trading on Euronext Paris under the same quotation line as existing shares (ISIN code: FR0013181864).\nConditions to the settlement and delivery\nThe transactions provided for under the safeguard plan and the Chapter 11 plan (including the Rights Issue) shall be regarded as a whole so that if one of them cannot be implemented, none of them will be implemented. The settlement and delivery of the Rights Issue must occur (i) before February 28, 2018 (or any later date as may be determined in accordance with the terms of the Lock-Up Agreement entered into by the Company on June 13, 2017 (the \" Lock-Up Agreement \") and the restructuring support agreement which provides for the backstop commitment of DNCA Invest and the entities managed by DNCA Finance (the \" DNCA Entities \") (the \" Restructuring Support Agreement \") and (ii) concurrently with the settlement and delivery of the other securities to be issued by the Company in connection with the Company's restructuring plan.\nThe settlement and delivery of the Rights Issue and, more generally, the completion of the financial restructuring plan, remain subject to the satisfaction (or waiver) prior to the settlement and delivery of the Rights Issue, of certain conditions precedent set forth in the private placement agreement dated June 26, 2017 (the \" Private Placement Agreement \") and in the preparatory documents for the issuance of the New First Lien Notes and the Second Lien Notes (the \" Preparatory Documents \"). In addition, persons who have committed to subscribe to the Second Lien Notes in the context of the Private Placement Agreement have the right, under certain conditions, to terminate such agreement prior to the settlement and delivery of the Rights Issue. The Restructuring Support Agreement providing for the backstop commitment of the DNCA Entities of the Rights Issue may be terminated under certain conditions, prior to the settlement and delivery of the Rights Issue.\nThe settlement and delivery of the Rights Issue, as well as the transactions provided for in the Company's financial restructuring plan might not be implemented in the following cases:\nthe breach of any representation and warranty or any covenant made by the Company or certain of its subsidiaries pursuant to the Private Placement Agreement, in each case in any material respects; the absence of execution or delivery of the final documentation related to the issuance of the New First Lien Notes and the Second Lien Notes; the occurrence or existence of any event having individually or in the aggregate a Material Adverse Effect (as such term is defined hereafter); a decision of a competent court or authority restraining or otherwise preventing the implementation of all or part of the Company's financi", "external_links": ["https://www.globenewswire.com/Tracker?data=QV_GBYOQIzQyYcq95qkuEZc-jWmL7RESGtX1tsTI2wsJIjz8r_Ve7u-8-MynCWoP-I5plljVzCtVpzFqtfM4jQ==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/d614c2bf-7cb7-49b1-a439-4caf3bc49fc8", "https://www.globenewswire.com/Tracker?data=1TZ2941IL8W7t14d5tEGp5A2kC-ocpGSqx5L2KDnT3_ciIam6i62nIuv7fLBTzaAW1MpU1elv2aKg1I9-YsYLVGZsk2IWWGARskqPDDbcVMNKolO9gmBCTenEABjbpktzlPbbbulyBUBByErvU_4OayxCXA_qA_3XOJySboRYXPcjg8xxSW_VCj8ddF-yPUlZKl2g3yzIplNCa2rNvH56x7yDd6AoRjeLPT5_WbYNqCK__ZNS-Y5J6krEUBUHZ4L49NbLFCWQ6fli_CZfTq7Yw=="], "published": "2018-01-17T09:31:00.000+02:00", "crawled": "2018-01-17T11:34:47.004+02:00", "highlightTitle": ""}