{"organizations": [], "uuid": "025da393177aa17d4ed6576d947a736c7f027961", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/21/104957600-907762292.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/21/pence-meets-jordan-king-on-trip-clouded-by-jerusalem-move.html", "country": "US", "domain_rank": 767, "title": "Pence meets Jordan king on trip clouded by Jerusalem move", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.043, "site_type": "news", "published": "2018-01-21T02:00:00.000+02:00", "replies_count": 0, "uuid": "025da393177aa17d4ed6576d947a736c7f027961"}, "author": "Salah Malkawi", "url": "https://www.cnbc.com/2018/01/21/pence-meets-jordan-king-on-trip-clouded-by-jerusalem-move.html", "ord_in_thread": 0, "title": "Pence meets Jordan king on trip clouded by Jerusalem move", "locations": [], "entities": {"persons": [{"name": "pence", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "abdullah ii", "sentiment": "none"}, {"name": "salah malkawi", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}], "locations": [{"name": "jerusalem", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "tel aviv", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "amman", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "marka", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. Vice President Mike Pence is defending President Donald Trump's move to declare Jerusalem the capital of Israel, a decision that has touched off uneasiness among Arab nations on his first tour of the region.\nPence was to meet Sunday with Jordan's King Abdullah II for discussions that are expected to include last month's shift on Jerusalem and plans to move the U.S. embassy from Tel Aviv to the fiercely contested holy city.\nThe vice president said after meeting Saturday with Egypt's President Abdel-Fattah el-Sissi that he emphasized the U.S. commitment to a two-state solution to the conflict between Israel and the Palestinians.\nPence said he assured el-Sissi the U.S. was committed to \"preserving the status quo with regard to holy sites in Jerusalem,\" and that borders and other issues would be negotiated between the parties.\n\"The United States of America is deeply committed to restarting the peace process in the Middle East,\" Pence said before departing for Jordan. He said he would be \"delivering that message in Jordan, delivering that message in Israel, as well.\"\nEl-Sissi said in a statement after the meeting that he affirmed Egypt's \"unyielding position\" in support of the Palestinians' right to establish an independent state with east Jerusalem as its capital. He said the conflict could only be resolved through negotiations leading to a two-state solution.\nIsrael views Jerusalem as its unified capital, while the Palestinians demand east Jerusalem, which was captured by Israel in the 1967 Mideast war, as the capital of their future state. A longstanding international consensus holds that the city's final status should be decided through negotiations, which was also U.S. policy going back decades.\nArab and Muslim nations support the Palestinians' claim to east Jerusalem, and the Trump administration's shift ignited protests across the region.\nAhead of Pence's arrival, several dozen Jordanians gathered outside the U.S. Embassy in Amman, protesting against U.S. policies in the Middle East.\n\"America is the head of the snake,\" they chanted. Some held up a banner reading: \"The envoy of the Zionist American right-wing is not welcome.\"\nThe Trump administration's dramatic policy shift on Jerusalem has posed a dilemma for Jordan's monarch, a staunch U.S. ally.\nMuhammad Hamed | Reuters Jordan's King Abdullah speaks during his meeting with U.S. Vice President Mike Pence at the Royal Palace in Amman, Jordan January 21, 2018. Palestinians make up a large segment of Jordan's population, and the ruling Hashemite monarchy derives some of its political legitimacy from its historic role as custodian of Jerusalem's main Muslim shrine, the Al-Aqsa mosque, which is Islam's third holiest site.\nAny perceived threats to Muslim claims to the city, such as Trump's shift on Jerusalem, undermine its vital role there.\nAt the same time, Jordan relies on U.S. military and economic aid — $1.5 billion in 2015 and $1.6 billion last year — at a time of a worsening economic downturn and rising unemployment.\nPalestinians view Trump's recognition of Jerusalem as Israel's capital as a blatantly one-sided move and have ruled out continued U.S. mediation of the Israeli-Palestinian conflict.\nPalestinian President Mahmoud Abbas said he would not meet with Trump administration officials and called off a meeting with Pence that had been scheduled for mid-December.\nIn a new expression of that snub, Abbas overlapped with Pence in Jordan from Saturday evening to midday Sunday, when the Palestinian leader is to fly to Brussels for a meeting with EU foreign ministers. There, Abbas is expected to urge EU member states to recognize a state of Palestine in the West Bank, Gaza and east Jerusalem, lands captured by Israel in 1967, and to step up involvement in mediation.\nNabil Abu Rdeneh, an Abbas adviser, reiterated Sunday that \"the U.S. is no longer acceptable as a mediator.\"\n\"Any plan from any side should be based on the basic references, which are the U.N. resolutions on the establishment of a Palestinian state on the borders of 1967, with east Jerusalem as a capital, and the Arab Peace Initiative, which addresses many issues, including the issue of refugees,\" he said.\n\"Any plan that is not based on the international legitimacy and the Arab Peace Initiative will not be acceptable, neither by the Palestinians nor the Arabs.\"\nPence was also expected to meet with U.S. troops in the region on Sunday and then depart for Israel, where he's scheduled to hold meetings with Israeli Prime Minister Benjamin Netanyahu, deliver an address to the Knesset and visit the Yad Vashem Holocaust memorial.\nNetanyahu has said he'll soon decide on Israel's new ambassador to Jordan after the two countries agreed to move past a diplomatic row. Israel media reported Netanyahu as saying Israel had expressed remorse over a shooting at its Amman embassy last summer that killed two Jordanians.\nIsrael's ambassador returned to Israel along with the guard involved in the shooting. The guard claimed self-defense and received a hero's welcome at home, angering Jordanians.\nThe incident has strained relations between the countries, which signed a peace agreement in 1994 and cooperate on security and other issues.", "external_links": [], "published": "2018-01-21T02:00:00.000+02:00", "crawled": "2018-01-21T13:47:14.001+02:00", "highlightTitle": ""}