{"organizations": [], "uuid": "ab602dcacf3505c9abc3deeafa4dfcae52068cc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/09/reuters-america-ford-taps-postmates-for-edge-in-self-driving-delivery-race.html", "country": "US", "domain_rank": 767, "title": "Ford taps Postmates for edge in self-driving delivery race", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T19:00:00.000+02:00", "replies_count": 0, "uuid": "ab602dcacf3505c9abc3deeafa4dfcae52068cc5"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/reuters-america-ford-taps-postmates-for-edge-in-self-driving-delivery-race.html", "ord_in_thread": 0, "title": "Ford taps Postmates for edge in self-driving delivery race", "locations": [], "entities": {"persons": [{"name": "farley", "sentiment": "none"}, {"name": "jim farley", "sentiment": "none"}, {"name": "sherif marakby", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "san francisco-based postmates", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ford", "sentiment": "negative"}, {"name": "ford motor co", "sentiment": "negative"}, {"name": "tmates inc", "sentiment": "none"}, {"name": "dominos pizza", "sentiment": "none"}, {"name": "uber technologies inc", "sentiment": "none"}, {"name": "lyft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Las Vegas, Jan 9 (Reuters) - Ford Motor Co on Tuesday said it will partner with delivery service Postmates Inc as the automaker starts testing ways to transport people, food and packages using its self-driving cars in a U.S. city during the first quarter.\nFord's plans challenge the ambitions of ride services companies like Uber Technologies Inc and highlight how automakers and those with roots in the tech industry are forging separate paths to build businesses enabled by self-driving cars.\nWhile Ford has a partnership with ride-hailing company Lyft, the automaker is focusing on moving goods itself for businesses large and small, Jim Farley, president of global markets, and Sherif Marakby, Ford's head of autonomous and electric vehicle development told Reuters in an interview.\n\"We're testing the business model\" for goods delivery, Farley said. Ford expects to expand delivery partners beyond Dominos Pizza and San Francisco-based Postmates, Farley said. The automaker sees small businesses as a significant potential market and a natural next step after decades of catering to commercial van and pickup buyers, he said.\nFord has not named the city where it will begin testing its approach.\nFord intends to power its self-driving cars with plug-in hybrid systems that rely on petroleum-fueled engines to extend driving range and power the electronics needed for automated driving, Farley and Marakby said.\nBut top California clean air regulator Mary Nichols had tweeted her objection to that plan last month.\n\"Earth to Ford: what part of sustainability do you not understand?\" Nichols had tweeted. \"Driverless hybrid vehicles running 24/7 delivering pizza and passengers means more tons of pollution/GHGs in cities!\"\nMarakby and Farley said the power demands from computers and sensors can cut the range of an all-electric self-driving car by half. Ford does not plan to use full electric systems until the second generation of its self-driving vehicles, Marakby said.\nGeneral Motors Co has trained its resources on developing self-driving, all-electric vehicles for use as taxis in big cities. GM has said it will begin launching robo-taxi services in cities by 2019.\nWaymo, Alphabet Inc's self-driving car unit, is launching its first public tests in the suburbs of Phoenix. Waymo is currently using hybrid minivans built by Fiat Chrysler Automobiles NV .\nToyota Motor Corp on Monday used the backdrop of the CES technology show here to outline plans to develop services for moving goods and people, and showed a prototype of a multi-purpose self-driving vehicle called ePalette that it intends to begin testing in the early 2020s.\nFord has said it will launch its own self-driving vehicles by 2021. (Reporting By Joseph White; Editing by Meredith Mazzilli)", "external_links": [], "published": "2018-01-09T19:00:00.000+02:00", "crawled": "2018-01-09T20:42:48.022+02:00", "highlightTitle": ""}