{"organizations": [], "uuid": "67b722038cc3d04e31cb15b4c0aa4aa33a6cf995", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-saudi-rises-on-royal-handouts-qatar-outperforms-idUSL8N1P207F", "country": "US", "domain_rank": 408, "title": "MIDEAST STOCKS-Saudi rises on royal handouts, Qatar outperforms", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T15:34:00.000+02:00", "replies_count": 0, "uuid": "67b722038cc3d04e31cb15b4c0aa4aa33a6cf995"}, "author": "", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-saudi-rises-on-royal-handouts-qatar-outperforms-idUSL8N1P207F", "ord_in_thread": 0, "title": "MIDEAST STOCKS-Saudi rises on royal handouts, Qatar outperforms", "locations": [], "entities": {"persons": [{"name": "andrew torchia", "sentiment": "none"}, {"name": "jarir", "sentiment": "none"}, {"name": "salman", "sentiment": "none"}], "locations": [{"name": "qatar", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "emaar", "sentiment": "none"}, {"name": "al sharq al awsat", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 1:34 PM / in 8 hours MIDEAST STOCKS-Saudi rises on royal handouts, Qatar outperforms Reuters Staff \n* Saudi handouts will limit austerity damage, not cause boom \n* Stocks in retailers strong, especially Jarir \n* PetroRabigh rises on news of Phase II start-up \n* Qatar surges ahead of dividend announcements \n* Arabtec leaps in Dubai on Emaar contract \nBy Andrew Torchia \nDUBAI, Jan 7 (Reuters) - Saudi Arabia’s stock market rose on Sunday after King Salman announced a package of handouts for Saudi citizens to compensate for rising living costs, while Qatar was the strongest market in the region ahead of dividend announcements. \nThe Saudi index gained 0.6 percent. Shares in most retail sector firms, which could benefit from the package’s boost to consumer spending power, rose with major retailer Jarir up 2.6 percent to its highest since early October. \nThe information minister was quoted by the Al Sharq Al Awsat newspaper as saying the cost of this year’s handouts, which include bonuses for state employees and the government paying value-added tax (VAT) on some items such as purchases of first homes, would total about 50 billion riyals ($13.3 bln). \nThat is about 1.9 percent of this year’s projected gross domestic product. An additional 30 billion riyals would be spent this year on a previously announced aid programme for low- and middle-income Saudis. \nThe steps are unlikely to trigger a consumer boom. Private economists have estimated the government will raise about 40 billion riyals in 2018 by introducing VAT, while gasoline price hikes that took effect this month are expected to cost consumers tens of billions of riyals. \nBut the handouts are a sign that Saudi authorities are keen to limit damage to domestic demand from this year’s austerity measures, and that rising oil prices are giving them the means to do so. \nShares in Saudi petrochemical producer PetroRabigh climbed 2.0 percent after the company said that of 12 units in its Phase II expansion, 10 had achieved production in line with specifications and the remaining two would start up in the current quarter. \nQatar’s index rose 1.4 percent on the back of stocks including Barwa Real Estate, which gained 2.9 percent, and major Islamic bank Masraf Al Rayan, up 4.3 percent. \nQatari companies, which traditionally pay high dividend yields, are due to announce fourth-quarter or annual dividends in the next few weeks, and yields may be boosted this year by the fact that stock prices have been pushed lower by the economic embargo imposed by four Arab states on Qatar. \nMarkets in the United Arab Emirates were sluggish despite strength in global equities. Indexes in Dubai and Abu Dhabi both edged up 0.2 percent although Dubai builder Arabtec, which had been trading near six-year lows, jumped 6.5 percent in its heaviest trade since July after saying one of its units had won a 250 million dirham ($68 million) contract for work from blue chip Emaar Properties. \nEgypt’s market was closed for a public holiday. HIGHLIGHTS \n* The index rose 0.6 percent to 7,318 points. DUBAI \n* The index gained 0.2 percent to 3,471 points. ABU DHABI \n* The index added 0.2 percent to 4,556 points. QATAR \n* The index surged 1.4 percent to 8,751 points. KUWAIT \n* The index climbed 0.8 percent to 6,505 points. BAHRAIN \n* The index rose 0.5 percent to 1,319 points. OMAN", "external_links": [], "published": "2018-01-07T15:34:00.000+02:00", "crawled": "2018-01-07T15:59:28.001+02:00", "highlightTitle": ""}