{"organizations": [], "uuid": "0f97256bd7e5fede0c7e60e3a507b52d1b50f3ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-southsudan-unrest/clashes-break-out-near-south-sudan-capital-in-truce-violation-idUSKBN1EU1AS", "country": "US", "domain_rank": 408, "title": "Clashes break out near South Sudan capital in truce violation", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T15:26:00.000+02:00", "replies_count": 0, "uuid": "0f97256bd7e5fede0c7e60e3a507b52d1b50f3ae"}, "author": "", "url": "https://www.reuters.com/article/us-southsudan-unrest/clashes-break-out-near-south-sudan-capital-in-truce-violation-idUSKBN1EU1AS", "ord_in_thread": 0, "title": "Clashes break out near South Sudan capital in truce violation", "locations": [], "entities": {"persons": [{"name": "lul ruai koang", "sentiment": "none"}, {"name": "kiir", "sentiment": "none"}, {"name": "salva kiir", "sentiment": "none"}, {"name": "kapur", "sentiment": "none"}, {"name": "chan garang", "sentiment": "none"}], "locations": [{"name": "south sudan", "sentiment": "none"}, {"name": "addis ababa", "sentiment": "none"}, {"name": "juba", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "spla", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sudan people’s liberation army", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JUBA (Reuters) - Clashes have broken out near South Sudan’s capital Juba between government troops and rebels, officials said on Friday, the latest violation of a ceasefire signed last month.\nThe deal reached in the Ethiopian capital Addis Ababa between the government of President Salva Kiir and a myriad of opposition groups had aimed to end a four-year-old war in which tens of thousands of people have been killed.\nBut several violations have since taken place, for which all sides have been blamed.\nOn Friday, the army’s spokesman Lul Ruai Koang said several people were killed after rebel troops attempted to seize a military outpost west of Juba held by Kiir’s Sudan People’s Liberation Army (SPLA).\n“At about 10:30 p.m. last night, bandits under the direct command of Lieutenant Colonel Chan Garang attacked the SPLA’s position at the north of Kapur,” he told a news conference, referring to a high-ranking officer who defected from the government last year.\nKoang did not give details on casualties, but said fighting was going on.\nRebels under former vice president Riek Machar, whose sacking in mid-2013 amid a power struggle triggered the civil war months later, denied any involvement and added soldiers allied with the defected official had acted on their own.\n“We have no hand in what happened in Juba last night,” said Lam Paul Gabriel, the group’s deputy spokesperson. “Those soldiers who are friends to him (Garang) decided to say enough is enough. So they did it.”\nThe violence prompted the U.S. embassy in Juba to impose a 7 p.m. curfew for unofficial travel.\nThe conflict in the world’s youngest country has been fought largely along ethnic lines, pitting forces loyal to Kiir - an ethnic Dinka - and Machar, who is Nuer. Other factions have also sprung up ever since.\nThe war has forced a third of South Sudan’s 12 million-strong population to flee their homes.\nThe ceasefire is intended to revive a 2015 peace deal that collapsed in 2016 after heavy fighting erupted in Juba, with talks on a new power-sharing arrangement and a new date for polls scheduled to follow.\nIt is also designed to allow humanitarian groups access to civilians caught in the fighting.\nNeighbouring countries who brokered that agreement have warned the warring sides that they would back punitive measures if violations persisted.\nThe United States, Britain and Norway, who form a group that supported a 2005 accord that led to South Sudan’s independence from Sudan, have also threatened to impose individual or group sanctions for those violating the ceasefire.\nAdditional reporting by Jason Patinkin; Writing by Aaron Maasho; Editing by William Maclean\n ", "external_links": [], "published": "2018-01-05T15:26:00.000+02:00", "crawled": "2018-01-05T15:38:49.003+02:00", "highlightTitle": ""}