{"organizations": [], "uuid": "e62dc9a169d9ca1233fbde1b7610e48dd694ef90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/14/104281693-IMG_0580.1910x1000.JPG", "site_section": "https://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/03/intel-says-its-working-to-fix-security-issue-promptly-and-constructively.html", "country": "US", "domain_rank": 767, "title": "Intel says it's working to fix security issue 'promptly and constructively'", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T23:28:00.000+02:00", "replies_count": 0, "uuid": "e62dc9a169d9ca1233fbde1b7610e48dd694ef90"}, "author": "Jordan Novet", "url": "https://www.cnbc.com/2018/01/03/intel-says-its-working-to-fix-security-issue-promptly-and-constructively.html", "ord_in_thread": 0, "title": "Intel says it's working to fix security issue 'promptly and constructively'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "intel", "sentiment": "negative"}, {"name": "amd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hour Ago | 01:19 \nIntel on Wednesday said it's working with AMD , ARM and software companies to resolve a security issue that was reported Wednesday. \nThe announcement comes after the Register reported that a patch for a serious security flaw in Intel chips could impact their performance. Intel stock was down as much as 6 percent on Wednesday as the report got wider attention, while AMD stock was up more than 8 percent; its chips were reported to be unaffected. \nIntel suggested that other companies' chips could also suffer from the same problem. \n\"Recent reports that these exploits are caused by a 'bug' or a 'flaw' and are unique to Intel products are incorrect,\" the company said in a statement . \"Based on the analysis to date, many types of computing devices — with many different vendors' processors and operating systems — are susceptible to these exploits.\" \nThe idea is to fix the issue \"promptly and constructively,\" the statement said. \nIn addition to affecting PCs, the vulnerability also impacts public cloud providers like Amazon Web Services, Microsoft Azure and Google Cloud Platform. They let people rent out Intel chips to run their own applications atop Windows and Linux operating systems, which are being updated, according to the Register. \nPeople should expect performance penalties in the \"single to double digits,\" noted Michael Larabel of Phoronix , who ran tests on an early release of a patched version of Linux. Gaming performance on PCs doesn't seem to be affected by the patch, while performance of databases like PostgreSQL and Redis does appear to be measurably worse, Larabel wrote. \nIntel briefly addressed performance in its statement. \n\"Contrary to some reports, any performance impacts are workload-dependent, and, for the average computer user, should not be significant and will be mitigated over time,\" the company said. \nIntel said it was planning to talk about the security issue next week, \"when more software and firmware updates will be available,\" but decided to say something now due to recent reports on the issue. \nThe entire incident could lead to charges or lawsuits for Intel, as Bernstein analyst Stacy Rasgon indicated in a Wednesday note . \nApple has been busy trying to patch the hole affecting macOS, AppleInsider reported, and Microsoft has been testing Windows updates with fixes, the Register said. \nGoogle and Microsoft declined to comment. Amazon and Apple did not respond to requests for comment. \n\"Check with your operating system vendor or system manufacturer and apply any available updates as soon as they are available,\" Intel said. Jordan Novet Technology Reporter for CNBC.com Related Securities", "external_links": ["https://www.theregister.co.uk/2018/01/02/intel_cpu_design_flaw/", "http://appleinsider.com/articles/18/01/03/apple-has-already-partially-implemented-fix-in-macos-for-kpti-intel-cpu-security-flaw", "https://newsroom.intel.com/news/intel-responds-to-security-research-findings/"], "published": "2018-01-03T23:28:00.000+02:00", "crawled": "2018-01-03T22:33:54.007+02:00", "highlightTitle": ""}