{"organizations": [], "uuid": "21b6b06390d0c5c912a10ab845db40bf135e3554", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-j-alexanderas-holdings-inc-issues-open-letter-to-shareholders.html", "country": "US", "domain_rank": 767, "title": "J. Alexander’s Holdings, Inc. Issues Open Letter to Shareholders", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.049, "site_type": "news", "published": "2018-01-16T15:30:00.000+02:00", "replies_count": 0, "uuid": "21b6b06390d0c5c912a10ab845db40bf135e3554"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-j-alexanderas-holdings-inc-issues-open-letter-to-shareholders.html", "ord_in_thread": 0, "title": "J. Alexander’s Holdings, Inc. Issues Open Letter to Shareholders", "locations": [], "entities": {"persons": [{"name": "j. alexander", "sentiment": "neutral"}], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}], "organizations": [{"name": "holdings, inc", "sentiment": "neutral"}, {"name": "ninety nine restaurant & pub", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "holdings, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Acquisition of 99 Restaurants Provides Unique Opportunity for Growth\nNASHVILLE, Tenn.--(BUSINESS WIRE)-- J. Alexander’s Holdings, Inc. (NYSE: JAX) (“J. Alexander’s”) today issued an open letter to its shareholders in connection with J. Alexander’s previously announced acquisition of Ninety Nine Restaurant & Pub (“99 Restaurants”) described in its proxy statement dated December 21, 2017.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180116005751/en/\nSee pages 60-64 of the proxy statement for information concerning the use of projections, and the use of non-GAAP financial measures Revenue and Adjusted EBITDA, as well as a reconciliation of projected Adjusted EBITDA to projected net income. (Graphic: Business Wire)\nJ. ALEXANDER’S BOARD RECOMMENDS THAT SHAREHOLDERS VOTE “FOR” THIS TRANSACTION ON THE WHITE PROXY CARD.\nDear Fellow Shareholder:\nYour Board and management have worked diligently to identify and execute opportunities to drive growth and value for your shares and we are confident that the proposed transaction with 99 Restaurants represents a significant opportunity to do so.\n99 Restaurants Continues its Solid Performance\nRecently, Cannae Holdings, Inc. (NYSE: CNNE), the majority owner and operator of 99 Restaurants, provided preliminary sales results for the fourth quarter and fiscal year ended December 31, 2017 relative to 99 Restaurants. These results confirmed our high regard for 99 Restaurants and its management. The business continues to deliver consistent, quality financial results, which help to make it unique in the $15 to $20 check average bar and grill segment. These results are driven by:\nBest in class operations , with complementary philosophies to J. Alexander’s in terms of its approach to guests and management style A stable and experienced management team , with long-tenured hourly employees A long-standing presence in the Northeast, with significant guest loyalty and strong ties to local communities built by its emphasis on good food for a fair price .\nThe combination with 99 Restaurants will not only allow the Company to achieve more rapid growth, but will also help to increase its scale of operations and better support public company and management costs.\nThis Transaction Will Drive Significant Value\nThe acquisition will create attractive value for your investment now and in the future. The combination is expected to help J. Alexander’s achieve significant revenue and earnings growth that it would not be able to achieve on a stand-alone basis. In addition, synergies realized through the combination of back-office operations are expected to create additional value.\nThe projected financial information reflected above was reviewed by our Board and reflects compound annual revenue growth of 6.4 percent and compound annual Adjusted EBITDA growth of 10.5 percent through 2021 1 .\nThese projections are considered achievable and reflect conservative assumptions on same store sales and modest increase in payroll and benefits expenses. Potential synergies could reach approximately $1.5 million to $2 million in annual positive impact on pre-tax income.\nJ. Alexander’s Board Secured Key Improvements in the Acquisition Proposal\nOver the course of the negotiations, your Board of Directors was able to achieve a number of improvements to the terms of the acquisition proposal, which included:\nA lower valuation for 99 Restaurants and a premium valuation for J. Alexander’s stock , Termination of the consulting agreement with Black Knight Advisory Services, Only one additional Board member , in William P. Foley, II, A “fiduciary out,” or the right of the Company to terminate the Merger Agreement in certain circumstances, including a superior proposal from a third party for a transaction with the Company; and A disinterested shareholder vote , which requires that, in addition to any required approvals under applicable law, the transaction is also being submitted for approval by the disinterested shareholders of the Company.\nIn short, the Company will continue to benefit from the expertise of Mr. Foley without any consulting agreement, and is allowed to terminate the Merger Agreement if any third party makes a superior offer.\nImportantly, the Company is aware this is a transaction involving conflicts of interest and, accordingly, specifically negotiated that the transaction will only proceed if disinterested shareholders vote in favor of it.\nThe J. Alexander’s Board of Directors believes this transaction will create attractive value for, and is in the best interest of, all shareholders, for reasons including:\nThe transaction is expected to be accretive to J. Alexander’s earnings per share. The acquisition presents opportunities for synergies and management estimates that potential synergies could have an annual positive impact on pre-tax income of $1.5 million to $2.0 million. The combination with 99 Restaurants will help J. Alexander’s achieve more rapid growth and increase the scale of operations.\nJ. ALEXANDER’S BOARD RECOMMENDS THAT SHAREHOLDERS VOTE “FOR” THIS TRANSACTION ON THE WHITE PROXY CARD BEFORE JANUARY 30, 2018.\nSincerely,\nThe J. Alexander’s Board of Directors\nAbout J. Alexander’s\nJ. Alexander’s Holdings, Inc. is a collection of boutique restaurants that focus on providing high quality food, outstanding professional service and an attractive ambiance. The company presently owns and operates the following concepts: J. Alexander’s, Redlands Grill, Stoney River Steakhouse and Grill and Lyndhurst Grill. J. Alexander’s Holdings, Inc. has its headquarters in Nashville, Tennessee. To learn more about J. Alexander’s, please visit www.jalexandersholdings.com .\nCAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS\nIn connection with the safe harbor established under the Private Securities Litigation Reform Act of 1995, J. Alexander’s Holdings, Inc. (the “Company,” “J. Alexander’s” or “JAX”) cautions that certain information contained or incorporated by reference in this document and its filings with the Securities and Exchange Commission (the “SEC”), in its press releases and in statements made by or with the approval of authorized personnel is forward-looking information that involves risks, uncertainties and other factors that could cause actual results to differ materially from those expressed or implied by the forward-looking statements contained herein. Forward-looking statements discuss the Company’s current expectations and projections relating to our financial condition, results of operations, plans, objectives, future performance and business. Forward-looking statements are typically identified by words or phrases such as “may,” “will,” “would,” “can,” “should,” “likely,” “anticipate,” “potential,” “estimate,” “pro forma,” “continue,” “expect,” “project,” “intend,” “seek,” “plan,” “believe,” “target,” “outlook,” “forecast,” the negatives thereof and other words and terms of similar meaning in connection with any disc", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.jalexandersholdings.com&esheet=51743440&newsitemid=20180116005751&lan=en-US&anchor=investor.jalexandersholdings.com&index=3&md5=ae53eddc096553500b846ce20937a0a1", "http://www.businesswire.com/news/home/20180116005751/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.jalexandersholdings.com&esheet=51743440&newsitemid=20180116005751&lan=en-US&anchor=www.jalexandersholdings.com&index=1&md5=b40e65fd63c56bf54f1d166d147efd5a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51743440&newsitemid=20180116005751&lan=en-US&anchor=www.sec.gov&index=2&md5=b41aa8882ed1b8a7392b409b1fca9bcb"], "published": "2018-01-16T15:30:00.000+02:00", "crawled": "2018-01-16T16:16:16.018+02:00", "highlightTitle": ""}