{"organizations": [], "uuid": "ebcafb682442879991d344bff5e416859ee00bed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/germany-banks-lobbying/german-savings-banks-lobby-state-govts-with-debt-buys-ecb-study-idUSL8N1P63AB", "country": "US", "domain_rank": 408, "title": "German savings banks lobby state govts with debt buys: ECB study", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T21:03:00.000+02:00", "replies_count": 0, "uuid": "ebcafb682442879991d344bff5e416859ee00bed"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/germany-banks-lobbying/german-savings-banks-lobby-state-govts-with-debt-buys-ecb-study-idUSL8N1P63AB", "ord_in_thread": 0, "title": "German savings banks lobby state govts with debt buys: ECB study", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT, Jan 11 (Reuters) - Germany’s politically controlled savings banks may be using debt purchases as a way to lobby their regional state government when a rival party comes to power, a study by a European Central Bank economist said on Thursday.\nThe paper, which looks at the relationship between Germany’s 16 federal states and banks owned by lower levels of government, comes as Chancellor Angela Merkel’s conservatives and their Social Democrats (SPD) partners are locked in talks to renew their ruling coalition.\nIt found that savings banks, nearly always in the hands of either the conservatives or the SPD, buy more bonds from their home state after an election brings to power the opposing party.\nThe author said this suggested bond purchases were a form of “lobbying” that can divert resources from more productive use and strengthen a vicious circle between governments and banks.\n“We argue that in the wake of a post-election loss of political connections along party lines, local government-owned banks use purchases of sub-sovereign bonds to keep communication channels with state politicians open, a mechanism akin to lobbying,” Alexander Popov said in his study.\nPopov found that the average savings bank increased its holding of home state bonds to 2 percent of its total assets in the three years after an election that resulted in a “political misalignment” between county and state governments, from 1 percent before the vote.\nBy contrast, banks in counties governed by the same party that runs the state kept their holding roughly stable.\n“This strongly suggests that incumbent politicians on the supervisory boards of local government-owned banks prompt the banks in question to buy more bonds issued by their home state in reaction to losing political proximity to the state government,” Popov said.\nGermany’s 16 federal states typically sell their bonds directly to banks via private placements, which Popov says give bankers a chance to have direct access to policymakers and possibly offer them preferential terms.\nThe study is based on data from 455 government-owned banks around 32 state parliament and 600 county council elections between 2005 and 2013. (Reporting By Francesco Canepa; Editing by Gareth Jones)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T21:03:00.000+02:00", "crawled": "2018-01-12T18:51:48.076+02:00", "highlightTitle": ""}