{"organizations": [], "uuid": "49dfadd4568f55ebffb531b86e2bb04da09bc777", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/legal", "section_title": "Legal News | Reuters", "url": "https://www.reuters.com/article/legal-us-otc-katz/the-2nd-circuit-wants-you-to-be-able-to-test-cutting-edge-legal-theories-idUSKBN1FJ2PQ", "country": "US", "domain_rank": 408, "title": "The 2nd Circuit wants you to be able to test cutting-edge legal theories", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T03:34:00.000+02:00", "replies_count": 0, "uuid": "49dfadd4568f55ebffb531b86e2bb04da09bc777"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/legal-us-otc-katz/the-2nd-circuit-wants-you-to-be-able-to-test-cutting-edge-legal-theories-idUSKBN1FJ2PQ", "ord_in_thread": 0, "title": "The 2nd Circuit wants you to be able to test cutting-edge legal theories", "locations": [], "entities": {"persons": [{"name": "nelson roman", "sentiment": "negative"}, {"name": "nance hutter", "sentiment": "none"}, {"name": "stephen katz", "sentiment": "none"}, {"name": "hutter", "sentiment": "none"}, {"name": "katz", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "white plains", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "2nd circuit", "sentiment": "negative"}, {"name": "countrywide", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - U.S. District Judge Nelson Roman of White Plains, New York, was thoroughly fed up with Westchester homeowner Nance Hutter and her lawyer, Stephen Katz , when he issued a decision finding them liable for Rule 11 sanctions in August 2014.\nHutter had defaulted on a $1.8 million refinanced mortgage for her house. In three successive complaints, she claimed her mortgage brokers, Watermark Capital and Evolution Mortgage, and her lender, Countrywide, had misled her about the terms of the loan. Years into the litigation, after the close of discovery, Hutter and Katz asked to file a fourth amended complaint to add or reinstate some individual defendants and to add a new claim. Countrywide opposed the motion to amend and moved for sanctions under Rule 11 of the Federal Rules of Civil Procedure, arguing that Hutter’s claims were contrary to the evidence and Katz was asserting legally frivolous arguments.\nJudge Roman agreed. He rejected the amended complaint and granted the motion for Rule 11 sanctions, lacing into Katz, in particular, for his slippery grasp of the facts and for ever-shifting theories. “The court is baffled by Katz’s inconsistent arguments in his motion filings,” the judge wrote. Among other theories, Katz claimed that Hutter had a private right of action under a provision of New York Banking Law that bars unlicensed brokers from arranging loans. Judge Roman said Katz’s theory was utterly unfounded. “Katz’s assertion that plaintiff may assert a right of action … on the basis that other courts have read implicit rights of action into statutes lacks legal support,” the judge wrote. “Katz cites to no legal authority to support his contention.”\nIn a followup ruling, Judge Roman held Katz liable for all of Countrywide’s costs in defeating the motion to amend Hutter’s complaint: $25,000. (Hutter was sanctioned only $100. She went on to lose on summary judgment to Countrywide and Evolution. After Katz withdrew as her counsel, she settled with Watermark.)\nKatz appealed. In his brief to the 2nd U.S. Circuit Court of Appeals , he contended the “basically consistent” evidence from Hutter and her husband supported the proposed amendments that prompted Countrywide to seek sanctions. “The proposed amendments to Hutter’s complaint were based on sufficient evidence and on sufficiently adequate legal theory to avoid being classified as frivolous or objectively unreasonable,” Katz wrote.\nHe also said – and here’s why you should care about this case – that he was improperly sanctioned for testing the bounds of state banking law with a theory he pressed in good faith. The 2nd Circuit itself, Katz wrote, has said in 2000’s Salovaara v. Eckert that lawyers can be acting in good faith even if there’s only one case from another jurisdiction that backs their position. “Katz cited and legitimately relied on (a) New York banking regulation,” Katz’s brief said. “As a result, a good faith basis existed to support Katz’s legal argument.”\nOn Friday, the 2nd Circuit said Katz is right! In a summary order from Judges Pierre Leval and Jose Cabranes (after Judge Guido Calabresi recused himself), the appeals court upheld the Rule 11 sanctions against Hutter and Katz for alleging unfounded facts. But it tossed the sanction on Katz for asserting a baseless legal theory.\n“The award of fees here would risk deterring others from advancing novel theories ‘in good faith for fear that they would be saddled with their adversary’s fees in addition to their own in the event that they failed to prevail,’” the 2nd Circuit said, citing the Salovaara decision Katz mentioned in his brief. “We vacate that portion of the order imposing sanctions against Katz for arguing that there is an implied private right of action” under New York banking law.\nThe order, which was first reported by Law.com, is not precedential, so don’t go crazy. But if you’re a bold litigator pushing the edges of precedent, it’s good to know the 2nd Circuit has your back.\nI left phone messages for Katz and for Countrywide counsel Kenneth Rudd of Zeichner Ellman & Krause but didn’t hear back.\nThe views expressed in this article are not those of Reuters News.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "https://www.law.com/litigationdaily/sites/newyorklawjournal/2018/01/29/second-circuit-finds-sanctioning-over-a-novel-legal-theory-could-have-chilling-effect/?et=&bu=&cn=&src=&pt="], "published": "2018-01-31T03:34:00.000+02:00", "crawled": "2018-01-31T04:46:26.011+02:00", "highlightTitle": ""}