{"organizations": [], "uuid": "80931dae16600a48d61875e6e7c5fc6db2241e44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 20, "shares": 20, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/09/103856171-RTSFRMG.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/us-stocks-amd-intel-trump-fed.html", "country": "US", "domain_rank": 767, "title": "Nasdaq opens higher as chip stocks rise", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.116, "site_type": "news", "published": "2018-01-03T16:30:00.000+02:00", "replies_count": 0, "uuid": "80931dae16600a48d61875e6e7c5fc6db2241e44"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/03/us-stocks-amd-intel-trump-fed.html", "ord_in_thread": 0, "title": "Nasdaq opens higher as chip stocks rise", "locations": [], "entities": {"persons": [{"name": "katie stockton", "sentiment": "none"}, {"name": "brendan mcdermid", "sentiment": "none"}], "locations": [], "organizations": [{"name": "advanced micro devices", "sentiment": "negative"}, {"name": "cnbc.com shares  chip", "sentiment": "neutral"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "nvidia", "sentiment": "none"}, {"name": "amd", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}, {"name": "btig", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. stocks rose to all-time highs Wednesday as a gain in chip stocks propelled the tech sector higher.\nThe Nasdaq composite jumped 0.6 percent, with Advanced Micro Devices surging more than 8 percent.\nThe S&P 500 also posted an all-time high, advancing 0.5 percent with tech rising 0.9 percent. The index also broke above 2,700 for the first time. The Dow Jones industrial average traded 40 points higher and also hit a record.\n\"The 2017 trends are continuing in 2018,\" said Adam Sarhan, CEO of 50 Park Investments. \"You're seeing a lot of money flowing back into the semiconductors\" after some profit-taking at the end of last year.\nThe VanEck Vectors Semiconductor exchange-traded fund (SMH) easily outperformed the broader market last year. It rose 36.5 percent while the S&P 500 gained 19.4 percent.\nThe Register reported there is a security flaw with Intel processors. The report said the issue will require a significant security update of Linux and Microsoft Windows operating systems to work around it. AMD shares jumped on the back of the report.\nNvidia 's stock climbed 5.9 percent, following AMD's gains. Intel shares, meanwhile, declined more than 5.9 percent.\nBrendan McDermid | Reuters A trader on the floor of the New York Stock Exchange. Investors largely shrugged off a tweet from President Donald Trump about North Korea's Kim Jong-Un. Trump tweeted on Tuesday that his \"nuclear button\" was \"much bigger and more powerful\" than the one controlled by the North Korean leader.\nTweet\n\"The market has sort of priced in this kind of banter,\" said Jeff Zipper, managing director of investments at U.S. Bank Private Wealth Management. He also noted investors may be numb to these tweets \"because they've become somewhat daily.\"\nStocks also got a boost from strong economic data. The ISM manufacturing index hit 59.7 percent in December, while construction spending rose 0.8 percent in November. The Atlanta Federal Reserve raised its fourth-quarter real GDP forecast to 3.2 percent from 2.8 percent, citing the strong ISM number.\nThe Federal Reserve also released a summary of its December meeting. The minutes showed that changes to the federal tax code pushed the central bank to raise its economic forecast. President Trump signed a bill last month that revamped the U.S. tax code.\nIn corporate news, Scana shares popped 23 percent after Dominion Energy announced it was buying the South Carolina-based utility company for $7.9 billion .", "external_links": [], "published": "2018-01-03T16:30:00.000+02:00", "crawled": "2018-01-03T16:36:18.000+02:00", "highlightTitle": ""}