{"organizations": [], "uuid": "4b90f7300c30b80c76e4fd2a3064f720c850b6a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-kerber/update-1-tennis-kerber-thrashes-sharapova-to-reach-fourth-round-idUKL3N1PF07K", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Tennis-Kerber thrashes Sharapova to reach fourth round", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T14:04:00.000+02:00", "replies_count": 0, "uuid": "4b90f7300c30b80c76e4fd2a3064f720c850b6a8"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-kerber/update-1-tennis-kerber-thrashes-sharapova-to-reach-fourth-round-idUKL3N1PF07K", "ord_in_thread": 0, "title": "UPDATE 1-Tennis-Kerber thrashes Sharapova to reach fourth round", "locations": [], "entities": {"persons": [{"name": "sharapova", "sentiment": "negative"}, {"name": "martyn herman", "sentiment": "none"}, {"name": "angelique kerber", "sentiment": "none"}, {"name": "serena williams", "sentiment": "none"}, {"name": "maria sharapova", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "kerber", "sentiment": "none"}, {"name": "anastasija sevastova", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 12:08 PM / Updated 22 minutes ago UPDATE 1-Tennis-Kerber thrashes Sharapova to reach fourth round Reuters Staff \n* Kerber sends message with easy win over Sharapova \n* Claimed victory in 64 minutes (Adds details, quotes) \nBy Martyn Herman \nMELBOURNE, Jan 20 (Reuters) - Maria Sharapova’s hopes of a title-winning return to the Australian Open were unceremoniously crushed by Angelique Kerber as the battle of the former champions ended 6-1 6-3 in the German’s favour on Saturday. \nThe Rod Laver Arena evening clash between the only two grand slam winners left in the women’s draw had the feel of a showpiece final rather than a third-round match-up but only 21st seed Kerber rose to the occasion. \nUnseeded Russian Sharapova, back in Melbourne after testing positive for a banned substance following her quarter-final defeat by Serena Williams here in 2016, which resulted in a 15-month ban, had looked menacing in the opening two rounds. \nBut the form she showed in beating 14th seeded Latvian Anastasija Sevastova deserted her. \nKerber, who plummeted down the rankings last year after finishing the previous campaign at number one, broke Sharapova’s serve in the first game of the match and that set the tone. \nThe German made only seven unforced errors in the 64-minute contest and, on the court on which she stunned Serena Williams to win the title two years ago, celebrated victory with the look of a woman who firmly believes she is back in business. \n”Of course this was quite a big match,“ Kerber, who began working with new coach Wim Fissette at the end of last year, told reporters. ”Maria is a champion. She’s always dangerous, especially at the grand slams. \n“But I was really trying to not think about everything around and everything about the match, about against who I was playing. I was just more trying to go out on the special court for me and play good tennis.” ERRATIC SHARAPOVA \nKerber streaked away with the first set, aided by the erratic nature of Sharapova’s game, and although the 2008 champion briefly threatened a fightback after falling behind in the second, it was not to be the Russian’s night. \nAn error-prone Sharapova double-faulted on the way to dropping serve to trail 0-2 in the second set. \nThe Russian replied with a break of her own and when she slapped a running forehand winner down the line to make it 2-2 it appeared battle was truly about to commence. \nAlarm bells were ringing for Kerber when Sharapova rifled away a backhand winner to earn a break point at 3-3 but the Russian missed a regulation forehand to waste the chance. \nFour unforced errors, including a flimsy attempt at a drop shot at 15-30, allowed 2016 champion Kerber a break and some breathing space and the German finished the contest with ease. \nSharapova, playing only her second grand slam since returning from her doping suspension, took it on the chin. \n“I don’t want to take anything away from her and the way she played. I think she played extremely well,” said the Russian. \n“She was the more aggressive player. She took a lot more risks than I did. I didn’t return well. I gave her the confidence by making a lot of errors on the return games.” \nKerber will face either 26th seed Agnieszka Radwanska or Hsieh Su-Wei of Taiwan in the next round. (Reporting by Martyn Herman; Editing by Sudipto Ganguly and Ken Ferris)", "external_links": [], "published": "2018-01-20T14:04:00.000+02:00", "crawled": "2018-01-20T14:33:05.049+02:00", "highlightTitle": ""}