{"organizations": [], "uuid": "09e955cfe84f4bbf2b4f3a4a5ee13dea59cb4db0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-biostem-technologies-inc-announces-new-board-member-dr-jennie-sandqvist.html", "country": "US", "domain_rank": 767, "title": "BioStem Technologies Inc. Announces New Board Member, Dr. Jennie Sandqvist", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T18:05:00.000+02:00", "replies_count": 0, "uuid": "09e955cfe84f4bbf2b4f3a4a5ee13dea59cb4db0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-biostem-technologies-inc-announces-new-board-member-dr-jennie-sandqvist.html", "ord_in_thread": 0, "title": "BioStem Technologies Inc. Announces New Board Member, Dr. Jennie Sandqvist", "locations": [], "entities": {"persons": [{"name": "jennie sandqvist", "sentiment": "negative"}, {"name": "sandqvist", "sentiment": "none"}], "locations": [{"name": "fl", "sentiment": "none"}, {"name": "pompano beach", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "ft lauderdale", "sentiment": "none"}, {"name": "stockholm", "sentiment": "none"}], "organizations": [{"name": "biostem technologies, inc.", "sentiment": "neutral"}, {"name": "biostem technologies inc", "sentiment": "neutral"}, {"name": "semmelweis medical school", "sentiment": "none"}, {"name": "institute for functional medicine", "sentiment": "none"}, {"name": "company’s board of directors and audit committee", "sentiment": "none"}, {"name": "karolinska university hospital", "sentiment": "none"}, {"name": "mih clinic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Pompano Beach, FL, Jan. 24, 2018 (GLOBE NEWSWIRE) -- BioStem Technologies, Inc. (OTC PINK: BSEM) (“BSEM” or “Company”) announced today that Dr. Jennie Sandqvist has joined the Company’s Board of Directors and Audit Committee. Dr. Sandqvist is a leading neurologist in Sweden, but maintains a residence in Ft Lauderdale and has been involved with the Company for more than a year as a shareholder and advisor.\nDr. Sandqvist has a medical degree from Semmelweis Medical School in Hungary, with a specialty in neurology. She served as Chief of Neurology at the Karolinska University Hospital in Stockholm, Chief of Neurology at the Neurological Rehab Station in Stockholm, and is currently the Founder and CEO of the Mih Clinic in Stockholm. She studied at the Institute for Functional Medicine in Stockholm, Sweden in 2016 and subspecialized in spinal cord injuries and psychiatry. Dr. Sandqvist is the author of over 100 meeting abstracts on a range of topics that include brain tumors, epilepsy, stroke, multiple sclerosis, degenerative neurological diseases, ALS, interventional/intraluminal stroke treatments and spinal cord injuries. She speaks five languages (Swedish, English, French, Hungarian, and Norwegian) and is licensed to practice medicine in Sweden, Norway and Hungary.\nAbout BioStem Technologies, Inc. (OTC PINK: BSEM): BioStem Technologies, Inc. is a global life sciences corporation, providing innovative technologies with a concentration in Pharmaceuticals and Regenerative Medicine. The Company’s mission is to discover, develop and produce the most effective Pharmaceutical and Regenerative Medicine products in the world. The Company is comprised of a diverse group of scientists, physicians, and entrepreneurs who collaborate to create innovative products. These technologies improve the Quality of Life for our patients and, as a result, drive shareholder value.\nForward-Looking Statements: Except for statements of historical fact, the matters discussed in this press release are forward looking and made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. \"Forward-looking statements\" describe future expectations, plans, results, or strategies and are generally preceded by words such as \"future,\" \"plan\" or \"planned,\" \"expects,\" believe\" or \"projected.\" These forward-looking statements reflect numerous assumptions and involve a variety of risks and uncertainties, many of which are beyond the company's control that may cause actual results to differ materially from stated expectations. These risk factors include, among others, limited operating history, difficulty in developing, exploiting and protecting proprietary technologies, intense competition and additional risks factors as discussed in reports filed by the company with OTC Markets.\nBioStem Technologies, Inc. Phone: 954-380-8342 Website: http://www.biostemtech.com Email: info@biostemtech.com Twitter: @Biostemtech Facebook: BioStem Technologies Investor Relations: Andrew Van Vurst info@biostemtech.com (954) 380-8342\nSource:BioStem Technologies, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/5b57a48d-be58-42e8-90b9-1092f9d943c7"], "published": "2018-01-24T18:05:00.000+02:00", "crawled": "2018-01-24T19:29:15.007+02:00", "highlightTitle": ""}