{"organizations": [], "uuid": "5166bf8cbd6551f526a9d1f52c3e8d5bb4c3212b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-exonics-therapeutics-appoints-roger-m-perlmutter-m-d-ph-d-to-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Exonics Therapeutics Appoints Roger M. Perlmutter, M.D., Ph.D., to Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:00:00.000+02:00", "replies_count": 0, "uuid": "5166bf8cbd6551f526a9d1f52c3e8d5bb4c3212b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-exonics-therapeutics-appoints-roger-m-perlmutter-m-d-ph-d-to-board-of-directors.html", "ord_in_thread": 0, "title": "Exonics Therapeutics Appoints Roger M. Perlmutter, M.D., Ph.D., to Board of Directors", "locations": [], "entities": {"persons": [{"name": "roger m. perlmutter", "sentiment": "negative"}, {"name": "roger", "sentiment": "none"}, {"name": "david goeddel", "sentiment": "none"}, {"name": "perlmutter", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "exonics therapeutics, inc.", "sentiment": "neutral"}, {"name": "merck research laboratories", "sentiment": "none"}, {"name": "amgen", "sentiment": "none"}, {"name": "amgen, inc.", "sentiment": "none"}, {"name": "merck", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass., Jan. 30, 2018 (GLOBE NEWSWIRE) -- Exonics Therapeutics, Inc., a biotechnology company focused on developing SingleCut CRISPR technology to repair mutations causing Duchenne muscular dystrophy and other neuromuscular diseases, today announced the appointment of Roger M. Perlmutter, M.D., Ph.D., to its board of directors.\nDr. Perlmutter brings extensive biopharmaceutical research and development experience to Exonics’ board. Since 2013, Dr. Perlmutter has served as executive vice president of Merck and president of Merck Research Laboratories. From January 2001 to February 2012, Dr. Perlmutter led Amgen, Inc.’s research and development efforts as executive vice president and head of R&D. Before joining Amgen, he held roles of increasing responsibility in Merck’s research organization, including executive vice president of worldwide basic research and preclinical development.\n“We are thrilled to welcome Roger to Exonics’ board of directors,” said David Goeddel, Ph.D., chairman of the board of Exonics. “Roger’s world-class R&D expertise will be invaluable as Exonics continues growing its research organization and translating its gene repair technology into a transformative therapy for Duchenne muscular dystrophy, a devastating disease for which there is no cure.”\n“In preclinical studies, Exonics’ SingleCut CRISPR technology has demonstrated the potential to repair many of the gene mutations that cause Duchenne,” said Dr. Perlmutter. “I look forward to working with the board and contributing to the advancement of this technology to the clinic and to patients with genetic neuromuscular diseases.”\nFrom 1991 to 1997, Dr. Perlmutter was a professor in the Departments of Immunology, Biochemistry and Medicine at the University of Washington, where he also served as chairman of the Department of Immunology and was a Howard Hughes Medical Institute investigator. He is a Fellow of the American Academy of Arts and Sciences and an elected Fellow of the American Association for the Advancement of Science. Dr. Perlmutter is a graduate of Reed College and received his M.D. and Ph.D. degrees from Washington University (St. Louis). He previously served on the boards of Ablynx, Inc., Heptares, Ltd (purchased by Sosei Group in 2015), Immune Design Corporation, and Stem Cells, Inc., and is a Science Partner at The Column Group.\nAs part of this transition, Cristina Csimma, PharmD, MHP, John Edwards, MBA, and Debra Miller will depart from Exonics’ board. Dr. Csimma will serve as a senior advisor to the company.\nMr. Ripple added, “We extend our sincere gratitude to Cristina, John and Debra for their service and contributions to the board, as they each played an important role in building Exonics’ corporate and scientific foundation.\"\nAbout Exonics Therapeutics\nExonics Therapeutics has developed SingleCut CRISPR, a gene repair technology that has the potential to effectively halt the progression of certain genetic neuromuscular diseases. In multiple Duchenne muscular dystrophy preclinical models, Exonics has used SingleCut CRISPR to genetically repair and restore dystrophin, the key protein missing in children with Duchenne. Exonics is initially focused on correcting mutations that cause Duchenne in order to develop a therapy to treat many children with the devastating disease, for which there is no cure. Exonics’ technology is licensed from the University of Texas Southwestern Medical Center and is based on the research of Eric Olson, Ph.D., Exonics’ founder and chief science advisor. Exonics is located in Cambridge, Mass. For more information, please visit www.exonicstx.com .\nMedia Contact\nHeather Anderson\n6 Degrees\n980-938-0260\nhanderson@6degreespr.com\nSource: Exonics Therapeutics", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/3a201b42-a46c-4e99-8ce5-068513b804c4", "https://www.globenewswire.com/Tracker?data=gHaBRIefLtnx59j4r3tlPskIzHu3fefk00SwBVG-pNzwvv9maUjbiMHPsyvzbSYjcGt3HHqKqd1j1wrpBh48iA==", "https://www.globenewswire.com/Tracker?data=tuBw8hVhsJ1up2b47-KEXCvMpwUov1rQGQuWpqzi-NeBNK6ZJs6AHTko9AWd9FMdP3tHAy-LQMpGCJO-IMGVwpztoJ_tPG8EPNChjezIMGqmZCE5YY7chd7LRFGeHtJWHeQcNuvPKGxlZvyDT7Y-Q_TrMLcLoM-6ZqfOSnC4LiXEOmNO6zm2NyAWZOjFZZt3JpKOUJ_33LFGqwjIVrZ5pb_8LylKDZX4ySMxDQSE0FztnpUGQaG4kjEGsA1EWWK9ukIscgAkhnF_6_xmMFn6Lw==", "https://www.globenewswire.com/Tracker?data=hO8sr-PJOaxgYKGDdJQoyvQJDxkUPjMUx3aF_MffskGTbGlYwOK5-vukB1q-sVCKu8qY6Oz5RQuzhg3yC_mhixIDD3H71iaoh2uRKoNq7vU="], "published": "2018-01-30T16:00:00.000+02:00", "crawled": "2018-01-30T17:51:12.029+02:00", "highlightTitle": ""}