{"organizations": [], "uuid": "cafc0e3168e5bc7ae5860932c567a769741da8b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222661427&w=1200&r=LYNXMPEE0G0EW", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-czech-government/czech-government-approves-resignation-after-losing-confidence-vote-idUSKBN1F60RX", "country": "US", "domain_rank": 408, "title": "Czech government approves resignation after losing confidence vote", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T10:00:00.000+02:00", "replies_count": 0, "uuid": "cafc0e3168e5bc7ae5860932c567a769741da8b7"}, "author": "", "url": "https://www.reuters.com/article/us-czech-government/czech-government-approves-resignation-after-losing-confidence-vote-idUSKBN1F60RX", "ord_in_thread": 0, "title": "Czech government approves resignation after losing confidence vote", "locations": [], "entities": {"persons": [{"name": "andrej babis", "sentiment": "none"}, {"name": "robert muller", "sentiment": "none"}, {"name": "milos zeman", "sentiment": "none"}, {"name": "toby chopra", "sentiment": "none"}], "locations": [{"name": "babis", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRAGUE (Reuters) - The Czech government led by Prime Minister Andrej Babis agreed to resign on Wednesday after the minority cabinet lost a confidence vote a day earlier.\nThe government will remain in office in a caretaker capacity after the compulsory step, pending negotiations on forming an alternative administration that could take weeks or months as parties shun Babis while he battles allegations he abused an EU subsidy program a decade ago as a businessman.\n“The government approved its resignation and I will ask for an appointment with the president so that I can deliver the resignation personally,” Babis said.\nPresident Milos Zeman has said he will give Babis another go at forming a government.\nThe president’s spokesman said Zeman would accept the resignation by the end of the working week.\nPolice allege Babis, the country’s second-richest person, hid ownership of one of his companies a decade ago to win a 2 million euro subsidy, mostly from European Union funds, meant for small businesses. He denies wrongdoing.\nCzech Prime Minister Andrej Babis (2nd L) attends a parliamentary session during a confidence vote for the newly appointed government he leads, in Prague, Czech Republic January 16, 2018. REUTERS/David W Cerny He was charged in the case but regained immunity from prosecution when he won a lower house seat in an October general election in which his ANO party was the winner by a wide margin but failed to reach a majority.\nParliament will decide whether to lift Babis’ immunity on Friday.\nThe other eight parties in parliament have so far rejected any form of cooperation with ANO, though its decisive victory means it is almost certain to be in any viable government, with or without Babis at the helm.\nSeveral parties have signaled they might discuss governing with ANO, especially if Babis was not prime minister, a condition he has so far refused to meet.\nGovernment talks could also drag on because of the possible departure of Zeman as president, whose reelection bid is facing a formidable challenger in academic Jiri Drahos.\nCzechs votes in the second, decisive round of the presidential election on Jan. 26-27.\nReporting by Robert Muller; Editing by Toby Chopra\n ", "external_links": [], "published": "2018-01-17T10:00:00.000+02:00", "crawled": "2018-01-17T10:15:31.004+02:00", "highlightTitle": ""}