{"organizations": [], "uuid": "f56ebb4a5612f3b7b3bf5dc05feaa079b0392332", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://bizdailies.com/News/Rss", "section_title": "Biz Dailies: Business and Financial News Feed", "url": "https://www.cnbc.com/2018/01/07/reuters-america-precious-gold-prices-firm-amid-higher-u-s-rate-hike-environment.html", "country": "US", "domain_rank": 767, "title": "PRECIOUS-Gold prices firm amid higher U.S. rate hike environment - CNBC", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T03:20:00.000+02:00", "replies_count": 0, "uuid": "f56ebb4a5612f3b7b3bf5dc05feaa079b0392332"}, "author": "", "url": "https://www.cnbc.com/2018/01/07/reuters-america-precious-gold-prices-firm-amid-higher-u-s-rate-hike-environment.html", "ord_in_thread": 0, "title": "PRECIOUS-Gold prices firm amid higher U.S. rate hike environment - CNBC", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "hour ago reuters", "sentiment": "negative"}, {"name": "cme group", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRECIOUS-Gold prices firm amid higher U.S. rate hike environment Published 1 Hour Ago Reuters SHARES \nJan 8 (Reuters) - Gold prices held steady on early Monday, below 3-1/2-month highs hit last week, amid expectations of more U.S. interest rate hikes this year. \nFUNDAMENTALS \n* Spot gold was mostly unchanged at $1,322.73 an ounce at 0059 GMT. Last week, prices touched their highest since Sept. 15 at $1,325.86. \n* U.S. gold futures were also mostly unchanged at $1,322 an ounce. \n* Spot gold rose for a fourth straight week last week. \n* The U.S. December non-farm payrolls report on Friday was weaker than expected. The dollar dipped briefly, then rose as investors reckoned the data would not deter the U.S. Federal Reserve from raising interest rates multiple times this year, though at a gradual pace. \n* Despite weaker-than-expected data, traders overall stuck to their conviction that the Federal Reserve will raise rates at least twice this year, a Reuters analysis of fed funds futures contracts traded at CME Group suggested. \n* Gold is highly sensitive to rising U.S. interest rates, as these increase the opportunity cost of holding non-yielding bullion, while boosting the dollar, in which it is priced. \n* China gold reserves were at 59.240 million fine troy ounces at end-Dec, unchanged vs end-Nov, the central bank said on Sunday. \n* China's foreign exchange reserves rose to their highest in more than a year in December and grew at a faster-than-expected pace, as tight regulations and a strong yuan continued to discourage capital outflows, data showed on Sunday. \n* Holdings of SPDR Gold Trust , the world's largest gold-backed exchange-traded fund, fell 0.14 percent to 834.86 tonnes on Friday from 836.04 tonnes on Thursday. \n* Hedge funds and money managers raised their net long positions in COMEX gold and copper contracts in the week to Jan. 2, U.S. Commodity Futures Trading Commission (CFTC) data showed on Friday. \n* China's Shanghai Futures Exchange will adjust the last trading date for February delivery contracts to Feb. 9, in a bid to avoid public holiday for the Chinese lunar new year, the bourse said in a statement on Friday. \n* Physical gold demand across Asia remained subdued last week as prices rallied to a three-and-a-half-month high, keeping retail buyers away from the market. \n* Asian shares neared all-time peaks on Monday after Wall Street boasted its best start to a year in over a decade, with brisk economic growth and benign inflation proving a potent cocktail for risk appetite. \n(Reporting by Nallur Sethuraman in Bengaluru; Editing by Sunil Nair)", "external_links": [], "published": "2018-01-08T03:20:00.000+02:00", "crawled": "2018-01-08T04:40:46.025+02:00", "highlightTitle": ""}