{"organizations": [], "uuid": "2a8c1136ab6c7cb7c3689faaffe04dc0e0cabd38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104934599-GettyImages-163775787.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/after-hours-buzz-agn-urbn-more.html", "country": "US", "domain_rank": 767, "title": "After-hours buzz: AGN, URBN & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.879, "site_type": "news", "published": "2018-01-09T00:15:00.000+02:00", "replies_count": 0, "uuid": "2a8c1136ab6c7cb7c3689faaffe04dc0e0cabd38"}, "author": "Chloe Aiello", "url": "https://www.cnbc.com/2018/01/08/after-hours-buzz-agn-urbn-more.html", "ord_in_thread": 0, "title": "After-hours buzz: AGN, URBN & more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Check out the companies making headlines after the bell Monday :\nAllergan rose close to 1 percent in the extended session. The pharmaceutical company released fiscal 2018 outlook that projects continued cost cuts and an $0.84 loss per share. Allergan Chairman and CEO Brent Saunders attributed the weak data to \"loss of exclusivity revenue headwinds in 2018.\" After losing about 20 percent in 2017, Allergan shares are up more than 4 percent in the new year.\nUrban Outfitters reported disappointing holiday sales that sent shares falling more than 6 percent after the bell. The lifestyle retailer, which owns brands, like Anthropologie and Free People, reported disappointing holiday sales numbers. The company saw year-over-year same store sales fall about 1 percent, and double-digit sales in the direct-to-consumer channel that was offset by negative sales in-stores.\nAfter posting a 7.1 percent increase during regular trading, Seagate stock climbed an additional 2 percent in the extended session before flattening. The hardware technology company announced second quarter financial guidance, including revenue, gross margin and shipment estimates, that beat analyst expectations. Seagate also announced completion of long-term supply deal with Toshiba .\nShares of A. Schulman gained more than 5 percent in the after-hours session, on relatively volume. The plastics manufacturing company reported first quarter financial results that included 12 percent growth in net sales year-over-year.", "external_links": [], "published": "2018-01-09T00:15:00.000+02:00", "crawled": "2018-01-09T09:35:32.105+02:00", "highlightTitle": ""}