{"organizations": [], "uuid": "d295d901f96aa95fbf3a78ecc229ab17e13c04be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222417724&w=1200&r=LYNXMPEE0F0JD", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-britain-eu-tusk/eu-still-open-to-britain-changing-mind-on-brexit-idUSKBN1F50WX", "country": "US", "domain_rank": 408, "title": "UPDATE 1-EU still open to Britain changing mind on Brexit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:34:00.000+02:00", "replies_count": 0, "uuid": "d295d901f96aa95fbf3a78ecc229ab17e13c04be"}, "author": "", "url": "https://www.reuters.com/article/us-britain-eu-tusk/eu-still-open-to-britain-changing-mind-on-brexit-idUSKBN1F50WX", "ord_in_thread": 0, "title": "UPDATE 1-EU still open to Britain changing mind on Brexit", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "gilbert reilhac", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "donald tusk", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "min read  strasbourg", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 9:20 AM / Updated 31 minutes ago EU still open to Britain changing mind on Brexit Gilbert Reilhac 4 Min Read \nSTRASBOURG (Reuters) - Leaders of the European Union institutions weighed into a new British debate on whether to hold a second referendum on Brexit by saying on Tuesday that Britons would be welcome to stay in the EU. \nPrime Minister Theresa May and her main opponent Jeremy Corbyn have ruled out giving voters a chance to approve whatever withdrawal treaty is agreed with Brussels before Britain leaves the bloc in March 2019. However, campaigners on both sides of the debate have raised the issue again this month. \nUpdating the European Parliament on a summit he chaired last month at which EU leaders agreed to open talks with London on their post-Brexit future, European Council President Donald Tusk took the opportunity to support those calling for a rethink. \n”Brexit will become a reality, with all its negative consequences, in March next year, unless there is a change of heart among our British friends,“ the former Polish premier said. ”We here on the continent haven’t had a change of heart. \n“Our hearts are still open to you.” \nPicking up on Tusk’s comment, European Commission President Jean-Claude Juncker, whose executive arm is negotiating Britain’s departure, added his endorsement: “He said that our door is still open. I hope this is heard in London.” \nConstitutional lawyers are divided on whether Britain can withdraw its two-year notice to quit but the exchanges underline a view in Brussels that an EU political consensus could be found to avert Brexit -- even if most are now resigned to Britain leaving and believe the Union will weather the disruption. \nRichard Tice of the Leave Means Leave campaign issued a statement saying Tusk and Juncker should accept that Britons would not reverse their vote -- “despite their best efforts”. \nIn the debate, senior EU lawmakers called on May to offer more clarity on what she wants. Some mocked her, with the top German conservative skewering her announcement that she would restore Britain’s old blue passports after Brexit as a “scam”. TOUGH TERMS \nMember states are discussing among themselves a new set of negotiating instructions for Juncker’s negotiator Michel Barnier ahead of an expected launch of talks on a post-Brexit transition period during which much of the status quo would be maintained. \nDiplomats say those discussions reveal a firm line among the 27 on holding Britain to commitments to accepting continued obligations to the Union during the transition, including accepting continued free immigration from the EU and being subject to EU courts -- key complaints of Brexit supporters. \nWork is continuing on how Britain might continue to take part in free trade agreements between the EU and other countries during the transition and on how and whether the transition might be extended beyond Dec. 31, 2020. \nAmong the most eye-catching of demands which diplomats have clarified is that EU citizens arriving in Britain even after Brexit, during the transition, would be entitled to retain for life the rights currently enjoyed by EU expatriates. \nSenior lawmakers in the Strasbourg chamber were generally scathing about May’s plans for Brexit. The leader of the center-right group, an ally of German Chancellor Angela Merkel, mocked her announcement that British passports would go back to being blue after Brexit as opposed to the red used by most EU states. \n“The whole story is a scam,” said Manfred Weber, denouncing a “lack of leadership” and of “honesty” in portraying the move on passport color as a restoration of sovereignty -- no EU law binds member states to red passports and Croatia uses blue ones. \nFor the UK Independence Party, which campaigned for Brexit, David Coburn accused Barnier of trying to “destroy Britain” as a center for financial services by rejecting London’s efforts to retain existing access to EU financial markets. Additional reporting by Elizabeth Piper in London, Writing by Alastair Macdonald in Brussels, Editing by Angus MacSwan", "external_links": [], "published": "2018-01-16T14:34:00.000+02:00", "crawled": "2018-01-16T15:24:33.032+02:00", "highlightTitle": ""}