{"organizations": [], "uuid": "06b8c2e8acace1b0944dc1c30b226b11eb123c33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-lennar-reports-fourth-quarter-eps-of-1-point-29.html", "country": "US", "domain_rank": 767, "title": "Lennar Reports Fourth Quarter EPS of $1.29", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T14:00:00.000+02:00", "replies_count": 0, "uuid": "06b8c2e8acace1b0944dc1c30b226b11eb123c33"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-lennar-reports-fourth-quarter-eps-of-1-point-29.html", "ord_in_thread": 0, "title": "Lennar Reports Fourth Quarter EPS of $1.29", "locations": [], "entities": {"persons": [], "locations": [{"name": "miami", "sentiment": "none"}], "organizations": [{"name": "lennar", "sentiment": "negative"}, {"name": "lennar multifamily", "sentiment": "none"}, {"name": "lennar financial services", "sentiment": "none"}, {"name": "lennar homebuilding", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MIAMI, Jan. 10, 2018 /PRNewswire/ --\n2017 Fourth Quarter\nNet earnings of $309.6 million, or $1.29 per diluted share, compared to $313.5 million, or $1.31 per diluted share, as adjusted for Class B stock dividend Strategic, one-time transaction projected in Q4 2017 shifted into Q1 2018, thereby benefiting from a lower federal tax rate Deliveries of 8,633 homes – up 5% New orders of 7,357 homes – up 12%; new orders dollar value of $2.8 billion – up 18% Backlog of 8,935 homes – up 17%; backlog dollar value of $3.6 billion – up 23% Revenues of $3.8 billion – up 12% Lennar Homebuilding operating earnings of $478.8 million, compared to $436.7 million Gross margin on home sales of 22.4%, compared to 23.3% S,G&A expenses as a % of revenues from home sales improved to 8.4%, compared to 8.7% Operating margin on home sales of 14.0%, compared to 14.6% Lennar Financial Services operating earnings of $42.1 million, compared to $51.4 million Rialto operating earnings (net of noncontrolling interests) of $2.2 million, compared to $8.0 million Lennar Multifamily operating earnings of $38.6 million, compared to $41.4 million Lennar Homebuilding cash and cash equivalents of $2.3 billion Lennar issued $300 million of 2.95% senior notes due 2020 and $900 million of 4.750% senior notes due 2027 primarily to fund cash portion of proposed CalAtlantic merger No outstanding borrowings under the $2.0 billion credit facility Lennar Homebuilding debt to total capital, net of cash and cash equivalents, of 34.4%\n2017 Fiscal Year\nNet earnings of $810.5 million, or $3.38 per diluted share, compared to net earnings of $911.8 million, or $3.86 per diluted share, as adjusted for Class B stock dividend Lennar Homebuilding pretax loss due to litigation of $140 million Deliveries of 29,394 homes – up 11% New orders of 30,348 homes – up 11% Revenues of $12.6 billion – up 15%\nLennar Corporation (NYSE: LEN and LEN.B) , one of the nation's largest homebuilders, today reported results for its fourth quarter and fiscal year ended November 30, 2017. Fourth quarter net earnings attributable to Lennar in 2017 were $309.6 million, or $1.29 per diluted share, compared to $313.5 million, or $1.31 per diluted share in the fourth quarter of 2016, as adjusted for Class B stock dividend. Net earnings attributable to Lennar for the year ended November 30, 2017 were $810.5 million, or $3.38 per diluted share, compared to $911.8 million, or $3.86 per diluted share for the year ended November 30, 2016, as adjusted for Class B stock dividend.\nStuart Miller, Chief Executive Officer of Lennar Corporation, said, \"We are pleased to announce a strong fourth quarter and fiscal 2017, as we continued to execute on our strategies in all of our operating businesses. Although we missed fourth quarter, bottom-line guidance because a single, strategic transaction shifted into the first quarter of 2018, our core operating performance exceeded expectations. The proceeds from the shifted transaction will now benefit from a much lower federal tax rate.\"\nMr. Miller continued, \"Our fourth quarter operating success was driven by focused execution in the field, favorable economic conditions in our markets and by managing a quick rebound from the two major hurricanes we experienced at the beginning of the quarter. Our results also benefitted from strong demand for homes, low unemployment, favorable interest rates and increased consumer confidence. General enthusiasm for the strength of the economy, combined with the added tailwinds of recent tax law changes, continue to propel the housing market forward.\"\n\"Our homebuilding operating strategies produced strong results in the fourth quarter as our gross and operating margins were 22.4% and 14.0%, respectively, while our home deliveries and new orders increased 5% and 12%, respectively, compared to last year. Additionally, we continue to focus on stragetic innovation in every aspect of our business to drive down S,G&A expenses and improve profitability.\"\n\"Complementing our homebuilding business, our Financial Services business reported earnings of $42.1 million in our fourth quarter. Although these results are down 18% from the prior year, the decrease was primarily due to a significantly lower number of refinance transactions.\"\n\"Our Multifamily business generated $38.6 million of earnings in the fourth quarter, driven by the sale of two apartment properties by its joint ventures. With its $9.1 billion geographically diversified pipeline of multifamily product, this segment continues to grow while capitalizing on future development opportunities.\"\n\"Our homebuilding business and financial services operations continue to be the primary drivers of our quarterly results and earnings growth, while our ancillary segments continue to mature as independent businesses and create significant value.\"\nMr. Miller concluded, \"Our company is very well positioned for future growth and we look forward to another strong year in 2018. Our pending strategic combination with CalAtlantic, which is scheduled to close on February 12, 2018, will add to the future growth of our company as we strategically combine two great companies in markets that we know well with products that we know well, to create the leading homebuilder in the country.\"\nRESULTS OF OPERATIONS\nTHREE MONTHS ENDED NOVEMBER 30, 2017 COMPARED TO\nTHREE MONTHS ENDED NOVEMBER 30, 2016\nLennar Homebuilding\nRevenues from home sales increased 14% in the fourth quarter of 2017 to $3.3 billion from $2.9 billion in the fourth quarter of 2016. Revenues were higher primarily due to a 5% increase in the number of home deliveries, excluding unconsolidated entities, and an 8% increase in the average sales price of homes delivered. New home deliveries, excluding unconsolidated entities, increased to 8,614 homes in the fourth quarter of 2017 from 8,206 homes in the fourth quarter of 2016. There was an increase in home deliveries in all of the Company's Homebuilding segments and Homebuilding Other, except Homebuilding East that was slightly down from prior year due to the impact of Hurricane Irma on deliveries in the fourth quarter. The average sales price of homes delivered, excluding unconsolidated entities, increased to $387,000 in the fourth quarter of 2017 from $357,000 in the fourth quarter of 2016. Sales incentives offered to homebuyers were $23,500 per home delivered in the fourth quarter of 2017, or 5.7% as a percentage of home sales revenue, compared to $23,700 per home delivered in the same period last year, or 6.2% as a percentage of home sales revenue. The improvement in sales incentives was primarily due to the Homebuilding West segment.\nGross margins on home sales were $747.5 million, or 22.4%, in the fourth quarter of 2017, compared to $683.5 million, or 23.3%, in the fourth quarter of 2016. Gross margin percentage on home sales decreased compared to the fourth quarter of 2016 primarily due to an increase in land and construction costs per home, partially offset by an increase in the average sales price of homes delivered.\nSelling, general and administrative expenses were $281.0 million in the fourth quarter of 2017, compared to $256.2 million in the fourth quarter of 2016. As a percentage of revenues from home sales, selling, general and administrative expenses improved to 8.4% in th", "external_links": ["http://www.lennar.com/", "http://www.prnewswire.com/news-releases/lennar-reports-fourth-quarter-eps-of-129-300580505.html"], "published": "2018-01-10T14:00:00.000+02:00", "crawled": "2018-01-10T16:32:12.000+02:00", "highlightTitle": ""}