{"organizations": [], "uuid": "8e0dbc6014463691bd50cada6b0186ceef545196", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-hmc-healthworks-appoints-jon-reid-chief-marketing-officer.html", "country": "US", "domain_rank": 767, "title": "HMC HealthWorks Appoints Jon Reid Chief Marketing Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-16T14:56:00.000+02:00", "replies_count": 0, "uuid": "8e0dbc6014463691bd50cada6b0186ceef545196"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-hmc-healthworks-appoints-jon-reid-chief-marketing-officer.html", "ord_in_thread": 0, "title": "HMC HealthWorks Appoints Jon Reid Chief Marketing Officer", "locations": [], "entities": {"persons": [{"name": "jon reid", "sentiment": "negative"}, {"name": "janis dimonaco", "sentiment": "none"}, {"name": "reid", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}], "organizations": [{"name": "hmc healthworks", "sentiment": "negative"}, {"name": "cmo", "sentiment": "none"}, {"name": "pbm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JUPITER, Fla., Jan. 16, 2018 /PRNewswire/ -- HMC HealthWorks, a 40-year veteran in healthcare management with clinically-integrated models of care that reduce healthcare costs and improve population health, today announced that Jon Reid has been appointed chief marketing officer (CMO).\n\"Jon has extraordinary business development expertise and marketing leadership,\" said Dr. Janis DiMonaco, President, Founder and CEO, HMC HealthWorks. \"For the last two years he has been well-recognized for developing strategies that have accelerated the growth to build out the HMC HealthWorks brand. His leadership will continue to increase the demand for our solutions and drive revenue growth.\"\nReid joined HMC HealthWorks in early 2016 and served as Executive Vice President of Program and Business Development. Prior to HMC HealthWorks, Reid was responsible for the strategic expansion of sales growth for a top tier Pharmacy Benefit Manager (PBM) in the labor and trust market. He also spent several years within the insurance marketplace overseeing the daily operation of a voluntary worksite administration division while building out a sales team with strategic focus on relationship building with brokers and consultants throughout the United States.\n\"HMC HealthWorks is well poised to add more decades of growth to its 40-plus-year history,\" explained Jon Reid, Chief Marketing Officer. \"We have a longstanding history of excellence in improving the delivery of care and controlling of healthcare costs for our clients. I am excited to leverage our collective knowledge of internal expertise to continually improve healthcare management for our clients.\"\nThroughout his 20 years of experience in the healthcare and pharmacy industries, development, growth and relationship building have remained Reid's consistent focus. He has also held positions as regional vice president of sales in the Midwest and manager of marketing and sales with two other insurance and pharmacy benefit management companies.\nReid has received several industry awards and recognitions, including the 2010 and 2012 President's Club member, 2008 Teamwork Leadership Award at the annual National Business Conference, and in 2006 he was Sales Leader of the Year.\nSince 1976, HMC HealthWorks has been improving population health by identifying key health issues and areas of cost improvement when plan sponsors and their participants engage in its clinically-integrated models of care in chronic disease management, mental health and substance abuse care management, EAP and wellness programs, along with coordinated PBM initiatives. With its state of the art data warehouse, data mining capabilities and best practices in utilization management, HMC HealthWorks generates critical insight to continually improve healthcare management for its clients.\nTo learn more about HMC HealthWorks' program solutions and how the company can work with your organization, contact Jon Reid, Chief Marketing Officer, at JReid@hmcebs.com .\nAbout HMC HealthWorks\nHMC HealthWorks, the premier national provider of population healthcare management programs, offers plan sponsors value-added programs including Integrated Clinical Solutions, Chronic Care Management, Behavioral Health Solutions, Wellness/Lifestyle Coaching and Care Coordination- www.hmchealthworks.com .\nMedia Relations:\nChristy Heady\nDirector of Public Relations\n(561) 275-8398\ncheady@hmcebs.com\nView original content: http://www.prnewswire.com/news-releases/hmc-healthworks-appoints-jon-reid-chief-marketing-officer-300583048.html\nSOURCE HMC HealthWorks", "external_links": ["http://www.hmchealthworks.com/", "http://www.prnewswire.com/news-releases/hmc-healthworks-appoints-jon-reid-chief-marketing-officer-300583048.html"], "published": "2018-01-16T14:56:00.000+02:00", "crawled": "2018-01-16T17:08:49.002+02:00", "highlightTitle": ""}