{"organizations": [], "uuid": "98e4a3519125d0331ef4a045a9d45a27792660d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 364, "shares": 364, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219483582&w=1200&r=LYNXMPEE0403S", "site_section": "http://feeds.reuters.com/reuters/topNews\r", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-northkorea-southkorea/north-korea-accepts-talks-offer-from-south-korea-meeting-to-be-held-january-9-idUSKBN1EU06O", "country": "US", "domain_rank": 408, "title": "North Korea accepts January 9 talks offer from South Korea", "performance_score": 3, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T04:56:00.000+02:00", "replies_count": 0, "uuid": "98e4a3519125d0331ef4a045a9d45a27792660d5"}, "author": "", "url": "https://www.reuters.com/article/us-northkorea-southkorea/north-korea-accepts-talks-offer-from-south-korea-meeting-to-be-held-january-9-idUSKBN1EU06O", "ord_in_thread": 0, "title": "North Korea accepts January 9 talks offer from South Korea", "locations": [], "entities": {"persons": [{"name": "sou", "sentiment": "neutral"}, {"name": "baik tae-hyun", "sentiment": "none"}, {"name": "christine kim", "sentiment": "none"}, {"name": "south ko", "sentiment": "none"}, {"name": "baik", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "koreas", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "panmunjom", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - North Korea agreed on Friday to hold official talks with South Korea next week, the first in more than two years, hours after Washington and Seoul delayed a military exercise amid a standoff over the North’s nuclear and missile programs.\nSouth Korea said the North had sent its consent for the talks to be held on Tuesday. The last time the two Koreas engaged in official talks was in December 2015.\nThe meeting will take place at the border truce village of Panmunjom where officials from both sides are expected to discuss the Winter Olympics, to be held in the South next month, and inter-Korean relations, South Korean Unification Ministry spokesman Baik Tae-hyun told reporters.\nNorth Korea asked for further negotiations about the meeting to be carried out via documented exchanges, Baik said.\nNorth Korean leader Kim Jong Un opened the way for talks with South Korea in a New Year’s Day speech in which he called for reduced tensions and flagged the North’s possible participation in the Winter Olympics.\nBut Kim remained steadfast on the issue of nuclear weapons, saying the North would mass-produce nuclear missiles for operational deployment and warned he would launch a nuclear strike if his country was threatened.\nU.S. President Donald Trump on Thursday called the proposed inter-Korean talks a “good thing” and he and his South Korean counterpart Moon Jae-in announced that annual large-scale military drills would now take place after the Olympics.\nThe North sees the drills as preparations for invasion and justification for its weapons programs that it conducts in defiance of U.N. Security Council resolutions. South Korea and the United States are technically still at war with North Korea after the 1950-53 Korean conflict ended with a truce, not a peace treaty.\nTrump, who hurled fresh insults at the North Korean leader this week, took credit for any dialogue that takes place.\n“Does anybody really believe that talks and dialogue would be going on between North and South Korea right now if I wasn’t firm, strong and willing to commit our total ‘might’ against the North,” Trump tweeted.\nIn an interview with CNN on Friday, U.S. Secretary of State Rex Tillerson warned that while it was Washington’s aim to resolve the North Korean crisis diplomatically, “those diplomatic efforts are backed by a strong military option if necessary.”\nRibbons bearing messages wishing for unification between the two Koreas hang on a barbed-wire fence near the militarized zone separating the two Koreas, in Paju, South Korea, December 21, 2017. REUTERS/Kim Hong-Ji He said future talks involving the United States could allow North Korea to “chart a way for themselves to a more secure future, a more prosperous future,” and added: “They do know how to reach us if and when they are ready to engage with us as well.”\nTillerson said how such talks might begin had yet to be determined, but North Korea would have to signal it understood that they would be aimed at “final, full denuclearization.”\nNorth Korea regularly threatens to destroy the United States and its two key Asia allies, Japan and South Korea, and says its weapons are necessary to counter U.S. aggression.\nChinese Foreign Ministry spokesman Geng Shuang welcomed North and South Korea “taking positive steps to improve ties”, and said the postponement of the exercises was “without doubt a good thing”.\nSlideshow (4 Images) China’s Commerce Ministry said it would limit exports of crude oil, refined oil products, steel and other metals to North Korea, in line with tough new sanctions imposed by the United Nations.\nJapanese Defence Minister Itsunori Onodera sounded a note of caution about the proposed talks.\n“I think what is important is to maintain a firm defense posture,” he told reporters. “North Korea goes through phases of apparent dialogue and provocation, but either way, North Korea is continuing its nuclear and missile development. We have no intention of weakening our warning and surveillance.”\nThe ramped-up momentum for inter-Korean dialogue follows a year of missile and nuclear tests by North Korea as well as an exchange of bellicose comments between Trump and Kim, which raised alarm across the world.\nEarlier this week, Nikki Haley, the U.S. ambassador to the United Nations, said Washington had heard reports that Pyongyang might be preparing to fire another missile.\nSouth Korea’s defense ministry has said it had yet to see any evidence of an imminent missile launch.\nAnalysts with the website 38 North, which tracks North Korea, reported Pyongyang may be preparing to test a rocket engine at a facility in Sohae, North Pyongan province, where all of the North’s satellite launches have taken place since 2012.\nCommercial satellite imagery from Dec. 25 showed a rail-mounted environment shelter had been moved away from a test stand, indicating that an engine test may be in the near future, the website said, rather than a new rocket launch suspected in recent media reports.\nReporting by Christine Kim; Additional reporting by Hyonhee Shin and Josh Smith in SEOUL, Olivier Fabre in TOKYO, Philip Wen in BEIJING, Denis Pinchuk in MOSCOW and David Brunnstrom and David Alexander in WASHINGTON; Editing by Nick Macfie and James Dalgleish\n ", "external_links": [], "published": "2018-01-05T04:56:00.000+02:00", "crawled": "2018-01-05T05:11:49.030+02:00", "highlightTitle": ""}