{"organizations": [], "uuid": "717aa17ea841ac56e62bcab3f22e73440791141a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 77}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/06/103284069-103284069-Photo_Oct_06.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/15837362/device/rss/rss.html", "section_title": "U.S. News", "url": "https://www.cnbc.com/2018/01/08/intel-ceo-brian-krzanich-at-ces-on-spectre-and-meltdown-chip-flaws.html", "country": "US", "domain_rank": 767, "title": "Intel CEO Brian Krzanich at CES on Spectre and Meltdown chip flaws", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T07:02:00.000+02:00", "replies_count": 0, "uuid": "717aa17ea841ac56e62bcab3f22e73440791141a"}, "author": "Saheli Roy Choudhury", "url": "https://www.cnbc.com/2018/01/08/intel-ceo-brian-krzanich-at-ces-on-spectre-and-meltdown-chip-flaws.html", "ord_in_thread": 0, "title": "Intel CEO Brian Krzanich at CES on Spectre and Meltdown chip flaws", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Intel CEO Brian Krzanich said Monday the chip maker expects to issue updates to all of its processors released in the last five years before the end of January. \nThe announcement followed the disclosure of massive security vulnerabilities last week that affect Intel chips. \n\"For our processors, products, introduced in the past five years, Intel expects to issue updates for more than 90 percent of them within a week,\" Krzanich told audiences in Las Vegas during his keynote address at industry expo CES. \"And the remaining [updates will be available] by the end of January.\" \nSecurity researchers released documentation of critical vulnerabilities in modern processors used on almost every computer and smartphones around the world. The hardware bugs — known as Meltdown and Spectre — could allow programs to steal data including passwords, personal photos and emails. The revelations last week sent the computer industry scrambling to patch those vulnerabilities. \nIndustry blog The Register reported that a patch for the security flaw in Intel chips could impact their functioning. \nKrzanich stuck to the company line that the updates would not drastically affect computer performance for the average user. He told the audience on Monday that the \"impact of these updates is highly workload dependent.\"\nHe said that he expects some users to be affected more than others. \"So, we will continue working with the industry to minimize the impact on those workloads over time.\" \nEarlier in the day, the Intel CEO also informed employees about the creation of a new security group following the disclosure of the vulnerabilities. That news was first reported by the Oregonian and a source familiar with the matter confirmed the change to CNBC.\nIntel declined to comment on the matter. \nAt first, the company was quick to point out that the security vulnerabilities were not limited to its products , and might not have the biggest impact. \"Contrary to some reports, any performance impacts are workload-dependent, and, for the average computer user, should not be significant and will be mitigated over time,\" the company said.\nThen, a few days after the details of the so-called Meltdown and Spectre vulnerabilities — which Intel had known about for months — became public, the company emphasized that it had been busy issuing updates for affected processors.\nIn his keynote, Krzanich reiterated that Intel did not received any information that those vulnerabilities were being used to obtain customer data.\nWith the formation of the security group, Intel is going further, suggesting the problems could require more work over time.\nPatches to prevent exploits of the two vulnerabilities have already caused a few issues. One gaming company, Epic, released a chart showing clear spikes in chip utilization after servers it relies on for one game were patched. Some customers of cloud provider Amazon Web Services have reported issues on its online forums as well.", "external_links": ["http://www.oregonlive.com/silicon-forest/index.ssf/2018/01/intel_reorganizes_amid_fervor.html", "https://meltdownattack.com/", "https://www.theregister.co.uk/2018/01/02/intel_cpu_design_flaw/", "https://www.epicgames.com/fortnite/forums/news/announcements/132642-epic-services-stability-update"], "published": "2018-01-09T07:02:00.000+02:00", "crawled": "2018-01-09T10:19:12.001+02:00", "highlightTitle": ""}