{"organizations": [], "uuid": "e4f16b9a854969adfc5a0eab91512c2934440f4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/15/the-associated-press-adventurous-armani-fanciful-fendi-close-milan-fashion-week.html", "country": "US", "domain_rank": 767, "title": "Adventurous Armani, fanciful Fendi close Milan Fashion Week", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T18:23:00.000+02:00", "replies_count": 0, "uuid": "e4f16b9a854969adfc5a0eab91512c2934440f4d"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/15/the-associated-press-adventurous-armani-fanciful-fendi-close-milan-fashion-week.html", "ord_in_thread": 0, "title": "Adventurous Armani, fanciful Fendi close Milan Fashion Week", "locations": [], "entities": {"persons": [{"name": "armani", "sentiment": "negative"}, {"name": "giorgio armani", "sentiment": "none"}, {"name": "yoshio kubo", "sentiment": "none"}, {"name": "emporio armani", "sentiment": "none"}], "locations": [], "organizations": [{"name": "milan fashion week", "sentiment": "negative"}, {"name": "milan fashion week milan", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "fendi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILAN (AP) — And in a flash, it was over. The Milan Fashion Week devoted to fall and winter menswear for 2018-19 was abbreviated this year into a super-slim long weekend that ended Monday.\nMany fashion houses opted to fold their previews for men into their womenswear shows scheduled for next month. Others decided to go with more hands-on presentations instead of all-out runway productions.\nSome of the fashion houses that participated in the condensed men's week mixed women's clothes in with their predominantly male displays. But the final day stuck strictly to menswear, with Armani, Fendi, No. 21 and Yoshio Kubo closing out the previews.\nHere are some highlights:\nARMANI'S ADVENTUROUS ELEGANCE\nElegance meets adventure at Giorgio Armani, with double-breasted looks, a new jacket collar with a built-in shawl, a posable shirt collar and joggers or cargo pants tucked into tall mountain boots.\nAs with his youthful Emporio Armani line shown Saturday, Armani employed velvet generously in his main line. Velvet is the textile of princes, the designer noted after the show, tracing its popularity as far back as the 15th century. Armani's suits were both formal and casual.\nFormal double-breasted looks were a strong suit, in shirts and knitwear as well as the classic jacket. For Armani, \"the double-breasted construction is beautiful, because it does it all,\" whereas a more common single button jacket requires a vest or a fancy shirt and tie to finish the look.\n\"You need to compensate for the lack of buttons with other elements,\" he advised.\nArmani also created a new shirt with a collar that can be configured into manifold shapes courtesy of hidden metallic thread. The white shirts on the runway contrasted elegantly with darker tones and were worn either high, rolled up or scrunched down, out of sight.\nLess formal cargo pants and joggers finished many looks. Bags included big overnight duffels. Colors were mostly earth tones.\nArmani said he sought to make \"sporty looks more sophisticated\" and to add a \"touch of sportiness to the evening.\"\nFENDI TAKE-OFF\nSilvia Venturini Fendi took a journey to the family fashion house's past for next winter's menswear and found herself at a fantastical airport carousel.\nBags of every sort and even a fur-covered baby bassinet sped by on a conveyor belt as models strode by. Fanciful accessories had a strong role to play in the collection, from fur-covered safari hats to plasticized rain hats and Fendi-branded umbrella-shaped caps.\nThe collection had a feel both contemporary and nostalgic. Brown and gold were the main colors, and the silhouettes veered toward relaxed, roomy cuts.\nDiagonal detailing characterized the season, appearing on fur coats, down jackets, and matching silken shirt-and-tie sets. The print of the season, a collaboration with the artist-designer known on Instagram as @hey_reilly, was a collage of plaids, architectural detailing and the double-F Fendi logo applied to some of the catchwords of the season, including \"Freedom.\"\nEVEREST LANDING BY YOSHIO KUBO\nJapanese designer Yoshio Kubo imagines a plane crash on Mount Everest as the backstory to his latest collection. \"It is not scary,\" the 43-year-old designer explained backstage. \"I survive, right?\"\nThe scenario starts to explain the diaphanous red parachute that bellowed behind a bright striped pant paired with a boldly printed top. And it gives deeper meaning to a sheer organza anorak, its edges left frayed, that suggests an airplane's fiberglass shell.\nThe colors of the collection are the bright reds and purples of Nepal that would come into focus outside the plane. They appear alongside more classic blacks, grays, tans and olive green.\nA fringed jacquard jacket in red, black and white shown with loose-fitting striped trousers for a meditative touch had a ceremonial feel. Everest itself appeared as a motif, both graphic depictions of the mountain and the word repeated as a pattern.\nKubo gave survivors of the pretend crash hoods and improvised turbans, and a few got quilted moon boots.\nCALIFORNIA DREAMING AT NO. 21\nAlessandro Dell'Acqua is dreaming of California in his next collection, but a more desolate and isolated California than the always sunny Golden State depicted in popular culture.\nHis is a world of roadside motels and isolated youth who seek refugee from the world behind big hoods with music blaring from their earbuds. The world is more \"Stranger Things\" than \"Surfin' USA.\"\nThe looks are both classic and nostalgic, featuring suit jackets with quilted details, patterned knitwear slightly cropped and cardigans buttoned askew. Woolen trousers have elastic waistbands and athletic stripes, hemmed to reveal nubby-soled shoes in dark leather or cowskin.\nOuterwear includes quilted parkas and sturdy leather coats with patch details.\n\"It is a collection of garments that I like to define as classics, essentials,\" Dell'Acqua said backstage.", "external_links": [], "published": "2018-01-15T18:23:00.000+02:00", "crawled": "2018-01-16T08:05:38.002+02:00", "highlightTitle": ""}