{"organizations": [], "uuid": "906e4932ce79f396a3a840a241b2d4eaac0aaa91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-scorpio-tankers-inc-announces-fourth-quarter-2017-earnings-release-and-conference-call-on-february-14-2018.html", "country": "US", "domain_rank": 767, "title": "Scorpio Tankers Inc. Announces Fourth Quarter 2017 Earnings Release and Conference Call on February 14, 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T00:15:00.000+02:00", "replies_count": 0, "uuid": "906e4932ce79f396a3a840a241b2d4eaac0aaa91"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-scorpio-tankers-inc-announces-fourth-quarter-2017-earnings-release-and-conference-call-on-february-14-2018.html", "ord_in_thread": 0, "title": "Scorpio Tankers Inc. Announces Fourth Quarter 2017 Earnings Release and Conference Call on February 14, 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "monaco", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "scorpio tankers inc.", "sentiment": "negative"}, {"name": "scorpio tankers inc", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONACO, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Scorpio Tankers Inc. (NYSE:STNG) (“Scorpio Tankers,” or the \"Company\") announced today that the Company plans to issue its fourth quarter 2017 earnings before the market open on Wednesday, February 14, 2018 and will host a conference call later in the day at 9:00 AM Eastern Standard Time and 3:00 PM Central European Time.\nConference Call Details\nDate: Wednesday, February 14, 2018\nTime: 9:00 AM Eastern Standard Time and 3:00 PM Central European Time\nUS Dial-In Number: +1 (855) 861-2416\nInternational Dial-In Number: +1 (703) 736-7422\nConference ID: 5389004\nParticipants should dial into the call 10 minutes before the scheduled time.\nThe information provided on the teleconference is only accurate at the time of the conference call, and the Company will take no responsibility for providing updated information.\nSlides and Audio Webcast:\nThere will also be a simultaneous live webcast over the internet, through the Scorpio Tankers Inc. website www.scorpiotankers.com . Participants for the live webcast should register on the website approximately 10 minutes prior to the start of the webcast.\nWebcast URL: https://edge.media-server.com/m6/p/568uhhv6\nAbout Scorpio Tankers Inc.\nScorpio Tankers is a provider of marine transportation of petroleum products worldwide. The Company currently owns or finance leases 109 product tankers (38 LR2 tankers, 12 LR1 tankers, 45 MR tankers and 14 Handymax tankers) with an average age of 2.5 years and time or bareboat charters-in 19 product tankers (one LR2 tanker, nine MR tankers and nine Handymax tankers).\nForward-Looking Statements\nMatters discussed in this press release may constitute forward-looking statements. The Private Securities Litigation Reform Act of 1995 provides safe harbor protections for forward-looking statements in order to encourage companies to provide prospective information about their business. Forward-looking statements include statements concerning plans, objectives, goals, strategies, future events or performance, and underlying assumptions and other statements, which are other than statements of historical facts. Scorpio Tankers desires to take advantage of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 and is including this cautionary statement in connection with this safe harbor legislation. The words “believe,” “expect,” “anticipate,” “estimate,” “intend,” “plan,” “target,” “project,” “likely,” “may,” “will,” “would,” “could” and similar expressions identify forward-looking statements.\nThe forward-looking statements in this press release are based upon various assumptions, many of which are based, in turn, upon further assumptions, including without limitation, management’s examination of historical operating trends, data contained in company records and other data available from third parties. Although management believes that these assumptions were reasonable when made, because these assumptions are inherently subject to significant uncertainties and contingencies which are difficult or impossible to predict and are beyond the company’s control, there can be no assurance that Scorpio Tankers will achieve or accomplish these expectations, beliefs or projections. The Company undertakes no obligation, and specifically declines any obligation, except as required by law, to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nIn addition to these important factors, other important factors that, in our view, could cause actual results to differ materially from those discussed in the forward-looking statements include, unforeseen liabilities, future capital expenditures, revenues, expenses, earnings, synergies, economic performance, indebtedness, financial condition, losses, future prospects, business and management strategies for the management, expansion and growth of our operations, risks relating to the integration of the operations of Navig8 Product Tankers Inc. (“NPTI”) and the possibility that the anticipated synergies and other benefits of the acquisition of NPTI will not be realized or will not be realized within the expected timeframe, the outcome of any legal proceedings related to the merger with NPTI and the related transactions, the failure of counterparties to fully perform their contracts with us, the strength of world economies and currencies, general market conditions, including fluctuations in charter rates and vessel values, changes in demand for tanker vessel capacity, changes in our operating expenses, including bunker prices, drydocking and insurance costs, the market for our vessels, availability of financing and refinancing, charter counterparty performance, ability to obtain financing and comply with covenants in such financing arrangements, changes in governmental rules and regulations or actions taken by regulatory authorities, potential liability from pending or future litigation, general domestic and international political conditions, potential disruption of shipping routes due to accidents or political events, vessels breakdowns and instances of off-hires, and other factors. Please see Scorpio Tankers’ filings with the U.S. Securities and Exchange Commission for a more complete discussion of certain of these and other risks and uncertainties.\nScorpio Tankers Inc.\n212-542-1616\nSource: Scorpio Tankers Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=UF4MjkI2oEZs1-wNEWFzDO1bMFkg_2iNIbv49J7YWe1zTK_8jnQTl_YChUUarux2H91D_E2Owqb7aVvrGMXZ_FkPb_WdE2JPhpJg3L1wEmI=", "https://edge.media-server.com/m6/p/568uhhv6", "https://www.globenewswire.com/Tracker?data=-2XlB_rxeAj5bkFNIF57FwC8fXNJiSfmED8W-LHJOevLe07g3-0g-y46yfHMHotnJwCHFt_NJM__wqLdtZPGgTFGgPhvPO7oGaPtDytKgVFbdH7-feWVSfzqPTt3fzCn8x6JAZJWNnOHOLUuVwb8BA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f7e24336-fbde-413f-9519-5f0b0fc0f292"], "published": "2018-01-30T00:15:00.000+02:00", "crawled": "2018-01-30T04:25:53.059+02:00", "highlightTitle": ""}