{"organizations": [], "uuid": "34e5c8f7096c2cab926ad03ba8fc98501571cdb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-sec-qualifies-25-million-regulation-a-capital-raise-for-terracycle-u-s.html", "country": "US", "domain_rank": 767, "title": "SEC Qualifies $25 Million Regulation A Capital Raise For TerraCycle U.S.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.028, "site_type": "news", "published": "2018-01-17T16:33:00.000+02:00", "replies_count": 0, "uuid": "34e5c8f7096c2cab926ad03ba8fc98501571cdb8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-sec-qualifies-25-million-regulation-a-capital-raise-for-terracycle-u-s.html", "ord_in_thread": 0, "title": "SEC Qualifies $25 Million Regulation A Capital Raise For TerraCycle U.S.", "locations": [], "entities": {"persons": [{"name": "tom szaky", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "u.s. trenton", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "terracycle us inc.", "sentiment": "negative"}, {"name": "inc.", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TRENTON, N.J., Jan. 17, 2018 /PRNewswire/ -- TerraCycle US Inc., the U.S. subsidiary of TerraCycle, Inc., announced that its $25 million Regulation A offering has been qualified by the U.S. Securities and Exchange Commission (SEC), thereby allowing anyone the opportunity to invest in the innovative recycling company.\n\"Our mission at TerraCycle is to eliminate waste, recycle the unrecyclable and use our innovative business solutions to minimize human impact on the planet,\" said TerraCycle CEO Tom Szaky. \"During the course of our 15-year history, we've inspired a passionate following and have been asked by those who support our mission how they can invest in the company. With the recent qualification by the SEC, any category of investor can invest in our U.S. operating company and I'm pleased to be in a position to invite the public to participate in our future.\"\nUsing third party logistics and facilities, TerraCycle converts collected waste into raw materials that are sold to manufacturers to create new products. Examples of waste streams collected and recycled by TerraCycle include chip bags, coffee capsules, cigarette butts, oral care, writing utensils and over 100 other waste streams in the United States. Through its programs, TerraCycle has shown that consumers favor businesses that provide recycling solutions for the products they manufacture.\nThrough the Regulation A offering, TerraCycle US Inc. seeks to use the proceeds from the offering to acquire related companies, increase staff and grow its business. Interested investors are invited to visit www.OwnTerraCycle.com to view detailed information about the offering.\nRegulation A is part of the JOBS Act, bi-partisan legislation signed in 2012. The new form of Regulation A went into effect in 2015. This legislation greatly expanded entrepreneurs' access to capital, allowing them to crowdfund their capital raises and opened the door to non-accredited investors to participate in early stage investments, subject to SEC review.\nAbout TerraCycle\nTerraCycle is the world's leader in the collection and repurposing of hard-to-recycle post-consumer waste and has developed proprietary solutions to recycle a range of complex waste streams including cigarette butts, dirty diapers, ocean plastic, adhesive packaging and household paint. In addition to free programs, TerraCycle also sells Zero Waste Boxes for end users to recycle items in offices, homes, factories and public facilities. To learn more, visit www.terracycle.com .\nAn offering statement regarding this offering has been filed with the SEC. The SEC has qualified that offering statement, which only means that the company may make sales of the securities described by the offering statement. It does not mean that the SEC has approved, passed upon the merits or passed upon the accuracy or completeness of the information in the offering statement. You should read the offering circular before making any investment. The offering circular that is part of that offering statement can be found at https://www.sec.gov/Archives/edgar/data/1714781/000114420418002133/tv483295_253g2.htm .\nContact: Lauren Taylor\nTerraCycle\nLauren.taylor@terracycle.com\n609-656-5100 ext. 3705\nView original content: http://www.prnewswire.com/news-releases/sec-qualifies-25-million-regulation-a-capital-raise-for-terracycle-us-300583580.html\nSOURCE TerraCycle US Inc.", "external_links": ["https://www.sec.gov/Archives/edgar/data/1714781/000114420418002133/tv483295_253g2.htm", "http://www.prnewswire.com/news-releases/sec-qualifies-25-million-regulation-a-capital-raise-for-terracycle-us-300583580.html", "http://www.ownterracycle.com/", "http://www.terracycle.com/"], "published": "2018-01-17T16:33:00.000+02:00", "crawled": "2018-01-17T16:35:28.005+02:00", "highlightTitle": ""}