{"organizations": [], "uuid": "995a5ab006879510198059609bf935d659b3eff2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224876440&w=1200&r=LYNXMPEE0N1RX", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-davos-meeting-aramco/aramco-seeks-to-expand-in-u-s-says-trump-is-pro-oil-idUSKBN1FD2HK", "country": "US", "domain_rank": 408, "title": "Aramco seeks to expand in U.S., says Trump is pro-oil", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T19:31:00.000+02:00", "replies_count": 0, "uuid": "995a5ab006879510198059609bf935d659b3eff2"}, "author": "", "url": "https://www.reuters.com/article/us-davos-meeting-aramco/aramco-seeks-to-expand-in-u-s-says-trump-is-pro-oil-idUSKBN1FD2HK", "ord_in_thread": 0, "title": "Aramco seeks to expand in U.S., says Trump is pro-oil", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "nasser", "sentiment": "none"}, {"name": "amin nasser", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "aramco", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland (Reuters) - Saudi oil giant Aramco is looking to expand in the United States where President Donald Trump’s tax cuts and support for the oil industry are making business increasingly attractive, its chief executive told Reuters.\nAramco already controls a large refinery in Texas. It is also preparing to launch what could be the world’s largest initial public offer (IPO) and is considering listing its shares in New York among several possible exchanges.\n“We are looking at new business opportunities in the U.S. and with the tax cuts it will make it much more profitable ... It is part of our strategy to grow our business in the U.S.,” Amin Nasser said in an interview.\n“The Trump administration has been positive towards the energy industry. As long as what they are doing is in the interest of all and the U.S. economy is growing, we are happy,” Nasser said on the sidelines of the World Economic Forum in Davos.\n“The whole oil industry is benefiting from the current administration.”\nTrump is due to speak in Davos on Friday and has encouraged Aramco to list in New York.\nAramco wants to list this year. Saudi Arabia has shortlisted New York, London and Hong Kong -- singly or in a combination of two or even all three -- for the international portion of the state-owned firm’s listing, sources say.\nWashington has been a long-standing political ally of Riyadh while New York offers the best liquidity of all exchanges but requires more disclosure than exchanges in London or Hong Kong.\n“This is a company that provides a significant portion of the country’s GDP. There are pros and cons for every exchange. It needs to be well analyzed,” Nasser said.\n“Of course, the New York stock exchange is the best in terms of liquidity. But it is not just the question of liquidity. It is also about other rules and regulations and the ease of doing business in these markets.”\nFILE PHOTO: Chief Executive Officer of ARAMCO, Amin Nasser speaks during an interview with REUTERS in Dhahran, Saudi Arabia, December 13, 2017. REUTERS/Hamad I Mohammed Saudi Arabia is also considering listing Aramco shares on the local stock exchange, Tadawul, but there are concerns that this could swamp the bourse. Nasser noted an official advisory council’s request for the securities regulator to study the impact of Aramco’s listing on Tadawul.\n“All of these things need to be looked at... They (the advisory council) are asking a legitimate question.”\nLOWEST-COST PRODUCER Nasser said he was not concerned by a growing number of funds and investors -- including Norway’s sovereign fund, the world’s biggest -- moving away from investing in oil stocks.\nFILE PHOTO: Logo of Saudi Aramco is seen at the 20th Middle East Oil & Gas Show and Conference (MOES 2017) in Manama, Bahrain, March 7, 2017. REUTERS/Hamad I Mohammed/File Photo “We know we are the lowest-cost producer in the world ... I‘m sure Aramco will be attractive”.\nNasser said healthy global demand combined with OPEC supply cuts should help oil markets achieve a balance of supply and demand and lead to a reduction in oil stocks to a five-year average by the end of the year.\nHe also said he was not concerned by rising U.S. oil exports though the Saudi market share in some core markets was declining.\n“We have a good share in each market. We don’t have an issue in terms of market share. Our long-term sales agreements work well.”\nThe Aramco share listing is part of wider reforms driven by Saudi Crown Prince Mohammed bin Salman and Nasser said economic and social reforms were speeding up.\n“Diversification is key ... We need to identify other sectors rather than relying on oil and gas. Privatization is also key as you can improve the quality of service. Regulatory frameworks are also changing big time. We are working on easing the climate for business,” he said.\n“We are opening the country in a big way ... These are drastic changes.”\nEditing by Mark Bendeich\n ", "external_links": [], "published": "2018-01-24T19:31:00.000+02:00", "crawled": "2018-01-24T19:40:22.009+02:00", "highlightTitle": ""}