{"organizations": [], "uuid": "34c4491b19579df448a3988a9878bff4fb495c24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/12/04/101246295-177199490.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/15839135/device/rss/rss.html", "section_title": "Earnings", "url": "https://www.cnbc.com/2018/01/31/home-builder-dr-hortons-profit-drops-8-point-5-percent.html", "country": "US", "domain_rank": 767, "title": "Home builder DR Horton's profit drops 8.5%", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:45:00.000+02:00", "replies_count": 0, "uuid": "34c4491b19579df448a3988a9878bff4fb495c24"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/31/home-builder-dr-hortons-profit-drops-8-point-5-percent.html", "ord_in_thread": 0, "title": "Home builder DR Horton's profit drops 8.5%", "locations": [], "entities": {"persons": [{"name": "dr horton", "sentiment": "negative"}, {"name": "d.r. horton", "sentiment": "none"}], "locations": [{"name": "wall street", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "d.r. horton", "sentiment": "negative"}, {"name": "pulte", "sentiment": "none"}, {"name": "lennar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "D.R. Horton reported first-quarter profit and revenue on Wednesday above Wall Street estimates as the biggest U.S. homebuilder sold more homes, sending its shares up 4.1 percent in premarket trading.\nOrders, an indicator of future revenue for homebuilders, rose 16.4 percent to 10,753 homes in the quarter as job growth fueled demand in spite of higher prices due to rising construction costs.\nHome prices in 20 metropolitan areas rose 6.4 percent in November and consumer confidence rebounded in January, a set of consumer data released on Tuesday showed.\nD.R. Horton, which mainly sells single-family homes, said it expects fiscal 2018 gross margin to be around 20-21 percent, with some fluctuations in the quarters ahead, compared with its prior forecast of around 20 percent.\nThe company's home sales gross margins for the year ended Sept. 30 slipped 20 basis points from 2016 to 20 percent.\nOn Tuesday, smaller rival PulteGroup warned of a decline in gross margin this year , citing higher land, labor, and raw material costs.\nBut, Pulte and Lennar remained upbeat on housing demand despite climbing interest rates and changes in U.S. tax laws related to mortgage debts.\nD.R. Horton said it expects to sell between 50,500 and 52,500 homes in fiscal 2018 and reaffirmed its revenue forecast to be between $15.5 billion and $16.3 billion.\n\"With recent fears around higher rates appearing to ease somewhat, at least temporarily, we expect that DHI shares will perform well today,\" MKM Partner analyst Megan McGrath wrote in a note.\nThe company, which also sells townhomes and condominiums, said it sold 10,788 homes in the quarter, up from 9,404, a year earlier.\nNet income attributable to the company fell to $189.3 million, or 49 cents per share, in the quarter ended Dec. 31, from $206.9 million, or 55 cents per share, a year earlier.\nExcluding a one-time charge, the company earned 77 cents per share, well above the average analysts' estimate of 49 cents, according to Thomson Reuters I/B/E/S.\nRevenue rose 14.8 percent to $3.33 billion, beating the estimate of $3.26 billion.\nShares of the Fort Worth, Texas -based company were trading at $50.50 premarket. Up to Tuesday's close, they have risen 58 percent in the last 12 months.", "external_links": [], "published": "2018-01-31T14:45:00.000+02:00", "crawled": "2018-01-31T14:44:13.003+02:00", "highlightTitle": ""}