{"organizations": [], "uuid": "04c017a0aae2d1466e31e586c745097adc05c8b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968498-20180123-0625-2548.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/goldman-sachs-sees-high-probability-of-a-stock-market-correction.html", "country": "US", "domain_rank": 767, "title": "Goldman Sachs sees 'high probability' of a stock market correction", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:34:00.000+02:00", "replies_count": 0, "uuid": "04c017a0aae2d1466e31e586c745097adc05c8b6"}, "author": "Thomas Franck", "url": "https://www.cnbc.com/2018/01/29/goldman-sachs-sees-high-probability-of-a-stock-market-correction.html", "ord_in_thread": 0, "title": "Goldman Sachs sees 'high probability' of a stock market correction", "locations": [], "entities": {"persons": [{"name": "adam jeffery", "sentiment": "none"}, {"name": "peter oppenheimer", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "gold goldman sachs", "sentiment": "negative"}, {"name": "goldman sachs", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Adam Jeffery | CNBC Caution tape outside the New York Stock Exchange in New York on Jan. 23rd, 2018. \nGoldman Sachs believes \"correction signals are flashing\" and is advising its clients to prepare for a correction in the coming months as investors pour cash into the stock market. \n\"Whatever the trigger, a correction of some kind seems a high probability in the coming months,\" Peter Oppenheimer, chief global equity strategist at Goldman Sachs, wrote Monday. \"Our Goldman Sachs Bull/Bear Market Indicator is at elevated levels, although the continuation of low core inflation and easy monetary policy suggests that a correction is more likely than a bear market.\" \nThe S&P 500 has entered the longest period since 1929 without a correction of more than 5 percent, the strategist explained. And while bear markets risks are \"low,\" Oppenheimer wouldn't be surprised to see a market re-rating in the next few months. \n\"Drawdowns within bull markets of 10 percent or more are not uncommon,\" Oppenheimer added. \"The average bull market 'correction' is 13 percent over four months and takes just four months to recover.\" \nWhile the S&P 500 and the Dow Jones industrial average have rocketed higher this month, the Cboe Volatility Index (VIX) – widely considered the best gauge of fear in the market – is also on the rise. \nThe VIX hit a high of 13.21 Monday, up from record lows below 9 just months prior. The previous 12 months were characterized by a chronic lack of volatility as stocks ticked higher, unperturbed by a well-broadcast tightening of monetary policy. But now, with soaring confidence, Republican tax cuts, and a president threatening to disrupt longstanding trade agreements, 2018 may prove to shake up the status quo. \n\"The increase in volatility amid a market rally may, in part, reflect increasing risks, and may also reflect a bullish willingness to spend premium to add to upside exposure,\" added Oppenheimer. \"Investors should be vigilant to periods when optimism has overpriced assets, leaving them vulnerable to small 'disappointments.' A good sign of this is when 'all news is good news': for example, the market goes up with rising interest rate expectations because this is seen as confirmation of strong growth.\" \nInflows into equities are also up, as a \"fear of missing out\" drives investors headfirst into stocks. Earlier this month, mutual funds and ETFs that focus on stocks saw a fresh $58 billion flood markets, the highest pace ever over a four-week period. \nTo be sure, while Goldman Sachs may hold that stocks are \"overdue\" for a correction, analysts believe investors should prepare to buy on any signs of weakness. \n\"We remain overweight and think that bear market risks are low,\" Oppenheimer wrote. \"Despite the strong macro outlook, it is worth remembering that it is typically better to buy a market when the news is poor and valuations are low than when all news is good and valuations are high. WATCH: Rising interest rates most likely to cause correction show chapters", "external_links": [], "published": "2018-01-29T17:34:00.000+02:00", "crawled": "2018-01-29T17:34:51.002+02:00", "highlightTitle": ""}