{"organizations": [], "uuid": "449b350c15c9ae3cdd77712557a11ce9d4a6568c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970981-GettyImages-136910198.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/26/employers-get-a-vote-of-no-confidence-in-handling-harassment.html", "country": "US", "domain_rank": 767, "title": "Employers get a vote of no confidence in handling harassment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T21:23:00.000+02:00", "replies_count": 0, "uuid": "449b350c15c9ae3cdd77712557a11ce9d4a6568c"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/26/employers-get-a-vote-of-no-confidence-in-handling-harassment.html", "ord_in_thread": 0, "title": "Employers get a vote of no confidence in handling harassment", "locations": [], "entities": {"persons": [{"name": "laura goldberg", "sentiment": "none"}], "locations": [{"name": "legalzoom", "sentiment": "none"}], "organizations": [{"name": "cmo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fewer than half of employees are confident that their workplace can handle problems that arise on the job, and a small number who've specifically witnessed harassment were too fearful of retaliation to speak up about it, according to a new survey.\nOnly 27% of those who've had a workplace issue have taken their concerns to management, and 12% who witnessed harassment feared they would be penalized if they challenged it, according to the poll conducted for legal solutions provider, LegalZoom .\n\"I think that 12% is incredibly alarming,'' said Laura Goldberg, LegalZoom's CMO. \"We just have to create environments where people are comfortable being honest and speaking out about what they see and what they've experienced.''\nPart of the issue is that many employees don't know where to turn if there is a problem\nFewer than half of those surveyed said their workplace had a human resources department. Only 52% said they had an employee handbook, and just 46% of them said their handbook is up to date and inclusive of all guidelines.\nFor those worried about reprisals, only 24% of those polled had a channel to anonymously submit a complaint or recommendation.\nIn addition to making harassment training mandatory, and having management emphasize that employee concerns are a priority, Goldberg suggested that companies might embrace technology to make the rules of the workplace more accessible.\n\"Think about making a handbook that's more visual,'' she says, \"think about making one that's interactive, that sets a different tone in the workplace as opposed to a handbook that with its tone says 'this is a legal document.' ''\nRead more from USA Today:\nEconomy grew solid 2.6% in Q4 but less than expected\nIn-N-Out managers make $160,000 per year\nSee if your Toys R Us store is on the closure list \nLegalZoom's survey of 1,128 adults, which was conducted by the firm YouGov , took place in December, in the midst of the rising #MeToo movement. That effort has helped stoke a national conversation about sexual harassment in the workplace in the wake of allegations against such prominent men as Hollywood producer Harvey Weinstein, former Today anchor Matt Lauer and actor Kevin Spacey.\nGoldberg says that it may take a while longer for the current cultural movement to move from talk to meaningful change.\n\"I think nothing has changed yet other than awareness,'' she says. \"It would be interesting if in a year or two years we see real change in people reporting what they see and what they experience . . . .We may feel like we're having a conversation. But (the question remains) are we having it in a way that's affecting peoples' lives every day.''", "external_links": [], "published": "2018-01-26T21:23:00.000+02:00", "crawled": "2018-01-26T21:47:53.002+02:00", "highlightTitle": ""}