{"organizations": [], "uuid": "fca4f2ebe53a730c03978efae371a4bfee2d7065", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104969963-Cardinal_Turkson_.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/trump-in-davos-vatican-urges-us-president-to-bring-hope-to-the-world.html", "country": "US", "domain_rank": 767, "title": "Trump in Davos: Vatican urges US president to 'bring hope' to the world", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-26T13:13:00.000+02:00", "replies_count": 0, "uuid": "fca4f2ebe53a730c03978efae371a4bfee2d7065"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/26/trump-in-davos-vatican-urges-us-president-to-bring-hope-to-the-world.html", "ord_in_thread": 0, "title": "Trump in Davos: Vatican urges US president to 'bring hope' to the world", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "turkson", "sentiment": "none"}, {"name": "peter turkson", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "vatican", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "integral human development", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "wef", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Vatican has given President Donald Trump its advice on what he should say during his address to global business and political leaders in Davos, Switzerland.\nWhen asked what he believed needed to be in Trump's address to attendees of the World Economic Forum (WEF) on Friday, Cardinal Peter Turkson, Prefect at the Vatican's Dicastery for Integral Human Development, said: \"Recognizing that what decisions made over here impact on the conduct of society, I suppose that he probably should have a message that would bring hope.\"\nTurkson also underlined the importance for the president to widen his focus away from the world's business and political elite. Instead, Trump should recognize the people who protested against him and WEF earlier in the week, he said.\n\"Do not simply celebrate the world of economics and economic leaders, but have a sense for the very many (who demonstrated) and need to be helped out.\"\nOn Tuesday evening, thousands of anti-capitalist activists marched through Swiss cities to protest Trump's visit to the Alpine town of Davos.\nFlag-waving demonstrators marching near Zurich's financial district carried anti-globalist and environmentalist placards such as, \"No Trump, no coal, no gas, no fossil fuels.\"\nSome protesters also broke through a security cordon in Davos — where protests are strictly forbidden — to demonstrate against WEF and the U.S. president.\n'Ambition for profit at all costs' On Monday, Cardinal Turkson delivered a message on behalf of Pope Francis , sending a stern warning that capitalism was failing to serve society effectively.\nEvan Vucci | AFP | Getty Images Pope Francis (R) poses with US President Donald Trump (C), US First Lady Melania Trump and the daughter of US President Donald Trump Ivanka Trump (L) at the end of a private audience at the Vatican on May 24, 2017. In it, the Pope said an \"ambition for profit at all costs\" was driving individualism, rather than inclusiveness. The Pope also warned of the \"growing fragmentation between states and institutions.\"\nIn recent months, Trump and Pope Francis have clashed on issues such as migration, climate change and a Mexico-U.S. wall.\nAfter meeting Pope Frances at the Vatican in May 2017, Trump said he was \"more determined than ever\" to pursue peace in the world.", "external_links": [], "published": "2018-01-26T13:13:00.000+02:00", "crawled": "2018-01-26T13:18:02.002+02:00", "highlightTitle": ""}