{"organizations": [], "uuid": "a2608f39620c309c4c49897219ab80dc482cdced", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-gammacorea-receives-fda-clearance-for-the-acute-treatment-of-pain-associated-with-migraine-headache-in-adult-patients.html", "country": "US", "domain_rank": 767, "title": "gammaCore® Receives FDA Clearance for the Acute Treatment of Pain Associated with Migraine Headache in Adult Patients", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-29T16:45:00.000+02:00", "replies_count": 0, "uuid": "a2608f39620c309c4c49897219ab80dc482cdced"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-gammacorea-receives-fda-clearance-for-the-acute-treatment-of-pain-associated-with-migraine-headache-in-adult-patients.html", "ord_in_thread": 0, "title": "gammaCore® Receives FDA Clearance for the Acute Treatment of Pain Associated with Migraine Headache in Adult Patients", "locations": [], "entities": {"persons": [{"name": "stephen d. silberstein", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "u.s. food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BASKING RIDGE, N.J., Jan. 29, 2018 /PRNewswire/ -- electroCore, LLC (electroCore), a commercial-stage bioelectronic medicine company, announced today that it has received 510(k) clearance from the U.S. Food and Drug Administration (FDA) for an expanded label for gammaCore ® (nVNS) as an acute treatment of pain associated with migraine in adult patients. gammaCore therapy is a proprietary, non-invasive neuromodulation treatment delivered by a hand-held unit that stimulates the vagus nerve through the skin. This label expansion is the first for electroCore since gammaCore received its initial FDA clearance for the acute treatment of pain associated with episodic cluster headache in adult patients in April 2017.\n\"Migraine is a debilitating disease affecting 39 million Americans, the majority of whom do not seek medical care for their pain. 1 With the FDA's decision to release gammaCore for migraine, patients now have access to an effective and safe therapy which can be self-administered to acutely treat the pain associated with migraine,\" said Stephen D. Silberstein, M.D., Professor of Neurology and Director of the Headache Center, Thomas Jefferson University.\nThe FDA clearance of gammaCore for the acute treatment of pain associated with migraine was principally supported by the results of the multicenter, randomized, double-blind, sham-controlled trial, PRESTO ( PR ospectiv E S tudy of nVNS for the Acute T reatment O f Migraine). 2 Results from this trial, which were recently profiled at the Congress of the International Headache Society (IHC) in Vancouver in September 2017, demonstrated that treatment with gammaCore for the acute treatment of pain associated with migraine was superior to sham, and also enabled patients to reach pain freedom more frequently by 30, 60, and 120 minutes compared with sham treatment. 2 The results further showed that a significantly higher proportion of gammaCore-treated patients achieved pain relief within two hours compared with the control treatment. 2 Consistent with all prior studies with gammaCore, the therapy was found to be well tolerated by patients. 2\n\"With annual healthcare and lost productivity costs associated with migraine measured in the tens of billions of dollars in the U.S., the availability of gammaCore provides patients with a new treatment option to relieve migraine pain, while also offering the potential to alleviate some of the economic strain that arises from their condition as well,\" said Francis R. Amato, Chief Executive Officer of electroCore.\ngammaCore is also available outside of the U.S., including in Canada and the European Economic Area. In the U.S., gammaCore is commercially available for the acute treatment of pain associated with episodic cluster headache in adults. electroCore expects commercial availability of gammaCore for the acute treatment of pain associated with migraine headache in adults in the second quarter of 2018.\nAbout PRESTO\nThe multicenter, randomized, double-blind, sham-controlled trial evaluated the efficacy, safety and tolerability of nVNS in 243 patients with episodic migraine. Results from PRESTO found that acute treatment with gammaCore was superior to sham for pain freedom at 30, 60, and 120 minutes: nVNS (n=120) led to significantly higher pain-free rates than sham (n=123) for the first treated migraine attack at 30 minutes (12.7% vs 4.2%; p=0.012) and 60 minutes (21.0% vs 10.0%; p=0.023); however, the improvement at 120 minutes missed statistical significance (30.4% vs 19.7%; p=0.067). A post-hoc repeated-measures test was performed to examine the statistical anomaly between the 120-minute findings and the 30- and 60-minute findings. This test confirmed that gammaCore was superior to sham through 120 minutes (odds ratio: 2.3; 95% CI: 1.2, 4.4; p=0.012). Clinically meaningful and statistically significant benefits from gammaCore therapy were also observed in the secondary endpoints of mild or no pain at 120 minutes (40.8% vs 27.6%; p=0.030) and mean percent pain reduction at 120 minutes (34.8% vs 5.4%; p=0.004). As seen in other published studies, gammaCore was well tolerated, as demonstrated by a low incidence of device-related adverse effects. 2\nAbout gammaCore ®\ngammaCore ® (nVNS) is the first non-invasive, hand-held medical therapy applied at the neck that acutely treats the pain associated with episodic cluster headache and migraine in adult patients through the utilization of a mild electrical stimulation to the vagus nerve that passes through the skin. Designed as a portable, easy-to-use technology, gammaCore can be self-administered by patients, as needed, without the potential side effects associated with standard of care. When placed on a patient's neck over the vagus nerve, gammaCore stimulates the nerve's afferent fibers, which may lead to a reduction of pain in patients.\ngammaCore is released/cleared in the U.S. for the acute treatment of pain associated with episodic cluster headache and migraine headache in adult patients. gammaCore is currently available outside of the U.S., including in the European Economic Area, where it is CE-Marked.\nAbout Migraine\nMigraine is a term used to describe a class of recurrent, pulsing headaches that are typically unilateral (on one side of the head) but may occur bilaterally (on both sides of the head) and may cause visual disturbances, nausea and vomiting. 1 They may occur with or without recognized warning signs, including either prodromal symptoms or an aura phase. 3 Prodromal symptoms consist of altered mood, irritability, depression or euphoria, fatigue, dizziness and other visceral symptoms preceding the headache by several hours or days. 3 Auras can include visual disturbances such as photopsia or scotomas or, in less frequent cases, somatosensory, auditory or gustatory hallucinations. 3\nThere are approximately 39 million Americans living with migraine, and more than 100,000 migraines occur every day in the U.S. 1,4 Migraine prevalence is significantly higher in females than in males, at a ratio of 3:1. 1\nAbout electroCore\nelectroCore, LLC is a commercial-stage bioelectronic medicine company dedicated to improving patient outcomes through its platform non-invasive vagus nerve stimulation therapy initially focused on the treatment of multiple conditions in neurology and rheumatology. The company's initial targets are the acute treatment of migraine and episodic cluster headache.\nFor more information, visit www.electrocore.com .\nIMPORTANT SAFETY INFORMATION REGARDING GAMMACORE\nThe safety and effectiveness of the gammaCore (nVNS) has not been established in the acute treatment of chronic cluster headache. gammaCore has not been shown to be effective for the prophylactic treatment of chronic or episodic cluster headache or migraine headache. The long-term effects of the chronic use of gammaCore have not been evaluated. Safety and efficacy of gammaCore has not been evaluated in the following patients, and therefore is NOT indicated for: Patients with an active implantable medical device, such as a pacemaker, hearing aid implant, or any implanted electronic device Patients diagnosed with narrowing of the arteries (carotid atherosclerosis)\nPatients who have had surgery to cut the vagus nerve in the neck (cervical vagotomy) Pediatric patients Pregnant women Patients with clinically significant hypertension, hypotension, bradycardia, or tachycardia Patients should not use gammaCore if they: Have a metallic device such as a stent, bone plate, or bone screw implanted at or near their neck Are using another device at the same time (e.g., TENS Unit, muscle stimulator) or any portable electronic device (e.g., mobile phone)\nNote: This list is not all inclusive. Please refer to the gammaCore Instructions for Use for all important warnings and precautions before using or prescribing this product.\ngammaCore is available by prescription only. U.S. Federal Law restricts this device to sale by or on the order of a licensed healthcare provider.\nMedia Contact\nStephanie Bukantz\nGCI Health\n347-587-9811\nStephanie.bukantz@gcihealth.com\n1 Migraine facts. Migraine Research Foundation. http://migraineresearchfoundation.org/about-migraine/migraine-facts . Accessed January 2018.\n2 Tassorelli, C., (September 2017). Non-invasive vagus nerve stimulation (nVNS) for the acute treatment of migraine: a randomized controlled trial. Oral presentation at the Congress of the International Headache Society, Vancouver, Canada.\n3 Migraine and aura. American Migraine Foundation. https://americanmigrainefoundation.org/understanding-migraine/migraine-and-aura/ . Accessed January 2018.\n4 Global burden of migraine in the Year 2000: summary of methods and data sources. World Health Organization. http://www.who.int/healthinfo/statistics/bod_migraine.pdf . Accessed January 2018.\nView original content with multimedia: http://www.prnewswire.com/news-releases/gammacore-receives-fda-clearance-for-the-acute-treatment-of-pain-associated-with-migraine-headache-in-adult-patients-300589314.html\nSOURCE electroCore LLC", "external_links": ["http://www.electrocore.com/", "http://www.prnewswire.com/news-releases/gammacore-receives-fda-clearance-for-the-acute-treatment-of-pain-associated-with-migraine-headache-in-adult-patients-300589314.html", "http://migraineresearchfoundation.org/about-migraine/migraine-facts", "https://americanmigrainefoundation.org/understanding-migraine/migraine-and-aura/", "http://www.who.int/healthinfo/statistics/bod_migraine.pdf"], "published": "2018-01-29T16:45:00.000+02:00", "crawled": "2018-01-29T19:26:09.018+02:00", "highlightTitle": ""}