{"organizations": [], "uuid": "4102a2ae3c9780863ed0cb13af0e3f81766939f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 62}, "facebook": {"likes": 354, "shares": 354, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225745270&w=1200&r=LYNXMPEE0Q09M", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-saudi-arrests-princealwaleed/saudi-billionaire-prince-alwaleed-bin-talal-released-family-sources-idUSKBN1FG0DT", "country": "US", "domain_rank": 408, "title": "Saudi billionaire Prince Alwaleed bin Talal released - family sources", "performance_score": 3, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.996, "site_type": "news", "published": "2018-01-27T18:43:00.000+02:00", "replies_count": 0, "uuid": "4102a2ae3c9780863ed0cb13af0e3f81766939f5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-saudi-arrests-princealwaleed/saudi-billionaire-prince-alwaleed-bin-talal-released-family-sources-idUSKBN1FG0DT", "ord_in_thread": 0, "title": "Saudi billionaire Prince Alwaleed bin Talal released - family sources", "locations": [], "entities": {"persons": [{"name": "alwaleed bin talal", "sentiment": "negative"}, {"name": "prince alwaleed", "sentiment": "none"}, {"name": "mohammed bin salman", "sentiment": "none"}, {"name": "alwaleed", "sentiment": "none"}], "locations": [{"name": "dubai", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "ritz-carlton", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 10:43 AM / in 2 hours Saudi billionaire Prince Alwaleed released as corruption probe winds down Sarah Dadouch , Katie Paul 6 Min Read \nRIYADH (Reuters) - Saudi Arabian billionaire Prince Alwaleed bin Talal, one of the kingdom’s top international businessmen, was released from detention on Saturday, more than two months after he was taken into custody in a sweeping crackdown on corruption. \nHis release came hours after he told Reuters in an interview at Riyadh’s opulent Ritz-Carlton hotel that he expected to be cleared of any wrongdoing and be freed within days. \nA senior Saudi official said Prince Alwaleed was freed after he reached a financial settlement with the attorney general. \n“The attorney general has approved this morning the settlement that was reached with Prince Alwaleed bin Talal, and the prince returned home at 1100 a.m. (0800 GMT),” the official told Reuters, without giving details of the terms. \nThe decision to free him, and the release of several other well-known tycoons on Friday, suggested the main part of the corruption probe was winding down after it sent shockwaves through Saudi Arabia’s business and political establishment. \nIn his first interview since being detained, conducted hours before his release, Prince Alwaleed told Reuters he maintained his innocence of any corruption in talks with the authorities. \nHe said he expected to keep full control of his global investment firm Kingdom Holding Co 4280.SE without being required to hand assets to the state. He said he had been able to communicate with executives at his business while detained. \nPrince Alwaleed, who is in his early 60s, described his confinement as a “misunderstanding” and said he supported reform efforts by Crown Prince Mohammed bin Salman. \n“There are no charges. There are just some discussions between me and the government,” he said. \nPrince Alwaleed had been confined at the Ritz-Carlton since early November, along with dozens of other senior officials and businessmen, part of the crown prince’s plan to reform oil superpower Saudi Arabia and consolidate his position. FOREIGN INVESTOR CONCERNS \nWhen asked if the attorney general was convinced of Prince Alwaleed’s innocence, the senior Saudi official said: \n“I will not negate or confirm what he says. Generally this falls back to those who concluded the settlement, and for sure there is no settlement unless there are violations, and they are not concluded without the accused admitting it in writing and promising not to repeat it.” \nThe source declined to give further details, but confirmed that Prince Alwaleed would remain head of Kingdom Holding. \nA Gulf banker who deals with Saudi Arabia said the authorities appeared keen to conclude the probe partly because foreign investors were concerned their assets or local business partners could be targeted in the wide-ranging crackdown. Slideshow (4 Images) \nPrince Alwaleed’s detention was particularly worrying for foreigners because of his international prominence as an investor in top Western companies such as Twitter ( TWTR.N ) and Citigroup ( C.N ), and in top hotels including the George V in Paris and the Plaza in New York, the banker said. \n“The government is signaling that it wants to move to a new phase now, away from the crackdown and into other economic reforms,” the banker said. \nOutside Prince Alwaleed’s Riyadh palace, dozens of cars lined the entrances as a huge Saudi flag flapped above. Guards cracked jokes and drank coffee. His office said the prince was out visiting family, but declined to give any details. \nThe attorney general said earlier this week that 90 detainees had been released after their were charges dropped, while others traded cash, real estate and other assets for their freedom. The authorities were still holding 95 people, he said. Some are expected to be put on trial. \n“NOTHING TO HIDE” \nAn official Saudi source said on Friday that several prominent businessmen had reached financial settlements with the authorities, including Waleed al-Ibrahim, owner of regional television network MBC, who was released. Terms of his settlement were not revealed. \nSaudi authorities have said they expect to raise some $100 billion for the government through such settlements - a huge windfall for the state, which has seen its finances squeezed by low oil prices. Some private analysts think that target will be hard to hit, given how many suspects have seen charges dropped. \nAllegations against Prince Alwaleed included money laundering, bribery and extorting officials, a Saudi official told Reuters in November. The prince’s net worth has been estimated by Forbes magazine at $17 billion. \nWhile declaring his innocence in the Reuters interview, the prince appeared greyer and thinner than in his last public appearance, a television interview in October, and had grown a beard while in detention. \n“I have nothing to hide at all. I‘m so comfortable, I‘m so relaxed. I shave here, like at home. My barber comes here. I‘m like at home, frankly speaking,” he said, adding he had been able to communicate with family members while in detention. \nHe granted the 30-minute interview to Reuters, including a tour of his suite, partly to disprove rumors about mistreatment and that he had been moved from the hotel to a prison. \nPrince Alwaleed showed off the comforts of his gold-accented private office, dining room and kitchen, which was fully stocked with his preferred vegetarian meals. \nIn the corner of his office sat tennis shoes, which he said he used regularly for exercise. A television played business news programs, and a mug with an image of his own face on it was perched on the desk. \nAfter being released, Prince Alwaleed said, he would stay in Saudi Arabia and would return to the challenge of juggling his global business interests. \n“I will not leave Saudi Arabia, for sure. This is my country.” Related Coverage", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T18:43:00.000+02:00", "crawled": "2018-01-27T12:50:17.020+02:00", "highlightTitle": ""}