{"organizations": [], "uuid": "80e6dcc3252fca06ea01fed8315669909bcfaf9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-kellermeyer-bergensons-services-announces-acquisition-of-east-coastnational-maintenance-services.html", "country": "US", "domain_rank": 767, "title": "Kellermeyer Bergensons Services Announces Acquisition of East Coast/National Maintenance Services", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.162, "site_type": "news", "published": "2018-01-10T19:01:00.000+02:00", "replies_count": 0, "uuid": "80e6dcc3252fca06ea01fed8315669909bcfaf9e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-kellermeyer-bergensons-services-announces-acquisition-of-east-coastnational-maintenance-services.html", "ord_in_thread": 0, "title": "Kellermeyer Bergensons Services Announces Acquisition of East Coast/National Maintenance Services", "locations": [], "entities": {"persons": [{"name": "mark minasian", "sentiment": "none"}], "locations": [{"name": "oceanside", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "rhode island", "sentiment": "none"}, {"name": "midwest", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "kellermeyer bergensons services announces acquisition of east coast/national maintenance services", "sentiment": "negative"}, {"name": "kellermeyer bergensons services", "sentiment": "negative"}, {"name": "kbs", "sentiment": "negative"}, {"name": "east coast lot", "sentiment": "none"}, {"name": "nms", "sentiment": "none"}, {"name": "national maintenance systems", "sentiment": "none"}, {"name": "pavement maintenance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OCEANSIDE, Calif., Jan. 10, 2018 /PRNewswire/ -- Kellermeyer Bergensons Services, LLC (KBS), the largest provider of technology-enabled, integrated interior and exterior property services to multi-region and multi-site customers in North America, today announced the acquisition of East Coast Lot and Pavement Maintenance (East Coast)/National Maintenance Systems (NMS), an independently-owned exterior facility services company headquartered in Rhode Island. The transaction closed on Jan. 5, 2018.\nMark Minasian, Chief Executive Officer and Co-founder of KBS stated, \"We are very excited about the acquisition of East Coast/NMS. They are a leader in snow and ice management, landscaping and parking lot maintenance services primarily in the Northeast and Midwest regions. This expansion by KBS into complementary exterior services in very attractive end markets further strengthens our commercial value proposition, offering our customers the largest, most reliable integrated facility support solutions platform for interior, exterior or bundled services across North America.\"\nEast Coast/NMS offers a full line of on-site maintenance services including regenerative air and brush truck sweeping, snow and ice removal, landscaping, power washing, asphalt repair, line striping and crack filling.\nMinasian continued, \"Uri Ben-Yashar, the Founder-CEO of East Coast/NMS, is a top tier operator who, after nearly three decades of dedication, has refined the predictive, efficient, simultaneous and scaled delivery of on-demand snow and ice management services. He will continue to lead the division going forward and we are very excited to welcome Uri and his talented team to the KBS family of companies.\"\nBen-Yashar said, \"I am very happy to be partnering with KBS. I've had the opportunity to get to know Mark and his team over the past two years. After decades of operating independently and establishing our brand identity, I became very excited about the opportunities that a merger with KBS would provide for our people and customers. We will keep our brand identity while having the coverage and access to KBS's resources. With KBS's support and our knowledge of the exterior services market, we have now entered the next phase in our growth and development, and I am very excited about the future.\"\nMinasian added, \"Ice and snow management services are mission critical for customers who depend on East Coast/NMS to do the toughest jobs in the very toughest conditions to keep their properties safe and operating during major weather events. By merging with KBS, East Coast/NMS customers can now have even greater confidence that the service support as well as financial and operational underpinnings of East Coast/NMS are stronger than ever. Major hospitals with emergency vehicle flows, massive regional U.S. Postal Service distribution centers moving millions of parcels per day, major regional banks and commercial clients all depend on the expert team at East Coast/NMS. During spring and summer, East Coast/NMS's plows give way to exterior landscape and parking lot maintenance services in a very efficient cycle of year-round stewardship for exterior property environments.\"\nHoon Cho, Managing Director at GI Partners, a leading San Francisco-based private equity firm and KBS sponsor, stated, \"East Coast/NMS marks the fourth acquisition by KBS in the past year, with more expected to close as we progress through 2018. The serial completion of these deals comes as a result of a very focused and disciplined strategic and operational path the company undertook over the past three years resulting in KBS becoming the acquirer of choice for regional facility support service providers. We congratulate Mark and the KBS team on the acquisition of East Coast/National Maintenance Systems and welcome Uri and his team into KBS.\"\nAbout East Coast / National Maintenance Services\nEast Coast Lot and Pavement Maintenance (East Coast) and National Maintenance Systems (NMS) deliver complete exterior maintenance services for clients nationwide. Our services concentrate on exterior maintenance such as snow plowing, snow displacement, de-icing, landscaping, irrigation systems, power washing, parking lot sweeping and more. We have a dedicated staff with more than 25 years of experience who provide dedicated oversight of our own employees as well as a network of vendors to ensure your property is maintained to the highest standards and your business remains open, even during inclement weather. Headquartered in Pawtucket, Rhode Island, East Coast/NMS has satellite offices in Connecticut, New Hampshire and New York. For more information, visit econsite.com and nationalmaintsys.com .\nAbout KBS\nKellermeyer Bergensons Services, LLC (KBS) is the largest provider of technology-enabled, integrated interior and exterior property services to multi-region and multi-site customers in North America. With more than 41,000 active customer locations in all 50 U.S. states, Canada, and Puerto Rico, KBS sets the industry standard for delivering consistently high quality, compliant and cost-effective service solutions. Based in Oceanside, Calif., the company is majority owned by GI Partners. For more information, visit kbs-services.com .\nAbout GI Partners\nGI Partners is a leading private investment firm based in San Francisco. The firm has raised over $16 billion in capital through private equity and real estate strategies from recognized institutional investors across the globe. GI Partners' private equity team is active in several sectors, including IT Infrastructure, Healthcare, Software, and Services. For more information on GI Partners and its entire portfolio, please visit gipartners.com .\nContacts:\nAndi Murray, 760-477-9207 (o), 202-329-7798 (c) or amurray@kbs-services.com\nNathaniel Shaw, 828-244-7042 or nshaw@kbs-services.com\nView original content: http://www.prnewswire.com/news-releases/kellermeyer-bergensons-services-announces-acquisition-of-east-coastnational-maintenance-services-300580777.html\nSOURCE Kellermeyer Bergensons Services, LLC", "external_links": ["http://www.prnewswire.com/news-releases/kellermeyer-bergensons-services-announces-acquisition-of-east-coastnational-maintenance-services-300580777.html", "http://www.kbs-services.com/", "http://www.gipartners.com/", "http://www.econsite.com/", "http://nationalmaintsys.com/"], "published": "2018-01-10T19:01:00.000+02:00", "crawled": "2018-01-10T20:18:07.087+02:00", "highlightTitle": ""}