{"organizations": [], "uuid": "311e7cccda7dbd63770f2ad4a21634f5f7b8a20b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-trump-guantanamobay-military/u-s-detainee-policy-review-wont-touch-harsh-interrogation-tactics-idUSKBN1FK2JU", "country": "US", "domain_rank": 408, "title": "U.S. detainee policy review won't touch harsh interrogation tactics", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:20:00.000+02:00", "replies_count": 0, "uuid": "311e7cccda7dbd63770f2ad4a21634f5f7b8a20b"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-guantanamobay-military/u-s-detainee-policy-review-wont-touch-harsh-interrogation-tactics-idUSKBN1FK2JU", "ord_in_thread": 0, "title": "U.S. detainee policy review won't touch harsh interrogation tactics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 5:23 PM / in 23 minutes U.S. detainee policy review will not consider harsh interrogation Phil Stewart , Idrees Ali 5 Min Read \nWASHINGTON (Reuters) - The U.S. military said on Wednesday it will not consider harsh interrogation tactics as part of a new 90-day review of detainee policy ordered by President Donald Trump, who once said he supported ‘waterboarding’ but has since softened his stance. \nThe military also told Reuters no one was currently identified for possible transfer to the detention center at Guantanamo Bay, a day after Trump signed an order to keep the facility in Cuba open and give the U.S. military the option of adding to the detainee population. \nTrump’s Democratic predecessor, Barack Obama, tried unsuccessfully to close the prison that has drawn international condemnation, but reduced the inmate population to 41 from 242 during his eight years in office. \n“We do not have any individuals currently identified for transfer to Guantanamo,” Navy Commander Sarah Higgins, a U.S. military spokeswoman, told Reuters. \nShe also said the review would not in any way include the United States considering the issue of so-called “enhanced interrogation techniques” that human rights advocates have equated to torture and which the United States banned a decade ago. \n“Enhanced interrogation techniques are absolutely not a part of the review,” Higgins said. \nThe U.S. military has long struggled with what to do about prisoners of war in an open-ended battle against Islamist extremism, in which militants have come from all corners of the world to fight in places like Syria and Iraq for Islamic State. \nAfter meeting Mattis for the first time shortly after his election victory on Nov. 19, Trump described how the retired Marine general had persuasively argued against waterboarding, an interrogation tactic that involves pouring water over someone’s face to simulate drowning. \nTrump had promised during his presidential campaign he would not only revive use of waterboarding but bring back “a hell of a lot worse” if elected. But he has since put aside any such plans for the military, deferring to Mattis, who opposes such practices. CONDEMNATION \nThe prison at Guantanamo Bay, which President George W. Bush first used to hold suspected militants captured overseas after the Sept. 11, 2001, attacks, came to symbolize harsh detention practices that opened the United States to accusations of torture. \nAs a presidential candidate, Trump vowed “to load it up with some bad dudes.” Still, since he became president, there has been no indication that any new prisoners have arrived. \nCritics of the U.S. military detention system say that militants can be best prosecuted in civilian courts and have seized on the high costs of facilities like Guantanamo Bay as one argument why indefinite detention is misguided. \nCivil liberties groups condemned Trump’s announcement. The American Civil Liberties Union noted that it cost taxpayers more than $445 million a year to detain the 41 men held at the facility. \nInitial reaction from abroad was also negative. German Foreign Minister Sigmar Gabriel sharply criticized the decision to keep the detention center open, in an interview with Handelsblatt published online. \n“In our view, the detention center in Guantanamo is not compatible with the principles of humanity, the rule of law and human rights. Keeping it open only aids the propaganda machines of IS (Islamic State) and al-Qaeda,” he said. \nThe International Committee of the Red Cross (ICRC) - one of very few aid agencies allowed to visit Guantanamo detainees - said it does not take a position on whether the facility stays open. \n“Our objective is to ensure that the detainees are humanely treated, held in suitable conditions, and have access to appropriate healthcare,” said ICRC spokeswoman Patricia Rey Gonzalez in Geneva. \nU.S. partners holding some of the hundreds of militants captured in the Middle East have reached out to the detainees’ home governments to see if they could be sent back to face justice. \n“If the home governments are willing to take these individuals back for the purposes of prosecution then that is a way to thin the herd a little bit,” U.S. Air Force General Paul Selva, vice chairman of the Joint Chiefs of Staff, told reporters on Tuesday. Reporting by Phil Stewart and Idrees Ali, additional reporting by Andrea Shalal in Berlin and Stephanie Nebahay in Geneva, Editing by Rosalba O'Brien", "external_links": [], "published": "2018-01-31T19:20:00.000+02:00", "crawled": "2018-01-31T19:41:23.051+02:00", "highlightTitle": ""}