{"organizations": [], "uuid": "74a585080901e679c323bd421f9a8426198c8107", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219548702&w=1200&r=LYNXMPEE040G4", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/rcom-debt/china-development-bank-withdraws-insolvency-petition-against-rcom-idINKBN1EU0R0", "country": "US", "domain_rank": 408, "title": "China Development Bank withdraws insolvency petition against RCom", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T10:49:00.000+02:00", "replies_count": 0, "uuid": "74a585080901e679c323bd421f9a8426198c8107"}, "author": "", "url": "https://in.reuters.com/article/rcom-debt/china-development-bank-withdraws-insolvency-petition-against-rcom-idINKBN1EU0R0", "ord_in_thread": 0, "title": "China Development Bank withdraws insolvency petition against RCom", "locations": [], "entities": {"persons": [{"name": "clarence fernandez", "sentiment": "none"}, {"name": "abhirup roy", "sentiment": "none"}, {"name": "devidutta tripathy", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "china development bank", "sentiment": "negative"}, {"name": "reliance communications ltd", "sentiment": "none"}, {"name": "cdb", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "national company law tribunal", "sentiment": "none"}, {"name": "reliance jio infocomm", "sentiment": "none"}, {"name": "reliance group", "sentiment": "none"}, {"name": "reliance center", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 8:50 AM / Updated 7 hours ago China's CDB withdraws insolvency petition against RCom Abhirup Roy , Devidutta Tripathy 3 Min Read \nMUMBAI (Reuters) - China Development Bank (CDB), the biggest foreign lender to Reliance Communications Ltd (RCom), on Friday withdrew a petition seeking to drag the indebted telecoms carrier into insolvency. A logo of Reliance Group is seen at Reliance Center in Mumbai, December 26, 2017. REUTERS/Danish Siddiqui/Files \nThe move followed a new debt reduction plan outlined by RCom last week, including asset sales. \nWhile details of a possible settlement between the Chinese bank and RCom were not immediately known, the lender has told the National Company Law Tribunal (NCLT) it reserves the right to file the insolvency application again if RCom’s planned asset sales do not go through by March, said a lawyer on the case. \nCDB, which is owed around $2 billion along with two other Chinese banks, had filed the petition in November seeking insolvency proceedings against RCom, saying a large amount of loan principal and interest payments was overdue. \nAfter RCom’s debt-reduction plan, including an asset sale to Reliance Jio Infocomm Ltd, was announced last week, CDB told Reuters it was in talks with RCom. \nRCom last Thursday announced a deal to sell most of its wireless assets to Jio in a deal people familiar with the matter said was worth nearly 240 billion rupees ($3.8 billion), subject to final adjustments at the time the transaction closes. \nRCom has said it will use proceeds from the deal, expected to close by March, to repay part of the $7 billion it owes to Indian and foreign banks. \nAs part of an overall debt-reduction plan, RCom Chairman Anil Ambani said RCom would shift 100 billion rupees of debt to a special purpose vehicle housing its real estate assets, including a corporate park in a Mumbai suburb. \nRCom still faces two other insolvency proceedings - one by the Indian unit of Swedish telecom equipment maker Ericsson and the other by public relations firm Fortuna - over unpaid dues. \nAfter a hearing on Friday, the NCLT posted there would be a further hearing on the Ericsson case on Jan. 18. \nRCom has struggled under heavy debt and reported a string of losses during a price war, triggered by new entrant Jio which is controlled by Anil’s elder brother and India’s richest man Mukesh Ambani. That prompted RCom to reduce operations by shutting down its wireless business. \nAs it exits the wireless telecommunications segment, it will be left with a division housing its undersea cable business and internet data centres. \nThe firm is also looking for an equity injection from global strategic partners for further debt reduction and is in talks to sell a stake in the scaled-down business, RCom said last week. \nRCom shares closed 2.1 percent higher on Friday in a Mumbai market up 0.5 percent. \n($1 = 63.3525 Indian rupees)", "external_links": [], "published": "2018-01-05T10:49:00.000+02:00", "crawled": "2018-01-05T11:03:41.065+02:00", "highlightTitle": ""}