{"organizations": [], "uuid": "c06ffe65fe79cf20e9017757e469a118e4cc5b3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/21/103956675-GettyImages-604208430.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/10/what-is-monero-north-korea-new-favorite-cryptocurrency.html", "country": "US", "domain_rank": 767, "title": "What is monero, North Korea’s new favorite cryptocurrency?", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T11:39:00.000+02:00", "replies_count": 0, "uuid": "c06ffe65fe79cf20e9017757e469a118e4cc5b3e"}, "author": "Arjun Kharpal", "url": "https://www.cnbc.com/2018/01/10/what-is-monero-north-korea-new-favorite-cryptocurrency.html", "ord_in_thread": 0, "title": "What is monero, North Korea’s new favorite cryptocurrency?", "locations": [], "entities": {"persons": [{"name": "andariel", "sentiment": "none"}, {"name": "alienvault", "sentiment": "none"}], "locations": [{"name": "north korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "kim il sung university", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "alienvault", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North Korea appears to have taken a liking to monero, the world's 13th largest cryptocurrency by value.\nEarlier this week, cybersecurity researchers at U.S. firm AlienVault found evidence of a malicious piece of software that infected computers to mine monero and send it back to North Korea .\nMining is the process of solving complex mathematical equations in order to verify a transaction using cryptocurrency; the miner gets rewarded in that cryptocurrency.\nWhat happened? AlienVault said it found evidence of malware that took over a person's computer and mined monero. The mined currency was then sent back to Kim Il Sung University in Pyongyang.\nNorth Korea has been hit by sanctions from the United Nations and by countries including the U.S.\n\"Cryptocurrencies could provide a financial lifeline to a country hit hard by sanctions,\" the researchers said in a blog post. \" Therefore, it's not surprising that universities in North Korea have shown a clear interest in cryptocurrencies.\"\nThere have been other incidents of North Korean attackers mining monero. A group called Andariel took over a server at a South Korean company last year and used it to mine the cryptocurrency.\nWhat is monero? Monero is a cryptocurrency built on a different blockchain to bitcoin. The blockchain is the underlying technology behind cryptocurrencies.\nThese blockchains are public ledgers of activities that show all the transactions on a network. But monero's blockchain is purposely made to be more obscure. It works by obfuscating the so-called wallet addresses that people are sending monero from, making it more anonymous.\nWhy is it attractive to North Korea? The increased anonymity that the developers of monero claim exists could be a reason it has been so favored by North Korean actors.\nMonero's website also claims that it is \"safe from capital controls\" or measures that restrict the outflow of traditional currencies, much like the North Korean won. Given that sanctions have hit North Korea, monero could be an alternative currency.\nAlso, the time it takes for a monero transaction to take place is 21 minutes. For bitcoin, this rises to more than an hour and a half, and on any given day could be several hours.\nHow big is monero? Monero is the 13th largest cryptocurrency in the world with a market capitalization of $5.9 billion, according to Coinmarketcap.com, which tracks prices of cryptocurrencies.\nIt's worth noting that Coinamarketcap removed some South Korean exchanges from the way it calculates prices on its website, citing the large divergence in price in the country. This caused the price of some coins on its site to show price declines earlier this week .\nOne monero token was worth just over $378 at around 4:15 a.m. ET on Wednesday, Coinmarketcap data showed.", "external_links": [], "published": "2018-01-10T11:39:00.000+02:00", "crawled": "2018-01-10T12:19:00.000+02:00", "highlightTitle": ""}