{"organizations": [], "uuid": "2addce02a4d94fb199d6037477e0e571e170f62b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-sp-500-dips-after-choppy-session-chipmakers-drag-nasdaq-idUSL2N1PJ2B9", "country": "US", "domain_rank": 408, "title": "US STOCKS-S&P 500 dips after choppy session; chipmakers drag Nasdaq", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T23:10:00.000+02:00", "replies_count": 0, "uuid": "2addce02a4d94fb199d6037477e0e571e170f62b"}, "author": "", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-sp-500-dips-after-choppy-session-chipmakers-drag-nasdaq-idUSL2N1PJ2B9", "ord_in_thread": 0, "title": "US STOCKS-S&P 500 dips after choppy session; chipmakers drag Nasdaq", "locations": [], "entities": {"persons": [{"name": "chuck mikolajczak", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mnuchin", "sentiment": "none"}, {"name": "ross", "sentiment": "none"}, {"name": "wilbur ross", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "nasdaq", "sentiment": "negative"}, {"name": "u.s. commerce", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "ge", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 14 PM / Updated 6 minutes ago US STOCKS-S&P 500 dips after choppy session; chipmakers drag Nasdaq Reuters Staff \n* GE falls after revealing regulatory probe \n* Dollar slides on Mnuchin’s remarks \n* Dow up 0.16 pct, S&P 500 down 0.06 pct, Nasdaq down 0.61 pct \nBy Chuck Mikolajczak \nNEW YORK, Jan 24 (Reuters) - The S&P 500 was little changed on Wednesday while the Nasdaq lagged in choppy trading in the wake of comments by U.S. Commerce Secretary Wilbur Ross which hinted at action against China in a trade war. \nRoss said at the World Economic Forum in Davos that U.S. trade authorities were investigating whether there is a case for taking action over China’s infringements of intellectual property. \nU.S. President Donald Trump is scheduled to speak in Davos on Thursday. \nEquities were initially lifted by another round of solid earnings and a drop in the dollar, which supports large multinational companies, before the trade comments sent the S&P down as much as 0.5 percent. \nThe Dow and S&P were able to recover from the losses as investors chose to wait for concrete action on trade and stay involved in a market that hasn’t seen a 5 percent correction in nearly 400 trading days. \n“The trend is higher and it is so universally, and with such conviction believed that any meaningful pullback is going to be aborted because investors simply don’t want to miss out,” said Peter Kenny, senior market strategist at Global Markets Advisory Group in New York. \n“So we are not seeing that healthy pullback that most investors would actually welcome.” \nThe dollar fell 0.98 percent against a basket of currencies after U.S. Treasury Secretary Steven Mnuchin welcomed the currency’s weakness. \nWorries about a protectionist stance have added to the dollar’s woes after Trump slapped steep tariffs on imported washing machines and solar panels on Monday. \nBank stocks were among the gainers, tracking a rise in U.S. Treasury yields as the dollar struggled. The S&P financial index rose 0.68 percent as the best performing of the major sectors. \nThe Dow Jones Industrial Average rose 41.31 points, or 0.16 percent, to 26,252.12, the S&P 500 lost 1.6 points, or 0.06 percent, to 2,837.54 and the Nasdaq Composite dropped 45.23 points, or 0.61 percent, to 7,415.06. \nEarnings season continues to be strong, with S&P 500 growth expected at 12.4 percent, according to Thomson Reuters data through Wednesday morning. Of the 88 companies in the index that have posted results, 78.4 percent have topped expectations versus the 72 percent beat rate for the past four quarters. \nAmong those posting results, General Electric fell 2.66 percent after the company revealed a regulatory investigation of a multibillion-dollar insurance charge. \nThe company in its earnings report forecast further weakening of its troubled power business and reported a $10 billion loss and a 5-percent fall in revenue. \nAbbott Laboratories jumped 4.20 percent after quarterly profit and 2018 adjusted earnings forecast beat estimates. \nSemiconductor stocks were off 2.31 percent and pulled the Nasdaq lower as Texas Instruments slumped 8.50 percent after it posted the slowest revenue growth in four quarters on softer demand for its chips used in communications equipment. \nDeclining issues outnumbered advancing ones on the NYSE by a 1.21-to-1 ratio; on Nasdaq, a 1.68-to-1 ratio favored decliners. \nThe S&P 500 posted 141 new 52-week highs and one new low; the Nasdaq Composite recorded 183 new highs and 12 new lows. \nVolume on U.S. exchanges was 7.63 billion shares, compared to the 6.53 billion average over the last 20 trading days. (Reporting by Chuck Mikolajczak; Editing by James Dalgleish)", "external_links": [], "published": "2018-01-24T23:10:00.000+02:00", "crawled": "2018-01-24T23:28:48.020+02:00", "highlightTitle": ""}