{"organizations": [], "uuid": "5d3626aea090c8fce82034cc5810b39a556932f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-davos-meeting-town/swiss-mountain-town-davos-relishing-in-trump-spotlight-idUSKBN1F02HM", "country": "US", "domain_rank": 408, "title": "Swiss mountain town Davos relishing in Trump spotlight", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T20:11:00.000+02:00", "replies_count": 0, "uuid": "5d3626aea090c8fce82034cc5810b39a556932f8"}, "author": "", "url": "https://www.reuters.com/article/us-davos-meeting-town/swiss-mountain-town-davos-relishing-in-trump-spotlight-idUSKBN1F02HM", "ord_in_thread": 0, "title": "Swiss mountain town Davos relishing in Trump spotlight", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "john miller", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "trump spo", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 6:14 PM / in 16 minutes Swiss mountain town Davos relishing in Trump spotlight John Miller 5 Min Read \nDAVOS, Switzerland (Reuters) - The Swiss Alpine town of Davos is used to celebrities and high-rollers, but even it is relishing new attention being heaped on it with U.S. President Donald Trump’s decision to attend the World Economic Forum this month \nTrump’s visit to Davos for the annual meet-up of global political and business leaders will be the first for a sitting U.S. president since Bill Clinton came in 2000. \nTrump’s policies, including his intention to exit the 2015 Paris climate accord and his “America First” tendencies, may not sit well with all of Switzerland, which backs the global climate pact and whose economy relies on global trade. \nThis has prompted some critics to suggest Trump’s polarising persona could resurrect violent anti-WEF protests from the early 2000s. An online petition is circulating telling Trump he is not welcome. \nStill, the tenor in Davos this week Thursday was upbeat, with many confident a robust security contingent -- up to 5,000 soldiers if necessary alongside about 1,000 police -- can handle any furor surrounding Trump’s presence. \n“It doesn’t get any better than this,” said Ernst Wyrsch, who was director of the hotel where Clinton stayed during his WEF visit and now heads the region’s hotel association. \n“Davos, for at least a couple of days, will be at the center of the world.” \nWhile dignitaries come each year -- British Prime Minister Theresa May and Chinese Premier Xi Jinping made the trek to the town last year -- they lack the media power of a U.S. president that puts the spotlight on a community that relies on tourism. \n“I guess there’s no such thing as bad publicity,” said Linard Kinschi, a resident who was heading out to the 1,560 meters above sea level (5,120 ft) town’s cross-country ski trails. \nAlthough U.S. officials are already in Switzerland preparing for Trump’s arrival, details of his trip, including whether he will even spend the night during the Jan. 23-26 event, were under wraps. \nTrump, expected to be accompanied by Treasury Secretary Steven Mnuchin and possibly Trump son-in-law Jared Kushner, may rush in for a day, give a speech and then depart. \nThere is something of a contradiction in all this. The logo of the World Economic Forum (WEF) is seen the congress centre in the Swiss mountain resort of Davos, Switzerland, January 11, 2018 REUTERS/Arnd Wiegmann \nThe WEF is a haven for supporters of globalisation who espousing the very free trade pacts that Trump has blasted as unfair to the United States. \nHeinz Brand, who represents Davos in the Swiss parliament, hopes Trump arrives in the mood for discussion, not a fight. \n“Even people who were sworn enemies have met in Davos and left on more favorable terms,” Brand said, recalling when Palestinian leader Yasser Arafat and Israeli Foreign Minister Shimon Peres shared a WEF stage. CHANGES Slideshow (7 Images) \nThe Swiss army has begun erecting checkpoints on roads leading into town and armed hillside bivouacs down the valley, scenes on par with every post-Sept. 11 WEF where security has been to the fore. \n“This is the 48th WEF,” said Reto Branschi, CEO of Davos Klosters Tourism. “Every year, we have 20 presidents from all over the world. We are used to the visits of presidents.” \nLast year, 4,300 Swiss soldiers deployed, with the airspace open only to aircraft ferrying participants to the forum. Grisons cantonal police, who coordinate WEF security measures and are liaising with U.S. officials, say they are ready. \n“The closure of the airspace has worked well in recent years, and we don’t believe that any modifications will be necessary this year,” said Andre Kraske, a Grisons spokesman. \nStill, there are some changes. \nFor decades, helicopters carrying visitors have landed in the meadow of Hans Stiffler, a lifelong Davoser who runs an inn. \nThis year, the landing pad has been moved across the valley, where there is more room. \nWithout choppers at the doorstep this year, it will be a bit quieter, and Stiffler will not have to bring his security badge with him every time he leaves home. \nBut he may also not be able to add to his trove of WEF memorabilia includes letters of appreciation from Clinton, photos of former secretary of state Condoleezza Rice, and an intimate shot of then Brazilian president Lula da Silva meeting Israel’s Peres in Stiffler’s hotel for five minutes before each was helicoptered away. Reporting by John Miller", "external_links": [], "published": "2018-01-11T20:11:00.000+02:00", "crawled": "2018-01-11T20:42:54.001+02:00", "highlightTitle": ""}