{"organizations": [], "uuid": "d8c95ca36c046db8eb9f41b8acda548fb62d8dd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-palestinians-hamas/u-s-state-department-designates-hamas-leader-as-terrorist-idUKKBN1FK2J2", "country": "US", "domain_rank": 408, "title": "U.S. State Department designates Hamas leader as terrorist", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:14:00.000+02:00", "replies_count": 0, "uuid": "d8c95ca36c046db8eb9f41b8acda548fb62d8dd1"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-palestinians-hamas/u-s-state-department-designates-hamas-leader-as-terrorist-idUKKBN1FK2J2", "ord_in_thread": 0, "title": "U.S. State Department designates Hamas leader as terrorist", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " 16 PM / Updated 23 minutes ago U.S. State Department designates Hamas leader as terrorist Reuters Staff 2 Min Read \nWASHINGTON (Reuters) - The U.S. State Department said on Wednesday it had designated Ismail Haniyeh, leader of the Islamist Palestinian group Hamas, as a terrorist. \nThe State Department said in a statement that Haniyeh, along with two Islamist groups active in Egypt and one in the Palestinian territories, were listed as specially designated global terrorists. \nIt quoted Secretary of State Rex Tillerson as saying the designations “target key terrorist groups and leaders – including two sponsored and directed by Iran – who are threatening the stability of the Middle East, undermining the peace process, and attacking our allies Egypt and Israel.” \nIn Gaza, Hamas official Sami Abu Zuhri told Reuters: ”We reject and condemn the decision and we see it as a reflection of the domination by a gang of Zionists of the American decision.“The decision is worthless,” he added. \nHamas, which dominates the Gaza Strip, advocates Israel’s destruction and is designated as a terrorist group by the United States and some other Western countries. \nIn December, after U.S. President Donald Trump recognized Jerusalem as the capital of Israel, Haniyeh told a rally in Gaza marking the 30th anniversary of Hamas’s founding: “We will knock down Trump’s decision. No superpower is capable of offering Jerusalem to Israel, there is no Israel that it should have a capital named Jerusalem.” \nThe three groups designated by the State Department are: \n- Harakat al-Sabireen, which the statement said is backed by Iran, operates primarily in Gaza and the West Bank, and fired rockets into Israel; \n- Liwa al-Thawra, which it said has claimed responsibility for killing an Egyptian army general in Cairo in 2016 and a bombing in 2017; \n- Harakat Sawa’d Misr (HASM), which it said claimed responsibility for killing an Egyptian security officer and other attacks. \nThe State Department designations deny Haniyeh and the three groups access to the U.S. financial system. Reporting by Mohammad Zargham; Additional reporting by Nidal al-Mughrabi in Gaza; Editing by James Dalgleish", "external_links": [], "published": "2018-01-31T19:14:00.000+02:00", "crawled": "2018-01-31T19:34:44.074+02:00", "highlightTitle": ""}