{"organizations": [], "uuid": "f71e803978f54dad1f59dffe93726ae6e8c29cc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-monotype-issues-statement-regarding-director-nominations.html", "country": "US", "domain_rank": 767, "title": "Monotype Issues Statement Regarding Director Nominations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-31T17:38:00.000+02:00", "replies_count": 0, "uuid": "f71e803978f54dad1f59dffe93726ae6e8c29cc1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-monotype-issues-statement-regarding-director-nominations.html", "ord_in_thread": 0, "title": "Monotype Issues Statement Regarding Director Nominations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WOBURN, Mass.--(BUSINESS WIRE)-- Monotype Imaging Holdings Inc. (Nasdaq:TYPE) (“Monotype”) today confirmed that Starboard Value LP (“Starboard”) has nominated individuals to stand for election to the Monotype Board of Directors. Three directors will be up for election at the 2018 Annual Meeting of Shareholders.\nMonotype issued the following statement:\nThe Monotype Board of Directors and management team value the views of shareholders, and in this spirit, we have had extensive discussions with Starboard since September 2017 to better understand its perspective. The Company’s goal has been to work with Starboard constructively, and we are disappointed that Starboard has chosen to take this path.\nMonotype is laser focused on creating long-term shareholder value through revenue growth, profit margin expansion and return of shareholder capital. Our financial results, which have sequentially improved throughout 2017, demonstrate that our plan has already started to drive improved performance. Notably, in the third quarter of 2017, we delivered better-than-expected net adjusted EBITDA of $15.9 million, or a 26% margin, and 12% pro forma revenue growth. We also recognize the need to adapt our capital allocation strategy, when appropriate, to maximize return on investment. For example, upon acquisition, we funded Olapic based on a rapid market growth scenario. However, we pledged to throttle back our investment if we did not see the rate of market uptake we originally anticipated. One year in, we have refined our focus and are leveraging the investments made to grow the business at about 15-30% annually, while significantly accelerating profitability. We believe this will have positive profit implications on Monotype as a whole as we continue to contribute to our overall revenue growth. We look forward to providing a more thorough update on our fourth quarter and full year 2017 earnings call.\nLooking ahead, we will continue our disciplined approach to capital investment with the goal of growing revenue, driving margin improvement and creating value for shareholders.\nThe Monotype Board of Directors regularly considers strategic options to create shareholder value. In July 2017 – well before Starboard filed its 13D publicly disclosing its ownership in Monotype – the Board decided to engage J.P. Morgan to explore and evaluate a broad range of strategic and financial alternatives to enhance shareholder value, including a possible merger or sale of the Company. The Company approached 28 potentially interested parties, including 18 strategic buyers and 10 financial buyers. Of those approached, 10 parties expressed interest and executed confidentiality agreements with Monotype, and nine of those parties received a management presentation. Management presentations took place between September 2017 and January 2018. Although several parties expressed preliminary interest in the Company during the process, ultimately, no definitive offers were received.\nFollowing this review, Monotype’s Board of Directors and management team believe that the best option for shareholders at this time is for Monotype to continue its focus on creating sustainable growth and expanding its profit margins by building on its current momentum in Creative Professional, growing Olapic profitably, expanding reach within the Global 2000 and deepening our relationships with our OEM customers. Consistent with its fiduciary duties, the Board and management team remain open to all potential value creating opportunities.\nThe Monotype Board comprises eight highly qualified and experienced directors who bring significant leadership and managerial experience in finance, software and product development and mobile technology, as well as marketing and agency experience leading to a deep understanding of both the OEM and Creative Professional markets that we serve. Since 2012, three new directors have joined the Board, including Scott Landers, the Company’s CEO. The Board regularly evaluates its composition to ensure it has the appropriate skills and experience necessary to drive growth and profitability and create value for all Monotype shareholders.\nIn an effort to avoid a costly proxy contest, the Monotype Board offered Starboard the opportunity to (1) add one Starboard nominee and choose one of three candidates identified by Monotype; and (2) enter into an NDA to discuss the strategic alternatives process and other Company updates in an effort to find a constructive path forward. Starboard summarily rejected both proposals. The Company consistently indicated its willingness to explore various other reconfigurations of the Board. Instead, Starboard insisted three unnamed candidates be added to the Board without giving Monotype consent rights, and stated that anything other than that configuration would be unacceptable. Rather than working collaboratively to reach a mutually agreeable resolution, as Monotype has repeatedly tried to do, Starboard has determined to wage a disruptive proxy contest.\nThe Board’s Nominating and Corporate Governance Committee will review any validly submitted nominees in accordance with the Company’s corporate governance guidelines, including its director nomination policy. The Board will present its formal recommendation regarding director nominees in the Company’s definitive proxy statement and other materials, to be filed with the Securities and Exchange Commission and mailed to all shareholders eligible to vote at the 2018 Annual Meeting. The Company has not yet scheduled its 2018 Annual Meeting of Shareholders.\nMonotype shareholders are not required to take any action at this time.\nJ.P. Morgan is acting as financial advisor to Monotype, and Goodwin Procter LLP is acting as legal advisor.\nAbout Monotype\nMonotype provides the design assets, technology and expertise that help create beautiful, authentic and impactful brands that customers will engage with and value, wherever they experience the brand, now and in the future. Further information is available at www.monotype.com . Follow Monotype on Twitter, Instagram and LinkedIn.\nMonotype is a trademark of Monotype Imaging Inc. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. ©2017 Monotype Imaging Holdings Inc. All rights reserved.\nForward-Looking Statements\nThis press release may contain forward-looking statements including those related to future revenues and operating results, the growth of the company’s business, the execution of the company’s capital allocation and funding strategies and anticipated business momentum that involve risks and uncertainties that could cause the company’s actual results to differ materially. Factors that might cause or contribute to such differences include, but are not limited to: risks associated with changes in the economic climate including decreased demand for the company’s products or products that incorporate the company’s solutions; risks associated with the company’s ability to adapt its products or services to new markets and to anticipate and quickly respond to evolving technologies and customer requirements; risks associated with the company’s development of and the market acceptance of new products, product features or services; risks associated with the company’s integration of the Olapic acquisition and the 2017 restructuring of the Olapic business; risks associated with the company’s ability to expand products and services offered through acquired companies; risks associated with increased competition in markets the company serves, including the risks that increased competition may result in the company’s inability to gain new customers, retain existing customers or may force the company to reduce prices; risks associated with the ownership and enforcement of the company’s intellectual property; and risks associated with geopolitical conditions and changes in the financial markets. Additional disclosure regarding these and other risks faced by the company is available in the company’s public filings with the Securities and Exchange Commission, including the risk factors included in the company’s Annual Report on Form 10-K for the year ended December 31, 2016 and subsequent filings. The forward-looking financial information set forth in this press release reflects estimates based on information available at this time. These amounts could differ from actual reported amounts to be included in the company’s future earnings releases and public filings. While the company may elect to update forward-looking statements at some point in the future, the company specifically disclaims any obligation to do so, even if an estimate changes.\nImportant Stockholder Information\nThe company plans to file with the Securities and Exchange Commission and mail to its stockholders a proxy statement in connection with the company’s 2018 Annual Meeting of Stockholders. The proxy statement will contain important information about the company, the 2018 Annual Meeting of Stockholders and related matters. INVESTORS AND STOCKHOLDERS ARE URGED TO READ THE PROXY STATEMENT AND ANY OTHER RELEVANT SOLICITATION MATERIALS WHEN THEY BECOME AVAILABLE BECAUSE THESE DOCUMENTS WILL CONTAIN IMPORTANT INFORMATION. The company, its directors and certain of its executive officers may be deemed to be participants in the solicitation of proxies from the company’s shareholders in connection with the matters to be considered at the company’s 2018 Annual Meeting. The proxy statement and other relevant solicitation materials (when they become available), and any and all documents filed by the company with the Securities and Exchange Commission, may be obtained by investors and stockholders free of charge on the Securities and Exchange Commission's web site at www.sec.gov . Copies will also be available at no charge on the company's website at www.monotype.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005837/en/\nMonotype Imaging Holdings Inc.\nAmy Aylward\nAmy.aylward@monotype.com\nor\nJoele Frank, Wilkinson Brimmer Katcher\nAndi Rose / Dan Moore\n212-355-4449\nSource: Monotype Imaging Holdings Inc.", "external_links": ["http://www.businesswire.com/news/home/20180131005837/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.monotype.com&esheet=51751487&newsitemid=20180131005837&lan=en-US&anchor=www.monotype.com&index=1&md5=89519c3dfc98e3ba0f9566f615f73de4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.monotype.com&esheet=51751487&newsitemid=20180131005837&lan=en-US&anchor=www.monotype.com&index=3&md5=959f129711b4e28fbcfc873e386be5d9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51751487&newsitemid=20180131005837&lan=en-US&anchor=www.sec.gov&index=2&md5=7b3ff6d6f5b8d6fb21290a39db222cbb"], "published": "2018-01-31T17:38:00.000+02:00", "crawled": "2018-01-31T18:37:00.005+02:00", "highlightTitle": ""}