{"organizations": [], "uuid": "9d7a42438db288bbf65eeaed3b975d1d1cc6fd3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-leading-technology-workforce-educator-galvanize-names-alfonso-rosabal-as-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Leading Technology Workforce Educator Galvanize Names Alfonso Rosabal as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T20:00:00.000+02:00", "replies_count": 0, "uuid": "9d7a42438db288bbf65eeaed3b975d1d1cc6fd3f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-leading-technology-workforce-educator-galvanize-names-alfonso-rosabal-as-chief-executive-officer.html", "ord_in_thread": 0, "title": "Leading Technology Workforce Educator Galvanize Names Alfonso Rosabal as Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "alfonso rosabal", "sentiment": "negative"}, {"name": "alfonso", "sentiment": "none"}, {"name": "galvanize", "sentiment": "none"}, {"name": "jim deters", "sentiment": "none"}, {"name": "rosabal", "sentiment": "none"}, {"name": "p. rosabal", "sentiment": "none"}], "locations": [{"name": "denver", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}], "organizations": [{"name": "galvanize board of directors", "sentiment": "none"}, {"name": "national cinemedia", "sentiment": "none"}, {"name": "co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER, Jan. 3, 2018 /PRNewswire/ -- Galvanize, a technology-enabled learning community that delivers the education, skills and platform to help people advance in key technical disciplines, today announced that Alfonso (\"Al\") P. Rosabal has been named as Chief Executive Officer. He will also join the Galvanize Board of Directors. Al was most recently Chief Operations Officer of National CineMedia in Denver, CO, a public media and advertising company with over a $1 billion market capitalization and an estimated $450 million in revenue. Rosabal comes to Galvanize at an exciting time of growth and innovation as the company completed 2017 with record revenue and continued growth across all its key business lines. Al succeeds Galvanize's founder, Jim Deters, who stepped down in July 2017.\n\"I am extremely excited to be joining Galvanize to help lead the company through its next phase of growth and to fulfill on the promise of providing individuals and companies with opportunities to excel in technology education and innovation,\" said Rosabal. \"As a first generation college graduate and the son of immigrants, I am keenly aware of the opportunity for effective education programs to harness an individual's true potential and enable employers to diversify their engineering workforces and skillsets. I also understand the critical role technology and technical skills are playing across every corner of the global workforce, and it will be my mission to match those needs with our resources at Galvanize.\"\nPrior to Galvanize, Al joined NCMI in 2010 as Chief Technology Officer and later became Chief Operations Officer, during which he led go-to-market strategies, technology, engineering, operations, media operations, affiliate management and digital products. Prior to NCMI he served in senior roles in the public sector as well as Fortune 500 companies, including as Chief Technology Officer for the City of Denver, and roles with Nextel, IBM and a JV with Ford Motor Company in England. He began his career developing software in the Air Force, and as a veteran and former officer understands how to engage, train and lead people. Al has a bachelor's degree in civil engineering from the United States Air Force Academy, an MBA in Finance from Boston University's Questrom School of Business, and has successfully completed executive programs such as the Yale CEO College, the Center for Creative Leadership (CCL), and an executive management program with the Robert H. Smith School of Business at the University of Maryland.\n\"Al will bring exceptional clarity of vision and sense of purpose to Galvanize as it continues to serve the technology education and training needs of consumers and enterprises,\" said Paul Mariani, General Partner with ABS Capital and Galvanize Board Director. \"Galvanize, through its eight campuses and online platforms, will continue to build the leading technology learning community and provide technology workforce and training programs through a growing list of Fortune 500 companies.\"\nDaniel Pianko, Managing Director with University Ventures and Galvanize Board Director added, \"Al has always been a mission driven leader. As Galvanize continues to grow and become a dominant player in the technology training ecosystem, Al's work with both the public and private sectors gives him a first-hand appreciation for how critical the Company's solution is and the bright growth opportunities that lie ahead.\"\nThe Company's offerings in software development, data science and machine learning directly address the increasing skills needed for developing tech talent in the global economy. By offering industry-aligned faculty and curriculum, Galvanize delivers strong educational outcomes while nurturing a community of innovators on its campuses. In October, Galvanize announced that it had raised an additional $7 million to fuel continued growth initiatives.\nAbout Galvanize\nGalvanize is a technology learning platform and community for data scientists, engineers and entrepreneurs. With eight campuses across the U.S., innovative startups, aspiring students, and large enterprises benefit from a dynamic learning community. Our faculty and flexible blended-learning platform, which combines online education and in-person training, provide the most relevant and in-demand technology skills for consumers and enterprise organizations. Galvanize members include first-time entrepreneurs, growing startups, and Fortune 500 companies looking to advance their technology skill sets. Become a member or enroll in a course by visiting the Galvanize website .\nView original content with multimedia: http://www.prnewswire.com/news-releases/leading-technology-workforce-educator-galvanize-names-alfonso-rosabal-as-chief-executive-officer-300576584.html\nSOURCE Galvanize", "external_links": ["http://www.prnewswire.com/news-releases/leading-technology-workforce-educator-galvanize-names-alfonso-rosabal-as-chief-executive-officer-300576584.html", "http://www.galvanize.com/"], "published": "2018-01-03T20:00:00.000+02:00", "crawled": "2018-01-03T22:58:37.000+02:00", "highlightTitle": ""}