{"organizations": [], "uuid": "5973b6b0057b79b6c4afdb167ca0552777771fc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221983988&w=1200&r=LYNXMPEE0D0MF", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-motor-rally-dakar/peterhansel-wins-stage-but-sainz-remains-well-ahead-idUKKBN1F30XX", "country": "US", "domain_rank": 408, "title": "Peterhansel wins stage but Sainz remains well ahead", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T23:43:00.000+02:00", "replies_count": 0, "uuid": "5973b6b0057b79b6c4afdb167ca0552777771fc5"}, "author": "", "url": "https://uk.reuters.com/article/uk-motor-rally-dakar/peterhansel-wins-stage-but-sainz-remains-well-ahead-idUKKBN1F30XX", "ord_in_thread": 0, "title": "Peterhansel wins stage but Sainz remains well ahead", "locations": [], "entities": {"persons": [{"name": "sainz", "sentiment": "negative"}, {"name": "peterhansel", "sentiment": "negative"}, {"name": "carlos sainz", "sentiment": "none"}, {"name": "dakar", "sentiment": "none"}, {"name": "jean paul cottret", "sentiment": "none"}, {"name": "stephane peterhansel", "sentiment": "none"}], "locations": [{"name": "dakar", "sentiment": "none"}, {"name": "bolivia", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "peru-bolivia-argentina dakar", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "uyuni", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "peugeot", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 9:44 PM / Updated 31 minutes ago Peterhansel wins stage but Sainz remains well ahead Reuters Staff 3   Reigning champion Stephane Peterhansel fought back to win the eighth stage of the Dakar Rally in Bolivia on Sunday but Peugeot team mate Carlos Sainz remained more than an hour clear of the field. Dakar Rally - 2018 Peru-Bolivia-Argentina Dakar rally - 40th Dakar Edition stage seven, La Paz to Uyuni - January 13, 2018. Stephane Peterhansel of France and co-pilot Jean Paul Cottret of France drive their Peugeot. REUTERS/Franck Fife/Pool \nPeterhansel lost an hour and 45 minutes repairing his car on Saturday when he hit a rock while leading, the Frenchman dropping to third place while Spaniard Sainz took over at the front. \nOn Sunday, in the longest special stage of the race and having to contend with high altitude and rain after a stopover without mechanical assistance, the 13-times champion known as ‘Mr Dakar’ secured the 40th stage win of his career. \nIt was also his second stage win of the current rally but, with Monday’s timed stage leading into Argentina cancelled due to weather conditions, he knew it was unlikely to make much of a difference. \n“At least we didn’t run into trouble, which is good,” he said of the 498-km special stage from the salt flats of Uyuni to Tupiza. \n“I‘m not back in the game, because we’re talking hours of time difference and I just got a few minutes back,” added Peterhansel. \n“Gaining two minutes on Nasser Al-Attiyah won’t bring us back into the game. It’s a pity that tomorrow’s stage has been cancelled because we needed every opportunity we could get our hands on to claw back time.” Dakar Rally - 2018 Peru-Bolivia-Argentina Dakar rally - 40th Dakar Edition stage seven, La Paz to Uyuni - January 13, 2018. Carlos Sainz of Spain and co-pilot Lucas Cruz of Spain drive their Peugeot. REUTERS/Franck Fife/Pool \nSainz was fifth on the stage, seven minutes and four seconds slower than Peterhansel, but remained an hour and six minutes clear of Qatari challenger Al-Attiyah in a Toyota. \nPeterhansel was an hour and 13 minutes off the lead. Slideshow (3 Images) \n“We’ll try to do our best in the next six days,” said Al-Attiyah, a two-times Dakar winner. “If Carlos makes a mistake, we can catch him. But one hour... it’s going to be difficult.” \nIn the motorcycle category, French Yamaha rider Adrien van Beveren remained in the lead but with a reduced advantage after a stage won by compatriot Antoine Meo on a KTM. \nVan Beveren is now just 22 seconds clear of Argentina’s Kevin Benavides. \nThe rally proper will resume on Tuesday for a stage between Salta and Belen. \nThe Dakar ends in Cordoba, Argentina, on Jan 20. Reporting by Alan Baldwin in London, editing by Clare Fallon", "external_links": [], "published": "2018-01-14T23:43:00.000+02:00", "crawled": "2018-01-15T00:21:30.015+02:00", "highlightTitle": ""}