{"organizations": [], "uuid": "627fd3b95746bd0a3e3ee1870f3b10c4ae1d1729", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224397247&w=1200&r=LYNXMPEE0M0EI", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-taiwan-china/taiwan-president-says-does-not-exclude-possibility-of-china-attack-idUKKBN1FC0QI", "country": "US", "domain_rank": 408, "title": "Taiwan president says does not exclude possibility of China attack", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T09:53:00.000+02:00", "replies_count": 0, "uuid": "627fd3b95746bd0a3e3ee1870f3b10c4ae1d1729"}, "author": "", "url": "https://uk.reuters.com/article/uk-taiwan-china/taiwan-president-says-does-not-exclude-possibility-of-china-attack-idUKKBN1FC0QI", "ord_in_thread": 0, "title": "Taiwan president says does not exclude possibility of China attack", "locations": [], "entities": {"persons": [{"name": "tsai", "sentiment": "none"}, {"name": "tsai ing-wen", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "taipei", "sentiment": "none"}, {"name": "taipei", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "democratic progressive party", "sentiment": "none"}, {"name": "communist party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 7:58 AM / Updated 3 hours ago Taiwan president says does not exclude possibility of China attack Reuters Staff 3 Min Read \nTAIPEI (Reuters) - Taiwan President Tsai Ing-wen said that she does not exclude the possibility of China attacking the self-ruled island, amid heightened tensions between the two sides including an increasing number of Chinese military drills near Taiwan. \nBeijing has taken an increasingly hostile stance towards Taiwan, which it considers a breakaway province, since the election two years ago of Tsai of the pro-independence Democratic Progressive Party. \nChina suspects Tsai wants to push for formal independence, a red line for Communist Party leaders in Beijing, though she has said she wants to maintain the status quo and is committed to ensuring peace. \nIn recent months, China has stepped up military drills around Taiwan, alarming Taipei. China says the exercises are routine, but that it will not tolerate any attempt by the island to declare independence. \n“No one can exclude this possibility. We will need to see whether their policymakers are reasonable policymakers or not,” Tsai said in an interview on Taiwan television broadcast late on Monday, when asked whether China could attack Taiwan. \n“When you consider it (Taiwan-China relationship) from a regional perspective, any reasonable policymaker will have to very carefully deliberate as to whether launching war is an option,” Tsai said. \n“When our government faces resistance and pressure from China, we will find our method to resist this. This is very important,” she added. \n“In terms of China circulating around Taiwan or carrying out other military activities, our military is carefully following every action and movement in the scope of its monitoring,” Tsai said. “Our military is very confident to face these situations.” \nChina considers proudly democratic Taiwan to be its sacred territory and has never renounced the use of force to bring it under Chinese control. \nTaiwan and China have also traded accusations this month about China’s opening of new civilian aviation routes close to Taiwan-controlled islands in the Taiwan Strait. \nAlthough China has cut off a formal dialogue mechanism with Taiwan, Tsai acknowledged that both sides currently have a method for communications to avoid misunderstanding. \nTaiwan has been pressing for the United States, its main source of arms, to provide more advanced equipment, but has also been trying to bolster its own weapons programmes, to avoid what Tsai termed “certain political difficulties” that come with buying weapons overseas in the teeth of Chinese opposition. \nTsai said she believed one day Taiwan would be able to produce its own submarines, an item Taipei has long pressed for to face China’s navy. \nChina’s Taiwan Affairs Office did not immediately respond to a request for comment on Tsai’s remarks. Reporting by Jess Macy Yu; Additional reporting by Ben Blanchard in BEIJING; Editing by Nick Macfie", "external_links": [], "published": "2018-01-23T09:53:00.000+02:00", "crawled": "2018-01-23T10:18:19.004+02:00", "highlightTitle": ""}