{"organizations": [], "uuid": "0462a7b3fa7d0a11abdbca578a90729175fbb5fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-t-rowe-price-group-reports-fourth-quarter-2017-results.html", "country": "US", "domain_rank": 767, "title": "T. Rowe Price Group Reports Fourth Quarter 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:30:00.000+02:00", "replies_count": 0, "uuid": "0462a7b3fa7d0a11abdbca578a90729175fbb5fb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-t-rowe-price-group-reports-fourth-quarter-2017-results.html", "ord_in_thread": 0, "title": "T. Rowe Price Group Reports Fourth Quarter 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "baltimore", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "t. rowe price group reports fourth", "sentiment": "negative"}, {"name": "t. rowe price group, inc.", "sentiment": "neutral"}, {"name": "dell", "sentiment": "none"}, {"name": "t. rowe price", "sentiment": "none"}, {"name": "non-gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BALTIMORE, T. Rowe Price Group, Inc. (NASDAQ-GS: TROW) today reported its fourth quarter of 2017 results, including net revenues of $1.3 billion, net income of $347.1 million, and diluted earnings per common share of $1.37. For the fourth quarter of 2016, net revenues were $1.1 billion, net income was $379.8 million, and diluted earnings per common share was $1.50. On a non-GAAP basis, diluted earnings per share for the fourth quarter of 2017 was $1.52, compared with $1.21 in the 2016 quarter.\nFinancial Highlights\nThe table below presents financial results on a U.S. GAAP basis as well as a non-GAAP basis that adjusts for the impact of the Dell appraisal rights matter, the consolidated T. Rowe Price investment products, the supplemental savings plan, other non-operating income, and the non-recurring charge recognized in 2017 related to the enactment of U.S. tax reform. The firm believes the non-GAAP financial measures below provide relevant and meaningful information to investors about its core operating results.\nThree months ended\nYear ended\n(in millions, except per-share data)\n12/31/2016\n12/31/2017\n%\nchange\n12/31/2016\n12/31/2017\n%\nchange\nU.S. GAAP basis\nInvestment advisory fees\n$\n966.8\n$\n1,156.0\n19.6\n%\n$\n3,728.7\n$\n4,287.7\n15.0\n%\nNet revenues\n$\n1,091.2\n$\n1,286.1\n17.9\n%\n$\n4,222.9\n$\n4,793.0\n13.5\n%\nOperating expenses\n$\n527.9\n$\n755.1\n43.0\n%\n$\n2,489.5\n$\n2,684.2\n7.8\n%\nNet operating income\n$\n563.3\n$\n531.0\n(5.7)\n%\n$\n1,733.4\n$\n2,108.8\n21.7\n%\nNon-operating income (1)\n$\n12.2\n$\n102.0\nn/m\n$\n227.1\n$\n396.3\n74.5\n%\nNet income attributable to T. Rowe Price\nGroup\n$\n379.8\n$\n347.1\n(8.6)\n%\n$\n1,215.0\n$\n1,497.8\n23.3\n%\nDiluted earnings per common share\n$\n1.50\n$\n1.37\n(8.7)\n%\n$\n4.75\n$\n5.97\n25.7\n%\nWeighted average common shares\noutstanding assuming dilution\n246.8\n247.7\n.4\n%\n250.3\n245.1\n(2.1)\n%\nAdjusted - non-GAAP basis (2)\nOperating expenses\n$\n626.0\n$\n747.7\n19.4\n%\n$\n2,416.8\n$\n2,715.8\n12.4\n%\nNet income attributable to T. Rowe Price\nGroup\n$\n304.7\n$\n383.9\n26.0\n%\n$\n1,148.9\n$\n1,361.1\n18.5\n%\nDiluted earnings per common share\n$\n1.21\n$\n1.52\n25.6\n%\n$\n4.49\n$\n5.43\n20.9\n%\nAssets under Management (in billions)\nAverage assets under management\n$\n807.6\n$\n976.4\n20.9\n%\n$\n778.2\n$\n909.0\n16.8\n%\nEnding assets under management\n$\n810.8\n$\n991.1\n22.2\n%\n$\n810.8\n$\n991.1\n22.2\n%\n(1)\nThe percentage change in non-operating income for the three-months ended is not meaningful (n/m).\n(2)\nSee the reconciliation to the comparable U.S. GAAP measures at the end of this earnings release\nAssets Under Management\nAssets under management increased $43.2 billion in the fourth quarter of 2017 to $991.1 billion at December 31, 2017. The firm's net cash inflows were $3.7 billion in the fourth quarter of 2017, inclusive of $4.2 billion of client transfers from the T. Rowe Price U.S. mutual funds to other investment products. The components of the change in assets under management are shown in the table below.\nThree months ended 12/31/2017\nYear ended 12/31/2017\n(in billions)\nT. Rowe\nPrice U.S.\nmutual\nfunds\nOther\ninvestment\nproducts\nTotal\nT. Rowe\nPrice U.S.\nmutual\nfunds\nOther\ninvestment\nproducts\nTotal\nAssets under management at\nbeginning of period\n$\n585.3\n$\n362.6\n$\n947.9\n$\n514.2\n$\n296.6\n$\n810.8\nNet cash flows before client\ntransfers\n2.0\n1.7\n3.7\n9.4\n4.6\n14.0\nClient transfers\n(4.2)\n4.2\n—\n(20.2)\n20.2\n—\nNet cash flows after client transfers\n(2.2)\n5.9\n3.7\n(10.8)\n24.8\n14.0\nNet market appreciation and income\n24.5\n16.3\n40.8\n104.6\n63.4\n168.0\nDistributions not reinvested\n(1.3)\n—\n(1.3)\n(1.7)\n—\n(1.7)\nChange during the period\n21.0\n22.2\n43.2\n92.1\n88.2\n180.3\nAssets under management at\nDecember 31, 2017\n$\n606.3\n$\n384.8\n$\n991.1\n$\n606.3\n$\n384.8\n$\n991.1\nThe firm's net cash flows were in the following asset classes:\n(in billions)\nThree\nmonths\nended\n12/31/2017\nYear ended\n12/31/2017\nStock and blended asset\n$\n(.9)\n$\n(6.8)\nBond, money market, and stable value\n4.6\n20.8\nTotal net cash flows\n$\n3.7\n$\n14.0\nNet cash flows into the firm's target date retirement products were $.7 billion in the fourth quarter of 2017 and $7.1 billion in the full year of 2017. The asset class net cash flows above include, in addition to net client flows, rebalancing within the target date products in order to maintain their targeted asset allocations.\nThe firm's assets under management by asset class and in the firm's retirement date products are as follows:\n(in billions)\nAs of\n12/31/2016\n12/31/2017\nStock and blended asset\n$\n622.1\n$\n772.4\nBond, money market, and stable value\n188.7\n218.7\n$\n810.8\n$\n991.1\nTarget date retirement products\n$\n189.2\n$\n232.1\nInvestors domiciled outside the United States accounted for about 6% of the firm's assets under management at December 31, 2017, up from about 5% at December 31, 2016.\nCapital Management\nT. Rowe Price remains debt-free with ample liquidity, including cash and investments in T. Rowe Price products as follows:\n(in billions)\n12/31/2016\n12/31/2017\nCash and cash equivalents\n$\n1,204.9\n$\n1,902.7\nDiscretionary investments\n700.6\n780.3\nTotal cash and discretionary investments\n1,905.5\n2,683.0\nRedeemable seed capital investments\n1,263.8\n1,188.9\nInvestments used to hedge the supplemental savings plan liability\n—\n268.2\nTotal cash and investments in T. Rowe Price products\n$\n3,169.3\n$\n4,140.1\nThe firm's common shares outstanding were 245.1 million at December 31, 2017, compared with 244.8 million at December 31, 2016, as the firm issued more shares from the exercise and vesting of equity awards than the firm repurchased in 2017. The firm expended $458.1 million in 2017 to repurchase 6.6 million shares, or 2.7%, of its outstanding common shares, including $1.4 million to repurchase 15,000 shares during the fourth quarter of 2017. The firm invested $186.1 million during 2017 in capitalized facilities and technology, and expects capital expenditures for 2018 to be about $180 million, of which about two-thirds is planned for technology initiatives. These expenditures are expected to continue to be funded from operating resources.\nInvestment Performance\nThe percentage of T. Rowe Price U.S. mutual funds (across share classes) that outperformed their comparable Lipper averages on a total return basis and that are in the top Lipper quartile for the one-, three-, five-, and 10-years ended December 31, 2017, were:\n1 year\n3 years\n5 years\n10 years\nOutperformed Lipper averages\nAll funds\n72%\n84%\n82%\n81%\nAsset allocation funds\n86%\n97%\n93%\n93%\nTop Lipper quartile\nAll funds\n38%\n50%\n55%\n57%\nAsset allocation funds\n59%\n60%\n82%\n86%\nIn addition, 88% of the firm's rated T. Rowe Price U.S. mutual funds' assets under management ended the quarter with an overall rating of four or five stars from Morningstar. The performance of the firm's institutional strategies against their benchmarks remains very competitive, especially over longer time periods.\nFinancial Results\nInvestment advisory revenues earned in the current quarter from the T. Rowe Price U.S. mutual funds were $817.9 million, an increase of 16.7% from the comparable 2016 quarter. Average assets under management in these funds increased 17.1% to $600.6 billion.\nInvestment advisory revenues earned in the current quarter from other investment products were $338.1 million, an increase of 27.1% from the comparable 2016 quarter. Average assets under management for these products increased 27.5% to $375.8 billion.\nOperating expenses were $755.1 million in the fourth quarter of 2017 compared with $527.9 million in the fourth quarter of 2016. The fourth quarter of 2016 operating expenses were reduced by the recognition of the $100 million insurance recovery related to the Dell appraisal rights matter. For the year, operating expenses were $2,684.2 million in 2017 compared with $2,489.5 million in 2016. On a non-GAAP basis, the firm's operating expenses in the fourth quarter of 2017 increased 19.4% to $747.7 million, and for the year increased 12.4% to $2,715.8 million. This 12.4% increase was primarily due to market driven expenses and continued strategic spend in light of strong markets and early successes of the firm's investments.\nThe firm currently expects 2018 non-GAAP operating expense growth to lessen relative to 2017, even as growth in market driven expenses and investments in the business continue. However, the firm could elect to adjust its expense growth should markets increase or decline significantly. In addition, other events not currently planned or expected could impact the firm's expense level in 2018. The firm is carefully evaluating the impact the U.S. tax reform will have on the firm, and factoring in the potential investment, operating expense, and capital management implications.\nCompensation and related costs were $446.3 million in the current quarter, an increase of 17.0% over the fourth quarter of 2016, due primarily to additional headcount, an increase in the interim accrual of the annual bonus to reward strong performance, and higher benefits. Higher benefit expenses primarily relate to an increase in health care costs, greater payroll taxes resulting from the impact the firm's higher stock price had on equity based awards, and additional compensation expense related to the supplemental savings plan as stronger equity markets have increased the liability. Average staff size increased by 9.0% from the fourth quarter of 2016, and the firm employed 6,881 associates at December 31, 2017, an increase of 552 associates from the end of 2016.\nAdvertising and promotion costs were $33.8 million in the current quarter, an increase of 24.3% over the fourth quarter of 2016. For the full year, advertising and promotion costs increased 15.1% over the 2016 year. The firm increased its spend in 2017 in support of efforts to broaden its distribution reach and in response to investor sentiment and the strong market environment.\nOccupancy and facility costs, together with depreciation expense, were $90.4 million in the current quarter, an increase of 14.9% compared to the fourth quarter of 2016. The increase is due primarily to added costs to update and enhance technology capabilities, including related maintenance programs, as well as expanded office facilities and new locations.\nOther operating expenses were $146.6 million in the current quarter, an increase of 39.8% from the comparable 2016 quarter. The increase was a result of the firm's investment in its strategic initiatives, higher distribution and client servicing costs driven by the strong market performance, and other growing operational and regulatory business demands.\nNet non-operating income was $102.0 million in the current quarter, an increase of $89.8 million from the fourth quarter of 2016. The increase was driven primarily by higher investment income resulting from the strong market performance in 2017. The components of net non-operating income for the quarters as well as the full-years ended December 31, 2016 and 2017 are included in the tables at the back of this release.\nThe firm's income tax provision for the fourth quarter of 2017 includes a non-recurring charge of $71.1 million to reflect the estimated effect of the U.S. tax law changes enacted on December 22, 2017. The recognized charge is based on current interpretation of the tax law changes, and includes $18.9 million for the remeasurement of the firm's deferred tax assets and liabilities, and a $52.2 million tax liability for the mandatory deemed repatriation of foreign sourced net earnings. The increase in the firm's 2017 effective tax rate resulting from this charge was offset in part by higher than expected tax benefits related to the exercise of stock options, vesting of restricted stock, and net income attributable to redeemable non-controlling interests, which is not taxable to the firm. The following reconciles the statutory federal income tax rate to the firm's effective tax rate for the full-year 2017:\nStatutory U.S. federal income tax rate\n35.0\n%\nImpact of U.S. tax reform\n2.9\n%\nState income taxes for current year, net of federal income tax benefits (1)\n3.9\n%\nNet income attributable to redeemable non-controlling interests\n(1.3)\n%\nNet excess tax benefits from stock-based compensation plans activity\n(3.0)\n%\nOther items\n(.6)\n%\nEffective income tax rate\n36.9\n%\n(1)\nState income benefits totaling (.4)% are reflected in the total benefits for net income attributable to redeemable non-controlling interests and stock-based compensation plans activity.\nThe firm estimates that the reduction in the U.S. corporate tax rate (from 35% to 21%) in 2018, combined with other miscellaneous tax changes that effect certain tax deductions, will reduce its 2018 effective tax rate to a range of 24.0% to 27.0%.\nManagement Commentary\nWilliam J. Stromberg, the company's president and chief executive officer, commented: \"Capping a year of strong gains, U.S. stocks again rose in the fourth quarter, pushing most major indexes further into record territory. Led by emerging markets, international stocks continued their strong run, outperforming U.S. shares in 2017. In global fixed income markets, non-U.S., emerging markets, and high yield debt led the way for the quarter and year, supported by solid credit fundamentals.\n\"This was a very good quarter and year for T. Rowe Price, our clients, and our stockholders. Strong relative investment performance, robust markets, and healthy client activity boosted our assets under management by 22% in 2017, including 5% in the fourth quarter. Reflecting increased demand for our approach to active management, and our success in broadening our product offerings and distribution capabilities, our net flows and organic growth reached their highest annual levels since 2012. The strength of our core business and early success of our strategic efforts also is reflected in the diversity of these flows across geographies and asset classes, including positive flows for our international equity, fixed income, and multi-asset strategies.\n\"As we continue to advance our strategic priorities, we are encouraged by the progress we are making to add new capabilities and by the significant client interest we are experiencing. Recent highlights include:\nMulti-Asset Investing - On the continued strength of investment performance, T. Rowe Price remains a leader in the active target date space. We have more than doubled the size of our dedicated multi-asset investment professional staff in the past two years and in 2017 further built out our solutions capabilities with several senior hires across the globe. We also remain on track for several upcoming product launches. U.S. Intermediary and Institutional Distribution - We continued to extend our leadership position with U.S. intermediaries and saw the early impact of last year's 20% expansion in the number of client-facing associates in this area. Flows through no transaction fee platforms remained strong and diverse across asset classes. We planted the seeds for future managed accounts activity by adding three more equity strategies to our model portfolio and retail separately managed account lineups. On the institutional side, we saw continued growth in our DCIO business, also supported by an expansion of client-facing resources. EMEA and Asia Pacific Distribution - The extension of our vehicle lineups continue, and we have expanded our local distribution resources. This has contributed to new and expanded client engagements, including the launch of two multi-asset Target Income funds in partnership with a key client in South Korea. Client Experience and Technology - Work is advancing in our Maryland Innovation Center to use technology and agile processes to accelerate delivery of redesigned and improved digital client experiences for individual investors and retirement plan participants. We saw initial success with these initiatives in 2017, and plan to expand these efforts in 2018. This work complements our progress in leveraging advanced analytics and machine learning to enhance customer segmentation and augment our investment process.\n\"We are confident that the hard work of our associates will enable us to be competitive and continue to grow and diversify the company on a global basis. We are well positioned to invest for the future and to create additional long-term value for our clients and our stockholders.\"\nOther Matters\nThe financial results presented in this release are unaudited. KPMG LLP is currently completing its audits of the firm's 2017 consolidated financial statements and internal controls over financial reporting at December 31, 2017. The firm expects that KPMG will complete its work in mid-February and that it will then file its Form 10-K Annual Report for 2017 with the U.S. Securities and Exchange Commission. The Form 10-K will include additional information, including the firm's audited consolidated financial statements, management's report on internal controls over financial reporting at December 31, 2017, and the reports of KPMG.\nCertain statements in this earnings release may represent \"forward-looking information,\" including information relating to anticipated changes in revenues, net income and earnings per common share, anticipated changes in the amount and composition of assets under management, anticipated expense levels, estimated tax rates, and expectations regarding financial results, future transactions, new products and services, investments, capital expenditures, dividends, stock repurchases, and other market conditions. For a discussion concerning risks and other factors that could affect future results, see the firm's 2016 Form 10-K and subsequent Form 10Q reports.\nFounded in 1937, Baltimore-based T. Rowe Price ( troweprice.com ) is a global investment management organization that provides a broad array of mutual funds, subadvisory services, and separate account management for individual and institutional investors, retirement plans, and financial intermediaries. The organization also offers a variety of sophisticated investment planning and guidance tools. T. Rowe Price's disciplined, risk-aware investment approach focuses on diversification, style consistency, and fundamental research.\nUnaudited Consolidated Statements of Income\n(in millions, except per-share amounts)\nThree months ended\nYear ended\nRevenues\n12/31/2016\n12/31/2017\n12/31/2016\n12/31/2017\nInvestment advisory fees\n$\n966.8\n$\n1,156.0\n$\n3,728.7\n$\n4,287.7\nAdministrative fees\n88.9\n92.1\n352.5\n358.3\nDistribution and servicing fees\n35.5\n38.0\n141.7\n147.0\nNet revenues\n1,091.2\n1,286.1\n4,222.9\n4,793.0\nOperating expenses\nCompensation and related costs\n381.6\n446.3\n1,494.0\n1,664.9\nAdvertising and promotion\n27.2\n33.8\n79.9\n92.0\nDistribution and servicing costs\n35.5\n38.0\n141.7\n147.0\nDepreciation and amortization of property and equipment\n33.4\n36.7\n133.4\n143.6\nOccupancy and facility costs\n45.3\n53.7\n172.8\n194.9\nOther operating expenses\n104.9\n146.6\n401.5\n491.8\nNonrecurring charge (insurance recoveries) related to Dell appraisal rights\nmatter\n(100.0)\n—\n66.2\n(50.0)\nTotal operating expenses\n527.9\n755.1\n2,489.5\n2,684.2\nNet operating income\n563.3\n531.0\n1,733.4\n2,108.8\nNon-operating income\nNet investment income on non-consolidated investments\n16.9\n33.2\n108.0\n198.3\nNet investment income on consolidated T. Rowe Price investment products\n(2.9)\n68.1\n121.1\n193.9\nOther income\n(1.8)\n.7\n(2.0)\n4.1\nTotal non-operating income\n12.2\n102.0\n227.1\n396.3\nIncome before income taxes\n575.5\n633.0\n1,960.5\n2,505.1\nProvision for income taxes\n208.7\n246.4\n706.5\n923.9\nNet income\n366.8\n386.6\n1,254.0\n1,581.2\nLess: net income attributable to redeemable non-controlling interests\n(13.0)\n39.5\n39.0\n83.4\nNet income attributable to T. Rowe Price Group\n379.8\n347.1\n1,215.0\n1,497.8\nLess: net income allocated to outstanding restricted stock and stock unit\nholders\n8.4\n7.9\n25.5\n33.9\nNet income allocated to T. Rowe Price Group common stockholders\n$\n371.4\n$\n339.2\n$\n1,189.5\n$\n1,463.9\nEarnings per share on common stock of T. Rowe Price Group\nBasic\n$\n1.53\n$\n1.40\n$\n4.85\n$\n6.07\nDiluted\n$\n1.50\n$\n1.37\n$\n4.75\n$\n5.97\nWeighted-average common shares\nOutstanding\n242.6\n242.5\n245.5\n241.2\nOutstanding assuming dilution\n246.8\n247.7\n250.3\n245.1\nDividends declared per share\n$\n.54\n$\n.57\n$\n2.16\n$\n2.28\nInvestment Advisory Revenues (in millions)\nThree months ended\nYear ended\n12/31/2016\n12/31/2017\n12/31/2016\n12/31/2017\nT. Rowe Price U.S. mutual funds\nStock and blended asset\n$\n578.2\n$\n691.4\n$\n2,228.1\n$\n2,570.9\nBond and money market\n122.5\n126.5\n477.3\n501.0\n700.7\n817.9\n2,705.4\n3,071.9\nOther investment products\nStock and blended asset\n219.9\n281.6\n850.3\n1,009.4\nBond, money market, and stable value\n46.2\n56.5\n173.0\n206.4\n266.1\n338.1\n1,023.3\n1,215.8\nTotal\n$\n966.8\n$\n1,156.0\n$\n3,728.7\n$\n4,287.7\nAssets Under Management (in billions)\nAverage during\nThree months ended\nYear ended\nAs of\n12/31/2016\n12/31/2017\n12/31/2016\n12/31/2017\n12/31/2016\n12/31/2017\nBy investment vehicle\nT. Rowe Price U.S. mutual funds\nStock and blended asset\n$\n400.1\n$\n475.3\n$\n386.1\n$\n447.5\n$\n401.3\n$\n480.5\nBond and money market\n112.7\n125.3\n109.4\n121.0\n112.9\n125.8\n512.8\n600.6\n495.5\n568.5\n514.2\n606.3\nOther investment products\nStock and blended asset\n219.6\n284.4\n211.1\n256.4\n220.8\n291.9\nBond, money market, and stable value\n75.2\n91.4\n71.6\n84.1\n75.8\n92.9\n294.8\n375.8\n282.7\n340.5\n296.6\n384.8\nTotal\n$\n807.6\n$\n976.4\n$\n778.2\n$\n909.0\n$\n810.8\n$\n991.1\nAs of\nBy asset class\n12/31/2016\n12/31/2017\nEquity\n$\n450.6\n$\n564.1\nFixed income\n121.2\n134.4\nAsset Allocation\n239.0\n292.6\nTotal assets under management\n$\n810.8\n$\n991.1\nNet Cash Flows After Client Transfers (in billions)\nThree\nmonths\nended\n12/31/2017\nYear ended\n12/31/2017\nT. Rowe Price U.S. mutual funds\nStock and blended asset funds\n$\n(4.0)\n$\n(18.9)\nBond funds\n2.6\n6.9\nMoney market funds\n(.8)\n1.2\n(2.2)\n(10.8)\nOther investment products\nStock and blended assets\n3.1\n12.1\nFixed income, money market, and stable value\n2.8\n12.7\n5.9\n24.8\nTotal net cash flows after client transfers\n$\n3.7\n$\n14.0\nNet Non-Operating Income (in millions)\nThree months ended\nYear ended\n12/31/2016\n12/31/2017\n12/31/2016\n12/31/2017\nNet investment income on non-consolidated T. Rowe Price\ninvestment products\nNet realized gains on dispositions of available-for-sale\ninvestments\n$\n.7\n$\n5.1\n$\n53.0\n$\n83.1\nOrdinary and capital gain dividend distributions\n11.1\n11.0\n16.1\n22.2\nDividends and unrealized gains on investment products used to\nhedge the supplemental savings plan liability\n—\n6.2\n—\n12.3\nUnrealized gains on equity method and other trading\ninvestments\n(1.0)\n6.5\n20.8\n32.5\nGains reclassified from accumulated other comprehensive\nincome upon transfer of an available-for-sale sponsored\ninvestment portfolio to sponsored investment portfolios held as\ntrading\n—\n—\n—\n23.6\nNet gain recognized upon deconsolidation\n1.1\n—\n2.2\n.1\nTotal investment income from non-consolidated T. Rowe Price\ninvestment products\n11.9\n28.8\n92.1\n173.8\nNet investment income on consolidated T. Rowe Price investment\nproducts\n(2.9)\n68.1\n121.1\n193.9\nOther investment income\n5.0\n4.4\n15.9\n24.5\nOther income (expenses), including foreign currency gains and\nlosses\n(1.8)\n.7\n(2.0)\n4.1\nNet non-operating income\n$\n12.2\n$\n102.0\n$\n227.1\n$\n396.3\nUnaudited Condensed Consolidated Cash Flows Information (in millions)\nYear ended\n12/31/2016\n12/31/2017\nCash flow\nattributable to\nT. Rowe\nPrice Group\nCash flow\nattributable to\nconsolidated\nT. Rowe Price\ninvestment\nproducts, net\nof eliminations\nAs\nreported on\nstatement\nof cash\nflows\nCash flow\nattributable to\nT. Rowe\nPrice Group\nCash flow\nattributable to\nconsolidated\nT. Rowe Price\ninvestment\nproducts, net\nof eliminations\nAs\nreported on\nstatement\nof cash\nflows\nCash provided by (used in) operating\nactivities, including $152 of stock-based\ncompensation expense and $150 related\nto the Dell appraisal rights matter\nattributable to T. Rowe Price Group in\n2017\n$\n1,343.7\n$\n(1,173.2)\n$\n170.5\n$\n1,551.8\n$\n(1,322.3)\n$\n229.5\nCash provided by (used in) investing\nactivities, including ($186) for additions\nto property and equipment and $335 of\nproceeds from the sale of available-for-\nsale investments attributable to T. Rowe\nPrice Group in 2017\n(219.7)\n325.9\n106.2\n(33.9)\n72.9\n39.0\nCash provided by (used in) financing\nactivities, including T. Rowe Price Group\ncommon stock repurchases of $(458)\nand dividends paid of $(563) in 2017\n(1,091.4)\n915.0\n(176.4)\n(820.1)\n1,281.6\n461.5\nEffect of exchange rate changes on cash\nand cash equivalents\n—\n(2.1)\n(2.1)\n—\n5.3\n5.3\nNet change in cash and cash\nequivalents during period\n$\n32.6\n$\n65.6\n$\n98.2\n$\n697.8\n$\n37.5\n$\n735.3\nUnaudited Condensed Consolidated Balance Sheet Information (in millions)\nAs of\n12/31/2016\n12/31/2017\nCash and cash equivalents\n$\n1,204.9\n$\n1,902.7\nAccounts receivable and accrued revenue\n455.1\n556.7\nInvestments\n1,257.5\n1,477.3\nAssets of consolidated T. Rowe Price investment products\n1,680.5\n2,048.4\nProperty and equipment, net\n615.1\n652.0\nGoodwill\n665.7\n665.7\nOther assets\n346.2\n231.9\nTotal assets\n6,225.0\n7,534.7\nTotal liabilities, includes $65.6 at December 31, 2016, and $55.9 at December 31, 2017, from\nconsolidated T. Rowe Price investment products\n529.2\n717.5\nRedeemable non-controlling interests\n687.2\n992.8\nStockholders' equity, 245.1 common shares outstanding at December 31, 2017, includes net unrealized\nholding gains of $7.9 at December 31, 2017\n$\n5,008.6\n$\n5,824.4\nCash, Cash Equivalents, and Investments Information (in millions)\nInterest Held by T. Rowe Price Group\nCash and\ndiscretionary\ninvestments\nin T. Rowe\nPrice\nproducts\nSeed capital\ninvestments\nin T. Rowe\nPrice\ninvestment\nproducts\nInvestments\nin T. Rowe\nPrice\nproducts used\nto hedge\nsupplemental\nsavings plan\nInvestment\nin UTI and\nother\ninvestments\nTotal\nRedeemable\nnon-\ncontrolling\ninterests\nAs reported\non\nconsolidated\nbalance\nsheet\n12/31/2017\nCash and cash equivalents\n$\n1,902.7\n$\n—\n$\n—\n$\n—\n$\n1,902.7\n$\n—\n$\n1,902.7\nInvestments\n669.7\n299.8\n268.2\n239.6\n1,477.3\n—\n1,477.3\nNet assets of consolidated\nT. Rowe Price investment\nproducts\n110.6\n889.1\n—\n—\n999.7\n992.8\n1,992.5\n$\n2,683.0\n$\n1,188.9\n$\n268.2\n$\n239.6\n$\n4,379.7\n$\n992.8\n$\n5,372.5\nNon-GAAP Information and Reconciliation\nThe firm believes the non-GAAP financial measures below provide relevant and meaningful information to investors about its core operating results. These measures have been established in order to increase transparency for the purpose of evaluating the firm's core business, for comparing current results with prior period results, and to enable more appropriate comparison with industry peers. However, non-GAAP financial measures should not be considered as a substitute for financial measures calculated in accordance with U.S. GAAP and may be calculated differently by other companies. The following schedule (in millions, except for per-share amounts) reconciles U.S. GAAP financial measures to non-GAAP measures for the three months and year ended December 31, 2016 and 2017.\nThree months ended\nYear ended\n12/31/2016\n12/31/2017\n12/31/2016\n12/31/2017\nOperating expenses, GAAP basis\n$\n527.9\n$\n755.1\n$\n2,489.5\n$\n2,684.2\nNon-GAAP adjustments:\nExpenses of consolidated T. Rowe Price investment products, net of\nelimination of its related management fee (1)\n(1.9)\n(1.4)\n(6.5)\n(6.7)\nCompensation expense related to market valuation changes in\nsupplemental savings plan liability (2)\n—\n(6.0)\n—\n(11.7)\nInsurance recoveries (nonrecurring charge) related to Dell appraisal rights\nmatter (4)\n100.0\n—\n(66.2)\n50.0\nAdjusted operating expenses\n$\n626.0\n$\n747.7\n$\n2,416.8\n$\n2,715.8\nNet income attributable to T. Rowe Price Group, GAAP basis\n$\n379.8\n$\n347.1\n$\n1,215.0\n$\n1,497.8\nNon-GAAP adjustments:\nNet income of consolidated T. Rowe Price investment products, net of\nredeemable non-controlling interests (1)\n(7.0)\n(24.8)\n(69.1)\n(98.2)\nNon-operating income of investments designated as an economic hedge\nof supplemental savings plan liability less related compensation expense (2)\n—\n(.2)\n—\n(.6)\nNon-operating income, excluding impacts of consolidated T. Rowe Price\ninvestment products and investments designated as an economic hedge\nof supplemental savings plan liability (3)\n(15.1)\n(27.7)\n(106.0)\n(190.1)\nNonrecurring charge (insurance recoveries) related to Dell appraisal rights\nmatter (4)\n(100.0)\n—\n66.2\n(50.0)\nIncome tax impacts of non-GAAP adjustments before tax reform (5)\n47.0\n18.4\n42.8\n131.1\nImpact of U.S. tax reform (6)\n—\n71.1\n—\n71.1\nAdjusted net income attributable to T. Rowe Price Group\n$\n304.7\n$\n383.9\n$\n1,148.9\n$\n1,361.1\nDiluted earnings per common share, GAAP basis\n$\n1.50\n$\n1.37\n$\n4.75\n$\n5.97\nNon-GAAP adjustments:\nConsolidated T. Rowe Price investment products (1)\n(.02)\n(.06)\n(.16)\n(.24)\nNon-operating income, excluding impacts of consolidated T. Rowe Price\ninvestment products and investments designated as an economic hedge\nof supplemental savings plan liability (3)\n(.03)\n(.07)\n(.25)\n(.46)\nNonrecurring charge (insurance recoveries) related to Dell appraisal rights\nmatter (4)\n(.24)\n—\n.15\n(.12)\nImpact of U.S. tax reform (6)\n—\n.28\n—\n.28\nAdjusted diluted earnings per common share (7)\n$\n1.21\n$\n1.52\n$\n4.49\n$\n5.43\n(1)\nThe non-GAAP adjustments add back the management fees that the firm earns from the consolidated T. Rowe Price investment products and subtract the investment income and operating expenses of these products that have been included in the firm's U.S. GAAP consolidated statements of income. Management believes the consolidated T. Rowe Price investment products may impact the reader's ability to understand the firm's core operating results. The following table details the calculation of net income of consolidated T. Rowe Price investment products, net of redeemable non-controlling interests:\nThree months ended\nYear ended\n12/31/2016\n12/31/2017\n12/31/2016\n12/31/2017\nNet investment income\n$\n(2.9)\n$\n68.1\n$\n121.1\n$\n193.9\nOperating expenses\n(3.1)\n(3.8)\n(13.0)\n(12.3)\nNet income\n(6.0)\n64.3\n108.1\n181.6\nLess: net income attributable to redeemable non-controlling interests\n(13.0)\n39.5\n39.0\n83.4\nT. Rowe Price Group's portion of net income\n$\n7.0\n$\n24.8\n$\n69.1\n$\n98.2\n(2)\nThis non-GAAP adjustment removes the impact of market movements on the supplemental savings plan liability and related investments designated as economic hedges of the liability beginning July 1, 2017. Amounts deferred under the supplemental savings plan are adjusted for appreciation (depreciation) of hypothetical investments chosen by the employees. Since the firm economically hedges the exposure to these market movements, management believes it is useful to offset the non-operating investment income earned on the hedges against the related compensation expense to increase comparability period to period. The following table details the supplemental savings plan related items:\nThree months ended\nYear ended\n12/31/2016\n12/31/2017\n12/31/2016\n12/31/2017\nNon-operating income of investments designated as an economic\nhedge of supplemental savings plan liability\n$\n—\n$\n6.2\n$\n—\n$\n12.3\nCompensation expense from market valuation changes in supplemental\nsavings plan liability\n—\n(6.0)\n—\n(11.7)\nNon-operating income of investments designated as an economic\nhedge of supplemental savings plan liability less compensation expense\n$\n—\n$\n.2\n$\n—\n$\n.6\n(3)\nThis non-GAAP adjustment removes the non-operating income that remains after eliminating the portion related to the consolidated T. Rowe Price investment products and investments designated as an economic hedge of the firm's supplemental savings plan liability. Management believes excluding non-operating income helps the reader's ability to understand the firm's core operating results and increases comparability to prior years. Additionally, management does not emphasize the impact of non-operating income when managing the firm and evaluating its performance. The following table details the calculation of other non-operating income:\nThree months ended\nYear ended\n12/31/2016\n12/31/2017\n12/31/2016\n12/31/2017\nTotal non-operating income\n$\n12.2\n$\n102.0\n$\n227.1\n$\n396.3\nLess: net investment income of consolidated T. Rowe Price investment\nproducts\n(2.9)\n68.1\n121.1\n193.9\nLess: non-operating income from investments designated as an\neconomic hedge of supplemental savings plan liability\n—\n6.2\n—\n12.3\nTotal other non-operating income\n$\n15.1\n$\n27.7\n$\n106.0\n$\n190.1\n(4)\nIn the second quarter of 2016, the firm recognized a nonrecurring charge of $166.2 million related to the firm's decision to compensate certain clients in regard to the Dell appraisal rights matter. The firm also recognized an offset to this charge during the fourth quarter of 2016 for related insurance recoveries totaling $100 million. In the first quarter of 2017, the firm recognized additional insurance recoveries of $50 million as a reduction in operating expenses from claims that were filed in relation to the matter. Management believes it is useful to readers of the firm's consolidated statements of income to adjust for these charges and non-recurring insurance recoveries in arriving at adjusted operating expenses and net income attributable to T. Rowe Price Group and diluted earnings per share.\n(5)\nThese were calculated using the effective tax rate applicable to each non-GAAP adjustment before tax reform.\n(6)\nIn the fourth quarter of 2017, the firm recognized a nonrecurring charge of $71.1 million to reflect the effect of the U.S. tax law changes enacted on December 22, 2017. Management believes it is useful to readers of the firm's consolidated statements of income to adjust for this nonrecurring charge in arriving at net income attributable to T. Rowe Price Group and diluted earnings per share.\n(7)\nThis non-GAAP measure was calculated by applying the two-class method to adjusted net income attributable to T. Rowe Price Group divided by the weighted-average common shares outstanding assuming dilution.\n : releases/t-rowe-price-group-reports-fourth-quarter-2017-results-300590162.html\nSOURCE T. Rowe Price Group, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/t-rowe-price-group-reports-fourth-quarter-2017-results-300590162.html"], "published": "2018-01-30T15:30:00.000+02:00", "crawled": "2018-01-30T15:22:56.013+02:00", "highlightTitle": ""}