{"organizations": [], "uuid": "e45d1d2c546a680e9dffbde4768b8362dd47d9b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-icon-appoints-dr-james-cummings-as-president-of-clinicalrm.html", "country": "US", "domain_rank": 767, "title": "ICON Appoints Dr. James Cummings as President of ClinicalRM", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.144, "site_type": "news", "published": "2018-01-09T13:00:00.000+02:00", "replies_count": 0, "uuid": "e45d1d2c546a680e9dffbde4768b8362dd47d9b3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-icon-appoints-dr-james-cummings-as-president-of-clinicalrm.html", "ord_in_thread": 0, "title": "ICON Appoints Dr. James Cummings as President of ClinicalRM", "locations": [], "entities": {"persons": [{"name": "james cummings", "sentiment": "negative"}, {"name": "victoria tifft", "sentiment": "none"}, {"name": "cummings", "sentiment": "none"}], "locations": [{"name": "dublin", "sentiment": "none"}], "organizations": [{"name": "novavax, inc", "sentiment": "none"}, {"name": "u.s. federal health agencies", "sentiment": "none"}, {"name": "us army", "sentiment": "none"}, {"name": "geis", "sentiment": "none"}, {"name": "translational medicine & regulated activities for the walter reed army institute of research", "sentiment": "none"}, {"name": "department of defence", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBLIN--(BUSINESS WIRE)-- ICON plc, (NASDAQ: ICLR) a global provider of drug development solutions and services to the pharmaceutical, biotechnology and medical device industries, today announced the appointment of Dr. James Cummings as President of ClinicalRM. ClinicalRM is a wholly owned subsidiary of ICON plc, providing full service and functional research solutions to a range of U.S. Federal Health Agencies.\nDr. Cummings has over 20 years’ experience within the global health and government research and development industries. He is a vaccine and infectious disease specialist and most recently led the Influenza related program at Novavax, Inc, in his role as VP Clinical Development and Translational Medicine. Dr. Cummings is a retired Colonel with the US Army and served as Director of the Department of Defence’s Global Emerging Infectious Surveillance and Response System (GEIS) and as the Director of Translational Medicine & Regulated Activities for the Walter Reed Army Institute of Research (WRAIR).\nDr. Cummings is replacing ClinicalRM founder and CEO, Victoria Tifft, who will transition her leadership role throughout Q1 2018 and will move to the ClinicalRM Board as a non-executive Director in February 2018. Dr. Cummings will work closely with the ClinicalRM Board, Executive Team and ICON Leadership in the continued development of the ClinicalRM organisation as the CRO of choice in the government sponsored research sector.\nCommenting on the appointment of Dr. Cummings, Colin Stanley, President, ICON Functional Services, said: “I am pleased that James has joined ClinicalRM to lead the company’s next stage of development and that Vicki will continue to provide guidance as a valuable member of the ClinicalRM Board. James’ knowledge of the industry, operational experience and understanding of research will help ICON expand in the government research sector. Furthermore his expertise will strengthen ICON’s capabilities in vaccines and infectious disease, both of which are important areas of focus for government and commercial customers.”\nDr. Cummings commented: “I am excited to take on this unique challenge to combine ClinicalRM’s extensive sector experience and reputation, with ICON’s broad, global capabilities to provide a differentiated service offering to federal health agencies. I look forward to working with Vicki, the ClinicalRM Board and the wider ICON team to broaden and deepen our relationships with federal and commercial research sponsors.”\nAbout ClinicalRM\nClinicalRM, a wholly-owned subsidiary of ICON plc, is a full-service CRO providing clinical trial and functional services to government and commercial customers. From international partnerships and affiliations to government relations and local alliances, ClinicalRM delivers projects spanning the government, academic and commercial marketplaces. The company has a distinct ability to provide boots-on-the-ground and rapid response efforts to global health crises. More information is at http://www.clinicalrm.com/\nAbout ICON plc\nICON plc is a global provider of drug development solutions and services to the pharmaceutical, biotechnology and medical device industries. The company specialises in the strategic development, management and analysis of programs that support clinical development - from compound selection to Phase I-IV clinical studies. With headquarters in Dublin, Ireland, ICON currently, operates from 97 locations in 38 countries and has approximately 13,100 employees. More information is at http://www.iconplc.com\nThis press release contains forward-looking statements. These statements are based on management's current expectations and information currently available, including current economic and industry conditions. These statements are not guarantees of future performance or actual results, and actual results, developments and business decisions may differ from those stated in this press release. The forward-looking statements are subject to future events, risks, uncertainties and other factors that could cause actual results to differ materially from those projected in the statements, including, but not limited to, the ability to enter into new contracts, maintain client relationships, manage the opening of new offices and offering of new services, the integration of new business mergers and acquisitions, as well as economic and global market conditions and other risks and uncertainties detailed from time to time in SEC reports filed by ICON, all of which are difficult to predict and some of which are beyond our control. For these reasons, you should not place undue reliance on these forward-looking statements when making investment decisions. The word \"expected\" and variations of such words and similar expressions are intended to identify forward-looking statements. Forward-looking statements are only as of the date they are made and we do not undertake any obligation to update publicly any forward-looking statement, either as a result of new information, future events or otherwise. More information about the risks and uncertainties relating to these forward-looking statements may be found in SEC reports filed by ICON, including its Form 20-F, F-1, S-8 and F-3, which are available on the SEC's website at http://www.sec.gov .\nICON/ICLR-G\n //www.businesswire.com/news/home/20180109005846/en/\nICON Media Contact\nOlivia Pimenta\nWeber Shandwick\n+44 (0)207 067 0557\nOPimenta@webershandwick.com\nSource: ICON plc", "external_links": ["http://www.businesswire.com/news/home/20180109005846/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Furldefense.proofpoint.com%2Fv1%2Furl%3Fu%3Dhttp%3A%2F%2Fwww.sec.gov.%26k%3DO82v1QPk8v0F4rUQzzlDIA%253D%253D%250A%26r%3Dtx5RTZGGN%252Bj%252FP1Q1hxZ8WtJFA7oGnvclXKE9%252F3CJssI%253D%250A%26m%3DC%252BDFebmEXvEee67y1S96%252FVAdeXlCrzUKXWTrX8fNWXU%253D%250A%26s%3D520f928f8f4ef39f62d95156e0b70115302f2d248aca553a7b006d40b3842344&esheet=51740211&newsitemid=20180109005846&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=3&md5=b6d62e9bff5eb51", "http://www.clinicalrm.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.clinicalrm.com%2F&esheet=51740211&newsitemid=20180109005846&lan=en-US&anchor=http%3A%2F%2Fwww.clinicalrm.com%2F&index=1&md5=e5724ab7eebb134c2e61de022e32942f"], "published": "2018-01-09T13:00:00.000+02:00", "crawled": "2018-01-09T15:37:40.000+02:00", "highlightTitle": ""}