{"organizations": [], "uuid": "d974d241dc1465e7a233fde3beac2062ffd38f32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-youngevity-acquires-gigi-hill-brand.html", "country": "US", "domain_rank": 767, "title": "Youngevity Acquires Gigi Hill Brand", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-24T16:30:00.000+02:00", "replies_count": 0, "uuid": "d974d241dc1465e7a233fde3beac2062ffd38f32"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-youngevity-acquires-gigi-hill-brand.html", "ord_in_thread": 0, "title": "Youngevity Acquires Gigi Hill Brand", "locations": [], "entities": {"persons": [{"name": "youngevi", "sentiment": "negative"}, {"name": "gabrielle", "sentiment": "none"}, {"name": "gigi hill", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "youngevity", "sentiment": "none"}, {"name": "orange county california", "sentiment": "none"}], "organizations": [{"name": "youngevity acquires gigi hill brand", "sentiment": "negative"}, {"name": "youngevity", "sentiment": "none"}, {"name": "international, inc.", "sentiment": "none"}, {"name": "gigi hill handbag", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Signs Exclusive Agreement With Founder\nSAN DIEGO, Calif., Youngevity® International, Inc. , (NASDAQ:YGYI), a leading omni-direct lifestyle company, today announced the acquisition of the Gigi Hill Handbag and Accessory Brand. The company has also entered into a long-term contract with Gabrielle \"Gigi\" DeSantis, Co-Founder of Gigi Hill, to lead the integration of Gigi Hill handbags and accessories.\nGigi Hill, based in Orange County California and started in 2007, was born out of the need for women to have more stylish, and functional handbags and luggage. The line will be marketed within Youngevity’s fashion and jewelry verticals where the company believes many strong cross marketing opportunities exist. Gigi Hill’s new collection is expected to be available in the second quarter of 2018.\n\"We are extremely honored and excited to join the Youngevity team and its family of brands. We feel Gigi Hill’s unique collection of travel and everyday accessories will thrive within Youngevity’s omni direct platform. As part of Youngevity, our Stylists should greatly benefit from the robust earning opportunity and cross selling benefits that exists within Youngevity,” said Co-Founder, Gabrielle “Gigi” DeSantis.\nSteve Wallach, Youngevity Chief Executive Officer, said, “We are impressed with the loyal following of the Gigi Hill brand and we are excited to be forging a partnership with Ms. DeSantis. We anticipate this partnership has the potential to create excitement and positively impact other verticals within Youngevity.”\nAbout Youngevity International, Inc.\nYoungevity International, Inc. (NASDAQ:YGYI), is a leading omni-direct lifestyle company - offering a hybrid of the direct selling business model, that also offers e-commerce and the power of social selling. Assembling a virtual Main Street of products and services under one corporate entity, Youngevity offers products from the six top selling retail categories: health/nutrition, home/family, food/beverage (including coffee), spa/beauty, apparel/jewelry, as well as innovative services. The Company was formed in the course of the summer 2011 merger of Youngevity Essential Life Sciences with Javalution® Coffee Company (now part of the company's food and beverage division). The resulting company became Youngevity International, Inc. in July 2013. For investor information, please visit YGYI.com . Be sure to like us on Facebook and follow us on Twitter .\nSafe Harbor Statement\nThis release includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 on our current expectations and projections about future events. In some cases forward-looking statements can be identified by terminology such as \"may,\" \"should,\" \"potential,\" \"continue,\" \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"encouraged\" and similar expressions. The forward-looking statements contained in this press release include statements regarding the many strong cross marketing opportunities with the GIGI HILL Handbag and Accessory Brand, the availability of the Gigi Hill’s new collection in the second quarter of 2018, and Gigi Hill. Stylists benefiting from the robust earning opportunity and exciting cross selling benefits that exists within Youngevity. These forward-looking statements are based on management's expectations and assumptions as of the date of this press release and are subject to a number of risks and uncertainties, many of which are difficult to predict that could cause actual results to differ materially from current expectations and assumptions from those set forth or implied by any forward-looking statements. Important factors that that could cause actual results to differ materially from current expectations include, among others, the ability to successfully implement cross marketing opportunities with the GIGI HILL Handbag and Accessory Brand, the ability to launch the Gigi Hill’s new collection in the second quarter of 2018, and the ability of Gigi Hill. Stylists to benefiting from the earning opportunity and cross selling benefits that exists within Youngevity and the other factors discussed in our Annual Report on Form 10-K for the year ended December 31, 2016 and our subsequent filings with the SEC, including subsequent periodic reports on Forms 10-Q and 8-K. The information in this release is provided only as of the date of this release, and we undertake no obligation to update any forward-looking statements contained in this release based on new information, future events, or otherwise, except as required by law.\nMedia Contact: Chuck Harbey PCG Advisory Group charbey@pcgadvisory.com P: 646.863.7997\nSource:Youngevity International, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=x1_7mdv0klDVmcrsfQ9v7BNN0YB8Fq0iJbJkuSq5Vs8Sudh1j66FwPmfl8OUa0DwqAa-bzGBV355NmliZglkATglP1GGz2odmIrQvCmNyh4=", "https://www.globenewswire.com/Tracker?data=16qPo17SxxDfBZQusYPPgaqOy2ORomf3AwRnzx4v6kAwcLAMD5sNekAujs4FRc3vHakM73EUmO-rgf8jNVVRJhbhAsp8lR-qaDY6xCPet4o=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/5384eed1-8728-4ee2-8365-80bacb6f115c", "https://www.globenewswire.com/Tracker?data=n1dUW8E26-E9Y3NWSF_JcVxBI_NFpg6LsEjpDQT5qmg8FojaEU433oTkn4oqPEBBcMF6HcjgIWKbCY1drTqv7A==", "https://www.globenewswire.com/Tracker?data=SrINmUE6m0DDzyEMCe635BFF8A0xsJSeaz4IOUSpRIjWH6oPraQ5wrKyuyvzygnj"], "published": "2018-01-24T16:30:00.000+02:00", "crawled": "2018-01-24T16:50:13.039+02:00", "highlightTitle": ""}