{"organizations": [], "uuid": "48e807e010148043fc860dbf27faf33cb6c21684", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-lockheed-martin-reports-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Lockheed Martin Reports Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:30:00.000+02:00", "replies_count": 0, "uuid": "48e807e010148043fc860dbf27faf33cb6c21684"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-lockheed-martin-reports-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Lockheed Martin Reports Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "bethesda", "sentiment": "none"}], "organizations": [{"name": "lockheed martin reports fourth quarter", "sentiment": "negative"}, {"name": "lockheed martin", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BETHESDA, Md., Jan. 29, 2018 /PRNewswire/ -- Lockheed Martin (NYSE: LMT) today reported fourth quarter 2017 net sales of $15.1 billion, compared to $13.8 billion in the fourth quarter of 2016. Net loss from continuing operations in the fourth quarter of 2017 was $715 million, or $2.50 per share, compared to net earnings from continuing operations of $959 million, or $3.25 per share, in the fourth quarter of 2016. The net loss from continuing operations in the fourth quarter of 2017 included a net one-time charge of $1.9 billion ($6.80 per share), substantially all of which was non-cash, primarily related to the estimated impacts of the Tax Cuts and Jobs Act (the \"Tax Act\"). Excluding the estimated impacts of the Tax Act, adjusted earnings from continuing operations were $1.2 billion, or $4.30 per share, in the fourth quarter of 2017 compared with $959 million, or $3.25 per share, in the fourth quarter of 2016. Cash from operations in the fourth quarter of 2017 was $1.5 billion, compared to $729 million in the fourth quarter of 2016.\nNet sales in 2017 were $51.0 billion, compared to $47.2 billion in 2016. Net earnings from continuing operations in 2017 were $1.9 billion, or $6.64 per share, compared to $3.8 billion, or $12.38 per share, in 2016. Earnings from continuing operations in 2017 included a net one-time charge of $1.9 billion ($6.69 per share), substantially all of which was non-cash, primarily related to the estimated impacts of the Tax Act. Excluding the estimated impacts of the Tax Act, adjusted earnings from continuing operations were $3.9 billion, or $13.33 per share, in 2017 compared with $3.8 billion, or $12.38 per share, in 2016. Cash from operations in 2017 was $6.5 billion, compared to cash from operations in 2016 of $5.2 billion.\n\"We delivered outstanding performance as we completed 2017, which enabled us to end the year with strong sales growth, $6.5 billion of cash from operations and a backlog of nearly $100 billion, while also returning over $4.0 billion to our shareholders,\" said Marillyn Hewson, Chairman, President and CEO. \"Looking ahead to 2018, we remain focused on meeting commitments to customers, pursuing new business growth opportunities, investing in innovative solutions to prepare for the future, and returning value to our shareholders.\"\nSummary Financial Results\nThe following table presents the corporation's summary financial results.\n(in millions, except per share data)\nQuarters Ended Dec. 31,\nYears Ended Dec. 31,\n2017\n2016\n2017\n2016\nNet sales 1\n$\n15,137\n$\n13,752\n$\n51,048\n$\n47,248\nBusiness segment operating profit 1\n$\n1,487\n$\n1,290\n$\n5,115\n$\n5,100\nUnallocated items\nFAS/CAS pension adjustment\n220\n230\n876\n902\nSpecial item - severance charges\n—\n—\n—\n(80)\nOther, net 3\n152\n(92)\n(70)\n(373)\nTotal unallocated items\n372\n138\n806\n449\nConsolidated operating profit 1\n$\n1,859\n$\n1,428\n$\n5,921\n$\n5,549\nNet (loss) earnings from\nContinuing operations 1,2,3\n$\n(715)\n$\n959\n$\n1,929\n$\n3,753\nDiscontinued operations 4\n73\n29\n73\n1,549\nNet (loss) earnings\n$\n(642)\n$\n988\n$\n2,002\n$\n5,302\nDiluted (loss) earnings per share from\nContinuing operations 1,2,3,5\n$\n(2.50)\n$\n3.25\n$\n6.64\n$\n12.38\nDiscontinued operations 4,5\n0.25\n0.10\n0.25\n5.11\nDiluted (loss) earnings per share 5\n$\n(2.25)\n$\n3.35\n$\n6.89\n$\n17.49\nCash from operations 4\n$\n1,512\n$\n729\n$\n6,476\n$\n5,189\n1\nOn Aug. 24, 2016, the corporation's ownership interest in the AWE Management Limited (AWE) joint venture increased from 33 percent to 51 percent and the corporation was required to change its accounting for this investment from the equity method to consolidation. As a result of the increased ownership interest, the corporation recognized a non-cash gain of $127 million at its Space business segment, which increased net earnings from continuing operations by $104 million ($0.34 per share) in the year ended Dec. 31, 2016. For additional information regarding this transaction, refer to the \"Divestiture and Acquisition\" section of this news release.\n2\nIn the fourth quarter of 2017, the corporation recorded a net one-time charge of $1.9 billion ($6.80 per share in the fourth quarter and $6.69 per share in 2017), substantially all of which was non-cash, primarily related to the estimated impacts of the Tax Cuts and Jobs Act. For additional information regarding the one-time charge, refer to the \"Income Taxes\" section of this news release.\n3\nIn the fourth quarter of 2017, the corporation recognized a previously deferred non-cash gain of $198 million related to properties sold in 2015 as a result of completing its remaining obligations, which increased net earnings from continuing operations by $122 million ($0.43 per share in the fourth quarter and $0.42 per share in 2017).\n4\nOn Aug. 16, 2016, the corporation completed the divestiture of its former Information Systems & Global Solutions (IS&GS) business. Accordingly, the operating results of IS&GS and an initial $1.2 billion gain on the divestiture have been classified as discontinued operations in 2016. However, cash from operations in 2016 includes cash generated by IS&GS of approximately $310 million as the corporation retained this cash as part of the divestiture. In the fourth quarter of 2017 the corporation recognized an additional gain of $73 million related to the divestiture of the IS&GS business, which reflects certain post-closing adjustments, including certain tax adjustments and the final determination of net working capital. For additional information regarding this transaction, refer to the \"Divestiture and Acquisition\" section in this news release.\n5\nThe corporation incurred a net loss in the fourth quarter of 2017 causing inclusion of any potentially dilutive securities to have an anti-dilutive effect, resulting in the weighted average shares outstanding for basic and dilutive earnings per share being equivalent during the quarter. As a result the corporation's net loss in the fourth quarter of 2017, diluted earnings per share for the quarters of 2017 will not equal the earnings per share amount on the consolidated statements of earnings.\n2018 Financial Outlook\nThe following table and other sections of this news release contain forward-looking statements, which are based on the corporation's current expectations. Actual results may differ materially from those projected. It is the corporation's practice not to incorporate adjustments into its financial outlook for proposed acquisitions, divestitures, ventures, changes in law and new accounting standards until such items have been consummated, enacted or adopted. For additional factors that may impact the corporation's actual results, refer to the \"Forward-Looking Statements\" section in this news release.\n(in millions, except per share data)\n2017 Pro Forma for\nNew Accounting\nStandards\n2018\nCurrent Outlook\nNet sales\n$49,976\n$50,000 - $51,500\nBusiness segment operating profit\n$5,107\n$5,200 - $5,350\nNet FAS/CAS pension adjustment\n876\n~1,010\nOther, net\n(70)\n~(250)\n$5,913\n$5,960 - $6,110\nReclassification of non-service FAS costs for all\npostretirement benefit plans\n846\n~870\nConsolidated operating profit\n$6,759\n$6,830 - $6,980\nDiluted earnings per share - GAAP 1,2\n$6.57\n$15.20 - $15.50\nDiluted earnings per share - Adjusted 1,2\n$13.31\nCash from operations 3\n$6,476\n≥$3,000\n1\nIn the fourth quarter of 2017, the corporation recorded a net one-time charge of $1.9 billion ($6.74 per share in 2017 on a pro forma basis), substantially all of which was non-cash, primarily related to the estimated impacts of the Tax Cuts and Jobs Act. For additional information regarding the one-time charge, refer to the \"Income Taxes\" section of this news release.\n2\nEarnings per share amounts are from continuing operations.\n3\nWe will make contributions of $5.0 billion to our qualified defined benefit pension plans in 2018, including required and discretionary contributions.\nEffective Jan. 1, 2018, the corporation adopted two new accounting standards (Accounting Standard Update (ASU) No. 2014-09, Revenue from Contracts with Customers, as amended (Topic 606) (commonly referred to as ASC 606) and ASU No. 2017-07, Compensation-Retirement Benefits (Topic 715)). The 2017 Pro Forma for New Accounting Standards and the 2018 Current Outlook reflect the changes resulting from the adoption of the new accounting standards. For further information on the impact of the corporation's adoption of the new standards, refer to the New Accounting Standards and Pro Forma Consolidated Statements of Earnings included in the supplemental tables of this news release.\nThe corporation expects the net 2018 FAS/CAS pension benefit to be approximately $1.0 billion assuming a 3.625 percent discount rate (a 50 basis point decrease from the end of 2016), an approximately 13.00 percent return on plan assets in 2017 (a 550 basis point increase from the expected rate of return at the end of 2016), a 7.50 percent expected long-term rate of return on plan assets in future years, and the revised longevity assumptions released during the fourth quarter of 2017 by the Society of Actuaries. The corporation will make contributions of $5.0 billion to its qualified defined benefit pension plans in 2018, including required and discretionary contributions. As a result of these contributions, the corporation does not anticipate any material qualified defined benefit funding will be required until 2021. As a result of adopting ASU No. 2017-07 for our qualified defined benefit pension plans, the corporation expects to present a FAS/CAS pension benefit of approximately $1.0 billion in other unallocated net, in cost of sales. The corporation also expects to present a reclassification of non-service FAS net periodic benefit costs for all postretirement benefit plans (including the qualified defined benefit pension plans) of $870 million of non-service pension expense from other unallocated net in cost of sales to other non-operating expense, net.\nCash Deployment Activities\nThe corporation's cash deployment activities in the quarter and year ended Dec. 31, 2017 consisted of the following:\nrepurchasing 1.6 million shares for $501 million and 7.1 million shares for $2.0 billion during the quarter and year ended Dec. 31, 2017, compared to 3.2 million shares for $816 million and 8.9 million shares for $2.1 billion during the quarter and year ended Dec. 31, 2016; paying cash dividends of $572 million and $2.2 billion during the quarter and year ended Dec. 31, 2017, compared to $530 million and $2.0 billion during the quarter and year ended Dec. 31, 2016; no long-term debt repayments during the year ended Dec. 31, 2017 compared to repayments of $952 million of long-term debt upon scheduled maturity during the year ended Dec. 31, 2016; and making capital expenditures of $507 million and $1.2 billion during the quarter and year ended Dec. 31, 2017, compared to $436 million and $1.1 billion during the quarter and year ended Dec. 31, 2016.\nInternal Controls\nAs previously reported, during the fourth quarter of 2016 the corporation determined that Sikorsky's internal control over financial reporting was ineffective and therefore concluded that a material weakness existed in Lockheed Martin's internal control over financial reporting as of Dec. 31, 2016. Over the course of 2017, the corporation systematically improved controls at Sikorsky in order to remediate the material weakness. During the fourth quarter of 2017, the corporation successfully completed testing of the improved controls and, in its Annual Report on Form 10-K for the year ended Dec. 31, 2017, the corporation will report that it has remediated the material weakness and that management has determined that Lockheed Martin's internal control over financial reporting was effective as of Dec. 31, 2017. There were no material errors in the corporation's financial results or balances and there was no restatement of prior period financial statements and no change in previously released financial results as a result of the material weakness in internal control over financial reporting.\nSegment Results\nThe corporation operates in four business segments organized based on the nature of products and services offered: Aeronautics, Missiles and Fire Control (MFC), Rotary and Mission Systems (RMS) and Space. During the fourth quarter of 2017, the corporation changed the name of its Space Systems business segment to Space. This was a change of name only and had no impact on the programs comprised in each business segment.\nThe following table presents summary operating results of the corporation's business segments and reconciles these amounts to the corporation's consolidated financial results.\n(in millions)\nQuarters Ended Dec. 31,\nYears Ended Dec. 31,\n2017\n2016\n2017\n2016\nNet sales\nAeronautics\n$\n6,046\n$\n5,407\n$\n20,148\n$\n17,769\nMissiles and Fire Control\n2,293\n1,757\n7,212\n6,608\nRotary and Mission Systems\n4,351\n3,809\n14,215\n13,462\nSpace\n2,447\n2,779\n9,473\n9,409\nTotal net sales\n$\n15,137\n$\n13,752\n$\n51,048\n$\n47,248\nOperating profit\nAeronautics\n$\n661\n$\n552\n$\n2,164\n$\n1,887\nMissiles and Fire Control\n296\n255\n1,053\n1,018\nRotary and Mission Systems\n299\n228\n905\n906\nSpace\n231\n255\n993\n1,289\nTotal business segment operating profit\n1,487\n1,290\n5,115\n5,100\nUnallocated items\nFAS/CAS pension adjustment\n220\n230\n876\n902\nSpecial item - severance charges\n—\n—\n—\n(80)\nOther, net\n152\n(92)\n(70)\n(373)\nTotal unallocated items\n372\n138\n806\n449\nTotal consolidated operating profit\n$\n1,859\n$\n1,428\n$\n5,921\n$\n5,549\nOperating profit of the business segments includes the corporation's share of earnings or losses from equity method investees as the operating activities of the equity method investees are closely aligned with the operations of the corporation's business segments. United Launch Alliance (ULA), the results of which are included in the Space business segment, is the corporation's primary equity method investee. Operating profit of the corporation's business segments excludes the FAS/CAS pension adjustment, which represents the difference between total pension expense recorded in accordance with U.S. generally accepted accounting principles (FAS) and pension costs recoverable on U.S. Government contracts as determined in accordance with U.S. Government Cost Accounting Standards (CAS); expense for stock-based compensation; the effects of items not considered part of management's evaluation of segment operating performance, such as charges related to significant severance actions and certain asset impairments; gains or losses from divestitures; the effects of certain legal settlements; corporate costs not allocated to the corporation's business segments; and other miscellaneous corporate activities.\nChanges in net sales and operating profit generally are expressed in terms of volume. Changes in volume refer to increases or decreases in sales or operating profit resulting from varying production activity levels, deliveries or service levels on individual contracts. Volume changes in segment operating profit are typically based on the current profit booking rate for a particular contract.\nIn addition, comparability of the corporation's segment sales, operating profit and operating margin may be impacted favorably or unfavorably by changes in profit booking rates on the corporation's contracts accounted for using the percentage-of-completion method of accounting. Increases in the profit booking rates, typically referred to as risk retirements, usually relate to revisions in the estimated total costs that reflect improved conditions on a particular contract. Conversely, conditions on a particular contract may deteriorate resulting in an increase in the estimated total costs to complete and a reduction in the profit booking rate. Increases or decreases in profit booking rates are recognized in the current period and reflect the inception-to-date effect of such changes. Segment operating profit and margin may also be impacted favorably or unfavorably by other items. Favorable items may include the positive resolution of contractual matters, cost recoveries on restructuring charges, insurance recoveries and gains on sales of assets. Unfavorable items may include the adverse resolution of contractual matters; restructuring charges, except for significant severance actions which are excluded from segment operating results; reserves for disputes; certain asset impairments; and losses on sales of assets.\nThe corporation's consolidated net profit adjustments not related to volume, including net profit booking rate adjustments and reserves, represented approximately 27 percent and 30 percent of total segment operating profit for the quarter and year ended Dec. 31, 2017, compared to approximately 26 percent and 28 percent for the quarter and year ended Dec. 31, 2016.\nAeronautics\n(in millions)\nQuarters Ended Dec. 31,\nYears Ended Dec. 31,\n2017\n2016\n2017\n2016\nNet sales\n$\n6,046\n$\n5,407\n$\n20,148\n$\n17,769\nOperating profit\n$\n661\n$\n552\n$\n2,164\n$\n1,887\nOperating margin\n10.9\n%\n10.2\n%\n10.7\n%\n10.6\n%\nAeronautics' net sales in the fourth quarter of 2017 increased $639 million, or 12 percent, compared to the same period in 2016. The increase was attributable to higher net sales of approximately $570 million for the F-35 program primarily due to increased production volume and about $150 million for the C-130 program due to increased aircraft deliveries (10 aircraft delivered in 2017 compared to eight in 2016). These increases were partially offset by a decrease of approximately $85 million for the C-5 program due to fewer aircraft deliveries (two aircraft delivered in 2017 compared to three in 2016).\nAeronautics' operating profit in the fourth quarter of 2017 increased $109 million, or 20 percent, compared to the same period in 2016. Operating profit increased approximately $75 million for the F-35 program due to increased aircraft production volume and higher risk retirements; and about $15 million for the C-130 program due to increased aircraft deliveries and pricing mix. Operating profit for the C-5 program was comparable in the fourth quarter of 2017 and 2016. Adjustments not related to volume, including net profit booking rate adjustments, were about $60 million higher in the fourth quarter of 2017 compared to the same period in 2016.\nAeronautics' net sales in 2017 increased $2.4 billion, or 13 percent, compared to 2016. The increase was primarily attributable to higher net sales of approximately $2.0 billion for the F-35 program due to increased volume on production and sustainment; about $260 million for the C-130 program due to increased deliveries (26 aircraft delivered in 2017 compared to 24 in 2016) and due to aircraft configuration mix, partially offset by lower volume for sustainment programs; and about $55 million for the F-16 program due to higher volume on aircraft modernization programs, partially offset by lower deliveries (eight aircraft delivered in 2017 compared to 12 in 2016). These increases were partially offset by a decrease of approximately $155 million for the C-5 program due to lower deliveries (seven aircraft delivered in 2017 compared to nine in 2016).\nAeronautics' operating profit in 2017 increased $277 million, or 15 percent, compared to 2016. Operating profit increased approximately $290 million for the F-35 program due to increased volume on aircraft production and sustainment activities and higher risk retirements and about $85 million for the F-16 program due to higher risk retirements and higher volume on aircraft modernization programs, partially offset by lower deliveries. These increases were partially offset by a decrease of about $30 million due to lower equity earnings from an investee; about $25 million for the C-130 program primarily due to lower volume and the timing of expenses for sustainment programs; and approximately $45 million for other aeronautics programs primarily due to lower risk retirements and the establishment of a reserve recorded in the first quarter of 2017. Adjustments not related to volume, including net profit booking rate adjustments, were about $175 million higher in 2017 compared to 2016.\nMissiles and Fire Control\n(in millions)\nQuarters Ended Dec. 31,\nYears Ended Dec. 31,\n2017\n2016\n2017\n2016\nNet sales\n$\n2,293\n$\n1,757\n$\n7,212\n$\n6,608\nOperating profit\n$\n296\n$\n255\n$\n1,053\n$\n1,018\nOperating margin\n12.9\n%\n14.5\n%\n14.6\n%\n15.4\n%\nMFC's net sales in the fourth quarter of 2017 increased $536 million, or 31 percent, compared to the same period in 2016. The increase was primarily attributable to higher net sales of approximately $255 million for air and missile defense programs due to increased deliveries (primarily Patriot Advanced Capability-3 (PAC-3)); about $155 million for tactical missile programs due to increased deliveries (primarily Precision Fires) and due to increased deliveries and product configuration mix (Joint Air-to-Surface Standoff Missile (JASSM)); and about $90 million for fire control programs due to increased deliveries (primarily LANTIRN® and SNIPER®).\nMFC's operating profit in the fourth quarter of 2017 increased $41 million, or 16 percent, compared to the same period in 2016. Operating profit increased approximately $45 million for air and missile defense programs due to higher risk retirements (primarily Terminal High Altitude Area Defense (THAAD)) and increased deliveries (primarily PAC-3). Operating profit for tactical missiles and fire control programs was comparable in the fourth quarter of 2017 and 2016 with increased deliveries (primarily LANTIRN® and SNIPER®) and a charge recorded in 2016 for a contractual matter that did not recur in 2017 being offset by lower risk retirements (primarily Apache and Precision Fires). Adjustments not related to volume, including net profit booking rate adjustments, were about $10 million lower in the fourth quarter of 2017 compared to the same period in 2016.\nMFC's net sales in 2017 increased $604 million, or 9 percent, compared to 2016. The increase was attributable to higher net sales of approximately $250 million for tactical missile programs due to product configuration mix and increased deliveries (JASSM) and due to increased deliveries for various other programs; about $210 million for air and missile defense programs due to contract mix on certain programs (primarily PAC-3) and increased volume on certain programs (primarily THAAD); and about $110 million for fire control programs due to increased deliveries (primarily LANTIRN® and SNIPER®).\nMFC's operating profit in 2017 increased $35 million, or 3 percent, compared to 2016. Operating profit increased about $70 million for air and missile defense programs due to increased volume (primarily THAAD), contract mix (primarily PAC-3), a reserve recorded in fiscal year 2016 for a contractual matter that did not recur in 2017, partially offset by lower risk retirements; and about $30 million for fire control programs due to increased deliveries (primarily LANTIRN® and SNIPER®). These increases were partially offset by a decrease of approximately $65 million for tactical missile programs due to lower risk retirements (primarily JASSM and Hellfire) and the establishment of a reserve on a program. Adjustments not related to volume, including net profit booking rate adjustments, were about $80 million lower in 2017 compared to 2016.\nRotary and Mission Systems\n(in millions)\nQuarters Ended Dec. 31,\nYears Ended Dec. 31,\n2017\n2016\n2017\n2016\nNet sales\n$\n4,351\n$\n3,809\n$\n14,215\n$\n13,462\nOperating profit\n$\n299\n$\n228\n$\n905\n$\n906\nOperating margin\n6.9\n%\n6.0\n%\n6.4\n%\n6.7\n%\nRMS' net sales in the fourth quarter of 2017 increased $542 million, or 14 percent, compared to the same period in 2016. The increase was primarily attributable to an increase of approximately $445 million in higher sales for Sikorsky helicopter programs primarily due to aircraft mix and increased deliveries; and an increase of about $65 million for training and logistics services programs due to higher volume.\nRMS' operating profit in the fourth quarter of 2017 increased $71 million, or 31 percent, compared to the same period in 2016. Operating profit increased approximately $60 million for Sikorsky helicopter programs due to aircraft mix and increased deliveries. Adjustments not related to volume, including net profit booking rate adjustments, were about $20 million lower in the fourth quarter of 2017 compared to the same period in 2016.\nRMS' net sales in 2017 increased $753 million, or 6 percent, compared to 2016. The increase was primarily attributable to approximately $680 million for Sikorsky helicopter programs due to certain adjustments recorded in 2016 required to account for the acquisition and higher volume on certain helicopter programs; and about $160 million for training and logistics services programs due to higher volume. These increases were partially offset by a decrease of about $50 million for integrated warfare systems and sensors (IWSS) programs due to lower volume.\nRMS' operating profit in 2017 was comparable with 2016. Operating profit increased about $105 million for Sikorsky helicopter programs due to certain adjustments recorded in 2016 required to account for the acquisition. This increase was offset by a decrease of $100 million for C4ISR & Undersea Systems & Sensors (C4USS) programs due to a net $95 million increase for charges for performance matters on the EADGE-T contract and $20 million for IWSS programs primarily due to a performance matter on the Vertical Launching System (VLS) program, partially offset by higher risk retirements (primarily Littoral Combat Ship (LCS)). Adjustments not related to volume, including net profit booking rate adjustments, were about $55 million lower in 2017 compared to 2016.\nSpace\n(in millions)\nQuarters Ended Dec. 31,\nYears Ended Dec. 31,\n2017\n2016\n2017\n2016\nNet sales\n$\n2,447\n$\n2,779\n$\n9,473\n$\n9,409\nOperating profit\n$\n231\n$\n255\n$\n993\n$\n1,289\nOperating margin\n9.4\n%\n9.2\n%\n10.5\n%\n13.7\n%\nSpace's net sales in the fourth quarter of 2017 decreased $332 million, or 12 percent, compared to the same period in 2016. The decrease was primarily attributable to approximately $300 million for space transportation programs due a reduction in launch-related events.\nSpace's operating profit in the fourth quarter of 2017 decreased $24 million, or 9 percent, compared to the same period in 2016. Operating profit decreased approximately $45 million for lower equity earnings from ULA and about $30 million for space transportation programs due to a reduction in launch-related events. These decreases were partially offset by an increase of $20 million for government satellite programs (primarily Global Positioning System (GPS)) due to higher risk retirements and about $30 million for commercial satellite programs due to lower charges recorded in the fourth quarter of 2017 for performance matters on certain programs than were recorded in the comparable period of 2016. Adjustments not related to volume, including net profit booking rate adjustments and changes in reserves, were about $45 million higher in the fourth quarter of 2017 compared to the same period in 2016.\nSpace's net sales in 2017 increased $64 million, or 1 percent, compared to 2016. The increase was attributable to approximately $810 million due to a full year of net sales from AWE in 2017 compared to four months of sales in 2016, which the corporation began consolidating during the third quarter of 2016. This increase was partially offset by a decrease of approximately $300 million for space transportation programs due a reduction in launch-related events; about $255 million for government satellite programs (primarily Advanced Extremely High Frequency (AEHF) and Space Based Infrared System (SBIRS)) due to lower volume; and approximately $190 million across other programs (including the Orion program) due to lower volume.\nSpace's operating profit in 2017 decreased $296 million, or 23 percent, compared to 2016. Operating profit decreased about $127 million due to the pre-tax gain recorded in 2016 related to the consolidation of AWE; about $95 million for lower equity earnings from ULA; about $30 million for space transportation programs due a reduction in launch-related events; a net decrease of about $25 million related to charges recorded in 2017 for performance matters on certain commercial satellite programs; and about $25 million for government satellite programs (primarily SBIRS and AEHF) due to a charge for performance matters and lower volume. Adjustments not related to volume, including net profit booking rate adjustments and changes in reserves, were about $20 million higher in 2017 compared to 2016.\nTotal equity earnings recognized by Space (primarily ULA) represented approximately $35 million, or 15 percent and approximately $205 million, or 21 percent, of this business segment's operating profit during the quarter and the year ended Dec. 31, 2017, compared to approximately $85 million, or 33 percent and approximately $325 million, or 25 percent, during the quarter and the year ended Dec. 31, 2016.\nIncome Taxes\nThe corporation's effective income tax rate from continuing operations was 142.3 percent and 63.4 percent in the quarter and year ended Dec. 31, 2017, compared to 23.6 percent and 23.2 percent in the quarter and year ended Dec. 31, 2016. During the quarter ended Dec. 31, 2017, the corporation recorded a net one-time charge of $1.9 billion ($6.80 per share in the fourth quarter and $6.69 per share in 2017), substantially all of which was non-cash, primarily related to enactment of the Tax Act which resulted in the re-measurement of certain net deferred tax assets using the lower U.S. corporate income tax rate (approximately $1.8 billion), a deemed repatriation tax (approximately $43 million), and a reduction in the U.S. manufacturing benefit (approximately $81 million) as a result of the corporation's decision to accelerate contributions to its pension fund in 2018. Excluding the net one-time charge, the corporation's effective income tax rate from continuing operations was 27.5 percent and 26.5 percent in the quarter and year ended Dec. 31, 2017.\nThe rates for all periods benefited from the research and development tax credit and tax deductions for dividends paid to the corporation's defined contribution plans with an employee stock ownership plan feature. The rates for the quarter and year ended Dec. 31, 2016 also benefited from tax deductions for U.S. manufacturing activities. For the year ended Dec. 31, 2017, the rate impact of the U.S. manufacturing benefit was insignificant. The rate in the year ended Dec. 31, 2016 also benefited from the nontaxable gain recorded in connection with the increase in AWE ownership.\nThe net one-time charge related to the Tax Act is based on the corporation's current estimates. The final impact of the Tax Act may differ materially due to factors such as further refinement of the corporation's calculations, changes in interpretations and assumptions that the corporation has made, additional guidance that may be issued by the U.S. Government, and actions the corporation may take, among other items.\nDivestiture and Acquisition\nOn Aug. 16, 2016, the corporation divested its former IS&GS business, which merged with Leidos Holdings, Inc. (Leidos) in a Reverse Morris Trust transaction (the Transaction). As part of the transaction, the corporation also completed an exchange offer that resulted in a reduction of Lockheed Martin common stock outstanding by approximately 9.4 million shares (approximately three percent). Additionally, Lockheed Martin received a one-time special cash payment of $1.8 billion, which is reported under financing activities in the consolidated statements of cash flows. The corporation recognized an initial $1.2 billion gain in net earnings from discontinued operations as a result of the Transaction. In the fourth quarter of 2017 the corporation recognized an additional gain on discontinued operations of $73 million, which reflects certain post-closing adjustments, including certain tax adjustments and the final determination of net working capital.\nOn Aug. 24, 2016, the corporation increased its ownership interest in the AWE joint venture from 33 percent to 51 percent at which time it began consolidating AWE. Consequently, the corporation's operating results for the year ended 2017 include 100 percent of AWE's sales and 51 percent of its operating profit. Prior to increasing its ownership interest, the corporation accounted for its investment in AWE using the equity method of accounting. Under the equity method, the corporation recognized only 33 percent of AWE's earnings or losses and no sales. Accordingly, prior to Aug. 24, 2016, the date the corporation obtained control, it recorded 33 percent of AWE's net earnings in the corporation's operating results and subsequent to Aug. 24, 2016, it recognized 100 percent of AWE's sales and 51 percent of its operating profit. Additionally, in the year ended 2016, the corporation recorded a net gain of $104 million associated with obtaining control of AWE, which consisted of a $127 million pre tax gain recognized in the operating results of our Space business segment and $23 million of deferred tax liabilities recorded at our corporate office.\nUse of Non-GAAP Financial Measures\nThis news release contains the following non-GAAP financial measures:\nAdjusted earnings from continuing operations and adjusted earnings per share from continuing operations are calculated by adding (1) net (loss) earnings from continuing operations (GAAP) (or diluted (loss) earnings per share from continuing operations (GAAP)) plus (2) the net one-time charge of $1.9 billion (or $6.80 per share for the quarter ended Dec. 31, 2017 and $6.69 per share for the year ended Dec. 31, 2017). 2017 pro forma for new accounting standards diluted earnings per share - adjusted is calculated by adding (1) 2017 pro forma diluted earnings per share from continuing operations - GAAP plus (2) the net one-time charge of $6.74 per share for the year ended Dec. 31, 2017.\nManagement believes that the exclusion of the net one-time charge, which is primarily related to the estimated impacts of the Tax Act, provides a more useful comparison of the corporation's underlying business performance from period to period. It also provides investors and management useful information about the performance of the underlying business prior to the impact of the net one-time charge for the impacts of the Tax Act. However, this information is supplemental and should not be considered a substitute for financial measures prepared in accordance with GAAP.\nConference Call Information\nLockheed Martin will webcast live the earnings results conference call (listen-only mode) on Monday, Jan. 29, 2018, at 10:00 a.m. ET. The live webcast and relevant financial charts will be available for download on the Lockheed Martin Investor Relations website at www.lockheedmartin.com/investor .\nFor additional information, visit our website: www.lockheedmartin.com .\nAbout Lockheed Martin\nHeadquartered in Bethesda, Maryland, Lockheed Martin is a global security and aerospace company that employs approximately 100,000 people worldwide and is principally engaged in the research, design, development, manufacture, integration and sustainment of advanced technology systems, products and services.\nForward-Looking Statements\nThis news release contains statements that, to the extent they are not recitations of historical fact, constitute forward-looking statements within the meaning of the federal securities laws, and are based on Lockheed Martin's current expectations and assumptions. The words \"believe,\" \"estimate,\" \"anticipate,\" \"project,\" \"intend,\" \"expect,\" \"plan,\" \"outlook,\" \"scheduled,\" \"forecast\" and similar expressions are intended to identify forward-looking statements. These statements are not guarantees of future performance and are subject to risks and uncertainties. Actual results may differ materially due to factors such as:\nthe corporation's reliance on contracts with the U.S. Government, which are conditioned upon the availability of funding and can be terminated by the U.S. Government for convenience, and the corporation's ability to negotiate favorable contract terms; budget uncertainty, any failure to further raise the debt ceiling, and the potential for a government shutdown; affordability initiatives; the implementation of automatic sequestration under the Budget Control Act of 2011 or Congressional actions intended to replace sequestration; risks related to the development, production, sustainment, performance, schedule, cost and requirements of complex and technologically advanced programs including the corporation's largest, the F-35 program; economic, industry, business and political conditions including their effects on governmental policy; the corporation's success expanding into and doing business in adjacent markets and internationally; the differing risks posed by international sales, including those involving commercial relationships with unfamiliar customers and different cultures; our ability to recover investments which is frequently dependent upon the successful operation of ventures that we do not control; and changes in foreign national priorities, and foreign government budgets; the competitive environment for the corporation's products and services, including increased pricing pressures, competition from outside the aerospace and defense industry, and increased bid protests; planned production rates for significant programs; compliance with stringent performance and reliability standards; materials availability; the performance and financial viability of key suppliers, teammates, ventures, venture partners, subcontractors and customers; the timing and customer acceptance of product deliveries; the corporation's ability to continue to innovate and develop new products and to attract and retain key personnel and transfer knowledge to new personnel; the impact of work stoppages or other labor disruptions; the impact of cyber or other security threats or other disruptions to the corporation's businesses; the corporation's ability to implement and continue capitalization changes such as share repurchases and dividend payments (including the availability of sufficient net earnings to permit such distributions under Maryland law), pension funding as well as the pace and effect of any such capitalization changes; the corporation's ability to recover certain costs under U.S. Government contracts and changes in contract mix; the accuracy of the corporation's estimates and projections; movements in interest rates and other changes that may affect pension plan assumptions, equity, the level of the FAS/CAS adjustment and actual returns on pension plan assets; realizing the anticipated benefits of acquisitions or divestitures, ventures, teaming arrangements or internal reorganizations, and the corporation's efforts to increase the efficiency of its operations and improve the affordability of its products and services; risk of an impairment of goodwill, investments or other long-term assets, including the potential impairment of goodwill, intangible assets and inventory recorded as a result of the Sikorsky acquisition if Sikorsky does not perform as expected, has a deterioration of projected cash flows, negative changes in market factors, including oil and gas trends, or a significant increase in carrying value of the reporting unit; the adequacy of the corporation's insurance and indemnities; the effect of changes in (or the interpretation of): legislation, regulation or policy, including those applicable to procurement (including competition from fewer and larger prime contractors), cost allowability or recovery, accounting, taxation (including the impact of the Tax Cuts and Jobs Act), or export; and the outcome of legal proceedings, bid protests, environmental remediation efforts, government investigations or government allegations that we have failed to comply with law, other contingencies and U.S. Government identification of deficiencies in the corporation's business systems.\nThese are only some of the factors that may affect the forward-looking statements contained in this news release. For a discussion identifying additional important factors that could cause actual results to vary materially from those anticipated in the forward-looking statements, see the corporation's filings with the U.S. Securities and Exchange Commission (SEC) including, but not limited to, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and \"Risk Factors\" in the corporation's Annual Report on Form 10-K for the year ended Dec. 31, 2016 and subsequent quarterly reports on Form 10-Q. The corporation's filings may be accessed through the Investor Relations page of its website, www.lockheedmartin.com/investor , or through the website maintained by the SEC at www.sec.gov .\nThe corporation's actual financial results likely will be different from those projected due to the inherent nature of projections. Given these uncertainties, forward-looking statements should not be relied on in making investment decisions. The forward-looking statements contained in this news release speak only as of the date of its filing. Except where required by applicable law, the corporation expressly disclaims a duty to provide updates to forward-looking statements after the date of this news release to reflect subsequent events, changed circumstances, changes in expectations, or the estimates and assumptions associated with them. The forward-looking statements in this news release are intended to be subject to the safe harbor protection provided by the federal securities laws.\nLockheed Martin Corporation\nConsolidated Statements of Earnings\n(unaudited; in millions, except per share data)\nQuarters Ended Dec. 31,\nYears Ended Dec. 31,\n2017\n2016\n2017\n2016\nNet sales 1\n$ 15,137\n$ 13,752\n$ 51,048\n$ 47,248\nCost of sales\n(13,518)\n(12,399)\n(45,500)\n(42,186)\nGross profit\n1,619\n1,353\n5,548\n5,062\nOther income, net 1,2\n240\n75\n373\n487\nOperating profit\n1,859\n1,428\n5,921\n5,549\nInterest expense\n(174)\n(171)\n(651)\n(663)\nOther non-operating income(expense), net\n7\n(2)\n(1)\n-\nEarnings from continuing operations before income taxes\n1,692\n1,255\n5,269\n4,886\nIncome tax expense 3\n(2,407)\n(296)\n(3,340)\n(1,133)\nNet (loss) earnings from continuing operations\n(715)\n959\n1,929\n3,753\nNet earnings from discontinued operations\n73\n29\n73\n1,549\nNet (loss) earnings\n$ (642)\n$ 988\n$ 2,002\n$ 5,302\nEffective tax rate 3\n142.3\n%\n23.6\n%\n63.4\n%\n23.2\n%\n(Loss) earnings per common share\nBasic\nContinuing operations 1,2,3\n$ (2.50)\n$ 3.29\n$ 6.70\n$ 12.54\nDiscontinued operations 4\n0.25\n0.10\n0.26\n5.17\nBasic (loss) earnings per common share\n$ (2.25)\n$ 3.39\n$ 6.96\n$ 17.71\nDiluted\nContinuing operations 1,2,3,5\n$ (2.50)\n$ 3.25\n$ 6.64\n$ 12.38\nDiscontinued operations 4,5\n0.25\n0.10\n0.25\n5.11\nDiluted (loss) earnings per common share 5\n$ (2.25)\n$ 3.35\n$ 6.89\n$ 17.49\nWeighted average shares outstanding\nBasic\n285.9\n291.8\n287.8\n299.3\nDiluted 5\n285.9\n295.2\n290.6\n303.1\nCommon shares reported in stockholders' equity at end of period\n284\n289\n1 On Aug. 24, 2016, the corporation's ownership interest in the AWE Management Limited (AWE) joint venture increased from 33 percent to\n51 percent and the corporation was required to change its accounting for this investment from the equity method to consolidation. As a result\nof the increased ownership interest, the corporation recognized a non-cash gain of $127 million at its Space business segment, which\nincreased net earnings from continuing operations by $104 million ($0.34 per share) in the year ended Dec. 31, 2016.\n2 In the fourth quarter of 2017, the corporation recognized a previously deferred non-cash gain of $198 million related to properties sold in 2015\nas a result of completing its remaining obligations, which increased net earnings from continuing operations by $122 million ($0.43 per share\nin the fourth quarter and $0.42 per share in 2017).\n3 In the fourth quarter of 2017, the corporation recorded a net one-time charge of $1.9 billion ($6.80 per share in the fourth quarter and $6.69 per share\nin 2017), substantially all of which was non-cash, primarily related to the estimated impacts of the Tax Cuts and Jobs Act. For additional information\nregarding the one-time charge, refer to the \"Income Taxes\" section of this news release.\n4 On Aug. 16, 2016, the corporation completed the divestiture of its former Information Systems & Global Solutions (IS&GS) business. Accordingly,\nthe operating results of IS&GS and the $1.2 billion initial gain on the divestiture have been classified as discontinued operations in the year\nended Dec. 31, 2016. In the fourth quarter of 2017 the corporation recognized an additional gain on discontinued operations of $73 million,\nwhich reflects certain post-closing adjustments, including certain tax adjustments and the final determination of net working capital.\n5 The corporation incurred a net loss in the fourth quarter of 2017 causing inclusion of any potentially dilutive securities to have an anti-dilutive\neffect, resulting in the weighted average shares outstanding for basic and dilutive earnings per share being equivalent during the quarter. As a\nresult the corporation's net loss in the fourth quarter of 2017, diluted earnings per share for the quarters of 2017 will not equal the earnings per\nshare amount on the statements of earnings.\nLockheed Martin Corporation\nBusiness Segment Summary Operating Results\n(unaudited; in millions)\nQuarters Ended Dec. 31,\nYears Ended Dec. 31,\n2017\n2016\n% Change\n2017\n2016\n% Change\nNet sales\nAeronautics\n$ 6,046\n$ 5,407\n12\n%\n$ 20,148\n$ 17,769\n13\n%\nMissiles and Fire Control\n2,293\n1,757\n31\n%\n7,212\n6,608\n9\n%\nRotary and Mission Systems\n4,351\n3,809\n14\n%\n14,215\n13,462\n6\n%\nSpace\n2,447\n2,779\n(12)\n%\n9,473\n9,409\n1\n%\nTotal net sales\n$ 15,137\n$ 13,752\n10\n%\n$ 51,048\n$ 47,248\n8\n%\nOperating profit\nAeronautics\n$ 661\n$ 552\n20\n%\n$ 2,164\n$ 1,887\n15\n%\nMissiles and Fire Control\n296\n255\n16\n%\n1,053\n1,018\n3\n%\nRotary and Mission Systems\n299\n228\n31\n%\n905\n906\n-\n%\nSpace 1\n231\n255\n(9)\n%\n993\n1,289\n(23)\n%\nTotal business segment operating profit\n1,487\n1,290\n15\n%\n5,115\n5,100\n-\n%\nUnallocated items\nFAS/CAS pension adjustment\n220\n230\n876\n902\nSpecial item - severance\n-\n-\n-\n(80)\nOther, net 2,3\n152\n(92)\n(70)\n(373)\nTotal unallocated items\n372\n138\n806\n449\nTotal consolidated operating profit\n$ 1,859\n$ 1,428\n30\n%\n$ 5,921\n$ 5,549\n7\n%\nOperating margins\nAeronautics\n10.9\n%\n10.2\n%\n10.7\n%\n10.6\n%\nMissiles and Fire Control\n12.9\n%\n14.5\n%\n14.6\n%\n15.4\n%\nRotary and Mission Systems\n6.9\n%\n6.0\n%\n6.4\n%\n6.7\n%\nSpace\n9.4\n%\n9.2\n%\n10.5\n%\n13.7\n%\nTotal business segment operating margins\n9.8\n%\n9.4\n%\n10.0\n%\n10.8\n%\nTotal consolidated operating margins\n12.3\n%\n10.4\n%\n11.6\n%\n11.7\n%\n1 On Aug. 24, 2016, the corporation's ownership interest in the AWE Management Limited (AWE) joint venture increased from 33 percent to\n51 percent and the corporation was required to change its accounting for this investment from the equity method to consolidation. As a result\nof the increased ownership interest, the corporation recognized a non-cash gain of $127 million at its Space business segment, which\nincreased net earnings from continuing operations by $104 million ($0.34 per share) in the year ended Dec. 31, 2016.\n2 On Aug. 16, 2016, the corporation divested its former IS&GS business. Accordingly, the operating results of IS&GS have been classified as\ndiscontinued operations in the year ended Dec. 31, 2016. Due to the divestiture, the corporation reclassified $82 million of corporate overhead costs\nincurred in 2016 from the IS&GS business to other unallocated, net in our consolidated statement of earnings.\n3 In the fourth quarter of 2017, the corporation recognized a previously deferred non-cash gain of $198 million related to properties sold in 2015 as a\nresult of completing our remaining obligations, which increased net earnings from continuing operations by $122 million ($0.43 per share in the\nfourth quarter and $0.42 per share in 2017).\nLockheed Martin Corporation\nConsolidated Balance Sheets\n(unaudited; in millions, except par value)\nDec. 31,\n2017\nDec. 31,\n2016\nAssets\nCurrent assets\nCash and cash equivalents\n$ 2,861\n$ 1,837\nReceivables, net\n8,603\n8,202\nInventories, net\n4,487\n4,670\nOther current assets\n1,510\n399\nTotal current assets\n17,461\n15,108\nProperty, plant and equipment, net\n5,775\n5,549\nGoodwill\n10,807\n10,764\nIntangible assets, net\n3,797\n4,093\nDeferred income taxes\n3,239\n6,625\nOther noncurrent assets\n5,442\n5,667\nTotal assets\n$ 46,521\n$ 47,806\nLiabilities and equity\nCurrent liabilities\nAccounts payable\n$ 1,467\n$ 1,653\nCustomer advances and amounts in excess of costs incurred\n6,752\n6,776\nSalaries, benefits and payroll taxes\n1,785\n1,764\nCurrent maturities of long-term debt\n750\n-\nOther current liabilities\n1,883\n2,349\nTotal current liabilities\n12,637\n12,542\nLong-term debt, net\n13,513\n14,282\nAccrued pension liabilities\n15,703\n13,855\nOther postretirement benefit liabilities\n719\n862\nOther noncurrent liabilities\n4,558\n4,659\nTotal liabilities\n47,130\n46,200\nStockholders' equity\nCommon stock, $1 par value per share\n284\n289\nAdditional paid-in capital\n-\n-\nRetained earnings\n11,573\n13,324\nAccumulated other comprehensive loss\n(12,540)\n(12,102)\nTotal stockholders' (deficit) equity 1\n(683)\n1,511\nNoncontrolling interests in subsidiary\n74\n95\nTotal (deficit) equity 1\n(609)\n1,606\nTotal liabilities and equity\n$ 46,521\n$ 47,806\n1 The deficit in equity was predominantly due to a $1.9 billion net one-time charge primarily due to the enactment of the Tax Act and the annual\nDec. 31, 2017, re-measurement adjustment related to our postretirement benefit plans of $1.4 billion. Under Maryland law, if a corporation\nhas a deficit in equity, it is still able to pay dividends and make share repurchases in an amount limited to its net earnings in either the current\nor the preceding fiscal year or from the net earnings for the preceding eight quarters and if it is otherwise able to pay its debts as these come due.\nLockheed Martin Corporation\nConsolidated Statements of Cash Flows 1\n(unaudited; in millions)\nYears Ended Dec. 31,\n2017\n2016\nOperating activities\nNet earnings\n$ 2,002\n$ 5,302\nAdjustments to reconcile net earnings to net cash provided by operating activities\nDepreciation and amortization\n1,195\n1,215\nStock-based compensation\n158\n149\nDeferred income taxes\n3,304\n(152)\nSeverance charges\n-\n99\nGain on property sale\n(198)\n-\nGain on divestiture of IS&GS business\n(73)\n(1,242)\nGain on step acquisition of AWE\n-\n(104)\nChanges in assets and liabilities\nReceivables, net\n(401)\n(811)\nInventories, net\n183\n(46)\nAccounts payable\n(189)\n(188)\nCustomer advances and amounts in excess of costs incurred\n(24)\n3\nPostretirement benefit plans\n1,316\n1,028\nIncome taxes\n(1,082)\n146\nOther, net\n285\n(210)\nNet cash provided by operating activities\n6,476\n5,189\nInvesting activities\nCapital expenditures\n(1,177)\n(1,063)\nOther, net\n30\n78\nNet cash used for investing activities\n(1,147)\n(985)\nFinancing activities\nRepurchases of common stock\n(2,001)\n(2,096)\nDividends paid\n(2,163)\n(2,048)\nSpecial cash payment from divestiture of IS&GS business\n-\n1,800\nRepayments of long-term debt\n-\n(952)\nProceeds from stock option exercises\n71\n106\nOther, net\n(212)\n(267)\nNet cash used for financing activities\n(4,305)\n(3,457)\nNet change in cash and cash equivalents\n1,024\n747\nCash and cash equivalents at beginning of period\n1,837\n1,090\nCash and cash equivalents at end of period\n$ 2,861\n$ 1,837\n1 On Aug. 16, 2016, the corporation divested its former IS&GS business. Although, the operating results of IS&GS have been classified as\ndiscontinued operations in the year ended Dec. 31, 2016, cash from operations includes cash generated by IS&GS of approximately\n$310 million as the corporation retained this cash as part of the divestiture.\nLockheed Martin Corporation\nConsolidated Statement of Equity\n(unaudited; in millions)\nAccumulated\nTotal\nAdditional\nOther\nStockholders'\nNoncontrolling\nTotal\nCommon\nPaid-in\nRetained\nComprehensive\n(Deficit)\nInterests\n(Deficit)\nStock\nCapital\nEarnings\nLoss\nEquity 3\nin Subsidiary\nEquity 3\nBalance at Dec. 31, 2016\n$ 289\n$ -\n$ 13,324\n$ (12,102)\n$ 1,511\n$ 95\n$ 1,606\nNet earnings\n-\n-\n2,002\n-\n2,002\n-\n2,002\nOther comprehensive loss, net of tax 1\n-\n-\n-\n(438)\n(438)\n-\n(438)\nRepurchases of common stock\n(7)\n(398)\n(1,596)\n-\n(2,001)\n-\n(2,001)\nDividends declared 2\n-\n-\n(2,157)\n-\n(2,157)\n-\n(2,157)\nStock-based awards, ESOP activity and other\n2\n398\n-\n-\n400\n-\n400\nNet decrease in noncontrolling interests in subsidiary\n-\n-\n-\n-\n-\n(21)\n(21)\nBalance at Dec. 31, 2017\n$ 284\n$ -\n$ 11,573\n$ (12,540)\n$ (683)\n$ 74\n$ (609)\n1 At Dec. 31, 2017, the corporation recognized a non-cash, after-tax reduction to stockholders' equity of $1.4 billion as a result of the year-end re-\nmeasurement of its postretirement benefit plans. Partially offsetting this reduction was an $802 million recognition of previously deferred amounts. The\nreduction to stockholders' equity was primarily due to a lower discount rate at Dec. 31, 2017 of 3.625 percent as compared to 4.125 percent at Dec. 31, 2016.\n2 Represents dividends of $2.00 per share declared for the fourth quarter of 2017 and $1.82 per share declared for the first, second and third quarters of 2017.\n3 The deficit in equity was predominantly due to a $1.9 billion net one-time charge primarily due to the enactment of the Tax Act and the annual\nDec. 31, 2017, re-measurement adjustment related to our postretirement benefit plans of $1.4 billion. Under Maryland law, if a corporation has a deficit in equity,\nit is still able to pay dividends and make share repurchases in an amount limited to its net earnings in either the current or the preceding fiscal year or\nfrom the net earnings for the preceding eight quarters and if it is otherwise able to pay its debts as these come due.\nLockheed Martin Corporation\nOperating Data\n(unaudited; in millions, except aircraft deliveries)\nBacklog\nDec. 31,\n2017\nDec. 31,\n2016\nAeronautics\n$ 35,832\n$ 34,182\nMissiles and Fire Control\n17,863\n14,704\nRotary and Mission Systems\n28,974\n28,430\nSpace\n17,267\n18,842\nTotal backlog\n$ 99,936\n$ 96,158\nQuarters Ended\nYears Ended\nAircraft Deliveries\nDec. 31,\n2017\nDec. 31,\n2016\nDec. 31,\n2017\nDec. 31,\n2016\nF-35\n22\n16\n66\n46\nF-16\n1\n4\n8\n12\nC-130J\n10\n8\n26\n24\nC-5\n2\n3\n7\n9\nOther fixed-wing aircraft\n2\n-\n2\n-\nGovernment helicopter programs\n54\n42\n164\n166\nCommercial helicopter programs\n4\n4\n7\n12\nInternational military helicopter programs\n6\n1\n9\n2\nNew Accounting Standards\nEffective Jan. 1, 2018, the corporation adopted Accounting Standards Update (ASU) No. 2014-09, Revenue from Contracts with Customers, as amended (commonly referred to as ASC 606), which changes the way the corporation recognizes revenue for certain of its customer contracts. On Jan. 1, 2018, the corporation also adopted ASU No. 2017-07, Compensation-Retirement Benefits, which changed the income statement classification of certain components of net periodic benefit cost for defined benefit pension and other postretirement plans.\nPrior to the adoption of ASC 606, the corporation recognized the majority of its revenue using the percentage-of-completion method of accounting. Based on the nature of products provided or services performed, revenue was recorded using the percentage-of-completion cost-to-cost method or the percentage-of-completion units-of-delivery method. See the Annual Report on Form 10-K for fiscal year ended Dec. 31, 2016 for details on the corporation's revenue recognition policy. Under ASC 606, revenue is recognized as the customer obtains control of the goods or receives benefit from services promised in the contract (i.e., performance obligations). For most of the corporation's contracts, the customer obtains control or receives benefits as we perform on the contract, and under ASC 606, revenue for those contracts is recognized over time using a method similar to the current percentage-of-completion cost-to-cost method. The main impacts of ASC 606 to the corporation are timing of revenue recognition for contracts that were historically accounted for using the percentage-of-completion units-of-delivery method with revenue for these contracts recognized earlier in the performance period as we incur costs. Major programs impacted by ASC 606 include the C-130J and C-5 programs in the Aeronautics business; tactical missile programs (Hellfire and JASSM), Patriot Advanced Capability-3 (PAC-3), and fire control programs (LANTIRN® and SNIPER®) in the Missiles and Fire Control (MFC) business; and the Black Hawk and Seahawk helicopter programs in the Rotary and Mission Systems (RMS) business. Also with the adoption of ASC 606, pro forma backlog was re-measured to reflect the value of performance obligations yet to be completed at Dec. 31, 2017. Please see the backlog attachment to this earnings release for pro forma backlog information. Total net cash provided by operating activities and net cash used by investing and financing activities on our consolidated statements of cash flows are not expected to be impacted by the adoption of ASC 606.\nThe new accounting standard, Compensation-Retirement Benefits, which the corporation adopted Jan. 1, 2018, changes the income statement presentation of certain components of net periodic benefit cost related to defined benefit pension and other postretirement benefit plans. Currently, we record all components of net periodic benefit costs in operating profit as part of cost of sales. Under ASU No. 2017-07, we will record only the service component of net periodic benefit cost in operating profit and the non-service components of net periodic benefit cost (i.e., interest cost, expected return on plan assets, amortization of prior service cost or credits, and net actuarial gains or losses) as part of non-operating income.\nThe financial results reported in the news release for fiscal years ended Dec. 31, 2016 and 2017 do not reflect the accounting changes required by these standards as the corporation did not adopt them until Jan. 1, 2018. However, the Financial Outlook and supplemental tables included in the news release include pro forma financial information, which reflect the accounting changes of these new accounting standards to help understand the 2018 Financial Outlook.\nLockheed Martin Corporation\nPro Forma Consolidated Statements of Earnings - Adjusted for Impacts of New Accounting Standards\n(unaudited; in millions)\nYear Ended December 31, 2016\nLockheed\nMartin\nHistorical\nAdjustments for\nAdoption of\nASC 606 1\nReclassification\nfor New Pension\nStandard\nLockheed\nMartin\nAdjusted\nAeronautics\n$ 17,769\n$ (476)\n$ -\n$ 17,293\nMissiles and Fire Control\n6,608\n206\n-\n6,814\nRotary and Mission Systems\n13,462\n133\n-\n13,595\nSpace\n9,409\n209\n-\n9,618\nNet sales\n47,248\n72\n-\n47,320\nAeronautics\n1,887\n(42)\n-\n1,845\nMissiles and Fire Control\n1,018\n9\n-\n1,027\nRotary and Mission Systems\n906\n(61)\n-\n845\nSpace\n1,289\n(1)\n-\n1,288\nBusiness Segment Operating Profit\n5,100\n(95)\n-\n5,005\nTotal Unallocated Items\n449\n(15)\n471\n905\nTotal Consolidated Operating Profit\n5,549\n(110)\n471\n5,910\nInterest expense\n(663)\n-\n-\n(663)\nOther non-operating expense, net\n-\n-\n(471)\n(471)\nEarnings from continuing operations before income taxes\n4,886\n(110)\n-\n4,776\nIncome tax expense\n(1,133)\n33\n-\n(1,100)\nNet earnings from continuing operations\n3,753\n(77)\n-\n3,676\nNet earnings from discontinued operations\n1,549\n(37)\n-\n1,512\nNet earnings\n$ 5,302\n$ (114)\n$ -\n$ 5,188\nEffective tax rate\n23.2%\n23.0%\nEarnings per common share\nBasic\nContinuing operations\n$ 12.54\n$ (0.26)\n$ -\n$ 12.28\nDiscontinued operations\n5.17\n(0.12)\n-\n5.05\nBasic earnings per common share\n$ 17.71\n$ (0.38)\n$ -\n$ 17.33\nDiluted\nContinuing operations\n$ 12.38\n$ (0.25)\n$ -\n$ 12.13\nDiscontinued operations\n5.11\n(0.12)\n-\n4.99\nDiluted earnings per common share\n$ 17.49\n$ (0.37)\n$ -\n$ 17.12\n1 Primarily reflects adjustments for contracts that were historically accounted for using the percentage-of-completion units-of-delivery method,\nwhich under ASC 606 are recognized as the customer obtains control of the goods and services promised in the contract. The major programs\nimpacted by ASC 606 listed by business segment are as follows: Aeronautics (C-5 and C-130J programs); Missiles and Fire Control (PAC-3,\nJASSM, Hellfire, LANTIRN® and SNIPER® programs); Rotary and Mission Systems (Black Hawk and Seahawk helicopter programs); and Space\n(commercial satellite programs).\nLockheed Martin Corporation\nPro Forma Consolidated Statements of Earnings - Adjusted for Impacts of New Accounting Standards\n(unaudited; in millions)\nYear Ended December 31, 2017\nLockheed\nMartin\nHistorical\nAdjustments for\nAdoption of\nASC 606 1\nReclassification\nfor New Pension\nStandard\nLockheed\nMartin\nAdjusted\nAeronautics\n$ 20,148\n$ (738)\n$ -\n$ 19,410\nMissiles and Fire Control\n7,212\n82\n-\n7,294\nRotary and Mission Systems\n14,215\n(552)\n-\n13,663\nSpace\n9,473\n136\n-\n9,609\nNet sales\n51,048\n(1,072)\n-\n49,976\nAeronautics\n2,164\n12\n-\n2,176\nMissiles and Fire Control\n1,053\n(4)\n-\n1,049\nRotary and Mission Systems\n905\n(3)\n-\n902\nSpace\n993\n(13)\n-\n980\nBusiness Segment Operating Profit\n5,115\n(8)\n-\n5,107\nTotal Unallocated Items\n806\n-\n846\n1,652\nTotal Consolidated Operating Profit\n5,921\n(8)\n846\n6,759\nInterest expense\n(651)\n-\n-\n(651)\nOther non-operating expense, net\n(1)\n-\n(846)\n(847)\nEarnings from continuing operations before income taxes\n5,269\n(8)\n-\n5,261\nIncome tax expense 2\n(3,340)\n(13)\n-\n(3,353)\nNet earnings from continuing operations\n1,929\n(21)\n-\n1,908\nNet earnings from discontinued operations\n73\n-\n-\n73\nNet earnings\n$ 2,002\n$ (21)\n$ -\n$ 1,981\nEffective tax rate\n63.4%\n63.7%\nEarnings per common share\nBasic\nContinuing operations\n$ 6.70\n$ (0.07)\n$ -\n$ 6.63\nDiscontinued operations\n0.26\n-\n-\n0.26\nBasic earnings per common share\n$ 6.96\n$ (0.07)\n$ -\n$ 6.89\nDiluted\nContinuing operations 2\n$ 6.64\n$ (0.07)\n$ -\n$ 6.57\nDiscontinued operations\n0.25\n-\n-\n0.25\nDiluted earnings per common share\n$ 6.89\n$ (0.07)\n$ -\n$ 6.82\n1 Primarily reflects adjustments for contracts that were historically accounted for using the percentage-of-completion units-of-delivery method,\nwhich under ASC 606 are recognized as the customer obtains control of the goods and services promised in the contract. The major programs\nimpacted by ASC 606 listed by business segment are as follows: Aeronautics (C-130J and C-5 programs); Missiles and Fire Control (Hellfire,\nJASSM, PAC-3, LANTIRN® and SNIPER® programs); Rotary and Mission Systems (Black Hawk and Seahawk helicopter programs); and Space\n(commercial satellite programs).\n2 In the fourth quarter of 2017, the corporation recorded a net one-time charge of $1.9 billion ($6.69 per share in 2017 on a GAAP historical basis and\n$6.74 per share in 2017 on a pro forma adjusted basis), substantially all of which was non-cash, primarily related to the estimated impacts of the\nTax Cuts and Jobs Act. For additional information regarding the one-time charge, refer to the \"Income Taxes\" section of this news release.\nLockheed Martin Corporation\nPro Forma Backlog - Adjusted for Impacts of ASC 606\n(unaudited; in millions)\nPro Forma for\nAdoption of\nHistorical\nASC 606\nBacklog\nDec. 31,\n2017\nDec. 31,\n2017\nAeronautics\n$ 35,832\n$ 35,692\nMissiles and Fire Control\n17,863\n17,678\nRotary and Mission Systems\n28,974\n30,030\nSpace\n17,267\n22,082\nTotal backlog\n$ 99,936\n$ 105,482\nView original content with multimedia: http://www.prnewswire.com/news-releases/lockheed-martin-reports-fourth-quarter-and-full-year-2017-results-300589270.html\nSOURCE Lockheed Martin", "external_links": ["http://www.prnewswire.com/news-releases/lockheed-martin-reports-fourth-quarter-and-full-year-2017-results-300589270.html", "http://www.sec.gov/", "http://www.lockheedmartin.com/", "http://www.lockheedmartin.com/investor"], "published": "2018-01-29T15:30:00.000+02:00", "crawled": "2018-01-29T16:37:39.000+02:00", "highlightTitle": ""}