{"organizations": [], "uuid": "1bbe67bac80a15e90cc14f4e39d7de3efcb6f593", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-hmc-healthworks-appoints-bart-bracken-chief-operating-officer.html", "country": "US", "domain_rank": 767, "title": "HMC HealthWorks Appoints Bart Bracken Chief Operating Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:52:00.000+02:00", "replies_count": 0, "uuid": "1bbe67bac80a15e90cc14f4e39d7de3efcb6f593"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-hmc-healthworks-appoints-bart-bracken-chief-operating-officer.html", "ord_in_thread": 0, "title": "HMC HealthWorks Appoints Bart Bracken Chief Operating Officer", "locations": [], "entities": {"persons": [{"name": "bart bracken", "sentiment": "negative"}, {"name": "janis dimonaco", "sentiment": "none"}, {"name": "bracken", "sentiment": "none"}, {"name": "bart", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}], "organizations": [{"name": "hmc healthworks", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JUPITER, Fla., Jan. 16, 2018 /PRNewswire/ -- HMC HealthWorks, a 40-year veteran in healthcare management with clinically-integrated models of care that reduce healthcare costs and improve population health, today announced that Bart Bracken has been appointed Chief Operating Officer (COO).\n\"For the last six years Bart has lead HMC toward an efficient framework of day-to-day operations, strategy and policies,\" said Dr. Janis DiMonaco, President, Founder and CEO, HMC HealthWorks. \"His track record in healthcare operations and performance evaluation of interpreting data and metrics has played a critical role in the efficacy and delivery of our program offerings to clients and stakeholders.\"\nBracken has served as Executive Vice President of Operations when he joined HMC in 2012. Prior to his role at HMC HealthWorks, he held the position of Chief Operating Officer for the analytics division of a national healthcare data analytics company. Bracken has more than 30 years of experience in a wide range of consulting and operational roles in health care with large managed care organizations, consulting firms, and specialty entrepreneurial companies.\n\"For HMC HealthWorks, excellence in healthcare operations is about driving strategic prioritization and accountability, with a strong focus on excellence,\" said Bart Bracken, Chief Operating Officer, HMC HealthWorks. \"I am looking forward to this next season of proactive growth for the company.\"\nBracken holds a Master's Degree in Industrial and Labor Relations from Cornell University and graduated magna cum laude with a bachelor's degree in Economics from St. Lawrence University.\nSince 1976, HMC HealthWorks has been improving population health by identifying key health issues and areas of cost improvement when plan sponsors and their participants engage in its clinically-integrated models of care in chronic disease management, mental health and substance abuse care management, EAP and wellness programs, along with coordinated PBM initiatives. With its state of the art data warehouse, data mining capabilities and best practices in utilization management, HMC HealthWorks generates critical insight to continually improve healthcare management for its clients.\nAbout HMC HealthWorks\nHMC HealthWorks, the premier national provider of population healthcare management programs, offers plan sponsors value-added programs including Integrated Clinical Solutions, Chronic Care Management, Behavioral Health Solutions, Wellness/Lifestyle Coaching and Care Coordination- www.hmchealthworks.com .\nMedia Relations Contact:\nChristy Heady\nDirector of Public Relations\n(561) 275-8398\nView original content: http://www.prnewswire.com/news-releases/hmc-healthworks-appoints-bart-bracken-chief-operating-officer-300583045.html\nSOURCE HMC HealthWorks", "external_links": ["http://www.prnewswire.com/news-releases/hmc-healthworks-appoints-bart-bracken-chief-operating-officer-300583045.html", "http://www.hmchealthworks.com/"], "published": "2018-01-16T14:52:00.000+02:00", "crawled": "2018-01-16T17:09:12.002+02:00", "highlightTitle": ""}