{"organizations": [], "uuid": "06b899569b6634e1a6b0b4be2509e013ded239c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-matrix-medical-network-expands-its-population-health-platformawith-acquisition-of-healthfair.html", "country": "US", "domain_rank": 767, "title": "Matrix Medical Network Expands Its Population Health Platform with Acquisition of HealthFair", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.93, "site_type": "news", "published": "2018-01-16T20:00:00.000+02:00", "replies_count": 0, "uuid": "06b899569b6634e1a6b0b4be2509e013ded239c5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-matrix-medical-network-expands-its-population-health-platformawith-acquisition-of-healthfair.html", "ord_in_thread": 0, "title": "Matrix Medical Network Expands Its Population Health Platform with Acquisition of HealthFair", "locations": [], "entities": {"persons": [{"name": "healthfair", "sentiment": "none"}, {"name": "walt cooper", "sentiment": "none"}], "locations": [{"name": "ariz.", "sentiment": "none"}, {"name": "healthfair scottsdale", "sentiment": "none"}], "organizations": [{"name": "matrix medical network", "sentiment": "negative"}, {"name": "healthfair", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SCOTTSDALE, Ariz., Jan. 16, 2018 (GLOBE NEWSWIRE) -- Matrix Medical Network (Matrix) announced it has reached an agreement to acquire HealthFair – the leading provider of mobile health assessment and diagnostic testing services.\nMatrix provides health assessment, quality improvement and care management services through a nationwide network of over 5,800 community based providers directly to individuals in their homes and care facilities. With the addition of HealthFair’s fleet of mobile health clinics, health plan members will have even greater choice and convenience in accessing important care and preventive services.\n“HealthFair has created a unique and scalable engagement platform used by employers, health plans and healthcare providers,” said Walt Cooper, President and Chief Executive Officer of Matrix. “Adding their capabilities allows us to offer what we see as the most comprehensive and engaging set of population health solutions in the industry.”\nHealthFair’s mobile health clinics are equipped with sophisticated diagnostic technologies including laboratory, ultrasound, EKG and mammography equipment, which expands the scope of diagnostic and preventive services that will be provided by Matrix. By making it easier for individuals to get the support and preventive tests they need, compliance and health outcomes are improved.\n“Over the past 20 years, HealthFair has been able to develop and refine a unique and special approach to health assessments,” said Terry Diaz, President of HealthFair. “By combining our resources with Matrix, we will advance our shared vision of creating an unmatched platform for connecting people to the care they need.”\nThe HealthFair management team will continue to lead the business as part of Matrix. HealthFair has developed deep domain expertise in managing the logistics of operating a fleet of mobile health clinics and driving member engagement. The transaction is subject to standard regulatory review and is expected to close within the next 30-60 days.\nAbout Matrix Medical Network\nMatrix Medical Network provides in-home assessments and comprehensive care management services to health plan members that improve health outcomes. Using an advanced technology platform, Matrix providers visit with health plan members in their homes to obtain a deeper understanding about how to best support the members’ care needs. This information is used to ensure that provider and health plan services are best aligned with the needs of the member, resulting in better overall health outcomes. Matrix is headquartered in Scottsdale, AZ, and partners with leading health plans across the country. Matrix is backed by Frazier Healthcare Partners and The Providence Service Corporation (Nasdaq:PRSC) of Stamford, CT. For more information, visit www.matrixmedicalnetwork.com .\nAbout HealthFair\nHealthFair is an emerging leader in preventive wellness and provides health assessments, diagnostic testing, and care management services for health plans and employers. Using a nationwide fleet of mobile clinics equipped with diagnostic technologies, HealthFair provides essential testing services and supports patients' relationships with their primary care physicians. By utilizing a sophisticated electronic medical records system, HealthFair puts members' health information in the hands of the right healthcare decision makers. This information is invaluable to both the provider and health plan as they work together to best serve the members' needs and improve health outcomes. HealthFair is headquartered in Winter Springs, FL. For more information, visit www.healthfair.com .\nMatrix Medical Network Media Contact\nDavid M. Goodspeed: office 480.862.1970 or dgoodspeed@matrixhealth.net\nSource: Matrix Medical Network", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/618cc0fa-fb41-4494-8526-4fdf140c04f9", "https://www.globenewswire.com/Tracker?data=yAq36Lykjv8udQdu_gyO6zlWxnGK1nS8g8MZl9VOTWiiR5-vWMYPvCOyCjTL--n7BLQdlsQZjiyipkGtRGXB-CcPM7tik6n-DLP3q1szr8fhHNFZszXfGf3ih7e_mQE8", "https://www.globenewswire.com/Tracker?data=carZRrCL0jYM3TkNObm0ixI9E0ifPaov_5X0G7dsd1RvLE_t58spLRY8lZ39Rx2gjVaKAY3klzvqBHa2VH2FB3ciy6ZrxLO7rMrOSacYv88=", "https://www.globenewswire.com/Tracker?data=m3ukc6M5HR-7swVNo_hhmMLj4Qr87JVY4KzFz8o1q5UBkKep4M-qZPJQCDeqVJ-087hBB13XlIimutH_QmxmRFUpqd-UUTgVuvycJO5b7mxaAG41DP3LGi-hSTsJgcz0"], "published": "2018-01-16T20:00:00.000+02:00", "crawled": "2018-01-16T21:16:45.000+02:00", "highlightTitle": ""}