{"organizations": [], "uuid": "c679764cc71d77fcc4f67173b01f694ace283162", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-dr-timothy-ferris-chairman-and-ceo-of-massachusetts-general-physicians-organization-joins-health-catalyst-board.html", "country": "US", "domain_rank": 767, "title": "Dr. Timothy Ferris, Chairman and CEO of Massachusetts General Physicians Organization, Joins Health Catalyst Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T15:55:00.000+02:00", "replies_count": 0, "uuid": "c679764cc71d77fcc4f67173b01f694ace283162"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-dr-timothy-ferris-chairman-and-ceo-of-massachusetts-general-physicians-organization-joins-health-catalyst-board.html", "ord_in_thread": 0, "title": "Dr. Timothy Ferris, Chairman and CEO of Massachusetts General Physicians Organization, Joins Health Catalyst Board", "locations": [], "entities": {"persons": [{"name": "timothy ferris", "sentiment": "negative"}, {"name": "ferris", "sentiment": "none"}, {"name": "penny wheeler", "sentiment": "none"}, {"name": "timothy g. ferris", "sentiment": "none"}], "locations": [{"name": "salt lake city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "joins health catalyst board", "sentiment": "negative"}, {"name": "massachusetts general physicians organization", "sentiment": "negative"}, {"name": "health catalyst", "sentiment": "none"}, {"name": "mgpo", "sentiment": "none"}, {"name": "allina health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SALT LAKE CITY, Jan. 23, 2018 /PRNewswire/ -- Health Catalyst , a leader in healthcare analytics, decision support and outcomes improvement, announced today that Timothy G. Ferris, MD, Chairman and CEO of Massachusetts General Physicians Organization (MGPO), has joined the company's board of directors, replacing Penny Wheeler, MD, the CEO of Allina Health, whose board term is now completed.\n\"I am thrilled to join the board of Health Catalyst, a company with which I have worked closely since 2015,\" said Dr. Ferris. \"I had the privilege of partnering with Health Catalyst on a collaboration aimed at fostering and accelerating the adoption of population health management (PHM) strategies and practices nationally, to improve the quality of healthcare and lower costs, helping health systems meet the needs of patients, providers and payors. I look forward to sharing that experience and know-how to help more health systems across the U.S. improve the quality and affordability of patient care.\"\nThe MGPO is a multi-specialty medical group of nearly 2,500 physicians affiliated with 999-bed Massachusetts General hospital in Boston. Dr. Ferris was previously the medical director of the MGPO, and the senior vice president for Population Health at both Mass General and its Boston-based parent organization, Partners HealthCare, an integrated healthcare delivery system that includes community hospitals, primary care and specialty physicians, specialty facilities, community health centers and other health-related entities.\nA photo of Dr. Ferris is available to download here .\n\"We are thrilled that Dr. Ferris accepted our invitation to join the board,\" said Dan Burton, CEO of Health Catalyst. \"He is one of the most capable, forward thinking CEOs in healthcare today and a champion of healthcare improvement and innovation. Tim's understanding of healthcare economics, delivery and improvement is as deep and significant as any healthcare executive with whom I have interfaced. He is a remarkable leader and innovator, and we are deeply honored that he has agreed to share his insights and guidance by participating on our board of directors.\"\nSince 2012, Dr. Ferris has led the design and implementation of system-wide care delivery changes at MGPO and Partners HealthCare to respond to the changing healthcare environment, enhancing care delivery, increasing access to care, and reducing the healthcare cost burden. He has successfully turned new laws, regulations and payment policies into opportunities to provide better care for patients.\nBeyond his work at the MGPO and Partners HealthCare, Dr. Ferris has played multiple roles at the national level, including chairing the steering committee of the National Quality Forum and working as a member of the Secretary of Health and Human Services independent advisory council on physician payment policy. His clinical interest involves caring for medically complex patients, geriatrics, and respiratory and heart conditions. He still practices as a physician today, including making home visits to the elderly.\nDr. Ferris was educated at Middlebury College, Oxford University (M.Phil.), Harvard Medical School (MD), and Harvard School of Public Health (MPH).\nLast month, Dr. Wheeler completed her years of service as a member of Health Catalyst's board of directors. Dr. Wheeler is the President and CEO of Allina Health, named one of the nation's top five large hospital systems by Truven Health Analytics.\n\"I want to thank Dr. Wheeler for her extraordinary contributions to our company, including through her exemplary board service. She has always been a champion for the patient, and has been a consistent advocate for the company's mission-orientation,\" said Burton. \"Her experience leading the design and implementation of organization-wide clinical service lines at Allina Health has assisted us in driving significant and measurable improvements in care, service, and efficiency for patients across the country. I deeply respect and admire Penny's goodness, strength and leadership, and feel blessed to have been mentored by her over the past several years.\"\nThe Health Catalyst board of directors includes the following members in addition to Ferris and Burton: Board Chairman Fraser Bullock, Co-Founder and Senior Advisor at Sorenson Capital; Michael Dixon, a partner in Sequoia Capital; Promod Haque, Senior Managing Partner of Norwest Venture Partners; Todd Cozzens, Managing Director of Leerink Capital; John A. Kane, former Chief Financial Officer of IDX Systems (now GE Healthcare); Anita Pramoda, CEO and founder of Owned Outcomes; and Duncan Gallagher, the retired Executive Vice President, Chief Administrative Officer and CFO of Allina Health.\nAbout Health Catalyst\nHealth Catalyst is a next-generation data, analytics, and decision-support company committed to being a catalyst for massive, sustained improvements in healthcare outcomes. We are the leaders in a new era of advanced predictive analytics for population health and value-based care with a suite of machine learning-driven solutions, decades of outcomes-improvement expertise, and an unparalleled ability to integrate data from across the healthcare ecosystem. Our proven data warehousing and analytics platform helps improve quality, add efficiency and lower costs in support of more than 85 million patients for organizations ranging from the largest US health system to forward-thinking physician practices. Health Catalyst's technology and professional services help to keep patients engaged and healthy in their homes and workplaces, and to optimize their care when it becomes necessary. We are grateful to be recognized by Fortune, Gallup, Glassdoor, Modern Healthcare and a host of others as a \"Best Place to Work\" in technology and healthcare. Visit www.healthcatalyst.com , and follow us on Twitter, LinkedIn and Facebook.\nFor more information contact:\nTodd Stein\nAmendola Communications for Health Catalyst\n916.346.4213\ntstein@acmarketingpr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/dr-timothy-ferris-chairman-and-ceo-of-massachusetts-general-physicians-organization-joins-health-catalyst-board-300586187.html\nSOURCE Health Catalyst", "external_links": ["http://bit.ly/2n1Z7sj", "http://www.healthcatalyst.com/", "https://www.healthcatalyst.com/accountable-care-organization-solutions", "http://www.prnewswire.com/news-releases/dr-timothy-ferris-chairman-and-ceo-of-massachusetts-general-physicians-organization-joins-health-catalyst-board-300586187.html", "https://www.healthcatalyst.com/population-health/"], "published": "2018-01-23T15:55:00.000+02:00", "crawled": "2018-01-23T18:43:36.016+02:00", "highlightTitle": ""}