{"organizations": [], "uuid": "330883ed5791baa931059d0f9825fbd618d12497", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-kenya-landrights-forests/kenya-flushes-out-criminals-in-forest-dispute-after-sengwer-killing-idUSKBN1F810R", "country": "US", "domain_rank": 408, "title": "Kenya flushes out 'criminals' in forest dispute after Sengwer killing", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T18:25:00.000+02:00", "replies_count": 0, "uuid": "330883ed5791baa931059d0f9825fbd618d12497"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-kenya-landrights-forests/kenya-flushes-out-criminals-in-forest-dispute-after-sengwer-killing-idUSKBN1F810R", "ord_in_thread": 0, "title": "Kenya flushes out 'criminals' in forest dispute after Sengwer killing", "locations": [], "entities": {"persons": [{"name": "judi wakhungu", "sentiment": "none"}, {"name": "sengwer", "sentiment": "none"}], "locations": [{"name": "kenya", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "embobut", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "nairobi", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "united nations special rapporteurs", "sentiment": "none"}, {"name": "kenya forest service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NAIROBI (Thomson Reuters Foundation) - Security forces are flushing “criminal elements” out of a forest in western Kenya, an official said on Thursday, two days after a man was killed there, leading the European Union to suspend aid.\nThe dead man was a member of the Sengwer community, who have been campaigning for a halt to the EU’s six-year 3.6 billion shilling ($35 million) water conservation scheme in the Embobut forest, which they claim as their ancestral home.\n“There are criminal elements in the forest which must be flushed out,” Judi Wakhungu, Kenya’s environment minister, told the Thomson Reuters Foundation by phone.\n“The security operation has been designed to return the situation to normal, which is what is likely to happen soon.”\nUnited Nations Special Rapporteurs expressed concerns on Monday about reports that indigenous Sengwer had been attacked and evicted from their homes as a result of the EU project.\nMore than 100 armed Kenya Forest Service (KFS) guards entered the forest on Dec. 25, firing gunshots and burning at least 15 homes and killing livestock, the Office of the United Nations High Commissioner for Human Rights said on its website.\nWakhungu said this week’s security operation was led by the interior ministry and did not include KFS.\nThe Sengwer hunter-gatherers have fought for more than five decades for the right to live in the Embobut forest in the Cherengany Hills, from where they were first evicted by British colonialists in the 19th century.\nRights groups, including Amnesty International, called on Kenya on Thursday to halt the security operation, which illustrates widespread tensions between indigenous people’s land rights and conservation projects around the world.\n“The EU is consistently committed to the full respect of human rights and would only resume the project if guarantees are provided that it benefits and respects all Kenyans, indigenous communities included,” an EU spokesman said in emailed comments.\nActivists welcomed the EU’s move but called on Kenya to allow the Sengwer to return to live in the forest.\n“It’s unfortunate that the killing of a member of the Sengwer community by KFS is what has made the European Union see that there is a problem here,” said Yator Kiptum, a Sengwer activist.\nMore than 70 Sengwer houses have been burned and numerous livestock shot dead since the start of January, he said.\nAnother Sengwer campaigner, Milka Chepkorir, said the EU decision to suspend funding was “one step in a million” and the government should stop the evictions to allow for negotiations.\n“I believe there will be increased brutality,” she said.\nReporting by Kevin Mwanza. Editing by Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T18:25:00.000+02:00", "crawled": "2018-01-19T14:18:21.040+02:00", "highlightTitle": ""}