{"organizations": [], "uuid": "0ef75c0e2c349f68707d3c9c6a18a67ab242780a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 16, "shares": 16, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104939516-GettyImages-903110250.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/10/asia-markets-china-bond-purchases-dollar-and-corporate-earnings-in-focus.html", "country": "US", "domain_rank": 767, "title": "Asia markets: China bond purchases, dollar and corporate earnings in focus", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.251, "site_type": "news", "published": "2018-01-11T01:47:00.000+02:00", "replies_count": 0, "uuid": "0ef75c0e2c349f68707d3c9c6a18a67ab242780a"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/10/asia-markets-china-bond-purchases-dollar-and-corporate-earnings-in-focus.html", "ord_in_thread": 0, "title": "Asia markets: China bond purchases, dollar and corporate earnings in focus", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Most major Asian indexes closed lower on Thursday following the softer lead from Wall Street. Investors in the region also focused on quarterly releases as Japanese corporates kicked off earnings season.\nThe Nikkei 225 declined 0.33 percent, or 77.77 points, to close at 23,710.43, with major exporters, including automakers and technology names, trading lower: Toyota fell 1 percent, Honda lost 1.85 percent and Sony shed 0.13 percent by the end of the day. \nCorporate earnings were also in focus in Japan. Uniqlo owner Fast Retailing , the most heavily weighted stock on the Nikkei 225 , reported a record first-quarter profit in the three months ending November, Reuters said.\nSymbol Name Price   Change %Change NIKKEI --- HSI --- ASX 200 --- SHANGHAI --- KOSPI --- CNBC 100 --- Over in Seoul, the Kospi finished lower by 0.47 percent at 2,487.91. Chipmakers, which had weighed on the index in the last session, extended declines on Thursday. Samsung Electronics closed down 1.23 percent and SK Hynix shed 0.41 percent.\nAutomakers and manufacturing names also saw losses. Steelmakers Posco and Hyundai Steel declined 1.61 percent and 1.82 percent, respectively, while Hyundai Motor lost 0.32 percent by the end of the day. \nIn Sydney, the benchmark S&P/ASX 200 shed 0.48 percent to close at 6,067.6 — with most sectors except gold producers edging lower on the day.\nThe Australian dollar got a boost after data released earlier showed November retail sales rose more than expected. The currency traded at $0.7867 at 2:53 p.m. HK/SIN, which compared to levels around the $0.783 handle seen before the release.\nGreater China markets clung to slight gains after trading lower in the morning. Hong Kong's Hang Seng Index hovered around the flat line, trading higher by 0.03 percent at 3:10 p.m. HK/SIN. The index, which had closed higher for the 12th straight day on Wednesday for its longest winning streak ever, continued to hold above the 31,000 level.\nMainland markets closed in positive territory, with the Shanghai composite edging up buy 0.11 percent to end at 3,425.57 and the Shenzhen composite advancing 0.38 percent to finish the session at 1,953.12. The blue chip CSI 300 index closed lower by 0.05 percent, with technology and financials among the top-performing sectors. Consumer and energy names were among the worst.\nChina bond purchases in the spotlight  A report that China could potentially slow or halt its purchases following recommendation from officials in Beijing could be inaccurate, Reuters reported on Thursday, citing a source in the Chinese government. The original headlines, reported by Bloomberg on Wednesday, saw U.S. indexes close lower and the dollar tumble in the last session. \nThe Dow Jones industrial average slipped 0.07 percent, or 16.67, to end at 25,369.13 and the S&P 500 and Nasdaq composite closed lower for the first time in 2018.\nThe latest news saw the dollar pare some overnight losses. The dollar index, which tracks the U.S. currency against a basket of currencies, traded at 92.446 at 2:50 p.m. HK/SIN, off levels around the 92.3 handle seen before the news. The dollar index had traded as low as 91.922 on Wednesday after the Bloomberg report.\nAgainst the yen, the dollar edged higher to fetch 111.83.\nThe dollar had been on the back foot against the Japanese currency following news earlier this week that the Bank of Japan had slightly reduced its purchases of Japanese government bonds. The greenback had traded around the 113 handle at the beginning of the week.\nMeanwhile, bitcoin tumbled after South Korea said it was readying a bill that would ban trade of the digital currency in the country. The cryptocurrency later pared some losses to trade at $13,422.36 at 2:52 p.m. HK/SIN, according to industry site CoinDesk. \nCorporate news Also of note, Hyundai Motor announced in a statement that it would be partnering with Southeast Asian ride-hailing company Grab to develop \"future mobility services\" in the fast-growing region. The sum of the investment was not disclosed by the companies.", "external_links": [], "published": "2018-01-11T01:47:00.000+02:00", "crawled": "2018-01-11T01:51:32.005+02:00", "highlightTitle": ""}