{"organizations": [], "uuid": "721a296e13e92e79dd21a062e00130cdde601a54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-germany-security-children/germany-expects-return-of-over-100-children-of-islamist-fighters-idUSKBN1EX157", "country": "US", "domain_rank": 408, "title": "Germany expects return of over 100 children of Islamist fighters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:34:00.000+02:00", "replies_count": 0, "uuid": "721a296e13e92e79dd21a062e00130cdde601a54"}, "author": "", "url": "https://www.reuters.com/article/us-germany-security-children/germany-expects-return-of-over-100-children-of-islamist-fighters-idUSKBN1EX157", "ord_in_thread": 0, "title": "Germany expects return of over 100 children of Islamist fighters", "locations": [], "entities": {"persons": [{"name": "emily haber", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "interior ministry state", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 12:34 PM / Updated 7 minutes ago Germany expects return of over 100 children of Islamist fighters Reuters Staff 4 Min Read \nBERLIN (Reuters) - German security officials are preparing for the arrival of over 100 infants and children of people who left the country to fight for Islamic State in Iraq and Syria, amid concerns about the radicalization of minors. \nNearly a thousand people are believed to have left Germany to join up with the Islamist militants. As the group’s presence in the Middle East crumbles, some are returning with family members, while German authorities are trying to secure the release of children whose parents have been detained. \nIn a document addressed to a lawmaker and seen by Reuters on Monday, Interior Ministry State Secretary Emily Haber said it was difficult to estimate the exact number of children set to arrive since it was unclear how many babies were born while their parents were in Iraq or Syria. \nBut security officials had information indicating that “a low three-digit number of minors is expected,” with the majority believed to be babies or toddlers, Haber said in a reply to a formal parliamentary query by Greens lawmaker Irene Mihalic. \nHans-Georg Maassen, head of the BfV domestic intelligence agency, had warned in October that children of returning Islamists could pose a threat after being “socialised and indoctrinated in the battlefield areas.” \nThe radicalization of children has been in the spotlight given that three of five Islamist attacks in Germany in 2016 were carried out by minors, and a 12-year-old boy was also detained after trying to bomb a Christmas market in Ludwigshafen. \nThe German government says it has evidence that more than 960 people left Germany for Iraq and Syria through November 2017 to fight for the Islamic State jihadist group, of which about a third are believed to have returned to Germany. Another 150 likely died in combat, according to government data. \nState Secretary Haber said there was no evidence of a big increase in the return of people from Iraq and Syria in recent months despite military setbacks for Islamic State. \nThe German foreign ministry was providing consular services to German citizens and their children who had been detained or imprisoned in Iraq, and was seeking the return of children that were now imprisoned with their parents in Iraq, Haber said. \n“No timeline can be given for the return of these children since this is largely dependent on the cooperation of the Iraqi authorities,” she wrote. \nGiven Germany’s decentralized federal structure, state officials had the main responsibility for deradicalization of those who returned from Iraq and Syria, including those were convicted and incarcerated, Haber said. \nBut she said the federal government was supporting those efforts through a number of initiatives, including support for families of those who left Germany to fight for Islamic State. \nNew federally-funded programs were planned in 2018 to educate and deradicalize returning foreign fighters, and the federal government was also funding programs in each of the 16 states to prevent further radicalization in prison, Haber said. Reporting by Sabine Siebold and Andrea Shalal; Editing by Toby Chopra", "external_links": [], "published": "2018-01-08T14:34:00.000+02:00", "crawled": "2018-01-08T14:49:35.032+02:00", "highlightTitle": ""}