{"organizations": [], "uuid": "8ebe4189f45c805dde017461b5c31cd18a1558a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-roxgold-exceeds-increased-2017-production-guidance-and-provides-2018-operational-outlook.html", "country": "US", "domain_rank": 767, "title": "Roxgold Exceeds Increased Production Guidance and Provides 2018 Operational Outlook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-16T01:00:00.000+02:00", "replies_count": 0, "uuid": "8ebe4189f45c805dde017461b5c31cd18a1558a3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-roxgold-exceeds-increased-2017-production-guidance-and-provides-2018-operational-outlook.html", "ord_in_thread": 0, "title": "Roxgold Exceeds Increased Production Guidance and Provides 2018 Operational Outlook", "locations": [], "entities": {"persons": [], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "roxgold inc.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan. 15, 2018 /PRNewswire/ - Roxgold Inc. (\"Roxgold\" or \"the Company\") (TSX: ROXG) (OTC: ROGFF) is pleased to announce its preliminary production results for the fourth quarter and full year of 2017, and its operational outlook for 2018. All amounts are in U.S. dollars unless otherwise indicated.\n2017 Highlights\nGold production of 126,990 ounces in 2017, exceeding the upper limit of the increased guidance range of 115,000 to 125,000 ounces previously announced on September 20, 2017 Gold production of 35,016 ounces during the fourth quarter at an average mill feed grade of 17.6 grams per tonne (\"g/t Au\") achieving 99.1% gold recovery Sold 126,555 ounces of gold for annual gold sales totalling approximately $159.4 million Strong balance sheet with cash balance of approximately $64 million and long-term debt face value balance of $47 million as of December 31, 2017 Over 4 million hours worked Lost Time Injury Free\n2018 Outlook\nGold production is expected to be between 110,000 and 120,000 ounces in 2018 Cost estimates for 2018:\no Cash operating cost (per ounce produced) 1 : $450 - $500\no All-in sustaining cost (per ounce sold) 1 : $780 - $830\no Underground capital expenditure: $22 million - $26 million\no Bagassi South pre-production capital expenditure: $30 million\no Exploration budget: $9 million\n\"2017 was another significant year for Roxgold. In our first full year of operations, we exceeded the upper limit of our increased guidance range, and have ended the year with a strong balance sheet and an exceptional safely record. I would like to thank our team for their continued hard work on accomplishing these milestones,\" commented John Dorward, President and CEO of Roxgold. \"In 2018, our focus will be on continuing to deliver value to our shareholders with the ramp-up of the Bagassi South extension and process plant expansion, and pursuing accretive growth opportunities through the execution of our extensive regional exploration program. With the development of Bagassi South, our second-high grade underground mine at Yaramoko expected to come online in late 2018, we anticipate production to be approximately 160,000 ounces of gold from the two mines over the course of 2019.\"\n2017 Preliminary Fourth Quarter and Fiscal Year Key Metrics 2\nQ1 2017\nQ2 2017\nQ3 2017\nQ4 2017\n2017\nGold ounces produced\n35,594\n27,970\n28,410\n35,016\n126,990\nGold ounces sold\n34,979\n28,788\n27,912\n34,876\n126,555\nGold Sales (000's)\n$42,977\n$36,166\n$35,907\n$44,364\n$159,414\nAverage realized selling price (per ounce)\n$1,229\n$1,254\n$1,286\n$1,270\n$1,260\nTotal Development (metres)\n1,740\n2,085\n1,730\n1,267\n6,822\nOre mined (tonnes)\n69,237\n66,044\n76,480\n108,094\n319,855\nOre processed (tonnes)\n63,955\n65,159\n66,670\n70,815\n266,599\nHead grade (g/t)\n17.3\n12.8\n13.6\n17.6\n15.3\nRecovery (%)\n99.2\n99.0\n98.6\n99.1\n98.9\nIn 2017, the Yaramoko gold mine produced 319,855 tonnes at 13.6 g/t from the underground mine with the proportion of stoping tonnes increasing over the course of the year.\nIn the plant, metallurgical performance has been consistently high with gravity recovery averaging 65% to 70% and overall recovery of 99% for the period. Throughput was 266,599 tonnes at 15.3 g/t with operating time of 96%. Notably, throughputs increased quarter on quarter indicating increased stability and reliability of the circuit.\nRoxgold's closing cash balance was approximately $64 million 3 and long-term debt face value balance of $47 million 3 as of December 31, 2017.\nRoxgold expects to release its fourth quarter and full year 2017 financial results on March 28, 2018. The Company's 2017 Cash Operating cost 1 per ounce and All-in-Sustaining cost 1 per ounce will be reported at that time and is expected to be within guidance.\nHealth and Safety in 2017\nThere were no lost time injuries (\"LTI\") during the fourth quarter, or in the full calendar year for 2017. In 2017, there were 2.1 million LTI free hours worked, with a total of 4 million LTI free hours worked as at December 31, 2017.\n2018 Operational Outlook\nRoxgold anticipates its 2018 annual gold production at Yaramoko to be between 110,000 and 120,000 ounces in 2018.\n2018 Estimated Costs\nCash operating cost (per ounce produced) 1\n$450 - $500\nAll-in sustaining cost (per ounce sold) 1\n$780 - $830\nUnderground capital expenditure\n$22 million - $26 million\nBagassi South pre-production capital expenditure\n$30 million\nExploration budget\n$9 million\nThe mine is expected to produce slightly stronger quarters in Q2 and Q3. In addition, 2018 is expected to see a greater proportion of the mill feed met by stoping activities as opposed to ore development. Grades from the mine are expected to be in line with those seen in 2017 with an average of 13.7 g/t Au expected across the year.\nIn Q3 and Q4, the processing plant tie-ins for the Bagassi South expansion are expected to occur, slightly affecting mill operating time in those periods; however, it is planned that these exercises will largely occur within planned maintenance stoppages.\nNotes:\n1\nThis is a non-IFRS Financial performance measure with no standard definition under IFRS. See the \"non-IFRS financial performance measure\" section of the Company's 2017 MD&A available on www.SEDAR.com .\n2\nTotals may not add up due to rounding.\n3\nUnaudited.\nQualified Persons\nPaul Criddle, FAUSIMM, Chief Operating Officer for Roxgold Inc., and Craig Richards P. Eng, Principal Mining Engineer for Roxgold Inc., are Qualified Persons within the meaning of National Instrument 43-101, and have verified and approved the technical data disclosed in this press release.\nAbout Roxgold\nRoxgold is a gold mining company with its key asset, the high grade Yaramoko Gold Mine, located in the Houndé greenstone region of Burkina Faso, West Africa. Roxgold trades on the TSX under the symbol ROXG and as ROGFF on OTC.\nThis press release contains \"forward-looking information\" within the meaning of applicable Canadian securities laws (\"forward-looking statements\"). Such forward-looking statements include, without limitation: statements with respect to Mineral Reserves and Mineral Resource estimates (including proposals for the potential growth and/or upgrade thereof), anticipated receipt of permits, future production and life of mine estimates, production and cost guidance, anticipated decreases in waste development and increases in head grade, the anticipated increased proportion of mill feed coming from stoping ore, future capital and operating costs and expansion and development plans including with respect to the 55 Zone and Bagassi South, and the expected timing thereof. These statements are based on information currently available to the Company and the Company provides no assurance that actual results will meet management's expectations. In certain cases, forward-looking information may be identified by such terms as \"anticipates\", \"believes\", \"could\", \"estimates\", \"expects\", \"may\", \"shall\", \"will\", or \"would\". Forward-looking information contained in this news release is based on certain factors and assumptions regarding, among other things, the estimation of Mineral Resources and Mineral Reserves, the realization of resource estimates and reserve estimates, gold metal prices, the timing a", "external_links": ["http://www.sedar.com/"], "published": "2018-01-16T01:00:00.000+02:00", "crawled": "2018-01-16T03:07:00.016+02:00", "highlightTitle": ""}