{"organizations": [], "uuid": "cb42df66f20b2eed0bc122989fb59e421c87273e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-dow-eyes-26000-as-earnings-pick-up-pace-idUSL3N1PB41B", "country": "US", "domain_rank": 408, "title": "US STOCKS-Dow eyes 26,000 as earnings pick up pace", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T22:07:00.000+02:00", "replies_count": 0, "uuid": "cb42df66f20b2eed0bc122989fb59e421c87273e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-dow-eyes-26000-as-earnings-pick-up-pace-idUSL3N1PB41B", "ord_in_thread": 0, "title": "US STOCKS-Dow eyes 26,000 as earnings pick up pace", "locations": [], "entities": {"persons": [{"name": "sruthi shankar jan", "sentiment": "none"}, {"name": "hershey", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "citigroup", "sentiment": "negative"}, {"name": "unitedhealth", "sentiment": "negative"}, {"name": "ge", "sentiment": "negative"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "citigroup inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Citigroup, UnitedHealth jump after Q4 results\n* GE slides after saying it would take $6.2 bln Q4 charge\n* Hershey’s slip after Goldman Sachs downgrades to sell\n* Futures up: Dow 208 pts, S&P 12.5 pts, Nasdaq 38.75 pts (Adds comment, details, updates prices)\nBy Sruthi Shankar\nJan 16 (Reuters) - Futures on the Dow Jones Industrial Average surged more than 200 points on Tuesday, indicating that the blue-chip index could open above 26,000 for the first time as the fourth-quarter reporting season kicks into high gear.\nDow component UnitedHealth rose 1.47 percent after the largest U.S. health insurer reported results that beat analysts’ estimates and raised its full-year profit forecast.\nCitigroup Inc jumped 2.7 percent after the lender reported profit that topped Wall Street expectations as strength in consumer businesses made up for lower revenue from bond and currency trading.\nHopes of strong quarterly earnings, supported by steep cut in corporate taxes, and solid global economic growth have bolstered Wall Street’s optimism in the start to 2018.\n“Not only is the U.S. coming off a strong quarter, but the new tax reform measures are continuing to provide a boost, with investors keen to hear more about what impact this will have on future earnings,” said Craig Erlam, senior market analyst at online foreign exchange broker Oanda.\nMore than three quarters of the 26 S&P 500 companies that have reported so far have topped profit estimates, according to Thomson Reuters I/B/E/S.\nAt 8:28 a.m. ET (1328 GMT), Dow e-minis were up 208 points, or 0.81 percent, with 77,188 contracts changing hands.\nIf the Dow hits 26,000 on Tuesday, it would mark its fastest 1000-point rise. It ended above 25,000 on Jan. 4.\nS&P 500 e-minis were up 12.5 points, or 0.45 percent, with 312,460 contracts traded.\nNasdaq 100 e-minis were up 38.75 points, or 0.57 percent, on volume of 72,029 contracts.\nGeneral Motors rose 3.36 percent after the company said it expects earnings in 2018 to be largely flat, compared with 2017, but that profits should pick up pace in 2019.\nGeneral Electric shares fell 3.52 percent in heavy premarket trading, after the industrial conglomerate said it would record a $6.2 billion charge in the fourth quarter as part of an ongoing review of its finance arm’s insurance portfolio.\nOil prices pulled back from recent highs on Tuesday, with Brent crude dipping 1.07 percent to $69.51 per barrel.\nHershey fell 1.05 percent after Goldman Sachs downgraded the stock to “sell”.\nBitcoin tumbled 18 percent to a four-week trough close to $11,000, after reports that a ban on trading of cryptocurrencies in South Korea was still an option.\nShares of cryptocurrency-related companies were all down. Marathon Patent, Riot BlockChain, Xunlei and Overstock.com fell between 4 percent and 13 percent. (Reporting by Sruthi Shankar in Bengaluru; Editing by Anil D‘Silva)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T22:07:00.000+02:00", "crawled": "2018-01-17T20:09:38.002+02:00", "highlightTitle": ""}