{"organizations": [], "uuid": "495dfef32755024157a1fc26ba5d44a4db79e2fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222356253&w=1200&r=LYNXMPEE0F0H9", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/us-china-shipping-accident/japan-sees-little-chance-of-oil-slick-from-sunk-tanker-reaching-its-coast-idINKBN1F50QS", "country": "US", "domain_rank": 408, "title": "Japan sees little chance of oil slick from sunk tanker reaching its coast", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T09:50:00.000+02:00", "replies_count": 0, "uuid": "495dfef32755024157a1fc26ba5d44a4db79e2fa"}, "author": "", "url": "https://in.reuters.com/article/us-china-shipping-accident/japan-sees-little-chance-of-oil-slick-from-sunk-tanker-reaching-its-coast-idINKBN1F50QS", "ord_in_thread": 0, "title": "Japan sees little chance of oil slick from sunk tanker reaching its coast", "locations": [], "entities": {"persons": [], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "east china sea", "sentiment": "none"}, {"name": "sanchi", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "10th regional coast guard", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 7:54 AM / Updated 5 hours ago Japan sees little chance of oil slick from sunk tanker reaching its coast Yuka Obayashi 4   Japan sees little chance of the oil spill from a stricken Iranian tanker that sank on Sunday in the East China Sea reaching its shores, an official at the nation’s environment ministry said on Tuesday. Flames and smoke from the Iranian oil tanker Sanchi is seen in the East China Sea, on January 15, 2018 in this photo provided by Japan's 10th Regional Coast Guard. 10th Regional Coast Guard Headquarters/Handout via REUTERS \n(Graphic: Burning Iranian tanker drifts to Japan - tmsnrt.rs/2DqMwH7 ) \nThe large tanker Sanchi (IMO:9356608) sank in the worst oil ship disaster in decades and produced a large oil slick, Chinese media and Japanese authorities said on Monday, as worries grew over damage to the marine ecosystem. \nThe vessel’s crew of 30 Iranians and two Bangladeshis are all believed to have perished in the incident. \n“Oil spills in general can have a big environmental impact if they reach the coast, but we think that there is little chance of that happening on Japanese seashores for now,” the official who helps oversee the marine environment for the ministry told Reuters by telephone. He declined to be named as he was not authorised to speak to media. \nThe tanker had been adrift and ablaze after crashing into the freighter CF Crystal (IMO:9497050) on Jan. 6. Strong winds pushed it away from the Chinese coast, where the incident happened, and into Japan’s exclusive economic zone (EEZ). \nThe ship, which was carrying 136,000 tonnes or almost a million barrels of condensate - an ultra-light, highly flammable crude oil - sank after several explosions weakened the hull. \n“From the area where the tanker sank, a sea current is heading to the north, limiting the chances of the oil slick reaching Japanese coasts,” the ministry official said. \nAccording to the Japan Coast Guard, the slick has narrowed and elongated. It is now meandering across an area about 27 km (16.8 miles) long and 15 km (9.3 miles) wide, with a width of between 300 metres and 800 metres, it said in a statement. \nOn Monday, the Coast Guard had said the oil had spread over an area about 13 km (8.1 miles) long and 11 km (6.8 miles) wide. \n(Infographic: Tanker blaze burns bright interactive - tmsnrt.rs/2DmrPvL ) \nA Coast Guard spokesman said patrol boats were cruising through the area to help diffuse the slick, adding that the “spill area had shrunk from the previous day”, referring to the overall narrowing of the area covered by the slick. \nAnother spokesman at the Coast Guard said earlier on Tuesday that it was carefully monitoring the oil slick in case weather conditions changed the spill’s direction. \nExperts worry the sinking of the tanker Sanchi will likely expel the remaining condensate and the tanker’s bunker fuel, or the heavy fuel oil that powers a ship’s engines, contaminating the surrounding waters. \nBunker fuel is the dirtiest kind of oil, extremely toxic when spilled, though less explosive than condensate. \nThe Coast Guard has not identified the kind of oil in the slick, but it assumes the spill mostly contains condensate as some of the slick is diffusing and disappearing. \nSouth Korea is north of the site where the tanker sank, but a coast guard official from the country played down the chances of the slick reaching the peninsula, noting it was about 600 km (373 miles) from Jeju Island, the nation’s southernmost island. Reporting by Yuka Obayashi, additional reoorting by Jane Chung in Seoul; Editing by Joseph Radford and Himani Sarkar", "external_links": [], "published": "2018-01-16T09:50:00.000+02:00", "crawled": "2018-01-16T10:01:27.048+02:00", "highlightTitle": ""}