{"organizations": [], "uuid": "afb11b2fab996c4a2a33aca12650a632acc6b0c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WY342_2bt5C_TOP_20180111015154.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1516709189", "country": "US", "domain_rank": 387, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T15:06:00.000+02:00", "replies_count": 0, "uuid": "afb11b2fab996c4a2a33aca12650a632acc6b0c7"}, "author": "Brian Baskin", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1516709189", "ord_in_thread": 0, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "locations": [], "entities": {"persons": [{"name": "matthew dalton", "sentiment": "none"}], "locations": [], "organizations": [{"name": "logistics news from - wsj", "sentiment": "negative"}, {"name": "cartier", "sentiment": "none"}, {"name": "compagnie financière richemont sa", "sentiment": "none"}, {"name": "yoox net-a-porter", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "richemont", "sentiment": "none"}, {"name": "amzn", "sentiment": "none"}, {"name": "wsj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Sign up: With one click, get this newsletter delivered to your inbox .\nLuxury retailers are starting to embrace e-commerce - on their terms . Compagnie Financière Richemont SA, CFRUY 1.01% owner of Cartier and other brands, will pay up to $3.3 billion to buy the shares in e-commerce firm Yoox Net-a-Porter it doesn’t already own , the WSJ’s Matthew Dalton reports. Luxury brands have been slow to embrace e-commerce, largely avoiding partnerships with Amazon.com Inc. AMZN 1.69% and other marketplaces due to concerns about counterfeiting and pricing. But the industry faces the same problems as down-market brick-and-mortar chains, including declining store traffic and competition from online-only competitors. Richemont’s decision shows that neither side has all the answers - online marketplaces need well-known brands for their financial firepower and large customer bases, and the incumbents need help attracting younger, web-savvy shoppers and tackling the complex logistics of e-commerce distribution.\nRetail’s automated future is here - albeit later than expected. Amazon.com Inc. opened to the public a cashierless store in the base of its Seattle headquarters about a year later than originally planned, the online retailer’s latest foray into the physical world, the WSJ’s Laura Stevens writes. Shoppers are tracked throughout the location and charged when they pick out an item, eliminating the need for checkout counters . Amazon says it’s trained the system to recognize subtle differences in packaging and shoppers’ unpredictable movements.The technology has the potential to accelerate a shift already underway in the retail world, where brick-and-mortar chains are shifting employees and resources from the storefront to warehouses. Still, former Amazon executives say the Amazon Go store concept would be difficult to scale up to a larger footprint.\nGlobalization’s decades-long winning streak appears to be over. Businesses cut back on overseas investments for a second consecutive year in 2017, the WSJ’s Paul Hannon writes. The United Nations report showed foreign direct investment, covering everything from new factories and international mergers, declined by 16% last year to $1.52 trillion . The drop is surprising in that it comes at a time when the world economy is growing, and may indicate that a backlash to globalization is having some tangible effects on where businesses choose to invest. Not all of the decline can be attributed to protectionist rhetoric or President Donald Trump’s election. A temporary lull in mega-mergers and uncertainty over U.S. tax policy and Brexit also kept some businesses on the sidelines. The U.N. Conference on Trade and Development anticipates a rebound this year, but says the era of one-way globalization has come to an end.\nENERGY The Philadelphia Energy Solutions oil refinery. Photo: david parrott/Reuters The owner of a pair of Philadelphia refineries has found itself cut out of the rapidly evolving global energy supply chain. Philadelphia Energy Solutions LLC affiliates filed for bankruptcy protection , blaming federal environmental regulations, the WSJ’s Peg Brickley and Christopher M. Matthews write. But the refineries’ problems run much deeper than the cost of complying with ethanol blending rules. East Coast refineries, which mainly process oil imported from Russia, Nigeria and other foreign sources, have been undercut by competitors that have easy access to cheaper domestically produced crude. The lifting of a ban on U.S. oil exports further doomed the Philadelphia refineries, which found it even more difficult to bring in oil from the Bakken basin in the Northern U.S. after producers there gained access to the international market. With the U.S. set to surpass Saudi Arabia as the world’s biggest oil producer, the two refineries are the latest, but likely not the last, examples of businesses that have struggled to keep up with the changing market.\nQUOTABLE\n‘ [People] move in very unpredictable ways. You’re always bending down, you’re examining items, you’re picking things up. ’\n—Dilip Kumar, vice president of technology for Amazon Go and Amazon Books, on the difficulties involved in setting up a cashierless store.\nNumber of the Day 15% Increase in Yoox Net-a-Porter’s revenue in 2017\nIN OTHER NEWS The Trump administration imposed tariffs on washing machines and solar panels , its most aggressive steps yet to implement an “America First” trade policy. (WSJ)\nThe International Monetary Fund predicts the world economy will grow 3.9% in 2018 and 2019, the strongest pace since 2011. (WSJ)\nCanadian and Mexican trade officials are looking to salvage the North American Free Trade Agreement in talks now underway in Montreal. (WSJ)\nActivist investor Daniel Loeb’s Third Point LLC put fresh pressure on Nestlé SA to sell stakes in non-core businesses. (WSJ)\nBillionaires Carl Icahn and Darwin Deason teamed up to urge a sale of Xerox Corp. (WSJ)\nBacardi is acquiring the maker of Patrón tequila for $5.1 billion. (WSJ)\nThe Transportation Safety Administration ordered stricter screening of cargo originating in the Middle East. (Air Cargo World)\nCosmetics companies are taking a cue from fast-fashion retailers and speeding up their supply chains. (Business of Fashion)\nA union representing Bangladeshi textile workers reached a $2.3 million settlement with a multinational apparel brand over unsafe working conditions. (The Guardian)\nCompanies that rent big rigs for under 30 days received a 90-day exemption from the new rule requiring electronic logging devices. (Transport Topics)\nFreight forwarders are struggling to find enough capacity to handle increased air freight demand. (Lloyd’s Loading List)\nMid-Atlantic ports are seeing a revival in coal exports . (Associated Press)\nPort of Charleston officials are looking for more space as container volumes surge. (The Post and Courier)\nAlstom will test an automated freight train in the Netherlands. (Reuters)\nABOUT US Brian Baskin is editor of WSJ Logistics Report. Follow him at @brianjbaskin , and follow the entire WSJ Logistics Report team: @PaulPage , @jensmithWSJ and @EEPhillips_WSJ . Follow the WSJ Logistics Report on Twitter at @WSJLogistics .\nWrite to Brian Baskin at brian.baskin@wsj.com", "external_links": ["http://www.ttnews.com/articles/fmcsa-grants-truck-leasing-group-90-day-eld-exemption", "https://twitter.com/jensmithWSJ", "https://www.postandcourier.com/business/with-cargo-containers-on-the-rise-charleston-ports-agency-looks/article_de03a848-fc65-11e7-8180-5f0bad97d24d.html", "https://twitter.com/WSJLogistics?lang=en", "https://pilotonline.com/news/nation-world/virginia/article_b3ea8751-7325-5b33-8181-5051c80527fa.html", "https://www.theguardian.com/business/2018/jan/22/bandgladesh-textile-factory-safety-unions-settlement", "https://www.reuters.com/article/us-alstom-transportation-automation/alstom-to-test-automated-freight-train-in-the-netherlands-idUSKBN1FB22A", "https://www.lloydsloadinglist.com/freight-directory/news/Air-freight-capacity-concerns-prompt-new-forwarder-strategies/71169.htm#.WmY9DK6nHyE", "https://twitter.com/EEPhillips_WSJ?lang=en", "https://www.businessoffashion.com/articles/professional/beauty-brands-are-boosting-speed-to-market", "https://twitter.com/PaulPage", "http://www.twitter.com/brianjbaskin", "http://www.twitter.com/paulpage", "https://aircargoworld.com/allposts/citing-increased-bombing-risk-tsa-mandates-additional-security-on-middle-east-airfreight/"], "published": "2018-01-23T15:06:00.000+02:00", "crawled": "2018-01-23T19:28:12.002+02:00", "highlightTitle": ""}