{"organizations": [], "uuid": "511b9e175d4c72b77365c46794f25cafe14cf917", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-rocket-pharmaceuticals-prices-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Rocket Pharmaceuticals Prices Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:25:00.000+02:00", "replies_count": 0, "uuid": "511b9e175d4c72b77365c46794f25cafe14cf917"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-rocket-pharmaceuticals-prices-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Rocket Pharmaceuticals Prices Public Offering of Common Stock", "locations": [], "entities": {"persons": [{"name": "cowen", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "rocket pharmaceuticals prices public offering of common stock", "sentiment": "negative"}, {"name": "rocket pharmaceuticals, inc.", "sentiment": "neutral"}, {"name": "evercore isi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Rocket Pharmaceuticals, Inc. (NASDAQ: RCKT) (“Rocket”), a leading U.S.-based multi-platform gene therapy company, today announced the pricing of an underwritten public offering of 5,500,000 shares of its common stock at a public offering price of $13.25 per share. The gross proceeds to Rocket from the offering are expected to be $72,875,000 before deducting the underwriting discounts and commissions and other estimated offering expenses. Rocket has granted the underwriters a 30-day option to purchase up to an additional 825,000 shares of common stock. All the shares in the offering are to be sold by Rocket. The offering is expected to close on or about January 26, 2018, subject to satisfaction of customary closing conditions. Rocket intends to use the net proceeds from this offering to fund the continued development of its pipeline of gene therapies for rare diseases, enhancements to in-house manufacturing, and general corporate purposes.\nCowen and Evercore ISI are acting as joint book-running managers for the offering.\nThe shares are being offered by Rocket pursuant to an effective shelf registration statement on Form S-3 that was previously filed with the U.S. Securities and Exchange Commission (SEC). A final prospectus supplement relating to and describing the terms of this offering will be filed with the SEC. When available, copies of the final prospectus supplement and the accompanying prospectus relating to these securities may be obtained from Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY 11717, Attention: Prospectus Department, or by telephone at (631) 274-2806 and Evercore Group L.L.C., Attention: Equity Capital Markets, 55 East 52nd Street, 36th Floor, New York, NY 10055, by telephone at 888-474-0200, or by email at ecm.prospectus@evercore.com . You may also obtain these documents free of charge by visiting the SEC’s website at www.sec.gov .\nThis press release does not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Rocket Pharmaceuticals, Inc.\nRocket Pharmaceuticals, Inc. (NASDAQ: RCKT) (“Rocket”) is an emerging, clinical-stage biotechnology company focused on developing first-in-class gene therapy treatment options for rare, undertreated diseases. Rocket’s multi-platform development approach applies the well-established lentiviral vector (LVV) and adeno-associated viral vector (AAV) gene therapy platforms. Rocket's lead clinical program is a LVV-based gene therapy for the treatment of Fanconi Anemia (FA), a difficult to treat genetic disease that leads to bone marrow failure and potentially cancer. Preclinical studies of additional bone marrow-derived disorders are ongoing and target Pyruvate Kinase Deficiency (PKD), Leukocyte Adhesion Deficiency-I (LAD-I) and Infantile Malignant Osteopetrosis (IMO). Rocket is also developing an AAV-based gene therapy program for an undisclosed rare pediatric disease.\nForward-looking Statements\nVarious statements in this release concerning Rocket’s future expectations, plans and prospects, including without limitation, Rocket’s expectations regarding the safety, effectiveness and timing of products that Rocketmay develop, including in collaboration with academic partners, to treat Fanconi Anemia (FA), Leukocyte Adhesion Deficiency-I (LAD-I), Pyruvate Kinase Deficiency (PKD) and Infantile Malignant Osteopetrosis (IMO), and the safety, effectiveness and timing of related pre-clinical studies and clinical studies, may constitute forward-looking statements for the purposes of the safe harbor provisions under The Private Securities Litigation Reform Act of 1995 and other federal securities laws and are subject to substantial risks, uncertainties and assumptions. You should not place reliance on these forward-looking statements, which often include words such as \"believe\", \"expect\", \"anticipate\", \"intend\", \"plan\", \"will give\", \"estimate\", \"seek\", \"will\", \"may\", \"suggest\" or similar terms, variations of such terms or the negative of those terms. Although Rocket believes that the expectations reflected in the forward-looking statements are reasonable, Rocket cannot guarantee such outcomes. Actual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including, without limitation, Rocket’s ability to successfully demonstrate the efficacy and safety of such products and pre-clinical and clinical studies, its gene therapy programs, the pre-clinical and clinical results for its product candidates, which may not support further development and marketing approval, the potential advantages of Rocket’s product candidates, actions of regulatory agencies, which may affect the initiation, timing and progress of pre-clinical studies and clinical trials of its product candidates, Rocket’s and its licensors ability to obtain, maintain and protect its and their respective intellectual property, the timing, cost or other aspects of a potential commercial launch of Rocket’s product candidates, Rocket’s ability to manage operating expenses, Rocket’s ability to obtain additional funding to support its business activities and establish and maintain strategic business alliances and new business initiatives, Rocket’s dependence on third parties for development, manufacture, marketing, sales and distribution of product candidates, the outcome of litigation, and unexpected expenditures, as well as those risks more fully discussed in the section entitled “Risk Factors” in the Definitive Proxy Statement on Schedule 14A filed by Rocket with the Securities and Exchange Commission in connection with its recently completed merger. Accordingly, you should not place undue reliance on these forward-looking statements. All such statements speak only as of the date made, and Rocket undertakes no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005635/en/\nClaudine Prowse, Ph.D.\nSVP Corporate Development and IRO\nRocket Pharma, Inc.\nThe Alexandria Center for Life Science\n430 East 29 Street, Suite 1040\nNew York, NY 10016\ncp@rocketpharma.com\nSource: Rocket Pharmaceuticals, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketpharma.com%2F&esheet=51748089&newsitemid=20180124005635&lan=en-US&anchor=Rocket+Pharmaceuticals%2C+Inc.&index=1&md5=d2223618a30be0c74c91a5d4c3d6626f", "http://www.businesswire.com/news/home/20180124005635/en/"], "published": "2018-01-24T16:25:00.000+02:00", "crawled": "2018-01-24T19:12:41.003+02:00", "highlightTitle": ""}