{"organizations": [], "uuid": "ef108a1f32113ada1fc2954f858fbb39e7b1ccee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 54, "shares": 54, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218681597&w=1200&r=LYNXMPEE0012O", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-australia-economy-houseprices/australia-home-prices-slip-in-december-as-sydney-slows-idUSKBN1EQ1A3", "country": "US", "domain_rank": 408, "title": "Australia home prices slip in Dec as Sydney slows", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T01:00:00.000+02:00", "replies_count": 0, "uuid": "ef108a1f32113ada1fc2954f858fbb39e7b1ccee"}, "author": "", "url": "https://www.reuters.com/article/us-australia-economy-houseprices/australia-home-prices-slip-in-december-as-sydney-slows-idUSKBN1EQ1A3", "ord_in_thread": 0, "title": "Australia home prices slip in Dec as Sydney slows", "locations": [], "entities": {"persons": [], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "corelogic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SYDNEY (Reuters) - Home prices across Australia’s major cities fell in December as the once red-hot Sydney market continued to cool in the face of tighter rules on investment lending, a relief to regulators but a potential drag on consumer spending power.\nProperty consultant CoreLogic said its index of home prices for the combined capital cities dipped 0.4 percent in December from November.\nAnnual growth in prices slowed to 4.3 percent, from 5.2 percent in November and 10.5 percent in the middle of 2017.\nPrices in Sydney slipped 0.9 percent in December and pulled annual growth down to just 3.1 percent, a far cry from the peak of 17 percent seen early in the year. Sydney dwelling values are still up 71 percent on the cyclical low hit in February 2012.\nMelbourne fared somewhat better, thanks in part to rapid population growth, with prices easing 0.2 percent in December to be 8.9 percent higher for the year.\nHome prices outside the major cities edged up 0.2 percent in December to be 3.8 percent higher on the year.\nA slowdown has been much desired by the country’s bank watchdog which tightened standards on investment and interest-only loans, leading banks to raise rates on some mortgage products.\nThe Reserve Bank of Australia has also been concerned that debt-fuelled speculation in property could ultimately hurt both consumers and banks.\nThe inexorable rise of prices in the major cities had put homes out of the reach of many first-time buyers and had become a political hot potato.\nYet the boom has also been a boon for household wealth with the government statistician estimating the housing stock was worth a cool A$6.8 trillion ($5.3 trillion) at the end of the third quarter - four times the size of annual gross domestic product.\nThe explosion in wealth had helped offset weakness in wages, so any lasting downturn in home prices could now act as a drag on consumer confidence and spending.\nReporting by Wayne Cole; Editing by Jonathan Oatis\n ", "external_links": [], "published": "2018-01-02T01:00:00.000+02:00", "crawled": "2018-01-02T01:34:13.165+02:00", "highlightTitle": ""}