{"organizations": [], "uuid": "6190791efef4a89ac52f56e05a4d90f9e9c996cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-all-stars-projects-board-elects-nationally-recognized-business-professionals-to-leadership-posts.html", "country": "US", "domain_rank": 767, "title": "All Stars Project's Board Elects Nationally-Recognized Business Professionals to Leadership Posts", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T18:30:00.000+02:00", "replies_count": 0, "uuid": "6190791efef4a89ac52f56e05a4d90f9e9c996cb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-all-stars-projects-board-elects-nationally-recognized-business-professionals-to-leadership-posts.html", "ord_in_thread": 0, "title": "All Stars Project's Board Elects Nationally-Recognized Business Professionals to Leadership Posts", "locations": [], "entities": {"persons": [{"name": "gregory tosko", "sentiment": "none"}, {"name": "gabrielle kurlander", "sentiment": "none"}, {"name": "maria morris", "sentiment": "none"}, {"name": "peter langerman", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "m.d", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "all stars project, inc", "sentiment": "neutral"}, {"name": "all stars", "sentiment": "none"}, {"name": "inc.", "sentiment": "none"}, {"name": "mount sinai st. luke's hospital", "sentiment": "none"}, {"name": "metlife", "sentiment": "none"}, {"name": "franklin mutual advisers", "sentiment": "none"}, {"name": "all stars project", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 22, 2018 /PRNewswire/ -- The All Stars Project, Inc . (ASP) today announced that at its December meeting the Board of Directors elected a team of nationally-recognized business professionals to key leadership posts including:\nNew Chair: Maria Morris , retired Executive Vice President and head of Global Employee Benefits at MetLife, Inc.; New Vice Chairs: Jessie Fields, M.D ., Attending physician, Mount Sinai St. Luke's Hospital, and Peter Langerman , Chairman, President and CEO of Franklin Mutual Advisers, LLC; New Treasurer , Gregory Tosko , Vice Chairman at CBRE-Tri-state region.\nEach of the new officers has a long history of philanthropic involvement with the ASP and its work to address poverty and help youth in America's inner cities, and they will be instrumental in helping ASP launch its $100 million expansion campaign.\n\"The combined knowledge, vision and commitment of our board to the mission and work of the All Stars has always been a fundamental part of our success,\" said Gabrielle Kurlander, president and CEO of the All Stars Project. \"The amazing group of talented people serving on our board, and our newly elected officers, will strengthen our efforts to be recognized by 2020 as America's action and thought leader in Afterschool Development as a new way to engage poverty.\"\nNew Chair\nMaria Morris has been on the ASP board since 2008, serving as a vice chair since 2013. Morris recently retired from MetLife, and is currently a member of the board of directors of S&P Global and Wells Fargo. Morris was instrumental in building the partnership between MetLife and the All Stars, one of its most successful corporate relationships. MetLife has a 15-year record of support for ASP, ranging from organizational expertise, financial support and grassroots program involvement.\n\"Through our wonderful organization, donors and partnerships, the All Stars Project has achieved record growth and impact over the last few years. We are making a positive difference to tens of thousands of youth and poor communities across the nation. And we are also on the verge of breaking through to our next level of impact as the nationally-recognized leader in Afterschool Development,\" said Maria Morris, new Chair of the ASP Board. \"As a 100% privately funded non-profit, the in-the-trenches support we receive from corporate partners, community leaders and philanthropists are vital components of our success, and inspirational to us all.\"\nMorris succeeds Richard Sokolow of Davidson Kempner Capital Management who remains on the board and co-chairs the ASP's $100 million expansion campaign.\nNew Vice Chairs\nDr. Jessie Fields and Peter Langerman join Hunter Hunt , the CEO of Hunt Consolidated Energy, as vice chairs.\nDr. Fields has been a member of the ASP community for over 20 years. She maintains a general medical practice at Mount Sinai St. Luke's Hospital in Manhattan and is on the faculty at Touro College of Osteopathic Medicine , where she mentors medical students pursuing careers in primary care in underserved communities. She has steadfastly worked throughout her career to bring better health conditions to poor urban communities.\nMr. Langerman became an All Stars supporter a decade ago and joined the ASP of New Jersey board in 2014. He has served on the board since 2015 and is the co-chair of the $100 million expansion campaign. Langerman was an early and vital supporter of the campaign to establish the Scott Flamm Center for Afterschool Development in Newark and is now lead sponsor of the ASP of NJ, involved in every aspect of advancing programs and fundraising.\nNew Treasurer\nGregory Tosko has been an All Stars supporter since 1996, including serving on the board since 2007. Tosko was also appointed the new chair of the Finance and Audit Committee, which he has served on for the last seven years. In addition to his professional guidance, he has been a prolific fundraiser and is actively involved in ASP's youth development programs.\nAbout The All Stars Project:\nThe All Stars Project is a 100% privately-funded national nonprofit organization founded in 1981 to transform the lives of youth and poor communities using the developmental power of performance, in partnership with caring adults. With over 180 corporate partners who give their time, talents and energy – in addition to financial support – ASP's Afterschool Development programs reach over 50,000 youth and community members in poor neighborhoods in six cities, including New York, Chicago, Dallas, Newark, Jersey City and the San Francisco Bay Area. The ASP is supported by some of America's leading companies including MetLife, EY, Viacom, PSEG, AIG, Equity Residential, Investors Bank, Hunt Consolidated and Silicon Valley Bank. For more information visit www.allstars.org .\nMedia Contact: Derek Beckwith, (617) 331-3567, E-mail: derekrbeckwith@gmail.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/all-stars-projects-board-elects-nationally-recognized-business-professionals-to-leadership-posts-300585865.html\nSOURCE All Stars Project, Inc.", "external_links": ["http://www.allstars.org/", "https://allstars.org/", "https://tourocom.touro.edu/", "http://www.prnewswire.com/news-releases/all-stars-projects-board-elects-nationally-recognized-business-professionals-to-leadership-posts-300585865.html"], "published": "2018-01-22T18:30:00.000+02:00", "crawled": "2018-01-22T20:26:59.006+02:00", "highlightTitle": ""}