{"organizations": [], "uuid": "ac6ea5259a88bdc26b1ba049fea3b3d06bae8ed3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-metals/metals-upbeat-china-industrial-data-boosts-copper-idUSL3N1PD3MG", "country": "US", "domain_rank": 408, "title": "METALS-Upbeat China industrial data boosts copper", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:20:00.000+02:00", "replies_count": 0, "uuid": "ac6ea5259a88bdc26b1ba049fea3b3d06bae8ed3"}, "author": "", "url": "https://www.reuters.com/article/global-metals/metals-upbeat-china-industrial-data-boosts-copper-idUSL3N1PD3MG", "ord_in_thread": 0, "title": "METALS-Upbeat China industrial data boosts copper", "locations": [], "entities": {"persons": [{"name": "zandi shabalala", "sentiment": "none"}, {"name": "dan smith", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "oxford economics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:10 PM / in 10 minutes METALS-Upbeat China industrial data boosts copper Reuters Staff \n* LME/ShFE arb: bit.ly/2wZSAEz (Adds closing price, zinc, nickel stories) \nBy Zandi Shabalala \nLONDON, Jan 18 (Reuters) - Copper rose on Thursday as a robust performance by China’s industrial sector helped to lift the biggest metal consumer’s economic growth in the fourth quarter. \nBenchmark copper closed 0.6 percent higher at $7,076 a tonne after the metal used in power and construction touched a four-week low in the previous session. \n“China’s construction markets and industry have held up better than people thought,” said Oxford Economics commodities analyst Dan Smith. \n“A few months ago the data for construction was quite poor, but that has improved recently and those are the kinds of things that are important for a boost in copper.” \nCHINA GDP: China’s economy grew faster than expected in the fourth quarter, helped by a rebound in the industrial sector, a resilient property market and strong export growth. \nHOME PRICES: China’s housing market picked up slightly in December, but price growth more than halved in 2017 as government curbs on speculation took effect. \nU.S. INDUSTRIAL DATA: U.S. industrial production increased more than expected in December but manufacturing output barely rose, pointing to moderate growth in the sector. \nCOPPER BOOST: Chile’s state copper commission, Cochilco, on Wednesday raised its estimated 2018 average price for the metal to $3.06 per pound from its previous forecast of $2.95, pointing to the potential for global supply disruptions this year. \nBHP: Copper output at BHP jumped 20 percent to 429,000 tonnes in the three months to Dec. 31, helped by a rise in production at its Escondida mine in Chile. \nALUMINIUM OUTPUT: China’s primary aluminium production rebounded in December after five months of decline despite winter output restrictions imposed on smelters, helping to lift total 2017 output to record levels. \nMETALS COLUMN: After the party must come the hangover. Industrial metals went on something of a bull bender over the course of December and have done no more than stagger into the New Year. \nZINC: Rising supplies of zinc over the next couple of years are unlikely to replenish dwindling inventories to the extent that the market stops fretting about shortages and driving up prices towards peaks last seen in 2007. \nNICKEL: The global nickel market narrowed its deficit to 8,400 tonnes in November from 11,500 tonnes the previous month, the International Nickel Study Group said on Thursday. \nPRICES: Aluminium ended 2.2 percent up at $2,241 a tonne, lead rose 2.5 percent to $2,610, tin dipped 0.3 percent to $20,425, zinc edged up 0.3 percent to $3,376 and nickel was up 0.5 percent at $12,475. Additional reporting by James Regan in Sydney; Editing by David Goodman and Alexander Smith", "external_links": [], "published": "2018-01-18T15:20:00.000+02:00", "crawled": "2018-01-18T15:35:51.014+02:00", "highlightTitle": ""}