{"organizations": [], "uuid": "2e8c0306af21d6c2016567690d18c19e7c70f3b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-wsfs-announces-actions-related-to-the-tax-cuts-and-jobs-act-of-2017-and-other-year-end-noteworthy-items.html", "country": "US", "domain_rank": 767, "title": "WSFS Announces Actions Related to the Tax Cuts and Jobs Act of 2017, and Other Year-End Noteworthy Items", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-05T00:44:00.000+02:00", "replies_count": 0, "uuid": "2e8c0306af21d6c2016567690d18c19e7c70f3b2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-wsfs-announces-actions-related-to-the-tax-cuts-and-jobs-act-of-2017-and-other-year-end-noteworthy-items.html", "ord_in_thread": 0, "title": "WSFS Announces Actions Related to the Tax Cuts and Jobs Act of 2017, and Other Year-End Noteworthy Items", "locations": [], "entities": {"persons": [{"name": "mark turner", "sentiment": "none"}], "locations": [{"name": "del.", "sentiment": "none"}, {"name": "wilmington", "sentiment": "none"}], "organizations": [{"name": "wsfs financial corporation", "sentiment": "negative"}, {"name": "wsfs", "sentiment": "negative"}, {"name": "wsfs foundation", "sentiment": "none"}, {"name": "wsfs bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WILMINGTON, Del., Jan. 04, 2018 (GLOBE NEWSWIRE) -- WSFS Financial Corporation (NASDAQ:WSFS), the parent company of WSFS Bank, today announced a series of actions resulting from the enactment of H.R. 1, also known as the Tax Cuts and Jobs Act , and other decisions that will impact earnings for the fourth quarter of 2017. These actions include writing down a deferred tax asset, the planned surrender of bank-owned life insurance (BOLI) policies, realizing a fraud loss charge, and a periodic grant to the WSFS Foundation.\n“The enactment of recent tax reform legislation along with continued strong core performance, positions us to further invest in our business and the communities we serve,” said Mark Turner, Chairman, President and CEO, WSFS Bank. “These decisions will also enable us to focus our attention in 2018 on key performance metrics and exceeding goals set in our Strategic Plan.”\nThe impacts to earnings described in this release are preliminary estimates and subject to additional procedures which could result in material changes to the preliminary estimated impacts to earnings noted below. These additional procedures could result in material changes to our preliminary estimates during the course of our preparation of condensed consolidated financial statements as of and for the quarter and full year ended December 31, 2017.\nDeferred Tax Asset Write-Down\nThe enactment of H.R. 1 results in significant changes to the U.S. tax code, including a reduction in the top corporate income tax rate from 35% to 21%, effective January 1, 2018. As of September 30, 2017, WSFS had a net deferred tax asset (DTA) totaling $29.4 million. As a result of the reduction in the corporate income tax rate, WSFS is required to revalue its net DTA at December 31, 2017. WSFS estimates the revaluation of its DTA will result in an incremental income tax charge of approximately $12 – $13 million in the fourth quarter of 2017. The Company anticipates a negative earnings per share (EPS) impact of approximately $0.37 – $0.40 resulting from this income tax charge. WSFS expects to recover this charge through lower taxes by the end of the third quarter in 2018.\nSurrender of Bank-Owned Life Insurance\nWSFS periodically reviews its various tax-advantaged investments. In light of the current higher interest rate environment, the lower corporate tax rate, and the tax-equivalized yield on its Bank-Owned Life Insurance (BOLI) investments, WSFS will surrender all BOLI policies in 2018, as the returns on such policies are no longer accretive to the Company’s expected high-performance goals for return on assets (ROA). In addition, the decision to surrender the policies was based on ongoing administrative complexity and a reduction in insured interest coverage, as a significant majority of those insured are no longer current Associates. WSFS’ decision to surrender the policies will result in an incremental income tax charge of approximately $8 million in the fourth quarter of 2017. The Company anticipates an impact on EPS of approximately $0.25 resulting from this income tax charge. The timing to surrender the BOLI policies in conjunction with the new tax rates represents a $3.6 million savings over the prior tax rate environment.\nFraud Loss\nWSFS will record a pre-tax operating expense of approximately $2.8 million from a fraud loss in the fourth quarter of 2017, resulting from a scheme to defraud the bank that was previously disclosed in a current report on Form 8-K on June 22, 2017. The previously viable business loans associated with this relationship became delinquent when the individual decided to immediately wind-down and liquidate the assets of his business due to the significant reductions in revenue that occurred once his indictment was made public. WSFS is pursuing all available remedies, including working with insurance carriers to recoup the loss and believes it has a strong case for recovery in 2018. The Company anticipates an impact on EPS of approximately $0.06 resulting from this pre-tax operating expense.\nGrant to the WSFS Foundation\nAs a community-based organization, and consistent with WSFS’ mission, We Stand For Service , the Company contributed $1.5 million (pre-tax) to the WSFS Foundation in the fourth quarter of 2017. This generational donation matches the only other grant made to the Foundation when it was formed in 2003. The grant will help fund the next generation of improvements in the communities served by WSFS Bank. The WSFS Foundation primarily focuses on educational programs for children in grades K-12 who live in underserved communities and who attend public schools. WSFS Bank anticipates an impact on EPS of approximately $0.03 resulting from this pre-tax expense.\nRecap\nThe actions outlined in this announcement are expected to reduce reported after-tax income by $22.8 – $23.8 million in the fourth quarter of 2017, or $0.71 – $0.74 in EPS.\nWSFS Financial Corporation expects to report fourth quarter and full-year 2017 results on January 22, 2018, followed by a conference call with analysts and investors on January 23, 2018 at 1p.m. EST.\nAbout WSFS Financial Corporation\nWSFS Financial Corporation is a multi-billion dollar financial services company. Its primary subsidiary, WSFS Bank, is the oldest and largest locally-managed bank and trust company headquartered in Delaware and the Delaware Valley. As of September 30, 2017, WSFS Financial Corporation had $6.88 billion in assets on its balance sheet and $18.07 billion in assets under management and administration. WSFS operates from 77 offices located in Delaware (46), Pennsylvania (29), Virginia (1) and Nevada (1) and provides comprehensive financial services including commercial banking, retail banking, cash management and trust and wealth management. Other subsidiaries or divisions include Christiana Trust, WSFS Wealth Investments, Cypress Capital Management, LLC, West Capital Management, Powdermill Financial Solutions, Cash Connect ® , WSFS Mortgage and Arrow Land Transfer. Serving the Delaware Valley since 1832, WSFS Bank is one of the ten oldest banks in the United States continuously operating under the same name. For more information, please visit wsfsbank.com .\nForward-Looking Statement Disclaimer\nThis press release contains estimates, predictions, opinions, projections and other \"forward-looking statements\" as that phrase is defined in the Private Securities Litigation Reform Act of 1995. Such statements include, without limitation, references to the Company's predictions or expectations of future business or financial performance as well as its goals and objectives for future operations, financial and business trends, business prospects, the effects of recent tax reform legislation, and management's outlook or expectations for earnings, revenues, expenses, capital levels, liquidity levels, asset quality or other future financial or business performance, strategies or expectations. Such forward-looking statements are based on various assumptions (some of whi", "external_links": ["https://www.globenewswire.com/Tracker?data=Rhl76TIKU4VLZKCwGmNBdyhAjfwWa7Nz3u3ZifpSQsJxGl867XkAHqm4Jdc5p_fWWBW0LUkt7FExl1L4kmaQgTzbEA-Prrc9UTmF6-PgF-k=", "https://www.globenewswire.com/Tracker?data=qbvz449BVA9NJ2ayJU5dS2vzI82pHVkAGdGC22ZD7exnSez-BK2cvlCAY_e4ib_A8i8GSWGtTdukK3Ixnvl9UAQ-SSE9In0YDvOYoCBbUIE=", "https://www.globenewswire.com/Tracker?data=AeEG8CoW2n8ZSZteyI22hdFIciZe1oAP9lj7u1f6Ik1d13bYU6KEsHF_8lOWM1SHlbSA_rIWRcUbL6Z_EO6-xsVZl8BK3vKLRjixucAiV0w=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/3f252484-32e0-4f86-8fa0-bc29ac99eb0f"], "published": "2018-01-05T00:44:00.000+02:00", "crawled": "2018-01-05T01:23:24.003+02:00", "highlightTitle": ""}