{"organizations": [], "uuid": "66c97066f4dbcd8bd1eabfe3bab92528dbf62e9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/sri-lanka-bond-probe/sri-lanka-panel-finds-ex-cbank-chief-former-finmin-fault-in-2015-bond-sale-president-idUSL4N1OY3N6", "country": "US", "domain_rank": 408, "title": "Sri Lanka panel finds ex-cbank chief, former finmin fault in 2015 bond sale - president", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T15:35:00.000+02:00", "replies_count": 0, "uuid": "66c97066f4dbcd8bd1eabfe3bab92528dbf62e9e"}, "author": "", "url": "https://www.reuters.com/article/sri-lanka-bond-probe/sri-lanka-panel-finds-ex-cbank-chief-former-finmin-fault-in-2015-bond-sale-president-idUSL4N1OY3N6", "ord_in_thread": 0, "title": "Sri Lanka panel finds ex-cbank chief, former finmin fault in 2015 bond sale - president", "locations": [], "entities": {"persons": [{"name": "arjuna mahendran", "sentiment": "none"}, {"name": "maithripala sirisena", "sentiment": "none"}, {"name": "sirisena", "sentiment": "none"}, {"name": "mahendran", "sentiment": "none"}], "locations": [{"name": "sri lanka", "sentiment": "none"}, {"name": "colombo", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "perpetual treasuries ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "perpetual treasuries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 1:37 PM / in 33 minutes Sri Lanka panel finds ex-cbank chief, former finmin fault in 2015 bond sale - president Reuters Staff 3 Min Read \nCOLOMBO, Jan 4 (Reuters) - Sri Lankan President Maithripala Sirisena said a panel investigating irregularities in government bond sales has recommended legal action against the finance minister and the head of the central bank at the time, in a case that has energised the opposition. \nThe case relates to a 2015 bond auction in which more than half the issue was sold to Perpetual Treasuries Ltd, a subsidiary of a company owned by the son-in-law of former central bank governor Arjuna Mahendran. \nSirisena said the presidential commission of inquiry had concluded that Perpetual Treasuries has made profits through illegal means and blamed the bank governor and other officials for the lapse. \nMahendran did not answer telephone calls or text messages from Reuters on Thursday seeking his comments on the panel’s report which was submitted to the president on Dec. 31. But earlier appearing before the committee, Mahendran denied any wrongdoing. \nPerpetual Treasuries also did not respond to a request for comment. In its submission to the panel, it too had denied any wrongdoing. \nSirisena, in a statement released late on Wednesday, said the panel had recommended charges of bribery and giving false evidence be brought against former finance minister Ravi Karunanayake for his role in the sale. \nKarunanayake resigned from his portfolio in August over corruption charges in the bond probe, maintaining that he was innocent. \n“The confidentiality, astuteness and auditing methods of the Central Bank of Sri Lanka were extremely weak. There were no tele-recording systems, electronic monitoring or even CCTVs,” Sirisena said, summing up the recommendations of the commission. \nOpposition parties as well as a faction of the ruling coalition have demanded parliament be convened earlier than the scheduled opening on Jan. 23 to debate the findings of the panel. \nSirisena said he was already acting on the committee’s recommendations. “I have already submitted this report to the Attorney General and the Commission recommends that the criminal and civil court action must be taken,” he said. \nOpposition lawmakers have said the bond auction had cost the state more than $1 billion because of rising borrowing costs. $1 = 153.5000 Sri Lankan rupees Reporting by Shihar Aneez and Ranga Sirilal; Editing by Sanjeev Miglani and Subhranshu Sahu", "external_links": [], "published": "2018-01-04T15:35:00.000+02:00", "crawled": "2018-01-04T16:12:46.046+02:00", "highlightTitle": ""}