{"organizations": [], "uuid": "9185c21be3b161771c1c8294fcf6b077292cde76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/emerging-markets/emerging-markets-global-growth-optimism-lifts-emerging-stocks-to-new-multi-year-high-idUSL8N1PI2ET", "country": "US", "domain_rank": 408, "title": "EMERGING MARKETS-Global growth optimism lifts emerging stocks to new multi-year high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T12:21:00.000+02:00", "replies_count": 0, "uuid": "9185c21be3b161771c1c8294fcf6b077292cde76"}, "author": "", "url": "https://www.reuters.com/article/emerging-markets/emerging-markets-global-growth-optimism-lifts-emerging-stocks-to-new-multi-year-high-idUSL8N1PI2ET", "ord_in_thread": 0, "title": "EMERGING MARKETS-Global growth optimism lifts emerging stocks to new multi-year high", "locations": [], "entities": {"persons": [{"name": "karin strohecker", "sentiment": "none"}], "locations": [{"name": "budapest", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 23 (Reuters) - Buoyed by a strong lead from Wall Street and the end of the U.S. government shutdown, emerging stocks rose 1 percent on Tuesday to near-decade highs, though currencies were mixed, with the rand retreating from 2-1/2-year highs.\nMSCI’s emerging equity benchmark extended gains for an eighth session - the longest winning streak since July with heavyweight Hong Kong up 1.6 percent to hit record highs and South Korea hot on the heels with tech and consumer stocks racing higher.\nAcross emerging Europe, stocks in Budapest and Warsaw scaled new peaks while bourses in South Africa, Turkey and Russia all advanced.\nThe gains came after U.S. senators struck a deal to end a three-day government shutdown, sending Wall Street’s main indexes to record highs.\nGlobal equity markets have been on a tear over the past year, buoyed by a synchronised uptick in global economic growth and emerging markets bolstered by continued low borrowing rates.\nThe International Monetary Fund upped its global growth forecasts for 2018 and 2019, including for China, helping to support bullish sentiment\n“China has continued to grow at a very strong pace – there were very few signs of a slowdown in the fourth quarter, and that has driven up commodities and sentiment,” said Per Hammarlund at SEB in Stockholm.\nFresh money flowing into investment funds had “combined to give this very positive sentiment at the beginning of the year,” he added.\nEmerging currencies were hit by a rise in the dollar\nSouth Africa’s rand and Turkey’s lira weakened 0.5 percent against the greenback, but the losses followed solid gains on Monday, when the rand hit a 2-1/2 year high on hopes scandal-tarnished President Jacob Zuma would be forced out.\nMexico’s peso extended falls for a second day while Russia’s rouble was treading water thanks to support from stronger oil prices .\nInvestors remain bullish on South Africa though, with Eurobonds in state-run utility Eskom extending gains to multi-month highs. The firm said it would ask local banks to reopen lending facilities that were suspended last year and the Treasury said it would support this request\n“(South Africa‘s) leadership has a window of opportunity to implement changes ahead of the 2019 general elections,” UBS Wealth Management said.\nGlobal markets were jittery about trade wars though and some Asian heavyweights such as Samsung Electronics and LG Electronics suffered after U.S. President Donald Trump slapped steep tariffs on washing machines and solar cells.\nThe shares later recovered some ground as Seoul said it would complain to the WTO.\nIn eastern Europe, the most notable move was on Hungarian sovereign domestic bond benchmark yields which pulled back following a sharp rise since Thursday, when markets had been disappointed with the central bank’s interest swap tender.\nFor GRAPHIC on emerging market FX performance 2017, see tmsnrt.rs/2e7eoml For GRAPHIC on MSCI emerging index performance 2017, see tmsnrt.rs/2dZbdP5\nFor CENTRAL EUROPE market report, see\nFor TURKISH market report, see\nFor RUSSIAN market report, see)\nReporting by Karin Strohecker, additional reporting and graphic by Claire Milhench; Editing by Robin Pomeroy\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-23T12:21:00.000+02:00", "crawled": "2018-01-23T12:42:34.005+02:00", "highlightTitle": ""}