{"organizations": [], "uuid": "f460cf4da12eb32696885616a933b4c1d72d8d62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 24}, "facebook": {"likes": 55, "shares": 55, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/03/03/101461392-145775987.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/leadership-what-kind-of-leader-are-you.html", "country": "US", "domain_rank": 767, "title": "Leadership: What kind of leader are you?", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.151, "site_type": "news", "published": "2018-01-31T09:30:00.000+02:00", "replies_count": 0, "uuid": "f460cf4da12eb32696885616a933b4c1d72d8d62"}, "author": "Karen Gilchrist", "url": "https://www.cnbc.com/2018/01/30/leadership-what-kind-of-leader-are-you.html", "ord_in_thread": 0, "title": "Leadership: What kind of leader are you?", "locations": [], "entities": {"persons": [{"name": "andrew harrer", "sentiment": "negative"}, {"name": "charismatic", "sentiment": "none"}, {"name": "warren buffett", "sentiment": "none"}, {"name": "jeff bezos", "sentiment": "none"}, {"name": "richard branson", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bloomberg | getty images warren buffett  imagine", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Imagine you're asked to name a great leader. Chances are a few major names spring to mind.\nBut now imagine you're asked to name the attribute that got them there. That's perhaps a little more difficult. What is it that unites the likes of Jeff Bezos , Warren Buffett and Richard Branson and has enabled them to effect great change?\nWell, according to a new research from British communications specialists Call Care, there's no one magic trait. Instead, their success can be attributed to one of four key leadership styles.\nWhich one is yours? CNBC Make It breaks them down.\nA charismatic leader Charismatic leaders are strong public speakers and are renowned for their ability to influence and inspire others. Some of history's most notable leaders are considered to have risen to prominence largely because of this attribute.\nCharacter traits: Inspiring and great at communicating\nCharismatic leaders are unrivaled when it comes to motivating and inspiring others. That is an especially beneficial attribute when it comes to boosting morale and encouraging others to work harder.\nBy being able to communicate well, charismatic leaders are able to promote their vision and persuade others to buy into it.\nFamous charismatic leaders, according to Call Care:\nMartin Luther King Jr., civil rights leader Sir Richard Branson, entrepreneur behind Virgin brands Winston Churchill, former British prime minister Adam Jeffery | CNBC Sir Richard Branson speaking at the Innovation Summit in Brooklyn, New York on July 14, 2017. A collaborative leader Known for being team players, collaborative leaders are typically less authoritative but their strength lies in making others feel valued and listened to.\nCharacter traits: Credit-sharers and good at mediating\nCollaborative leaders don't just collaborate, but they make sure others receive recognition for their hard work. That, in turn, can be crucial for boosting morale.\nBy listening to others and helping to mediate disputes, collaborative types are able to diffuse problems and encourage better working practices.\nFamous collaborative leaders , according to Call Care:\nAbraham Lincoln, former U.S. president Jeff Bezos, Amazon founder and chief Sheryl Sandberg , Facebook COO Fabrice Coffrini | AFP | Getty Images Sheryl Sandberg, Chief Operating Officer (COO) of Facebook. A calculated leader Calculated leaders rely heavily on facts and figures in their decision-making, which makes them good at discovering and finding solutions to problems.\nCharacter traits: Hard working and process-driven\nCalculated leaders are not afraid of getting their hands dirty to ensure their vision is successful on all levels. That can be a great way of gaining respect from others.\nEfficiency is paramount for calculated leaders, who like to implement thought-out processes to ensure their work runs smoothly.\nFamous calculated leaders , according to Call Care:\nMary Barra , General Motors CEO Mark Zuckerberg , Facebook co-founder and CEO Warren Buffett, investor Getty Images Mark Zuckerberg, CEO of Facebook A no-compromise leader No-compromise leaders have the ability to make important decisions and retain sight of their vision. Some may find it tough to work for such a leader, but they often create great things.\nCharacter traits: Confident and proactive\nUnsurprisingly, no-compromise leaders are confident and driven, which enables them to avoid being taken advantage of and can also be a source of motivation for others.\nNo-compromise leaders can be among the most innovative because they focus on creating solutions and getting jobs done, rather than relying on input from others.\nFamous no-compromise leaders , according to Call Care :\nLord Alan Sugar, business magnate on BBC's \"The Apprentice\" Steve Jobs , co-founder and former CEO of Apple Peter Jones, entrepreneur famed for BBC's \"Dragons' Den\" Justin Sullivan | Getty Images Steve Jobs, co-founder of Apple Call Care's head of client services, Gemma Harding, noted that identifying your strengths and weaknesses, and how those impact others, is the first step toward being an effective leader.\n\"In today's diverse working culture, it's more important than ever to understand how different types of leaders can be effective in their environments,\" she said.\n\"Identifying the kind of leader we are can help make us more aware of our own strengths and weaknesses so that we can better anticipate how to best tackle the obstacles that come our way.\"\nTo take Call Care's leadership test, click here .\nshow chapters Welcome to the Charisma Masterclass 9:34 AM ET Tue, 2 May 2017 | 03:02 Like this story? Like CNBC Make It on Facebook !", "external_links": [], "published": "2018-01-31T09:30:00.000+02:00", "crawled": "2018-01-31T09:31:23.017+02:00", "highlightTitle": ""}