{"organizations": [], "uuid": "730c97c75c08cc6d71c7511b252080854a268837", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-blacksmith-applications-acquires-gosimple.html", "country": "US", "domain_rank": 767, "title": "Blacksmith Applications Acquires GoSimple", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-11T17:00:00.000+02:00", "replies_count": 0, "uuid": "730c97c75c08cc6d71c7511b252080854a268837"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-blacksmith-applications-acquires-gosimple.html", "ord_in_thread": 0, "title": "Blacksmith Applications Acquires GoSimple", "locations": [], "entities": {"persons": [{"name": "blacksmith", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "lawrence", "sentiment": "none"}, {"name": "oldsmar", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "gosimple llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAWRENCE, Mass., Jan. 11, 2018 /PRNewswire/ -- Blacksmith Applications, a leading provider of SaaS-based trade promotion management software for enterprise-class consumer packaged goods manufacturers, today announced the acquisition of GoSimple LLC of Oldsmar, Florida.\nGoSimple provides a complete foodservice trade promotion management solution to small and mid-tier CPG manufacturing organizations. GoSimple offers an end-to-end workflow, pricing analytics, and a fully integrated claims processing capability.\nThe combined company, which manages more than $4.5 billion in annual promotional spend, will provide a comprehensive solution that serves the needs of small and large CPG companies. Blacksmith will retain the GoSimple brand and offering as the premier solution for small and mid-tier CPG companies, and it will continue to be offered to new clients seeking ease of use and rapid onboarding. Blacksmith's FORGE application will be the enterprise platform for clients with the most complex requirements. FORGE Analytics, providing data and insights to improve pricing and trade effectiveness, will be offered across the portfolio. Going forward, Blacksmith Applications will invest in product enhancements and extensions to meet the needs of the GoSimple client base.\n\"The Blacksmith Applications team has a vision that dovetails really well with the GoSimple brand. Together we can reach all tiers in the market, delivering product solutions that are best-in-class and structured for the needs of companies managing trade promotions, regardless of their size,\" said Brian Maloney, COO of GoSimple. \"This partnership will allow us to deliver the best solutions in the competitive set. Employees of GoSimple will also benefit from our expanded corporate network and professional growth opportunities.\"\nBrian Maloney will join Blacksmith Applications' senior leadership team as General Manager of the GoSimple product division after the transaction.\n\"I have great respect for Brian Maloney and the GoSimple team. The solution they have built has been welcomed by the market, and it is a terrific complement to the FORGE enterprise platform, delivering a quick-start, easy-to-use solution for small and mid-tier clients,\" said Paul Wietecha, President & CEO of Blacksmith Applications. \"This transaction demonstrates our commitment to assembling the best talent and creating the best solutions to meet the growing pricing and promotion demands of the entire CPG industry. Together, we will continue to outpace the competition.\"\nThe needs that Blacksmith Applications addresses with its application, FORGE, are highlighted as ongoing imperatives in the industry. According to a recent Gartner* publication, \"Consumer goods manufacturers continue to spend a significant portion of their budgets managing promotions and price reductions as a part of collaborative efforts with retail partners.\"\nAs an organization with tiered end-to-end solutions for both retail and foodservice, Blacksmith Applications will be able to drive critical transformation in the CPG manufacturing industry with process oriented and analytically superior solutions.\nBlacksmith Applications will leverage GoSimple's investments in location level data and CRM solutions to enhance the client experience at every tier. The combined Blacksmith Applications will expand strategic investments in analytics and integrations to deliver insights that advance the business intelligence position of our customers and separate our portfolio from competitors. Blacksmith Applications, which is backed by Strattam Capital, has a long history of partnering with the world's largest CPG companies and it looks forward to continued success with existing and incorporated customers.\nAbout Blacksmith Applications:\nBlacksmith Applications is a SaaS technology company offering TPM software and consulting to top tier CPG retail and foodservice organizations. Our application, FORGE, enables program creation, claim settlement, and boasts powerful analytical capabilities. Our customer list includes organizations such as General Mills, Unilever Food Solutions, Conagra Brands, The KraftHeinz Company and more. The Blacksmith Applications team is comprised of professionals with decades of CPG experience and we stand apart from ordinary solutions not only in the capabilities of our application but also in our industry knowledge. Find out more at www.blacksmithapplications.com .\nAbout GoSimple:\nGoSimple provides affordable trade promotion management solutions for foodservice manufacturers. Our focus is to provide superior service in the claims/deduction management arena while providing a best in class software solution. Learn more about our manufacturer trade promotion management platform: http://gosimple.me\nAbout Strattam Capital\nStrattam Capital is a private equity firm with an innovative and focused approach to scaling established business IT companies. Our team's alignment and engagement practices are designed to deliver a better future for our companies. Strattam has offices in Austin and San Francisco. To learn more visit www.strattam.com .\nMedia Contact:\nJennifer Schiffman\nBlacksmith Applications\n978-557-7565\n*Source: Gartner, \"Market Guide for Trade Promotion Management and Optimization for the Consumer Goods Industry\", Ellen S Eichhorn, Stephen E. Smith, 2 February 2017\nView original content: http://www.prnewswire.com/news-releases/blacksmith-applications-acquires-gosimple-300580881.html\nSOURCE Blacksmith Applications", "external_links": ["http://www.blacksmithapplications.com/", "http://www.prnewswire.com/news-releases/blacksmith-applications-acquires-gosimple-300580881.html", "http://gosimple.me/", "http://www.strattam.com/"], "published": "2018-01-11T17:00:00.000+02:00", "crawled": "2018-01-11T18:50:01.032+02:00", "highlightTitle": ""}