{"organizations": [], "uuid": "8a61a66ebc1e85c67ed962d15445b8dda5294d36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-hearst-completes-acquisition-of-rodale-inc-magazine-media-brands.html", "country": "US", "domain_rank": 767, "title": "Hearst Completes Acquisition of Rodale Inc. Magazine Media Brands", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:30:00.000+02:00", "replies_count": 0, "uuid": "8a61a66ebc1e85c67ed962d15445b8dda5294d36"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-hearst-completes-acquisition-of-rodale-inc-magazine-media-brands.html", "ord_in_thread": 0, "title": "Hearst Completes Acquisition of Rodale Inc. Magazine Media Brands", "locations": [], "entities": {"persons": [{"name": "bill strickland", "sentiment": "none"}, {"name": "bicycl", "sentiment": "none"}, {"name": "steven r. swartz", "sentiment": "none"}, {"name": "david carey", "sentiment": "none"}, {"name": "ronan gardiner", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "lehigh valley", "sentiment": "none"}], "organizations": [{"name": "magazine media brands", "sentiment": "negative"}, {"name": "rodale", "sentiment": "neutral"}, {"name": "hearst completes acquisition of rodale inc", "sentiment": "neutral"}, {"name": "hearst", "sentiment": "neutral"}, {"name": "hearst magazines", "sentiment": "none"}, {"name": "men’s health", "sentiment": "none"}, {"name": "hearst magazines’ enthusiast group", "sentiment": "none"}, {"name": "runner’s world", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Hearst announced today that it has completed its transaction with Rodale to acquire the company’s global health and wellness brands. In addition to the U.S. editions and digital expressions, the newly-acquired brands publish 62 print editions and 57 websites in 31 countries.\nThe acquisition adds complementary health and wellness titles to Hearst’s diversified portfolio of magazine brands, encompassing 20 titles in the U.S. and nearly 300 editions and websites around the world. The announcement was made by Hearst President and CEO Steven R. Swartz and Hearst Magazines President David Carey. Terms were not disclosed.\nFollowing the close, Hearst Magazines announced several new leadership roles:\nBill Strickland, formerly group editorial director at Rodale, was named editorial director of Hearst Magazines’ Enthusiast Group, encompassing Bicycling and Runner’s World, and will reimagine the business models for a modern audience. This business will remain based in the Lehigh Valley. Ronan Gardiner becomes vice president, publishing director of Men’s Health, Bicycling and Runner’s World. Previously, Gardiner was chief advertising officer at Rodale after serving as vice president, publisher and managing director at Men’s Health. Before that, he was advertising director at Men’s Journal. David Zinczenko, founder and CEO of Galvanized Media, will serve as interim editorial director of Men’s Health, with a new editor-in-chief to be named in the second quarter. Before launching Galvanized, which has been retained to help in the transition, Zinczenko served as the award-winning editor-in-chief of Men’s Health from 2000 to 2012, and editorial director of Women’s Health and Prevention. Women’s Health joins the Hearst Magazines Young Women’s Group, which includes Cosmopolitan and Seventeen. Liz Plosser has been named editor-in-chief of Women’s Health. Plosser will report to Michele Promaulayko, editor-in-chief of Cosmopolitan and editorial director of the Hearst Magazines Young Women's Group. Promaulayko served as Women’s Health editor-in-chief from 2009 to 2014. Donna Kalajian Lagani, senior vice president, publishing director of the Young Women’s Group, adds oversight of advertising and marketing operations for Women’s Health. Paul Collins, has been named publisher of Bicycling and Runner’s World, reporting to Ronan Gardiner. Collins was previously publisher of Runner’s World and associate publisher of Bicycling. Beth Buehler takes on a consulting role overseeing strategic integration as the companies are brought together, reporting to Carey and Hearst Magazines Chief Financial Officer Debi Chirichella. Buehler was previously chief operating officer of Rodale. Prevention joins the Women’s Lifestyle Group, under editorial director and Good Housekeeping Editor-in-Chief Jane Francisco. The brand will resume accepting advertising, with business-side functions overseen by Women’s Lifestyle Group Senior Vice President, Group Publishing Director, Pat Haegele. Chris Peel has been named executive director, Men’s & Enthusiast Media Group, Hearst Magazines Digital Media, overseeing Esquire.com , MensHealth.com , PopularMechanics.com , Bicycling.com and RunnersWorld.com . Peel was previously publisher of Men’s Health.\nConcurrent with the close, Penguin Random House purchased the assets of Rodale Books.\nAbout Hearst\nHearst is one of the nation's largest diversified media, information and services companies with more than 360 businesses. Its major interests include ownership in cable television networks such as A&E, HISTORY, Lifetime and ESPN; majority ownership of global ratings agency Fitch Group; Hearst Health, a group of medical information and services businesses; 30 television stations such as WCVB-TV in Boston and KCRA-TV in Sacramento, Calif., which reach a combined 19 percent of U.S. viewers; newspapers such as the Houston Chronicle, San Francisco Chronicle and Albany Times Union, nearly 300 magazines around the world including Cosmopolitan, ELLE, Harper's BAZAAR and Car and Driver; digital services businesses such as iCrossing and KUBRA; and investments in emerging digital and video companies such as BuzzFeed, Vice, Complex Networks and AwesomenessTV. Follow us on Twitter @HearstLive and @Hearst .\nAbout Hearst Magazines\nHearst is the largest publisher of monthly magazines with a total paid circulation of over 36 million (AAM 1H 2017). Hearst Magazines’ print and digital assets reach nearly 137 million readers and site visitors each month–more than two-thirds of all women and millennial women in the country (source: 2017 comScore Multi-Platform/MRI 09-17/S17). The company publishes close to 300 editions and 200 websites around the world, with 25 titles in the U.S., and operates iCrossing , a global, full-service digital marketing agency, and business process provider CDS Global . Hearst Magazines holds a majority stake in KUBRA , a customer experience management solutions company, and is a partner with Condé Nast in the publishing services company PubWorX.\n //www.businesswire.com/news/home/20180109006391/en/\nHearst\nPaul Luthringer, 212-649-2540\nPaul@Hearst.com\nor\nHearst Magazines\nFlavie Lemarchand-Wood, 212-649-2581\nFLemarchand-Wood@Hearst.com\nSource: Hearst", "external_links": ["http://www.businesswire.com/news/home/20180109006391/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.runnersworld.com%2F&esheet=51740294&newsitemid=20180109006391&lan=en-US&anchor=RunnersWorld.com&index=5&md5=432243142e1aa05409f780b046ffbe5a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.bicycling.com%2F&esheet=51740294&newsitemid=20180109006391&lan=en-US&anchor=Bicycling.com&index=4&md5=c71481e66950d35ff6468a82b59557f9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.icrossing.com%2F&esheet=51740294&newsitemid=20180109006391&lan=en-US&anchor=iCrossing&index=8&md5=e0046a3e37397d514aa9cbec126a1d95", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.menshealth.com%2F&esheet=51740294&newsitemid=20180109006391&lan=en-US&anchor=MensHealth.com&index=2&md5=ff6836e1b8fdf8aff0c3cc8a9e0fa22e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.twitter.com%2Fhearst&esheet=51740294&newsitemid=20180109006391&lan=en-US&anchor=%40Hearst&index=7&md5=3d4a738ec031775081e7d8138cc5f989", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fkubra.com%2F&esheet=51740294&newsitemid=20180109006391&lan=en-US&anchor=KUBRA&index=10&md5=0695b910cd5041dbb342e5706df2e8db", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.popularmechanics.com%2F&esheet=51740294&newsitemid=20180109006391&lan=en-US&anchor=PopularMechanics.com&index=3&md5=189df8098432602040819a1c34651330", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.esquire.com%2F&esheet=51740294&newsitemid=20180109006391&lan=en-US&anchor=Esquire.com&index=1&md5=148c5b0f3b52b6e86b964843f943df93", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.cds-global.com%2F&esheet=51740294&newsitemid=20180109006391&lan=en-US&anchor=CDS+Global&index=9&md5=b425ef3a1a8f6f70b484c4b81228613d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.twitter.com%2Fhearstlive&esheet=51740294&newsitemid=20180109006391&lan=en-US&anchor=%40HearstLive&index=6&md5=b24778cc9f00e23e9c03f99cacc597db"], "published": "2018-01-09T20:30:00.000+02:00", "crawled": "2018-01-09T21:15:45.005+02:00", "highlightTitle": ""}