{"organizations": [], "uuid": "b545f3f42f92b48c994c80a40edea123c55e3432", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/07/the-associated-press-judge-aims-to-referee-fight-over-charles-mansons-remains.html", "country": "US", "domain_rank": 767, "title": "Judge aims to referee fight over Charles Manson's remains", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T19:54:00.000+02:00", "replies_count": 0, "uuid": "b545f3f42f92b48c994c80a40edea123c55e3432"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/07/the-associated-press-judge-aims-to-referee-fight-over-charles-mansons-remains.html", "ord_in_thread": 0, "title": "Judge aims to referee fight over Charles Manson's remains", "locations": [], "entities": {"persons": [{"name": "charles", "sentiment": "negative"}, {"name": "charles manson", "sentiment": "negative"}, {"name": "mike smith", "sentiment": "none"}, {"name": "jason freeman", "sentiment": "none"}, {"name": "freeman", "sentiment": "none"}, {"name": "manson", "sentiment": "none"}, {"name": "sharon tate", "sentiment": "none"}], "locations": [{"name": "sacramento", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "los angeles superior court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SACRAMENTO, Calif. (AP) — The fight over the body and possessions of apocalyptic cult leader Charles Manson has fragmented into at least three camps competing over an estate that could cash in on songs he wrote that were used by The Beach Boys and Guns N' Roses.\nManson, 83, died in November nearly a half-century after he orchestrated the 1969 killings of pregnant actress Sharon Tate and eight other people.\nA Los Angeles Superior Court judge on Monday will try to sort out at least two conflicting wills and claims by a purported son, grandson and pen pal who all seek control of an estate that includes commercial rights to his name, image and mementos that can fetch thousands of dollars from \"murderabilia\" collectors.\n\"We think Manson's worth more than anyone realizes,\" said Mike Smith, a music agent for a man who claims Manson fathered him during an orgy. \"There's a lot of money there.\"\nThe hearing seeks to name an attorney to administer Manson's estate on behalf of purported grandson Jason Freeman, who claims to be the rightful next of kin. Court documents show Freeman is the son of the late Charles Manson Jr. and the grandson of Charles Manson and his first wife, Rosalie Willis.\nThat lineage is disputed by Matt Lentz, a Los Angeles-area musician who goes by the name Matthew Roberts. Lentz was adopted by an Illinois couple as a newborn.\nLentz plans to file a will Monday that Manson purportedly signed in January 2017 and gave to friend and memorabilia collector Ben Gurecki. It names Gurecki as executor and Lentz as beneficiary.\nIf valid, it could supersede a 2002 will filed in Kern County by longtime Manson pen pal Michael Channels that disinherits Manson's natural born children and names him as executor and heir.\nAttorney Alan Davis, who represents the Freeman bid, said he expects no final decision Monday in part because Judge Clifford Klein would first have to consolidate competing claims.\nLentz wants a DNA test of Manson's remains, which are still being held by the Kern County sheriff-coroner, to prove he is kin and Freeman is not.\nJoAnne Lentz is among those who think her adopted son looks like Manson and has other similarities.\n\"Matthew's got long dark hair and he's a musician,\" she said. \"Have you seen a picture of my Matthew? They look alike, but as far as any DNA (test), I don't know.\"\nMatthew Lentz himself questions whether the will he possesses is valid.\n\"It looks pretty generic, like they got it off the internet or something,\" he said. \"It didn't have the three witnesses that California requires, it only had one.\"\nManson also had a reputed son with Mary Brunner, an early member of his cult. Michael Brunner had no connection with Manson growing up and has severed ties and made no apparent claim to the estate. He did not return messages seeking comment.\nThe will filed by Channels purportedly disinherits both Brunner and Charles Manson Jr., who killed himself in 1993 after siring Jason Freeman.\nSmith said he fears that Freeman only seeks to profit from his position and could put Manson's remains on display.\nCelebrity probate attorney Adam Streisand, who is not involved in the case, said any royalties might instead go to relatives of Manson's victims, though their claims may have lapsed over the years.\nRoyalties from Guns N' Roses 1993 recording of a Manson song, \"Look at Your Game, Girl,\" went to the son of one of his victims under a court order, Streisand said. Manson was also an acquaintance of Beach Boys drummer Dennis Wilson in 1968, and the band recorded a variation of a Manson song under the title \"Never Learn Not To Love.\"\nWhomever controls the estate would be able the use Manson's image and have the power to authorize biographies or documentaries.\nFreeman refused to say what he would do if he wins the court fight, other than to have the body cremated. He's saving further details for a documentary he's been filming since last year.\nHis bid is backed by Manson associate John Michael Jones, who said Manson refused to leave a will. Jones dismissed other claims to Manson's body or possessions as frauds.\n\"They're just looking for 15 minutes of fame,\" he said.\nFreeman said he's waiting for a judge to sort it all out.\n\"I'm a former professional fighter,\" Freeman said. \"I look at this like we're going into the 7th round of a 12-round fight. We're looking for the knockout punch.\"", "external_links": [], "published": "2018-01-07T19:54:00.000+02:00", "crawled": "2018-01-08T00:24:27.004+02:00", "highlightTitle": ""}