{"organizations": [], "uuid": "b0d5bd996c591928fc043a3aaf15c07fbfcf5ab4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/olympics-2018-medals/factbox-olympics-medals-at-winter-olympics-through-the-years-idUSL4N1P54KO", "country": "US", "domain_rank": 408, "title": "FACTBOX-Olympics-Medals at Winter Olympics through the years", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-12T21:08:00.000+02:00", "replies_count": 0, "uuid": "b0d5bd996c591928fc043a3aaf15c07fbfcf5ab4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/olympics-2018-medals/factbox-olympics-medals-at-winter-olympics-through-the-years-idUSL4N1P54KO", "ord_in_thread": 0, "title": "FACTBOX-Olympics-Medals at Winter Olympics through the years", "locations": [], "entities": {"persons": [{"name": "arnold hunerwadel diameter", "sentiment": "none"}, {"name": "mont blanc", "sentiment": "none"}, {"name": "raoul benard diameter", "sentiment": "none"}, {"name": "garmisch-partenki", "sentiment": "none"}, {"name": "huguenin", "sentiment": "none"}], "locations": [{"name": "alps", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "st. moritz", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "chamonix", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "lake placid", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "robbins company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 12 (Reuters) - Design aspects and key features of the medals from each of the Winter Olympic Games from 1924-2018:\n1924 Chamonix, France\nDesigner: Raoul Benard\nDiameter: 55 millimetres (mm)\nMint: Administration of Coins and Medals, Paris\nOn the obverse, a winter sports athlete is holding a pair of skates in his right hand and in his left a pair of skis. In the background, the Alps with Mont Blanc.\nWritten information about the Games on the reverse.\n1928 St. Moritz, Switzerland\nDesigner: Arnold Hunerwadel\nDiameter: 50 mm\nMint: Huguenin Freres\nA skater surrounded by snow crystals on the obverse. The reverse comprised of the Olympic rings with inscription about the host city and olive branches on each side.\n1932 Lake Placid, U.S.\nDiameter: 54 mm\nMint: Robbins Company\nOn the obverse, a winged goddess above the clouds holding a laurel crown in her right hand. In the background, the Adirondack mountains with, at their feet, a winter sports stadium and Lake Placid landscape. On the reverse, in the top half the Olympic rings, under which can be seen a laurel crown.\n1936 Garmisch-Partenkirchen, Germany\nDesigner: Richard Klein\nDiameter: 100 mm\nMint: Deschler\nOn the obverse, an ancient chariot pulled by three horses, driving on a triumphal arch composed of four rays. A goddess of victory sits on the chariot holding a laurel crown. On the reverse, the Olympic rings and the inscription “IV OLYMPISCHE WINTERSPIELE 1936”.\n1948 St. Moritz, Switzerland\nDesigner: Paul-Andre Droz\nDiameter: 60 mm\nMint: Huguenin Freres\nOn the obverse, in between two snow crystals, the inscription “Vmes JEUX OLYMPIQUES D‘HIVER ST.-MORITZ 1948”. A hand holding a lit torch with Olympic rings in the background along with the Olympic motto “CITIUS ALTIUS FORTIUS”.\n1952 Oslo, Norway\nDesigners: Vasos Falireas and Knut Yran\nDiameter: 71 mm\nMint: Th. Marthinsen\nOn the obverse, the Olympic rings with a superimposed torch, a composition based on the design by the Greek artist Vasos Falireas. The reverse, designed by Knut Yran, comprised of an inscription about the host city complemented by a pictogram of the Oslo Town Hall and three snowflakes.\n1956 Cortina D‘Ampezzo, Italy\nDesigner: Costantino Affer\nDiameter: 60 mm\nMint: Lorioli A.E\nOn the obverse, the head of an idealised woman, crowned with five rings. The Olympic flame appears in the foreground with written host description surrounding the scene. Mount Pomagagnon, one of the principal symbols of the Games, topped by a snow crystal on the reverse.\n1960 Squaw Valley, U.S.\nDiameter: 55 mm\nMint: Jones Herff\nThe profile of a male and a female, symbolising the youth of America and the world, on the obverse. The reverse remained simple, with the Olympic rings and the motto “CITIUS ALTIUS FORTIUS”.\n1964 Innsbruck, Austria\nDesigners: Martha Coufal-Hartl and Arthur Zelger\nDiameter: 70 mm\nMint: Hauptmunzamt, Wein\nAn imposing Alpine scene with the inscription “INNSBRUCK 1964” on the obverse. The Olympic rings and the emblem of Innsbruck on the reverse with the host details inscribed around them.\n1968 Grenoble, France\nDesigner: Roger Excoffon\nDiameter: 60 mm\nMint: Administration of Coins and Medals, Paris\nOn the obverse, the official emblem of the Games with the inscription “XEME JEUX OLYMPIQUES D’HIVER GRENOBLE 1968”. A pictogram of the relevant discipline was designed on the reverse for the first time in the history of the Olympic Games. The process used was a photographic transfer onto acid-impregnated steel.\n1972 Sapporo, Japan\nDesigners: Yagi Kazumi and Ikko Tanaka\nDiameter: 60 mm\nMint: Mint Bureau of the Finance Ministry\nSoft, feathery snow highlighting the Japanese scene of peace and serenity on the obverse. On the reverse, snowflake, the sun, and the Olympic rings along with the event details inscription.\n1976 Innsbruck, Austria\nDesigners: Martha Coufal-Hartl and Arthur Zelger\nDiameter: 72 mm\nMint: Hauptmunzamt, Wein\nThe obverse depicts the emblem of the 1976 Games, comprising the Olympic rings and coat of arms of the city showing the bridge on the Inn which gives the city of Innsbruck its name.\nBergisel skiing area is shown on the reverse with Alps in the background.\n1980 Lake Placid, U.S.\nDesigner: Tiffany & Co.\nDiameter: 80mm\nMint: Medallic Art Co.\nOn the obverse, a hand holds the Olympic torch against a mountain background. The reverse shows a pine branch with cones, along with the text “LAKE PLACID 1980”.\n1984 Sarajevo, Yugoslavia\nDesigner: Nebojsa Mitric\nDiameter: 71 mm\nMint: Majdanpek\nOn the obverse, a stylised snowflake with Olympic rings above, and words ”XIV ZIMSKE OLIMPIJSKE IGRE SARAJEVO 1984”. On the reverse, the stylised head of an athlete crowned with a laurel wreath.\n1988 Calgary, Canada\nDesigner: Friedrich Peter\nDiameter: 69 mm\nMint: Jostens Inc.\nEvent logo with host details on the obverse. The reverse shows an athlete crowned with an olive wreath and an Indian with a headdress composed of ski sticks, a bob, skis, skate blades, a stick, a luge and a rifle.\n1992 Albertville, France\nDesigner: Under the direction of Marie-Claude Lalique\nDiameter: 92 mm\nMint: Lalique\nCreated for the first time in glass, set with gold, silver and bronze, the medals were entirely hand-made. The production of a medal required the contributions of 35 people. On the obverse, the Olympic rings with a valley in the background, and event details at the top. The reverse was comprised of a decorative motif in colourless glass.\n1994 Lillehammer, Norway\nDesigner: Ingjerd Hanevold\nDiameter: 78 mm\nMint: Th. Marthinsen\nIngjerd Hanevold said she designed the medals to be “humorous, sober and recognisable” and that their design “is Norwegian through and through”. Her surprise element was the use of sparagmite as the basic material.\n1998 Nagano, Japan\nDiameter: 80 mm\nMint: Japan Mint\nTo blend with local characteristics, the medals were created in lacquer and the decoration technique used was embossed gliding and precision metals work. The rising sun in Maki-e, surrounded by olive branches and the event emblem made up the obverse. On the reverse, the Games emblem with the sun rising over Shinshu mountains in the background.\n2002 Salt Lake City, U.S.\nDesigners: Scott Given and Axiom Design\nDiameter: 85 mm\nMint: O.C. Tanner\nThe medals were designed in shapes of river rocks, similar to those found in Utah’s streams and rivers. The obverse depicts an athlete carrying the Olympic torch stepping out of the flames. On the reverse, Nike, the Greek goddess of victory, holds a small victory leaf, symbolising the olive wreaths.\n2006 Turin, Italy\nDesigner: Dario Quatrini\nDiameter: 107 mm\nMint: Ottaviani\nThe open space in the centre of the medal, reveals the place where the heart beats, the symbol of life itself. The graphic elements of the Games were highlighted on the obverse, while on the reverse was a pictogram of the discipline in which the medal was won.\n2010 Vancouver, Canada\nDesigner: Omer Arbel and Corinne Hunt\nDiameter: 100 mm\nMint: Royal Canadian Mint\nOn the obverse, the Olympic rings accompanied by Aboriginal designs taken from th", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T21:08:00.000+02:00", "crawled": "2018-01-13T14:39:33.025+02:00", "highlightTitle": ""}