{"organizations": [], "uuid": "f8eb7ae5f6578afd21b211d67d79f7f50e0085e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104933173-GettyImages-902427454.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/frances-macron-in-china-for-trade-mission.html", "country": "US", "domain_rank": 767, "title": "France's Macron in China for trade mission", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.232, "site_type": "news", "published": "2018-01-08T12:01:00.000+02:00", "replies_count": 0, "uuid": "f8eb7ae5f6578afd21b211d67d79f7f50e0085e8"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/08/frances-macron-in-china-for-trade-mission.html", "ord_in_thread": 0, "title": "France's Macron in China for trade mission", "locations": [], "entities": {"persons": [{"name": "brigi", "sentiment": "negative"}, {"name": "emmanuel macron", "sentiment": "negative"}, {"name": "macron", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "xian", "sentiment": "none"}, {"name": "silk road", "sentiment": "none"}, {"name": "euro zone", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "airbus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "French President Emmanuel Macron was in China on Monday for a three-day state visit designed to bolster economic and political ties between Beijing and the euro zone's second-largest economy.\nImproving trade and business relations is top of the agenda, with Macron leading a delegation of around 50 top business representatives to China. Like other nations making overtures to Beijing, such as the U.S. and U.K., France is keen to increase its access to China's lucrative markets and consumers.\nToulouse-based Airbus is reportedly offering China an industrial partnership if it places orders for the aircraft manufacturer's largest passenger jet, the A380 . Airbus Chief Operating Officer Fabrice Bregier, who is part of Macron's trade mission, is due to hold talks in China on Monday.\nRecent reports have suggested that Airbus was ready to phase out production of the A380 due to slow sales, so a deal could be crucial for the company.\nThe visit comes hot on the heels of trade agreements signed between China and France in December that pledged \"reciprocal\" treatment in terms of commercial relations. China has long been accused of a protectionist approach to its economy, but has said [when?] it will open more markets to foreign investment.\nSpeaking in the city of Xi'an on Monday, Macron endorsed China's Belt and Road initiative , saying China and Europe should collaborate so that a new Silk Road isn't a one-way street. He also referenced concerns about China's trade surpluses. The French president is due to meet his counterpart, President Xi Jinping, later Monday.\nGift horse Like other global leaders visiting China and hoping to woo the country's leadership , France has been keen to make a good impression with Macron reportedly presenting President Xi Jinping the unusual gift of a horse ahead of his state visit.\nThe horse is an eight-year old gelding called Vesuvius, according to Reuters, and belonged to France's elite Republican Guard. The gift was reportedly made after Xi expressed an interest in the presidential cavalry corps during a visit to Paris in 2014.\nFrance's horses are not the only thing to have caught China's attention, with the country's cheeses, wines and meats gaining favor in the country's increasing consumer market .\nThere were concerns in the cheese-producing nation last year when China put a block on soft cheese imports over fears of the bacteria used in their production . French cheese-makers breathed a sigh of relief when China lifted the restrictions in October, allowing Brie, Camembert and Roquefort to enter the country again.\nBuilding trust David Baverez, private investor and author of \"Beijing Express – How to Understand New China,\" told CNBC on Monday that Macron should push to cement France's – and Europe's – relationship with China, as U.S. foreign policy under President Donald Trump looks precarious.\n\"Really, President Macron should be speaking not as the president of France, but he should be speaking as someone who wants to rebuild Europe. And you cannot rebuild Europe without redefining what should be the relationship with the second largest economic power which, at some part of the 21st century, will be the first (economic power in the world). That's really the challenge for Macron,\" he said.\nshow chapters Time is right for Macron to be disruptive in foreign affairs: Investor 10 Hours Ago | 04:14 Macron, who is seen to have injected France and the euro zone with renewed hope, should take some \"disruptive\" messages to China, Baverez said.\n\"Macron should tell the Chinese: 'You need to recognize that they need the West more than ever, because you have an economic problem which is productivity. It is not increasing fast enough, so your wages are not increasing fast enough, so the rebalancing of the economy through internal consumption is not working. So you need Western technology. You're not going to get it from the U.S. under Trump so the only place you can come is actually Europe,'\" he said.\n\"Macron's other disruptive message should be a redefinition of reciprocity… the 21st century should be about building trust between Europe and China, because the U.S. under Trump is not going to build trust with China, that's for sure.\"\nBaverez said Macron's trip had come at a good moment for France, as it looks like the most stable nation in Europe given the U.K.'s uncertain exit from the European Union, a continuing lack of government in Germany, and political uncertainty in Italy ahead of elections in the spring.\n\"We all know that President Macron is a lucky man so the timing is absolutely fantastic. I think it's a unique opportunity for President Macron to be as disruptive in foreign affairs as he has been in internal politics in France,\" Baverez said.", "external_links": [], "published": "2018-01-08T12:01:00.000+02:00", "crawled": "2018-01-08T12:01:34.013+02:00", "highlightTitle": ""}