{"organizations": [], "uuid": "99ffbd46fcc82ad52f5fc8de8a7d189083e1d797", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/10/12/103070123-RTX1RVI2.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/18/oil-prices-fall-as-us-output-rise-outweighs-crude-stock-falls.html", "country": "US", "domain_rank": 767, "title": "Oil prices fall as US output rise outweighs crude stock falls", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.415, "site_type": "news", "published": "2018-01-19T15:18:00.000+02:00", "replies_count": 0, "uuid": "99ffbd46fcc82ad52f5fc8de8a7d189083e1d797"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/oil-prices-fall-as-us-output-rise-outweighs-crude-stock-falls.html", "ord_in_thread": 0, "title": "Oil prices fall as US output rise outweighs crude stock falls", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "iea", "sentiment": "none"}, {"name": "international energy agency", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices slid about 1 percent on Friday, posting their first weekly loss in five weeks, as a bounce-back in U.S. production outweighed ongoing declines in crude inventories.\nBrent crude futures fell 70 cents, or 1 percent, to $68.61 a barrel. On Monday, they hit their highest since December 2014 at $70.37.\nU.S. West Texas Intermediate (WTI) crude futures ended Friday's session down 58 cents at $63.37 a barrel. WTI marked a December-2014 peak of $64.89 a barrel on Tuesday.\nBoth benchmarks posted a weekly loss of more than 1 percent.\nThe International Energy Agency (IEA), in its monthly report, said that global oil stocks have tightened substantially, aided by OPEC cuts, demand growth and Venezuelan production hitting near 30-year lows.\nshow chapters IEA: Expect a volatile year for oil prices 10 Hours Ago | 03:29 But it warned that rapidly increasing production in the United States could threaten market balancing.\n\"Explosive growth in the U.S. and substantial gains in Canada and Brazil will far outweigh potentially steep declines in Venezuela and Mexico,\" the IEA said of 2018 production.\nU.S. crude oil production stood at 9.75 million barrels per day (bpd) on Jan. 12, data from the Energy Information Administration showed. The IEA said it expects this to soon exceed 10 million bpd, overtaking OPEC behemoth Saudi Arabia and rivaling Russia.\nAnalysts also pointed to an expected demand slowdown at the end of winter in the northern hemisphere and excessive long positions in financial oil markets as a likely brake on any upward momentum in prices.\nANZ bank said \"an upcoming soft patch in demand and extreme investor positioning does open up the possibility of some short-term weakness.\"\nSome analysts, however, contend the IEA may be underestimating oil demand growth this year amid strong U.S. shale production trends as global economies show signs of growth to absorb the commodity.\n\"The demand side of the equation is keeping us well-healed,\" said Phil Flynn, analyst at Price Futures Group in Chicago, who expects oil demand to hit between 1.8 million bpd to 2 million bpd.\n\"While its great to be adding shale, its coming at the expense of deepwater projects. Demand is going to continue to surprise on the upside,\" he added.\nshow chapters Crude oil at $60 is unsustainable: John Kilduff 1:45 PM ET Thu, 18 Jan 2018 | 05:59 Overall, however, oil prices remain well supported, and most analysts do not expect steep declines.\nThe main price driver has been a production cut by a group of major oil producers around the Organization of the Petroleum Exporting Countries (OPEC) and Russia, who started to withhold output in January last year.\nThe supply cuts by OPEC and its allies, which are scheduled to last throughout 2018, were aimed at tightening the market to prop up prices.\nIn the United States, crude inventories fell 6.9 million barrels last week to 412.65 million barrels, the lowest seasonal level in three years and below the five-year average marker around 420 million barrels.\nThe U.S. oil rig count, an early indicator of future output, fell by five rigs in the week through Jan. 19, Baker Hughes reported. Last week drillers added 10 oil rigs, the biggest increase since June.", "external_links": [], "published": "2018-01-19T15:18:00.000+02:00", "crawled": "2018-01-19T15:37:28.015+02:00", "highlightTitle": ""}