{"organizations": [], "uuid": "82373eb76a634e532d47326450367d2c4d8174d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-smb-ceo-optimism-reaches-decade-peak-with-more-than-7-in-10-planning-to-hire-in-2018-finds-q4-2017-vistage-ceo-confidence.html", "country": "US", "domain_rank": 767, "title": "SMB CEO Optimism Reaches Decade Peak with More than 7-in-10 Planning to Hire in 2018, finds Q4 2017 Vistage CEO Confidence Index", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T21:20:00.000+02:00", "replies_count": 0, "uuid": "82373eb76a634e532d47326450367d2c4d8174d1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-smb-ceo-optimism-reaches-decade-peak-with-more-than-7-in-10-planning-to-hire-in-2018-finds-q4-2017-vistage-ceo-confidence.html", "ord_in_thread": 0, "title": "SMB CEO Optimism Reaches Decade Peak with More than 7-in-10 Planning to Hire in 2018, finds Q4 2017 Vistage CEO Confidence Index", "locations": [], "entities": {"persons": [{"name": "richard curtin", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "university of michigan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 11, 2018 /PRNewswire/ -- CEOs voiced the most optimistic economic outlook in 14 years in the Q4 2017 Vistage CEO Confidence Index . The index spiked to 110.3 from the prior quarter's 103. Among U.S. small- to mid-sized business leadership, planned increases in hiring and expected revenue growth were the highest in a dozen years, anticipated profit growth was the highest in ten years, and intentions to expand investments in their productive capacity reached the highest level since the closing quarter of 2004.\n\"This surge in optimism about all aspects of their firm's health were recorded before the final passage of the tax reform measure, but its passage was certainly anticipated,\" said Dr. Richard Curtin, Director of Research at University of Michigan, who analyzed the data. \"One might anticipate that as the specifics of the tax reforms become more widely understood, firms would react even more positively.\"\nSurvey highlights include:\nSurge in hiring: 71 percent of CEOs said they plan to increase hiring in the next year, up from last quarter's 62 percent. The recent reading represents the highest percentage of respondents with planned workforce additions since 2003.\nStrong investment spending: Intentions to increase investments in new plant and equipment rose to 54 percent, the highest number to plan increased investment spending in more than a dozen years.\nRobust revenue and profit outlook : 83 percent of CEOs anticipate gains in revenues during the year ahead, the highest level since 2005. Profit expectations also improved, with 67 percent anticipating higher profits in 2018.\nAmong all firms, 66 percent reported the economy had recently improved, up from last quarter's 52 percent. When asked about prospects for the year ahead, 45 percent anticipated continued gains, up from 32 percent in the prior quarter.\n\"It is clear that CEOs anticipate strong economic growth in 2018,\" said Vistage Chief Research Officer, Joe Galvin. \"And with credit more easily available, CEOs see now as an opportune time to invest in their people, technology, and infrastructure. However, the decisions they face are neither obvious nor simple if they want to capitalize on the continuing strong economy.\"\nRead the full results .\nAbout the Vistage CEO Confidence Index\nThe Vistage CEO Confidence Index, established in 2003, is a quarterly survey of small- to mid-sized business CEOs, presidents, and business owners about the U.S. economy. The Q4 2017 Vistage CEO Confidence Index includes responses from 1,377 U.S. CEOs, surveyed between December 11 and December 18, 2017. Since its establishment in 2003, the Index has proven to be a reliable indicator for changes in GDP and employment, two to three quarters hence.\nAbout Vistage Worldwide, Inc.\nVistage Worldwide is an organization designed exclusively for high-integrity CEOs and executive leaders who are looking to drive better decisions and better results for their companies. Our members — 21,000 strong in 20 countries — gather in trusted, confidential peer advisory boards where they tackle their toughest challenges and biggest opportunities. Leveraging the Vistage platform, our members have demonstrated the ability to refine their instincts, improve their judgment, expand their perspectives, and optimize decision making. CEOs who joined Vistage grew their companies at 2.2 times the rate of the average small and midsize U.S. company, according to a 2017 analysis of Dun and Bradstreet data. Learn more at vistage.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/smb-ceo-optimism-reaches-decade-peak-with-more-than-7-in-10-planning-to-hire-in-2018-finds-q4-2017-vistage-ceo-confidence-index-300581568.html\nSOURCE Vistage Worldwide, Inc.", "external_links": ["https://www.vistage.com/wp-content/uploads/2018/01/CI-flyer-Q417.pdf", "http://www.prnewswire.com/news-releases/smb-ceo-optimism-reaches-decade-peak-with-more-than-7-in-10-planning-to-hire-in-2018-finds-q4-2017-vistage-ceo-confidence-index-300581568.html", "http://www.vistage.com/", "https://www.vistage.com/research-center/vistage-ceo-survey/"], "published": "2018-01-11T21:20:00.000+02:00", "crawled": "2018-01-11T23:47:00.004+02:00", "highlightTitle": ""}