{"organizations": [], "uuid": "8a2217f9f8597a550aa1e0c43589e1c99d2f99bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds/euro-zone-bond-yields-fall-boj-plays-down-talk-of-ending-stimulus-idUSL8N1PI1UH", "country": "US", "domain_rank": 408, "title": "Euro zone bond yields fall, BOJ plays down talk of ending stimulus", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:06:00.000+02:00", "replies_count": 0, "uuid": "8a2217f9f8597a550aa1e0c43589e1c99d2f99bd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds/euro-zone-bond-yields-fall-boj-plays-down-talk-of-ending-stimulus-idUSL8N1PI1UH", "ord_in_thread": 0, "title": "Euro zone bond yields fall, BOJ plays down talk of ending stimulus", "locations": [], "entities": {"persons": [{"name": "fanny potkin", "sentiment": "none"}, {"name": "haruhiko kuroda", "sentiment": "none"}], "locations": [{"name": "spain", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "boj", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Spain’s 10-year bond yield falls to 7 month low\n* Most euro zone bond yields up 1-2 bps\n* New supply from Spain and Germany expected\n* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr\nBy Fanny Potkin\nLONDON, Jan 23 (Reuters) - Euro zone bond yields edged down on Tuesday after the Bank of Japan played down speculation that it was close to ending its stimulus, raising hopes that the European Central Bank may do the same when it meets later this week.\nRegional bond markets showed little immediate reaction to news of a deal to lift a three-day U.S. government shutdown. While U.S. Treasury yields rose on Monday, they were lower in early European trades on Tuesday.\nBOJ chief Haruhiko Kuroda reiterated his commitment to strong monetary easing on Tuesday, saying there is still some distance to go towards meeting the bank’s 2 percent inflation target.\nGlobal bond markets have been hit in recent weeks by growing talk that central banks in Japan and Europe could end monetary stimulus sooner rather than later.\nThe ECB meets on Thursday against a backdrop of heightened speculation over when it will end its vast stimulus and signal a rise in interest rates from record lows.\nThe past week has seen ECB officials play down talk of an imminent change in monetary policy stance, although hawkish December minutes, a soaring euro and oil prices have put the spotlight on Thursday’s meeting.\n“Markets are waiting for Draghi to confirm this dovish push-back that we’ve seen over the past week,” said ING rates strategist Benjamin Schroeder. “They are looking for hints some change might be coming forth in March in terms of change to forward guidance for asset purchases.”\nWhile most core euro zone borrowing costs were down 1-2 basis points, peripherals outperformed in early trades following ratings upgrades of Spain and Greece on Friday.\nSpain’s 10-year bond yield fell to a seven-month at 1.36 percent, down 3 bps on day. The premium it holds over its German peer narrowed to 87 bps, its tightest since March 2015. Portuguese bond yields fell 6 bps, their lowest since April 2015 at 1.675 percent.\nFitch upgraded Spain’s credit rating to “A-” with a stable outlook late on Friday, citing a broad-based economic recovery in the country’s first “A” rating from one of the top three ratings agencies since the euro zone debt crisis.\nSpain is expected to sell a new 10-year bond, possibly later on Tuesday.\nSentiment towards peripheral bonds was also boosted by hopes for a deal to create a coalition government in Germany, the euro zone’s biggest economy.\nA leading member of Chancellor Angela Merkel’s conservatives urged Social Democrats (SPD) on Monday evening to finish coalition talks within two to three weeks.\nGermany’s 10-year government bond yield was down 2 bps at 0.48 percent. The country plans to sell 5 billion of its Schatz bond later in the day. Markets also awaited the release of Germany’s closely watched ZEW survey.\nReporting by Fanny Potkin; Editing by Dhara Ranasinghe and Keith Weir\n ", "external_links": ["http://tmsnrt.rs/2ii2Bqr", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T17:06:00.000+02:00", "crawled": "2018-01-24T15:54:27.013+02:00", "highlightTitle": ""}