{"organizations": [], "uuid": "e40c19ff1e7413eb963a06cef1728fc1e886ee56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-seczetta-joins-the-sailpoint-identity-alliance.html", "country": "US", "domain_rank": 767, "title": "SecZetta Joins the SailPoint Identity+ Alliance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.476, "site_type": "news", "published": "2018-01-31T16:30:00.000+02:00", "replies_count": 0, "uuid": "e40c19ff1e7413eb963a06cef1728fc1e886ee56"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-seczetta-joins-the-sailpoint-identity-alliance.html", "ord_in_thread": 0, "title": "SecZetta Joins the SailPoint Identity+ Alliance", "locations": [], "entities": {"persons": [{"name": "david pignolet", "sentiment": "none"}, {"name": "joe gottlieb", "sentiment": "none"}], "locations": [{"name": "r.i.", "sentiment": "none"}, {"name": "alliance newport", "sentiment": "none"}], "organizations": [{"name": "seczetta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEWPORT, R.I., Jan. 31, 2018 /PRNewswire/ -- SecZetta , the leading provider of third party identity risk and lifecycle management solutions, today announced it has joined SailPoint's Identity+ Alliance. The collaboration provides SecZetta customers using SailPoint's identity management solutions, a way to enable business users to directly manage non-employee identities. SecZetta products extend IGA programs to include an authoritative source for managing third party identity risk and identity lifecycle.\n\"SailPoint helps enterprises manage who has access to what, across all users, all applications and all data,\" said Joe Gottlieb, Senior Vice President of Corporate Development, SailPoint. \"We are excited to welcome SecZetta into the Identity+ Alliance so that together, we can make sure that 'all users' includes the third parties managed by SecZetta.\"\n\"The collaboration between SecZetta and SailPoint creates a powerful business centric, identity risk and third party management toolset,\" said David Pignolet, President and CEO of SecZetta. \"We are pleased to become a SailPoint Identity+ Alliance member and to enhance the range of identity management solutions available to our respective customers.\"\nThe SailPoint Identity+ Alliance provides standards and tools that ease the integration of identity management with security solutions and operational infrastructure, making the latter more \"identity-aware\" and significantly increasing the effectiveness of a customer's security and risk mitigation efforts.\nThe integration of SecZetta's solutions into SailPoint's IdentityIQ™ will give organizations a powerful business process and relationship engine that ensures any identity type can be properly onboarded and maintained so that SailPoint IdentityIQ can appropriately grant and govern access, even to third parties not in the HR systems. SecZetta's suite of products gives businesses the ability to replace legacy processes and homegrown systems with a uniform, streamlined solution that reduces costs and improves performance and security.\nTo learn more about SecZetta, please visit https://www.seczetta.com/ . For more information about SailPoint or SailPoint's Identity + Alliance program, please visit https://www.sailpoint.com/ .\nAbout SecZetta\nSecZetta leading provider of third party identity risk and lifecycle management software solutions. SecZettas' solutions are utilized by companies around the globe to manage third party identity risk: create, control and respond to third party identity requirements and processes, meet compliance and minimize data breaches. SecZetta products extend IGA programs to include identity life cycle capabilities: NE Profile, which manages identity risk and lifecycle processes for nonemployees; NE Access, enables collaboration with partners and vendors; and ID Proxy, which merges identity data from multiple sources to maintain master identities in a single authoritative source. To learn more please visit http://www.seczetta.com or @seczetta\nContacts\nSecZetta\nJason Hobart\n781-832-0767\n189626@email4pr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/seczetta-joins-the-sailpoint-identity-alliance-300590381.html\nSOURCE SecZetta", "external_links": ["http://www.seczetta.com/", "http://www.prnewswire.com/news-releases/seczetta-joins-the-sailpoint-identity-alliance-300590381.html", "https://www.seczetta.com/", "https://www.sailpoint.com/", "http://www.seczetta.com/products"], "published": "2018-01-31T16:30:00.000+02:00", "crawled": "2018-01-31T17:52:57.001+02:00", "highlightTitle": ""}