{"organizations": [], "uuid": "3a060ccf3b908ba09c13f020719a4520a9524366", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218961254&w=1200&r=LYNXMPEE0205B", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-auckland-women/impressive-wozniacki-continues-march-in-auckland-idUKKBN1ES07Z", "country": "US", "domain_rank": 408, "title": "Impressive Wozniacki continues march in Auckland", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T06:44:00.000+02:00", "replies_count": 0, "uuid": "3a060ccf3b908ba09c13f020719a4520a9524366"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-auckland-women/impressive-wozniacki-continues-march-in-auckland-idUKKBN1ES07Z", "ord_in_thread": 0, "title": "Impressive Wozniacki continues march in Auckland", "locations": [], "entities": {"persons": [{"name": "wozniacki", "sentiment": "negative"}, {"name": "martic", "sentiment": "none"}, {"name": "caroline wozniacki", "sentiment": "none"}, {"name": "petra martic", "sentiment": "none"}, {"name": "madison brengle", "sentiment": "none"}, {"name": "venus williams", "sentiment": "none"}], "locations": [{"name": "auckland", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "croatia", "sentiment": "none"}], "organizations": [{"name": "usa", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 4:45 AM / Updated 2 hours ago Impressive Wozniacki continues march in Auckland Reuters Staff 3 Min Read \n(Reuters) - Caroline Wozniacki continued to build on her WTA Finals victory late last year with another impressive performance on her way to a 6-2 6-2 victory over Croatia’s Petra Martic to reach the quarter-finals of the Auckland Classic on Wednesday. Tennis - WTA Tour Finals - Singapore Indoor Stadium, Singapore - October 29, 2017 Denmark's Caroline Wozniacki celebrates after winning the final against USA's Venus Williams REUTERS/Edgar Su \nThe Danish world number three ended 2017 with the biggest title of her career in Singapore and returned a day after thrashing Madison Brengle in her season opener to hit 21 winners against eight unforced errors in the 53-minute win over Martic. \n“I‘m trying to stay aggressive,” Wozniacki said in a court-side interview. “I still made some unforced errors. It’s taking a few matches to play like 100 percent but I still felt I played pretty well today.” \nTop seed Wozniacki started brightly with a break of serve to love on her way to an early 3-0 lead and added another break in the eighth game to wrap up the opening set in just 24 minutes on a glorious day in New Zealand’s largest city. \nMartic tried to mount a comeback early in the second when she broke for a 2-0 lead but Wozniacki won the final six games behind impressive serving numbers, including six aces, to book a last eight encounter with young American Sofia Kenin. \n“I’ve worked on everything I need to work on in the off-season,” Wozniacki added as she continues her preparations for the Australian Open starting in Melbourne on Jan. 15. \n“Now it’s just a matter of working out how to incorporate that into your match or into a situation where you maybe get nervous.” \nKenin, a 19-year-old wild card, knocked out compatriot Varvara Lepchenko 6-4 7-6(6) earlier in the day and there were also victories for Taiwan’s Hsieh Su-wei and Barbora Strycova. \nHsieh recorded a 6-4 6-3 triumph over Belgian qualifier Ysaline Bonaventure to set up a quarter-final clash against Strycova after the third seeded Czech edged out Sweden’s Johanna Larsson 6-1 6-7(3) 6-2. \nIn the late matches, second seeded German Julia Goerges eased to a 6-4 6-0 victory over Slovakia’s Viktoria Kuzmova to book a last eight tie against Slovenia’s Polona Hercog, who was almost as ruthless in a 6-4 6-2 win over Kirsten Flipkens. \nFormer world number two Agnieszka Radwanska continued her strong start to the campaign with a 6-3 7-5 win over American Taylor Townsend, the Pole holding her nerve in a tight second set that lasted more than an hour to advance. \nFourth seed Radwanska, who remains on a collision course for a semi-final against Wozniacki, next faces American qualifier Sachia Vickery, who defeated Paraguay’s Veronica Cepede Royg 6-2 6-4. Reporting by John O'Brien in Singapore; Editing by Greg Stutchbury/Amlan Chakraborty", "external_links": [], "published": "2018-01-03T06:44:00.000+02:00", "crawled": "2018-01-03T07:08:18.022+02:00", "highlightTitle": ""}