{"organizations": [], "uuid": "073ea18fb19eac5186cc64cb0da3fc62a6ba814c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-trg-announces-acquisition-of-screen-group.html", "country": "US", "domain_rank": 767, "title": "TRG Announces Acquisition Of Screen Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.42, "site_type": "news", "published": "2018-01-18T16:30:00.000+02:00", "replies_count": 0, "uuid": "073ea18fb19eac5186cc64cb0da3fc62a6ba814c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-trg-announces-acquisition-of-screen-group.html", "ord_in_thread": 0, "title": "TRG Announces Acquisition Of Screen Group", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "trg announces acquisition of screen group", "sentiment": "negative"}, {"name": "screen group", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 18, 2018 /PRNewswire/ -- TRG, (\"the Company\") the leading provider of subscription spend management software solutions, today announced it has acquired Screen Group (\"Screen\"), a world leading market data software company that assists business professionals in managing their market data costs, processes and workflows more efficiently. The acquisition of Screen will further solidify TRG's position as a global market leader in enterprise spend management.\nThe new Company will have a greater suite of complementary, innovative software solutions that will be uniquely positioned to provide the full spectrum of subscription spend management capabilities across expense management (FITS, INFOmatch), usage tracking (ResearchMonitor), enquiry management (Quest), specialist consulting services and events to many of the world's leading financial, legal and professional services firms. The combined Company is committed to continuing to support and grow both FITS and INFOmatch products for the foreseeable future.\nThe deal will bring significant benefits to customers by enhancing the Company's ability to support multiple spend and revenue categories, including market and reference data, index licenses, research services and software licenses. In addition, there is an immediate opportunity to cross sell products such as TRG's ResearchMonitor, which provides analytics on subscriber usage, to Screen's INFOmatch and Consultancy customers. By combining Screen's spend management capabilities with TRG's Research Monitor usage platform, the Company will enable a broader set of customers to optimize their subscription spend and maximize their annual savings.\nBuilding upon both companies' market leading positions in their respective geographies (TRG: North America/ UK/Australia; Screen: Continental Europe, Africa, Middle-East and Asia), the deal will create a truly global service and support organization with offices in the US, UK, the Netherlands, France, Germany, Switzerland, Singapore and New Zealand.\nIn addition, with over 100 employees, the combined Company will have a larger resource and expertise pool to support the combined Company's over 300 customers. The Company will realize efficiencies in product development and delivery while generally benefitting from economies of scale, which will provide a greater ability to invest in further growth and innovation.\n\"Through this partnership with Screen, TRG will be able to offer an integrated, scaled spend management platform with the ability to address any global enterprise that operates in data-intensive industry verticals anywhere in the world,\" said TRG CEO Steve Matthews. \"Together, the companies are able to offer a powerful growth engine with multiple opportunities for enhanced profitable growth in the future.\"\n\"We are thrilled to be joining the TRG family in order to bring new opportunities for current and potential customers within the market data and enterprise spend management industries, while also offering an unparalleled combination of scale, domain expertise and global reach that stands out as second to none among our competitive set,\" said Screen co-founders and joint CEOs Peter Fruitema and Kees Brooimans. \"We have a longstanding relationship with TRG's executives and are excited to be taking this next step together.\"\nThe acquisition demonstrates the Company's ongoing commitment to its continued global growth and unrelenting product innovation, which began in 2014 with the investment from Boston-based Polaris Partners and continued in 2016 with the acquisition of Priory Solutions. Mr. Matthews will lead the new Company, with Messrs. Fruitema and Brooimans reporting directly to him.\nThe acquisition closed on January 10, 2018. Financial terms of the transaction were not disclosed.\nAbout TRG\nTRG provides spend management solutions enabling enterprises to gain total cost transparency and control of their entire universe of corporate subscriptions and vendor relationships. Founded by senior IT executives from global investment banks in 1998, TRG provides software and services which help companies streamline their expense management, reduce costs, and make informed decisions about spend on subscription-based services including market data, software, research, information services, consulting, and more. TRG's clients manage billions of dollars in recurring costs using TRG's advanced expense management platform FITS. With FITS, vendor contracts, procurement, invoicing, and expense allocations can be expertly managed, providing detailed reporting down to the employee-level, enterprise-wide cost transparency, and accurate control of all commercial and financial relationships with vendors. TRG's unrelenting commitment to exceeding clients' expectations, coupled with deep business and technology expertise, has earned it a reputation for delivery that is the envy of the industry. With client retention rates over 95% and numerous competitor product displacement success stories, FITS provides the industry's highest quality, most trusted solution with the highest level of service to match.\nAbout Screen Group\nThe Screen Group offers a range of specialized services and solutions for the professional financial services industry.\nAt the foundation of the company Screen built a unique Market Data and Investment Management consultancy practice that has made Screen the global leader for market and reference data advisory services. Through benchmarking, user profiling, compliance assessment and vendor information projects, Screen assists user firms in optimizing their market data spend, as well as in researching, selecting and implementing software applications and solutions.\nTo inform the Financial Services Industry of new vendors and industry trends, Screen has been organizing one-day trade shows, Screen Events, for more than 25 years.\nThe offering is completed with a range of in-house developed and supported software solutions, the INFOmatch suite, which allows user firms to manage market data spend, create cost transparency and reduce redundant services. INFOmatch is also used by Vendors & Exchanges to manage inbound licensing, usage reporting, support the billing workflow and CRM data.\nThe labels that represent this unique suite of complementary services are Screen Consultants, Screen Markets and Screen INFOmatch.\nMedia Contact\nNadia Damouni / Kate Sylvester, Prosek Partners\nT: 646-503-5783 / 646-706-7236\nndamouni@prosek.com / ksylvester@prosek.com\nView original content: http://www.prnewswire.com/news-releases/trg-announces-acquisition-of-screen-group-300584519.html\nSOURCE TRG", "external_links": ["http://www.prnewswire.com/news-releases/trg-announces-acquisition-of-screen-group-300584519.html"], "published": "2018-01-18T16:30:00.000+02:00", "crawled": "2018-01-18T16:34:08.086+02:00", "highlightTitle": ""}