{"organizations": [], "uuid": "768a2a695f894db8d6ee7c2dbe660c09644240be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/07/pr-newswire-vanda-pharmaceuticals-reports-preliminary-fourth-quarter-and-full-year-2017-revenue-results-and-2018-guidance.html", "country": "US", "domain_rank": 767, "title": "Vanda Pharmaceuticals Reports Preliminary Fourth Quarter and Full Year 2017 Revenue Results and 2018 Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-07T17:00:00.000+02:00", "replies_count": 0, "uuid": "768a2a695f894db8d6ee7c2dbe660c09644240be"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/07/pr-newswire-vanda-pharmaceuticals-reports-preliminary-fourth-quarter-and-full-year-2017-revenue-results-and-2018-guidance.html", "ord_in_thread": 0, "title": "Vanda Pharmaceuticals Reports Preliminary Fourth Quarter and Full Year 2017 Revenue Results and 2018 Guidance", "locations": [], "entities": {"persons": [{"name": "vanda", "sentiment": "negative"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "vanda pharmaceuticals inc.", "sentiment": "negative"}, {"name": "vanda pharmaceuticals reports preliminary fourth quarter", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 7, 2018 /PRNewswire/ -- Vanda Pharmaceuticals Inc. (Vanda) (NASDAQ: VNDA), a biopharmaceutical company focused on the development and commercialization of novel therapies addressing high unmet medical needs, today announced preliminary unaudited financial results for the fourth quarter and full year 2017 and its financial guidance for 2018.\nPreliminary Full Year 2017 Results\nVanda expects to report 2017 total net product sales from HETLIOZ ® and Fanapt ® of approximately $165 million, consistent with Vanda's prior guidance of between $163 million and $169 million. HETLIOZ ® net product sales for 2017 are expected to be approximately $90 million, consistent with Vanda's prior guidance of between $89 million and $92 million. Fanapt ® net product sales for 2017 are expected to be approximately $75 million, consistent with Vanda's prior guidance of between $74 million and $77 million. Vanda ended 2017 with approximately $143 million in cash, cash equivalents and marketable securities (Cash), representing an increase to Cash of approximately $2 million in 2017.\nPreliminary Fourth Quarter 2017 Results\nVanda expects to report fourth quarter 2017 total net product sales from HETLIOZ ® and Fanapt ® of approximately $44 million. HETLIOZ ® fourth quarter 2017 net product sales are expected to be approximately $25 million. Fanapt ® fourth quarter 2017 net product sales are expected to be approximately $19 million.\n2017 Financial Guidance\nIn addition to the preliminary 2017 results announced today, Vanda expects to achieve the following financial objectives in 2017:\nNon-GAAP Operating expenses, excluding cost of goods sold, of between $150 million and $157 million. Non-GAAP Operating expenses also excludes intangible asset amortization expense of $1.7 million and stock-based compensation of between $9 million and $12 million.\n2018 Financial Guidance\nVanda expects to achieve the following financial objectives in 2018:\nNet product sales from both HETLIOZ ® and Fanapt ® of between $180 million and $200 million. HETLIOZ ® net product sales of between $108 million and $118 million. Fanapt ® net product sales of between $72 million and $82 million. Non-GAAP Operating expenses, excluding cost of goods sold, of between $163 million and $173 million. The primary drivers of the expected increase over the prior year are clinical investments including studies of tradipitant in atopic dermatitis and gastroparesis. Non-GAAP Operating expenses also excludes intangible asset amortization expense of $1.7 million and stock-based compensation of between $11 million and $15 million. Year-end 2018 Cash is expected to be between $115 and $125 million. This includes the expected payment of a $25 million milestone obligation based on cumulative HETLIOZ ® net product sales.\nSelect 2018 Research and Development Objectives\nTradipitant\nA Phase III clinical study of tradipitant for atopic dermatitis is expected to begin in the first half of 2018. A tradipitant Phase II clinical study for the treatment of gastroparesis is ongoing. Results are expected by the end of 2018.\nHETLIOZ ®\nJet Lag clinical program results are expected in the first quarter of 2018. Enrollment in the Smith-Magenis Syndrome clinical study is ongoing. Results are expected by the end of 2018.\nNon-GAAP Financial Information\nVanda believes that the Non-GAAP financial information provided in this press release can assist investors in understanding and assessing the ongoing economics of Vanda's business and reflect how it manages the business internally and sets operational goals. Vanda's \"Non-GAAP Operating expenses, excluding cost of goods sold\" exclude stock-based compensation and intangible asset amortization.\nVanda believes that excluding the impact of these items better reflects the recurring economic characteristics of its business, as well as Vanda's use of financial resources and its long-term performance.\nThis press release includes a projection of 2017 Non-GAAP Operating expenses, excluding cost of goods sold, a forward-looking Non-GAAP financial measure under the heading \"2017 Financial Guidance\" and a projection of 2018 Non-GAAP Operating expenses, excluding cost of goods sold, a forward-looking Non-GAAP financial measure under the heading \"2018 Financial Guidance.\" This Non-GAAP financial measure is determined by excluding cost of goods sold, stock-based compensation and intangible asset amortization. Vanda is unable to reconcile this Non-GAAP guidance to GAAP because it is difficult to predict the future impact of these adjustments.\nThis Non-GAAP financial measure, as presented, may not be comparable to similarly titled measures reported by other companies since not all companies may calculate this measure in an identical manner and, therefore, it is not necessarily an accurate measure of comparison between companies.\nThe presentation of this Non-GAAP financial measure is not intended to be considered in isolation or as a substitute for guidance prepared in accordance with GAAP. The principal limitation of this Non-GAAP financial measure is that it excludes significant elements that are required by GAAP to be recorded in Vanda's financial statements. In addition, it is subject to inherent limitations as they reflect the exercise of judgments by management in determining this Non-GAAP financial measure. Vanda is unable to reconcile this non-GAAP guidance to GAAP because it is difficult to predict the future impact of these adjustments.\nAbout Vanda Pharmaceuticals Inc.\nVanda Pharmaceuticals Inc. is a biopharmaceutical company focused on the development and commercialization of novel therapies addressing high unmet medical needs. For more on Vanda, please visit www.vandapharma.com .\nCAUTIONARY NOTE REGARDING FORWARD LOOKING STATEMENTS\nVarious statements in this release, including, but not limited to, statements regarding the preliminary financial results for the fourth quarter of 2017 and full year 2017, and the 2018 financial guidance provided in the subheading to this release and under \"2018 Financial Guidance\" above, are \"forward-looking statements\" under the securities laws. Forward-looking statements are based upon current expectations that involve risks, changes in circumstances, assumptions and uncertainties. Important factors that could cause actual results to differ materially from those reflected in Vanda's forward-looking statements include, among others, the fact that Vanda's preliminary financial results are unaudited and changes in such results may be required by Vanda's accountants following their audit of the results, Vanda's assumptions regarding its ability to continue to grow its business in the U.S., Vanda's ability to successfully commercialize HETLIOZ ® in Europe, the timing of filings with the FDA for new indications or new potential therapies and other factors that are described in the \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" sections o", "external_links": ["http://www.vandapharma.com/", "http://www.sec.gov/", "http://www.prnewswire.com/news-releases/vanda-pharmaceuticals-reports-preliminary-fourth-quarter-and-full-year-2017-revenue-results-and-2018-guidance-300578488.html"], "published": "2018-01-07T17:00:00.000+02:00", "crawled": "2018-01-07T18:46:24.005+02:00", "highlightTitle": ""}