{"organizations": [], "uuid": "1eb51822010e36f8c9f9bd41e475656628865397", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-chase-corporation-acquires-stewart-superabsorbents-ssa-llc-a-zappa-stewart.html", "country": "US", "domain_rank": 767, "title": "Chase Corporation Acquires Stewart Superabsorbents (SSA), LLC – Zappa Stewart", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:35:00.000+02:00", "replies_count": 0, "uuid": "1eb51822010e36f8c9f9bd41e475656628865397"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-chase-corporation-acquires-stewart-superabsorbents-ssa-llc-a-zappa-stewart.html", "ord_in_thread": 0, "title": "Chase Corporation Acquires Stewart Superabsorbents (SSA), LLC – Zappa Stewart", "locations": [], "entities": {"persons": [{"name": "zappa stewart", "sentiment": "negative"}, {"name": "stewart superabsorbents", "sentiment": "negative"}, {"name": "adam p. chase", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "westwood", "sentiment": "none"}, {"name": "mcleansville", "sentiment": "none"}, {"name": "nc", "sentiment": "none"}, {"name": "hickory", "sentiment": "none"}], "organizations": [{"name": "ssa", "sentiment": "negative"}, {"name": "ccf", "sentiment": "negative"}, {"name": "chase corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "chase", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WESTWOOD, Mass.--(BUSINESS WIRE)-- Chase Corporation (NYSE American: CCF) announced that it has acquired Stewart Superabsorbents (SSA), LLC, an advanced superabsorbent polymer (SAP) formulator and solutions provider, with operations located in Hickory and McLeansville, NC. In the most recently completed calendar year, SSA and its recently acquired Zappa-Tec business (collectively “Zappa Stewart”) had combined revenue in excess of $24,000,000. Chase expects this acquisition to be immediately accretive to its earnings. The business was acquired for a purchase price of $71,382,000, net of cash acquired, pending any working capital adjustments and excluding acquisition-related costs. As part of this transaction, Chase acquired all equity of the business and entered into multiyear leases at both locations. The purchase was funded from a combination of a $65,000,000 draw on Chase’s existing revolving credit facility and available cash on hand.\nAdam P. Chase, President and Chief Executive Officer, commented,\n“This is a highly complementary acquisition for Chase Corporation which leverages our existing channels to industrial markets and allows us to deliver more value to our customers. Zappa Stewart’s proven protective materials technology is a great fit with our core strategy and extends our reach into growing medical and consumer applications. Their North Carolina operations will broaden our capabilities, and will add two facilities near the three we already have in the region. The new technologies and additional management talent will enhance our cross-functional operating model, creating logical synergies and value-creation opportunities.”\nQuint Barefoot, Managing Partner of Zappa Stewart, commented,\n“Our organization is excited to become part of the dynamic Chase team. Becoming part of the Chase platform creates significant opportunities to deploy proprietary polymer solutions across diverse market segments. This increased scale and geographic reach for our specialty reagents will generate new opportunities for our personnel, new perspectives and sustainable growth. This could not happen at a more exciting time in our markets, as we see heightened demand for our differentiated products used in directional drilling, telecommunications, energy, infrastructure and remediation projects.”\nThe transaction was effective December 31, 2017. Chase Corporation will continue to manufacture and market under the Zappa Stewart brands and locations, with plans to integrate Zappa Stewart into its ERP platform in the coming months to further enhance existing operational, development and engineering expertise. Zappa Stewart is a solutions provider of specialty materials for water and liquid management, remediation and protection in diverse markets including wire and cable, medical, environmental, infrastructure, energy and consumer products.\nChase Corporation, founded in 1946, is a leading manufacturer of protective materials for high reliability applications throughout the world.\nCertain statements in this press release are forward-looking. These may be identified by the use of forward-looking words or phrases such as “believe”; “expect”; “anticipate”; “should”; “planned”; “estimated” and “potential,” among others. These forward-looking statements are based on Chase Corporation’s current expectations. The Private Securities Litigation Reform Act of 1995 provides a “safe harbor” for such forward-looking statements. In order to comply with the terms of the safe harbor, the Company cautions investors that any forward-looking statements made by the Company are not guarantees of future performance and that a variety of factors could cause the Company's actual results and experience to differ materially from the anticipated results or other expectations expressed in the Company's forward-looking statements. The risks and uncertainties which may affect the operations, performance, development and results of the Company's business include, but are not limited to, the following: uncertainties relating to economic conditions; uncertainties relating to customer plans and commitments; the pricing and availability of equipment, materials and inventories; technological developments; performance issues with suppliers and subcontractors; economic growth; delays in testing of new products; the Company’s ability to successfully integrate acquired operations; the effectiveness of cost-reduction plans; rapid technology changes and the highly competitive environment in which the Company operates. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date the statement was made.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104006399/en/\nChase Corporation\nPaula Myers, 508-819-4219\nShareholder & Investor Relations Department\ninvestorrelations@chasecorp.com\nwww.chasecorp.com\nSource: Chase Corporation", "external_links": ["http://www.businesswire.com/news/home/20180104006399/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.chasecorp.com&esheet=51737871&lan=en-US&anchor=www.chasecorp.com&index=2&md5=bd52659ec6fe7e176b12374c2c24de7d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.chasecorp.com&esheet=51737871&newsitemid=20180104006399&lan=en-US&anchor=Chase+Corporation&index=1&md5=b10140a9066d02d34d9298304ba0e12b"], "published": "2018-01-05T00:35:00.000+02:00", "crawled": "2018-01-05T01:22:35.041+02:00", "highlightTitle": ""}