{"organizations": [], "uuid": "7589966e863c955d9f331f0f2e0dbfcb933af58e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-school-specialty-announces-the-appointment-of-scott-p-scharfman-as-its-new-member-of-the-board.html", "country": "US", "domain_rank": 767, "title": "School Specialty Announces the Appointment of Scott P. Scharfman as Its New Member of the Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:30:00.000+02:00", "replies_count": 0, "uuid": "7589966e863c955d9f331f0f2e0dbfcb933af58e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-school-specialty-announces-the-appointment-of-scott-p-scharfman-as-its-new-member-of-the-board.html", "ord_in_thread": 0, "title": "School Specialty Announces the Appointment of Scott P. Scharfman as Its New Member of the Board", "locations": [], "entities": {"persons": [{"name": "scott p. scharfman", "sentiment": "negative"}, {"name": "scharfman", "sentiment": "none"}, {"name": "sch", "sentiment": "none"}, {"name": "gus halas", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "wis.", "sentiment": "none"}, {"name": "greenville", "sentiment": "none"}], "organizations": [{"name": "school specialty board of directors", "sentiment": "none"}, {"name": "compensation committee", "sentiment": "none"}, {"name": "school specialty", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GREENVILLE, Wis., Jan. 17, 2018 (GLOBE NEWSWIRE) -- School Specialty, Inc. (OTCQB:SCOO) (“School Specialty”, “SSI” or “the Company”), a leading distributor of supplies, furniture and both curriculum and supplemental learning resources to the education, healthcare and other marketplaces, today announced that its Board of Directors has added a new independent member. Scott P. Scharfman has been appointed to the School Specialty Board of Directors, effective January 16, 2018. Mr. Scharfman has also been appointed to the Compensation Committee of the Board of Directors.\n“We’re very excited to welcome Scott to School Specialty's Board of Directors,” stated Gus Halas, Chairman of the Board. “He brings more than two decades of experience as a corporate executive and investment banker, with an impressive track record for growing companies and building shareholder value. We are confident that Scott’s operating experience, his strong connections to a variety of industries, and success as an investor will benefit School Specialty, our customers, partners, and shareholders tremendously.”\nMr. Scharfman has served as a Managing Director of Mill Road Capital, an investment firm, since 2006. In addition, he has served since 2012 as the Chairman of the Board of PRT Growing Services, a privately held service and logistics business, and the Chairman of the Board of RG Barry Corporation, a privately held apparel business, since 2014. Mr. Scharfman has also served on the Board of Rubio’s Restaurants Inc., a privately held restaurant company since 2010, and in 2009 he served on the Board of Galaxy Nutritional Foods, Inc., a publicly held packaged food company. He was the Chief Financial Officer of Mercata Inc., a start-up founded by Paul Allen, the Co-Founder of Microsoft, and was formerly a Managing Director in the equity capital markets groups at Robertson Stephens and Bear Stearns & Co. His early private equity experience was with the Blackstone Group, where he held the role of Vice President, investing Blackstone's funds in a variety of companies. He earned a Bachelor of Arts degree (cum laude) from Princeton University.\n“I’m honored and greatly anticipate working closely with the Board and management team in advancing the strategic initiatives that help set School Specialty apart as a dominant leader in the 21 st century education marketplace. This is an incredible opportunity to serve an innovative company which is positioned for growth and I hope that my industry experiences and insights will serve the organization well and help drive shareholder value for years to come,” said Mr. Scharfman.\n“The addition of Scott to our Board advances positioning School Specialty for long term success,” stated Joseph M. Yorio, President and CEO of School Specialty. “Our Directors’ extensive experience and know-how is an invaluable resource for management, as our collaborative efforts improve School Specialty’s performance.”\nAbout School Specialty, Inc.\nSchool Specialty is a leading distributor of innovative and proprietary products, programs and services to the education marketplace. The Company designs, develops, and provides educators with the latest and very best school supplies, furniture and both curriculum and supplemental learning resources. Working in collaboration with educators, School Specialty reaches beyond the scope of textbooks to help teachers, guidance counselors and school administrators ensure that every student reaches his or her full potential. Through its SSI Guardian subsidiary, the Company is also committed to school, healthcare and corporate workplace safety by offering the highest quality curriculum, training and safety and security products. Finally, through its SOAR Life Products brand, the Company offers thousands of products that sharpen cognitive skills and build physical and mental strength in fun and creative ways. From childhood through adulthood, they help individuals live life to the fullest – engaged, happy and well. SOAR Life Products is a customized offering for hospitals, long-term care, therapeutic facilities, home care, surgery centers, day care centers, physician offices, and clinics. For more information about School Specialty, visit www.schoolspecialty.com .\nStatement Concerning Forward-Looking Information\nAny statements made in this press release about School Specialty’s future financial condition, results of operations, expectations, plans, or prospects constitute forward-looking statements. Forward-looking statements also include those preceded or followed by the words \"anticipates,\" \"believes,\" \"could,\" \"estimates,\" \"expects,\" \"intends,\" \"may,\" \"plans,\" “projects,” “should,” \"targets\" and/or similar expressions. These forward-looking statements are based on School Specialty's current estimates and assumptions and, as such, involve uncertainty and risk. Forward-looking statements are not guarantees of future performance, and actual results may differ materially from those contemplated by the forward-looking statements because of a number of factors, including the risk factors described in Item 1A of School Specialty's Form 10-K for the fiscal year ended December 31, 2016, which risk factors are incorporated herein by reference. Any forward-looking statement in this release speaks only as of the date on which it is made. Except to the extent required under the federal securities laws, School Specialty does not intend to update or revise the forward-looking statements.\nMedia Contacts:\nGlenn Wiener and Dionne Manchester\nGW Communications (for School Specialty)\nTel: 212-786-6011 / 212-786-6068\nEmail: gwiener@GWCco.com / dionne@GWCco.com\nSource:School Specialty, Inc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8f0e86dd-a10d-412d-9c93-180e31bb6643", "https://www.globenewswire.com/Tracker?data=MdhkD_0XzlLbPSDP94zxviF--umvu2ADS-dGk6mHGEOR8EPYEjnglE6skD-NKTik-TUIazU67hbyK2rLkm2kCPezYWnN2P79QuTMlLmkYYk=", "https://www.globenewswire.com/Tracker?data=DAnxKrkbb9DBSe_GmEqamHuB-and-r2KcBKCe728apX8dZkpk8Ov7I3RgvHqMErfbYLkYbkodtWZXtLNqI8ixQ==", "https://www.globenewswire.com/Tracker?data=IAiBxWnip2sWmIRiGw0LB9VW8BHzVZbsGu-cnhRuUR-kutBbdGonlJQzNsFmgPAWe_DfJlALNf5no385aStdMw==", "https://www.globenewswire.com/Tracker?data=0OSiI9m47-D3JBPzVLeH8qcdWnkgfq2rx31ECyMmSpTpbEIy59_1RruKpM9LB1m4vf38aPtBGsqtZKoaMxMgLiQXV8CgmQPV4PP4SDmadH8SaCHe34qHJviGH0ppU14321Mg5U311O-N9qCrKYA4ljN4PXICP_uy3PjRQXQptAY="], "published": "2018-01-18T00:30:00.000+02:00", "crawled": "2018-01-18T00:29:35.016+02:00", "highlightTitle": ""}