{"organizations": [], "uuid": "6a2409536004574fb7450aac734fea7c054b958e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-cambodia-rouge/cambodia-marks-39-years-since-fall-of-brutal-killing-fields-regime-idUKKBN1EW03A", "country": "US", "domain_rank": 408, "title": "Cambodia marks 39 years since fall of brutal 'killing fields' regime", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T05:41:00.000+02:00", "replies_count": 0, "uuid": "6a2409536004574fb7450aac734fea7c054b958e"}, "author": "", "url": "https://uk.reuters.com/article/uk-cambodia-rouge/cambodia-marks-39-years-since-fall-of-brutal-killing-fields-regime-idUKKBN1EW03A", "ord_in_thread": 0, "title": "Cambodia marks 39 years since fall of brutal 'killing fields' regime", "locations": [], "entities": {"persons": [{"name": "hun sen", "sentiment": "none"}, {"name": "pol pot", "sentiment": "none"}, {"name": "prak chan thul", "sentiment": "none"}], "locations": [{"name": "cambodia", "sentiment": "none"}, {"name": "phnom penh", "sentiment": "none"}], "organizations": [{"name": "cambodian people’s party", "sentiment": "none"}, {"name": "cpp", "sentiment": "none"}, {"name": "khmer rouge", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 3:41 AM / Updated 10 minutes ago Cambodia marks 39 years since fall of brutal 'killing fields' regime Prak Chan Thul 3 Min Read \nPHNOM PENH (Reuters) - Thousands of Cambodian survivors of the Khmer Rouge on Sunday marked 39 years since the fall of the brutal regime that killed an estimated 1.7 million people. \nUp to 40,000 people attended an event in the capital Phnom Penh, organised by the ruling Cambodian People’s Party (CPP) of Prime Minister Hun Sen, installed by the Vietnamese who invaded Cambodia on January 7, 1979 and put and end to the regime. \n“The January 7 victory saved the lives of people who survived the killings and brought back to the Cambodian people rights lost under the regime of Pol Pot,” Hun Sen said at the ceremony. \nMost of the victims of the regime died of torture, starvation, exhaustion or disease in labour camps or were beaten to death during mass executions in the “killing fields”. \nThe day is controversial in Cambodia, with Hun Sen’s party celebrating it as a day of liberation while others mourn it as the start of a 10-year occupation by their hated Vietnamese neighbours. \nThe rise and fall of the genocidal Khmer Rouge was initiated by Vietnam to “divide and weaken” Cambodia to keep it under Vietnamese control, former opposition leader Sam Rainsy said in a post on his Facebook page. \nThe day marks Cambodia’s journey toward a brighter future, the United States said. \n“We also celebrate the ingenuity, courage, and perseverance with which the Cambodian people have emerged from this period of darkness, rebuilt their country, and carried forward the process of national reconciliation,” the U.S. embassy said in a statement. \nThe anniversary comes amid an opposition crackdown by Hun Sen’s government ahead of a July general election. \nThe United States and the European Union withdrew support for the vote following the dissolution of the main opposition Cambodia National Rescue Party last year but China, Cambodia’s biggest foreign backer, said on Thursday it believes the election this year will be fair. \nPol Pot’s three top surviving henchmen are serving life sentences on convictions by a joint Cambodian-United Nations tribunal for various crimes, including crimes against humanity. \nThose in custody are former Khmer Rouge S-21 prison chief Kaing Guek Eav, ‘Brother Number Two’ Nuon Chea and former President Khieu Samphan. Reporting by Prak Chan Thul; Editing by Amy Sawitta Lefevre and Clarence Fernandez", "external_links": [], "published": "2018-01-07T05:41:00.000+02:00", "crawled": "2018-01-07T05:52:27.000+02:00", "highlightTitle": ""}