{"organizations": [], "uuid": "30ab5e07b905c7cd944bb39a93046019636069e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-clough-global-dividend-and-income-fund.html", "country": "US", "domain_rank": 767, "title": "Clough Global Dividend and Income Fund", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T18:00:00.000+02:00", "replies_count": 0, "uuid": "30ab5e07b905c7cd944bb39a93046019636069e3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-clough-global-dividend-and-income-fund.html", "ord_in_thread": 0, "title": "Clough Global Dividend and Income Fund", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Statement Pursuant to Section 19(a) of the Investment Company Act of 1940\nDENVER--(BUSINESS WIRE)-- On January 31, 2018, the Clough Global Dividend and Income Fund (NYSE MKT: GLV) (the “Fund”), a closed-end fund, paid a monthly distribution on its common stock of $0.1218 per share to shareholders of record at the close of business on January 22, 2018.\nThe following table sets forth the estimated amount of the sources of distribution for purposes of Section 19 of the Investment Company Act of 1940, as amended, and the related rules adopted thereunder. The Fund estimates the following percentages, of the total distribution amount per share, attributable to (i) current and prior fiscal year net investment income, (ii) net realized short-term capital gain, (iii) net realized long-term capital gain and (iv) return of capital or other capital source as a percentage of the total distribution amount. These percentages are disclosed for the current distribution as well as the fiscal year-to-date cumulative distribution amount per share for the Fund.\nCurrent Distribution from: Per Share ($) % Net Investment Income 0.0180 14.78 % Net Realized Short-Term Capital Gain 0.0000 0.00 % Net Realized Long-Term Capital Gain 0.0693 56.90 % Return of Capital or other Capital Source 0.0345 28.32 % Total (per common share) 0.1218 100.00 % Fiscal Year-to-Date Cumulative Distributions from: Per Share ($) % Net Investment Income 0.0364 9.89 % Net Realized Short-Term Capital Gain 0.0000 0.00 % Net Realized Long-Term Capital Gain 0.2970 80.73 % Return of Capital or other Capital Source 0.0345 9.38 % Total (per common share) 0.3679 100.00 % The amounts and sources of distributions reported in this 19(a) Notice are only estimates and not for tax reporting purposes. The actual amounts and sources of the amounts for tax reporting purposes will depend upon the Fund’s investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The Fund will send you a Form 1099-DIV for the calendar year that will tell you how to report these distributions for federal income tax purposes. The Fund estimates that it has distributed more than its income and net realized capital gains; therefore, a portion of your distribution may be a return of capital. A return of capital may occur for example, when some or all of the money that you invested in the Fund is paid back to you. A return of capital distribution does not necessarily reflect the Fund’s investment performance and should not be confused with ‘yield’ or ‘income.’\nPresented below are return figures, based on the change in the Fund’s Net Asset Value per share (“NAV”), compared to the annualized distribution rate for this current distribution as a percentage of the NAV on the last business day of the month prior to distribution record date.\nFund Performance & Distribution Information\nFiscal Year to Date (11/01/2017 through 12/31/2017) Annualized Distribution Rate as a Percentage of NAV^ 10.02 % Cumulative Distribution Rate on NAV^ + 2.52 % Cumulative Total Return on NAV* 0.60 % Average Annual Total Return on NAV for the 5 Year Period Ending 12/31/2017** 8.38 % Past performance is not indicative of future results.\n^ Based on the Fund’s NAV as of December 31, 2017.\n+ Cumulative distribution rate is based on distributions paid to date for the period November 1, 2017 through January 31, 2018.\n*Cumulative fiscal year-to-date return is based on the change in NAV including distributions paid and assuming reinvestment of these distributions for the period November 1, 2017 through December 31, 2017.\n**The 5 year average annual total return is based on change in NAV including distributions paid and assuming reinvestment of these distributions and is through the last business day of the month prior to the month of the current distribution record date.\nWhile the NAV performance may be indicative of the Fund’s investment performance, it does not measure the value of a shareholder’s investment in the Fund. The value of a shareholder’s investment in the Fund is determined by the Fund’s market price, which is based on the supply and demand for the Fund’s shares in the open market. Shareholders should not draw any conclusions about the Fund’s investment performance from the amount of this distribution or from the terms of the Fund’s Managed Distribution Plan.\nFurthermore, the Board of Trustees reviews the amount of any potential distribution and the income, capital gain or capital available. The Board of Trustees will continue to monitor the Fund’s distribution level, taking into consideration the Fund’s net asset value and the financial market environment. The Fund’s distribution policy is subject to modification by the Board of Trustees at any time. The distribution rate should not be considered the dividend yield or total return on an investment in the Fund.\nALPS Portfolio Solutions Distributor, Inc. FINRA Member Firm.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005280/en/\nClough Global Dividend and Income Fund\nNed Burke, ALPS, +1 303-623-2577\nned.burke@alpsinc.com\nSource: Clough Global Dividend and Income Fund", "external_links": ["http://www.businesswire.com/news/home/20180131005280/en/"], "published": "2018-01-31T18:00:00.000+02:00", "crawled": "2018-01-31T18:38:39.000+02:00", "highlightTitle": ""}