{"organizations": [], "uuid": "c8bf33a96624c6be4b46e9f2cbd6eaa7a9b5e7e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-live-ventures-announces-fiscal-2017-results-and-988-percent-increase-in-earnings-per-share.html", "country": "US", "domain_rank": 767, "title": "Live Ventures Announces Fiscal 2017 Results and 988 Percent Increase in Earnings Per Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:00:00.000+02:00", "replies_count": 0, "uuid": "c8bf33a96624c6be4b46e9f2cbd6eaa7a9b5e7e8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-live-ventures-announces-fiscal-2017-results-and-988-percent-increase-in-earnings-per-share.html", "ord_in_thread": 0, "title": "Live Ventures Announces Fiscal 2017 Results and 988 Percent Increase in Earnings Per Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "live ventures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Live Ventures Incorporated (Nasdaq:LIVE), a diversified holding company, today announced financial results from its fiscal year ended September 30, 2017.\nReporting its most successful year in the company’s history, Live Ventures reported a record $152.0 million in revenues, an increase of 92.6 percent over the previous fiscal year.\nStockholders’ equity, management’s preferred measurement for performance, increased by 39 percent year-over-year. Since present management took over six years ago, stockholders’ equity has grown at a rate of 88.6 percent compounded annually.\nKey highlights from 2017 include:\nRecord revenues of $152.0 million, up 92.6 percent over the last fiscal year\nGross profit up 213.2 percent to $62.5 million Operating Income up 680.7 percent to $18.1 million Total assets of $129 million Earnings per Share (EPS) up 988 percent when excluding one-time, non-cash gains from deferred tax asset and bargain purchase gain booked in the 2016 fiscal year, to $2.94 per basic common share Earnings before interest, taxes, depreciation and amortization (EBITDA) of $23.21 million Completed the acquisition of Vintage Stock Inc., a 57-store retail chain\nReduced total outstanding basic shares to 1,991,879 Repurchased 66,185 shares during the fiscal year Obtained dismissal of class action and derivative lawsuits (December 2017)\n“We expect our numbers to further improve in fiscal year 2018 as a result of additional capital expenditures at Marquis Industries, operational improvements and new store openings at Vintage Stock. We also believe that the financial results from ApplianceSmart, which we recently entered into an agreement to acquire, will aid in improving our fiscal year 2017 results in 2018,” said Jon Isaac. “I personally thank Mr. Rodney Spriggs of Vintage Stock, Mr. Tim Bailey of Marquis Industries and all 1,400 company employees nationwide for these terrific results.”\nAbout Live Ventures Incorporated\nLive Ventures Incorporated, originally incorporated in 1968, is a diversified holding company with several wholly owned subsidiaries and a strategic focus on acquiring profitable companies that have demonstrated a strong history of earnings power. Through its subsidiary, Marquis Industries, the company operates as a specialty, high-performance yarns manufacturer and hard-surfaces re-seller. Marquis Industries, which is a top-10 high-end residential carpet manufacturer in the United States, utilizes its state-of-the-art yarn extrusion capacity to market monofilament textured yarn products to the artificial turf industry. Marquis is the only manufacturer in the world that can produce certain types of yarn prized by the industry. Through its subsidiary Vintage Stock, Inc., an award-winning entertainment retailer, the company sells new and preowned movies, classic and current generation video games and systems, music on cd & lp, collectible comics, books, toys, and more. Vintage Stock, through its stores and website, ships product worldwide directly to the customer’s doorstep.\nPresentation of Non-GAAP Measure\nIn addition to the results provided in accordance with U.S. generally accepted accounting principles (GAAP) throughout this press release, Live Ventures has provided a non-GAAP measurement of EBITDA. We have included EBITDA because it is a key measure used by our management and board of directors to understand and evaluate our core operating performance and trends, to prepare and approve our annual budget and to develop short- and long-term operational plans. Accordingly, we believe that EBITDA provides useful information to investors and others in understanding and evaluating our operating results in the same manner as our management and board of directors. EBITDA is reconciled from the respective measure under GAAP in the attached table “Non-GAAP Reconciliation.”\nForward-Looking and Cautionary Statements\nThis press release may contain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. In accordance with the safe harbor provisions of this Act, statements contained herein that look forward in time that include everything other than historical information, involve risks and uncertainties that may affect the company’s actual results. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. Live Ventures may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission on Forms 10-K, 10-Q and 8-K, in its annual report to stockholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. There can be no assurance that such statements will prove to be accurate and there are a number of important factors that could cause actual results to differ materially from those expressed in any forward-looking statements made by the company, including, but not limited to, plans and objectives of management for future operations or products, the market acceptance or future success of our products, and our future financial performance. The company cautions that these forward-looking statements are further qualified by other factors including, but not limited to, those set forth in the company’s Form 10-K for the fiscal year ended September 30, 2017 (available at http://www.sec.gov ). Live Ventures undertakes no obligation to publicly update or revise any statements in this release, whether as a result of new information, future events, or otherwise.\nEBITDA Non-GAAP Reconciliation\nFor the fiscal year ended September 30, 2017 Net Income $ 6,501,780 Plus: Interest Expense 7,596,985 Provision for Income Taxes 4,081,819 Depreciation and Amortization 5,025,548 EBITDA $ 23,206,132 Earnings Per Share Non-GAAP Reconciliation\nFor the fiscal year ended September 30, 2016 Net Income $ 17,829,857 Less: Benefit from Income Tax (Restated) 15,567,844 Bargain Purchase Gain (Restated) 1,499,345 Adjusted Earnings 762,668 Number of Weighted Basic Common Shares 2,815,072 Adjusted Earnings per Basic Share $ 0.27\nFor the fiscal year ended September 30, 2017 Net Income $ 6,501,780 Number of Weighted Basic Common Shares* 2,210,104 Earnings per Basic Share $ 2.94 *As of the date of this press release, the total number of basic common shares outstanding is 1,991,879.\nContact:\nLive Ventures Incorporated\nTim Matula, investor relations\n425-836-9035\ntmatula@live-ventures.com\nhttp://www.live-ventures.com\nSource:Live Ventures Incorporated", "external_links": ["https://www.globenewswire.com/Tracker?data=KzTa4FaejcNrGio2XbDxYMZhKHK2QbUWWL29mL3okkGFPwKiXm9uBHcDpP9l5JUG8txlOQ4XOlWVgKm0Ol5ZVP80p3bgbrJPmv7UBJgwDszeMqKFedOV-o0-z81-rglZslvZb8QZ8oohpjllK9BKgwRAVwNvSYGmPrtZ11NFIQ2kA4EMqBXcv9N-7DSIMJ2O2sTpACa_5pkpAkT-Z4NZoftFACzW7kKGFbNXUmobSwe8uxnudEjH11PI7B4XSVahnUDsotcGQAywzhEudSsmQyeLu8x41sktYLiG9mugOYUAW7Kln5kcGfQhkU6Vh5Vm2Pnj5CVxvREWsUDw1PUjHTeNjQvBhTMnHkIY-JwieWKPreETD-VajBjl6liDo2LQlOiq3eYqh0z16J8GmtCE4_JmraIcH0OSrjhQz50ICmk=", "https://www.globenewswire.com/Tracker?data=KzTa4FaejcNrGio2XbDxYDK5Xk-IHvZ9CeBPK3jD539SZDRhTbjWEE8UPTqPU3ys4IvBmZNI6C7gw0J4pT_k6umyyN0tyd85H8HC2fdDBK8="], "published": "2018-01-18T14:00:00.000+02:00", "crawled": "2018-01-18T13:24:33.034+02:00", "highlightTitle": ""}