{"organizations": [], "uuid": "58a4859f173dfee297eb3fb9b303efeaa6dbcc04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-wsfs-reports-4q-2017-and-full-year-2017-results-11-percent-increase-in-net-revenue-over-4q-2016-driven-by-over-10-percent.html", "country": "US", "domain_rank": 767, "title": "WSFS Reports 4Q 2017 and Full Year 2017 Results; 11% Increase in Net Revenue Over 4Q 2016 Driven by Over 10% Organic Growth in Loans, Deposits and Fee Income, and Continued Improvements in Net Interest Margin; Results Impacted by Actions Related to Recent", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.592, "site_type": "news", "published": "2018-01-23T00:05:00.000+02:00", "replies_count": 0, "uuid": "58a4859f173dfee297eb3fb9b303efeaa6dbcc04"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-wsfs-reports-4q-2017-and-full-year-2017-results-11-percent-increase-in-net-revenue-over-4q-2016-driven-by-over-10-percent.html", "ord_in_thread": 0, "title": "WSFS Reports 4Q 2017 and Full Year 2017 Results; 11% Increase in Net Revenue Over 4Q 2016 Driven by Over 10% Organic Growth in Loans, Deposits and Fee Income, and Continued Improvements in Net Interest Margin; Results Impacted by Actions Related to Recent", "locations": [], "entities": {"persons": [], "locations": [{"name": "del.", "sentiment": "none"}, {"name": "wilmington", "sentiment": "none"}], "organizations": [{"name": "wsfs financial corporation", "sentiment": "neutral"}, {"name": "wsfs", "sentiment": "neutral"}, {"name": "wsfs bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WILMINGTON, Del., Jan. 22, 2018 (GLOBE NEWSWIRE) -- WSFS Financial Corporation (NASDAQ:WSFS), the parent company of WSFS Bank, reported a net loss of $0.5 million, or $0.02 per diluted common share for 4Q 2017 compared to net income of $18.1 million, or $0.56 per share for 4Q 2016 and net income of $20.6 million, or $0.64 per share for 3Q 2017. Net income for the year ended December 31, 2017 was $59.6 million, or $1.84 per diluted common share as compared to $64.1 million, or $2.06 per share for 2016. The results for 4Q 2017 and full-year 2017 include $23.6 million of after-tax expense related to the four items disclosed in the Company’s press release and Form 8-K dated January 4, 2018. See Notable Items for further information.\nNet revenue (which includes net interest income and noninterest income) was $90.2 million for 4Q 2017, an increase of $8.9 million, or 11% from 4Q 2016. The strong increase in net revenue includes balanced organic growth in both net interest income and noninterest income. Net interest income was $57.7 million, an increase of $4.8 million, or 9% from 4Q 2016; and fee income (noninterest income) was $32.4 million, an increase of $4.1 million, or 15% from 4Q 2016. Noninterest expenses were $56.1 million in 4Q 2017, an increase of $7.1 million, or 15% from 4Q 2016.\nFor 4Q 2017, return on assets (ROA) was (0.03)%, return on average tangible common equity (ROTCE) was (0.05)% and the efficiency ratio was 61.7%. For the full-year 2017, ROA was 0.87%, ROTCE was 11.48% and the efficiency ratio was 61.5%.\nHighlights for 4Q 2017:\nCore earnings per share (EPS) (1) of $0.71 for 4Q 2017 increased 22% from $0.58 in 4Q 2016.\nCore ROA (1) was 1.31% for 4Q 2017 compared to 1.12% for 4Q 2016. Core return on average tangible common equity (1) was 16.46% for 4Q 2017 compared to 15.39% for 4Q 2016.\nCore net revenue (1) of $89.9 million increased $9.2 million, or 11% from 4Q 2016, reflecting strong organic growth, including a $4.8 million, or 9% increase in core net interest income (1) and a $4.4 million, or 16% increase in core fee income (noninterest income) (1) across several business lines.\nCore noninterest expense (1) increased $4.3 million, or 9% from 4Q 2016, creating 2 percentage points of positive operating leverage and resulting in a strong core efficiency ratio (1) of 57.0%.\nLoans grew 10% (annualized), customer funding increased 12% (annualized), and the net interest margin grew 5 basis points to 4.00% compared to 3Q 2017. Compared to 4Q 2016, loans grew 7%, customer funding increased 9%, and the net interest margin grew 10 basis points to 4.00%. These healthy growth rates demonstrate our ability to simultaneously increase market share in a competitive environment, while also expanding our geographic footprint and growing our gross margins and profitability.\n(1) As used in this release, core earnings per share (EPS), core return on average assets (ROA), core net revenue, core net interest income, core fee income (noninterest income), core noninterest expense and core efficiency ratio are non-GAAP financial measures. For a reconciliation of these measures to their comparable GAAP measures, see \"Non-GAAP Reconciliation\" at the end of this press release.\nNotable items in the quarter:\nAll of the items below are excluded from core earnings. The first four items listed below are described in greater detail in our press release and Form 8-K dated January 4, 2018.\nWSFS recorded a $12.8 million income tax charge, or $0.40 per share, in 4Q 2017 upon revaluing the Company’s deferred tax asset (DTA) at December 31, 2017 as a result of the reduction of the top corporate income tax rate from 35% to 21%, effective January 1, 2018, included in H.R. 1 (the Tax Cuts and Jobs Act of 2017). The Company expects to recover this charge through lower taxes in less than one year.\nWSFS recognized an $8.0 million income tax charge, or $0.25 per share, in 4Q 2017 from the decision in 4Q 2017 to surrender all of its Bank-Owned Life Insurance (BOLI) policies. Due to the change in the corporate tax rate, the returns on these very long-term assets are no longer accretive to our current ROA performance and expectations. We expect to redeploy the estimated $101 million of cash proceeds upon formal surrender of the policies, which is expected to occur in 2018.\nWSFS realized a $2.8 million fraud loss expense, or $0.06 per share, in 4Q 2017 resulting from a scheme to defraud the bank that was previously disclosed on Form 8-K on June 22, 2017. WSFS is aggressively pursuing all available remedies, including working with insurance carriers, to recover the loss.\nWSFS made a $1.5 million donation, or $0.03 per share, to the WSFS Foundation, matching the only other grant made to the WSFS Foundation when it was formed in 2003.\nWSFS realized $0.2 million, or less than $0.01 per share, in net gains on sales of securities in 4Q 2017, compared to $0.5 million, or $0.01 per share, in 4Q 2016.\nWSFS recorded less than $0.1 million, or less than $0.01 per share, in corporate development expenses during 4Q 2017, compared to $1.5 million or approximately $0.03 per share, in 4Q 2016.\nCEO outlook and commentary\nMark A. Turner, President and CEO, said, “Our fourth quarter results were impacted by previously announced actions resulting from the Tax Cuts and Jobs Act of 2017 and other discrete items. Excluding these items, we recorded strong fourth quarter core results, which cap a successful year. For the quarter, we recorded core EPS of $0.71 and core ROA of 1.31%, which represent significant improvement from the prior year. We gained meaningful market share during the fourth quarter as loans grew an impressive 10% and customer deposits increased 12% on an annualized basis. Execution and optimization of previous acquisitions was a strategic focus in 2017, and we are pleased to report a strong 4Q 2017 core efficiency ratio of 57.0% and 2 percentage points of positive operating leverage compared to 4Q 2016. Our 4Q 2017 core results were balanced and almost entirely driven by organic growth, confirming the strength of our business model and growth strategy. Our full-year 2017 results were highlighted by 17% growth in core EPS, a core ROA of 1.21%, 7% loan growth, 9% customer funding growth, core fee income growth of 19%, and a 60.1% core efficiency ratio. These core results and the resulting momentum position us well to exceed our Strategic Plan goals in 2018, even before the favorable impact of the recent tax rate change.\n“Further, the results of our 2017 Associate engagement survey conducted by the Gallup organization placed us among the top 5% of Gallup clients worldwide. During the year, we also were named a top workplace in Delaware for the twelfth consecutive year in The News Journal’s ‘Top Workplaces’ survey, ranking second in the large company category. We were also named the ‘Top Bank’ in Delaware for the seventh year in a row. In addition, we were named a ‘Top Workplace’ in our newer, greater-Philadelphia market by philly.com , earning third place in the mid-size company category.\n“Strong Associate and Customer engagement across our footprint coupled with high performing, high quality, and sustainable financial results, continue to fuel our growth and ability to execute on our strategic goals. These results and accolades demonstrate the continued success of our focused strategy of: ‘Engaged Associates delivering stellar experiences growing Customer Advocates and value for our Owners’.”\nFourth Quarter 2017 Discussion of Financial Results\nNet interest margin increased due to balance sheet positioning and growth\nNet interest income for 4Q 2017 was $57.7 million, an increase of $4.8 million, or 9% compared to 4Q 2016. The net interest margin for 4Q 2017 was 4.00%, an increase of 10 bps from 3.90% for 4Q 2016. The year-over-year increase reflects an estimated 9 bps resulting from the higher short-term interest rate environment, 6 bps related to the redemption of $55.0 million of our senior notes in late 3Q 2017, an estimated 6 bps from favorable balance sheet growth and mix, and 3 bps from the payoff of a loan previously placed on nonaccrual status. These drivers of higher net interest margin were offset somewhat by 11 bps attributable to lower purchased loan accretion from previous acquisitions and 3 bps from the continued run-off of our high-yielding reverse mortgage portfolio.\nCompared with 3Q 2017, net interest income increased $1.6 million or 3% (not annualized) and net interest margin increased 5 bps to 4.00% from 3.95%. The increase in the net interest margin from 3Q 2017 was primarily driven by a 4 bps benefit from the aforementioned redemption of $55.0 million of our senior notes in 3Q 2017 and a 3 bps benefit from the loan payoff described in the paragraph above. These factors were offset by 3 bps of lower purchased loan accretion in 4Q 2017.\nStrong and balanced loan portfolio growth continues\nAt December 31, 2017, WSFS’ net loan portfolio was $4.81 billion, an increase of $117.8 million, or 10% (annualized), from September 30, 2017. The increase was highlighted by a $76.8 million, or 8% (annualized), increase in total commercial loans and a $37.7 million, or 29% (annualized), increase in consumer loans.\nCompared to December 31, 2016, net loans increased $308.2 million, or 7%. The year-over-year growth included an increase of $176.5 million, or 7% in commercial and industrial (C&I) loans, an increase of $58.7 million, or 27% in construction loans and an increase of $109.6 million, or 24% in consumer loans. These increases were partially offset by a decline in residential mortgages of $59.6 million, or 17%, reflecting our ongoing strategy of selling most newly-originated residential mortgages in the secondary market.\nThe following table summarizes loan balances and composition at December 31, 2017 compared to September 30, 2017 and December 31, 2016:\n(Dollars in thousands) December 31, 2017 September 30, 2017 December 31, 2016 Commercial & industrial $ 2,540,853 52 % $ 2,483,193 53 % $ 2,364,399 53 % Commercial real estate 1,180,399 25 1,149,664 25 1,156,542 26 Construction 280,017 6 291,617 6 221,321 5 Total commercial loans 4,001,269 83 3,924,474 84 3,742,262 84 Residential mortgage 284,798 6 281,092 6 344,373 7 Consumer 561,905 12 524,164 11 452,273 10 Allowance for loan losses (40,599 ) (1 ) (40,201 ) (1 ) (39,751 ) (1 ) Net Loans $ 4,807,373 100 % $ 4,689,529 100 % $ 4,499,157 100 % Credit quality trends remain stable and strong\nCredit quality metrics during 4Q 2017 reflect continued strength in portfolio performance.\nTotal problem assets, which includes all criticized, classified, and nonperforming loans as well as other real estate owned (OREO), were $150.3 million, or 21.34% of Tier 1 capital plus the allowance for loan losses (ALLL) at December 31, 2017, a slight increase compared to $147.7 million, or 20.63%, at September 30, 2017. Notably, classified assets, which are included in problem assets, decreased to $110.7 million at December 31, 2017 compared to $128.7 million at September 30, 2017.\nTotal delinquencies, which include nonperforming delinquencies, were $25.3 million at December 31, 2017, or 0.53% of gross loans, a slight improvement from $27.0 million and 0.57% of gross loans at September 30, 2017. Excluding nonperforming delinquencies, performing loan delinquencies were only 0.18% of gross loans at December 31, 2017.\nTotal nonperforming assets increased $6.6 million or 13% to $59.0 million at December 31, 2017, as compared to $52.4 million at September 30, 2017, primarily due to one loan relationship that was placed on non-accrual status during the quarter. The nonperforming assets to total assets ratio was a low 0.84% at December 31, 2017 compared to 0.76% at September 30, 2017.\nNet charge-offs for 4Q 2017 were $3.7 million or 0.31% (annualized), an increase from $2.7 million, or 0.23% (annualized), in 3Q 2017, and a decrease from $4.4 million, or 0.40% (annualized), during 4Q 2016. For the full-year 2017, the ratio of net charge-offs to total gross loans was 0.22% in 2017, as compared with 0.23% for the full-year 2016, demonstrating continued overall positive and stable credit quality trends.\nTotal credit costs (provision for loan losses, loan workout expenses, OREO expenses and other credit costs) were $4.1 million for 4Q 2017, an increase from $3.5 million during 3Q 2017 and a decrease from $5.9 million during 4Q 2016. Total credit costs for the full-year 2017 were $12.6 million, as compared with $14.8 million for the full-year 2016, further demonstrating continued positive and stable credit quality and costs.\nThe ratio of the ALLL to total gross loans was 0.84% at December 31, 2017 compared to 0.86% at September 30, 2017. Excluding the balances for acquired loans (marked-to-market at acquisition), the ALLL to total gross loans ratio would have been 0.97% at December 31, 2017 and 0.99% at September 30, 2017. The ALLL was 111% of nonaccruing loans at December 31, 2017 compared to 120% at September 30, 2017 and 174% at December 31, 2016.\nCustomer funding reflects continued core deposit strength\nTotal customer funding was $5.02 billion at December 31, 2017, a $140.4 million, or 12% (annualized) increase from September 30, 2017. The increase included a $63.2 million increase in noninterest bearing deposits, reflecting strong organic growth in our core deposit franchise. In addition, the Company took the opportunity to attract fixed rate funding during the quarter in a rising rate environment. As a result, CDs increased $71.9 million in the quarter.\nCustomer funding increased $418.6 million, or 9% compared to December 31, 2016. This included a core deposit increase of $382.7 million, or 10% over the prior year, with $290.6 million attributable to no- and low-cost checking deposit accounts.\nCore deposits were a very strong 87% of total customer deposits, and no- and low-cost checking deposit accounts represent a robust 49% of total customer deposits at December 31, 2017. These core deposits predominantly represent longer-term, less price-sensitive customer relationships, which are very valuable in a rising-rate environment. The ratio of loans to customer deposits was 96% at December 31, 2017.\nThe following table summarizes customer funding balances and composition at December 31, 2017 compared to September 30, 2017 and December 31, 2016:\n( Dollars in thousands) December 31, 2017 September 30, 2017 December 31, 2016 Noninterest demand $ 1,420,760 28 % $ 1,357,597 28 % $ 1,266,306 28 % Interest-bearing demand 1,071,512 21 1,057,571 22 935,333 20 Savings 549,744 11 557,914 11 547,293 12 Money market 1,347,146 27 1,347,576 28 1,257,520 27 Total core deposits 4,389,162 87 4,320,658 89 4,006,452 87 Customer time deposits 629,071 13 557,129 11 593,184 13 Total customer deposits $ 5,018,233 100 % $ 4,877,787 100 % $ 4,599,636 100 % Strong and diversified organic fee income growth\nCore fee income (noninterest income) increased by $4.4 million, or 16%, to $32.2 million compared to 4Q 2016, including $4.1 million, or 15%, from organic growth, demonstrating our ability to execute on our strategic goal of optimizing our fee-based businesses. This was the result of diversified growth across most of our businesses and included $1.7 million from credit/debit card and ATM income and $1.3 million from investment management and fiduciary revenue.\nWhen compared to 3Q 2017, core fee income increased $0.5 million, or 2% (not annualized), driven by a $0.6 million increase in investment management and fiduciary revenue. Further, full-year 2017 core fee income increased $20.0 million over 2016, or 19%, of which $12.3 million, or 12% was organic growth.\nFor 4Q 2017, fee income was 35.7% of total revenue (computed on a fully tax-equivalent basis), compared to 34.5% for 4Q 2016, and was well diversified among various sources, including traditional banking, mortgage banking, wealth management and ATM services (Cash Connect ® ).\nNoninterest expenses reflect improved efficiency\nCore noninterest expense for 4Q 2017 was $51.7 million, an increase of $4.3 million or 9% from $47.4 million in 4Q 2016. Contributing to the year-over-year increase was $3.4 million of higher compensation and benefit costs to support overall franchise growth and $0.4 million due to higher costs to support Cash Connect ® revenue growth.\nWhen compared to 3Q 2017, core noninterest expense decreased $1.6 million, primarily due to $1.0 million of lower incentive compensation costs and $0.3 million related to a vendor credit.\nOur core efficiency ratio was 57.0% in 4Q 2017, an improvement compared to 60.2% in 3Q 2017 and 58.2% in 4Q 2016. This improvement reflects continued growth and economies of scale as well as the typical seasonality of our business, with results typically improving throughout the year. Our full-year 2017 core efficiency ratio was 60.1% in 2017, slightly improved from 60.2% in 2016.\nIncome taxes\nOur income tax provision and effective tax rate were significantly affected by the revaluation of our net DTA due to the permanent reduction in the corporate tax rate included in H.R. 1 (the Tax Cuts and Jobs Act) as well as our related decision to surrender our BOLI policies in 2018. The table below shows the effect of these items on our tax provision and effective tax rate.\nThree months ended December 31, 2017 September 30, 2017 December 31, 2016 Tax provision $ 30,557 $ 10,942 $ 9,070 Less: DTA revaluation (12,820 ) — — Less: BOLI surrender (7,952 ) — — Adjusted tax provision (2) $ 9,785 $ 10,942 $ 9,070 Effective tax rate 101.7 % 34.7 % 33.4 % Less: Effect of DTA revaluation (42.7 ) — — Less: Effect of BOLI surrender (26.4 ) — — Adjusted effective tax rate (2) 32.6 % 34.7 % 33.4 % The modest fluctuation in the adjusted effective tax rate (excluding the effects of our DTA revaluation and BOLI surrender) is primarily the result of differences in tax benefits realized on stock-based compensation and state taxes.\n(2) As used in this release, adjusted tax provision and adjusted effective tax rate are non-GAAP financial measures. For further discussion of our use of non-GAAP financial information, see note (o) in \"Non-GAAP Reconciliation\" at the end of this press release.\nSelected Business Segments (included in previous results):\nWealth Management segment fee revenue grew 16% over the prior year\nThe Wealth Management segment provides a broad array of fiduciary, investment management, credit and deposit products to clients through six businesses. WSFS Wealth Investments provides insurance, asset management, and brokerage products primarily to our retail banking clients with $188.7 million in assets under management (AUM). Cypress Capital Management, LLC is a registered investment adviser with $901.5 million (3) in AUM. Cypress is a fee-only wealth management firm whose primary market segment is high net worth individuals, offering a “balanced” investment style focused on preservation of capital and providing current income. West Capital Management is a registered investment adviser with $861.2 million in AUM. West Capital is a fee-only wealth management firm which operates under a multi-family office philosophy and provides fully-customized solutions tailored to the unique needs of institutions and high net worth individuals. Christiana Trust , with $16.79 billion (3) in AUM and assets under administration, provides fiduciary and investment services to personal trust clients; and trustee, agency, bankruptcy, administration, custodial and commercial domicile services to corporate and institutional clients. Powdermill Financial Solutions, LLC is a multi-family office that specializes in providing unique, independent solutions to high net worth individuals, families and corporate executives through a coordinated, centralized approach. WSFS Wealth Client Management serves high net worth clients by delivering credit and deposit products and partnering with other business units to deliver investment management and fiduciary products and services.\nTotal Wealth Management revenue (net interest income, fiduciary fees and other fee income) was $13.2 million for 4Q 2017. This represented an increase of $1.6 million, or 14% compared to 4Q 2016 and an increase of $0.6 million, or 5% compared to 3Q 2017. Included in the year-over-year increase is fee revenue, which increased $1.4 million, or 16%, compared to 4Q 2016. The year over year increase reflects continued organic growth across our business lines.\nTotal noninterest expense (including intercompany allocations and provision for loan losses and credit costs) was $8.4 million during 4Q 2017 compared to $10.7 million during 4Q 2016 and $8.6 million during 3Q 2017. The year-over-year decrease in costs was due to a 2016 charge-off of $3.5 million in the Wealth Division’s Wealth Client Management Group. Excluding this, noninterest expense increased $1.2 million or 17% due to higher legal and consulting costs related to certain legacy trust legal matters, increased compensation expense due to higher revenue and other infrastructure costs necessary to support the continuing growth of the business.\nPre-tax income in 4Q 2017 was $4.9 million compared to $0.9 million in 4Q 2016 and $4.1 million in 3Q 2017 and was driven by the above mentioned factors.\n(3) AUM includes $146.9 million of Christiana Trust assets for which Cypress serves as sub-adviser.\nCash Connect ® net revenue increases 10% over same quarter 2016\nCash Connect ® is a premier provider of ATM vault cash and smart safe and cash logistics services in the United States. Cash Connect ® services over 23,000 non-bank ATMs and retail safes nationwide with over $970 million in cash and other fee-based services. Cash Connect ® also operates 440 ATMs for WSFS Bank, which has the largest branded ATM network in Delaware.\nOur Cash Connect ® division recorded $9.5 million in net revenue (fee income less funding costs) in 4Q 2017, an increase of $0.9 million or 10% from 4Q 2016, primarily due to continued growth in the bailment, cash management and smart safe lines of business, partially offset by higher funding costs. Compared to 3Q 2017, net revenue decreased $0.1 million. Noninterest expense (including intercompany allocations of expense) was $7.5 million during 4Q 2017, an increase of $1.2 million from 4Q 2016 and a decrease of $0.1 million compared to 3Q 2017. The year-over-year increase in expense was primarily due to higher operating and funding costs associated with growth, including higher partner costs, and investment in several new features of our managed services and smart safe products. Cash Connect ® reported pre-tax income of $1.9 million for 4Q 2017, which was a decrease of $0.3 million from 4Q 2016, primarily as a result of margin compression from rising interest rates. Pre-tax net income was essentially flat in 4Q 2017 compared to 3Q 2017.\nThroughout 2017, Cash Connect ® focused on expanding both ATM and smart safe managed services to offset margin compression resulting from the ATM industry consolidation trend and higher interest rate expense pressure. Cash Connect ® is committed to improving funding costs and ROA by optimizing cash usage throughout our network. Cash Connect ® almost doubled our smart safe network to nearly 1,600 safes as of year-end 2017, an increase from approximately 800 safes at the end of 2016 and 100 safes at the end of 2015. Additionally, Cash Connect ® has a strong smart safe pipeline generated by several national channel partners actively marketing our program.\nCapital management\nWSFS’ total stockholders’ equity decreased $7.2 million, or 1% (not annualized), to $733.7 million at December 31, 2017 from $740.9 million at September 30, 2017, primarily due to the small quarterly loss, stock buybacks and the payment of the common stock dividend during the quarter.\nWSFS’ tangible common equity (4) decreased by 1% (not annualized) to $545.2 million at December 31, 2017 from $551.7 million at September 30, 2017 for the reasons described in the paragraph above.\nWSFS’ common equity to assets ratio was 10.49% at December 31, 2017, and its tangible common equity to tangible assets ratio (4) decreased by 24 bps during the quarter to 8.01%. At December 31, 2017, book value per share was $23.35, a $0.24 decrease from September 30, 2017, and tangible common book value per share (4) was $17.35, a $0.22 decrease from September 30, 2017.\nAt December 31, 2017, WSFS Bank’s Tier 1 leverage ratio of 9.87%, Common Equity Tier 1 capital ratio and Tier 1 capital ratio of 11.53%, and Total Capital ratio of 12.25%, were all substantially in excess of the “well-capitalized” regulatory benchmarks. (5)\nIn 4Q 2017, WSFS repurchased 51,000 shares of common stock at an average price of $49.76 as part of our 5% buyback program approved by the Board of Directors in 4Q 2015. WSFS has 699,194 shares, or more than 2% of outstanding shares, remaining to repurchase under this current authorization. In addition, the Board of Directors approved a quarterly cash dividend of $0.09 per share of common stock. This dividend will be paid on February 22, 2018 to stockholders of record as of February 8, 2018.\n(4) As used in this release, tangible common equity, tangible common equity to assets and tangible common book value per share are non-GAAP financial measures. For a reconciliation of these measures to their comparable GAAP measures, see \"Non-GAAP Reconciliation\" at the end of this press release.\n(5) These ratios are calculated in accordance with guidance included in the Interagency Statement on Accounting and Reporting Implications of the New Tax Law which was issued on January 18, 2018.\nFourth quarter 2017 earnings release conference call\nManagement will conduct a conference call to review 4Q 2017 results at 1:00 p.m. Eastern Time (ET) on Tuesday, January 23, 2018. Interested parties may listen to this call by dialing 1-877-312-5857. A rebroadcast of the conference call will be available beginning at 4 pm on January 23, 2018 until Tuesday, February 6, 2018 at 4 pm. by dialing 1-855-859-2056 and using Conference ID #7077949.\nAbout WSFS Financial Corporation\nWSFS Financial Corporation is a multi-billion dollar financial services company. Its primary subsidiary, WSFS Bank, is the oldest and largest locally-managed bank and trust company headquartered in Delaware and the Delaware Valley. As of December 31, 2017, WSFS Financial Corporation had $7.0 billion in assets on its balance sheet and $18.6 billion in assets under management and administration. WSFS operates from 76 offices located in Delaware (46), Pennsylvania (28), Virginia (1) and Nevada (1) and provides comprehensive financial services including commercial banking, retail banking, cash management and trust and wealth management. Other subsidiaries or divisions include Christiana Trust, WSFS Wealth Investments, Cypress Capital Management, LLC, West Capital Management, Powdermill Financial Solutions, Cash Connect ® , WSFS Mortgage and Arrow Land Transfer. Serving the Delaware Valley since 1832, WSFS Bank is one of the ten oldest banks in the United States continuously operating under the same name. For more information, please visit wsfsbank.com .\nForward-Looking Statement Disclaimer\nThis press release contains estimates, predictions, opinions, projections and other \"forward-looking statements\" as that phrase is defined in the Private Securities Litigation Reform Act of 1995. Such statements include, without limitation, references to the Company's predictions or expectations of future business or financial performance as well as its goals and objectives for future operations, financial and business trends, business prospects, and management's outlook or expectations for earnings, revenues, expenses, capital levels, liquidity levels, asset quality or other future financial or business performance, strategies or expectations. Such forward-looking statements are based on various assumptions (some of which may be beyond the Company's control) and are subject to risks and uncertainties (which change over time) and other factors which could cause actual results to differ materially from those currently anticipated. Such risks and uncertainties include, but are not limited to, those related to difficult market conditions and unfavorable economic trends in the United States generally, and particularly in the market areas in which the Company operates and in which its loans are concentrated, including the effects of declines in housing markets, an increase in unemployment levels and slowdowns in economic growth; the Company's level of nonperforming assets and the costs associated with resolving any problem loans including litigation and other costs; changes in market interest rates which may increase funding costs and reduce earning asset yields thus reducing margin; the impact of changes in interest rates and the credit quality and strength of underlying collateral and the effect of such changes on the market value of the Company's investment securities portfolio; the credit risk associated with the substantial amount of commercial real estate, construction and land development, and commercial and industrial loans in our loan portfolio; the extensive federal and state regulation, supervision and examination governing almost every aspect of the Company's operations including changes in regulations affecting financial institutions, including the Dodd-Frank Wall Street Reform and Consumer Protection Act and the rules and regulations being issued in accordance with this statute and potential expenses associated with complying with such regulations; possible additional loan losses and impairment of the collectability of loans; the Company's ability to comply with applicable capital and liquidity requirements (including the finalized Basel III capital standards), including our ability to generate liquidity internally or raise capital on favorable terms; possible changes in trade, monetary and fiscal policies, laws and regulations and other activities of governments, agencies, and similar organizations; any impairment of the Company's goodwill or other intangible assets; failure of the financial and operational controls of the Company's Cash Connect ® division; conditions in the financial markets that may limit the Company's access to additional funding to meet its liquidity needs; the success of the Company's growth plans, including the successful integration of past and future acquisitions; negative perceptions or publicity with respect to the Company's trust and wealth management business; system failure or cybersecurity breaches of the Company's network security; the Company's ability to recruit and retain key employees; the effects of problems encountered by other financial institutions that adversely affect the Company or the banking industry generally; the effects of weather and natural disasters such as floods, droughts, wind, tornadoes and hurricanes as well as effects from geopolitical instability and manmade disasters including terrorist attacks; possible changes in the speed of loan prepayments by the Company's customers and loan origination or sales volumes; possible acceleration of prepayments of mortgage-backed securities due to low interest rates, and the related acceleration of premium amortization on prepayments on mortgage-backed securities due to low interest rates; regulatory limits on the Company's ability to receive dividends from its subsidiaries and pay dividends to its stockholders; the effects of any reputational, credit, interest rate, market, operational, legal, liquidity, regulatory and compliance risk resulting from developments related to any of the risks discussed above; and the costs associated with resolving any problem loans, litigation and other risks and uncertainties, discussed in the Company's Form 10-K for the year ended December 31, 2016 and other documents filed by the Company with the Securities and Exchange Commission from time to time. Forward-looking statements are as of the date they are made, and the Company does not undertake to update any forward-looking statement, whether written or oral, that may be made from time to time by or on behalf of the Company.\nWSFS FINANCIAL CORPORATION\nFINANCIAL HIGHLIGHTS\nSUMMARY STATEMENTS OF INCOME (Unaudited)\n(Dollars in thousands, except per share data) Three months ended Twelve months ended December 31,\n2017 September 30,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 Interest income: Interest and fees on loans $ 59,889 $ 58,504 $ 53,951 $ 229,147 $ 194,345 Interest on mortgage-backed securities 5,176 4,955 4,096 19,308 15,754 Interest and dividends on investment securities 1,124 1,139 1,212 4,648 4,872 Other interest income 367 412 433 1,623 1,607 66,556 65,010 59,692 254,726 216,578 Interest expense: Interest on deposits 4,626 3,862 2,687 14,904 9,421 Interest on Federal Home Loan Bank advances 2,206 2,402 1,310 8,263 4,707 Interest on senior debt 1,179 1,807 2,120 7,228 6,356 Interest on trust preferred borrowings 522 500 439 1,940 1,622 Interest on other borrowings 298 310 182 1,120 727 8,831 8,881 6,738 33,455 22,833 Net interest income 57,725 56,129 52,954 221,271 193,745 Provision for loan losses 4,063 2,896 5,124 10,964 12,986 Net interest income after provision for loan losses 53,662 53,233 47,830 210,307 180,759 Noninterest income: Credit/debit card and ATM income 9,710 9,350 7,969 36,116 29,899 Investment management and fiduciary revenue 9,420 8,809 8,081 35,103 25,691 Deposit service charges 4,666 4,695 4,634 18,318 17,734 Mortgage banking activities, net 1,508 1,756 1,409 6,293 7,434 Loan fee income 735 483 567 2,218 2,066 Investment securities gains, net 220 736 479 1,984 2,369 Bank-owned life insurance income 421 546 222 1,545 919 Other income 5,755 6,066 4,938 23,067 18,949 32,435 32,441 28,299 124,644 105,061 Noninterest expense: Salaries, benefits and other compensation 28,145 29,172 24,794 114,376 95,983 Occupancy expense 4,807 4,756 4,086 19,409 16,646 Equipment expense 3,020 2,922 2,726 12,564 10,368 Professional fees 2,045 2,248 2,251 8,597 9,142 Data processing and operations expense 1,594 1,817 1,711 6,779 6,275 Marketing expense 815 712 843 3,083 3,020 FDIC expenses 533 560 526 2,216 2,606 Loan workout and OREO expense 316 484 622 1,820 1,681 Early extinguishment of debt — 695 — 695 — Corporate development expense 21 153 1,526 878 8,529 Fraud loss 2,844 — — 2,844 — Other operating expenses 11,925 10,644 9,864 41,200 34,416 56,065 54,163 48,949 214,461 188,666 Income before taxes 30,032 31,511 27,180 120,490 97,154 Income tax provision 30,557 10,942 9,070 60,939 33,074 Net (loss) income $ (525 ) $ 20,569 $ 18,110 $ 59,551 $ 64,080 Diluted (loss) earnings per share of common stock: $ (0.02 ) $ 0.64 $ 0.56 $ 1.84 $ 2.06 Weighted average shares of common stock outstanding for fully diluted EPS (q) 31,404,353 32,268,538 32,280,897 32,302,540 31,085,693 See “Notes”\nWSFS FINANCIAL CORPORATION\nFINANCIAL HIGHLIGHTS\nSUMMARY STATEMENTS OF INCOME (Unaudited) - continued\nThree months ended Twelve months ended December 31,\n2017 September 30,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 Performance Ratios: Return on average assets (a) (0.03 )% 1.20 % 1.08 % 0.87 % 1.06 % Return on average equity (a) (0.28 ) 11.06 10.37 8.21 10.03 Return on average tangible common equity (a)(o) (0.05 ) 15.22 14.82 11.48 12.85 Net interest margin (a)(b) 4.00 3.95 3.90 3.95 3.88 Efficiency ratio (c) 61.67 60.61 59.71 61.47 62.73 Noninterest income as a percentage of total net revenue (b) 35.68 36.30 34.52 35.72 34.93 See “Notes”\nWSFS FINANCIAL CORPORATION\nFINANCIAL HIGHLIGHTS (Continued)\nSUMMARY STATEMENTS OF FINANCIAL CONDITION (Unaudited)\n(Dollars in thousands) December 31,\n2017 September 30,\n2017 December 31,\n2016 Assets: Cash and due from banks $ 122,141 $ 117,343 $ 119,929 Cash in non-owned ATMs 598,117 612,443 698,454 Investment securities (d) 161,809 162,345 199,979 Other investments 34,892 36,856 41,788 Mortgage-backed securities (d) 837,499 809,809 758,910 Net loans (e)(f)(l) 4,807,373 4,689,529 4,499,157 Bank owned life insurance 102,958 102,727 101,425 Goodwill and intangibles 188,444 189,116 191,247 Other assets 143,787 155,176 154,381 Total assets $ 6,997,020 $ 6,875,344 $ 6,765,270 Liabilities and Stockholders’ Equity: Noninterest-bearing deposits $ 1,420,760 $ 1,357,597 $ 1,266,306 Interest-bearing deposits 3,597,473 3,520,190 3,333,330 Total customer deposits 5,018,233 4,877,787 4,599,636 Brokered deposits 229,371 173,932 138,802 Total deposits 5,247,604 5,051,719 4,738,438 Federal Home Loan Bank advances 710,001 697,812 854,236 Other borrowings 227,805 305,496 413,211 Other liabilities 77,958 79,456 72,049 Total liabilities 6,263,368 6,134,483 6,077,934 Stockholders’ equity 733,652 740,861 687,336 Total liabilities and stockholders’ equity $ 6,997,020 $ 6,875,344 $ 6,765,270 Capital Ratios: Equity to asset ratio 10.49 % 10.78 % 10.16 % Tangible common equity to tangible asset ratio (o) 8.01 8.25 7.55 Common equity Tier 1 capital (g) (required: 4.5%; well capitalized: 6.5%) (p) 11.53 11.52 11.19 Tier 1 leverage (g) (required: 4.00%; well-capitalized: 5.00%) (p) 9.87 10.24 9.66 Tier 1 risk-based capital (g) (required: 6.00%; well-capitalized: 8.00%) (p) 11.53 11.52 11.19 Total Risk-based capital (g) (required: 8.00%; well-capitalized: 10.00%) (p) 12.25 12.22 11.93 Asset Quality Indicators: Nonperforming Assets: Nonaccruing loans $ 36,436 $ 33,536 $ 22,876 Troubled debt restructuring (accruing) 20,061 14,905 14,336 Assets acquired through foreclosure 2,503 3,924 3,591 Total nonperforming assets $ 59,000 $ 52,365 $ 40,803 Past due loans (h) $ 461 $ 1,338 $ 438 Allowance for loan losses 40,599 40,201 39,751 Ratio of nonperforming assets to total assets 0.84 % 0.76 % 0.60 % Ratio of nonperforming assets (excluding accruing TDRs) to total assets 0.56 0.54 0.39 Ratio of allowance for loan losses to total gross loans (i)(n) 0.84 0.86 0.89 Ratio of allowance for loan losses to nonaccruing loans 111 120 174 Ratio of quarterly net charge-offs to average gross loans (a)(e)(i)(n) 0.31 0.23 0.40 Ratio of year-to-date net charge-offs to average gross loans (a)(e)(i)(n) 0.22 0.19 0.23\nWSFS FINANCIAL CORPORATION\nFINANCIAL HIGHLIGHTS (Continued)\nAVERAGE BALANCE SHEET (Unaudited)\n(Dollars in thousands) Three months ended December 31, 2017 September 30, 2017 December 31, 2016 Average\nBalance Interest &\nDividends Yield/\nRate\n(a)(b) Average\nBalance Interest &\nDividends Yield/\nRate\n(a)(b) Average\nBalance Interest &\nDividends Yield/\nRate\n(a)(b) Assets: Interest-earning assets: Loans: (e) (j) Commercial real estate loans $ 1,469,316 $ 18,713 5.05 % $ 1,422,306 $ 18,186 5.07 % $ 1,354,359 $ 17,004 4.99 % Residential real estate loans 258,900 3,714 5.74 269,134 3,747 5.57 288,281 4,687 6.50 Commercial loans 2,497,730 30,575 4.89 2,471,382 30,013 4.85 2,328,245 26,789 4.61 Consumer loans 543,569 6,700 4.89 509,750 6,329 4.93 448,709 4,988 4.42 Loans held for sale 18,862 187 3.97 22,734 229 4.03 57,432 483 3.36 Total loans 4,788,377 59,889 4.98 4,695,306 58,504 4.96 4,477,026 53,951 4.81 Mortgage-backed securities (d) 824,838 5,176 2.51 809,655 4,955 2.45 763,379 4,096 2.15 Investment securities (d) 162,258 1,124 4.12 168,526 1,139 4.08 200,517 1,212 3.49 Other interest-earning assets 33,389 367 4.40 36,992 412 4.46 36,418 433 4.76 Total interest-earning assets 5,808,862 66,556 4.60 % 5,710,479 65,010 4.57 % 5,477,340 59,692 4.39 % Allowance for loan losses (40,465 ) (40,831 ) (39,720 ) Cash and due from banks 136,542 118,056 127,583 Cash in non-owned ATMs 575,121 558,855 653,662 Bank owned life insurance 102,781 102,513 101,733 Other noninterest-earning assets 342,467 344,783 324,679 Total assets $ 6,925,308 $ 6,793,855 $ 6,645,277 Liabilities and Stockholders’ Equity: Interest-bearing liabilities: Interest-bearing deposits: Interest-bearing demand $ 1,017,068 $ 781 0.30 % $ 939,239 $ 606 0.26 % $ 925,853 $ 331 0.14 % Money market 1,345,702 1,375 0.41 1,324,946 1,227 0.37 1,273,868 968 0.30 Savings 554,028 262 0.19 564,275 264 0.19 548,669 220 0.16 Customer time deposits 597,111 1,467 0.97 555,668 1,188 0.85 577,834 934 0.64 Total interest-bearing customer deposits 3,513,909 3,885 0.44 3,384,128 3,285 0.39 3,326,224 2,453 0.29 Brokered deposits 243,441 741 1.21 195,073 577 1.17 148,127 234 0.63 Total interest-bearing deposits 3,757,350 4,626 0.49 3,579,201 3,862 0.43 3,474,351 2,687 0.31 FHLB of Pittsburgh advances 633,941 2,206 1.38 730,390 2,402 1.30 786,171 1,310 0.66 Trust preferred borrowings 67,011 522 3.09 67,011 500 2.96 67,011 439 2.61 Senior Debt 98,139 1,179 4.81 134,658 1,807 5.37 151,966 2,120 5.58 Other borrowed funds 122,313 298 0.97 132,030 310 0.93 133,037 182 0.54 Total interest-bearing liabilities 4,678,754 8,831 0.75 % 4,643,290 8,881 0.76 % 4,612,536 6,738 0.58 % Noninterest-bearing demand deposits 1,414,356 1,333,266 1,271,373 Other noninterest-bearing liabilities 80,248 79,176 66,580 Stockholders’ equity 751,950 738,123 694,788 Total liabilities and stockholders’ equity $ 6,925,308 $ 6,793,855 $ 6,645,277 Excess of interest-earning assets over interest-bearing liabilities $ 1,130,108 $ 1,067,189 $ 864,804 Net interest and dividend income $ 57,725 $ 56,129 $ 52,954 Interest rate spread 3.85 % 3.81 % 3.81 % Net interest margin 4.00 % 3.95 % 3.90 % See “Notes”\nWSFS FINANCIAL CORPORATION\nFINANCIAL HIGHLIGHTS (Continued)\n(Unaudited)\n(Dollars in thousands, except per share data) Three months ended Twelve months ended Stock Information: December 31,\n2017 September 30,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 Market price of common stock: High $ 52.50 $49.45 $47.64 $ 52.50 $47.64 Low 45.75 42.45 31.90 42.45 26.40 Close 47.85 48.75 46.35 47.85 46.35 Book value per share of common stock 23.35 23.59 21.90 Tangible common book value per share of common stock (o) 17.35 17.57 15.80 Number of shares of common stock outstanding (000s) 31,418 31,410 31,390 Other Financial Data: One-year repricing gap to total assets (k) (0.80 )% (1.70)% (4.14)% Weighted average duration of the MBS portfolio 5.2 years 5.1 years 5.4 years Unrealized (losses) gains on securities available for sale, net of taxes $ (6,401 ) $(3,528) $(8,194) Number of Associates (FTEs) (m) 1,159 1,121 1,116 Number of offices (branches, LPO’s, operations centers, etc.) 76 77 77 Number of WSFS owned ATMs 440 447 446 Notes:\n(a) Annualized.\n(b) Computed on a fully tax-equivalent basis.\n(c) Noninterest expense divided by (tax-equivalent) net interest income and noninterest income.\n(d) Includes securities held to maturity (at amortized cost) and securities available for sale (at fair value).\n(e) Net of unearned income.\n(f) Net of allowance for loan losses.\n(g) Represents capital ratios of Wilmington Savings Fund Society, FSB and subsidiaries.\n(h) Accruing loans which are contractually past due 90 days or more as to principal or interest.\n(i) Excludes loans held for sale.\n(j) Nonperforming loans are included in average balance computations.\n(k) The difference between projected amounts of interest-sensitive assets and interest-sensitive liabilities repricing within one year divided by total assets, based on a current interest rate scenario.\n(l) Includes loans held for sale and reverse mortgages.\n(m) Includes seasonal Associates, when applicable.\n(n) Excludes reverse mortgage loans.\n(o) The Company uses non-GAAP (Generally Accepted Accounting Principles) financial information in its analysis of the Company’s performance. The Company’s management believes that these non-GAAP measures provide a greater understanding of ongoing operations, enhance comparability of results of operations with prior periods and show the effects of significant gains and charges in the periods presented. The Company’s management believes that investors may use these non-GAAP measures to analyze the Company’s financial performance without the impact of unusual items or events that may obscure trends in the Company’s underlying performance. This non-GAAP data should be considered in addition to results prepared in accordance with GAAP, and is not a substitute for, or superior to, GAAP results. For a reconciliation of these non-GAAP measures, see \"Non-GAAP Reconciliation\" at the end of this press release.\n(p) Calculated for Wilmington Savings Fund Society, FSB.\n(q) Diluted earnings per share considers the impact of potentially dilutive shares except in periods in which there is a loss because the inclusion of the potential common shares would have an anti-dilutive effect. For the three months ended December 31, 2017, 884,982 shares were anti-dilutive and were not included in the diluted earnings per share calculation.\nWSFS FINANCIAL CORPORATION\nFINANCIAL HIGHLIGHTS (Continued)\n(Dollars in thousands, except per share data)\n(Unaudited)\nNon-GAAP Reconciliation (o): Three months ended Twelve months ended December 31,\n2017 September 30,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 Net interest income (GAAP) $ 57,725 $ 56,129 $ 52,954 $ 221,271 $ 193,745 Core net interest income (non-GAAP) $ 57,725 $ 56,129 $ 52,954 $ 221,271 $ 193,745 Noninterest Income (GAAP) $ 32,435 $ 32,441 $ 28,299 $ 124,644 $ 105,061 Less: Securities gains 220 736 479 1,984 2,369 Core fee income (non-GAAP) $ 32,215 $ 31,705 $ 27,820 $ 122,660 $ 102,692 Core net revenue (non-GAAP) $ 89,940 $ 87,834 $ 80,774 $ 343,931 $ 296,437 Core net revenue (non-GAAP)(tax-equivalent) $ 90,688 $ 88,627 $ 81,494 $ 346,922 $ 299,407 Noninterest expense (GAAP) $ 56,065 $ 54,163 $ 48,949 $ 214,461 $ 188,666 Less: Corporate development costs 21 153 1,526 878 8,529 Less: Debt extinguishment costs — 695 — 695 — Less: Fraud loss 2,844 — — 2,844 — Less: WSFS Foundation contribution 1,500 — — 1,500 — Core noninterest expense (non-GAAP) $ 51,700 $ 53,315 $ 47,423 $ 208,544 $ 180,137 Core efficiency ratio (c) 57.0 % 60.2 % 58.2 % 60.1 % 60.2 % End of period December 31,\n2017 September 30,\n2017 December 31,\n2016 Total assets $ 6,997,020 $ 6,875,344 $ 6,765,270 Less: Goodwill and other intangible assets 188,444 189,116 191,247 Total tangible assets $ 6,808,576 $ 6,686,228 $ 6,574,023 Total stockholders’ equity $ 733,652 $ 740,861 $ 687,336 Less: Goodwill and other intangible assets 188,444 189,116 191,247 Total tangible common equity (non-GAAP) $ 545,208 $ 551,745 $ 496,089 Calculation of tangible common book value per share: Book value per share (GAAP) $ 23.35 $ 23.59 $ 21.90 Tangible common book value per share (non-GAAP) 17.35 17.57 15.80 Calculation of tangible common equity to tangible assets: Equity to asset ratio (GAAP) 10.49 % 10.78 % 10.16 % Tangible common equity to tangible assets ratio (non-GAAP) 8.01 8.25 7.55\nThree months ended Twelve months ended December 31,\n2017 September 30,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 GAAP net (loss) income $ (525 ) $ 20,569 $ 18,110 $ 59,551 $ 64,080 Pre-tax adjustments: Securities gains, corporate development,\ndebt extinguishment costs, fraud loss and WSFS Foundation contribution 4,145 112 1,047 3,933 6,160 Tax adjustments: DTA writedown & BOLI surrender 20,772 — — 20,772 — Tax impact of pre-tax adjustments (1,485 ) (43 ) (315 ) (1,415 ) (1,837 ) Non-GAAP net income $ 22,907 $ 20,638 $ 18,842 $ 82,841 $ 68,403 GAAP return on average assets (ROA) (0.03 )% 1.20 % 1.08 % 0.87 % 1.06 % Pre-tax adjustments: Securities gains, corporate development,\ndebt extinguishment costs, fraud loss and WSFS Foundation contribution 0.24 0.01 0.06 0.06 0.10 Tax adjustments: DTA writedown & BOLI surrender 1.19 — — 0.30 — Tax impact of pre-tax adjustments (0.09 ) — (0.02 ) (0.02 ) (0.03 ) Core ROA (non-GAAP) 1.31 % 1.21 % 1.12 % 1.21 % 1.13 % GAAP net (loss) income $ (0.02 ) $ 0.64 $ 0.56 $ 1.84 $ 2.06 Pre-tax adjustments: Securities gains, corporate development,\ndebt extinguishment costs, fraud loss and WSFS Foundation contribution 0.13 — 0.03 0.12 0.19 Tax adjustments: DTA writedown & BOLI surrender 0.64 — — 0.64 — Tax impact of pre-tax adjustments (0.04 ) — (0.01 ) (0.04 ) (0.06 ) Core EPS (non-GAAP) $ 0.71 $ 0.64 $ 0.58 $ 2.56 $ 2.19 Calculation of return on average tangible common equity: GAAP net (loss) income $ (525 ) $ 20,569 $ 18,110 $ 59,551 $ 64,080 Plus: Tax effected amortization of intangible assets 461 468 808 1,954 1,621 Net tangible income (non-GAAP) $ (64 ) $ 21,037 $ 18,918 $ 61,505 $ 65,701 Average shareholders’ equity $ 751,950 $ 738,123 $ 694,788 $ 725,763 $ 638,624 Less: average goodwill and intangible assets 188,834 189,599 186,890 189,784 127,168 Net average tangible common equity $ 563,116 $ 548,524 $ 507,898 $ 535,979 $ 511,456 Return on average tangible common equity (non-GAAP) (0.05 )% 15.22 % 14.82 % 11.48 % 12.85 % Calculation of core return on average tangible common equity: Non-GAAP net income $ 22,907 $ 20,638 $ 18,842 $ 82,841 $ 68,403 Plus: Tax effected amortization of intangible assets 461 468 808 1,954 1,621 Core net tangible income (non-GAAP) $ 23,368 $ 21,106 $ 19,650 $ 84,795 $ 70,024 Net average tangible common equity $ 563,116 $ 548,524 $ 507,898 $ 535,979 $ 511,456 Core return on average tangible common equity (non-GAAP) 16.46 % 15.27 % 15.39 % 15.82 % 13.69 %\nInvestor Relations Contact:\nDominic C. Canuso\n(302) 571-6833\ndcanuso@wsfsbank.com\nMedia Contact:\nJimmy A. Hernandez\n(302) 571-5254\njhernandez@wsfsbank.com\nSource:WSFS Financial Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/3f252484-32e0-4f86-8fa0-bc29ac99eb0f"], "published": "2018-01-23T00:05:00.000+02:00", "crawled": "2018-01-23T02:15:34.008+02:00", "highlightTitle": ""}