{"organizations": [], "uuid": "d9190e17739718253eb92f95712b8da299c461c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-oil-states-announces-offering-of-200-million-principal-amount-of-convertible-senior-notes-due-2023.html", "country": "US", "domain_rank": 767, "title": "Oil States Announces Offering of $200 Million Principal Amount of Convertible Senior Notes Due 2023", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:15:00.000+02:00", "replies_count": 0, "uuid": "d9190e17739718253eb92f95712b8da299c461c6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-oil-states-announces-offering-of-200-million-principal-amount-of-convertible-senior-notes-due-2023.html", "ord_in_thread": 0, "title": "Oil States Announces Offering of $200 Million Principal Amount of Convertible Senior Notes Due 2023", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "globe newswire", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "oil states international, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 24, 2018 (GLOBE NEWSWIRE) -- Oil States International, Inc. (NYSE:OIS) (the “Company”) announced today that it intends to offer, subject to market and other conditions, $200 million aggregate principal amount of convertible senior notes due 2023 (the “Notes”) in a private offering to qualified institutional buyers pursuant to Rule 144A under the Securities Act of 1933, as amended (the “Securities Act”).\nThe Notes will be senior, unsecured obligations of the Company, with interest payable semi-annually in arrears, and will be convertible by the holder, subject to various conditions, into cash, shares of the Company's common stock, or a combination thereof, at the Company's election. The Company will have the option to redeem all or any portion of the Notes on or after February 15, 2021, if certain conditions (including the Company’s common stock trading above a specified level) are met, at a redemption price equal to 100% of the principal amount plus accrued and unpaid interest to, but excluding, the redemption date. The Notes are expected to mature on February 15, 2023, unless repurchased, redeemed or converted in accordance with their terms prior to such date. The interest rate and initial conversion rate of the Notes will be determined by negotiations between the Company and the initial purchasers.\nThe Company expects to use the net proceeds from the sale of the Notes to repay a portion of the borrowings outstanding under the Company’s revolving credit facility, which were drawn to fund the cash portion of the purchase price in the GEODynamics, Inc. acquisition that closed on January 12, 2018.\nThe offer and sale of the Notes and any shares of the Company’s common stock issuable upon conversion of the Notes have not been and are not expected to be registered under the Securities Act or the securities laws of any other jurisdiction, and the Notes and any such shares may not be offered or sold in the United States absent registration or an applicable exemption from such registration requirements.\nThis press release does not constitute an offer to sell, or the solicitation of an offer to buy, any securities, nor shall it constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation or sale is unlawful. Any offer, if at all, will be made only pursuant to Rule 144A under the Securities Act.\nForward Looking Statements\nThe foregoing contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements are those that do not state historical facts and are, therefore, inherently subject to risks and uncertainties. The forward-looking statements included therein are based on then current expectations and entail various risks and uncertainties that could cause actual results to differ materially from those forward-looking statements. Such risks and uncertainties include, among other things, the Company’s ability to consummate the offering on acceptable terms or at all; risks associated with the general nature of the energy service industry; and other factors discussed in the \"Business\" and \"Risk Factors\" sections of the Annual Report on Form 10-K for the year ended December 31, 2016 and in subsequently filed Quarterly Reports on Form 10-Q filed by the Company with the Securities and Exchange Commission.\nSOURCE: Oil States International, Inc.\nSource:Oil States International, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/35b001a2-0c99-40dd-b403-fd2a4f176c98"], "published": "2018-01-25T00:15:00.000+02:00", "crawled": "2018-01-25T02:19:36.000+02:00", "highlightTitle": ""}