{"organizations": [], "uuid": "2f9489dd2d7cb3ade5595ca0321b7c2bb6091942", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219109321&w=1200&r=LYNXMPEE0212G", "site_section": "http://feeds.reuters.com/reuters/healthNews", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-cancer-alcohol/how-alcohol-damages-stem-cell-dna-and-increases-cancer-risk-idUSKBN1ES1N2", "country": "US", "domain_rank": 408, "title": "How alcohol damages stem cell DNA and increases cancer risk", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T22:23:00.000+02:00", "replies_count": 0, "uuid": "2f9489dd2d7cb3ade5595ca0321b7c2bb6091942"}, "author": "", "url": "https://www.reuters.com/article/us-health-cancer-alcohol/how-alcohol-damages-stem-cell-dna-and-increases-cancer-risk-idUSKBN1ES1N2", "ord_in_thread": 0, "title": "How alcohol damages stem cell DNA and increases cancer risk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 6:07 PM / Updated 7 hours ago How alcohol damages stem cell DNA and increases cancer risk Kate Kelland 3 Min Read \nLONDON (Reuters) - Drinking alcohol produces a harmful chemical in the body which can lead to permanent genetic damage in the DNA of stem cells, increasing the risk of cancer developing, according to research published on Wednesday. \nWorking with mice in a laboratory, British scientists used chromosome analysis and DNA sequencing to examine the genetic damage caused by acetaldehyde, a harmful chemical produced when the body processes alcohol. \nTheir findings offered more detail about how alcohol increases the risk of developing 7 types of cancer, including common forms such as breast and bowel cancer. It also showed how the body seeks to defend against the damage alcohol can do. \n“Some cancers develop due to DNA damage in stem cells. While some damage occurs by chance, our findings suggest that drinking alcohol can increase the risk of this damage,” said Ketan Patel, a professor at the Medical Research Council Laboratory of Molecular Biology, who co-led the study. \nThe World Health Organization’s International Agency for Research on Cancer classifies alcohol as a Group 1 carcinogen, citing “convincing evidence” it causes cancer in humans. \nA study published in 2011 found that alcohol is responsible for around 4 percent of all cancer in Britain - equating to around 12,800 cases a year. Professor Ketan Patel works in the lab at MRC Laboratory of Molecular Biology in Cambridge, Britain January 2, 2018. Picture taken January 2, 2018. REUTERS/Chris Radburn \nIn Wednesday’s study, published in the journal Nature, Patel’s team gave diluted alcohol to mice and then analyzed the effect on the animals’ DNA. They found that acetaldehyde can break and damage DNA within blood stem cells, permanently altering the DNA sequences within these cells. \nThis is important, Patel said, because when healthy stem cells become faulty, they can give rise to cancerous cells. Slideshow (7 Images) \nThe researchers also looked at how the body tries to protect itself against damage caused by alcohol. The first line of defense is a group of enzymes called aldehyde dehydrogenases or ALDHs, Patel explained. These break down the acetaldehyde into acetate, which cells can then use as a source of energy. \nIn the study, when mice lacking a critical ALDH enzyme were given alcohol, their DNA suffered four times as damage compared with mice with a properly functioning version of the enzyme. \nPatel said cells also have a second line of defense in the form of a range of DNA repair systems which, most of the time, allow them to fix and reverse different types of DNA damage. \nBut in some instances and in some people - particularly people from South East Asia - the repair systems fail to work, meaning their cells are unable to repair effectively. \n“It’s important to remember that alcohol clearance and DNA repair systems are not perfect, and alcohol can still cause cancer in different ways - even in people whose defense mechanisms are intact,” Patel said. Reporting by Kate Kelland Editing by Jeremy Gaunt", "external_links": [], "published": "2018-01-03T22:23:00.000+02:00", "crawled": "2018-01-04T00:12:40.002+02:00", "highlightTitle": ""}