{"organizations": [], "uuid": "f2c374c5c16f2bfa006f951008f9ec23bd70ee0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224219180&w=1200&r=LYNXMPEE0L1QJ", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-israel-palestinians-usa-aid/in-gaza-unrwa-chief-says-u-s-aid-cut-risks-more-middle-east-instability-idUKKBN1FB2F4", "country": "US", "domain_rank": 408, "title": "In Gaza, UNRWA chief says U.S. aid cut risks more Middle East instability", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T19:35:00.000+02:00", "replies_count": 0, "uuid": "f2c374c5c16f2bfa006f951008f9ec23bd70ee0a"}, "author": "", "url": "https://uk.reuters.com/article/uk-israel-palestinians-usa-aid/in-gaza-unrwa-chief-says-u-s-aid-cut-risks-more-middle-east-instability-idUKKBN1FB2F4", "ord_in_thread": 0, "title": "In Gaza, UNRWA chief says U.S. aid cut risks more Middle East instability", "locations": [], "entities": {"persons": [{"name": "pierre krähenbühl", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "nidal", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}], "locations": [{"name": "gaza", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "gaza strip", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "unrwa", "sentiment": "negative"}, {"name": "min read  gaza", "sentiment": "none"}, {"name": "u.n. relief and works agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 5:38 PM / Updated 16 minutes ago In Gaza, UNRWA chief says U.S. aid cut risks more Middle East instability Nidal al-Mughrabi 4 Min Read \nGAZA (Reuters) - The head of the U.N. agency that helps Palestinian refugees said on Monday that U.S. plans to cut funding to the body were abrupt and harmful and risked destabilising the Middle East. \nPierre Krähenbühl, commissioner-general of the U.N. Relief and Works Agency (UNRWA), visited the Gaza Strip on the same day that U.S. Vice President Mike Pence told the Israeli parliament in Jerusalem that the U.S. would move its embassy there by the end of 2019. \nThe United States, by far the largest contributor to UNRWA, announced on Jan. 16 that Washington will withhold $65 million (£46.61 million) of $125 million that it had planned to send to UNRWA this year. UNRWA is funded almost entirely by voluntary contributions from U.N. member states. \nU.S. President Donald Trump questioned the value of such funding, and the State Department said the agency needed to make unspecified reforms. \nIn Gaza to launch a global funding appeal to keep UNRWA’s schools and clinics open through 2018 and beyond, Krähenbühl said the American cuts would cause difficulties for the agency. \n“The reduction is a very severe one, it is abrupt and is harmful,” said Krähenbühl. \n“The world has to ask itself this question: does the Middle East need more instability? Is it reasonable to think that by reducing amounts to UNRWA one is achieving anything else but greater instability in the region?” \nMore than half of the two million people in Gaza are dependent on support from UNRWA and other humanitarian agencies. Palestinians say the funding decision could deepen hardship in the Gaza Strip, where the unemployment rate is 46 percent. UNRWA Commissioner-General Pierre Krahenbuhl speaks during a news conference at a UN-run school in Gaza City January 22, 2018. REUTERS/Suhaib Salem \nUNRWA was established by the U.N. General Assembly in 1949 after hundreds of thousands of Palestinians fled or were expelled from their homes in the 1948 war that followed Israel’s creation. \nAround 525,000 boys and girls in 700 UNRWA schools could be affected by the U.S. fund cut, Krähenbühl told Reuters while visiting a girls’ school in Gaza City. Palestinian access to primary health care could also be impacted. \n“I can’t imagine to come to this school or to any other school in UNRWA in few weeks and say to the students, ‘Sadly we failed.’ Failing is not an option,” Krähenbühl said. \nWashington gave $355 million to UNRWA in the 2017 fiscal year that ended Sept. 30, U.S. officials say. \nIn a Twitter post on Jan. 2, Trump said that the U.S. gives the Palestinians “HUNDRED OF MILLIONS OF DOLLARS a year and get no appreciation or respect.” Trump added that “with the Palestinians no longer willing to talk peace, why should we make any of these massive future payments to them?” \nIsraeli Prime Minister Benjamin Netanyahu, who has called for a gradual cut in UNRWA funding and for its responsibilities to be transferred to the U.N. global refugee agency UNHCR, has voiced measured support for the U.S. fund cut. \nBut Netanyahu has also appeared to acknowledge that it could leave Israel - which maintains tight restrictions on the movement of people and goods across its border with Gaza - with a potential humanitarian crisis on its doorstep. \nFor a graph of funding for Palestinian refugee relief, click - reut.rs/2CN66gl Writing by Stephen Farrell; Editing by Maayan Lubell, William Maclean", "external_links": [], "published": "2018-01-22T19:35:00.000+02:00", "crawled": "2018-01-22T20:01:31.001+02:00", "highlightTitle": ""}