{"organizations": [], "uuid": "7e43b158b4220915f651acb84449e878c3a7783a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-mynd-provides-year-end-business-update.html", "country": "US", "domain_rank": 767, "title": "MYND Provides Year-End Business Update", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:10:00.000+02:00", "replies_count": 0, "uuid": "7e43b158b4220915f651acb84449e878c3a7783a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-mynd-provides-year-end-business-update.html", "ord_in_thread": 0, "title": "MYND Provides Year-End Business Update", "locations": [], "entities": {"persons": [], "locations": [{"name": "mission viejo", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "mynd analytics, inc.", "sentiment": "neutral"}, {"name": "horizon healthcare services, inc.", "sentiment": "none"}, {"name": "arcadian telepsychiatry services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MISSION VIEJO, Calif., Jan. 02, 2018 (GLOBE NEWSWIRE) -- MYnd Analytics, Inc. (NASDAQ:MYND), the market leader in improving the delivery of mental health through the combination of telemedicine and data analytics/augmented intelligence, today provided a business update.\nRecent highlights include:\nCompleted the acquisition of revenue-generating Arcadian Telepsychiatry Services which is anticipated to generate rapid growth and benefits from cross-selling going forward Well positioned to capitalize on the new collaborative care reimbursement model and to assist value-based medical practices and systems to improve outcomes and to reduce costs First patient enrolled in a 600-patient paid pilot with Horizon Healthcare Services, Inc. to improve patient care over trial and error medication management and to reduce total costs of care Completed pharmacoeconomic dossier showing significant potential savings when following PEER recommendations as compared to trial and error prescribing Completed financing of $8.79 million, coinciding with listing on NASDAQ Hired sales team targeting strong revenue growth for 2018 Ended fiscal year with solid balance sheet; over $5 million of cash\nGeorge Carpenter, CEO of MYnd Analytics, commented, “2017 was a transformative year for the company as we achieved a number of important milestones. Most recently, we completed the acquisition of Arcadian Telepsychiatry Services, which manages the delivery of telepsychiatry and tele-mental health services throughout the United States. Telemedicine is one of the fastest growing areas of healthcare services today and directly addresses the shortage of mental health providers and the growing need for behavioral health services. The American Psychiatric Association estimates through effective integration of medical and behavioral health services $26-48 billion could be saved annually.\"\nMr. Carpenter continued, \"This acquisition provides us a foothold in the rapidly growing telemedicine market, as well as an opportunity to leverage our unique technology platform. Combining Arcadian’s capabilities with MYnd’s data analytics capabilities will provide patients greater access to care, reduce costs, and help doctors to reduce trial and error prescribing, which is the current standard in mental health treatment. I am pleased to report the integration is progressing well, and that Arcadian’s business is growing rapidly. As a result, we believe Arcadian will be a major contributor to our revenue in 2018 and beyond.”\n“I am also pleased to report that we are gaining significant traction with our Psychiatric EEG Evaluation Registry (“PEER”) platform technology. To this end, we have started to enroll patients in the first payor demonstration project with Horizon Healthcare Services, Inc., in New Jersey. This project is a paid 600 patient pilot to evaluate the cost savings and reduction in trial and error prescribing when utilizing the PEER report to assist in treatment decision making. Additionally, it is designed to demonstrate that using PEER Online® will reduce total costs of care. An independent study by Cedar Associates, LLC, a Stanford Health Policy Adjunct Affiliate estimated a 4.7-fold cost savings, net cost of the test, could be achieved, which makes our program very appealing for payers. With over 3.8 million patients in its network, Horizon itself represents a $48 million potential annual market for MYnd, from a single payor in one state. We look forward to adding additional pilot programs in 2018 and to rolling out our offering with our expanded telepsychiatry capabilities.”\n“Coverage for mental health continues to expand and CPT codes are in place for reimbursement. The Mental Health Parity and Addiction Equity Act (MHPAEA) requires health plans to ensure parity between medical/surgical benefits and mental health/substance use disorder (MH/SUD) benefits. In addition, Medicare recently added coverage and reimbursement for Psychiatric Collaborative Care Management Services under the Collaborative Care Model (CoCM). Under CoCM, there is greater financial incentive for both the primary care provider and the consulting psychiatrist to collaborate in providing care to patients. Specifically, the consulting psychiatrist provides the primary care practice with specialized expertise through regular case review and recommendations for therapeutic and pharmacological treatment, medication adjustments, and additional specialty care. We believe this important shift will expand the market for both telepsychiatry and for the use of PEER.”\n“Looking ahead to 2018, we believe we are poised for rapid growth. We have expanded our sales force and plan to accelerate our patient-direct marketing through social media and through other digital media initiatives, which should help to drive sales growth. We are also enhancing both our operational and financial infrastructure to support our anticipated growth and listing requirements. We ended the fiscal year-end on September 30, 2017 with no long-term debt and over $5 million cash. Our financials reflect a one-time, $16 million non-cash expense related to the issuance of warrants in our last financing transaction. Given the tremendous progress we made in 2017, our anticipated growth, scalable business model, and solid balance sheet, we believe we are well positioned to drive shareholder value in 2018 and beyond.”\nAbout MYnd Analytics\nMYnd Analytics, Inc. ( www.myndanalytics.com ) is a predictive analytics company that has developed a decision support tool to help physicians reduce trial and error treatment in mental health and provide more personalized care to patients. The Company’s Psychiatric EEG Evaluation Registry, or PEER Online, is a registry and reporting platform that allows medical professionals to exchange treatment outcome data for patients referenced to objective neurophysiology data obtained through a standard electroencephalogram (EEG). Based on the Company’s original physician-developed database, there are now more than 39,000 outcomes for over 10,000 unique patients in the PEER registry. The goal of PEER Online is to provide objective, personalized data to assist physicians in the selection of appropriate medications.\nAbout Arcadian\nArcadian, manages a suite of services including telepsychiatry, teletherapy, digital patient screening, curbside consultation, on-demand services, and scheduled encounters for all age groups. Arcadian utilizes patient engagement and re-engagement strategies so that care is effectively completed, helping to comfortably move inpatient care to outpatient, assisting patients in readjusting to their life routine, as well as reducing wait times for mental health treatment. Arcadian’s customer base includes major health plans, health systems, and community based organizations.\nForward-looking Statements\nExcept for the historical information contained herein, the matters discussed are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended. These involve risks and uncertainties, such as statements regarding the integration of Arcadian into MYnd, future revenues, future earnings, future number of patients or clients, developments relating to reimbur", "external_links": ["https://www.globenewswire.com/Tracker?data=a-e54jRxAQPywEamdDWRvCYQ5NvlE3vBXd97P9JWwWl7zqHxHuQ-2JvWKBEdHACOFeMDrz6wDZrqZsV-IdrzeVkGHq2Hk90fAXsf4qy39Nc=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/00b02d71-8090-4f9a-946b-ea5293348396", "https://www.globenewswire.com/Tracker?data=a-e54jRxAQPywEamdDWRvCYQ5NvlE3vBXd97P9JWwWmOEqtEoGnP9G-B2VbZnnxuWDqb0ZEG3WZ1fozvDGui_qAqH9bLnuEZ3PolWTX82Lw=", "https://www.globenewswire.com/Tracker?data=QDNDmzvrgsxxGSkd9JGgIrHW1FF6ajktgZpb-QBscdV6bq69iZ1T1sAOD0FHNCn5c46FZmu2ZjQpR2Qwmzmo9h9loN-ht8OP8pQwvfandNQ="], "published": "2018-01-02T16:10:00.000+02:00", "crawled": "2018-01-02T16:31:53.007+02:00", "highlightTitle": ""}