{"organizations": [], "uuid": "80dd6f059ab9685bfcbf26174144b0f4a858d283", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222430447&w=1200&r=LYNXMPEE0F0XG", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-djokovic-wilander/pressure-will-determine-whether-djokovic-is-back-wilander-idUKKBN1F51MQ", "country": "US", "domain_rank": 408, "title": "Pressure will determine whether Djokovic is back - Wilander", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:40:00.000+02:00", "replies_count": 0, "uuid": "80dd6f059ab9685bfcbf26174144b0f4a858d283"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-djokovic-wilander/pressure-will-determine-whether-djokovic-is-back-wilander-idUKKBN1F51MQ", "ord_in_thread": 0, "title": "Pressure will determine whether Djokovic is back - Wilander", "locations": [], "entities": {"persons": [{"name": "djokovic", "sentiment": "negative"}, {"name": "wilander", "sentiment": "none"}, {"name": "novak djokovic", "sentiment": "none"}, {"name": "donald young", "sentiment": "none"}, {"name": "mats wilander", "sentiment": "none"}, {"name": "margaret court arena", "sentiment": "none"}, {"name": "kato  djokovic", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "wilander ian ransom", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "margaret court arena", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 1:41 PM / Updated an hour ago Pressure will determine whether Djokovic is back - Wilander Ian Ransom 3 Min Read \nMELBOURNE (Reuters) - Novak Djokovic exceeded expectations on his return to grand slam action at the Australian Open on Tuesday but the Serb should brace for doubts to re-surface during tougher matches, according to former world number one Mats Wilander. Tennis - Australian Open - Margaret Court Arena, Melbourne, Australia, January 16, 2018. Novak Djokovic of Serbia reacts during his match against Donald Young of the U.S. REUTERS/Issei Kato \nDjokovic routed 63rd-ranked American Donald Young 6-1 6-2 6-4 at Margaret Court Arena to reach the second round at Melbourne Park, his first match since retiring with elbow trouble during the Wimbledon quarter-finals. \nThe 12-times grand slam champion was thrilled with his performance, having known only a few weeks before that he would compete in the tournament. \n“I thought he looked very good. He was fresh, he was moving well,” Wilander, host of the “Game, Set and Mats” show for Eurosport at the Australian Open, told Reuters on Tuesday. \n”You would think maybe on paper it would have been a little bit closer because Donald Young is a solid player, but maybe Djokovic was too just good. He looked great. \n”I think it was above expectations. \n”I think physically he has a level that could make a deep run. Plus he’s won here six times. \n“It makes it easier when the courts are playing quick because if you’re lacking a little bit of confidence ... he doesn’t have too be so eager to get on to the ball to add body weight, literally, so I think the courts really suit him there.” \nDjokovic, who holds a professional era record six titles at Melbourne Park, was wearing a compression sleeve on his elbow and his newly modified serve remains a work in progress. \nHe landed barely half of his first serves against Young but it barely mattered as he amassed 33 winners in a dominant display. \nSeeded 14th, he faces a bigger test in the next round against Frenchman Gael Monfils, a former quarter-finalist at Melbourne Park. \n“You would think maybe, because (Djokovic) hasn’t played matches, at some point he would lack some confidence in a close match or a close set,” Wilander said. \n“You never know. When it’s easy it’s going to be no problem. When it gets tough that’s when you know what’s going to hold up and what’s not.” \nBeyond Monfils, Djokovic’s path to a record-extending seventh title gets no easier. \nThe fourth seed and highly fancied tyro Alexander Zverev looms as a possible fourth round match-up, with three-times grand slam champion Stan Wawrinka a potential quarter-final opponent. Editing by Ed Osmond", "external_links": [], "published": "2018-01-16T15:40:00.000+02:00", "crawled": "2018-01-16T15:52:11.002+02:00", "highlightTitle": ""}