{"organizations": [], "uuid": "b2c03f1495dc3700ad640528942d94db64b4b813", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/29/104134711-GettyImages-518604672.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/fertitta-says-hes-successful-because-he-never-shot-for-the-stars.html", "country": "US", "domain_rank": 767, "title": "Fertitta says he's successful because he never 'shot for the stars'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.243, "site_type": "news", "published": "2018-01-03T15:22:00.000+02:00", "replies_count": 0, "uuid": "b2c03f1495dc3700ad640528942d94db64b4b813"}, "author": "Ruth Umoh", "url": "https://www.cnbc.com/2018/01/03/fertitta-says-hes-successful-because-he-never-shot-for-the-stars.html", "ord_in_thread": 0, "title": "Fertitta says he's successful because he never 'shot for the stars'", "locations": [], "entities": {"persons": [{"name": "fertitta", "sentiment": "negative"}, {"name": "mastro", "sentiment": "none"}, {"name": "tilman fertitta", "sentiment": "none"}], "locations": [{"name": "rainforest cafe", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "bubba gump shrimp co.", "sentiment": "none"}, {"name": "forbes", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "houston rockets", "sentiment": "none"}, {"name": "landry's inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hour Ago | 01:04 SHARES \nWe're often told that we should always reach for the stars. In business, however, that may not be the best idea, according to self-made billionaire Tilman Fertitta. \nFertitta has an estimated net worth of $3.6 billion, according to Forbes , and is the owner and CEO of Landry's Inc., one of the largest restaurant corporations in the U.S. His portfolio includes popular chains like Rainforest Cafe, Bubba Gump Shrimp Co. and Mastro's Restaurants. \nIn September, the Texas native purchased the Houston Rockets basketball team for $2.2 billion and he also stars in CNBC's reality show, \" Billion Dollar Buyer ,\" which first premiered in 2016. \nDuring this season's premiere, the hospitality magnate meets with the owner of an athleisure apparel line to discuss the possibility of selling her clothing in one of his stores. \nThe Los Angeles-based clothing line, which is named Never Too Pretty, has a strong social media following. Women hold up signs that say \"Never Too Pretty\" and share personal stories about things that they're never too pretty to do. \nThe company was founded just a few years ago by CEO Cary Williams, a former fighter and full-time Olympic-level boxing coach. However, Williams says that she's looking to move away from being a boxing instructor to focus full-time on her clothing brand. Mike Windle/NBC | Getty Images Tilman Fertitta stars in CNBC's \"Billion Dollar Buyer\" \nThis year, the company made about $50,000 in sales. But in two years, Williams says she'd like for Never Too Pretty to become a million-dollar company. \nFertitta quickly puts a stop to this idea. \"If people said, 'Tilman, why are you so successful?'\" he tells Williams, \"I'd say, 'You know why? Because I never shot for the stars.'\" \n\"It's happened over a long period of time,\" he says of his personal achievements in business. \"It didn't happen overnight.\" \nHe adds that his success grew incrementally over the years and slowly progressed upward. And it took patience and time. \"I always had goals but they were goals that I could reach,\" says the billionaire. \nIn an interview with CNBC Make It , he says that although he doesn't write down his goals, he always has an idea of what he wants to accomplish and lays out a general time frame of when he wants to fulfill that goal. \n\"I'm not talking about little goals. I'm talking about big goals,\" he says. \"Everybody in life should always strive [to figure out], 'How am I going to get from point A to point B?'\" \nOn \"Billion Dollar Buyer,\" the restaurateur explains to Williams that it's completely impractical for her to jump from making $50,000 in sales to making one million in sales next year. \"That's not gonna happen unless something crazy happens,\" he says. \nThe entrepreneur acknowledges that sometimes companies can accomplish this feat, but that it's highly unlikely this will happen for Never Too Pretty. \"It's not realistic,\" he says. \nInstead, he advises Williams to set attainable goals for her business. \"You've gotta be disciplined about your goals,\" he tells her. \"Just always remember that.\"", "external_links": [], "published": "2018-01-03T15:22:00.000+02:00", "crawled": "2018-01-03T15:41:05.005+02:00", "highlightTitle": ""}