{"organizations": [], "uuid": "2b8ca6d8de01fc824cdf961fda85c9ec04fff64e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/rtx3fvyu.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/eu-pushes-plastic-recycling/", "country": "US", "domain_rank": 1196, "title": "EU: Plastics Packaging to be Reusable or Recyclable by 2030 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-17T02:40:00.000+02:00", "replies_count": 0, "uuid": "2b8ca6d8de01fc824cdf961fda85c9ec04fff64e"}, "author": "Laignee Barron", "url": "http://fortune.com/2018/01/17/eu-pushes-plastic-recycling/", "ord_in_thread": 0, "title": "EU: Plastics Packaging to be Reusable or Recyclable by 2030 | Fortune", "locations": [], "entities": {"persons": [{"name": "frans", "sentiment": "none"}, {"name": "caren firouz", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}], "organizations": [{"name": "eu targets plastic waste", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The EU Targets Plastic Waste as it Aims to Make All Packaging Recyclable by 2030 A worker sorts bottles at a recycling workshop in Islamabad, Pakistan on Sept. 12, 2017. Caren Firouz—Reuters 12:40 AM EST \nOne word: plastics. \nEuropean Union regulators declared a new policy agenda Tuesday starting with the goal that all plastic packaging on the EU market will be recyclable or reusable by 2030. \nThe European Commission appears to be scrambling to curb plastic usage and increase recycling after China announced it would no longer accept imports of “foreign garbage” starting in 2018, the Guardian reports. \nThe urgent goal is part of a plan to develop a new, sustainable “plastic economy,” which could potentially involve levying taxes and modernizing plastics production to kickstart a behavior change, the European Commission said in a statement . \nEuropeans produce 25 million tons of plastic waste annually, but less than 30% of it is currently recycled, the commission said. \n“If we don’t do anything about this, 50 years down the road we will have more plastic than fish in the oceans” Frans Timmermans, vice-president of the European Commission responsible for sustainable development, said in a statement. \nBrussels is zeroing in on single-use plastics in particular, hoping to reduce if not eliminate items like straws, bottles that do not degrade, coffee cups, lids and stirrers, cutlery and takeaway containers. \n“Single-use plastics … take five seconds to produce, you use it for five minutes and it takes 500 years to break down again,” Timmermans said. \nIn addition to promoting consumer education, the commission said it will facilitate easy access to tap water throughout Europe in order to reduce the demand for bottled water, according to the Guardian. \nLast week, budget commissioner Günther Oettinger reportedly suggested a levy on plastics could be one way to start filling the $16 billion gap in the EU budget after the U.K.’s withdrawal from the bloc. \nCommissioners said China’s ban has created a “positive crisis” in the global plastics market, forcing innovation and more efficient recycling. The Commission said it would support such innovation and will make an additional €100 million ($122 million) available for the development of smarter and cleaner recyclable materials. \n“It’s urgent because of the change in the Chinese position. We can’t export these plastics any more to China. The knee-jerk reaction is that we will have to burn or bury it here. Let’s use this opportunity to show we can also recycle it here,” Timmermans said. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T02:40:00.000+02:00", "crawled": "2018-01-17T08:07:12.000+02:00", "highlightTitle": ""}