{"organizations": [], "uuid": "ff055d5a85312837c069566f35b62f8fd010ae66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223846596&w=1200&r=LYNXMPEE0K0BR", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-mideast-pence-jordan/jordans-king-says-east-jerusalem-must-be-capital-of-palestinian-state-idUSKBN1FA0FS", "country": "US", "domain_rank": 408, "title": "Jordan's king says East Jerusalem must be capital of Palestinian state", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-21T19:05:00.000+02:00", "replies_count": 0, "uuid": "ff055d5a85312837c069566f35b62f8fd010ae66"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-mideast-pence-jordan/jordans-king-says-east-jerusalem-must-be-capital-of-palestinian-state-idUSKBN1FA0FS", "ord_in_thread": 0, "title": "Jordan's king says East Jerusalem must be capital of Palestinian state", "locations": [], "entities": {"persons": [{"name": "abdullah", "sentiment": "negative"}, {"name": "suleiman al-khalidi", "sentiment": "none"}, {"name": "jeff mason", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "john stonestreet", "sentiment": "none"}], "locations": [{"name": "east jerusalem", "sentiment": "none"}, {"name": "amman", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "amman", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 11:05 AM / in 3 hours Jordan's king tells Pence U.S. must rebuild trust after Jerusalem decision Jeff Mason 3 Min Read \nAMMAN (Reuters) - Jordan’s King Abdullah told U.S. Vice President Mike Pence on Sunday he looked to Washington to rebuild “trust and confidence” in moving toward a two-state solution in Israel after President Donald Trump recognized Jerusalem as the country’s capital. \nWith Pence sitting across from him in the royal palace, King Abdullah said Jordan viewed the Israel-Palestinian conflict as a “potential major source of instability”. \nHe said he had raised his concerns for some time that such a decision on Jerusalem “does not come as a result of a comprehensive settlement to the Palestinian-Israeli conflict”. He also reiterated that East Jerusalem should be the capital of a future Palestinian state. \n“We hope that the U.S. will reach out and find the right way to move forward in these challenging circumstances,” the king said. \nAt the end of the visit, Pence in remarks to the press said he “agreed to disagree” with King Abdullah on the impact of Trump’s move. \nPence said in Egypt on Saturday and again in Jordan that the United States would support a two-state solution for Israelis and Palestinians if they both agreed to it. \nTrump’s endorsement in December of Israel’s claim to Jerusalem as its capital drew universal condemnation from Arab leaders and criticism around the world. It also broke with decades of U.S. policy that the city’s status must be decided in negotiations between Israel and the Palestinians. Jordan's King Abdullah, his wife Queen Rania (R), meet with U.S. Vice President Mike Pence, and wife Karen Pence, at the Royal Palace in Amman, Jordan January 21, 2018. REUTERS/Muhammad Hamed \nJordan lost East Jerusalem and the West Bank to Israel during the Arab-Israeli war in 1967. \nPence told the king that Washington was committed to preserving the status quo of holy sites in Jerusalem. \nKing Abdullah’s Hashemite dynasty is the custodian of the Muslim holy sites in the city, making Amman particularly sensitive to any changes of status there. Slideshow (5 Images) \n“For us, Jerusalem is key to Muslims and Christians, as it is to Jews. It is key to peace in the region and key to enabling Muslims to effectively fight some of our root causes of radicalization,” he said. \nJordanian officials fear Trump’s move has wrecked chances of a resumption of Arab-Israeli peace talks, which King Abdullah had sought to revive. \nThey also worry the move could trigger violence in the Palestinian territories which could spill over into Jordan, where many people are descendants of Palestinian refugees whose families left after Israel was created in 1948. \n“We take no position on boundaries and final status. Those are subject to negotiation,” Pence said. \nAfter the meeting, Pence flew to a military facility near the Syrian border to meet with U.S. troops. He will finish his three-nation Middle East trip in Israel. Reporting by Jeff Mason; Writing by Suleiman Al-Khalidi and Jeff Mason; Editing by Sonya Hepinstall, William Maclean", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-21T19:05:00.000+02:00", "crawled": "2018-01-21T13:18:45.003+02:00", "highlightTitle": ""}