{"organizations": [], "uuid": "364fad2dc0803b3c7e47f6c486bd8e5797ad8fdd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-stocks-close/china-stocks-up-for-8th-day-helped-by-consumer-firms-idUSZZN2R7A00", "country": "US", "domain_rank": 408, "title": "China stocks up for 8th day, helped by consumer firms", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:14:00.000+02:00", "replies_count": 0, "uuid": "364fad2dc0803b3c7e47f6c486bd8e5797ad8fdd"}, "author": "", "url": "https://www.reuters.com/article/china-stocks-close/china-stocks-up-for-8th-day-helped-by-consumer-firms-idUSZZN2R7A00", "ord_in_thread": 0, "title": "China stocks up for 8th day, helped by consumer firms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI, Jan 9 (Reuters) - China stocks extended a rally to an eighth straight day, with major indexes ending at their six-week highs, helped by gains from consumer and healthcare firms.\n** At the close, the Shanghai Composite index was up 5.35 points or 0.16 percent at 3,414.83. ** The blue-chip CSI300 index was up 0.71 percent, with its financial sector sub-index higher by 0.38 percent, the consumer staples sector up 3.41 percent, the real estate index up 0.18 percent and healthcare sub-index up 2.43 percent. ** The smaller Shenzhen index ended up 0.32 percent and the start-up board ChiNext Composite index was weaker by 0.14 firmer by 0.06 percent while Japan’s Nikkei index closed up 0.57 percent. ** At 07:00 GMT, the yuan was Quote: d at 6.5041 per U.S. dollar, 0.09 6.4984. ** The largest percentage gainers in the main Shanghai Composite index were Shanghai Jiaoda Onlly Co Ltd up 10.06 percent, followed by Shanghai U9 Game Co Ltd gaining 10.01 percent and Easysight Supply Chain Management Co Ltd up by 9.98 percent. ** The largest percentage losses in the Shanghai index were Jiangsu Protruly Vision Technology Group Co Ltd down 4.97 percent, followed by BOCO Inter-Telecom Co Ltd losing 4.94 percent and Ningxia Xinri Hengli Steel Wire Rope Co Ltd down by 4.92 percent. ** So far this year, the Shanghai stock index is up 3.09 percent, the CSI300 is up 3.9 percent, while China’s H-share index listed in Hong Kong is up 4.5 percent. ** About 19.15 billion shares were traded on the Shanghai exchange, roughly 123.3 15.53 billion shares a day. The volume in the previous trading session was 23.62 billion. ** As of 07:01 GMT, China’s 27.14 ** The Shanghai stock index is above its 50-day moving average and above its 200-day moving average. ** The price-to-earnings ratio of the Shanghai index was 15.35 as of the last full trading day while the dividend yield was 1.9 percent. ** So far this week, the market capitalisation of the Shanghai stock index has risen by 0.51 percent to 29.86 trillion yuan. (Reporting by Shanghai Newsroom)\n ", "external_links": [], "published": "2018-01-09T09:14:00.000+02:00", "crawled": "2018-01-09T09:47:49.801+02:00", "highlightTitle": ""}