{"organizations": [], "uuid": "c1dff5d8aaf83cce27d55cfe3b0e847824db7b68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218736127&w=1200&r=LYNXMPEE0104W", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-russia-energy-production/russian-daily-oil-production-up-in-december-idUSKBN1ER08T", "country": "US", "domain_rank": 408, "title": "Russian daily oil output edges up in 2017 to 30-year high", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T13:44:00.000+02:00", "replies_count": 0, "uuid": "c1dff5d8aaf83cce27d55cfe3b0e847824db7b68"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-russia-energy-production/russian-daily-oil-production-up-in-december-idUSKBN1ER08T", "ord_in_thread": 0, "title": "Russian daily oil output edges up in 2017 to 30-year high", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - Russian oil production has continued to grow in 2017, with average daily output at a 30-year high of 10.98 million barrels per day, though the pace of growth slowed from 2016 because of the country’s participation in an OPEC-led global supply pact.\nThe Middle East-dominated Organization of the Petroleum Exporting Countries and other leading oil producers agreed to cut their combined oil production by almost 1.8 million barrels per day (bpd) from the start of 2017 to prop up prices.\nRussia said it would cut its output by 300,000 bpd from the 30-year monthly high of 11.247 million bpd hit in October 2016 and achieved the targeted cut by the second quarter.\nOPEC and Russia have subsequently agreed to extend the cuts for the whole of 2018.\nRussian energy ministry data showed that oil and gas condensate production stood at 10.95 million bpd in December, up from 10.94 million bpd in November.\nIn tonnes, oil output rose to 46.322 million last month from 44.782 million in November, lifted by a 0.2 percent rise in output at leading oil company Rosneft\nFor the whole of 2017, the average output of 10.98 million bpd compared with 10.96 million bpd in 2016 and 10.72 million bpd in 2015.\nIn tonnes, Russian oil output reached 546.8 million last year, against 547.5 million tonnes in 2016, which was one day longer. Reuters uses the barrel to tonnes ratio of 7.33 to 1.\nRussian Energy Minister Alexander Novak has said that 2018 oil production is expected to stay at 547 million tonnes if the cuts last until the end of the year, as agreed.\n“Output is likely to hold around current levels following the recent decision by OPEC and non-OPEC producers to extend the cuts to the end of 2018,” the International Energy Agency (IEA) said in its December review.\nOil markets have been supported by a year of production cuts and strong demand from China. For 2017, the oil price has risen by 20 percent to about $67 a barrel.\nOnly rising U.S. production, which is on the verge of breaking through 10 million bpd, is weighing on the price outlook for 2018.\nNatural gas production in Russia was at 63.5 billion cubic metres (bcm) last month, versus 60.6 bcm in November.\nReporting by Vladimir Soldatkin; Editing by David Goodman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-02T13:44:00.000+02:00", "crawled": "2018-01-02T18:15:06.005+02:00", "highlightTitle": ""}