{"organizations": [], "uuid": "3146020d1851116b8b3570db932e15e14e07629e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-surgery-partners-announces-appointment-of-wayne-s-deveydt-as-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Surgery Partners Announces Appointment of Wayne S. DeVeydt as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T15:00:00.000+02:00", "replies_count": 0, "uuid": "3146020d1851116b8b3570db932e15e14e07629e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-surgery-partners-announces-appointment-of-wayne-s-deveydt-as-chief-executive-officer.html", "ord_in_thread": 0, "title": "Surgery Partners Announces Appointment of Wayne S. DeVeydt as Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "wayne s. deveydt", "sentiment": "negative"}, {"name": "wayne", "sentiment": "none"}, {"name": "o’reilly", "sentiment": "none"}, {"name": "deveydt", "sentiment": "none"}, {"name": "adlerz", "sentiment": "none"}, {"name": "clifford adlerz", "sentiment": "none"}, {"name": "wayne deveydt devin o’reilly", "sentiment": "none"}], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}], "organizations": [{"name": "board", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NASHVILLE, Tenn., Jan. 05, 2018 (GLOBE NEWSWIRE) -- Surgery Partners, Inc. (NASDAQ:SGRY) (the “Company”), a leading healthcare services company, today announced the appointment of Wayne S. DeVeydt as Chief Executive Officer and member of the Board of Directors, effective immediately. Mr. DeVeydt succeeds Clifford Adlerz, who was named as Interim Chief Executive Officer in September. Mr. Adlerz will maintain his position as a Director on the Board.\nWayne DeVeydt\nDevin O’Reilly, Chairman of the Company’s Board of Directors, said, “We are thrilled to welcome Wayne to the Surgery Partners family. The Board of Directors and I are confident that he is the right person to lead Surgery Partners into its next phase of growth. His significant experience and positive track record in overseeing and integrating large, diversified businesses, coupled with his strategic vision and strong capital markets and M&A experience, make Wayne the right leader for Surgery Partners.”\nMr. O’Reilly continued, “On behalf of the entire Board, I would like to express our gratitude to Cliff for his leadership over the past few months while we’ve worked diligently to find the best long-term candidate for the job. His steady hand and commitment to Surgery Partners and its patients, payors, and providers is commendable, and we look forward to continuing to draw on his strategic insights as a colleague on the Board.”\nMr. DeVeydt brings more than twenty years of operational and strategic experience as well as strong financial oversight and acumen. For nearly a decade, he served as the Executive Vice President and Chief Financial Officer of Anthem, Inc., overseeing the financial operations associated with the company’s over $82 billion in annual revenues. During his tenure at Anthem, he also held numerous other leadership roles including Chief Strategy Officer, Chief Accounting Officer, and Chief of Staff to the Chairman and Chief Executive Officer. Prior to his work at Anthem, Mr. DeVeydt was a partner with PricewaterhouseCoopers, the multinational accounting and consulting firm, with a focus on the managed care and healthcare sector across the United States. He currently serves on the Board of Directors of NiSource, Inc. and Myovant Sciences, Ltd. He received a B.S. in business administration from the University of Missouri in St. Louis.\nMr. DeVeydt stated, “It is an exciting time to join such a strong, high-growth business that is uniquely positioned to capitalize on current favorable industry trends. As the leading independent short stay surgical company, Surgery Partners is on the right side of the health care equation: higher quality and lower costs. Having worked on the payor side of the aisle for over a decade, I look forward to incorporating my experiences and deploying win-win strategies to benefit patients, physicians, and payors. I believe there are numerous opportunities to create meaningful shareholder value over the near and long term. I look forward to working with the leadership team to achieve operational improvements, accelerate same-facility case growth, and act on accretive tuck-in acquisitions that leverage the true earnings power of a larger, integrated organization.”\nMr. DeVeydt continued, “Furthermore, I’d like to thank Cliff for his insight and stewardship these past few months, and look forward to continuing to collaborate with him as a mentor and fellow member of the Board. I am excited to learn from the entire talented Surgery Partners team as we work together to capitalize on the many growth opportunities ahead to create value for all of our stakeholders.”\nAbout Surgery Partners, Inc.\nHeadquartered in Brentwood, Tennessee, Surgery Partners is a leading healthcare services company with a differentiated outpatient delivery model focused on providing high quality, cost effective solutions for surgical and related ancillary care in support of both patients and physicians. Founded in 2004, Surgery Partners is one of the largest and fastest growing surgical services businesses in the country, with more than 150 locations in 29 states, including ambulatory surgery centers, surgical hospitals, a diagnostic laboratory, multi-specialty physician practices and urgent care facilities.\nForward-Looking Statements\nThis press release contains forward-looking statements, including those regarding growth and value creating opportunities, expectations regarding industry trends and our ability to capitalize on those trends and other similar statements. These statements can be identified by the use of words such as “believes,” “anticipates,” “expects,” “intends,” “plans,” “continues,” “estimates,” “predicts,” “projects,” “forecasts,” and similar expressions. All forward looking statements are based on current expectations and beliefs as of the date of this release and are subject to risks, uncertainties and assumptions that could cause actual results to differ materially from those discussed in, or implied by, the forward-looking statements, including but not limited to, the risks identified and discussed from time to time in the Company’s reports filed with the SEC, including the Company’s Quarterly Report on Form 10-Q for the quarterly period ended September 30, 2017, filed on November 9, 2017. Except as required by law, the Company undertakes no obligation to revise or update publicly any forward-looking statements to reflect events or circumstances after the date of this report, or to reflect the occurrence of unanticipated events or circumstances.\nInvestors:\nFTI Consulting\n(615) 234-8940\nIR@surgerypartners.com\nMedia:\nFTI Consulting\n(212) 850-5681\nsurgerypartners@fticonsulting.com\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/23372238-6c08-4de0-a039-8972df0c6fde\nSource:Surgery Partners, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/d0188456-e6d3-48f9-8479-b40422f00e4c", "http://www.globenewswire.com/NewsRoom/AttachmentNg/23372238-6c08-4de0-a039-8972df0c6fde", "https://www.globenewswire.com/Tracker?data=aZt31uU4w-ZPgNGJji0Oj9d74mLlnS5QDkeKM-BMvimBCkrv8CiDd8A73kUuv1eXdo7KkvkSC-V-7Q8gPr19Mtmj4hqZEO1EJQQKeUcd5fihoqnd42aGyfMXU_lU18gRiY6nibekIFZaNzXviSjH2azpuHI8hz1hJZbRYOj516Q6XZrTFzZvq78F_ftnF_kNgxmU5qdF7s7_2DFUKwOqxQQk9-CMOBrkgr3TOqIcdCx6L2S2-w8wXpNH871xbOGXwUuDNesQ3CEXgy3WeVljYQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/23372238-6c08-4de0-a039-8972df0c6fde/en"], "published": "2018-01-05T15:00:00.000+02:00", "crawled": "2018-01-05T17:51:14.000+02:00", "highlightTitle": ""}