{"organizations": [], "uuid": "172e823ed870186c809e38dd7f8f9286265db2e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-technology-companies-lead-modest-pullback-in-us-stocks.html", "country": "US", "domain_rank": 767, "title": "Technology companies lead modest pullback in US stocks", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T09:27:00.000+02:00", "replies_count": 0, "uuid": "172e823ed870186c809e38dd7f8f9286265db2e6"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-technology-companies-lead-modest-pullback-in-us-stocks.html", "ord_in_thread": 0, "title": "Technology companies lead modest pullback in US stocks", "locations": [], "entities": {"persons": [{"name": "charles schwab", "sentiment": "none"}, {"name": "keurig", "sentiment": "none"}, {"name": "randy frederick", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "nasd", "sentiment": "none"}, {"name": "standard & poor", "sentiment": "none"}, {"name": "dow jones", "sentiment": "none"}, {"name": "dr. pepper snapple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A broad sell-off handed the U.S. stock market its biggest loss in more than four months Monday, pulling the major indexes below their recent record highs.\nTechnology stocks, the biggest gainers in 2017, accounted for much of the slide. Energy companies also fell as crude oil prices finished lower. Utilities and other rate-sensitive sectors declined as bond yields hit their highest level in almost four years.\nInvestors weighed the latest company earnings and deal news, including Keurig's acquisition of Dr. Pepper Snapple for $16.6 billion, including debt, and looked ahead to a busy week of corporate news and economic data.\nThe pullback followed a big rally on Friday, which gave the stock market its biggest single-day gain since March 2017.\n\"It may just be we've had a really good run and people are taking profit off the table right now,\" said Randy Frederick, vice president of trading & derivatives at Charles Schwab.\nThe Standard & Poor's 500 index fell 19.34 points, or 0.7 percent, to 2,853.53. The Dow Jones industrial average slid 177.23 points, or 0.7 percent, to 26,439.48. The Nasdaq composite lost 39.27 points, or 0.5 percent, to 7,466.51. The Russell 2000 index of smaller-company stocks gave up 9.95 points, or 0.6 percent, to 1,598.11.\nFalling stocks outnumbered rising ones almost five-to-one on the New York Stock Exchange.\nBond prices fell. The yield on the 10-year Treasury note rose to 2.70 percent, the highest level in almost four years, from 2.66 percent late Friday.\nThe prospect for stronger economic growth, both in the U.S. and abroad, has helped drive bond yields higher. As bond yields rise it puts pressure on yield-sensitive sectors: Real estate investment trusts, telecoms and utilities. The three sectors finished more than 1 percent lower Monday and are in the red for the year.\nInvestors face a busy week of potential market-moving corporate news and economic data the rest of this week. Several big-name companies are due to report quarterly results on Wednesday and Thursday, including Apple, Amazon, Microsoft, Facebook and Google's parent company Alphabet.\n\"Combined, that's 14.3 percent of the entire S&P 500 index in five companies -- $3.6 trillion in market cap -- so this is a very important week,\" said Mike Baele, senior portfolio manager at U.S. Bank Private Wealth Management.\nAbout a quarter of the companies in the S&P 500 have reported results so far this earnings season, and some 65 percent of those have delivered results that exceeded financial analysts' expectations, according to S&P Global Market Intelligence.\nOn Monday, Lockheed Martin added 1.9 percent after the defense contractor reported better-than-expected quarterly results. The stock rose $6.52 to $351.42.\nApple fell 2.1 percent amid growing investor worries that the iPhone X has not been a hit with customers. Shares in the technology giant have been declining for several days, erasing billions of the company's market capitalization. The stock shed $3.55 to $167.96. Apple is scheduled to report its earnings Thursday.\nBeyond earnings, the market will be sizing up new data on U.S. jobs, manufacturing and consumer sentiment this week.\nThe Commerce Department said Monday that consumer spending rose 0.4 percent in December, a solid though slower pace than in November.\nAlso on investors' radar: Tuesday night's State of the Union address and a two-day meeting of the Federal Reserve's policymaking committee that wraps up Wednesday.\nThe Fed has signaled it expects to raise its key short-term interest rate three times this year. But some investors speculated that the growing strength in the U.S. economy and labor market could prompt the central bank to perhaps forecast an extra rate increase this year.\nAs for President Donald Trump's address to the nation, investors will be listening for any insights on U.S. trade policy, Baele said.\n\"This is one of the few prepared speeches that the president will give, so the progress on NAFTA and trade with China is something the market is going to watch carefully,\" Baele said.\nTraders welcomed a crop of corporate deals Monday.\nDr. Pepper Snapple Group vaulted 22.4 percent after it agreed to be acquired by Keurig for $16.6 billion, including debt. The deal would create a beverage giant with about $11 billion in annual sales and a stable of brands including Dr. Pepper, 7UP, Snapple, A&W, Mott's, Sunkist and Keurig's single-serve coffee makers. Dr. Pepper Snapple added $21.42 to $117.07.\nKapStone Paper and Packaging Corp. soared 30.8 percent after it agreed to be bought by rival WestRock for $35 a share, or $3.39 billion. KapStone shares gained $8.17 to $34.71. WestRock slid $1.86, or 2.6 percent, to $68.41.\nBenchmark U.S. crude fell 58 cents, or about 1 percent, to settle at $65.56 a barrel on the New York Mercantile Exchange. Brent crude, used to price international oils, dropped $1.06, or 1.5 percent, to close at $69.46 per barrel.\nGold, which hit an 18-month high last week, fell $11.80 to $1,340.30 an ounce. Silver dropped 31 cents, or 1.8 percent, to $17.13 an ounce. Copper slipped 1 cent to $3.19 a pound.\nThe dollar, which fell sharply last week, rose to 108.94 yen from 108.66 late Friday. The euro fell to $1.2389 from $1.2423.\nThe price of bitcoin fell 4.2 percent Monday to $11,207, according to the tracking site CoinDesk. Bitcoin futures on the Cboe Futures Exchange rose 2.1 percent to $11,170.\nIn other futures trading, wholesale gasoline was little changed at $1.9 a gallon. Heating oil slid 3 cents to $2.11 a gallon. Natural gas rose 13 cents, or 3.6 percent, to $3.63 per 1,000 cubic feet.\nGermany's DAX and France's CAC 40 fell 0.1 percent Monday. Britain's FTSE 100 added 0.1 percent. Japan's benchmark Nikkei 225 finished flat, while Hong Kong's Hang Seng index lost 0.6 percent. South Korea's Kospi gained 0.9 percent.", "external_links": [], "published": "2018-01-29T09:27:00.000+02:00", "crawled": "2018-01-30T00:42:22.022+02:00", "highlightTitle": ""}