{"organizations": [], "uuid": "23acce8727a3a3438bcfa3c126dbd61fd1e98bba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/06/23/103739474-GettyImages-533689304.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/15839069/device/rss/rss.html", "section_title": "Investing", "url": "https://www.cnbc.com/2018/01/23/goldman-new-washer-could-be-as-much-as-20-percent-pricier-because-of-trump-tariff.html", "country": "US", "domain_rank": 767, "title": "Goldman: New washer could be as much as 20% pricier because of Trump tariff", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T22:16:00.000+02:00", "replies_count": 0, "uuid": "23acce8727a3a3438bcfa3c126dbd61fd1e98bba"}, "author": "Thomas Franck", "url": "https://www.cnbc.com/2018/01/23/goldman-new-washer-could-be-as-much-as-20-percent-pricier-because-of-trump-tariff.html", "ord_in_thread": 0, "title": "Goldman: New washer could be as much as 20% pricier because of Trump tariff", "locations": [], "entities": {"persons": [{"name": "dona", "sentiment": "neutral"}, {"name": "goldman", "sentiment": "neutral"}, {"name": "samuel eisner", "sentiment": "none"}, {"name": "eisner", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "goldman sachs", "sentiment": "none"}, {"name": "goldman", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Americans could see the price of new washing machines soar in the next year thanks to President Donald Trump's new tariffs on appliance imports, according to Goldman Sachs.\nThe bank is now forecasting an 8 percent to 20 percent increase in the price of a new washing machine in the next year, depending on how much of the tax is passed on to U.S. consumers. The tariff also includes a tax on machine parts, which could drive some costs higher for domestic manufacturers as well.\n\"This calculation assumes that tariff costs will be partly absorbed by international suppliers and/or offset by other operational or supply chain initiatives which would impact the flow through from tariffs to domestic pricing,\" Goldman analyst Samuel Eisner wrote on Tuesday.\nshow chapters Trump approves tariffs on laundry machine and solar panel imports 5 Hours Ago | 02:04 The Trump administration announced Monday it will impose a 20 percent tariff on the first 1.2 million imported large residential washing machines in the first year and a 50 percent tariff on machines above that number.\nFor his part, Eisner expects the same level of imports in 2018 as in years past, around 3.4 million washing machines. His assumption implies an effective tariff rate of roughly 40 percent, and if international suppliers pass along half the cost of the tariff, Americans could wind up shelling out a premium.\nStill, the move is being lauded by U.S.-based appliance manufacturer Whirlpool , which has long lobbied for more protective measures against its Asian rivals.\n\"This is a victory for American workers and consumers alike,\" Whirlpool Chairman Jeff Fettig said in a press release Monday. \"This announcement caps nearly a decade of litigation and will result in new manufacturing jobs in Ohio, Kentucky, South Carolina and Tennessee.\"\nThe company added 200 new full-tine positions at its manufacturing plant in Clyde, Ohio in anticipating increased demand following a tariff decision.\nShares of Whirlpool were up 3.7 percent Tuesday.\nBut Whirlpool's rivals – including South Korean electronics makers Samsung and LG – were disappointed with Trump's decision, arguing that the market should be the ultimate determinant of prices.\n\"We are very disappointed in this misguided decision, which far exceeds what the expert agency recommended,\" said LG on Tuesday. \"This is a textbook case about how certain companies can game the process to use trade laws to try to accomplish what they can't accomplish in the marketplace.\"\nDisclaimer", "external_links": [], "published": "2018-01-23T22:16:00.000+02:00", "crawled": "2018-01-23T21:34:06.004+02:00", "highlightTitle": ""}