{"organizations": [], "uuid": "d817c1946d3f0d16fa01b7d175b5322dd6e78420", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/global-economy-fdi/u-s-britain-led-surprise-fall-in-global-fdi-last-year-u-n-data-shows-idINKBN1FB2J3", "country": "US", "domain_rank": 408, "title": "U.S., Britain led surprise fall in global FDI last year, U.N. data shows", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T20:16:00.000+02:00", "replies_count": 0, "uuid": "d817c1946d3f0d16fa01b7d175b5322dd6e78420"}, "author": "", "url": "https://in.reuters.com/article/global-economy-fdi/u-s-britain-led-surprise-fall-in-global-fdi-last-year-u-n-data-shows-idINKBN1FB2J3", "ord_in_thread": 0, "title": "U.S., Britain led surprise fall in global FDI last year, U.N. data shows", "locations": [], "entities": {"persons": [{"name": "tom miles", "sentiment": "none"}, {"name": "james zhan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "u.n.", "sentiment": "negative"}, {"name": "min read  geneva", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "fdi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "unctad", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GENEVA (Reuters) - Global foreign direct investment (FDI) fell by 16 percent in 2017 to an estimated $1.52 trillion, a surprise downturn led by steep reversals in Britain and the United States, United Nations data showed on Monday.\nFDI, which largely comprises cross-border mergers and acquisitions and investment in start-up projects abroad, is a bellwether of globalisation and a potential sign of growth of corporate supply chains and future trade ties.\nBut it can also go into reverse as companies pull investments out of foreign projects or repatriate earnings.\n“We had called a modest recovery in 2017, but it was not the case. It declined by 16 percent, a big decline,” James Zhan, investment chief at UNCTAD, the U.N.’s trade and development agency told a news conference.\n“This is in striking contrast with the other macroeconomic variables such as global GDP and trade growth, which saw substantial improvements in 2017.”\nFDI going into the United States fell by a third to $310 billion.\nFlows into Britain, where there is business uncertainty about the future because of its decision to quit the European Union, shrank by 90 percent to $19.4 billion. This did come against unprecedented investment in 2016 led by some mega-deals, however.\nOverall flows into China rose by 8 percent to reach a record $144 billion, although Zhan said multinational firms had also restructured and made significant divestments in China, which would have reduced the total stock of net FDI in China.\nThe figures are preliminary but the overall trends are likely to be borne out in the final data, he said.\nUP NEXT The outlook for 2018 is cloudy. Global FDI may recover to the 2016 level as the global economy grows, but there are geopolitical risks and uncertainty over policy, including the impact of U.S. tax reforms, Zhan said.\nThe net flow of FDI into the United States would be cut by remittances, such as Apple’s announcement last week that it would repatriate $38 billion, but it should also be boosted by investment attracted by U.S. tax cuts, he said.\nThe UNCTAD figures also showed announcements of new foreign-owned “greenfield” projects in developing countries appeared to have slumped in 2017, retreating from a bumper 2016.\nInvestors may have held back, anticipating a rise in U.S. interest rates, and longer-term trends may be at work.\n“The world economy is transforming into the digital era,” Zhan said. “Foreign investment becomes asset lighter, and in terms of numbers also smaller.”\nManufacturing companies were also increasingly leasing their equipment rather than buying it, so it does not show up as FDI, Zhan said.\nReporting by Tom Miles Editing by Jeremy Gaunt.\n ", "external_links": [], "published": "2018-01-22T20:16:00.000+02:00", "crawled": "2018-01-22T20:31:53.013+02:00", "highlightTitle": ""}