{"organizations": [], "uuid": "93ec2fe1464e829b6e8f207ad1f61c3e00650fe3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/term-sheet-tuesday-january-30/", "country": "US", "domain_rank": 1196, "title": "Term Sheet -- Tuesday, January 30 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.142, "site_type": "news", "published": "2018-01-30T12:07:00.000+02:00", "replies_count": 0, "uuid": "93ec2fe1464e829b6e8f207ad1f61c3e00650fe3"}, "author": "Polina Marinova", "url": "http://fortune.com/2018/01/30/term-sheet-tuesday-january-30/", "ord_in_thread": 0, "title": "Term Sheet -- Tuesday, January 30 | Fortune", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "emeryville", "sentiment": "none"}], "organizations": [{"name": "s2g ventures", "sentiment": "none"}, {"name": "new enterprise associates", "sentiment": "none"}, {"name": "euclidean capital", "sentiment": "none"}, {"name": "accel", "sentiment": "none"}, {"name": "standard industries", "sentiment": "none"}, {"name": "goldman sachs, fall line capital", "sentiment": "none"}, {"name": "khosla ventures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\n• Uber’s Indian Rival Ola Expands Beyond Its Home Market for the First Time VENTURE DEALS \n• Ripple Foods , an Emeryville, Calif.-based maker of plant-based dairy alternatives, raised $65 million in Series C funding. Euclidean Capital led the round, and was joined by investors including Goldman Sachs, Fall Line Capital, GV, Prelude Ventures, S2G Ventures and Khosla Ventures. \n• BrowserStack , an India-based web and mobile browser testing platform, raised $50 million in Series A funding. Investors include Accel. \n• Tyto Care, a New York City and Israel-based telehealth company, raised $25 million in funding. Ping An Global Voyager Fund led the round. \n• HOVER , a San Francisco-based platform that uses computer vision and deep learning to create photos into a customizable 3D model of a home, raised $25 Million Series B funding. GV led the round, and was joined by investors including Home Depot and Standard Industries. \n• Logikcull , a San Francisco-based provider of legal intelligence software, raised $25 million in funding. New Enterprise Associates led the round with participation from return backers OpenView Venture Partners and Storm Ventures. \n• Drop , a Canada-based rewards app that enables consumers to earn rewards, raised $21 million in Series A funding. NEA led the round, and was joined by investors including Sierra Ventures, White Star Capital, ff Venture Capital, Portag3 Ventures, and Silicon Valley Bank. \n• NEXT Trucking , a Los Angeles, Calif.-based trucker-centric online marketplace that connects carriers with shippers, raised $21 million in Series B funding. Sequoia Capital led the round. \n• BehavioSec , a Sweden-based provider information security solutions for IT organizations, raised $17.5 million in Series B funding. Trident Capital Cybersecurity led the round, and was joined by investors including Cisco Investments and ABN AMRO . Existing investors Octopus Ventures and Conor Venture Partners also participated. \n• Busbud , a Montreal-based travel booking platform, raised $11 million in Series B funding. iNovia Capital led the round, and was joined by investors including Teralys, Claridge and Plaza Ventures. Existing investor Real Ventures also participated in the round. \n• Xperiel , a Sunnyvale, Calif.-based developer of the Real World Web (RWW) platform, raised $7 million in Series A funding. Investors include Scott Cook , Founders Fund , WTI and the Sacramento Kings. \n• Cake Technologies, Inc , a mobile web browser, raised $5 million in pre-Series A funding. Peak Ventures led the round, and was joined by investors including Pelion Venture Partners and Kickstart Seed Fund. \n• FreeWire Technologies Inc , a San Leandro, Calif.-based manufacturer of mobile rapid charging systems for electric vehicles, raised $5 million in funding. Investors include BP Ventures . \n• Aquabyte , a San Francisco-based company applying computer vision and machine learning models to optimize fish farming efficiency, raised $3.5 million in seed funding. Costanoa Ventures and New Enterprise Associates led the round. \n• Mush , a London-based social media platform for mothers, raised £2 million ($2.8 million) in funding. Investors include Octopus Ventures and Mustard Seed. PRIVATE EQUITY DEALS \n• New MainStream Capital recapitalized Anne Arundel Dermatology Management , a Severna Park, Md.-based dermatology practice. Financial terms weren’t disclosed. Pantheon also participated in the transaction and has acquired a minority ownership stake in ADM; however, NMS remains as the lead and control investor. \n• KLD Discovery , a McLean, Virginia-based provider of technology-enabled services and software for law firms and corporations, raised funding of an undisclosed amount. Investors include WestView Capital Partners and existing backers Revolution Growth and the Carlyle Group. \n• Wind Point Partners and portfolio company GF Assets Holdings Corporation acquired California Natural Products , a Lathrop, Calif.-basedaseptic packager of dairy-based and dairy alternative beverages. Financial terms weren’t disclosed. OTHER DEALS \n• Digi International acquired Accelerated Concepts Inc , a Tampa, Fla.-based provider of enterprise wireless cellular network data hardware, for approximately $17 million in cash with a potential for future earn-out consideration based on top line performance. IPOs \n• IPSCO Tubulars , the Houston-based subsidiary of Russian pipemaker TMK, said it plans to raise $500 million in an offering of 23.3 million shares (68% insider) priced between $20 to $23. BofA Merrill Lynch, Morgan Stanley, J.P. Morgan, UBS Investment Bank, Citi, Credit Suisse, Barclays and Evercore ISI are joint bookrunners in the deal. The firm plans to list on the NYSE as “IPSC.” \n• Victory Capital Holdings , a Brooklyn, Ohio-based asset management firm, said it plans to raise $211 million in an offering of 11.7 million shares between $17 to $19 a piece. Crestview GP and Reverence Capital Partners back the company. J.P. Morgan, BofA Merrill Lynch, Morgan Stanley, Barclays, Goldman Sachs and RBC Capital Markets are joint bookrunners inn the deaI. The firm plans to list on the Nasdaq as “VCTR.” \n• Quintana Energy , a Houston, Texas-based oil and gas services provider, says it plans to raise $125 million by offering 9.3 million shares priced between $12 to $15 a piece. In 2016, the company booked loss of 11.7 million on revenue of $210.4 million. Merrill Lynch, Pierce, Fenner & Smith as well as Piper Jaffray are representing the underwriters. It plans to list on the NYSE as “QES.” \n• Cardlytics , an Atlanta-based credit carded data firm, said it plans to raise $76 million in an offering of 5.4 million shares priced between $13 to $15. BofA Merrill Lynch, J.P. Morgan, Wells Fargo Securities, and SunTrust Robinson Humphrey are joint bookrunners in the deal. The firm plans to list on the Nasdaq as “CDLX.” \n• Evolus , an Irvine, Calif.-based maker of a Botox rival, said it plans to raise $65 million in an IPO of 5 million shares priced between $12 to $14 a piece. Alphaeon Corporation (100% pre-offering) backs the firm. Cantor and Mizuho are underwriting the deal. The company plans to list on the Nasdaq as “EOLS.” \n• Entera Bio , a Jerusalem-based oral drug maker for thyroid conditions, postoned its IPO. Previously, the company said it planned to offer 5 million shares priced between $10 to $12 a share, raising $55 million. In 2016, the company posted loss of $5.4 million. D.N.A Biomedical Solutions (43.7% pre-offering), Centellion Fund (21.1%) and Pontifax (8.9%) back the company. Oppenheimer & Co. is sole underwriter in the deal. The company plans to list on the Nasdaq as “ENTX.” \n• Sky Bet , a Leeds, U.K.-based betting firm, has filed Rothschild in preparation of an IPO, Reuters reports. The firm plans to list in London. CVC backs the firm. Read more . EXITS \n• Avaya Holdings Corp agreed to acquire Seattle-based Spoken Communications , a Seattle-based provider of contact center as a service solutions. Financial terms weren’t disclosed. Spoken had raised approximately $58.2 million in venture funding from investors including Riverwood Capital and Ignition Partners. \n• American Express will acquire Mezi , a Sunnyvale, Calif.-based AI-powered personal travel assistant app. Financial terms weren’t disclosed. Mezi had raised approximately $11.8 million in funding from investors including Nexus Venture Partners and American Express Ventures. \n• Microsoft acquired PlayFab , a Seattle-based provider of backend platform with services to build cloud-connected games. Financial terms weren’t disclosed. PlayFab had raised approximately $13 million in funding from investors including Madrona Venture Group, Benchmark, and Startup Capital Ventures. \n• Blackstone Group LP is in talks to buy a 55% stake in Thomson Reuters Corp.’s largest unit, which supplies data and analytical tools to financial professionals. The division is worth about $20 billion, according to Reuters. Read more. FIRMS + FUNDS \n• Humanity United , a Washington D.C.-based foundation, raised $23 million for an early-stage venture fund, Working Capital. PEOPLE \n• Ken Chenault joined General Catalyst as chairman and a managing director. SHARE TODAY'S TERM SHEET \nPolina Marinova produces Term Sheet, and Lucinda Shen compiles the IPO news. Send deal announcements to Polina and IPO news to Lucinda . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-30T12:07:00.000+02:00", "crawled": "2018-01-30T18:50:15.003+02:00", "highlightTitle": ""}