{"organizations": [], "uuid": "c7b1c767ad25b93dbabf4648fa7c07840e79d83c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-a-c-moore-appoints-new-president.html", "country": "US", "domain_rank": 767, "title": "A.C. Moore Appoints New President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T22:16:00.000+02:00", "replies_count": 0, "uuid": "c7b1c767ad25b93dbabf4648fa7c07840e79d83c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-a-c-moore-appoints-new-president.html", "ord_in_thread": 0, "title": "A.C. Moore Appoints New President", "locations": [], "entities": {"persons": [{"name": "a.c. moore", "sentiment": "negative"}, {"name": "anthony pipe", "sentiment": "negative"}, {"name": "pepe piperno", "sentiment": "none"}, {"name": "anthony piperno", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "n.j.", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN, N.J., A.C. Moore has announced the appointment of Anthony Piperno as President of the arts and crafts specialty retailer, which operates 135 locations along the East Coast as well as global offices in the U.S. and Asia. He will assume responsibilities on Jan. 16, succeeding long-time leader and industry pioneer Pepe Piperno, who has both championed and sculpted the arts and crafts marketspace for the past 55 years. Pepe Piperno will remain actively involved in the company as Chairman and CEO, consulting on long-term strategy and leveraging his extensive industry expertise and knowledge.\nSince joining the company in 2005, Anthony Piperno has led A.C. Moore's merchandising team, overseeing product development, global sourcing and store operations. Together with Pepe Piperno, the duo has positioned the company on the leading edge of creative innovation, revolutionizing the brand and developing products to enhance the craft experience. In November, under Anthony Piperno's leadership, the company announced two major investments; the acquisition of leading online arts and craft retailer Blitsy, and a major investment and exclusive partnership with handcraft marketplace Zibbet. The investments position the company for groundbreaking digital expansion, including the redesign and relaunch of acmoore.com , and set the stage for an unprecedented omni-channel experience for the creative consumer.\n\"I am honored to follow in the footsteps of such an exceptional leader and role model,\" said Anthony Piperno. \"It is a privilege to be part of an organization filled with such dedicated and talented individuals. I plan to deliver on the shared vision that we have established, and take A.C. Moore to the forefront of creative consumers worldwide.\"\n\"I am thrilled to pass the torch and watch Anthony drive the company we love to the next level,\" said Pepe Piperno. \"We've selected a very strong leader at a time when A.C. Moore is in a prime position for growth. He brings a dynamic mix of leadership, operational excellence and passion to his new role. This, combined with Anthony's industry knowledge and acumen, make him uniquely qualified to lead A.C. Moore into the future.\"\nAbout A.C. Moore: Established in Moorestown, N.J. in 1985, A.C. Moore is devoted to being the first choice for product selection, value and service that inspires and fulfills unlimited creative possibilities. For more information, visit www.acmoore.com/about .\nMEDIA CONTACT:\nAnastasia Barbalios\n856.768.4930 x399\nabarbalios@acmoore.com\n with multimedia: releases/ac-moore-appoints-new-president-300583393.html\nSOURCE A.C. Moore", "external_links": ["http://www.acmoore.com/about", "http://www.prnewswire.com/news-releases/ac-moore-appoints-new-president-300583393.html"], "published": "2018-01-16T22:16:00.000+02:00", "crawled": "2018-01-17T03:27:20.016+02:00", "highlightTitle": ""}