{"organizations": [], "uuid": "8e4852ac9dfcf7369c6547529335fefbc3bdfff4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223430984&w=1200&r=LYNXMPEE0I1LB", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-football-nfl-nep-brady/patriots-brady-wont-discuss-hand-injury-idUSKBN1F82JK", "country": "US", "domain_rank": 408, "title": "Patriots' Brady won't discuss hand injury", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:09:00.000+02:00", "replies_count": 0, "uuid": "8e4852ac9dfcf7369c6547529335fefbc3bdfff4"}, "author": "", "url": "https://www.reuters.com/article/us-football-nfl-nep-brady/patriots-brady-wont-discuss-hand-injury-idUSKBN1F82JK", "ord_in_thread": 0, "title": "Patriots' Brady won't discuss hand injury", "locations": [], "entities": {"persons": [{"name": "frank pingue", "sentiment": "negative"}, {"name": "brady", "sentiment": "negative"}, {"name": "tom brady", "sentiment": "none"}], "locations": [{"name": "new england", "sentiment": "none"}], "organizations": [{"name": "jacksonville jaguars", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "new england patriots", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - New England Patriots quarterback Tom Brady declined to discuss his injured hand on Friday or say if it would keep him from playing in Sunday’s AFC Championship game where a Super Bowl berth is on the line.\nThe five-times Super Bowl champion, who injured his right throwing hand during practice on Wednesday, had a chance to shed some light on what has become the biggest story of the week in New England but decided to keep everyone guessing.\n“Not talking about it,” Brady, 40, told reporters when asked how his hand felt. He repeated the same answer when asked if he threw a football at Friday’s practice.\nAsked if he was confident that he would play against the visiting Jacksonville Jaguars, Brady simply said: “We’ll see.”\nMedia reports said Brady injured his hand when a team mate ran into him at practice. While the injury is not considered serious, Brady did not practice on Thursday and canceled his media availability that day.\nBrady also gave away very little when asked if he had played in greater pain than he was currently experiencing.\nJan 17, 2018; Foxborough, Massachussetts, USA; New England Patriots head coach Bill Belichick talks with quarterback Tom Brady (12) during practice before the AFC Press Conference at Gillette Stadium. Mandatory Credit: Greg M. Cooper-USA TODAY Sports “I’ve played in a lot of games with pain,” he said.\nEarlier, Patriots head coach Bill Belichick was just as tight-lipped when asked if Brady would be a game-time decision for Sunday, saying only: “Today is Friday.”\nJan 17, 2018; Foxborough, Massachussetts, USA; New England Patriots quarterback Tom Brady (12) talks with quarterback Brian Hoyer (2) during practice before the AFC Press Conference at Gillette Stadium. Mandatory Credit: Greg M. Cooper-USA TODAY Sports Brady has appeared on the defending champion Patriots’ injury report since late in the regular season but has not missed a game due to injury since 2008.\n“We’re going to continue to get ready for Jacksonville all the way through until game time,” said Belichick.\nBut Jaguars head coach Doug Marrone said he was not reading much into the storylines surrounding Brady and fully expected the two-times NFL Most Valuable Player to feature on Sunday.\n“Tommy will play. We know that,” said Marrone.\nReporting by Frank Pingue in Toronto; Editing by Christian Radnedge and Ken Ferris\n ", "external_links": [], "published": "2018-01-19T22:09:00.000+02:00", "crawled": "2018-01-19T22:23:24.017+02:00", "highlightTitle": ""}