{"organizations": [], "uuid": "3f5b89b66991bab1b3d5bceea29b909de6190f87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226969175&w=1200&r=LYNXMPEE0U12C", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-economy/u-s-private-payrolls-growth-maintains-brisk-pace-labor-costs-rise-in-fourth-quarter-idUSKBN1FK228", "country": "US", "domain_rank": 408, "title": "WRAPUP 1-U.S. private payrolls growth maintains brisk pace; labor costs rise in Q4", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:13:00.000+02:00", "replies_count": 0, "uuid": "3f5b89b66991bab1b3d5bceea29b909de6190f87"}, "author": "", "url": "https://www.reuters.com/article/us-usa-economy/u-s-private-payrolls-growth-maintains-brisk-pace-labor-costs-rise-in-fourth-quarter-idUSKBN1FK228", "ord_in_thread": 0, "title": "WRAPUP 1-U.S. private payrolls growth maintains brisk pace; labor costs rise in Q4", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "adp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 2:31 PM / Updated 18 minutes ago U.S. private payrolls rise strongly, wage growth picking up Lucia Mutikani 6 Min Read \nWASHINGTON (Reuters) - U.S. private sector payrolls rose at a brisk pace in January as hiring increased across the board despite unseasonably cold weather, pointing to sustained labor market strength at the start of the year. \nThe robust jobs market is gradually putting upward pressure on compensation, with other data on Wednesday showing a solid increase in labor costs in the fourth quarter. Tightening labor market conditions and signs of a pickup in wage growth are likely to be welcomed by Federal Reserve officials who have long expressed concern about benign inflation. \nIn a statement at the end of a two-day policy meeting on Wednesday, Fed officials said they expected annual inflation to “move up this year and to stabilize” around the U.S. central bank’s 2 percent target. \nThe Fed left its benchmark overnight interest rate unchanged. U.S. financial markets expect a rate hike in March. The U.S. central bank has forecast three rate increases this year after lifting borrowing costs three times in 2017. \n“It’s a myth that wages are not going up so the Fed doves can stop thinking there is slack in the labor market,” said Chris Rupkey, chief economist at MUFG in New York. “We now expect the Fed can lift rates four times this year and not the three rate hikes they penciled-in in December.” \nThe ADP national employment report showed private sector employment rose by 234,000 jobs in January, beating economists’ expectations for an increase of only 185,000. December’s payrolls count was revised down to 242,000 from 250,000. \nManufacturing added 12,000 jobs last month and construction payrolls increased 9,000 despite bitterly cold temperatures in many parts of the country. There were also widespread job gains in the private services sector. \nThe ADP report is jointly produced with Moody’s Analytics. It, however, has a poor record predicting the private payrolls component of the government’ more comprehensive employment report. The Department of Labor will publish January’s employment report on Friday. \nAccording to a Reuters survey of economists, nonfarm payrolls probably rose by 180,000 jobs in January after increasing 148,000 in December. The unemployment rate is forecast unchanged at a 17-year low of 4.1 percent. STRONG START \n“While we do not take the ADP employment report into our forecasting methodology for payrolls, the report nonetheless suggests job creation got off to a strong start in 2018,” said John Ryding, chief economist at RDQ Economics in New York. \nThe dollar rose against a basket of currencies following the Fed’s policy statement, while prices for U.S. Treasuries pared losses. Stocks on Wall Street were trading higher after two days of steep losses. \nIn a separate report the Labor Department said the Employment Cost Index (ECI), the broadest measure of labor costs, increased 0.6 percent in the fourth quarter after an unrevised 0.7 percent rise in the third quarter. \nThat lifted the year-on-year rate of increase to 2.6 percent, the largest gain since the first quarter of 2015, from 2.5 percent in the third quarter. \nPrivate sector wages and salaries rose 0.6 percent in the fourth quarter. They were up 2.8 percent in the 12 months through December, the biggest increase since the first quarter of 2015, and followed a 2.6 percent gain in the third quarter. \nWage growth is expected to get a boost from the strong labor market, which is forecast to hit full employment this year. Economists expect the jobless rate to hit 3.5 percent by the end of 2018. \nA $1.5 trillion tax cut package pushed through by the Trump administration and the Republican-controlled U.S. Congress in December is also expected to bolster compensation growth. The tax cut has resulted in some companies either paying out one-time bonuses or raising wages for employees. \nCompanies like Starbucks Corp ( SBUX.O ) and FedEx Corp have announced they will use some of the savings from the tax cut to boost wages for workers. \n“Today’s report is quite consistent with our view of gradually firming wage growth, which we expect to reach a sustainable pace around 2.5-3.0 percent in 2018,” said Gregory Daco, chief U.S. economist at Oxford Economics in New York. \n“We expect one-time bonuses and minimum wage increases to provide a tailwind to the ECI to start the year.” \nThe ECI is widely viewed by policymakers and economists as one of the better measures of labor market slack. It is also considered a better predictor of core inflation. Economists say labor costs need to rise by at least 3 percent to push inflation closer to the Fed’s 2 percent inflation target. \nBenefits for all workers increased 0.5 percent in the October-December quarter after rising 0.8 percent in the third quarter. They were up 2.5 percent in the 12 months through December after rising 2.4 percent in the year to September. Healthcare benefits increased 1.1 percent in 12 months through December, the smallest gain since 1995. \nA third report on Wednesday showed contracts to purchase previously owned homes increased 0.5 percent in December. These contracts become sales after a month or two and suggest moderate gains in home resales. Existing home sales have been constrained by tight supply, which is pushed up prices, making house purchases unaffordable for some first-time buyers. Reporting By Lucia Mutikani; Editing by Andrea Ricci and Chizu Nomiyama", "external_links": [], "published": "2018-01-31T16:13:00.000+02:00", "crawled": "2018-01-31T16:32:59.001+02:00", "highlightTitle": ""}