{"organizations": [], "uuid": "5f071f29296cfbcda8027e2b609a4faf465575be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222743748&w=1200&r=LYNXMPEE0G10R", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-kosovo-serbs-shooting/mourners-light-candles-for-murdered-kosovo-serb-leader-idUKKBN1F61SE", "country": "US", "domain_rank": 408, "title": "Mourners light candles for murdered Kosovo Serb leader", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:23:00.000+02:00", "replies_count": 0, "uuid": "5f071f29296cfbcda8027e2b609a4faf465575be"}, "author": "", "url": "https://uk.reuters.com/article/uk-kosovo-serbs-shooting/mourners-light-candles-for-murdered-kosovo-serb-leader-idUKKBN1F61SE", "ord_in_thread": 0, "title": "Mourners light candles for murdered Kosovo Serb leader", "locations": [], "entities": {"persons": [{"name": "branko filipo", "sentiment": "negative"}, {"name": "oliver ivanovic", "sentiment": "none"}, {"name": "ivanovic", "sentiment": "none"}], "locations": [{"name": "kosovo", "sentiment": "none"}, {"name": "mitrovica", "sentiment": "none"}, {"name": "mitrovica", "sentiment": "none"}, {"name": "ibar river", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 23 PM / Updated 25 minutes ago Mourners light candles for murdered Kosovo Serb leader Branko Filipovic 4 Min Read \nMITROVICA, Kosovo (Reuters) - More than 2,000 people gathered in Kosovo’s northern town of Mitrovica on Wednesday to pay respects to a Serb leader whose killing inflamed tensions between the neighbours. \nOliver Ivanovic, 64, was shot dead with six bullets on Tuesday in front of his party office in Mitrovica, a town bitterly divided between ethnic Serbs and Albanians. \nHe was facing a retrial over the killings of ethnic Albanians during the 1998-99 war. Serbia condemned the killing as an act of terrorism but the president declined to say whether he believed the killing was ethnically motivated. \nIvanovic came to prominence shortly after the war as one of the Mitrovica “bridge-watchers”, Serbs who sought to prevent “infiltration” by Albanians over the Ibar River bridge into the northern half of the town. \nKosovo Serbs, mainly from Mitrovica, gathered at Ivanovic’s party office on Wednesday, lighting candles before they escorted his coffin to the outskirts of the town, from where a car will take it to Belgrade where the funeral will take place. \nA Serbian Orthodox church bishop held a service before the procession left. A man holding a wooden cross with Ivanovic’s name on it led the procession through the streets of Mitrovica. \n“Every single person who wants normalcy and the city to be without crime and political crime and pressure and insecurity came to bid farewell to Oliver,” said Spomenka, 40, an office clerk, who declined to give her family name. \nAn EU-sponsored dialogue on the normalisation of ties between Serbia and Kosovo was suspended on Belgrade’s request after the killing. A Serbian official said they only would go back to negotiations once the perpetrator was brought to justice. \nThe European Union, NATO and the United States urged Serbia and its former province, which won independence a decade ago, to recommit to establishing normal relations, key for both countries to progress towards EU accession. \n“Ivanovic’s murder yesterday was a tragedy for Kosovo,” the U.S. ambassador to Kosovo, Greg Delawie, told journalists. “No one should take advantage of this crime for political ends.” Mourners cry as a cortege escorts a car carrying coffin of Oliver Ivanovic travels to the northern outskirts of Kosovska Mitrovica, Kosovo, January 17, 2018. REUTERS/Djordje Kojadinovic POLICE INVESTIGATION \nKosovo police said they had tracked down the owners of a burnt car believed to be linked to killers and were interviewing potential witnesses. No one heard shots as, according to investigators, the gunman likely used silencer. \nAutopsy results released on Wednesday showed he had been shot with six bullets. Slideshow (5 Images) \nBridge-watchers such as Ivanovic were often involved in ethnic violence in the early post-war period, after NATO air strikes drove out Serbian forces accused of killing and expelling Kosovo Albanian civilians in a counter-insurgency campaign. \nAfter the group disbanded, Ivanovic entered politics and became known for advocating dialogue and compromise with Kosovo Albanians, while still rejecting Kosovo’s sovereignty. \nIn 2016 he was sentenced to nine years in prison for killing Albanians during the 1998-99 war, but was released last year after a retrial was ordered. The retrial was ongoing. \nSerbian officials dismissed the accusations against Ivanovic and said the process against him was staged. \nFor years the north of Kosovo with up to 50,000 Serbs, functioned in a legal limbo, part of Kosovo but de facto under the control of Serbia in defiance of Kosovo’s NATO and European Union overseers. \nFlorian Bieber, Florian Bieber, a Balkans expert at the University of Graz, said the impact of Ivanovic’s murder would “depend on how it will be instrumentalised and used”. \n(This version of the story fixes spelling error in paragraph 8) Additional reporting by Alkesandar Vasovic in Belgrade and Fatos Bytyci in Pristina; Writing by Ivana Sekularac; Editing by Alison Williams", "external_links": [], "published": "2018-01-17T16:23:00.000+02:00", "crawled": "2018-01-17T16:53:50.013+02:00", "highlightTitle": ""}