{"organizations": [], "uuid": "d376182fee2032eff1e06ae70089bec054c07ad6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-servisfirst-bancshares-inc-announces-results-for-fourth-quarter-of-2017.html", "country": "US", "domain_rank": 767, "title": "ServisFirst Bancshares, Inc. Announces Results for Fourth Quarter of 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:01:00.000+02:00", "replies_count": 0, "uuid": "d376182fee2032eff1e06ae70089bec054c07ad6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-servisfirst-bancshares-inc-announces-results-for-fourth-quarter-of-2017.html", "ord_in_thread": 0, "title": "ServisFirst Bancshares, Inc. Announces Results for Fourth Quarter of 2017", "locations": [], "entities": {"persons": [{"name": "bud foshee", "sentiment": "none"}, {"name": "tom broughton", "sentiment": "none"}], "locations": [{"name": "ala.", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "servisfirst bancshares, inc", "sentiment": "neutral"}, {"name": "servisfirst bancshares, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Birmingham, Ala., Jan. 22, 2018 (GLOBE NEWSWIRE) -- ServisFirst Bancshares, Inc. (NASDAQ:SFBS), today announced earnings and operating results for the quarter and year ended December 31, 2017.\nFourth Quarter 2017 Highlights:\nDiluted EPS increased 13.2% from $1.52 to $1.72 year over year, while core diluted EPS increased 17.1% from $1.52 to $1.78 Additional tax provision from the revaluation of net deferred tax assets resulting from Tax Cuts and Jobs Act reduced diluted EPS by $0.06 in the fourth quarter of 2017 Loans and deposits increased 19% and 12%, respectively, year over year Loans and deposits increased 16% and 20%, respectively, for the fourth quarter on an annualized basis\nTom Broughton, President and CEO, said, “We are pleased to report a year of strong growth in net income and loan and deposit growth. Our business model continues to resonate with our clients because of its focus on service.” Bud Foshee, CFO, stated, “We believe we took advantage of tax law changes to the maximum advantage for our stockholders in the fourth quarter of 2017. We also continued our cost control efforts, evidenced by a consistently low efficiency ratio.”\nFINANCIAL SUMMARY (UNAUDITED)\n(in Thousands except share and per share amounts) Period Ending\nDecember 31, 2017 Period Ending\nSeptember 30, 2017 % Change\nFrom Period\nEnding\nSeptember 30, 2017\nto Period\nEnding\nDecember 31, 2017 Period Ending\nDecember 31, 2016 % Change\nFrom Period\nEnding\nDecember 31, 2016\nto Period\nEnding\nDecember 31, 2017 QUARTERLY OPERATING RESULTS Net Income $ 21,150 $ 25,259 (16 )% $ 21,738 (3 )% Net Income Available to Common Stockholders $ 21,119 $ 25,259 (16 )% $ 21,714 (3 )% Diluted Earnings Per Share $ 0.39 $ 0.47 (17 )% $ 0.40 (3 )% Return on Average Assets 1.20 % 1.55 % 1.39 % Return on Average Common Stockholders' Equity 13.97 % 17.28 % 16.71 % Average Diluted Shares Outstanding 54,161,788 54,099,672 53,961,160 Core Net Income* $ 24,424 $ 25,259 (3 )% $ 21,738 12 % Core Net Income Available to Common Stockholders* $ 24,393 $ 25,259 (3 )% $ 21,714 12 % Core Diluted Earnings Per Share* $ 0.45 $ 0.47 (4 )% $ 0.40 13 % Core Return on Average Assets* 1.39 % 1.55 % 1.39 % Core Return on Average Common Stockholders' Equity* 16.13 % 17.28 % 16.71 % YEAR-TO-DATE OPERATING RESULTS Net Income $ 93,092 $ 81,479 14 % Net Income Available to Common Stockholders $ 93,030 $ 81,432 14 % Diluted Earnings Per Share $ 1.72 $ 1.52 13 % Return on Average Assets 1.43 % 1.42 % Return on Average Common Stockholders' Equity 16.37 % 16.63 % Average Diluted Shares Outstanding 54,123,957 53,608,372 Core Net Income* $ 96,366 $ 81,479 18 % Core Net Income Available to Common Stockholders* $ 96,304 $ 81,432 18 % Core Diluted Earnings Per Share* $ 1.78 $ 1.52 17 % Core Return on Average Assets* 1.48 % 1.42 % Core Return on Average Common Stockholders' Equity* 16.95 % 16.63 % BALANCE SHEET Total Assets $ 7,082,384 $ 6,712,103 6 % $ 6,370,448 11 % Loans 5,851,261 5,628,765 4 % 4,911,770 19 % Non-interest-bearing Demand Deposits 1,440,326 1,405,965 2 % 1,281,605 12 % Total Deposits 6,091,674 5,796,901 5 % 5,420,311 12 % Stockholders' Equity 607,604 590,213 3 % 522,889 16 % * Core measures exclude non-routine expenses during the comparative periods presented in this press release as more fully described in “GAAP Reconciliation and Management Explanation of Non-GAAP Financial Measures” below.\nDETAILED FINANCIALS\nServisFirst Bancshares, Inc. reported net income $21.2 million and net income available to common stockholders of $21.1 million for the quarter ended December 31, 2017, compared to net income and net income available to common stockholders of $21.7 million for the same quarter in 2016. Basic and diluted earnings per common share were $0.40 and $0.39, respectively, for the fourth quarter of 2017, compared to $0.41 and $0.40, respectively, for the fourth quarter of 2016.\nIn December 2017, we revalued our net deferred tax assets and recorded additional income tax expense of $3.1 million as a result of the reduction in the corporate income tax rate under the recently enacted Tax Cuts and Jobs Act of 2017. We also incurred $347,000 of non-routine expenses associated with moving into our new headquarters building in Birmingham, Alabama. The additional tax provision and non-routine expenses totaled $3.3 million, net of taxes, and are considered non-core components of our earnings in this press release. Excluding such non-core components, core net income and core net income available to common stockholders was $24.4 for the quarter ended December 31, 2017.\nReturn on average assets was 1.20% and return on average equity was 13.97% for the fourth quarter of 2017, compared to 1.39% and 16.71%, respectively, for the fourth quarter of 2016. Core return on average assets was 1.39% and core return on average equity was 16.13% for the fourth quarter of 2017.\nNet interest income was $61.4 million for the fourth quarter of 2017, compared to $58.4 million for the third quarter of 2017 and $49.1 million for the fourth quarter of 2016. The net interest margin in the fourth quarter of 2017 was 3.66%, a decrease of 11 basis points from the third quarter of 2017 and an increase of 36 basis points from the fourth quarter of 2016. The decrease in net interest income on a linked quarter basis is attributable to a $224.5 million increase in excess liquidity and a five basis point increase in average rates paid on deposits.\nThe Company’s held-to-maturity investment portfolio was transferred to available-for-sale during the fourth quarter of 2017 to provide the Company more flexibility managing its portfolio.\nAverage loans for the fourth quarter of 2017 were $5.72 billion, an increase of $276.8 million, or 5%, over average loans of $5.44 billion for the third quarter of 2017, and an increase of $1.01 billion, or 22%, over average loans of $4.70 billion for the fourth quarter of 2016.\nAverage total deposits for the fourth quarter of 2017 were $6.03 billion, an increase of $502.6 million, or 9%, over average total deposits of $5.53 billion for the third quarter of 2017, and an increase of $761.7 million, or 14%, over average total deposits of $5.27 billion for the fourth quarter of 2016.\nNon-performing assets to total assets were 0.25% for the fourth quarter of 2017, a decrease of three basis points compared to 0.28% for the third quarter of 2017 and a decrease of nine basis points compared to 0.34% for the fourth quarter of 2016. Net credit charge-offs to average loans for the fourth quarter of 2017 were 0.56%, a 46 basis point increase compared to 0.10% for the third quarter of 2017 and a 47 basis point increase compared to 0.09% for the fourth quarter of 2016. Net credit charge-offs to average loans for the year ended December 31, 2017 were 0.29% compared to 0.11% in 2016. The increase in net credit charge-offs for the fourth quarter and full year of 2017 was primarily attributable to a $5.8 million charge-off on one commercial relationship. Accordingly, we recorded a $9.1 million provision for loan losses in the fourth quarter of 2017 compared to $4.8 million in the third quarter of 2017 and $4.1 million in the fourth quarter of 2016. The allowance for loan losses as a percentage of total loans was 1.02% at December 31, 2017 compared to 1.04% at September 30, 2017 and 1.06% at December 31, 2016. In management’s opinion, the allowance is adequate and was determined by consistent application of ServisFirst Bank’s methodology for calculating its allowance for loan losses.\nNon-interest income for the fourth quarter of 2017 was $4.9 million, a decrease of $1.1 million, or 18%, from the fourth quarter of 2016. During the fourth quarter of 2016 we recognized a $1.3 million gain on the sale of fixed assets. Service charges on deposit accounts increased $124,000 while mortgage banking revenue decreased by approximately $150,000 in the fourth quarter of 2017 compared to the fourth quarter of 2016. Credit card income increased approximately $246,000, or 23%, during the fourth quarter of 2017 compared to the fourth quarter of 2016. Purchases on credit cards increased by 36% year over year.\nNon-interest expense for the fourth quarter of 2017 decreased $782,000, or 4%, to $21.3 million from $22.0 million in the fourth quarter of 2016, and decreased $242,000, or 1%, on a linked quarter basis. Salary and benefit expense for the fourth quarter of 2017 increased $235,000, or 2%, to $11.4 million from $11.2 million in the fourth quarter of 2016, and decreased $1.0 million, or 8%, on a linked quarter basis. The linked-quarter decrease resulted from a $786,000 reversal of incentive bonuses accrued during the first three quarters of 2017. Equipment and occupancy expense decreased $311,000, or 16%, to $1.6 million for the fourth quarter of 2017 compared to $1.9 million for the fourth quarter of 2016. We accelerated depreciation on our remaining tenant improvements of our previous headquarters building in Birmingham starting at the beginning of 2016 up to June of 2017 in anticipation of our move to our new headquarters building. Professional service expenses decreased by $225,000, or 21%, to $833,000 for the fourth quarter of 2017 compared to $1.1 million for the fourth quarter of 2016, a result of lower legal expenses. Other operating expense for the fourth quarter of 2017 decreased $508,000, or 7%, to $6.2 million from $6.7 million in the fourth quarter of 2016. Included in the fourth quarter of 2016 other operating expense is a $1.2 million write-down of a tax credit investment.\nIncome tax expense increased $7.6 million to $14.9 million in the fourth quarter of 2017, compared to $7.3 million in the fourth quarter of 2016. We recognized $3.1 million of additional tax expense as a result of revaluing our net deferred tax assets as of December 31, 2017 in connection with the Tax Cuts and Jobs Act passed into law in December 2017. We also recognized a $2.5 million federal tax credit during the fourth quarter of 2016. We recognized excess tax benefits from the exercise and vesting of stock options and restricted stock of $351,000 in the fourth quarter of 2017, compared to $54,000 in the fourth quarter of 2016.\nFinal financial results and other disclosures will be reported in our Annual Report on Form 10-K for the year ended December 31, 2017, and may differ materially from the results and disclosures in this press release due to, among other things, the completion of final review procedures, the occurrence of subsequent events, or the discovery of additional information.\nGAAP Reconciliation and Management Explanation of Non-GAAP Financial Measures\nWe recorded $3.1 million of additional tax expense as a result of revaluing our net deferred tax assets at December 31, 2017 due to lower corporate income tax rates provided by the Tax Cuts and Jobs Act passed into law in December 2017. We also recorded expenses of $347,000 related to terminating the lease agreement on our previous headquarters building in Birmingham, Alabama and expenses of moving into our new headquarters building. Core financial measures included in this press release are “core net income,” “core net income available to common stockholders,” “core diluted earnings per share,” “core return on average assets,” and “core return on average common stockholders’ equity.” Each of these five core financial measures excludes the impact of the non-routine expenses attributable to our net deferred tax asset revaluation, lease termination and moving expenses, and are all considered non-GAAP financial measures. In addition to these financial measures adjusting for non-routine expenses, this press release contains certain non-GAAP financial measures, including tangible common stockholders’ equity, total tangible assets, tangible book value per share and tangible common equity to total tangible assets, each of which excludes goodwill and core deposit intangibles associated with our acquisition of Metro Bancshares, Inc. in January 2015. We believe these non-GAAP financial measures provide useful information to management and investors that is supplementary to our financial condition, results of operations and cash flows computed in accordance with GAAP; however, we acknowledge that these non-GAAP financial measures have a number of limitations. As such, you should not view these disclosures as a substitute for results determined in accordance with GAAP, and they are not necessarily comparable to non-GAAP financial measures that other companies, including those in our industry, use. The following reconciliation tables provide a more detailed analysis of the non-GAAP financial measures as of and for the comparative periods presented in this press release. Dollars are in thousands, except share and per share data.\nThree Months Ended\nDecember 31, 2017 Year Ended\nDecember 31, 2017 Return on average assets - GAAP 1.20 % 1.43 % Net income - GAAP $ 21,150 $ 93,092 Adjustments: Revaluation of net deferred tax assets 3,059 3,059 Lease termination and moving expenses 347 347 Tax (benefit) of adjustments (132) (132) Core net income - non-GAAP* $ 24,424 $ 96,366 Average assets $ 6,988,731 $ 6,495,067 Core return on average assets - non-GAAP* 1.39 % 1.48 % Return on average common stockholders' equity - GAAP 13.97 % 16.37 % Net income available to common stockholders - GAAP $ 21,119 $ 93,030 Adjustments: Revaluation of net deferred tax assets 3,059 3,059 Lease termination and moving expenses 347 347 Tax (benefit) of adjustments (132) (132) Core net income available to common stockholders - non-GAAP* $ 24,393 $ 96,304 Average common stockholders' equity $ 599,947 $ 568,228 Core return on average common stockholders' equity - non-GAAP* 16.13 % 16.95 % Diluted earnings per share - GAAP $ 0.39 $ 1.72 Weighted average shares outstanding, diluted - GAAP 54,161,788 54,123,957 Core diluted earnings per share - non-GAAP* $ 0.45 $ 1.78\nAt December 31, 2017 At September 30, 2017 At June 30, 2017 At March 31, 2017 At December 31, 2016 Book value per share - GAAP $ 11.47 $ 11.14 $ 10.72 $ 10.32 $ 9.93 Total common stockholders' equity - GAAP 607,604 590,213 567,086 545,148 522,889 Adjustments: Adjusted for goodwill and core deposit intangible asset 14,719 14,787 14,855 14,924 14,996 Tangible common stockholders' equity - non-GAAP $ 592,885 $ 575,426 $ 552,231 $ 530,224 $ 507,893 Tangible book value per share - non-GAAP $ 11.19 $ 10.86 $ 10.44 $ 10.04 $ 9.65 Stockholders' equity to total assets - GAAP 8.58 % 8.79 % 8.96 % 8.60 % 8.21 % Total assets - GAAP $ 7,082,384 $ 6,712,103 $ 6,329,599 $ 6,336,165 $ 6,370,448 Adjustments: Adjusted for goodwill and core deposit intangible asset 14,719 14,787 14,855 14,924 14,996 Total tangible assets - non-GAAP $ 7,067,665 $ 6,697,316 $ 6,314,744 $ 6,321,241 $ 6,355,452 Tangible common equity to total tangible assets - non-GAAP 8.39 % 8.59 % 8.75 % 8.39 % 7.99 % * Core measures exclude non-routine expenses during the comparative periods presented in this press release as more fully described in “GAAP Reconciliation and Management Explanation on Non-GAAP Financial Measures” above.\nConference Call\nServisFirst Bancshares, Inc. will host a live audio webcast to discuss earnings and results on Monday, January 22, 2018 beginning at 5:15 p.m. ET. You may access the webcast at https://services.choruscall.com/links/sfbs180122.html . The webcast will be available until February 2, 2018.\nAbout ServisFirst Bancshares, Inc.\nServisFirst Bancshares, Inc. is a bank holding company based in Birmingham, Alabama. Through its subsidiary ServisFirst Bank, ServisFirst Bancshares, Inc. provides business and personal financial services from locations in Birmingham, Huntsville, Montgomery, Mobile and Dothan, Alabama, Pensacola and Tampa Bay, Florida, Atlanta, Georgia, Charleston, South Carolina and Nashville, Tennessee.\nServisFirst Bancshares, Inc. files periodic reports with the U.S. Securities and Exchange Commission (SEC). Copies of its filings may be obtained through the SEC’s website at www.sec.gov or at www.servisfirstbancshares.com .\nStatements in this press release that are not historical facts, including, but not limited to, statements concerning future operations, results or performance, are hereby identified as \"forward-looking statements\" for the purpose of the safe harbor provided by Section 21E of the Securities Exchange Act of 1934 and Section 27A of the Securities Act of 1933. The words \"believe,\" \"expect,\" \"anticipate,\" \"project,\" “plan,” “intend,” “will,” “would,” “might” and similar expressions often signify forward-looking statements. Such statements involve inherent risks and uncertainties. ServisFirst Bancshares, Inc. cautions that such forward-looking statements, wherever they occur in this press release or in other statements attributable to ServisFirst Bancshares, Inc., are necessarily estimates reflecting the judgment of ServisFirst Bancshares, Inc.’s senior management and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. Such forward-looking statements should, therefore, be considered in light of various factors that could affect the accuracy of such forward-looking statements, including: general economic conditions, especially in the credit markets and in the Southeast; the performance of the capital markets; changes in interest rates, yield curves and interest rate spread relationships; changes in accounting and tax principles, policies or guidelines; changes in legislation or regulatory requirements; changes in our loan portfolio and the deposit base; possible changes in laws and regulations and governmental monetary and fiscal policies, including, but not limited to, economic stimulus initiatives; the cost and other effects of legal and administrative cases and similar contingencies; possible changes in the creditworthiness of customers and the possible impairment of the collectability of loans and the value of collateral; the effect of natural disasters, such as hurricanes and tornados, in our geographic markets; and increased competition from both banks and non-bank financial institutions. The foregoing list of factors is not exhaustive. For discussion of these and other risks that may cause actual results to differ from expectations, please refer to “Cautionary Note Regarding Forward-looking Statements” and “Risk Factors” in our most recent Annual Report on Form 10-K and our other SEC filings. If one or more of the factors affecting our forward-looking information and statements proves incorrect, then our actual results, performance or achievements could differ materially from those expressed in, or implied by, forward-looking information and statements contained herein. Accordingly, you should not place undue reliance on any forward-looking statements, which speak only as of the date made. ServisFirst Bancshares, Inc. assumes no obligation to update or revise any forward-looking statements that are made from time to time.\nMore information about ServisFirst Bancshares, Inc. may be obtained over the Internet at www.servisfirstbancshares.com or by calling (205) 949-0302.\nContact: ServisFirst Bank\nDavis Mange (205) 949-3420\ndmange@servisfirstbank.com\nSELECTED FINANCIAL HIGHLIGHTS (UNAUDITED) (In thousands except share and per share data) 4th Quarter 2017 3rd Quarter 2017 2nd Quarter 2017 1st Quarter 2017 4th Quarter 2016 CONSOLIDATED STATEMENT OF INCOME Interest income $ 72,060 $ 67,641 $ 63,538 $ 59,517 $ 56,200 Interest expense 10,652 9,245 7,971 7,465 7,091 Net interest income 61,408 58,396 55,567 52,052 49,109 Provision for loan losses 9,055 4,803 4,381 4,986 4,075 Net interest income after provision for loan losses 52,353 53,593 51,186 47,066 45,034 Non-interest income 4,905 4,790 4,805 4,546 6,039 Non-interest expense 21,255 21,497 21,875 21,267 22,037 Income before income tax 36,003 36,886 34,116 30,345 29,036 Provision for income tax 14,853 11,627 9,952 7,826 7,298 Net income 21,150 25,259 24,164 22,519 21,738 Preferred stock dividends 31 - 31 - 24 Net income available to common stockholders $ 21,119 $ 25,259 $ 24,133 $ 22,519 $ 21,714 Earnings per share - basic $ 0.40 $ 0.48 $ 0.46 $ 0.43 $ 0.41 Earnings per share - diluted $ 0.39 $ 0.47 $ 0.45 $ 0.42 $ 0.40 Average diluted shares outstanding 54,161,788 54,099,672 54,100,604 54,133,722 53,961,160 CONSOLIDATED BALANCE SHEET DATA Total assets $ 7,082,384 $ 6,712,103 $ 6,329,599 $ 6,336,165 $ 6,370,448 Loans 5,851,261 5,628,765 5,343,688 5,151,984 4,911,770 Debt securities 538,330 522,724 518,065 526,023 484,939 Non-interest-bearing demand deposits 1,440,326 1,405,965 1,373,353 1,292,440 1,281,605 Total deposits 6,091,674 5,796,901 5,394,810 5,361,532 5,420,311 Borrowings 64,832 54,975 55,075 55,169 55,262 Stockholders' equity $ 607,604 $ 590,213 $ 567,086 $ 545,148 $ 522,889 Shares outstanding 52,992,586 52,970,310 52,909,362 52,812,396 52,636,896 Book value per share $ 11.47 $ 11.14 $ 10.72 $ 10.32 $ 9.93 Tangible book value per share (1) $ 11.19 $ 10.86 $ 10.44 $ 10.04 $ 9.65 SELECTED FINANCIAL RATIOS Net interest margin 3.66 % 3.77 % 3.77 % 3.53 % 3.30 % Return on average assets 1.20 % 1.55 % 1.55 % 1.45 % 1.39 % Return on average common stockholders' equity 13.97 % 17.28 % 17.36 % 17.09 % 16.71 % Efficiency ratio 32.05 % 34.02 % 36.23 % 37.58 % 39.96 % Non-interest expense to average earning assets 1.26 % 1.38 % 1.47 % 1.43 % 1.46 % CAPITAL RATIOS (2) Common equity tier 1 capital to risk-weighted assets 9.51 % 9.60 % 9.72 % 9.67 % 9.78 % Tier 1 capital to risk-weighted assets 9.52 % 9.61 % 9.73 % 9.68 % 9.78 % Total capital to risk-weighted assets 11.52 % 11.51 % 11.67 % 11.66 % 11.84 % Tier 1 capital to average assets 8.51 % 8.91 % 8.88 % 8.46 % 8.22 % Tangible common equity to total tangible assets (1) 8.39 % 8.59 % 8.75 % 8.39 % 7.99 % (1) See \"GAAP Reconciliation and Management Explanation of Non-GAAP Financial Measures\" for a discussion of these Non-GAAP financial measures. (2) Regulatory capital ratios for most recent period are preliminary.\nCONSOLIDATED BALANCE SHEETS (UNAUDITED) (Dollars in thousands) December 31, 2017 December 31, 2016 % Change ASSETS Cash and due from banks $ 86,213 $ 56,855 52 % Interest-bearing balances due from depository institutions 151,849 566,707 (73 )% Federal funds sold 239,524 160,435 49 % Cash and cash equivalents 477,586 783,997 (39 )% Available for sale debt securities, at fair value 538,080 422,375 27 % Held to maturity debt securities (fair value of $250 and $63,302 at December 31, 2017 and 2016, respectively) 250 62,564 (100 )% Restricted equity securities 1,034 1,024 1 % Mortgage loans held for sale 4,459 4,675 (5 )% Loans 5,851,261 4,911,770 19 % Less allowance for loan losses (59,406 ) (51,893 ) 14 % Loans, net 5,791,855 4,859,877 19 % Premises and equipment, net 58,900 40,314 46 % Goodwill and other identifiable intangible assets 14,719 14,996 (2 )% Other assets 195,501 180,626 8 % Total assets $ 7,082,384 $ 6,370,448 11 % LIABILITIES AND STOCKHOLDERS' EQUITY Liabilities: Deposits: Non-interest-bearing $ 1,440,326 $ 1,281,605 12 % Interest-bearing 4,651,348 4,138,706 12 % Total deposits 6,091,674 5,420,311 12 % Federal funds purchased 301,797 355,944 (15 )% Other borrowings 64,832 55,262 17 % Other liabilities 16,477 16,042 3 % Total liabilities 6,474,780 5,847,559 11 % Stockholders' equity: Preferred stock, Series A Senior Non-Cumulative Perpetual, par value $0.001 (liquidation preference $1,000), net of discount; no shares authorized, no shares issued or outstanding at December 31, 2017 and 2016 - - - % Preferred stock, par value $0.001 per share; 1,000,000 shares authorized and undesignated at December 31, 2017 and 2016 - - - % Common stock, par value $0.001 per share; 100,000,000 shares authorized; 52,992,586 shares issued and outstanding at December 31, 2017 and 52,636,896 shares issued and outstanding at December 31, 2016 53 53 - % Additional paid-in capital 217,693 215,932 1 % Retained earnings 389,597 307,151 27 % Accumulated other comprehensive income (241 ) (624 ) (61 )% Noncontrolling interest 502 377 33 % Total stockholders' equity 607,604 522,889 16 % Total liabilities and stockholders' equity $ 7,082,384 $ 6,370,448 11 %\nCONSOLIDATED STATEMENTS OF INCOME (UNAUDITED) (In thousands except per share data) Three Months Ended December 31, Year Ended December 31, 2017 2016 2017 2016 Interest income: Interest and fees on loans $ 67,357 $ 52,533 $ 246,682 $ 200,463 Taxable securities 2,468 1,604 9,117 5,343 Nontaxable securities 702 785 2,948 3,300 Federal funds sold 508 377 1,693 1,007 Other interest and dividends 1,025 901 2,316 2,789 Total interest income 72,060 56,200 262,756 212,902 Interest expense: Deposits 8,954 5,817 28,831 20,169 Borrowed funds 1,698 1,274 6,502 5,636 Total interest expense 10,652 7,091 35,333 25,805 Net interest income 61,408 49,109 227,423 187,097 Provision for loan losses 9,055 4,075 23,225 13,398 Net interest income after provision for loan losses 52,353 45,034 204,198 173,699 Non-interest income: Service charges on deposit accounts 1,499 1,375 5,702 5,355 Mortgage banking 894 1,044 3,835 3,725 Credit card income 1,298 1,052 4,815 3,207 Securities gains (losses) - - - (3 ) Increase in cash surrender value life insurance 797 745 3,131 2,794 Other operating income 417 1,823 1,563 3,034 Total non-interest income 4,905 6,039 19,046 18,112 Non-interest expense: Salaries and employee benefits 11,432 11,197 47,604 43,955 Equipment and occupancy expense 1,566 1,877 8,018 7,985 Professional services 833 1,058 3,217 3,977 FDIC and other regulatory assessments 1,030 1,072 3,918 3,400 Other real estate owned expense 160 91 323 759 Other operating expense 6,234 6,742 22,814 20,917 Total non-interest expense 21,255 22,037 85,894 80,993 Income before income tax 36,003 29,036 137,350 110,818 Provision for income tax 14,853 7,298 44,258 29,339 Net income 21,150 21,738 93,092 81,479 Dividends on preferred stock 31 24 62 47 Net income available to common stockholders $ 21,119 $ 21,714 $ 93,030 $ 81,432 Basic earnings per common share $ 0.40 $ 0.41 $ 1.76 $ 1.55 Diluted earnings per common share $ 0.39 $ 0.40 $ 1.72 $ 1.52\nLOANS BY TYPE (UNAUDITED) (In thousands) 4th Quarter 2017 3rd Quarter 2017 2nd Quarter 2017 1st Quarter 2017 4th Quarter 2016 Commercial, financial and agricultural $ 2,279,366 $ 2,223,910 $ 2,123,498 $ 2,061,503 $ 1,982,267 Real estate - construction 580,874 467,838 395,398 345,777 335,085 Real estate - mortgage: Owner-occupied commercial 1,328,666 1,323,383 1,272,659 1,262,578 1,171,719 1-4 family mortgage 603,063 593,180 565,121 554,261 536,805 Other mortgage 997,079 962,690 931,788 872,955 830,683 Subtotal: Real estate - mortgage 2,928,808 2,879,253 2,769,568 2,689,794 2,539,207 Consumer 62,213 57,764 55,224 54,910 55,211 Total loans $ 5,851,261 $ 5,628,765 $ 5,343,688 $ 5,151,984 $ 4,911,770\nSUMMARY OF LOAN LOSS EXPERIENCE (UNAUDITED) (Dollars in thousands) 4th Quarter 2017 3rd Quarter 2017 2nd Quarter 2017 1st Quarter 2017 4th Quarter 2016 Allowance for loan losses: Beginning balance $ 58,459 $ 55,059 $ 53,892 $ 51,893 $ 48,933 Loans charged off: Commercial, financial and agricultural 7,064 924 3,067 2,855 1,059 Real estate - construction - 16 40 - - Real estate - mortgage 1,134 550 106 266 45 Consumer 137 65 33 75 82 Total charge offs 8,335 1,555 3,246 3,196 1,186 Recoveries: Commercial, financial and agricultural 64 67 16 190 10 Real estate - construction 126 12 14 16 12 Real estate - mortgage 26 59 2 2 46 Consumer 11 14 - 1 3 Total recoveries 227 152 32 209 71 Net charge-offs 8,108 1,403 3,214 2,987 1,115 Provision for loan losses 9,055 4,803 4,381 4,986 4,075 Ending balance $ 59,406 $ 58,459 $ 55,059 $ 53,892 $ 51,893 Allowance for loan losses to total loans 1.02 % 1.04 % 1.03 % 1.05 % 1.06 % Allowance for loan losses to total average loans 1.04 % 1.07 % 1.05 % 1.08 % 1.10 % Net charge-offs to total average loans 0.56 % 0.10 % 0.25 % 0.24 % 0.09 % Provision for loan losses to total average loans 0.63 % 0.35 % 0.34 % 0.40 % 0.34 % Nonperforming assets: Nonaccrual loans $ 10,765 $ 12,356 $ 9,963 $ 12,084 $ 10,624 Loans 90+ days past due and accruing 60 2,506 1,016 16 6,263 Other real estate owned and repossessed assets 6,701 3,888 3,891 5,102 4,988 Total $ 17,526 $ 18,750 $ 14,870 $ 17,202 $ 21,875 Nonperforming loans to total loans 0.19 % 0.26 % 0.21 % 0.23 % 0.34 % Nonperforming assets to total assets 0.25 % 0.28 % 0.23 % 0.27 % 0.34 % Nonperforming assets to earning assets 0.25 % 0.29 % 0.24 % 0.28 % 0.35 % Reserve for loan losses to nonaccrual loans 551.84 % 473.12 % 552.63 % 445.98 % 488.45 % Restructured accruing loans $ 16,919 $ 12,700 $ 12,716 $ 536 $ 558 Restructured accruing loans to total loans 0.29 % 0.23 % 0.24 % 0.01 % 0.01 % TROUBLED DEBT RESTRUCTURINGS (TDRs) (UNAUDITED) (In thousands) 4th Quarter 2017 3rd Quarter 2017 2nd Quarter 2017 1st Quarter 2017 4th Quarter 2016 Beginning balance: $ 16,354 $ 16,370 $ 7,269 $ 7,292 $ 6,738 Additions 4,233 - 12,716 - - Removal from TDR - - (535 ) - - Net (paydowns) / advances (15 ) (16 ) (1,380 ) (23 ) 554 Charge-offs - - (1,700 ) - - $ 20,572 $ 16,354 $ 16,370 $ 7,269 $ 7,292\nCONSOLIDATED STATEMENTS OF INCOME (UNAUDITED) (In thousands except per share data) 4th Quarter 2017 3rd Quarter 2017 2nd Quarter 2017 1st Quarter 2017 4th Quarter 2016 Interest income: Interest and fees on loans $ 67,357 $ 63,857 $ 59,912 $ 55,556 $ 52,533 Taxable securities 2,468 2,288 2,274 2,087 1,604 Nontaxable securities 702 729 752 765 785 Federal funds sold 508 379 287 519 377 Other interest and dividends 1,025 388 313 590 901 Total interest income 72,060 67,641 63,538 59,517 56,200 Interest expense: Deposits 8,954 7,574 6,321 5,982 5,817 Borrowed funds 1,698 1,671 1,650 1,483 1,274 Total interest expense 10,652 9,245 7,971 7,465 7,091 Net interest income 61,408 58,396 55,567 52,052 49,109 Provision for loan losses 9,055 4,803 4,381 4,986 4,075 Net interest income after provision for loan losses 52,353 53,593 51,186 47,066 45,034 Non-interest income: Service charges on deposit accounts 1,499 1,467 1,382 1,354 1,375 Mortgage banking 894 978 1,064 899 1,044 Credit card income 1,298 1,149 1,189 1,179 1,052 Increase in cash surrender value life insurance 797 825 785 724 745 Other operating income 417 371 385 390 1,823 Total non-interest income 4,905 4,790 4,805 4,546 6,039 Non-interest expense: Salaries and employee benefits 11,432 12,428 12,031 11,713 11,197 Equipment and occupancy expense 1,566 1,947 2,265 2,250 1,877 Professional services 833 805 808 771 1,058 FDIC and other regulatory assessments 1,030 810 1,081 997 1,072 Other real estate owned expense 160 31 56 76 91 Other operating expense 6,234 5,476 5,634 5,460 6,742 Total non-interest expense 21,255 21,497 21,875 21,267 22,037 Income before income tax 36,003 36,886 34,116 30,345 29,036 Provision for income tax 14,853 11,627 9,952 7,826 7,298 Net income 21,150 25,259 24,164 22,519 21,738 Dividends on preferred stock 31 - 31 - 24 Net income available to common stockholders $ 21,119 $ 25,259 $ 24,133 $ 22,519 $ 21,714 Basic earnings per common share $ 0.40 $ 0.48 $ 0.46 $ 0.43 $ 0.41 Diluted earnings per common share $ 0.39 $ 0.47 $ 0.45 $ 0.42 $ 0.40\nAVERAGE BALANCE SHEETS AND NET INTEREST ANALYSIS (UNAUDITED) ON A FULLY TAXABLE-EQUIVALENT BASIS (Dollars in thousands) 4th Quarter 2017 3rd Quarter 2017 2nd Quarter 2017 1st Quarter 2017 4th Quarter 2016 Average Balance Yield /\nRate Average Balance Yield /\nRate Average Balance Yield /\nRate Average Balance Yield /\nRate Average Balance Yield /\nRate Assets: Interest-earning assets: Loans, net of unearned income (1) Taxable $ 5,680,227 4.68 % $ 5,407,109 4.66 % $ 5,192,812 4.60 % $ 4,976,933 4.50 % $ 4,676,565 4.45 % Tax-exempt (2) 36,992 4.95 33,357 5.17 41,143 4.92 27,322 4.72 26,344 4.74 Total loans, net of unearned income 5,717,219 4.68 5,440,466 4.66 5,233,955 4.60 5,004,255 4.51 4,702,909 4.45 Mortgage loans held for sale 6,199 3.52 4,862 3.51 5,958 3.90 5,637 4.10 6,271 3.36 Debt securities: Taxable 406,488 2.43 385,431 2.37 389,505 2.34 368,349 2.27 295,608 2.17 Tax-exempt (2) 128,201 3.27 131,478 3.34 133,590 3.38 132,578 3.45 134,748 3.54 Total securities (3) 534,689 2.63 516,909 2.62 523,095 2.60 500,927 2.58 430,356 2.60 Federal funds sold 143,905 1.40 111,175 1.35 98,598 1.17 234,460 0.90 242,211 0.62 Restricted equity securities 1,030 1.93 1,030 3.47 1,030 10.51 1,030 1.57 3,042 8.24 Interest-bearing balances with banks 310,289 1.31 118,510 1.27 109,909 1.04 295,648 0.80 601,143 0.55 Total interest-earning assets $ 6,713,331 4.29 % $ 6,192,952 4.37 % $ 5,972,545 4.30 % $ 6,041,957 4.03 % $ 5,985,932 3.77 % Non-interest-earning assets: Cash and due from banks 68,444 65,457 68,894 59,697 55,593 Net premises and equipment 57,320 54,727 49,813 44,739 30,421 Allowance for loan losses, accrued interest and other assets 149,636 151,786 143,286 138,289 140,721 Total assets $ 6,988,731 $ 6,464,922 $ 6,234,538 $ 6,284,682 $ 6,212,667 Interest-bearing liabilities: Interest-bearing deposits: Checking $ 899,334 0.46 % $ 800,437 0.42 % $ 779,916 0.39 % $ 789,273 0.38 % $ 735,115 0.37 % Savings 49,697 0.31 48,313 0.30 48,150 0.30 50,461 0.33 51,845 0.32 Money market 3,065,298 0.80 2,774,061 0.74 2,567,817 0.64 2,694,225 0.58 2,669,513 0.56 Time deposits 576,010 1.16 546,020 1.10 537,220 1.06 530,000 1.02 527,100 1.00 Total interest-bearing deposits 4,590,339 0.77 4,168,831 0.72 3,933,103 0.64 4,063,959 0.60 3,983,573 0.58 Federal funds purchased 271,248 1.37 282,806 1.34 336,344 1.11 359,747 0.86 353,029 0.63 Other borrowings 60,829 4.98 55,034 5.17 55,130 5.22 55,239 5.26 55,315 5.16 Total interest-bearing liabilities $ 4,922,416 0.86 % $ 4,506,671 0.81 % $ 4,324,577 0.74 % $ 4,478,945 0.68 % $ 4,391,917 0.64 % Non-interest-bearing liabilities: Non-interest-bearing demand 1,444,338 1,363,207 1,338,514 1,254,496 1,289,448 Other liabilities 22,030 15,070 13,739 16,809 14,399 Stockholders' equity 599,754 578,626 556,521 535,232 514,245 Unrealized gains on securities and derivatives 193 1,348 1,187 (800 ) 2,658 Total liabilities and stockholders' equity $ 6,988,731 $ 6,464,922 $ 6,234,538 $ 6,284,682 $ 6,212,667 Net interest spread 3.43 % 3.56 % 3.56 % 3.35 % 3.13 % Net interest margin 3.66 % 3.77 % 3.77 % 3.53 % 3.30 % (1 ) Average loans include loans on which the accrual of interest has been discontinued. (2 ) Interest income and yields are presented on a fully taxable equivalent basis using a tax rate of 35%. (3 ) Average net unrealized gains or losses on available-for-sale debt securities are excluded from the yield calculation.\nSource:ServisFirst Bancshares, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/c53be748-d878-41ae-891a-b71a9675df9d", "https://www.globenewswire.com/Tracker?data=vvMrw1X_kOWu66d9vFrytBkiL3WPTSBXTos9ftqQplQcDNoRhXo3o5G3vM0ChLG4Y0DO0qOh2gMEVRs_PX47ETcWs_8AxKxn68QzD4YJ4bjobJA2mDAk3zawW4DdSTiz", "https://www.globenewswire.com/Tracker?data=sIS1mC5b1eGSVKwgFzBIbiS8KYRjNxMZ9dMJK2UjogNeIH0Cl3FCKcnDXg0hz-M1rZXSWe7f8eKr5kunfNSLB11ae9BoE1B6V6HuMaW8NTgZPZ5E7ITi3F7FCwZxI9aG2iU4UgAcO__nraL2Iegov0wLJSx4i-F7HS7o_QYPYBTjXM_kkk7yzoFcOIfbzJh_", "https://www.globenewswire.com/Tracker?data=vQgb7nOIDCOMQ6CqzOhouJC8vI0546CKO7hhSHx3gIYAYmwut903dC_QW3OVvTz1tMrEtuGL4AlhYHzhnkTYLw==", "https://www.globenewswire.com/Tracker?data=vQgb7nOIDCOMQ6CqzOhouK303ofZOYbr8dIbRrQqVTX3dhuMkNztle39u55DZcgk763jFo0Ct4DHtKK8oUGBkuTiXwAx9rw7on6eaY7IehWUGwVQFMoRMJ2P41hLBABi", "https://services.choruscall.com/links/sfbs180122.html", "https://www.globenewswire.com/Tracker?data=vQgb7nOIDCOMQ6CqzOhouK303ofZOYbr8dIbRrQqVTWiSWuYrGh3y58X2SaKZBJ43R6ECvOOzRckkrI2UT3wjYBFhOvkqbnhG8gYBu0EGHi5OqNOAYudBtzrscOxBu1p"], "published": "2018-01-23T00:01:00.000+02:00", "crawled": "2018-01-23T02:16:07.032+02:00", "highlightTitle": ""}