{"organizations": [], "uuid": "d446da5873a4bd61c41df7fc5a4a5f4c8198adb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-eyenovia-announces-pricing-of-initial-public-offering.html", "country": "US", "domain_rank": 767, "title": "Eyenovia Announces Pricing of Initial Public Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:30:00.000+02:00", "replies_count": 0, "uuid": "d446da5873a4bd61c41df7fc5a4a5f4c8198adb3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-eyenovia-announces-pricing-of-initial-public-offering.html", "ord_in_thread": 0, "title": "Eyenovia Announces Pricing of Initial Public Offering", "locations": [], "entities": {"persons": [{"name": "ladenburg thalma", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "eyenovia", "sentiment": "none"}], "organizations": [{"name": "eyenovia inc.", "sentiment": "negative"}, {"name": "inc.", "sentiment": "none"}, {"name": "nasdaq capital market", "sentiment": "none"}, {"name": "ladenburg thalmann & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 25, 2018 (GLOBE NEWSWIRE) -- Eyenovia Inc. (“Eyenovia”), a clinical stage biopharmaceutical company developing a pipeline of ophthalmology products utilizing its patented piezo-print technology to deliver micro-therapeutics topically to the eye, today announced the pricing of its initial public offering of 2,730,000 shares of common stock at a price of $10.00 per share. In addition, Eyenovia has granted the underwriters a 30-day option to purchase up to an additional 409,500 shares of common stock at the initial public offering price, less the underwriting discounts and commission, to cover overallotments if any. The gross proceeds to Eyenovia from the initial public offering are expected to be $27.3 million, before underwriting discounts and commissions and other estimated offering expenses. The shares are expected to begin trading on the Nasdaq Capital Market under the ticker symbol “EYEN” on January 25, 2018. The offering is expected to close on January 29, 2018, subject to customary closing conditions.\nLadenburg Thalmann & Co. Inc., a subsidiary of Ladenburg Thalmann Financial Services Inc. (NYSE American:LTS) and Roth Capital Partners are acting as joint book-running managers for the offering.\nA registration statement relating to these securities has been filed with the Securities and Exchange Commission (SEC) and was declared effective on January 24, 2018. This offering will be made only by means of a final prospectus. A copy of the final prospectus relating to the offering will be filed with the SEC, and may be obtained from: Ladenburg Thalmann & Co. Inc., 277 Park Avenue, 26 th Floor, New York, NY 10172, telephone: (212) 409-2000 or email prospectus@ladenburg.com or from Roth Capital Partners, LLC, Attn: Prospectus Department, 888 San Clemente Drive, Suite 400, Newport Beach, CA 92660, telephone: (800) 678-9147.\nThis press release shall not constitute an offer to sell, or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Eyenovia\nEyenovia is a specialty biopharmaceutical company building a portfolio of next generation topical eye treatments based on its proprietary delivery and formulation platform for micro-therapeutics. Eyenovia’s pipeline is currently focused on the late-stage development of micro-therapeutics for glaucoma and other eye diseases.\nForward-Looking Statements\nThis press release includes certain disclosures which contain “forward-looking statements,” including, without limitation, statements regarding the anticipated timing of completion of the offerings of Eyenovia’s common stock. You can identify forward-looking statements because they contain words such as “believes” and “expects.” Forward-looking statements are based on Eyenovia’s current expectations and assumptions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that may differ materially from those contemplated by the forward-looking statements, which are neither statements of historical fact nor guarantees or assurances of future performance. Important factors that could cause actual results to differ materially from those in the forward-looking statements are set forth in Eyenovia’s filings with the SEC, including its registration statement on Form S-1, as amended from time to time, under the caption “Risk Factors.”\nAny forward-looking statements included in this press release are made only as of the date of this release. We do not undertake any obligations to update or supplement any forward-looking statements to reflect subsequent events or circumstances. We cannot assure you that projected events will be achieved.\nCompany Contact:\nEyenovia Inc.\nJohn Gandolfo\nChief Financial Officer\njgandolfo@eyenoviabio.com\nInvestor Contact:\nLee Roth / Tram Bui\nThe Ruth Group\nPhone: 646-536-7012/7035\nE-mail: lroth@theruthgroup.com / tbui@theruthgroup.com\nMedia Contact:\nThe Ruth Group\nKirsten Thomas\n508-280-6592\nkthomas@theruthgroup.com\nSource:Eyenovia, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=M8xVIX_eE2XmBZ453fY8ZJfZSLUWPcjpUM4ar-jyxCoXNjyHzvi4_lAW6D2GzVk8rgf1vlGeZjeS3R401qyNE7kvFiWnk29SflUP8OmJ34s=", "https://www.globenewswire.com/Tracker?data=syDRbz_5pHscsLsZrjoBJa1QU9mUv1f9bF5598i7cW1kUpddMbBB--ezci7UxJ4bvO99M_64Hwu-0OpZ8oygu2CI_O3AWxG7T7jhaAo6D-Y=", "https://www.globenewswire.com/Tracker?data=f08Q78xh02Ycepu_70fb42rmgDYuK6CRYFksW6a-TDw15565M4j5KIj0_eqsltZeW8BiEOTdobBPtT5ui7fLLzMaMjwkxIOjdFkCCjo6J7w=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/6c15f139-33a1-40ee-95e4-6c89edb40e5d", "https://www.globenewswire.com/Tracker?data=VZDXZn9wFrYO-ZN4CbYr4M-rOBYhBojwIdFStvj8t01O2RpfOUpkS2l5bRugooWUvzErBo4i2UQgGOx0C_1CQg2w3v52PgGgwLnW3-VBW5A=", "https://www.globenewswire.com/Tracker?data=tDKxrbmcKlP5eJXSc-jdU26wuVYmz226q9VbeELemx5eMdIq5j43K4N1Ccx2kRpbofBvkSDPiKScLJh0_SWhrPHNkzhJHZNIlt1uIHoMWiU="], "published": "2018-01-25T14:30:00.000+02:00", "crawled": "2018-01-25T14:18:45.003+02:00", "highlightTitle": ""}