{"organizations": [], "uuid": "54b01c1a7cb6e5704dd77042f348874f6971c750", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-amd-reports-fourth-quarter-and-annual-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "AMD Reports Fourth Quarter and Annual 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.978, "site_type": "news", "published": "2018-01-31T00:05:00.000+02:00", "replies_count": 0, "uuid": "54b01c1a7cb6e5704dd77042f348874f6971c750"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-amd-reports-fourth-quarter-and-annual-2017-financial-results.html", "ord_in_thread": 0, "title": "AMD Reports Fourth Quarter and Annual 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "amd", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "non-gaap financial results", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA CLARA, Calif., Jan. 30, 2018 (GLOBE NEWSWIRE) -- AMD (NASDAQ:AMD) today announced revenue for the fourth quarter of 2017 of $1.48 billion, operating income of $82 million and net income of $61 million or diluted earnings per share of $0.06. Non-GAAP (1) operating income was $103 million, non-GAAP (1) net income was $88 million and non-GAAP (1) diluted earnings per share was $0.08.\nFor fiscal 2017, the Company reported revenue of $5.33 billion, operating income of $204 million and net income of $43 million or diluted earnings per share of $0.04. Non-GAAP (1) operating income was $301 million, non-GAAP (1) net income was $179 million and non-GAAP (1) diluted earnings per share was $0.17.\nGAAP Financial Results Q4-17 Q3-17 Q4-16 2017 2016 Revenue $1.48B $1.64B $1.11B $5.33B $4.27B Operating income (loss) $82M $126M $(3)M $204M $(372)M Net income (loss) $61M $71M $(51)M $43M $(497)M Earnings (loss) per share $0.06 $0.07 $(0.06) $0.04 $(0.60)\nNon-GAAP Financial Results (1) Q4-17 Q3-17 Q4-16 2017 2016 Revenue $1.48B $1.64B $1.11B $5.33B $4.27B Operating income $103M $155M $26M $301M $44M Net income (loss) $88M $110M $(8)M $179M $(117)M Earnings (loss) per share $0.08 $0.10 $(0.01) $0.17 $(0.14) “2017 marked a key inflection point for AMD as we re-shaped our product portfolio, delivered 25 percent annual revenue growth, expanded gross margin and achieved full-year profitability,\" said Dr. Lisa Su, AMD president and CEO. \"We are even more excited about 2018 as we launch our next wave of high-performance products and continue to position AMD as one of the premier long-term growth companies in the technology industry.”\nQ4 2017 Results\nRevenue of $1.48 billion was up 34 percent year-over-year, primarily driven by strong sales of Radeon™ graphics and Ryzen™ processors. Revenue was down 10 percent sequentially, primarily driven by seasonally lower sales of semi-custom SoCs. Gross margin was 35 percent, up 3 percentage points year-over-year and flat sequentially. On a GAAP basis, operating income was $82 million compared to an operating loss of $3 million a year ago and operating income of $126 million in the prior quarter. The year-over-year increase was primarily due to higher revenue from the Computing and Graphics segment, while the sequential decrease was primarily due to seasonally lower Enterprise, Embedded and Semi-Custom segment revenue. Net income was $61 million compared to a net loss of $51 million a year ago and net income of $71 million in the prior quarter. Diluted earnings per share was $0.06 compared to a loss per share of $0.06 a year ago and diluted earnings per share of $0.07 in the prior quarter. On a non-GAAP basis, operating income was $103 million compared to operating income of $26 million a year ago and $155 million in the prior quarter. The year-over-year improvement was primarily due to higher revenue from the Computing and Graphics segment, while the sequential decrease was primarily due to seasonally lower Enterprise, Embedded and Semi-Custom segment revenue. Net income was $88 million compared to net loss of $8 million a year ago and net income of $110 million in the prior quarter. Diluted earnings per share was $0.08 compared to a loss per share of $0.01 a year ago and diluted earnings per share of $0.10 in the prior quarter. Cash and cash equivalents were $1.18 billion at the end of the quarter, up $306 million from the end of the prior quarter.\n2017 Annual Results\nRevenue of $5.33 billion, up 25 percent on an annual basis, was driven by an increase in the Computing and Graphics segment. On a GAAP basis, gross margin was 34 percent, up 11 percentage points from the prior year primarily due to the absence of a $340 million charge (WSA charge) recorded in 2016 associated with an amendment to our wafer supply agreement with GLOBALFOUNDRIES. Operating income was $204 million compared to an operating loss of $372 million in the prior year. The operating income improvement was primarily due to higher revenue and gross margin expansion in 2017, and the absence of the WSA charge recorded in 2016, partially offset by higher operating expenses. Net income was $43 million compared to a net loss of $497 million in the prior year. Diluted earnings per share was $0.04 compared to a loss per share of $0.60 in 2016. On a non-GAAP (1) basis, gross margin was 34 percent, up 3 percentage points year-over-year primarily due to improved revenue mix from new products. Operating income was $301 million compared to an operating income of $44 million in the prior year. Operating income improvement was primarily related to higher revenue and gross margin expansion, partially offset by higher operating expenses. Net income was $179 million compared to a net loss of $117 million in the prior year. Diluted earnings per share was $0.17 compared to a loss per share of $0.14 in 2016. Cash and cash equivalents were $1.18 billion at the end of the year, down from $1.26 billion at the end of 2016.\nQuarterly Financial Segment Summary\nComputing and Graphics segment revenue was $958 million, up 60 percent year-over-year and 17 percent sequentially. The year-over-year and sequential increases were primarily driven by strong sales of Radeon graphics and Ryzen desktop processors.\n◦ Operating income was $85 million, compared to an operating loss of $21 million in Q4 2016 and operating income of $70 million in Q3 2017. The year-over-year and sequential improvements were primarily driven by higher revenue.\n◦ Client average selling price (ASP) was up year-over-year driven by higher Ryzen desktop processors ASP. Client ASP was flat sequentially.\n◦ GPU ASP increased year-over-year and sequentially due to higher desktop and professional graphics ASP. Enterprise, Embedded and Semi-Custom segment revenue was $522 million, up 3 percent year-over-year driven by server revenue. Sequentially, revenue decreased 37 percent driven by seasonally lower semi-custom SoC revenue.\n◦ Operating income was $19 million compared to $47 million in Q4 2016 and $84 million in Q3 2017. The year-over-year decrease was primarily due to the absence of a $31 million licensing gain in Q4 2016 and an increase in R&D expenses, partially offset by the benefit from a richer product mix. The sequential decrease was primarily due to seasonally lower semi-custom SoC revenue. All Other operating loss was $22 million compared with operating losses of $29 million in Q4 2016 and $28 million in Q3 2017. The year-over-year and sequential improvement was primarily related to lower stock-based compensation charges in Q4 2017.\nRecent Corporate Highlights\nAMD expanded its presence in the datacenter with new AMD EPYC™ processor-powered solutions and deployments:\n◦ Microsoft Azure became the first global cloud provider to deploy AMD EPYC processors in its datacenters for its latest L-Series of Virtual Machines.\n◦ Baidu deployed AMD EPYC single-socket platforms to power its AI, big data, and cloud computing datacenters.\n◦ New high-performance platforms powered by AMD EPYC CPUs are now available from ecosystem partners including ASUS , GIGABYTE Technology , and Supermicro .\n◦ The AMD EPYC processor-powered HPE ProLiant DL385 Gen10 server started shipping in volume in December 2017, which launched with record-setting SPEC CPU® performance and features leadership cost per virtual machine configurations.\n◦ EPYC CPUs were recognized as the Linley Group Analysts’ Choice Awards “Best Server Processor” and in the “Top 5 Products or Technologies to Watch” category of both the HPCWire Readers’ Choice and Editors’ Choice Awards . AMD continued its commitment to bring innovation and competition to every segment of the PC market with the launch of its Ryzen Mobile Processors with Radeon Vega graphics , including the AMD Ryzen™ 7 2700U processor - the world’s fastest processor for ultrathin notebooks.\n◦ Combining the power of the “Zen” CPU and “Vega” GPU architectures, Ryzen mobile processors deliver up to 3x the CPU performance, up to 2.3x the GPU performance, and up to 58 percent less power consumption compared to the previous generation AMD notebook processors.\n◦ Ryzen mobile-based notebooks are currently available from Acer, HP, and Lenovo, with more systems expected from Dell and other OEMs in Q1 2018.\n◦ AMD and Qualcomm announced a collaboration to bring smooth and fast PC connectivity based on Qualcomm® Snapdragon™ LTE modem solutions to high-performance AMD Ryzen mobile processors designed for consumer and enterprise notebooks. At CES 2018, AMD announced details for upcoming computing and graphics products including its first 7nm product, a Radeon “Vega” GPU specifically built for machine learning applications, as well as next-generation Ryzen CPUs and desktop Ryzen APUs. Momentum around AMD’s next-generation “Vega” graphics portfolio continues to build:\n◦ Apple launched its most powerful Mac ever, the iMac Pro featuring AMD Radeon Pro Vega graphics.\n◦ AMD designed a semi-custom GPU that will be integrated into the 8 th Gen Intel® Core™ processor with Radeon RX Vega M Graphics.\n◦ AMD announced the expansion of the “Vega” family with the Radeon Vega Mobile GPU for ultrathin notebooks. AMD released a major update to its advanced GPU software suite for Radeon graphics, the Radeon Software Adrenalin Edition. AMD announced the appointment of Mark Durcan to its board of directors. AMD expanded its leadership team with the appointment of graphics industry leaders Mike Rayfield as senior vice president and general manager of AMD Radeon Technologies Group (RTG) and David Wang as senior vice president of engineering for RTG. Rayfield will be responsible for all aspects of strategy and business management for AMD’s consumer graphics, professional graphics, and semi-custom products. Wang will be responsible for all aspects of graphics engineering, including the technical strategy, architecture, hardware, and software for AMD graphics products and technologies.\nCurrent Outlook\nAMD’s outlook statements are based on current expectations. The following statements are forward-looking, and actual results could differ materially depending on market conditions and the factors set forth under “Cautionary Statement” below.\nFor Q1 2018, AMD expects revenue to be approximately $1.55 billion, plus or minus $50 million, an increase of 32 percent year-over-year, primarily driven by the strength of the ramp of new Ryzen, GPU and EPYC products.\nGuidance for Q1 2018 and the year-over-year comparison are under the new revenue recognition accounting standard (ASC 606). AMD is adopting the new revenue recognition standard by applying the “full retrospective” method. For comparative purposes under the new standard, Q1 2017 restated revenue was $1.18 billion and Q4 2017 restated revenue was $1.34 billion.\nFor fiscal 2018, AMD expects the impact of the new standard on revenue to be immaterial.\nFor additional details regarding AMD’s results and outlook please see the CFO commentary posted on the Investor Relations page at www.amd.com .\nAMD Teleconference\nAMD will hold a conference call for the financial community at 2:00 p.m. PT (5:00 p.m. ET) today to discuss its fourth quarter and fiscal year 2017 financial results. AMD will provide a real-time audio broadcast of the teleconference on the Investor Relations page of its website at www.amd.com . The webcast will be available for 12 months after the conference call.\nReconciliation of GAAP to Non-GAAP Gross Margin (Millions except percentages) Q4-17 Q3-17 Q4-16 2017 2016 GAAP Gross Margin $ 515 $ 573 $ 351 $ 1,823 $ 998 GAAP Gross Margin % 35 % 35 % 32 % 34 % 23 % Charge related to the sixth amendment to the WSA with GF — — — — 340 Stock-based compensation — 1 1 2 2 Non-GAAP Gross Margin $ 515 $ 574 $ 352 $ 1,825 $ 1,340 Non-GAAP Gross Margin % 35 % 35 % 32 % 34 % 31 %\nReconciliation of GAAP Operating Income (loss) to Non-GAAP Operating Income (Millions) Q4-17 Q3-17 Q4-16 2017 2016 GAAP operating income (loss) $ 82 $ 126 $ (3 ) $ 204 $ (372 ) Stock-based compensation 21 29 29 97 86 Charge related to the sixth amendment to the WSA with GF — — — — 340 Restructuring and other special charges, net — — — — (10 ) Non-GAAP operating income $ 103 $ 155 $ 26 $ 301 $ 44\nReconciliation of GAAP to Non-GAAP Net Income (Loss)/Earnings (Loss) per Share (Millions except per share amounts) Q4-17 Q3-17 Q4-16 2017 2016 GAAP net income (loss) / earnings (loss) per share $ 61 $ 0.06 $ 71 $ 0.07 $ (51 ) $ (0.06 ) $ 43 $ 0.04 $ (497 ) $ (0.60 ) Charge related to the sixth amendment to the WSA with GF — — — — — — — — 340 0.41 Stock-based compensation 21 0.02 29 0.02 29 0.03 97 0.09 86 0.10 Restructuring and other special charges, net — — — — — — — — (10 ) (0.01 ) Loss on debt redemption 3 — 2 — 7 0.01 12 0.01 68 0.08 Non-cash interest expense related to convertible debt 5 — 6 0.01 5 0.01 22 0.02 6 0.01 Gain on sale of 85% of ATMP JV (3 ) — — — — — (3 ) — (146 ) (0.17 ) Tax provision related to sale of 85% of ATMP JV 1 — — — — — 1 — 26 0.03 Equity loss in investee — — 2 — 2 — 7 0.01 10 0.01 Non-GAAP net income (loss) / earnings (loss) per share $ 88 $ 0.08 $ 110 $ 0.10 $ (8 ) $ (0.01 ) $ 179 $ 0.17 $ (117 ) $ (0.14 ) Q4 and Q3 2017 GAAP diluted earnings per share (EPS) are calculated based on 1,037 million and 1,042 million shares, respectively. Q4 and Q3 2017 non-GAAP diluted EPS are calculated based on 1,137 million and 1,143 million shares, respectively, which include 100.6 million shares related to the Company’s 2026 Convertible Notes and a $5 million cash interest expense add-back to net income under the \"if converted\" method.\n2017 GAAP and non-GAAP diluted EPS are both calculated based on 1,039 million shares. About AMD\nFor more than 45 years, AMD has driven innovation in high-performance computing, graphics, and visualization technologies - the building blocks for gaming, immersive platforms, and the datacenter. Hundreds of millions of consumers, leading Fortune 500 businesses, and cutting-edge scientific research facilities around the world rely on AMD technology daily to improve how they live, work, and play. AMD employees around the world are focused on building great products that push the boundaries of what is possible. For more information about how AMD is enabling today and inspiring tomorrow, visit the AMD (NASDAQ: AMD) website , blog , Facebook and Twitter pages.\nCautionary Statement\nThis press release contains concerning Advanced Micro Devices, Inc. (AMD), including AMD's ability to launch its next wave of high-performance products; AMD's ability to position itself as one of the premier long-term growth companies in the technology industry; the features, functionality, timing, availability and expected benefits of AMD's future products and technologies; AMD's expected first quarter 2018 revenue and the expected drivers of such revenue; and the expected impact of the new revenue recognition accounting standard on AMD fiscal 2018 revenue, which are made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are commonly identified by words such as \"would,\" \"intends,\" \"believes,\" \"expects,\" \"may,\" \"will,\" \"should,\" \"seeks,\" \"intends,\" \"plans,\" \"pro forma,\" \"estimates,\" \"anticipates,\" or the negative of these words and phrases, other variations of these words and phrases or comparable terminology. Investors are cautioned that the in this press release are based on current beliefs, assumptions and expectations, speak only as of the date of this document and involve risks and uncertainties that could cause actual results to differ materially from current expectations. Such statements are subject to certain known and unknown risks and uncertainties, many of which are difficult to predict and generally beyond AMD's control, that could cause actual results and other future events to differ materially from those expressed in, or implied or projected by, the forward-looking information and statements. Material factors that could cause actual results to differ materially from current expectations include, without limitation, the following: Intel Corporation’s dominance of the microprocessor market and its aggressive business practices may limit AMD’s ability to compete effectively; AMD has a wafer supply agreement with GLOBALFOUNDRIES Inc. (GF) with obligations to purchase all of its microprocessor and APU product requirements, and a certain portion of its GPU product requirements from GF with limited exceptions. If GF is not able to satisfy AMD’s manufacturing requirements, AMD's business could be adversely impacted; AMD relies on third parties to manufacture its products, and if they are unable to do so on a timely basis in sufficient quantities and using competitive technologies, AMD’s business could be materially adversely affected; failure to achieve expected manufacturing yields for AMD’s products could negatively impact its financial results; the success of AMD’s business is dependent upon its ability to introduce products on a timely basis with features and performance levels that provide value to its customers while supporting and coinciding with significant industry transitions; if AMD cannot generate sufficient revenue and operating cash flow or obtain external financing, it may face a cash shortfall and be unable to make all of its planned investments in research and development or other strategic investments; the loss of a significant customer may have a material adverse effect on AMD; AMD’s receipt of revenue from its semi-custom SoC products is dependent upon its technology being designed into third-party products and the success of those products; global economic uncertainty may adversely impact AMD’s business and operating results; the markets in which AMD’s products are sold are highly competitive; AMD may not be able to generate sufficient cash to service its debt obligations or meet its working capital requirements; AMD has a large amount of indebtedness which could adversely affect its financial position and prevent it from implementing its strategy or fulfilling its contractual obligations; the agreements governing AMD’s notes and the Secured Revolving Line of Credit impose restrictions on AMD that may adversely affect its ability to operate its business; the products that AMD sells are complex and may be subject to security vulnerabilities that could result in, among other things, the loss, corruption or misuse of confidential data by unauthorized third parties or system performance issues. AMD's efforts to prevent and address security vulnerabilities can be costly and may be partially effective or not successful at all. For instance, AMD's mitigation efforts, including the deployment of software or firmware updates to address security vulnerabilities, could result in unintended consequences such as adverse performance system operation issues and reboots. AMD may also depend on third parties, such as customers, vendors and end users to deploy AMD's mitigations or create their own, and they may delay, decline or modify the implementation of such mitigations. AMD's relationships with its customers could be adversely affected as some of its customers may stop purchasing AMD products, reduce or delay future purchases of AMD products, or use competing products. Any of these actions by AMD's customers could adversely affect its revenue. AMD is also subject to claims related to the recently disclosed side-channel exploits, such as “Spectre” and “Meltdown”, and may face claims or litigation for future vulnerabilities. Actual or perceived security vulnerabilities of AMD products may subject AMD to adverse publicity, damage to its brand and reputation, and could materially harm AMD's business or financial results; AMD's issuance to West Coast Hitech L.P. (WCH) of warrants to purchase 75 million shares of its common stock, if and when exercised, will dilute the ownership interests of AMD's existing stockholders, and the conversion of the 2.125% Convertible Senior Notes due 2026 (2.125% Notes) may dilute the ownership interest of AMD's existing stockholders, or may otherwise depress the price of its common stock; uncertainties involving the ordering and shipment of AMD’s products could materially adversely affect it; the demand for AMD’s products depends in part on the market conditions in the industries into which they are sold. Fluctuations in demand for AMD’s products or a market decline in any of these industries could have a material adverse effect on its results of operations; AMD’s ability to design and introduce new products in a timely manner is dependent upon third-party intellectual property; AMD depends on third-party companies for the design, manufacture and supply of motherboards, software and other computer platform components to support its business; if AMD loses Microsoft Corporation’s support for its products or other software vendors do not design and develop software to run on AMD’s products, its ability to sell its products could be materially adversely affected; AMD’s reliance on third-party distributors and AIB partners subjects it to certain risks; AMD’s inability to continue to attract and retain qualified personnel may hinder its business; in the event of a change of control, AMD may not be able to repurchase its outstanding debt as required by the applicable indentures and its secured revolving line of credit (Secured Revolving Line of Credit), which would result in a default under the indentures and its Secured Revolving Line of Credit; the semiconductor industry is highly cyclical and has experienced severe downturns that have materially adversely affected, and may continue to materially adversely affect its business in the future; acquisitions, divestitures and/or joint ventures could disrupt its business, harm its financial condition and operating results or dilute, or adversely affect the price of, its common stock; AMD’s business is dependent upon the proper functioning of its internal business processes and information systems and modification or interruption of such systems may disrupt its business, processes and internal controls; data breaches and cyber-attacks could compromise AMD’s intellectual property or other sensitive information, be costly to remediate and cause significant damage to its business and reputation; AMD’s operating results are subject to quarterly and seasonal sales patterns; if essential equipment, materials or manufacturing processes are not available to manufacture its products, AMD could be materially adversely affected; if AMD’s products are not compatible with some or all industry-standard software and hardware, it could be materially adversely affected; costs related to defective products could have a material adverse effect on AMD; if AMD fails to maintain the efficiency of its supply chain as it responds to changes in customer demand for its products, its business could be materially adversely affected; AMD outsources to third parties certain supply-chain logistics functions, including portions of its product distribution, transportation management and information technology support services; AMD may incur future impairments of goodwill; AMD's stock price is subject to volatility; AMD’s worldwide operations are subject to political, legal and economic risks and natural disasters, which could have a material adverse effect on it; worldwide political conditions may adversely affect demand for AMD’s products; unfavorable currency exchange rate fluctuations could adversely affect AMD; AMD’s inability to effectively control the sales of its products on the gray market could have a material adverse effect on it; if AMD cannot adequately protect its technology or other intellectual property in the United States and abroad, through patents, copyrights, trade secrets, trademarks and other measures, it may lose a competitive advantage and incur significant expenses; AMD is a party to litigation and may become a party to other claims or litigation that could cause it to incur substantial costs or pay substantial damages or prohibit it from selling its products; AMD’s business is subject to potential tax liabilities; and AMD is subject to environmental laws, conflict minerals-related provisions of the Dodd-Frank Wall Street Reform and Consumer Protection Act as well as a variety of other laws or regulations that could result in additional costs and liabilities. Investors are urged to review in detail the risks and uncertainties in AMD's Securities and Exchange Commission filings, including but not limited to AMD's Quarterly Report on Form 10-Q September 30, 2017.\nAMD, the AMD Arrow logo, EPYC, Radeon, Radeon Instinct, Ryzen, and combinations thereof, are trademarks of Advanced Micro Devices, Inc. Other names are for informational purposes only and used to identify companies and products and may be trademarks of their respective owner.\n1. In this earnings press release, in addition to GAAP financial results, AMD has provided non-GAAP financial measures including non-GAAP gross margin, non-GAAP operating income (loss), non-GAAP net income (loss) and non-GAAP earnings (loss) per share. These non-GAAP financial measures reflect certain adjustments as presented in the tables in this earnings press release. AMD also provided adjusted EBITDA and free cash flow as supplemental non-GAAP measures of its performance. These items are defined in the footnotes to the selected corporate data tables provided at the end of this earnings press release. AMD is providing these financial measures because it believes this non-GAAP presentation makes it easier for investors to compare its operating results for current and historical periods and also because AMD believes it assists investors in comparing AMD’s performance across reporting periods on a consistent basis by excluding items that it does not believe are indicative of its core operating performance and for the other reasons described in the footnotes to the selected data tables. Refer to the data tables at the end of this earnings press release.\nADVANCED MICRO DEVICES, INC. CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (Millions except per share amounts and percentages) Three Months Ended Year Ended December 30,\n2017 September 30,\n2017 December 31,\n2016 December 30,\n2017 December 31,\n2016 Net revenue $ 1,480 $ 1,643 $ 1,106 $ 5,329 $ 4,272 Cost of sales 965 1,070 755 3,506 3,274 Gross margin 515 573 351 1,823 998 Gross margin % 35 % 35 % 32 % 34 % 23 % Research and development 300 315 264 1,160 1,008 Marketing, general and administrative 133 132 121 511 460 Restructuring and other special charges, net - - - - (10 ) Licensing gain - - (31 ) (52 ) (88 ) Operating income (loss) 82 126 (3 ) 204 (372 ) Interest expense (31 ) (31 ) (34 ) (126 ) (156 ) Other income (expense), net 2 (3 ) (7 ) (9 ) 80 Income (loss) before equity loss and income taxes 53 92 (44 ) 69 (448 ) Provision (benefit) for income taxes (8 ) 19 5 19 39 Equity loss in investee - (2 ) (2 ) (7 ) (10 ) Net Income (loss) $ 61 $ 71 $ (51 ) $ 43 $ (497 ) Earnings (loss) per share Basic $ 0.06 $ 0.07 $ (0.06 ) $ 0.04 $ (0.60 ) Diluted $ 0.06 $ 0.07 $ (0.06 ) $ 0.04 $ (0.60 ) Shares used in per share calculation Basic 965 957 931 952 835 Diluted 1,037 1,042 931 1,039 835 ADVANCED MICRO DEVICES, INC. CONDENSED CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS) (Millions) Three Months Ended Year Ended December 30,\n2017 September 30,\n2017 December 31,\n2016 December 30,\n2017 December 31,\n2016 Total comprehensive income (loss) $ 65 $ 73 $ (53 ) $ 54 $ (494 )\nADVANCED MICRO DEVICES, INC. CONDENSED CONSOLIDATED BALANCE SHEETS (Millions) December 30,\n2017 December 31,\n2016 Assets Current assets: Cash and cash equivalents $ 1,185 $ 1,264 Accounts receivable, net 400 311 Inventories, net 739 751 Prepayment and other receivables - related parties 33 32 Prepaid expenses 77 63 Other current assets 188 109 Total current assets 2,622 2,530 Property, plant and equipment, net 261 164 Goodwill 289 289 Investment: equity method 58 59 Other assets 310 279 Total Assets $ 3,540 $ 3,321 Liabilities and Stockholders' Equity Current liabilities: Short-term debt $ 70 $ - Accounts payable 384 440 Payables to related parties 412 383 Accrued liabilities 541 391 Other current liabilities 57 69 Deferred income on shipments to distributors 22 63 Total current liabilities 1,486 1,346 Long-term debt, net 1,325 1,435 Other long-term liabilities 118 124 Stockholders' equity: Capital stock: Common stock, par value 9 9 Additional paid-in capital 8,464 8,334 Treasury stock, at cost (108 ) (119 ) Accumulated deficit (7,760 ) (7,803 ) Accumulated other comprehensive income (loss) 6 (5 ) Total Stockholders' equity 611 416 Total Liabilities and Stockholders' Equity $ 3,540 $ 3,321\nADVANCED MICRO DEVICES, INC. CONDENSED CONSOLIDATED STATEMENT OF CASH FLOWS (Millions) Three Months Ended Year Ended December 30,\n2017 December 30,\n2017 Cash flows from operating activities: Net Income $ 61 $ 43 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation and amortization 39 144 Stock-based compensation expense 21 97 Amortization of debt discount and issuance costs 9 36 Loss on debt redemption 3 12 Net gain on sale of equity interests in ATMP JV (3 ) (3 ) Other (1 ) 3 Changes in operating assets and liabilities: Accounts receivable 371 (89 ) Inventories 55 12 Prepayment and other receivables - related parties (7 ) (1 ) Prepaid expenses and other assets (58 ) (140 ) Payables to related parties (32 ) 29 Accounts payable, accrued liabilities and other (75 ) (75 ) Net cash provided by operating activities $ 383 $ 68 Cash flows from investing activities: Purchases of property, plant and equipment (44 ) (113 ) Purchases of available-for-sale securities (1 ) (222 ) Proceeds from maturity of available-for-sale securities 1 222 Net proceeds from sale of equity interests in ATMP JV 1 1 Other - (2 ) Net cash used in investing activities $ (43 ) $ (114 ) Cash flows from financing activities: Proceeds from borrowings, net - 70 Proceeds from issuance of common stock under stock-based compensation equity plans 5 20 Repayments of long-term debt (40 ) (110 ) Other 1 (13 ) Net cash used in financing activities $ (34 ) $ (33 ) Net increase (decrease) in cash and cash equivalents 306 (79 ) Cash and cash equivalents at beginning of period $ 879 $ 1,264 Cash and cash equivalents at end of period $ 1,185 $ 1,185\nADVANCED MICRO DEVICES, INC. SELECTED CORPORATE DATA (Millions) Three Months Ended Year Ended Segment and Category Information December 30,\n2017 September 30,\n2017 December 31,\n2016 December 30,\n2017 December 31,\n2016 Computing and Graphics (1) Net revenue $ 958 $ 819 $ 600 $ 3,029 $ 1,967 Operating income (loss) $ 85 $ 70 $ (21 ) $ 147 $ (238 ) Enterprise, Embedded and Semi-Custom (2) Net revenue $ 522 $ 824 $ 506 $ 2,300 $ 2,305 Operating income $ 19 $ 84 $ 47 $ 154 $ 283 All Other (3) Net revenue - - - - - Operating loss $ (22 ) $ (28 ) $ (29 ) $ (97 ) (417 ) Total Net revenue $ 1,480 $ 1,643 $ 1,106 $ 5,329 $ 4,272 Operating income (loss) $ 82 $ 126 $ (3 ) $ 204 $ (372 ) Other Data Capital expenditures (4) $ 44 $ 34 $ 21 $ 113 $ 77 Adjusted EBITDA (5) $ 142 $ 191 $ 60 $ 445 $ 177 Cash and cash equivalents $ 1,185 $ 879 $ 1,264 $ 1,185 $ 1,264 Free cash flow (6) $ 339 $ 32 $ 167 $ (45 ) $ 13 Total assets $ 3,540 $ 3,586 $ 3,321 $ 3,540 $ 3,321 Total debt $ 1,395 $ 1,426 $ 1,435 $ 1,395 $ 1,435 See footnotes on the next page\n(1) The Computing and Graphics segment primarily includes desktop and notebook processors and chipsets, discrete graphics processing units (GPUs) and professional graphics processors. The Company also licenses portions of its intellectual property portfolio. (2 ) The Enterprise, Embedded and Semi-Custom segment primarily includes server and embedded processors, semi-custom System-on-Chip (SoC) products, development services and technology for game consoles. The Company also licenses portions of its intellectual property portfolio. (3) All Other category primarily includes certain expenses and credits that are not allocated to any of the operating segments. Also included in this category is stock-based compensation expense. In addition, the Company also included a charge related to the sixth amendment to the WSA with GF and restructuring and other special charges, net for the year ended December 31, 2016. (4) Starting in Q1 2017, the Company classifies production mask sets as property, plant and equipment on its balance sheet. (5) Reconciliation of GAAP Operating Income (Loss) to Adjusted EBITDA*\nThree Months Ended Year Ended December 30,\n2017 September 30,\n2017 December 31,\n2016 December 30,\n2017 December 31,\n2016 GAAP operating income (loss) $ 82 $ 126 $ (3 ) $ 204 $ (372 ) Charge related to the sixth amendment to the WSA with GF - - - - 340 Restructuring and other special charges, net - - - - (10 ) Stock-based compensation 21 29 29 97 86 Depreciation and amortization 39 36 34 144 133 Adjusted EBITDA $ 142 $ 191 $ 60 $ 445 $ 177 (6) Free cash flow reconciliation** Three Months Ended Year Ended December 30,\n2017 September 30,\n2017 December 31,\n2016 December 30,\n2017 December 31,\n2016 GAAP net cash provided by operating activities $ 383 $ 66 $ 188 $ 68 $ 90 Purchases of property, plant and equipment (44 ) (34 ) (21 ) (113 ) (77 ) Free cash flow $ 339 $ 32 $ 167 $ (45 ) $ 13\n* The Company presents “Adjusted EBITDA” as a supplemental measure of its performance. Adjusted EBITDA for the Company is determined by adjusting operating income (loss) for depreciation and amortization and stock-based compensation expense. In addition, the Company excluded a charge related to the sixth amendment to the WSA with GF and restructuring and other special charges, net for the year ended December 31, 2016. The Company calculates and presents Adjusted EBITDA because management believes it is of importance to investors and lenders in relation to its overall capital structure and its ability to borrow additional funds. In addition, the Company presents Adjusted EBITDA because it believes this measure assists investors in comparing its performance across reporting periods on a consistent basis by excluding items that the Company does not believe are indicative of its core operating performance. The Company’s calculation of Adjusted EBITDA may or may not be consistent with the calculation of this measure by other companies in the same industry. Investors should not view Adjusted EBITDA as an alternative to the GAAP operating measure of operating income (loss) or GAAP liquidity measures of cash flows from operating, investing and financing activities. In addition, Adjusted EBITDA does not take into account changes in certain assets and liabilities as well as interest income and expense and income taxes that can affect cash flows. ** The Company also presents free cash flow as a supplemental Non-GAAP measure of its performance. Free cash flow is determined by adjusting GAAP net cash provided by (used in) operating activities for capital expenditures. The Company calculates and communicates free cash flow in the financial earnings press release because management believes it is of importance to investors to understand the nature of these cash flows. The Company’s calculation of free cash flow may or may not be consistent with the calculation of this measure by other companies in the same industry. Investors should not view free cash flow as an alternative to GAAP liquidity measures of cash flows from operating activities. The Company has provided reconciliations within the earnings press release of these non-GAAP financial measures to the most directly comparable GAAP financial measures.\nMedia Contact\nDrew Prairie\n512-602-4425\ndrew.prairie@amd.com\nInvestor Contact\nLaura Graves\n408-749-5467\nlaura.graves@amd.com\nSource: Advanced Micro Devices", "external_links": ["https://www.supermicro.com/products/nfo/AMD_SP3.cfm?pg=SS", "http://www.amd.com/en-us/press-releases/Pages/amd-delivers-supercomputing-2017nov13.aspx", "https://www.hpcwire.com/2017-hpcwire-awards-readers-editors-choice/2/", "http://www.amd.com/en-us/press-releases/Pages/world-record-benchmark-2017nov20.aspx", "https://www.asus.com/News/g6MUDyAxX7d8hCRx", "http://ir.amd.com/", "https://www.facebook.com/AMD/", "https://community.amd.com/", "http://www.amd.com/en", "https://www.gigabyte.com/Press/News/1567", "http://www.amd.com/en-us/press-releases/Pages/ces-2018-2018jan07.aspx", "http://www.amd.com/en-us/press-releases/Pages/graphics-industry-leaders-2018jan23.aspx", "http://www.amd.com/en-us/press-releases/Pages/introducing-radeon-software2017dec12.aspx", "https://www.globenewswire.com/NewsRoom/AttachmentNg/9782a337-07ac-424b-9c5a-f9cde47d8d55", "http://www.amd.com/en-us/press-releases/Pages/amd-introduces-the-2017oct26.aspx", "http://www.amd.com/en-us/press-releases/Pages/amd-appoints-mark-2017nov1.aspx", "https://www.apple.com/newsroom/2017/12/imac-pro-the-most-powerful-mac-ever-available-today/", "http://www.linleygroup.com/press_detail.php?The-Linley-Group-Announces-Winners-of-Annual-Analysts-rsquo-Choice-Awards-91", "http://www.amd.com/en-us/press-releases/Pages/semi-custom-graphics-chip-2017nov6.aspx", "http://www.amd.com/en-us/press-releases/Pages/baidu-deploys-amd-2017dec13.aspx", "http://www.amd.com/en-us/press-releases/Pages/microsoft-azure-becomes-2017dec05.aspx", "https://twitter.com/AMD", "http://www.amd.com/en-us/press-releases/Pages/amd-and-qualcomm-2017dec05.aspx"], "published": "2018-01-31T00:05:00.000+02:00", "crawled": "2018-01-31T03:10:12.004+02:00", "highlightTitle": ""}