{"organizations": [], "uuid": "13dfe2abc38af008ad45f1d766bc857f425371bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/03/104382104-GettyImages-707592073_1.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/05/own-a-mac-pc-or-smartphone-a-major-security-flaw-means-you-need-to-do-this-now.html", "country": "US", "domain_rank": 767, "title": "Own a Mac, PC or smartphone? A major security flaw means you need to do this now", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T15:36:00.000+02:00", "replies_count": 0, "uuid": "13dfe2abc38af008ad45f1d766bc857f425371bd"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/own-a-mac-pc-or-smartphone-a-major-security-flaw-means-you-need-to-do-this-now.html", "ord_in_thread": 0, "title": "Own a Mac, PC or smartphone? A major security flaw means you need to do this now", "locations": [], "entities": {"persons": [], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "usa today", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO — Apple says all of its Macs, iPhones and iPads contain a security flaw that requires an update. It's not alone. Any owner of a PC, tablet or smart phone should make sure that automatic software updates for their operating systems are enabled after security researchers this week revealed a broad flaw in Intel and other chips that could allow hackers to access data previously thought to be secure.\nWhat you should do about it?\nMore from USA Today:\nApple to issue fix against chip flaw risk\n5G: What is it? What does it mean for your smartphone?\nSmartphones don't work well in the bitter cold, but there's an easy fix\nEvery major software company has been pushing out updates to fix the problem. Make sure you allow your computers and phones to automatically install software updates and patches as they are released. These will likely be modified as companies craft the best work-arounds, so it's not likely to be a one-time deal — update early and often!\nThose on Microsoft products will needs to first determine which version of the Windows operating system they are running, then run a query on the Microsoft support site asking \"update Windows\" along with the version they're running.\nApple products will automatically update themselves, or at least prompt users to update them.\nGeorgijevic | Getty Images Google Chromebooks self update. Many, but not all, phones running the Android operating system also do, or will ask if the user wants their operating system updated. You can also go to the settings app on the phone, tap About Device and then tap System Updates to see if an update is available.\nMany security companies are suggesting users also make sure their security software is up to date. As soon as hackers create code to use this new flaw, security software will help flag and possibly stop them.\nWhat products are affected? Potentially everything that's got a central processing unit or CPU, which means PCs, Macs, laptops, smart phones and tablets. But patches are coming fast and furious.\nMicrosoft has already pushed out a patch for Windows 10 and other Windows versions will be updated on Tuesday, January 9. If you have auto updates enabled, you should get this upgrade.\nApple on Thursday said that it has already released patches in iOS 11.2, macOS 10.13.2, and tvOS 11.2 to help defend against Meltdown, and that Apple Watch is not affected by Meltdown. The upgrades come via auto updates.\nThe company plans to release mitigations in Safari to help defend against Spectre \"in the coming days,\" it said in a blog. The company also said it will continue to develop and test further patches for future updates of its operating system.\nGoogle has published a list of all its devices and software that might need updates and what users have to do to install them, though many (like Chromebooks) will self install.\nAmazon's AWS cloud computing service expected all its computing systems to be patched by the end of the day Wednesday. Customers were also told to patch their operating systems to be fully secured.\nWhat chips are affected? Intel , which makes most of the chips used in PCs, is the most heavily affected. It said Thursday it has already issued updates for the majority of CPUs — the chips that handle the instructions a computer receives from hardware and software, sometimes known as the \"brain\" of the computer — introduced within the past five years. By the end of next week it expects to have issued updates for more than 90% of processors introduced within the past five years.\nChip-maker Advanced Micro Devices , whose products are mostly used in corporate server computers and personal computers, originally said it didn't believe its products were at risk for the flaw. It has since updated that to say that one of the potential attacks could be used on some of its chips. It encouraged its customers to use safe computing practices, including \"not clicking on unrecognized hyperlinks, following strong password protocols, using secure networks, and accepting regular software updates.\"\nARM, whose chips are primarily used in smart phones and electronic devices such as e-readers, televisions, cable boxes and cars, said that only a small subset of its chips were vulnerable and listed them on its website. It has also published a technical paper outlining how the flaws can be mitigated.\nHow did this happen? There are actually two exploitable flaws, though they're related. They have been given the James Bond-esque names Meltdown and Spectre. Both use what's known as a side-channel analysis attack. Basically, malicious code can be written that allows an attacker to see information stored in what was previously believed to be a secure portion of a computer's central processing unit, or CPU.\nWhat's the problem that makes this possible? It's something no one had realized was an issue for 20-some years. Back in the early 1990s, in an effort to speed up computer processing, computer chip engineers hit on the idea of letting computers guess at what data would be needed next. It was called \"speculative execution.\" It's something like a salesperson who sees a man pick out a pair of slacks in a store and so grabs a belt and a jacket that match because they might be what he looks for next.\nboschettophotography | Getty Images In the computer, it could be that you go to the banking section of your password management program. The speculative execution function then pulls all your banking passwords into the protected memory portion of the CPU because it's making a good guess you'll ask for that next.\nMeltdown allows full access to the protected memory space, so it's potentially more dangerous. It appears to only affect Intel chips manufactured since 1995.\nSpectre allows malicious code to trick access random portions of the protected memory. It is believed to affect processors made by Intel, Advanced Micro Devices and ARM.\nThe real issue is that the flaws allow cyber criminals a new set of tools to steal passwords and other critical data.\n\"The scope impacts a large set of the computing devices that we rely on, from PC to phones and back-end services consumers rely upon, such as servers and the cloud,\" said McAfee chief technology officer Steve Grobman.\nHow much could the hackers see? The exploit could allow an attacker to open a window that let's them look at what's being rolled into and out of that protected memory space, says Atiq Raza, chairman and CEO of Virsec Systems, Inc and the former president of AMD. Depending how long the hackers can keep the window open \"they could see a very significant amount of data scroll by. Even if it's just for a few seconds, a humongous amount of information could go through,\" he said.\nHow did this exist for so long? An excellent question, which hasn't been answered yet.\nThe flaws were discovered over the last several months independently by several teams, including Google's Project Zero security team, researchers at Graz University of Technology in Austria, the University of Adelaide in Australia and the universities of Pennsylvania and Maryland, along with researchers at security firms Cyberus Technology, Rambus and Data61.\nThe researchers alerted chip and software companies, which began writing patches and fixes. Everything was supposed to be announced on January 9th.\nПавел Игнатов | Get", "external_links": ["https://www.theregister.co.uk/2018/01/02/intel_cpu_design_flaw/", "https://www.usatoday.com/story/tech/columnist/baig/2017/11/15/iphone-x-and-freezing-weather-can-smartphones-die-bitter-cold/860460001/", "https://support.apple.com/en-us/HT208394", "https://security.googleblog.com/2018/01/todays-cpu-vulnerability-what-you-need.html", "https://support.microsoft.com/en-us/help/4056892/windows-10-update-kb4056892", "https://newsroom.intel.com/news-releases/intel-issues-updates-protect-systems-security-exploits/", "https://aws.amazon.com/security/security-bulletins/AWS-2018-013/", "https://www.amd.com/en/corporate/speculative-execution", "https://developer.arm.com/support/security-update", "https://www.usatoday.com/videos/tech/2018/01/05/apple-issue-fix-against-chip-flaw-risk/109174848/", "https://www.usatoday.com/story/tech/news/2018/01/04/five-things-you-need-know-5-g/1002998001/", "https://support.microsoft.com/en-us/help/12373/windows-update-faq"], "published": "2018-01-05T15:36:00.000+02:00", "crawled": "2018-01-05T14:42:04.019+02:00", "highlightTitle": ""}