{"organizations": [], "uuid": "0d1a4c48522c98b29b04e5faa6f40f21be14312c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-oil-gulfcoast-crude/rail-shipments-of-canadian-oil-to-u-s-seen-rising-over-60-pct-idUSL1N1OZ1E9", "country": "US", "domain_rank": 408, "title": "Rail shipments of Canadian oil to U.S. seen rising over 60 pct", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T21:04:00.000+02:00", "replies_count": 0, "uuid": "0d1a4c48522c98b29b04e5faa6f40f21be14312c"}, "author": "", "url": "https://www.reuters.com/article/usa-oil-gulfcoast-crude/rail-shipments-of-canadian-oil-to-u-s-seen-rising-over-60-pct-idUSL1N1OZ1E9", "ord_in_thread": 0, "title": "Rail shipments of Canadian oil to U.S. seen rising over 60 pct", "locations": [], "entities": {"persons": [{"name": "bryan sims", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "gulf coast", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "tudor, pickering, holt & co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 7:04 PM / Updated 7 minutes ago Rail shipments of Canadian oil to U.S. seen rising over 60 pct Bryan Sims 3 Min Read \nHOUSTON, Jan 4 (Reuters) - Canadian crude shipments to the United States by rail could rise more than 60 percent this year on demand by Gulf Coast refiners for the heavy crudes and the wide differential between Canadian grades and the U.S. benchmark. \nThe rail shipments could reach as much as 350,000 barrels per day (bpd) by year end and average some 400,000 bpd in 2019, estimated analysts at Tudor, Pickering, Holt & Co. Last year, the shipments averaged 130,000 bpd, according to U.S. government data. \nCanadian crudes have been replacing heavy oil from Venezuela and Mexico at the Gulf Coast, due to production declines in both countries. \n“Canadian barrels are a great fit for Gulf Coast refiners right now. It’s just a matter of getting those barrels down here,” said a Gulf Coast trader. \nWestern Canada Select for February delivery traded Thursday at $25.05 per barrel below West Texas Intermediate, the widest since December 2014. Including transportation costs of between $11 and $14 a barrel to ship the crude by rail to the Gulf Coast, it is affordable to more refiners, said analysts and traders. \n“Based on where the differentials are today, as an oil producer, you’re incentivized to ship product by rail to the Gulf Coast,” said Matt Murphy, a Tudor Pickering researcher. \nThe current differential is driven in part by increased supplies. Canadian crude oil production averaged 4.2 million barrels per day in 2017, according to National Energy Board estimates, up from 3.9 million bpd in 2016. \nProduction is expected to rise further this year as new projects like Suncor Energy’s 190,000 bpd Fort Hills oil sands plant expand operations. \nHowever, the increase in shipments will be capped by railroad operators’ willingness to accept spot deliveries. Companies such as Canadian National Railway, have insisted on long-term crude-by-rail commitments before providing more rail capacity. \n“There is a two or three-year window, irrespective of what happens to pipelines, that rail is going to be required to move product to market,” said John Zahary, chief executive at Altex Energy, which owns five rail terminals in Canada. (Additional reporting by Nia Williams in Calgary; Editing by Tom Brown)", "external_links": [], "published": "2018-01-05T21:04:00.000+02:00", "crawled": "2018-01-05T21:15:54.030+02:00", "highlightTitle": ""}