{"organizations": [], "uuid": "520cef037217503363d9482e0a53343d49a6570b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-cambodia-politics/signs-of-division-in-cambodias-opposition-over-new-group-idUSKBN1F40OI", "country": "US", "domain_rank": 408, "title": "Signs of division in Cambodia's opposition over new group", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:27:00.000+02:00", "replies_count": 0, "uuid": "520cef037217503363d9482e0a53343d49a6570b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-cambodia-politics/signs-of-division-in-cambodias-opposition-over-new-group-idUSKBN1F40OI", "ord_in_thread": 0, "title": "Signs of division in Cambodia's opposition over new group", "locations": [], "entities": {"persons": [{"name": "kem sokha", "sentiment": "none"}, {"name": "sam rainsy", "sentiment": "none"}, {"name": "muth chantha", "sentiment": "none"}, {"name": "hun sen", "sentiment": "none"}], "locations": [{"name": "cambodia", "sentiment": "none"}], "organizations": [{"name": "phnom penh", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "cambodia national rescue party", "sentiment": "none"}, {"name": "cambodia national rescue movement", "sentiment": "none"}, {"name": "cnrp", "sentiment": "none"}, {"name": "cnrm", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHNOM PENH (Reuters) - Signs of division emerged among opponents of long-serving Cambodian Prime Minister Hun Sen on Monday after prominent exiles said they had founded a new movement following a ban on the main opposition party.\nHun Sen, who celebrated 33 years in power on Sunday, has become a master at dividing his opponents and using force and legal measures to neutralize challenges to his rule.\nThe new opposition movement was announced at the weekend by Hun Sen’s veteran foe Sam Rainsy following the dissolution of the Cambodia National Rescue Party (CNRP) last year and the arrest of its leader, Kem Sokha.\nBut Kem Sokha’s former cabinet chief said there was no need for the new Cambodia National Rescue Movement (CNRM).\n“The CNRP represents the will of the more than three million people who voted for it, so we continue to move forward within the framework of the CNRP, without changing,” Muth Chantha said on Facebook.\nThe CNRP was dissolved after the arrest of Kem Sokha, who was accused of plotting to take power with American help - charges he says were politically motivated because the threat the party posed to Hun Sen at this year’s election.\nThe dissolution of the party and arrest of Kem Sokha have been condemned by Western aid donors who have said the election cannot now be credible. Hun Sen, 65, is expected to win easily.\nThe CNRP was set up in 2012 to unify Sam Rainsy’s and Kem Sokha’s separate parties. Its success in a 2013 general election and local elections last year had shown what a powerful electoral force it had become.\nSam Rainsy served as finance minister in an ill-fated coalition set up when Hun Sen refused to give up power after losing a U.N.-organized election in 1993.\nHe has lived in France since 2015 to avoid a series of convictions he says were politically motivated.\nSam Rainsy said on Sunday the new CNRM could launch appeals to the people to organize peaceful protests, to workers to go on strike and to the armed forces to join them - although at this stage it has made no specific call for action.\nOn the streets of the capital, Phnom Penh, an opposition stronghold, the formation of the new movement met scepticism from CNRP supporters.\n“Even though people are still with the opposition party, they want to stay quiet, people are afraid to protest,” said Phat Sokan, a 38-year old vegetable seller.\nHing Soksan, the former director of the youth wing of the CNRP, urged Sam Rainsy to reconsider the move and said the new movement would also endanger former CNRP members.\n“A majority of the masses expressed disapproval and asked why this movement is set up under these circumstances,” he said.\nSam Rainsy and another senior opposition politician, Mu Sochua, who are members of the movement, did not respond immediately to requests for comment on the signs of division.\nA government spokesman described the new movement as “desperate” on Sunday, adding that the Supreme Court had banned 118 of the CNRP’s senior members from politics ahead of the general election on July 29.\nEditing by Matthew Tostevin, Robert Birsel\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T15:27:00.000+02:00", "crawled": "2018-01-15T09:31:48.004+02:00", "highlightTitle": ""}