{"organizations": [], "uuid": "67cd3f1c5b32ad90933f9b80de90d79c6836ceb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928183-RTS1L3DX.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/why-2018-will-not-be-another-perfect-year-for-stocks.html", "country": "US", "domain_rank": 767, "title": "Why 2018 will not be another perfect year for stocks", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.064, "site_type": "news", "published": "2018-01-16T10:21:00.000+02:00", "replies_count": 0, "uuid": "67cd3f1c5b32ad90933f9b80de90d79c6836ceb1"}, "author": "Karen Tso", "url": "https://www.cnbc.com/2018/01/16/why-2018-will-not-be-another-perfect-year-for-stocks.html", "ord_in_thread": 0, "title": "Why 2018 will not be another perfect year for stocks", "locations": [], "entities": {"persons": [{"name": "peter tuchman", "sentiment": "negative"}, {"name": "andrew kelly", "sentiment": "negative"}, {"name": "goldilocks", "sentiment": "none"}, {"name": "ralph jainz", "sentiment": "none"}, {"name": "jainz", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "centricus asset management", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stock markets are rallying, central banks are drifting to the exit as low inflation persists and economies are enjoying the benefits of synchronized growth — what could possibly go wrong?\nSurely 2018 is another so-called \"Goldilocks\" year for investors — not too hot, not too cold ... just right, which means profits for retail investors arriving late to the party.\nNot so fast, warns one hedge fund. 2018 is the opposite of Goldilocks said Ralph Jainz, fund manager at Centricus Asset Management, in a recent interview on CNBC. He warned companies are facing growing wage pressures and will either pass on those higher costs, lifting inflation or they will assume cost pressures and face lower margins.\nU.S. margins peaked nearly two years ago and Europe is also likely to have seen the best of the margin cycle, said Jainz. If he's right the picture is alarming as it suggests more inflation could trigger more interest rate hikes than the market expects. The other scenario that profit margins are at risk is also worrying, given investors are already nervously looking for earnings season to justify gains.\nExactly where does one look for signs of a market rolling over? Jainz nominated small-cap stocks, given three small-cap indexes all peaked in June 2007.\nThere are conflicting views though which are testing the notion that Goldilocks is indeed finished. One is that corporates have a trick or two up their sleeve to tackle wage pressures and another more popular view is that the inflation mystery continues to confound central bankers while rewarding investors.\nTake the first point. U.K. grocer Sainsbury revealed its strategy last week with CEO Mike Coupe telling CNBC it had covered a 4 percent pay rise for staff with further cost cutting. Cutting to spend is a long adopted strategy by the C-suite, but in some sectors investors would be right to ask, how much more cost-cutting can be achieved?\nCompanies can also spend to cut costs, which many have avoided since the financial crisis. But the U.S. tax overhaul could be the trigger. Steve Blitz, chief U.S. economist of TS Lombard, believes margins will hold together as companies faced with wage pressure will spend on investment. Capital expenditure (capex) these days, often means buying equipment for automation, reducing the need for as many workers, removing higher wage demands. The President Donald Trump administration has another view that the tax bill will simply create \"jobs, jobs, jobs.\"\nSkeptics though dismiss the above. Carl Weinberg, of High Frequency Economics, believes wage pressure will not materialize and corporates will not significantly increase capex much like 2017, which he acknowledges will keep Goldilocks in play for markets.\nWhile recruitment agencies and companies warn of a lack of skilled employees to fulfil positions, data reveal little wage pressures. Take the recent JOLTS report, a closely watched measure of the labor market by the Federal Reserve . There was a slight drop in the number of people quitting positions, leaving the so-called quits rate unchanged for a third month in a row. Lower turnover reduces pressure on employers to lift wages.\nThe conclusion? 2018 is not an easy read and the market promises too many adventures for investors to be comfortable about a fairy tale ending.\nKaren Tso is an anchor on Squawk Box Europe, CNBC and you can follow her on Twitter @cnbckaren .", "external_links": [], "published": "2018-01-16T10:21:00.000+02:00", "crawled": "2018-01-16T10:30:15.020+02:00", "highlightTitle": ""}