{"organizations": [], "uuid": "9ea0b3e2bd33cb78e3de35a3fe463499ad76f4dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 23}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC765_3e51U_TOP_20180122170158.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7455.xml", "section_title": "WSJ.com: WSJD", "url": "https://www.wsj.com/articles/adobe-cfo-garrett-to-retire-company-books-charge-and-raises-guidance-1516660948", "country": "US", "domain_rank": 387, "title": "Adobe CFO Garrett to Retire, Company Books Charge and Raises Guidance", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:42:00.000+02:00", "replies_count": 0, "uuid": "9ea0b3e2bd33cb78e3de35a3fe463499ad76f4dd"}, "author": "Maria Armental", "url": "https://www.wsj.com/articles/adobe-cfo-garrett-to-retire-company-books-charge-and-raises-guidance-1516660948", "ord_in_thread": 0, "title": "Adobe CFO Garrett to Retire, Company Books Charge and Raises Guidance", "locations": [], "entities": {"persons": [{"name": "garrett", "sentiment": "negative"}, {"name": "mark garrett", "sentiment": "negative"}, {"name": "shantanu narayen", "sentiment": "none"}, {"name": "mike", "sentiment": "none"}, {"name": "mike dillon", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "systems inc.", "sentiment": "negative"}, {"name": "company books charge and raises guidance", "sentiment": "negative"}, {"name": "emc software group", "sentiment": "none"}, {"name": "emc corp", "sentiment": "none"}, {"name": "adobe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS Mark Garrett, the finance chief who led Adobe ADBE 1.12% Systems Inc.’s transition to a subscription business model , is retiring after more than a decade in the role. \nThe cloud-based software provider said Monday that Mr. Garrett, 60 years old, and general counsel Mike Dillon, 59, will retire later this year, but both will remain in their posts until successors are appointed.\n“Mark and Mike have been phenomenal leaders and have played a pivotal role in making Adobe the company it is today. I’m grateful to both of them for their many contributions to Adobe’s growth and future success,” said Chief Executive Shantanu Narayen in prepared remarks. The company said it is searching for replacements for both.\nMr. Garrett led Adobe’s shift from selling consumers shrink-wrapped disks of photo and video-editing software to selling monthly subscriptions to its suite of cloud-based software. The move was later copied by others in the industry. \nAdobe’s creative business revenue, which totaled $2.3 billion in 2012, dipped to $1.8 billion in 2014 during the transition before climbing to $4.2 billion in fiscal 2017, said Jennifer Lowe, analyst at UBS AG. \n“It’s no small feat, it could easily derail many a CFO,” Ms. Lowe said. “Adobe is the poster child for how to do it right.”\nAdobe transformed from a feast or famine company that relied on the launch of blockbuster products every few years to drive an influx of revenue to a more predictable business that collects monthly income from its expanding base of subscribers, analysts said.\nOver Mr. Garrett’s tenure Adobe’s recurring revenue grew to account for 85% of overall revenue, up from 5% more than a decade ago.\nRelated Coverage \nStop Using Excel, Finance Chiefs Tell Staffs (Nov. 29, 2017) Adobe’s Cloud Hits First Headwind (Sept. 20, 2017) Adobe Is a Bright Spot in the Cloud (June 21, 2017) “The way Mark helped guide investors through Adobe’s business transformation was exceptional,” said Kirk Materne, senior managing director at Evercore ISI. “He helped make it a much more digestible transition as he understood the optics around the income statement weren’t necessarily going to tell the whole story.”\nThe shift made Adobe a pioneer among its peers as other software makers followed suit and often consulted Mr. Garrett on how to navigate the change, analysts said.\n“Mark Garrett is the Tom Brady of software CFOs—at the top of his game,” said Brent Thill, managing director at Jefferies. \nPrior to joining Adobe in 2007 Mr. Garrett was senior vice president and chief financial officer at EMC Software Group, within EMC Corp. \nAdobe also said Monday it will book a roughly $85 million one-time charge in the first quarter tied to recent changes in U.S. tax law.\nBut the changes, the company said, are expected to drive “a significant increase” in earnings in fiscal 2018 as it benefits from a reduction in the corporate tax rate.\nAdobe now expects to earn $4.72 a share, or $6.20 a share on an adjusted basis, up from its previous forecast of $4.40 a share, or $5.50 as adjusted. Revenue is expected to reach about $8.73 billion.\nIn the first quarter, the company expects to earn $1.05 a share, or $1.43 a share as adjusted. It had previously forecast a profit of $1.15 a share, or $1.27 adjusted.\n“With ready access to our offshore cash, we will continue to evaluate investment opportunities to grow our business,” said Mr. Garrett in prepared remarks, adding the company is “actively expanding our campuses in the Bay Area and Utah to accommodate the growth of our employee base.”\nAs of Dec. 1, Adobe had about $5.82 billion in cash, with roughly 89% of that held offshore.\nShares rose 2.3% to $202.30 in after-hours trading.\nWrite to Tatyana Shumsky at tatyana.shumsky@wsj.com and Maria Armental at maria.armental@wsj.com", "external_links": [], "published": "2018-01-23T00:42:00.000+02:00", "crawled": "2018-01-23T01:20:23.014+02:00", "highlightTitle": ""}