{"organizations": [], "uuid": "3872afe5391d0e75bcb09645c738947fb642c9e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-venezuela-politics-factbox/factbox-venezuelas-jailed-exiled-or-barred-opposition-politicians-idUSKBN1FC2OG", "country": "US", "domain_rank": 408, "title": "Factbox: Venezuela's jailed, exiled or barred opposition politicians", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.036, "site_type": "news", "published": "2018-01-24T02:58:00.000+02:00", "replies_count": 0, "uuid": "3872afe5391d0e75bcb09645c738947fb642c9e2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-venezuela-politics-factbox/factbox-venezuelas-jailed-exiled-or-barred-opposition-politicians-idUSKBN1FC2OG", "ord_in_thread": 0, "title": "Factbox: Venezuela's jailed, exiled or barred opposition politicians", "locations": [], "entities": {"persons": [{"name": "capriles", "sentiment": "none"}, {"name": "leopoldo lopez", "sentiment": "none"}, {"name": "maduro", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "miranda", "sentiment": "none"}, {"name": "henrique capriles capriles", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Venezuela’s most popular opposition leaders are almost all sidelined from the upcoming presidential election - jailed, in exile, or disqualified from holding office.\nThat has left the coalition lacking an obvious flagbearer for the vote, due by the end of April, in which leftist President Nicolas Maduro is widely expected to run for a second term in the OPEC nation of 30 million people.\nThe following is the situation of some main opposition leaders:\nHENRIQUE CAPRILES Capriles, 45, is a two-time presidential candidate who has long reached out to disaffected government supporters, especially in Venezuela’s poor “barrios.”\nHe is the closest the opposition has come to clinching the presidency, losing narrowly to Maduro in a 2013 vote.\nAlong with Leopoldo Lopez, Capriles is considered Venezuela’s most popular opposition politician, though some activists have criticized him for being too moderate.\nThe national comptroller’s office last year barred Capriles, a lawyer and former governor of Miranda state, from holding any public office for 15 years, citing alleged mishandling of donations and other administrative irregularities.\nHowever, Capriles - a sports fanatic who helped found the opposition party Justice First - remains an active figure in the political scene and still aspires to be president.\nLEOPOLDO LOPEZ Lopez, 46, advocates hardline resistance to the government. In 2014, he was jailed for championing anti-Maduro protests, and later sentenced to 15 years in prison on charges of fomenting violence and terrorism. He is currently under house arrest.\nLopez’ political career took off during an eight-year tenure as the popular mayor of Caracas’ wealthy Chacao municipality which ended a decade ago.\nBut the photogenic U.S.-educated politician was then barred from running for another term over corruption allegations.\nA prosecutor who helped lead the trial against Lopez later fled abroad and accused the socialist government of pressing him to use false evidence.\nANTONIO LEDEZMA Antonio Ledezma, a 62-year-old lawyer and former mayor of Caracas, recently fled house arrest by escaping by land over the Colombian border. He then flew to Spain, where he has been mobilizing opposition supporters.\nHe is a veteran politician derided by the government as a “vampire.” Ledezma entered politics before the election of late leader Hugo Chavez in 1998.\nHe was a member of the Democratic Action party, which for decades dominated Venezuela’s politics but has fallen out of favor with the young. He recently founded his own party, Alliance of the Courageous People.\nFREDDY GUEVARA Freddy Guevara is a 31-year-old former student leader who went on to be congressional vice-president and a top leader of the Popular Will party. He was also a leader of the 2017 political protests, often on the front lines.\nGuevara sought refuge in the Chilean ambassador’s residence in Caracas in November amid fears he could be jailed.\nRAMON MUCHACHO Ramon Muchacho, also a former mayor of Chacao, fled to Miami in August after he was sentenced by Venezuela’s top court to 15 months in jail.\nThe Supreme Court alleged the 45-year-old failed to suppress last year’s massive anti-Maduro rallies in Chacao, a hotbed of opposition activism.\nThe lawyer is a member of Capriles’ Justice First party.\nDAVID SMOLANSKY A 32-year-old journalist and former mayor of the wealthy hillside El Hatillo district of Caracas, Smolansky was sentenced to 15 months in jail last year. After going into hiding, he fled Venezuela via the Brazilian border.\nThe former student leader is a member of the militant Popular Will party.\nReporting by Andreina Aponte and Leon Wietfeld; editing by Alexandra Ulmer and Girish Gupta\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T02:58:00.000+02:00", "crawled": "2018-01-24T15:52:50.004+02:00", "highlightTitle": ""}