{"organizations": [], "uuid": "36ae68e943acde83cc7b8b9a7f89a6c9ece204a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222950293&w=1200&r=LYNXMPEE0H0DJ", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/bollywood-padmaavat-bhansali-padman/padmaavat-takes-on-padman-in-2018s-first-bollywood-showdown-idUSKBN1F70OU", "country": "US", "domain_rank": 408, "title": "'Padmaavat' takes on 'Padman' in 2018's first Bollywood showdown", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.787, "site_type": "news", "published": "2018-01-18T15:07:00.000+02:00", "replies_count": 0, "uuid": "36ae68e943acde83cc7b8b9a7f89a6c9ece204a9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/bollywood-padmaavat-bhansali-padman/padmaavat-takes-on-padman-in-2018s-first-bollywood-showdown-idUSKBN1F70OU", "ord_in_thread": 0, "title": "'Padmaavat' takes on 'Padman' in 2018's first Bollywood showdown", "locations": [], "entities": {"persons": [{"name": "arunachalam muruganantham", "sentiment": "none"}, {"name": "sonam kapoor", "sentiment": "none"}, {"name": "akshay kumar", "sentiment": "none"}, {"name": "sanjay leela bhansali", "sentiment": "none"}, {"name": "r. balki", "sentiment": "none"}, {"name": "radhika apte", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A controversial period drama based on a Rajput queen will clash with a biopic on the manufacturer of low-cost sanitary pads when two of the year’s biggest Bollywood films open ahead of India’s Republic Day weekend.\nFilm-maker Sanjay Leela Bhansali’s “Padmaavat”, originally titled “Padmavati”, had been slated to release on Dec. 1 before a row over its historical content forced its makers to delay the film. The new release date of Jan. 25 was announced on Sunday, which means it will now go head-to-head with R. Balki’s “Padman” in a box office battle likely to affect revenues.\n“Padman”, which had first dibs on the holiday weekend, tells the story of Arunachalam Muruganantham, the man behind a low-cost machine for manufacturing sanitary napkins in rural India.\nThe film’s unusual storyline and its cast of Akshay Kumar, Sonam Kapoor and Radhika Apte led to it being billed as a sure-fire winner at the Indian box office. The makers of at least one Bollywood challenger - the espionage thriller “Aiyaari” - postponed its release to give “Padman” free rein over the extended Republic Day weekend.\nThat was until the long-delayed historical epic “Padmaavat” arrived on the scene.\n“When two big films release on the same day, they both suffer because audiences are divided,” said Girish Johar, a film and trade analyst. “‘Padmaavat’ is a big release and has a big budget, so ideally it needed a solo release date.”\nThe film ran into trouble when Rajput organisations critical of the project accused director Bhansali of distorting history by showing Muslim ruler Alauddin Khilji as the “lover” of Queen Padmavati.\nA man walks past a poster of the Bollywood movie 'Padmavati' outside a theatre in Mumbai, November 21, 2017. The film has been renamed 'Padmaavat'. REUTERS/ Danish Siddiqui/Files Members of hardline Hindu fringe groups as well as the ruling Bharatiya Janata Party criticised it. India’s censors cleared the film ahead of the new year, suggesting modifications including changing the name to “Padmaavat” from “Padmavati” to reflect that the source material was the epic poem and not actual historical events.\nBut the modifications have not placated protesters. A school in Madhya Pradesh was vandalized this week after students danced to a song from the film. At least four states, including Madhya Pradesh banned the film citing security threats. On Thursday, the Supreme Court struck down the bans as illegal, a day after the producers of “Padmaavat” moved the top court.\nThe spectre of violence would still hang over “Padmaavat” when it opens in cinemas.\n“Any possibility of violence at theatres will be a deterrent for people to go to theatres, and could affect ‘Padman’ collections as well, but that is something we will know only on the day of release,” said Vajir Singh, a trade analyst.\nBhansali is no stranger to box office clashes. His 2015 film “Bajirao Mastani” opened in cinemas along with actor Shah Rukh Khan’s “Dilwale”, in a repeat of the 2007 clash pitting Bhansali’s “Saawariya” against Khan-starrer “Om Shanti Om”.\nStudios behind most big-ticket Bollywood films announce release dates a year in advance, booking slots on coveted holiday weekends. Analysts say releasing movies together hurts both films, leading to fewer ticket sales than an otherwise solo release.\n“There are just 52 weeks in a year, and it is obvious that some films will clash,” said Singh. “This doesn’t always work when it comes to bigger films, which have bigger budgets and therefore need a clear window to recover their costs.”\nEditing by Tony Tharakan; The views expressed in this article are not those of Reuters News. This article is website-exclusive and cannot be reproduced without permission\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T15:07:00.000+02:00", "crawled": "2018-01-19T12:30:14.112+02:00", "highlightTitle": ""}