{"organizations": [], "uuid": "ecf41658d189347129a57c130b89da09ea177de5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/619463438.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/05/peter-thiel-rebekah-mercer-news/", "country": "US", "domain_rank": 1196, "title": "Peter Thiel Reportedly Interested in Starting Conservative News Outlet | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.111, "site_type": "news", "published": "2018-01-06T02:00:00.000+02:00", "replies_count": 0, "uuid": "ecf41658d189347129a57c130b89da09ea177de5"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/05/peter-thiel-rebekah-mercer-news/", "ord_in_thread": 0, "title": "Peter Thiel Reportedly Interested in Starting Conservative News Outlet | Fortune", "locations": [], "entities": {"persons": [{"name": "peter thiel", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "saul loeb", "sentiment": "none"}, {"name": "roger ailes", "sentiment": "none"}, {"name": "ailes", "sentiment": "none"}, {"name": "thiel", "sentiment": "none"}, {"name": "mercer", "sentiment": "none"}], "locations": [{"name": "washington, dc", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "mercer family", "sentiment": "negative"}, {"name": "trump white house", "sentiment": "none"}, {"name": "paypal", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "facebook inc.", "sentiment": "none"}, {"name": "national press club", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Television Peter Thiel Looking to Start Conservative News Outlet Backed by Mercer Family, Report Says Peter Thiel, PayPal founder-turned-venture-capitalist, discusses his support for US Republican presidential nominee Donald Trump, at the National Press Club in Washington, DC, October 31, 2016. Saul Loeb—AFP/Getty Images By Bloomberg 12:55 PM EST \nBillionaire investor Peter Thiel is exploring starting a conservative news outlet, with backing from the powerful Mercer family and a cast of Fox News celebrities, according to revelations in a new book and a report from BuzzFeed News. Last May, Thiel was set to meet with former Fox News Chairman Roger Ailes to discuss the idea, according to an excerpt of the book, “Fire and Fury: Inside the Trump White House,” by the journalist Michael Wolff. But two days before the scheduled meeting, Ailes fell, hit his head and went into a coma, and died soon thereafter. \nNonetheless, Thiel, one of Facebook Inc.’s earliest backers and a prominent conservative activist, has continued to pursue the idea, according to BuzzFeed News, and is talking with the Mercer family about helping to back it. A spokesman for Thiel declined to comment. \nRobert Mercer, a hedge fund mogul, was a major backer of U.S. President Donald Trump and bankrolled conservative news outlet Breitbart News. In November, he said he would step down from Renaissance Technologies, where he was co-chief executive officer and sell his stake in Breitbart News to his daughters, including Rebekah Mercer, who served on Trump’s transition team. The Mercer family didn’t immediately respond to a request for comment. \nAiles, who launched Fox News in 1996 but resigned in July 2016 after several women accused him of sexual harassment, had intended to bring star Fox anchors to the planned news outlet, Wolff writes. The potential talent included Sean Hannity and Bill O’Reilly. O’Reilly was also fired from Fox over allegations of harassment. \nThiel, who brought Trump some rare support from Silicon Valley during the 2016 campaign and the early days of his presidency, was warned by another billionaire not to take any offers of Trump’s friendship too seriously. But Thiel “was certain of Trump’s sincerity when he said they’d be friends for life — only never to basically hear from him again or have his calls returned,” Wolff writes. \nThiel also would back former Trump aide Steve Bannon in any potential bid for president in 2020, as would other big conservative donors like casino magnate Sheldon Adelson and the Mercers, Wolff writes. Bannon was a key source for Wolff’s book and was quoted making many disparaging remarks about the president and his family. On Wednesday night, Trump’s lawyers sent Bannon a cease and desist order to attempt to prevent him from making any more comments about the Trumps. \nThiel’s interest in journalism goes back to his college days at Stanford University, where he founded the Stanford Review, a libertarian newspaper. More recently, he funded a lawsuit that bankrupted media company Gawker, which had outed him as gay more than a decade ago. He has placed a bid for Gawker’s archives. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-06T02:00:00.000+02:00", "crawled": "2018-01-05T20:41:26.000+02:00", "highlightTitle": ""}