{"organizations": [], "uuid": "4967a7c1927b56cee9206f10296143dbe4b2604b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224273733&w=1200&r=LYNXMPEE0L22I", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-sec-blockchain/sec-is-scrutinizing-overnight-blockchain-companies-chairman-idUSKBN1FB2XI", "country": "US", "domain_rank": 408, "title": "SEC is scrutinizing overnight blockchain companies: chairman", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T23:39:00.000+02:00", "replies_count": 0, "uuid": "4967a7c1927b56cee9206f10296143dbe4b2604b"}, "author": "", "url": "https://www.reuters.com/article/us-usa-sec-blockchain/sec-is-scrutinizing-overnight-blockchain-companies-chairman-idUSKBN1FB2XI", "ord_in_thread": 0, "title": "SEC is scrutinizing overnight blockchain companies: chairman", "locations": [], "entities": {"persons": [{"name": "jay clayton", "sentiment": "none"}, {"name": "clayton", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}, {"name": "crypto company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 39 PM / in 7 minutes SEC is scrutinizing overnight blockchain companies: chairman Reuters Staff 2 Min Read \nWASHINGTON (Reuters) - The U.S. Securities and Exchange Commission (SEC) is scrutinizing public companies that change their name or business model in a bid to capitalize upon the hype surrounding blockchain technology, SEC Chairman Jay Clayton said on Monday. \nDozens of little-known companies across the globe have seen their share prices leap in recent months after unveiling plans to enter the bitcoin industry or that of its underlying distributed ledger blockchain technology. \nIn December, the SEC temporarily suspended trading in the shares of Crypto Company ( CRCW.PK ), a small firm that saw its stock rise more than 2,700 percent after signing a deal to buy a cryptocurrency data platform. \nClayton warned that it was not acceptable for companies without a meaningful track record in the sector to dabble in blockchain technology, change their name and immediately offer investors securities without providing adequate disclosures around the risks involved. \n“The SEC is looking closely at the disclosures of public companies that shift their business models to capitalize on the perceived promise of distributed ledger technology and whether the disclosures comply with the securities laws, particularly in the case of an offering,” he told a conference on Monday. \nThe chairman also said the SEC had seen “disturbing” evidence that legal professionals have been wrongly counseling clients that initial coin offerings, whereby cryptocurrency start-ups solicit funds from investors who receive tokens in return, do not need to comply with federal securities law. \nThe SEC has previously said that such fundraisings should comply with securities law and has warned investors more broadly over the risks of cryptocurrency fraudsters. \n“I have instructed the SEC staff to be on high alert for approaches to ICOs that may be contrary to the spirit of our securities laws and the professional obligations of the U.S. securities bar,” Clayton said. Reporting by Michelle Price; Editing by Marguerita Choy", "external_links": [], "published": "2018-01-22T23:39:00.000+02:00", "crawled": "2018-01-22T23:45:20.010+02:00", "highlightTitle": ""}