{"organizations": [], "uuid": "6e63ed992e6950d6f73dc60633a39533742e1d2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2016/11/gettyimages-623402804.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/05/intel-ceo-stock-security-flaws/", "country": "US", "domain_rank": 1196, "title": "Intel CEO Sold Half Of Stock Before Security Flaws Became Public | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.119, "site_type": "news", "published": "2018-01-06T18:17:00.000+02:00", "replies_count": 0, "uuid": "6e63ed992e6950d6f73dc60633a39533742e1d2a"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/05/intel-ceo-stock-security-flaws/", "ord_in_thread": 0, "title": "Intel CEO Sold Half Of Stock Before Security Flaws Became Public | Fortune", "locations": [], "entities": {"persons": [{"name": "brian krzanich", "sentiment": "negative"}, {"name": "krzanich", "sentiment": "none"}, {"name": "kirsten korosec", "sentiment": "none"}, {"name": "spectre", "sentiment": "none"}], "locations": [{"name": "automobility la", "sentiment": "none"}], "organizations": [{"name": "fortune intel intel", "sentiment": "negative"}, {"name": "intel", "sentiment": "negative"}, {"name": "intel corp.", "sentiment": "none"}, {"name": "bloomberg bloomberg", "sentiment": "none"}, {"name": "motley fool", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Intel Intel CEO Sold Half Of His Stock Before Security Flaws Became Public Brian Krzanich, chief executive officer of Intel Corp., speaks during Automobility LA. The company announced at CES the launch of a new automated driving brand called Intel GO. Bloomberg Bloomberg via Getty Images By Kirsten Korosec January 5, 2018 \nIntel CEO Brian Krzanich sold half of his stock several months after learning there were security flaws in billions of microchips across the industry, raising questions about the timing of the sale and his confidence in the company. \nKrzanich sold the most stock as allowed under corporate bylaws in November, reported the Motley Fool last month before the security flaws became public. He now holds only the minimum number of shares he’s required to own. \nIntel insists that Krzanich’s stock sale is unrelated to the discovery of two security flaws in the majority of computer chips could leave computers, servers, and mobile devices open to an attack by hackers. Researchers found the flaws, named Meltdown and Spectre, are related to how the chips are designed. \nIntel revealed Wednesday that most of the processors running the world’s computers and smartphones have a security flaw that makes them vulnerable to attack . Intel says it’s working with rivals and partners on a fix. The flaw affected chips from Intel and mobile chip designer ARM Holdings. \n“Brian’s sale is unrelated,” and Intel spokeswoman said in an email. “It was made pursuant to a pre-arranged stock sale plan (10b5-1) with an automated sale schedule. He continues to hold shares in-line with corporate guidelines.” \nThe stock sale in late November occurred more than five months after Intel was alerted to flaws in its chips. Krzanich had scheduled those sales on October 30. The security flaws became public on Wednesday. It’s common for a company dealing with security flaws to sit on the information in hopes of fixing the problem before hackers discover the vulnerabilities. \nKrzanich sold shares 21 times during 2017, according to filing with the Securities and Exchange Commission. \nIntel said Thursday that it has developed and is now issuing updates for all types of Intel-based computer systems, including personal computers and servers that will render those systems immune from both exploits referred to as “Spectre” and “Meltdown.” \nAn internal memo, which CNBC received and reported on, suggests Krzanich is bullish on the company’s future (stock sale aside). He noted in the memo that the biggest opportunities are in connected devices, artificial intelligence, and autonomous driving—anything that produces data. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-06T18:17:00.000+02:00", "crawled": "2018-01-06T01:40:08.025+02:00", "highlightTitle": ""}