{"organizations": [], "uuid": "e41a8f729f676c3273ab5320fc59c8b805051dea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-pendo-systems-hires-philip-filleul--adding-deep-data-and-regulatory-expertise-to-its-expanding-team.html", "country": "US", "domain_rank": 767, "title": "Pendo Systems Hires Philip Filleul - Adding Deep Data and Regulatory Expertise to Its Expanding Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T21:15:00.000+02:00", "replies_count": 0, "uuid": "e41a8f729f676c3273ab5320fc59c8b805051dea"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-pendo-systems-hires-philip-filleul--adding-deep-data-and-regulatory-expertise-to-its-expanding-team.html", "ord_in_thread": 0, "title": "Pendo Systems Hires Philip Filleul - Adding Deep Data and Regulatory Expertise to Its Expanding Team", "locations": [], "entities": {"persons": [{"name": "pendo", "sentiment": "none"}, {"name": "philip filleul", "sentiment": "none"}, {"name": "patni", "sentiment": "none"}, {"name": "phil", "sentiment": "none"}, {"name": "pam pecs cytron", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "montclair", "sentiment": "none"}, {"name": "pendo", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}], "organizations": [{"name": "pendo systems", "sentiment": "negative"}, {"name": "pendo systems hires philip filleul - adding deep data", "sentiment": "negative"}, {"name": "financial services", "sentiment": "none"}, {"name": "sun microsystems", "sentiment": "none"}, {"name": "cray", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONTCLAIR, N.J., Jan. 10, 2018 /PRNewswire/ -- Pendo Systems is pleased to announce industry veteran, Philip Filleul has joined their growing business development team as a Sales Engineer. Based in Pendo's Charlotte office, Phil reports directly to CEO Pam Pecs Cytron and will be responsible for driving new business sales in the banking and capital markets segments.\nPhil has a deep understanding of how the financial services industry operates as well as the importance of adopting new technologies to effect much-needed change in the industry. It's here where his 20+ years' experience combined in both banking and capital markets will most benefit Pendo. Most recently, Phil has been focused on sell-side institution's large risk grid workloads, quantitative fund backtesting as well as, large-scale analytics workloads.\nPhil joins Pendo from Cray where he was Global Director for their Financial Services group. His in-depth understanding of compliance and regulation was drawn from his time at Sun Microsystems, where amongst other roles, he was head of MiFID. He also ran iGate Patni's reference data business.\nA British national, Phil has a Master's degree from Cambridge University UK in Computer Science.\nPendo CEO, Pam Pecs Cytron said: \"We are currently inundated with new business inquiries and are delighted Phil has agreed to join us. Given his extensive background in this arena, he will hit the ground running and will help us to close many of the opportunities we currently have. His knowledge and experience in reference data, data management, data governance, risk and regulatory compliance will be invaluable as we develop deeper relationships with our growing customer base. Phil's exposure to technologies such as; deep learning, Hadoop big data, relational DBMS, middleware stacks, graph databases and micro-services are also valuable assets for the firm.\"\nPendo Systems\nThe Pendo Machine Learning Platform (PMLP) is a data management and intelligence platform that provides exploration, discovery and analysis capabilities across multiple, disparate sources of unstructured data. It transforms unstructured data into AI ready datasets at machine scale and significantly improves on standard NLP libraries by applying real-world, customer training data – improving accuracy to over 95%. Headquartered in New Jersey with offices in Charlotte, NC, the senior management team brings decades of experience developing, selling and supporting enterprise-grade software solutions to global banks, insurance companies, and asset management firms. The firm prides itself on maintaining its agile development philosophy in order to address the ever-changing environment of the financial services industry.\nPendo Systems is certified as a Women's Business Enterprise by the Women's Business Enterprise National Council (WBENC), the nation's largest third-party certifier of the businesses owned and operated by women in the United States.\nFor press information\nClare Walsh | clare@adessotech.co.uk | +44 7768 770757\nHannah Pewter | hannah@adessotech.co.uk | +44 7500 905415\nFor company information\nPhilip Smith prsmith@pendosystems.com | 646.354.0067\nView original content with multimedia: http://www.prnewswire.com/news-releases/pendo-systems-hires-philip-filleul---adding-deep-data-and-regulatory-expertise-to-its-expanding-team-300580779.html\nSOURCE Pendo Systems", "external_links": ["http://www.prnewswire.com/news-releases/pendo-systems-hires-philip-filleul---adding-deep-data-and-regulatory-expertise-to-its-expanding-team-300580779.html"], "published": "2018-01-10T21:15:00.000+02:00", "crawled": "2018-01-10T23:31:17.003+02:00", "highlightTitle": ""}