{"organizations": [], "uuid": "95a959d9a4de2d4eea62efb20949a233df45aeac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/wendys-steak-umm.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/06/wendys-steak-umm-twitter-flame-war/", "country": "US", "domain_rank": 1196, "title": "Wendy's and Steak-Umm Have Beef. It's What's Wrong With Twitter | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-06T15:57:00.000+02:00", "replies_count": 0, "uuid": "95a959d9a4de2d4eea62efb20949a233df45aeac"}, "author": "David Z. Morris", "url": "http://fortune.com/2018/01/06/wendys-steak-umm-twitter-flame-war/", "ord_in_thread": 0, "title": "Wendy's and Steak-Umm Have Beef. It's What's Wrong With Twitter | Fortune", "locations": [], "entities": {"persons": [{"name": "wendy", "sentiment": "neutral"}, {"name": "david z. morris", "sentiment": "none"}, {"name": "don rickles", "sentiment": "none"}, {"name": "steak-umm", "sentiment": "none"}], "locations": [], "organizations": [{"name": "great wendy", "sentiment": "negative"}, {"name": "wendy", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Great Wendy’s-Steak-Umm Flame War Captures Some of Twitter’s Biggest Problems Wendy's and Steak-Umm, fighting on Twitter. Twitter By David Z. Morris 1:57 PM EST \nOn Thursday, a strange Twitter battle erupted between Wendy’s, the global burger chain, and Steak-Umm, an innovation of frozen beef science . The sharp-edged exchange exemplified some of the risks brands are willing to take to get traction on the platform, and several serious problems Twitter itself is struggling to come to grips with. \nIt all started with Roast Day. Wendy’s is notorious for a quippy, snarky Twitter presence described as “savage” by no less an authority than BuzzFeed . Its declaration of ‘National Roast Day’ was an offer to playfully insult all comers, in the style of the late, great Don Rickles. Start the grill! It’s #NationalRoastDay \n— Wendy's (@Wendys) January 4, 2018 \nThings go darker quickly, though, when the corporate account for Steak-Umm challenged Wendy’s to “see if you can turn our frozen beef sheets into roast beef you corporate cowards.” \nWendy’s immediately shot back that “You aren’t verified because your tweets are just a bunch of try hard edgelord fodder. Quit trying to sit at the table with the big kids.” I don't think anyone anticipated this stage of corporate dystopia pic.twitter.com/h9FlZZJP3O \n— Ken Klippenstein (@kenklippenstein) January 4, 2018 \nThe exchange continued for a half-dozen more messages, with Steak-Umm at one point referring to Wendy’s as “an old queen trying desperately to hold on to your crown.” \nIf it was supposed to be a good-natured roast, it definitely didn’t stay that way. \nThe whole thing would be horrifying, if not outright incomprehensible, to a conventionally upbeat advertising agency. But it’s par for the course on Twitter, where brands – and other prominent figures – have gained huge traction by adopting personas on the spectrum between semi-literate weirdo and condescending jerk. \nGet Data Sheet , Fortune’s technology newsletter. \nThe fact that nastiness has become a viable strategy for promoting major brands is just the dramatic tip of a huge iceberg that could still sink Twitter. Critics have blamed Twitter’s hyper-competitive, snarky, high-school-lunchroom vibe for stalled user growth. Even one of its biggest investors has described the Twitter experience as “scary” and “lonely” for most people. \nAfter years of taking an absolutist free-speech stance, Twitter last summer seemed to get serious about cracking down on the worst kinds of abuse and hate speech . Public backlash and looming government regulation likely added to the underlying business motivation. \nSteak-umm is a newcomer to the game, with a Twitter-perfect style that’s simultaneously upbeat, bizarre — and frequently furious at Twitter itself, primarily for not granting it the ‘verified’ blue check mark. our time is now ", "external_links": [], "published": "2018-01-06T15:57:00.000+02:00", "crawled": "2018-01-06T21:00:00.058+02:00", "highlightTitle": ""}