{"organizations": [], "uuid": "cfd2c6821c28547a044154ef763defaad2eaf9c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-paul-hanly-of-simmons-hanly-conroy-to-co-lead-legal-team-in-federal-opioid-litigation.html", "country": "US", "domain_rank": 767, "title": "Paul Hanly of Simmons Hanly Conroy to Co-Lead Legal Team in Federal Opioid Litigation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-05T00:25:00.000+02:00", "replies_count": 0, "uuid": "cfd2c6821c28547a044154ef763defaad2eaf9c4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-paul-hanly-of-simmons-hanly-conroy-to-co-lead-legal-team-in-federal-opioid-litigation.html", "ord_in_thread": 0, "title": "Paul Hanly of Simmons Hanly Conroy to Co-Lead Legal Team in Federal Opioid Litigation", "locations": [], "entities": {"persons": [{"name": "simmons hanly conroy shareholde", "sentiment": "negative"}, {"name": "paul hanly", "sentiment": "negative"}, {"name": "simmons hanly conroy", "sentiment": "negative"}, {"name": "paul t. farrell jr.", "sentiment": "none"}, {"name": "paul j. hanly jr.", "sentiment": "none"}, {"name": "joseph f. rice", "sentiment": "none"}, {"name": "hanly", "sentiment": "none"}, {"name": "dan aaron polster", "sentiment": "none"}, {"name": "polster", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "northern district of ohio", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "co-lead legal team", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 4, 2018 /PRNewswire/ -- A federal judge has appointed Simmons Hanly Conroy Shareholder Paul J. Hanly Jr. as co-lead counsel in the national multidistrict litigation pending against pharmaceutical companies involved in the marketing of prescription opioid painkillers.\nU.S. District Court Judge Dan Aaron Polster, of the Northern District of Ohio, issued an order today naming Hanly and attorneys Joseph F. Rice and Paul T. Farrell Jr. as co-lead counsels for the plaintiffs in the federal litigation alleging pharmaceutical companies and physicians engaged in fraudulent marketing of prescription opioid painkillers, leading to the current nationwide epidemic.\nHanly, with extensive experience in litigation against opioid manufacturers going back more than a decade, will work with his co-lead counsels to manage the federal litigation and oversee nearly 100 other law firms representing plaintiffs in more than 200 docketed opioid cases.\n\"I am honored to have been appointed by Judge Polster to such a significant position in this litigation, which involves so many issues that are critical to the public health of our communities nationwide,\" said Hanly. \"It is vital we hold the pharmaceutical companies accountable for their roles in the nation's ongoing drug crisis and epidemic.\"\nHanly is a founding member of Simmons Hanly Conroy, headquartered in Alton, Illinois. Based in the firm's New York City office, he has extensive experience in mass torts litigation including representing more than 5,000 clients who sued Purdue Pharma in 2003, the maker of OxyContin, and winning a significant settlement in 2006.\nRice is a founding partner of Motley Rice LLC, based in Mount Pleasant, S.C. Farrell is a partner at Green, Ketchum, Farrell, Bailey & Tweel, LLP, based in Huntington, W.V. Both, as well as many of the other lawyers involved, are viewed as the top mass torts litigators in the country.\nThe defendants in the MDL lawsuit include dozens of parties with diverse roles in the pharmaceutical industry, including manufacturers Purdue Pharma L.P.; Purdue Pharma, Inc.; The Purdue Frederick Company, Inc.; Teva Pharmaceuticals USA, Inc.; Cephalon, Inc.; Johnson& Johnson; Janssen Pharmaceuticals, Inc.; Ortho-McNeil-Janssen Pharmaceuticals, Inc.; Janssen Pharmaceutica, Inc.; Endo Health Solutions Inc.; and Endo Pharmaceuticals, Inc.\nSimmons Hanly Conroy and its attorneys have held multiple national positions of note in pharmaceutical mass torts litigations. Federal judges have appointed the firm's attorneys to serve on multiple plaintiff executive and steering committees in mass tort litigations including DePuy Pinnacle hip implants, Volkswagen emission scandal, testosterone replacement therapy, transvaginal mesh, Lipitor, Yaz and more. Their work has resulted in millions of dollars secured on behalf of clients injured by dangerous drugs and defective medical devices.\nThe case is In Re: National Prescription Opiate Litigation, MDL No. 2804, Case No. 17-md-02804.\nAbout Simmons Hanly Conroy, LLC\nSimmons Hanly Conroy is one of the nation's largest mass tort law firms. Primary areas of litigation include asbestos and mesothelioma, pharmaceutical, consumer protection, environmental and personal injury. The firm's attorneys have been appointed to leadership in numerous national multidistrict litigations, including Vioxx, Toyota Unintended Acceleration, BP Deepwater Horizon Oil Spill, DePuy Pinnacle and the Volkswagen Emission Scandal. The firm also represents small and mid-size corporations, inventors and entrepreneurs in matters involving business litigation. Offices are located in Alton, Ill.; Chicago; Los Angeles; New York City; San Francisco; and St. Louis. Read more at www.simmonsfirm.com .\nView original content: http://www.prnewswire.com/news-releases/paul-hanly-of-simmons-hanly-conroy-to-co-lead-legal-team-in-federal-opioid-litigation-300577918.html\nSOURCE Simmons Hanly Conroy", "external_links": ["http://www.prnewswire.com/news-releases/paul-hanly-of-simmons-hanly-conroy-to-co-lead-legal-team-in-federal-opioid-litigation-300577918.html", "https://www.simmonsfirm.com/about-us/our-attorneys/profiles/paul-j-hanly-jr/", "http://www.simmonsfirm.com/"], "published": "2018-01-05T00:25:00.000+02:00", "crawled": "2018-01-05T01:34:50.003+02:00", "highlightTitle": ""}