{"organizations": [], "uuid": "56d5ec683a79bf71e18ea9213eb3a019036690ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-chino-commercial-bancorp-reports-quarterly-and-full-year-earnings.html", "country": "US", "domain_rank": 767, "title": "Chino Commercial Bancorp Reports Quarterly and Full Year Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-20T00:40:00.000+02:00", "replies_count": 0, "uuid": "56d5ec683a79bf71e18ea9213eb3a019036690ad"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-chino-commercial-bancorp-reports-quarterly-and-full-year-earnings.html", "ord_in_thread": 0, "title": "Chino Commercial Bancorp Reports Quarterly and Full Year Earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "chino commercial bancorp", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "chino commercial bank", "sentiment": "none"}, {"name": "ccbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHINO, Calif., Jan. 19, 2018 (GLOBE NEWSWIRE) --\nThe Board of Directors of Chino Commercial Bancorp (OTC:CCBC), the parent company of Chino Commercial Bank, N.A., announced the net earnings for the Bank and the consolidated holding company, for the fourth quarter ended December 31, 2017, with net earnings before taxes of $588 thousand, or an increase of 9.1%, compared with earnings before taxes of $539 thousand for the same quarter last year. Net after-tax income for the fourth quarter ending December 31, 2017 was $280 thousand, which represents a 14.9% decrease, compared with net income of $329 thousand for the same quarter last year. The decrease in net income for the fourth quarter 2017 was attributable to a one-time deferred tax adjustment in order to comply with the Tax Reform Act signed into law in December 2017. Net income per basic and diluted share for the fourth quarter of 2017 was $0.18 as compared to $0.27 for the same quarter last year.\nThe Company’s net after-tax income for the full year ended December 31, 2017 increased 8.1% to $1.571 million as compared with net earnings of $1.453 million for the same period in 2016. Even though net after-tax earnings were higher in 2017 as compared with 2016, because of additional shares issued during the year, the basic and diluted earnings per share were $1.17 in 2017 as compared with $1.18 in 2016.\nDann H. Bowman, President and Chief Executive Officer, stated, “The Company had an excellent year in 2017, posting new record levels of Deposits, Loans, Revenue and Net Earnings. The Tax Reform Act will reduce the corporate income tax rate beginning in 2018; however, for 2017 it resulted in a one-time increased tax burden, because of the reduction to the Company’s deferred tax asset.\n\"In 2017 the Company raised $4.4 million in additional capital and issued 318,088 shares of additional common stock. The capital raise was oversubscribed and will allow the Company to offer new products and expand into new markets. The Bank recently filed an application with the Office of the Comptroller of the Currency to establish a fourth branch office in Upland. We are excited about expanding into this community, which we believe will significantly contribute to the Company’s growth and profitability.”\nFinancial Condition\nAt December 31, 2017, total assets were $192.8 million, an increase of $17.7 million or 10.1% over $175.1 million at December 31, 2016. Total deposits increased by 8.4% or $11.6 million during the year to $149.1 million, compared to $137.6 million as of December 31, 2016. At December 31, 2017, the Company’s core deposits represent 90.8% of the total deposits.\nGross loans increased by 11.9% or $13.0 million as of December 31, 2017 to $122.6 million, as compared with $109.5 million as of December 31, 2016. The Bank did not have any nonperforming loans for the quarter ended December 31, 2017, and one nonperforming loan as of December 31, 2016, respectively. OREO properties remained at zero as of December 31, 2017 and December 31, 2016, respectively.\nEarnings\nThe Company posted net interest income of $1.6 million and $1.5 million for the three months ended December 31, 2017 and 2016, respectively, or an increase of $158 thousand or 10.7%. Average interest-earning assets were $179.4 million with average interest-bearing liabilities of $101.0 million, yielding a net interest margin of 3.62% for the fourth quarter of 2017, as compared to the average interest-earning assets of $161.8 million with average interest-bearing liabilities of $85.9 million, yielding a net interest margin of 3.64% for the fourth quarter of 2016.\nNon-interest income totaled $372 thousand for the fourth quarter of 2017, or a decrease of 3.0% as compared with $383 thousand earned during the same quarter last year. Service charges on deposit accounts increased by $43 thousand or 18.0% to $241 thousand, primarily due to an increase in income from returned items, overdraft charges, and analysis fees. Dividend income from restricted stock decreased to $40.1 thousand for the fourth quarter of 2017, compared to $99 thousand for the same quarter in 2016, due to the Federal Home Loan Bank change in dividend payout percentage policy. Income from Bank-owned life insurance remained consistent at about $25 thousand in the fourth quarter of 2017 and 2016, respectively.\nGeneral and administrative expenses were $1.3 million for the three months ended December 31, 2017, and December 31, 2016, respectively. The largest component of general and administrative expenses was salary and benefits expense of $803 thousand for the fourth quarter of 2017, as compared to $791 thousand for the same quarter last year. Regulatory assessments remained consistent at about $38 thousand for the fourth quarter of 2017 and 2016, respectively. Advertising and marketing expenses increased by $28 thousand or 122.7% to $50 thousand in the fourth quarter of 2017 from $23 thousand for the same period last year. The Company engaged a marketing company to assist with advertising efforts during 2017.\nIncome tax expense was $307 thousand which represents an increase of $98 thousand or 47.03% for the three months ended December 31, 2017 as compared to $209 thousand for the three months ended December 31, 2016. The effective income tax rate for the fourth quarter of 2017 and 2016 is approximately 52.3% and 38.8%, respectively. The increase in the income tax expense as well as the effective tax rate is entirely attributed to the deferred tax adjustment recorded to comply with the Tax Reform Act signed into law in December 2017.\nForward-Looking Statements\nThe statements contained in this press release that are not historical facts are forward-looking statements based on management’s current expectations and beliefs concerning future developments and their potential effects on the Company. Readers are cautioned not to unduly rely on forward-looking statements. Actual results may differ from those projected. These forward-looking statements involve risks and uncertainties, including but not limited to, the health of the national and California economies, the Company’s ability to attract and retain skilled employees, customers’ service expectations, the Company’s ability to successfully deploy new technology and gain efficiencies therefrom, and changes in interest rates, loan portfolio performance, and other factors.\nContact: Dann H. Bowman, President and CEO or Melinda M. Milincu, Vice President and CFO, Chino Commercial Bancorp and Chino Commercial Bank, N.A., 14245 Pipeline Avenue, Chino, Ca. 91710, (909) 393-8880.\nCHINO COMMERCIAL BANCORP CONSOLIDATED BALANCE SHEET December 31, 2017 and December 31, 2016 December 31, 2017 December 31, 2016 (unaudited) (audited) ASSETS: Cash and due from banks 34,157,668 $ 30,498,888 Total cash and cash equivalents 34,157,668 30,498,888 Interest-bearing deposits in other banks 1,240,000 2,480,000 Investment securities available for sale 3,131,027 3,924,102 Investment securities held to maturity (fair value approximates $21,104,000 at December 31, 2017 and $18,", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/35f0c1e1-a4a2-40f1-ae75-ec09a0361e0a"], "published": "2018-01-20T00:40:00.000+02:00", "crawled": "2018-01-20T00:43:50.001+02:00", "highlightTitle": ""}