{"organizations": [], "uuid": "556c89386972a972beace38cc634e015146d75ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-goldcrypto-ico-update.html", "country": "US", "domain_rank": 767, "title": "GoldCrypto ICO Update", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-31T19:21:00.000+02:00", "replies_count": 0, "uuid": "556c89386972a972beace38cc634e015146d75ed"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-goldcrypto-ico-update.html", "ord_in_thread": 0, "title": "GoldCrypto ICO Update", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BELIZE CITY, BELIZE, Jan. 31, 2018 (GLOBE NEWSWIRE) -- GoldCrypto.io (through its Service Operator Crypto Investor, Inc.) advises as follows:\nThe GoldCrypto ICO has been rescheduled to commence on April 16, 2018.\nThe rescheduling will allow GoldCrypto to incorporate a number of cryptocurrency security measures that are seen as highly desirable, especially as the incidence of cryptocurrency hacking is on the increase. The deferral will also provide time for the overall cryptocurrencies market to stabilize.\nTo provide for a better market positioning and broader base for a gold-backed cryptocurrency, the base AuX Coin valuation has been changed from US$1.00 to US$0.20. In this regard all early participants will have their respective AuX Coin issue adjusted by a factor of five to reflect this change.\nGoing forward the Pre-ICO will continue with new discounts applicable. Until February 28, 2018 the Pre-ICO discount will be 30% and from March 1 through to March 31, the pre-ICO discount will reduce to 20%. From April 1 to April 15 the final pre-ICO discount will be 15%.\nTo secure its AuX Coin gold backing, GoldCrypto has a gold pre-purchase agreement with Scottsdale, Arizona based Key Capital Corporation (OTC PINK: KCPC), which has a mining team with extensive experience and expertise in all facets of mining. Key Capital will monitor mine performance and the production of all pre-purchased gold (see: www.keycapitalgroup.com ).\nThe GoldCrypto Gold Standard is backed by pre-purchased gold to be delivered as bullion following traditional mining operations. Significantly, the initial AuX Coin gold backing of circa US$0.34 following the ICO closing is positioned to continuously and autonomously increase to the direct benefit of the GoldCrypto economy and its AuX Coin holders.\nThe pre-purchase, or streaming, of gold and other precious metals is a well-accepted industry practice. Significant publicly listed companies, including Franco-Nevada, Silver Wheaton, Royal Gold, Sandstorm, and Osisko Royalties, acquire gold through pre-purchase or streaming agreements. Similarly, GoldCrypto interest in gold starts while it is still in the ground and continues as it is mined, processed, and stored as bullion in recognized depositories.\nFor further information:\nSee: https://goldcrypto.io\nGoldCrypto.io Email: info@cryptoinvestorinc.com or info@goldcrypto.io Darcy Johnston: darcy@cryptoinvestorinc.com Chris Nichols: info@keycapitalgroup.com\nSource: GoldCrypto.io", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/f4c92b7c-abdc-4ae9-b76a-324aa17664c5", "https://www.globenewswire.com/Tracker?data=0uOgOqh5-VsLLwxe0fi0E6qtdqbKJNb7TnisgftbwTxizkTAT_StZ1EZLV5nlSKOBmOegaqdsOZIWyB5N83AFTgq5qGSu-iPSgYa-Gpskl4=", "https://www.globenewswire.com/Tracker?data=IDRGTmCgvMlMI1hOse5i3GfZQ6TQJpPqwsKmpCDzJKBzZx_q0usoj955GZq6SBPOteQzej9myNtKpdbieEaWQTn4NmoFklQDrn8eLBZaNeg="], "published": "2018-01-31T19:21:00.000+02:00", "crawled": "2018-01-31T20:33:35.004+02:00", "highlightTitle": ""}