{"organizations": [], "uuid": "cb762ad7ac5c9b105d0048d7ad6a2b4175a320f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-the-chefsa-warehouse-inc-announces-preliminary-full-year-2018-guidance.html", "country": "US", "domain_rank": 767, "title": "The Chefs’ Warehouse, Inc. Announces Preliminary Full Year 2018 Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.055, "site_type": "news", "published": "2018-01-08T16:30:00.000+02:00", "replies_count": 0, "uuid": "cb762ad7ac5c9b105d0048d7ad6a2b4175a320f7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-the-chefsa-warehouse-inc-announces-preliminary-full-year-2018-guidance.html", "ord_in_thread": 0, "title": "The Chefs’ Warehouse, Inc. Announces Preliminary Full Year 2018 Guidance", "locations": [], "entities": {"persons": [{"name": "christopher pappas", "sentiment": "none"}], "locations": [{"name": "ridgefield", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "the chefs’ warehouse, inc.", "sentiment": "neutral"}, {"name": "chefs’ warehouse, inc", "sentiment": "neutral"}, {"name": "the chefs’ warehouse, inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RIDGEFIELD, Conn., Jan. 08, 2018 (GLOBE NEWSWIRE) -- The Chefs’ Warehouse, Inc. (NASDAQ:CHEF), a premier distributor of specialty food products in the United States and Canada, today announced its preliminary outlook for full year 2018.\nBased on current trends in the business, the Company is providing the following financial guidance for fiscal year 2018:\n• Net sales between $1.40 billion and $1.44 billion\n• Gross profit between $355 million and $365 million\n• Adjusted EBITDA between $74 million and $78 million\n“In 2018, we expect growth across our Specialty and Protein categories with a focus on driving growth in unique customers, placements and cases. We also look forward to our first full year of Fells Point being part of the Chefs Warehouse family,” said Christopher Pappas, chairman and chief executive officer of The Chefs’ Warehouse, Inc.\nForward-Looking Statements\nSafe Harbor Statement under the Private Securities Litigation Reform Act of 1995: Statements in this press release regarding the Company’s business that are not historical facts are “forward-looking statements” that involve risks and uncertainties and are based on current expectations and management estimates; actual results may differ materially. The risks and uncertainties which could impact these statements include, but are not limited to, the Company’s ability to successfully deploy its operational initiatives to achieve synergies from the acquisition of the Del Monte entities; the Company’s sensitivity to general economic conditions, including the current economic environment, changes in disposable income levels and consumer discretionary spending on food-away-from-home purchases; the Company’s vulnerability to economic and other developments in the geographic markets in which it operates; the risks of supply chain interruptions due to a lack of long-term contracts, severe weather or more prolonged climate change, work stoppages or otherwise; the risk of loss of customers due to the fact that the Company does not customarily have long-term contracts with its customers; the risks of loss of revenue or reductions in operating margins in the Company’s protein business as a result of competitive pressures within this segment of the Company’s business; changes in the availability or cost of the Company’s specialty food products; the ability to effectively price the Company’s specialty food products and reduce the Company’s expenses; the relatively low margins of the foodservice distribution industry and the Company’s and its customers’ sensitivity to inflationary and deflationary pressures; the Company’s ability to successfully identify, obtain financing for and complete acquisitions of other foodservice distributors and to integrate and realize expected synergies from those acquisitions; the Company’s ability to service customers from its new Chicago, San Francisco and Las Vegas distribution centers and the expenses associated therewith; increased fuel cost volatility and expectations regarding the use of fuel surcharges; fluctuations in the wholesale prices of beef, poultry and seafood, including increases in these prices as a result of increases in the cost of feeding and caring for livestock; the loss of key members of the Company’s management team and the Company’s ability to replace such personnel; and the strain on the Company’s infrastructure and resources caused by its growth. Any forward-looking statements are made pursuant to the Private Securities Litigation Reform Act of 1995 and, as such, speak only as of the date made. A more detailed description of these and other risk factors is contained in the Company’s most recent annual report on Form 10-K filed with the Securities and Exchange Commission (“SEC”) on March 10, 2017 and other reports filed by the Company with the SEC since that date. The Company is not undertaking to update any information in the foregoing report until the effective date of its future reports required by applicable laws. Any projections of future results of operations are based on a number of assumptions, many of which are outside the Company’s control and should not be construed in any manner as a guarantee that such results will in fact occur. These projections are subject to change and could differ materially from final reported results. The Company may from time to time update these publicly announced projections, but it is not obligated to do so.\nAbout The Chefs’ Warehouse\nThe Chefs’ Warehouse, Inc. ( http://www.chefswarehouse.com ) is a premier distributor of specialty food products in the United States and Canada focused on serving the specific needs of chefs who own and/or operate some of the nation’s leading menu-driven independent restaurants, fine dining establishments, country clubs, hotels, caterers, culinary schools, bakeries, patisseries, chocolatiers, cruise lines, casinos and specialty food stores. The Chefs’ Warehouse, Inc. carries and distributes more than 43,000 products to more than 28,000 customer locations throughout the United States and Canada.\nContact:\nInvestor Relations\nJim Leddy, CFO, (718) 684-8415\nSource:The Chefs' Warehouse, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/245438f8-9b06-40ce-b478-38e27b01b422"], "published": "2018-01-08T16:30:00.000+02:00", "crawled": "2018-01-08T18:51:24.000+02:00", "highlightTitle": ""}