{"organizations": [], "uuid": "cd40723b51666f4f0af73605c116ccfbef2b3b56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/aerospace-and-defense", "section_title": "Aerospace and Defense | Reuters.com", "url": "https://www.reuters.com/article/us-sas-strategy/scandinavian-airline-sas-sees-airbus-jet-order-this-spring-idUSKBN1F71OP", "country": "US", "domain_rank": 408, "title": "Scandinavian airline SAS sees Airbus jet order this spring", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.098, "site_type": "news", "published": "2018-01-18T21:09:00.000+02:00", "replies_count": 0, "uuid": "cd40723b51666f4f0af73605c116ccfbef2b3b56"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-sas-strategy/scandinavian-airline-sas-sees-airbus-jet-order-this-spring-idUSKBN1F71OP", "ord_in_thread": 0, "title": "Scandinavian airline SAS sees Airbus jet order this spring", "locations": [], "entities": {"persons": [{"name": "goran jansson", "sentiment": "none"}, {"name": "jansson", "sentiment": "none"}], "locations": [{"name": "stockholm", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "sas", "sentiment": "negative"}, {"name": "airbus", "sentiment": "negative"}, {"name": "boeing", "sentiment": "none"}, {"name": "ryanair", "sentiment": "none"}, {"name": "air shuttle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STOCKHOLM (Reuters) - Scandinavian airline SAS is in talks with Airbus about buying A320neo jets for its short-haul fleet and expects to agree a deal this spring after ending negotiations with rival planemaker Boeing, its finance chief said.\nGoran Jansson also told Reuters in an interview that SAS was in talks with Japanese investors about a so-called Japanese operating lease with call option (JOLCO) to fund the planes.\nJOLCO is a niche aircraft financing structure already used by SAS where an airline leases planes from a Japanese investor and has a buyout option.\nJansson, who will take on a new role at the airline in March with a focus on strategy, said in December that SAS needed to invest in 40-50 new aircraft, in addition to planes already on order, and was looking into how to finance that.\nAirbus’s 2017 list price for an A320neo is $108 million.\nSAS, which is part-owned by Sweden, Norway and Denmark, is in the midst of renewing an elderly and fuel-intensive fleet in the face of cut-price competition from the likes of Norwegian Air Shuttle and Ryanair.\nAfter years of restructuring, long-struggling SAS is back in the black. New efforts to stay competitive include setting up, for the first time, bases outside Scandinavia to cut staff costs.\nJansson said the key would now be to intensify the development of services within SAS’s Eurobonus loyalty scheme, such as credit card reward programs and partnerships with hotels and event organizers, in order to boost turnover.\n“There are areas where we feel that we today make far from enough use of our bookings and customer base,” he said.\nThe aim is to entice business travelers to also choose SAS for leisure travel - a market segment that unlike business travel is growing and that SAS wants a larger chunk of.\n“We need to a greater extent to get our business travelers to also do their leisure travel with us,” Jansson said. “We believe Eurobonus is the key to success here.”\nThe European airline sector has seen consolidation in recent years with most recently Lufthansa and easyJet scooping up assets in Air Berlin which like Alitalia [CAITLA.UL] has entered administration.\nSAS’s restructuring, and Sweden’s and Norway’s sale last year of part of their stakes in a first step toward planned exits from their longstanding holdings, could make the airline a more attractive takeover candidate.\nIn 2016, two sources told Reuters that Lufthansa had been in talks with the owners of SAS which could lead to Lufthansa taking a stake in SAS or some other kind of partnership.\nReporting by Anna Ringstrom; Editing by Niklas Pollard, Mark Potter and Adrian Croft\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T21:09:00.000+02:00", "crawled": "2018-01-19T00:51:58.006+02:00", "highlightTitle": ""}