{"organizations": [], "uuid": "d1f7e9cb0cee390ecf684c7b3a740bec7b4ebc34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex-volume/update-1-london-fx-daily-volume-fell-in-six-months-to-oct-rose-in-n-america-surveys-idUSL2N1PK1EE", "country": "US", "domain_rank": 408, "title": "UPDATE 1-London FX daily volume fell in six months to Oct, rose in N. America -surveys", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.461, "site_type": "news", "published": "2018-01-26T02:32:00.000+02:00", "replies_count": 0, "uuid": "d1f7e9cb0cee390ecf684c7b3a740bec7b4ebc34"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex-volume/update-1-london-fx-daily-volume-fell-in-six-months-to-oct-rose-in-n-america-surveys-idUSL2N1PK1EE", "ord_in_thread": 0, "title": "UPDATE 1-London FX daily volume fell in six months to Oct, rose in N. America -surveys", "locations": [], "entities": {"persons": [{"name": "gertrude chavez-dreyfuss", "sentiment": "negative"}, {"name": "saikat chatterjee londo", "sentiment": "negative"}], "locations": [{"name": "n. america", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "n/new york", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "new york federal reserve", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds background, details, analyst comments)\nBy Gertrude Chavez-Dreyfuss and Saikat Chatterjee\nLONDON/NEW YORK, Jan 25 (Reuters) - Daily currency volume in London, the world’s largest foreign exchange trading center, fell in October 2017 from six months earlier, but rose in North America during the same period, semi-annual surveys by the Bank of England and the New York Federal Reserve showed on Thursday.\nLondon’s average volume declined 4 percent in October 2017 to $2.23 trillion, compared from six months earlier, due to a drop in activity in the spot and swaps market. But compared to a year earlier, London’s FX volume was 7 percent higher.\nIn North America, daily volume rose to $944.3 billion in October, up 7.1 percent from a year earlier, and up 6.2 percent from six months earlier, boosted by increases across all types of foreign exchange instruments.\nThis was a change from the previous year’s low volatility brought on by global central bank policy easing and low rates, which resulted in thinner foreign exchange volumes.\nIn recent months, the market has seen unprecedented geopolitical risk and an uncertain political outlook, especially in the United States, leading to periods of volatility.\nThat volatility should continue to rise this year, analysts said, which should impact overall volume.\n“Rates are expected to rise and diverging central bank policy will likely become more noticeable,” said Alice Leng, FX strategist at Bank of America Merrill Lynch in a research note. “The much anticipated tax reform and infrastructure spending in the U.S. to boost the economy...will start to surface. This will have substantial effects on FX.”\nTrading in the euro against the dollar, in the greenback versus the Mexican peso, and the dollar against the Canadian currency, showed the largest increases in volume, the Fed survey said.\nThe largest decrease in volume was in the dollar/yen pair, where turnover dropped by $9.5 billion, the survey said.\nIn London, the survey showed spot turnover declined by $45 billion per day from six months earlier to $677 billion. The decline in volumes traded was across the board for all major currencies.\nDaily cash volume for sterling fell 6 percent to $285 billion over the six months to October 2017. The fall in dollar/yen spot trading volumes was the biggest with a 20 percent drop over the last six months.\nIt was a different story though in North America. Average daily volume increased across all instrument types, with a rise in spot turnover of 5.9 percent and forwards of 6.7 percent.\nSwaps and over-the-counter options, meanwhile, increased 5.2 percent and 12.4 percent, respectively, the survey showed. (Reporting by Gertrude Chavez-Dreyfuss in New York and Saikat Chatterjee in London; Editing by Bernadette Baum)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T02:32:00.000+02:00", "crawled": "2018-01-25T23:15:04.015+02:00", "highlightTitle": ""}