{"organizations": [], "uuid": "2dee891d427d26dd31acf9e8d9f0c6a3a1204c8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/06/15/102759780-464629648.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/16/airbus-chief-lays-into-us-protectionism-boeing-and-brexit.html", "country": "US", "domain_rank": 767, "title": "Airbus chief lays into US protectionism, Boeing, and Brexit", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:27:00.000+02:00", "replies_count": 0, "uuid": "2dee891d427d26dd31acf9e8d9f0c6a3a1204c8c"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/airbus-chief-lays-into-us-protectionism-boeing-and-brexit.html", "ord_in_thread": 0, "title": "Airbus chief lays into US protectionism, Boeing, and Brexit", "locations": [], "entities": {"persons": [{"name": "brexit frederic stevens", "sentiment": "negative"}, {"name": "enders", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "airbus", "sentiment": "negative"}, {"name": "boeing", "sentiment": "negative"}, {"name": "airbus group  tom enders", "sentiment": "neutral"}, {"name": "financial times", "sentiment": "none"}, {"name": "bombardier", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Frederic Stevens | Getty Images Tom Enders Chief Executive Officer of Airbus Group\nTom Enders, chief executive of Airbus, on Monday launched a stinging attack on US protectionism and warned that President Donald Trump would leave \"wreckage\" behind after his term in office.\nSpeaking at the UK aerospace industry's annual dinner in London , Mr Enders said the Trump administration was putting free trade at risk.\nMore from the Financial Times:\nAirbus prepared to shut down production of A380 superjumbo\nAirbus deliveries hit new record\nBoeing deliveries soar in 2017\n\"There is no one fighting for free trade. There is no one fighting for opening markets but [instead] closing US markets to foreign companies and foreign competitors,\" he said.\nHe accused Airbus rival Boeing of \"ruthlessly surfing\" on the US protectionist wave to smother competition.\nHe cited the legal challenges by its competitor against Bombardier's C-series regional aircraft which have led to proposals by the US department of trade for tariffs of 300 per cent on that type of aircraft sold in the US.\n\"This strategy may bring short-term success but it will be self-defeating in the end,\" he said. \"It hurts our industry.\"\nAirbus last year struck a deal to acquire the C series from Bombardier for a nominal sum of $1 in what is widely regarded as a coup for the European aircraft maker which has long aimed to increase its presence in the US market.\nAirbus plans to manufacture the aircraft at its plant in Mobile, Alabama , to avoid the tariff if it is imposed next month.\nBoeing's response has been to open discussions with Brazilian aircraft maker Embraer.\nBoeing said last night: \"Boeing believes in strong competition, rules-based trade and a level playing-field for all in the industry. Competitors must abide by the rules that everyone has agreed will govern the competition. Those who don't abide by the rules are the ones that are 'taking advantage' and harming the wider industry.\"\nThe Airbus boss also warned against the implications of Britain's exit from the EU. \"The wreckage that President Trump will leave after four or eight years in the White House will be easier to repair than the exit of the UK from the EU.\"\nMr Enders said that Brexit would strain the efficiency of operations, add costs and \"thereby curtail the competitiveness\" of the aerospace industry.\nHis comments will raise concerns already emerging about the Franco-German group's commitment to the UK and the pressure to take manufacturing operations back to France, Germany or Spain.\nMr Enders said he hoped that Britain would always be a home country for Airbus. The UK business remained Airbus's most efficient and innovative operation, he said.\nHowever, whatever industry did to mitigate the effects of weakening ties between Britain and the EU, \"the result of Brexit would be negative\".\nReceive 4 weeks of unlimited digital access to the Financial Times for just $1 .", "external_links": [], "published": "2018-01-16T14:27:00.000+02:00", "crawled": "2018-01-16T14:45:59.005+02:00", "highlightTitle": ""}