{"organizations": [], "uuid": "f4baeecf3d36b99f4e5f7b7fba17de17054a2b0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/21/reuters-america-jumanji-stays-strong-topping-12-strong-den-of-thieves-with-20-million.html", "country": "US", "domain_rank": 767, "title": "'Jumanji' Stays Strong, Topping '12 Strong,' 'Den of Thieves' With $20 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T20:06:00.000+02:00", "replies_count": 0, "uuid": "f4baeecf3d36b99f4e5f7b7fba17de17054a2b0c"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/21/reuters-america-jumanji-stays-strong-topping-12-strong-den-of-thieves-with-20-million.html", "ord_in_thread": 0, "title": "'Jumanji' Stays Strong, Topping '12 Strong,' 'Den of Thieves' With $20 Million", "locations": [], "entities": {"persons": [{"name": "fox", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "variety.com", "sentiment": "none"}], "organizations": [{"name": "sony", "sentiment": "negative"}, {"name": "warner bros.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Million@\nLOS ANGELES, Jan 21, ( Variety.com ) - Sony's \"Jumanji: Welcome to the Jungle\" has won its third weekend box office title with ease, topping newcomers \"12 Strong\" and \"Den of Thieves,\" with $20 million at 3,704 North American locations.\nAfghan war drama \"12 Strong\" took second with $16.5 million at 3,002 sites for Warner Bros. and STXfilms' \"Den of Thieves\" followed with $15.3 million from 2,432 venues. Fox's \"The Post\" finished fourth with $12 million at 2,851 venues and its fifth weekend of \"The Greatest Showman\" remained a solid draw in fifth with $11 million at 2,823 screens.\n\"Jumanji: Welcome to the Jungle\" has shown remarkable staying power, declining only 28% this weekend and lifting its 33-day North American total to $317 million -- the 61st highest of all time. It's Sony's fifth highest domestic grosser of all time, trailing only the first three Spider-Man titles and last summer's \"Spider-Man: Homecoming.\"\n\"Jumanji\" is also singular in winning the box office in its third, fourth and fifth weekends after finishing second in its first two weekends to \"Star Wars: The Last Jedi.\" \"This is an unprecedented and unusual box office trajectory for a wide release blockbuster,\" said Paul Dergarabedian, senior media analyst with comScore.\nThe action comedy, starring Dwayne Johnson and Kevin Hart, has also kept overall domestic business healthy with the year-to-date total at $730.1 million through Sunday, up 2.1% from a year ago. The weekend's total hit about $137 million, down 6% from the same frame in 2017 when \"Split\" opened with $40 million.\n\"Another great performance by the seemingly unstoppable 'Jumanji' powers the pre-Oscar nominations weekend while bolstered by a pair of solid debuts from '12 Strong' and 'Den of Thieves,' but this was not enough to beat a tough weekend over weekend comparison to the year ago stellar performance of M. Night Shyamalan's 'Split,\"' Dergarabedian said.\n\"12 Strong,\" starring Chris Hemsworth and Michael Shannon, had been tracking in the $14 million to $17 million range. The movie is based Doug Stanton's 2009 bestseller \"Horse Soldiers,\" which centers on CIA paramilitary operations officers and U.S. Special Forces sent to fight the Taliban in Afghanistan immediately after the Sept. 11 attacks. Prospects for ongoing business are solid, given its A Cinemascore.\nProduction companies for \"12 Strong\" are Alcon Entertainment, Black Label Media, and Jerry Bruckheimer Films with Nicolai Fuglsig directing. Bruckheimer began developing the film in 2009 while at Disney.\nThe R-rated \"Den of Thieves,\" starring Gerard Butler, O'Shea Jackson Jr., and Curtis \"50 Cent\" Jackson, finished well above forecasts, which had been in the $9 million range. The film follows the intersecting lives of an elite unit of the Los Angeles County Sheriff's Department and a successful bank robbery crew as the outlaws plan a seemingly impossible heist on the Federal Reserve Bank in downtown Los Angeles.\nChristian Gudegast is directing from his original screenplay, based on a story by Gudegast and Paul Scheuring, and is produced by Tucker Tooley and Mark Canton, who spent 15 years developing the film. \"Den of Thieves\" carries a $30 million budget and generated a B+ Cinemascore.\n\"It's incredibly satisfying to have this in theaters and performing so well after all this time,\" Tooley told Variety. \"STXfilms has done a great job activating social media on this.\"\n\"The Post\" centers on the 1971 legal battle by the Washington Post and New York Times over the publication of the Pentagon Papers and stars Meryl Streep as WaPo publisher Katharine Graham and Tom Hanks as editor Ben Bradlee. It showed respectable staying power with a 37% decline from its first weekend in wide release and has totaled $45.2 million domestically.\n\"The Greatest Showman,\" starring Hugh Jackman as P.T. Barnum, remained a powerful draw with a remarkable small decline of 12% in its fifth weekend. The domestic total has hit $113.5 million while the international box office is at $118 million.\nWarner Bros.' second weekend of family comedy \"Paddington 2\" finished sixth with $8.2 million at 3,702 sites, followed by Lionsgate's sophomore session of Liam Neeson's \"The Commuter\" with $6.7 million at 2,892 venues. Both titles have reached $25 million in 10 days.\nDisney-Lucasfilm's sixth weekend of \"Star Wars: The Last Jedi\" came in eighth with $6.6 million at 2,456 locations for a 38-day total of $604.3 million. It trails \"The Avengers\" by less than $20 million for the fifth spot on that list.", "external_links": [], "published": "2018-01-21T20:06:00.000+02:00", "crawled": "2018-01-22T01:08:45.035+02:00", "highlightTitle": ""}