{"organizations": [], "uuid": "d5ea2cedcdd6bdcffa6d80e4b02fbe22d1beedda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-8-oil-settles-lower-after-dollar-strengthens-rising-u-s-output.html", "country": "US", "domain_rank": 767, "title": "UPDATE 8-Oil settles lower after dollar strengthens, rising U.S. output", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T23:06:00.000+02:00", "replies_count": 0, "uuid": "d5ea2cedcdd6bdcffa6d80e4b02fbe22d1beedda"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-8-oil-settles-lower-after-dollar-strengthens-rising-u-s-output.html", "ord_in_thread": 0, "title": "UPDATE 8-Oil settles lower after dollar strengthens, rising U.S. output", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Brent down 1.5 pct, WTI down 0.9 percent\n* U.S. weekly crude stocks expected to rise -Reuters poll\n* Speculators bet on higher prices but potential for correction\n* U.S. production to hit 10 million bpd soon (New throughout, updates prices, market activity and analyst comments to settlement)\nHOUSTON, Jan 29 (Reuters) - Oil prices settled lower on Monday, pressured by a strengthening dollar and rising U.S. crude output, but prices remained on track for the biggest January increase in five years.\nBrent crude futures for March delivery settled down $1.06, or 1.5 percent, at $69.46 a barrel, after rallying to a session high of $70.64.\nU.S. West Texas Intermediate (WTI) crude futures fell 58 cents, or 0.9 percent, to close at $65.56 a barrel.\nThe rally in oil prices has been buoyed by the U.S. dollar's six straight weekly slides. The greenback is set to fall 3 percent this month. Oil is priced in the U.S. currency, so a falling dollar can boost demand for crude from buyers using other currencies.\nThe dollar index had been below $90 since Jan. 24. But the currency has rebounded 0.3 percent since Friday to $89.31, which has weighed on crude prices.\n\"The strength in the dollar pushed some sellers in the market. There are some warning signs that maybe the rally is getting a bit overextended,\" said Gene McGillian, manager of market research at Tradition Energy in Stamford, Connecticut.\nAnalysts expected U.S. crude supplies would post a weekly rise for the first time in 10 weeks, a preliminary Reuters poll showed on Monday. Industry group American Petroleum Institute posts its data on Tuesday and the U.S. Energy Information Administration reports on Wednesday.\nCrude prices also had drawn support from a large premium in the front-month Brent oil contract over those for future delivery, as investment in crude futures and options reached a record high last week.\nOil consumption is surging as a result of growth in major economies, while OPEC and its allies have made repeated commitments to limiting their crude output.\nOn Monday, Iraq's oil minister said in London that the oil market was improving, and that the country would comply with OPEC output cuts even though it is trying to increase its oil export capacity.\nSomewhat offsetting the OPEC-led cuts has been rising oil output in North America.\nU.S. output <C-OUT-T-EIA> has jumped more than 17 percent since mid-2016. It is expected to exceed 10 million bpd soon.\nU.S. energy firms added 12 oil rigs for new production in the week to Jan. 26, Baker Hughes reported on Friday, , which added to bearish sentiment in the market.\n\"Today's lower oil prices were a partial correction and a reaction to increasing drilling activity,\" said James Williams, an energy economist at WTRG Economics in London, Arkansas.\n(Additional reporting by Nina Chestney and Amanda Cooper in London and Henning Gloystein in Singapore; Editing by David Gregorio)", "external_links": [], "published": "2018-01-29T23:06:00.000+02:00", "crawled": "2018-01-30T00:42:22.000+02:00", "highlightTitle": ""}