{"organizations": [], "uuid": "e310140a19f20ec10e0350b726d6e4f73f0a81ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-teladoc-completes-record-visit-volume-in-2017-provides-preliminary-unaudited-2017-results-and-2018-financial-outlook.html", "country": "US", "domain_rank": 767, "title": "Teladoc Completes Record Visit Volume in 2017; Provides Preliminary Unaudited 2017 Results and 2018 Financial Outlook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.054, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "e310140a19f20ec10e0350b726d6e4f73f0a81ff"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-teladoc-completes-record-visit-volume-in-2017-provides-preliminary-unaudited-2017-results-and-2018-financial-outlook.html", "ord_in_thread": 0, "title": "Teladoc Completes Record Visit Volume in 2017; Provides Preliminary Unaudited 2017 Results and 2018 Financial Outlook", "locations": [], "entities": {"persons": [{"name": "jason gorevic", "sentiment": "none"}, {"name": "gorevic", "sentiment": "none"}], "locations": [{"name": "ny", "sentiment": "none"}, {"name": "teladoc", "sentiment": "none"}], "organizations": [{"name": "teladoc , inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "teladoc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PURCHASE, NY, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Teladoc , Inc. (NYSE:TDOC), today announced certain preliminary unaudited 2017 results and financial outlook for 2018.\n“For Teladoc, 2017 marked a landmark year as we redefined the virtual care delivery landscape with our acquisition of Best Doctors,” said Jason Gorevic, chief executive officer of Teladoc. “Through rapid integration, Teladoc has brought to market innovation that gives members a single point of access for a wide array of medical needs. We are seeing a tremendous reception from both clients and prospects to this unique, comprehensive solution.”\n“Building on our strong momentum in all segments of the Teladoc business, we head into 2018 extremely well positioned to deliver on our targets for all key operating and financial metrics,” continued Gorevic.\nPreliminary Unaudited 2017 Financial Results (1)\nTotal revenues of approximately $232 million, an 88% increase over 2016\nTotal membership of approximately 23 million, a 31% increase over 2016\nTotal visits of approximately 1,460,000, a 53% increase over 2016, and representing utilization of approximately 7%, compared to 6% utilization in 2016\nPreliminary Unaudited Fourth Quarter 2017 Financial Results\nTotal revenues of approximately $76 million, a 103% increase over 2016\nTotal adjusted EBITDA of approximately $2.5 million compared to a loss of approximately $8 million in the fourth quarter 2016\nTotal visits of approximately 460,000, a 48% increase over 2016, and representing utilization of approximately 2.0%, compared to 1.8% utilization during the same period in 2016\n(1 ) As the Company has not completed its quarter and year-end annual close procedures and the audit of its 2017 financial statements are not complete, the revenue expectations presented in this press release are preliminary, and, therefore, subject to final year-end closing adjustments and may change. The preliminary financial results presented in this release are based solely upon information available as of the date of this release, are not a comprehensive statement of our financial results or positions as of or for the 2017 fiscal year, and have not been audited, reviewed, or compiled by our independent registered accounting firm. Preliminary 2018 Financial Outlook\nTotal revenues of $350 million to $360 million, a 52% increase over 2017 (at the midpoint)\nTotal adjusted EBITDA of $7 million to $10 million, a 169% increase over 2017 (at the midpoint)\nTotal membership of 22 million to 24 million, a 20% increase over 2017 (at the midpoint) plus visit fee only access to 18 million individuals compared to zero in 2017\nTotal visits of 1.9 million to 2.0 million, a 33% increase over 2017 (at the midpoint)\nUpcoming Presentation\nAs previously announced, Jason Gorevic, chief executive officer, and Mark Hirschhorn, chief operating officer and chief financial officer, will present at the 36th Annual J.P. Morgan Healthcare Conference in San Francisco at 9:00 a.m. Pacific Time on Monday, January 8, 2018. A live audio webcast will be available at www.ir.teladoc.com .\nAbout Teladoc, Inc.\nTeladoc, Inc. (NYSE:TDOC) is the world’s largest and most trusted provider of virtual healthcare delivery services. Recognized by MIT Technology Review as one of the “50 Smartest Companies”, Teladoc is forging a new healthcare experience with better convenience, outcomes and value. The company provides virtual access to high quality care and expertise with a portfolio of services and solutions – inclusive of coverage of 450 medical subspecialties –that spans the spectrum from non-urgent, episodic needs like flu and upper respiratory infections, to chronic, complicated medical conditions like cancer and congestive heart failure. By marrying the latest in data and analytics with its award-winning user experience and highly flexible technology platform, Teladoc has delivered millions of medical visits to patients around the globe. For additional information, please visit www.teladoc.com .\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains “forward-looking statements” within the meaning of the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by words such as: “anticipate,” “intend,” “plan,” “believe,” “project,” “estimate,” “expect,” “may,” “should,” “will” and similar references to future periods. Examples of forward-looking statements include, among others, statements we make regarding future revenues, future earnings, future numbers of members or clients, litigation outcomes, regulatory developments, market developments, new products and growth strategies, and the effects of any of the foregoing on our future results of operations or financial conditions.\nForward-looking statements are neither historical facts nor assurances of future performance. Instead, they are based only on our current beliefs, expectations and assumptions regarding the future of our business, future plans and strategies, projections, anticipated events and trends, the economy and other future conditions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict and many of which are outside of our control. Our actual results and financial condition may differ materially from those indicated in the forward-looking statements. Therefore, you should not rely on any of these forward-looking statements. Important factors that could cause our actual results and financial condition to differ materially from those indicated in the forward-looking statements include, among others, the following: (i) changes in laws and regulations applicable to our business model; (ii) changes in market conditions and receptivity to our services and offerings; (iii) results of litigation; (iv) the loss of one or more key clients; and (v) changes to our abilities to recruit and retain qualified providers into our network. Additional relevant risks that may affect our results are described in certain of our filings with the Securities and Exchange Commission.\nAny forward-looking statement made by us in this press release is based only on information currently available to us and speaks only as of the date on which it is made. We undertake no obligation to publicly update any forward-looking statement, whether written or oral, that may be made from time to time, whether because of new information, future developments or otherwise.\nInvestor Contact:\nWestwicke Partners\nJordan E. Kohnstam\n443-450-4189\nJordan.kohnstam@westwicke.com\nMedia Contact:\nCourtney McLeod\nDirector, Communications, Teladoc\n914-265-6789\ncmcleod@teladoc.com\nSource:Teladoc, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8391bb9e-20cf-4a5a-9d9e-18c6851f045d", "https://www.globenewswire.com/Tracker?data=uLq-XzYtwanVjmAC9_fW7vLaM6zyFB_fMYfRNLuUpWDL81yCt8we1Ydebomp8Kwvn8UAeFdSg-JNoi4yECSPyQ==", "https://www.globenewswire.com/Tracker?data=x9y96KHLTiNDG49JnMh_bBnmXrVLg_Grz09RNn7DhMK_U0Xs_IXzrP8-yL4ETA5mRlu-4F_m_-uAO3z3U67NvmmW9N61oRj7cmuDr0B2KMpaJljdsWSkyoQgRLjVjuX2E5Da_TzIO6Hd8_R6zoOlQExdUrckAEpamoC3u4nHvMBJYMr7s5u6MPqfxINxYvb0z6p5Sy8wVAavMY-4nkOj9MnB8fum3vC1I-3fHgIAk-kQ6zc5_a5w671JPKNwpNZWMAqkE8V7N2ABXJCfdvTbU0w9A0psHfrYFIuMBKlHO9FTl9BSWoieBls6wkqXhs6zwTOAYdv3FDgoD4r0O68k0g==", "https://www.globenewswire.com/Tracker?data=1YBiSuVMnglbNsAJtlO-avSWlUTFM3BzqFnzwThHuNKsXLyFme8oG-0TpSJ7JXK0R0kzxiydRZc9-fWJ-ypCKQ=="], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:11:41.000+02:00", "highlightTitle": ""}