{"organizations": [], "uuid": "a1ca3bc656a71928ddae54c0c8b78233678049c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 15}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/28/104864771-GettyImages-881034868.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/02/the-fed-may-be-only-thing-that-can-stand-in-the-way-of-rally.html", "country": "US", "domain_rank": 767, "title": "The Fed may be only thing that can stand in the way of rally", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T15:00:00.000+02:00", "replies_count": 0, "uuid": "a1ca3bc656a71928ddae54c0c8b78233678049c3"}, "author": "Jeff Cox", "url": "https://www.cnbc.com/2018/01/02/the-fed-may-be-only-thing-that-can-stand-in-the-way-of-rally.html", "ord_in_thread": 0, "title": "The Fed may be only thing that can stand in the way of rally", "locations": [], "entities": {"persons": [{"name": "quincy krosby", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "negative"}, {"name": "federal open market committee", "sentiment": "none"}, {"name": "prudential financial", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "No dynamic could be more important in 2018 for investors than how the Federal Reserve manages what should be an accelerating economy.\nThe question essentially becomes whether growth gets too strong. In that case, where GDP shows sustained gains above 3 percent and the Fed finally starts hitting its 2 percent inflation target, the central bank may go from tapping the brakes to slamming them.\nThat may be the only thing that can stand in the way of a market rally that has been impossible to stop.\n\"What's going to be more difficult for the market is if inflation does in fact kick in,\" said Quincy Krosby, chief market strategist at Prudential Financial. \"The question is then, is the Fed behind the curve?\"\nMarkets will get a better look inside the mind of the central bank when the Federal Open Market Committee on Wednesday releases the minutes from its mid-December meeting. The Fed hiked its benchmark interest rate a quarter point at the session and raised its economic outlook for 2018.\nHowever, the post-meeting statement provided little in the way of insight into what drove the decision. Was the committee moved by tax reform? Growth prospects? A little bit of both? The minutes will provide more perspective both on why the Fed did what it did — and what moves are likely ahead.\n\"This is not strictly a science,\" Krosby said.\nIndeed, much will be left to interpretation. The market soon will have to deal with a new Fed chair, when current Governor Jerome Powell likely takes over in mid-February. In addition, there is one new governor, Randal Quarles, and another appointment looming in Marvin Goodfriend. Current Chair Janet Yellen is leaving when her term expires next month, and the New York Fed is in the process of picking a new president to take over for William Dudley.\nIn addition, President Donald Trump will still have two other vacancies to fill.\n\"If you look at the background of the new Fed board members, you would have to put them on the bit more hawkish side of the equation,\" Krosby said. \"How much more hawkish, we don't know.\"\nIndeed, the voting complexion will be changing. Cleveland Fed President Loretta Mester, a reliably hawkish member — favoring higher interest rates — will return as a voter, and uber-dovish Minneapolis Fed President Neel Kashkari will not be voting. Charles Evans of Chicago, who joined Kashkari in voting against the December rate hike, also will be on the sidelines.\nAmid the changes, investors have become more acclimated toward a more aggressive rate hike pace.\nFed funds futures trading indicates the market currently is pricing in March and September and now have increased the chance for a third hike in December to about 41 percent, compared with less than 30 percent a month ago, according to the CME. The Fed currently is projecting three rate hikes in 2018, while some economists, like those at Goldman Sachs and Capital Economics, indicate a year with four hikes is not out of the question .\nMohamed El-Erian , chief economic advisor at Allianz, has spoken of a \"beautiful normalization\" the Fed has achieved in raising rates off the near-zero level prevalent from the financial crisis until December 2015. The Fed has managed to guide the markets off crisis-era policies without causing inordinate disruptions, and in fact oversaw a market in 2017 that set historic new lows in volatility despite three rate increases.\nThe challenge will be doing it again in 2018 while the European Central Bank also is reversing its own high levels of policy accommodation.\nPowell \"is going to have to navigate the way toward rate hikes in the U.S. against the backdrop of a European Central Bank that is beginning this process as well,\" Krosby said. \"He's going to make sure the market accepts rate hikes. He'll telegraph it well in advance so that the transition from normalization to tightening is a smooth one.\"\nHow that fits into market behavior is the bigger question mark. If the Fed's schedule outpaces market expectations because of faster inflation, that's one factor that could take the shine off another big year for stocks.\n\"I think it's time to prepare for a rough and rugged year,\" said Jim Paulsen, chief investment strategist at The Leuthold Group. Paulsen envisions a 2018 where \"the economy's pretty good here and globally and it's just too good from here for us to keep costs and rate structures in place. You're going to have to adjust them up.\"\nInvestors should consider taking up a cash position and shifting money from the U.S. to international stocks, he added. Sectorwise, U.S. positions in materials, energy, industrials, commodities and financials would outperform.\n\"There might be a better buying opportunity down the road,\" Paulsen said. \"It's just hard to stand in the way of a one-way train going north and say, 'be cautious.'\"\nWATCH: Though the market has accepted rate hikes, not everyone is convinced they're necessary .\nshow chapters Chief strategist: It's a mistake for Fed to raise rates now. Here's why 9:26 AM ET Tue, 2 Jan 2018 | 03:53", "external_links": [], "published": "2018-01-03T15:00:00.000+02:00", "crawled": "2018-01-03T14:25:51.008+02:00", "highlightTitle": ""}