{"organizations": [], "uuid": "7891f648be0bc71b3a02e6be5989ae88da473a1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-senseonics-announces-proposed-convertible-senior-subordinated-notes-offering.html", "country": "US", "domain_rank": 767, "title": "Senseonics Announces Proposed Convertible Senior Subordinated Notes Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:15:00.000+02:00", "replies_count": 0, "uuid": "7891f648be0bc71b3a02e6be5989ae88da473a1a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-senseonics-announces-proposed-convertible-senior-subordinated-notes-offering.html", "ord_in_thread": 0, "title": "Senseonics Announces Proposed Convertible Senior Subordinated Notes Offering", "locations": [], "entities": {"persons": [{"name": "senseonics", "sentiment": "none"}], "locations": [{"name": "germantown", "sentiment": "none"}, {"name": "md.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "eversense", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "senseonics holdings, inc.", "sentiment": "neutral"}, {"name": "cgm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GERMANTOWN, Md.--(BUSINESS WIRE)-- Senseonics Holdings, Inc. (NYSE American: SENS), a medical technology company focused on the development and commercialization of Eversense®, a long-term, implantable continuous glucose monitoring (CGM) system for people with diabetes, today announced a proposed underwritten offering, subject to market and other conditions, of convertible senior subordinated notes due 2023 (the Notes). Senseonics also announced preliminary fourth quarter and full year 2017 financial results.\nProposed Convertible Senior Subordinated Notes Offering\nThe Notes will be convertible at the option of the holders into shares of Senseonics’ common stock. The interest rate, initial conversion rate and other terms of the Notes will be determined at the time of the pricing of the offering.\nSenseonics intends to use a portion of the net proceeds from the offering of the Notes to begin commercialization of Eversense in the United States, if approved, to fund continued research and development of future configurations of Eversense, and for working capital and general corporate purposes.\nBTIG is acting as the sole manager for the offering.\nThe Notes will be issued and sold pursuant to an effective shelf registration statement (including a base prospectus) on Form S-3, which it filed with the Securities and Exchange Commission (the SEC) on April 3, 2017 and which became effective on April 17, 2017. The preliminary prospectus supplement relating to the offering will be filed with the SEC and will be available on the SEC’s website at http://www.sec.gov . A copy of the preliminary prospectus supplement and the accompanying prospectus relating to the offering may also be obtained, when available, from BTIG, LLC, 825 Third Avenue, 6th Floor, New York, NY 10022, or by telephone at (212) 588-6500 or by e-mail at convertiblecapitalmarkets@btig.com .\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy the Notes or any other securities, and will not constitute an offer, solicitation or sale in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful. The offering of the Notes will be made only by means of the prospectus supplement and the accompanying prospectus.\nPreliminary Financial Results\nPreliminary and unaudited revenue for the fourth quarter of 2017 is expected to be approximately $2.9 million, compared to $0.3 million in the fourth quarter of 2016. Preliminary and unaudited revenue for the year ended December 31, 2017 is expected to be $6.4 million, compared to $0.3 million in 2016. As of December 31, 2017, cash, cash equivalents, and marketable securities were $36.4 million.\nAbout Senseonics\nSenseonics Holdings, Inc. is a medical technology company focused on the design, development and commercialization of glucose monitoring products designed to help people with diabetes confidently live their lives with ease. Senseonics’ first generation CGM system, Eversense, includes a small sensor, smart transmitter and mobile application. Based on fluorescence sensing technology, the sensor is designed to be inserted subcutaneously and communicate with the smart transmitter to wirelessly transmit glucose levels to a mobile device. After insertion, the sensor is designed to continually and accurately measure glucose levels.\nForward-Looking Statements\nAny statements in this press release about future expectations, plans and prospects for Senseonics, including, without limitation, statements about the potential U.S. launch of Eversense, the terms of the offering of the Notes, Senseonics’ intentions regarding the use of proceeds from the offering, the preliminary financial results for the fourth quarter of 2017 and the year ended December 31, 2017 and other statements containing the words “expect,” “intend,” “may,” “will,” and similar expressions, constitute forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors, including: the uncertainties related to market conditions and the completion of the underwritten public offering on the anticipated terms or at all, the potential for adjustments to Senseonics’ preliminary financial results in connection with the completion of the audit of Senseonics’ 2017 financial statements by Senseonics’ independent registered public accounting firm, uncertainties inherent in the expanded commercial launch of Eversense and such other factors as are set forth in the risk factors detailed in Senseonics’ Annual Report on Form 10-K for the year ended December 31, 2016, Senseonics’ Quarterly Report on Form 10-Q for the quarter ended September 30, 2017 and Senseonics’ other filings with the SEC under the heading “Risk Factors.” In addition, the forward-looking statements included in this press release represent Senseonics’ views as of the date hereof. Senseonics anticipates that subsequent events and developments will cause Senseonics’ views to change. However, while Senseonics may elect to update these forward-looking statements at some point in the future, Senseonics specifically disclaims any obligation to do so except as required by law. These forward-looking statements should not be relied upon as representing Senseonics’ views as of any date subsequent to the date hereof.\n //www.businesswire.com/news/home/20180125006317/en/\nSenseonics Holdings, Inc.\nR. Don Elsey\nChief Financial Officer\n301-556-1602\ndon.elsey@senseonics.com\nSource: Senseonics Holdings, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51749198&newsitemid=20180125006317&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=1&md5=0e376ed44e8c184660e9e74d4df9bb03", "http://www.businesswire.com/news/home/20180125006317/en/"], "published": "2018-01-26T00:15:00.000+02:00", "crawled": "2018-01-26T02:32:35.000+02:00", "highlightTitle": ""}