{"organizations": [], "uuid": "10f02dd7cc5c7ed35c10ce365546c65bf607c1c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-vion-names-jeff-henry-as-president.html", "country": "US", "domain_rank": 767, "title": "ViON Names Jeff Henry as President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T22:45:00.000+02:00", "replies_count": 0, "uuid": "10f02dd7cc5c7ed35c10ce365546c65bf607c1c5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-vion-names-jeff-henry-as-president.html", "ord_in_thread": 0, "title": "ViON Names Jeff Henry as President", "locations": [], "entities": {"persons": [{"name": "jeff henry", "sentiment": "negative"}, {"name": "tom frana", "sentiment": "none"}, {"name": "jeff", "sentiment": "none"}, {"name": "henry", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "herndon", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}], "organizations": [{"name": "vion", "sentiment": "negative"}, {"name": "vion corporation", "sentiment": "negative"}, {"name": "hitachi data systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HERNDON, Va.--(BUSINESS WIRE)-- ViON Corporation, a market leader in the design, delivery and maintenance of mission critical IT infrastructure solutions, announced today the appointment of Jeff Henry as President. Mr. Henry brings over 30 years of sales and marketing experience along with a deep understanding of emerging technologies and their impact on federal and commercial IT customers.\n“Jeff’s experience on the executive committee and his successful history of managing client needs and delivering revenue make him the ideal leader for ViON,” said Tom Frana, Chairman and CEO of ViON. “In his new role he will continue to cultivate relationships with our partners and manufacturers enabling ViON to maintain the tremendous momentum we’ve gained as a leading provider of as-a-Service offerings.”\nPrior to joining ViON, Mr. Henry served as Senior Vice President and General Manager of the Americas at Hitachi Data Systems, where he was responsible for leading a team of over 2,000 employees and was a member of the executive committee. Hitachi Data Systems saw exponential revenue and profit growth during Mr. Henry’s tenure. His responsibilities included managing both the sales and services revenue streams within the United States, Canada and Latin America. Before joining Hitachi, Mr. Henry served as Vice President and General Manager for Unisys Corporation, Vice President of Global Accounts at HP and Regional Vice President at Compaq Computer.\n“I have watched ViON grow into a premier systems integrator while differentiating itself with a compelling portfolio of as-as-Service solutions that aligns perfectly with the market’s current needs,” said Henry. “I am honored to serve as ViON’s President during such an exciting time for our company. Years of investment in innovation and differentiation are paying huge dividends in our industry. I look forward to continuing my work with Tom and our outstanding executive team to help our customers transition to the new technology landscape.”\nAbout ViON Corporation\nViON Corporation designs, delivers and maintains mission-critical IT infrastructure solutions on an enterprise scale for the military, governments and commercial businesses, while offering the highest level of security available anywhere around the globe. ViON is well known for its cost-effective compute, network and storage capabilities, delivered on premise or through the cloud anywhere on earth. Supported by cleared resources that are highly trained and armed with the industry's latest certifications and specializations, ViON has a legacy of helping its customers meet business goals and mission objectives, support warfighters and deliver citizen services and drive innovation and business growth. The veteran-owned business is located in Herndon, Virginia with field offices throughout the United States. For more information visit www.vion.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109006619/en/\nViON Corporation\nMariryan Starr, 919-601-5058\nmariryans@propelmg.com\nSource: ViON Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.vion.com&esheet=51740601&newsitemid=20180109006619&lan=en-US&anchor=www.vion.com&index=1&md5=2919ae04dfa077ec976ca92e35d26e7b", "http://www.businesswire.com/news/home/20180109006619/en/"], "published": "2018-01-09T22:45:00.000+02:00", "crawled": "2018-01-09T23:34:44.024+02:00", "highlightTitle": ""}