{"organizations": [], "uuid": "c0e3bdaacec55beff10792717c78f1aa4116e156", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-the-buccinipollin-group-acquires-hilton-melbourne-rialto-place-in-florida.html", "country": "US", "domain_rank": 767, "title": "The Buccini/Pollin Group Acquires Hilton Melbourne Rialto Place in Florida", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.121, "site_type": "news", "published": "2018-01-09T16:55:00.000+02:00", "replies_count": 0, "uuid": "c0e3bdaacec55beff10792717c78f1aa4116e156"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-the-buccinipollin-group-acquires-hilton-melbourne-rialto-place-in-florida.html", "ord_in_thread": 0, "title": "The Buccini/Pollin Group Acquires Hilton Melbourne Rialto Place in Florida", "locations": [], "entities": {"persons": [{"name": "dave pollin", "sentiment": "none"}], "locations": [{"name": "florida washington", "sentiment": "none"}, {"name": "melbourne international airport", "sentiment": "none"}, {"name": "fla", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "buccini/pollin group", "sentiment": "negative"}, {"name": "buccini/pollin group acquires hilton melbourne rialto place", "sentiment": "negative"}, {"name": "pm hotel group", "sentiment": "none"}, {"name": "hilton melbourne rialto place", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON--(BUSINESS WIRE)-- Officials of The Buccini/Pollin Group , a privately held, full-service real estate acquisition, development and management company (BPG), today announced that it has acquired the 238-room Hilton Melbourne Rialto Place in Melbourne, Fla. PM Hotel Group , a leading, national hotel management company based in Washington, D.C., will operate the hotel.\n“BPG’s recent acquisition of the beautifully renovated Hilton Melbourne Rialto Place reflects the continued success of our strategy of acquiring newly renovated, premier-branded, full-service hotels in key business markets across the US,” said Dave Pollin, co-founder, BPG. “With strong marketing and management, we believe this hotel has excellent upside. We now own and operate twenty-six hotels with several other acquisitions and development projects in the works.\n“The Hilton Melbourne Rialto Place is the only full-service, first-class hotel in the mainland market. It is centrally located just one-mile from the Melbourne International Airport; the surrounding aerospace industry’s booming Space Coast industrial base; Melbourne’s beautiful beaches; and multiple nearby youth sports complexes. The property also benefits from its sophisticated style, many recreational amenities, including tennis and basketball courts, and Hilton’s world class global distribution system.”\nThe hotel recently completed an extensive $5 million upgrade. With more 12,000 sq. ft. of function space, the Hilton Melbourne Rialto Place is one of the busiest meeting and event hubs on Florida’s Space Coast.\n2017 Particularly Active Year for BPG\n2017 was a particularly active year for BPG. Other highlights include:\nCompleted construction on the 310-room Embassy Suites Midtown Manhattan, the only Embassy Suites in New York City, opening January 17, 2018. Acquired the 238-room DoubleTree by Hilton Wilmington, Del. Broke ground on the 260-room Virgin Hotels Nashville, Tenn., in partnership with Virgin Hotels and founder Richard Branson. Acquired the HOTEL DU PONT, the historic, Four Diamond, Grande Dame in the heart of Wilmington, Del. Acquired the Sheraton DFW Airport Hotel, a 302-room, recently renovated hotel in dynamic Irving, Texas, epicenter of the Dallas Metroplex. Completed more than $30 million in renovations, upgrades and repositioning, including: a complete reimagining of the 353-room Sheraton Raleigh Hotel in N.C.; opening the first Renaissance Hotel in downtown Philadelphia; and an addition and comprehensive renovation of the Fairfield Inn by Marriott King of Prussia, Pa. Nearing completion of the 177-room Canopy by Hilton Hotel Washington, D.C. – Bethesda North, opening in February, 2018. Nearing completion of the 153-room Canopy by Hilton Portland, Ore. – Pearl District in April, 2018.\n“We maintain a full acquisition and development pipeline as we enter 2018,” Pollin added. “With the economy continuing to hum along and continued low interest rates, we forecast a happy and healthy New Year for both BPG and the hotel industry at large.”\nAbout The Buccini/Pollin Group\nThe Buccini/Pollin Group, Inc. (Buccini/Pollin) is a privately held, integrated real estate acquisition, development and management company with offices in Washington D.C., Wilmington, Philadelphia, and Baltimore. Buccini/Pollin has developed and acquired hotel, office, residential, retail, and parking properties throughout the United States, valued in excess of $4.0 billion. Investments include over 40 hotels, six million square feet of office and retail space, 10 major residential communities and multiple entertainment venues, such as Talen Energy Stadium, home of the Philadelphia Union Major League Soccer team. The principals of Buccini/Pollin, along with PM Hotel Group (hotel operating company), BPG Real Estate Services (office property management and leasing), ResideBPG (residential property management and leasing), BPGS Construction (construction management), oversee all aspects of project acquisition, finance, development, construction, leasing, operations, and disposition for its portfolio properties. The Buccini/Pollin Group has over 3,500 employees in 12 states. For more information, please visit www.bpgroup.net .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109005364/en/\nThe Buccini/Pollin Group, Inc.\nChris Daly, media\n703-435-6293\nchris@dalygray.com\nSource: The Buccini/Pollin Group, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180109005364/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bpgroup.net%2F&esheet=51739954&newsitemid=20180109005364&lan=en-US&anchor=The+Buccini%2FPollin+Group&index=1&md5=de8b532ce80b2ae25f85a5b655fab3ef", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bpgroup.net%2F&esheet=51739954&newsitemid=20180109005364&lan=en-US&anchor=www.bpgroup.net&index=3&md5=79bf16704812b13800104c0217a1189a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pmhotelgroup.com%2F&esheet=51739954&newsitemid=20180109005364&lan=en-US&anchor=PM+Hotel+Group&index=2&md5=cfe61491ea454f03a13ae65c898b23ff"], "published": "2018-01-09T16:55:00.000+02:00", "crawled": "2018-01-09T18:50:38.012+02:00", "highlightTitle": ""}