{"organizations": [], "uuid": "692b8653e03e795e30708b6c96d3df1c877ed977", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-mmsurvey-carlmarks/u-s-mid-market-lenders-concerned-about-leverage-loan-docs-report-idUSKBN1EY1LO", "country": "US", "domain_rank": 408, "title": "U.S. mid-market lenders concerned about leverage, loan docs: report", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.186, "site_type": "news", "published": "2018-01-09T22:04:00.000+02:00", "replies_count": 0, "uuid": "692b8653e03e795e30708b6c96d3df1c877ed977"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mmsurvey-carlmarks/u-s-mid-market-lenders-concerned-about-leverage-loan-docs-report-idUSKBN1EY1LO", "ord_in_thread": 0, "title": "U.S. mid-market lenders concerned about leverage, loan docs: report", "locations": [], "entities": {"persons": [{"name": "carl marks", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "carl marks advisors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Lenders to U.S. mid-sized businesses are increasingly concerned about the higher levels of debt held by middle market companies versus a year ago, as well as what they consider to be less restrictive leveraged loan documents, a survey by Carl Marks Advisors found.\nHigher leverage levels and borrower-friendly loan agreements, the result of highly competitive market conditions last year that pushed lenders to make such concessions, could impact loan portfolios if business performance comes under pressure.\nCarl Marks, a mid-market focused corporate restructuring and investment banking firm, conducted the national online survey in December 2017 of 190 participants from US middle market lending-related fields, including traditional bank lenders, alternative lenders, legal and accounting advisors, restructuring advisors, private equity and hedge fund investors, and other financial and business consultants.\n“This is now the third-longest economic expansion in US history, so it is getting a little bit long-dated. Companies are not necessarily improving and there is a lot of capital - both debt and equity - chasing too few deals,” Patrick Flynn, managing director at Carl Marks, said in an interview ahead of the survey’s release. “But while there is relatively more concern today than a year ago, it is not necessarily a predictor that the next contraction is any closer.”\nThe survey found that 76% of respondents are more concerned than they were at the beginning of 2017 about leverage levels at US middle market companies.\n“In 2017 many a transaction has added debt, but there has not been a lot of value created,” said Joseph D’Angelo, a partner at Carl Marks. “There are not a lot of unencumbered assets left to borrow more money against. If a company doesn’t perform through that, it will likely see a restructuring.”\nLeverage on middle market institutional deals increased in 2017 to 5.51x total debt to Ebitda compared to 4.95x in 2016, according to Thomson Reuters LPC data. Ebitda, or earnings before interest, tax, depreciation and amortization, is a measure of a company’s operating performance.\nRegarding concessions that lenders have offered to borrowers and private equity sponsors in the face of aggressive market conditions, 48% of respondents said they considered loan documents executed in 2017 to be less restrictive for borrowers than those executed immediately prior to the 2007-2008 financial crisis. Thirty-five percent said they did not consider documents to be less restrictive, while 17% said they were unsure.\nMiddle market covenant-lite issuance reached an all-time high of US$25bn in 2017, LPC data show. By comparison, before the financial crisis, 2007 middle market covenant-lite volume totaled US$7.49bn.\n“There is a fully functioning credit market and pressure to deploy capital remains robust. It’s hard to predict what will trigger the pendulum back towards lender-friendly terms. Currently it seems that lender pushback is still being solved with price and terms,” Flynn said.\nLOOSE DOCS Loan document concessions resulting in covenant-lite loans or springing covenants with lower triggers are of primary concern for respondents in 2018, followed by the allowance of add backs to Ebitda calculations.\nCovenant-lite refers to loans that are stripped of certain lender protections, including financial maintenance tests requiring the borrower to meet monthly or quarterly performance standards. Such tests serve as early warning signs in a potential default scenario. Boosting Ebitda, meanwhile, can increase a company’s financial flexibility with respect to incurring additional debt or setting restricted payments, thereby increasing credit risk and weakening investor protections.\n“As long as there are as many different funding sources and they keep raising capital, there are no forces that would influence loan documents to tighten up,” said D’Angelo.\nAs for types of lenders expected to face the greatest challenges in their loan portfolios this year, 26% of respondents said mezzanine lenders are at the top of the list. Business Development Companies (BDCs) were next in line with 23%, 18% said distressed investors and 14% selected traditional banks. Specialty finance companies and direct lenders were tied at 6.84% each, while bank asset-based lenders and equipment finance companies are ranked least likely to face trouble, at less than 5% each.\n“Many BDCs make investments in much smaller companies, which can be more vulnerable to economic contraction. BDCs also have a higher cost of capital relative to regulated banks, which dictates looking to invest in places that justify their cost of capital, which can also translate into added risk,” said Flynn.\nDespite heightened concerns about leverage and loan documentation, respondents were notably split regarding technical and payment defaults in 2018. Forty-three percent said deafults would increase and the same share said they would stay the same this year.\n“We don’t really expect much difference in 2018. If the economy can continue to grow, we expect to see more sector specific situations. Changes continue to ripple through healthcare with downward pressure on both federal and state budgets,” said D’Angelo. “The bitter chill has given the energy sector a boost. With prices increasing, there is more confidence around the table to do more constructive deals. We could even see some M&A there.”\nReporting by Leela Parker Deo; Editing by Lynn Adler and Jon Methven\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T22:04:00.000+02:00", "crawled": "2018-01-09T16:46:37.006+02:00", "highlightTitle": ""}