{"organizations": [], "uuid": "b0da67170fbb632972fa3a94ab60b68355298c5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226241253&w=1200&r=LYNXMPEE0S0JM", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-europe-stocks/chipmakers-sanofi-deal-dominate-european-share-trading-idUSKBN1FI0SV", "country": "US", "domain_rank": 408, "title": "Chipmakers, Sanofi deal dominate European share trading", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T10:43:00.000+02:00", "replies_count": 0, "uuid": "b0da67170fbb632972fa3a94ab60b68355298c5e"}, "author": "", "url": "https://www.reuters.com/article/us-europe-stocks/chipmakers-sanofi-deal-dominate-european-share-trading-idUSKBN1FI0SV", "ord_in_thread": 0, "title": "Chipmakers, Sanofi deal dominate European share trading", "locations": [], "entities": {"persons": [{"name": "ablynx", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "sanofi", "sentiment": "negative"}, {"name": "infineon", "sentiment": "none"}, {"name": "novo nordisk", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "dialog", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 8:52 AM / in 19 minutes Chipmakers, Sanofi deal dominate European share trading Helen Reid , Danilo Masoni 4 Min Read \nLONDON/MILAN (Reuters) - Stellar results from chip-maker AMS and another big pharma deal dominated European share trading at the start of a heavy earnings week, while a rise in bond yields hit income stocks. \nThe euro, whose strength had crimped stocks late last week, eased back from its highs, but Europe’s STOXX 600 index edged 0.2 percent, as investors held their breath for the results rush. \n“Some people are recalculating what the euro’s strength means for our earnings,” said Martin Moeller, co-head of Swiss and global equity portfolios at UBP in Geneva. \n“What kind of outlook do you give with the dollar at $1.25? I think companies will be more hesitant,” he added. \nAustria’s AMS ( AMS.S ) soared 16 percent after its 2017 revenue doubled and the iPhone component supplier raised its growth forecasts far beyond analyst expectations. \n“The clear message from these results is that we have these negative headlines about the iPhone 10 but it’s of course not the only client of AMS,” Moeller said, referring to a JP Morgan note last week saying iPhone X orders are weakening, which had hit the stock. \nPeers Dialog Semiconductor ( DLGS.DE ) and STMicro ( STM.MI ) rose 1.5 and 2.4 percent respectively, while Infineon ( IFXGn.DE ) reversed earlier gains, ending down 0.2 percent. \nChip-makers reduced gains with traders citing a report that Apple ( AAPL.O ) had cut production guidance for the iPhone X. \nSanofi ( SASY.PA ) muscled Novo Nordisk ( NOVOb.CO ) out of the way to buy Ablynx ( ABLX.BR ), clinching a 3.9 billion euro deal for the Belgian biotech firm. \n“The acquisition has some obvious strategic value with Ablynx’s most advanced product in development,” said Liberum analysts. “Sanofi can use its existing and recently acquired platform Bioverativ to help to commercialize the asset.” \nThe French pharma giant’s shares fell 0.8 percent as traders digested the hefty price tag of 45 euros per share, against Ablynx’s closing price of 39 euros on Friday. The offer was a 109 percent premium to Ablynx’s share price prior to Novo Nordisk’s bid on Jan 8. \nAblynx shares shot up 18.5 percent. \nShares in Swedish medical technology group Getinge ( GETIb.ST ) sank 10.5 percent to the bottom of the STOXX after it reported fourth-quarter profit far below market forecasts, and said 2018 results would be affected by currency transactions. \nSpain’s Bankia ( BKIA.MC ) fell 4.3 percent after reporting a fourth-quarter loss of 235 million euros due to one-off restructuring costs after its acquisition of smaller lender BMN. \nA fall in bond prices that sent German five-year bond yields turn into positive territory for the first time since 2015 weighed on dividend paying sectors like consumer staples and utilities. Reporting by Helen Reid and Danilo Masoni; editing by Tom Pfeiffer and Toby Chopra", "external_links": [], "published": "2018-01-29T10:43:00.000+02:00", "crawled": "2018-01-29T11:05:03.009+02:00", "highlightTitle": ""}