{"organizations": [], "uuid": "62eadf7406a4ac5e565e10d575a54336035a8189", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/10/jerome-powell-bipartisan-policy-center.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/who-is-jerome-powell-fed-trump/", "country": "US", "domain_rank": 1196, "title": "Jerome Powell: Meet Fed Chair, Most Powerful After President Trump | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.583, "site_type": "news", "published": "2018-01-25T21:50:00.000+02:00", "replies_count": 0, "uuid": "62eadf7406a4ac5e565e10d575a54336035a8189"}, "author": "Lucinda Shen", "url": "http://fortune.com/2018/01/24/who-is-jerome-powell-fed-trump/", "ord_in_thread": 0, "title": "Jerome Powell: Meet Fed Chair, Most Powerful After President Trump | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jerome powell", "sentiment": "negative"}, {"name": "lucinda shen", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "yellen", "sentiment": "none"}, {"name": "powell", "sentiment": "none"}, {"name": "janet yellen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "u.s. senate", "sentiment": "negative"}, {"name": "meet fed", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "carlyle group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Lucinda Shen 7:50 PM EST \nWith relatively little opposition, the U.S. Senate voted on Tuesday to confirm Federal Reserve Governor Jerome Powell as the next head of the central bank . \nThe Senate approved him 84 to 13 for what is arguably among the most powerful jobs in the U.S. government after the President. Investors breathed something of a sigh of relief upon the news , with the 64-year-old considered a departure from many of President Donald Trump’s other nomination because Powell is mostly expected to continue Chairwoman Janet Yellen’s post-financial crisis policies. \n“He’s been part of the consensus,” Yellen said of Powell in December, noting, as many market watchers, that he is likely to continue pursuing the Fed’s strategy of gradual interest rate hikes. Powell has voted in favor of every monetary policy decision since he first joined the Fed in 2012. The Fed is expected to hike interest rates three times in 2018, while Yellen is expected to step down Feb. 3. \nWhere the wealthy alumnus of private equity firm Carlyle Group may differ in approach from the recent history of the Fed is banking regulation. In line with Trump’s own deregulatory stance toward businesses, Powell has been thought to oppose some of the laws passed following the 2008 financial crisis. In a confirmation hearing late November, Powell said that he would like to see more tailored regulation of banks—with perhaps less for smaller regional and community banks. \n“While the recent nomination of Jerome Powell as Federal Reserve chair signals little change in rate policy, we will keep an eye on whether he guides the Fed to adjust its approach to bank regulation,” wrote T. Rowe Price economists in a recent note. “The new chair may loosen regulations for small banks, but we caution that investors should not expect Powell to be an advocate for wholesale deregulation.” \nPowell’s track record at the Fed however doesn’t mean investors are letting their guard down. His lack of an economics degree has raised questions about how he might react in the face of drastic economic changes. \nMeanwhile, with Yellen resigning as a governor after Powell’s swearing in, Trump will be tasked with filled three empty governor seats—resulting in the current administration choosing six out of seven Board of Governor seats. The additions will also have a long-term effect beyond that of Trump’s own tenure in the White House, with a full governor term lasting 14 years. \nAll things considered, Powell has also been relatively quiet in public, using his influence behind the scenes. Deutsche Bank’s Torsten Slok dubbed the new Fed leadership a potential top risk to markets in 2018 due to uncertainty surrounding the incoming chair. \n“Will Powell be politically driven, or driven by incoming data?” he wrote in a December note. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T21:50:00.000+02:00", "crawled": "2018-01-25T18:37:13.009+02:00", "highlightTitle": ""}