{"organizations": [], "uuid": "d2a6f586fc856ae31aa24022e03307733cb24a2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220564001&w=1200&r=LYNXMPEE080X1", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/usa-stocks/futures-edge-up-sp-set-for-record-open-idINKBN1EY1IM", "country": "US", "domain_rank": 408, "title": "Wall Street hits new record at open on healthcare, bank gains", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:04:00.000+02:00", "replies_count": 0, "uuid": "d2a6f586fc856ae31aa24022e03307733cb24a2c"}, "author": "", "url": "https://in.reuters.com/article/usa-stocks/futures-edge-up-sp-set-for-record-open-idINKBN1EY1IM", "ord_in_thread": 0, "title": "Wall Street hits new record at open on healthcare, bank gains", "locations": [], "entities": {"persons": [{"name": "kohl", "sentiment": "none"}, {"name": "sruthi shankar", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "johnson & johnson", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "lululemon athletica", "sentiment": "none"}, {"name": "boston scientific", "sentiment": "none"}, {"name": "corp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Wall Street’s major indexes extended the New Year rally to close at record levels on Tuesday on investor optimism ahead of quarterly earnings reports and hopes for easing tensions with North Korea.\nTraders work on the floor at the New York Stock Exchange (NYSE) in Manhattan, New York City, U.S., December 21, 2016. REUTERS/Andrew Kelly/Files Defensive S&P sectors - utilities, real estate and telecommunications - were out of favour, while bank stocks were boosted by rising U.S. 10-year Treasury yields. Healthcare stocks rose with the sector in focus on the second day of an industry conference.\nThe S&P 500 and Nasdaq registered their sixth closing record highs in a row. The Dow also ended at record levels after it had snapped a 3-day run of closing highs in Monday’s session.\nSome investors were reassured that North and South Korea held their first talks in more than two years, which Washington described as a good first step in solving the North’s nuclear missile programme crisis. Pyongyang said it would not discuss weapons that were aimed only at the United States.\n“The diplomacy taking place between North Korea and South Korea might circumvent some type of military action. Anything that would de-risk the peninsula would be viewed favourably by investors,” said Mark Luschini, chief investment strategist at Janney Montgomery Scott in Philadelphia.\nThe Dow Jones Industrial Average .DJI rose 102.8 points, or 0.41 percent, to 25,385.8, the S&P 500 .SPX gained 3.58 points, or 0.13 percent, to 2,751.29 and the Nasdaq Composite .IXIC added 6.19 points, or 0.09 percent, to 7,163.58.\nProfits for S&P 500 companies are expected to rise 11.8 percent in the fourth quarter, compared with an 8-percent increase a year earlier, according to Thomson Reuters I/B/E/S.\n“There will be some noise there with tax adjustments, but the forward-looking comments ought to be pretty positive. Investors are buying into that,” said Bucky Hellwig, senior vice president at BB&T Wealth Management in Birmingham, Alabama.\nThe S&P financial sector .SPSY ended 0.8 percent higher after yields on the 10-year U.S. Treasury note hit a 10-month high after the Bank of Japan said it will trim its purchases of Japanese government bonds.\nInterest-rate sensitive utilities .SPLRCU and real estate .SPLRCR sectors ended 1 percent lower while the telecommunications .SPLRCL sector fell 1.8 percent.\nWhile investors are hopeful about global economic growth and tax-cut led gains for corporate earnings, they are anxious about whether the tax-overhaul could overheat inflation and lead to a sharper than expected rise in interest rates.\nAfter a lukewarm December jobs report, signs of a pickup in inflation could come in the monthly consumer price report due on Friday, on the same day that big U.S. banks are set to kick off the fourth-quarter earnings season.\nThe S&P healthcare sector .SPXHC closed 1 percent higher, boosted by a 1.6-percent rise in Johnson & Johnson ( JNJ.N ), a 5-percent gain in Gilead ( GILD.O ) and a 8.3-percent jump in Boston Scientific ( BSX.N ) shares.\nChip stocks dragged on the technology sector .SPLRCT, which fell 0.3 percent. Intel ( INTC.O ) fell 2.5 percent after Microsoft Corp said computers with older Intel chips slowed noticeably after it released security patches.\nDeclining issues outnumbered advancing ones on the NYSE by a 1.41-to-1 ratio; on Nasdaq, a 1.19-to-1 ratio favoured decliners.\nThe S&P 500 posted 124 new 52-week highs and 3 new lows; the Nasdaq Composite recorded 131 new highs and 24 new lows.\nVolume on U.S. exchanges was 6.77 billion shares, above the 6.3 billion average for the full session over the last 20 trading days.\nAdditional reporting by Caroline Valetkevitch in New York, Sruthi Shankar in Bengaluru; Editing by Arun Koyyur and Nick Zieminski\n ", "external_links": [], "published": "2018-01-09T17:04:00.000+02:00", "crawled": "2018-01-09T17:26:15.013+02:00", "highlightTitle": ""}