{"organizations": [], "uuid": "f8595293aa8cebbe848ccbcd37cd275cddcd93d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-john-doris-joins-tbwachiatday-new-york-as-head-of-integrated-production.html", "country": "US", "domain_rank": 767, "title": "John Doris Joins TBWA\\Chiat\\Day New York as Head of Integrated Production", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.13, "site_type": "news", "published": "2018-01-08T22:00:00.000+02:00", "replies_count": 0, "uuid": "f8595293aa8cebbe848ccbcd37cd275cddcd93d4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-john-doris-joins-tbwachiatday-new-york-as-head-of-integrated-production.html", "ord_in_thread": 0, "title": "John Doris Joins TBWA\\Chiat\\Day New York as Head of Integrated Production", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 8, 2018 /PRNewswire/ -- TBWA\\Chiat\\Day New York today announced that it has hired John Doris as Head of Integrated Production. Doris, who starts at the agency this week, is the first major hire for newly-appointed Chief Creative Officer Chris Beresford-Hill, who joined the agency in October.\nReporting directly to Beresford-Hill, Doris will lead production for the agency, and be a key driver in exploring and discovering new media, technology and platforms across its client roster, which includes Accenture, adidas, eos, Hilton, McDonald's, Michelin, Nissan, PepsiCo, TD Bank, Thomson Reuters, Tic-Tac and Travelers Insurance, among others.\n\"John and I both see production the same way, not just an extension of creative, but a true partnership,\" said Beresford-Hill. \"I've worked with John in the past and seen firsthand the passion and expertise that he brings to the table, and so I feel incredibly fortunate to have him as a partner, leading production and bringing disruptive creative ideas to life for our clients.\"\nDoris comes to TBWA from Saatchi & Saatchi New York, where he was Head of Integrated Production. As a lead and longtime curator for the world-renowned Saatchi & Saatchi New Directors Showcase, held annually in Cannes, Doris also has unparalleled experience in discovering and working with the best emerging filmmakers in the industry. Prior to New York, Doris was EVP, Executive Producer at Saatchi & Saatchi's London office, where he produced award-winning content for clients such as T-Mobile, NSPCC, Cadbury, P&G among others.\n\"TBWA is a storied agency, here in New York and globally, and I'm honored to have the opportunity to shape and grow its creative output alongside a really great group of talented people,\" said Doris. \"This is an exciting new creative chapter for the agency, and I am thrilled to be a part of it.\"\nDoris has won numerous creative awards throughout this career, and is responsible for some of the industry's most iconic work, most recently the Tide \"Bradshaw Stain\" Super Bowl commercial and live game integration, which brought home 12 Cannes Lions in 2017, a series of short films entitled \"The Receipt\" for Walmart that was featured on the 2017 Academy Awards broadcast, and Prop8's \"Devin and Glenn\" campaign, in which he worked in partnership with Beresford-Hill. Other work highlights include JCPenney's \"Beware of the Doghouse,\" Luvs \"Lullaby Lift\" and Coordown's \"Now You See Me\".\nFor more news from the TBWA network please visit: tbwa.com/news\nAbout TBWA\\Worldwide\nTBWA\\Worldwide ( http://www.tbwa.com ) is a top-ten ranked global advertising collective that holds Disruption® at its core to develop business-changing ideas for brands. TBWA has 11,300 employees across 305 offices in 98 countries and also includes brands such as Auditoire, Digital Arts Network (DAN), eg+ worldwide, The Integer Group®, TBWA\\Media Arts Lab and TBWA\\WorldHealth. TBWA's global clients include adidas, Apple, Gatorade, Henkel, McDonald's, Michelin, Nissan, Pernod Ricard, Standard Chartered Bank, Singapore Airlines, Sotheby's and Vichy. Follow TBWA on Twitter and Instagram and like us on Facebook .\nAbout Omnicom Group Inc.\nOmnicom Group Inc. (NYSE: OMC) ( http://www.omnicomgroup.com ) is a leading global marketing and corporate communications company. Omnicom's branded networks and numerous specialty firms provide advertising, strategic media planning and buying, digital and interactive marketing, direct and promotional marketing, public relations and other specialty communications services to over 5,000 clients in more than 100 countries.\nView original content: http://www.prnewswire.com/news-releases/john-doris-joins-tbwachiatday-new-york-as-head-of-integrated-production-300579214.html\nSOURCE TBWA\\Worldwide", "external_links": ["http://www.omnicomgroup.com/", "http://www.tbwa.com/", "http://www.prnewswire.com/news-releases/john-doris-joins-tbwachiatday-new-york-as-head-of-integrated-production-300579214.html", "https://www.instagram.com/tbwa/", "http://tbwa.com/news/", "https://twitter.com/TBWA", "https://www.facebook.com/TBWAWorldwide"], "published": "2018-01-08T22:00:00.000+02:00", "crawled": "2018-01-09T09:40:13.941+02:00", "highlightTitle": ""}