{"organizations": [], "uuid": "99bf3ddfd4e60c51767cd8c0507361244f1a9980", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-21st-century-oncology-receives-court-approval-of-plan-of-reorganization.html", "country": "US", "domain_rank": 767, "title": "21st Century Oncology Receives Court Approval of Plan of Reorganization", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-09T22:03:00.000+02:00", "replies_count": 0, "uuid": "99bf3ddfd4e60c51767cd8c0507361244f1a9980"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-21st-century-oncology-receives-court-approval-of-plan-of-reorganization.html", "ord_in_thread": 0, "title": "21st Century Oncology Receives Court Approval of Plan of Reorganization", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "myers", "sentiment": "none"}], "organizations": [{"name": "21st century oncology receives court", "sentiment": "negative"}, {"name": "21st century oncology holdings, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "roystone capital management lp", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "hps investment partners", "sentiment": "none"}, {"name": "beach point capital management", "sentiment": "none"}, {"name": "united states bankruptcy court for the southern district of new york", "sentiment": "none"}, {"name": "oaktree capital management", "sentiment": "none"}, {"name": "j.p. morgan investment management, inc.", "sentiment": "none"}, {"name": "the court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT MYERS, Fla., Jan. 09, 2018 (GLOBE NEWSWIRE) -- 21st Century Oncology Holdings, Inc., the largest global provider of integrated cancer care services, announced today that the United States Bankruptcy Court for the Southern District of New York has confirmed the Company’s chapter 11 plan of reorganization. The Plan, as approved today, is expected to reduce the Company’s long-term debt by more than $500 million, strengthen its balance sheet and establish a sustainable capital structure.\nThe Company expects to complete the financial restructuring process and emerge from chapter 11 within the next couple of weeks. Upon emergence, the majority owners of the reorganized Company, which include certain funds and accounts managed by Beach Point Capital Management, LP, Governors Lane, LP, J.P. Morgan Investment Management, Inc., Oaktree Capital Management, L.P., Roystone Capital Management LP and HPS Investment Partners, LLC, will provide fresh capital to the Company.\n“The Court’s approval of the Plan is the culmination of months of hard work and constructive negotiations. 21 st Century Oncology is well poised to achieve its objective of being the preeminent integrated cancer care provider in the country,” said Jeff Goldberg, incoming Chairman of the Board of the reorganized Company. “We are pleased with all the cooperation we received in reaching this important milestone, and very soon 21 st Century Oncology will emerge from chapter 11 as a more financially stable company with a stronger balance sheet. We will be poised for long-term growth and have the financial flexibility to continue to be at the forefront of cancer care.\"\nThomas Gordon, board member of the reorganized Company and long-time consultant to the Company, stated, “[t]oday's confirmation provides us with an opportunity to put the past behind us and focus on our strategic vision for the future. I want to thank our dedicated employees and physicians, and the hospital and joint venture partners, who remained focused on providing the best possible care to patients throughout this process, which has positioned us to be on the cusp of a transformation that holds significant opportunities for 21 st Century Oncology.\"\nAbout 21st Century Oncology Holdings, Inc.\n21st Century Oncology Holdings, Inc. is the largest global provider of integrated cancer care services. The Company offers a comprehensive range of cancer treatment services, focused on delivering academic quality, cost-effective patient care in personal and convenient settings. As of March 31, 2017, the Company operated 179 treatment centers, including 143 centers located in 17 U.S. states and 36 centers located in seven countries in Latin America.\nForward Looking Statements\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Act of 1934, as amended. Statements preceded by, followed by or that otherwise include the words “believes”, “expects”, “anticipates”, “intends”, “projects”, “estimates”, “plans”, “may increase”, “forecast” and similar expressions or future or conditional verbs such as “will”, “should”, “would”, “may” and “could” are generally forward-looking in nature and not historical facts. Forward-looking statements are based on management’s current expectations or beliefs about the Company’s future plans, expectations and objectives. These forward-looking statements are not historical facts and are subject to risks and uncertainties that could cause the actual results to differ materially from those projected in these forward looking statements including, but not limited to reductions in Medicare reimbursement, healthcare reform, state and federal investigations, claims and litigation matters, decreases in payments by managed care organizations and other commercial payers, liquidity, leverage ratios and compliance with other debt covenants and other risk factors that may be described from time to time in the Company’s filings with the Securities and Exchange Commission. Readers of this release are cautioned not to place undue reliance on forward-looking statements contained herein, which speak only as of the date stated, or if no date is stated, as of the date of this press release. The Company undertakes no obligation to publicly update or revise the forward-looking statements contained herein to reflect changed events or circumstances after the date of this release, unless required by law.\nCautionary Note Regarding the Chapter 11 Cases\nThe Company’s security holders are cautioned that trading in securities of the Company during the pendency of these Chapter 11 cases will be highly speculative and will pose substantial risks. It is possible some or all of the Company’s currently outstanding securities may be cancelled and extinguished upon confirmation of a restructuring plan by the Bankruptcy Court. In such an event, the Company’s security holders would not be entitled to receive or retain any cash, securities or other property on account of their cancelled securities. Trading prices for the Company’s securities may bear little or no relation to actual recovery, if any, by holders thereof in the Company’s Chapter 11 cases. Accordingly, the Company urges extreme caution with respect to existing and future investments in its securities.\nMedia Contacts\nSard Verbinnen & Co.\nAndrew Cole 212.687.8080 / Steven Goldberg 310.201.2040\n21CO-SVC@sardverb.com\nSource: 21st Century Oncology", "external_links": ["https://www.globenewswire.com/Tracker?data=HMsMCMw1WSipCjplvOacaLa02MXUC-eQnqD8UfUy2VQM6564cephD9T6n82Mmbvp02qAzG2WEOYBY4NVA9lMR2ybXYmFPiFDYqL1_ni8koI="], "published": "2018-01-09T22:03:00.000+02:00", "crawled": "2018-01-09T23:35:17.005+02:00", "highlightTitle": ""}