{"organizations": [], "uuid": "7a780a00cb2732fcfb80efa816b109312a68ddca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-nn-inc-appoints-elvin-c-tyler-chief-compliance-officer.html", "country": "US", "domain_rank": 767, "title": "NN, Inc. Appoints Elvin C. Tyler Chief Compliance Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.086, "site_type": "news", "published": "2018-01-18T18:01:00.000+02:00", "replies_count": 0, "uuid": "7a780a00cb2732fcfb80efa816b109312a68ddca"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-nn-inc-appoints-elvin-c-tyler-chief-compliance-officer.html", "ord_in_thread": 0, "title": "NN, Inc. Appoints Elvin C. Tyler Chief Compliance Officer", "locations": [], "entities": {"persons": [{"name": "elvin c. tyler", "sentiment": "negative"}, {"name": "elvin", "sentiment": "none"}, {"name": "tyler", "sentiment": "none"}, {"name": "richard holder", "sentiment": "none"}], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "johnson city", "sentiment": "none"}], "organizations": [{"name": "nn, inc", "sentiment": "neutral"}, {"name": "nn, inc.", "sentiment": "neutral"}, {"name": "nn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHNSON CITY, Tenn., Jan. 18, 2018 /PRNewswire/ -- NN, Inc., (NASDAQ: NNBR) a diversified industrial company, today announced that it has appointed Elvin C. Tyler as Chief Compliance Officer. This role is in addition to Tyler's position as Vice President, Internal Audit. In his new role, Tyler will have overall responsibility for NN's ethics and compliance program, and he will support NN's business operations and leadership team in driving business success through an organizational culture committed to integrity, ethical conduct, and compliance with the law, industry regulations and the NN Operating System.\n\"Elvin's appointment demonstrates NN's on-going commitment to the strengthening of our compliance program across all of our markets,\" stated Richard Holder, President and CEO of NN. \"His extensive expertise will ensure that NN continues to develop a world-class compliance function and strong ethical culture, an initiative that is of critical importance to the Board of Directors and senior management team.\"\n\"A strong ethical culture helps form the backbone of NN's mission to provide high-quality products to our customers,\" stated Robert Brunner, Chairman of the Board. \"We are pleased that Elvin will take on this important role to help us maintain our performance as an ethically sound, world-class company.\"\nTyler has over 25 years of broad experience in internal audit, risk management, and corporate governance. Tyler joined NN in 2016 as Director of Internal Audit, with responsibility for NN's global internal audit function. Tyler earned a Bachelor of Science degree in accounting from San Francisco State University and his MBA from the Masagung Graduate School of Management at the University of San Francisco.\nNN, Inc., a diversified industrial company combines advanced engineering and production capabilities with in-depth materials science expertise to design and manufacture high-precision components and assemblies for a variety of markets on a global basis. NN has 36 manufacturing facilities in North America, Western Europe, Eastern Europe, South America and China.\nExcept for specific historical information, many of the matters discussed in this press release may express or imply projections of revenues or expenditures, statements of plans and objectives or future operations or statements of future economic performance. These, and similar statements, are forward-looking statements concerning matters that involve risks, uncertainties and other factors which may cause the actual performance of NN, Inc. and its subsidiaries to differ materially from those expressed or implied by this discussion. All forward-looking information is provided by the Company pursuant to the safe harbor established under the Private Securities Litigation Reform Act of 1995 and should be evaluated in the context of these factors. Forward-looking statements generally can be identified by the use of forward-looking terminology such as \"assumptions\", \"target\", \"guidance\", \"outlook\", \"plans\", \"projection\", \"may\", \"will\", \"would\", \"expect\", \"intend\", \"estimate\", \"anticipate\", \"believe\", \"potential\" or \"continue\" (or the negative or other derivatives of each of these terms) or similar terminology. Factors which could materially affect actual results include, but are not limited to: general economic conditions and economic conditions in the industrial sector, inventory levels, regulatory compliance costs and the Company's ability to manage these costs, start-up costs for new operations, debt reduction, competitive influences, risks that current customers will commence or increase captive production, risks of capacity underutilization, quality issues, availability and price of raw materials, currency and other risks associated with international trade, the Company's dependence on certain major customers, and the successful implementation of the global growth plan including development of new products. Similarly, statements made herein and elsewhere regarding pending and completed transactions are also forward-looking statements, including statements relating to the future performance and prospects of an acquired business, the expected benefits of an acquisition on the Company's future business and operations and the ability of the Company to successfully integrate recently acquired businesses or the possibility that the Company will be unable to execute on the intended redeployment of proceeds from a divestiture, whether due to a lack of favorable investment opportunities or otherwise.\nFor additional information concerning such risk factors and cautionary statements, please see the section titled \"Risk Factors\" in the Company's periodic reports filed with the Securities and Exchange Commission, including, but not limited to, the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2016. Except as required by law, we undertake no obligation to update or revise any forward-looking statements we make in our press releases, whether as a result of new information, future events or otherwise.\nView original content: http://www.prnewswire.com/news-releases/nn-inc-appoints-elvin-c-tyler-chief-compliance-officer-300584619.html\nSOURCE NN, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/nn-inc-appoints-elvin-c-tyler-chief-compliance-officer-300584619.html"], "published": "2018-01-18T18:01:00.000+02:00", "crawled": "2018-01-18T20:12:58.005+02:00", "highlightTitle": ""}