{"organizations": [], "uuid": "2aab9f52b47dd54856e5152e447d457b5d2d724b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-monarques-gold-produces-5444-ounces-of-gold-and-generates-10-point-3-million-in-revenue-in-q2-2018.html", "country": "US", "domain_rank": 767, "title": "Monarques Gold Produces 5,444 Ounces of Gold and Generates $10.3 Million in Revenue in Q2 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:55:00.000+02:00", "replies_count": 0, "uuid": "2aab9f52b47dd54856e5152e447d457b5d2d724b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-monarques-gold-produces-5444-ounces-of-gold-and-generates-10-point-3-million-in-revenue-in-q2-2018.html", "ord_in_thread": 0, "title": "Monarques Gold Produces 5,444 Ounces of Gold and Generates $10.3 Million in Revenue in Q2 2018", "locations": [], "entities": {"persons": [{"name": "mona", "sentiment": "negative"}], "locations": [{"name": "beaufor", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ounces produced at Beaufor up 62% from the prior quarter\nMONTREAL, Jan. 18, 2018 /PRNewswire/ - MONARQUES GOLD CORPORATION (\"Monarques\" or the \"Corporation\") (TSX.V:MQR) (OTCMKTS:MRQRF) (FRANKFURT:MR7) is pleased to report its production results and highlights for the second quarter ended December 31, 2017 (\"Q2 2018\"). All amounts are in Canadian dollars unless otherwise indicated.\nQ2 2018 Production Highlights\nMonarques produced 5,444 ounces of gold in Q2 2018, a 62% increase over the 3,380 ounces produced in the prior quarter by the previous owner, and a 16% increase over the quarterly average of 4,715 ounces produced during the prior nine-month period. The Corporation recorded revenue of $10.3 million in the second quarter based on an average gold price of $1,612 per ounce (US $1,268) and 5,444 ounces sold combined with toll milling activities. The Corporation reported strong results from its drilling program at the Beaufor mine, including 61.48 g/t Au over 3.9 metres (see press release dated January 11, 2018 ), which confirms the strong exploration potential in the area east of Zone Q.\n\"We exceeded our target for the quarter by producing more gold than anticipated,\" said Jean-Marc Lacoste, President and Chief Executive Officer of Monarques. \"Our toll milling activities were also strong. With the addition of Eldorado Gold (TSX:ELD; NYSE:EGO) and Nottaway Resources, the Camflo mill operated at 72% capacity during the last quarter, and based on the contracts signed for 2018 with Nottaway and Wallbridge Mining, among others, we expect to continue to increase mill productivity in the next quarter. On the exploration side, our recent drilling program at Beaufor was a success, and we plan to continue drilling to increase the mine's gold resource.\"\nQ2 2018 Production Statistics\nProduction statistics\nQ2 2018\nBeaufor mine statistics\nOre processed (tonnes)\n35,005\nGold recovery (%)\n98.68\nOunces produced\n5,444\nOunces sold\n5,444\nQ2 2018 Corporate Highlights\nOn October 2, 2017, Monarques completed the acquisition of Richmont Mines' Quebec assets, combined with a $6.5 million financing and a US $4.0 million credit facility (see press release ). On October 26, 2017, Monarques announced the results of an updated NI 43-101 Mineral Resource Estimate on its wholly-owned Wasamac gold project, which established a Measured and Indicated resource of 2,587,900 ounces and an Inferred resource of 293,900 ounces of gold (see press release ). On December 14, 2017, Monarques reported strong results from its drilling program at the Croinor Gold deposit, including 7.84 g/t Au over 9.0 metres (29.5 feet) (see press release ). These new results are additional evidence that the geological model provides predictability and that the Croinor Gold deposit remains open along strike and at depth. On December 21, 2017, Monarques announced the acquisition of the McKenzie Break and Swanson gold properties from Agnico Eagle Mines Limited (NYSE:AEM; TSX:AEM) (see press release ). This transaction allowed the Corporation to consolidate its land position in the Abitibi region by adding two high-quality gold projects to its portfolio, which, along with Wasamac and Croinor Gold, brings the total of Monarques' advanced projects to four. With the closing of the recent flow-through financings and the exercise of stock options and warrants in the month of December, the Corporation had over $17 million in cash as of December 31, 2017.\nNext Steps\nMonarques' goal for the coming quarters is to increase the throughput of the Camflo mill with ore from the Beaufor mine and toll milling activities while reducing its production costs. The priorities at the Beaufor mine are to steadily improve productivity and increase grade through more selective mining. The Corporation will also assess the possibility of restarting the Beacon mill in the second half of the year, as it foresees increased demand for toll milling services. Finally, Monarques will continue exploring the Beaufor and Croinor Gold properties and will initiate new programs and/or technical studies to advance the Wasamac, McKenzie Break and Swanson gold projects.\n\"2018 will be another milestone year for Monarques, as we will pursue our growth strategy with the goals of improving our financial performance, increasing our gold resources and continuously enhancing the value of Monarques for our shareholders,\" concluded M. Lacoste.\nThe technical and scientific content of this press release has been reviewed and approved by Marc-André Lavergne, Eng., the Corporation's qualified person under National Instrument 43‑101.\nABOUT MONARQUES GOLD CORPORATION\nMonarques Gold Corp (TSX.V:MQR) is an emerging gold producer focused on pursuing growth through its large portfolio of high-quality projects in the Abitibi mining camp in Quebec, Canada. The Corporation currently owns close to 300 km² of gold properties (see map ), including the Beaufor Mine, the Croinor Gold (see video ), Wasamac, McKenzie Break and Swanson advanced projects, and the Camflo and Beacon mills, as well as six promising exploration projects. It also offers custom milling services out of its 1,600 tonne-per-day Camflo mill. Monarques enjoys a strong financial position and has more than 150 skilled employees who oversee its operating, development and exploration activities.\nForward-Looking Statements\nThe forward-looking statements in this press release involve known and unknown risks, uncertainties and other factors that may cause Monarques' actual results, performance and achievements to be materially different from the results, performance or achievements expressed or implied therein. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.\nSOURCE Monarques Gold Corporation", "external_links": ["https://www.monarquesgold.com/news-releases/monarques-gold-reports-2-6-million-ounces-in-measured-and-indicated-resources-on-the-wasamac-gold-project", "https://www.monarquesgold.com/news-releases/monarques-gold-acquires-agnico-eagles-mckenzie-break-and-swanson-properties", "https://www.monarquesgold.com/news-releases/monarques-gold-intersects-61-48-g-t-au-over-3-9-metres-12-8-feet-at-the-beaufor-mine", "https://www.monarquesgold.com/en/investors/corporate-video", "http://monarquesgoldfiles.com/documents/files/Monarques-Gold-LocalisationGenerale_FR+EN.pdf", "https://www.monarquesgold.com/news-releases/monarques-gold-intersects-7-84-g-t-au-over-9-0-metres-29-5-feet-at-croinor-gold", "https://www.monarquesgold.com/news-releases/monarques-gold-announces-the-closing-of-the-transaction-to-acquire-all-the-mining-assets-of-richmont-mines-in-the-province-of-quebec"], "published": "2018-01-18T16:55:00.000+02:00", "crawled": "2018-01-18T20:47:26.001+02:00", "highlightTitle": ""}