{"organizations": [], "uuid": "331d0adc6bf3076cd8ef0c6220bcdafbda22da80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-868706174.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/facebook-trump-russia-ads-overlap/", "country": "US", "domain_rank": 1196, "title": "Facebook: 'Insignificant' Overlap of Russia Ads, Trump Campaign | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.438, "site_type": "news", "published": "2018-01-26T23:16:00.000+02:00", "replies_count": 0, "uuid": "331d0adc6bf3076cd8ef0c6220bcdafbda22da80"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/25/facebook-trump-russia-ads-overlap/", "ord_in_thread": 0, "title": "Facebook: 'Insignificant' Overlap of Russia Ads, Trump Campaign | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jaap arriens", "sentiment": "none"}, {"name": "colin stretch", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}], "organizations": [{"name": "trump campaign | fortune facebook", "sentiment": "negative"}, {"name": "est  facebook", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "senate intelligence committee", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook Says It Found an 'Insignificant' Overlap Between Russia Ads and President Trump's Campaign A Facebook logo is seen on a computer screen in this photo illustration on Oct. 31, 2017. Jaap Arriens—NurPhoto/Getty Images By Bloomberg 9:16 PM EST \nFacebook (fb) told a Senate panel that it has detected “only what appears to be insignificant overlap” between targeting of ads and content promoted by a pro-Kremlin Russia group and by the presidential campaign of Donald Trump. \nThe social-media company said it “does not believe it is in a position to substantiate or disprove allegations of possible collusion” between Russia and the Trump campaign, as part of a written response to questions from the Senate Intelligence Committee released Thursday evening by the panel. Facebook didn’t go into further detail, saying it was willing to schedule a meeting with Senate staff to discuss the matter. \nThe remarks go beyond what the company told Congress during public hearings on Nov. 1 as part of probes into Russian election meddling. At that time, Facebook General Counsel Colin Stretch said, “We have not seen overlap in the targeting — that was relatively rudimentary — used in the advertising that was disclosed, and any other advertiser on the site, including the Trump campaign.” \nIn responding to the Senate panel, Facebook, Twitter (twtr) . and Alphabet’s Google (goog) defended their efforts to combat malicious content on their networks and touted new disclosure efforts for election-related content that should be up and running for the 2018 midterm elections. \nThe company answers aren’t likely to quell concerns from lawmakers that the companies may not have found all of the abuse of its networks by Russians or taken enough steps to prevent future actions \nFacebook said it has no evidence that the Russian Internet Research Agency, which disseminated fake news and ads, targeted its efforts based on U.S. voter registration data. \nTheir targeting was “relatively rudimentary, targeting broad locations and interests,” the company said. Any revenue that Facebook made from ads run by the IRA was “immaterial,” it added, noting that it was contributing hundreds of thousands of dollars to the Defending Digital Democracy Project. \nFacebook also said that the IRA organized 129 real-world events, viewed by approximately 338,300 people, with 62,500 people saying they were planning to attend. Facebook said that in some cases, its algorithm did automatically recommend that people view, follow or join Russian-linked pages, because the company wasn’t aware that they were not legitimate. \nTwitter and Google didn’t address the possibility of overlap between the Russian-backed IRA and the Trump campaign in their latest answers. \nBut Twitter did say it wasn’t aware of “any specific state-sponsored attempts to interfere in any American elections in 2017, including the Virginia and New Jersey gubernatorial elections.” \nTwitter said it was unable to monitor every tweet posted in relation to real-time events, but that it dedicated nearly the entire engineering, product and design teams to address malicious automation, bots and other coordinated activities in the beginning of 2017. Its automated systems are supplemented by internal, manual reviews conducted by Twitter employees, the company said. \n“We are committed to addressing the spread of misinformation on our platform — and to prevent future attempts to interfere with U.S. elections — but we recognize that spam and malicious automation are not limited to political content and can undermine the positive user experience we seek to offer irrespective of the content,” the company said. \nGoogle told Senate investigators it is working on “greater transparency” for news in its search results, including labeling sources that receive funding from governments. RT and Sputnik, prominent publishers backed by the Russian government, are now labeled in search, the company said. Google also said it’s planning to apply the same disclosures on YouTube, its massive video site, although it didn’t offer specifics. \nFacebook said it has no problem with RT and Sputnik maintaining pages on Facebook and using its advertising tools, as long as they comply with the company’s policies and local laws. \nFacebook was also asked how much news content on its site was “hyper-partisan.” \n“Defining what is hyper-partisan is difficult and controversial, and we do not have an estimate,” the company said. “We have not conducted any formal studies on how such content spreads on the platform.” \nIn response to a question from Republican Senator Tom Cotton, Twitter defended hosting accounts from Wikileaks and its founder Julian Assange, as well as former National Security Agency contractor Edward Snowden, who stole and released a trove of highly classified data. \n“Consistent with our values and commitment to fostering an open exchange of ideas, unless the activity or posted content violates our Terms of Service or Twitter Rules, we do not bar controversial figures from our platform or prohibit accounts from posting controversial content,” the company said. \nIn response to another question, Google and Twitter said they don’t use products made by Kaspersky Lab, a security-software maker that has been working with Russian intelligence. Facebook said that in October it stopped offering Kaspersky anti-virus software to users when its systems detect they may have malware, but said it still uses a Kaspersky product that provides the company with information about threat activity. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-26T23:16:00.000+02:00", "crawled": "2018-01-26T04:22:11.000+02:00", "highlightTitle": ""}