{"organizations": [], "uuid": "7a08d94144387701e24f81350c8c95d200d2c2d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222050539&w=1200&r=LYNXMPEE0E06P", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-anderson/edmund-out-guns-anderson-for-first-round-shock-idUKKBN1F40CK", "country": "US", "domain_rank": 408, "title": "Edmund out-guns Anderson for first round shock", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T06:35:00.000+02:00", "replies_count": 0, "uuid": "7a08d94144387701e24f81350c8c95d200d2c2d2"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-anderson/edmund-out-guns-anderson-for-first-round-shock-idUKKBN1F40CK", "ord_in_thread": 0, "title": "Edmund out-guns Anderson for first round shock", "locations": [], "entities": {"persons": [{"name": "edmund out-guns anderson", "sentiment": "negative"}, {"name": "kyle edmund", "sentiment": "none"}, {"name": "denis istomin", "sentiment": "none"}, {"name": "kevin anderson", "sentiment": "none"}, {"name": "grigor dimitrov", "sentiment": "none"}, {"name": "anderson", "sentiment": "none"}, {"name": "edmund", "sentiment": "none"}], "locations": [{"name": "brisbane", "sentiment": "none"}, {"name": "staff   britain", "sentiment": "none"}, {"name": "brisbane international - pat rafter arena", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 4:39 AM / Updated 2 hours ago Edmund out-guns Anderson for first-round shock Reuters Staff 3 Min Read \nMELBOURNE (Reuters) - Britain’s Kyle Edmund outfought Kevin Anderson in a court three marathon to send the 11th seed tumbling out of the Australian Open 6-7(4) 6-3 3-6 6-3 6-4 in the first round on Monday. FILE PHOTO - Tennis - ATP 250 - Brisbane International - Pat Rafter Arena, Brisbane, Australia January 5, 2018 - Britain's Kyle Edmund serves during his quarter-final match against Bulgaria's Grigor Dimitrov. REUTERS/Patrick Hamilton \nFlying the Union Flag alone in the men’s draw in the absence of injured compatriot Andy Murray, Edmund conjured up the best result of his career the hard way. \nThe world number 49 twice needed to come from a set down to force a deciding fifth set, where again he battled back from a break down to clinch victory and set up a second round clash with Uzbek Denis Istomin. \n“Really happy,” said the 23-year-old Edmund, who was born in South Africa but moved to England at the age of three. \n”So many positive reasons. Just getting through a tough match like that (against) a quality player .. going down a set, coming back. \n“Overall, there’s a personal satisfaction, the hours you put in, training, et cetera, so many things like that. Those type of results make ... worth it basically.” \nBig-serving Anderson sent down his usual barrage of aces, 35 in all, and showed no shortage of fight himself but was ultimately undone as Edmund fired back winner after winner. FILE PHOTO - Tennis - Australian Open - Kevin Anderson of South Africa v Kyle Edmund of Britain - Melbourne, Australia, January 15, 2018. Edmund and Anderson shake hands after Edmund won their match. REUTERS/Edgar Su \nAnderson, a finalist at the U.S. Open last year, had looked like he would ultimately pull away from his opponent until the last few games of the decider. \nHe won the tie break with his 23rd winner of the first set and even when Edmund squared up the match in the second he was putting enough consistent pressure on his opponent’s serve to feel confident of getting the breaks. \nLight rain stopped play at a crucial moment in the third set after Edmund had saved three break points to battle back for deuce. He was left cursing his slow start after the action resumed and Anderson broke for 5-3 then served out the set. \n“Everyone gets angry. It’s human nature,” reflected Edmund. \n”But I just knew that it’s tennis. It’s going to be up and down. I knew I would get the opportunity to break him. Just \ndeal with it when it happens and move on.” \nThe Englishman simply refused to buckle and again battled back to even up the set count, only to be broken in his opening service game of the decider. \nEdmund broke back immediately, however, and although he needed treatment on his right shoulder, grabbed another and was soon sealing his victory with a thunderous forehand winner. Reporting by Nick Mulvenney in Sydney, editing by Peter Rutherford", "external_links": [], "published": "2018-01-15T06:35:00.000+02:00", "crawled": "2018-01-15T06:53:32.000+02:00", "highlightTitle": ""}