{"organizations": [], "uuid": "acc79dff5b5f8c2916352fed3f1755d9c21af85e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-salem-media-group-appoints-jamie-cohen-to-new-position-as-vp-local-digital.html", "country": "US", "domain_rank": 767, "title": "Salem Media Group Appoints Jamie Cohen to New Position as VP Local Digital", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.026, "site_type": "news", "published": "2018-01-08T17:30:00.000+02:00", "replies_count": 0, "uuid": "acc79dff5b5f8c2916352fed3f1755d9c21af85e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-salem-media-group-appoints-jamie-cohen-to-new-position-as-vp-local-digital.html", "ord_in_thread": 0, "title": "Salem Media Group Appoints Jamie Cohen to New Position as VP Local Digital", "locations": [], "entities": {"persons": [{"name": "jamie cohen", "sentiment": "negative"}, {"name": "jamie", "sentiment": "none"}, {"name": "dave santrella", "sentiment": "none"}, {"name": "salem", "sentiment": "none"}], "locations": [{"name": "camarillo", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "salem", "sentiment": "none"}], "organizations": [{"name": "salem media group", "sentiment": "negative"}, {"name": "reachlocal", "sentiment": "none"}, {"name": "usatoday network", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}, {"name": "chicago sun-times", "sentiment": "none"}, {"name": "journal media group", "sentiment": "none"}, {"name": "vp local digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMARILLO, Calif.--(BUSINESS WIRE)-- Salem Media Group (NASDAQ: SALM) announced today effective immediately Salem has appointed Jamie Cohen to the position of VP Local Digital, responsible for driving local digital revenue growth. Jamie joins Salem from USAToday Network, where he oversaw Digital sales and development efforts in a number of regions. Prior to that, Jamie worked for the Chicago Sun-Times and Journal Media Group, where, in both cases, he was responsible for building the infrastructure for their digital sales operations. Jamie also spent three years at ReachLocal successfully leading multiple sales teams in the mid-west.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180108005669/en/\nJamie Cohen (Photo: Business Wire)\nDave Santrella, Salem’s President of Broadcast Media, commented, “Providing our clients with multi-dimensional marketing campaigns that include best-in-class digital services is vital to our continued growth. Jamie has the drive and experience to lead that evolution for Salem’s broadcast division, and I’m thrilled to have him joining us in this key position.”\nFollow us on Twitter @SalemMediaGrp .\nABOUT SALEM MEDIA GROUP:\nSalem Media Group is America’s leading multimedia company specializing in Christian and conservative content, with media properties comprising radio, digital media and book and newsletter publishing. Each day Salem serves a loyal and dedicated audience of listeners and readers numbering in the millions nationally. With its unique programming focus, Salem provides compelling content, fresh commentary and relevant information from some of the most respected figures across the Christian and conservative media landscape.\nThe company is the largest commercial U.S. radio broadcasting company providing Christian and conservative programming. Salem owns and/or operates 120 radio stations, with 75 stations in the top 25 media markets. Salem Radio Network (“SRN”) is a full-service national radio network, with nationally syndicated programs comprising Christian teaching and talk, conservative talk, news, and music. SRN is home to many industry-leading hosts including: Hugh Hewitt, Mike Gallagher, Dennis Prager, Michael Medved, Larry Elder, Joe Walsh and Eric Metaxas.\nSalem’s digital media is a leading source of Christian and conservative themed news, analysis, and commentary. Salem’s Christian sites include: Christianity.com®, BibleStudyTools.com , GodTube.com , GodVine.com , Crosswalk.com , ibelieve.com , churchstaffing.com , WorshipHouseMedia.com and OnePlace.com . Salem’s conservative sites include Townhall.com®, RedState.com , HotAir.com , Twitchy.com , and BearingArms.com .\nSalem’s Regnery Publishing unit, with a history dating back to 1948, is the nation’s leading independent publisher of conservative books. Having published many of the seminal works of the early conservative movement, Regnery today continues as a major publisher in the conservative space, with leading authors including: Ann Coulter, Dinesh D’Souza, Newt Gingrich, David Limbaugh, Ed Klein and Mark Steyn. Salem’s book publishing business also includes Xulon Press™, a leading provider of self-publishing services for Christian authors, and Mill City Press, a general market self-publisher.\nSalem’s Eagle Financial Publications provides general market analysis and non-individualized investment strategies from financial commentators Mark Skousen, Nicholas Vardy, Bryan Perry, Bob Carlson, Mike Turner and Jim Woods, as well as a stock screening website for dividend investors ( DividendInvestor.com ). The business unit’s other investing websites include StockInvestor.com and RetirementWatch.com .\nEagle Wellness, through its website newportnaturalhealth.com , provides insightful health advice and is a trusted source of high quality nutritional supplements from leading health expert, Leigh Erin Connealy MD. Dr. Connealy is the medical director of one of the largest medical practices in the country where she practices integrative medicine.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005669/en/\nSalem Media Group\nEvan D. Masyr\nExecutive Vice President & Chief Financial Officer\n(805) 384-4512\nevan@SalemMedia.com\nSource: Salem Media Group", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.twitter.com%2FSalemMediaGrp&esheet=51739056&newsitemid=20180108005669&lan=en-US&anchor=Twitter+%40SalemMediaGrp&index=1&md5=0c30a976431aa7a0c5d6b485cbe83f8c", "http://www.businesswire.com/news/home/20180108005669/en/"], "published": "2018-01-08T17:30:00.000+02:00", "crawled": "2018-01-08T19:05:48.008+02:00", "highlightTitle": ""}