{"organizations": [], "uuid": "d8fea8416386b7c53cc237ef10e84880553f9621", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000666/device/rss", "section_title": "IPOs", "url": "https://www.cnbc.com/2018/01/16/reuters-america-update-1-siemens-healthineers-in-cost-cutting-drive-before-ipo.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-Siemens Healthineers in cost-cutting drive before", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:11:00.000+02:00", "replies_count": 0, "uuid": "d8fea8416386b7c53cc237ef10e84880553f9621"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/reuters-america-update-1-siemens-healthineers-in-cost-cutting-drive-before-ipo.html", "ord_in_thread": 0, "title": "UPDATE 1-Siemens Healthineers in cost-cutting drive before", "locations": [], "entities": {"persons": [], "locations": [{"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "siemens healthineers", "sentiment": "none"}, {"name": "siemens", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Aims for 240 mln eur in annual cost savings from 2020\n* Sees adj 2018 profit margin of 17-18 pct, vs 18.1 in fiscal 2017\n* Sees margins, growth perking up over medium term\n* Siemens vows to remain long-term investor (Adds medium-term targets, executive's comment on parent)\nFRANKFURT, Jan 16 (Reuters) - Healthineers, Siemens's medical imaging and diagnostics division, will launch a cost-cutting drive to address modest earnings growth this year as it prepares for a separate listing expected to value it at around 40 billion euros ($49 billion).\n\"Structural cost savings initiatives are targeting 240 million euros of cost savings per year with a first full impact visible in 2020, and the company aims to achieve continuous productivity improvements going forward,\" Siemens Healthineers said in a statement on Tuesday before an event for analysts and investors.\nThe maker of medical gear such as X-ray and MRI machines expects an adjusted operating profit margin of 17-18 percent for 2018 and comparable revenue growth of 3-4 percent.\nThat compares with 18.1 percent in the fiscal year to September, while comparable revenue growth was 3 percent.\nSiemens plans to list its healthcare unit in March, two people close to the matter told Reuters last week. The German industrial conglomerate reiterated on Tuesday the listing was planned for the first half of 2018.\nOver the medium term the business expects organic revenue growth to speed up to 4-6 percent, led by products such as automated lab diagnostic gear or software to help physicians interpret medical images.\nAnalysts have said they would be looking for clues on how Siemens plans to turn around the underperforming In-Vitro diagnostics business, which provides lab machinery to analyse blood, tissue or urine samples.\nThe group said that business's profit margin would improve to 16-19 percent over the medium term, up from 14 percent last year.\nMichael Sen, Siemens board member in charge of Healthineers, said the unit would act independently but it would remain part of the parent group in the long term.\n\"We will actively accompany that development as a long-term shareholder.\" ($1 = 0.8174 euros) (Reporting by Ludwig Burger; Editing by Georgina Prodhan and Adrian Croft)", "external_links": [], "published": "2018-01-16T13:11:00.000+02:00", "crawled": "2018-01-16T17:01:12.009+02:00", "highlightTitle": ""}