{"organizations": [], "uuid": "0576780ddfdd9863534e91d25489cf450bc6fdfd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/26/104610992-GettyImages-669949322.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/05/career-advice-7-jobs-that-are-incredibly-underpaid.html", "country": "US", "domain_rank": 767, "title": "Career advice: 7 jobs that are incredibly underpaid", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.086, "site_type": "news", "published": "2018-01-05T22:12:00.000+02:00", "replies_count": 0, "uuid": "0576780ddfdd9863534e91d25489cf450bc6fdfd"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/career-advice-7-jobs-that-are-incredibly-underpaid.html", "ord_in_thread": 0, "title": "Career advice: 7 jobs that are incredibly underpaid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We live in a world where not all jobs — or salaries — are created equal.\nWhile some jobs are glamorous and come with equally glamorous paychecks, others offer more humble salaries — and some of them just might surprise you.\nAccording to a recent article on Glassdoor.com , the average American worker is underpaid by approximately $7,500 — this translates to salaries that are roughly 13 percent less than their potential market values. This is attributable to a variety of factors, from job market conditions and supply vs. demand of available talent to the tendency of some new employees to not negotiate for higher salaries when starting new jobs.\nMore from TheJobNetwork: \n5 ways to help your teen's career path\n7 leaders share their best insights about work-life balance\nHow to keep Your New Year's resolutions \nLet's take a closer look at seven jobs that are incredibly underpaid, often despite having very important responsibilities.\n1. Medical assistant Medical assistants work directly under the guidance of doctors and nurses, and have a host of important responsibilities including maintaining medical records, prepping patients for exams, and administering medications. That said, they don't typically command large salaries. According to the Bureau of Labor Statistics, the mean average wage for medical assistants is $32,850.\nshow chapters Here are the highest paying jobs with the fastest growth      8:14 AM ET Tue, 23 May 2017 | 00:54 2. Web developer If you're looking to break into the web developer profession, you may find a wealth of opportunities across industries, and even across borders as international projects abound. That said, the growing supply of talented web developers both around the United States and abroad has adversely impacted salaries. According to the Bureau of Labor Statistics, the mean average wage for web developers is $72,150.\n3. Social worker Social workers are typically dedicated and qualified individuals who provide important support services to populations in need. Despite being a rewarding and commendable profession, the average social worker is not earning a huge payday. According to the Bureau of Labor Statistics, the mean average wage for social workers is approximately $59,410.\n4. Licensed practical nurse (LPN) Nurses are incredibly important professionals who handle a wide array of critical tasks in a variety of healthcare settings, and are essential personnel for handling patient needs. That said, they typically make far less than their colleagues who are doctors or registered nurses (RNs). According to the Bureau of Labor Statistics, the mean average wage for LPNs is $44,840.\n5. Pharmacy technician When you're purchasing prescription medications at your local pharmacy, you're likely to encounter a pharmacy tech at the front lines. These workers mix, measure, count out, and label medications as well as interact directly with customers. However, pharmacy techs don't command the same salaries as the pharmacists they work beside. According to the Bureau of Labor Statistics, the mean average wage for pharmacy techs is $32,170.\n6. Veterinary technician When your pet needs a checkup or isn't feeling well, you can count on a vet tech to help you out when you first arrive at the veterinarian's office. They're responsible for a host of things that help keep veterinarian practices running smoothly, including performing medical tests, preparing serums and vaccines, taking and preparing samples, and maintaining charts and medical equipment. Vet techs likely aren't in the field to get rich quick; the mean average wage according to the Bureau of Labor Statistics is $33,870.\nshow chapters Highest-paying jobs for women      12:33 PM ET Wed, 2 Nov 2016 | 00:50 7. Emergency medical technician (EMT) Few can argue about the importance of EMTs — when an accident or medical emergency occurs, they are often the first on the scene, and assess injuries, administer aid, and transport individuals to hospitals and medical facilities. Despite their incredible importance in saving lives, they just don't command big salaries. According to the Bureau of Labor Statistics, the mean average wage for EMTs is $36,110.\nAs you can see, not all employees are compensated equally. The seven jobs listed here may offer professional fulfillment and satisfaction, depending on one's job-related goals, but they will probably not set you on a road to riches. If you're on the hunt for a new job and salary is a big factor for you, use this information to help guide you towards — and away — from certain positions.\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: The top 10 highest-paying jobs in America right now \nThis article originally appeared on TheJobNetwork. \nshow chapters These are the best and worst paying jobs in America ranked by state      1:48 PM ET Fri, 2 June 2017 | 01:00", "external_links": ["https://www.thejobnetwork.com/how-to-keep-your-new-years-resolutions/", "https://www.thejobnetwork.com/7-jobs-that-are-incredibly-underpaid/", "https://www.glassdoor.com/blog/average-american-underpaid-7500/", "https://www.facebook.com/CNBCMakeIt/", "https://www.thejobnetwork.com/7-leaders-share-best-insights-work-life-balance/", "https://www.thejobnetwork.com/5-ways-help-teens-career-path/"], "published": "2018-01-05T22:12:00.000+02:00", "crawled": "2018-01-05T22:30:11.002+02:00", "highlightTitle": ""}