{"organizations": [], "uuid": "5af055f9f0d87a54bb4059905c790ccf6fa927ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 133, "shares": 133, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/08/103775476-499353136rr.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/us-personal-income-dec-2017.html", "country": "US", "domain_rank": 767, "title": "US personal income rose 0.4% in Dec, vs 0.3% increase expected", "performance_score": 1, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.627, "site_type": "news", "published": "2018-01-29T15:30:00.000+02:00", "replies_count": 0, "uuid": "5af055f9f0d87a54bb4059905c790ccf6fa927ac"}, "author": "Liz O. Baylen", "url": "https://www.cnbc.com/2018/01/29/us-personal-income-dec-2017.html", "ord_in_thread": 0, "title": "US personal income rose 0.4% in Dec, vs 0.3% increase expected", "locations": [], "entities": {"persons": [{"name": "liz o. baylen", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "commerce department", "sentiment": "none"}, {"name": "los angeles times", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. consumer spending rose solidly in December as demand for goods and services increased, but the increase came at the expense of savings, which dropped to a 10-year low in a troubling sign for future consumption and economic growth.\nThe Commerce Department said on Monday consumer spending, which accounts for more than two-thirds of U.S. economic activity, increased 0.4 percent last month after an upwardly revised 0.8 percent increase in November.\nEconomists polled by Reuters had forecast consumer spending increasing 0.4 percent in December after a previously reported 0.6 percent rise in November. When adjusted for inflation , consumer spending rose 0.3 percent in December.\nThe figures were included in the advance fourth-quarter gross domestic product report published on Friday . Consumer spending accelerated at a 3.8 percent annualized rate in the October-December period, the fastest in three years, after rising at a 2.2 pace in the third quarter.\nRobust consumer spending helped to offset the drag from trade and inventories on the economy, which grew at a 2.6 percent rate in the fourth quarter. GDP increased at a 3.2 percent pace in the third quarter.\nPersonal income rose 0.4 percent last month after advancing 0.3 percent in November. Wages increased 0.5 percent last month. Savings fell to $351.6 billion in December, the lowest level since December 2007, from $365.1 billion in the prior month.\nThe saving rate dropped to 2.4 percent, the lowest level since September 2005, from 2.5 percent in November. It dropped to 3.4 percent in 2017, the lowest level since 2007, from 4.9 percent in 2016. The low saving rate is a red flag for both consumer spending and economic growth\nLast month, spending on long-lasting goods, such as motor vehicles, increased 0.7 percent. Outlays on services rose 0.5 percent, reflecting rising demand for utilities.\nMonthly inflation ticked up in December. The Federal Reserve's preferred inflation measure, the personal consumption expenditures (PCE) price index excluding food and energy, rose 0.2 percent in December after gaining 0.1 percent in November. The so-called core PCE increased 1.5 percent in the 12 months through December after a similar rise in November.\nThe core PCE has missed the Fed's 2 percent target since mid-2012.", "external_links": [], "published": "2018-01-29T15:30:00.000+02:00", "crawled": "2018-01-29T15:45:41.016+02:00", "highlightTitle": ""}