{"organizations": [], "uuid": "0aa3cc8ceb776a3d9090da6a141114d4deb981af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220540607&w=1200&r=LYNXMPEE070F1", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-myanmar-journalists-factbox/factbox-international-reaction-to-arrest-of-reuters-reporters-in-myanmar-idUSKBN1EX0K9", "country": "US", "domain_rank": 408, "title": "Factbox: International reaction to arrest of Reuters reporters in Myanmar", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:57:00.000+02:00", "replies_count": 0, "uuid": "0aa3cc8ceb776a3d9090da6a141114d4deb981af"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-myanmar-journalists-factbox/factbox-international-reaction-to-arrest-of-reuters-reporters-in-myanmar-idUSKBN1EX0K9", "ord_in_thread": 0, "title": "Factbox: International reaction to arrest of Reuters reporters in Myanmar", "locations": [], "entities": {"persons": [{"name": "kyaw soe", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}, {"name": "ministry of information", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Many nations, including the United States, Canada and several European countries, as well as top United Nations and EU officials are among those demanding the release of Reuters reporters Wa Lone and Kyaw Soe Oo from detention in Myanmar.\nThe reporters were arrested four weeks ago, on Dec. 12, after being invited to meet police officials on the outskirts of Yangon. They had worked on stories about a military crackdown in Rakhine state, from where about 665,000 Rohingya Muslims have fled since August and sought refuge in Bangladesh, according to the United Nations.\nThe two journalists were sent to Yangon’s Insein prison after a brief court appearance on Dec. 27, when they were allowed to meet their families and a lawyer for the first time since their arrest. Their second court appearance is due on Wednesday.\nMyanmar’s Ministry of Information has said the reporters “illegally acquired information with the intention to share it with foreign media,” and released a photo of them in handcuffs at the time of the arrest.\nIt said the reporters and two policemen faced charges under the British colonial-era Official Secrets Act, which carries a maximum prison sentence of 14 years, though officials said they have not been charged.\nReuters President and Editor-In-Chief Stephen J. Adler has called for the immediate release of Wa Lone and Kyaw Soe Oo.\n“As they near their hearing date, it remains entirely clear that they are innocent of any wrongdoing,” Adler said in a statement on Monday.\n“Their arrest and continued incarceration represent an egregious attack on press freedom — preventing them, and deterring other journalists, from reporting independently in Myanmar.”\nHere are comments on their detention from governments, politicians, human rights groups, journalists and press freedom advocates around the world:\nLATEST REACTION - Former U.S. President Bill Clinton called on Monday for the immediate release of the two journalists. “A free press is critical to a free society - the detention of journalists anywhere is unacceptable,” Clinton said in a Twitter post.\n- The Committee to Protect Journalists called on Myanmar on Monday to cease all legal proceedings against the two Reuters journalists and release them from jail.\n“The proceedings against Wa Lone and Kyaw Soe Oo are a transparent attempt to intimidate the media and to prevent coverage of the unfolding tragedy of the Rohingya people in Myanmar’s Rakhine state,” said Steven Butler, CPJ’s Asia program coordinator.\n“The two reporters should not be in jail for trying to uncover the truth about this story of vital public interest.”\n- Samantha Power, former U.S. ambassador to the United Nations, called the arrests “an outrage and a symptom of a world without credible U.S. leadership” in a Twitter post.\nGOVERNMENTS, MULTILATERAL ORGANIZATIONS - U.S. Secretary of State Rex Tillerson has said the United States was “demanding their immediate release or information as to the circumstances around their disappearance.”\n- Senator Ben Cardin, the leading Democrat on the Senate Foreign Relations Committee called the arrests of the two journalists “outrageous”.\n“It just brings back the memory of the horrible practices with the repressive military rule,” he said.\n- Republican Thom Tillis and Democrat Chris Coons, leaders of the U.S. Senate Human Rights Caucus, said they were “gravely concerned” about the reporters’ arrests and that press freedom was critical to ensuring accountability for violence against the Rohingya.\nFILE PHOTO: Reuters reporter Wa Lone talks to reporters as he leaves court in Yangon, Myanmar, December 27, 2017. REUTERS/Stringer - The European Union has urged Myanmar to release the two Reuters reporters “as quickly as possible.” A spokeswoman for the EU’s foreign affairs chief Federica Mogherini said, “Freedom of the press and media is the foundation and a cornerstone of any democracy.”\n- Japanese Foreign Minister Taro Kano said, “Freedom of the press is extremely important, including in order to protect fundamental human rights. The Japanese government would like to watch (this matter) closely.” Tokyo-based Human Rights Now has called on Japan to take a stronger stance.\n- U.N. Secretary-General Antonio Guterres said countries should do everything possible to secure the journalists’ release and press freedom in Myanmar.\n- Surakiart Sathirathai, the head of a new international advisory panel on the Rohingya crisis, said he had asked Suu Kyi’s national security adviser for the case to be dealt with transparently and been assured that proper legal procedures would be followed.\n- Yanghee Lee and David Kaye, the U.N. special rapporteurs on Myanmar and on freedom of expression respectively, said, “Journalism is not a crime. These detentions are another way for the government to censor information about the military’s role in Rakhine State and the humanitarian catastrophe taking place.”\n- Britain, Holland, Canada, Norway and Sweden have demanded the release of the Reuters reporters. Australia has expressed concern and Bangladesh has denounced the arrests.\n- Vijay Nambiar, former special adviser on Myanmar to the U.N. Secretary-General, said in a statement to Reuters that the detentions had caused “widespread disappointment within and outside the country that is likely to further damage the international reputation and image of Myanmar.”\n- President of the European Parliament Antonio Tajani called on Myanmar to protect media freedoms and release the reporters.\n- Former New Zealand Prime Minister Helen Clark said it was “disturbing” to hear of the detention of the two Reuters journalists.\nJOURNALISTS, NGOS - A group of 50 Pulitzer Prize winners called the arrests “an outrageous attack on media freedom” and demanded the immediate release of the two journalists. “Wa Lone and Kyaw Soe Oo are brave, principled and professional journalists who were working in the public interest and were jailed simply for doing their jobs,” they said in a statement.\n- The New York Times said in an editorial that releasing the two journalists immediately “would help restore at least some lost faith” in Aung San Suu Kyi’s government.\n- Washington-based Freedom House called in a statement for the immediate release of Wa Lone and Kyaw Soe Oo, saying their “real offense in the eyes of the government was their reporting on military crackdowns in Rakhine State”.\n- Human Rights Watch said the detentions appeared to be “aimed at stopping independent reporting of the ethnic cleansing campaign against the Rohingya.”\n- Reporters Without Borders said there was no justification for the arrests and the charges being considered against the journalists were “completely spurious”.\n- Advocacy group Fortify Rights demanded Myanmar immediately and unconditionally release the Reuters journalists.\n- Myanmar’s Irrawaddy online news site called on Dec. 14 for the journalists’ release in an editorial headlined “The Crackdown on the Media Must Stop.” It said “it is an outrage to see the Ministry o", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T15:57:00.000+02:00", "crawled": "2018-01-09T16:45:58.035+02:00", "highlightTitle": ""}