{"organizations": [], "uuid": "88d5cd7f5647cd66d5df2d18197cfb3805823a51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/13/104839565-AP_17317676402685-flannery-ge2.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/ge-will-likely-be-dropped-from-the-dow-deutsche-bank-predicts.html", "country": "US", "domain_rank": 767, "title": "GE will likely be dropped from the Dow, Deutsche Bank predicts", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.941, "site_type": "news", "published": "2018-01-31T16:17:00.000+02:00", "replies_count": 0, "uuid": "88d5cd7f5647cd66d5df2d18197cfb3805823a51"}, "author": "Thomas Franck", "url": "https://www.cnbc.com/2018/01/31/ge-will-likely-be-dropped-from-the-dow-deutsche-bank-predicts.html", "ord_in_thread": 0, "title": "GE will likely be dropped from the Dow, Deutsche Bank predicts", "locations": [], "entities": {"persons": [{"name": "john flannery", "sentiment": "none"}, {"name": "john inch", "sentiment": "none"}, {"name": "flannery", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "venture capital ge", "sentiment": "neutral"}, {"name": "deutsche bank", "sentiment": "neutral"}, {"name": "ge", "sentiment": "neutral"}, {"name": "general electric", "sentiment": "none"}, {"name": "deutsche", "sentiment": "none"}, {"name": "cnbc.com general electric", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "General Electric will likely be removed from the Dow Jones industrial average, according to Deutsche Bank.\nAs one of the original members of the 30-company index, General Electric has been a component of the Dow for more than 120 years.\n\"We believe the chances that GE could be removed from the Dow are increasing as GE continues to face substantial challenges including earnings and cash pressure, tough global power generation markets, aggressive downsizing, shrinking its portfolio, management shake-up and SEC investigations,\" Deutsche Bank analyst John Inch wrote Wednesday. \"Apart from GE's other challenges, as the company's absolute share price has continued to drop, GE increasingly falls into the category of outlier and consequently a likely candidate for removal.\"\nChanges to the index are made without ceremony and without warning by S&P Dow Jones Indices and they are not governed by quantitative rules. S&P Dow Jones Indices offered no comment for this story.\nGeneral Electric did not immediately respond to CNBC's request for comment.\nThe Dow is a price-weighted benchmark unlike the S&P 500 , which is market-cap weighted. At about $16, GE is the lowest-priced stock in the average by far. Pfizer is second lowest, but with a price twice as much as GE at $37.\nGE shares rose 1.5 percent Wednesday despite this call as global asset prices rebounded from a two-day slide. A removal from the Dow may not be that bad of a thing anyway as stocks that are removed often tend to outperform .\nDespite the better performance Wednesday, the industrial conglomerate has proven a bane for investors in the past several years, recently slashing its dividend and tempering profit expectations. The stock is down 55 percent over the past 10 years, including a 46 percent decline in just the past 12 months.\nBoeing , which surged Wednesday on the back of better-than-expected earnings is the highest-priced stock in the Dow at about $355 a share.\nWrote Inch:\n\"The committee reportedly prefers for the Dow to incur no more than a 10:1 ratio between the component companies' highest share price and lowest share price. Currently, the ratio between Boeing (the highest) and GE (the lowest) exceeds 20:1.\"\nIn its earnings report last week, GE missed Wall Street expectations, but Chief Executive Officer John Flannery appeared positive about upcoming changes, including a possible breakup of the company.\n\"Our results this quarter demonstrate some of the early progress we are seeing from our key initiatives,\" Flannery said in the company's news release. \"The team is focused on operational execution, capital allocation and deep cost reduction to position us for continued improvement in 2018.\"", "external_links": [], "published": "2018-01-31T16:17:00.000+02:00", "crawled": "2018-01-31T16:16:45.005+02:00", "highlightTitle": ""}