{"organizations": [], "uuid": "e30b42385b1d91bbeb5b28711e94ad27f0165f9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 47, "shares": 47, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226664862&w=1200&r=LYNXMPEE0T1AE", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-amazon-healthcare-breakingviews/breakingviews-u-s-healthcare-bloat-faces-new-triple-threat-idUSKBN1FJ2GV", "country": "US", "domain_rank": 408, "title": "Breakingviews - U.S. healthcare bloat faces new triple threat", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:29:00.000+02:00", "replies_count": 0, "uuid": "e30b42385b1d91bbeb5b28711e94ad27f0165f9a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-amazon-healthcare-breakingviews/breakingviews-u-s-healthcare-bloat-faces-new-triple-threat-idUSKBN1FJ2GV", "ord_in_thread": 0, "title": "Breakingviews - U.S. healthcare bloat faces new triple threat", "locations": [], "entities": {"persons": [{"name": "jamie dimon", "sentiment": "none"}, {"name": "warren buffett", "sentiment": "none"}, {"name": "jeff bezos", "sentiment": "none"}, {"name": "buffett", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters breakingviews", "sentiment": "negative"}, {"name": "amazon.com", "sentiment": "none"}, {"name": "jpmorgan", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}, {"name": "healthcare cost institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters Breakingviews) - “The ballooning costs of healthcare act as a hungry tapeworm on the American economy,” says Berkshire Hathaway boss Warren Buffett. That’s why his conglomerate, Amazon.com and JPMorgan are getting together to cut healthcare costs. Details are few and obstacles many, but the three firms bring relevant skills and a lot of employees to the mix.\nThe United States spends about 18 percent of GDP on healthcare, about twice as much as most other developed countries. Yet it receives little, ranking poorly on measures of care like infant mortality and efficiency such as administrative costs.\nMuch of the burden falls upon business, as about half of all Americans receive health insurance through their own or a family member’s employer. And while premiums are rising, insurance is covering less. Spending per privately insured person rose 4.6 percent in 2016, while the use of most services fell, according to a new report from the Healthcare Cost Institute.\nExactly what Buffett, Amazon’s Jeff Bezos and Jamie Dimon at JPMorgan have in mind isn’t clear. They say their new firm will use technology and not seek profit. For what it’s worth, Amazon has lots of logistics experience and is mulling expansion into the pharmacy business. Berkshire may not be a health insurer but it understands underwriting. And JPMorgan knows all about payments. Combined, they have well over 1 million employees worldwide.\nThe three could simply negotiate better prices from insurers. At its most expansive, though, the new joint venture could provide care directly to employees – imagine clinics that dispense generic drugs at cost – and seek arrangements with hospitals for more complicated cases.\nA multibillion-dollar hit to the stocks of health insurers, drug wholesalers, pharmacists and other middlemen on Tuesday – a 3.5 percent drop in UnitedHealth shares, for example, wiping out more than $8 billion of value – shows the shakiness of the status quo. Amazon is already perceived as a potential threat to many U.S. businesses. Add other big employers and the threat is multiplied.\nThat said, past attempts by insurers to rein in costs by limiting choice, as so-called HMOs tried to do in the 1990s, have proved unpopular with patients and doctors. A recent attempt by 40 big companies - including American Express, IBM and Royal Dutch Shell - called the Health Transformation Alliance hasn’t gained traction either. Yet Tuesday’s events suggest that the tapeworm, while resilient, may be starting to squirm.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-31T01:29:00.000+02:00", "crawled": "2018-01-31T04:27:22.006+02:00", "highlightTitle": ""}