{"organizations": [], "uuid": "49a8ca088d3291fdc1ee75f4732e49bd2fa31332", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/environment", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-cocoa-ivorycoast-weather/rare-dry-season-showers-promising-for-ivory-coast-cocoa-mid-crop-idUSKBN1FB1YU", "country": "US", "domain_rank": 408, "title": "Rare dry-season showers promising for Ivory Coast cocoa mid-crop", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T16:47:00.000+02:00", "replies_count": 0, "uuid": "49a8ca088d3291fdc1ee75f4732e49bd2fa31332"}, "author": "", "url": "https://www.reuters.com/article/us-cocoa-ivorycoast-weather/rare-dry-season-showers-promising-for-ivory-coast-cocoa-mid-crop-idUSKBN1FB1YU", "ord_in_thread": 0, "title": "Rare dry-season showers promising for Ivory Coast cocoa mid-crop", "locations": [], "entities": {"persons": [{"name": "amadou diallo", "sentiment": "none"}, {"name": "divo", "sentiment": "none"}], "locations": [{"name": "ivory coast", "sentiment": "none"}, {"name": "abidjan", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 2:50 PM / Updated 6 hours ago Rare dry-season showers promising for Ivory Coast cocoa mid-crop Reuters Staff 2 Min Read \nABIDJAN (Reuters) - Light, patchy showers in a number of Ivory Coast’s main cocoa growing regions last week are expected to aid the development of the upcoming April-to-September mid-crop, farmers said on Monday. \nPrecipitation is rare during the annual dry season running from mid-November to March, and farmers said the sporadic showers had been exceptional. \nThe flowers that will develop into the cocoa of the mid-crop were visible on trees, they said, but more rainfall was needed to transform into small pods. \nThe farmers were satisfied with the size of pods already on the trees and said significant volumes of beans were still leaving the bush. They said they expected the main crop to start tailing off in mid-February. \n“At the moment the dry season is not worrying,” said Amadou Diallo, who farms in the southern region of Divo. “If we have two good rain showers in February and two more in March, there will be many beans in the mid-crop.” \nIn the western region of Soubre, in the heart of the cocoa belt, farmers welcomed the rainfall and the seasonal Harmattan winds - which blow dust from the Sahara and can damage crops - were easing. \nData collected by Reuters showed rain in the Soubre region, including Sassandra and San Pedro, was at 4.2 mm last week, 0.6 mm above average. \nFarmers also reported rainfall in the southern regions of Aboisso, Agboville and Tiassale. \nIn the center-western region of Daloa, which produces a quarter of Ivory Coast’s national output, farmers reported good flowering for the mid-crop despite the lack of rain last week. \n“There are many flowers and young pods on the trees, but we need rain before the end of this month because it is very hot,” said Raphael Kouadio, who farms near Daloa. \nThe eastern region of Abengourou saw similar conditions during the week. Reporting by Loucoumane Coulibaly; Editing by Sofia Christensen and Dale Hudson", "external_links": [], "published": "2018-01-22T16:47:00.000+02:00", "crawled": "2018-01-22T17:15:16.018+02:00", "highlightTitle": ""}