{"organizations": [], "uuid": "b2381066cf58761f3a956eac79d5819b0a71bea4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/23/103491829-RTS9BQX.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/17/us-stocks-dow-earnings-bank-of-america.html", "country": "US", "domain_rank": 767, "title": "Dow rises 133 points on better-than-expected earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.963, "site_type": "news", "published": "2018-01-17T16:30:00.000+02:00", "replies_count": 0, "uuid": "b2381066cf58761f3a956eac79d5819b0a71bea4"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/17/us-stocks-dow-earnings-bank-of-america.html", "ord_in_thread": 0, "title": "Dow rises 133 points on better-than-expected earnings", "locations": [], "entities": {"persons": [{"name": "brendan mcdermid", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bank of america", "sentiment": "none"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "factset", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "reuters traders", "sentiment": "none"}, {"name": "u.s. bancorp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dow jumps 300 points to record, breaks above 26,000 once again The S&P 500 gained 1.1 percent, with staples and tech rising more than 1 percent Tech stocks got a boost from Apple, which erased losses after announcing plans to repatriate billions in overseas cash. Earnings season is off to a strong start thus far. 1 Hour Ago | 02:19 \nStocks traded higher on Wednesday following the release of stronger-than-expected quarterly results from some of the biggest U.S. companies. \nThe Dow Jones industrial average rose 300 points to a record high, breaking above 26,000 once again. The index first broke above the milestone mark on Tuesday, but failed to close above it. \nThe S&P 500 gained 1.1 percent, with staples and tech rising more than 1 percent. Tech stocks got a boost from Apple, which erased losses after announcing plans to r epatriate billions in overseas cash . The stock traded 1.5 percent higher at 3:04 p.m. ET. \nThe Nasdaq composite rose 1.1 percent. Symbol --- \nBank of America reported adjusted quarterly earnings that surpassed analyst estimates. U.S. Bancorp also posted better-than-expected results. \nEarnings season is off to a strong start thus far. Of the S&P 500 companies that had reported as of Wednesday, 78 percent have surpassed earnings-per-share estimates while 89 percent have beaten expectations on the top line, according to Nick Raich, CEO of The Earnings Scout. \n\"You've got a bullish start to the earnings season and earnings are expected to be strong for 2018,\" said Adam Sarhan, CEO of 50 Park Investments. He added: \"The very strong underlying trend for the market remains in place.\" Brendan McDermid | Reuters Traders work on the floor of the New York Stock Exchange. \nEquities closed lower on Tuesday after a sharp reversal from record levels. The Dow closed 10 points lower after rising as much as 283 points and breaking above 26,000 for the first time. \nRobert Pavlik, chief investment strategist at SlateStone Wealth, said there were concerns in the market that stocks had risen too much too quickly. \"The government shutdown played right into that,\" he said. \nThe reversal took place as concerns of a government shutdown loomed over investors' minds. Congress needs to pass a spending bill by the end of Friday to avoid a government shutdown. \n\"Basically, what you saw was a market digesting strong gains,\" said Tom Essaye of The Sevens Report. \"We're up 4 percent and we're still in January. When you see this, the market looks for a reason to consolidate.\" \nEssaye also noted that, even if the government experiences a shutdown, \"that's not going to deter from the strength in the economy and in earnings.\" \nElsewhere, shares of Juno Therapeutics spiked 50 percent higher after The Wall Street Journal reported the company was in talks to be acquired by Celgene.", "external_links": [], "published": "2018-01-17T16:30:00.000+02:00", "crawled": "2018-01-17T17:30:58.012+02:00", "highlightTitle": ""}