{"organizations": [], "uuid": "dceff03f722a3686134dd36305a1130decfa9693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936248-GettyImages-902836240.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/09/no-sane-lawyer-would-let-trump-sit-for-an-interview-with-mueller.html", "country": "US", "domain_rank": 767, "title": "No sane lawyer would let Trump sit for an interview with Mueller", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T19:21:00.000+02:00", "replies_count": 0, "uuid": "dceff03f722a3686134dd36305a1130decfa9693"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/no-sane-lawyer-would-let-trump-sit-for-an-interview-with-mueller.html", "ord_in_thread": 0, "title": "No sane lawyer would let Trump sit for an interview with Mueller", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "james comey", "sentiment": "negative"}, {"name": "mueller", "sentiment": "negative"}, {"name": "comey", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "sarah huckabee sanders", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "negative"}, {"name": "fbi", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "bureau", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When fired FBI director James Comey torched the White House last summer for spreading falsehoods about his leadership of the Bureau and the morale among its ranks — \"Those were lies, plain and simple,\" he told Congress — Sarah Huckabee Sanders seemed to take umbrage that anyone would dare suggest the president is loose with the truth. \"No, I can definitively say the president is not a liar,\" she assured reporters during an off-camera briefing. \"It's frankly insulting that that question would be asked.\"\nSince it's the administration's official position that Donald Trump doesn't lie, its lawyers should be heartened that Robert Mueller , the special counsel appointed to investigate crimes associated with Russia's disruption of the 2016 election, has shown an interest in interviewing him. Multiple reports on Monday indicated that Trump's legal team is bracing for a potential encounter between Trump and Mueller — a significant development in a sprawling investigation that grew even bigger thanks to the president's decision to dismiss Comey.\nThe dismissal and other Trump moves in its wake have raised the specter that he might have taken affirmative steps to put obstacles before the Russia probe, and so it makes sense for Mueller to want to hear directly from the president, who remains adamant that he has done nothing wrong and thus has nothing to fear. Trump said as much over the weekend during a getaway at Camp David, where he seemed game for a sitdown with Mueller's team. \"We have been very open,\" he told reporters, according to the Washington Post . \"We could have done it two ways. We could have been very closed, and it would have taken years. But you know, sort of like when you've done nothing wrong, let's be open and get it over with.\"\nExcept that's never going to happen. No lawyer worth his or her salt would let a client like Trump go in for an interview. A person with knowledge of the Mueller investigation who asked to remain anonymous told me that Trump is the kind of client who would \"humiliate you and destroy you because he just can't follow directions.\"\nIndeed, even Trump's own star-studded legal team seems acutely aware that allowing Trump to be interviewed by the special counsel is a recipe for disaster. In all the reporting about Mueller's interest in interviewing Trump, there's an unease among the sources, all of whom are almost certainly lawyers, in the very thought of Trump being alone in a room with Mueller. They want to know where the conversation would take place, for how long, and the scope of the questioning. Short of an interview, there's been discussion about letting Trump answer written questions from the special counsel. The implication is clear: Trump is a walking, talking perjury trap, and saving him from himself is simply what any sane, competent lawyer would advise. (Ask Tim O'Brien.)\nRead more from New York Magazine: \nRepublicans poised for collapse in New Yor k \nNorth Korea: Our nukes are aimed only at United States \nThe company of Trump's pick for health secretary tested Cialis on kids \nNot even Alan Dershowitz, an ardent Trump defender who recently got his own show on Fox News, thought allowing the special counsel to grill Trump was the best play. \"I would never let the prosecution interview my client,\" Dershowitz told NBC News. \"But I don't represent the president of the United States, and presidents don't want to plead the Fifth. So this route makes sense.\" Come to think of it, Dershowitz was probably trying to send smoke signals to those who do represent Trump.\nNot that they needed the warning. Because in the end, avoiding a Trump-Mueller one-on-one is not just a good course of action, but the only course of action. \"The man's uncontrollable. He's a loose cannon,\" the person with knowledge of the Mueller investigation said. \"No matter how much you prep him, no matter what small words you use to explain to him the potential landmines he could step on … he will leap in blindly and say whatever pops into his head, and that could be a potential disaster.\"\nThis source added: \"The absolute last thing I want to do in my life is be sitting next to Donald Trump being questioned by the special counsel.\"", "external_links": [], "published": "2018-01-09T19:21:00.000+02:00", "crawled": "2018-01-09T20:30:07.027+02:00", "highlightTitle": ""}