{"organizations": [], "uuid": "3fa418450e6a1db7074f49003f84a8b5b259b4b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104959053-GettyImages-908735324.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/turkey-could-lose-in-its-attack-on-us-backed-syrian-kurds-says-expert.html", "country": "US", "domain_rank": 767, "title": "Turkey could lose in its attack on US-backed Syrian Kurds, says expert", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.521, "site_type": "news", "published": "2018-01-22T23:17:00.000+02:00", "replies_count": 0, "uuid": "3fa418450e6a1db7074f49003f84a8b5b259b4b6"}, "author": "Jeff Daniels", "url": "https://www.cnbc.com/2018/01/22/turkey-could-lose-in-its-attack-on-us-backed-syrian-kurds-says-expert.html", "ord_in_thread": 0, "title": "Turkey could lose in its attack on US-backed Syrian Kurds, says expert", "locations": [], "entities": {"persons": [{"name": "bulent kilic", "sentiment": "negative"}, {"name": "recep tayyip erdogan", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hatay province", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "hassa", "sentiment": "none"}, {"name": "kurdish-held afrin", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "isis", "sentiment": "none"}, {"name": "pentagon", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Bulent Kilic | AFP | Getty Images A Syrian opposition fighter takes a selfie as fighters walk through Syria in front of Turkish troops near the Syrian border at Hassa, Hatay province, on January 22, 2018. \nA former Pentagon official says Turkey's offensive into northern Syria may end up being a huge mistake and miscalculation by Turkish President Recep Tayyip Erdogan. \nTurkey's cross-border assault into the Afrin region of Syria to attack the U.S.-backed Kurdish force is seen as yet another problem for already frayed American-Turkish ties and also threatens to undermine NATO unity. \nOn Monday, there were Turkish reports and other media reports that ground troops had advanced nearly five miles into the Kurdish-held Afrin region and had captured several villages. It was the fourth day of Ankara's military operation to root out the Syrian Kurdish People's Protection Units (YPG), a militia whose members helped the U.S. coalition defeat ISIS in Syria. \nU.S. officials reportedly tried to talk Turkey out of launching the military operation but to no avail. Experts say Turkey also appears to have coordinated the offensive with Russia , which backs the regime of Syrian President Bashar Assad. \n\"Turkey is coordinating with Russia,\" said Michael Rubin, a former Pentagon official and now resident scholar at the American Enterprise Institute, a conservative think tank. \"The basic problem isn't Turkey's move into Syria; it's Turkey's pivot away from NATO.\" Bulent Kilic | AFP | Getty Images Turkish army troops gather near the Syrian border at Hassa, in Hatay province on January 21, 2018. \nIndeed, before the move into the Kurdish-controlled Afrin region of Syria, Turkish President Erdogan sent two of his top military and intelligence officials to consult with Moscow, according to reports. Turkey, a NATO member since the early 1950s, has moved closer to Moscow's orbit under Erdogan and recently even agreed to buy a Russian-made S-400 air defense system despite concerns raised by the U.S. \nRegardless, Rubin said Erdogan's offensive into northern Syria may end up being \"a big mistake and they could actually lose.\" He said that's because of purges undertaken by the Turkish president since the 2016 failed coup attempt that have drained important talent from Turkish security forces and its intelligence service. \n\"Erdogan is stuck in such a bubble of sycophancy,\" said Rubin, who prior to AEI worked on the staff of the secretary of Defense and in other government-related roles. \"He may not understand how ill-prepared and hollowed out the Turkish military actually is.\" \nTurkish airstrikes and shelling over the weekend struck more than 150 targets in the operation dubbed \"Olive Branch\" by Turkey. At least 18 civilian deaths in the Afrin region were reported as of Sunday, according to the Syrian Observatory for Human Rights, a U.K.-based war monitor group. \nTurkey sees YPG's presence in Syria's Afrin area as a security threat and is upset the United States backed and armed the YPG militia because it considers the group a branch of the outlawed terrorist group Kurdistan Workers' Party (or PKK). \nAt the same time, Rubin said the attack into the Syrian Kurdish enclave also may lead to retaliation by the PKK in both Turkish cities and other locations, such as resort towns. He said the Ankara government has been \"woefully ineffective at fighting them.\" \nLt. Cmdr. Rebecca Rebarich, a Pentagon spokeswoman, told CNBC in a written statement Monday: \"We recognize Turkey's security concerns about the PKK, a U.S.-designated foreign terrorist organization. The U.S. does not provide any support to PKK.\" \nShe added, \"We encourage all parties to avoid escalation and to focus on the most important task of defeating ISIS\" \nEven so, a NATO official told CNBC on Monday that Ankara had provided information about its operation to NATO allies and that NATO's secretary-general remained \"in regular contact with Turkish leaders.\" The official added, \"All countries have the right to self-defense, but it's important that this is done in a proportionate and measured way.\" \nAfter the United States, Turkey has the second-largest standing army in NATO. \nTurkey is getting help in its military offensive into Afrin from the Free Syrian Army (FSA), a Turkish-backed proxy group. YPG claimed four of its own militia members were killed over the weekend in the Turkish military operation along with 10 fighters from FSA. \nThe offensive follows a report earlier this month that the U.S. planned to build a 30,000-strong border force with the YPG-led Syrian Democratic Forces (SDF), the group that served as the proxy ground force in Washington's ISIS fight and received weapons, air strike support and special forces advisors. \nExperts say the border force is seen as a way for the U.S. to keep the Islamic State from coming back and also be a check against the Iranian and Russian presence in Syria. \n\"America has acknowledged it is in the process of creating a terror army on our border,\" Erdogan said in a televised address last Monday. \"What we have to do is nip this terror army in the bud.\" \nRubin said that the Ankara government was \"fanning the flames of anti-Americanism even further, and that's a tool Erdogan has always found useful.\" \nU.S. Secretary of State Rex Tillerson insisted, however, that the Syria-Turkey border force report had been mischaracterized. \n\"It is yet another stresser and strain on the U.S.-Turkish relationship and Turkey's relationship with NATO,\" said Steven Cook, a senior fellow for Middle East and Africa studies at the Council on Foreign Relations, a nonpartisan think tank. \nAlso, Cook said a possibility exists once again that Ankara may \"restrict or take away American access to Incirlik air base.\" \nTurkey's Incirlik air base has served as a hub in the coalition's fight against Islamic State in Iraq and Syria, to support coalition missions in Afghanistan and is the location of the largest stockpile of American nuclear weapons in Europe. \nIn 2016, Turkey temporarily halted U.S. air operations against ISIS from Incirlik after a failed coup against the government of Erdogan. \n\"People in the military will tell you that Incirlik is very, very important,\" said Cook. \"But now with the Islamic State kind of on the run, it maybe less important than it was a year ago.\" \nRubin said the U.S. is no longer dependent on Incirlik as it once was. For example, he said the U.S. has bolstered its military presence in nearby Romania, so \"all our eggs are not in one basket anymore.\" ", "external_links": [], "published": "2018-01-22T23:17:00.000+02:00", "crawled": "2018-01-22T23:38:55.005+02:00", "highlightTitle": ""}