{"organizations": [], "uuid": "7247878ab9173ec0e5ad3ecadb4f32c166df60b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104961295-GettyImages-631860250.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/23/alphabet-cfo-ruth-porat-on-how-all-company-meetings-boost-transparency-and-openness-at-work.html", "country": "US", "domain_rank": 767, "title": "Alphabet CFO Ruth Porat on how all-company meetings boost transparency and openness", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.127, "site_type": "news", "published": "2018-01-23T14:10:00.000+02:00", "replies_count": 0, "uuid": "7247878ab9173ec0e5ad3ecadb4f32c166df60b3"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/23/alphabet-cfo-ruth-porat-on-how-all-company-meetings-boost-transparency-and-openness-at-work.html", "ord_in_thread": 0, "title": "Alphabet CFO Ruth Porat on how all-company meetings boost transparency and openness", "locations": [], "entities": {"persons": [{"name": "ruth porat", "sentiment": "negative"}, {"name": "porat", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "cfo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you're struggling to find ways of elevating openness and morale in the workplace, how about taking a leaf out of the book of one of the world's largest tech companies?\nRuth Porat, the chief financial officer of Alphabet , as well as its subsidiary Google , said there's one morale booster that the conglomerate does that she would urge \"every company\" to try out.\n\"There's one thing we do at Alphabet, at Google, that I would encourage every company in every industry to do and it's our all-company meeting — where everyone is encouraged to ask any question and they do,\" Porat said at (WEF) in Davos, Switzerland, on Tuesday.\nSpeaking at a CNBC-moderated panel entitled \"In Technology We Trust?,\" Porat described how the tech giant employs a company voting board that allows colleagues to vote on questions and raise discussion on certain issues.\n\"Whatever is at the top of that leaderboard, we must answer,\" the CFO said.\n\"Relative to what I have seen in other places, it drives a level of transparency and openness in the company. It surfaces the types of problems which you don't want to get in a memo later published — that's festered for too long.\"\nPhoto by bennymarty Google's Mountain View, Calif., headquarters. Google launched its first Transparency Report in 2010, to highlight how policies and actions by both governments and business organizations impact access, privacy and security to material found online. Other companies who report on transparency include AT&T, Apple, Facebook and Pinterest.\nBeing such a well-known company, it isn't surprising that many want to secure a job with Google. In fact, according to Glassdoor, Google was named as the fifth \"best place\" to work in 2018 , coming behind firms including Facebook. The search engine operator has been in the U.S.' top 10 of the survey since 2012, and took the top spot in 2015.\nFor Alphabet and Google, its all-company meeting and voting board allows the group to drill down into what the business needs to do for morale in the long-term.\n\"And it really gets us to grasp quickly: 'What do we need to do?', 'What's at the core of our culture?' — so that we really are protecting what we're doing for the long-term,\" she said.\nLike this story? Like CNBC Make It on Facebook .\nDon't miss:\nDavos flashback: 9 inspiring Quote: s for those looking to lead\nThese are the best places to work in 2018\nDavos flashback: 7 inspiring life advice Quote: s from major leaders\nshow chapters We are about creating platforms, Alphabet CFO says 9 Hours Ago | 02:03", "external_links": [], "published": "2018-01-23T14:10:00.000+02:00", "crawled": "2018-01-23T14:20:22.001+02:00", "highlightTitle": ""}