{"organizations": [], "uuid": "ca874fe699f1f5874fd263f2ba5fa69ac86823e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/11/18/102196843-146679742.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/12/financial-times-bridgewater-billionaire-ray-dalioas-quest-for-aradical-transparencya.html", "country": "US", "domain_rank": 767, "title": "Bridgewater billionaire Ray Dalio’s quest for ‘radical transparency’", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:13:00.000+02:00", "replies_count": 0, "uuid": "ca874fe699f1f5874fd263f2ba5fa69ac86823e2"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/12/financial-times-bridgewater-billionaire-ray-dalioas-quest-for-aradical-transparencya.html", "ord_in_thread": 0, "title": "Bridgewater billionaire Ray Dalio’s quest for ‘radical transparency’", "locations": [], "entities": {"persons": [{"name": "ray dalio", "sentiment": "negative"}, {"name": "dalio", "sentiment": "none"}], "locations": [{"name": "bridgewater", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cameron Costa | CNBC Ray Dalio It is high noon in the saloon of the Jackson Hole burger bar in midtown Manhattan and I am butting heads with Ray Dalio, head of the world’s largest hedge fund. A few minutes earlier, the famed financier had turned up for lunch, trailing a spokesman who asked to join our meal and “check” any Quote: s.\n“No!” I tell Dalio. He cuts a discreet figure in slacks and an expensive-looking cardigan but his stance is confident and forceful, as you might expect from a “master of the universe”. I know perfectly well that Quote: -checking is normal in New York, I explain. After all, an entire communications industry exists to protect billionaires from verbal slips. But there are three golden rules at Lunch with the FT: the FT pays, no PRs and no Quote: -checking.\nI play my trump card. Dalio has just written a book that exhorts executives to embrace “radical transparency” and “tough love” honesty. The hedge fund titan is so evangelical about this that his employees apparently rate each other with iPads in meetings with public scores, like a reality television show — and even junior trainees are encouraged to challenge the boss. So surely Dalio can handle sitting with a journalist, unchaperoned, for an hour? If it makes him feel better, I joke, he can rate me on an iPad, and announce the results.\nThe minder hovers, looking nervously at Dalio. There is a brief stand-off. Then, with a half-smile, he waves the minder out and sits with me at a table with a cheap plastic cover at the back of the saloon, next to a jukebox and fairy lights. Originally, we were to eat at the Harvard Club, a more natural habitat. In my two decades of covering finance I have found that billionaires usually choose to eat in their university clubs, offices, a swanky restaurant or spartan health bar. But, at the last minute Dalio switched to Jackson Hole Burgers, a haunt laden with Western memorabilia. The only other guests are elderly tourists. I wonder if he is trying to hide? Or pretend that he is normal? (Most of his rivals consider him anything but.)\nA server unceremoniously waves plastic menus. “I love the burgers here!” Dalio says. “The fries and fried onions are great.”\nUntil recently, he seemed the last person willingly to eat a burger with a journalist. That was not because he had anything to hide. On the contrary, his $160bn hedge fund, Bridgewater, has long been one of the most successful of its kind: for the past two decades it has earned mostly double-digit average investment returns, helping to birth a new investment strategy known as “risk parity”. This essentially chooses which securities to purchase based on the volatility of prices.\nMore from the Financial Times:\nStrong US inflation signals rate rise in March\nTrump unapologetic despite storm over 'racist' comments\nBond markets: Is the bull run over?\nMore impressive still, Dalio was also one of the few hedge fund founders who sailed through the last financial crash. In 2007 he presciently announced the end of the US housing boom. In 2008 he forecast the looming collapse of banks, and the implosion of credit markets. That propelled his flagship fund, Pure Alpha, to gains of almost 10 per cent in 2008, at a time when most funds suffered searing losses. In subsequent years, Pure Alpha delivered even higher returns, cementing his reputation.\nBut in spite of that success, or perhaps because of it, Bridgewater has been opaque to outsiders, and Dalio disdains the press. He was particularly angry when The New York Times reported two years ago that some employees had filed legal suits alleging the fund’s culture was abusive and intrusive. “Anybody who doesn’t think that accuracy is a problem in the media is blind,” he tells me.\nNow, however, he has changed tack: by publishing Principles: Life & Work, he says he hopes to show that the critics are wrong. “There was a lot of controversy about our culture. I am 68 and this is my transition year,” he says.\n\"I am not predicting anything like the type of debt crunch we had in 2008. But there is a tightening financial squeeze which is going to hurt the bottom 60 per cent more and more, particularly when we have the next recession.\" -Ray Dalio, founder, Bridgewater Associates Dalio grew up “in a middle-class Long Island neighborhood, the only son of a professional jazz musician”. An indifferent, rebellious student, he started working as a golf caddie when he was 12 and overheard the golfers talking about the markets. He bought his first stock, Northwest Airlines, saw it triple in value and was hooked. He subsequently found his way to Harvard Business School and joined a Wall Street broker, but was fired after he scrapped with his boss. So in 1975, aged 26, from his two-bed apartment he created Bridgewater, a hedge fund — one of the then newish financial vehicles that placed leveraged bets on the markets, aiming for fat returns.\nUnlike some rivals, Dalio’s fund did not focus on stockpicking; instead he tried to spot “macro” trends in the global economy and finance that might affect, say, the price of gold or Japanese bonds. Initially he was very successful. But in 1982 he wrongly forecast that the American economy was heading for a depression and his fund almost imploded from the losses.\nFrom this he concluded he was “an arrogant jerk”, he writes in his book, leading to a wave of soul-searching and from there his “principles”. Their gist is that executives need to embrace their worst failures, study them, give each other honest feedback — or tough love — about their character and skills, and aggressively debate their views with “radical transparency”. Employees not only rank each other on iPads, but also record all their interactions.\n“It’s not for everyone,” he concedes. Quite so: a quarter of Bridgewater employees find it so hard to fit into this culture that they leave in their first year. Although most hedge funds try to keep a tight control on their staff, the surveillance in Bridgewater seems extreme. But Dalio claims the survivors love the rigour. “What I have developed a knee-jerk affinity for is mistakes and failures . . . I learn more from them than I learn from success,” he says. His book, a New York Times best-seller, is decorated with endorsements from corporate titans including Bill Gates praising his “invaluable guidance and insights”.\n“To be successful in the markets you have to be an independent thinker because the consensus is in the price, and if you’re betting against the consensus, there is a high probability that you are wrong. So the ability to have a group of independent thinkers who will argue with each other is critical,” he says.\nGetty Images A homeless man rests along Wall Street in front of the New York Stock Exchange in New York City. A waiter arrives. Dalio pauses to order a medium rare burger with mushrooms, fried onions and fries. I choose a Mexican burger and try to replace the potatoes with lettuce. It is impossible. “Beer?” I ask. Dalio brushes the idea aside; his wiry frame and sparkling grey-blue eyes exude an aura of disciplined health.\nSo what does Bridgewater expect in 2018", "external_links": ["https://www.ft.com/content/6fe195ca-f781-11e7-8715-e94187b3017e", "https://www.ft.com/content/57d10570-f78f-11e7-88f7-5465a6ce1a00", "https://www.ft.com/content/7ba28a3a-f7a5-11e7-88f7-5465a6ce1a00"], "published": "2018-01-12T15:13:00.000+02:00", "crawled": "2018-01-13T21:18:28.010+02:00", "highlightTitle": ""}