{"organizations": [], "uuid": "51433b2419113a177724457efc83a2ce8f59f057", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-moviepass-hires-natasha-mulla-as-companyas-first-chief-marketing-officer.html", "country": "US", "domain_rank": 767, "title": "MoviePass Hires Natasha Mulla as Company’s First Chief Marketing Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.106, "site_type": "news", "published": "2018-01-16T18:38:00.000+02:00", "replies_count": 0, "uuid": "51433b2419113a177724457efc83a2ce8f59f057"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-moviepass-hires-natasha-mulla-as-companyas-first-chief-marketing-officer.html", "ord_in_thread": 0, "title": "MoviePass Hires Natasha Mulla as Company’s First Chief Marketing Officer", "locations": [], "entities": {"persons": [{"name": "natasha mulla", "sentiment": "negative"}, {"name": "mulla", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "helios", "sentiment": "none"}], "organizations": [{"name": "moviepass hires", "sentiment": "negative"}, {"name": "cmo", "sentiment": "none"}, {"name": "matheson analytics inc.", "sentiment": "none"}, {"name": "moviepass", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 16, 2018 (GLOBE NEWSWIRE) -- MoviePass ™, the nation's premier movie-theater subscription service and a majority-owned subsidiary of Helios and Matheson Analytics Inc. (NASDAQ:HMNY), today announced the hire of Natasha Mulla as Chief Marketing Officer (CMO). Mulla, a savvy media industry veteran, joins MoviePass from her previous position as Senior Vice President of Marketing at Mashable.\nMoviePass Hires Natasha Mulla as Company’s First Chief Marketing Officer\nMulla’s addition to MoviePass’ growing executive team comes as MoviePass continues to experience a significant and rapid rise of subscribers in the wake of the massively popular $9.95 per month subscription plan rolled out in August 2017.\nAs CMO, Mulla will oversee MoviePass’ brand identity across all platforms. She will develop long-term marketing strategies in order to grow MoviePass’ subscriber base in key markets, and will work closely with the product team to continue to improve and enhance the overall customer experience.\n“MoviePass has already proven to be one of the fastest growing subscription services, generating over 1.5 million new subscribers in under five months,” Mulla said. “The company has seen great success throughout media and entertainment. I look forward to helping the team strategize and execute on programs to expand our already incredible customer base and continue to build a trusted and sustainable brand.”\nIn her previous role at Mashable, Mulla oversaw the development of that company’s brand and image. She assisted with public relations and global events, including organizing initiatives for the Mashable House at SXSW and the Social Good Summit in New York. Prior to Mashable, Mulla was Director of Events for Haymarket Media, an international publishing company, producing both online and in-person award shows and conferences across multiple brands and industries. She now brings her valuable experience to MoviePass, where her knowledge of the current media landscape will serve to maintain and increase awareness for MoviePass as it continues to grow.\n“We’re thrilled to have Natasha join the team as we continue to grow,” said CEO Mitch Lowe. “The type of rapid subscriber increase we’ve experienced can make it challenging to remain focused on delivering a great customer experience, and we believe that Natasha will be invaluable in helping us stay on track, while strategically orienting around the MoviePass brand. Her experience, dedication, and passion for the service are going to be hugely important as we move forward in our mission to fundamentally improve the movie-going experience.”\nAbout MoviePass\nMoviePass, Inc. is a technology company dedicated to enhancing the exploration of cinema. As the nation's premier movie-theater subscription service, MoviePass provides film enthusiasts the ability to attend unlimited movies. The service, now accepted at more than 91% of theaters across the United States, is the nation's largest theater network. For more information, visit www.moviepass.com .\nAbout Helios and Matheson\nHelios and Matheson Analytics Inc. (Nasdaq:HMNY) is a provider of information technology services and solutions, offering a range of technology platforms focusing on big data, artificial intelligence, business intelligence, social listening, and consumer-centric technology. HMNY owns a majority interest in MoviePass Inc., the nation's premier movie-theater subscription service. HMNY’s holdings include RedZone Map™, a safety and navigation app for iOS and Android users, and a community-based ecosystem that features a socially empowered safety map app that enhances mobile GPS navigation using advanced proprietary technology. HMNY is headquartered in New York, NY and listed on the Nasdaq Capital Market under the symbol HMNY. For more information, visit us at www.hmny.com .\nCautionary Statement on Forward-looking Information\nCertain information in this communication contains “forward-looking statements” about HMNY and MoviePass Inc. (“MoviePass”) within the meaning of the Private Securities Litigation Reform Act of 1995 or under Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended (collectively, “forward-looking statements”), that may not be based on historical fact, but instead relate to future events. Forward-looking statements are generally identified by words such as “projects,” “may,” “will,” “could,” “would,” “should,” “believes,” “expects,” “anticipates,” “estimates,” “intends,” “plans,” “potential” or similar expressions. Such forward-looking statements include, without limitation, statements regarding MoviePass’ business and prospects. Statements regarding future events are based on HMNY’s and MoviePass’ current expectations and are necessarily subject to associated risks.\nSuch forward-looking statements are based on a number of assumptions. Although management of HMNY and MoviePass believe that the assumptions made and expectations represented by such statements are reasonable, there can be no assurance that a forward-looking statement contained herein will prove to be accurate. Actual results and developments (including, without limitation, the impact of the new executive described herein on MoviePass and its business and results of operations, as well as the potential for any future increases in MoviePass’ subscriber base) may differ materially and adversely from those expressed or implied by the forward-looking statements contained herein and even if such actual results and developments are realized or substantially realized, there can be no assurance that they will have the expected consequences or effects.\nRisk factors and other material information concerning HMNY and MoviePass are described in HMNY’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2017 filed with the SEC on November 14, 2017, in HMNY’s Annual Report on Form 10-K for the fiscal year ended December 31, 2016 filed with the SEC on April 14, 2017, in HMNY’s Current Report on Form 8-K filed on November 30, 2017 and other HMNY filings, including subsequent current and periodic reports, information statements and registration statements filed with the SEC. You are cautioned to review such reports and other filings at www.sec.gov .\nGiven these risks, uncertainties and factors, you are cautioned not to place undue reliance on such forward-looking statements and information, which are qualified in their entirety by this cautionary statement. All forward-looking statements and information made herein are based on HMNY’s and MoviePass’ current expectations and HMNY does not undertake an obligation to revise or update such forward-looking statements and information to reflect subsequent events or circumstances, except as required by law.\nIn particular, MoviePass’ subscription pricing models are new. There can be no assurance that MoviePass’ recent rate of increase in its subscribers resulting from these pricing models will be sustained. Moreover, an increase in the number of Mo", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/69c73253-d520-4370-961f-f9058c0353c4/en", "https://www.globenewswire.com/Tracker?data=BM1Rt3ai5yq4-shQOUVlfPmboqHsjwvepDcnZQC1abExjIPzTPk4q4ObP4i9-LpzjVQ2d1F-8DuLCato_Yb1RQ==", "https://www.globenewswire.com/Tracker?data=UActRFt-Ty-fmw0P87XSyXqskuERQykmMYLM72IJ91_oF9-Mr_6cmnbV9ju0lMLPYsZ2o6TiVGeSZAqlpB3cYQTwz7xAmuJks2MogwUI63gIM4S__Uat-LIHitiptLCCE0AIylQLGwjCWsbpj05rFN51gzHsKbDuyCONQHKUDgcys7ydjUIUx6QmpLKOqBQQJ_YfkrKcNShvk-jhHZAAPTVvtFsN-1N1oJ6IGl4255wtIBHNQ8xXg66uLcqnBEy7u-X1gIaxw26Spj7hnx2DYw==", "https://www.globenewswire.com/Tracker?data=9juwsQxND8DYP7LgzUMBmj0EzZYSxhhHPekkG0cvVx4019Dvb2I_Ous_ZkirTTqzFUizxHoyeH6O8i9-_usiseqdC-Qo4CaNpjootXRw2CU=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/21206e44-dea4-467c-8805-b830d9e3ca32", "http://www.globenewswire.com/NewsRoom/AttachmentNg/69c73253-d520-4370-961f-f9058c0353c4", "https://www.globenewswire.com/Tracker?data=gMaqw-wxBZ1bZihWzF5rEZX5PxV0b1-fT0RY3fOWm56nunx8UB8Skx3_upSPFS0N-lLmDg0jL9ZI6Xjn33BGXw=="], "published": "2018-01-16T18:38:00.000+02:00", "crawled": "2018-01-16T18:24:41.007+02:00", "highlightTitle": ""}