{"organizations": [], "uuid": "4467e8ad8bc03032563048f37cedb37868efccc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223896489&w=1200&r=LYNXMPEE0K0LZ", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-amazon-com-store/amazons-automated-grocery-store-of-the-future-opens-monday-idUKKBN1FA0SM", "country": "US", "domain_rank": 408, "title": "Amazon's automated grocery store of the future opens Monday", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T17:58:00.000+02:00", "replies_count": 0, "uuid": "4467e8ad8bc03032563048f37cedb37868efccc2"}, "author": "", "url": "https://uk.reuters.com/article/uk-amazon-com-store/amazons-automated-grocery-store-of-the-future-opens-monday-idUKKBN1FA0SM", "ord_in_thread": 0, "title": "Amazon's automated grocery store of the future opens Monday", "locations": [], "entities": {"persons": [{"name": "jeffrey dastin", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "min read  seattle", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 3:43 PM / Updated 14 minutes ago Amazon's automated grocery store of the future opens Monday Jeffrey Dastin 4 Min Read \nSEATTLE (Reuters) - Amazon.com Inc ( AMZN.O ) will open its checkout-free grocery store to the public on Monday after more than a year of testing, the company said, moving forward on an experiment that could dramatically alter brick-and-mortar retail. \nThe Seattle store, known as Amazon Go, relies on cameras and sensors to track what shoppers remove from the shelves, and what they put back. Cash registers and checkout lines become superfluous - customers are billed after leaving the store using credit cards on file. \nFor grocers, the store’s opening heralds another potential disruption at the hands of the world’s largest online retailer, which bought high-end supermarket chain Whole Foods Market last year for $13.7 billion. Long lines can deter shoppers, so a company that figures out how to eradicate wait times will have an advantage. \nAmazon did not discuss if or when it will add more Go locations, and reiterated it has no plans to add the technology to the larger and more complex Whole Foods stores. \nThe convenience-style store opened to Amazon employees on Dec. 5, 2016 in a test phase. At the time, Amazon said it expected members of the public could begin using the store in early 2017. \nBut there have been challenges, according to a person familiar with the matter. These included correctly identifying shoppers with similar body types, the person said. When children were brought into the store during the trial, they caused havoc by moving items to incorrect places, the person added. \nGianna Puerini, vice president of Amazon Go, said in an interview that the store worked very well throughout the test phase, thanks to four years of prior legwork. Slideshow (10 Images) \n“This technology didn’t exist,” Puerini said, walking through the Seattle store. “It was really advancing the state of the art of computer vision and machine learning.” \n“If you look at these products, you can see they’re super similar,” she said of two near-identical Starbucks drinks next to each other on a shelf. One had light cream and the other had regular, and Amazon’s technology learned to tell them apart. HOW IT WORKS \nThe 1800-square-foot (167-square-meter) store is located in an Amazon office building. To start shopping, customers must scan an Amazon Go smartphone app and pass through a gated turnstile. \nReady-to-eat lunch items greet shoppers when they enter. Deeper into the store, shoppers can find a small selection of grocery items, including meats and meal kits. An Amazon employee checks IDs in the store’s wine and beer section. \nSleek black cameras monitoring from above and weight sensors in the shelves help Amazon determine exactly what people take. \nIf someone passes back through the gates with an item, his or her associated account is charged. If a shopper puts an item back on the shelf, Amazon removes it from his or her virtual cart. \nMuch of the store will feel familiar to shoppers, aside from the check-out process. Amazon, famous for dynamic pricing online, has printed price tags just as traditional brick-and-mortar stores do. Reporting by Jeffrey Dastin in Seattle; Editing by Jonathan Weber and Rosalba O'Brien", "external_links": [], "published": "2018-01-21T17:58:00.000+02:00", "crawled": "2018-01-21T18:22:17.036+02:00", "highlightTitle": ""}