{"organizations": [], "uuid": "a74288b59c12b00c4523fd229789267334275774", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222143968&w=1200&r=LYNXMPEE0E0VT", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-iran-rallies-prisoners/iran-frees-440-people-arrested-during-protests-idUSKBN1F41MP", "country": "US", "domain_rank": 408, "title": "Iran frees 440 people arrested during protests", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:12:00.000+02:00", "replies_count": 0, "uuid": "a74288b59c12b00c4523fd229789267334275774"}, "author": "", "url": "https://www.reuters.com/article/us-iran-rallies-prisoners/iran-frees-440-people-arrested-during-protests-idUSKBN1F41MP", "ord_in_thread": 0, "title": "Iran frees 440 people arrested during protests", "locations": [], "entities": {"persons": [{"name": "mahmoud sadeghi", "sentiment": "none"}, {"name": "ali motahari", "sentiment": "none"}, {"name": "ayatollah ali khamenei", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "irna", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 1:13 PM / Updated 8 minutes ago Iran frees 440 people arrested during protests Reuters Staff 3 Min Read \nLONDON (Reuters) - Iran has freed 440 people arrested in Tehran during anti-government protests, a judiciary official said, amid continuing uncertainty over how many were detained around the country. \nThe demonstrations, which began over economic hardships in late December, spread to more than 80 cities and towns and resulted in 25 deaths. \nDemonstrators initially vented their anger over high prices and alleged corruption, but the protests took on a rare political dimension, with a growing number of people calling on Supreme Leader Ayatollah Ali Khamenei to step down. \nJudicial officials have announced more than 1,000 arrests around the country, but lawmaker Mahmoud Sadeghi said last week that at least 3,700 people had been detained. \nSeveral detainees have died in custody, and human rights activists have called for an independent investigation of their cases. \nThe deputy speaker of parliament, Ali Motahari, was quoted as saying by state news agency IRNA on Sunday that based on reports received “one detainee in Tehran and two in other provinces” had died in jail. \nThe judiciary has confirmed two deaths in custody but said they have committed suicide. \n“More than 440 people who were arrested in Tehran riots have been released,” Tehran prosecutor Abbas Jafari Dolatabadi was quoted as saying by Mehr news agency on Sunday. \nDolatabadi said most of those held during the protests were from low income families, and were 18 to 35 years old. \nIran’s judiciary spokesman said on Sunday that Iranian authorities had arrested a dual national who was taking pictures during recent unrest, but gave no details of the person’s nationality. \nThe United States imposed sanctions on 14 individuals and entities on Friday for human rights abuses in Iran and for supporting Iranian weapons programs, including the head of Iran’s judiciary, Ayatollah Sadeq Larijani. \nLarijani is a close ally of Supreme Leader Ayatollah Ali Khamenei. Larijani was quoted by ISNA news agency as saying on Monday that imposing sanctions on him as the head of the judiciary was “crossing the line” and said Iran would not remain silent against such action. Reporting by Bozorgmehr Sharafedin, Editing by William Maclean", "external_links": [], "published": "2018-01-15T15:12:00.000+02:00", "crawled": "2018-01-15T15:32:53.004+02:00", "highlightTitle": ""}