{"organizations": [], "uuid": "446fd6871c92cc58d93ab1380479ab1024d6fe16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224464263&w=1200&r=LYNXMPEE0M0XE", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-sainsbury-s/sainsburys-restructures-store-management-in-cost-cutting-plan-idUKKBN1FC1LK", "country": "US", "domain_rank": 408, "title": "Sainsbury's restructures store management in cost-cutting plan", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T14:44:00.000+02:00", "replies_count": 0, "uuid": "446fd6871c92cc58d93ab1380479ab1024d6fe16"}, "author": "", "url": "https://uk.reuters.com/article/uk-sainsbury-s/sainsburys-restructures-store-management-in-cost-cutting-plan-idUKKBN1FC1LK", "ord_in_thread": 0, "title": "Sainsbury's restructures store management in cost-cutting plan", "locations": [], "entities": {"persons": [{"name": "kate holton", "sentiment": "none"}, {"name": "james davey", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "sainsbury", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 12:42 PM / Updated 7 hours ago Sainsbury's targets cost savings with store management shake-up Reuters Staff 2 Min Read \nLONDON (Reuters) - Sainsbury‘s, Britain’s second largest supermarket group, said on Tuesday it would restructure its store management as it seeks to achieve another round of targeted cost savings. \nAll of Britain’s big four food retailers - market leader Tesco, Sainsbury‘s, Asda and Morrisons - are chasing efficiency savings to finance price cuts so they can better compete with discounters Aldi and Lidl, who are still winning market share. \nTesco said on Monday it would cut a net 800 jobs and on Tuesday French retailer Carrefour announced a voluntary redundancy plan for 2,400 staff. \nSainsbury‘s, which has reported three straight years of profit decline, said the role of store manager across its circa 1,400 British stores of various formats would remain but management roles below that would change. \nIt said employees whose jobs disappear would be offered alternative roles in the business but that could be with less status and pay. \n“The proposals ... will deliver cost savings to be invested in our customer offer,” retail and operations director Simon Roberts said. \n“Our intention is not to reduce overall headcount as a result of these proposals,” he said. \nA formal consultation with affected workers will run to May. \nSainsbury’s said in November it expected to achieve cost savings of 540 million pounds by the end of the current 2017-18 financial year. It is targeting “at least” another 500 million pounds in savings over the three years starting in 2018-19. \nSainsbury‘s, which also owns the Argos chain, has a total workforce of 195,000 and is Britain’s second biggest private sector employer after Tesco. \nIt said in October it would cut up to 2,000 jobs mainly in its payroll and human resources departments, while about 400 jobs went in a store operations restructuring announced in March. \nShares in Sainsbury’s were up 0.4 percent at 258 pence at 1355 GMT. Reporting by James Davey; editing by Kate Holton and Jane Merriman", "external_links": [], "published": "2018-01-23T14:44:00.000+02:00", "crawled": "2018-01-23T15:06:36.000+02:00", "highlightTitle": ""}