{"organizations": [], "uuid": "fb7216cb7530342efef44b0abe59d906631751d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223287157&w=1200&r=LYNXMPEE0I0FP", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-iea-oil/iea-sees-oil-markets-tightening-as-venezuelan-output-collapses-idUSKBN1F80UI", "country": "US", "domain_rank": 408, "title": "IEA sees oil markets tightening as Venezuelan output collapses", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-19T17:05:00.000+02:00", "replies_count": 0, "uuid": "fb7216cb7530342efef44b0abe59d906631751d9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-iea-oil/iea-sees-oil-markets-tightening-as-venezuelan-output-collapses-idUSKBN1F80UI", "ord_in_thread": 0, "title": "IEA sees oil markets tightening as Venezuelan output collapses", "locations": [], "entities": {"persons": [], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "iea", "sentiment": "negative"}, {"name": "international energy agency", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Global oil markets are tightening quickly on falling supply from Venezuela, which posted 2017’s biggest unplanned output fall and could see a further decline in 2018, the International Energy Agency (IEA) said on Friday.\nDebt and infrastructure problems cut Venezuela’s December output to 1.61 million barrels per day (bpd), somewhere near a 30-year low. That helped oil prices top $70 per barrel in early January, their highest level in three years.\n“The general perception that the market has been tightening is clearly the overriding factor and, within this overall picture, there is mounting concern about Venezuela’s production,” the IEA, which coordinates energy policy in industrialized nations, said in its monthly report.\n“Given Venezuela’s astonishing debt and deteriorating oil network, it is possible that declines this year will be even steeper... U.S. financial sanctions are also making it tougher for Venezuela’s oil sector to operate,” the IEA said.\nAs a result of lower Venezuelan production, the IEA said OPEC’s crude output in December fell to 32.23 million bpd, boosting the group’s compliance with a deal to curb output to 129 percent.\nDecember also saw production problems in the North Sea, which helped cut global December oil supply to 97.7 million bpd, down 405,000 bpd from November.\nOPEC agreed to lower production in 2017 and has agreed to maintain output cuts for the whole of 2018 to help bring oil stocks in OECD industrialized countries down to their 5-year average.\nThe IEA said that if OPEC and its non-OPEC allies maintained good compliance with the output deal, oil markets would balance in 2018.\nIt said stocks in industrialized countries posted an average fall of 600,000 bpd in the last three quarters of 2017, the largest since 1984 when it began collecting data, helped by record global refinery runs in the fourth quarter.\n“Global crude oil markets saw an exceptionally tight 4Q17,” the IEA said, adding that it saw a combined fall of 1 million bpd during that period on declining stocks in industrialized nations and a fall in Chinese balances.\nU.S. OVERTAKING SAUDI The recovery in oil prices and a decline in global oil stocks has been helped by robust global demand growth in 2017 but it will slow down in 2018, the IEA said.\nIt kept its oil demand growth estimate for 2018 unchanged at 1.3 million bpd, down from 1.6 million bpd in 2017, mainly due to the impact of higher oil prices and changing patterns of oil use in China.\nBesides slowing demand, a spectacular rise in U.S. output is expected to keep oil prices under pressure, the IEA said.\nU.S. supply growth will push its output past 10 million bpd, overtaking Saudi Arabia and rivaling Russia. Along with gains in Canada and Brazil, this will drive up non-OPEC supply by 1.7 million bpd in 2018, versus last year’s 0.7 million bpd increase. Non-OPEC nations will be producing just short of 60 million bpd this year.\n“Explosive growth in the U.S. and substantial gains in Canada and Brazil will far outweigh potentially steep declines in Venezuela and Mexico,” the IEA said.\nThe IEA said short-cycle U.S. production was reacting to rising oil prices and therefore it raised its forecast for U.S. crude oil growth for 2018 to 1.1 million bpd from 870,000 bpd in its previous report.\n“This represents, after the downturn in 2016 and the steady recovery in 2017, a return to the heady days of 2013-2015 when U.S.-led growth averaged 1.9 million bpd,” the IEA said.\nAdditional reporting by Libby George; editing by Jason Neely\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T17:05:00.000+02:00", "crawled": "2018-01-19T14:14:54.003+02:00", "highlightTitle": ""}