{"organizations": [], "uuid": "850a9b989934f62ef94d8d94fe82a1a21191a3d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-tech-industrials-lift-wall-st-financials-recover-idUSL3N1PC4JF", "country": "US", "domain_rank": 408, "title": "US STOCKS-Tech, industrials lift Wall St; financials recover", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T02:08:00.000+02:00", "replies_count": 0, "uuid": "850a9b989934f62ef94d8d94fe82a1a21191a3d1"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-tech-industrials-lift-wall-st-financials-recover-idUSL3N1PC4JF", "ord_in_thread": 0, "title": "US STOCKS-Tech, industrials lift Wall St; financials recover", "locations": [], "entities": {"persons": [{"name": "john hanco", "sentiment": "none"}, {"name": "sruthi shankar jan", "sentiment": "none"}, {"name": "marcelle daher", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "goldman sachs", "sentiment": "negative"}, {"name": "boeing", "sentiment": "negative"}, {"name": "bank of america", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "bofa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Goldman Sachs slips on trading revenue weakness\n* Boeing shares jump after announcing JV to make aircraft seats\n* Apple slips after brokerage downgrade\n* Indexes up: Dow 0.82 pct, S&P 0.60 pct, Nasdaq 0.59 pct (Updates to early afternoon)\nBy Sruthi Shankar\nJan 17 (Reuters) - Wall Street’s main indexes were higher on Wednesday, led by technology and industrial stocks as well as a recovery in the financial sector.\nBank stocks were trading lower for much of the session following underwhelming results from Goldman Sachs and Bank of America.\nGoldman Sachs was down 2.28 percent after posting its first quarterly loss in six years on tax-related charges and a sharp drop in trading revenue.\nBofA fell 0.64 percent after the second-biggest U.S. lender reported profit that nearly halved as it booked a $2.9 billion charge due to the new federal tax law.\n“You saw a lot of earnings estimates increase coming into earnings season, certainly after tax cuts. So one has to wonder if a lot of that optimism has been baked in,” said Marcelle Daher, co-head of North American asset allocation at John Hancock Financial Services in Boston.\n“As you continue to see muted trading, and particularly a flattening of yield curve that tends to depress net interest margin, the bank stocks could be reacting to that.”\nAt 12:28 p.m. ET (1728 GMT), the Dow Jones Industrial Average was up 212.76 points, or 0.82 percent, at 26,005.62. The index hit the 26,000 milestone for the first time on Tuesday, its fastest 1000-point rise.\nThe S&P 500 was up 16.75 points, or 0.60 percent, at 2,793.17 and the Nasdaq Composite was up 42.32 points, or 0.59 percent, at 7,266.00.\nWall Street has rallied strongly in the new year, with the S&P 500 gaining 4.15 percent so far and posting only two sessions of losses, partly on hopes of a robust earnings season.\nMore than three-quarters of the 36 S&P 500 companies that have reported so far have topped earnings estimates, according to Thomson Reuters I/B/E/S.\nBoeing jumped 3.7 percent after the company announced a joint venture with car seating leader Adient to make aircraft seats.\nIBM rose 2.5 percent after Barclays analysts double upgraded the stock to “overweight” and hiked its price target by $59 to $192.\nIBM, along with Microsoft’s 1.75 percent gain, lifted the S&P technology index by 0.88 percent.\nApple’s 0.25 percent fall was a drag on the sector after Longbow Research downgraded its stock to “neutral”, citing a “good, not great iPhone cycle”.\nFord slipped 7.10 percent after the automaker reported full-year profit below estimates and provided a downbeat forecast.\nGeneral Electric slipped more than 4 percent, extending losses from Tuesday when it announced more than $11 billion in charges.\nAdvancing issues outnumbered decliners on the NYSE by 1,822 to 1,006. On the Nasdaq, 1,730 issues rose and 1,151 fell. (Reporting by Sruthi Shankar in Bengaluru; Editing by Anil D‘Silva)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T02:08:00.000+02:00", "crawled": "2018-01-18T16:28:02.008+02:00", "highlightTitle": ""}