{"organizations": [], "uuid": "471d5c8461616f4d46488ba8cd785db9b5552f94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-supermicroa-announces-the-appointment-of-kevin-bauer-as-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Supermicro® Announces the Appointment of Kevin Bauer as Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:06:00.000+02:00", "replies_count": 0, "uuid": "471d5c8461616f4d46488ba8cd785db9b5552f94"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-supermicroa-announces-the-appointment-of-kevin-bauer-as-chief-financial-officer.html", "ord_in_thread": 0, "title": "Supermicro® Announces the Appointment of Kevin Bauer as Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "kevin bauer", "sentiment": "negative"}, {"name": "bauer", "sentiment": "none"}], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "supermicro", "sentiment": "none"}], "organizations": [{"name": "diodes inc.", "sentiment": "none"}, {"name": "pericom", "sentiment": "none"}, {"name": "exar corporation", "sentiment": "none"}, {"name": "pericom semiconductor corporation", "sentiment": "none"}, {"name": "santa clara university", "sentiment": "none"}, {"name": "bs in business administration", "sentiment": "none"}, {"name": "california lutheran university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif.--(BUSINESS WIRE)-- Super Micro Computer, Inc. (NASDAQ:SMCI), a global leader in high-performance, high-efficiency server, storage technology and green computing, today announced that Kevin Bauer has been appointed as Senior Vice President and Chief Financial Officer, effective immediately. Mr. Bauer joined Supermicro in January 2017 and has previously served as Senior Vice President, Corporate Development and Strategy. Prior to joining Supermicro, Mr. Bauer was the Senior Vice President and Chief Financial Officer of Pericom Semiconductor Corporation from February 2014 until its sale to Diodes Inc. in November 2015 and, thereafter, assisted Diodes with the integration of Pericom until November 2016. Prior to that he was Chief Financial Officer of Exar Corporation from June 2009 through December 2012 and Corporate Controller from August 2004 to June 2009. Mr. Bauer has over 33 years of finance experience and received an MBA from Santa Clara University and a BS in Business Administration from California Lutheran University.\n“We are delighted to announce the appointment of Kevin at this time,” said Charles Liang, President and Chief Executive Officer of Supermicro. “We believe that Kevin’s background and experience will be of substantial benefit to the company as we continue to grow our operations. The fact that he has been with us for a year is also a significant advantage.”\n“With the introduction of Supermicro 3.0, my excitement about our opportunity has grown over the last year,” said Kevin Bauer. “The company’s growth continues and I look forward to working with Charles to take the company to the next level of performance.”\nCautionary Statement Regarding Forward Looking Statements\nStatements contained in this press release that are not historical fact may be within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Such do not constitute guarantees of future performance and are subject to a variety of risks and uncertainties that could cause our actual results to differ materially from those anticipated. Additional factors that could cause actual results to differ materially from those projected or suggested in any are contained in our filings with the Securities and Exchange Commission, including those factors discussed under the caption \"Risk Factors\" in such filings.\nAbout Super Micro Computer, Inc.\nSupermicro®, a global leader in high-performance, high-efficiency server technology and innovation is a premier provider of end-to-end green computing solutions for Data Center, Cloud Computing, Enterprise IT, Hadoop/Big Data, HPC and Embedded Systems worldwide. Supermicro's advanced Server Building Block Solutions® offer a vast array of components for building energy-efficient, application-optimized, computing solutions. Architecture innovations include Twin, TwinPro, FatTwin™, Ultra Series, MicroCloud, MicroBlade, SuperBlade®, Double-sided Storage®, Battery Backup Power (BBP®) modules and WIO/UIO.\nProducts include servers, blades, GPU systems, workstations, motherboards, chassis, power supplies, storage, networking, server management software and SuperRack® cabinets/accessories delivering unrivaled performance and value.\nFounded in 1993 and headquartered in San Jose, California, Supermicro is committed to protecting the environment through its \"We Keep IT Green®\" initiative. The Company has global logistics and operations centers in Silicon Valley (USA), the Netherlands (Europe) and its Science & Technology Park in Taiwan (Asia).\nSupermicro, FatTwin, TwinPro, SuperBlade, Double-Sided Storage, BBP, SuperRack, Building Block Solutions and We Keep IT Green are trademarks and/or registered trademarks of Super Micro Computer, Inc.\nAll other brands, names and trademarks are the property of their respective owners.\nSMCI-F\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006336/en/\nInvestor Relations Contact\nSuper Micro Computer, Inc.\nPerry G. Hayes, 408-895-6570\nSVP, Investor Relations\nSource: Super Micro Computer, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180130006336/en/"], "published": "2018-01-31T00:06:00.000+02:00", "crawled": "2018-01-31T03:10:02.025+02:00", "highlightTitle": ""}