{"organizations": [], "uuid": "70fa4ea337928b7cec99b5c32bbf77425d362fa8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-jaguar-mining-reports-q4-and-full-year-2017-production-and-provides-2018-outlook.html", "country": "US", "domain_rank": 767, "title": "Jaguar Mining Reports Q4 and Full Year 2017 Production and Provides 2018 Outlook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T14:00:00.000+02:00", "replies_count": 0, "uuid": "70fa4ea337928b7cec99b5c32bbf77425d362fa8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-jaguar-mining-reports-q4-and-full-year-2017-production-and-provides-2018-outlook.html", "ord_in_thread": 0, "title": "Jaguar Mining Reports Q4 and Full Year 2017 Production and Provides 2018 Outlook", "locations": [], "entities": {"persons": [{"name": "rodney lamond", "sentiment": "none"}, {"name": "turmalina", "sentiment": "none"}, {"name": "pilar", "sentiment": "none"}], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "iron quadrangle", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "turmalina", "sentiment": "none"}, {"name": "pilar", "sentiment": "none"}], "organizations": [{"name": "jaguar mining reports q4", "sentiment": "negative"}, {"name": "jaguar mining inc.", "sentiment": "negative"}, {"name": "jaguar", "sentiment": "negative"}, {"name": "minas gerais", "sentiment": "none"}, {"name": "ag", "sentiment": "none"}, {"name": "jaguar mining", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TSX: JAG\nTORONTO, Jan. 17, 2018 /PRNewswire/ - Jaguar Mining Inc. (\"Jaguar\" or the \"Company\") (TSX:JAG) today announced preliminary fourth quarter 2017 (\"Q4 2017\") operating results for its core assets located in the Iron Quadrangle area of Minas Gerais, Brazil. All figures are in US dollars unless otherwise expressed. Detailed Q4 2017 financial results are expected to be released on or around March 28, 2018.\nRodney Lamond, President and CEO, Jaguar Mining commented: \"In 2017, we made meaningful progress at our core producing assets Turmalina and Pilar mines in terms of production, exploration and managing cash costs company-wide. Turmalina delivered improved fourth quarter results compared to the previous two quarters in both head grade and gold production following accelerated development and stoping activities into new high-grade mining areas of Orebodies A and C. As head grades continue to increase at Pilar, we expect lower cash operating costs and increasing gold production in 2018, potentially at new record levels\".\n\"Our core producing assets are benefitting from significant investments during 2017, including 48.5 kilometres of diamond drilling, 7.76 kilometres of underground development, sustaining capital expenditures and equipment purchases. The exploration success achieved during 2017 at Turmalina and Pilar will allow the Company to begin realizing the upside potential of creating long-term sustainable value through increasing near-mine Ore Reserves and Mineral Resources.\"\n2017 Key Milestones and Exploration Success\nInvested total capital of approximately $23M in 2017, which yielded positive results with approximately $5M invested in exploration drilling. Increased definition, infill and exploration drilling metres by 28% to 48,498 m compared to 2016.\nCompleted more than 48,000 m of targeted diamond drilling for exploration and growth programs across our core assets focusing on upgrading and converting resources and adding new resources. Currently 9 drills are in operation at Jaguar's core assets.\nSignificantly increased exploration drilling year-over-year, 28.5 km (61% increase) drilled at Turmalina Mine (\"Turmalina\") and 18.8 km (68% increase) at Pilar Mine (\"Pilar\"). Secondary development at Pilar increased 64% year-over-year.\nExploration success at Pilar (see press releases August 16 and September 20, 2017) and Turmalina (see press releases February 8 and November 28, 2017). Identified high-grade mineralization on the significant down plunge extensions to main producing ore bodies. Pilar drill results demonstrated expected continuity of high-grade mineralized structures well beyond current mine plans and provided the potential for adding substantial new resources to significantly extend mine life.\nCompleted the rebuild and dry commissioning of the paste fill plant at Turmalina. Final commissioning and start-up of the plant to be completed in the beginning of 2018.\nTurmalina purchased 35.9 hectares of private land over its Zona Basal deposit, which the Company plans to test mine in 2018.\nFourth Quarter and Full Year 2017 Operating Highlights\nTotal gold production in 2017 was 84,151 ounces, reflecting 22% increase year-over-year in production at Pilar to 34,017 ounces, the highest production since 2012.\nIncreased total gold production to 21,311 ounces in Q4 2017, up 2.5% compared to 20,780 ounces in\nQ3 2017; however, lower compared to 25,408 ounces in Q4 2016. Improved progress at Turmalina: 12,245 ounces of gold produced in Q4 2017, 27% higher over Q3 2017.\nTurmalina average grade recovered significantly in Q4 2017, up 42% to 4.41 g/t Au over Q3 2017 reflecting mining from higher-grade area of Orebody A. Mining volumes continue to increase from higher grade Orebody A with more working stopes.\nPilar average head grade of 3.46 g/t Au in FY 2017 was the highest annual average grade since the start-up of the mine. Year-over-year head grade increased 14% in Q4 2017 and 5% for full year 2017 (\"FY 2017\").\nCompleted 13,973 m or 41% more definition, infill and exploration drilling metres in Q4 2017, compared to 9,914 m in Q4 2016 and 21% more metres than Q3 2017.\nDefinitions: g/t Au – grams per tonne gold\nImproving Cash Operating Costs\nImproved consolidated cash operating costs (\"COC\") to $743 per ounce sold during Q4 2017, compared to $809 in Q3 2017, and $735 in Q4 2016. COC for the second half of 2017 decreased to $775 per ounce sold compared to $895 in the first half of 2017.\nLower unit costs are a result of a continued focus on profitable ounce production, waste reduction and solid progress made on company-wide cost reduction programs. The Company estimates that the Q4 2017 operating cash flow will be between $5-6M.\nPreliminary cash balance of approximately $18.6M as of December 31, 2017, compared to a cash balance of $19.2M at September 30, 2017.\nMr. Lamond continued: \"Our fourth quarter results demonstrate excellent progress made on our strategy of delivering profitable ounce production to generate operating cash flow for re-investment in sustaining and growth exploration projects and to pay down debt. With this focus, we continued to make operational and strategic improvements in all key areas including Geological Modeling, Block Modeling and Mine Design. Operational Excellence programs, both underground and in our processing facilities, have helped deliver the efficiencies and productivity needed to continue reducing cash operating costs. As a result, cash costs decreased to $775 per ounce sold in the second half of 2017, compared to $895 for the first half. During the fourth quarter, cash costs decreased 8% to $743 per ounce sold compared to Q3 2017.\n\"Turning to 2018, we will continue to focus on increasing operating cash flow and investing capital in sustaining and growth projects, and reducing debt. The results of our 2017 exploration success will be summarized in the updated mineral resource and ore reserve statement for Pilar and an update mineral resource statement for Turmalina for Q1 2018. Our exploration strategy for 2018 will be to convert the newly reported resources into reserves through infill drilling and productive sub-level development. While this work will take 12 to 18 months to complete, the goal is to establish a large reserve base and convert the perception of a short life mine into a long-term sustainable asset.\n\"Based on our plan, the Company will be positioned to achieve strong production growth and increased mining flexibility by the end of 2018 and beyond. In 2018, we expect gold production of approximately 90,000–105,000 ounces.\"\n2018 Guidance\nGuidance for FY 2018 for Turmalina, Pilar and Roça Grande (\"RG\") mines is as follows:\n2018 Production & Guidance cost\nTurmalina\nCCA\nConsolidated\nPilar\nRG\nLow\nHigh\nLow\nHigh\nLow\nHigh\nLow\nHigh\nGold production (ounces)\n50,000\n57,000\n36,000\n42,000\n4,000\n6,000\n90,000\n105,000\nCash Operating Cost (US$/oz sold)\n675\n775\n700\n800\n825\n925\n700\n800\nAll-in sustaining cost (US$/oz sold)\n900\n1,000\n950\n1,050\n1,100\n1,250\n950\n1,100\nSustaining Capex (US$'000)\n12,000\n15,000\n9,000\n11,000\n1,000\n2,000\n22,000\n28,000\nDevelopment\nPrimary ", "external_links": ["http://www.jaguarmining.com/", "http://www.sedar.com/"], "published": "2018-01-17T14:00:00.000+02:00", "crawled": "2018-01-17T17:32:03.000+02:00", "highlightTitle": ""}