{"organizations": [], "uuid": "c4a1f437b16cae32764cba585b42678055e36590", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-rjd-green-inc-appoints-mr-jerry-niblett-as-chief-operating-officer.html", "country": "US", "domain_rank": 767, "title": "RJD Green Inc. appoints Mr. Jerry Niblett as Chief Operating Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:02:00.000+02:00", "replies_count": 0, "uuid": "c4a1f437b16cae32764cba585b42678055e36590"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-rjd-green-inc-appoints-mr-jerry-niblett-as-chief-operating-officer.html", "ord_in_thread": 0, "title": "RJD Green Inc. appoints Mr. Jerry Niblett as Chief Operating Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TULSA, OK, Jan. 31, 2018 (GLOBE NEWSWIRE) -- RJD Green Inc. (OTCPK:RJDG) Board announced today Mr. Jerry Niblett will assume the role of Chief Operating Office. Mr. Niblett has served as a Board Director for RJDG since 2014.\n“Mr. Niblett brings over 25 years of management success in oil & gas operations for both corporate and small-cap enterprise” said Mr. Ron Brewer – CEO of RJD Green Inc. “His management expertise includes executive management, as well as direct management in disciplines that include operations, maintenance, lean, reliability engineering, emergency management, compliance, safety, environmental, hazardous materials, training, and exploration. His corporate employment includes; Dominion Energy, Texaco, Shell, Energy Transfer and Sunoco Pipeline LP where he served as a national director.”\nIn his most recent employment with Sunoco Pipeline, Jerry served as part of a corporate turnaround team. Jerry helped structure an organizational growth from $37,000,000 EBITDA to $1,000,000,000 EBITDA in 8 years and had direct P/L responsibilities for annual expense budgets in excess of $25,000,000 and capital integration in excess of $500,000,000.\nEnergy sectors in which Jerry has participated include; petro-chemical refining, natural gas compression, crude oil pipeline and storage, oil & gas exploration, and business development within oil & gas products and services.\n“Jerry excels in creating, planning, implementing and maintaining needed or desired business divisions, and processes that enhance existing business disciplines. His vision and communication abilities are invaluable in emerging growth companies for creating initial launch stability and long-term success,” said Mr. Brewer.\nMr. Niblett holds a B.S. degree in Quality Management graduating with honors. He is well credentialed in various disciplines within the energy field. Jerry is both a writer and editor within industry publications, noted operations management speaker, and is affiliated with multiple industry and civic organizations. Mr. Niblett has maintained a long-term personal commitment to humanitarian and societal efforts that he feels can make a difference in people’s lives both in the United States and abroad.\nAbout RJD Green, Inc.\nThe Company operates as a holding company with a focus of acquiring and managing assets and companies. RJD Green operates in three divisions: RJD Green Healthcare Services Division, which owns IOSOFT Inc., a company that provides discrete payment technologies, services and software that can be integrated into targeted offerings for healthcare provider networks, hospitals, healthcare payers and individual providers; Earthlinc Environmental Services Division, which provides green environmental services and technologies; and Silex Holdings Division, which is engaged in specialty construction and industrial manufacturing and fills a market niche between the Home Depots and local contractors. Silex offers installed granite/other counter tops, cabinets and related products to the residential builder, commercial contractor, remodel contractor and retail customer.\nFor more information, visit http://www.rjdgreen.com\nForward-looking Statement:\nThis release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All forward-looking statements are inherently uncertain as they are based on current expectations and assumptions concerning future events of future performance of the company. Readers are cautioned not to place undue reliance on these forward-looking statements, which are only predictions and speak only as of the date hereof. In evaluation such statements, prospective investors should review carefully various risks and uncertainties identified in this release and matters set in the company's SEC filings. These risks and uncertainties could cause the company's actual results to differ materially from those indicated in the forward-looking statements.\nFor additional information contact, Ron Brewer, CEO, http://www.rjdgreen.com at ronb@rjdgreen.com , or at (918) 551-7883, or Kenneth Quist, Publicist, at thekwister@aol.com or (918) 261-8126.\nCompany Contact: RJD Green, Inc. Ron Brewer, CEO 918.551.7883 ronb@rjdreen.com Company Publicist: Kenneth Quist 918.261.8126 thekwister@aol.com\nSource:RJD Green Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=5N3N4Nb2Gd1hRqFlGjznuw8kYNC1bVMY14_dff3AoeAzt_p-z2Oob6L-0vW1UluYLy43GIhR2cRs7Sbz-7-1bXjf8op9A63e51b3-AfJ0vU=", "https://www.globenewswire.com/Tracker?data=5N3N4Nb2Gd1hRqFlGjznuw8kYNC1bVMY14_dff3AoeC-11n2n9RcBg6tCs4pkNWVamavZ-ElZdlm_CPo9GcGnWIfIAVy9bvCjz4AJxcnGlI="], "published": "2018-01-31T17:02:00.000+02:00", "crawled": "2018-01-31T18:50:18.006+02:00", "highlightTitle": ""}