{"organizations": [], "uuid": "6aaf49edf578108c6d9d3a43ab04f241a6d8849e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-gatx-corporation-announces-quarterly-dividend-increase-and-250-million-aggregate-stock-repurchase-authorization.html", "country": "US", "domain_rank": 767, "title": "GATX Corporation Announces Quarterly Dividend Increase and $250 Million Aggregate Stock Repurchase Authorization", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T19:36:00.000+02:00", "replies_count": 0, "uuid": "6aaf49edf578108c6d9d3a43ab04f241a6d8849e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-gatx-corporation-announces-quarterly-dividend-increase-and-250-million-aggregate-stock-repurchase-authorization.html", "ord_in_thread": 0, "title": "GATX Corporation Announces Quarterly Dividend Increase and $250 Million Aggregate Stock Repurchase Authorization", "locations": [], "entities": {"persons": [{"name": "brian a. kenney", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "gatx corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "gatx", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 26, 2018 (GLOBE NEWSWIRE) --\nThe board of directors of GATX Corporation (NYSE:GATX) today declared a quarterly dividend of $0.44 per common share, payable March 31, 2018, to shareholders of record on March 5, 2018. GATX has paid quarterly dividends without interruption since 1919, and the dividend amount announced today represents a 5.0% increase from the prior year’s dividend. Further, the board has approved an additional share repurchase authorization of $170 million, bringing GATX’s aggregate repurchase authorization to $250 million.\nBrian A. Kenney, president and chief executive officer of GATX stated, “2018 will mark our 100th consecutive year of paying a dividend, a track record that few companies can match. Over the past ten years, GATX has invested over $7.0 billion in our business and returned over $1.2 billion to our shareholders through dividends and share repurchase. We have done so while maintaining a strong balance sheet and steady investment grade credit rating. Both the dividend increase and share repurchase authorization reflect the board’s confidence in GATX’s long-term outlook and demonstrates the Company’s continued commitment to return capital to our shareholders.”\nCOMPANY DESCRIPTION\nGATX Corporation (NYSE:GATX) strives to be recognized as the finest railcar leasing company in the world by its customers, its shareholders, its employees and the communities where it operates. As the leading global railcar lessor, GATX has been providing quality railcars and services to its customers for 120 years. GATX has been headquartered in Chicago, Illinois, since its founding in 1898. For more information, please visit the Company's website at www.gatx.com .\nFORWARD LOOKING STATEMENTS\nStatements in this Earnings Release not based on historical facts are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995 and, accordingly, involve known and unknown risks and uncertainties that are difficult to predict and could cause our actual results, performance, or achievements to differ materially from those discussed. These statements include statements as to our future expectations, beliefs, plans, strategies, objectives, events, conditions, financial performance, prospects, or future events. In some cases, forward-looking statements can be identified by the use of words such as “may,” “could,” “expect,” “intend,” “plan,” “seek,” “anticipate,” “believe,” “estimate,” “predict,” “potential,” “continue,” “likely,” “will,” “would”, and similar words and phrases. Forward-looking statements are necessarily based on estimates and assumptions that, while considered reasonable by us and our management, are inherently uncertain. Accordingly, you should not place undue reliance on forward-looking statements, which speak only as of the date they are made, and are not guarantees of future performance. We do not undertake any obligation to publicly update or revise these forward-looking statements.\nThe following factors, in addition to those discussed in our other filings with the SEC, including our Form 10-K for the year ended December 31, 2016 and subsequent reports on Form 10-Q, could cause actual results to differ materially from our current expectations expressed in forward-looking statements:\nexposure to damages, fines, criminal and civil penalties, and reputational harm arising from a negative outcome in litigation, including claims arising from an accident involving our railcars inability to maintain our assets on lease at satisfactory rates due to oversupply of railcars in the market or other changes in supply and demand weak economic conditions and other factors that may decrease demand for our assets and services decreased demand for portions of our railcar fleet due to adverse changes in the price of, or demand for, commodities that are shipped in our railcars higher costs associated with increased railcar assignments following non-renewal of leases, customer defaults, and compliance maintenance programs or other maintenance initiatives events having an adverse impact on assets, customers, or regions where we have a concentrated investment exposure financial and operational risks associated with long-term railcar purchase commitments reduced opportunities to generate asset remarketing income operational and financial risks related to our affiliate investments, including the Rolls-Royce & Partners Finance joint ventures (collectively the “RRPF affiliates”) the impact of changes to the Internal Revenue Code as a result of the recently enacted Tax Cuts and Jobs Act, and uncertainty as to how this legislation will be interpreted and applied fluctuation in foreign exchange rates failure to successfully negotiate collective bargaining agreements with the unions representing a substantial portion of our employees changes in railroad operations that could decrease demand for railcars, either due to increased railroad efficiency or decreased attractiveness of rail service relative to other modes the impact of regulatory requirements applicable to tank cars carrying crude, ethanol, and other flammable liquids asset impairment charges we may be required to recognize deterioration of conditions in the capital markets, reductions in our credit ratings, or increases in our financing costs competitive factors in our primary markets, including competitors with a significantly lower cost of capital than GATX risks related to international operations and expansion into new geographic markets changes in, or failure to comply with, laws, rules, and regulations inability to obtain cost-effective insurance environmental remediation costs inadequate allowances to cover credit losses in our portfolio inability to maintain and secure our information technology infrastructure from cybersecurity threats and related disruption of our business FOR FURTHER INFORMATION CONTACT:\nGATX Corporation\nJennifer McManus\nDirector, Investor Relations\nGATX Corporation\n312-621-6409\njennifer.mcmanus@gatx.com\nInvestor, corporate, financial, historical financial, and news release information may be found at www.gatx.com .\nSource:GATX Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=Je1qiYli4Um171ZISRXN0RFc3i0V3pWWjzgOniUQnRHJJXMVjUzLgftOFCpO80XDOS52dJygOo2he_f9brw20A==", "https://www.globenewswire.com/Tracker?data=Je1qiYli4Um171ZISRXN0UJoVT1wUofa7FLiqC5Y6mLlUMfcQDSqrd0Bb0bSRTCqtEdN0ZV5DhJXaAWnCoTdRw==", "https://www.globenewswire.com/Tracker?data=lvF8RIIFZIL7-UTiNmlndfXY6uyX5jA7Vo7NWmwcYWG-QEw75Qa6oF8xTyZvB073hW8KiOyihh3bgbQpJE2rkVFt80OXU5UJS_OGNiyrJXg=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2544e258-68b4-434c-9366-d1c8a9a61a05"], "published": "2018-01-26T19:36:00.000+02:00", "crawled": "2018-01-26T20:02:53.003+02:00", "highlightTitle": ""}