{"organizations": [], "uuid": "992e46bbb3bc15c2deaa250c4e57ae20dc573137", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 120, "shares": 120, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-896237202.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/02/donald-trump-barack-obama-aviation-credit/", "country": "US", "domain_rank": 1196, "title": "Donald Trump Takes Credit for Air Safety System Run by Obama Holdover | Fortune", "performance_score": 1, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.416, "site_type": "news", "published": "2018-01-03T16:37:00.000+02:00", "replies_count": 0, "uuid": "992e46bbb3bc15c2deaa250c4e57ae20dc573137"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/02/donald-trump-barack-obama-aviation-credit/", "ord_in_thread": 0, "title": "Donald Trump Takes Credit for Air Safety System Run by Obama Holdover | Fortune", "locations": [], "entities": {"persons": [{"name": "obama", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "buffalo", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "national transportation safety board", "sentiment": "none"}, {"name": "asiana airlines", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg January 2, 2018 \nPresident Donald Trump is taking credit for the safety of the U.S. aviation system even though it is being run by a holdover from the previous administration and has avoided any commercial passenger fatalities for several years before he took office. \n“Since taking office I have been very strict on Commercial Aviation,” Trump said in a tweet Tuesday morning. “Good news — it was just reported that there were zero deaths in 2017, the best and safest year on record.” \nIf by “commercial aviation” he means scheduled passenger airline flights, the record actually stretches back to July, 2013, when an Asiana Airlines plane struck a seawall as it was about to land in San Francisco, killing three people. The last death on a U.S.-registered airline was in 2009 near Buffalo, New York. \nCommercial aviation generally refers to paying customers on planes of all sorts. The National Transportation Safety Board reported at least 13 deaths last year in seven crashes involving commercial charter flights in the U.S. \nLast year was unusual in one regard: there were no fatalities involving scheduled passenger jet airliners anywhere in the world, according to the Aviation Safety Network. But there were 10 airliner accidents resulting in 44 occupant fatalities and 35 deaths of people on the ground worldwide last year when charter and cargo planes were included. \nThis makes 2017 the safest year ever, both by the number of fatal accidents as well as in terms of deaths. In 2016, ASN recorded 16 accidents and 303 lives lost. \n“I’m unaware that the president has had any impact on aviation oversight policy or practice,” said Bob Mann, president of aviation consultancy R.W. Mann & Co. “Social media is not ‘oversight.’” \n“In fact, his stated preferences — less ‘red tape,’ fewer regulations — would suggest a preference for less oversight, not strictness.” \nEarlier: Trump Backs Air-Traffic Spinoff to Fix ‘Broken’ System \nThe trend toward safer flying has been building for years as U.S. regulators, the airlines and safety investigators brought on board new safety technologies, better monitoring of potential hazards and improved training. \nIndeed, the head of the Federal Aviation Administration during the first year of the Trump administration Michael Huerta was appointed by former President Barack Obama. Huerta’s five-year term expires on Jan. 6. \nLast year’s aviation safety record is the culmination of decades of work by industry and governments worldwide and should be applauded as a success story, said John Cox, chief executive officer of consultant Safety Operating Systems and a former commercial airline pilot. \n“It’s a great thing but I don’t think any one individual can take credit for it,” Cox said. “As the head of the federal government, I suppose you can take credit for the very good work the FAA has done over the years, but it’s the work the people in the trenches have done that has led to this result.” \nThe FAA referred all questions to the White House. \n“President Trump has raised the bar for our nation’s aviation safety and security,” Raj Shah, a White House spokesman, said. He cited anti-terrorism efforts and a plan to privatize air-traffic control that has languished in Congress. \n“The President is pleased there were no commercial airline deaths in 2017, and hopes this remains consistent in 2018 and beyond,” Shah said. \nTrump had harsh words for the FAA’s air-traffic control system last year during the debate over whether it should be privatized and spun off to a non-profit. He cited a technology modernization program he said was not progressing fast enough. \n“They didn’t know what they were doing,” he said of previous efforts to modernize the system. “A total waste of money.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T16:37:00.000+02:00", "crawled": "2018-01-03T00:24:20.019+02:00", "highlightTitle": ""}