{"organizations": [], "uuid": "ba3dcdaa343851194db288d9fafe48905731aefe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-mma-capital-management-announces-sale-of-asset-management-businesses-for-57-million-external-management-agreement-and-8-point.html", "country": "US", "domain_rank": 767, "title": "MMA Capital Management Announces Sale of Asset Management Businesses for $57 million, External Management Agreement and $8.375 Million Private Placement", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.976, "site_type": "news", "published": "2018-01-09T04:40:00.000+02:00", "replies_count": 0, "uuid": "ba3dcdaa343851194db288d9fafe48905731aefe"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-mma-capital-management-announces-sale-of-asset-management-businesses-for-57-million-external-management-agreement-and-8-point.html", "ord_in_thread": 0, "title": "MMA Capital Management Announces Sale of Asset Management Businesses for $57 million, External Management Agreement and $8.375 Million Private Placement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BALTIMORE, Jan. 8, 2018 /PRNewswire/ -- MMA Capital Management, LLC (NASDAQ: MMAC) (\" MMA Capital \" or \" the Company \") today announced a series of agreements with affiliates of Hunt Companies, Inc. (collectively, \" Hunt \") pursuant to which the Company sold to Hunt its low-income housing tax credit (\" LIHTC \") business, its international investment management business, its renewable energy lending underwriting platform and certain miscellaneous non-core assets. Additionally, the Company's option to purchase the LIHTC business of Morrison Grove Management, LLC (\" MGM \") was converted to a purchase agreement subject to certain conditions precedent (the \" MGM Agreement \"). Hunt has the right to take an assignment of the MGM Agreement which, if exercised, will result in Hunt also acquiring the MGM LIHTC business. In conjunction with the sale transaction, the Company also engaged Hunt to perform the day-to-day operations of the Company, including investment, management and financial reporting services. Hunt agreed to pay the Company $57 million in the form of a seven-year note as described below and to assume certain liabilities of the Company as consideration for this sale transaction. The Company may receive additional purchase consideration based on the performance of the transferred LIHTC business. The Company provided financing for the purchase price in the form of a seven-year, fully amortizing note receivable from Hunt that bears a stated rate of interest of 5%, is payable quarterly and is secured by certain ownership interests in subsidiaries of Hunt. The Company will recognize an estimated increase in shareholders' equity of $32 million upon settlement of this sale transaction and will recognize an estimated $9 million increase in common shareholders' equity in the first quarter of 2018 in connection with the adoption of new revenue recognition rules whose transitional effect is primarily driven by contracts associated with the Company's conveyed LIHTC business line. Additionally, should Hunt take an assignment of the MGM Agreement and, subject to the terms of the MGM Agreement, consummate the acquisition of the MGM LIHTC business, the Company estimates that it would recognize an incremental increase in common shareholders' equity of $14 million.\nMichael Falcone, MMA Capital's Chief Executive Officer stated, \"For some time we have heard from shareholders that our business is too small and too complicated to understand. With this transaction we have started a process to change that. When all elements of this transaction are complete, we will have achieved significant value realization from our tax credit and international businesses, simplified our balance sheet, reduced our overhead, and increased transparency, while preserving our net operating losses and our attractively priced long-term subordinate debt. Going forward we will continue to invest primarily in debt related to affordable housing and clean energy. Our hope is that our increased transparency and the simplification of our balance sheet will help our shareholders to better understand our value as we work to grow the business over time, including through increased investment supported by retained earnings and accretive share issuance.\"\nIn order to ensure alignment of interests between the Company and Hunt, Hunt has agreed to buy 250,000 of the Company's common shares in two equal tranches. An initial 125,000 shares must be acquired by March 8, 2018 at a price of $33.00 per share, and the balance by July 8, 2018 at a price of $34.00 per share, resulting in an aggregate capital raise of $8,375,000, or $33.50 per share. In connection with Hunt's investment, the Company agreed to appoint an individual selected by Hunt as a non-voting observer to our Board effective immediately and agreed to appoint an individual selected by Hunt as a Class II director of the Board upon completion of the share acquisition. Hunt selected and the Board appointed James C. (\"Chris\") Hunt as Hunt's non-voting observer to the Board.\nMr. Falcone, Mr. Bjarnason and Mr. Mentesana have all signed amendments to their employment agreements that will have them continue to serve in their current roles subsequent to the closing of the transaction. They have agreed to buy additional shares as part of their 2017 bonus program, as well as to accept additional restrictions related to the shares they currently own. In addition, all current employees of the Company and its subsidiaries will become employees of Hunt.\nMr. Falcone continued, \"We are excited by this transaction and what it means for our shareholders and the future of the Company. First, the sale of the management businesses allows us to immediately monetize businesses that would have taken us quite a while to properly develop, while taking back an income producing note receivable that provides a consistent earnings stream over the next seven years as we advance our future business model. Second, selling operating businesses and externalizing the management of the Company will result in immediate savings on the overhead burden currently borne by the Company, helping right-size the costs associated with operating a public company of our size. Third, we have partnered with an outstanding organization in Hunt, which is expected to bring even greater breadth of origination capacity and investing experience to the management of the Company. Finally, our Board of Directors looks forward to Chris Hunt's insights and perspectives as a contributor to our Board. Chris brings a tremendous amount of real estate investment and operations knowledge and will help the transition to our new business model.\"\nChris Hunt, Chief Executive Officer of Hunt stated, \"I look forward to working with the Board to help build value for all shareholders. The complimentary nature of our businesses with MMA Capital made this deal very attractive for Hunt. We at Hunt see significant value in the Company's shares as evidenced by our acquisition of shares related to the closing of this transaction. It's my belief that this share purchase aligns the interests of Hunt as external manager with those of the shareholders of MMA Capital as we seek to grow the Company in the coming years.\"\nFrancis X. Gallagher, Chairman of the Board for the Company, stated, \"This is a tremendous opportunity for the Company to work with a well-matched partner and forge ahead with the growth and investment opportunities that will further enhance shareholder value. For us, it was important to see shareholders rewarded by the recognition of value related to the disposed businesses, as well as to see Hunt's commitment to the continued growth of the Company, the continuity of our employees and the vision for our investment path moving forward.\"\nMr. Falcone continued, \"While we generated a significant gain with this transaction today, we likely will realize fewer one-time gains in future periods than we have in the past due to the disposition of the LIHTC business. We believe that this tra", "external_links": ["http://www.mmacapitalmanagement.com/", "http://www.huntcompanies.com/", "http://www.prnewswire.com/news-releases/mma-capital-management-announces-sale-of-asset-management-businesses-for-57-million-external-management-agreement-and-8375-million-private-placement-300579555.html", "https://mmacapitalmanagement.investorroom.com/shareholder-information"], "published": "2018-01-09T04:40:00.000+02:00", "crawled": "2018-01-09T09:41:25.739+02:00", "highlightTitle": ""}