{"organizations": [], "uuid": "e8c25511b2aaf96a6f9622b497426b8f286457f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/09/104832576-20171109-4560-2512.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/11/treasury-secretary-mnuchin-applauds-walmart-for-wage-increase.html", "country": "US", "domain_rank": 767, "title": "Treasury Secretary Mnuchin applauds Walmart for wage increase", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T22:54:00.000+02:00", "replies_count": 0, "uuid": "e8c25511b2aaf96a6f9622b497426b8f286457f7"}, "author": "Lauren Thomas", "url": "https://www.cnbc.com/2018/01/11/treasury-secretary-mnuchin-applauds-walmart-for-wage-increase.html", "ord_in_thread": 0, "title": "Treasury Secretary Mnuchin applauds Walmart for wage increase", "locations": [], "entities": {"persons": [{"name": "mnuchin", "sentiment": "negative"}, {"name": "steven mnuchin", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "walmart", "sentiment": "negative"}, {"name": "waste management", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "jetblue", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Treasury Secretary Mnuchin applauds Walmart for wage increase Treasury Secretary Mnuchin applauded Walmart for raising its starting hourly wage. \"We thought that [tax cuts] would be great for the economy and we are thrilled with the number of companies reacting accordingly,\" he said Thursday. Mnuchin also said he expects about 90 percent of workers to see their paychecks increase with the new tax law. 1 Hour Ago | 00:38 \nTreasury Secretary Steven Mnuchin applauded Walmart Thursday for raising its starting hourly wage to $11 and giving bonuses to some employees, among other benefits, after the passage of new tax legislation. \nDiscussing new tax withholding tables during a White House briefing, Mnuchin said: \"We thought that [tax cuts] would be great for the economy and we are thrilled with the number of companies reacting accordingly. We have been talking with lots of companies for a long time, and we are thrilled with how people are responding.\" \n\"Different companies will do different things,\" Mnuchin said. \nSome will invest capital back into their businesses, some will give money back to workers, and overall \"lots of things are going on in the economy,\" he said. \"We appreciate what Walmart is doing.\" \nCapital One also revealed Thursday that it would be raising its minimum wage for U.S. employees to $15 an hour. Other companies including JetBlue and Waste Management have reacted to the new tax law, which slashes corporate tax rates to 21 percent, by promising to pay out bonuses. JetBlue said it will give bonuses of $1,000 to crew members, while Waste Management said it will pay out bonuses of $2,000 to its employees. \nThe question of hiking the federal minimum wage, which has been stuck at $7.25 an hour since 2009, was also asked during Thursday's White House briefing. A push for $15 an hour by members of the Democratic Party so far hasn't been successful. \nMnuchin responded that he believes the \"most important issue\" today is for companies to raise their own wages over time. President Donald Trump has flirted with the idea of raising the federal minimum wage to at least $10, but it hasn't been a priority of his agenda. \nMeanwhile, Mnuchin said he expects about 90 percent of workers to see their paychecks increase with the new tax law. \n— CNBC's Chloe Aiello contributed to this story. Lauren Thomas News Associate for CNBC Related Securities", "external_links": [], "published": "2018-01-11T22:54:00.000+02:00", "crawled": "2018-01-11T23:17:54.087+02:00", "highlightTitle": ""}