{"organizations": [], "uuid": "043bdf5565b352d678e0246c5df52986e0116c1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 29, "shares": 29, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218941884&w=1200&r=LYNXMPEE02032", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-global-metals/china-metals-mixed-lead-gains-as-frigid-weather-persists-idUSKBN1ES050", "country": "US", "domain_rank": 408, "title": "METALS-China metals mixed; lead gains as frigid weather persists", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T04:14:00.000+02:00", "replies_count": 0, "uuid": "043bdf5565b352d678e0246c5df52986e0116c1e"}, "author": "", "url": "https://www.reuters.com/article/us-global-metals/china-metals-mixed-lead-gains-as-frigid-weather-persists-idUSKBN1ES050", "ord_in_thread": 0, "title": "METALS-China metals mixed; lead gains as frigid weather persists", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london meta", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SYDNEY (Reuters) - Most Chinese base metals ended lower on Wednesday, while lead gained more than 1 percent as parts of the United States braced for more frigid weather.\nThe peak demand period for lead, which is largely used to make batteries, is during the height of winter when freezing temperatures cause battery failures.\nCommodities traders said mixed signals were also emerging over the extent of China’s demand for imported industrial metals in 2018, which was dampening activity among some local investors and leading to a broader fall on the bourse.\nOptimism about Chinese demand was boosted overnight by an unexpected December rise in manufacturing and a pick up in new orders. But higher prices for raw materials and firms cutting staff have fuelled concerns about growth.\nHowever, Goldman Sachs said it sees more risks to the upside than the downside for metals demand in China, playing down concerns of a sharp decline from policy changes.\nFUNDAMENTALS * Three-month copper on the London Metal Exchange was down 0.45 percent at $7,173.50 a tonne, by 0700 GMT, extending losses from the previous session.\n* The most-traded copper contract on the Shanghai Futures Exchange slipped 0.53 percent to 54,850 yuan ($8,428.74) a tonne.\n* SHFE LEAD: ShFE lead was the top gainer on the exchange, closing 1.6 percent higher, while zinc slipped 0.31 percent, failing to build on a significant move in the LME contract overnight to a 10-year price peak on expectations of supply deficit.\nLead was aided by forecasts for further cold weather in the eastern United States, which could translate into greater demand for replacement of lead batteries in automobiles, a key market for the metal.\n* COLD FREEZE: A record-shattering freeze kept its grip on much of the eastern United States on Tuesday, causing at least seven deaths and closing schools as forecasters warned of a storm that could slam some areas with blizzard conditions later this week.\n* CHINA BANK MOVE: China’s central bank lifted its official yuan midpoint CNY=PBOC to the highest level in over 1-1/2 years to 6.4920 per dollar on Wednesday, breaching a key threshold, reflecting broad dollar weakness and solid spot yuan performance.\nReporting by James Regan; Editing by Sherry Jacob-Phillips and Vyas Mohan\n ", "external_links": [], "published": "2018-01-03T04:14:00.000+02:00", "crawled": "2018-01-03T04:55:19.008+02:00", "highlightTitle": ""}