{"organizations": [], "uuid": "aef3c03ccd5f6804ddec1a4b61433b54ffc44dd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-djokovic/tennis-djokovic-to-reassess-options-over-elbow-injury-idUKL8N1PH4N5", "country": "US", "domain_rank": 408, "title": "Tennis-Djokovic to reassess options over elbow injury", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T16:22:00.000+02:00", "replies_count": 0, "uuid": "aef3c03ccd5f6804ddec1a4b61433b54ffc44dd0"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-djokovic/tennis-djokovic-to-reassess-options-over-elbow-injury-idUKL8N1PH4N5", "ord_in_thread": 0, "title": "Tennis-Djokovic to reassess options over elbow injury", "locations": [], "entities": {"persons": [{"name": "martyn herman", "sentiment": "none"}, {"name": "djokovic", "sentiment": "none"}, {"name": "novak djokovic", "sentiment": "none"}, {"name": "chung hyeon", "sentiment": "none"}, {"name": "chung", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 2:22 PM / Updated 11 minutes ago Tennis-Djokovic to reassess options over elbow injury Martyn Herman 3 Min Read \nMELBOURNE, Jan 22 (Reuters) - Novak Djokovic said he would have to reassess the way forward for his injured elbow after it flared up again during his shock defeat by Chung Hyeon at the Australian Open on Monday. \nThe 30-year-old Serb wore a compression sleeve on his playing arm throughout the tournament, his first for six months, but after three relatively straightforward wins it was clear all was not well as he lost 7-6(4) 7-5 7-6(3) to Chung. \nHe was shaking his arm during the first set and grimaced at times when serving using a re-modelled action. \n”It’s not great. Unfortunately, it’s not great,“ the six-times grand slam champion told reporters. ”Kind of end of the first set it started hurting more. \n”So, yeah, I had to deal with it till the end of the match. \n“It’s frustrating, of course, when you have that much time and you don’t heal properly. But it is what it is.” \nDjokovic needed treatment at the end of the first set but said the pain had been manageable. \n“I felt the level of pain was not that high that I need to stop the match, even though it was obviously compromising my serve,” he said. “That is a big shot, especially against Chung, who returns well, gets a lot of balls back.” \nAsked whether he would need another layoff, Djokovic said he would sit down with his coaching team. \n“I really don’t know. I have to reassess everything with my team, medical team, coaches and everybody, scan it, see what the situation is like,” he said. \n“Last couple weeks I played a lot of tennis. Let’s see what’s happening inside.” \nIt was Djokovic’s second successive early defeat at the Australian Open he used to dominate, having been beaten by Denis Istomin in the second round a year ago. \nDjokovic did not want his condition to detract from the brilliance of Chung who produced a display reminiscent of the Serb at his best. \n”Amazing. Amazing performance,“ he said. ”He was a better player on the court tonight. He deserved to win. \n”We do play very similar. He definitely has the game to be a top-10 player, without a doubt. Obviously, I respect him a lot because he’s a hard worker, he’s disciplined, he’s a nice guy, he’s quiet. You can see that he cares about his career. \n“I‘m sure that he’s going to get some really good results in the future.” (Reporting by Martyn Herman, editing by Ed Osmond)", "external_links": [], "published": "2018-01-22T16:22:00.000+02:00", "crawled": "2018-01-22T16:35:48.006+02:00", "highlightTitle": ""}