{"organizations": [], "uuid": "3e8b1276ec95d3cdded07175d3381ef10d81b668", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/04/reuters-america-calif-regulator-tries-to-stop-insurers-dropping-coverage-over-wildfire-risk.html", "country": "US", "domain_rank": 767, "title": "Calif. regulator tries to stop insurers dropping coverage over wildfire risk", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:44:00.000+02:00", "replies_count": 0, "uuid": "3e8b1276ec95d3cdded07175d3381ef10d81b668"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/reuters-america-calif-regulator-tries-to-stop-insurers-dropping-coverage-over-wildfire-risk.html", "ord_in_thread": 0, "title": "Calif. regulator tries to stop insurers dropping coverage over wildfire risk", "locations": [], "entities": {"persons": [{"name": "dave jones", "sentiment": "none"}, {"name": "jones", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "california insurance", "sentiment": "none"}, {"name": "california department of insurance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 4 (Reuters) - California's insurance regulator wants a new state law to stop insurers dropping homeowner coverage due to wildfire risk by making them change computer models to factor in efforts to prevent blazes from spreading.\nCalifornia Insurance Commissioner Dave Jones issued a report on Thursday describing how more frequent and ferocious California wildfires are restricting the availability and affordability of homeowners' insurance in the state.\nMassive, out-of-season fires in California during 2017 caused billions of dollars in claims and are challenging expectations of when and where to expect blazes. State law gives insurers more leeway to drop coverage than to raise rates, and some have been taking the opportunity to not renew policies, a trend concerning Jones.\nThe California Department of Insurance lacks authority to regulate how insurers underwrite property insurance, a problem the state's legislature must fix, Jones said.\nHe unveiled legislative proposals to change computer models that homeowner insurers rely on for house-by-house predictions of risk, now using factors such as local topography and brush cover. Jones wants to require the models to include wildfire mitigation efforts, such as homeowner or community efforts to clear brush, according to the report.\n\"There are no specific statutory standards in place to ensure the models accuracy or reliability in rating and underwriting of homeowners insurance,\" Jones said in the report.\nJones also wants homeowners to be able to appeal the risk scores that models generate which insurers use to make coverage decisions.\nIt was unclear whether legislators would take up Jones' proposals, but at least one California lawmaker has suggested that insurers give discounts when homeowners reduce their wildfire risks.\nWe look forward to reviewing Commissioner Jones recommendations and working with him and other policymakers to address wildfire safety and recovery efforts, while balancing the need to remain solvent and pay future claims,\" said Mark Sektnan, vice president of state government relations for the Property Casualty Insurers Association of America.\nHomeowners can already appeal risk scores by talking to insurers who, in turn, can ask risk modeling companies to review the property again, said Janet Ruiz, a spokeswoman for the industrys Insurance Information Institute.\nThe 2017 wildfires will not change Allstate Corp's underwriting in the state, said the insurer's chief executive officer, Tom Wilson, in an unrelated interview on Thursday. Allstate already scaled back its wildfire exposure four to five years ago, said Wilson.\n\"But you do have to make sure over time that youre collecting the proper amount of money for that,\" Wilson said. (Reporting by Suzanne Barlyn; Editing by Andrew Hay)", "external_links": [], "published": "2018-01-05T00:44:00.000+02:00", "crawled": "2018-01-05T06:34:07.009+02:00", "highlightTitle": ""}