{"organizations": [], "uuid": "ae765a526b342e795df7390d416e1b63531376e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224612787&w=1200&r=LYNXMPEE0M1WK", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-bsc-mci/manchester-city-survive-late-fightback-to-reach-league-cup-final-idUKKBN1FC351", "country": "US", "domain_rank": 408, "title": "Manchester City survive late fightback to reach League Cup final", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:29:00.000+02:00", "replies_count": 0, "uuid": "ae765a526b342e795df7390d416e1b63531376e8"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-bsc-mci/manchester-city-survive-late-fightback-to-reach-league-cup-final-idUKKBN1FC351", "ord_in_thread": 0, "title": "Manchester City survive late fightback to reach League Cup final", "locations": [], "entities": {"persons": [{"name": "sergio aguero", "sentiment": "none"}, {"name": "leroy sane", "sentiment": "none"}, {"name": "marlon pack", "sentiment": "none"}, {"name": "pep guardiola", "sentiment": "none"}, {"name": "kevin de bruyne", "sentiment": "none"}], "locations": [{"name": "manchester city", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "aden flint", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "bristol city", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "bristol city", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 10:30 PM / Updated 9 hours ago Manchester City survive late fightback to reach League Cup final Reuters Staff 3 Min Read \nBRISTOL, England (Reuters) - Manchester City reached the League Cup final, shattering second-tier Bristol City’s hopes of a remarkable upset, as the Premier League leaders survived a late fightback to win 3-2 on Tuesday and clinch the tie 5-3 on aggregate. \nCity appeared to be cruising when goals from Leroy Sane and Sergio Aguero either side of halftime put them three goals up overall, after a 2-1 win in the first leg, before their plucky opponents dragged themselves back into the game. \nMarlon Pack reduced the arrears for the hosts past the hour and Aden Flint scored deep into stoppage time to make it 2-2 on the night, leaving them one goal short of forcing extra time. \nThere was time for one more goal, but sadly for the second-tier side, it was scored by the visitors’ Kevin De Bruyne in the sixth minute of added time, leaving Pep Guardiola’s Manchester City side to face Arsenal or Chelsea in the final on Feb. 25. \n“We are so happy to be in the final. We played amazing in the first half,” Spaniard Guardiola said after reaching his first final with the club. \n“After we lost control, maybe it will be good for us... to learn that anything can happen and you have to play for 90 minutes.” \nIf there was a hint of complacency about Manchester City in the first leg, it seemed to have been drummed out of them by kickoff on Tuesday as they tightened the screw from the first minute. \nThey barely gave the hosts a kick in the first half, hitting the woodwork from an Aguero cross and seeing a John Stones header drift just wide before Sane gave them the lead. Soccer Football - Carabao Cup Semi Final Second Leg - Bristol City vs Manchester City - Ashton Gate Stadium, Bristol, Britain - January 23, 2018 Manchester City's Sergio Aguero scores their second goal REUTERS/Hannah Mckay RIFLED SHOT \nBristol City failed to clear their lines and the ponderous defending was punished by Bernardo Silva, who nipped in to steal the ball and feed Sane, whose rifled shot across goal was deflected into the net. \nAguero doubled the lead on the night four minutes after the break with a pin-point finish from De Bruyne’s perfect pass to end a lethal counter attack from the visitors. Slideshow (9 Images) \nThere appeared no way back for the hosts until Pack guided a superb header back across goalkeeper Claudio Bravo into the corner of the net in the 64th minute. \nThat lifted the crowd but did little to change the momentum of the contest until three minutes into stoppage time when centre back Flint finished from close range off Bobby Reid’s header across goal, sending Ashton Gate wild with hope. \nYet the faint trace of belief among the home fans was wiped out when Sane cut the ball back for De Bruyne to slam home. \n“We came close to a draw today. They are a top, top side, probably the best side I’ve seen live,” said Bristol City boss Lee Johnson, whose team are fifth in the Championship and pushing for promotion to the Premier League. \n“They have so many players that are intricate and have class on the ball and sometimes you have to hold your hands up and say, ‘They are a better side than us’.” \nThe second semi-final, second leg is on Wednesday when Arsenal host Chelsea following a 0-0 draw in the first game. Writing by Toby Davis in London; Editing by Ken Ferris", "external_links": [], "published": "2018-01-24T00:29:00.000+02:00", "crawled": "2018-01-24T00:42:00.008+02:00", "highlightTitle": ""}