{"organizations": [], "uuid": "82fd348aa7bf2a6a60d136ea78b3921d97382af7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/03/104818956-thumbnail_1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/some-major-warning-signs-youre-in-the-wrong-job-for-your-personality.html", "country": "US", "domain_rank": 767, "title": "Some major warning signs you're in the wrong job for your personality", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-03T17:54:00.000+02:00", "replies_count": 0, "uuid": "82fd348aa7bf2a6a60d136ea78b3921d97382af7"}, "author": "Zameena Mejia", "url": "https://www.cnbc.com/2018/01/03/some-major-warning-signs-youre-in-the-wrong-job-for-your-personality.html", "ord_in_thread": 0, "title": "Some major warning signs you're in the wrong job for your personality", "locations": [], "entities": {"persons": [{"name": "gretchen rubin", "sentiment": "none"}, {"name": "rubin", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "pdt  rubin", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "4 Hours Ago | 01:52 SHARES \nHave you ever scored an internship or job you really looked forward to only to find out it wasn't a great fit? \nHappiness expert and New York Times bestselling author Gretchen Rubin says that knowing your personality type can help boost your chance of achieving career success. She also offers some major warning signs that your personality might not be the best fit for your job. \nIn her book \" The Four Tendencies, \" Rubin poses a new personality framework which separates all people into one of four categories based on a simple question: \"How do you respond to expectations?\" \n\"It can help to know your own tendency because it can allow you to understand why your situation may not be working out,\" Rubin tells CNBC Make It . \"When you understand your tenancy, it does shed light on why certain circumstances might or might not favor that aspect of your nature.\" A post shared by Gretchen Rubin (@gretchenrubin) on Jun 10, 2017 at 2:34pm PDT \nRubin has an online quiz to assess your tendency. Here are her \"Four Tendencies\" based on how you respond to inner and outer expectations: Upholders: You readily meet both outer expectations and inner expectations. You meet your work deadlines and you keep your New Year's resolutions without much fuss. You prioritize what others expect from you and your expectations for yourself because both are equally important to you. Questioners: You question all expectations because you don't like doing anything arbitrary, inefficient or irrational. You will meet outer expectations only if you think it makes sense and as a result, turn everything into an inner expectation. Obligers: You respond readily to outer expectations but struggle to meet your own inner expectations.You work well when held accountable by others, but you find it difficult to accomplish your expectations for yourself. Rebels: You resist all expectations, outer and inner alike. You do only what you want to do, in your own way and in your own time. If someone asks or tells you to do something, you're very likely to resist. \nBased on Rubin's framework and advice, here are some warning signs you're in a workplace that's rubbing your personality tendency the wrong way. Upholder \nYour boss or coworkers think you're too rigid or too inflexible. Your work environment does not respect your desire to execute a plan. Instead, it penalizes you for wanting to move forward. \nRubin notes that if you're being told that sticking to the script and moving forward with a plan doesn't work in your office, then something about your upholder tendency is not matching with your workplace. \n\"In many workplaces, that would be very, very valued,\" Rubin says. Questioner \n\"If your workplace is telling you that you ask too many questions, it's probably not giving you the robust justification that you need as an upholder,\" Rubin says. \nSome responses your manager may give you in response to your questioner tendency include: \"We've always done it this way\" \"I'm your boss and this is what I say\" \"This is what corporate is telling us to do\" \"Just get with the program and follow through\" \nAs a questioner in search of answers, these types of responses are sure to rile you up. \nAnother warning sign is if you feel like what you're doing seems unjustified or an inefficient use of your time. show chapters 1:40 PM ET Tue, 6 June 2017 | 01:25 Obliger \nRubin says there are two specific warning signs to keep an eye on as an obliger. On the one hand, you may feel like your manager is too hands off and you're not getting the accountability you need. As a result, you stall out and don't accomplish all that you hope to because you \"don't have the outer accountability that would allow you to thrive,\" Rubin says. \nOn the other hand, if expectations are too heavy and you feel overwhelmed, you may fall into what Rubin calls \"obliger rebellion.\" After accepting and taking on too many responsibilities, an obliger will rebel by not doing any of the tasks, like refusing to answer email and engaging in more counterproductive activities. \n\"If you have that feeling that no one else is listening to you or you feel everyone expects you to do everything all the time, this is a sign that this job isn't working out for you,\" Rubin says. Rebel \nIf your job isn't a good fit for you as a rebel, you may find yourself thinking, \"I'm being controlled\" \"I'm being told what to do,\" \"I'm not being allowed to do work in my own way and not being allowed to make choices,\" according to Rubin. \nWhen you start feeling that someone else is trying to control or micromanage over you, you'll feel less accommodated in your workplace \n\"For rebels, it's all about choice and freedom,\" Rubin says.", "external_links": [], "published": "2018-01-03T17:54:00.000+02:00", "crawled": "2018-01-03T17:54:20.006+02:00", "highlightTitle": ""}