{"organizations": [], "uuid": "63930c6635e8d3d85646a2ef6a910b3b97585f8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219659458&w=1200&r=LYNXMPEE0413H", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-corruption/ex-u-n-chief-bans-nephew-pleads-guilty-to-u-s-corruption-charges-idUKKBN1EU1TT", "country": "US", "domain_rank": 408, "title": "Ex-U.N. chief Ban's nephew pleads guilty to U.S. corruption charges", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T20:11:00.000+02:00", "replies_count": 0, "uuid": "63930c6635e8d3d85646a2ef6a910b3b97585f8e"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-corruption/ex-u-n-chief-bans-nephew-pleads-guilty-to-u-s-corruption-charges-idUKKBN1EU1TT", "ord_in_thread": 0, "title": "Ex-U.N. chief Ban's nephew pleads guilty to U.S. corruption charges", "locations": [], "entities": {"persons": [{"name": "ban", "sentiment": "negative"}, {"name": "joo hyun “dennis” bahn", "sentiment": "none"}, {"name": "brendan pierson", "sentiment": "none"}, {"name": "ban ki-sang", "sentiment": "none"}, {"name": "joo hyun bahn", "sentiment": "none"}, {"name": "julia gatto", "sentiment": "none"}, {"name": "edgardo ramos", "sentiment": "none"}, {"name": "bahn", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "hanoi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "korean construction company keangnam enterprises co ltd", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 6:14 PM / Updated 28 minutes ago Ex-U.N. chief Ban's nephew pleads guilty to U.S. corruption charges Brendan Pierson 3 Min Read \nNEW YORK (Reuters) - A nephew of former U.N. Secretary-General Ban Ki-moon pleaded guilty on Friday to U.S. charges that he took part in a scheme to bribe an official at a sovereign wealth fund in order to sell a building complex in Vietnam. FILE PHOTO: Joo Hyun Bahn (L), a nephew of former U.N. Secretary-General Ban Ki-moon, leaves a hearing in the federal court in Manhattan with his lawyer, Julia Gatto in New York City, New York, U.S. January 20, 2017. REUTERS/Nate Raymond/File Photo \nJoo Hyun “Dennis” Bahn, 39, pleaded guilty to violating a U.S. foreign corruption law and to conspiracy before U.S. District Judge Edgardo Ramos in Manhattan. \nBahn admitted that in 2014 and 2015, he tried to arrange a bribe to secure the sale of Hanoi’s Landmark 72 building complex, owned by Korean construction company Keangnam Enterprises Co Ltd. Bahn’s father, Ban Ki-sang, was an executive at the company. \nBahn said he believed he was paying a $500,000 bribe to an official at Qatar’s sovereign wealth fund through a middleman, New York fashion designer and blogger Malcolm Harris. In reality, Bahn said, Harris had no connection with any Qatari official and kept the money. \nProsecutors have said that Bahn agreed to pay another $2 million upon closing of the sale. \n“I knew what I was doing was a bad act,” Bahn said on Friday. \nBahn is scheduled to be sentenced on June 29. He faces a maximum sentence of 10 years, though prosecutors have agreed that an appropriate sentence would be up to about seven years, according to Bahn’s written plea deal. \nBahn, a South Korean citizen who lives in New Jersey and has worked as a real estate broker in Manhattan, said on Friday that he understood he would face deportation after serving his sentence. \nU.S. prosecutors have also charged Ban Ki-sang, who remains at large. Prosecutors have said he enlisted his son to arrange the Landmark 72 sale to help Keangnam deal with a liquidity crisis. \nBan Ki-moon was long expected to make a bid for the presidency of South Korea, but announced in February 2017 that he would not run, decrying “fake news” about him and his family. \nHarris pleaded guilty to money laundering and wire fraud in June, and was sentenced to three and a half years in prison in October. \nAnother man, Andrew Simon, was charged in October with taking part in the attempted bribery scheme. According to a criminal complaint filed in Manhattan federal court, Simon met with Bahn and another person in April 2014 to discuss the bribe payment. \nA lawyer for Simon could not immediately be reached for comment. Reporting By Brendan Pierson in New York; Editing by Susan Thomas", "external_links": [], "published": "2018-01-05T20:11:00.000+02:00", "crawled": "2018-01-05T20:30:02.091+02:00", "highlightTitle": ""}