{"organizations": [], "uuid": "19e6ab9e9f5e0013d94a00ff77fa4da294b2a046", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-united-airlines-names-michael-leskinen-head-of-investor-relations.html", "country": "US", "domain_rank": 767, "title": "United Airlines Names Michael Leskinen Head of Investor Relations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T17:30:00.000+02:00", "replies_count": 0, "uuid": "19e6ab9e9f5e0013d94a00ff77fa4da294b2a046"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-united-airlines-names-michael-leskinen-head-of-investor-relations.html", "ord_in_thread": 0, "title": "United Airlines Names Michael Leskinen Head of Investor Relations", "locations": [], "entities": {"persons": [{"name": "michael leskinen", "sentiment": "negative"}, {"name": "andrew levy", "sentiment": "none"}, {"name": "mike", "sentiment": "none"}, {"name": "julie stewart", "sentiment": "none"}, {"name": "scott kirby", "sentiment": "none"}, {"name": "oscar munoz", "sentiment": "none"}, {"name": "leskinen", "sentiment": "none"}], "locations": [], "organizations": [{"name": "united airlines", "sentiment": "negative"}, {"name": "united", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 16, 2018 /PRNewswire/ -- United Airlines today announced Michael Leskinen has been named managing director of investor relations. He replaces Julie Stewart, who was recently promoted to chief of staff to United Airlines CEO Oscar Munoz. In this role, Leskinen will lead the company's engagement within the financial community reporting to Andrew Levy, Chief Financial Officer of United Airlines.\n\"I am excited to name Mike to head of investor relations and look forward to working with him as he cultivates our critical relationship with shareholders and lenders,\" said Andrew Levy. \"Mike's 16 years on the buy-side and strong relationships within the financial community make him an excellent addition to the team.\"\n\"Mike brings an outstanding mix of investing experience, sector knowledge and shareholder perspective, all of which place him in an excellent position to deepen United's relationships within the financial community as well as articulate our strategy going forward,\" said Scott Kirby, President of United Airlines.\n\"I look forward to having Mike's unique perspective brought inside the company to continually refine our efforts around Investor Relations and sharpen our communications with our shareholders,\" said Oscar Munoz, Chief Executive Officer of United Airlines.\nLeskinen joins United Airlines from J.P. Morgan Asset Management, where he served as senior sector analyst – executive director, and led the firm's research efforts in Aerospace, Defense, and Airlines.\nLeskinen received his bachelor's degree in finance from Arizona State University and his M.B.A. from the University of Pennsylvania.\nAbout United\nUnited Airlines and United Express operate approximately 4,500 flights a day to 338 airports across five continents. In 2017, United and United Express operated more than 1.6 million flights carrying more than 148 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, Newark/New York, San Francisco and Washington, D.C. United operates 744 mainline aircraft and the airline's United Express carriers operate 507 regional aircraft. The airline is a founding member of Star Alliance, which provides service to 191 countries via 28 member airlines. For more information, visit united.com , follow @United on Twitter or connect on Facebook. The common stock of United's parent, United Continental Holdings, Inc., is traded on the NYSE under the symbol \"UAL\".\nView original content with multimedia: http://www.prnewswire.com/news-releases/united-airlines-names-michael-leskinen-head-of-investor-relations-300583126.html\nSOURCE United Airlines", "external_links": ["http://www.prnewswire.com/news-releases/united-airlines-names-michael-leskinen-head-of-investor-relations-300583126.html"], "published": "2018-01-16T17:30:00.000+02:00", "crawled": "2018-01-16T18:33:17.013+02:00", "highlightTitle": ""}