{"organizations": [], "uuid": "e9a226f1515c9d988156e8f9d98005de78d0466b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/28/104918779-GettyImages-94932459.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/19/european-stocks-earnings-data-us-government-shutdown.html", "country": "US", "domain_rank": 767, "title": "European stocks: earnings, data, US government shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-19T09:22:00.000+02:00", "replies_count": 0, "uuid": "e9a226f1515c9d988156e8f9d98005de78d0466b"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/19/european-stocks-earnings-data-us-government-shutdown.html", "ord_in_thread": 0, "title": "European stocks: earnings, data, US government shutdown", "locations": [], "entities": {"persons": [{"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "thyssenkrupp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "European equities closed provisionally higher Friday as investors digested strong economic data.\nSymbol Name Price Change %Change Volume FTSE --- DAX --- CAC --- IBEX 35 --- The pan-European Stoxx 600 provisionally closed 0.5 percent higher, hitting its highest level since August 2015, while the euro zone's Stoxx finished the session 0.8 percent higher, hitting a 10-year high.\nBasic resources were among the gainers following strong demand figures for metal in China. On the other hand, oil and gas stocks fell almost 0.9 percent after OPEC said it sees more oil supply in the market in 2018 from competitors. As a result, oil prices traded lower with Brent down 1.2 percent and WTI off by 1.27 percent at about 4:41 p.m. London time.\nOn Wall Street, the Dow Jones Industrial Average slipped on the possibility of a government shutdown. The 30-stock index notched an all-time high earlier this week but has since been weighed down by politics . There is uncertainty as to whether the U.S. Senate will approve a bill to avoid the shutdown of the U.S. government later on Friday. Meanwhile, the yield on the 10-year Treasury note climbed to its highest level since 2014 .\nLooking across the European benchmark, shares of Adidas rose to the top of the benchmark after brokerage firm Telsey Advisory Group cut its price target to 184 euros ($225) from 202 euros. The company's stock rose almost 7 percent. Shares of Steinhoff rose 6 percent after getting financial support from South African lenders to overcome an accounting scandal, Moneyweb reported. At the other end, Kingfisher dropped more than 2 percent following a profit warning from Carpetright.\nStrong economic data in the euro zone In terms of data, euro zone current account numbers showed Friday morning a wider account surplus in November compared to the previous month. Higher exports from the region helped the adjusted surplus to grow to 32.5 billion euros ($39.92 billion) from 30.3 billion euros in October.\nRetail sales in the U.K. dropped in December, despite the Christmas season, as consumers took advantage of Black Friday deals. Volumes fell by 1.5 percent month-to-month in December, worse than the consensus for a 1 percent drop.\n\"December's plunge in retail sales confirms that November's surge merely reflected people bringing forward Christmas present shopping to take advantage of Black Friday discounts,\" Samuel Tombs, chief U.K. economist at Pantheon Macroeconomics, said in an email.\nOn Thursday night, French President Emmanuel Macron said that there cannot be special access for the City of London post- Brexit . If the U.K. wants access to the single market, including the financial services industry, then it will have to contribute to the EU budget and follow European jurisdiction, Macron said following a meeting with U.K. Prime Minister Theresa May, the Financial Times reported.\n- Reuters contributed to this report.", "external_links": [], "published": "2018-01-19T09:22:00.000+02:00", "crawled": "2018-01-19T10:19:29.060+02:00", "highlightTitle": ""}