{"organizations": [], "uuid": "c9397cf6013249ecf8aacc1e92904404c7762b72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/27/business-wire-shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-aqua-metals-inc-of-class-action.html", "country": "US", "domain_rank": 767, "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with Losses on their Investment in Aqua Metals, Inc. of Class Action Lawsuit and Upcoming Deadline", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.036, "site_type": "news", "published": "2018-01-27T16:00:00.000+02:00", "replies_count": 0, "uuid": "c9397cf6013249ecf8aacc1e92904404c7762b72"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/27/business-wire-shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-aqua-metals-inc-of-class-action.html", "ord_in_thread": 0, "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with Losses on their Investment in Aqua Metals, Inc. of Class Action Lawsuit and Upcoming Deadline", "locations": [], "entities": {"persons": [{"name": "robert s. willoughby", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "aqua metals", "sentiment": "none"}, {"name": "united states district court", "sentiment": "none"}], "organizations": [{"name": "pomerantz llp", "sentiment": "neutral"}, {"name": "northern district of california", "sentiment": "none"}, {"name": "aqua metals", "sentiment": "none"}, {"name": "aqua metals, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Pomerantz LLP announces that a class action lawsuit has been filed against Aqua Metals, Inc. (“Aqua Metals” or the “Company”) (NASDAQ:AQMS) and certain of its officers. The class action, filed in United States District Court, for the Northern District of California, and docketed under 17-cv-07270, is on behalf of a class consisting of investors who purchased or otherwise acquired Aqua Metals securities, seeking to recover compensable damages caused by defendants’ violations of the Securities Exchange Act of 1934.\nIf you are a shareholder who purchased Aqua Metals securities between May 19, 2016, and November 9, 2017, both dates inclusive, you have until February 13, 2018, to ask the Court to appoint you as Lead Plaintiff for the class. A copy of the Complaint can be obtained at www.pomerantzlaw.com . To discuss this action, contact Robert S. Willoughby at rswilloughby@pomlaw.com or 888.476.6529 (or 888.4-POMLAW), toll-free, Ext. 9980. Those who inquire by e-mail are encouraged to include their mailing address, telephone number, and the number of shares purchased.\n[Click here to join this class action]\nAqua Metals was purportedly formed to engage in the business of recycling lead through a novel process called “AquaRefining.”\nThe Complaint alleges that throughout the Class Period, Defendants made materially false and misleading statements regarding the Company’s business, operational and compliance policies. Specifically, Defendants made false and/or misleading statements and/or failed to disclose that: (i) the Company was touting the business value of the Interstate Battery Partnership and the JCI Partnership; (ii) the Company was aware of and ignoring material unresolved deficiencies in the AquaRefining technology and process preventing large scale development; (iii) the Company was experiencing numerous execution and operational issues preventing scaling and production ramp up at its facility; (iv) the Company was unable to produce and generate revenue from its core business, therefore, remaining unprofitable; and (v) as a result, Aqua Metals’ public statements were materially false and misleading at all relevant times.\nOn May 9, 2017, Aqua Metals advised investors that the Company had experienced “issues” and “challenges” as it ramped up its AquaRefining recycling process, specifically stating that certain steps in the process “took longer than we planned to get . . . up and running.”\nOn this news, Aqua Metals’ share price fell $4.34, or roughly 26%, to close at $12.31 on May 10, 2017.\nOn August 9, 2017, after the market closed, Aqua Metals issued a press release entitled “Aqua Metals Provides Second Quarter 2017 Corporate Update.” Therein, the Company revealed that it was “currently in the process of scaling up AquaRefining operations to include 16 modules by the end of 2017,” but made no mention of “120 tons/day” as it did in its Q1 2017 press release.\nOn this news, Aqua Metals’ share price fell $2.56, or 23.6%, to close at $8.31 on August 10, 2017.\nOn October 23, 2017, the Company issued a press release entitled “Aqua Metals Provides Update on Plant’s Operations.” Therein, the Company stated that “[f]our modules are assembled, commissioned and are being used to determine the optimal operating parameters, including electrolyte pH, lead concentration, operating temperature, electrolyte flow rate and free acid levels.” However, the Company disclosed that Aqua Metals had only “produced small quantities of AquaRefined lead during the commissioning process” and that “under certain conditions, the operators would need to periodically assist the lead removal.”\nOn this news, Aqua Metals’ share price fell $0.96, or 17.9%, to close at $4.41 on October 23, 2017.\nOn November 9, 2017, after the market closed, Aqua Metals issued a press release entitled “Aqua Metals Provides Third Quarter 2017 Corporate Update.” Therein, the Company revealed that it “faced . . . many challenges as [it] worked to ramp up production.”\nOn this news, Aqua Metals’ share price fell $0.08, or 2.1%, to close at $3.71 on November 10, 2017. The stock price continued to decline on the following trading days, falling $0.13 per share (3.5%) on November 13, 2017, and $0.58 per share (16.2%) on November 14, 2017, to close at $3.00 per share on November 14, 2017.\nThe Pomerantz Firm, with offices in New York, Chicago, Los Angeles, and Paris, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, the Pomerantz Firm pioneered the field of securities class actions. Today, more than 80 years later, the Pomerantz Firm continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomerantzlaw.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180127005019/en/\nPomerantz LLP\nRobert S. Willoughby, 888-476-6529, ext. 9980\nrswilloughby@pomlaw.com\nSource: Pomerantz LLP", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pomerantzlaw.com&esheet=51749669&newsitemid=20180127005019&lan=en-US&anchor=www.pomerantzlaw.com&index=3&md5=5b69b53eee0455c5ab0bc7ca2650197c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pomerantzlaw.com&esheet=51749669&newsitemid=20180127005019&lan=en-US&anchor=www.pomerantzlaw.com&index=1&md5=9c07481810b56a252e0b585ddfcccebb", "http://www.businesswire.com/news/home/20180127005019/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fform.jotformpro.com%2Fpomerantzllp2%2Faqua-metals&esheet=51749669&newsitemid=20180127005019&lan=en-US&anchor=%5BClick+here+to+join+this+class+action%5D&index=2&md5=e37a38bf4593d42fb79ab103903be0f6"], "published": "2018-01-27T16:00:00.000+02:00", "crawled": "2018-01-27T20:12:55.004+02:00", "highlightTitle": ""}