{"organizations": [], "uuid": "329a75d58597dd2df2998281e6219835316864dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.goldreview.com/?feed=linkfeed", "section_title": "Gold Review » Gold Review", "url": "https://www.reuters.com/article/asia-gold-demand/asia-gold-bullish-price-outlook-stirs-moderate-demand-idUSL4N1PL2XH", "country": "US", "domain_rank": 408, "title": "Asia Gold-Bullish price outlook stirs moderate demand", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T15:52:00.000+02:00", "replies_count": 0, "uuid": "329a75d58597dd2df2998281e6219835316864dc"}, "author": "cmullen", "url": "https://www.reuters.com/article/asia-gold-demand/asia-gold-bullish-price-outlook-stirs-moderate-demand-idUSL4N1PL2XH", "ord_in_thread": 0, "title": "Asia Gold-Bullish price outlook stirs moderate demand", "locations": [], "entities": {"persons": [{"name": "rajendra jadhav  bengaluru/mumbai", "sentiment": "none"}, {"name": "nithin thomasprasad", "sentiment": "none"}, {"name": "harshad ajmera", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "kolkata", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "jj gold house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 12:01 PM / Updated 5 hours ago Asia Gold-Bullish price outlook stirs moderate demand Reuters Staff \n* Premiums in China at about $7 \n* Discounts in India down to $3 from $5 last week \nBy Nithin ThomasPrasad and Rajendra Jadhav \nBENGALURU/MUMBAI, Jan 26 (Reuters) - Demand for physical gold improved slightly in most Asian hubs this week, despite rising prices, as buyers stocked up on expectations of a further rally in the yellow metal. \nGold prices rose on Friday, putting them on course for a near 2 percent weekly gain, in anticipation of a further dip in the U.S. dollar. \nDemand in India, the world’s second-largest consumer of gold, was marginally better and discounts narrowed as jewellers increased purchases anticipating higher prices. \n“For the last few weeks, jewellers were waiting for a correction in prices. As prices are going up and up only, some started buying,” said Harshad Ajmera, the owner of JJ Gold House, a wholesaler in the Indian city of Kolkata. \nLocal gold prices jumped to 30,464 rupees ($480) per 10 grams on Thursday, the highest level since Sept. 8. \nDealers in India were offering a discount of up to $3 an ounce this week, down from $5 last week. \nMany jewellers were still postponing purchases, expecting up to a 4 percent reduction in the import duty in the budget on Feb. 1, said a Mumbai-based dealer at a private bank. \nIn top consumer China, premiums eased to $7 per ounce from about $8 last week, while in Hong Kong, premiums ranged between 60 cents and $1.20, compared with 50 cents previously. \nIn Singapore, premiums remained mostly unchanged from last week at 60-80 cents an ounce. \n“We still see stronger demand for gold and one of the reasons is that Chinese New Year is approaching and the business side (jewellers) needs more gold,” said Brian Lan, managing director at dealer GoldSilver Central in Singapore. \nThe Chinese New Year, a key gold-buying occasion, starts on Feb. 16 this year. \n“We also think that prices are bullish for the first quarter of the year ... that’s why some people want to buy physical,” said Lan. \nGold bulls are likely to have their patience rewarded in what is tipped to be the strongest year since 2013, a Reuters survey showed. \n“The Chinese are still buying because the CNY (Chinese Yuan) is very strong (versus the dollar),” said Ronald Leung, chief dealer at Lee Cheong Gold Dealers in Hong Kong. \nA weaker dollar makes bullion cheaper for holders of other currencies. \nAdditionally, some people who invested in cryptocurrencies are also moving into precious metals, since cryptocurrencies have not been doing as well these few weeks, Lan added. \nMeanwhile, discounts in Japan narrowed to 50 cents an ounce from $1 on weak demand, a Tokyo-based trader said. ($1 = 63.5200 Indian rupees) (Reporting by Nithin Prasad and Arpan Varghese in Bengaluru; Editing by Susan Fenton)", "external_links": [], "published": "2018-01-26T15:52:00.000+02:00", "crawled": "2018-01-26T16:03:10.025+02:00", "highlightTitle": ""}