{"organizations": [], "uuid": "4b748a34cda02961ad041e395160053f3f626e90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/iran-usa-detainee/elderly-american-iranian-jailed-in-iran-hospitalised-with-heart-problems-lawyer-idINKBN1F62GA", "country": "US", "domain_rank": 408, "title": "Elderly American-Iranian jailed in Iran hospitalised with heart problems - lawyer", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T20:28:00.000+02:00", "replies_count": 0, "uuid": "4b748a34cda02961ad041e395160053f3f626e90"}, "author": "", "url": "https://in.reuters.com/article/iran-usa-detainee/elderly-american-iranian-jailed-in-iran-hospitalised-with-heart-problems-lawyer-idINKBN1F62GA", "ord_in_thread": 0, "title": "Elderly American-Iranian jailed in Iran hospitalised with heart problems - lawyer", "locations": [], "entities": {"persons": [{"name": "babak", "sentiment": "none"}, {"name": "namazi", "sentiment": "none"}, {"name": "baquer namazi", "sentiment": "none"}, {"name": "jared genser", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "beirut", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIRUT (Reuters) - An 81-year old American-Iranian imprisoned in Iran, Baquer Namazi, was hospitalised earlier this week due to a drop in blood pressure and an irregular heartbeat, his lawyer said on Wednesday.\nIt was the fourth time that Namazi, who was detained in February 2016 and later convicted of espionage charges which he denied, had been taken to hospital in the past year, the statement by lawyer Jared Genser said.\nLast September, Namazi, a former Iranian provincial governor and ex-UNICEF official, underwent emergency heart surgery to install a pacemaker.\n”(He) has undergone relentless interrogations and has been held in terrible conditions, including having spent extended periods in solitary confinement,” Namazi’s son, Babak, said in the same statement. “It is becoming more clear by the day that this will be a death sentence for him.”\nNamazi, who was hospitalised on Monday, was transferred back to Tehran’s high-security Evin prison on Monday evening and his health is now stable, the statement added.\nIn October 2015, the elite Revolutionary Guards detained Namazi’s son Siamak, a businessman in his mid-40s also with dual U.S.-Iranian citizenship, as he was visiting family in Tehran.\nFather and son were each sentenced in the autumn of 2016 to 10 years in prison for spying and cooperating with the U.S. government. They denied the charges.\nIran does not recognise dual citizenship and judiciary officials have said both men would be treated as Iranian citizens in the legal process.\nTehran has had no diplomatic relations with Washington since its 1979 Islamic Revolution and ties have deteriorated anew since U.S. President Donald Trump took office a year ago, after a modest detente under his predecessor Barack Obama.\nFive other U.S. citizens and permanent U.S. residents have been arrested in Iran over the past two years - Princeton doctoral student Xiyue Wang; art gallery owner Karan Vafadari and his wife Afarin Niasari; Robin Reza Shahini, an Iranian-American from California; and Nizar Zakka, a Lebanese national with U.S. permanent residency.\nLast July Trump warned that Iran would face “new and serious consequences” unless all unjustly detained American citizens were released and returned. Babak Namazi asked Trump to intervene in his family’s case.\n“My family desperately needs the president to redouble his efforts to bring Siamak and my dad home,” Babak added.\nReporting by Babak Dehghanpisheh; editing by Mark Heinrich\n ", "external_links": [], "published": "2018-01-17T20:28:00.000+02:00", "crawled": "2018-01-17T20:40:50.004+02:00", "highlightTitle": ""}