{"organizations": [], "uuid": "03f243e7366fb5d4df4299e6a76424e42601457e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-f-n-b-corporation-schedules-fourth-quarter-2017-earnings-report-and-conference-call.html", "country": "US", "domain_rank": 767, "title": "F.N.B. Corporation Schedules Fourth Quarter 2017 Earnings Report and Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.063, "site_type": "news", "published": "2018-01-09T00:30:00.000+02:00", "replies_count": 0, "uuid": "03f243e7366fb5d4df4299e6a76424e42601457e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-f-n-b-corporation-schedules-fourth-quarter-2017-earnings-report-and-conference-call.html", "ord_in_thread": 0, "title": "F.N.B. Corporation Schedules Fourth Quarter 2017 Earnings Report and Conference Call", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH, Jan. 8, 2018 /PRNewswire/ -- F.N.B. Corporation (NYSE: FNB) announced that it expects to issue financial results for the fourth quarter and full year of 2017 before the markets open on Tuesday, January 23, 2018. Chairman, President and Chief Executive Officer, Vincent J. Delie, Jr., Chief Financial Officer, Vincent J. Calabrese, Jr., and Chief Credit Officer, Gary L. Guerrieri, plan to host a conference call to discuss the Company's financial results the same day at 10:30 AM ET.\nParticipants are encouraged to pre-register for the conference call at http://dpregister.com/10115668 . Callers who pre-register will be provided a conference passcode and unique PIN to gain immediate access to the call and bypass the live operator. Participants may pre-register at any time, including up to and after the call start time.\nDial-in Access: The conference call may be accessed by dialing (844) 802-2440 or (412) 317-5133 for international callers. Participants should ask to be joined into the F.N.B. Corporation call.\nWebcast Access: The audio-only call and related presentation materials may be accessed via webcast through the \"Investor Relations and Shareholder Services\" section of the Corporation's website at www.fnbcorporation.com . Access to the live webcast will begin approximately 30 minutes prior to the start of the call.\nPresentation Materials: Presentation slides and the earnings release will also be available on the Corporation's website at www.fnbcorporation.com .\nA replay of the call will be available shortly after the completion of the call until midnight ET on Tuesday, January 30, 2018. The replay can be accessed by dialing (877) 344-7529 or (412) 317-0088 for international callers; the conference replay access code is 10115668. Following the call, a link to the webcast and the related presentation materials will be posted to the \"Shareholder and Investor Relations\" section of F.N.B. Corporation's website at www.fnbcorporation.com .\nAbout F.N.B. Corporation\nF.N.B. Corporation (NYSE:FNB), headquartered in Pittsburgh, Pennsylvania, is a diversified financial services company operating in eight states. FNB holds a significant retail deposit market share in attractive markets including: Pittsburgh, Pennsylvania; Baltimore, Maryland; Cleveland, Ohio; and Charlotte, Raleigh, Durham and the Piedmont Triad (Winston-Salem, Greensboro and High Point) in North Carolina. The Company has total assets of $31 billion, and more than 400 banking offices throughout Pennsylvania, Ohio, Maryland, West Virginia, North Carolina and South Carolina. The company also operates Regency Finance Company, which has more than 75 consumer finance offices in Pennsylvania, Ohio, Kentucky and Tennessee.\nFNB provides a full range of commercial banking, consumer banking and wealth management solutions through its subsidiary network which is led by its largest affiliate, First National Bank of Pennsylvania, founded in 1864. Commercial banking solutions include corporate banking, small business banking, investment real estate financing, international banking, business credit, capital markets and lease financing. The consumer banking segment provides a full line of consumer banking products and services, including deposit products, mortgage lending, consumer lending and a complete suite of mobile and online banking services. FNB's wealth management services include asset management, private banking and insurance.\nThe common stock of F.N.B. Corporation trades on the New York Stock Exchange under the symbol \"FNB\" and is included in Standard & Poor's MidCap 400 Index with the Global Industry Classification Standard (GICS) Regional Banks Sub-Industry Index. Customers, shareholders and investors can learn more about this regional financial institution by visiting the F.N.B. Corporation website at www.fnbcorporation.com .\nView original content: http://www.prnewswire.com/news-releases/fnb-corporation-schedules-fourth-quarter-2017-earnings-report-and-conference-call-300579221.html\nSOURCE F.N.B. Corporation", "external_links": ["http://dpregister.com/10115668", "http://www.prnewswire.com/news-releases/fnb-corporation-schedules-fourth-quarter-2017-earnings-report-and-conference-call-300579221.html", "https://www.fnb-online.com/about-us", "http://www.fnbcorporation.com/"], "published": "2018-01-09T00:30:00.000+02:00", "crawled": "2018-01-09T09:40:15.969+02:00", "highlightTitle": ""}