{"organizations": [], "uuid": "5473da9fbee57e8f980ba35d37cb2fd92ed85c8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219200840&w=1200&r=LYNXMPEE0303U", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-myanmar-journalists-friends/friends-of-arrested-reuters-reporter-in-myanmar-pour-out-hearts-on-social-media-idUSKBN1ET088", "country": "US", "domain_rank": 408, "title": "Friends of arrested Reuters reporter in Myanmar pour out hearts on social media", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T04:26:00.000+02:00", "replies_count": 0, "uuid": "5473da9fbee57e8f980ba35d37cb2fd92ed85c8e"}, "author": "", "url": "https://www.reuters.com/article/us-myanmar-journalists-friends/friends-of-arrested-reuters-reporter-in-myanmar-pour-out-hearts-on-social-media-idUSKBN1ET088", "ord_in_thread": 0, "title": "Friends of arrested Reuters reporter in Myanmar pour out hearts on social media", "locations": [], "entities": {"persons": [{"name": "kyaw soe", "sentiment": "none"}, {"name": "kyaw soe oo", "sentiment": "none"}, {"name": "wa lone", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}, {"name": "rakhine state", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters myanmar", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 2:23 AM / Updated 8 hours ago Friends of arrested Reuters reporter in Myanmar pour out hearts on social media Reuters Staff 5 Min Read \nYANGON (Reuters) - Ever since Reuters Myanmar reporter Wa Lone was arrested on Dec. 12 on suspicion of violating the Official Secrets Act, friends and former colleagues have poured out their hearts and expressed hopes for his release on social media. \nWa Lone and colleague Kyaw Soe Oo, who was also arrested, had worked on Reuters coverage of a crisis in the western state of Rakhine, where an estimated 655,000 Rohingya Muslims have fled from a fierce military crackdown on militants. \nMajor governments, including the United States, the European Union and Canada, and top U.N. officials, are among those demanding the release of Wa Lone and Kyaw Soe Oo. \nIn Myanmar, which is still in transition after almost half a century of strict military rule, speaking out in support of journalists and others who run afoul of the authorities is more the exception than the rule. \nA relative of Kyaw Soe Oo, who is based in Rakhine State, where animosity between the Buddhist Rakhine community and Rohingya Muslims is intense, said his friends were reluctant to show support for him given the divisive atmosphere. \nGovernment spokesman Zaw Htay, when asked about social media support for the pair, said such a campaign should not be done while a case was being heard in court. \n“During the trial, they need to prove they’re right and they’re innocent,” he told Reuters. \n“The complainant will accuse and the accused should defend. They should think about how their pressure will affect the court.” \nThe following are some of the numerous comments about Wa Lone, who has done voluntary charity work, helping poor children. \nThiha Maung Maung, a former colleague of Wa Lone’s at the People’s Age journal. \n“He speaks frankly, he has a very good attitude and always helps out friends.” \n“I am very sad to see that not only the government but also some people are seeing Ko Wa Lone as a traitor,” he said, using a Burmese honorific that means “brother”. \n”Ko Wa Lone loves the country. He is someone who serves for the benefit of the country in whatever role he can.” \n”We, friends, are waiting for the day of his release.” \nWi Sara, a monk who studied English with Wa Lone. \n“Wa Lone is someone who studies knowledge and who shares that knowledge.” \n“As a journalist ... he goes after information that should be known and then presents it.” FILE PHOTO: Reuters reporter Kyaw Soe Oo looks out from a police vehicle as he leaves a court in Yangon, Myanmar, December 27, 2017. REUTERS/Stringer/File Photo \n”I don’t believe he tried to sell the country’s secrets for dollars, which many people are accusing him of doing. I see that he tried to share information that should be known to the people. So, I wish for Lone’s release.” \nEi Pwint Rhi Zan, a friend who Wa Lone did charity work with. \n“He is very kind to people who are in trouble. He is someone who always wants to help and loves the truth.” \n“He’s someone we never have to worry would do something wrong. He never treated anyone badly and he has a very good attitude. He is very kind-hearted. He is strong-minded.” \nSan Naing, a member of the Benevolent Youth charity group which Wa Lone is involved with. \n“He’s a good volunteer worker, a real volunteer worker.” \n”We can always rely on him during our donation trips ... Whenever he’s on the trip, we feel energized. He makes the kids happy.” \nMyat Nyein Aye, a former colleague of Wa Lone’s at the Myanmar Times newspaper. \n“Ko Wa Lone is always helpful to others and he loves kids a lot and wants kids to be educated.” \nMindy Walker, English-language teacher: \n“He was an eager kid who was hoping for a better future for himself, his family and his country.” \n“He brought joy everywhere he went and made everyone feel special ... Wa Lone was especially involved in making children’s lives better.” \n“Always smiling. Always giving. Always there to help. He doesn’t belong in prison. He belongs in the community telling stories ... spreading messages of peace.” \nDespite the praise for Wa Lone and Kyaw Soe Oo expressed by their supporters, many people in Myanmar have criticized the journalists. \n“Media should understand that if they sell information about the country just for dollars, things become complex,” wrote a Facebook user named Linn Aung, commenting on a Myanmar news report about the two journalists. \n”Myanmar citizens of foreign news agencies should be loyal to their country,” Facebook user Pinky Shine commented in response to another Myanmar media report about the pair. Addtional reporting by Shoon Naing; Editing by Robert Birsel", "external_links": [], "published": "2018-01-04T04:26:00.000+02:00", "crawled": "2018-01-04T04:30:20.006+02:00", "highlightTitle": ""}