{"organizations": [], "uuid": "afc47d6c25dd5ad9b8b2732484d2d08779c18421", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/10/12/103070123-RTX1RVI2.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19836768/device/rss/rss.html", "section_title": "Energy", "url": "https://www.cnbc.com/2018/01/03/oil-prices-near-levels-last-seen-in-20142015-as-market-tightens.html", "country": "US", "domain_rank": 767, "title": "Oil prices near levels last seen in 2014/2015 as market tightens", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T03:35:00.000+02:00", "replies_count": 0, "uuid": "afc47d6c25dd5ad9b8b2732484d2d08779c18421"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/03/oil-prices-near-levels-last-seen-in-20142015-as-market-tightens.html", "ord_in_thread": 0, "title": "Oil prices near levels last seen in 2014/2015 as market tightens", "locations": [], "entities": {"persons": [{"name": "william o'loughlin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "rivkin securities", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices on Thursday hit fresh two-and-a-half year highs and were at levels last seen at the start of the commodity slump in 2014/2015, with markets tightening amid tensions in Iran and due to ongoing OPEC-led production cuts.\nPrices were also buoyed by Asia's stock markets, which flirted with 10-year highs on Thursday amid strong data from leading economies including the United States, Japan and Germany.\nU.S. West Texas Intermediate (WTI) crude futures were at $62.10 a barrel at 0445 GMT, up 47 cents, or 0.8 percent, from their last close. They hit $62.14 shortly before, the highest level since May 2015.\nBrent crude futures - the international benchmark for oil prices - were at $68.13 a barrel, up 29 cents, or 0.4 percent, after hitting a May-2015 high of $68.16 shortly before.\nshow chapters Geopolitical tensions biggest bullish risk to oil prices: ClipperData's Matt Smith 22 Hours Ago | 02:52 Beyond a brief intraday spike in May, 2015, these were the highest crude price levels since December, 2014, at the start of the oil price downturn.\nFreezing weather in the United States has also spurred short-term demand, especially for heating oil.\n\"The market is clearly getting more bullish on oil as inventory levels get closer to the five-year average. Geopolitical uncertainty in Iran, OPEC's third largest producer, is also helping to support the price as citizens are again protesting the government,\" said by William O'Loughlin, investment analyst at Australia' Rivkin Securities.\nIran's elite Revolutionary Guards have deployed forces to three provinces to put down anti-government unrest that has been ongoing for a week, their commander said on Wednesday.\nIn the United States, crude oil inventories fell by 5 million barrels in the week to Dec. 29 to 427.8 million barrels, industry group the American Petroleum Institute said on Wednesday.\nPotentially undermining the trend towards tighter market conditions is U.S.oil production, which has risen by almost 16 percent since mid-2016, hitting 9.75 million barrels per day (bpd) at the end of last year.\nOfficial U.S. Energy Information Administration (EIA) storage and production data is due on Thursday.", "external_links": [], "published": "2018-01-04T03:35:00.000+02:00", "crawled": "2018-01-04T03:58:33.004+02:00", "highlightTitle": ""}