{"organizations": [], "uuid": "240c582f35f7cde9c63eb1bc7df773a9c172216f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/31/104621313-GettyImages-630680490-vape.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000108/device/rss/rss.html", "section_title": "Health Care", "url": "https://www.cnbc.com/2018/01/23/teenagers-to-smoking.html", "country": "US", "domain_rank": 767, "title": "Vaping can be addictive and may lure teenagers to smoking, science panel concludes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T20:43:00.000+02:00", "replies_count": 0, "uuid": "240c582f35f7cde9c63eb1bc7df773a9c172216f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/teenagers-to-smoking.html", "ord_in_thread": 0, "title": "Vaping can be addictive and may lure teenagers to smoking, science panel concludes", "locations": [], "entities": {"persons": [], "locations": [{"name": "united states", "sentiment": "none"}], "organizations": [{"name": "national academies of sciences", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A national panel of public health experts concluded in a report released on Tuesday that vaping with e-cigarettes that contain nicotine can be addictive and that teenagers who use the devices may be put at higher risk of switching to traditional smoking.\nWhether teenage use of e-cigarettes may lead to conventional smoking has been intensely debated in the United States and elsewhere. While the industry argues that vaping is not a steppingstone to conventional cigarettes or addiction, some antismoking advocates contend that young people become hooked on nicotine, and are enticed to cancer-causing tobacco-based cigarettes over time.\nThe new report by the National Academies of Sciences, Engineering and Medicine is the most comprehensive analysis of existing research on e-cigarettes. It concluded the devices are safer than traditional smoking products and that they do help smokers quit, citing conclusive proof that switching can reduce smokers' exposure to deadly tar, numerous dangerous chemicals and other carcinogens.\nBut it stopped short of declaring e-cigarettes are safe, noting that there are no long-term scientific studies of the devices' addictive potential or their effects on the heart, lungs or on reproduction.\nRead more from the New York Times:\nYes, lots of people are getting flu symptoms. No, this season isn't so unusual. Here's why. \nFed up with drug companies, hospitals decide to start their own \nSanofi, facing threat from generics, moves to buy hemophilia drug maker \nThe panel found evidence among studies it reviewed that vaping may prompt teenagers or young adults to try regular cigarettes, putting them at higher risk for addiction, but that any significant linkage between e-cigarettes and long-term smoking has not been established. It said it was unable to determine whether young people were just trying cigarettes or becoming habitual smokers.\n\"When it got down to answering the questions about what the impacts on health are, there is still a lot to be learned,\" said David Eaton, of the University of Washington, who led the committee that reviewed existing research and issued the report. \"E-cigarettes cannot be simply categorized as either beneficial or harmful.\"\nThe report was commissioned in 2016, after the F.D.A. gained the authority to regulate tobacco products that had previously been outside its jurisdiction, such as e-cigarettes, cigars and other goods.\nMitch Zeller, head of the agency's tobacco division, said the committee was assigned to assess the existing science, and to point out where research gaps suggest more study was needed. The report will aid the agency in its review of applications for lower-risk tobacco products and the potential harm or benefits those pose to individuals and the public.\nOn Wednesday, an F.D.A. advisory panel will review an application from Philip Morris International for iQOS, an electronic device that unlike e-cigarettes, contains tobacco in a stick that the company says heats it but does not burn it. It releases nicotine vapor the company says is less hazardous than smoke. If approved, it would be the first company allowed by the government to claim its product is less harmful than cigarettes.\nAlso this week, on Friday, the agency's new nicotine steering committee will hold a public hearing on over-the-counter therapeutic products, among them gums, patches and lozenges, designed to help smokers quit.\nCessation was one area where the committee's report did give the booming e-cigarette industry some good news. It pointed out the benefits for smokers of tobacco-based cigarettes who are trying to quit. and. But people who continue to smoke cigarettes, alternating with e-cigarettes, do not gain the same health benefits, the committee said. That's especially important given that most adults who vape also still smoke or use other tobacco products.\nWhile there is no evidence at this time that e-cigarettes or their components cause cancer, the committee recommended more long-term research. Some e-cigarettes do contain chemicals and metals whose long-term effects — including on pregnancy — also require additional research, the committee said.\nSmoking rates among adults and teenagers have declined significantly over the last few decades. In 2015, the last year for which the Centers for Disease Control and Prevention has statistics, about 37 million Americans, 15 percent of adults aged 18 and older, smoked cigarettes. The number has declined from nearly 21 percent of every 100 adults in 2005; and 42 percent in 1965.\nWith that decline, the e-cigarette industry has emerged as a potential substitute and Big Tobacco has been among the device developers enjoying new profits from the tobacco alternatives. Bonnie Herzog, a well-known Wells Fargo tobacco analyst, predicted the industry will grow about 15 percent to $5.1 billion in retail sales in the United States, in 2018. Of that, she noted that $1.6 billion will be spent on the pre-filled cartridges sold mostly by the big tobacco companies, and $3.5 billion on open vapor systems; the liquid refill products, most of which are sold at vape shops.\nThe vaping industry, as well as traditional tobacco companies, are also gearing up for a lengthy fight with the F.D.A. over the campaign by the agency's commissioner, Dr. Scott Gottlieb, to slash levels of nicotine in traditional cigarettes to nonaddictive or minimally addictive levels.\nDr. Gottlieb is expected to issue an initial proposal, calling for public comment on lower nicotine levels, in the near future.\nThe new report reflects the complexity of the issues surrounding e-cigarettes and the balancing act tobacco regulators face over the pros and cons of the many alternatives to conventional cigarettes. The notion of e-cigarettes as a gateway to conventional cigarettes for youths has been a sticking point.\nAdam Leventhal, a professor of preventive medicine at the University of Southern California, and an author of the report, said his group did an exhaustive literature search, reviewing all studies on youths and e-cigarette use from around the world. Of those, they found 10 studies that they deemed strong enough to address the question. But these studies did not show that using e-cigarettes caused teens to move on to tobacco, only that the use of e-cigarettes was associated with later smoking of at least one traditional cigarette. The report noted that more than 11 percent of all high school students had used e-cigarettes within the past month, a total of nearly 1.7 million youths.\n\"The evidence was substantial that this association was consistent across a number of research methodologies, age ranges, locations, and research groups in and outside the U.S.,\" Mr. Leventhal said.\nMore intriguing was the report's finding of moderate evidence that youths who use e-cigarettes before trying tobacco, are more likely to become more frequent and intense smokers.\nCritics have long contended that the flavored liquids for the devices are luring adolescents to the habit, at a time when nicotine is especially hazardous for their brain development. Three of the top-selling flavors at e-liquid.com , a large online retailer, include \"Unicorn Milk\" (strawberries and cream), \"TNT\" (strawberry, apple and peach) and \"I Love Donuts\" (blueberries and pastry).\nThe authors of the new report cite conclusive evidence that vaping can be addictive, and that exposure to nicotine from e-cigarettes is highly variable, depends on the characteristics of the device, as well as how it is used. They also cited conclusive proof that in addition to nicotine, most e-cigarettes also contain and emit numerous potentially toxic substances.\nIn terms of second hand vapor, the committee said there was conclusive evidence that e-cigarette use increases airborne concentrations of particulate matter and nicotine indoors.\nThe report concluded that much of the current research on e-cigarettes is lacking by scientific standards and that many important areas have not yet been studied. Dr. Eaton, in an interview, said that the authors did not distinguish between industry-funded, and independent research.\nMany of the existing studies were also flawed, either in methodology or because of industry-financed bias. In addition, the levels of nicotine and other chemicals, including metals, vary in e-cigarettes from brand to brand, which has complicated some research findings.\nMr. Zeller praised the report and stressed its strong findings that youths who start on e-cigarettes are more likely to become heavier users of tobacco.\n\"And for kids who initiate on e-cigarettes, there's a great chance of intensive use of cigarettes. As the regulator, we've got to factor all that in,\" Mr. Zeller said.\nIn July, the F.D.A. delayed the deadline at least four years for e-cigarette companies to submit applications for currently marketed products to demonstrate that their public health benefit warrants agency approval. The agency did not delay other aspects of its tobacco control work, including requirements for mandatory age and photo-ID checks to prevent illegal sales to minors and the banning of free samples.\nPublic health advocates who objected to the July delay, said this report gave them further concern.\n\"What the report demonstrates is that despite the popularity of e-cigarettes, little is known about their overall health effects, and there is wide variability from product to product,\" said Matthew L. Myers, President of Campaign for Tobacco-Free Kids. \"That makes the case even stronger for F.D.A. regulation. This report makes very real the concern that e-cigarettes may well increase the use of combustive tobacco products.''\nThe vaping industry was cautiously optimistic about the influence of the report. Gregory Conley, president of the American Vaping Association, a nonprofit that advocates for vapor products, said it was good news. He said the findings were consistent with those reached by the Royal College of Physicians and other institutions in Britain that have issued reports indicating e-cigarettes are less dangerous than traditional smoking and help with cessation.\n\"The committee's findings also fall in line with F.D.A. Director Scott Gottlieb's nicotine strategy, a key element of which involves adult smokers switching to lower risk products,\" he said. \"In the wake of this report, it is more apparent than ever that true leadership is needed in public health to ensure that adult smokers have access to truthful information about the benefits of switching to smoke-free products.", "external_links": [], "published": "2018-01-23T20:43:00.000+02:00", "crawled": "2018-01-24T22:39:43.000+02:00", "highlightTitle": ""}