{"organizations": [], "uuid": "91000f75c131cc8bf79b094bd5a1f0aa705c6646", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1220990745&w=1200&r=LYNXMPEE0A03Q", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-global-oil/oil-markets-cling-to-near-three-year-highs-on-tighter-u-s-market-idUKKBN1F0069", "country": "US", "domain_rank": 408, "title": "Oil markets cling to near three-year highs on tighter U.S. market", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T03:51:00.000+02:00", "replies_count": 0, "uuid": "91000f75c131cc8bf79b094bd5a1f0aa705c6646"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-oil/oil-markets-cling-to-near-three-year-highs-on-tighter-u-s-market-idUKKBN1F0069", "ord_in_thread": 0, "title": "Oil markets cling to near three-year highs on tighter U.S. market", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "duvignau  u.s.", "sentiment": "none"}, {"name": "parentis-en-born", "sentiment": "none"}], "organizations": [{"name": "min read  singapore", "sentiment": "none"}, {"name": "organization of the petroleum exporti", "sentiment": "none"}, {"name": "vermilion energy", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 53 AM / Updated 33 minutes ago Oil dips away from three-year highs on signs of overheated market Henning Gloystein 3 Min Read \nSINGAPORE (Reuters) - Oil inched away from three-year highs on Thursday on signs that a 13-percent rally since early December may have run its course, although a surprise drop in U.S. production and lower crude inventories offered prices some support. Oil barrels are pictured at the site of Canadian group Vermilion Energy in Parentis-en-Born, France, October 13, 2017. REUTERS/Regis Duvignau \n  were at $63.50 a barrel at 0529 GMT, 7 cents below their last settlement, but still close to a December-2014 high of $63.67 per barrel reached the previous day. \n  were at $69.10 a barrel, 10 cents below their last finish, albeit also still close to the previous day’s peak of $69.37 a barrel - the highest level since an intra-day spike in May 2015. \n“In Q1, the balance of risk to Brent lies to the downside, with prices overheating, record net-length built into the futures market and fundamentals set to weaken seasonally,” BMI Research said in a note. \nThe mounting downward pressure on prices is also showing in the physical oil market, where OPEC’s No.2 and No.3 producers, Iran and Iraq, this week cut their supply prices to remain competitive with customers. \nOil markets have so far been generally supported by a production cut led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia that started in January last year and is set to last through 2018. \nMore immediate price support came overnight from the United States, where crude inventories C-STK-T-EIA fell almost 5 million barrels in the week to Jan. 5, to 419.5 million barrels. \nThat’s slightly below the five-year average of just over 420 million barrels. \nU.S. production fell 290,000 barrels per day to 9.5 million bpd, the EIA said, foiling expectations of U.S. output breaking through 10 million bpd. AMPLE FUEL \nDespite this, more bearish signals are appearing. Fuel inventories in Asia and the United States remain ample, and in some cases are rising. \nU.S. gasoline stocks USOILG=ECI rose 4.1 million barrels, EIA data showed, more than expected. \nIn Asia’s oil trading hub Singapore, average refinery profit margins DUB-SIN-REF have fallen below $6 per barrel this month, their lowest seasonal level in five years, resulting in lower feedstock crude orders. \nWith the crude price up by more than 13 percent since early December, some analysts expect a downward price correction following the recent bull-run. \n“Markets are getting a bit fatigued, and a healthy correction could be on the cards,” said Stephen Innes, head of trading for Asia/Pacific at futures brokerage Oanda in Singapore. Reporting by Henning Gloystein; Editing by Richard Pullin and Joseph Radford", "external_links": [], "published": "2018-01-11T03:51:00.000+02:00", "crawled": "2018-01-11T04:01:25.000+02:00", "highlightTitle": ""}