{"organizations": [], "uuid": "6d5c45aec793e3b91415505a6603787542f8126e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 11}, "facebook": {"likes": 29, "shares": 29, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223477259&w=1200&r=LYNXMPEE0I1UM", "site_section": "http://feeds.reuters.com/reuters/environment/", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-brazil-dump/brasilia-closes-latin-americas-largest-rubbish-dump-idUSKBN1F82VI", "country": "US", "domain_rank": 408, "title": "Brasilia closes Latin America's largest rubbish dump", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T01:46:00.000+02:00", "replies_count": 0, "uuid": "6d5c45aec793e3b91415505a6603787542f8126e"}, "author": "", "url": "https://www.reuters.com/article/us-brazil-dump/brasilia-closes-latin-americas-largest-rubbish-dump-idUSKBN1F82VI", "ord_in_thread": 0, "title": "Brasilia closes Latin America's largest rubbish dump", "locations": [], "entities": {"persons": [{"name": "rodrigo rollemberg", "sentiment": "none"}, {"name": "anthony boadle", "sentiment": "none"}, {"name": "oscar niemeyer", "sentiment": "none"}, {"name": "lucio costa", "sentiment": "none"}], "locations": [{"name": "brasilia", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "min read  brasilia", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "estructural", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRASILIA (Reuters) - One thing the designers of Brazil’s modernistic capital Brasilia forgot to map out in their intricate plans was where to put the rubbish.\nThe city’s creators, world famous architect Oscar Niemeyer and urban planner Lucio Costa, could never have imagined the city’s explosive growth.\nNow, 67 years and 50 million tonnes of garbage later, the Estructural dump is the biggest in Latin America.\nUntil Friday, that is, when Brasilia’s dirty secret was closed. Governor Rodrigo Rollemberg opened a new landfill further out of town to replace it, angering thousands of scavengers who make a living from the garbage.\n“We cannot live with this open wound in the midst of our nation’s capital, a dump where human beings put their lives at risk seeking a livelihood in an undignified way,” the governor said at the opening of the new landfill.\nSince the city was founded on a cattle ranch on a highland plateau, Brasilia has expanded to become the nation’s fourth-biggest metropolis with some 2.5 million inhabitants.\nJust 12 miles (20 kms) from the presidential palace, thousands of scavengers have eked out a living for decades by picking out cans, copper wire and anything that can be recycled and sold.\nGenerations of pickers have brought their children to work in the dusty dump, beneath a scorching sun and hovering vultures, plagued by swarms of flies and the pungent stench of putrid food and methane gas.\nRollemberg’s plan is to employ the pickers at new “triage” centers in warehouses where garbage can be separated for recycling on conveyor belts in cleaner conditions by workers in uniforms and gloves.\nBut scavengers working at the dump on its last day said they refused to swap their source of income for regimented government jobs that payed too little to sustain their families.\nA man runs at 'Lixao da Estrutural', Latin America's largest rubbish dump, in Brasilia, Brazil, January 19, 2018. REUTERS/Ueslei Marcelino “I’ll have to start working the streets looking through garbage cans,” said Evando Souza, 32, who has worked at the dump day-in and day-out for five years.\nFlanked by his three young sons, Souza said in a good month he could take home 3,000 reais ($937), more than three times the minimum salary.\n“Today was a lucky day for us,” he said, polishing a silver ring they had found and a old model Nokia cellphone.\nSouza, his head covered with a dirty T-shirt to protect him from the sun and the flies, said he was thinking of returning to his home state of Maranhão in northeast Brazil.\nSlideshow (19 Images) While human rights groups criticized precarious conditions and child labor at the dump, environmentalists made the strongest case for closure, warning that it was polluting the water table beneath Brasilia, a city that has already has to ration water supplies due to recurrent droughts.\nPopulated by well paid government employees, Brasilia has the highest per capita income in the country - and affluent households that produce a lot of garbage.\nMore than 1,200 tonnes of garbage were dumped every day at the landfill by an endless line of trucks, due to halt at midnight on Friday.\nThe closure will impact families living in Ciudad Estructural, an adjacent community started by scavengers that has an estimated 40,000 inhabitants. Many will have a hard time finding alternative jobs as Brazil slowly emerges from its worst recession in decades.\nSome members of the 3,000-strong pickers cooperative said they would rather stay working the dump and not have the cost of a long commute to the new recycling centers.\n“Rollemberg hasn’t offered us a real alternative. We cannot survive on that pay,” said Valdir Dutra, who said he has scavenged through the dump’s rubbish for 16 years.\n“I‘m going to dust off my CV and see what job I can find,” he said with a wry smile.\nReporting by Anthony Boadle and Ueselei Marcelino; Editing by Daniel Flynn and Cynthia Osterman\n ", "external_links": [], "published": "2018-01-20T01:46:00.000+02:00", "crawled": "2018-01-20T01:59:04.005+02:00", "highlightTitle": ""}