{"organizations": [], "uuid": "4cd2fb9da7198a15a74e940e566bba9f63c98d8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-jll-income-property-trust-acquires-class-a-industrial-asset-in-atlanta.html", "country": "US", "domain_rank": 767, "title": "JLL Income Property Trust Acquires Class A Industrial Asset in Atlanta", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.976, "site_type": "news", "published": "2018-01-04T02:04:00.000+02:00", "replies_count": 0, "uuid": "4cd2fb9da7198a15a74e940e566bba9f63c98d8a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-jll-income-property-trust-acquires-class-a-industrial-asset-in-atlanta.html", "ord_in_thread": 0, "title": "JLL Income Property Trust Acquires Class A Industrial Asset in Atlanta", "locations": [], "entities": {"persons": [], "locations": [{"name": "atlanta chicago", "sentiment": "none"}, {"name": "southeast u.s.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "buford", "sentiment": "none"}], "organizations": [{"name": "jll income property trust", "sentiment": "negative"}, {"name": "mason mill distribution center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 3, 2018 /PRNewswire/ -- JLL Income Property Trust, an institutionally managed, daily valued perpetual life REIT (NASDAQ: ZIPTAX ; ZIPTMX ; ZIPIAX ; ZIPIMX ), today announced the acquisition of Mason Mill Distribution Center, a newly-constructed 340,000 square-foot Class A industrial property in Atlanta's northeast submarket located in Buford, Georgia. The property is fully leased to a publicly-traded global pharmaceutical distribution company through 2027. The tenant invested heavily in the property which is a mission critical facility servicing the southeast region. The purchase price was approximately $31 million.\nAtlanta is the largest economy in the Southeast U.S. and the region's hub for finance, commerce, communications, transportation, education and cultural activity. Atlanta has earned the reputation for being one of the most business-friendly cities in the U.S., with more than 75% of Fortune 1000 firms having operations in the metro area, and 15 of the Fortune 500 companies choosing Atlanta for their headquarters. The population of Atlanta is expected to grow by an average of 2.1% annually over the next five years according to economy.com , indicating the current growth rate among industrial tenants attracted to the local consumer base should continue.\nThe northeast submarket where Mason Mill Distribution Center is located is Atlanta's largest and has historically been the favorite of institutional investors and tenants. The close proximity to the Golden Triangle executive housing, access to skilled labor and the immediate interstate infrastructure provide an ideal location for higher employee count operations required by large, multinational tenants. This area has higher barriers to entry due to topography, few available developable land sites, and the increased resistance by municipalities to permit industrial development, which is curtailing new starts compared to other adjacent submarkets.\n\"We are pleased to add this high-quality industrial property to our portfolio, as we increase exposure to core assets in high-barrier-to-entry markets,\" said Allan Swaringen, President and CEO of JLL Income Property Trust. \"The fundamental tailwinds benefitting the industrial real estate sector are numerous, and we expect to continue to capture upside associated with this trend as long as it continues. This investment brings our aggregate industrial allocation to nearly $560 million and nearly six million square feet, and represents 23 percent of the value of the overall JLL Income Property Trust portfolio.\"\nMason Mill Distribution Center is a state-of-the-art distribution facility with best-in-class features, including 32-foot ceiling height, ESFR sprinklers, LED lighting, a cross-dock design, 100% air conditioned and also features 376 parking spots.\nJLL Income Property Trust is an institutionally managed, daily valued perpetual life real estate investment trust (REIT) that gives investors access to a growing portfolio of commercial real estate investments selected by an institutional investment management team and sponsored by one of the world's leading real estate services firms.\nFor more information on JLL Income Property Trust, please visit our website at www.jllipt.com .\nAbout JLL Income Property Trust (NASDAQ: ZIPTAX ; ZIPTMX ; ZIPIAX ; ZIPIMX ),\nJones Lang LaSalle Income Property Trust, Inc. is a daily valued perpetual life real estate investment trust (REIT) that owns and manages a diversified portfolio of high quality, income-producing office, retail, industrial and apartment properties located primarily in the United States. JLL Income Property Trust expects to further diversify its real estate portfolio over time, including on a global basis. For more information, visit www.jllipt.com .\nAbout LaSalle Investment Management\nLaSalle Investment Management, Inc., a member of the JLL group and advisor to JLL Income Property Trust, is one of the world's leading global real estate investment managers with nearly 700 employees in 17 countries worldwide and approximately $58 billion of assets under management of private and public property equity and debt investments. LaSalle's diverse client base includes public and private pension funds, insurance companies, governments, endowments and private individuals from across the globe. For more information, visit www.lasalle.com .\nForward Looking Statements and Future Results\nThis press release may contain forward-looking statements with respect to JLL Income Property Trust. Forward-looking statements are statements that are not descriptions of historical facts and include statements regarding management's intentions, beliefs, expectations, research, market analysis, plans or predictions of the future. Because such statements include risks, uncertainties and contingencies, actual results may differ materially from those expressed or implied by such forward-looking statements. Past performance is not indicative of future results.\nContact:\nMatt Schuler\nDate:\nJanuary 3, 2018\nTelephone:\n+1 312 897 4192\nEmail:\nmatt.schuler@lasalle.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/jll-income-property-trust-acquires-class-a-industrial-asset-in-atlanta-300577287.html\nSOURCE JLL Income Property Trust", "external_links": ["http://www.nasdaq.com/symbol/ziptmx", "http://www.nasdaq.com/symbol/zipiax", "http://www.nasdaq.com/symbol/ziptax", "http://www.nasdaq.com/symbol/zipimx", "http://www.prnewswire.com/news-releases/jll-income-property-trust-acquires-class-a-industrial-asset-in-atlanta-300577287.html", "http://www.jllipt.com/", "http://www.lasalle.com/"], "published": "2018-01-04T02:04:00.000+02:00", "crawled": "2018-01-04T05:27:26.011+02:00", "highlightTitle": ""}