{"organizations": [], "uuid": "71cb52578398f98e74eae044fcee7918ab7894a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/04/104877471-GettyImages-884598470-1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/23/us-tax-overhaul-is-a-short-term-sugar-high-says-ceo-of-the-worlds-largest-courier.html", "country": "US", "domain_rank": 767, "title": "US tax overhaul is a short-term sugar high, says CEO of the world's largest courier", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.066, "site_type": "news", "published": "2018-01-23T12:01:00.000+02:00", "replies_count": 0, "uuid": "71cb52578398f98e74eae044fcee7918ab7894a3"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/23/us-tax-overhaul-is-a-short-term-sugar-high-says-ceo-of-the-worlds-largest-courier.html", "ord_in_thread": 0, "title": "US tax overhaul is a short-term sugar high, says CEO of the world's largest courier", "locations": [], "entities": {"persons": [{"name": "appel", "sentiment": "none"}, {"name": "frank appel", "sentiment": "none"}, {"name": "erik mcgregor", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "42nd street", "sentiment": "none"}, {"name": "cipriani", "sentiment": "none"}, {"name": "midtown manhattan", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "treasury department", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "deutsche post", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The recent changes to the U.S. tax system are a short-term sugar high that will not fix the economy, the CEO of the world's largest courier service said Tuesday.\nSpeaking at a panel at the World Economic Forum, Frank Appel, CEO of Deutsche Post criticized the reduction of individual and corporate tax rates in the U.S. as he believes these will create bigger gaps in the country's budget .\n\"These measures have limited short-term impact,\" he said. \"Governments should look like companies in the fundamentals: So it's about infrastructure of a country; it's about education of the people in the country; it's about free trade; it's about a balanced budget.\"\n\"If the tax reform leads to higher budget deficits, it might be good for the next 12 months but there will be a bill later on,\" Appel told a panel in Switzerland.\nIn December, U.S. policymakers approved a new tax bill which saw the corporate tax rate drop from 35 percent to 21 percent and it's predicted to boost consumer spending and U.S. growth.\nOther CEOs welcomed the changes in the U.S. Speaking on the same panel, Tidjane Thiam, chief executive officer of Credit Suisse , said these were the boost that the global economy needed at this point in time.\nshow chapters Protectionism is not good for any business: Deutsche Post DHL Group CEO 13 Hours Ago | 02:56 \"I don't know if it's luck or skill, but certainly the tax reform in the U.S. has been exactly what we needed, something in the real economy, fundamental, to happen at this point in time, to give a new impetus to world growth,\" he said.\n\"I do believe the positive impacts of that are underestimated,\" he added, highlighting the recent deal between Nestle and Ferrero as an example of interest among the business community to invest in the U.S.\nHe added that \"there is a whole pipeline of similar transactions\" on the way.\nAppel from Deutsche Post said that only time will tell what the real impact of the tax changes will be but he doesn't believe that one country can reduce taxes, when it has a huge deficit.\nThe latest data from the Treasury Department showed that the U.S. budget gap increased to $225 billion between October and December — even before the tax cuts had materialized.\nHowever, Thiam is not worried because the U.S. economy is not like others.\n\"The U.S. is a completely different economy, it's in a unique position, which is that the rest of the world is willing to fund its deficit,\" he said.\nFollow CNBC International on Twitter and Facebook .", "external_links": [], "published": "2018-01-23T12:01:00.000+02:00", "crawled": "2018-01-23T12:02:25.000+02:00", "highlightTitle": ""}