{"organizations": [], "uuid": "c7bffde9cb50fe00919638bcd1ee3cb930207991", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224083327&w=1200&r=LYNXMPEE0L0J0", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-halep/tennis-halep-ends-osakas-run-to-reach-quarter-finals-idUSKBN1FB0RB", "country": "US", "domain_rank": 408, "title": "Tennis: Halep ends Osaka's run to reach quarter-finals", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T09:55:00.000+02:00", "replies_count": 0, "uuid": "c7bffde9cb50fe00919638bcd1ee3cb930207991"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-halep/tennis-halep-ends-osakas-run-to-reach-quarter-finals-idUSKBN1FB0RB", "ord_in_thread": 0, "title": "Tennis: Halep ends Osaka's run to reach quarter-finals", "locations": [], "entities": {"persons": [{"name": "halep", "sentiment": "negative"}, {"name": "simona halep", "sentiment": "none"}, {"name": "naomi osaka", "sentiment": "none"}], "locations": [{"name": "osaka", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - World number one Simona Halep shook off a sleepless night racked with ankle pain to sweep past rising Japanese star Naomi Osaka and into the Australian Open quarter-finals with a 6-3 6-2 victory on Monday.\nThe scoreline did not reflect the whole story, however, as the Romanian was given a real fight early on by a 20-year-old tipped to become the next big thing in women’s tennis.\nThe courageous Halep coaxed her sore ankle ligaments through a three-set marathon against her previous opponent Lauren Davis on Saturday but the effort left her miserably sore on the evening before her showdown against Osaka.\n”Last night was really tough. I couldn’t sleep. I had pain everywhere,“ she told reporters. ”But I slept before the match two hours and it worked perfect. I was, like, fresh after that. I felt good.\n“Ankle is still sore. But, you know, I‘m not thinking about that any more.”\nHaving battled through three hours and 44 minutes of graft against American Davis, the 79-minute workout against Osaka was a holiday by comparison as the Romanian continues her bid for a maiden grand slam title.\nTennis - Australian Open - Margaret Court Arena, Melbourne, Australia, January 22, 2018. Simona Halep of Romania shakes hands with Naomi Osaka of Japan after Halep won their match. REUTERS/Thomas Peter She was under immense pressure in the opening stages against Osaka, however, as her 72nd-ranked opponent blazed away to set up numerous break points.\nHalep displayed her usual resilience to save four of them in an intense game at 2-3 that featured six deuces, and it proved to be a turning point.\nSlideshow (3 Images) She began to feed off Osaka’s errors and broke twice on her way to taking the opener as the storm on the other side of the net blew itself out.\nOsaka’s spirit ebbed away in the second set and after establishing a 5-2 lead, Halep crunched a forehand return winner to seal victory and reach the last eight for the third time.\n”Actually I didn’t expect to do quarter-finals,“ Halep added. ”I didn’t expect also to stop (playing) the tournament, even if I was injured. I had nothing clear in my head. I just went on court, take (it) match by match.\n“The match against Davis was huge for me, maybe gave me a little bit more confidence that my body is okay and I can resist to the tough matches. Now I‘m more confident.”\nHalep will meet the winner of all-Czech fourth-round clash between Barbora Strycova and Karolina Pliskova as she bids for a maiden semi-final at Melbourne Park.\nEditing by Peter Rutherford/John O'Brien\n ", "external_links": [], "published": "2018-01-22T09:55:00.000+02:00", "crawled": "2018-01-22T10:15:26.000+02:00", "highlightTitle": ""}