{"organizations": [], "uuid": "2b71420d848940ec9aac29e48905d38ef8bf597d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-catalysis-announces-board-and-executive-leadership-changes.html", "country": "US", "domain_rank": 767, "title": "Catalysis Announces Board and Executive Leadership Changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:05:00.000+02:00", "replies_count": 0, "uuid": "2b71420d848940ec9aac29e48905d38ef8bf597d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-catalysis-announces-board-and-executive-leadership-changes.html", "ord_in_thread": 0, "title": "Catalysis Announces Board and Executive Leadership Changes", "locations": [], "entities": {"persons": [{"name": "lean transf", "sentiment": "negative"}, {"name": "toussaint", "sentiment": "none"}, {"name": "walter rugland", "sentiment": "none"}, {"name": "john toussaint", "sentiment": "none"}, {"name": "rugland", "sentiment": "none"}, {"name": "walt", "sentiment": "none"}, {"name": "walt rugland", "sentiment": "none"}], "locations": [{"name": "wis.", "sentiment": "none"}, {"name": "appleton", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "catalysis announces board", "sentiment": "negative"}, {"name": "inc.", "sentiment": "none"}, {"name": "faithlife financial in canada", "sentiment": "none"}, {"name": "wisconsin historical foundation", "sentiment": "none"}, {"name": "fox cities performing arts center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Helping Healthcare Executives Create Healthcare Value Through Operational Excellence and Lean Transformation Remains a Strategic Priority\nAPPLETON, Wis.--(BUSINESS WIRE)-- Catalysis today announced a restructuring of its executive team and the retirement of the organization’s board chair, Walter Rugland. The management changes are designed to enable Catalysis to better serve healthcare executives in North America and around the world as they seek to transform their organizations through continuous improvement and lean methodologies.\nCatalysis began 2018 with a change in board leadership. Chairperson duties transitioned to Dr. John Toussaint who replaces Walt Rugland. Rugland served on the Catalysis board since co-founding the organization with Dr. Toussaint in 2008. Rugland was the non-executive chairman of ThedaCare, Inc., until 2008. He currently serves as a director of FaithLife Financial in Canada and is vice president of the Wisconsin Historical Foundation. Rugland also is a director and secretary/treasurer of the board of the Fox Cities Performing Arts Center.\n“Walt’s leadership was instrumental in our success as an organization and we thank him for his service and counsel,” said Toussaint. “I look forward to serving as board chair while also continuing to help guide the strategic direction of Catalysis, coach healthcare executives around the world, co-lead the development of a European network, write and publish, and speak at conferences and events.”\nDr. Toussaint is one of the foremost figures in the adoption of lean principles in healthcare. Under his leadership, Catalysis has launched peer-to-peer learning networks, developed in-depth workshops, and created learning tools designed to help healthcare executives adopt lean methods for their health systems.\nKim Barnas has been named chief executive officer at Catalysis, a role previously held by Toussaint. In this role, Ms. Barnas will provide day-to-day guidance designed to drive the organization’s strategic growth. She also will continue her executive coaching efforts and publish books and industry-leading articles on operational excellence (lean) and the role of leadership. Ms. Barnas joined Catalysis in 2014 as president. Previously she served as senior vice president at ThedaCare, and as President of Theda Clark Medical Center and Appleton Medical Center. She is also the author of Beyond Heroes: A Lean Management System for Healthcare.\nHelen Zak, who previously served Catalysis as chief development officer, has been named President, Europe. In 2017, Europe quickly emerged as a region of new growth for Catalysis. Ms. Zak will develop the Catalysis business in Europe by building a peer-to-peer network to support healthcare executives there who seek advice and collaborative help implementing lean methodologies. Ms. Zak has 32 years of lean leadership experience across a wide range of industries, including automotive, capital equipment and high tech. Prior to joining Catalysis, she served as COO of the Lean Enterprise Institute for 11 years. In October 2017, Ms. Zak was inducted into the Association for Manufacturing Excellence Hall of Fame.\nIn 2017, Peter Mariahazy was named chief administrative officer at Catalysis. In this role he is responsible for financial administration, human resources, operational activity and support, succession planning, talent management, organizational and performance management, training and development, and compensation. Prior to joining Catalysis, he managed technology and human resources, as well as operations management at Modern Business Machines, a Xerox Company (MBM).\n“Strategically, we continue to serve as a healthcare thought leader and innovator, educating healthcare executives about operational excellence and lean methods designed to create healthcare value from the patient perspective,” said Barnas. “The changes we have announced are a natural evolution of Catalysis and we are confident these changes will help us achieve our mission.”\nAbout Catalysis\nCatalysis inspires healthcare leaders and accelerates change. With a focus on experiential education, Catalysis helps healthcare leaders in the United States and Europe create system-wide, transformative change. We believe in care delivery designed around the patient, payment and incentives based on value and outcomes, and transparency of performance (quality and cost). Founded in 2008, Catalysis is a not for profit with a mission to help create more healthcare value in the industry. Learn more at: createvalue.org .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005462/en/\nCatalysis\nSara Thompson, 920-659-7461\nsthompson@createvalue.org\nSource: Catalysis", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.createvalue.org%2F&esheet=51743337&newsitemid=20180116005462&lan=en-US&anchor=Catalysis&index=1&md5=d503c9909c746fb911de6a9bc4fbee34", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fcreatevalue.org%2F&esheet=51743337&newsitemid=20180116005462&lan=en-US&anchor=createvalue.org&index=2&md5=68e95b8138764b113f7656f620ea422c", "http://www.businesswire.com/news/home/20180116005462/en/"], "published": "2018-01-16T17:05:00.000+02:00", "crawled": "2018-01-16T18:22:02.001+02:00", "highlightTitle": ""}