{"organizations": [], "uuid": "0dd8d77fa4b05189c9e8c21d61fe030184a45f7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/15/the-associated-press-trump-has-kept-many-promises-during-his-first-year-in-office.html", "country": "US", "domain_rank": 767, "title": "has kept many promises during his first year in office", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T07:26:00.000+02:00", "replies_count": 0, "uuid": "0dd8d77fa4b05189c9e8c21d61fe030184a45f7f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/15/the-associated-press-trump-has-kept-many-promises-during-his-first-year-in-office.html", "ord_in_thread": 0, "title": "has kept many promises during his first year in office", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) —   often brags that he's done more in his first year in office than any other president. That's a spectacular stretch.\nBut while he's fallen short on many measures and has a strikingly thin legislative record, Trump has followed through on dozens of his campaign promises, overhauling the country's tax system, changing the U.S. posture abroad and upending the lives of hundreds of thousands of immigrants.\nA year in, Trump is no closer to making Mexico pay for a border wall than when he made supporters swoon with that promise at those rollicking campaign rallies of 2016.\nHe's run into legislative roadblocks — from fellow Republicans, no less — at big moments, which is why the Obama-era health law survives, wounded but still insuring millions. His own administration's sloppy start explains why none of the laws he pledged to sign in his first 100 days came to reality then and why most are still aspirational.\nNevertheless, Trump has nailed the tax overhaul, his only historic legislative accomplishment to date, won confirmation of a conservative Supreme Court justice and other federal judges, and used his executive powers with vigor to slice regulations and pull the U.S. away from international accords he assailed as a candidate.\nCourts tied his most provocative actions on immigration and Muslim entry in knots, but illegal border crossings appear to be at historic lows.\nThe upshot? For all his rogue tendencies, Trump has shaped up as a largely conventional Republican president when measured by his promises kept and in motion.\nThe Twitter version of Trump may be jazzed with braggadocio about the size of his (nonexistent) nuclear button and his \"very stable genius.\" But the ledger of actions taken is recognizable to Washington: mainstream Republican tax cuts, pro-business policy (with exceptions on trade), curbs on environmental regulation and an approach to health care that's been in the GOP playbook for years.\nThat's as of today and this moment. With Trump, you never know about tomorrow.\nA look at some of his campaign promises and what's happened with them:\nTAXES\nTrump and congressional Republicans delivered on an overhaul that substantially lowers corporate taxes and cuts personal income taxes, as promised. It's sizable but not everything Trump said it would be, and it is more tilted to the wealthy than he promised or will admit. He promised a 15 percent tax rate for corporations and settled for 21 percent, still a major drop from 35 percent. He promised three tax brackets; there are still seven. He did not eliminate the estate tax or the alternative minimum tax as he said he would. Fewer people will be subject to those taxes, however, at least temporarily.\n\"Everybody is getting a tax cut, especially the middle class,\" he said in the campaign. Most will; some will pay more.\nTRADE\nTrump made good on his promise to withdraw the U.S. from the Trans-Pacific Partnership trade agreement and to reopen the North American Free Trade Agreement in search of a better deal.\nHe's let China off the hook, though, on his oft-repeated threat during the campaign to brand Beijing a currency manipulator, a step toward potentially hefty penalties on Chinese imports and a likely spark for a trade war.\n\"We're like the piggy bank that's being robbed,\" he said of the trade relationship, which has tipped even more in China's favor since. Trump now threatens trade punishment if China does not sufficiently cooperate in reining in North Korea.\nTrump promised to impose a 35 percent tariff on goods from U.S. companies that ship production abroad. He's not delivered on that. Instead, his tax plan aims to encourage companies to stay in the U.S. with the lower tax rate and to entice those operating abroad to come home by letting them repatriate their profits in the U.S. at a temporarily discounted rate. His approach so far is all carrot, no stick.\nIMMIGRATION\nCandidate Trump rocked the political landscape when he proposed a temporary ban on all non-U.S. Muslims entering the country. While he's long backed away from such talk, Trump has worked since his first days in office to impose new restrictions on tourists and immigrants, signing executive orders that would have made good on his anti-immigration promises had those orders not been blocked by courts.\nHe's now succeeded in banning the entry of citizens from several Muslim-majority countries and in severely curbing refugee admissions. He's tried to deny certain federal money for cities that refuse to cooperate with federal immigration authorities.\nTrump is now deep in negotiations over an immigration deal that could deliver on other promises, including money for the border wall with Mexico and overhauling the legal immigration system to make it harder for immigrants to sponsor their families. That's in exchange for extending protections for hundreds of thousands of young people brought to the country illegally as children. They are protections he once slammed as an \"illegal\" amnesty and pledged to end.\nMexico still isn't ponying up money for the wall.\nENERGY AND THE ENVIRONMENT\nTrump promised aggressive action on the energy front and has pursued that.\nHe announced his intention to take the U.S. out of the Paris climate-change accord. He gave swift approval to the Keystone XL and Dakota Access pipelines stalled by President Barack Obama, moved to shrink protected national monument lands in Utah and Arizona, and acted to lift restrictions on mining coal and coastal drilling for oil and natural gas.\nA provision in the new tax law opens the long-protected Arctic National Wildlife Refuge to drilling.\nAs other countries turn harder toward green energy, Trump is making fossil fuels the centerpiece of his drive toward energy independence — a benchmark that Obama closed in on during an era of surging natural gas development.\nHEALTH CARE\nProbably nothing exemplifies frustrated ambition more than the Obama health law Republicans have been trying to dismantle ever since it was enacted in 2010. Trump has declared it dead many times — he just never got around to killing it.\nHe made this overpromise in the campaign: \"My first day in office, I'm going to ask Congress to put a bill on my desk getting rid of this disastrous law and replacing it with reforms that expand choice, freedom, affordability. You're going to have such great health care at a tiny fraction of the cost. It's going to be so easy.\"\nThat hasn't happened.\nRepublicans took several runs at repealing and replacing the law last year, only to fall short. The December tax law, though, is knocking out a pillar. As of 2019, the requirement to carry health insurance or pay a fine will be gone.\nTrump has come out with a proposed regulation to promote the sale of health plans across state lines. The goal is to make it easier for associations to sponsor plans that are cheaper than Affordable Care Act policies but don't have to meet all consumer protection and benefit requirements of that law.\nInsurance industry groups, patient groups and some state regulators are wary of the idea and see little chance it can make more", "external_links": [], "published": "2018-01-15T07:26:00.000+02:00", "crawled": "2018-01-15T08:07:34.004+02:00", "highlightTitle": ""}