{"organizations": [], "uuid": "987af85ca730e4490d35eeecf1995b356a8c6226", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/14/104652404-damore-onetime.1910x1000.png", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/james-damore-files-class-action-lawsuit-against-google-for-discrimination.html", "country": "US", "domain_rank": 767, "title": "James Damore files class action lawsuit against Google for discrimination", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.625, "site_type": "news", "published": "2018-01-08T21:25:00.000+02:00", "replies_count": 0, "uuid": "987af85ca730e4490d35eeecf1995b356a8c6226"}, "author": "Jillian D'Onfro", "url": "https://www.cnbc.com/2018/01/08/james-damore-files-class-action-lawsuit-against-google-for-discrimination.html", "ord_in_thread": 0, "title": "James Damore files class action lawsuit against Google for discrimination", "locations": [], "entities": {"persons": [{"name": "james damore", "sentiment": "negative"}, {"name": "damore", "sentiment": "none"}], "locations": [], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "santa clara superior court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "James Damore, the Google engineer who was fired after his internal memo criticizing the company's diversity efforts went viral, has filed a proposed class-action lawsuit against the company.\nDamore's original memo, which leaked last fall , criticized Google's culture as \"left leaning\" and argued that women in engineering were paid less than men because of their biological differences, not because of hiring practices, among other topics. It sparked a discussion about rampant sexism in Silicon Valley, and Google said that portions of the memo were contrary to the company's \"basic values\" and Code of Conduct.\nThe lawsuit, which was filed in the Santa Clara Superior Court on Monday, alleges that Google \"discriminated against employees for their perceived conservative political views,\" as well as due to their \"male gender\" and \"Caucasian race\" and then \"systematically punished\" them. David Gudeman — another former Google employee, who was fired in December 2016 — is also listed as a plaintiff. The suit alleges that he was fired for his comments on a coworker's thread about being targeted by the FBI for his religion.\nThe lawsuit seeks to represent all Google employees who have been discriminated against for being male, Caucasian or conservative and seeks monetary, non-monetary and punitive damages.\n\"Google employees who expressed views deviating from the majority view at Google on political subjects raised in the workplace and relevant to Google's employment policies and its business, such as 'diversity' hiring policies, 'bias sensitivity,' or 'social justice' were/are singled out, mistreated, and systematically punished and terminated from Google, in violation of their legal rights,\" the lawsuit states.\nThe suit also alleges that Google has \"open hostility for conservative thought,\" that Damore and others were \"ostracized, belittled and punished\" for their views, that the company is an \"ideological echo chamber\" that uses \"illegal hiring quotas\" at the expense of white males.\nThe lawsuit comes after Damore has spent the several months since his firing talking to press about discrimination and how Google \"betrayed\" him , including one conversation where he compared being a conservative at Google to \" being gay in the 1950s .\"\nDuring a press conference , Harmeet K. Dhillon, the lawyer representing the case, said that Google isn't the only company guilty of this kind of prejudice and that she hopes that the lawsuit will act as a wake-up call for Silicon Valley where the \"only acceptable form of discrimination\" is against \"conservatives and white men.\"\nMeanwhile, Google is also facing a class-action lawsuit for gender pay discrimination .\nGoogle did not immediately respond to a request for comment.\nRead the full document, on Scribd, here .", "external_links": [], "published": "2018-01-08T21:25:00.000+02:00", "crawled": "2018-01-08T21:27:14.016+02:00", "highlightTitle": ""}