{"organizations": [], "uuid": "19cfe396b599511e2452da5cae9215c7bfd2d103", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222441744&w=1200&r=LYNXMPEE0F108", "site_section": "http://feeds.reuters.com/reuters/topNews\r", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-security-senate-nielsen/homeland-security-chief-deporting-dreamers-not-top-priority-idUSKBN1F51RC", "country": "US", "domain_rank": 408, "title": "Homeland Security chief: Deporting 'Dreamers' not top priority", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:25:00.000+02:00", "replies_count": 0, "uuid": "19cfe396b599511e2452da5cae9215c7bfd2d103"}, "author": "", "url": "https://www.reuters.com/article/us-usa-security-senate-nielsen/homeland-security-chief-deporting-dreamers-not-top-priority-idUSKBN1F51RC", "ord_in_thread": 0, "title": "Homeland Security chief: Deporting 'Dreamers' not top priority", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "kirstjen nielsen", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "homeland security", "sentiment": "negative"}, {"name": "deferred action for childhood arrivals", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "cbs news", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "u.s. department of homeland security", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. Homeland Security Secretary Kirstjen Nielsen, under intense questioning from Democratic senators, said on Tuesday she did not hear President Donald Trump use a vulgarity to describe African countries during an impassioned White House meeting last week.\nNielsen’s testimony to the Senate Judiciary Committee echoed statements she has made since the meeting on Thursday with Trump and Republican and Democratic legislators, which roiled the debate on an immigration law deal and generated accusations of racism toward Trump.\nDemocratic Senator Dick Durbin, who attended the meeting, said Trump used the word “shithole” to describe African countries but Nielsen, also who participated in the meeting, said she did not hear that.\nIn one of the hearing’s most dramatic moments, Democratic Senator Cory Booker grew emphatic after Nielsen said she did not want to answer more questions about the language at the meeting.\n“When Dick Durbin called me I had tears of rage when I heard about this experience in this meeting,” Booker told her.\n“Your silence and your amnesia is complicity,” he said.\nTrump has said Durbin misrepresented his comments. Republican Senator Lindsey Graham, who also was at the meeting, issued a statement last week that did not dispute news accounts that Trump used the vulgarity to describe African countries. During the hearing Graham did not ask Nielsen about Trump’s comments, but described Durbin as a “decent, honest man.”\nNielsen said she did not remember Trump categorizing African countries in a specific way.\nFILE PHOTO: Activists demonstrate outside the New York office of Sen. Chuck Schumer (D-NY) to ask for the passage of a 'clean' Dream Act, one without additional enforcement or security, in New York, U.S., January 10, 2018. REUTERS/Lucas Jackson “The conversation was very impassioned. I don’t dispute that the president was using tough language,” Nielsen said, adding that several people in the room were using profanity.\nThe comments have complicated the debate over an immigration deal to protect immigrants who were brought to the country illegally as children, and also overshadowed larger spending negotiations ahead of a possible federal government shutdown this week.\nWhen asked about Trump’s reported statements about preferring immigrants from Norway, Nielsen said Trump was using Norway as an example of a country whose citizens work hard.\nNielsen also was asked about the administration’s decision to rescind Deferred Action for Childhood Arrivals, the Obama-era policy to protect from deportation immigrants brought to the United States illegally as children. Trump ended the program in September, giving Congress six months to find a permanent solution.\nNielsen said she did not believe Trump would have the authority to extend the March 5 deadline for the ending of the program. On Saturday, the Department of Homeland Security said it would resume accepting DACA renewals, after a federal judge blocked Trump’s decision to end the program.\nNielsen also testified about a DHS study on the link between immigration and terrorism. The report, issued on Tuesday, said about 73 percent of the 549 individuals convicted of “international terrorism-related” charges in U.S. federal courts between Sept. 11, 2001, and Dec. 31, 2016, were born outside the United States.\nIn a briefing call with reporters, a senior administration official pointed to the report as evidence that the United States needs to reform its immigration system, including to eliminate the diversity visa lottery and extended family-based immigration, in favor of high-skilled immigrants.\nBut the official said the administration was not ready to release statistical information on the manner of entry of the individuals convicted.\nReporting by Susan Heavey and Yeganeh Torbati; Editing by Bill Trott and Andrew Hay\n ", "external_links": [], "published": "2018-01-16T16:25:00.000+02:00", "crawled": "2018-01-16T16:39:07.028+02:00", "highlightTitle": ""}