{"organizations": [], "uuid": "10bc98eeaf09f83e7e6b722237bf6453217a24f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-massachusetts-lgbt-prison/massachusetts-asks-judge-to-toss-transgender-prison-inmates-lawsuit-idUSKBN1EU20C", "country": "US", "domain_rank": 408, "title": "Massachusetts asks judge to toss transgender prison inmate's lawsuit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T23:15:00.000+02:00", "replies_count": 0, "uuid": "10bc98eeaf09f83e7e6b722237bf6453217a24f0"}, "author": "", "url": "https://www.reuters.com/article/us-massachusetts-lgbt-prison/massachusetts-asks-judge-to-toss-transgender-prison-inmates-lawsuit-idUSKBN1EU20C", "ord_in_thread": 0, "title": "Massachusetts asks judge to toss transgender prison inmate's lawsuit", "locations": [], "entities": {"persons": [{"name": "scott malone", "sentiment": "none"}], "locations": [{"name": "massachusetts", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "min read  boston", "sentiment": "none"}, {"name": "state department of corrections", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ada", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 9:19 PM / Updated 2 minutes ago Massachusetts asks judge to toss transgender prison inmate's lawsuit Scott Malone 3 Min Read \nBOSTON (Reuters) - Massachusetts on Friday asked a federal judge to dismiss a lawsuit filed by a transgender woman who claimed the state is violating her rights by housing her in a men’s prison while she serves a three- to four-year sentence for a drug charge. \nThe woman sued the state Department of Corrections in federal court in Boston in November, claiming that it was violating her rights under the Americans with Disabilities Act (ADA) by refusing to house her with women and subjecting her to strip searches by male guards. \nThe state challenged those arguments, contending that the ADA specifically excludes transgender people from protection. It also said she did not show that the state denied her any services because of her gender dysphoria, noting that she is receiving treatment including counseling sessions, hormone therapy and facial hair removal. \nIt noted that the 53-year-old woman, whose name was not included in court paperwork, is being housed in a single-inmate cell at the medium-security MCI-Norfolk prison without a roommate. \n“Plaintiff’s complaint fails to plead any facts, and cannot demonstrate, that she was excluded from or denied a benefit or service by reason of her gender dysphoria,” the state argued in court papers. “Instead, the complaint focuses on alleged unlawful conditions of her confinement.” \nGender dysphoria is a medical condition where someone suffers distress because their gender identity does not match their body. \nAdvocates called the lawsuit the first of its kind filed in the state. \nA federal judge in Pennsylvania in May allowed a transgender woman to sue her employer under the ADA, citing the condition known as gender dysphoria, even though the disabilities law excludes transgender people from protection. The lawsuit has since been settled, according to federal court records. \nMassachusetts in 2016 passed a law banning discrimination against transgender people in public restrooms and other public buildings. \nThe woman, who was diagnosed with gender dysphoria decades ago, claimed in the lawsuit that she has been routinely groped by male guards during strip searches and is forced to shower in the presence of male inmates. \nThe woman is serving a three- to four-year sentence for possession of a Class A narcotic with intent to distribute. Reporting by Scott Malone; Editing by Jonathan Oatis", "external_links": [], "published": "2018-01-05T23:15:00.000+02:00", "crawled": "2018-01-05T23:29:07.004+02:00", "highlightTitle": ""}