{"organizations": [], "uuid": "69050dee38b20781b2cb0cd955529798a6fa82b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-cti-biopharma-provides-corporate-and-european-regulatory-update.html", "country": "US", "domain_rank": 767, "title": "CTI BioPharma Provides Corporate and European Regulatory Update", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.299, "site_type": "news", "published": "2018-01-26T00:40:00.000+02:00", "replies_count": 0, "uuid": "69050dee38b20781b2cb0cd955529798a6fa82b3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-cti-biopharma-provides-corporate-and-european-regulatory-update.html", "ord_in_thread": 0, "title": "CTI BioPharma Provides Corporate and European Regulatory Update", "locations": [], "entities": {"persons": [], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "delaware", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "cti biopharma provides corporate", "sentiment": "negative"}, {"name": "cti biopharma corp.", "sentiment": "negative"}, {"name": "european regulatory update", "sentiment": "negative"}, {"name": "cti", "sentiment": "negative"}, {"name": "cti biopharma", "sentiment": "none"}, {"name": "borsa italiana mta", "sentiment": "none"}, {"name": "european medicines agency", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE, Jan. 25, 2018 /PRNewswire/ -- CTI BioPharma Corp. (CTI BioPharma) (NASDAQ: CTIC) today announced that it has been reincorporated in the State of Delaware following a Special Meeting of Shareholders, triggering an automatic delisting of CTI's common stock from the Borsa Italiana MTA exchange. The Company also provided an update of the status of the Marketing Authorization Application of pacritinib to the European Medicines Agency (EMA).\nOn January 24, 2018, a Merger Agreement was approved by the Board of Directors and a majority of the votes cast at a Special Meeting of Shareholders of CTI BioPharma, with the sole purpose of changing the state of incorporation of CTI BioPharma Corp. from the State of Washington to the State of Delaware. The merger did not result in any change in the principal offices, business, management, capitalization, assets or liabilities of the Company. CTI BioPharma's common stock, par value $0.001 per share (the \"Common Stock\"), will continue to trade on Nasdaq and the Company's trading symbol remains as \"CTIC\".\nAdditionally, CTI BioPharma announced today that it was granted a three month extension for submitting its response to the Day 120 List of Questions (D120 LoQ) from the Committee for Medicinal Products for Human Use (CHMP) of the EMA, with regard to the Marketing Authorization Application (MAA) for pacritinib. As a result of the extension, the Company anticipates submitting its response to the D120 LoQ in May 2018. The Company primarily requested the extension in order to provide the EMA with new pharmacokinetic analyses that include data from the ongoing phase 2 PAC203 study. The MAA was originally submitted to the EMA in June 2017 based on data from the PERSIST-2 phase 3 study. The Day 120 LoQ were received by the Company in November 2017 and included Major Objections in areas including efficacy, safety (including hematological, cardiovascular and infectious toxicities) and other concerns including the size of the data set and the pharmacokinetic analyses of the two dosing regimens studied in PERSIST-2. The extension request was submitted following a clarification meeting with the rapporteur and co-rapporteur and members of the EMA.\nAbout CTI BioPharma Corp.\nCTI BioPharma Corp. is a biopharmaceutical company focused on the acquisition, development and commercialization of novel targeted therapies covering a spectrum of blood-related cancers that offer a unique benefit to patients and healthcare providers. CTI BioPharma has a late-stage development pipeline, including pacritinib for the treatment of patients with myelofibrosis. CTI BioPharma is headquartered in Seattle, Washington. For additional information and to sign up for email alerts and get RSS feeds, please visit www.ctibiopharma.com.\nForward-Looking Statements\nThis press release includes forward-looking statements, which are within the meaning of the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995, including statements regarding expectations with respect to receiving the milestone payment. Such statements are subject to a number of risks and uncertainties, the outcome of which could materially and/or adversely affect actual future results and the trading price of the issuers' securities, including risks related to the satisfaction of regulatory and other requirements; the actions of regulatory bodies and other governmental authorities; other clinical trial results; changes in laws and regulations; product quality, product efficacy, study protocol, data integrity or patient safety issues; product development risks; and other risks identified in each of the issuer's most recent filings on Forms 10-K and 10-Q and other Securities and Exchange Commission filings.\nCTI BioPharma Contacts:\nEd Bell\n+1 206-272-4345\nebell@ctibiopharma.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/cti-biopharma-provides-corporate-and-european-regulatory-update-300588585.html\nSOURCE CTI BioPharma Corp.", "external_links": ["http://www.prnewswire.com/news-releases/cti-biopharma-provides-corporate-and-european-regulatory-update-300588585.html"], "published": "2018-01-26T00:40:00.000+02:00", "crawled": "2018-01-26T01:39:18.000+02:00", "highlightTitle": ""}