{"organizations": [], "uuid": "1655cfb2da84f8c6e4e7b5f657da2ab263fd53f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223870269&w=1200&r=LYNXMPEE0K0H2", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-iran-iraq-kurdistan/irans-rouhani-says-wants-to-improve-ties-with-iraqi-kurds-idUSKBN1FA0MA", "country": "US", "domain_rank": 408, "title": "Iran's Rouhani says wants to improve ties with Iraqi Kurds", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T15:19:00.000+02:00", "replies_count": 0, "uuid": "1655cfb2da84f8c6e4e7b5f657da2ab263fd53f2"}, "author": "", "url": "https://www.reuters.com/article/us-iran-iraq-kurdistan/irans-rouhani-says-wants-to-improve-ties-with-iraqi-kurds-idUSKBN1FA0MA", "ord_in_thread": 0, "title": "Iran's Rouhani says wants to improve ties with Iraqi Kurds", "locations": [], "entities": {"persons": [{"name": "rouhani", "sentiment": "negative"}, {"name": "nechirvan barzani", "sentiment": "none"}, {"name": "hassan rouhani", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "kurdistan", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "islamic republic of iran", "sentiment": "none"}], "organizations": [{"name": "kurds reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "irna", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBAI (Reuters) - Iran’s President Hassan Rouhani on Sunday called for boosting relations with the Iraqi Kurdish region as part of a united Iraq, Iranian media reported, after ties were strained over an independence referendum in the area last year.\nThe call came during a visit by the semi-autonomous Kurdistan region’s Prime Minister Nechirvan Barzani, the first such high-level trip to Iran since last year’s Kurdish independence referendum which Iran strongly opposed.\nThe Kurdish referendum on Sept. 25, which produced an overwhelming “yes” for independence, angered Iraq’s central government and neighbours Iran and Turkey, which have their own restive Kurdish minorities.\n“President Rouhani stressed the historical and deep-rooted ties between the Islamic Republic of Iran and the Kurds of Iraq, and said all efforts should be made to strengthen the close relations between the two nations of Iran and Iraq,” the state news agency IRNA reported.\nAnalysts have said that Iran appeared to be the ultimate winner in the crisis triggered by the referendum. Tehran is widely believed to have backed Iraqi Prime Minister Haider al-Abadi in his offensive to recapture Kurdish held-areas, including the oil-rich city of Kirkuk.\nBarzani earlier met Ali Shamkhani, secretary of Iran’s Supreme National Security Council, who voiced concern over continued cross-borders raids by Iranian Kurdish rebels from Iraq’s Kurdish region.\n“We cannot tolerate that counter-revolutionary groups use Kurdish territory to assassinate our soldiers and citizens and return to the Kurdish region, and then take responsibility for these acts in official Kurdish media,” IRNA Quote: d Shamkani as saying.\nBarzani said: The “expansion of ties and cooperation between Iran and the Kurdistan region will not be affected by its opponents’ efforts, and we shall use all our power to prevent security threats against Iran,” IRNA added.\nSeveral armed Iranian Kurdish opposition groups operate from bases in Iraq’s remote mountainous north and launch sporadic raids into Iran.\nReporting by Dubai newsroom; Editing by Matthew Mpoke Bigg\n ", "external_links": [], "published": "2018-01-21T15:19:00.000+02:00", "crawled": "2018-01-21T15:34:30.000+02:00", "highlightTitle": ""}