{"organizations": [], "uuid": "5c27a0976a5f3327a64e29faacadd59c7495853e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/15/104946470-GettyImages-78991574.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/15/detroit-auto-show-may-be-celebrating-an-era-about-to-end.html", "country": "US", "domain_rank": 767, "title": "Detroit Auto Show May Be Celebrating an Era About to End", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:01:00.000+02:00", "replies_count": 0, "uuid": "5c27a0976a5f3327a64e29faacadd59c7495853e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/15/detroit-auto-show-may-be-celebrating-an-era-about-to-end.html", "ord_in_thread": 0, "title": "Detroit Auto Show May Be Celebrating an Era About to End", "locations": [], "entities": {"persons": [{"name": "mike jackson", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "detroit auto show", "sentiment": "negative"}, {"name": "new york times", "sentiment": "none"}, {"name": "autonation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT — Automakers have reason to celebrate as they gather this week at the Detroit auto show to unveil the new range of brawny trucks, high-tech cars and rugged sport-utility vehicles that will arrive in showrooms in the months ahead.\nThey just ended 2017 with sales in the United States topping 17 million vehicles for the third year in a row, the best three-year stretch the industry has ever experienced.\nSpurred by low gasoline prices, Americans are snapping up trucks and sport-utility vehicles, which generate fat profits for manufacturers. The American economy remains strong, with unemployment low and interest rates modest.\nMore from The New York Times:\nAt the Auto Show in Detroit, a Sneak Peek at What's New\nCar Sales End a 7-Year Upswing, With More Challenges Ahead\nLuxury Cars Offer More Models, but Find Fewer Buyers\n\"It's going to be a very good year in 2018,\" said Mike Jackson, chief executive of AutoNation, the nation's largest auto retailer.\nBut a closer look suggests that the industry may be headed for choppier waters than the hoopla in Detroit would indicate. While sales are healthy, consumers are actually buying fewer new vehicles. Purchases by individual customers at dealerships — known as retail sales and considered the most accurate reflection of demand — declined slightly in both 2016 and 2017. Some automakers are offsetting lower consumer purchasing by selling more cars to fleets like rental-car companies.\nMore worrisome is that the drops in retail sales have come even as manufacturers have resorted to heftier discounts, which eat into their profits. Sales incentives are now equal to more than 11 percent of the average vehicle's sticker price. As recently as 2014, that figure was below 8 percent.\nBryan Mitchell | Getty Images Part of the overall show floor seen during the press preview days at the North American International Auto show January 14, 2008 at Cobo Center in Detroit, Michigan. The NAIAS is the world's largest auto show. There are other troubling signs, too. Interest rates have started rising, which increases the cost of financing or leasing a new car. Younger buyers are showing less interest in owning cars than older generations. And the supply of low-mileage used cars is growing, giving shoppers attractive and lower-cost alternatives to new cars. Close to four million leased vehicles will be turned in and offered for sale as used models this year, up from 3.6 million in 2017.\n\"There's a lot of headwinds out there,\" said Mark Wakefield, global head of the automotive and industrial practice at Alix Partners, a consulting firm.\nThe auto industry has a long history of going from boom to bust — periods of rising sales and buoyant profits followed by inevitable sales slumps that leave idle plants and mounting losses. The last bust coincided with the 2008 financial crisis and nearly ruined Detroit. General Motors and Chrysler had to be saved by federally engineered bankruptcy proceedings.\nNow analysts are now wondering if harder times are arriving again.\nshow chapters Months or years to recover customer confidence: VW's Diess 12 Hours Ago | 02:55 Alix is forecasting a moderate drop in sales this year, followed by steeper declines in 2019 and 2020. In both of those years, Alix believes sales will fall short of 16 million cars and trucks.\nThis uncertainty comes as manufacturers are adding factories. BMW and Audi are finishing new plants in Mexico. Volvo's new plant in South Carolina will start building luxury sedans this year. Toyota Motor is adding a new truck plant in Mexico and just announced it would build a car factory with Mazda Motor in Alabama. Fiat Chrysler Automobiles is ramping up a plant in Michigan that had been idle for more than two years, after retooling it to make pickup trucks instead of cars. Fiat Chrysler has also just expanded Jeep plants in Ohio and Illinois.\nThe industry runs into trouble when automakers get stuck producing more vehicles than customers are willing to buy, said Ron Harbour, an auto manufacturing expert at Oliver Wyman, another consulting firm.\nHe added that one part of the industry was already in considerable distress — the car business. With Americans flocking to roomy vehicles like S.U.V.s, sales of family sedans and compacts have plunged in the last few years. Family cars like the Toyota Camry used to make up 25 percent of all new-vehicle sales. Now they account for just 15 percent.\nAs a result, some manufacturers are seeing a split in their operations. While running truck factories almost around the clock, they have been idling workers, cutting shifts or slowing assembly lines at their car plants. Ford , Toyota , Honda and Hyundai all cut output at car plants by 10 percent to 22 percent last year, according to data compiled by Automotive News. G.M. cut production by about 33 percent at its Lordstown, Ohio, plant, which makes the slow-selling Chevrolet Cruze compact. In Oshawa, Ontario, G.M.'s large-sedan factory lowered production by almost half.\n\"I wouldn't be surprised to see a car plant close in the next few years,\" if auto sales fall below 16 million vehicles a year as forecast, Mr. Harbour said. \"Somebody's going to have to bite the bullet.\"\nDan Ammann, G.M.'s chief financial officer, declined to give an outlook for the company's car plants for 2018. \"Our overall approach is to match production to demand,\" he said. \"So we'll see where demand is and act accordingly.\"\nThe last permanent shutdown of an auto plant in the United States occurred in 2016 when Mitsubishi Motors shuttered a factory in Normal. Ill. Before that, Ford closed a truck plant in St. Paul, Minn., in 2011.\nshow chapters Pickup trucks the stars at the Detroit auto show 20 Hours Ago | 02:52 Trouble could mount if any automakers resort to further incentives to gain market share and avoid production cuts, a strategy G.M. , Ford and Chrysler employed in the 2000s. All ended up reporting huge losses.\nIn the past week, executives from Honda, Subaru and other companies have acknowledged they aim to gain market share even though the market is likely to shrink.\n\"The two things to watch are crazy incentives and overproduction,\" Mr. Jackson, the AutoNation chief executive. \"They're ruinous.\"\nOne factor that could mitigate any difficulties in car manufacturing is the outsized profits that companies are earning on trucks, which now make up two-thirds of all new vehicles sold. \"The high mix of trucks is going to keep profits at near-record levels, and that's going to help them get through this downturn on the car side,\" Mr. Jackson said.\nHe also noted that G.M., Ford and Fiat Chrysler streamlined their operations over the past 10 years and were now better able to withstand shocks to their operations.\nAt the Detroit auto show, which opens to the media and industry visitors on Monday, the new models being presented reflect the industry's focus on trucks. Three of the most anticipated new models are pickups: the Chevrolet Silverado, the Ram 1500 from Fiat Chrysler, and the Ford Ranger. Other vehicles to be unveiled include the Mercedes-Benz G-Class S.U.V., the Honda Insight hybrid, the Toyota Avalon and the Acura RDX.\nThis year's event has less buzz than in recent years, perhaps because of the industry's uncertain outlook. Several auto brands, including Audi, Cadillac, Chrysler and Lincoln, are not presenting any new vehicles, and Porsche, Jaguar and Land Rover aren't even attending the show.", "external_links": [], "published": "2018-01-15T16:01:00.000+02:00", "crawled": "2018-01-15T16:19:28.029+02:00", "highlightTitle": ""}