{"organizations": [], "uuid": "3adc2d101e66fd2fe0a14d21224e093854fee49c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-bonds/chinas-money-rates-rise-as-quarterly-tax-time-approaches-idUSL8N1P70CA", "country": "US", "domain_rank": 408, "title": "China's money rates rise as quarterly tax-time approaches", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T07:30:00.000+02:00", "replies_count": 0, "uuid": "3adc2d101e66fd2fe0a14d21224e093854fee49c"}, "author": "", "url": "https://www.reuters.com/article/china-bonds/chinas-money-rates-rise-as-quarterly-tax-time-approaches-idUSL8N1P70CA", "ord_in_thread": 0, "title": "China's money rates rise as quarterly tax-time approaches", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}], "organizations": [{"name": "shanghai interbank", "sentiment": "none"}, {"name": "pboc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "people's bank of china", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 5:31 AM / Updated an hour ago China's money rates rise as quarterly tax-time approaches Reuters Staff 6 Min Read \nSHANGHAI, Jan 12 (Reuters) - China's primary money rates ended the week higher despite a net injection of liquidity this week as demand for cash rises ahead of a period when quarterly tax payments are due. The volume-weighted average rate of the benchmark seven-day repo traded in the interbank market, considered the best indicator of general liquidity in China, was 2.8702 percent on Friday. That's 18.4 basis points higher than the previous week's closing average of 2.6860 percent. The Shanghai Interbank Offered Rate (SHIBOR) for the same tenor rose to 2.8640 percent, 11.9 basis points higher than the previous week's close at 2.745 percent. The one-day or overnight rate stood at 2.8226 percent, and the 14-day repo stood at 3.9816 percent. On Friday, the People's Bank of China (PBOC) injected 270 billion yuan ($41.66 billion) into money markets through seven-day and 14-day reverse bond repurchase agreements. Net injections through open market operations this week totalled 40 billion yuan, compared with a net drain of 510 billion yuan the previous week. Citing what it called \"appropriate\" liquidity levels in the banking system, the PBOC skipped open market operations for 12 consecutive trading days through Jan. 10. But analysts said that rising demand for cash was leading to increased tightness in the market. \"As we step into the tax payment period, liquidity conditions may turn from relaxed to tight,\" CIB Research analysts said in a note, adding that they expect conditions to remain tight into next week. Financial institutions are set to make October-December tax payments, required reserve payments and other regulatory payments in mid-January. Adding to the drain on liquidity, two batches of medium-term lending facility (MLF) loans worth a total of 289.5 billion yuan mature in January. The first batch, worth 182.5 billion yuan, is due Jan. 13. During the week that starts on Jan. 15, maturing reverse bond repurchase agreements will drain 470 billion yuan. Key money rates at a glance: Volume-wei Previous Change (bps) Volume ghted day (%) average rate (%) Interbank repo market Overnight 2.8226 2.8396 -1.70 0.00 Seven-day 2.8702 2.9376 -6.74 0.00 14-day 3.9816 3.8536 +12.80 0.00 Shanghai stock exchange repo market Overnight 2.9700 2.3750 +59.50 175,739.2 0 Seven-day<CN7DR 3.3200 3.3650 -4.50 33,434.10 PO=SS> 14-day 3.8100 3.7400 +7.00 4,984.70 PBOC Guidance Rates Overnight 2.8500 2.8500 +0.00 <CN1DRPFIX=CFXS > Seven-day 3.4500 3.4900 -4.00 <CN7DRPFIX=CFXS > 14-day 4.0000 3.9000 +10.00 <CN14DRPFIX=CFX S> SHANGHAI INTERBANK OFFERED RATE Overnight 2.8300 2.8320 -0.20 Seven-day 2.8640 2.8320 +3.20 Three-month 4.6791 4.6701 +0.90 KEY INTEREST RATE SWAPS: Instrument RIC Rate Spread vs 1 yr official deposit rate* 2 yr IRS based on 1 CNABAD2YF= 0.0000 -1.5 year benchmark 5 yr 7-day repo swap CNYQB7R5Y= 3.9900 n/a *This spread can be seen as a proxy for forward-looking market expectations of an interest rate cut or rise China FX and money market guide: China debt market guide: SHIBOR rates: Reports on central bank open market operations: New Chinese debt issues: Prices for central bank bills, treasury bonds and sovereign bonds: Overview of China financial market data: ($1 = 6.4815 Chinese yuan) (Reporting by Andrew Galbraith; Editing by Richard Borsuk)", "external_links": [], "published": "2018-01-12T07:30:00.000+02:00", "crawled": "2018-01-12T08:54:52.044+02:00", "highlightTitle": ""}