{"organizations": [], "uuid": "af944c99286df2a115514b1e3b3fd42675a3dca7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218796202&w=1200&r=LYNXMPEE010FG", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/us-eurozone-bonds/new-year-jitters-for-bond-markets-as-ecb-cuts-back-stimulus-idUSKBN1ER0UL", "country": "US", "domain_rank": 408, "title": "New year jitters for bond markets as ECB cuts back stimulus", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T20:03:00.000+02:00", "replies_count": 0, "uuid": "af944c99286df2a115514b1e3b3fd42675a3dca7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-eurozone-bonds/new-year-jitters-for-bond-markets-as-ecb-cuts-back-stimulus-idUSKBN1ER0UL", "ord_in_thread": 0, "title": "New year jitters for bond markets as ECB cuts back stimulus", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Borrowing costs across the euro area shot higher on Tuesday as a cut in monthly ECB asset purchases became a reality, with hawkish comments from a top official and strong data hurting sentiment towards bonds on the first trading day of the year.\nPeripheral bonds markets, the biggest beneficiaries of European Central Bank stimulus, bore the brunt of the selling. Yields in Italy, Spain and Portugal rose 6-7 basis points each, widening the gap over German peers.\nBut even “core” or top-rated bond markets were left unscathed from the selling pressure, with Germany’s 10-year bond yield hitting two-month highs.\nBenoit Coeure, the Frenchman in charge of carrying out the ECB’s bond purchases, sees “a reasonable chance” the 2.55 trillion euro stimulus program will not be extended again when it expires in September, he told a Chinese financial magazine at the weekend.\nThe comments highlight that the days of extraordinary monetary stimulus are nearing an end given stronger economic conditions and signs of a pick-up in inflation.\nData on Friday showed inflation in Germany, Europe’s biggest economy, hit its highest level in five years in 2017. A survey on Tuesday showed euro zone manufacturers ended 2017 by ramping up activity at the fastest pace in more than two decades.\nECB monthly bond purchases, which have long underpinned bond yields, have fallen to 30 billion euros from 60 billion euros.\nThat cut in purchases from the start of January, unveiled in October, comes just as investors brace for a hefty month of supply -- a potentially powerful headwind for bond markets.\n“While the cut in ECB asset purchases is not a surprise, there is some uncertainty as to how the markets will adjust to this in an unusually heavy month for supply,” said Rainer Guntermann, a rates strategist at Commerzbank in Frankfurt.\n“The more hawkish commentary from the ECB is also weighing on markets.”\nGermany’s 10-year bond yields rose 2.5 basis points to 0.46 percent DE10YT=TWEB, the highest since late October. German 30-year bond yields jumped almost 5 bps to 1.31 percent DE30YT=RR, their highest since mid-November.\nIn Italy, where borrowing costs rose last week after the president called a general election for March 4, 10-year bond yields IT10YT=TWEB extended their rise to a two-month high just above 2 percent.\nThat pushed that gap over German equivalents to around 163 bps, its widest in more than two months. Spanish and Portuguese bond spreads also widened against Germany in a sign that investors were reducing their exposure to southern European bond markets.\n“The widening in peripheral spreads shows that the market is concluding that the recent spread tightening is inconsistent with a more hawkish ECB,” said Peter Chatwell, head of rates strategy at Mizuho.\nAnalysts said Portuguese five-year bonds were also coming under pressure from expectations of a syndicated bond deal of this maturity next week.\nMost other euro zone bond yields were up 2-3 basis points, with trade subdued after Monday’s New Year’s holiday. There was also some caution ahead of the implementation on Jan. 3 of the wide-ranging EU financial markets directive known as MiFID II.\nTo view a graphic on Peripheral bond spreads widening, click: reut.rs/2CGwOXW\nReporting by Dhara Ranasinghe; Additional reporting by Fanny Potkin; Editing by Catherine Evans\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://reut.rs/2CGwOXW"], "published": "2018-01-02T20:03:00.000+02:00", "crawled": "2018-01-02T18:16:27.007+02:00", "highlightTitle": ""}