{"organizations": [], "uuid": "e7cc407cc0626ae97965326ca4280c461ca5a26d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220120636&w=1200&r=LYNXMPEE060Q5", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-apple-shareholders-children/apple-should-address-youth-phone-addiction-say-two-large-investors-idUKKBN1EW0WS", "country": "US", "domain_rank": 408, "title": "Apple says it looks out for kids, as investors cite phone 'addiction'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T04:04:00.000+02:00", "replies_count": 0, "uuid": "e7cc407cc0626ae97965326ca4280c461ca5a26d"}, "author": "", "url": "https://uk.reuters.com/article/us-apple-shareholders-children/apple-should-address-youth-phone-addiction-say-two-large-investors-idUKKBN1EW0WS", "ord_in_thread": 0, "title": "Apple says it looks out for kids, as investors cite phone 'addiction'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 11:58 PM / Updated 4 hours ago Apple says it looks out for kids, as investors cite phone 'addiction' Elizabeth Dilts 3 Min Read \nNEW YORK (Reuters) - Apple Inc said it “has always looked out for kids”, defending its technology policy for children, after two major investors urged it to address what they said was a growing problem of young people getting addicted to Apple’s iPhones. Customers arrive to purchase an iPhone X at an Apple store in New York, U.S., November 3, 2017. REUTERS/Lucas Jackson \nShareholders Jana Partners, a leading activist shareholder, and California teacher pension investor CalSTRS, one of the nation’s largest public pension plans, delivered a letter to Apple on Saturday asking the company to consider developing software that would allow parents more options to limit children’s phone use. \nJana and CalSTRS also asked Apple to study the impact of excessive phone use on mental health. They said they own about $2 billion of Apple stock. \nApple on Monday said that since 2008 the iPhone’s software has allowed parents to control which apps, movies, games and other content children can access. \n“We think deeply about how our products are used and the impact they have on users and the people around them,” Apple said in the statement. “We take this responsibility very seriously and we are committed to meeting and exceeding our customers’ expectations, especially when it comes to protecting kids.” FILE PHOTO: An Apple Store staff shows Apple's new iPhones X after they go on sale at the Apple Store in Regents Street, London, Britain, November 3, 2017. REUTERS/Peter Nicholls/File Photo \nIt said it had new features in the works to make tools more robust. \nThe social rights issue is a new turn for Jana, which is known for pushing companies it invests in to make financial changes. FILE PHOTO: Boxes of iPhone X are pictured during its launch at the Apple store in Singapore, November 3, 2017. REUTERS/Edgar Su/File Photo \nHowever, the issue of phone addiction among young people has become a growing concern in the United States as parents report their children cannot give up their phones. CalSTRS and Jana worry that “even” Apple’s reputation could be hurt if it does not address those concerns. Their letter was originally reported by the Wall Street Journal. \nHalf of teenagers in the United States feel like they are addicted to their mobile phones and report feeling pressure to immediately respond to phone messages, according to a 2016 survey of children and their parents by Common Sense Media. \nThe phone addiction issue got a high-profile boost from the former Disney child star Selena Gomez, 24, who said she canceled a 2016 world tour to go to therapy for depression and low self-esteem, feelings she linked to her addiction to social media and the mobile photo-sharing app Instagram. Reporting by Elizabeth Dilts in New York, Stephen Nellis and Peter Henderson in San Francisco; Editing by Lisa Shumaker", "external_links": [], "published": "2018-01-09T04:04:00.000+02:00", "crawled": "2018-01-09T09:38:46.835+02:00", "highlightTitle": ""}