{"organizations": [], "uuid": "e735772ea9e2542dbec3900be40af9635ad1139c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-alex-barker-principal-joins-sullivancotters-employee-workforce-practice.html", "country": "US", "domain_rank": 767, "title": "Alex Barker, Principal, Joins SullivanCotter's Employee Workforce Practice", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:42:00.000+02:00", "replies_count": 0, "uuid": "e735772ea9e2542dbec3900be40af9635ad1139c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-alex-barker-principal-joins-sullivancotters-employee-workforce-practice.html", "ord_in_thread": 0, "title": "Alex Barker, Principal, Joins SullivanCotter's Employee Workforce Practice", "locations": [], "entities": {"persons": [{"name": "sullivan", "sentiment": "negative"}, {"name": "alex barker", "sentiment": "negative"}, {"name": "alex", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "cotter and associates, inc.", "sentiment": "neutral"}, {"name": "employee workforce practice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Jan. 18, 2018 /PRNewswire-USNewswire/ -- Sullivan, Cotter and Associates, Inc., the nation's leading independent consulting firm in the assessment and development of total rewards programs and workforce solutions for the health care industry and not-for-profit sector, welcomes Alex Barker, Principal, to the firm's Employee Workforce Practice.\nAlex is an innovative industry leader with more than 20 years of experience in the strategic management of health care operations. Having held leadership positions at some of the nation's largest hospitals and health systems, Alex is well-positioned to help clients navigate the rapidly changing health care environment as payment models evolve and organizations take on more risk. With direct insight into how large and operationally complex organizations are aligning their compensation and benefits programs as the industry continues its shift from volume to value, Alex specializes in the development of integrated total reward programs for employees at all levels.\n\"With strategic, value-based goals such as improved quality, access, service and affordability, organizations must look beyond physicians as the only drivers of clinical performance. Understanding how to better support key organizational goals across all segments of the health care workforce is critical. Alex's unique combination of experience in the executive, provider and employee workforces is rare, and will be a great asset to our clients as they look to implement a more holistic approach to aligning compensation and performance across the board,\" said Ted Chien, President and CEO, SullivanCotter.\nAlex also has an impressive range of additional experience that will help him to better assist clients, including governance, operational due diligence, post-merger integration and alignment, workforce resource planning and recruitment, onboarding and retention strategy.\nAlex joins the firm from his previous role as a Senior Client Partner in Korn Ferry Hay Group's Physician Compensation and Governance Practice. Prior to this, he served as the VP of Compensation, Benefits and Physician Services at Lahey Health, where he was responsible for managing both provider and non-provider total reward programs for the entire system.\nAbout SullivanCotter\nSullivanCotter is the leading independent consulting firm in the assessment and development of performance-based total rewards programs and workforce solutions for the health care industry and not-for-profit sector. For 25 years, the firm has provided unbiased advice to executives and boards to help attract, retain and motivate executives, physicians, advanced practice clinicians and employees at all levels. Through the Center for Information, Analytics and Insights, SullivanCotter has developed the most widely recognized compensation surveys in the United States. Combining data-driven intelligence with national insights, we act with integrity to help organizations fulfill their missions, business objectives and regulatory requirements.\nContact: Becky Lorentz\nSullivan, Cotter and Associates, Inc.\nbeckylorentz@sullivancotter.com\n314.414.3719\nView original content with multimedia: http://www.prnewswire.com/news-releases/alex-barker-principal-joins-sullivancotters-employee-workforce-practice-300584107.html\nSOURCE Sullivan, Cotter and Associates, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/alex-barker-principal-joins-sullivancotters-employee-workforce-practice-300584107.html"], "published": "2018-01-18T16:42:00.000+02:00", "crawled": "2018-01-18T16:23:51.002+02:00", "highlightTitle": ""}