{"organizations": [], "uuid": "7d21a862f5d12b2ca21b10b73cfb2628d24a6ebe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221455771&w=1200&r=LYNXMPEE0B0ZU", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-kurds/syrian-war-will-drag-into-next-decade-senior-kurdish-leader-idUKKBN1F11O4", "country": "US", "domain_rank": 408, "title": "Syrian war will drag into next decade - senior Kurdish leader", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:47:00.000+02:00", "replies_count": 0, "uuid": "7d21a862f5d12b2ca21b10b73cfb2628d24a6ebe"}, "author": "", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-kurds/syrian-war-will-drag-into-next-decade-senior-kurdish-leader-idUKKBN1F11O4", "ord_in_thread": 0, "title": "Syrian war will drag into next decade - senior Kurdish leader", "locations": [], "entities": {"persons": [{"name": "reuters/rodi said  aldar khalil", "sentiment": "none"}, {"name": "aldar khalil", "sentiment": "none"}, {"name": "tom perry", "sentiment": "none"}, {"name": "bashar al-assad", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "hasaka province", "sentiment": "none"}, {"name": "rmeilan", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "min read  beirut", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 1:50 PM / Updated 26 minutes ago Syrian war will drag into next decade - senior Kurdish leader Tom Perry 5 Min Read \nBEIRUT (Reuters) - A Russian-led effort to end the war in Syria will fail and the conflict looks set to extend into the next decade, a top Syrian Kurdish politician told Reuters in an interview. Aldar Khalil, a Kurdish politician is seen in the town of Rmeilan, Hasaka province, Syria September 27, 2017. Picture taken September 27, 2017. REUTERS/Rodi Said \nAldar Khalil, an architect of Kurdish-led plans for autonomous rule in northern Syria, also said the United States appears in “no hurry” to leave areas where it has helped Kurdish-led forces fight Islamic State, and that he expects ties with Washington to develop as U.S. recovery efforts proceed. \nThe Syrian Kurds are among the few winners in the almost seven-year-old war, having established control over large parts of the north with a powerful militia that has partnered with the U.S.-led coalition against IS. \nRussia, President Bashar al-Assad’s ally, has asked them to take part in an international peace conference on Syria for the first time -- a peace congress scheduled in the Russian city of Sochi on Jan. 29-30. \n“Yes we are invited and we might take part in the show but it will not succeed,” Khalil, co-chair of the Movement for a Democratic Society, a coalition of Syrian Kurdish parties, said by telephone. \nHe questioned what the hundreds of anticipated attendees could accomplish in two days and said more preparation was required. \nU.N.-led diplomacy in Geneva was also set for more failure, he said, adding that the war would “ebb and flow” until at least 2021, the end of Assad’s current seven-year presidential term. \n“I don’t expect any breakthrough in the Syrian situation before 2021 ... it might even go on until ‘25,” he said. \n“Daesh (IS) might expand in other areas, and of course the Turks might try to stir up problems in some areas.” \nThe Syrian Kurds’ ascendancy in Syria has alarmed neighbouring Turkey. Ankara views the dominant Syrian Kurdish groups as an extension of Kurdish parties in Turkey that have been fighting Ankara for more than three decades. \nU.S. support for Syrian Kurdish fighters has also strained ties between the NATO allies: Turkey on Wednesday summoned a top U.S. diplomat in Ankara to protest over U.S. support of Kurdish fighters in Syria. FILE PHOTO: Voters queue at a polling station in Qamishli, Syria September 22, 2017. REUTERS/Rodi Said/File Photo \nKhalil is seen as a key figure in plans to establish a federal region in northern Syria - a plan Washington has opposed despite backing the Syrian Kurdish YPG in the war with IS. \nThe Syrian Kurds say independence is not their goal. But Khalil said the Kurdish-led authorities would press ahead with unilateral autonomy plans, though elections to a new regional parliament have been postponed to allow more time to prepare. WARNING TO ASSAD FILE PHOTO: A man shows his ink-stained finger after casting his ballot in Qamishli, Syria September 22, 2017. REUTERS/Rodi Said/File Photo \nWith the fight against IS winding down, U.S. Defense Secretary Jim Mattis said last month he expected to see a larger U.S. civilian presence in Syria, including contractors and diplomats to focus on stabilisation and ensuring IS does not return. \nKhalil declined to say how long the United States might maintain a foothold in northern Syria, but said that achieving U.S. goals of helping cities such as Raqqa to recover implied a commitment of at least 18 months to two years. \n“These matters will not be completed in less time than this,” he said. \n“I can’t confirm to you a long-term relationship, but at least for the foreseeable time, it seems they are not in a hurry to leave,” he said. Pointing to the Mattis remarks, he said he expected U.S. ties to northern Syria to develop further. \nThe Kurdish-led authorities have held two local elections since September, part of their plan to build new governing structures. Discussions are underway to decide when a third vote -- aimed at electing a regional parliament -- will happen. \nKhalil said the delay was aimed partly at giving a chance for areas recently captured from IS to decide whether to participate. \nThough Assad recently condemned the U.S.-backed Kurdish forces and their allies as “traitors”, Khalil said the Syrian government was incapable of attacking areas they control and warned that if it tried to “all its forces will be killed”. \nHe warned that Islamic State sleeper cells posed a big threat. “The Daesh campaign is not over, now the more difficult phase has started,” he said. Editing by Timothy Heritage", "external_links": [], "published": "2018-01-12T15:47:00.000+02:00", "crawled": "2018-01-12T16:21:36.009+02:00", "highlightTitle": ""}