{"organizations": [], "uuid": "c2099aaa5f8d4c220dfbb0fdf122e39bb5ebfc5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-quorum-health-corporation-announces-mike-culotta-to-resign-march-2018-and-alfred-lumsdaine-to-succeed-as-chief-financial.html", "country": "US", "domain_rank": 767, "title": "Quorum Health Corporation Announces Mike Culotta to Resign March 2018 and Alfred Lumsdaine to Succeed as Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:30:00.000+02:00", "replies_count": 0, "uuid": "c2099aaa5f8d4c220dfbb0fdf122e39bb5ebfc5e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-quorum-health-corporation-announces-mike-culotta-to-resign-march-2018-and-alfred-lumsdaine-to-succeed-as-chief-financial.html", "ord_in_thread": 0, "title": "Quorum Health Corporation Announces Mike Culotta to Resign March 2018 and Alfred Lumsdaine to Succeed as Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "micha", "sentiment": "neutral"}, {"name": "alfred lumsdaine", "sentiment": "neutral"}, {"name": "mike culotta", "sentiment": "neutral"}, {"name": "culotta", "sentiment": "none"}, {"name": "lumsdaine", "sentiment": "none"}, {"name": "j. culotta", "sentiment": "none"}, {"name": "sharecare", "sentiment": "none"}], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "brentwood", "sentiment": "none"}], "organizations": [{"name": "quorum health corporation", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "community health systems, inc.", "sentiment": "none"}, {"name": "tivity health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRENTWOOD, Tenn.--(BUSINESS WIRE)-- Quorum Health Corporation (NYSE: QHC) today announced that Michael J. Culotta will resign as Executive Vice President and Chief Financial Officer effective March 31, 2018. Mr. Culotta has served as the Company’s Executive Vice President and Chief Financial Officer since the Company’s spin-off from Community Health Systems, Inc. in April 2016. Upon his departure, Mr. Culotta will enter into a consulting agreement with the Company, under which he will advise the Company’s management team on financial matters. In connection with Mr. Culotta’s planned departure, Alfred Lumsdaine will be appointed to serve as Executive Vice President of Finance effective February 12, 2018. Mr. Lumsdaine will then succeed Mr. Culotta in the position of Executive Vice President and Chief Financial Officer immediately following Mr. Culotta’s resignation.\nMr. Lumsdaine, age 52, most recently served as President of Population Health for Sharecare, a position he has held since 2016. Prior to joining Sharecare, Mr. Lumsdaine served as chief financial officer of Tivity Health, Inc. (f/k/a Healthways, Inc.) since 2011. Previously, Mr. Lumsdaine was controller and chief accounting officer at Tivity Health, Inc., a role he assumed in 2002 when he first joined the company. Prior to joining Tivity Health, Inc., Mr. Lumsdaine held the position of Treasurer and Controller for Logisco, Inc., which followed senior level financial positions with Aegis Therapies and Theraphysics. Mr. Lumsdaine started his career with the Nashville office of Ernst & Young, spending over eight years in the external audit practice, primarily focused on the healthcare industry, and subsequently directed the North America internal audit department of Willis. Mr. Lumsdaine is a CPA and earned both his BS in Accounting and Masters of Accountancy from the University of Tennessee.\nCommenting on the announcement, Thomas D. Miller, President and Chief Executive Officer of the Company, said, “Mr. Culotta has served Quorum Health since our spin-off from Community Health Systems, Inc., and, on behalf of the Company, we appreciate his service and contributions over the years. I am pleased that we have found such a qualified CFO in Mr. Lumsdaine and expect the transition will be smooth as he moves into the CFO role upon Mike’s departure.”\nAbout Quorum Health Corporation\nQuorum Health Corporation is an operator of general acute care hospitals and outpatient services in the United States. Through its subsidiaries, the Company owns, leases or operates 31 hospitals in rural and mid-sized markets with an aggregate of approximately 3,000 licensed beds. The Company also operates Quorum Health Resources, LLC, a leading hospital management advisory and consulting services business. More information about Quorum Health Corporation can be found at www.quorumhealth.com .\nForward-Looking Statements\nThis release contains forward-looking statements within the meaning of the federal securities laws. Actual future events or results may differ materially from these statements. Readers are referred to the documents filed by Quorum Health Corporation with the Securities and Exchange Commission, including the Company’s annual report on Form 10-K, current reports on Form 8-K and quarterly reports on Form 10-Q. These filings identify important risk factors and other uncertainties that could cause actual results to differ from those contained in the forward-looking statements. The Company undertakes no obligation to revise or update any forward-looking statements, or to make any other forward-looking statements, whether as a result of new information, future events or otherwise.\nThe terms “QHC,” “Quorum Health,” “the Company,” “we,” “us” or “our” refer to Quorum Health Corporation or one or more of its subsidiaries or affiliates as applicable.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006453/en/\nQuorum Health\nTom Miller, 615-221-3501\nPresident and CEO\nSource: Quorum Health Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.quorumhealth.com&esheet=51751265&newsitemid=20180130006453&lan=en-US&anchor=www.quorumhealth.com&index=1&md5=10f9447ce690cf19510884e4de7bdd4f", "http://www.businesswire.com/news/home/20180130006453/en/"], "published": "2018-01-31T01:30:00.000+02:00", "crawled": "2018-01-31T02:17:20.009+02:00", "highlightTitle": ""}