{"organizations": [], "uuid": "65979fbfd5a133d5a5c37388a473fff7c0606c12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104961901-GettyImages-626055028_1.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/38818154/device/rss/rss.html", "section_title": "Net Net", "url": "https://www.cnbc.com/2018/01/23/were-a-racing-team-that-was-built-to-win-championships-says-new-mclaren-head.html", "country": "US", "domain_rank": 767, "title": "'We're a racing team that was built to win championships,' says new McLaren head", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T18:36:00.000+02:00", "replies_count": 0, "uuid": "65979fbfd5a133d5a5c37388a473fff7c0606c12"}, "author": "Tom Chitty", "url": "https://www.cnbc.com/2018/01/23/were-a-racing-team-that-was-built-to-win-championships-says-new-mclaren-head.html", "ord_in_thread": 0, "title": "'We're a racing team that was built to win championships,' says new McLaren head", "locations": [], "entities": {"persons": [{"name": "zak brown", "sentiment": "negative"}, {"name": "brown", "sentiment": "none"}, {"name": "browne", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "mclaren", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Zak Brown is trying to turn his McLaren F1 team into winners again.\nWith the new season's opening race in Melbourne exactly two months away the team's executive director says he's excited because, \"I think you'll see us leap to the front in Australia.\"\nSpeaking in Davos on CNBC's Life Hack's Live the former racing driver admitted that \"last year was the worst year in the history of McLaren.\"\nThe team's poor performance was largely down to the disastrous engine partnership that began in 2015 with Japanese company Honda, which was ended at the end of last season.\n\"The last three years have been very painful,\" said Brown who believes that to be successful on the track the team need to first compete financially.\nshow chapters Europe is the foundation of F1, McLaren’s Browne says 3 Hours Ago | 00:47 \"It's an expensive sport — we're not able to compete financially with the top two teams. We're still definitely one of the top four teams. We need to continue to improve there to put as much resource into our race team as possible. If we can get all of that right we're going to start to move up the grid significantly.\"\nAs well as changing the team's engine supplier to Renault , McLaren's majority owners have also made big changes in the boardroom. Ron Dennis, who was in charge of McLaren for the last 40 years was forced out in 2016 after losing a high court battle against his removal from the McLaren board.\nWhile it's been a turbulent last few years for the British-based team, Brown believes that there are reasons to be optimistic, one of which is that they have a strong driver line-up which still contains arguably one of the best drivers in the recent history of F1, Fernando Alonso.\n\"Fernando is very diligent, he's very focused and very demanding of himself and the team. When Fernando comes into the garage you see everyone stand up a little more upright.\"\nTaking questions from a live audience both in Davos and on Facebook, Brown was asked what he deemed as success?\n\"Making sure that when you make mistakes, which are inevitable, that you learn by those mistakes and don't make the same one twice.\"\n—CNBC has announced a new multi-year partnership with McLaren.", "external_links": ["https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fwww.facebook.com%2Fcnbcinternational%2Fvideos%2F1274652835969187%2F&show_text=0&width=560"], "published": "2018-01-23T18:36:00.000+02:00", "crawled": "2018-01-23T21:46:41.000+02:00", "highlightTitle": ""}