{"organizations": [], "uuid": "662d65c804332d2ab47aba3a23ddec6b7b873c50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-psava-holding-company-acquires-hargrove.html", "country": "US", "domain_rank": 767, "title": "PSAV® HOLDING COMPANY ACQUIRES HARGROVE", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-08T14:00:00.000+02:00", "replies_count": 0, "uuid": "662d65c804332d2ab47aba3a23ddec6b7b873c50"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-psava-holding-company-acquires-hargrove.html", "ord_in_thread": 0, "title": "PSAV® HOLDING COMPANY ACQUIRES HARGROVE", "locations": [], "entities": {"persons": [{"name": "hargrove", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "hargrove schiller park", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "psav", "sentiment": "negative"}, {"name": "the board", "sentiment": "none"}, {"name": "hargrove, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Schiller Park, Ill., A parent holding company of PSAV has acquired Hargrove, Inc. (“Hargrove” or “Company”), a leading experiential events and exhibitions production company. This acquisition brings Hargrove within the same family of companies as PSAV, a leading global provider of audiovisual and event experiences. The acquisition creates opportunities for PSAV and Hargrove to partner and refer business to each other to facilitate delivery of services that enhance their respective clients’ live event experiences.\nThe acquisition brings together in one ownership group a best-in-class experiential events and trade show company with one of the largest event experience providers in North America and Europe. It represents the ownership group’s entry into the global trade show market and accelerates its expansion into live experiential events. For Hargrove, the acquisition expands its scale, provides access to leading technology, a vast customer base, and a platform for international growth through its trusted partner relationship with PSAV.\n“The Board and I are so pleased to be adding the incredibly talented folks at Hargrove, known for delivering large-scale, memorable experiences for more than seven decades, to the PSAV family,” said Mike McIlwain, President and CEO of PSAV and a board member of its parent holding company. “This transaction was driven by the Board’s desire to create a network of companies that would be able to offer customers expanded production and exhibition market capabilities.”\nHargrove, founded in 1946, is an award-winning, full-service, creative and technical production company serving every segment of the live events market. The Company brings to life high-impact, face-to-face experiences for some of the world’s most recognized corporations, associations and government agencies. Hargrove has executed some of the most high-profile political events, including every U.S. Presidential Inauguration since Harry Truman, major global summits, and highly innovative consumer product company brand activations. The Company is based in Lanham, Md., in a 300,000-square-foot facility with a state-of-the-art fabrication shop. Hargrove will maintain its distinct brand, culture and independence. Tim McGill will remain CEO and report to PSAV Holdings’ Board of Directors.\n“I could not be more excited to join the PSAV family, whose leadership shares our vision to create a world-class, global live events company,” said Tim McGill, CEO of Hargrove.\nCarla Hargrove McGill, President of Hargrove, added, “We have been a family-run business since being founded by my grandfather and father. There are no better caretakers for their legacy and our extended family of employees who helped us build one of the greatest experiential production companies in the world, than the people within the PSAV family of companies.”\nThe PSAV family of companies continues to execute on the group’s strategy to provide solutions that bring events to life.\nAbout Hargrove\nHargrove is a global leader in brand storytelling, creative innovative experiential environments for events, exhibits, trade shows and marketing productions around the world. For more than 70 years the Hargrove team has designed and delivered creative solutions for brands aiming to stand apart. Hargrove has more than 200 employees and is headquartered Lanham, Md. Visit us at www.hargroveinc.com .\nAbout PSAV ®\nPSAV is a leading provider in the audiovisual and event experiences industry delivering creative production, advanced technology and staging to help our customers deliver more dynamic and impactful experiences at their meetings, trade shows and special events. As the provider of choice at nearly 1,500 leading hotels, resorts and convention centers throughout the U.S., Canada, the Caribbean, Mexico, Europe and the Middle East, PSAV’s customers comprise event organizers, corporations, trade associations and meeting planners. Our customers choose PSAV for its innovative and comprehensive service offerings, as well as our exceptional customer service from more than 9,000 highly trained staff across a global platform. Visit us at www.psav.com .\n# # #\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/2368f671-e34e-4161-a68d-5c26b0779008\nBob Niersbach PSAV 847.385.3619 rniersbach@psav.com\nSource: PSAV", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/51bc3236-ae78-482f-bed2-ac906e5c9281", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2368f671-e34e-4161-a68d-5c26b0779008/en", "https://www.globenewswire.com/Tracker?data=qC9dIVCHcoyrBaTDv8JGvbWw2dTG4mvBCfeiU5SmY0uIdMDZWDO9-Jh8t2Vs5yDacgSv6EC44sqO9EmVcpGuVOzc8uFOQGkoD-Ctmr3Vq1k=", "https://www.globenewswire.com/Tracker?data=PBIpeg4bKUjKIdjcQ61r3oOKBEeH9UZYx3preyNK9aglsG6H1X2uXSDH-qV2GibXHaYd0ESyxNiRZayTVt8y-oCetj5NSTjexVvIQ6Kyxn9JFKOGAmN4PzUB8AURM1-7DY-42C4TV5eM4UeCVR1A7z_zN6J_hgQOCFyN7Lo4CUUcUozR8ZE1u8LrkCodrmg-7zu5NsuV7T3q2wBje8CE03VyeYTYrRjYWC5DGsXIuB1s7KMkBvJB1cNyE3ue6RRGsdZN8BZKDJlR9pAbnKY8xA==", "https://www.globenewswire.com/Tracker?data=aKAzg4i-0OtDRDniGyaxurGuYiLchp9DAujAPYOJaa4ZxQAoh2dthZ-Tg_gefQW-1xxuLIdawyQBleffrGe9Tg==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/2368f671-e34e-4161-a68d-5c26b0779008"], "published": "2018-01-08T14:00:00.000+02:00", "crawled": "2018-01-08T15:30:46.010+02:00", "highlightTitle": ""}