{"organizations": [], "uuid": "f33065e23a21d08bd19dc8c8ffaad6c5d866543f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219600728&w=1200&r=LYNXMPEE040RH", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-figs-radford/canadas-duhamel-radford-seek-olympic-redemption-idUKKBN1EU19Q", "country": "US", "domain_rank": 408, "title": "Canada's Duhamel, Radford seek Olympic redemption", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T15:16:00.000+02:00", "replies_count": 0, "uuid": "f33065e23a21d08bd19dc8c8ffaad6c5d866543f"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-figs-radford/canadas-duhamel-radford-seek-olympic-redemption-idUKKBN1EU19Q", "ord_in_thread": 0, "title": "Canada's Duhamel, Radford seek Olympic redemption", "locations": [], "entities": {"persons": [{"name": "duhamel", "sentiment": "negative"}, {"name": "radford", "sentiment": "negative"}, {"name": "gabrielle tetrault-farber", "sentiment": "none"}, {"name": "meagan duhamel", "sentiment": "none"}, {"name": "steve keating", "sentiment": "none"}, {"name": "richard gauthier", "sentiment": "none"}, {"name": "eric radford", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "nagoya", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "duhamel, radford", "sentiment": "neutral"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 1:19 PM / Updated 14 minutes ago Canada's Duhamel, Radford seek Olympic redemption Steve Keating , Gabrielle Tetrault-Farber 4 Min Read \nCALGARY/MOSCOW (Reuters) - The careers of Meagan Duhamel and Eric Radford were spiralling out of control a few months ago, casting doubt on their ability to regain form in time for their second and last Olympics. FILE PHOTO: Figure Ice Skating - ISU Grand Prix of Figure Skating Final - Pairs Free Skating - Nagoya, Japan - December 9, 2017. Canada's Meagan Duhamel and Eric Radford are seen in action. Ê Ê REUTERS/Issei Kato/File Photo \nThe Canadian pair have now found their balance after a disappointing seventh-place finish at the 2017 world championships, making some drastic changes in a bid to be medal contenders at the Pyeongchang Games next month. \nThe 2015 and 2016 world champions parted ways with their coach Richard Gauthier in June, just eight months before Pyeongchang, and added two new members to their coaching staff. \nThey also revived their free programme from the undefeated season they had after the 2014 Sochi Olympics, where they fell short of expectations and finished seventh. \n“Hitting that low last season can maybe prove to be the best thing that has ever happened to us,” Duhamel, 32, told Reuters last year. \n“It is like you need to take two steps back to take a step forward. It is never fun to go through those experiences, of course, but they are always valuable.” \nThe pair, which last year missed the world podium for the first time since 2012, cannot pinpoint the moment when things started to sour. Neither do they attribute their troubles to Radford skating with a herniated disc at the worlds, a competition he said was “completely exhausting and scary.” \n“I have never felt so much fear going into a competition,” Radford, 32, said. \n“When I look back on that moment, it really does seem to have happened for a reason. Those changes were made because of what happened at the worlds. Time will tell.” STAYING FRESH \nDuhamel and Radford, who won silver in the inaugural team event in Sochi, used the momentum of the Olympic season to win bronze at the 2014 world championships. \nThey were unstoppable after that. \nBut the pair’s post-Sochi meteoric success ultimately took its toll. FILE PHOTO: Oct 28, 2017; Regina, Saskatchawan, CAN; Meagan Duhamel and Eric Radford (CAN) compete in pairs free skating during the 2017 Skate Canada International figure skating competition at Brandt Centre. Mandatory Credit: Sergei Belski-USA TODAY Sports/File Photo \nDuhamel and Radford were finding it difficult to remain original when they were the ones setting the standards. \n“In an artistic sport like figure skating, the most difficult thing to do is stay fresh,” Radford said. \nIn recent years the pair have pushed the boundaries of athleticism with the throw quad Salchow. \nIn this element of their free programme, Radford tosses Duhamel, who spins four times in the air before landing backwards on one foot. \nThe treacherous jump, if well-executed, could help the pair move closer to Olympic gold. \n“We know what our potential is, if we skate two clean programs we can win that gold medal,” Radford said. \n“But at this point in our careers, leading into the Olympics, it’s like we just want to go out there and have a great experience and a good skate.” \nThe pair won the Skate Canada grand prix event in October with 222.22 points after having finished second in the short programme behind Aliona Savchenko and Bruno Massot of Germany. \nThe pair finished third at the Skate America grand prix event, with Duhamel falling on the side-by-side jump and putting her hand down on the throw quad Salchow. \nThey also came in third at the Grand Prix Final in Japan in December, with Duhamel falling on the throw quadruple Salchow. \n“We have a lot of things to improve from this competition as we go their ability forward to the Olympics,” Duhamel told reporters. “I think the most important for us will be to do a clean short programme at the Olympics.” \nAlthough Duhamel and Radford recognise their podium potential, their recent trials have made observers question their ability to shine at their last Games. \n“I think a lot of people will write us off and we’re fine with that,” Duhamel said. “Let everyone else have the pressure and we can show up, do our jobs and hopefully be back on top.” Reporting by Steve Keating; Additional reporting by Elaine Lies in Nagoya; Writing by Gabrielle Tétrault-Farber; Editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-05T15:16:00.000+02:00", "crawled": "2018-01-05T15:41:43.013+02:00", "highlightTitle": ""}