{"organizations": [], "uuid": "830a699676995f4762034794cdbc7eb1140dc84a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/india-energy/more-green-power-could-curb-indias-water-electricity-gap-researchers-idUSL8N1PA4KI", "country": "US", "domain_rank": 408, "title": "More green power could curb India's water, electricity gap - researchers", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.965, "site_type": "news", "published": "2018-01-17T00:53:00.000+02:00", "replies_count": 0, "uuid": "830a699676995f4762034794cdbc7eb1140dc84a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/india-energy/more-green-power-could-curb-indias-water-electricity-gap-researchers-idUSL8N1PA4KI", "ord_in_thread": 0, "title": "More green power could curb India's water, electricity gap - researchers", "locations": [], "entities": {"persons": [{"name": "tianyi luo", "sentiment": "none"}], "locations": [{"name": "rome", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "pricewaterhouse coopers", "sentiment": "none"}, {"name": "world resources institute", "sentiment": "none"}, {"name": "wri", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROME, Jan 16 (Thomson Reuters Foundation) - Water shortages have disrupted India’s power plants for years, and are likely to worsen as power demands grow and climate change brings more frequent droughts - a reality that is adding urgency to government plans to boost use of renewable energy, analysts said.\nMost of India’s energy comes from fossil-fuel-powered thermal power plants that rely on freshwater for cooling.\nFourteen of the country’s 20 largest thermal power utility companies experienced disruptions related to water shortages at least once between 2013 and 2016, losing more than $1.4 billion in potential revenue, the World Resources Institute (WRI) said in a report on Tuesday.\n“Water shortages are a threat to power companies in India,” said Tianyi Luo, co-author of the WRI report.\n“As India is expected to grow significantly in the next 20 to 30 years, the water competition is only going to be more severe,” he said.\nIndia is expanding its power supplies to meet the demands of a growing economy - which is set to double by 2030, according to Pricewaterhouse Coopers.\nThe country also needs to extend power to an estimated 300 million people currently living without electricity.\nClimate change - which is expected to cause more frequent and intense droughts and change rainfall patterns - will likely put additional stress on water supplies, Luo said.\nLESS WATER, MORE POWER? In a bid to address the problem, the government has introduced rules to curb the amount of water used by power stations.\nBut to effectively keep water consumption from India’s fossil fuel power generation in check, the country needs to meet its own ambitious renewable energy goals and implement its stringent water regulations on power plants, WRI said.\n“We don’t know how much water those power plants are using exactly on a daily basis. Unless you start to monitor and disclose this type of information, it’s hard to get a sense of what kinds of risks you are exposed to,” said Luo.\nThe government’s plans to meet India’s growing energy needs include building more power plants that run on coal, ramping up its nuclear power capacity - and investing heavily in solar and, to a lesser extent, wind power.\nAlthough growing use of solar power will to a large extent reduce reliance on water for power generation, it can still put a strain on water supplies in the arid areas where some major solar plants have been built, said Karthik Ganesan, a research fellow at the Delhi-based Council on Energy, Environment and Water.\nEven the small amount of water needed to clean dust off solar panels, for example, “is a significant demand” in extremely arid areas, Ganesan said.\n“So it doesn’t mean that the issue (of water shortages) dies out completely. It takes a different form,” he told the Thomson Reuters Foundation.\nMany entrepreneurs and companies are looking at building solar installations and wind turbines on the same pieces of land, as the wind often picks up when the sun sets. Wind power also requires little or no water.\n“I think the private sector will find what the right mix is,” Ganesan said.\nBy 2022, India is expected to more than double its current renewable electricity capacity, according to the International Energy Agency.\nThe government has decided to scale back some of its plans to build new coal-fired power plants, partly because the cost of renewables has dropped significantly in the last decade, said Niklas Höhne, a climate emissions expert at the Germany-based NewClimate Institute, which tracks countries’ emission reduction policies.\n\"India is a country where changes are the fastest compared to most other countries. (It's gone) from building more coal-fired power plants to building a lot of renewable energy,\" Höhne said. (Reporting by Alex Whiting @Alexwhi, Editing by Laurie Goering.; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, resilience, women's rights, trafficking and property rights. Visit news.trust.org/climate )\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://news.trust.org/climate"], "published": "2018-01-17T00:53:00.000+02:00", "crawled": "2018-01-17T19:57:16.005+02:00", "highlightTitle": ""}