{"organizations": [], "uuid": "221d24e009301030e10d886720c06b11887b3426", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-912455650.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/31/state-of-the-union-trump-deregulation/", "country": "US", "domain_rank": 1196, "title": "Commentary: Trump Deregulation Is Bad News for Workers | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-31T15:13:00.000+02:00", "replies_count": 0, "uuid": "221d24e009301030e10d886720c06b11887b3426"}, "author": "Sam Berger", "url": "http://fortune.com/2018/01/31/state-of-the-union-trump-deregulation/", "ord_in_thread": 0, "title": "Commentary: Trump Deregulation Is Bad News for Workers | Fortune", "locations": [], "entities": {"persons": [{"name": "sam berger", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Sam Berger 1:13 PM EST \nIn his State of the Union Address on Tuesday, President Donald Trump once again touted his administration’s efforts at deregulation. Trump has frequently suggested that eliminating regulations leads to economic growth and greater prosperity. But he is wrong that the economy has been booming under his watch, and he is obscuring the intent of his efforts to strip important safeguards for workers. \nJob growth in 2017 continued, but was the weakest it’s been since 2010 , and real wage growth was tepid. And, far from cutting burdensome or outdated requirements, Trump has been attacking regulations that protect workers’ pay, retirement, and safety in order to pad company profits. \nWhile Trump frequently crows about the number of regulations he will cut, and has even promised to reduce regulation to pre-1960s levels —a time before mandatory seat belts and air bags or protections to ensure clear air and water—he does not frequently discuss the specifics of his efforts. Doing so would reveal that deregulation is simply a code word for letting big businesses cut corners at everyone else’s expense. \nPerhaps the clearest example of whose side Trump is on is his attack on overtime protections. The U.S. Department of Labor sets requirements to make sure that people who work overtime are paid for it. The Obama administration modernized outdated rules to make sure that people in the middle class received overtime protections, benefiting 12.5 million workers . But the Trump administration quietly abandoned the rule, with no fanfare, ribbon-cutting ceremony, or presidential tweet, seeking to hide what amounts to a $1.2 billion pay cut for workers each year (the Center for American Progress and Economic Policy Institute have a tracker that shows in real time how much workers have already lost to date). \nThis is not Trump’s only attack on regulations that protect people’s pay. His administration recently proposed a new rule that would allow restaurant owners to steal their workers’ tips as long as they pay them minimum wage. Using a conservative estimate of the extent to which owners would take Trump up on his offer, the proposal would cost workers $5.8 billion in stolen tips each year. Trump also worked with Congress to repeal a rule that would limit violations of labor laws by government contractors; by scrapping that protection, workers will lose millions in wages each year and face more dangerous working conditions. \n\nBeyond the attacks on wages, the Trump administration has also been working to eliminate a rule , the fiduciary rule, that protects people’s retirement savings from unscrupulous financial advisors. The rule requires financial advisors to act in the interest of their clients—in its absence, people are often steered into investments that provide large fees to advisors, at the cost of lower returns and riskier products for investors. All told, people lose $17 billion each year as a result of financial advisors who care more about their own bottom line than the welfare of their customers. \nAnd these regulatory rollbacks are just the tip of the iceberg. Among other rollbacks, Trump has gotten rid of rules that keep Internet service providers from selling customers’ browser history without their consent and that prevent large corporations from stripping customers of their right to challenge fraudulent actions in court , and is trying to make it harder for students to obtain debt forgiveness when they have been defrauded by a university. \nThese deregulatory efforts are not seeking to create jobs. They are not aimed at improving the lives of middle-class Americans or spurring economic growth. Rather, they seek to eliminate important safeguards in order to encourage an economy in which it’s easier for big businesses to make money by cheating their clients and stealing from their workers. \nSo the next time you hear Trump talk about cutting regulations, hold onto your wallet: because when it comes to Trump, one man’s “red tape” is everybody else’s livelihood. \nSam Berger is the senior adviser at the Center for American Progress. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-31T15:13:00.000+02:00", "crawled": "2018-01-31T22:15:16.003+02:00", "highlightTitle": ""}