{"organizations": [], "uuid": "7215aa925b39de346db64ca8071ca11432ea95f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221354025&w=1200&r=LYNXMPEE0B09R", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-usa-stocks-weekahead/investors-green-light-infrastructure-trade-but-expect-road-bumps-idINKBN1F10HA", "country": "US", "domain_rank": 408, "title": "Wall St Weekahead: Investors green-light infrastructure trade, but expect road bumps", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T08:06:00.000+02:00", "replies_count": 0, "uuid": "7215aa925b39de346db64ca8071ca11432ea95f6"}, "author": "", "url": "https://in.reuters.com/article/us-usa-stocks-weekahead/investors-green-light-infrastructure-trade-but-expect-road-bumps-idINKBN1F10HA", "ord_in_thread": 0, "title": "Wall St Weekahead: Investors green-light infrastructure trade, but expect road bumps", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "lewis krauskopf", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mcdermid", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Volatility awaits shares of U.S. construction, engineering, building materials and other companies tied to infrastructure spending, but steel-nerved investors could be poised for gains if they weather a few bumps.\nTraders work on the floor of the New York Stock Exchange (NYSE) in New York, U.S., December 13, 2017. REUTERS/Brendan McDermid The stocks are set to be in focus in the coming weeks as President Donald Trump seeks legislation geared at overhauling the country’s aging roads, bridges and other infrastructure, fresh off passage of a tax reform bill by his Republican party.\nA bipartisan group of U.S. senators met with administration officials this week to discuss legislation to spend $1 trillion to improve infrastructure.\nAn infusion of federal spending is expected to boost infrastructure-sensitive companies, but the stocks could see a rocky performance as a bill maneuvers through Congress and details of any legislation emerge.\nImproving the country’s infrastructure, which last year was given a failing grade by the American Society of Civil Engineers, has broad appeal.\nStill, while some Democrats want such a bill, political differences may undermine the effort and affect the amount of private sector investment.\nRegardless of federal legislation, however, investors and analysts see a favorable climate for such stocks, including the need for an upgrade of national infrastructure, an expected spike in earnings for many companies this year, and positive economic trends that support investment in big projects.\n“There is money flowing in this area even if you don’t get the big federal one,“ said Walter Todd, chief investment officer at Greenwood Capital Associates in Greenwood, South Carolina. ”That would just be icing on the cake if that happened and would really flow through to these stocks.”\nINFRASTRUCTURE STOCKS SWING Todd says his firm is overweight infrastructure-related names, including owning civil contractor Granite Construction Inc, building materials companies Eagle Materials Inc and US Concrete Inc and steel company Nucor Corp.\nThose shares and other construction-related names soared in the immediate aftermath of Trump’s November 2016 election, spurred by his campaign vow to spend on infrastructure.\nBut while the benchmark S&P 500 stock index has been on a steady ascent since Trump’s election, construction-related stocks in particular have endured a rollercoaster ride, whipsawed in part last year by uncertainty over Trump’s agenda.\nEven with outsized gains over the past two months, the infrastructure trade has posted lukewarm returns since just after Trump’s win.\nFor example, since early December 2016, while the S&P 500 has surged more than 22 percent, the S&P 1500 construction and engineering index has climbed 9 percent, and the S&P 1500 steel index and the S&P 1500 construction materials group have each climbed about 5 percent.\n“From a year-over-year standpoint, a lot of these names have not really done anything,” Todd said.\nAt this relatively late point in the economic recovery, customers should be more comfortable making capital spending decisions on projects, according to analysts.\n‘LATE-CYCLE PLAY’\nEngineering and construction companies “are a late-cycle industrial play, so we have just started to see the juice kick in for a lot of them,” said Tahira Afzal, managing director at KeyBanc Capital Markets.\n”Even without an infrastructure stimulus or infrastructure bill, the next two years should be years in which the sector outperforms.”\nEarnings for S&P 1500 engineering and construction (E&C) companies overall are projected to grow 27 percent in 2018, while construction materials companies could see a 32 percent jump, according to Thomson Reuters data. That compares to a estimated 13.9 percent increase for the S&P 500, according to Thomson Reuters I/B/E/S.\n“The market is trading off of near-record earnings and the E&C companies aren’t at those record earnings yet as a group,” said John Rogers, founder of independent engineering and construction consulting firm JBR Advisory, LLC in Portland, Oregon.\nSome optimism over an infrastructure bill may already be reflected in stock values. For example, Fluor and Jacobs Engineering shares have climbed 28 percent and 18 percent respectively, since the start of November, while U.S. Steel shares have jumped more than 50 percent.\nWhile other factors could be fueling the gains, such as the tax-cut legislation or global economic momentum, these shares could pull back if the federal infrastructure package disappoints.\n“You really have to take a longer-term perspective and just realize that if something does happen in Washington there will be a lot of two-steps-forward, one-step-back,” said Eric Marshall, portfolio manager at Dallas-based Hodges Capital Management, which owns building materials stocks as well as equipment rental company United Rentals Inc and contractor Primoris Services Corp.\n“You can make a multi-year argument that there is pent-up demand for things like waterworks and roads and bridges and highways,” Marshall said.\nEditing by Alden Bentley and Bernadette Baum\n ", "external_links": [], "published": "2018-01-12T08:06:00.000+02:00", "crawled": "2018-01-12T08:25:10.016+02:00", "highlightTitle": ""}