{"organizations": [], "uuid": "934326a505b69b32cb3f1d906b0e3a1f165ca820", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 17, "shares": 17, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220545221&w=1200&r=LYNXMPEE080XF", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-russia-politics-history/russian-historian-who-exposed-stalins-crimes-faces-enforced-psychiatric-testing-idUSKBN1EY1JR", "country": "US", "domain_rank": 408, "title": "Russian historian who exposed Stalin's crimes faces enforced psychiatric testing", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:37:00.000+02:00", "replies_count": 0, "uuid": "934326a505b69b32cb3f1d906b0e3a1f165ca820"}, "author": "", "url": "https://www.reuters.com/article/us-russia-politics-history/russian-historian-who-exposed-stalins-crimes-faces-enforced-psychiatric-testing-idUSKBN1EY1JR", "ord_in_thread": 0, "title": "Russian historian who exposed Stalin's crimes faces enforced psychiatric testing", "locations": [], "entities": {"persons": [{"name": "stalin", "sentiment": "negative"}, {"name": "josef stalin", "sentiment": "none"}, {"name": "dmitriev", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "yuri dmitriev", "sentiment": "none"}, {"name": "andrew osborn", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}], "organizations": [{"name": "min read  moscow", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "kremlin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 1:38 PM / Updated 2 minutes ago Russian historian who exposed Stalin's crimes faces enforced psychiatric testing Andrew Osborn 4 Min Read \nMOSCOW (Reuters) - A Russian historian whose exposure of Soviet leader Josef Stalin’s crimes angered state officials is due to begin enforced psychiatric testing this week amid fears he will be falsely declared insane, his lawyer said on Tuesday. \nYuri Dmitriev, 61, is on trial in northwest Russia on charges brought by state prosecutors of involving his adopted daughter, then 11, in child pornography, of illegally possessing “the main elements of” a firearm, and of depravity involving a minor. \nSome of Russia’s leading cultural figures say Dmitriev was framed because his focus on Stalin’s crimes - he found a mass grave with up to 9,000 bodies dating from the Soviet dictator’s Great Terror in the 1930s - jars with the latter-day Kremlin narrative that Russia must not be ashamed of its past. \nThe narrative has taken on added importance ahead of a March presidential election which polls show incumbent Vladimir Putin, who uses his country’s World War Two victory when Stalin was in charge to bolster national pride, is on track to win. \nPutin asserted last year that what he called an “excessive demonization of Stalin” was being used to undermine Russia. \nDmitriev faces up to 15 years in prison if convicted of the charges, which he denies. \nA previous psychiatric evaluation declared him to be of sound mind and a court-sanctioned expert group found no pornographic content in nine photographs of his daughter that are at the center of the case against him, overturning the earlier findings of other experts commissioned by prosecutors. \nBut on Dec. 27, in an unexpected twist, the court ordered that the same nine photos be re-examined by experts for a third time. It also granted the prosecution’s request that Dmitriev undergo enforced psychiatric testing to determine whether he has “sexual deviations.” \nHowever, the court declined a prosecution request to extend his detention beyond Jan. 28. SOVIET HANGOVER \nDmitriev’s lawyer, Viktor Anufriev, told Reuters on Tuesday he had written to the supreme court of Karelia, the region where his client is being tried, to appeal against the court order. \n“He’s already been through one (psychiatric) test. The conclusions were fine, no evidence of deviance was found, and the results were not contested by prosecutors,” said Anufriev. \n“This (latest testing) was ordered illegally.” \nDmitriev was flown to Moscow at the end of last year to be evaluated at a psychiatric clinic, the Serbsky Centre, that was infamous in Soviet times for providing false testimony to allow the authorities to lock up dissidents in psychiatric facilities. \nAnufriev said he expected a doctor to be appointed to handle his client’s psychiatric case later on Tuesday. \nHe said he hoped the evaluation, which could last for up to a month, would be objective, but was concerned that state security officials in Karelia might pressure doctors. \nHe did not specify which officials he was referring to. \nState TV broadcast last year what it billed as an expose of Dmitriev and of Memorial, the organization for which he worked, complaining that foreign money was being used to provide a distorted and overly negative version of Russian history. \nThe Kremlin has told Reuters it does not get involved in cases like Dmitriev‘s, while the Investigative Committee of Karelia, whose investigators submitted the original case for prosecution, did not respond to Reuters’ questions about whether there was a political side to the trial. They said only that there had been enough evidence to open a criminal case. \nAnufriev, Dmitriev’s lawyer, said he was worried. \n“Perhaps if they can’t convict him (of child pornography) they need to declare him insane,” the lawyer said. “It’s a purely Soviet procedure. Make accusations and then end things by locking someone up in a psychiatric facility.” Editing by Mark Heinrich", "external_links": [], "published": "2018-01-09T15:37:00.000+02:00", "crawled": "2018-01-09T15:42:00.002+02:00", "highlightTitle": ""}