{"organizations": [], "uuid": "d899ea6eeb999c2dd1e9f44a18449f9c0495de14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-stock-yards-bancorp-reports-results-for-the-fourth-quarter-and-full-year-2017.html", "country": "US", "domain_rank": 767, "title": "Stock Yards Bancorp Reports Results for the Fourth Quarter and Full Year 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.167, "site_type": "news", "published": "2018-01-25T15:00:00.000+02:00", "replies_count": 0, "uuid": "d899ea6eeb999c2dd1e9f44a18449f9c0495de14"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-stock-yards-bancorp-reports-results-for-the-fourth-quarter-and-full-year-2017.html", "ord_in_thread": 0, "title": "Stock Yards Bancorp Reports Results for the Fourth Quarter and Full Year 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "louisville", "sentiment": "none"}, {"name": "ky.", "sentiment": "none"}, {"name": "louisville", "sentiment": "none"}, {"name": "cincinnati", "sentiment": "none"}, {"name": "indianapolis", "sentiment": "none"}], "organizations": [{"name": "stock yards bancorp reports results", "sentiment": "negative"}, {"name": "stock yards bancorp, inc.", "sentiment": "none"}, {"name": "stock yards bank & trust company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Revenues Increase to Record Amounts, While the Impact of New Tax Legislation Drives Down Net Income\nLOUISVILLE, Ky.--(BUSINESS WIRE)-- Stock Yards Bancorp, Inc. (NASDAQ: SYBT), parent company of Stock Yards Bank & Trust Company, with offices in the Louisville, Indianapolis and Cincinnati metropolitan markets, today reported results for the fourth quarter and year ended December 31, 2017. Total revenue, comprising net interest income and non-interest income, increased 6% to $38.6 million for the fourth quarter of 2017 from $36.4 million for the year-earlier quarter. Net income for the fourth quarter of 2017 totaled $4.9 million or $0.22 per diluted share compared with $10.6 million or $0.46 per diluted share for the fourth quarter of 2016. Total revenue for 2017 increased 6% to $148.7 million from $140.8 million for 2016. Net income for the year ended December 31, 2017, was $38.0 million or $1.66 per diluted share compared with $41.0 million or $1.80 per diluted share for 2016. Net income for the fourth quarter and full year 2017 reflected a non-cash charge of $5.9 million or $0.25 per diluted share to revalue the Company's net deferred tax asset in connection with federal income tax legislation enacted on December 22, 2017.\nKey aspects of the Company's performance for the year included:\nSolid loan growth during 2017, which increased the Company's loan portfolio almost 5% for 2018; Consistently strong net interest margin; Credit quality remained at historically strong levels; Continued growth in fee income, led by the Wealth Management and Trust Group; and Solid returns on average assets and equity of 1.25% and 11.61%, respectively, despite the negative impact of 0.20% on return on average assets and 1.81% on return on average equity due to the year-end remeasurement charge noted above.\n\"We are pleased to announce a strong conclusion to 2017, marked by solid performance in many important areas, such as loan production and loan growth, net interest margin and wealth management and trust,\" said David P. Heintzman, Chairman and Chief Executive Officer. \"Alongside that, credit quality remained exceptionally strong. These factors resulted in record pretax results for the Company in 2017 and, together with the solid loan pipeline we have in place as we head into 2018 and the positive effect of lower tax rates in the future, position us to maintain an attractive growth trajectory in the coming year.\n\"With the passage of the Tax Cuts and Jobs Act last month, an immediate recalculation of the value of our net deferred tax asset was required and recorded as additional income tax expense in the fourth quarter,\" Heintzman continued. \"While this had an impact on 2017 earnings, the lower statutory rate going forward should allow us to more than recoup during 2018 the remeasurement charge we recorded in 2017, and future periods will continue to benefit from lower income taxes. More broadly, lower tax rates are widely expected to promote growth and expansion across the business spectrum, including small and middle-market companies – our core clientele – leading to higher capital investment and new job creation, all of which would be positive for the Company's outlook.\"\nCommenting on the loan portfolio, Heintzman reported that loan production was strong in the fourth quarter, matching the pace experienced in the year-earlier quarter and representing one of the best quarterly performances ever for the Company. Significantly, the conversion of loan production to loan growth ramped up noticeably in the fourth quarter, with loan growth of more than 3% on a sequential quarter basis. \"After a slow start to the year in terms of net loan growth, we were pleased to see momentum build in the fourth quarter, pushing our total portfolio up almost 5% for all of 2017,\" he added. \"This growth, in which all three of our markets participated, was led by commercial and industrial loans – one of our key lending areas – and reflected a number of project-oriented deals funding up to permanent financing. Although loan payoffs may challenge future loan growth, we remain optimistic about where our loan pipeline stands today and new opportunities that may arise as tax reform begins to stimulate the economy.\"\nFocusing on non-interest income, which accounted for more than 30% of total revenue for 2017, Heintzman reiterated the positive impact of the Company's diverse fee-based revenue streams in supporting predictable, reliable earnings growth over the long term. Wealth management and trust, with approximately $2.8 billion of assets under management, comprises almost one-half of the Company's fee-based income and, thus, has been a key element of this strategy. Income from wealth management and trust increased 6% for the fourth quarter of 2017 compared with the year-earlier quarter and was up 7% for the full year, both of which reflected primarily the addition of new customer relationships along with continued stock market gains. Importantly, this growth has continued to offset a general slowdown in mortgage banking as rates have risen and housing inventory remained tight.\nConcluding, Heintzman said, \"We are pleased with the Company's overall progress and prosperity during 2017. These achievements not only underscore the strategies we have in place to grow our business across our markets, but also reflect the interest and effort everyone at Stock Yards Bank & Trust puts forth in forging strong, deep and enduring relationships with the customers we serve. Considering the diverse nature of our business, the strong lending pipeline we have developed as we move into 2018, and lower income taxes in the year to come, we remain optimistic about the Company's prospects to extend its record of growth in the future and remain among the top performing community banks in the country.\"\nConcerning the non-cash charge to remeasure the Company's net deferred tax asset, Heintzman noted that deferred taxes occur due to timing differences between recording transactions for financial reporting and tax purposes. These differences were originally recorded using a 35% marginal rate. With the new tax legislation, the Company's deferred tax asset is now expected to be settled at a lower rate and has been remeasured based on the new marginal rate of 21%. With this lower federal marginal rate in mind, the Company expects an overall effective tax rate of approximately 17% for 2018. The remeasurement of the Company's net deferred tax asset was based on management's reasonable estimates of certain income tax effects of the new federal income tax legislation, and these provisional amounts may be adjusted during the measurement period ending December 31, 2018.\nTotal assets increased $200 million or 6% at December 31, 2017, to $3.24 billion from $3.04 billion at December 31, 2016. Ongoing growth in the Company's loan portfolio accounted for a significant portion of this increase, as the portfolio rose $104.2 million or almost 5% to $2.41 billion at December 31, 2017. Total deposits advanced $57.7 million or 2% to $2.58 billion at December 31, 2017. Stock Yards Bank & Trust continues to attract new customers and experience growth with existing customers across most account categories, which in turn provides substantial support for the Company's balance sheet growth. Core deposits, which exclude brokered deposits and time deposits greater than $250,000, held steady at 99% of total deposits as of December 31, 2017.\nStock Yards Bancorp remains \"well capitalized\" – the highest capital rating for financial institutions. As of December 31, 2017, the Company's total equity to assets was 10.30% and tangible common equity ratio was 10.25% (tangible common equity is a non-GAAP financial measure; see reconciliation of total stockholders' equity to tangible common equity and total assets to tangible assets later in this release). While the remeasurement charge reduced year-end capital ratios approximately 20 basis points, the Company expects to more than recoup that decline through lower income taxes during 2018. Even with its strong capital position, the Company still produces industry-leading returns on equity due to its superior earnings performance. Stock Yards Bancorp continues to pursue strategies to enhance stockholder value, including a substantial and sustained dividend payout ratio. In November 2017, Stock Yards Bancorp's Board of Directors increased the Company's quarterly cash dividend to $0.21 per common share. With a lower marginal tax rate going forward, the Board intends to consider strategies to deploy tax savings in ways that grow the Company's business and drive higher stockholder value.\nNet interest income – the Company's largest source of revenue – increased approximately $1.9 million or 8% to $27.0 million in the fourth quarter of 2017 from $25.1 million in the prior-year quarter. The increase reflected the impact of ongoing loan portfolio growth and higher prevailing interest rates, offset in part by increased funding costs, primarily due to higher rates paid on deposit accounts. Net interest income increased $6.3 million or 7% to $103.6 million in 2017 compared with $97.3 million in the prior-year period.\nOn a sequential-quarter basis, net interest income increased $859 thousand or 3% from the third quarter of 2017, while net interest margin (on a fully tax-equivalent basis) was 3.65% compared with 3.66% in the third quarter of 2017 and 3.56% in the fourth quarter of 2016. Net interest margin for the fourth quarter reflected the positive impact of increases in the prime rate in 2017, which was offset by a temporary inflow of short-term public funds at the end of the year. While this excess liquidity was maintained in lower-yielding, short-term investments and resulted in lower net interest margin, it was accretive to earnings. The Company expects liquidity to return to normal levels during the first and second quarters of 2018. The first two rate hikes in 2017, which increased the prime rate to 4.25%, moved virtually all variable rate loans in the Company's portfolio above any remaining rate floors. The third 25-basis-point increase in the prime rate, which occurred on December 14, 2017, had no meaningful effect on net interest margin for the fourth quarter of 2017. Approximately 60% of the Company's loans are priced at fixed rates, so future rate increases may begin to benefit this part of the portfolio as existing fixed-rate loans renew and new fixed-rate loans originate at higher rates – with both subject to competitive conditions and prevailing interest rates.\nThe Company's historically strong asset quality metrics, which have trended within a narrow range over the past several years, remained steady during the fourth quarter of 2017. Non-performing loans (NPLs) totaled $7.4 million or 0.31% of total loans outstanding at December 31, 2017, versus $6.1 million or 0.26% of total loans outstanding at September 30, 2017, and $6.7 million or 0.29% of total loans outstanding at December 31, 2016. Similarly, non-performing assets, which include NPLs along with other real estate owned (OREO) and repossessed assets, were $10.0 million or 0.31% of total assets at December 31, 2017, versus $8.7 million or 0.28% of total assets at September 30, 2017, and $11.7 million or 0.39% of total assets at December 31, 2016. Net charge-offs in the fourth quarter of 2017, and throughout 2017 and 2016, were insignificant relative to average loans outstanding. While the Company is pleased to achieve these strong asset quality metrics, management understands the cyclic nature of banking and knows these metrics will normalize over the long term.\nThe Company recorded a loan loss provision of $900 thousand during the fourth quarter of 2017 compared with $150 thousand in the third quarter of 2017 and $500 thousand in the fourth quarter of 2016. The provision for the fourth quarter of 2017 took into consideration a generally favorable trend in most credit quality metrics, an ongoing low level of charge-offs, other qualitative considerations, and loan growth. As a result, in management's view the Company's allowance for loan losses remained adequate at 1.03% of total loans as of December 31, 2017, versus 1.07% at September 30, 2017, and 1.04% at December 31, 2016.\nTotal non-interest income in the fourth quarter of 2017 increased $226 thousand or 2% to $11.5 million from $11.3 million in the prior-year quarter. This increase primarily reflected ongoing growth in wealth management and trust and an increase in other non-interest income, which was partially offset by a decrease in mortgage banking and a loss on the disposition of available-for-sale securities. Total non-interest income for the year ended December 31, 2017, increased $1.6 million or 4% to $45.1 million from $43.5 million for 2016, reflecting trends similar to those noted for the fourth quarter along with higher service charges that were driven by growing treasury management services, bankcard transaction fees and bank-owned life insurance related to a death benefit on a former employee.\nTotal non-interest expense for the fourth quarter of 2017 increased approximately $5.9 million or 28% to $27.2 million from $21.3 million in the prior-year quarter. The increase primarily reflected higher amortization and impairment expense for investments in tax credit partnerships as well as increased health insurance costs under the Company's self-insured plan and higher other non-interest expense, the latter of which reflected benefits from certain items recorded in the fourth quarter of 2016 that did not recur in 2017. The sporadic timing of tax-credit partnership opportunities can cause corresponding expenses and tax benefits to vary widely. During the fourth quarter of 2017, the Company completed investments in additional tax-credit partnerships, which increased expense for the period. Expenses relating to partnership investments are recognized in the same period(s) as corresponding tax credits, with tax savings more than offsetting the expense. Tax savings from these additional fourth quarter investments exceeded corresponding expenses by $345 thousand. For the year ended December 31, 2017, total non-interest expense increased $9.5 million or 12% to $91.0 million from $81.5 million for 2016, largely reflecting the same trends noted for the quarter, as well as higher salaries related to the addition of personnel to support growth and operations.\nLouisville, Kentucky-based Stock Yards Bancorp, Inc., with $3.2 billion in assets, was incorporated in 1988 as a bank holding company. It is the parent company of Stock Yards Bank & Trust Company, which was established in 1904. The Company's common shares trade on the NASDAQ Global Select Market under the symbol SYBT.\nThe following table provides a reconciliation of total stockholders' equity, in accordance with US GAAP, to tangible common equity, which is a non-GAAP financial measure. The Company provides the tangible common equity ratio, in addition to those defined by banking regulators, because of its widespread use by investors to evaluate capital adequacy.\nTangible Common Equity Ratio (Dollars in thousands)\nDec. 31,\n2017\nSept. 30,\n2017\nDec. 31,\n2016\nTotal stockholders' equity $ 333,644 $ 334,255 $ 313,872 Less goodwill (682 ) (682 ) (682 ) Less core deposit intangible (1,225 ) (1,269 ) (1,405 ) Tangible common equity $ 331,737 $ 332,304 $ 311,785 Total assets $ 3,239,646 $ 3,155,913 $ 3,039,481 Less goodwill (682 ) (682 ) (682 ) Less core deposit intangible (1,225 ) (1,269 ) (1,405 ) Tangible assets $ 3,237,739 $ 3,153,962 $ 3,037,394 Total stockholders' equity to total assets 10.30 % 10.59 % 10.33 % Tangible common equity ratio 10.25 % 10.54 % 10.26 % This report contains under the Private Securities Litigation Reform Act that involve risks and uncertainties. Although the Company's management believes the assumptions underlying the contained herein are reasonable, any of these assumptions could be inaccurate. Therefore, there can be no assurance the included herein will prove to be accurate. Factors that could cause actual results to differ from those discussed in include, but are not limited to: economic conditions both generally and more specifically in the markets in which the Company and its subsidiaries operate; competition for the Company's customers from other providers of financial services; government legislation and regulation, which change from time to time and over which the Company has no control; changes in interest rates; material unforeseen changes in liquidity, results of operations, or financial condition of the Company's customers; and other risks detailed in the Company's filings with the Securities and Exchange Commission, all of which are difficult to predict and many of which are beyond the control of the Company. See Risk Factors outlined in the Company's Form 10-K for the year ended December 31, 2016.\nStock Yards Bancorp, Inc. Financial Information (unaudited) Fourth Quarter 2017 Earnings Release (In thousands unless otherwise noted) Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Income Statement Data Net interest income, fully tax equivalent (1) $ 27,217 $ 25,272 $ 104,396 $ 98,088 Interest income: Loans $ 26,062 $ 23,806 $ 99,874 $ 91,798 Federal funds sold and interest bearing deposits 532 96 1,330 491 Mortgage loans held for sale 46 52 191 237 Securities 2,452 2,414 9,454 9,646 Total interest income 29,092 26,368 110,849 102,172 Interest expense: Deposits 1,738 1,027 5,975 3,943 Federal funds purchased and short-term borrowings 57 19 182 76 Securities sold under agreements to repurchase 34 36 134 136 Federal Home Loan Bank (FHLB) advances 240 211 955 763 Total interest expense 2,069 1,293 7,246 4,918 Net interest income 27,023 25,075 103,603 97,254 Provision for loan losses 900 500 2,550 3,000 Net interest income after provision for loan losses 26,123 24,575 101,053 94,254 Non-interest income: Wealth management and trust services 5,233 4,936 20,505 19,155 Service charges on deposit accounts 2,540 2,519 9,908 9,471 Bankcard transaction 1,567 1,457 5,979 5,655 Mortgage banking 841 1,001 3,221 3,897 Gain/(Loss) on the sale of securities available for sale (263 ) - (232 ) - Securities brokerage 616 606 2,200 2,145 Bank owned life insurance 195 214 1,159 871 Other non-interest income 816 586 2,380 2,343 Total non-interest income 11,545 11,319 45,120 43,537 Non-interest expense: Salaries and employee benefits 13,327 12,971 52,571 49,185 Net occupancy 1,473 1,563 6,238 6,279 Data processing 2,079 1,901 7,988 7,073 Furniture and equipment 294 290 1,155 1,143 FDIC insurance 244 146 960 1,181 Amortization/impairment of investments in tax credit partnerships 5,277 1,412 7,124 4,458 Other non-interest expenses 4,486 2,986 14,955 12,201 Total non-interest expense 27,180 21,269 90,991 81,520 Net income before income tax expense 10,488 14,625 55,182 56,271 Income tax expense 5,542 4,009 17,139 15,244 Net income $ 4,946 $ 10,616 $ 38,043 $ 41,027 Weighted average shares - basic 22,555 22,448 22,532 22,356 Weighted average shares - diluted 22,993 22,952 22,983 22,792 Net income per share, basic $ 0.22 $ 0.47 $ 1.69 $ 1.84 Net income per share, diluted 0.22 0.46 1.66 1.80 Cash dividend declared per share 0.21 0.19 0.80 0.72 Balance Sheet Data (at period end) Total loans $ 2,409,570 $ 2,305,375 Allowance for loan losses 24,885 24,007 Total assets 3,239,646 3,039,481 Non-interest bearing deposits 674,697 680,156 Interest bearing deposits 1,903,598 1,840,392 Federal Home Loan Bank advances 49,458 51,075 Stockholders' equity 333,644 313,872 Total shares outstanding 22,679 22,617 Book value per share 14.71 13.88 Market value per share 37.70 46.95\nStock Yards Bancorp, Inc. Financial Information (unaudited) Fourth Quarter 2017 Earnings Release Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Average Balance Sheet Data Federal funds sold and interest bearing deposits $ 159,217 $ 70,186 $ 113,088 $ 92,994 Mortgage loans held for sale 3,213 4,770 3,545 4,881 Securities available for sale 455,727 494,868 458,956 479,938 FHLB stock and other securities 7,655 6,347 7,016 6,347 Loans 2,352,310 2,261,104 2,308,856 2,159,153 Earning assets 2,959,817 2,821,373 2,872,717 2,730,949 Assets 3,128,765 2,984,696 3,037,581 2,886,396 Interest bearing deposits 1,900,650 1,802,150 1,840,083 1,763,858 Total deposits 2,594,225 2,488,590 2,524,127 2,413,894 Securities sold under agreement to repurchase 77,993 69,318 70,187 62,670 Federal funds purchased and other short term borrowings 19,481 18,076 20,303 23,275 Federal Home Loan Bank advances 49,583 51,183 50,300 45,455 Interest bearing liabilities 2,047,707 1,940,727 1,980,873 1,895,258 Stockholders' equity 338,368 314,299 327,798 304,151 Performance Ratios Annualized return on average assets 0.63 % 1.41 % 1.25 % 1.42 % Annualized return on average equity 5.80 % 13.44 % 11.61 % 13.49 % Net interest margin, fully tax equivalent 3.65 % 3.56 % 3.63 % 3.59 % Non-interest income to total revenue, fully tax equivalent\n29.78 % 30.93 % 30.18 % 30.74 % Efficiency ratio 70.12 % 58.13 % 60.86 % 57.56 % Capital Ratios Average stockholders' equity to average assets 10.81 % 10.53 % 10.79 % 10.54 % Common equity tier 1 capital 12.57 % 12.10 % Tier 1 risk-based capital 12.57 % 12.10 % Total risk-based capital 13.52 % 13.04 % Leverage 10.70 % 10.54 % Loans by Type Commercial and industrial $ 779,014 $ 736,841 Construction and development 214,900 213,844 Real estate mortgage - commercial investment 594,902 538,886 Real estate mortgage - owner occupied commercial 398,685 408,292 Real estate mortgage - 1-4 family residential 262,110 249,498 Home equity - first lien 57,110 55,325 Home equity - junior lien 63,981 67,519 Consumer 38,868 35,170 Total loans $ 2,409,570 $ 2,305,375 Asset Quality Data Allowance for loan losses to total loans 1.03 % 1.04 % Allowance for loan losses to average loans 1.08 % 1.11 % Allowance for loan losses to non-performing loans 337.10 % 357.94 % Nonaccrual loans $ 6,511 $ 5,295 Troubled debt restructuring 869 974 Loans - 90 days past due & still accruing 2 438 Total non-performing loans 7,382 6,707 OREO and repossessed assets 2,640 5,033 Total non-performing assets 10,022 11,740 Non-performing loans to total loans 0.31 % 0.29 % Non-performing assets to total assets 0.31 % 0.39 % Net charge-offs to average loans (2) 0.04 % 0.04 % 0.07 % 0.07 % Net charge-offs $ 963 $ 862 $ 1,672 $ 1,434\nStock Yards Bancorp, Inc. Financial Information (unaudited) Fourth Quarter 2017 Earnings Release Five Quarter Comparison 12/31/17 9/30/17 6/30/17 3/31/17 12/31/16 Income Statement Data Net interest income, fully tax equivalent (1) $ 27,217 $ 26,363 $ 25,434 $ 25,382 $ 25,272 Net interest income $ 27,023 $ 26,164 $ 25,232 $ 25,184 $ 25,075 Provision for loan losses 900 150 600 900 500 Net interest income after provision for loan losses 26,123 26,014 24,632 24,284 24,575 Wealth management and trust services 5,233 5,025 5,153 5,094 4,936 Service charges on deposit accounts 2,540 2,522 2,439 2,407 2,519 Bankcard transaction 1,567 1,492 1,514 1,406 1,457 Mortgage banking 841 781 897 702 1,001 Gain/(Loss) on the sale of securities available for sale (263 ) 31 - - - Securities brokerage 616 551 494 539 606 Bank owned life insurance 195 204 556 204 214 Other non-interest income 816 497 622 445 586 Total non-interest income 11,545 11,103 11,675 10,797 11,319 Salaries and employee benefits 13,327 12,983 12,849 13,412 12,971 Net occupancy 1,473 1,621 1,514 1,630 1,563 Data processing 2,079 1,920 2,121 1,868 1,901 Furniture and equipment 294 316 268 277 290 FDIC Insurance 244 242 244 230 146 Amortization/impairment of investments in tax credit partnerships\n5,277 616 615 616 1,412 Other non-interest expenses 4,486 3,619 3,735 3,115 2,986 Total non-interest expense 27,180 21,317 21,346 21,148 21,269 Net income before income tax expense 10,488 15,800 14,961 13,933 14,625 Income tax expense 5,542 4,096 4,359 3,142 4,009 Net income $ 4,946 $ 11,704 $ 10,602 $ 10,791 $ 10,616 Weighted average shares - basic 22,555 22,542 22,538 22,492 22,448 Weighted average shares - diluted 22,993 22,964 22,996 23,002 22,952 Net income per share, basic $ 0.22 $ 0.52 $ 0.47 $ 0.48 $ 0.47 Net income per share, diluted 0.22 0.51 0.46 0.47 0.46 Cash dividend declared per share 0.21 0.20 0.20 0.19 0.19 Balance Sheet Data (at period end) Cash and due from banks $ 41,982 $ 47,700 $ 44,902 $ 43,583 $ 39,709 Federal funds sold and interest bearing deposits 97,266 81,378 80,223 45,898 8,264 Mortgage loans held for sale 2,964 5,459 3,055 3,884 3,213 Securities available for sale 574,524 571,522 576,291 556,144 570,074 FHLB stock and other securities 7,646 7,666 7,666 6,347 6,347 Total loans 2,409,570 2,335,120 2,309,668 2,272,778 2,305,375 Allowance for loan losses 24,885 24,948 25,115 24,481 24,007 Total assets 3,239,646 3,155,913 3,126,762 3,033,343 3,039,481 Non-interest bearing deposits 674,697 676,824 696,085 686,535 680,156 Interest bearing deposits 1,903,598 1,805,142 1,782,461 1,857,720 1,840,392 Securities sold under agreements to repurchase 70,473 71,863 65,024 65,701 67,595 Federal funds purchased and other short-term borrowings 161,352 161,961 161,463 10,975 47,374 Federal Home Loan Bank advances 49,458 50,110 50,433 50,755 51,075 Stockholders' equity 333,644 334,255 326,500 319,687 313,872 Total shares outstanding 22,679 22,669 22,662 22,661 22,617 Book value per share 14.71 14.75 14.41 14.11 13.88 Market value per share 37.70 38.00 38.90 40.65 46.95 Capital Ratios Average stockholders' equity to average assets 10.81 % 10.93 % 10.82 % 10.59 % 10.54 % Common equity tier 1 capital 12.57 % 12.67 % 12.51 % 12.51 % 12.10 % Tier 1 risk-based capital 12.57 % 12.67 % 12.51 % 12.51 % 12.10 % Total risk-based capital 13.52 % 13.64 % 13.49 % 13.49 % 13.04 % Leverage 10.70 % 11.02 % 10.88 % 10.64 % 10.54 %\nStock Yards Bancorp, Inc. Financial Information (unaudited) Fourth Quarter 2017 Earnings Release Five Quarter Comparison 12/31/17 9/30/17 6/30/17 3/31/17 12/31/16 Average Balance Sheet Data Average Federal funds sold and interest bearing deposits\n$ 159,217 $ 120,927 $ 105,786 $ 65,304 $ 70,186 Average mortgage loans held for sale 3,213 3,515 4,505 2,943 4,770 Average investment securities 455,727 439,601 454,834 486,209 494,868 Average loans 2,352,310 2,308,806 2,280,122 2,293,542 2,261,104 Average earning assets 2,959,817 2,861,144 2,830,211 2,838,491 2,821,373 Average assets 3,128,765 3,027,088 2,994,209 2,998,950 2,984,696 Average interest bearing deposits 1,900,650 1,800,653 1,812,290 1,846,579 1,802,150 Average total deposits 2,594,225 2,498,468 2,496,256 2,506,880 2,488,590 Average securities sold under agreement to repurchase\n77,993 73,806 60,336 68,467 69,318 Average federal funds purchased and other short term borrowings\n19,481 27,535 18,451 15,625 18,076 Average Federal Home Loan Bank advances 49,583 50,221 50,543 50,866 51,183 Average interest bearing liabilities 2,047,707 1,952,216 1,941,620 1,981,537 1,940,727 Average stockholders' equity 338,368 330,864 324,014 317,682 314,299 Performance Ratios Annualized return on average assets 0.63 % 1.53 % 1.42 % 1.46 % 1.41 % Annualized return on average equity 5.80 % 14.03 % 13.12 % 13.78 % 13.44 % Net interest margin, fully tax equivalent 3.65 % 3.66 % 3.60 % 3.63 % 3.56 % Non-interest income to total revenue, fully tax equivalent\n29.78 % 29.63 % 31.46 % 29.84 % 30.93 % Efficiency ratio 70.12 % 56.90 % 57.52 % 58.45 % 58.13 % Loans by Type Commercial and industrial $ 779,014 $ 750,728 $ 749,036 $ 736,633 $ 736,841 Construction and development 214,900 195,299 196,619 187,039 213,844 Real estate mortgage - commercial investment 594,902 576,810 547,196 546,957 538,886 Real estate mortgage - owner occupied commercial 398,685 397,804 408,558 406,209 408,292 Real estate mortgage - 1-4 family residential 262,110 261,707 255,939 244,349 249,498 Home equity - 1st lien 57,110 51,925 52,560 51,076 55,325 Home equity - junior lien 63,981 63,416 65,344 65,806 67,519 Consumer 38,868 37,431 34,416 34,709 35,170 Total loans $ 2,409,570 $ 2,335,120 $ 2,309,668 $ 2,272,778 $ 2,305,375 Asset Quality Data Allowance for loan losses to total loans 1.03 % 1.07 % 1.09 % 1.08 % 1.04 % Allowance for loan losses to average loans 1.07 % 1.09 % 1.10 % 1.07 % 1.06 % Allowance for loan losses to non-performing loans 337.10 % 411.14 % 411.25 % 402.18 % 357.94 % Nonaccrual loans $ 6,511 $ 4,858 $ 4,913 $ 5,099 $ 5,295 Troubled debt restructuring 869 949 963 988 974 Loans - 90 days past due and still accruing 2 261 231 - 438 Total non-performing loans 7,382 6,068 6,107 6,087 6,707 OREO and repossessed assets 2,640 2,640 3,185 3,989 5,033 Total non-performing assets 10,022 8,708 9,292 10,076 11,740 Non-performing loans to total loans 0.31 % 0.26 % 0.26 % 0.27 % 0.29 % Non-performing assets to total assets 0.31 % 0.28 % 0.30 % 0.33 % 0.39 % Net charge-offs to average loans 0.04 % 0.01 % 0.00 % 0.02 % 0.04 % Net charge-offs (recoveries) $ 963 $ 317 $ (34 ) $ 426 $ 862 Other Information Total assets under management (in millions) $ 2,809 $ 2,746 $ 2,643 $ 2,615 $ 2,523 Full-time equivalent employees 580 581 585 582 578 (1) - Interest income on a fully tax equivalent basis includes the additional amount of interest income that would have been earned if investments in certain tax-exempt interest earning assets had been made in assets subject to federal, state and local taxes yielding the same after-tax income. (2) - Interim ratios not annualized\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005181/en/\nStock Yards Bancorp, Inc.\nNancy B. Davis, 502-625-9176\nExecutive Vice President and Chief Financial Officer\nSource: Stock Yards Bancorp, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180125005181/en/"], "published": "2018-01-25T15:00:00.000+02:00", "crawled": "2018-01-25T16:25:03.001+02:00", "highlightTitle": ""}