{"organizations": [], "uuid": "979cb7a1a89debe49c63a0c2b15a42c972486d18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226933860&w=1200&r=LYNXMPEE0U0TL", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews\r", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/us-alphabet-uber-trial/in-waymo-trial-what-fired-uber-executive-may-not-say-could-be-key-idINKBN1FK1O6", "country": "US", "domain_rank": 408, "title": "In Waymo trial, what fired Uber exec may not say could be key", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:12:00.000+02:00", "replies_count": 0, "uuid": "979cb7a1a89debe49c63a0c2b15a42c972486d18"}, "author": "", "url": "https://in.reuters.com/article/us-alphabet-uber-trial/in-waymo-trial-what-fired-uber-executive-may-not-say-could-be-key-idINKBN1FK1O6", "ord_in_thread": 0, "title": "In Waymo trial, what fired Uber exec may not say could be key", "locations": [], "entities": {"persons": [{"name": "uber", "sentiment": "none"}, {"name": "waymo", "sentiment": "none"}, {"name": "anthony levandowski", "sentiment": "none"}, {"name": "dan levine", "sentiment": "none"}, {"name": "levandowski", "sentiment": "none"}], "locations": [{"name": "waymo", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "uber", "sentiment": "none"}, {"name": "alphabet inc", "sentiment": "none"}, {"name": "waymo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "alexandria sage", "sentiment": "none"}, {"name": "uber technologies inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 12:28 PM / a few seconds ago In Waymo trial, what fired Uber executive may not say could be key Dan Levine , Alexandria Sage 5 Min Read \nSAN FRANCISCO (Reuters) - One of the most dramatic moments in an upcoming trade secrets trial between Alphabet Inc’s ( GOOGL.O ) Waymo and Uber will likely come when the former chief of Uber’s self-driving car unit takes the witness stand, as he is expected to repeatedly refuse to answer questions. \nWaymo sued Uber Technologies Inc last year, claiming that former Waymo engineer Anthony Levandowski downloaded more than 14,000 confidential files before leaving to set up a self-driving truck company, called Otto, which Uber acquired soon after. \nLevandowski, regarded as a visionary in autonomous technology, is not a defendant in the case but is on Waymo’s witness list. Waymo has accused Uber of benefiting from Waymo technology that it says Uber acquired through Levandowski. Uber has denied Waymo’s allegations and has argued that the data in the files were not trade secrets. \nThe case hinges on whether Uber used the alleged trade secrets to further its autonomous vehicle program. It may help determine who emerges in the forefront of the fast-growing field of self-driving cars. It is the highest-stakes legal challenge on a list of litigation that Uber’s chief executive, Dara Khosrowshahi, inherited when he joined the company in August. \n“This is a case that is the biggest in the history of Uber,” Uber attorney Bill Carmody told the court during a pretrial hearing on Tuesday. \nJury selection in the civil case is set for Wednesday in San Francisco federal court, with testimony expected to begin next week. \nDuring a pretrial deposition in April, Waymo lawyers questioned Levandowski for hours about allegations that he took Waymo’s trade secrets. He declined to answer any questions about his time at both companies, citing constitutional protections against self-incrimination over 300 times, according to a deposition transcript. Levandowski has never publicly addressed the allegations of taking the documents and law enforcement has not charged anyone with their theft. \nThe U.S. Department of Justice is conducting a criminal investigation into what transpired, according to court filings. \nGiven the ongoing probe, lawyers for both companies said at a hearing in September that they do not expect Levandowski to answer questions if called to the witness stand at trial. \nUber, Waymo and Miles Ehrlich, an attorney for Levandowski, declined to comment. \nU.S. District Judge William Alsup issued a ruling this month saying he would likely instruct jurors that they are allowed to draw negative conclusions against Uber should Levandowski take the stand and refuse to answer questions. \nElizabeth Rowe, a trade secret expert at the University of Florida Levin College of Law, said Levandowski refusing to answer questions on the stand, and the judge’s instructions around it, would hurt Uber’s case because it would reinforce Waymo’s arguments that he was deceptive and took their information. \nTo counter Levandowski’s expected refusal to answer questions, Rowe said Uber should tell jurors in opening statements that the company’s actions and those of Levandowski are separate, stressing that Uber fired the engineer last May. \n“They definitely might want to say, ‘Whatever he did, it was for himself, by himself, on his own, and we didn’t benefit from it,” Rowe said. \nAlsup granted Waymo’s request for a pretrial injunction in May, prohibiting Levandowski from working on Lidar, a sensor technology for self-driving cars that is the crux of the current litigation. \nIf Waymo persuades a jury that Uber stole its trade secrets, it said it would seek a permanent injunction to prohibit Uber from using them in the future. \nOther tech executives who could testify at trial include former Uber CEO Travis Kalanick, Benchmark venture capitalist Bill Gurley, and Waymo CEO John Krafcik, court documents showed. \nFor Uber, Rowe said the perfect juror would be someone who is willing to have the patience to delve into the minutiae of what exactly constitutes a trade secret, as opposed to focusing on Levandowski’s expected refusal to answer questions on the stand. Reporting by Dan Levine and Alexandria Sage; Editing by Lisa Shumaker", "external_links": [], "published": "2018-01-31T14:12:00.000+02:00", "crawled": "2018-01-31T14:37:26.023+02:00", "highlightTitle": ""}