{"organizations": [], "uuid": "970410331f44b85cb8d010dc32a9353c9bb7159e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225225869&w=1200&r=LYNXMPEE0O1FM", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-ecb-policy-breakingviews/breakingviews-mario-draghi-is-ill-equipped-for-currency-wars-idUSKBN1FE2MQ", "country": "US", "domain_rank": 408, "title": "Mario Draghi is ill-equipped for currency wars", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T02:01:00.000+02:00", "replies_count": 0, "uuid": "970410331f44b85cb8d010dc32a9353c9bb7159e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-ecb-policy-breakingviews/breakingviews-mario-draghi-is-ill-equipped-for-currency-wars-idUSKBN1FE2MQ", "ord_in_thread": 0, "title": "Mario Draghi is ill-equipped for currency wars", "locations": [], "entities": {"persons": [{"name": "mario draghi", "sentiment": "negative"}, {"name": "draghi", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "neutral"}, {"name": "ecb", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON It’s never good to bring a knife to a gunfight. European Central Bank President Mario Draghi on Thursday took a potshot at the United States for flouting an international agreement to avoid currency manipulation. But he has limited scope to resist a stronger euro. And European politicians who take up cudgels may escalate a brawl they will lose.\nA day after U.S. Treasury Secretary Steven Mnuchin pushed the dollar to three-year lows against the euro by saying a weaker greenback was good for his country, Draghi had his riposte ready. Without actually naming the United States, the ECB boss called out language that violated an international pledge to refrain from targeting exchange rates for competitive purposes.\nThe ECB president even dropped a hint that too big a rise in the euro might have policy consequences. A strengthening single currency hinders Draghi’s bid to push inflation back towards his close-to-2 percent target by pushing down the price of imported goods. Draghi could, for instance, prolong his bond purchase programme beyond September, or keep interest rates at record lows for longer than planned.\nNone of this was muscular enough to impress traders, who reacted by driving the euro to new three-year highs above $1.25. Dealers know the ECB is probably unlikely to embark on another round of monetary policy loosening when the economy is growing more quickly than anticipated, especially given German opposition to sub-zero rates.\nGranted, Draghi is not the only one who can wade into this fight. German Chancellor Angela Merkel or French President Emmanuel Macron could, if they wanted, take a leaf out of Mnuchin’s book and start touting the benefits of a weaker euro. One of Macron’s predecessors, Nicolas Sarkozy, had no qualms about asserting that the single currency was too strong when he was in office. But similar comments could provoke the U.S. administration into considering more drastic ways of helping its exporters, such as tariffs. Currency wars are hard to win when opponents are willing to use far more destructive weapons than exchange rates.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-26T02:01:00.000+02:00", "crawled": "2018-01-25T23:09:39.000+02:00", "highlightTitle": ""}