{"organizations": [], "uuid": "d47ecb2b9ad85086abff988c903b1bec9dfdd5f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/vive-pro_angle03.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/08/htc-virtual-reality-vive-pro-ces/", "country": "US", "domain_rank": 1196, "title": "HTC and Oculus Debut New VR Headsets, Vive Pro and Mi VR Standalone | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.225, "site_type": "news", "published": "2018-01-09T21:58:00.000+02:00", "replies_count": 0, "uuid": "d47ecb2b9ad85086abff988c903b1bec9dfdd5f6"}, "author": "Jonathan Vanian", "url": "http://fortune.com/2018/01/08/htc-virtual-reality-vive-pro-ces/", "ord_in_thread": 0, "title": "HTC and Oculus Debut New VR Headsets, Vive Pro and Mi VR Standalone | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Jonathan Vanian 7:58 PM EST \nTwo more virtual reality headsets are hitting the market from Taiwanese gadget maker HTC and Facebook’s Oculus VR business unit. \nThe companies announced the new VR headsets against the backdrop of this week’s annual International Consumer Electronics Show in Las Vegas. \nHTC said Monday that it plans to sell a new version of its Vive headset, the Vive Pro. Like the Vive, people will be able to wear the VR headset to surround themselves in digital worlds. \nThe Vive Pro will have an improved resolution compared to the older Vive model to help it present more compelling graphics and sharper text, the company said. A new headstrap will also let people more easily adjust the Vive Pro headset to fit their heads and better distribute weight so that it doesn’t feel too heavy, HTC said. \nHowever, HTC did not say when the headset would be available or how much it would cost. The company is pitching the Vive Pro as an “upgrade” to the current Vive headset, but it’s unclear if current Vive owners will be able to trade their existing headsets in for the new models when they eventually debut. \nHTC also did not say if the VR headset would require a more powerful computer to operate than the current Vive headset. \nFortune contacted HTC for more information and will update this story if it responds. \nGet Data Sheet , Fortune’s technology newsletter. \nHTC is also describing the Vive Pro as a “premium” consumer device intended for “VR enthusiasts,” which likely means that it will cost more than the current Vive, which costs $600 after a $200 price cut in August. \nMeanwhile, Oculus also said Monday that it plans to debut the Mi VR Standalone VR headset that will go on sale in China sometime in 2018. \nThe Mi VR headset appears to be similar to the company’s recently announced Oculus Go headset , which costs $200, does not require a computer to operate , but will display less impressive visuals than the Oculus Rift headset. \nThe Mi VR Standalone headset will also contain a “powerful video player” and a “localized social experience,” intended specifically for Chinese users and that will be built by Chinese tech firm Xiaomi. Oculus did not say how much the Mi VR headset will cost. \nOculus also said that Xiaomi will help build the new Oculus Go and Mi VR headsets. Facebook’s (fb) current head of VR, Hugo Barra, was previously Xiaomi’s vice president of global operations before joining the social network a year ago. \n“Through our partnership with Xiaomi, both Oculus Go and Mi VR Standalone represent our first step in delivering that sweet spot between mobile and PC VR,” Facebook vice president of VR Hugo Barra said in a statement. “These devices will be, hands down, the easiest way to get into VR.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T21:58:00.000+02:00", "crawled": "2018-01-09T10:14:24.110+02:00", "highlightTitle": ""}