{"organizations": [], "uuid": "07f0b5cd844565624919e4d2be69ddb3132d7473", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225239960&w=1200&r=LYNXMPEE0O1HX", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/trade-nafta/u-s-has-not-moved-an-inch-during-the-nafta-talks-say-sources-idINKBN1FE28D", "country": "US", "domain_rank": 408, "title": "NAFTA negotiations grind on, little sign of quick breakthrough", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T20:56:00.000+02:00", "replies_count": 0, "uuid": "07f0b5cd844565624919e4d2be69ddb3132d7473"}, "author": "", "url": "https://in.reuters.com/article/trade-nafta/u-s-has-not-moved-an-inch-during-the-nafta-talks-say-sources-idINKBN1FE28D", "ord_in_thread": 0, "title": "NAFTA negotiations grind on, little sign of quick breakthrough", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "david ljunggren", "sentiment": "none"}, {"name": "anthony esposito", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "min read  montreal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONTREAL (Reuters) - U.S. officials on Thursday probed Canadian proposals for unblocking talks on NAFTA but there were few signs of progress, raising questions about whether any real movement is happening at the latest round of negotiations on the treaty.\nTeams from Canada, Mexico and the United States are in Montreal for the sixth and penultimate set of talks on the North American Free Trade Agreement. Major differences remain to be settled ahead of the end-March deadline.\nThe administration of U.S. President Donald Trump, which has repeatedly threatened to walk away from the 1994 pact, wants more North American content in autos and is pressing for a sunset clause that would allow one party to pull out of the treaty after five years.\nOn Wednesday, Canadian negotiators unveiled what they termed “creative ideas” to address U.S. demands for a sunset clause and higher auto content.\nU.S. Trade Representative Robert Lighthizer met Canadian Foreign Minister Chrystia Freeland at the World Economic Forum in Davos on Thursday and asked a series of technical questions about the autos proposals, said a source briefed on the meeting.\nCanada suggests North American content would be higher if the value of software and other high-tech equipment made on the continent were taken into account.\nCanadian chief negotiator Steve Verheul described the mood at the talks as “still reasonably constructive” and said the U.S. side would take the auto proposals back to Washington.\n“I think it went reasonably well. There is a lot more thinking to do,” he told reporters on Thursday.\nTrump, who has made contradictory comments about the 1994 treaty in recent weeks, told CNBC, “NAFTA’s a horrible deal, we’re renegotiating it. I may terminate NAFTA, I may not - we’ll see what happens.”\nDespite signs of possible movement on the autos file, there remain large gaps between the United States and its partners, indicating much work must be done if the process is to wrap up by end-March as planned.\nEarlier, one source close to the talks complained that “we have brought flexibility, we have brought ideas, but the problem is that the United States has not moved an inch”.\nTensions between Canada and the United States were set to rise on Friday when a U.S. trade commission is due to rule on whether to confirm steep anti-dumping tariffs on planemaker Bombardier Inc. A Canadian government source said Ottawa expected Bombardier to lose.\nUncertainly over NAFTA’s future is weighing on some North American markets and policymakers. Bank of Canada Governor Stephen Poloz told CNBC on Thursday that NAFTA is the “number one” thing that keeps him up at night.\nTrade groups representing automakers and auto parts manufacturers say U.S. demands for higher content would disrupt the highly integrated North American car industry.\nJerry Dias, leader of Canada’s Unifor labour union, met Verheul on Thursday for talks on the autos issue and told reporters “there is some understanding from the U.S. team it may be a proper track to start to break some of the log jams”.\nFiat Chrysler Automobiles NV ( FCHA.MI ) Chief Executive Officer Sergio Marchionne told an earnings call that “there appears to be the beginning of a solution to this problem. ... The concept embedded in the Canadian proposal is defensible.”\nFreeland had earlier sounded more upbeat, noting said nobody was expecting a deal to be struck in the current round of talks.\nLance Fritz, chief executive officer of Union Pacific Corp ( UNP.N ) railroad company, told Reuters that while he was not in Montreal, he was “constantly in contact” with U.S. officials close to the negotiations. He said the talks must be collaborative. “If the U.S. is intransigent, that is a concern.”\nAdditional reporting by Tom Miles in Davos and Andrea Hopkins in Ottawa and Nick Carey in Detroit; Editing by David Gregorio and Jonathan Oatis\n ", "external_links": [], "published": "2018-01-25T20:56:00.000+02:00", "crawled": "2018-01-25T21:29:46.021+02:00", "highlightTitle": ""}