{"organizations": [], "uuid": "b837242e5cad0a59b55ce6fe1b8b7e62a395f1a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/07/gettyimages-655512164.jpg", "site_section": "http://feeds.feedburner.com/google/rJLX", "section_title": "ATTACK - Google News", "url": "http://fortune.com/2018/01/04/data-sheet-meltdown-spectre-intel-arm-amd/", "country": "US", "domain_rank": 1196, "title": "Data Sheet—Meltdown and Spectre Security Attacks Haunt Chip Industry - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T17:08:00.000+02:00", "replies_count": 0, "uuid": "b837242e5cad0a59b55ce6fe1b8b7e62a395f1a2"}, "author": "", "url": "http://fortune.com/2018/01/04/data-sheet-meltdown-spectre-intel-arm-amd/", "ord_in_thread": 0, "title": "Data Sheet—Meltdown and Spectre Security Attacks Haunt Chip Industry - Fortune", "locations": [], "entities": {"persons": [{"name": "getty images", "sentiment": "negative"}, {"name": "alexander koerner", "sentiment": "negative"}, {"name": "robert hackett", "sentiment": "none"}, {"name": "adam lashinsky", "sentiment": "none"}], "locations": [], "organizations": [{"name": "spectre security attacks haunt chip industry - fortune data sheet", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "fortune", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Data Sheet—Meltdown and Spectre Security Attacks Haunt Chip Industry Alexander Koerner—Getty Images 10:08 AM EST \n(Adam Lashinsky is on vacation. Today’s essay is by Fortune writer Robert Hackett.) \nA bomb cyclone hit the IT world on Wednesday as tech giants and computer security researchers released details pertaining to two major security holes that affect the processors in almost all computers. Researchers—including ones employed by the likes of Google , various tech firms, and academic —independently discovered the attacks last year. \nThe vulnerabilities could allow attackers to swipe sensitive secrets from the memory of almost all devices, including phones, tablets, PCs, and computer servers. Experts have warned that hackers could develop exploits to purloin personal data, passwords, cryptographic keys, and other supposedly inaccessible information from targets. \nSeveral programmers have already demonstrated proofs of concept for these so-called side channel attacks. \nThe attacks plague hardware produced by top chip makers like Intel and Advanced Micro Devices, and SoftBank-owned chip designer ARM Holdings. Big tech companies, including Microsoft and Apple, have been scrambling in recent weeks to address these threats by developing fixes for their software while cloud computing giants, like Amazon and Google , have been rushing to apply patches to their data center infrastructure. \nThe first attack, dubbed “ Meltdown ,” is specific to Intel chips and allows hackers to circumvent the isolation barrier between user applications and operating systems, thereby opening up access to otherwise restricted machine memory. The second problem, “ Spectre ,” which is harder to exploit but has no available patches, lets hackers pry secrets out of the memory of devices running Intel, AMD, and ARM chips. \nFor more coverage of the flaws and the industry’s response so far, see our in-depth story . Robert Hackett @ NEWSWORTHY \nSpeed Racer. The next generation of faster wireless networks is drawing closer. AT&T says it will begin offering 5G service for mobile phones in a dozen cities by year end. Just how many 5G-capable phones will be on the market and in the hands of consumers by then is an open question, however. \nUnderdog . Google may sell Zagat , the restaurant review guide started by Tim and Nina Zagat back in the 1970s that the search giant bought for $151 million seven years ago, Reuters reported on Wednesday. Google had “informal” talks with multiple potential buyers, but no deal has been struck yet. \nSchoolhouse Rock. The world’s largest streaming music service, Spotify, filed to go public with the Securities and Exchange Commission last month, Axios reported . The confidential filing contemplates a so-called direct listing rather than an offering of shares underwritten and sold by Wall Street banks. \nThe Jetsons. It’s almost time for the big CES show in Las Vegas and that means lots of new product announcements. Dell and Lenovo updated some of their best-selling laptops with the newest Intel processors and USB-C ports. Tired of black? The new Dell XPS 13 comes in rose gold. \nInspector Gadget. Mesh Wi-Fi gear maker Eero said it decided not to pursue an undisclosed “related project,” resulting in layoffs. (TechCrunch put the number at 30 people or 20% of the company’s workforce.) \nBeavis and Butthead . Russia and Venezuela are looking at developing state-sponsored digital currencies as a way to avoid international sanctions, according to the New York Time s. “This instrument suits us very well,” Sergei Glazyev, an advisor to Russian President Vladimir Putin, said. “We can settle payments with our business partners all over the world regardless of sanctions.” FOOD FOR THOUGHT \nI wonder how many people made a New Year’s resolution to spend less time in meetings in 2018. It’s probably a smart strategy in most organizations. Marketing strategist Dorie Clark has a clever piece in the Harvard Business Review to help make that happen. Titled “How to Get Out of a Meeting You Know Will Waste Your Time,” the article offers a handful of excuses and arguments to duck the next time-wasting get together. Here’s one: \nIf you want to get out of the meeting but still feel it’s difficult to say no, suggest a minimally invasive compromise. A meeting will almost certainly take an hour or more of your time. See if the meeting organizer would be willing to update you over email, or if a short phone call to get your input might suffice. Alternatively, if the topic isn’t urgent, you can try a time dodge: “I’m traveling heavily for business the next three weeks, but we could reconnect after that. Perhaps you could email me the week of the 23rd for us to find a time?” Oftentimes, the requester will get distracted and forget, or discover that whatever they felt was so urgent has diminished in importance. You’ll get points for appearing helpful, but ultimately won’t have to attend the meeting. IN CASE YOU MISSED IT", "external_links": [], "published": "2018-01-04T17:08:00.000+02:00", "crawled": "2018-01-04T20:59:13.006+02:00", "highlightTitle": ""}