{"organizations": [], "uuid": "2f53bffd267c411a91dccfa454b511b789ab888d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-seaspine-announces-preliminary-results-for-fourth-quarter-and-full-year-2017.html", "country": "US", "domain_rank": 767, "title": "SeaSpine Announces Preliminary Results for Fourth Quarter and Full-Year 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "2f53bffd267c411a91dccfa454b511b789ab888d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-seaspine-announces-preliminary-results-for-fourth-quarter-and-full-year-2017.html", "ord_in_thread": 0, "title": "SeaSpine Announces Preliminary Results for Fourth Quarter and Full-Year 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "carlsbad", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "seaspine holdings corporation", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CARLSBAD, Calif., Jan. 08, 2018 (GLOBE NEWSWIRE) -- SeaSpine Holdings Corporation (NASDAQ:SPNE), a global medical technology company focused on surgical solutions for the treatment of spinal disorders, announced today preliminary financial results for fourth quarter and full-year 2017.\nPreliminary and unaudited revenue for fourth quarter 2017 is expected to be in the range of $34.2 million to $34.4 million, reflecting approximately 6% growth compared to the prior year period. Compared to fourth quarter 2016, total U.S. revenue is expected to increase 6% to approximately $31.5 million, with U.S. orthobiologics revenue expected to increase approximately 12% to $16.9 million and U.S. spinal implants revenue expected to be essentially flat at $14.6 million.\nPreliminary and unaudited full-year 2017 revenue is expected to be in the range of $132.0 million to $132.2 million, reflecting growth of approximately 2.5% over full-year 2016.\nCash and cash equivalents at December 31, 2017 are expected to be approximately $10.8 million and the Company had no outstanding borrowings under its $30 million credit facility. The Company did not sell any shares of its common stock under its “at the market” equity offering program during fourth quarter 2017.\n“We are encouraged by our revenue growth in the fourth quarter and, in particular, the strong performance of our U.S. orthobiologics franchise,” said Keith Valentine, President and Chief Executive Officer of SeaSpine. “As we continue to launch innovative products and gain traction with our distributor base, we expect our spinal implants franchise to deliver top line growth in 2018. We are confident that focused execution of our commercial strategy, investments in new products, and our growing distribution network position SeaSpine for sustained and accelerating revenue growth beginning in the second half of 2018.”\n2018 Financial Outlook\nSeaSpine expects full-year 2018 revenue to be in the range of $135 million to $139 million.\nAbout SeaSpine\nSeaSpine ( www.seaspine.com ) is a global medical technology company focused on the design, development and commercialization of surgical solutions for the treatment of patients suffering from spinal disorders. SeaSpine has a comprehensive portfolio of orthobiologics and spinal implants solutions to meet the varying combinations of products that neurosurgeons and orthopedic spine surgeons need to perform fusion procedures on the lumbar, thoracic and cervical spine. SeaSpine’s orthobiologics products consist of a broad range of advanced and traditional bone graft substitutes that are designed to improve bone fusion rates following a wide range of orthopedic surgeries, including spine, hip, and extremities procedures. SeaSpine’s spinal implants portfolio consists of an extensive line of products to facilitate spinal fusion in minimally invasive surgery (MIS), complex spine, deformity and degenerative procedures. Expertise in both orthobiologic sciences and spinal instrumentation product development allows SeaSpine to offer its surgeon customers a differentiated portfolio and a complete solution to meet their fusion requirements. SeaSpine currently markets its products in the United States and in over 30 countries worldwide.\nForward-Looking Statements\nSeaSpine cautions you that statements included in this news release that are not a description of historical facts are forward-looking statements that are based on the Company's current expectations and assumptions. Such forward-looking statements include, but are not limited to, statements relating to: the spinal implants franchise delivering top line growth in 2018; the Company’s ability to generate sustained and accelerating revenue growth beginning in the second half of 2018; and the Company’s expectations for full-year 2018 revenue. In addition, this release contains preliminary financial results for fourth quarter and full-year 2017. Preliminary results for 2017 are provided prior to completion of all internal and external review and audit procedures and therefore are subject to adjustment. Among the factors that could cause or contribute to material differences between the Company’s actual results and the expectations indicated by the forward-looking statements are risks and uncertainties that include, but are not limited to: surgeons’ willingness to continue to use the Company’s existing products and to adopt its newly launched products, including the risk that the Company’s products do not demonstrate adequate safety or efficacy, independently or relative to competitive products, to support expected levels of demand or pricing; the ability of newly launched products to perform as designed and intended and to meet the needs of surgeons and patients, including as a result of the lack of clinical validation of products in limited commercial (or “alpha”) launch; the Company’s ability to attract new, high-quality distributors, whether as a result of inability to reach agreement on financial or other contractual terms or otherwise, disruption to the Company’s existing distribution network as new distributors are added, and the ability of new distributors to generate growth or offset disruption to existing distributors; continued pricing pressure, whether as a result of consolidation in hospital systems, competitors or others, as well as exclusion from major healthcare systems, whether as a result of unwillingness to provide required pricing or otherwise; the risk of supply shortages and the associated, potentially long-term disruption to product sales, including as a result of the Company’s dependence on a limited number of third-party suppliers for components and raw materials, or otherwise; unexpected expense and delay, including as a result of developing and supporting the launch of new products, the fact that newly launched products may require substantial additional development activities, which could introduce further expense and delay, or as a result of obtaining regulatory clearances; the Company’s ability to continue to invest in product development and sales and marketing initiatives at levels sufficient to drive future revenue growth, including as a result of its inability to obtain funding on a timely basis on acceptable terms, or at all; general economic and business conditions in the markets in which the Company does business, both in the U.S. and abroad; and other risks and uncertainties more fully described in the Company’s news releases and periodic filings with the Securities and Exchange Commission. The Company’s public filings with the Securities and Exchange Commission are available at www.sec.gov .\nYou are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date when made. SeaSpine does not intend to revise or update any forward-looking statement set forth in this news release to reflect events or circumstances arising after the date hereof, except as may be required by law.\nInvestor Relations Contact\nLynn Pieper Lewis\n(415) 937-5402\nir@seaspine.com\nSource:SeaSpine Holdings Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/704e0380-b8fd-4e03-bfa6-01ad6c9144e5", "https://www.globenewswire.com/Tracker?data=0jpB_yFExEPctnRvRRgOM3X9c2bAGUIUTfZ36mRIVo3QF_H07YpW_JV_bTf6p5IoUQt5pW1pWl3mrJmahRdrcA=="], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:11:36.077+02:00", "highlightTitle": ""}