{"organizations": [], "uuid": "406e50b06750d8114719648682745f1dafdaa39c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223079473&w=1200&r=LYNXMPEE0H1EU", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-italy-election-berlusconi/italys-berlusconi-says-he-is-ready-to-be-premier-if-european-court-lifts-ban-idUSKBN1F72CX", "country": "US", "domain_rank": 408, "title": "Italy's Berlusconi says he is ready to be premier if European court lifts ban", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:47:00.000+02:00", "replies_count": 0, "uuid": "406e50b06750d8114719648682745f1dafdaa39c"}, "author": "", "url": "https://www.reuters.com/article/us-italy-election-berlusconi/italys-berlusconi-says-he-is-ready-to-be-premier-if-european-court-lifts-ban-idUSKBN1F72CX", "ord_in_thread": 0, "title": "Italy's Berlusconi says he is ready to be premier if European court lifts ban", "locations": [], "entities": {"persons": [{"name": "europ", "sentiment": "negative"}, {"name": "berlusconi", "sentiment": "negative"}, {"name": "silvio berlusconi", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "strasbourg", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european court of human rights", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "upper house senate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 4:47 PM / in 7 minutes Italy's Berlusconi says he is ready to be premier if European court lifts ban Reuters Staff 3 Min Read \nROME (Reuters) - Former prime minister Silvio Berlusconi said on Thursday he was ready to lead Italy again if the European Court of Human Rights scrapped a ban on him holding public office. \nAfter a resignation in 2011 amid scandal over his private life and an acute debt crisis the billionaire media mogul has bounced back. He is now leading a center-right coalition which polls see as having the best chance of forming a government after elections on March 4. \nHowever, the coalition has no jointly agreed candidate for prime minister and the 81-year-old had not indicated previously he would be willing to take on the job. \nBerlusconi was convicted of tax fraud in 2013 and subsequently stripped of his seat in the upper house Senate and banned from holding office until 2019, a decision he has asked the European court to overturn. [nL8N1NS1Q3] \n“I would have a duty ... if a ruling were to arrive from Strasbourg that reversed the Senate’s decision to expel me, I don’t think I could refuse,” he said on La7 television. \nHe acknowledged he thought it “unlikely” that the Strasbourg court would come up with a ruling before the vote. Judges began hearing arguments in the case only in November and could take several more months. \nBerlusconi’s main coalition partner, leader of the anti-immigrant League Matteo Salvini, has made clear he wants to be premier. \nBut Berlusconi dismissed this. “Forceful center-forward that he is, he could do well at the Interior Ministry,” he said. \nDespite this a person close to Berlusconi said he seemed not to want another mandate as prime minister and suggested he would settle for staying at the head of his Forza Italia (Go Italy!) party and back a different candidate to head the government. \n“I don’t have the sense he wants to play another round as prime minister,” said the source, who asked not to be named. \nHe has floated the names of a military police general, European Central Bank governor Mario Draghi or the CEO of carmaker Fiat Chrysler, Sergio Marchionne. [nL8N1NX1CP] \nThe center-right coalition, which also includes the smaller, right-wing Brothers of Italy, is polling well ahead of its nearest rivals, but is still shy of the 40 percent consensus that would give it a realistic chance of governing alone. \nWhichever center-right party gets the most votes will choose the prime minister candidate, their leaders have agreed. Currently, Forza Italia is ahead, polling between roughly one and six points above the League. Reporting by Isla Binnie; Editing by Gavin Jones and Richard Balmforth", "external_links": [], "published": "2018-01-18T18:47:00.000+02:00", "crawled": "2018-01-18T18:58:32.004+02:00", "highlightTitle": ""}