{"organizations": [], "uuid": "34f43c5b0825ac54564ef1572853daa7c2371b22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/treadmill.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/12/treadmill-meetings-wall-street-dinners/", "country": "US", "domain_rank": 1196, "title": "Treadmill Meetings, Spinning Are Wall Street’s New Steak Dinners | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.118, "site_type": "news", "published": "2018-01-12T13:35:00.000+02:00", "replies_count": 0, "uuid": "34f43c5b0825ac54564ef1572853daa7c2371b22"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/12/treadmill-meetings-wall-street-dinners/", "ord_in_thread": 0, "title": "Treadmill Meetings, Spinning Are Wall Street’s New Steak Dinners | Fortune", "locations": [], "entities": {"persons": [{"name": "vicky land", "sentiment": "none"}, {"name": "sean liebowitz", "sentiment": "none"}, {"name": "equinox", "sentiment": "none"}, {"name": "barry", "sentiment": "none"}, {"name": "sanford bernstein", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 11:35 AM EST \nMost health trends come and go, almost as soon as you’ve unpacked your cold press juicer. \nBut the business world’s affinity for combining client meetings and work outs is only getting stronger at intensive fitness spots like Barry’s Bootcamp, SoulCycle, and Rumble, and gyms like Equinox. The trend has been building for a while now with professionals in media relations and the entertainment industry in cities like New York and Los Angeles, with bankers slowly beginning to jump on the model over the last years. Now, Wall Street is fully engaged in this mentality. \n“Instead of going out, I see so many entertain by going to workout classes before and after work,” says Sean Liebowitz, a director and energy/industrials trader at Sanford Bernstein, who specifically mentions Rumble, SoulCycle, and Ripped as popular venues. \nBarry’s Bootcamp, where much of the maximum cardio workouts take place on treadmills that are kicked up to 10 mph, has seen an increase in early bookings to insure side-by-side workout spots. Vicky Land, vice president of communications and brand strategy at Barry’s, notes that that kind of service comes at a premium. \n“We often act as a concierge service to guarantee side-by-side treadmills. We do that that quite frequently for people in finance,” she says. “We have a lot of ‘two spots’ which are people ‘sweat-entertaining.’” \nThe cost is $50 per person, almost 30 percent more than an average class. The experience validates the cost, says Land. \n“Everything is relationship based these days. If you have a fun work out with a client, it’s much more impactful than wheeling and dealing over the dinner table,” she says. \nUnsurprisingly, Land says that the Tribeca and NoHo locations are the ones where they see the highest percentage of client workouts. They have no immediate plans to open in the Financial District. “We get a lot of requests to open in Midtown, where there are a lot of hedge funds. Last year we actually got a call from a hedge fund asking if we could hold Barry’s classes in their large private gym,” she reports. \nAt the high intensity biking destination SoulCycle, there is now a four person corporate sales team to accommodate the demand for events and special business requests. “There are only so many steaks business people want to eat in a week,” says Gabby Etrong Cohen, senior vice president of PR and brand strategy. “Across the board, people are time strapped, they don’t have 4 hours to hit the golf course, or 2 hours for a boozy meal. Plus, they want to do something good for themselves, plus they get networking out of it.” \nSome of SoulCycle’s biggest finance clients are Bank of America , J.P. Morgan , Goldman Sachs , Barclays, Citigroup , Deutsche Bank, and ING, according to Cohen. The company has 84 studios across the U.S. and Canada; the Financial District location is one of the busiest in early mornings. Cohen notes that San Francisco’s South of Market studio also does heavy corporate business. \nAt Equinox, group fitness classes like Playground Experience (PGX)—a training circuit which can be broken out into different teams—is a popular place for members to bring clients. According to Bloomberg, PGX has attracted finance people like Strauss Zelnick, founder of Zelnick Media Capital. \n“Our mission at Equinox is to empower our members to maximize their potential,” says Equinox chief marketing officer, Vimla Black Gupta. “Our mission rings especially true for those members working in the finance industry where finding balance isn’t a luxury they can always enjoy.” \nEarlier this year, Equinox, who own SoulCycle, invested in the boxing-oriented fitness company, Rumble, which has an outpost in NoHo and has a big following in the business community. \nSanford Bernstein’s Liebowitz said that there has been a noticeable trend towards more health-related and fewer boozy-type events, adding that “less traders want to be out late or simply feel gross the next day because of a huge meal or drinking.” \nThese fitness temples aren’t just work out destinations for the business world. They’ve become places of employment for former finance people as well. Among its employees, Barry’s counts Austin Caghley who went from being a business analyst at Goldman Sachs to a popular instructor. Justin Meli, a business consultant with an MBA, now teaches Barry’s in Washington. \n“His background helps him bond with and understand the mentality of business leaders,” says Devin Murphy, who spent over 4 years at the hedge fund Coatue Management and then four more at Sypartners, consulting for Fortune 100 companies. She was a five-times-a-week Barry’s client; now she’s the vice president of operations. \nIn the last year, Murphy has seen an increase in a demand for classes at Barry’s as what makes businesses competitive for employees. “We keep hearing from human resources in finance, ‘all our employees are banging down the door to make this part of our wellness package.’” \nSome companies take an even more direct approach, according to Murphy. She says it’s common for hedge funds to buy-out entire classes for just 15 people. “It’s partly networking and partly team-building. We see people from finance do buy outs at least once a week.” \nThe cost to book an entire class at a peak time: $5,000. \n“They take the 5 a.m. class. That way they still get to work early. And it’s also the accountability,” she says. “You would hear it if you get to the trading desk and you were the one who didn’t show up for class.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-12T13:35:00.000+02:00", "crawled": "2018-01-12T22:03:35.004+02:00", "highlightTitle": ""}