{"organizations": [], "uuid": "b0ac480fec1ec8c59f786ff71e48b03b750234bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 44, "shares": 44, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/14/104945773-GettyImages-904038194.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/14/china-editorial-criticizes-marriott-delta-and-more.html", "country": "US", "domain_rank": 767, "title": "China editorial criticizes Marriott, Delta and more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.692, "site_type": "news", "published": "2018-01-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "b0ac480fec1ec8c59f786ff71e48b03b750234bb"}, "author": "Huileng Tan", "url": "https://www.cnbc.com/2018/01/14/china-editorial-criticizes-marriott-delta-and-more.html", "ord_in_thread": 0, "title": "China editorial criticizes Marriott, Delta and more", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "zhejiang", "sentiment": "none"}, {"name": "hangzhou", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "macau", "sentiment": "none"}, {"name": "tibet", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "marriott", "sentiment": "negative"}, {"name": "delta", "sentiment": "negative"}, {"name": "delta air lines", "sentiment": "none"}, {"name": "marriott international", "sentiment": "none"}, {"name": "china daily", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet \n“What if a Chinese enterprise listed Alaska or Hawaii as an independent country rather than a state of the United States ?” a Beijing-owned newspaper asked Sunday amid a political ruckus spurred by foreign companies. \nJust as those territories are part of the U.S., the recent China Daily editorial argued, Hong Kong , Macau , Taiwan and Tibet are “all parts of China.” So Beijing’s ire was justified, the opinion piece suggested, when it cracked down on several international firms for listing those locations as separate countries on internet platforms. \nLast week, a Chinese regulator suspended Marriott International’s Chinese website for a week after it listed those places as separate countries in a questionnaire for members of its rewards program. Delta Air Lines also came under fire for listing Taiwan and Tibet as countries on its website. Medical device-maker Medtronic and Inditex-owned fashion brand Zara faced similar issues. \nThe four companies have all apologized. \n“These foreign companies should be aware that Chinese people are particularly sensitive to the status of Tibet, Hong Kong, Macao and Taiwan, which are all parts of China,” said China Daily, which called the characterization of the regions a “terrible mistake.” \n“There is not the least reason for Marriott and the other foreign companies to list these regions as independent countries on any occasion. They should have known that they would provoke a strong reaction from Chinese people,” the English language piece added. \nIt is also a breach of China’s Cyber Security Law and the Advertising Law, which prohibit any individual or company from activity that “undermines the country’s sovereignty and territorial integrity,” it said. \nHong Kong and Macau are former European territories that are now managed as special administration regions of China. Beijing regards Taiwan as a renegade province. China annexed Tibet in 1950, although Beijing has claimed the Himalayan region has been an indivisible part of China throughout history. \nThe current furor reflects Beijing’s increasing assertiveness internationally and the sensitivity of territorial rights for the mainland Chinese public. \nThe Chinese foreign ministry said Friday afternoon that Hong Kong, Macau, Taiwan and Tibet are all “parts of China.” \n“This is the objective fact as well as the consensus of the international community,” said the ministry’s spokesman, Lu Kang, at a scheduled press conference. \nForeign companies operating in China “should respect China’s sovereignty and territorial integrity, abide by China’s laws and respect Chinese people’s national feelings,” Lu said. \n“This is the minimum requirement for any enterprise to invest, operate and conduct cooperation in another country,” he added. \nAs to what would happen to a Chinese company listing Alaska or Hawaii as independent countries, the China Daily theorized: \n“It would definitely be considered as having infringed on the sovereignty and territorial integrity of the United States. Of course, none of them would be stupid enough to make such a mistake as they well know that they should respect the sovereignty and territorial integrity of a country when doing business there.” \n—Reuters contributed to this report.", "external_links": [], "published": "2018-01-14T02:00:00.000+02:00", "crawled": "2018-01-15T06:13:41.000+02:00", "highlightTitle": ""}