{"organizations": [], "uuid": "7d0dd9f53caa589888cb91612a04d8e4896b90f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-oil-shipping-atlantic/trans-atlantic-fuel-market-in-january-ships-passing-in-the-night-idUSKBN1F80HG", "country": "US", "domain_rank": 408, "title": "Trans-Atlantic fuel market in January: Ships passing in the night", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.757, "site_type": "news", "published": "2018-01-19T14:15:00.000+02:00", "replies_count": 0, "uuid": "7d0dd9f53caa589888cb91612a04d8e4896b90f9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-oil-shipping-atlantic/trans-atlantic-fuel-market-in-january-ships-passing-in-the-night-idUSKBN1F80HG", "ord_in_thread": 0, "title": "Trans-Atlantic fuel market in January: Ships passing in the night", "locations": [], "entities": {"persons": [{"name": "john auers", "sentiment": "none"}], "locations": [{"name": "london/new york", "sentiment": "none"}, {"name": "u.s. east coast", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "u.s. gulf coast", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "turner, mason & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON/NEW YORK (Reuters) - A cold blast that hit the U.S. East Coast has upended the diesel market, as fully-laden tankers criss-crossed the Atlantic to deliver fuel to both sides of the ocean, and various shippers attempted to take advantage of ever-changing market conditions.\nDozens of tankers are set to deliver diesel from the U.S. Gulf Coast to Europe in January, a routine maneuver due to favorable prices for U.S. shippers.\nIn a much rarer move, more than a dozen vessels will also ship diesel from Europe to the U.S. East Coast. Benchmark diesel prices spiked to a two-year record after the extreme cold that hit the U.S. East Coast earlier this month, making diesel imports into the region highly profitable for a short window of time.\n“In the short-term we’ve had a really big bump in heating oil demand on the East Coast,” said John Auers, executive vice president at consultancy Turner, Mason & Co.\nNimble traders that were able to lock in that brief arbitrage are now shipping tankers. The westbound arbitrage is relatively uncommon, because European refineries do not produce enough diesel to meet demand in Europe, where around half the auto fleet uses diesel engines.\nTankers carrying around 650,000 tonnes of diesel have been booked in January out of the U.S. Gulf Coast refining hub to Europe and the Mediterranean, according to shipping data and traders.\nIn the other direction, around 300,000 tonnes were booked out of Europe and the Baltics to go to New York and storage sites in the Caribbean.\n“Colder weather there and relatively warmer temperatures in Europe are the reason the HOGO blew up,” a trader said, referring to the ticker symbol that represents the spread between U.S. and European benchmark diesel future.\nWhile diesel generally flows from the U.S. Gulf Coast to the east through pipelines, marine movements can be needed when those conduits are full. Because shipments within the United States require more expensive Jones Act compliant vessels, shipping costs for foreign diesel imports can be less costly by comparison, Auers said.\nIt is unclear how many vessels will end up in the East Coast as a number have made a U-turn in recent weeks as European prices recovered, according to sources. Other tankers were also booked out of India and the Middle East to New York, according to shipping data.\nDiesel fuel for prompt delivery in New York Harbor hit a two-year record of $2.0342 per gallon on Jan. 12, but has cooled in recent days to $2.0021 on Thursday.\nDistillates stocks, which include diesel and heating oil, in the East Coast dropped last week by around 8 percent to 46 million barrels, lowest seasonally since 2015, according to the Energy Information Administration.\nCold weather in the U.S. Gulf shut refineries in the most recent week, which may further restrict supplies to the eastern U.S. in coming days. [EIA/S]\nReporting By Ron Bousso and; Jessica Resnick-Ault; Editing by Alistair Bell\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T14:15:00.000+02:00", "crawled": "2018-01-20T17:49:29.077+02:00", "highlightTitle": ""}