{"organizations": [], "uuid": "f6a2d6bf27b7698bc88086907ac8f3beda3f8a60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/insurance-farming-women/climate-insurance-scheme-targets-women-farmers-in-africa-asia-idUSL8N1PB5AB", "country": "US", "domain_rank": 408, "title": "Climate insurance scheme targets women farmers in Africa, Asia", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:20:00.000+02:00", "replies_count": 0, "uuid": "f6a2d6bf27b7698bc88086907ac8f3beda3f8a60"}, "author": "", "url": "https://www.reuters.com/article/insurance-farming-women/climate-insurance-scheme-targets-women-farmers-in-africa-asia-idUSL8N1PB5AB", "ord_in_thread": 0, "title": "Climate insurance scheme targets women farmers in Africa, Asia", "locations": [], "entities": {"persons": [{"name": "stefan hirche", "sentiment": "none"}, {"name": "alex whiting", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "myanmar", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "cambodia", "sentiment": "none"}, {"name": "malawi", "sentiment": "none"}, {"name": "mali", "sentiment": "none"}, {"name": "zambia", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}], "organizations": [{"name": "global parametrics", "sentiment": "none"}, {"name": "visionfund international", "sentiment": "none"}, {"name": "insuresilience investment fund", "sentiment": "none"}, {"name": "thomson reuters foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 5:21 PM / Updated an hour ago Climate insurance scheme targets women farmers in Africa, Asia Alex Whiting 5 Min Read \nROME, Jan 18 (Thomson Reuters Foundation) - A major insurance scheme launched on Thursday aims to help up to 4 million poor people in Africa and Asia rebuild their lives after climate disasters, its backers said. \nThe insurance programme - covering droughts in Kenya, Malawi, Mali, Zambia and Cambodia, and tropical cyclones in Myanmar - will support mostly women farmers and their families. \n“African and Asian countries are highly vulnerable to the effects of climate change and natural catastrophes,” said Stefan Hirche, board chairman of the InsuResilience Investment Fund, which is helping finance the new scheme. \nThe goal is to reduce the vulnerability of small businesses and low-income households in those regions, he added. \nThe African and Asian Resilience in Disaster Insurance Scheme (ARDIS) is being led by VisionFund International, the microfinance arm of development charity World Vision, and Global Parametrics, a new venture backed by the British and German governments. \nAll farmers eligible for the scheme, one of the largest climate insurance programmes run by non-governmental groups, are clients of VisionFund - about 80 percent of them women. \nMore than 690,000 families, totalling up to 4 million people, stand to benefit, according to the organisers. \nDuring a drought, if soil moisture drops below a certain level during the growing season, it will trigger an injection of debt and “insurance” funding into VisionFund’s microfinance coffers from the InsuResilience Investment Fund and Global Parametrics. \nVisionFund’s network provides farmers with loans on special terms to help them recover after a disaster - a time when other financial institutions would typically reduce or stop lending, said Stewart McCulloch, global insurance director of VisionFund International. \nThe loans are intended to help protect entire communities from a severe drought or cyclone, and stop families having to cut down on meals, take children out of school, sell their assets or migrate to cities to find work, McCulloch told the Thomson Reuters Foundation. \nThe scheme plans to expand to cover floods later this year. \nThe insurance scheme will allow VisionFund’s microfinance programmes to keep on lending if several countries are hit by a disaster at the same time, said Hector Ibarra, CEO of Global Parametrics, a for-profit organisation. \nInsuResilience Investment Fund’s Hirche said the scheme would also contribute towards a G7 goal to increase the number of vulnerable people with access to direct or indirect insurance against climate disasters by up to 400 million by 2020. INSURANCE NOT ENOUGH \nAlthough insurance can be an effective tool to cushion farmers and their communities in a crisis, it is not enough on its own, said Richard Choularton, a food security and climate resilience expert with U.S.-based Tetra Tech International Development Services. \nFor farmers to earn more and become better able to withstand climate shocks, like droughts or floods, they also need access to improved seeds, better storage facilities, irrigation, markets, education and much else, he said by telephone. \n“Insurance by itself doesn’t reduce risk,” said Choularton, who previously worked with the World Food Programme. “It spreads risk over a longer period of time at a cost.” \nUnlike many private lenders, charities and U.N. agencies can offer a package of support, in addition to loans and insurance. \n“It is an integrated approach which could be very powerful,” he said. \nA few governments do subsidise insurance schemes, which can reach tens of millions of farmers as in India, but most programmes are much smaller. \n“We’ve had way too many programmes that have tested index insurance on a few hundred farmers and never taken it to the larger scale with the larger vision,” Choularton said. \n\"Doing something like this which reaches millions of farmers ... is a great step forward,\" he added. (Reporting by Alex Whiting @Alexwhi, Editing by Megan Rowling; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, resilience, women's rights, trafficking and property rights. Visit news.trust.org/climate )", "external_links": [], "published": "2018-01-18T19:20:00.000+02:00", "crawled": "2018-01-18T21:02:08.022+02:00", "highlightTitle": ""}