{"organizations": [], "uuid": "82f8008336728bcfa31ba2f73dcc8b1e6f8bcdcb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-japan-sterilization/woman-sues-japanese-government-over-forced-sterilization-as-a-teen-idUSKBN1FJ15D", "country": "US", "domain_rank": 408, "title": "Woman sues Japanese government over forced sterilization as a teen", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T11:34:00.000+02:00", "replies_count": 0, "uuid": "82f8008336728bcfa31ba2f73dcc8b1e6f8bcdcb"}, "author": "", "url": "https://www.reuters.com/article/us-japan-sterilization/woman-sues-japanese-government-over-forced-sterilization-as-a-teen-idUSKBN1FJ15D", "ord_in_thread": 0, "title": "Woman sues Japanese government over forced sterilization as a teen", "locations": [], "entities": {"persons": [], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - A Japanese woman who was forcibly sterilized as a teenager due to intellectual disabilities sued the government on Tuesday in the first case of its kind, seeking compensation because her basic human rights had been trampled on.\nUnder Japan’s eugenics protection law, in force from 1948 to 1996, about 25,000 people were sterilized due to mental or genetic illnesses, Japanese media said. They included leprosy sufferers and some with intellectual and cognitive disabilities.\nAbout 16,500 of them are believed to have had the surgery without their consent.\nThe 60-year-old who sued had developed mental problems following surgery for a cleft palate as an infant and was diagnosed with an intellectual disability at 15, after which she was forcibly sterilized, media said, quoting court documents.\nAs the result of side-effects she later had to have her ovaries removed. Subsequently, marriage talks were broken off as a result of her inability to have children.\nNo further details were given, including the woman’s name.\n“Thanks to the law, my sister has really suffered, living her life hidden away,” the woman’s sister told a news conference.\n“We wanted to stand up and build a society where even people with disabilities can have a happy life.”\nThe woman seeks compensation of 11 million yen ($101,149), saying the government should have set up relief measures for those subjected to the surgery, in recompense for violating their human rights.\nHealth Minister Katsunobu Kato declined to comment, telling reporters he did not know the details of the case, but his ministry would investigate.\nPeople with disabilities have long suffered shame and stigma in Japan, although anti-discrimination efforts have gathered pace since a law took effect in 2016.\nThat July, however, Japan was forced to confront its attitudes after a man went on a stabbing spree at a facility for disabled people near Tokyo, killing 19 as they slept and wounding 26. He had previously threatened to “obliterate” disabled people.\nAlmost nothing about the victims was disclosed except for gender and age, mainly at the request of their families.\nReporting by Linda Sieg and Elaine Lies,; Writing by Elaine Lies; Editing by Clarence Fernandez\n ", "external_links": [], "published": "2018-01-30T11:34:00.000+02:00", "crawled": "2018-01-30T11:50:42.049+02:00", "highlightTitle": ""}