{"organizations": [], "uuid": "cdc2d40926bd62f571738c5f764501ec3fb947c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 32}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222960986&w=1200&r=LYNXMPEE0H0GI", "site_section": "http://feeds.reuters.com/reuters/environment", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-danone-evian-plastic/danones-evian-vows-to-use-100-percent-recycled-plastic-in-bottles-by-2025-idUSKBN1F70RZ", "country": "US", "domain_rank": 408, "title": "Danone's Evian vows to use 100 percent recycled plastic in bottles by 2025", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T09:57:00.000+02:00", "replies_count": 0, "uuid": "cdc2d40926bd62f571738c5f764501ec3fb947c8"}, "author": "", "url": "https://www.reuters.com/article/us-danone-evian-plastic/danones-evian-vows-to-use-100-percent-recycled-plastic-in-bottles-by-2025-idUSKBN1F70RZ", "ord_in_thread": 0, "title": "Danone's Evian vows to use 100 percent recycled plastic in bottles by 2025", "locations": [], "entities": {"persons": [{"name": "dominique vidalon", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}], "organizations": [{"name": "danone", "sentiment": "negative"}, {"name": "loop industries", "sentiment": "none"}, {"name": "vittel", "sentiment": "none"}, {"name": "perrier", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nestle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 8:00 AM / Updated 3 hours ago Danone's Evian vows to use 100 percent recycled plastic in bottles by 2025 Dominique Vidalon 3 Min Read \nPARIS (Reuters) - Evian, Danone’s popular mineral water brand, on Thursday became the latest consumer goods group to undertake pledges on recycling plastic, as companies around the world aim to bolster their credentials regarding helping the environment. \nEvian vowed to make all its plastic bottles from 100 percent recycled plastic by 2025, compared to 25 percent at present, in order to tackle the issue of waste. \nThe move comes as consumer goods companies seek to deal with criticism that packaging and transporting goods across the world causes undue environmental damage, as millions of tonnes of plastic waste end up in landfills and in the oceans. \nFurther highlighting the issue's prominence, last year Nestle - which owns the Perrier and Vittel water brands - strengthened ties with a non-governmental organization, which will monitor some 20 Nestle sites. ( bit.ly/2Di3zhp ) \nEvian is teaming up with Loop Industries, which has developed a new technology to transform all types of Polyethylene Terephthalate (PET) plastic waste into the high-quality plastic Evian requires, to redesign its packaging. \nEvian will invest a “significant” albeit undisclosed sum of money to reach its goal. The company is also calling for co-operation across industries regarding the issue. \n“We want to adopt a circular model where 100 percent of our plastic bottles will become bottles again. This will enable plastic to evolve from potential waste to become a valuable resource,” Evian global brand director Patricia Oliva told Reuters. \nIn the process Evian currently uses to recycle plastic, ‘PET’ cannot be recycled more than three times because the quality suffers. With Loop’s technology, Evian will be able to recycle the plastic again and again, retaining the same quality. \nDanone is the world’s third-largest bottled water company, and Evian is its marquee label in a portfolio that also has the Badoit and Volvic brands. \nIn September, Evian inaugurated its modernized, carbon-neutral bottling plant in the spa town of Evian-Les-Bains close to Lake Geneva, and Danone aims to make Evian its first, major carbon-neutral mineral water brand by 2020. Reporting by Dominique Vidalon; Editing by Sudip Kar-Gupta", "external_links": [], "published": "2018-01-18T09:57:00.000+02:00", "crawled": "2018-01-18T10:11:01.048+02:00", "highlightTitle": ""}