{"organizations": [], "uuid": "01ee3e11b967566c1261b34725470e73e2ae39f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-rjd-green-inc-recaps-2017-10k-filing-and-expected-2018-events.html", "country": "US", "domain_rank": 767, "title": "RJD Green Inc. Recaps 2017 10K Filing and Expected 2018 Events", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:30:00.000+02:00", "replies_count": 0, "uuid": "01ee3e11b967566c1261b34725470e73e2ae39f0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-rjd-green-inc-recaps-2017-10k-filing-and-expected-2018-events.html", "ord_in_thread": 0, "title": "RJD Green Inc. Recaps 2017 10K Filing and Expected 2018 Events", "locations": [], "entities": {"persons": [], "locations": [{"name": "okla.", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}], "organizations": [{"name": "rjd green", "sentiment": "negative"}, {"name": "rjd green inc", "sentiment": "neutral"}, {"name": "iosoft division", "sentiment": "none"}, {"name": "iosoft", "sentiment": "none"}, {"name": "rjd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TULSA, Okla., For the fiscal year 2017, RJD Green created revenue of $3,714,472 and net operating profit of $463,791. The performance was far below management’s expectations. The issue was singular and caused by the delayed launching of the IoSoft Division’s new software platforms that were expected to launch in 2017. The delayed launching was due to latest regulations for application of their services in the banking and healthcare sectors, which created an unexpected completion time (over twelve months) for the qualifying processes of these regulations.\nMuch of the planned execution for the RJD 2017 business model had to be curtailed to avail the corporate management’s devotion of full time efforts assisting in the completion of launching the lucrative opportunity that IoSoft offers. Additional planned acquisition opportunities were delayed until the IoSoft launch was completed.\nFor 2018, IoSoft is fully launched and initial contracts are being serviced creating additional revenues. The management of IoSoft feels substantial revenue as previously forecast can be achieved in 2018.\nCorporate management of RJD has conservatively forecast 2018 revenue of $9,680,026 and net operating profit of $4,356,011. This is prior to any additional planned acquisitions.\nThe launching of IoSoft allows RJD Green management to focus on important events that did not occur in 2017 as planned; completion of three acquisitions (one in each of the three divisions), and the launching of operations within the current Earthlinc division’s technologies.\nTo enhance our efforts, a Chief Operating Officer will be joining the Company for best coverage of operations, along with a successful financial advisory firm engaged to assist with capital procurement efforts for planned acquisitions.\nThe Company will provide expanded information in the immediate upcoming weeks in regards to the additional supporting action steps and the continued progressions in acquisition efforts.\nAbout RJD Green, Inc.,\nThe Company operates as a holding company with a focus of acquiring and managing assets and companies. RJD Green operates in three divisions: RJD Green Healthcare Services Division , which holds interest in IoSoft Inc, a company that provides discrete payment technologies, services and software that can be integrated into targeted offerings for healthcare provider networks, hospitals, healthcare payers and individual providers; Earthlinc Environmental Services Division , which provides green environmental services and technologies; Silex Holdings Division , which is engaged in specialty construction and industrial manufacturing and fills a market niche between the Home Depots and local contractors. Silex offers installed granite/other counter tops, cabinets and related products to the residential builder, commercial contractor, remodel contactor and retail customer. Visit http://www.rjdgreen.com\nForward-looking Statement:\nThis release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All forward-looking statements are inherently uncertain as they are based on current expectations and assumptions concerning future events of future performance of the company. Readers are cautioned not to place undue reliance on these forward-looking statements, which are only predictions and speak only as of the date hereof. In evaluation such statements, prospective investors should review carefully various risks and uncertainties identified in this release and matters set in the company's SEC filings. These risks and uncertainties could cause the company's actual results to differ materially from those indicated in the forward-looking statements.\nFor additional information contact, Ron Brewer, CEO, http://www.rjdgreen.com at ronb@rjdgreen.com , or at (918) 551-7883, or Kenneth Quist, Publicist, at thekwister@aol.com or (918) 261-8126.\nSource:RJD Green Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=IhNB-9g84nHh3yOw0byWPgFfl5IEb6p0Y4VIkYNQ9MoqYNacGwvR8sgCftMdYm1iYpKVmRptAv9Hf2Ei6Q5UJyIYGq7LpsejLyq07cndNZo=", "https://www.globenewswire.com/Tracker?data=IhNB-9g84nHh3yOw0byWPgFfl5IEb6p0Y4VIkYNQ9Mp4ZGkvEIOZkHps0c3vPsBe9HRRskubxl24v068rWT8fgy9qDz015gsE4Sqt26etvA="], "published": "2018-01-18T16:30:00.000+02:00", "crawled": "2018-01-18T16:34:51.022+02:00", "highlightTitle": ""}