{"organizations": [], "uuid": "d9dc8e271b70e5ada6b25f98c23b5a182a3f4a71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219328832&w=1200&r=LYNXMPEE030UK", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-climatechange-temperatures/2017-was-second-hottest-year-on-record-after-2016-european-data-idUSKBN1ET1JF", "country": "US", "domain_rank": 408, "title": "2017 was second hottest year on record, after 2016 - European data", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T15:43:00.000+02:00", "replies_count": 0, "uuid": "d9dc8e271b70e5ada6b25f98c23b5a182a3f4a71"}, "author": "", "url": "https://www.reuters.com/article/us-climatechange-temperatures/2017-was-second-hottest-year-on-record-after-2016-european-data-idUSKBN1ET1JF", "ord_in_thread": 0, "title": "2017 was second hottest year on record, after 2016 - European data", "locations": [], "entities": {"persons": [{"name": "alister doyle", "sentiment": "none"}], "locations": [], "organizations": [{"name": "min read  oslo", "sentiment": "none"}, {"name": "copernicus climate change service", "sentiment": "none"}, {"name": "u.n. world meteorological organization", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OSLO (Reuters) - Last year was the second hottest worldwide on record, just behind a sweltering 2016, with signs of climate change ranging from wildfires to a thaw of Arctic ice, a European Union monitoring center said on Thursday.\nThe Copernicus Climate Change Service, the first major international weather agency to report on conditions in 2017, said temperatures averaged 14.7 degrees Celsius (58.46 Fahrenheit) at the Earth’s surface - 1.2C (2.2F) above pre-industrial times.\nLast year was slightly “cooler than the warmest year on record, 2016, and warmer than the previous second warmest year, 2015”, it said. Temperature records date back to the late 19th century.\n“It’s striking that 16 of the 17 warmest years have all been this century,” Jean-Noel Thepaut, head of Copernicus, told Reuters, adding there was overwhelming scientific consensus that man-made emissions were stoking the warming trend.\nThe Copernicus study is in line with a projection by the U.N. World Meteorological Organization (WMO) in November that 2017 would be second or third warmest behind 2016.\nIn 2016, an extra dose of heat came from El Nino, a natural event that releases heat from the Pacific Ocean every few years.\nBut last year was the hottest year without an El Nino, according to Copernicus, run by the European Centre for Medium-Range Weather Forecasts.\nIt pointed to a retreat of sea ice in the Arctic and prolonged dry conditions in southern Europe that helped trigger wildfires in Portugal and Spain in 2017 as examples of the sort of disruptions that are becoming more frequent in a warming climate.\nFILE PHOTO: Firefighters keep watch on the Thomas wildfire in the hills and canyons outside Montecito, California, U.S., December 16, 2017. REUTERS/Gene Blevins/File Photo “BUNDLE UP”\nU.S. President Donald Trump, who doubts that climate change has a human cause, tweeted on Dec. 29 about bone-chilling cold in the United States and cast doubt on the need for action to limit emissions.\n“Perhaps we could use a little bit of that good old Global Warming that our Country, but not other countries, was going to pay TRILLIONS OF DOLLARS to protect against. Bundle up!” he wrote.\nChildren play at a fountain on a hot summer day in central Lviv, Ukraine, August 11, 2017. Picture taken August 11, 2017. REUTERS/Gleb Garanich Trump plans to quit the 2015 Paris Agreement, which has the backing of almost 200 nations and seeks to limit the rise in temperatures to “well below” 2 degrees Celsius (3.6 F) above pre-industrial times, ideally 1.5 C (2.7 F).\nHigh winds and heavy show barreled into the U.S. northeast on Thursday, closing schools and government offices and disrupting travel. [L1N1OZ0C5]\nData on Thursday compiled by the University of Maine and the Climate Change Institute showed temperatures in the eastern United States, Greenland and parts of central Asia were indeed colder than usual, while most of the rest of the world was warmer.\nEarlier on Thursday, German reinsurer Munich Re said insurers would have to pay claims of around $135 billion for 2017, the most ever, following a spate of hurricanes, earthquakes and fires in North America.\nThepaut said rising sea levels and higher temperatures that can produce more rainfall may have aggravated Atlantic hurricanes, even though it was hard to detect links between individual storms and man-made climate change.\nThe WMO will publish its review of 2017 temperatures, also drawing on Copernicus and other U.S., British and Japanese data, in about two weeks.\nReporting By Alister Doyle, additional reporting by Tom Sims and Alexander Hubner in Germany; Editing by Robin Pomeroy and Alison Williams\n ", "external_links": [], "published": "2018-01-04T15:43:00.000+02:00", "crawled": "2018-01-04T16:12:39.001+02:00", "highlightTitle": ""}