{"organizations": [], "uuid": "884f9e0527887024a6c55f09e1f53062fb0c2852", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-agenus-announces-key-leadership-to-advance-combination-trials-for-planned-bla-filings.html", "country": "US", "domain_rank": 767, "title": "Agenus Announces Key Leadership to Advance Combination Trials For Planned BLA Filings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.373, "site_type": "news", "published": "2018-01-03T15:00:00.000+02:00", "replies_count": 0, "uuid": "884f9e0527887024a6c55f09e1f53062fb0c2852"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-agenus-announces-key-leadership-to-advance-combination-trials-for-planned-bla-filings.html", "ord_in_thread": 0, "title": "Agenus Announces Key Leadership to Advance Combination Trials For Planned BLA Filings", "locations": [], "entities": {"persons": [{"name": "john castle", "sentiment": "none"}, {"name": "castle", "sentiment": "none"}, {"name": "youssoufian", "sentiment": "none"}, {"name": "tyler curiel", "sentiment": "none"}, {"name": "curiel", "sentiment": "none"}, {"name": "agenus", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "lexington", "sentiment": "none"}], "organizations": [{"name": "agenus inc.", "sentiment": "negative"}, {"name": "bla", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LEXINGTON, Mass., Jan. 3, 2018 /PRNewswire/ -- Agenus Inc. (NASDAQ: AGEN), an immuno-oncology company with a pipeline of immune checkpoint antibodies and cancer vaccines, announced new leadership appointments to enhance its team and advance combination clinical programs which will support its planned BLA filings in the second half of 2019 and in 2020.\nDr. Youssoufian will serve as Senior Clinical Strategist to provide overall strategic and tactical guidance to Agenus' clinical team for the advancement of our ongoing lead combination programs. Dr. Youssoufian brings over 25 years of product development and approval experience, particularly in biologics.\nDr. John Castle is a pioneer in translational bioinformatics and genomics and leader in the identification of immune-inducing antigens for cancer therapy. Dr. Castle will drive the application of mutational and biochemical based neoantigens for the development and evaluation of effective cancer treatments.\nDr. Tyler Curiel is appointed Senior Strategist for Translational and Biomarker Development. Dr. Curiel is a world-renowned physician-scientist and trained immunologist, past chief of hematology and medical oncology and executive director of an NCI-designated cancer center. Drs. Castle and Curiel will drive the translational and biomarker approaches to select patients most likely to benefit from combination approaches of our vaccines, adjuvants, and checkpoint modulating antibodies targeting T cells, tumor micro-environment conditioning, and regulatory T cell depletion strategies.\n\"These appointments will help drive landmark advances in cancer treatments here at Agenus,\" said Dr. Garo Armen, Chairman and CEO. \"These experts share our vision to quickly bring effective combination approaches to patients with cancer and will advance our currently ongoing pivotal programs with CTLA-4 and PD-1 designed to support a BLA filing in the second half of 2019.\"\nDr. Hagop Youssoufian brings more than 25 years of drug development expertise with specific experience in the development of protein-based therapeutics. Hagop has served in various senior roles in the pharmaceutical and biotechnology industry, including tenures as Chief Medical Officer at ImClone-Lilly and as President of R&D at Ziopharm and was involved in the development and approval of several oncology biologic products, including Erbitux® and Cyramza®. He is an elected member of the American Society for Clinical Investigation. Hagop received his Bachelor of Science from Boston College, his medical degree from the University of Massachusetts Medical School and completed training in Internal Medicine and fellowship in Clinical Genetics at Johns Hopkins and in Hematology-Oncology at Massachusetts General Hospital. Hagop was a Visiting Scientist at Whitehead Institute with subsequent academic positions at Harvard Medical School and Baylor College of Medicine.\nDr. John Castle is a pioneer in the identification of immunogenic antigens for application in cancer treatment. At Agenus, Dr. Castle revolutionized our neoantigen approach to vaccines from an autologous approach to a computationally driven, fully synthetic, off-the shelf approach to cancer therapy. He previously served in leadership positions at TRON and BioNTech AG (Mainz, Germany), where he built translational bioinformatics and genomics departments focused on immunotherapies. Under his leadership, these organizations pioneered approaches to identify immunogenic tumor mutations. John spent his early career at Rosetta Inpharmatics, later part of Merck & Co, where he gained expertise in integrating bioinformatics, computational immunology, biotechnology and genomics. John studied physics at Rice University, received his PhD from the University of Washington, and completed his post-doctoral studies at the Massachusetts Institute of Technology.\nDr. Tyler Curiel is a Professor of Hematology/Oncology in the Department of Medicine at University of Texas Health San Antonio (UTHSA), where he also holds the Daisy M. Skinner President's Chair in Cancer Immunology Research. Tyler is a physician-scientist and world recognized expert in tumor immunology and immunotherapy, Phase 1 experimental therapeutics and gynecologic cancers. He is board certified in internal medicine, infectious disease, and medical oncology. He is past chief of hematology and medical oncology and executive director of an NCI-designated cancer center and leads the Experimental and Developmental Therapeutics Program at UTHSA. Tyler is a leading expert in PD-L1/PD-1 immune-biology and regulatory T cells will serve as our Strategic Advisor of Translational Medicine.\nAbout Agenus\nAgenus is a clinical-stage immuno-oncology company focused on the discovery and development of therapies that engage the body's immune system to fight cancer. The Company's vision is to expand the patient populations benefiting from cancer immunotherapy by pursuing a number of combination approaches that leverage a broad repertoire of antibody therapeutics and proprietary cancer vaccine platforms. The Company is equipped with a suite of antibody discovery platforms and a state-of-the-art GMP manufacturing facility with the capacity to support early phase clinical programs. Agenus is headquartered in Lexington, MA. For more information, please visit www.agenusbio.com ; information that may be important to investors will be routinely posted on our website.\nForward-Looking Statements\nThis press release contains forward-looking statements that are made pursuant to the safe harbor provisions of the federal securities laws, including statements regarding Agenus' clinical trial plans and activities and the anticipated contributions of each of Dr. Hagop Youssoufian, Dr. John Castle and Dr. Tyler Curiel. These forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially. These risks and uncertainties include, among others, the factors described under the Risk Factors section of our most recent Quarterly Report on Form 10-Q or Annual Report on Form 10-K filed with the Commission. Agenus cautions investors not to place considerable reliance on the forward-looking statements contained in this release. These statements speak only as of the date of this press release, and Agenus undertakes no obligation to update or revise the statements, other than to the extent required by law. All forward-looking statements are expressly qualified in their entirety by this cautionary statement.\nContact:\nAgenus Inc.\nJennifer Buell, PhD\n781-674-4420\nJennifer.Buell@agenusbio.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/agenus-announces-key-leadership-to-advance-combination-trials-for-planned-bla-filings-300576819.html\nSOURCE Agenus", "external_links": ["http://www.prnewswire.com/news-releases/agenus-announces-key-leadership-to-advance-combination-trials-for-planned-bla-filings-300576819.html", "http://www.agenusbio.com/"], "published": "2018-01-03T15:00:00.000+02:00", "crawled": "2018-01-03T17:05:07.000+02:00", "highlightTitle": ""}