{"organizations": [], "uuid": "01e2ac02c2f7e746eedc6597eac81444aa74564d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-correcting-and-replacing-metropolitan-bank-holding-corp-achieves-net-income-of-12-point-4-million-for-full-year-2017-up-147.html", "country": "US", "domain_rank": 767, "title": "CORRECTING and REPLACING Metropolitan Bank Holding Corp. Achieves Net Income of $12.4 Million for Full Year 2017, Up 147% from $5.0 Million for 2016", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T01:10:00.000+02:00", "replies_count": 0, "uuid": "01e2ac02c2f7e746eedc6597eac81444aa74564d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-correcting-and-replacing-metropolitan-bank-holding-corp-achieves-net-income-of-12-point-4-million-for-full-year-2017-up-147.html", "ord_in_thread": 0, "title": "CORRECTING and REPLACING Metropolitan Bank Holding Corp. Achieves Net Income of $12.4 Million for Full Year 2017, Up 147% from $5.0 Million for 2016", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "replacing metropolitan bank holding corp", "sentiment": "negative"}, {"name": "metropolitan commercial bank", "sentiment": "none"}, {"name": "metropolitan bank holding corp.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "mcb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)--\nIn the CONSOLIDATED INCOME STATEMENTS table, the figure in the \"Average common shares outstanding for Diluted EPS\" line item for the \"December 31, 2016\" column should read 4,560,918 (sted of 4,574,525). Also, in the Reconciliation of GAAP Earnings to Earnings Excluding Writedown of Net Deferred Tax Assets and Taxi Medallion Loan Charge-off table, the figures in the \"Weighted average diluted shares outstanding\" line item have changed.\nThe corrected release reads:\nMETROPOLITAN BANK HOLDING CORP. ACHIEVES NET INCOME OF $12.4 MILLION FOR FULL YEAR 2017, UP 147% FROM $5.0 MILLION FOR 2016\nMetropolitan Bank Holding Corp. (NYSE:MCB), the holding company (the “Company”) for Metropolitan Commercial Bank (the “Bank”), today reported net income of $3.3 million, or $0.49 per diluted common share, for the fourth quarter of 2017, compared to $49 thousand, or $0.01 per diluted common share, for the fourth quarter of 2016, and $3.8 million, or $0.82 per diluted common share, for the third quarter of 2017.\nFor the year ended December 31, 2017, net income was $12.4 million, an increase of 147% from $5.0 million for the year ended December 31, 2016. Diluted earnings per common share for the year ended December 31, 2017 increased to $2.34, compared to $0.43 for the year ended December 31, 2016.\nThe fourth quarter of 2016 net income included a charge-off of $5.1 million of the Bank’s taxi medallion loan portfolio, while fourth quarter 2017 net income included a write-down of deferred tax assets related to the recent changes in the tax code of $1.6 million and a final taxi medallion related charge-off of $3.7 million. Excluding the impact of the above mentioned charges, the Company’s adjusted net income for the fourth quarter of 2017 was $7.1 million and adjusted diluted earnings per common share was $1.04. Excluding the impact of the above mentioned charges, the Company’s adjusted net income for the year ended 2017 was $16.1 million and adjusted diluted earnings per common share was $3.06. (See table of “Reconciliation of GAAP and Non-GAAP Financial Measures.”)\nThe Company completed an initial public offering (“IPO”) of its common stock on November 10, 2017 and sold 3,100,000 shares of common stock at $35.00 per share, as well as, 465,000 additional shares of common stock at $35.00 per share pursuant to the underwriter’s overallotment option. The aggregate net proceeds to the Company from its IPO, including the overallotment shares, after deducting the underwriting discount and estimated offering expenses were approximately $115 million.\n2017 Highlights (as of, or for the periods ended December 31, 2017, compared to December 31, 2016, and September 30, 2017, except as noted):\nDiluted earnings per common share totaled $0.49 for the fourth quarter of 2017, compared to $0.01 for the fourth quarter of 2016, and $0.82 for the third quarter of 2017. Diluted earnings per common share decreased in the fourth quarter of 2017 compared to the third quarter of 2017 primarily due to the increase in shares resulting from the IPO in November 2017, combined with the impact of the write-down of deferred tax assets and the aforementioned charge off. For the year ended December 31, 2017, diluted earnings per common share increased 444% to $2.34, compared to $0.43 per diluted common share for the year ended December 31, 2016. For the fourth quarter of 2017, the return on average assets (“ROAA”) was 0.73%, return on average tangible assets (“ROATA”) was 0.74%, return on average common equity (“ROACE”) was 7.68% and the return on average tangible common equity (“ROATCE”) was 8.14%. For the sequential quarter, ROAA was 0.94%, ROATA was 0.95%, ROACE was 13.39% and ROATCE was 15.11%. ROATCE for the fourth quarter of 2017 was lower than the sequential quarter due to the increase in equity resulting from the IPO in November 2017. For the year ended December 31, 2017, the ROAA was 0.81%, ROATA was 0.82%, ROACE was 9.67% and ROATCE was 10.46%, compared to 0.46%. 5.86%. 0.46% and 6.61%, respectively, for the year ended December 31, 2016. Excluding the impact of aforementioned charges, the adjusted ROAA for the fourth quarter of 2017, was 1.57% and the adjusted ROACE was 16.40% compared to the adjusted ROAA of 1.13% and adjusted ROACE of 12.40% for the quarter ended December 2016. For the year ended December 2017, the adjusted ROAA was 1.06% and the adjusted ROACE was 12.62% compared to the adjusted ROAA of 0.75% and the adjusted ROACE of 10.84% for the year ended December 31, 2016. Net interest income increased 49% to $15.6 million for the fourth quarter of 2017, compared to $10.4 million for the fourth quarter of 2016, and increased 12% from $14.0 million for the third quarter of 2017. For the year ended December 31, 2017, net interest income increased 37% to $52.1 million, compared to $38.1 million for the year ended December 31, 2016. The increase in net interest income was mainly attributable to higher volume of loans combined with higher yield on loans. Net interest margin (“NIM”) contracted in both the fourth quarter of 2017 and the year ended December 31, 2017 from the comparable periods in 2016 primarily due to higher average balances maintained in the fed funds accounts, resulting from the IPO and increased average non-interest bearing deposit balances in the settlement accounts related to digital currency. Loans increased $39.3 million, or 3%, to $1.42 billion at December 31, 2017, compared to $1.38 billion at September 30, 2017. Loans increased $365.3 million, or 35%, to $1.42 billion at December 31, 2017, compared to $1.06 billion at December 31, 2016. Credit quality in fourth quarter of 2017 improved with a decrease in non-performing assets and classified assets compared to the third quarter of 2017 and year end 2016. Nonperforming assets (“NPAs”) declined to $3.4 million, or 0.19% of total assets, at December 31, 2017, compared to $3.7 million, or 0.30% of total assets, at December 31, 2016, and $7.1 million, or 0.41% of total assets, at September 30, 2017. Classified assets declined to $4.6 million, or 0.26% of total assets, at December 31, 2017, compared to $4.9 million, or 0.40% of total assets, at December 31, 2016, and $8.3 million, or 0.48% of total assets, at September 30, 2017. Net charge-offs totaled $3.7 million for the fourth quarter of 2017, compared to $5.7 million for the fourth quarter of 2016, and $34,000 for the third quarter of 2017. Net charge-offs during the fourth quarter of 2017 included a final charge off related to the aforementioned taxi medallion loan for $3.66 million. After the charge off, the Company has no further exposure to taxi medallion loans. Total deposits increased $410.6 million, or 41%, to $1.4 billion at December 31, 2017, compared to $993.8 million at December 31, 2016, but decreased $84.3 million, or (6%), from $1.5 billion at September 30, 2017. Core Deposits, which exclude all time deposits, increased $407.0 million, or 44.4%, to $1.32 billion at December 31, 2017, from $917 million at December 31, 2016, and decreased $81.3 million, or (5.8%), from $1.41 billion at September 30, 2017. The decrease in core deposits was largely due to year-end funding needs of corporate clients. Average core deposit balances increased by $169 million or 13.4% compared to the sequential quarter. Due to the Tax Cuts and Jobs Act, which was enacted on December 22, 2017, the Company revalued its net deferred tax assets on the date of enactment based on the reduction in the overall future tax benefit expected to be realized at the lower tax rate implemented by the new legislation. The Company's estimated write-down of its net deferred tax assets is approximately $1.6 million. This write-down is reflected in the Company's operating results for the fourth quarter of 2017 as an increase in the income tax expense. In addition to the write-down of net deferred tax assets, the Company incurred other expenses and charges in connection with certain transactions that are considered to be infrequent in nature. The following table presents the impact of aforementioned charges on reported earnings for the dates presented (in thousands):\nThree months ended\nDecember 31, 2017\nThree months ended\nDecember 31, 2016\n(in $000's, unaudited) Pre-tax After-tax Diluted\nEPS\nPre-tax After-tax Diluted\nEPS\nEarnings, as reported $ 8,541 $ 3,325 $ 0.49 $ (384 ) $ 49 $ 0.01 Write-down of net deferred tax assets - 1,581 0.23 - - - Charge-off medallion loan 3,660 2,196 0.32 5,123 3,202 0.69 Earnings, adjusted $ 12,201 $ 7,102 $ 1.04 $ 4,739 $ 3,251 $ 0.70 Year ended\nDecember 31, 2017\nYear ended\nDecember 31, 2016\n(in $000's, unaudited) Pre-tax After-tax Diluted\nEPS\nPre-tax After-tax Diluted\nEPS\nEarnings, as reported $ 23,578 $ 12,369 $ 2.34 $ 8,058 $ 5,013 $ 0.43 Write-down of net deferred tax assets - 1,581 0.30 - - - Charge-off medallion loan 3,660 2,196 0.42 5,123 3,202 0.85 Earnings, adjusted $ 27,238 $ 16,146 $ 3.06 $ 13,181 $ 8,215 $ 1.28 The Company’s consolidated capital ratios exceeded regulatory guidelines and the Bank’s capital ratios exceeded the regulatory requirements for a well-capitalized financial institution at December 31, 2017.\nManagement Comments: Increasing Strong Core Performance\nMark DeFazio, the Company’s President and CEO stated, “Fourth quarter operating results reflect increasing strong core performance, with ROACE at 7.68% and adjusted ROATCE, excluding the impact of final taxi medallion charges and the tax reform bill, surpassing 16%. Key business drivers showed continued momentum, with deposit and loan growth achieving satisfactory levels. Loans increased by $39 million or 3% during the quarter. We also achieved strong progress in increasing core deposits. For the current quarter, our average core deposits (total deposits excluding time deposits) increased by $169 million, or 13% compared to the sequential quarter. When excluding the previously noted charges, the adjusted return on tangible assets and return on tangible common equity were 1.57% and 17.38%, respectively, while our efficiency ratio improved to 44.82%.”\nMr. DeFazio added, “We are also enhancing our efforts to increase retail deposits through the opening of a new branch located on Lexington Avenue and 85 th street, which is targeted to open in the beginning of second quarter 2018. The branch office is the Bank’s fourth location in Manhattan and enables the Bank to further provide best in class service to existing NY-based clients while also establishing new relationships in our footprint.”\nMr. DeFazio concluded, “Looking ahead, we remain focused on driving shareholder value by executing our key strategic objectives, including but not limited to, diversified loan growth, core deposit funding, continuing to be a branch-light franchise and maximizing our operating leverage. We are carefully building a strong and sustainable company and year-to-date results demonstrate our commitment to and success in achieving these goals, serving our clients, and driving growth in shareholder value.”\nOperating Results\nNet interest income increased 49% to $15.6 million for the fourth quarter of 2017, compared to $10.4 million for the fourth quarter of 2016, and increased 12% from $14.0 million for the third quarter of 2017. Net interest income increased 37% to $52.1 million for the year ended December 31, 2017, compared to $38.1 million for the year ended December 31, 2016. Net interest income increased for the year ended December 31, 2017, compared to the year ended December 31, 2016, primarily due to the organic growth in the loan portfolio, and the impact of increase in the fed funds rate resulting in a higher yield on floating rate loans.\nFor the fourth quarter of 2017, the net interest margin contracted 22 basis points to 3.49% from 3.71% for the fourth quarter of 2016, primarily due to large loan payoffs in the fourth quarter of 2016 and expedited realization of deferred fee income related to the payoff. For the fourth quarter of 2017, net interest margin was also lower due to higher balances at the Federal Reserve Bank resulting from the IPO, and an increase in average deposit balances in the settlement accounts related to digital currency, partially offset by higher yield on loans and other earning assets. The net interest margin contracted 13 basis points for the fourth quarter of 2017, from 3.62% for the third quarter of 2017, primarily due to higher average balances at the Federal Reserve Bank. For the year ended December 31, 2017, the net interest margin contracted 3 basis points to 3.54%, compared to 3.57% for the year ended December 31, 2016, primarily due to increase in the cost of interest bearing liabilities partially offset by an increase in the non-interest bearing deposits.\nThe provision for loan losses for the fourth quarter of 2017 was $3.5 million, compared to $6.1 million for the fourth quarter of 2016, and $1.2 million for the third quarter of 2017. The increase in provision in the fourth quarter of 2017 was due to the final charge off of a taxi-medallion loan. The provision for loan losses for the year ended December 31, 2017 was $7.1 million, compared to $8.1 million for the year ended December 31, 2016.\nNon-interest income increased to $6.2 million for the fourth quarter of 2017, compared to $1.3 million for the fourth quarter of 2016, and $2.2 million for the third quarter of 2017. For the fourth quarter of 2017, noninterest income included an increase in service charges and foreign exchange conversion fee related to wire transfer activities. For the year ended December 31, 2017, noninterest income increased by $5.9 million to $11.3 million, from $5.4 million for the year ended December 31, 2016. The increase in noninterest income for the year ended December 31, 2017, compared to the year ended December 31, 2016, was primarily due to increase in service charges and fees on deposit accounts by $2.5 million, increase in foreign exchange conversion fee by $3.5 million, and increase in income from debit card issuing business by $443,000. Non-interest income for the year ended December 31, 2017, included approximately $6.9 million associated with transaction activities of digital currency related deposit accounts.\nTotal non-interest expense for the fourth quarter of 2017 increased to $9.8 million, compared to $6.0 million for the fourth quarter of 2016, and $8.6 million for third quarter of 2017. The increase in noninterest expense in the fourth quarter of 2017, compared to the fourth quarter of 2016, was primarily due to an increase in compensation expense associated with annual salary increases and newly hired employees to support the growth of the Company’s business and increases in risk management activities, increase in core processing and FDIC assessment fees directly related to increased number of transactions and the asset size of the Bank.\nNon-interest expense for the year ended December 31, 2017 increased to $32.7 million, compared to $27.4 million for the year ended December 31, 2016, primarily due to higher compensation expense and higher professional fees resulting from public company expenses. Included in the increase in non-interest expenses are also higher occupancy cost resulting from renovation of the Company’s premises to add space for more employees, higher FDIC assessment and core processing fees related to the growth in the Bank’s business.\nThe efficiency ratio for the fourth quarter of 2017 improved to 44.82%, compared to 51.55% for the fourth quarter of 2016, and 53.03% for the third quarter of 2017. The efficiency ratio for the year ended December 31, 2017 was 51.66%, compared to 62.94% for the year ended December 31, 2016. The lower efficiency ratio in the fourth quarter of 2017 and year ended December 31, 2017 is a result of increased operating efficiencies through economies of scale as the increase in income from the growth of business outweighed the increase in operating expenses.\nIncome tax expense for the fourth quarter of 2017 was $5.2 million, compared to an income tax benefit of ($433,000) for the fourth quarter of 2016, and $2.6 million for the third quarter of 2017. Income tax expense for the year ended December 31, 2017 was $11.2 million, compared to $3.0 million for the year ended December 31, 2016. Income tax expense for the fourth quarter of 2017 included the impact of the write down of estimated net deferred tax assets by $1.6 million. The effective tax rate for the year ended December 31, 2017 was 47.5%, compared to 37.8% for the year ended December 31, 2016. Excluding the impact of the write down of deferred tax assets, the effective tax rate for the year ended 2017 would have been 40.8%.\nBalance Sheet Review, Capital Management and Credit Quality\nTotal assets increased to $1.76 billion at December 31, 2017, compared to $1.22 billion at December 31, 2016, and $1.72 billion at September 30, 2017.\nThe investment securities available-for-sale portfolio totaled $32.2 million at December 31, 2017, compared to $37.3 million at December 31, 2016, and $33.9 million at September 30, 2017. At December 31, 2017, the Company’s securities available-for-sale portfolio was comprised of $29.2 million of agency mortgage-backed securities (all issued by U.S. Government sponsored entities), $2.2 million CRA fund and $1.1 million in municipal securities. The pre-tax unrealized loss on securities available-for-sale at December 31, 2017 was ($347,000), compared to a pre-tax unrealized loss on securities available-for-sale of ($292,000) at December 31, 2016, and a pre-tax unrealized loss on securities available-for-sale of ($89,000) at September 30, 2017. All else being equal, when market interest rates are rising, the Company will experience a higher unrealized loss (or lower unrealized gain) on the securities available-for-sale portfolio.\nAt December 31, 2017, investment securities held-to-maturity totaled $5.4 million, compared to $6.5 million at December 31, 2016, and $5.7 million at September 30, 2017. At December 31, 2017, the Company’s securities held-to-maturity portfolio, at amortized cost, was largely comprised of $6.5 million of agency mortgage backed securities.\nLoan balances increased $365 million, or 35%, to $1.42 billion at December 31, 2017, compared to $1.06 billion at December 31, 2016, which included an increase of $335.5 million, in the Company’s existing portfolio, and an increase of $29.5 million in purchased loans. Loans increased $39.3 million, or 3%, at December 31, 2017, compared to $1.38 billion at September 30, 2017, which included an increase of $51.8 million, or in the Company’s legacy portfolio, and a decrease of $12.5 million of purchased loans.\nThe loan portfolio remains well-diversified with C&I loans (including owner occupied business loans) accounting for approximately 37.0% and residential mortgages and consumer loans consisting of 5.0% of the loan portfolio at December 31, 2017. CRE loans accounted for 58.0% of the total loan portfolio.\nThe yield on the loan portfolio was 4.63% for the fourth quarter of 2017, compared to 4.59% for the fourth quarter of 2016, and 4.65% for the third quarter of 2017. The increase in the yield on the loan portfolio for the fourth quarter of 2017, compared to the fourth quarter of 2016, reflects the impact of increase in the fed funds rate on the Company’s floating rate portfolio. The yield on the loan portfolio increased to 4.59% for the year ended December 31, 2017, compared to 4.56% for the year ended December 31, 2016, primarily due to increase in yield of the floating rate portfolio.\nAt December 31, 2017, NPAs declined to $3.4 million, or 0.19% of total assets, compared to $3.7 million, or 0.30% of total assets, at December 31, 2016, and $7.1 million, or 0.41% of total assets, at September 30, 2017. The following is a breakout of NPAs at the periods indicated:\nNONPERFORMING ASSETS End of Period: December 31, 2017 September 30, 2017 December 31, 2016 (in $000's, unaudited) Balance %\nof Total\nBalance % of\nTotal\nBalance % of\nTotal\nNon-accrual loans: Real Estate: Commercial $ 787 23 % $ 841 12 % $ - - % Construction - - % - - % - - % Multifamily - - % - - % - - % One-to-four family 2,447 72 % 2,466 34 % - - % Commercial and industrial - - % 3,660 52 % 3,660 100 % Consumer 155 5 % 125 2 % - - % Total non-performing assets $ 3,389 100 % $ 7,092 100 % $ 3,660 100 % Classified assets declined to $4.6 million at December 31, 2017, compared to $4.9 million at December 31, 2016, and $8.3 million at September 30, 2017.\nThe following table summarizes the allowance for loan and lease losses (“ALLL”)\nALLOWANCE FOR LOAN LOSSES For the Quarter Ended For the Year Ended December 31, September 30, December 31, December 31, December 31, (in $000's, unaudited) 2017 2017 2016 2017 2016 Beginning balance $ 15,075 $ 13,909 $ 11,497 $ 11,815 $ 9,942 Provision (credit) for loan losses 3,499 1,200 6,060 7,059 8,060 Loans charged-off (3,687 ) (34 ) (5,741 ) (3,987 ) (6,189 ) Recoveries - - (1 ) - 2 Total ending allowance balance $ 14,887 $ 15,075 $ 11,815 $ 14,887 $ 11,815 Total loans 1,420,966 1,381,649 1,055,706 1,420,966 1,055,706 Total nonperforming loans 3,389 7,092 3,660 3,389 3,660 Allowance for loan losses to total loans 1.05 % 1.09 % 1.12 % 1.05 % 1.12 % Allowance for loan losses to total nonperforming loans 439.21 % 212.55 % 322.82 % 439.21 % 322.82 % The ALLL at December 31, 2017 was 1.05% of total loans, compared to 1.12% at December 31, 2016, and 1.09% at September 30, 2017. The ALLL to total nonperforming loans was 439.2% at December 31, 2017, compared to 322.8% at December 31, 2016, and 212.6% at September 30, 2017. Net charge offs for the fourth quarter of 2017 were $3.7 million or 0.26% of total loans compared to $5.7 million or 0.54% of total loans for the fourth quarter of 2016 and $34,000 or 0.002% of total loans for the third quarter of 2017. Increase in charge offs in the fourth quarter of 2017 resulted from the aforementioned write off of a taxi medallion loan. After the charge off, the Company has no further exposure to taxi medallion loans.\nTotal deposits increased $410.5 million, or 41%, to $1.4 billion at December 31, 2017, compared to $993.7 million at December 31, 2016, and decreased $84.3 million, or (6%), compared to $1.49 billion at September 30, 2017. Core Deposits, which exclude all time deposits, increased $407.0 million, or 44.4%, to $1.32 billion at December 31, 2017, from $917 million at December 31, 2016, and decreased $81.3 million, or (5.8%), from $1.41 billion at September 30, 2017. The decrease in core deposits was largely due to year end funding needs of corporate clients. Average core deposit balances increased by $169 million or 13.4% compared to the sequential quarter.\nThe Bank’s deposit gathering initiatives are diversified and include a number of verticals leading to a solid core deposit base. Along with lending and non-borrowing retail relationships, the Bank also obtains deposits through its debit card issuing business and relationships with digital currency related businesses, which maintain non-interest bearing corporate and settlement accounts with the Bank. As a policy, these settlement account balances are not incorporated into the Bank’s funding strategies. The Bank’s policy is to keep deposit accounts related to digital currencies that are used for funding to less than 10% of its total deposit base.\nThe total cost of deposits decreased 10 basis points to 0.41% for the fourth quarter of 2017, from 0.51% for the fourth quarter of 2016, and decreased 6 basis points from 0.47% for the third quarter of 2017. The total cost of deposits was at 0.47% for the year ended December 31, 2017 and 0.51% for the year ended December 31, 2016.\nCommon equity was $231.4 million and tangible equity was $227.2 million at December 31, 2017, compared to $104 million and $99.8 million respectively at December 31, 2016. At September 30, 2017, common equity was $113.5 million and tangible equity was $109.2 million. Tangible book value per common share was $27.04 at December 31, 2017, compared to $20.76 at December 31, 2016, and $22.39 at September 30, 2017.\nAccumulated other comprehensive loss was ($206) thousand at December 31, 2017, compared to ($165) thousand at December 31, 2016, and ($47) thousand at September 30, 2017.\nAbout Metropolitan Bank Holding Corporation\nMetropolitan Bank Holding Corp. (NYSE: MCB) is the holding company for Metropolitan Commercial Bank ® , The Entrepreneurial Bank. The Bank provides a broad range of business, commercial and personal banking products and services to small and middle-market businesses, public entities and affluent individuals in the New York metropolitan area. Founded in 1999, the Bank is headquartered in New York City and operates five locations in Manhattan, Brooklyn and Great Neck, Long Island. The Bank is also an active issuer of debit cards for third-party debit card programs. Metropolitan Commercial Bank is a New York State chartered commercial bank, an FDIC member and an equal opportunity lender. For more information, please visit www.metropolitanbankny.com .\nForward Looking Statement Disclaimer\nThis release contains certain “forward-looking statements” about the Company which, to the extent applicable, are intended to be covered by the safe harbor for forward-looking statements provided under Federal securities laws and, regardless of such coverage, you are cautioned about. Examples of forward-looking statements include but are not limited to the Company’s financial condition and capital ratios, results of operations and the Company’s outlook and business. Forward-looking statements are not historical facts. Such statements may be identified by the use of such words as “may”, “believe”, “expect”, “anticipate”, “plan”, “continue”, or similar terminology. These statements relate to future events or our future financial performance and involve risks and uncertainties that may cause our actual results, levels of activity, performance or achievements to differ materially from those expressed or implied by these forward-looking statements. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we caution you not to place undue reliance on these forward-looking statements. Factors which may cause our forward-looking statements to be materially inaccurate include, but are not limited to, an unexpected deterioration in our loan portfolio, unexpected increases in our expenses, greater than anticipated growth, unanticipated regulatory action, unexpected changes in interest rates, an unanticipated loss of key personnel, an unanticipated loss of existing customers, competition from other institutions resulting in unanticipated changes in our loan or deposit rates, unanticipated increases in Federal Deposit Insurance Corporation costs and unanticipated adverse changes in our customers’ economic conditions or economic conditions in our local area in general.\nForward-looking statements speak only as of the date of this release. We do not undertake any obligation to update or revise any forward-looking statement, whether the result of new information, future events or otherwise.\nCONSOLIDATED BALANCE SHEETS End of Period: December 31, 2017 September 30, 2017 December 31, 2016 (in $000's, unaudited) Assets Cash and cash equivalents: Cash and due from banks $ 261,231 $ 267,099 $ 82,931 Investment securities available for sale 32,157 33,922 37,329 Investment securities held to maturity 5,428 5,681 6,500 Other investments 13,677 13,740 12,588 Loans 1,420,966 1,381,649 1,055,706 Deferred loan fees and unamortized costs, net (1,070 ) (820 ) (1,160 ) Allowance for loan losses (14,887 ) (15,075 ) (11,815 ) Net loans 1,405,009 1,365,754 1,042,731 Accounts receivable, net 6,601 3,825 5,420 Receivable from prepaid card programs, net 9,579 6,977 7,566 Accrued interest receivable 4,421 3,903 2,735 Premises and equipment, net 6,268 6,010 5,035 Prepaid expenses and other assets 5,751 7,013 7,733 Goodwill 9,733 9,733 9,733 Total assets $ 1,759,855 $ 1,723,657 $ 1,220,301 Liabilities Deposits: Noninterest-bearing demand deposits $ 812,497 $ 826,345 $ 403,402 Interest-bearing deposits 591,858 662,298 590,378 Total deposits 1,404,355 1,488,643 993,780 Borrowed Funds 42,198 43,750 78,418 Trust preferred securities 20,620 20,620 20,620 Subordinated debts, net of issuance cost 24,489 24,468 - Accounts payable, accrued expenses and other liabilities 21,678 20,411 10,901 Accrued interest payable 749 547 227 Debit cardholder balances 8,882 6,259 6,864 Total liabilities 1,522,971 1,604,698 1,110,810 Stockholders’ equity Class B preferred stock 3 3 3 Common stock 81 45 45 Additional paid in capital 211,145 96,422 96,116 Retained earnings 25,861 22,536 13,492 Accumulated other comprehensive (loss) (206 ) (47 ) (165 ) Total stockholders’ equity 236,884 118,959 109,491 Total liabilities and stockholders’ equity $ 1,759,855 $ 1,723,657 $ 1,220,301 CONSOLIDATED INCOME STATEMENTS For the Quarter Ended: For the Year Ended: December 31, September 30, December 31, December 31, December 31, (in $000's, unaudited) 2017 2017 2016 2017 2016 Interest and dividend income: Loans, including fees $ 16,304 $ 15,537 $ 42,360 $ 57,075 $ 42,360 Securities: Taxable 193 201 886 813 886 Tax-exempt 7 7 30 30 30 Money market funds and commercial paper 100 82 142 315 142 Other interest and dividends 1,260 574 737 2,520 737 Total interest income 17,864 16,401 44,155 60,753 44,155 Interest expense: Deposits 1,557 1,588 4,877 5,873 4,877 Borrowed funds 166 244 673 840 673 Trust preferred securities interest expense 166 165 539 636 539 Subordinated debt interest expense 404 440 - 1,322 - Total interest expense 2,293 2,437 6,089 8,671 6,089 Net interest income 15,571 13,964 38,066 52,082 38,066 Provision for loan losses 3,499 1,200 8,060 7,059 8,060 Net interest income after provision for loan losses 12,072 12,764 30,006 45,023 30,006 Non-interest income: Service charges on deposit accounts 1,820 836 876 3,452 876 Other service charges and fees 3,429 523 1,179 4,368 1,179 Loan prepayment penalties 71 27 402 111 402 Debit card income 929 847 2,926 3,369 2,926 Net gains on securities transactions - - 40 - 40 Total non-interest income 6,249 2,233 5,423 11,300 5,423 Non-interest expense: Compensation and benefits 5,478 4,847 17,010 19,165 17,010 Bank premises and equipment 1,200 1,075 3,985 4,385 3,985 Directors Fees 229 316 611 894 611 Insurance Expense 77 60 333 281 333 Professional fees 771 976 1,595 2,636 1,595 FDIC assessment 444 349 675 1,067 675 Core processing fees 542 423 862 1,495 862 Other expenses 1,038 544 2,300 2,821 2,300 Total non-interest expense 9,779 8,590 27,371 32,744 27,371 Net income before income tax expense 8,542 6,407 8,058 23,578 8,058 Income tax expense 5,216 2,562 3,045 11,209 3,045 Net Income $ 3,326 $ 3,845 $ 5,013 $ 12,369 $ 5,013 PER COMMON SHARE DATA (unaudited) Earnings per share – basic 0.50 0.83 0.01 2.40 0.43 Earnings per share – diluted 0.49 0.82 0.01 2.34 0.43 Average common shares outstanding for Diluted EPS 6,768,753 4,576,925 4,560,918\n5,202,234 3,673,026 Use of Non-GAAP Financial Measures\nIn addition to the results presented in accordance with Generally Accepted Accounting Principles (\"GAAP\"), the Company supplements its evaluation with an analysis of certain non-GAAP/adjusted financial measures including an adjusted net income available to common shareholders. We believe these non-GAAP financial measures, in addition to the related GAAP measures, provide meaningful information to investors in understanding our operating performance and trends. These non-GAAP measures have inherent limitations and are not required to be uniformly applied and are not audited. They should not be considered in isolation or as a substitute for an analysis of results reported under GAAP. These non-GAAP measures may not be comparable to similarly titled measures reported by other companies.\nReconciliations of non-GAAP/adjusted financial measures disclosed in this earnings release to the comparable GAAP measures are provided in the accompanying tables.\nSUPPLEMENTAL GAAP AND NON-GAAP FINANCIAL MEASURES As of (in $000's, unaudited) Dec. 31, Sept. 30, Jun. 30 Mar. 31 Dec. 31, 2017 2017 2017 2017 2016 Selected Financial Data\nTotal assets $ 1,759,855 $ 1,723,657 $ 1,586,773 $ 1,268,365 $ 1,220,301 Loans receivable: Commercial real estate 783,745 736,487 669,963 600,429 547,711 Commercial and industrial 340,001 346,738 332,291 284,009 315,870 Multifamily 190,097 187,753 179,245 131,097 117,373 Construction 36,960 37,723 40,386 36,137 29,447 One-to-four family 25,568 25,777 25,976 26,267 26,480 Consumer 44,595 47,171 38,115 20,959 18,825 Gross loans 1,420,966 1,381,649 1,285,976 1,098,898 1,055,706 Unearned net origination fees (1,070 ) (820 ) (823 ) (1,056 ) (1,160 ) Allowance for loan losses (14,887 ) (15,075 ) (13,909 ) (12,236 ) (11,815 ) Loans receivable, net $ 1,405,009 $ 1,365,754 $ 1,271,244 $ 1,085,606 $ 1,042,731 Securities available-for-sale $ 32,157 $ 33,922 $ 35,610 $ 41,927 $ 37,329 Goodwill and other intangible assets 9,733 9,733 9,733 9,733 9,733 Deposits: Noninterest-bearing demand 812,497 826,345 698,874 385,984 403,402 Interest-bearing deposits 591,858 662,298 630,424 630,693 590,378 Total Deposits $ 1,404,355 $ 1,488,643 $ 1,329,298 $ 1,016,677 $ 993,780 Borrowings 42,198 43,750 73,802 73,854 78,418 Trust preferred securities 20,620 20,620 20,620 20,620 20,620 Subordinated debentures (net of issuance costs) 24,489 24,468 24,453 25,000 - Total stockholders' equity $ 236,884 $ 118,959 $ 114,979 $ 112,207 $ 109,491 Three Months Ended Dec. 31, Sept. 30, Jun. 30 Mar. 31 Dec. 31, 2017 2017 2017 2017 2016 Net interest income $ 15,571 $ 13,964 $ 11,766 $ 10,783 $ 10,427 Provision for loan losses 3,499 1,200 1,790 570 6,060 Net interest income after provision for loan losses 12,072 12,764 9,976 10,213 4,367 Noninterest income\nService charges on deposit accounts\n1,820 836 505 291 249 Other service charges and fees 3,429 523 250 166 197 Loan prepayment penalties 71 27 13 - 14 Debit card income 929 847 805 788 828 Net gains on sales of securities - - - - - Total noninterest income 6,249 2,233 1,573 1,245 1,288 Noninterest expenses\nCompensation and benefits $ 5,478 $ 4,847 $ 4,264 $ 4,577 $ 3,573 Bank premises and equipment\n1,200 1,075 1,037 1,073 1,082 Directors fees $ 229 $ 316 $ 175 $ 174 $ 112 Insurance expense 77 60 65 79 82 Professional fees 771 976 480 410 411 FDIC assessment 444 349 105 170 168 Core processing fees 542 423 279 251 162 Other expenses 1,038 544 736 502 449 Total noninterest expenses 9,779 8,590 7,141 7,236 6,039 Income (loss) before income tax expense $ 8,542 $ 6,407 $ 4,408 $ 4,222 $ (384 ) Income tax expense (benefit) 5216 2562 1757 1674 -433 Net income available to common stockholders $ 3,326 $ 3,845 $ 2,651 $ 2,548 $ 49 Net income (loss) available to common stockholders $ 3,326 $ 3,845 $ 2,651 $ 2,548 $ 49 Reconciliation of GAAP Earnings to Earnings Excluding Writedown of Net Deferred Tax Assets and Taxi Medallion Loan\nCharge-off\nThree Months Ended Dec. 31, Sept. 30, Jun. 30 Mar. 31 Dec. 31, (in $000's, unaudited) 2017 2017 2017 2017 2016 Net income (loss) available to common stockholders $ 3,326 $ 3,845 $ 2,651 $ 2,548 $ 49 Writedown of Net Deferred Tax Assets 1,581 - - - - Charge-off related to taxi medallion loan (after taxes) 2,196 - - - 3,202 Net income available to common stockholders-adjusted $ 7,103 $ 3,845 $ 2,651 $ 2,548 $ 3,251 Weighted average diluted shares outstanding\n6,768,753\n4,576,925\n4,576,925\n4,574,525\n4,560,918\nDiluted EPS (GAAP) 0.49 0.82 0.57 0.55 0.01 Diluted EPS-adjusted (non-GAAP) (1) 1.04 0.82 0.57 0.55 0.70 (1) Adjusted net income available to common stockholders divided by weighted average diluted shares outstanding.\nThree Months Ended Dec. 31, Sept. 30, Jun. 30 Mar. 31 Dec. 31, (in $000's, unaudited)\n2017 2017 2017 2017 2016 Return on Assets Measures\nNet income available to common stockholders-adjusted Average assets $ 1,813,785 $ 1,633,543 $ 1,414,602 $ 1,236,036 $ 1,153,420 Less: average intangible assets 9,733 9,733 9,733 9,733 9,733 Average tangible assets 1,804,052 1,623,810 1,404,869 1,226,303 1,143,687 Return on avg. assets (GAAP) 0.73 % 0.94 % 0.75 % 0.83 % 0.02 % Return on avg. assets-adjusted (non-GAAP) (2) 1.57 % 0.94 % 0.75 % 0.82 % 1.13 % Return on avg. tangible assets (non-GAAP) (3) 0.74 % 0.95 % 0.75 % 0.83 % 0.02 % Return on avg. tangible assets-adjusted (non-GAAP) (4) 1.57 % 0.95 % 0.75 % 0.83 % 1.14 % (2) Adjusted net income available to common stockholders divided by average assets. (3) Net income available to common stockholders excluding amortization of intangible assets divided by average tangible assets. (4) Adjusted net income available to common stockholders excluding amortization of intangible assets divided by average tangible assets. Three Months Ended Dec. 31, Sept. 30, Jun. 30 Mar. 31 Dec. 31, (in $000's, unaudited) 2017 2017 2017 2017 2016 Return on Equity Measures\nNet income available to common stockholders-adjusted Average common equity $ 173,245 $ 111,553 $ 108,144 $ 105,336 $ 104,898 Less: average intangible assets 9,733 9,733 9,733 9,733 9,733 Average tangible common equity 163,512 101,820 98,411 95,603 95,165 Return on avg. common equity (GAAP) 7.68 % 13.79 % 9.80 % 9.68 % 0.19 % Return on avg. common equity-adjusted (non-GAAP) (5) 16.40 % 13.79 % 9.80 % 9.68 % 12.40 % Return on avg. tangible common equity (non-GAAP) (6) 8.14 % 15.11 % 10.77 % 10.66 % 0.21 % Return on avg. tangible common equity-adjusted (non-GAAP) (7) 17.38 % 15.11 % 10.77 % 10.66 % 13.66 % (5) Adjusted net income available to common stockholders divided by average common equity. (6) Net income available to common stockholders divided by average tangible common equity. (7) Adjusted net income available to common stockholders divided by average tangible common equity. Three Months Ended Dec. 31, Sept. 30, Jun. 30 Mar. 31 Dec. 31, 2017 2017 2017 2017 2016 Efficiency Measures\nTotal noninterest expenses 9,779 8,590 7,141 7,236 6,039 Net interest income 15,571 13,964 11,766 10,783 10,427 Noninterest income 6,249 2,233 1,573 1,245 1,288 Operating revenue 21,820 16,197 13,339 12,028 11,715 Operating efficiency ratio (non-GAAP) (8) 44.82 % 53.03 % 53.53 % 60.16 % 51.55 % (8) Operating noninterest expense divided by operating revenue. Net Interest Margin\nAverage interest-earning assets 1,785,784 1,546,332 1,357,189 1,213,217 1,134,562 Net interest margin (GAAP) 3.49 % 3.62 % 3.48 % 3.60 % 3.71 % Three Months Ended Dec. 31, Sept. 30, Jun. 30 Mar. 31 Dec. 31, (in $000's, unaudited) 2017 2017 2017 2017 2016 Capital Ratios and Book Value per Share\nCommon equity $ 231,381 $ 113,457 $ 109,477 $ 106,704 $ 103,988 Less: intangible assets 9,733 9,733 9,733 9,733 9,733 Tangible common equity 221,648 103,724 99,744 96,971 94,255 Total assets 1,759,855 1,723,657 1,586,773 1,268,365 1,220,301 Less: intangible assets 9,733 9,733 9,733 9,733 9,733 Tangible assets 1,750,122 1,713,924 1,577,040 1,258,632 1,210,568 Common shares outstanding 8,196,310 4,633,012 4,633,012 4,633,012 4,539,925 Regulatory capital ratios (The Company): Tier 1 leverage 13.71 % 7.96 % 8.91 % 9.54 % 10.49 % Tier 1 risk-based capital 17.09 % 7.38 % 9.62 % 10.72 % 11.32 % Total risk-based capital 19.84 % 12.01 % 12.63 % 14.14 % 12.45 % Common equity tier 1 capital 15.33 % 9.19 % 7.67 % 8.89 % 10.80 % Book value per share (GAAP) 28.23 24.49 23.63 23.03 22.91 Tangible book value per share (non-GAAP) (9) 27.04 22.39 21.53 20.93 20.76 (9) Tangible common equity divided by common shares outstanding at period-end. NET INTEREST INCOME AND NET INTEREST MARGIN For the three months ended December 31,\n2017 2016 (in $000's, unaudited) Average\nOutstanding\nBalance\nInterest Yield/ Rate (1)\nAverage\nOutstanding\nBalance\nInterest Yield/ Rate (1)\nInterest-earning assets: Loans $ 1,397,700 $ 16,304 4.63 % $ 1,000,187 $ 11,533 4.59 % Available-for-sale securities 33,322 172 2.06 % 38,729 199 2.06 % Held-to-maturity securities\n5,559 28 2.01 % 6,723 33 1.96 % Other interest-earning assets 349,203 1,360 1.55 % 88,922 196 0.88 % Total interest-earning assets 1,785,784 17,864 3.97 % 1,134,561 11,961 4.19 % Noninterest-earning assets 43,323 30,280 Allowance for loan and lease losses (15,322 ) (11,421 ) Total assets $ 1,813,785 $ 1,153,420 78.27 % 88.16 % Interest-bearing liabilities: Money market and savings accounts $ 559,339 $ 1,277 0.91 % $ 524,923 $ 975 0.74 % Certificates of deposit 82,020 280 1.35 % 91,485 282 1.23 % Total interest-bearing deposits 641,359 1,557 0.96 % 616,408 1,257 0.81 % Borrowed funds 88,488 736 3.30 % 48,403 235 1.93 % Total interest-bearing liabilities 729,847 2,293 1.25 % 664,811 1,492 0.89 % Noninterest-bearing deposits 868,117 371,871 Other non-interest bearing liabilities 37,074 6,350 Total liabilities 1,635,038 1,043,032 Equity 178,747 110,388 Total liabilities and equity $ 1,813,785 $ 1,153,420 Net interest income $ 15,571 $ 10,469 Net interest rate spread (2) 2.72 % 3.30 % Net interest-earning assets (3) $ 1,055,937 $ 469,750 Net interest margin (4) 3.49 % 3.71 % Average interest-earning assets to interest-bearing liabilities 244.68 % 170.66 % Cost of Funds 0.57 % 0.57 % (1) Yields and rates are annualized for the three months ended December 31, 2017 and 2016. (2) Represents the difference between the yield on average interest-earning assets and the cost of average interest-bearing liabilities. (3) Represents total interest-earning assets less total interest-bearing liabilities. (4) Represents net interest income divided by total interest-earning assets. NET INTEREST INCOME AND NET INTEREST MARGIN For the twelve months ended December 31,\n2017 2016 (in $000's, unaudited) Average\nOutstanding\nBalance\nInterest Yield/ Rate Average\nOutstanding\nBalance\nInterest Yield/ Rate Interest-earning assets: Loans $ 1,244,194 $ 57,075 4.59% $ 931,207 $ 42,360 4.56% Available-for-sale securities 37,649 720 1.91% 41,836 842 2.01% Held-to-maturity securities\n3,399 123 3.61% 6,215 121 2.01% Other interest-earning assets 195,805 2,835 1.45% 85,186 832 1.01% Total interest-earning assets 1,481,047 60,753 4.10% 1,064,444 44,155 4.16% Noninterest-earning assets 58,477.48 43,918 Allowance for loan and lease losses (15,322) (11,131) Total assets $ 1,524,202 $ 1,097,231 81.63% 84.87% Interest-bearing liabilities: Money market and savings accounts $561,733 $ 4,840 0.86% $501,619 $ 3,674 0.73% Certificates of deposit 80,130 1,033 1.29% 101,950 1,203 1.18% Total interest-bearing deposits 641,863 5,873 0.91% 603,569 4,877 0.80% Borrowed funds 105,684 2,798 2.61% 69,840 1,212 1.74% Total interest-bearing liabilities 747,547 8,671 1.16% 673,409 6,089 0.90% Noninterest-bearing deposits 607,743 313,594 Other non-interest bearing liabilities 35,450 20,022 Total liabilities 1,390,740 1,007,025 Equity 133,462 90,206 Total liabilities and equity $ 1,524,202 $ 1,097,231 Net interest income $ 52,082 $ 38,066 Net interest rate spread (1) 2.94% 3.26% Net interest-earning assets (2) $ 733,500 $ 391,035 Net interest margin (3) 3.54% 3.57% Average interest-earning assets to interest-bearing liabilities 198.12% 158.07% Cost of Funds 0.64% 0.61% (1) Represents the difference between the yield on average interest-earning assets and the cost of average interest-bearing liabilities. (2) Represents total interest-earning assets less total interest-bearing liabilities. (3) Represents net interest income divided by total interest-earning assets.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129006215/en/\nMetropolitan Bank Holding Corp.\nEdward Nebb, 203-972-8350\nIR@MetropolitanBankNY.com\nSource: Metropolitan Bank Holding Corp.", "external_links": ["http://www.businesswire.com/news/home/20180129006215/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.metropolitanbankny.com&esheet=51750396&newsitemid=20180129006215&lan=en-US&anchor=www.metropolitanbankny.com&index=1&md5=364d1f4b116e6db61863b5db888c642a"], "published": "2018-01-30T01:10:00.000+02:00", "crawled": "2018-01-30T03:44:08.004+02:00", "highlightTitle": ""}