{"organizations": [], "uuid": "0c2ea0c6dd5180877ea0c65596918c0d6c2077e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219214161&w=1200&r=LYNXMPEE03066", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-iran-rallies-los-angeles/los-angeles-large-iranian-community-cheers-anti-regime-protests-idUSKBN1ET0BN", "country": "US", "domain_rank": 408, "title": "Los Angeles' large Iranian community cheers anti-regime protests", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-04T11:29:00.000+02:00", "replies_count": 0, "uuid": "0c2ea0c6dd5180877ea0c65596918c0d6c2077e7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-iran-rallies-los-angeles/los-angeles-large-iranian-community-cheers-anti-regime-protests-idUSKBN1ET0BN", "ord_in_thread": 0, "title": "Los Angeles' large Iranian community cheers anti-regime protests", "locations": [], "entities": {"persons": [{"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "roozbeh farahanipour", "sentiment": "none"}, {"name": "farahanipour", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "united", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (Reuters) - Many in Los Angeles’ Iranian expatriate community, the largest in the United States, are heartened by anti-government street protests back home but want to make sure international focus stays on what they see as a struggle for democracy. \nHundreds of thousands of people have fled Iran since the 1979 Islamic revolution and are concentrated in a neighborhood on the city’s west side nicknamed “Tehrangeles” dotted with Persian shops and restaurants. The community is welcoming support for the protesters from political leaders of both parties in the United States. \nRoozbeh Farahanipour, a leader of the 1999 student movement who was jailed three times before fleeing the country under a death sentence and winning asylum in the United States, said moral support from U.S. leaders was crucial, praising supportive tweets from both President Donald Trump and his rival in the 2016 election, Democrat Hillary Clinton. \nIn 2009, Farahanipour said, some activists were disappointed when then-President Barack Obama showed support for reformers instead of those seeking regime change. \n“It’s exciting that this time there is no reformist movement involved. The people realize that reform is not going to work this time. They want regime change,” he said. \nAny pro-regime Iranians with ties to the government who may live in the area have kept a low profile. \nPeople protest in Los Angeles, California, U.S., in support of anti-government protesters in Iran, January 3, 2018. REUTERS/Lucy Nicholson Iran’s elite Revolutionary Guards have dispatched forces to several provinces after six days of street demonstrations that began out of frustration over economic hardships suffered by youth and the working class that have left 21 people dead. \nActivists in Los Angeles are planning a rally on Sunday at a federal building on the city’s west side to show moral support for the uprising and draw attention to the struggle going on in their homeland. \nIranian expatriate Roozbeh Farahanipour poses for a photo in his restaurant in Los Angeles, California U.S. January 3, 2018. Picture taken January 3, 2018. REUTERS/Lucy Nicholson Roxanne Ganji, a prominent Los Angeles-based pro-democracy activist whose father served as minister of education under the last Shah before his 1979 overthrow, said this generation of protesters seemed to less fearful than their predecessors. \n“The youth don’t have any future,” Ganji said. “A lot of (Iranians) come to L.A. after they finished college there and they are happier to be a waiter here. The economic situation is dire.” \nThe protests erupted in working-class neighborhoods over economic stagnation, high unemployment and allegations of graft within clerical and security hierarchies. They have evolved into a larger clash against the powers and privileges of a remote elite especially Supreme Leader Ayatollah Ali Khamenei. \nSid Mohasseb, an Iranian author and adjunct business professor at the University of Southern California, said U.S. media comparisons to a 2009 revolt over accusations of election fraud failed to consider that the earlier uprising was driven by middle-class Iranians who had stronger ties to the government. \n“This is massive, across the country, and it started with a different class of people. This is folks that are hurting in the pocketbook,” Mohasseb said. “I actually think its going to go somewhere precisely because they (in the government) can’t identify the leaders. If you say, ‘Here is the leader,’ they’ll go after that leader and take him out.” \nReporting by Dan Whitcomb; Additional reporting by Alex Dobuzinskis; Editing by Cynthia Osterman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T11:29:00.000+02:00", "crawled": "2018-01-04T07:52:48.002+02:00", "highlightTitle": ""}