{"organizations": [], "uuid": "861a9455d6869feb5a2e30a9016d88f3f85027a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/03/104749895-IMG_9615-irwin-simon.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/a-hain-celestial-deal-may-finally-happen-this-year-heres-why.html", "country": "US", "domain_rank": 767, "title": "A Hain Celestial deal may finally happen this year. Here's why.", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.069, "site_type": "news", "published": "2018-01-05T19:30:00.000+02:00", "replies_count": 0, "uuid": "861a9455d6869feb5a2e30a9016d88f3f85027a7"}, "author": "Lauren Hirsch", "url": "https://www.cnbc.com/2018/01/05/a-hain-celestial-deal-may-finally-happen-this-year-heres-why.html", "ord_in_thread": 0, "title": "A Hain Celestial deal may finally happen this year. Here's why.", "locations": [], "entities": {"persons": [{"name": "scott mlyn", "sentiment": "negative"}, {"name": "tyson", "sentiment": "none"}, {"name": "alba botanica", "sentiment": "none"}, {"name": "hain", "sentiment": "none"}, {"name": "ella", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc irwin simon", "sentiment": "negative"}, {"name": "hain celestial  shares of hain celestial", "sentiment": "neutral"}, {"name": "new york post", "sentiment": "none"}, {"name": "unilever", "sentiment": "none"}, {"name": "avalon organics", "sentiment": "none"}, {"name": "pri", "sentiment": "none"}, {"name": "plainville farms", "sentiment": "none"}, {"name": "big food", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shares of Hain Celestial dropped Friday on a report describing the company's sale prospects as grim due to its \"overload\" of brands.\nIndeed, Hain's many brands have complicated a sale process for quite some time. Some of the country's biggest food companies have already looked and passed. But this year, several factors — continued pressure on Big Food, Hain itself and even tax reform — may finally lead to a deal transpiring.\nFirst let's start with the challenges that have prevented a sale in the past.\nPrimarily, it has been, as the Thursday New York Post article acknowledges, that the company is a collection of seemingly haphazard brands and businesses: its protein business (Empire Kosher Poultry, Plainville Farms), its personal care business (Alba Botanica, Avalon Organics) and food (Terra Chips, Ella's Kitchen).\nThere has never been a clear buyer for all of these businesses, but there has been for select parts. The personal care business could make sense for Unilever . The protein business could work for Tyson or Pilgrim's Pride .\nThe snack business could be attractive for a number of food giants, if not for the fact that Hain's larger brands, like Celestial Seasonings, are swarmed by brands that have less than $75 million in revenue. It takes a lot of money for big food companies to turn small bits of revenue into large national brands. Companies have been largely adverse to making that gamble on Hain.\nMeantime, Hain's founder and CEO Irwin Simon, is the one that led the acquisitions and management of these small brands in its entirety. Without his knowledge and relationships, companies have been concerned it might be uniquely hard to pass the torch.\nHere's what's changed.\nFood companies are under more pressure than ever before .\nThe spree of 3G-style cost-cutting over the past few years has left little obvious fat left to trim. Food retailers are moving online, a channel that no longer offers yards of shelves to promote iconic products. Amazon and European grocers like Lidl are expanding their private-label presence in the U.S., appealing to millennials who care more about price than they do brand.\nCampbell Soup and Hershey recently announced their largest deals yet, buying Snyder's-Lance for $4.87 billion and Amplify Snack Brands for $1.6 billion, respectively.\nSnyder's-Lance, like Hain, had long been a potential takeover target, but many industry sources thought its direct store delivery model made a deal too complicated and expensive. Campbell's plans to buy the pretzel company therefore demonstrate the bets that companies are now willing to take.\nWith Snyder's and Amplify now off the table, the number of potential targets large enough to make an impact on the largest food brands has further whittled from what was already slim pickings.\nMeantime, the lowering of the corporate tax rate may help mitigate the complexity in breaking up Hain's various businesses. As the corporate tax rate drops from 35 percent to 21 percent, it may be cheaper for it to sell off a division than in times past.\nNot to mention, Hain has an activist. If Whole Foods is any lesson, an activist can make deals people thought would never happen become a reality .\nA settlement with activist investor Engaged Capital recently put its founder Glenn Welling on the Hain board. Engaged had disclosed at 9.9 percent stake the company over the summer.\nHain shares, which fell nearly 4 percent early Friday before recouping losses, were recently down less than 1 percent.", "external_links": [], "published": "2018-01-05T19:30:00.000+02:00", "crawled": "2018-01-05T19:47:25.009+02:00", "highlightTitle": ""}