{"organizations": [], "uuid": "d1d7ec89f1455e0f385e4eecc5ffe6e6577b1d4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-index-slips-to-3-year-low-on-broad-based-weakness-idUSL2N1PI1QW", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar index slips to 3-year low on broad-based weakness", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.911, "site_type": "news", "published": "2018-01-24T05:07:00.000+02:00", "replies_count": 0, "uuid": "d1d7ec89f1455e0f385e4eecc5ffe6e6577b1d4b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-index-slips-to-3-year-low-on-broad-based-weakness-idUSL2N1PI1QW", "ord_in_thread": 0, "title": "FOREX-Dollar index slips to 3-year low on broad-based weakness", "locations": [], "entities": {"persons": [{"name": "updat", "sentiment": "negative"}, {"name": "naeem aslam", "sentiment": "none"}, {"name": "saqib iqbal ahmed", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro zone consumer confidence jumps more than expected\n* Dollar slips vs yen after BoJ meet (Updates prices, market activity, comment)\nBy Saqib Iqbal Ahmed\nNEW YORK, Jan 23 (Reuters) - The dollar extended recent weakness against a basket of major currencies to hit a fresh three-year low on Tuesday, after the euro surged on consumer confidence data indicating strong momentum in the region’s economy.\nThe dollar index, which measures the greenback against six rival currencies, was down 0.32 percent at 90.115, after slipping as low as 90.063, its lowest since December 2014.\nThe euro was up 0.29 percent to $1.2295 against the greenback.\nData from the European Commission showed euro zone consumer confidence jumped much more than expected in January.\n“The number tells us one story, which is that the growth is booming in the euro zone. Hence, we are seeing massive buying pressure for the euro,” said Naeem Aslam, chief market analyst for Think Markets in London.\nInvestors were also focused on Thursday’s European Central Bank meeting for clues on the outlook for monetary policy, analysts said.\n“The market is really spinning a really positive tale around the ECB at the moment,” said Lennon Sweeting, chief market strategist at XE in Toronto.\nThe euro has rallied this year, boosted by growing optimism that a strengthening economy would prompt the ECB to signal a quicker end to years of efforts to stimulate the economy than previously forecast.\nThe dollar failed to hold early gains against the Japanese yen after the Bank of Japan kept monetary policy unchanged.\nThe greenback slipped about half a percent to 110.31 yen, its lowest since Wednesday.\n“There is nothing out of the Bank of Japan that would indicate that there is a real reason to get behind yen at the moment. Despite any fundamentals or central banking positioning, yen continues to perform well in risk-off scenarios,” said Sweeting.\nDollar bears were emboldened by U.S. President Donald Trump’s signing of an executive order imposing steep import tariffs on washing machines and solar panels, a move condemned by China and South Korea, Sweeting said.\nThe British pound powered past $1.40 to its highest level since the vote to leave the European Union in June 2016, extending a rally on the back of growing optimism around Britain’s chances of securing a favourable Brexit deal.\nMexico’s peso pared sharp losses after President Trump said talks to renegotiate the North American Free Trade Agreement (NAFTA) were going well.\nReporting by Saqib Iqbal Ahmed; Editing by Jonathan Oatis and Meredith Mazzilli\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T05:07:00.000+02:00", "crawled": "2018-01-24T08:29:52.000+02:00", "highlightTitle": ""}