{"organizations": [], "uuid": "99909cbc9fd924d956f04c14284a0c8417e0265c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/09/104272092-Euro_Italy.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/11/dollar-slumps-euro-lifted-by-hawkish-ecb-minutes.html", "country": "US", "domain_rank": 767, "title": "Dollar slumps, euro lifted by hawkish ECB minutes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T03:58:00.000+02:00", "replies_count": 0, "uuid": "99909cbc9fd924d956f04c14284a0c8417e0265c"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/11/dollar-slumps-euro-lifted-by-hawkish-ecb-minutes.html", "ord_in_thread": 0, "title": "Dollar slumps, euro lifted by hawkish ECB minutes", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The dollar slumped to a more than three-year low against the euro on Friday, as the common currency extended its gains on hopes that European Central Bank policymakers are preparing to reduce their vast monetary stimulus program.\nThe euro was up 1.23 percent to $1.2179, on pace for its biggest single-day percentage gain against the greenback in about two months.\nOn Thursday, the euro rose 0.72 percent against the dollar after ECB policymakers said in minutes of the bank's December meeting that they could revisit their communication stance in early 2018.\nInvestors took that as a signal that the ECB will wind down its 2.55 trillion euro ($3.10 trillion) bond purchase scheme this year if Europe's economy continues to hum along.\n\"The latest ECB comments were a bit on the hawkish side, so that's giving more life to the euro,\" Minh Trang, senior currency trader at Silicon Valley Bank in Santa Clara, California.\nThe euro found further support after Chancellor Angela Merkel struck a deal with Social Democrat (SPD) rivals on Friday to open government coalition talks, easing months of uncertainty that has undermined Germany's global role and raised questions about her political future.\nshow chapters The US dollar is a 'little bit oversold' 8:06 PM ET Wed, 10 Jan 2018 | 01:50 The euro's rise weighed on the dollar index, which measures the greenback against six rival currencies. The index was down 0.94 percent at 91.00.\nThe index pared losses slightly after data showed underlying U.S. consumer prices recorded their largest increase in 11 months in December amid strong gains in the cost of rental accommodation and healthcare, bolstering expectations that inflation will accelerate this year.\n\"Everyone is waiting for some type of inflation number to materialise,\" said Trang.\n\"But, it may be a bit premature to jump on the inflation bandwagon. I would want to see at least a quarter or two of some solid numbers,\" he said.\nSterling rocketed to its highest level against the dollar since the vote to leave the European Union in mid-2016, after a report that the Netherlands and Spain were open to a softer Brexit deal for Britain.\nSterling was up 1.44 percent to $1.3732.\nBitcoin was 3.67 percent higher at $13,774.59 on the Luxembourg-based Bitstamp exchange a day after it skidded over 11 percent after the government of South Korea, a crucial source of global demand for cryptocurrency, said it was considering a plan to ban cryptocurrency trading.", "external_links": [], "published": "2018-01-12T03:58:00.000+02:00", "crawled": "2018-01-12T03:54:19.028+02:00", "highlightTitle": ""}