{"organizations": [], "uuid": "2eee0ad1439dab75d970eb10ebd70badd492e73f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223353196&w=1200&r=LYNXMPEE0I0YC", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/uk-malawi-drought/malawi-seeks-divine-intervention-as-drought-pests-threaten-maize-crop-idUSKBN1F816Q", "country": "US", "domain_rank": 408, "title": "Malawi seeks divine intervention as drought, pests threaten maize crop", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:07:00.000+02:00", "replies_count": 0, "uuid": "2eee0ad1439dab75d970eb10ebd70badd492e73f"}, "author": "", "url": "https://www.reuters.com/article/uk-malawi-drought/malawi-seeks-divine-intervention-as-drought-pests-threaten-maize-crop-idUSKBN1F816Q", "ord_in_thread": 0, "title": "Malawi seeks divine intervention as drought, pests threaten maize crop", "locations": [], "entities": {"persons": [{"name": "frank phiri", "sentiment": "none"}, {"name": "mutharika", "sentiment": "none"}, {"name": "peter mutharika", "sentiment": "none"}], "locations": [{"name": "malawi", "sentiment": "none"}, {"name": "lilongwe", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LILONGWE (Reuters) - A dry spell and worsening pest infestation are threatening Malawi’s staple maize crop, prompting President Peter Mutharika on Friday to call on government officials to lead prayers for rain.\nImpoverished Malawi is periodically hit by food shortages as the tropical southern African country relies heavily on rain-fed agriculture and most of its maize is grown on small plots by subsistence farmers.\nThe current dry spell has been exacerbated by an outbreak of crop-munching fall armyworms, a pest from Latin America that first threatened African crops late in 2016.\nIn a statement, Mutharika asked cabinet ministers and all senior government officials to lead prayer vigils at mosques and churches starting on Friday and throughout the weekend.\n“The President urges the faith community and all Malawians to pray for good rains and a productive season this Friday, Saturday and Sunday,” the statement said. Such a call can have resonance in deeply religious Malawi, which has high rates of church and Mosque attendance.\nOfficial estimates of the damage to maize by both the drought and armyworms are underway, government and farmer organisations have said.\nThe president declared the armyworms a national disaster in December after it was discovered that they had spread to 20 of Malawi’s 28 districts.\nAlbert Changaya, a senior official in the department of agriculture, told journalists the armyworm infestation had spread from an initial 35,000 hectares to 206,000 hectares of maize.\nMalawi’s maize production in the 2016/17 farming season rose a third to 3.2 million tonnes. The surplus harvest led to maize prices falling and contributed to lower inflation as food accounts for 50.1 percent of Malawi’s CPI (consumer price inflation) basket.\nMalawi’s consumer inflation slowed to 7.1 percent year-on-year in December from 7.7 percent in November, the National Statistical Office said on Wednesday, with food inflation easing to 4.3 percent from 4.7 percent.\nThe Tobacco Association of Malawi said separately on Thursday it was undertaking field estimates of the cash crop amidst the drought. Tobacco is a key export earner.\nEditing by Ed Stoddard and Mark Potter\n ", "external_links": [], "published": "2018-01-19T16:07:00.000+02:00", "crawled": "2018-01-19T16:26:39.007+02:00", "highlightTitle": ""}