{"organizations": [], "uuid": "6f5368bb66bc67f45b781708cb20216fd15b5012", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-deutsche-asset-management-expands-high-yield-etf-suite.html", "country": "US", "domain_rank": 767, "title": "Deutsche Asset Management Expands High Yield ETF Suite", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.182, "site_type": "news", "published": "2018-01-11T17:15:00.000+02:00", "replies_count": 0, "uuid": "6f5368bb66bc67f45b781708cb20216fd15b5012"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-deutsche-asset-management-expands-high-yield-etf-suite.html", "ord_in_thread": 0, "title": "Deutsche Asset Management Expands High Yield ETF Suite", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "deutsche asset management", "sentiment": "negative"}, {"name": "hyup", "sentiment": "negative"}, {"name": "deutsche am", "sentiment": "none"}, {"name": "hydw", "sentiment": "none"}, {"name": "morningstar", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New funds – SHYL, HYUP and HYDW – offer investors cost-effective, targeted exposure to the high yield bond market\nNEW YORK--(BUSINESS WIRE)-- Deutsche Asset Management (Deutsche AM) today announced the addition of three Xtrackers exchange-traded funds (ETFs) to its high yield suite – Xtrackers Short Duration High Yield Corporate Bond ETF (NYSE Arca: SHYL), Xtrackers High Beta High Yield Bond ETF (NYSE Arca: HYUP) and Xtrackers Low Beta High Yield Bond ETF (NYSE Arca: HYDW). The new funds complement the current offering of the Xtrackers USD High Yield Corporate Bond ETF (NYSE Arca: HYLB), which has raised more than USD 500 million since its launch just over one year ago (as of Jan. 11, 2018). The three new products will provide investors with exposure to different levels of credit and interest rate risk for more customizable risk allocation in their portfolios.\nHYUP offers investors access to lower-credit quality, higher beta bonds, while HYDW provides access to lower beta bonds. Through SHYL, investors will now have the most cost-efficient access, in its Morningstar peer group, 1 to benchmark exposure to short duration high yield bonds.\n“In today’s low interest rate environment, fixed income investors are looking for new sources of yield,” said Fiona Bassett, Head of Passive Asset Management, Americas. “Our expanded Xtrackers suite of high yield bond ETFs uses rules-based strategies to provide exposure to different levels of credit and interest rate risk, allowing investors to manage credit and duration exposure for a more customized solution. SHYL will allow investors to gain cost efficient exposure specifically to the short duration high yield bonds. In addition, the unique construction methodology of HYUP and HYDW may help investors achieve their desired level of yield and credit risk while maintaining varied exposure to the underlying high yield market.”\nSHYL seeks to track the performance, before fees and expenses, of the Solactive USD High Yield Corporates Total Market 0-5 Year Index. HYUP seeks to track the performance, before fees and expenses, of the Solactive USD High Yield Corporates Total Market High Beta Index. HYDW seeks to track the performance, before fees and expenses, of the Solactive USD High Yield Corporates Total Market Low Beta Index.\nDeutsche AM’s suite also includes Xtrackers USD High Yield Corporate Bond ETF (NYSE Arca: HYLB), which seeks to track the performance, before fees and expenses, of the Solactive USD High Yield Corporates Total Market Index; and Xtrackers High Yield Corporate Bond-Interest Rate Hedged ETF (Cboe: HYIH), which seeks to track the performance, before fees and expenses, of the Solactive High Yield Corporate Bond - Interest Rate Hedged Index.\nFor more information about the ETFs available in the US, visit: www.Xtrackers.com .\nDeutsche Asset Management\nWith EUR 711 billion of assets under management (as of September 30, 2017), Deutsche Asset Management 2 is one of the world’s leading investment management organizations. Deutsche Asset Management offers individuals and institutions traditional and alternative investments across all major asset classes.\nShares are not individually redeemable, and owners of Shares may acquire those Shares from the Fund, or tender such Shares for the redemption to the Fund, in Creation Units only.\nConsider each Fund’s investment objectives, risk factors, and charges and expenses before investing. This and other important information can be found in the Fund’s prospectus, which may be obtained by calling 1-855-DBX-ETFS (1-855-329-3837) or by viewing or downloading a prospectus at www.Xtrackers.com . Please read it carefully before investing.\nDBX Advisors LLC (DBX) is the investment adviser to the Xtrackers ETFs, which are distributed by ALPS Distributors, Inc. (ALPS). DBX is an indirect, wholly-owned subsidiary of Deutsche Bank AG, neither of which is affiliated with ALPS.\nRISKS: Investing involves risk, including possible loss of principal. Stocks may decline in value. Bond investments are subject to interest-rate, credit, liquidity and market risks to varying degrees. When interest rates rise, bond prices generally fall. Foreign investing involves greater and different risks than investing in US companies, including currency fluctuations, less liquidity, less developed or less efficient trading markets, lack of comprehensive company information, political instability and differing auditing and legal standards. Emerging markets tend to be more volatile and less liquid than the markets of more mature economies, and generally have less diverse and less mature economic structures and less stable political systems than those of developed countries. Funds investing in a single industry, country or in a limited geographic region generally are more volatile than more diversified funds. Performance of a Fund may diverge from that of an Underlying Index due to operating expenses, transaction costs, cash flows, use of sampling strategies or operational inefficiencies. There are additional risks associated with investing in high-yield bonds, aggressive growth stocks, non-diversified/concentrated funds and small- and mid-cap stocks which are more fully explained in the prospectuses, as applicable. An investment in any Fund should be considered only as a supplement to a complete investment program for those investors willing to accept the risks associated with that fund. Please read the prospectus for more information.\nNothing contained herein is fiduciary or impartial investment advice that is individualized or directed to any plan, plan participant, or IRA owner regarding the advisability of any investment transaction, including any IRA distribution or rollover.\nNo bank guarantee | Not FDIC insured | May lose value\n© 2018 Deutsche Asset Management. All rights reserved. DBX003177 01.11.2019 054035_1.0_\n1 Source: Morningstar, as of January 11, 2018.\n2 Deutsche Asset Management is the brand name of the Asset Management division of the Deutsche Bank Group. The respective legal entities offering products or services under the Deutsche Asset Management brand are specified in the respective contracts, sales materials and other product information documents.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111005185/en/\nDeutsche Asset Management\nPress & Media Relations\nOksana Poltavets, +1 212-250-0072\noksana.poltavets@db.com\nSource: Deutsche Asset Management", "external_links": ["http://www.businesswire.com/news/home/20180111005185/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.Xtrackers.com&esheet=51741561&newsitemid=20180111005185&lan=en-US&anchor=www.Xtrackers.com&index=3&md5=206a717c8660fa0e48bfaa0f84f946e1", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fetfus.deutscheam.com%2FUS%2FEN%2FProduct-Detail-Page%2FHYLB&esheet=51741561&newsitemid=20180111005185&lan=en-US&anchor=Xtrackers+USD+High+Yield+Corporate+Bond+ETF&index=1&md5=623338a913232c5a07c31c4b820cb433", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fetfus.deutscheam.com%2FUS%2FEN%2FProduct-Detail-Page%2FHYIH&esheet=51741561&newsitemid=20180111005185&lan=en-US&anchor=Xtrackers+High+Yield+Corporate+Bond-Interest+Rate+Hedged+ETF&index=2&md5=4061ee670588deb63d8c1fa312fbfc0c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.Xtrackers.com&esheet=51741561&newsitemid=20180111005185&lan=en-US&anchor=www.Xtrackers.com&index=4&md5=cfdc9c363a6ca6fdf53a23ee2b035f73"], "published": "2018-01-11T17:15:00.000+02:00", "crawled": "2018-01-11T19:05:41.015+02:00", "highlightTitle": ""}