{"organizations": [], "uuid": "f722d84a758e1a7bbca27ba845524c1872c21507", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224446595&w=1200&r=LYNXMPEE0M0QT", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-egypt-politics-army/egypt-army-says-ex-military-chiefs-presidential-bid-is-incitement-idUSKBN1FC1CV", "country": "US", "domain_rank": 408, "title": "Last major challenger to Egypt's Sisi calls off campaign after arrest", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.311, "site_type": "news", "published": "2018-01-23T19:34:00.000+02:00", "replies_count": 0, "uuid": "f722d84a758e1a7bbca27ba845524c1872c21507"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-egypt-politics-army/egypt-army-says-ex-military-chiefs-presidential-bid-is-incitement-idUSKBN1FC1CV", "ord_in_thread": 0, "title": "Last major challenger to Egypt's Sisi calls off campaign after arrest", "locations": [], "entities": {"persons": [{"name": "sisi", "sentiment": "negative"}, {"name": "abdel fattah al-sisi", "sentiment": "none"}, {"name": "anan", "sentiment": "none"}, {"name": "hazem hosni", "sentiment": "none"}, {"name": "sami anan", "sentiment": "none"}], "locations": [{"name": "cairo", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "cairo", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 11:34 AM / Updated 10 minutes ago Last major challenger to Egypt's Sisi calls off campaign after arrest Reuters Staff 4 Min Read \nCAIRO (Reuters) - The last challenger seen as a potential threat to the re-election of Egyptian President Abdel Fattah al-Sisi was detained on Tuesday, and halted his campaign after the army accused him of breaking the law by running for office without permission. \nFormer military chief of staff Lieutenant General Sami Anan, who had announced his candidacy last week, was taken to the Military Prosecutor’s office in Cairo, according to his son and one of his lawyers, who were waiting outside the building. \nAn army statement read on state TV said Anan’s presidential bid amounted to “a serious breach of the laws of military service”, because as a military officer he was required to end his service and seek permission before seeking office. \nAnan’s spokesman denied he had broken any laws. The charges “come from an inaccurate reading of Anan’s announcement,” Hazem Hosni told Reuters, without elaborating. The campaign announced Anan was halting his bid. \n“To be banned by the state to enter the elections ... (means) that the state doesn’t want to hold an election,” Anan’s spokesman Hosni said. \nThe military declined to comment on Anan’s detention. The interior ministry could not immediately be reached for comment. \nThe Military Prosecution later issued a statement banning media coverage of its investigation into Anan. \nA witness who knows Anan told Reuters the candidate was detained while driving to his office shortly before the army statement was broadcast. His car was stopped by what appeared to be armed military police on a main road in Cairo. \nAnan, who served as armed forces chief of staff from 2005-2012, was the final high profile challenger to Sisi left in the race after a number of others dropped out, some citing intimidation by the authorities. \n“He was the longest-serving chief of staff but that didn’t stop them arresting him,” Anan’s office director Mustafa al-Shal said outside the Military Prosecutor’s office. \nEgypt’s president’s office and government press center have not commented on the election race. The electoral commission has said it will ensure the vote is fair and transparent. \nSisi, who as military chief led the overthrow of Islamist President Mohamed Mursi in 2013 and was elected president the following year, announced last week he will seek a second term in the election set for late March. CANDIDATES WITHDRAW \nAhmed Shafik, a former prime minister and air force chief, abandoned a bid this month, saying that after several years living abroad he was out of touch with Egyptian politics. The announcement came amid media criticism and speculation that he was being held by authorities in a Cairo hotel. \nMohamed Anwar al-Sadat, the nephew of assassinated President Anwar al-Sadat, said last week he would not run, citing an environment of fear surrounding the vote. \nRights lawyer Khaled Ali has said he will still run, but he might be disqualified over a legal case against him. \nAnan announced his presidential bid in a video declaration posted on his official Facebook page last week, saying he was running to save Egypt from incorrect policies and calling on state institutions to maintain neutrality toward all candidates. \nEgyptian law requires former army officials to end their service and receive permission from the military before they can run for political office. The army’s statement said Anan had falsified documents that stated his military service had ended. \nSisi’s critics say his popularity has eroded over tough economic reforms tied to a $12 billion International Monetary Fund loan, which have squeezed many Egyptians, and over a crackdown on dissidents. \nHis supporters say firm measures are necessary to bring security and stability to a country that has seen unrest since a 2011 uprising toppled long-serving autocrat Hosni Mubarak. \nEgypt is fighting a stubborn Islamic State insurgency in its North Sinai region. Militants have expanded their attacks to target civilians, especially over the past year. Reporting Cairo bureau; Editing by Peter Graff and Janet Lawrence", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T19:34:00.000+02:00", "crawled": "2018-01-23T20:40:50.006+02:00", "highlightTitle": ""}