{"organizations": [], "uuid": "06c6348936f149d0f6cbbbb8e5959a344b7b3643", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223206137&w=1200&r=LYNXMPEE0I032", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-immigration-court/trump-administration-appeals-dreamer-immigrant-ruling-to-top-court-idUKKBN1F804E", "country": "US", "domain_rank": 408, "title": "Trump administration appeals 'Dreamer' immigrant ruling to top court", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T04:09:00.000+02:00", "replies_count": 0, "uuid": "06c6348936f149d0f6cbbbb8e5959a344b7b3643"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-immigration-court/trump-administration-appeals-dreamer-immigrant-ruling-to-top-court-idUKKBN1F804E", "ord_in_thread": 0, "title": "Trump administration appeals 'Dreamer' immigrant ruling to top court", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "william alsup", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "san francisco-based u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "daca", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:20 AM / Updated 2 hours ago Trump administration appeals against 'Dreamer' immigrant ruling to top court Lawrence Hurley 3 Min Read \nWASHINGTON (Reuters) - The U.S. Justice Department asked the Supreme Court on Thursday to quickly overturn a lower court ruling that blocked President Donald Trump’s move to end a programme that protects hundreds of thousands of immigrants brought to the United States illegally as children. \nSolicitor General Noel Francisco said in a court filing “time is of the essence” and asked the high court to rule on the case before its current term ends in June. \nThe Republican president in September rescinded, effective in March, the Deferred Action for Childhood Arrivals, or DACA, programme put in place in 2012 by his Democratic predecessor, Barack Obama. Trump asked the Republican-controlled Congress to come up with a legislative fix, which it has not yet done. \nA variety of Democratic state attorneys general, organisations and individuals challenged Trump’s action in multiple federal courts. \nThe administration is challenging a Jan. 9 decision by San Francisco-based U.S. District Judge William Alsup, who ruled that DACA must remain in place while the litigation is resolved. \nThe Justice Department did not file an emergency application that, if successful, would result in the judge’s ruling being put on hold within days. That means the programme will remain in effect until the Supreme Court resolves the case. \nA decision could take more than a year if the court takes up the case but declines to speed up resolution of it issuing a ruling in its current term. \nAbout 800,000 young, mostly Hispanic adults dubbed “Dreamers,” have been protected from deportation and allowed to work legally in the United States since the programme was implemented. As of September, when the most recent figures were made available, 690,000 young adults were protected under the programme. \nAlsup’s ruling came during negotiations between Trump and congressional leaders over immigration policy. Those talks fell apart after Trump rejected a bipartisan deal and provoked outrage with his reported use of vulgar language to describe African countries in a meeting with lawmakers on immigration. \nThe Justice Department’s move to go directly to the Supreme Court is unusual because the administration is essentially seeking to circumvent the 9th U.S. Circuit Court of Appeals, which previously ruled against it over Trump’s temporary travel bans on people entering the United States from seven Muslim-majority countries. Reporting by Eric Walsh and Lawrence Hurley; Additional reporting by Lawrence Hurley and Dan Levine; Editing by Sandra Maler, Peter Cooney and Paul Tait", "external_links": [], "published": "2018-01-19T04:09:00.000+02:00", "crawled": "2018-01-19T04:40:49.036+02:00", "highlightTitle": ""}