{"organizations": [], "uuid": "3c7d539ea3c2da88b81d6c412caebc1fffa3ca96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221006874&w=1200&r=LYNXMPEE0A05U", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/china-pollution/beijing-winning-pollution-battle-as-other-chinese-cities-fall-behind-idINKBN1F009A", "country": "US", "domain_rank": 408, "title": "Beijing winning pollution battle as other Chinese cities fall behind", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T05:07:00.000+02:00", "replies_count": 0, "uuid": "3c7d539ea3c2da88b81d6c412caebc1fffa3ca96"}, "author": "", "url": "https://in.reuters.com/article/china-pollution/beijing-winning-pollution-battle-as-other-chinese-cities-fall-behind-idINKBN1F009A", "ord_in_thread": 0, "title": "Beijing winning pollution battle as other Chinese cities fall behind", "locations": [], "entities": {"persons": [], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "pudong", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "greenpeace", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - As Beijing and the surrounding region reported big improvements in air quality last year, nationwide gains were much more muted as industrial activity shifted further away from the capital, a report by Greenpeace shows.\nA man wearing a face mask rides a bicycle on a bridge in front of the financial district of Pudong covered in smog during a polluted day in Shanghai, China November 22, 2017. REUTERS/Aly Song Strict restrictions on coal use and industrial activity led to a dramatic improvement in air quality in Beijing and across northern China, helped also by favourable weather conditions.\nChina as a whole, however, cut air pollution levels by just 4.5 percent last year, according to the most often-cited measure, which was the smallest decline since 2013 as industry ramped up coal, cement and steel production, Greenpeace said in a report on China air pollution published on Thursday.\nA separate Reuters analysis of official government readings of concentrations of small, breathable particles known as PM2.5 also showed a disparity between Beijing and 27 nearby cities included in a pollution action plan and those just outside the zone.\nThe findings indicate that while government policies to reduce chocking smog that plagues most Chinese cities seem to be having an effect, the improvements are uneven and China still has a long way to go in taming air pollution.\nBeijing’s pollution level dropped 53.8 percent in the fourth quarter of 2017 from a year earlier, while PM2.5 levels in Heilongjiang, Anhui and Jiangsu provinces jumped, Greenpeace said.\n“China’s national air pollution action plan has brought massive reductions in pollution levels and associated health risks, but policies favouring coal and heavy industry are holding back progress,” said Greenpeace East Asia climate and energy campaigner Huang Wei.\nChina’s economy grew faster than expected for most of last year, with many economists crediting the industrial sector and a construction boom for boosting growth. The country’s steel output is expected to have hit a record 832 million tonnes in 2017.\nAverage air pollution in Linfen, an industrial city in Shanxi province that was not part of the government action plan, rose significantly last year, according to Reuters calculations of data from the independent website www.aqistudy.cn, which tracks official air quality data.\nBy contrast Taiyuan, the capital of Shanxi about 250 kilometres (155 miles) from Linfen and part of the 28 city campaign, showed a modest improvement in air quality last year.\nGreenpeace said that PM2.5 levels fell by 40 percent year-on-year in the 28 cities during the peak period for heating from mid-October to mid-March, and by only 23 percent in the surrounding cities.\nReporting by Elias Glenn and Muyu Xu; Additional reporting by the Beijing newsroom; Editing by Susan Fenton\n ", "external_links": [], "published": "2018-01-11T05:07:00.000+02:00", "crawled": "2018-01-11T05:44:11.023+02:00", "highlightTitle": ""}