{"organizations": [], "uuid": "a5d9df7befd24dd64ac466a03320101222e655c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226378462&w=1200&r=LYNXMPEE0S142", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/us-britain-eu-ministers/eu-warns-britain-their-divorce-is-not-yet-resolved-idUSKBN1FI1VD", "country": "US", "domain_rank": 408, "title": "EU offers Brexit transition, but UK must 'accept rules'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T23:03:00.000+02:00", "replies_count": 0, "uuid": "a5d9df7befd24dd64ac466a03320101222e655c3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-eu-ministers/eu-warns-britain-their-divorce-is-not-yet-resolved-idUSKBN1FI1VD", "ord_in_thread": 0, "title": "EU offers Brexit transition, but UK must 'accept rules'", "locations": [], "entities": {"persons": [{"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - The European Union offered on Monday to let Britain keep its membership benefits for 21 months after Brexit to help businesses adapt but it rejected the idea that London could block new EU laws during the transition.\nMinisters from the 27 other states took just two minutes in Brussels to endorse new instructions to their negotiator Michel Barnier, who will launch talks soon with the aim of sealing a transition package within a couple of months.\nThe rapid sign-off was a fresh demonstration of the unity they showed in pushing embattled British Prime Minister Theresa May into agreeing outline divorce terms a month ago and a signal of how far they believe they hold the whip hand.\nMay’s spokesman welcomed the EU agreement, saying it was in line with Britain’s aims, though several differences remained.\nOne difference aired in recent days as May tries to hold rival wings of her party together has been a suggestion by Brexit Secretary David Davis that Britain should have a way to “resolve concerns” it had on new EU laws passed once it has no vote.\nPressed on how that might work, Barnier said the offer was principally in Britain’s interests and not open to significant negotiation:\n“The United Kingdom must acknowledge these rules of the game and accept them from the outset,” he told reporters.\n“Otherwise ... there would be a kind of a la carte single market. That is not possible.”\nItaly’s EU affairs minister Sandro Gozi, often sympathetic to Britain, was blunter: “If you leave, you leave.”\nEuropean Union's chief Brexit negotiator Michel Barnier attends a meeting of European Union Home/European affairs ministers in Brussels, Belgium January 29, 2018. REUTERS/Francois Lenoir EU diplomats also dismissed the idea of Britain having a veto over EU laws after it leaves on March 29 next year, although the transition offer does give London a chance to air its views in EU meetings where its interests are at stake -- and notably on issues of immediate economic impact, such as EU fishing quotas.\nThe pace of EU legislation is slow enough that little which might be decided in the 21 months could be forced on Britain before it had fully left the system on Dec. 31, 2020.\nCALL TO MAY By that time, both sides hope to be able to enact a free trade accord to keep goods and services flowing, albeit leaving Britain outside the EU single market and customs union.\nBarnier said this timetable was still subject to May and her ministers agreeing a plan among themselves and presenting it to Brussels -- and also depends on finalizing many issues on the divorce treaty.\nWhile Britain agreed to pay tens of billions of euros into EU coffers on leaving and to give lifetime rights to Europeans living there, many issues have yet to be settled, including the power of the EU courts over the treaty and how the EU-UK border across the island of Ireland will be kept “invisible”.\nBarnier said: “I want to remind you, without agreement on all the withdrawal issues, there is no transition.”\nHe also made clear that talks on the future relationship might start after an EU summit in late March -- but only if May spells out what she wants in time for Brussels to put together its own responses. An outline trade package could then be agreed by the time the divorce and transition deal is ready in October.\nShowing some willingness to be flexible, the EU ministers are open to extending the transition period if need be to reach a trade pact -- though Barnier warned it could not be very long -- and also voiced a will to endorse Britain concluding trade agreements with other countries before the transition ends.\nAdditional reporting by Robert-Jan Bartunek, Samantha Koester, Philip Blenkinsop and Alastair Macdonald; Editing by Mark Heinrich and Robin Pomeroy\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T23:03:00.000+02:00", "crawled": "2018-01-30T03:15:26.012+02:00", "highlightTitle": ""}