{"organizations": [], "uuid": "3ea618f5d78676b0ef389107c58a608f4ffc478d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-davos-meeting-trade/davos-paper-attacks-trumps-views-on-trade-idUSKBN1F61JW", "country": "US", "domain_rank": 408, "title": "Davos paper attacks Trump's views on trade", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T15:01:00.000+02:00", "replies_count": 0, "uuid": "3ea618f5d78676b0ef389107c58a608f4ffc478d"}, "author": "", "url": "https://www.reuters.com/article/us-davos-meeting-trade/davos-paper-attacks-trumps-views-on-trade-idUSKBN1F61JW", "ord_in_thread": 0, "title": "Davos paper attacks Trump's views on trade", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "tom mi", "sentiment": "negative"}, {"name": "robert lawrence", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "yeling tan", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "harvard", "sentiment": "none"}, {"name": "princeton", "sentiment": "none"}, {"name": "min read  geneva", "sentiment": "none"}, {"name": "wef", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GENEVA (Reuters) - U.S. Donald Trump’s view of world trade will be challenged next week when he visits the World Economic Forum (WEF) at Davos, judging by a paper seen by Reuters on Wednesday that is aimed squarely at his “America First” stance.\nThe “Strategic Brief on Misconceptions around Trade Balances” issued by the WEF’s network of trade experts did not mention Trump by name. But it took issue with his administration’s understanding of international commerce.\n“A widely held view is that a country’s trade balance is a key measure of its international commercial success,” said co-authors Harvard professor Robert Lawrence and Princeton fellow Yeling Tan in the paper, which is due to be presented and debated at Davos.\n“Currently, invoking this reasoning, the administration is seeking to reduce the trade deficit by renegotiating U.S. trade agreements and adopting more protectionist U.S. policies.”\nTrump has railed against the U.S. trade deficit with China, hobbled the World Trade Organization by blocking judicial appointments, pulled out of the Trans-Pacific Partnership trade talks and antagonized Canada and Mexico by demanding a revamp of the North American Free Trade Agreement.\nThe Davos paper said Trump’s administration believed “unfair” trade had led to large trade deficits and job losses, but policies based on such thinking could end up harming the people they aimed to help.\nThe authors said similar narratives had also emerged in other countries and regions but did not name them.\nThey set out seven examples of sloppy thinking on trade, illustrated by graphs showing that the relationship between imports and U.S. domestic employment had been “overwhelmingly positive” and that larger U.S. trade deficits had been associated with faster jobs growth.\nThe first example was that “trade deficits are bad, trade surpluses are good”. Both deficits and surpluses may be bad or good, and the trade balance was a function of national saving and investment, not trade policies.\nOther examples were “imports are the cause of the decline in manufacturing jobs” and “trade agreements will increase the deficit”.\nTrump’s Jan. 26 speech at Davos comes as his administration prepares for a penultimate round of NAFTA talks and as he considers imposing broad restrictions on steel and aluminum imports, a policy which is aimed at China but risks rebounding on the European Union.\nIt was wrong to think that imposing a tax on imports would create manufacturing jobs, the Davos paper said.\n“New barriers to trade could disrupt production and reduce rather than increase domestic employment in both the protected industries and those that use their outputs.”\nReporting by Tom Miles, editing by Larry King\n ", "external_links": [], "published": "2018-01-17T15:01:00.000+02:00", "crawled": "2018-01-17T15:15:51.017+02:00", "highlightTitle": ""}