{"organizations": [], "uuid": "6b06ac618d0b3b678e405fd8b9ec476d7d14ed2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/globe-newswire-leading-brands-inc-amends-definitive-arrangement-agreement-with-liquid-media-group-inc-and-announces-q3-results.html", "country": "US", "domain_rank": 767, "title": "LEADING BRANDS, INC.: Amends Definitive Arrangement Agreement with Liquid Media Group, Inc., and Announces Q3 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:30:00.000+02:00", "replies_count": 0, "uuid": "6b06ac618d0b3b678e405fd8b9ec476d7d14ed2e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/globe-newswire-leading-brands-inc-amends-definitive-arrangement-agreement-with-liquid-media-group-inc-and-announces-q3-results.html", "ord_in_thread": 0, "title": "LEADING BRANDS, INC.: Amends Definitive Arrangement Agreement with Liquid Media Group, Inc., and Announces Q3 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}], "organizations": [{"name": "majesco entertainment company", "sentiment": "negative"}, {"name": "liquid media group, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "lbix", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LIQUID MEDIA GROUP, INC.: Acquires 51% of Majesco Entertainment Company, and Announces $4,000,000 US Preferred Share Subscription\nVANCOUVER, British Columbia, Jan. 15, 2018 (GLOBE NEWSWIRE) -- Leading Brands, Inc. (NASDAQ:LBIX), announces that it has amended its Definitive Arrangement Agreement with Liquid Media Group, Inc. and the results for its third quarter of fiscal 2017, which ended November 30, 2017. Unless otherwise stated, all financial amounts are denominated in Canadian dollars, with all financial figures rounded to the nearest $000.\nOn September 18, 2017 the Company announced that it had entered into a Definitive Arrangement Agreement with Liquid of Vancouver, Canada whereby LBIX would acquire 100% of Liquid pursuant to a plan of arrangement. Existing LBIX shareholders were anticipated to hold 22.637% and Liquid Shareholders were anticipated to hold 77.363% of the post-transaction entity. For those purposes, existing LBIX shares were valued at $1.50 US. As matters progressed and the transaction evolved, it became apparent that LBIX would have more cash available and that an adjustment of the exchange ratio to account for various transactions was appropriate. Consequently existing LBIX shares will now be valued at $1.78 US and the percentages of the combined entity held by each group of shareholders will be adjusted accordingly.\nWith the concurrent completion of the Liquid developments described below, it is anticipated that this transaction will now be completed by April 30, 2018.\nNon-GAAP Net Income (Loss) before S tock Based Compensation (“SBC”) is determined as follows:\nQ 3 2017 Q 3 201 6 YTD 2017 YTD 201 6 Net Income (Loss) from continuing operations $ (352,000 ) $ (144,000 ) $ (553,000 ) $ (530,000 ) Add Back SBC - - - - Net income (loss) before SBC $ (352,000 ) $ (144,000 ) $ (553,000 ) $ (530,000 ) Non-GAAP Net Income (Loss) per share before Stock Based Compensation (“ SBC ”) is determined as follows:\nQ 3 2017 Q 3 201 6 YTD 2017 YTD 201 6 Net Income (Loss) from continuing operations $ (0.13 ) $ (0.05 ) $ (0.20 ) $ (0.19 ) Add Back SBC - - - - Net income (loss) before SBC $ (0.13 ) $ (0.05 ) $ (0.20 ) $ (0.19 ) Pro-forma results for EBITDAS, as defined below, are determined as follows:\nQ 3 2017 Q 3 201 6 YTD 2017 YTD 201 6 Net Income (Loss) from continuing operations $ (352,000 ) $ (144,000 ) $ (553,000 ) $ (530,000 ) Add Back: Interest, net (1,000 ) - (17,000 ) - Depreciation and amortization - - 1,000 1,000 Non-cash stock based compensation - - - - Non-cash income tax expense - - - - Total Add Backs (1,000 ) - (16,000 ) 1,000 EBITDAS $ (353,000 ) $ (144,000 ) $ (569,000 ) $ (529,000 ) EBITDAS per share reconciles to earnings per share as follows:\nQ 3 2017 Q 3 201 6 YTD 2017 YTD 201 6 Net Income (Loss) from continuing operations $ (0.13 ) $ (0.05 ) $ (0.20 ) $ (0.19 ) Add Back: Interest, net - - (0.01 ) - Depreciation and amortization - - - - Non-cash stock based compensation - - - - Non-cash income tax expense - - - - Total Add Backs - - (0.01 ) - EBITDAS $ (0.13 ) $ (0.05 ) $ (0.21 ) $ (0.19 ) As at November 30, 2017 the Company had 2,802,412 outstanding common shares.\nLIQUID:\nToday, Liquid issued a News Release that, as it relates to LBIX and the transactions between the parties, the pertinent excerpt is as follows:\n“LIQUID MEDIA GROUP ACQUIRES PROVEN GAMING PUBLISHER\nMAJESCO ENTERTAINMENT, ANNOUNCES $4M PREFERRED SHARE FINANCING AND\nAMENDS ARRANGEMENT AGREEMENT\n“VANCOUVER, BC – January 15, 2017 – Liquid Media Group Ltd. (“LMG” or the “Company”) is pleased to announce that that it has acquired 51 percent of Majesco Entertainment Company, a proven gaming publisher that has had such hits as Zumba and A Boy and His Blob.\n“The Board of Directors of LMG is excited to add the Majesco assets to its portfolio of synergistic operations. Majesco is led by its current CEO Jesse Sutton who will now serve as LMG’s Gaming Advisor. LMG will use its production service capabilities to re-release Majesco’s library of gaming assets for all platforms including consoles, PC and mobile and extend Majesco’s assets into film and television verticals. The acquisition of Majesco fulfills LMG’s obligation to acquire a studio under the arrangement agreement with Leading Brands, Inc. (the “Arrangement Agreement”), announced on September 19, 2017.\n“LMG is also pleased to announce that it intends to complete a non-brokered private placement of newly created Class B Series I preferred shares (the “Preferred Shares”) for gross proceeds of up to U.S.$4,000,000. LMG has received and accepted a subscription agreement for the entire offering…”\nThe full text of the Liquid News Release may be found at www.LiquidMediaGroup.co\nLeading Brands, Inc.\nPer:\nRalph McRae\nRalph D. McRae\nChairman & CEO\nNon-GAAP Measures\nAny non-GAAP financial measures referenced in this release do not have any standardized meaning prescribed by GAAP and are therefore unlikely to be comparable to similar measures presented by other issuers.\nEBITDAS is a non-GAAP financial measure. EBITDAS is defined as net income (loss) before income taxes, interest expense, depreciation and amortization and stock-based compensation. EBITDAS should not be construed as a substitute for net income (as determined in accordance with GAAP) for the purpose of analyzing operating performance, as EBITDAS is not defined by GAAP. However, the Company regards EBITDAS as a complement to net income and income before taxes.\nForward Looking Statements\nCertain information contained in this press release includes forward-looking statements. Words such as “believe”, “expect,” “will,” or comparable terms, are intended to identify forward-looking statements concerning the Company’s expectations, beliefs, intentions, plans, objectives, future events or performance and other developments. All forward-looking statements included in this press release are based on information available to the Company on the date hereof. Such statements speak only as of the date hereof. Important factors that could cause actual results to differ materially from the Company’s estimations and projections are disclosed in the Company’s securities filings and include, but are not limited to, the following: general economic conditions, weather conditions, changing beverage consumption trends, pricing, availability of raw materials, economic uncertainties (including currency exchange rates), government regulation, managing and maintaining growth, the effect of adverse publicity, litigation, competition and other risk factors described from time to time in securities reports filed by Leading Brands, Inc. For all such forward-looking statements, we claim the safe harbor for forward looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n©2018 Leading Brands, Inc.\n(table follows)\nLEADING BRANDS, INC. CONDENSED CONSOLIDATED INTERIM STATEMENT OF INCOME (LOSS) (UNAUDITED) (EXPRESSED IN CANADIAN DOLLARS) Three months ended Nine months ended November 30 , 201 7 November 30 2016 November 30 , 201 7 November 30, 2016 Gross Revenue $ - $ - $ - $ - Less: Discount, rebates and slott", "external_links": ["https://www.globenewswire.com/Tracker?data=qNB0QjuGPppAUTU2I0HMDzC3Mj3yqrKwI4i8zsUyXXNiVuHnpeKb3AMh4tVHgqtTRvzHcU7NYqExRu7GhCZMwg==", "https://www.globenewswire.com/Tracker?data=1Vas8eq7EMY6RJQoOjA46y-TBWeD3f0FmqbEas1G4h_XSx1C8MZ76o4KQ5kM28-UNRkqG_vPDNXFxb1b-Rz_tINoHadv84g4D4l5kTK8s5I=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/c3ba5f86-a656-413e-9c6b-ffce85055b91"], "published": "2018-01-15T16:30:00.000+02:00", "crawled": "2018-01-15T19:02:53.009+02:00", "highlightTitle": ""}