{"organizations": [], "uuid": "9d56c26888a325e355f562c1a62a57d81cb5c791", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-cox-enterprises-promotes-andre-reese-to-vice-president-of-information-systems-operations.html", "country": "US", "domain_rank": 767, "title": "Cox Enterprises Promotes Andre Reese to Vice President of Information Systems Operations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-29T19:00:00.000+02:00", "replies_count": 0, "uuid": "9d56c26888a325e355f562c1a62a57d81cb5c791"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-cox-enterprises-promotes-andre-reese-to-vice-president-of-information-systems-operations.html", "ord_in_thread": 0, "title": "Cox Enterprises Promotes Andre Reese to Vice President of Information Systems Operations", "locations": [], "entities": {"persons": [{"name": "andre reese", "sentiment": "negative"}, {"name": "reese", "sentiment": "none"}, {"name": "greg morrison", "sentiment": "none"}, {"name": "andre", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}], "organizations": [{"name": "cox enterprises", "sentiment": "negative"}, {"name": "corporate information services", "sentiment": "none"}, {"name": "production operations", "sentiment": "none"}, {"name": "customer support center", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}, {"name": "information systems operations", "sentiment": "none"}, {"name": "network operations center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 29, 2018 /PRNewswire/ -- Cox Enterprises today announced the promotion of Andre Reese to Vice President of Information Systems Operations.\nReese is responsible for ensuring the integrity, quality of service and cost effectiveness of the production systems that support the company's operations and adapt to meet new and evolving business requirements.\nReese oversees a variety of organizational functions, including Production Operations, Application and Database Support, IT Service Management, Desktop and Telephone Support, the Network Operations Center as well as the Customer Support Center.\n\"Information systems and technology is a world that is constantly evolving and requires the forward-thinking abilities of experts like Andre Reese,\" said Greg Morrison, Senior Vice President of Corporate Information Services. \"Andre is an outstanding leader, and I look forward to seeing how he will continue to influence the innovation and growth of Cox Enterprises' information system's department.\"\nPrior to joining Cox in 2004, Reese held a variety of IT system and agency support roles at Prudential, leading large systems development and modernization efforts, as well as technology deployments to sales agents nationwide.\n\"I am extremely fortunate to work for a company that makes delivering high-quality information technology services a priority,\" said Reese. \"I look forward to continuing to work with partners from across the company's divisions to provide enterprise-shared services such as Oracle Financials and PeopleSoft.\"\nReese earned a bachelor's degree in Business Administration and Computer Science from the University of Florida. He is a member of the IT Senior Management Forum, the Society for Information Management and previously served on the board of the Auditory Verbal Center.\nAbout Cox Enterprises:\nCox Enterprises is a leading communications, media and automotive services company. With revenues exceeding $21 billion and approximately 60,000 employees, the company's major operating subsidiaries include Cox Communications (cable television distribution, high-speed internet access, telephone, home security and automation, commercial telecommunications and advertising solutions); Cox Automotive (automotive-related auctions, financial services, media and software solutions); and Cox Media Group (television and radio stations, digital media, newspapers and advertising sales rep firms).\nThe company's major national brands include Autotrader, Kelley Blue Book and Manheim. Through Cox Automotive, the company's international operations stretch across Asia, Australia, Europe and Latin America. To learn more about Cox's commitment to people, sustainability and our communities, please visit www.CoxCSRReport.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/cox-enterprises-promotes-andre-reese-to-vice-president-of-information-systems-operations-300588801.html\nSOURCE Cox Enterprises", "external_links": ["http://www.prnewswire.com/news-releases/cox-enterprises-promotes-andre-reese-to-vice-president-of-information-systems-operations-300588801.html", "http://www.coxcsrreport.com/"], "published": "2018-01-29T19:00:00.000+02:00", "crawled": "2018-01-29T20:51:47.024+02:00", "highlightTitle": ""}