{"organizations": [], "uuid": "0745555d336fd389ec6a97e5694be006b94a3894", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-camden-national-corporation-reports-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Camden National Corporation Reports 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:30:00.000+02:00", "replies_count": 0, "uuid": "0745555d336fd389ec6a97e5694be006b94a3894"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-camden-national-corporation-reports-2017-financial-results.html", "ord_in_thread": 0, "title": "Camden National Corporation Reports 2017 Financial Results", "locations": [], "entities": {"persons": [{"name": "gregory a. dufour", "sentiment": "none"}], "locations": [{"name": "maine", "sentiment": "none"}, {"name": "camden", "sentiment": "none"}], "organizations": [{"name": "camden national corporation", "sentiment": "negative"}, {"name": "camden national corporation reports 2017 financial results camden", "sentiment": "negative"}, {"name": "the company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMDEN, Maine, Jan. 30, 2018 /PRNewswire/ -- Camden National Corporation (NASDAQ: CAC; \"Camden National\" or the \"Company\"), a $4.1 billion bank holding company headquartered in Camden, Maine, reported net income for 2017 of $28.5 million and diluted earnings per share (\"EPS\") of $1.82 per share, compared to $40.1 million and $2.57 per share, respectively, a year ago. In the fourth quarter of 2017, the Tax Cuts and Jobs Act of 2017 (the \"Tax Act\") was passed, and the Company recognized $14.3 million of additional income tax expense upon the revaluation of its deferred tax assets and liabilities. The Company's 2017 adjusted operating income 1 , which excludes the effect of the Tax Act, was $42.7 million, representing an increase of 7% over last year.\n\"The Company produced another year of strong financial results in 2017 led by loan growth of 7%, deposit growth of 6%, and improved asset quality over last year,\" said Gregory A. Dufour, President and Chief Executive Officer of the Company. \"Like many other financial institutions and companies, we revalued our deferred tax balances using the lower federal corporate tax rate in the fourth quarter of 2017 that resulted in a one-time income tax charge. While the lower federal corporate tax rate drove a reported net loss for the fourth quarter and lowered our reported earnings for 2017, we expect that it will prove beneficial over the long-run through higher earnings and continued investment in our company to create long-term shareholder value.\"\nThe Company reported a net loss of $3.2 million for the fourth quarter of 2017. Adjusted operating income 1 , excluding the effect of the Tax Act, was $11.1 million, compared to $11.3 million for the third quarter of 2017.\n\"The anticipated future tax savings provided us an opportunity to recognize the dedication and contribution of our employees as we provided a special bonus to all non-executive employees. Additionally, we announced an increase in funds for future compensation practices and education to help ensure we attract and retain the best talent possible,\" shared Dufour. \"Complementing our employee investments, we announced that we will also increase our philanthropic efforts in 2018, reflecting our continued commitment to our communities.\"\nMr. Dufour added, \"In December, the Company announced a 9% increase in the fourth quarter 2017 dividend to $0.25 per share. At December 31, 2017, the Company exceeded all regulatory capital standards and reported a tangible common equity ratio 1 of 7.66%.\"\n1\nThis is a non-GAAP measure. Please refer to \"Reconciliation of non-GAAP to GAAP Financial Measures\" for further details.\nYEAR-TO-DATE 2017 FINANCIAL HIGHLIGHTS\nAdjusted operating income 1 was $42.7 million, representing a $2.7 million, or 7%, increase over last year Adjusted operating return on average assets 1 was 1.07% and adjusted operating return on average equity 1 was 10.51% Efficiency ratio 1 was 57.05% Total loans grew 7% in 2017 and deposits grew 6% over the same period Increased the fourth quarter 2017 dividend $0.02 per share, or 9%, to $0.25 per share\nFINANCIAL CONDITION\nTotal assets at December 31, 2017 grew 5% over last year to $4.1 billion. The loan portfolio reached $2.8 billion at December 31, 2017, representing loan growth of $187.9 million, or 7%, in 2017. Commercial real estate loans led the way with growth of $113.2 million, or 11%, followed by residential mortgage loan growth of 7% and commercial loan growth of 6% in 2017. Over the same period, we experienced a 2% decline in consumer and home equity balances.\nTotal deposits at December 31, 2017 grew 6% over last year to $3.0 billion. Checking account growth led the way with an increase in demand and interest checking balances of 18% and 22%, respectively. Total borrowings for the Company increased 2% in 2017 to $552.6 million at December 31, 2017.\nThe Company's loan-to-deposit ratio at December 31, 2017 was 93%, compared to 92% at December 31, 2016.\nTotal shareholders' equity at December 31, 2017 increased 3% to $403.4 million since December 31, 2016. The Company's capital position remains in excess of regulatory requirements for \"well capitalized\" status with a total risk-based capital ratio of 14.14%.\nASSET QUALITY\nThe Company continues to have strong asset quality metrics with lower non-performing asset levels and lower net charge-offs. Non-performing loans at December 31, 2017 were $20.3 million, compared to $25.1 million at December 31, 2016. The Company's non-performing loans to total loans ratio at December 31, 2017 was 0.73%, compared to 0.97% at December 31, 2016.\nThe provision for credit losses for 2017 totaled $3.0 million, compared to $5.3 million last year. The decrease in expense of $2.2 million was driven by a decline in net charge-offs of $1.3 million and overall improved asset quality. The Company's annualized charge-offs to average loans ratio for 2017 was 0.07%, compared to 0.13% last year.\nFINANCIAL OPERATING RESULTS (linked quarter)\nThe Company reported a net loss of $3.2 million for the fourth quarter of 2017 driven by additional income tax expense of $14.3 million as it revalued its deferred tax assets and liabilities for the lower federal corporate tax rate that was enacted in late December. Adjusted operating income 1 for the fourth quarter decreased $249,000 to $11.1 million, compared to last quarter. The decrease in adjusted operating income 1 between quarters was driven by:\nAn increase in non-interest expense of $1.3 million due to: A discretionary cash bonus and related taxes totaling $709,000 awarded to all non-executive employees of the Company. An increase in furniture, equipment and data processing costs of $261,000 due to new technology investments in the fourth quarter of 2017, including a commercial loan platform and a deposit account platform. A decrease in non-interest income of $459,000 as the Company recognized $827,000 of gains on sale of investment securities last quarter, compared to $28,000 in the fourth quarter, partially offset by an increase in fees generated from the back-to-back commercial loan swap program of $637,000. An increase in net interest income of $499,000 due to: An increase in our loan yield of 3 basis points to 4.26% as a portion of our loan portfolio repriced due to increases in short-term interest rates; and A change in our funding mix in the fourth quarter with strong core deposit growth driving a 2 basis point decrease in our cost of funds to 0.60%. A decrease in the provision for credit losses of $579,000 driven by a decrease in net charge-offs of $301,000.\n1\nThis is a non-GAAP measure. Please refer to \"Reconciliation of non-GAAP to GAAP Financial Measures\" for further details.\nFOURTH QUARTER 2017 DIVIDEND\nThe Company increased its fourth quarter 2017 dividend by $0.02 per share, or 9%, to $0.25 per share, payable on January 31, 2018, to shareholders of record as of January 15, 2018. This distribution represents an annualized dividend yield of 2.37%, based on the December 29, 2017 (last business day) closing price of Camden National's common stock at $42.13 per share as reported by NASDAQ.\nANNUAL MEETING\nCamden National has scheduled its annual meeting of shareholders for Tuesday, April 24, 2018, at 3:00 p.m. local time, at Point Lookout Resort and Conference Center, 67 Atlantic Highway, Northport, Maine 04849. The date for determining the Company's shareholders of record for the annual meeting is February 23, 2018.\nCONFERENCE CALL\nCamden National will host a conference call and webcast at 3:30 p.m. eastern time on January 30, 2018 to discuss our fourth quarter and year-to-date 2017 financial results and outlook. Participants should dial in to the call 10 - 15 minutes before it begins. Information about the conference call is as follows:\nLive dial-in (domestic):\n(888) 349-0139\nLive dial-in (international):\n(412) 542-4154\nLive webcast:\nhttp://services.choruscall.com/links/cac180130.html\nA link to the live webcast will be will be available on Camden National's website under \"Investors\" at CamdenNational.com prior to the meeting. The transcript of the conference call will also be available on Camden National's website approximately two business days after the conference call.\nABOUT CAMDEN NATIONAL CORPORATION\nCamden National Corporation (NASDAQ:CAC), founded in 1875 and headquartered in Camden, Maine, is the largest publicly traded bank holding company in Northern New England with $4.1 billion in assets and nearly 650 employees. Camden National Bank, its subsidiary, is a full-service community bank that offers an array of consumer and business financial products and services, accompanied by the latest in digital banking technology to empower customers to bank the way they want. The Bank provides personalized service through a network of 60 banking centers, 76 ATMs, and lending offices in New Hampshire and Massachusetts, all complemented by 24/7 live phone support. This year marks the 8th time Camden National Bank has received the \"Lender at Work for Maine\" Award from the Finance Authority of Maine. Comprehensive wealth management, investment, and financial planning services are delivered by Camden National Wealth Management. To learn more, visit CamdenNational.com . Member FDIC.\nFORWARD-LOOKING STATEMENTS\nCertain statements contained in this press release that are not statements of historical fact constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including certain plans, expectations, goals, projections and other statements, which are subject to numerous risks, assumptions and uncertainties. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. They often include words like \"believe,\" \"expect,\" \"anticipate,\" \"estimate,\" and \"intend\" or future or conditional verbs such as \"will,\" \"would,\" \"should,\" \"could\" or \"may.\" Certain factors that could cause actual results to differ materially from expected results include changes in general economic conditions, changes in the interest rate environment, increased competitive pressures, operational risks including, but not limited to, cybersecurity, fraud and natural disasters, legislative and regulatory changes that adversely affect the business in which the Company is engaged, changes in the securities markets, and other risks and uncertainties disclosed from time to time in in the Company's Annual Report on Form 10-K for the year ended December 31, 2016, as updated by other filings with the Securities and Exchange Commission (\"SEC\"). The Company does not have any obligation to update forward-looking statements.\nUSE OF NON-GAAP MEASURES\nIn addition to evaluating the Company's results of operations in accordance with generally accepted accounting principles in the United States (\"GAAP\"), management supplements this evaluation with certain non-GAAP financial measures, such as the efficiency ratio; tangible common equity ratio; adjusted operating income; adjusted operating diluted EPS; adjusted operating return on average assets; adjusted operating return on average equity; adjusted operating return on average tangible equity; and tangible book value per share. Management believes these non-GAAP financial measures help investors in understanding the Company's operating performance and trends and allow for better performance comparisons to other banks. In addition, these non-GAAP financial measures remove the impact of unusual items that may obscure trends in the Company's underlying performance. These disclosures should not be viewed as a substitute for GAAP operating results, nor are they necessarily comparable to non-GAAP performance measures that may be presented by other financial institutions. Reconciliation to the comparable GAAP financial measure can be found in this document.\nANNUALIZED DATA\nCertain returns, yields, and performance ratios are presented on an \"annualized\" basis. This is done for analytical and decision-making purposes to better discern underlying performance trends when compared to full year or year-over-year amounts.\nSelected Financial Data\n(unaudited)\nAt or For The\nThree Months Ended\nAt or For The\nYear Ended\n(In thousands, except number of shares and per share data)\nDecember 31,\n2017\nSeptember 30,\n2017\nDecember 31,\n2016\nDecember 31,\n2017\nDecember 31,\n2016\nFinancial Condition Data\nInvestments\n$\n907,642\n$\n916,018\n$\n897,679\n$\n907,642\n$\n897,679\nLoans and loans held for sale\n2,790,542\n2,761,287\n2,609,400\n2,790,542\n2,609,400\nAllowance for loan losses\n24,171\n24,413\n23.116\n24,171\n23,116\nTotal assets\n4,065,398\n4,039,943\n3,864,230\n4,065,398\n3,864,230\nDeposits\n3,000,491\n2,956,413\n2,828,529\n3,000,491\n2,828,529\nBorrowings\n611,498\n608,607\n599,675\n611,498\n599,675\nShareholders' equity\n403,413\n414,366\n391,547\n403,413\n391,547\nOperating Data\nNet interest income\n$\n29,659\n$\n29,160\n$\n28,244\n$\n115,300\n$\n113,072\nProvision for credit losses\n238\n817\n255\n3,035\n5,258\nNon-interest income\n9,840\n10,299\n10,151\n38,599\n39,621\nNon-interest expense\n23,099\n21,825\n22,508\n88,510\n89,896\nIncome before income tax expense\n16,162\n16,817\n15,632\n62,354\n57,539\nIncome tax expense\n19,335\n5,478\n4,730\n33,878\n17,472\nNet income (loss)\n$\n(3,173)\n$\n11,339\n$\n10,902\n$\n28,476\n$\n40,067\nKey Ratios\nReturn on average assets\n(0.31)\n%\n1.12\n%\n1.12\n%\n0.71\n%\n1.04\n%\nReturn on average equity\n(3.02)\n%\n10.93\n%\n11.01\n%\n7.00\n%\n10.47\n%\nNet interest margin\n3.24\n%\n3.19\n%\n3.26\n%\n3.23\n%\n3.32\n%\nNon-performing loans to total loans\n0.73\n%\n0.72\n%\n0.97\n%\n0.73\n%\n0.97\n%\nNon-performing assets to total assets\n0.50\n%\n0.50\n%\n0.67\n%\n0.50\n%\n0.67\n%\nAnnualized charge-offs to average loans\n0.07\n%\n0.11\n%\n0.07\n%\n0.07\n%\n0.13\n%\nTier I leverage capital ratio\n9.07\n%\n9.01\n%\n8.83\n%\n9.07\n%\n8.83\n%\nTotal risk-based capital ratio\n14.14\n%\n14.09\n%\n14.04\n%\n14.14\n%\n14.04\n%\nPer Share Data\nBasic earnings per share\n$\n(0.20)\n$\n0.72\n$\n0.70\n$\n1.83\n$\n2.59\nDiluted earnings per share\n$\n(0.20)\n$\n0.72\n$\n0.70\n$\n1.82\n$\n2.57\nCash dividends declared per share\n$\n0.25\n$\n0.23\n$\n0.23\n$\n0.94\n$\n0.83\nBook value per share\n$\n25.99\n$\n26.71\n$\n25.30\n$\n25.99\n$\n25.30\nWeighted average number of common shares outstanding\n15,521,447\n15,515,189\n15,457,498\n15,509,665\n15,422,160\nDiluted weighted average number of common shares\noutstanding\n15,521,447\n15,589,008\n15,569,346\n15,588,347\n15,504,239\nNon-GAAP Measures (1)\nAdjusted operating income\n$\n11,090\n$\n11,339\n$\n10,902\n$\n42,739\n$\n40,067\nAdjusted operating return on average assets\n1.09\n%\n1.12\n%\n1.12\n%\n1.07\n%\n1.04\n%\nAdjusted operating return on average equity\n10.56\n%\n10.93\n%\n11.01\n%\n10.51\n%\n10.47\n%\nAdjusted operating return on average tangible equity\n14.20\n%\n14.85\n%\n15.26\n%\n14.35\n%\n14.76\n%\nTangible common equity ratio\n7.66\n%\n7.98\n%\n7.71\n%\n7.66\n%\n7.71\n%\nTangible book value per share\n$\n19.57\n$\n20.26\n$\n18.74\n$\n19.57\n$\n18.74\nAdjusted operating diluted earnings per share\n$\n0.71\n$\n0.72\n$\n0.70\n$\n2.73\n$\n2.57\nEfficiency ratio\n57.75\n%\n55.72\n%\n57.89\n%\n57.05\n%\n57.53\n%\n(1) Please see \"Reconciliation of non-GAAP to GAAP Financial Measures.\"\nConsolidated Statements of Condition Data\n(unaudited)\n(In thousands, except number of shares)\nDecember 31,\n2017\nDecember 31,\n2016\nASSETS\nCash and due from banks\n$\n102,971\n$\n87,707\nInvestments:\nAvailable-for-sale securities, at fair value\n789,899\n779,867\nHeld-to-maturity securities, at amortized cost\n94,073\n94,609\nFederal Home Loan Bank and Federal Reserve Bank stock, at cost\n23,670\n23,203\nTotal investments\n907,642\n897,679\nLoans held for sale, at fair value\n8,103\n14,836\nLoans:\nResidential real estate\n858,369\n802,494\nCommercial real estate\n1,164,023\n1,050,780\nCommercial (1)\n418,520\n394,051\nConsumer and home equity\n341,527\n347,239\nTotal loans\n2,782,439\n2,594,564\nLess: allowance for loan losses\n(24,171)\n(23,116)\nNet loans\n2,758,268\n2,571,448\nGoodwill\n94,697\n94,697\nOther intangible assets\n4,955\n6,764\nBank-owned life insurance\n87,489\n78,119\nPremises and equipment, net\n41,891\n42,873\nDeferred tax assets\n22,776\n39,263\nOther assets\n36,606\n30,844\nTotal assets\n$\n4,065,398\n$\n3,864,230\nLIABILITIES AND SHAREHOLDERS' EQUITY\nLiabilities\nDeposits:\nDemand\n$\n478,643\n$\n406,934\nInterest checking\n855,570\n701,494\nSavings and money market\n985,508\n979,263\nCertificates of deposit\n475,010\n468,203\nBrokered deposits\n205,760\n272,635\nTotal deposits\n3,000,491\n2,828,529\nShort-term borrowings\n541,867\n530,129\nLong-term borrowings\n10,720\n10,791\nSubordinated debentures\n58,911\n58,755\nAccrued interest and other liabilities\n49,996\n44,479\nTotal liabilities\n3,661,985\n3,472,683\nShareholders' equity\n403,413\n391,547\nTotal liabilities and shareholders' equity\n$\n4,065,398\n$\n3,864,230\n(1) Includes the Healthcare Professional Funding Corporation (\"HPFC\") loan portfolio.\nConsolidated Statements of Income Data\n(unaudited)\nFor The\nThree Months Ended\n(In thousands, except per share data)\nDecember 31,\n2017\nSeptember 30,\n2017\nDecember 31,\n2016\nInterest Income\nInterest and fees on loans\n$\n29,728\n$\n29,350\n$\n27,107\nInterest on U.S. government and sponsored enterprise obligations\n4,091\n4,177\n4,027\nInterest on state and political subdivision obligations\n685\n686\n709\nInterest on federal funds sold and other investments\n536\n497\n433\nTotal interest income\n35,040\n34,710\n32,276\nInterest Expense\nInterest on deposits\n3,243\n3,027\n2,278\nInterest on borrowings\n1,283\n1,665\n896\nInterest on subordinated debentures\n855\n858\n858\nTotal interest expense\n5,381\n5,550\n4,032\nNet interest income\n29,659\n29,160\n28,244\nProvision for credit losses\n238\n817\n255\nNet interest income after provision for credit losses\n29,421\n28,343\n27,989\nNon-Interest Income\nDebit card income\n2,192\n2,061\n1,928\nService charges on deposit accounts\n1,897\n1,852\n1,854\nMortgage banking income, net\n1,797\n2,076\n1,337\nIncome from fiduciary services\n1,277\n1,229\n1,224\nBank-owned life insurance\n620\n603\n695\nBrokerage and insurance commissions\n546\n600\n505\nOther service charges and fees\n471\n589\n468\nNet gain on sale of securities\n28\n827\n47\nOther income\n1,012\n462\n2,093\nTotal non-interest income\n9,840\n10,299\n10,151\nNon-Interest Expense\nSalaries and employee benefits\n13,083\n12,359\n12,438\nFurniture, equipment and data processing\n2,690\n2,429\n2,400\nNet occupancy costs\n1,650\n1,599\n1,736\nConsulting and professional fees\n706\n714\n625\nDebit card expense\n721\n662\n477\nRegulatory assessments\n559\n574\n615\nAmortization of intangible assets\n392\n473\n476\nOther real estate owned and collection costs, net\n413\n258\n1,099\nOther expenses\n2,885\n2,757\n2,642\nTotal non-interest expense\n23,099\n21,825\n22,508\nIncome before income tax expense\n16,162\n16,817\n15,632\nIncome tax expense\n19,335\n5,478\n4,730\nNet income (loss)\n$\n(3,173)\n$\n11,339\n$\n10,902\nPer Share Data:\nBasic earnings per share\n$\n(0.20)\n$\n0.72\n$\n0.70\nDiluted earnings per share\n$\n(0.20)\n$\n0.72\n$\n0.70\nConsolidated Statements of Income Data\n(unaudited)\nYear Ended\nDecember 31,\n(In thousands, except per share data)\n2017\n2016\nInterest Income\nInterest and fees on loans\n$\n114,563\n$\n109,224\nInterest on U.S. government and sponsored enterprise obligations\n16,879\n16,082\nInterest on state and political subdivision obligations\n2,764\n2,836\nInterest on federal funds sold and other investments\n1,898\n1,484\nTotal interest income\n136,104\n129,626\nInterest Expense\nInterest on deposits\n11,811\n8,633\nInterest on borrowings\n5,585\n4,506\nInterest on subordinated debentures\n3,408\n3,415\nTotal interest expense\n20,804\n16,554\nNet interest income\n115,300\n113,072\nProvision for credit losses\n3,035\n5,258\nNet interest income after provision for credit losses\n112,265\n107,814\nNon-Interest Income\nDebit card income\n8,079\n7,578\nService charges on deposit accounts\n7,529\n7,210\nMortgage banking income, net\n7,363\n6,258\nIncome from fiduciary services\n5,108\n4,960\nBank-owned life insurance\n2,370\n2,594\nBrokerage and insurance commissions\n2,147\n2,074\nOther service charges and fees\n2,029\n1,962\nNet gain on sale of securities\n855\n51\nOther income\n3,119\n6,934\nTotal non-interest income\n38,599\n39,621\nNon-Interest Expense\nSalaries and employee benefits\n49,965\n48,072\nFurniture, equipment and data processing\n9,894\n9,557\nNet occupancy costs\n6,884\n7,088\nConsulting and professional fees\n3,118\n3,234\nDebit card expense\n2,755\n2,584\nRegulatory assessments\n2,166\n2,777\nAmortization of intangible assets\n1,809\n1,903\nOther real estate owned and collection costs, net\n971\n3,128\nMerger and acquisition costs\n—\n866\nOther expenses\n10,948\n10,687\nTotal non-interest expense\n88,510\n89,896\nIncome before income tax expense\n62,354\n57,539\nIncome tax expense\n33,878\n17,472\nNet income\n$\n28,476\n$\n40,067\nPer Share Data:\nBasic earnings per share\n$\n1.83\n$\n2.59\nDiluted earnings per share\n$\n1.82\n$\n2.57\nQuarterly Average Balance, Interest and Yield/Rate Analysis\n(unaudited)\nFor the Three Months Ended\nAverage Balance\nYield/Rate\n(In thousands)\nDecember 31,\n2017\nSeptember 30,\n2017\nDecember 31,\n2016\nDecember 31,\n2017\nSeptember 30,\n2017\nDecember 31,\n2016\nAssets\nInterest-earning assets:\nSecurities - taxable\n$\n811,006\n$\n819,778\n$\n791,565\n2.28\n%\n2.28\n%\n2.25\n%\nSecurities - nontaxable (1)\n101,371\n101,507\n103,904\n4.16\n%\n4.16\n%\n4.20\n%\nLoans (2)(3) :\nResidential real estate\n861,658\n851,828\n813,846\n4.15\n%\n4.09\n%\n4.15\n%\nCommercial real estate\n1,153,842\n1,136,851\n1,051,346\n4.15\n%\n4.07\n%\n3.92\n%\nCommercial (1)\n343,921\n347,469\n299,425\n4.12\n%\n4.18\n%\n3.96\n%\nMunicipal (1)\n18,442\n24,847\n20,971\n3.73\n%\n3.24\n%\n2.90\n%\nConsumer and home equity\n343,942\n345,533\n349,202\n4.54\n%\n4.58\n%\n4.23\n%\nHPFC\n46,565\n49,619\n63,662\n8.14\n%\n8.38\n%\n8.44\n%\nTotal loans\n2,768,370\n2,756,147\n2,598,452\n4.26\n%\n4.23\n%\n4.14\n%\nTotal interest-earning assets\n3,680,747\n3,677,432\n3,493,921\n3.82\n%\n3.79\n%\n3.72\n%\nOther assets\n358,349\n352,711\n368,323\nTotal assets\n$\n4,039,096\n$\n4,030,143\n$\n3,862,244\nLiabilities & Shareholders' Equity\nDeposits:\nDemand\n$\n486,753\n$\n450,350\n$\n428,057\n—\n%\n—\n%\n—\n%\nInterest checking\n824,247\n727,959\n728,563\n0.28\n%\n0.19\n%\n0.15\n%\nSavings\n497,929\n493,447\n481,630\n0.06\n%\n0.07\n%\n0.06\n%\nMoney market\n489,426\n469,458\n503,688\n0.58\n%\n0.53\n%\n0.41\n%\nCertificates of deposit (3)\n490,779\n454,013\n477,569\n0.90\n%\n0.83\n%\n0.80\n%\nTotal deposits\n2,789,134\n2,595,227\n2,619,507\n0.36\n%\n0.31\n%\n0.28\n%\nBorrowings:\nBrokered deposits\n217,328\n310,207\n276,347\n1.35\n%\n1.30\n%\n0.65\n%\nCustomer repurchase agreements\n254,529\n222,386\n229,020\n0.50\n%\n0.51\n%\n0.29\n%\nSubordinated debentures\n58,892\n58,853\n58,736\n5.76\n%\n5.78\n%\n5.81\n%\nOther borrowings\n257,420\n386,643\n231,688\n1.48\n%\n1.42\n%\n1.25\n%\nTotal borrowings\n788,169\n978,089\n795,791\n1.45\n%\n1.43\n%\n1.10\n%\nTotal funding liabilities\n3,577,303\n3,573,316\n3,415,298\n0.60\n%\n0.62\n%\n0.47\n%\nOther liabilities\n44,979\n45,330\n52,942\nShareholders' equity\n416,814\n411,497\n394,004\nTotal liabilities & shareholders' equity\n$\n4,039,096\n$\n4,030,143\n$\n3,862,244\nNet interest rate spread (fully-taxable equivalent)\n3.22\n%\n3.17\n%\n3.25\n%\nNet interest margin (fully-taxable equivalent)\n3.24\n%\n3.19\n%\n3.26\n%\nNet interest margin (fully-taxable equivalent), excluding fair value mark\naccretion and collection of previously charged-off acquired loans (3)\n3.17\n%\n3.11\n%\n3.14\n%\n(1)\nReported on tax-equivalent basis calculated using a tax rate of 35%, including certain commercial loans.\n(2)\nNon-accrual loans and loans held for sale are included in total average loans.\n(3)\nExcludes the impact of the fair value mark accretion on loans and certificates of deposit generated in purchase accounting\nand collection of previously charged-off acquired loans for the three months ended December 31, 2017, September 30, 2017 and\nDecember 31, 2016 totaling $689,000, $804,000 and $1.0 million, respectively.\nYear-to-Date Average Balance, Interest and Yield/Rate Analysis\n(unaudited)\nFor the Year Ended\nAverage Balance\nYield/Rate\n(In thousands)\nDecember 31,\n2017\nDecember 31,\n2016\nDecember 31,\n2017\nDecember 31,\n2016\nAssets\nInterest-earning assets:\nSecurities - taxable\n$\n826,749\n$\n796,423\n2.27\n%\n2.21\n%\nSecurities - nontaxable (1)\n101,898\n103,086\n4.17\n%\n4.23\n%\nLoans (2)(3) :\nResidential real estate\n838,781\n822,690\n4.12\n%\n4.18\n%\nCommercial real estate\n1,120,591\n1,004,169\n4.11\n%\n4.11\n%\nCommercial (1)\n336,685\n292,709\n4.21\n%\n4.22\n%\nMunicipal (1)\n19,428\n19,238\n3.43\n%\n2.97\n%\nConsumer and home equity\n343,457\n358,098\n4.45\n%\n4.22\n%\nHPFC\n52,031\n70,188\n8.53\n%\n8.82\n%\nTotal loans\n2,710,973\n2,567,092\n4.25\n%\n4.28\n%\nTotal interest-earning assets\n3,639,620\n3,466,601\n3.80\n%\n3.80\n%\nOther assets\n348,986\n370,096\nTotal assets\n$\n3,988,606\n$\n3,836,697\nLiabilities & Shareholders' Equity\nDeposits:\nDemand\n$\n430,706\n$\n386,189\n—\n%\n—\n%\nInterest checking\n750,543\n724,222\n0.21\n%\n0.13\n%\nSavings\n492,483\n461,794\n0.06\n%\n0.06\n%\nMoney market\n480,119\n490,155\n0.52\n%\n0.42\n%\nCertificates of deposit (3)\n466,418\n489,040\n0.88\n%\n0.78\n%\nTotal deposits\n2,620,269\n2,551,400\n0.32\n%\n0.28\n%\nBorrowings:\nBrokered deposits\n296,261\n231,610\n1.13\n%\n0.69\n%\nCustomer repurchase agreements\n232,762\n198,403\n0.46\n%\n0.28\n%\nSubordinated debentures\n58,834\n58,718\n5.79\n%\n5.82\n%\nOther borrowings\n329,988\n359,281\n1.37\n%\n1.10\n%\nTotal borrowings\n917,845\n848,012\n1.35\n%\n1.12\n%\nTotal funding liabilities\n3,538,114\n3,399,412\n0.59\n%\n0.49\n%\nOther liabilities\n43,864\n54,778\nShareholders' equity\n406,628\n382,507\nTotal liabilities & shareholders' equity\n$\n3,988,606\n$\n3,836,697\nNet interest rate spread (fully-taxable equivalent)\n3.21\n%\n3.31\n%\nNet interest margin (fully-taxable equivalent)\n3.23\n%\n3.32\n%\nNet interest margin (fully-taxable equivalent), excluding fair value mark accretion and collection of previously charged-off acquired loans (3)\n3.14\n%\n3.15\n%\n(1)\nReported on tax-equivalent basis calculated using a tax rate of 35%, including certain commercial loans.\n(2)\nNon-accrual loans and loans held for sale are included in total average loans.\n(3)\nExcludes the impact of the fair value mark accretion on loans and certificates of deposit generated in purchase accounting\nand collection of previously charged-off acquired loans for the year ended December 31, 2017 and 2016 totaling $3.2 million\nand $6.2 million, respectively.\nAsset Quality Data (unaudited)\n(In thousands)\nAt or For The\nYear Ended\nDecember 31, 2017\nAt or For The\nNine Months Ended\nSeptember 30, 2017\nAt or For The\nSix Months Ended\nJune 30, 2017\nAt or For The\nThree Months Ended\nMarch 31, 2017\nAt or For The\nYear Ended\nDecember 31, 2016\nNon-accrual loans:\nResidential real estate\n$\n4,979\n$\n4,465\n$\n4,890\n$\n4,105\n$\n3,945\nCommercial real estate\n5,642\n5,887\n16,291\n12,858\n12,849\nCommercial\n2,000\n1,830\n2,056\n1,994\n2,088\nConsumer\n1,650\n1,626\n1,371\n1,552\n1,624\nHPFC\n1,043\n838\n1,083\n1,014\n207\nTotal non-accrual loans\n15,314\n14,646\n25,691\n21,523\n20,713\nLoans 90 days past due and accruing\n—\n—\n76\n—\n—\nAccruing troubled-debt restructured loans not\nincluded above\n5,012\n5,154\n4,809\n4,558\n4,338\nTotal non-performing loans\n20,326\n19,800\n30,576\n26,081\n25,051\nOther real estate owned:\nResidential real estate\n—\n—\n—\n14\n14\nCommercial real estate\n130\n341\n341\n607\n908\nTotal other real estate owned\n130\n341\n341\n621\n922\nTotal non-performing assets\n$\n20,456\n$\n20,141\n$\n30,917\n$\n26,702\n$\n25,973\nLoans 30-89 days past due:\nResidential real estate\n$\n5,277\n$\n3,169\n$\n3,020\n$\n2,379\n$\n2,470\nCommercial real estate\n1,135\n2,297\n3,442\n2,531\n971\nCommercial\n518\n712\n269\n168\n851\nConsumer\n1,197\n1,256\n1,378\n1,008\n1,018\nHPFC\n887\n938\n639\n777\n1,029\nTotal loans 30-89 days past due\n$\n9,014\n$\n8,372\n$\n8,748\n$\n6,863\n$\n6,339\nAllowance for loan losses at the beginning of\nthe period\n$\n23,116\n$\n23,116\n$\n23,116\n$\n23,116\n$\n21,166\nProvision for loan losses\n3,026\n2,786\n1,984\n581\n5,269\nCharge-offs:\nResidential real estate\n482\n433\n195\n5\n356\nCommercial real estate\n124\n81\n12\n3\n315\nCommercial\n1,014\n650\n281\n136\n2,218\nConsumer\n558\n493\n454\n15\n409\nHPFC\n290\n274\n81\n—\n507\nTotal charge-offs\n2,468\n1,931\n1,023\n159\n3,805\nTotal recoveries\n(497)\n(442)\n(317)\n(183)\n(486)\nNet charge-offs (recoveries)\n1,971\n1,489\n706\n(24)\n3,319\nAllowance for loan losses at the end of the\nperiod\n$\n24,171\n$\n24,413\n$\n24,394\n$\n23,721\n$\n23,116\nComponents of allowance for credit losses:\nAllowance for loan losses\n$\n24,171\n$\n24,413\n$\n24,394\n$\n23,721\n$\n23,116\nLiability for unfunded credit commitments\n20\n22\n7\n9\n11\nAllowance for credit losses\n$\n24,191\n$\n24,435\n$\n24,401\n$\n23,730\n$\n23,127\nRatios:\nNon-performing loans to total loans\n0.73\n%\n0.72\n%\n1.12\n%\n0.99\n%\n0.97\n%\nNon-performing assets to total assets\n0.50\n%\n0.50\n%\n0.77\n%\n0.68\n%\n0.67\n%\nAllowance for loan losses to total loans\n0.87\n%\n0.89\n%\n0.89\n%\n0.90\n%\n0.89\n%\nNet charge-offs to average loans (annualized)\nQuarter-to-date\n0.07\n%\n0.11\n%\n0.11\n%\n—\n%\n0.07\n%\nYear-to-date\n0.07\n%\n0.07\n%\n0.05\n%\n—\n%\n0.13\n%\nAllowance for loan losses to non-performing loans\n118.92\n%\n123.30\n%\n79.78\n%\n90.95\n%\n92.28\n%\nLoans 30-89 days past due to total loans\n0.32\n%\n0.30\n%\n0.32\n%\n0.26\n%\n0.24\n%\nReconciliation of non-GAAP to GAAP Financial Measures (unaudited)\nEfficiency Ratio:\nFor the\nThree Months Ended\nFor the\nYear Ended\n(In thousands)\nDecember 31,\n2017\nSeptember 30,\n2017\nDecember 31,\n2016\nDecember 31,\n2017\nDecember 31,\n2016\nNon-interest expense, as presented\n$\n23,099\n$\n21,825\n$\n22,508\n$\n88,510\n$\n89,896\nLess: merger and acquisition costs\n—\n—\n—\n—\n(866)\nAdjusted non-interest expense\n$\n23,099\n$\n21,825\n$\n22,508\n$\n88,510\n$\n89,030\nNet interest income, as presented\n$\n29,659\n$\n29,160\n$\n28,244\n$\n115,300\n$\n113,072\nAdd: effect of tax-exempt income (1)\n525\n535\n533\n2,105\n2,121\nNon-interest income, as presented\n9,840\n10,299\n10,151\n38,599\n39,621\nLess: net gain on sale of securities\n(28)\n(827)\n(47)\n(855)\n(51)\nAdjusted net interest income plus non-interest income\n$\n39,996\n$\n39,167\n$\n38,881\n$\n155,149\n$\n154,763\nNon-GAAP efficiency ratio\n57.75\n%\n55.72\n%\n57.89\n%\n57.05\n%\n57.53\n%\nGAAP efficiency ratio\n58.48\n%\n55.31\n%\n58.62\n%\n57.51\n%\n58.87\n%\n(1) Assumed a 35% tax rate.\nTangible Book Value Per Share and Tangible Common Equity Ratio:\nDecember 31,\n2017\nSeptember 30,\n2017\nDecember 31,\n2016\n(In thousands, except number of shares and per share data)\nTangible Book Value Per Share:\nShareholders' equity, as presented\n$\n403,413\n$\n414,366\n$\n391,547\nLess: goodwill and other intangible assets\n(99,652)\n(100,044)\n(101,461)\nTangible equity\n$\n303,761\n$\n314,322\n$\n290,086\nShares outstanding at period end\n15,524,704\n15,515,577\n15,476,379\nTangible book value per share\n$\n19.57\n$\n20.26\n$\n18.74\nBook value per share\n$\n25.99\n$\n26.71\n$\n25.30\nTangible Common Equity Ratio:\nTotal assets\n$\n4,065,398\n$\n4,039,943\n$\n3,864,230\nLess: goodwill and other intangibles\n(99,652)\n(100,044)\n(101,461)\nTangible assets\n$\n3,965,746\n$\n3,939,899\n$\n3,762,769\nTangible common equity ratio\n7.66\n%\n7.98\n%\n7.71\n%\nShareholders' equity to total assets\n9.92\n%\n10.26\n%\n10.13\n%\nAdjusted Operating Return on Average Tangible Equity and Adjusted Operating Return on Average Equity:\nFor the\nThree Months Ended\nFor the\nYear Ended\n(In thousands)\nDecember 31,\n2017\nSeptember 30,\n2017\nDecember 31,\n2016\nDecember 31,\n2017\nDecember 31,\n2016\nNet income (loss), as presented\n$\n(3,173)\n$\n11,339\n$\n10,902\n$\n28,476\n$\n40,067\nAdd: impact of the Tax Act\n14,263\n—\n—\n14,263\n—\nAdjusted operating income\n11,090\n11,339\n10,902\n42,739\n40,067\nAdd: amortization of intangible assets, net of tax (1)\n255\n307\n309\n1,176\n1,237\nTangible net income, adjusted for the Tax Act\n$\n11,345\n$\n11,646\n$\n11,211\n$\n43,915\n$\n41,304\nAverage equity\n$\n416,814\n$\n411,497\n$\n394,004\n$\n406,628\n$\n382,507\nLess: average goodwill and other intangible assets\n(99,823)\n(100,273)\n(101,689)\n(100,513)\n(102,711)\nAverage tangible equity\n$\n316,991\n$\n311,224\n$\n292,315\n$\n306,115\n$\n279,796\nAdjusted operating return on average tangible equity\n14.20\n%\n14.85\n%\n15.26\n%\n14.35\n%\n14.76\n%\nAdjusted operating return on average equity\n10.56\n%\n10.93\n%\n11.01\n%\n10.51\n%\n10.47\n%\nReturn on average equity\n(3.02)\n%\n10.93\n%\n11.01\n%\n7.00\n%\n10.47\n%\n(1) Assumed a 35% tax rate.\nAdjusted Operating Income; Adjusted Operating Diluted EPS; and Adjusted Operating Return on Average Assets:\nFor the\nThree Months Ended\nFor the\nYear Ended\n(In thousands, except per share data)\nDecember 31,\n2017\nSeptember 30,\n2017\nDecember 31,\n2016\nDecember 31,\n2017\nDecember 31,\n2016\nAdjusted Operating Income:\nNet income (loss), as presented\n$\n(3,173)\n$\n11,339\n$\n10,902\n$\n28,476\n$\n40,067\nAdd: impact of the Tax Act\n14,263\n—\n—\n14,263\n—\nAdjusted operating income\n$\n11,090\n$\n11,339\n$\n10,902\n$\n42,739\n$\n40,067\nAdjusted Operating Diluted EPS:\nDiluted EPS, as presented\n$\n(0.20)\n$\n0.72\n$\n0.70\n$\n1.82\n$\n2.57\nAdd: impact of the Tax Act\n0.91\n—\n—\n0.91\n—\nAdjusted operating diluted EPS\n$\n0.71\n$\n0.72\n$\n0.70\n$\n2.73\n$\n2.57\nAdjusted Operating Return on Average Assets:\nReturn on average assets, as presented\n(0.31)\n%\n1.12\n%\n1.12\n%\n0.71\n%\n1.04\n%\nAdd: impact of the Tax Act\n1.40\n%\n—\n%\n—\n%\n0.36\n%\n—\n%\nAdjusted operating return on average assets\n1.09\n%\n1.12\n%\n1.12\n%\n1.07\n%\n1.04\n%\nView original content with multimedia: http://www.prnewswire.com/news-releases/camden-national-corporation-reports-2017-financial-results-300589863.html\nSOURCE Camden National Corporation", "external_links": ["http://www.prnewswire.com/news-releases/camden-national-corporation-reports-2017-financial-results-300589863.html", "http://camdennational.com/", "http://services.choruscall.com/links/cac180130.html"], "published": "2018-01-30T16:30:00.000+02:00", "crawled": "2018-01-30T17:38:04.008+02:00", "highlightTitle": ""}