{"organizations": [], "uuid": "0f8ef9dadec145aa473e4b5bdd8e82251a8591ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-invetech-announces-senior-management-appointment.html", "country": "US", "domain_rank": 767, "title": "Invetech announces senior management appointment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.654, "site_type": "news", "published": "2018-01-22T19:00:00.000+02:00", "replies_count": 0, "uuid": "0f8ef9dadec145aa473e4b5bdd8e82251a8591ee"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-invetech-announces-senior-management-appointment.html", "ord_in_thread": 0, "title": "Invetech announces senior management appointment", "locations": [], "entities": {"persons": [{"name": "david kneen", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "andreas knaack", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "invetech", "sentiment": "negative"}, {"name": "invetech's cell therapy group", "sentiment": "none"}, {"name": "gmp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 22, 2018 /PRNewswire/ -- Invetech, a global leader in instrument development, custom automation and contract manufacturing, has announced the appointment of David Kneen as Vice President, Cell Therapy. David brings a diverse range of skills to the role, including experience in biotechnology commercialization and business strategy, particularly in the commercial-scale manufacture of cell and advanced therapies.\nSince 2004, Invetech's Cell Therapy Group has helped more than 30 cell and advanced therapy companies across the globe translate their unit process steps into GMP controlled manufacturing processes on automated equipment in disposables.\n\"As the global regenerative medicine market gathers speed and looks to address larger disease indications, there are critical challenges around the effective manufacturability of these therapies that need to be addressed,\" said Andreas Knaack, President of Invetech. \"David's wealth of industry knowledge, together with his experience in innovative new product development, risk-based program management and business strategy are a great combination to lead the team.\"\nDavid has 11 years of experience with Invetech in two stints, initially joining as a mechanical engineer working on biomedical projects. After leaving Invetech to focus on his MBA, David joined McKinsey & Company as a management consultant where he advised on a broad range of strategic and operations themes across industries including healthcare, finance and food production. Since returning to Invetech, he has managed cell therapy manufacturing automation programs for clients across the USA and Europe.\n\"The opportunity to guide Invetech's Cell Therapy Group comes at an exciting time for the industry,\" said David Kneen. \"I see three key areas of strategic focus and opportunity in this role: Invetech's continued delivery of commercial-scale manufacturing establishment solutions to the nascent cell therapy industry, leveraging our commercial manufacturing expertise to provide flexible yet robust development modules for clinical players, and exploring the potential for new industry partnerships.\"\nDavid has an MBA from Melbourne Business School and a BE/BSc from The University of Melbourne.\nAbout Invetech\nInvetech has created breakthrough products and custom automation systems for more than 30 years. With experience drawn from more than 5,000 projects globally, Invetech partners with global leaders in industry to deliver product design and development, contract manufacturing and custom automation services. The company has experience in a broad range of market sectors including laboratory diagnostics, point of care diagnostics, life sciences, and cell and advanced therapy automated production systems. To learn more about Invetech, please visit http://www.invetech.us.\nContact: Heather Rold, Invetech, heather.rold@invetech.us , 858-768-3261\nView original content with multimedia: http://www.prnewswire.com/news-releases/invetech-announces-senior-management-appointment-300585146.html\nSOURCE Invetech", "external_links": ["http://www.invetech.us/", "http://www.prnewswire.com/news-releases/invetech-announces-senior-management-appointment-300585146.html"], "published": "2018-01-22T19:00:00.000+02:00", "crawled": "2018-01-22T20:12:50.025+02:00", "highlightTitle": ""}