{"organizations": [], "uuid": "f5dc6556934ca9b21c15bf385fac50b75caef09d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-wallows-near-3-yr-lows-on-u-s-govt-shutdown-idUSL4N1PH372", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar wallows near 3-yr lows on U.S. govt shutdown", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-22T17:00:00.000+02:00", "replies_count": 0, "uuid": "f5dc6556934ca9b21c15bf385fac50b75caef09d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-wallows-near-3-yr-lows-on-u-s-govt-shutdown-idUSL4N1PH372", "ord_in_thread": 0, "title": "FOREX-Dollar wallows near 3-yr lows on U.S. govt shutdown", "locations": [], "entities": {"persons": [{"name": "saikat chatterjee", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Japan, Europe central bank meetings in focus this week\n* Positioning data shows increased dollar bearish bets\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Saikat Chatterjee\nLONDON, Jan 22 (Reuters) - The dollar was pinned near a three-year low on Monday as a U.S. government shutdown encouraged investors to add to bearish bets against the greenback while the euro consolidated recent gains.\nAs indicators such as the Vix and the euro/dollar -- which traditionally flared up in previous U.S. government shutdown episodes -- remained well within recent ranges, currency markets remained focused on two major central bank meetings this week, namely the Bank of Japan and the European Central Bank.\nWhile Japan is unlikely to signal any policy normalization at the conclusion of a policy meeting on Tuesday, the surprise package for markets may be from the ECB which may stick to its dovish policy stance and unlikely to offer any hint of a change in forward guidance.\nThat may undermine the euro’s rally which has gained more than 2 percent in the opening days of 2018 after double-digit gains last year on growing expectations that the ECB may be forced to unwind its policy stimulus quicker than previously estimated thanks to a broadening recovery.\n“Unless the U.S. government shutdown ends very quickly which may boost the dollar, markets are focusing on the two other cross currents this week, namely the BOJ and the ECB with the latter likely to surprise euro bulls,” said Alvin Tan, a currency strategist at Societe Generale in London.\nOn Monday, the euro edged 0.1 percent higher to $1.22430 and not far away from a three-year peak of $1.2323 that it scaled on Wednesday.\nRecent data and political developments, especially in Germany has also proved to be supportive of the euro, with business sentiment remaining optimistic and capital spending picking up.\nMeanwhile, latest positioning data showed dollar bears extended bets against the greenback last week as political wrangling dented investor confidence.\nThe U.S. government shutdown took effect at midnight on Friday after Democrats and Republicans, locked in a bitter dispute over immigration and border security, failed to agree on a last-minute deal to fund government operations.\nIn order to break the impasse, Republican and Democratic leaders of the U.S. Senate held talks on Sunday. Senate Majority Leader Mitch McConnell said late on Sunday that an overnight vote on a measure to fund government operations through Feb. 8 was cancelled and would instead be held at 12 p.m. (1700 GMT) on Monday.\n“The market is accustomed with what is taking place in U.S. politics. It is not reading too far into the shutdown, which is more like a political show,” said Koji Fukaya, president of FPG Securities in Tokyo.\nThe dollar’s index against a basket of six other major currencies initially dipped to hit 90.155 but was last up 0.1 percent at 90.665, managing to hold above the three-year trough of 90.113 set on Thursday.\nThe pound dipped 0.3 percent to $1.3862, pulling away from a 1-1/2-year top of $1.3942 reached on Wednesday following Friday’s disappointing UK retail sales data.\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets (Reporting by Saikat Chatterjee; Editing by Toby Chopra)\n ", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T17:00:00.000+02:00", "crawled": "2018-01-23T17:48:31.056+02:00", "highlightTitle": ""}