{"organizations": [], "uuid": "c11426808d4e0a76a6fc07c85608311f4613a7f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/21/104543221-GettyImages-652663482-minnestota.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/top-10-cities-for-finding-a-job-in-2018.html", "country": "US", "domain_rank": 767, "title": "The top 10 cities for finding a job in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.128, "site_type": "news", "published": "2018-01-05T18:58:00.000+02:00", "replies_count": 0, "uuid": "c11426808d4e0a76a6fc07c85608311f4613a7f0"}, "author": "Courtney Connley", "url": "https://www.cnbc.com/2018/01/05/top-10-cities-for-finding-a-job-in-2018.html", "ord_in_thread": 0, "title": "The top 10 cities for finding a job in 2018", "locations": [], "entities": {"persons": [{"name": "fargo", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "stone arch bridge", "sentiment": "none"}, {"name": "columbia", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}, {"name": "north dakota", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If one of your top goals for the year is to find a new job then you're not alone. \nLast year, career resource site Monster found January to be one of the busiest job searching months, with January 4 being the busiest day of the year among people looking for new career opportunities. \nTo help job seekers narrow down their search, job search platform ZipRecruiter used data around job availability, industry diversity, unemployment and earnings to compile a list of the top job markets in 2018. \nTake a look below to see what cities you should consider during your job hunt this year. \nDenisTangneyJr | Getty Images Fargo, North Dakota 1. Fargo, North Dakota Top five industries: physical therapy, construction, human resources, finance and insurance, healthcare\nWhat makes the job market good: According to ZipRecruiter, Fargo, North Dakota has a low unemployment rate of 1.6 percent and offers many well-paying job opportunities that don't require a four-year degree. \n2. Columbia, Missouri  Top five industries: sales, business, desktop support, government, technology\nWhat makes the job market good: ZipRecruiter reports Columbia, Missouri as having steady job growth over the past few years and being one of the few cities on the list with a significant rise in technology opportunities. \n3. Oshkosh, Wisconsin Top five industries: truck driving, transportation and storage, healthcare, nursing, business\nWhat makes the job market good: ZipRecruiter reports low cost of living and a stress-free work commute as two compelling factors in Oshkosh, Wisconsin. \nColin Anderson | Getty Images 4. Honolulu, Hawaii Top five industries: real estate, attorney, construction, facilities maintenance, education\nWhat makes the job market good: In addition to its beautiful location, ZipRecruiter reports Honolulu, Hawaii as a place with significant job growth in well-paying industries like real estate, law and construction. \n5. Ames, Iowa Top five industries: software, transportation and storage, business, truck driving, healthcare\nWhat makes the job market good: According to ZipRecruiter, successful startup companies like Workiva Inc. are founded in Ames, Iowa in order to capitalize on talent from nearby Iowa State. \n6. Lincoln, Nebraska Top five industries: construction, insurance, real estate, information technology, desktop support\nWhat makes the job market good: According to ZipRecruiter, Lincoln, Nebraska is known for having a great job market for younger employees and for having a great entrepreneur community. \nChris L Smith/Getty Images The city of Wallace, Idaho. 7. Lewiston, Idaho Top five industries: healthcare, truck driving, nursing, transportation and storage, business\nWhat makes the job market good: ZipRecruiter reports Lewiston, Idaho as employing approximately 1.7 million people in the state thanks in part to a strong demand for jobs in healthcare, nursing and truck driving. \n8. Des Moines, Iowa Top five industries: human resources, construction, real estate, information technology, healthcare\nWhat makes the job market good: Making the list each year for top job markets, ZipRecruiter says Des Moines, Iowa has promising job growth for a diverse set of industries. \n9. Wausau, Wisconsin Top five industries: accounting, healthcare, technology, sales, transportation and storage\nWhat makes the job market good: According to ZipRecruiter, Wausau, Wisconsin not only has job growth potential in numerous industries, but it also has a lower than average cost of living and commute times.\n10. Minneapolis, Minnesota  Top five industries: nutrition, travel, e-commerce, construction, nursing\nWhat makes the job market good: ZipRecruiter places Minneapolis, Minnesota on the list for its large job market and low rate of job competition. \nLike this story? Like CNBC Make It on Facebook \nDon't miss: 10 companies that will be hiring thousands in 2018 \n\nshow chapters Here are the 10 best cities to start your career      6:00 PM ET Tue, 30 May 2017 | 00:51", "external_links": [], "published": "2018-01-05T18:58:00.000+02:00", "crawled": "2018-01-05T19:15:14.009+02:00", "highlightTitle": ""}