{"organizations": [], "uuid": "b135276964a64143ce41f01ee1f2094e92c5ab5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221394193&w=1200&r=LYNXMPEE0B0H2", "site_section": "http://feeds.reuters.com/reuters/UKGolfNews", "section_title": "Reuters: Golf News", "url": "https://uk.reuters.com/article/uk-golf-eurasia/last-gasp-li-birdie-helps-asia-take-lead-against-europe-idUKKBN1F10VJ", "country": "US", "domain_rank": 408, "title": "Golf-Last-gasp Li birdie helps Asia take lead against Europe", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T11:11:00.000+02:00", "replies_count": 0, "uuid": "b135276964a64143ce41f01ee1f2094e92c5ab5f"}, "author": "", "url": "https://uk.reuters.com/article/uk-golf-eurasia/last-gasp-li-birdie-helps-asia-take-lead-against-europe-idUKKBN1F10VJ", "ord_in_thread": 0, "title": "Golf-Last-gasp Li birdie helps Asia take lead against Europe", "locations": [], "entities": {"persons": [{"name": "golf-last-gasp li", "sentiment": "negative"}, {"name": "li", "sentiment": "negative"}, {"name": "nicholas fung", "sentiment": "none"}, {"name": "haotong li", "sentiment": "none"}, {"name": "bernd wiesberger", "sentiment": "none"}, {"name": "li haotong", "sentiment": "none"}, {"name": "thomas bjorn", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "southport", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "kuala lumpur", "sentiment": "none"}], "organizations": [{"name": "europe reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 9:25 AM / Updated 7 hours ago Last-gasp Li birdie helps Asia take lead against Europe Reuters Staff 3 Min Read \nKUALA LUMPUR (Reuters) - China’s Li Haotong held his nerve to birdie his final hole and give hosts Asia a slender lead over champions Europe on the opening day of the 2018 EurAsia Cup in Kuala Lumpur on Friday. Golf - The 146th Open Championship - Royal Birkdale - Southport, Britain - July 21, 2017 China’s Haotong Li hits his tee shot on the fifth hole during the second round REUTERS/Paul Childs \nPaired with Malaysian Nicholas Fung, the 22-year-old Li won the hole to halve the day’s final fourball match against Spaniard Rafa Cabrera-Bello and Austrian Bernd Wiesberger as Asia opened up a 3 1/2-2 1/2 lead. \nIn the last edition of the event, a Darren Clarke-captained European team romped to an 18 1/2-5 1/2 blowout win over their Asian counterparts in the second edition of the biennial matchplay contest in 2016. \nHowever, Thomas Bjorn’s side were far less convincing this time around, with Europe finding themselves down in four matches and all-square in the other two as Asia dominated the early stages of the first day at the Glenmarie Golf and Country Club. \nEurope did manage to fight back as the rounds progressed with the English pairing of Tommy Fleetwood and Paul Casey putting the team on the board with a 4 and 3 victory over Korean An Byeong-un and Thai Kiradech Aphibarnrat in the first match. \n”It feels great. I love matchplay, especially when you have a partner like Tommy Fleetwood,“ said Casey, who was one of Bjorn’s two wildcard selections. ”What a blast, what great golf we played, but the Asians threw a lot at us, as well. \n“I‘m ecstatic to get this going and get a point because it’s going to be a tough week.” \nAsia rallied to take the lead with Yuta Ikeda and Gavin Green beating Thomas Pieters and Matthew Fitzpatrick 2 and 1, before Poom Saksansin and Kang Sung-hoon defeated Henrik Stenson and Alex Levy 5 and 4. \nAnother English pairing, Ross Fisher and Tyrrell Hatton, then tied the scores with a 5 and 4 win over Indian duo of Anirban Lahiri and S.S.P Chawrasia. \nHowever, Hideto Tanihara and the 18-year-old Phachara Khongwatmai put Asia back in front with a 2-up victory over Alex Noren and Paul Dunne, leaving it to Cabrera-Bello and Wiesberger to ensure the champions headed into the weekend on level terms. \nCabrera-Bello’s immaculate putting saw the pair lead by one at the 18th tee but they failed to match Asia’s birdie and had to settle for a half point. \nBjorn will also captain Europe in the Ryder Cup, which takes place in France this September, with the hosts looking to regain the trophy they lost to the United States at Hazeltine in 2016. Reporting by Sudipto Ganguly in Mumbai; Editing by John O'Brien", "external_links": [], "published": "2018-01-12T11:11:00.000+02:00", "crawled": "2018-01-12T11:46:46.003+02:00", "highlightTitle": ""}