{"organizations": [], "uuid": "f82490c0c56a4c2467e5a2bcd0a6dc9813a8d0b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/09/ap_17240128980097.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/elon-musks-flamethrower-is-real-and-its-going-for-600/", "country": "US", "domain_rank": 1196, "title": "Elon Musk's Flamethrower Is Real And It's Going For $600 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.624, "site_type": "news", "published": "2018-01-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "f82490c0c56a4c2467e5a2bcd0a6dc9813a8d0b4"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/25/elon-musks-flamethrower-is-real-and-its-going-for-600/", "ord_in_thread": 0, "title": "Elon Musk's Flamethrower Is Real And It's Going For $600 | Fortune", "locations": [], "entities": {"persons": [{"name": "kirsten korosec", "sentiment": "negative"}, {"name": "elon musk", "sentiment": "negative"}, {"name": "tesla", "sentiment": "none"}, {"name": "griddy mcgridfinface", "sentiment": "none"}], "locations": [{"name": "reddit", "sentiment": "none"}, {"name": "l.a.", "sentiment": "none"}], "organizations": [{"name": "boring co.", "sentiment": "none"}, {"name": "musk", "sentiment": "none"}, {"name": "spacex", "sentiment": "none"}, {"name": "boring company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec January 25, 2018 \nLooks like Elon Musk really does intend to sell a flamethrower. Or at least has a webpage where you could buy it. \nElon Musk, the billionaire entrepreneur leading SpaceX, Tesla, and tunneling startup The Boring Co., teased the idea of a selling a flamethrower back in December. Some folks on Reddit discovered a URL “boringcompany.com/flamethrower ,” which landed on a password page. At least one person correctly guessed the password and a page showing a flamethrower and a price popped up, The Verge reported . The password has since been changed. (It was “flame”). It was leaked a few days ago but they changed the password pic.twitter.com/wcMXZ0ARFk \n— Griddy McGridfinFace (@FalconGridFin) January 25, 2018 \nWhy a flamethrower? For those who can’t keep track of Musk’s businesses and tweetstorms, here’s the rundown. \nThe Boring Company, first drummed up by Musk in December 2016 after a particularly soul-crushing bout with L.A. traffic, was founded to find a quick and cost-effective way to dig networks of tunnels for vehicles and high-speed trains. By February 2017, a giant hole meant to be a demonstration project appeared on the SpaceX campus in Hawthorne, Calif., the details of which were reported by Bloomberg . The tunnels could be used for vehicles or hyperloop, the theoretical and futuristic transit system that would shuttle people and packages at speeds of more than 700 miles per hour. \nA month later, Musk introduced a branded baseball hat because every business needs a little merch. Musk provided periodic updates on hat sales via Twitter. The progress reports ramped up in recent months after Musk decided to “cap” sales at 50,000 caps. After 50k hats, we will start selling The Boring Company flamethrower \n— Elon Musk (@elonmusk) December 11, 2017 \nAt $20 a cap, Musk raised $1 million. The flamethrower, if this web page is to be believed, will go for $600. \nThe flamethrower has been shared on social media at least one other time by DA Wallach, the investor and musician, who also helped Spotify partner with artists in its early days. Earlier this month, Wallach posted a photo on Instagram (which was reported by Teslarati ) holding the flamethrower. \nBut it until now, there wasn’t evidence it might actually go up for sale. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T02:00:00.000+02:00", "crawled": "2018-01-26T11:00:16.015+02:00", "highlightTitle": ""}