{"organizations": [], "uuid": "f65746b386390de7ead0acdd3947afbcfb333b54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226942096&w=1200&r=LYNXMPEE0U0VM", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-germany-politics-afd/german-far-right-afd-lawmaker-becomes-chair-of-key-budget-committee-idUKKBN1FK1RO", "country": "US", "domain_rank": 408, "title": "German far-right AfD lawmaker becomes chair of key budget committee", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:50:00.000+02:00", "replies_count": 0, "uuid": "f65746b386390de7ead0acdd3947afbcfb333b54"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-politics-afd/german-far-right-afd-lawmaker-becomes-chair-of-key-budget-committee-idUKKBN1FK1RO", "ord_in_thread": 0, "title": "German far-right AfD lawmaker becomes chair of key budget committee", "locations": [], "entities": {"persons": [{"name": "boehringer", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "peter boehringer", "sentiment": "none"}, {"name": "michelle martin", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 12:51 PM / Updated 41 minutes ago German far-right AfD lawmaker becomes chair of key budget committee Michelle Martin 3 Min Read \nBERLIN (Reuters) - A lawmaker from the eurosceptic, anti-immigrant Alternative for Germany (AfD) who has criticised euro zone rescues and the European Central Bank has been chosen as the chair of the parliament’s influential budget committee. \nThe top job in what is nicknamed the “king’s committee” due to its power in scrutinising government ministries’ budgets is traditionally reserved for the largest opposition party. That is set to be the AfD as Chancellor Angela Merkel’s conservatives and the Social Democrats (SPD) negotiate a new coalition. \nThe committee voted on Wednesday to accept AfD candidate Peter Boehringer, who rose to prominence by campaigning for the repatriation of Germany’s gold reserves from overseas. He has also called for an “immediate end to mass illegal Islamic migration to Europe that threatens our existence”. \nThe AfD and the pro-market Free Democrats (FDP) voted in favour of Boehringer, 48, while the conservatives, SPD and Greens abstained. The far-left Linke voted against him. \nStriking a conciliatory tone after the vote, Boehringer, a former corporate consultant, said he was optimistic that the parties would be able to work well together on the committee. \n“The budget committee will be well managed and in a moderating way and, in my opinion, in a balancing way. Of course we won’t create a spectacle in the budget committee,” he told reporters. \nBoehringer wants all of Germany’s gold repatriated from vaults in New York, Paris and elsewhere, but he has also said this is not a matter for the budget committee. Peter Boehringer, member of the German parliament from the Alternative for Germany (AfD) party, poses for a portrait in Berlin, Germany January 30, 2018. REUTERS/Axel Schmidt CONCERNS \nThe AfD, which surged into parliament in last September’s election amid public concerns over a mass influx of migrants and refugees into Germany, wants the country to leave the euro zone and re-introduce the deutsche mark. \nThere have been concerns the AfD will become more credible and legitimate by taking positions like the budget committee chair but the other parties said they respected the AfD had earned the role with its election result of almost 13 percent. \nMainstream parties are keen to avoid the impression of disadvantaging the AfD by changing rules or traditions as they do not want the party that rails against the establishment to have grounds to complain of unfair treatment. \nBoehringer has played down expectations of what he can do in the new job, telling Reuters on Tuesday the AfD would not be able to thwart government plans to spend on refugees or possible euro zone bailouts as mainstream parties have a majority in the committee and so would outvote the AfD. [L8N1PP721] \nThe former head of the budget committee - Gesine Loetzsch, a member of the far-left Linke - said she had concerns about the choice of Boehringer, especially as he would have to represent the committee to international organisations. \n“We’ve noticed that he has made racist and misogynist comments and that’s not a good foundation for representing the committee,” she said. Reporting by Michelle Martin; Editing by Gareth Jones", "external_links": [], "published": "2018-01-31T14:50:00.000+02:00", "crawled": "2018-01-31T15:09:28.001+02:00", "highlightTitle": ""}