{"organizations": [], "uuid": "ad5674fc7f4f29a75ca62f4fef815ab6bca0ea99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-penske-automotive-increases-dividend.html", "country": "US", "domain_rank": 767, "title": "Penske Automotive Increases Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T14:59:00.000+02:00", "replies_count": 0, "uuid": "ad5674fc7f4f29a75ca62f4fef815ab6bca0ea99"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-penske-automotive-increases-dividend.html", "ord_in_thread": 0, "title": "Penske Automotive Increases Dividend", "locations": [], "entities": {"persons": [{"name": "jr.", "sentiment": "none"}, {"name": "robert h. kurnick", "sentiment": "none"}], "locations": [{"name": "mich.", "sentiment": "none"}], "organizations": [{"name": "pag", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "penske automotive group, inc.", "sentiment": "neutral"}, {"name": "penske automotive group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BLOOMFIELD HILLS, Mich., Jan. 30, 2018 /PRNewswire/ -- Penske Automotive Group, Inc. (NYSE: PAG), an international transportation services company, today announced that its Board of Directors has approved an increase in the cash dividend to $0.34 per share for the fourth quarter of 2017.\nPenske Automotive Group President Robert H. Kurnick, Jr., said, \"I am pleased to announce that our Board of Directors has increased the dividend for PAG's shareholders for the 27 th consecutive quarter. The increase in the dividend reflects our commitment to increasing returns for shareholders and reinforces the continued confidence we have in the strength of the company's business model and cash flow.\"\nThe dividend is payable on March 1, 2018, to shareholders of record on February 12, 2018.\nCaution Concerning Forward Looking Statements\nStatements in this press release may involve regarding Penske Automotive Group, Inc.'s future. Actual results may vary materially because of risks and uncertainties that are difficult to predict. These risks and uncertainties include, among others: economic conditions generally, conditions in the credit markets and changes in interest rates and foreign currency exchange rates, adverse conditions affecting a particular manufacturer, including the adverse impact to the vehicle and parts supply chain due to natural disasters, recalls or other disruptions that interrupt the supply of vehicles or parts to us, changes in consumer credit availability, the outcome of legal and administrative matters, and other factors over which management has limited control. These should be evaluated together with additional information about Penske Automotive's business, markets, conditions and other uncertainties, which could affect Penske Automotive's future performance. These risks and uncertainties are addressed in Penske Automotive's Form 10-K for the year ended December 31, 2016, and its other filings with the Securities and Exchange Commission (\"SEC\"). This press release speaks only as of its date, and Penske Automotive disclaims any duty to update the information herein.\nAbout Penske Automotive\nPenske Automotive Group, Inc., (NYSE: PAG) headquartered in Bloomfield Hills, Michigan, is an international transportation services company that operates automotive and commercial truck dealerships principally in the United States, Canada and Western Europe, and distributes commercial vehicles, diesel engines, gas engines, power systems and related parts and services principally in Australia and New Zealand. PAG employs more than 26,000 people worldwide, is a member of the Fortune 500, Russell 2000, and was named as one of the World's Most Admired Companies by Fortune. For additional information visit the company's website at www.penskeautomotive.com .\nFind a vehicle: http://www.penskecars.com\nEngage Penske Automotive:", "external_links": ["http://www.penskecars.com/", "http://www.penskeautomotive.com/"], "published": "2018-01-30T14:59:00.000+02:00", "crawled": "2018-01-30T15:38:01.020+02:00", "highlightTitle": ""}