{"organizations": [], "uuid": "88520cfa9edfaeebf4db3016251fa0df5b15b274", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-stocks-close/china-blue-chips-recover-property-consumer-firms-gain-idUSZZN2R7W00", "country": "US", "domain_rank": 408, "title": "China blue chips recover; property, consumer firms gain", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T09:16:00.000+02:00", "replies_count": 0, "uuid": "88520cfa9edfaeebf4db3016251fa0df5b15b274"}, "author": "", "url": "https://www.reuters.com/article/china-stocks-close/china-blue-chips-recover-property-consumer-firms-gain-idUSZZN2R7W00", "ord_in_thread": 0, "title": "China blue chips recover; property, consumer firms gain", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "shenzhen", "sentiment": "none"}], "organizations": [{"name": "lotus health group co", "sentiment": "none"}, {"name": "maoye commercial co ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Shanghai stocks lower, blue-chip CSI300 index up\n* Gains in Shanghai stocks led by Maoye Commercial Co Ltd\n* Losses led by Lotus Health Group Co\n* China’s A-shares are at a 28.88 pct premium over H-shares\nSHANGHAI, Jan 31 (Reuters) - China stocks ended mixed on Wednesday, with the blue-chip index recouping earlier losses to close higher, aided by a bounce in real estate and consumer firms.\n** Chinese fund managers boosted their suggested equity exposure for the next three months as financial and real-estate stocks surged amid easing worries over liquidity in early 2018.\n** At the close, the Shanghai Composite index was down 6.50 points or 0.19 percent at 3,481.51. ** The blue-chip CSI300 index was up 0.48 percent, with its financial sector sub-index higher by 1.22 percent, the consumer staples sector up 2.59 percent, the real estate index up 2.86 percent and healthcare sub-index up 0.37 percent. ** The smaller Shenzhen index ended down 1.66 percent and the start-up board ChiNext Composite index was weaker by 2.66 firmer by 0.29 percent while Japan’s Nikkei index closed down 0.83 percent. ** At 07:06 GMT, the yuan was Quote: d at 6.2978 per U.S. dollar, 0.43 percent firmer than the previous close of 6.325. ** The largest percentage gainers in the main Shanghai Composite index were Maoye Commercial Co Ltd up 10.03 percent, followed by Guanghui Logistics Co Ltd gaining 9.94 percent and Beijing Vantone Real Estate Co Ltd up by 9.91 percent. ** The largest percentage losses in the Shanghai index were Lotus Health Group Co down 10.11 percent, followed by Anyuan Coal Industry Group Co Ltd losing 10.06 percent and Hunan Chen Dian International Development Co Ltd down by 10.02 percent. ** So far this year, the Shanghai stock index is up 5.47 percent, the CSI300 is up 6.1 this year, while China’s H-share index listed in Hong Kong is up 14.3 percent. ** About 20.73 billion shares were traded on the Shanghai exchange, roughly 105.8 19.60 billion shares a day. The volume in the previous trading session was 18.64 billion. ** As of 07:07 GMT, China’s 28.91 Shanghai stock index is above its 50-day moving average and above its 200-day moving average. ** The price-to-earnings ratio of the Shanghai index was 15.86 1.8 percent. ** So far this week, the market capitalisation of the Shanghai stock index has fallen by 2.04 percent to 30.68 trillion yuan. (Reporting by Shanghai Newsroom; Editing by Jacqueline Wong)\n ", "external_links": [], "published": "2018-01-31T09:16:00.000+02:00", "crawled": "2018-01-31T10:00:23.008+02:00", "highlightTitle": ""}