{"organizations": [], "uuid": "8a5796b18750f727f5e3dedc828f5874999f1644", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223588821&w=1200&r=LYNXMPEE0J0A9", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-congress-shutdown/u-s-government-shuts-down-as-trump-feuds-with-democrats-idINKBN1F90EG", "country": "US", "domain_rank": 408, "title": "U.S. government shuts down as Trump feuds with Democrats", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T12:36:00.000+02:00", "replies_count": 0, "uuid": "8a5796b18750f727f5e3dedc828f5874999f1644"}, "author": "", "url": "https://in.reuters.com/article/usa-congress-shutdown/u-s-government-shuts-down-as-trump-feuds-with-democrats-idINKBN1F90EG", "ord_in_thread": 0, "title": "U.S. government shuts down as Trump feuds with Democrats", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "richard cowan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The second year of Donald Trump’s presidency began on Saturday with the U.S. government in shutdown mode while lawmakers gathered in hopes of finding a compromise that would fund federal agencies.\nFor the first time since October 2013 - when a similar standoff that lasted 16 days kept only essential agency operations running - federal workers were being told to stay at home or in some cases to work without pay until new funding is approved.\nFacing a political crisis that could have an impact on November’s congressional elections, the Republican-controlled Senate and House of Representatives were holding rare weekend sessions on Saturday.\nBut House Republicans, who gathered for closed meeting before their open session, were taking a hard line against Democrats, which could point to the possibility of a prolonged standoff.\nThe government had been running on three consecutive temporary funding bills since the new fiscal year began in October.\nOne senior House Republican, Greg Walden, told reporters the government would have to be reopened before discussions could advance on immigration - a main sticking point that led to the impasse.\nDemocrats’ demand of securing permanent legal protections for 700,000 young, undocumented immigrants as a condition for new government funding, Walden said, was “hostage taking in its worse form.”\nDemocrats counter that they have been pleading with Republicans for months to approve the immigration measure as a stand-alone bill and were rebuffed.\nOne idea being floated by Republicans was to renew government funding through Feb. 8 to end the shutdown, while working to resolve other issues, ranging from immigration, military and non-military spending levels, disaster relief and some healthcare issues.\nIMMIGRATION HURDLE The partial government shutdown was triggered at midnight on Friday when the Senate failed to agree to a House-passed bill to fund the government through Feb. 16. It lacked immigration measures that Democrats insisted upon and also drew some Republican opposition.\nDespite tough words from some House Republicans, others were providing conflicting messages.\nMarc Short, the White House legislative affairs director, told reporters on Capitol Hill: ”We are anxious to get a resolution on DACA.”\nHe was referring to the Deferred Action for Childhood Arrivals program that former President Barack Obama created and Trump ended in September. It was providing protection from deportation for the illegal immigrants brought to the United States as children and now known as “Dreamers.”\nModerate Republican Representative Charlie Dent predicted the government shutdown will end only when bipartisan legislation is allowed to advance in Congress, even if it angers conservatives.\n“That’s the price of leadership,” he said.\nThe shutdown began a year to the day after Trump was sworn in as president. His inability to cut a deal despite having a Republican majority in both houses of Congress marks arguably the most debilitating setback for his administration.\nIn Twitter posts early on Saturday, Trump blamed Democratic lawmakers.\nCapitol Police officer stands shortly after beginning the Government shutdown on Capitol Hill in Washington, U.S., January 20, 2018. REUTERS/Yuri Gripas “This is the One Year Anniversary of my Presidency and the Democrats wanted to give me a nice present,” he said.\n“Democrats are far more concerned with illegal immigrants than they are with our great military or safety at our dangerous southern border,” he said. “They could have easily made a deal but decided to play shutdown politics instead.”\nTrump said the shutdown showed the need to win more Republican seats in 2018 mid-term elections.\n“We can then be even tougher on Crime (and Border), and even better to our Military & Veterans!” he said.\nHouse Democratic Leader Nancy Pelosi laid blame on Republicans in a floor speech on Saturday.\n“Despite controlling the House, the Senate and the White House the Republicans were so incompetent, so negligent that they couldn’t get it together to keep government open,” Pelosi said.\nSlideshow (7 Images) FADED HOPE There had been modest hope on Friday when Democratic Senate Leader Chuck Schumer went to the White House to talk with Trump. One person familiar with the events said the two men agreed to seek a grand deal in which Democrats would win protections from deportation for some 700,000 young undocumented immigrants known as “Dreamers” and Trump would get more money for a border wall and tighter security to stem illegal immigration from Mexico.\nDespite frantic meetings that ran through midnight, a deal could not be reached.\nIn a statement issued minutes before Friday’s midnight deadline for a funding deal, Trump’s White House said: “We will not negotiate the status of unlawful immigrants while Democrats hold our lawful citizens hostage over their reckless demands.”\nThe reference to “unlawful immigrants” was in stark contrast to earlier statements, including one in September in which Trump proclaimed, “We love the Dreamers.”\nDemocrats and many Republicans want to provide permanent legal status leading to citizenship for Dreamers.\nThe immediate impact of the government shutdown was eased somewhat by its timing, starting on a weekend when most government employees normally do not work anyway.\nThe Defense Department said its combat operations in Afghanistan and other military activities would continue, while federal law enforcement officers also would remain on duty.\nThe State Department warned that it could have problems processing passports.\nTrump’s administration also said it planned to keep national parks open with rangers and security guards on duty. The parks were closed during the last shutdown in 2013, which upset many tourists and resulted in the loss of $500 million in visitor spending in areas around the parks and at the Smithsonian museums.\nBut without a quick deal, most day-to-day operations in the federal government will be disrupted. Hundreds of thousands of government employees will be put on temporary unpaid leave, including many of the White House’s 1,700 workers.\nParks and monuments remained open in the U.S. capital and on the National Mall preparations were under way for a second multi-city women’s rights march. Some tourists appeared unaware of the shutdown while others expressed frustration at lawmakers’ failure to reach a deal.\n”It’s ironic that they get paid - meaning Congress - and the rest of the government doesn’t,” said Dawn Gaither, 57, a Washington teacher. “That’s what we need to do, kick these guys in the tail and get them to work.”\nReporting by Richard Cowan, Ginger Gibson, Ian Simpson and David Brunnstrom in Washington and Rich McKay in Atlanta; Editing by John Stonestreet and Bill Trott\n ", "external_links": [], "published": "2018-01-20T12:36:00.000+02:00", "crawled": "2018-01-20T12:59:30.014+02:00", "highlightTitle": ""}