{"organizations": [], "uuid": "34adc3988dfe8bb71af267538cce855c56c050b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/22/103962817-GettyImages-107158537.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/dollar-rebound-leaves-investors-disinterested.html", "country": "US", "domain_rank": 767, "title": "Dollar rebound leaves investors disinterested", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T04:31:00.000+02:00", "replies_count": 0, "uuid": "34adc3988dfe8bb71af267538cce855c56c050b4"}, "author": "Dan Kitwood", "url": "https://www.cnbc.com/2018/01/02/dollar-rebound-leaves-investors-disinterested.html", "ord_in_thread": 0, "title": "Dollar rebound leaves investors disinterested", "locations": [], "entities": {"persons": [{"name": "timothy graf", "sentiment": "none"}, {"name": "dan kitwood", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "emea", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The dollar rallied on Wednesday after upbeat U.S. manufacturing and construction data, snapping a three-week losing streak as investors awaited the release of the Federal Reserve's December policy meeting minutes.\nThe U.S. currency was on track to post its largest daily gain in more than two weeks.\nGains accelerated after data showed U.S. construction spending rose 0.8 percent in November to an all-time high of $1.257 trillion, driven by a surge in investment in private residential and nonresidential projects. At the same time, a U.S. manufacturing index as measured by the Institute for Supply Management rose to 59.7 last month, beating market expectations.\n\"U.S. manufacturing had been sliding since last autumn but today's uptick will fill investors with confidence about seeing a first rate rise of 2018 sooner rather than later,\" said Dennis de Jong, managing director at UFX.com in Limassol, Cyprus. \"Dollar bulls will be hoping this latest reading can stop the rot for the currency.\"\nStill, analysts remained skeptical about the dollar's near-term prospects, noting the expected rate hikes have been priced in. Some also said modest U.S. inflation may encourage the Fed to go slower in raising rates.\n\"Gains could be tough to sustain for the dollar, barring a meaningful rise in inflation,\" said Joe Manimbo, senior market analyst, at Western Union Business Solutions in Washington.\nshow chapters How to play a weak dollar in 2018: Pro 5:09 PM ET Thu, 28 Dec 2017 | 01:12 In late morning trading, the dollar bounced 0.27 percent to 92.13 after falling 2.5 percent the last three weeks. The dollar's 10 percent drop in 2017 was the largest annual decline in 14 years.\nFriday's U.S. non-farm payrolls report should provide more clarity about the outlook for interest rates this year. For now though, Timothy Graf, head of macro strategy for EMEA at State Street Global Markets, said there seems to be very little going on with the dollar as the U.S. economy continues to see easy financial conditions with accompanying fiscal stimulus.\nReal interest rates in the U.S. were holding near their lowest in nearly five years, according to Thomson Reuters data.\nThe euro , meanwhile, slid 0.30 percent to $1.2021 after hitting a four-month high of $1.2081 on Tuesday, up roughly 3 percent from a mid-December trough.\nThe single European currency has been supported by improving prospects for the euro zone economy and expectations the European Central Bank will wind down its bond-buying stimulus in 2018.", "external_links": [], "published": "2018-01-03T04:31:00.000+02:00", "crawled": "2018-01-03T14:47:15.009+02:00", "highlightTitle": ""}