{"organizations": [], "uuid": "5a8de3d85e6fdba30b4c894f764083c904fc927d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-jsras-life-sciences-division-appoints-new-ceo-for-mbl-international.html", "country": "US", "domain_rank": 767, "title": "JSR’s Life Sciences Division Appoints New CEO for MBL International", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T23:16:00.000+02:00", "replies_count": 0, "uuid": "5a8de3d85e6fdba30b4c894f764083c904fc927d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-jsras-life-sciences-division-appoints-new-ceo-for-mbl-international.html", "ord_in_thread": 0, "title": "JSR’s Life Sciences Division Appoints New CEO for MBL International", "locations": [], "entities": {"persons": [{"name": "nalini murdter", "sentiment": "none"}, {"name": "murdter", "sentiment": "none"}], "locations": [{"name": "sunnyvale", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "mbl international", "sentiment": "negative"}, {"name": "jsr", "sentiment": "negative"}, {"name": "jsr life sciences", "sentiment": "negative"}, {"name": "life sciences", "sentiment": "negative"}, {"name": "mbli", "sentiment": "none"}, {"name": "crown biosciences", "sentiment": "none"}, {"name": "sr corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SUNNYVALE, Calif.--(BUSINESS WIRE)-- JSR Life Sciences, the life sciences-focused business unit of JSR Corporation, announced today that it has appointed Dr. Nalini Murdter as the President and Chief Executive Officer of MBL International (MBLI) effective immediately.\nThis leadership transition at MBLI comes on the heels of JSR’s recent acquisition of contract research organization, Crown Biosciences in which JSR sees great potential for synergy. Whereas MBLI specializes in detecting and analyzing disease biomarkers and pathways, Crown’s expertise lies in supporting drug discovery, development and translation of potential drug targets into viable treatments. The complementary product portfolios and potential for innovative collaboration between the companies supports JSR’s vision to improve the overall efficiency of drug development and manufacturing.\n“We are at a significant pivot point for MBLI and JSR Life Sciences,” said Murdter. “I am excited to lead the organization into the next growth phase. Over the last year, MBLI has grown its business in the pharma and biotech industry and gained significant adoption of its products with leading researchers in the immuno-oncology field. Together with the greater JSR family of companies, I look forward to expanding our product and services business especially in immuno-oncology, autoimmune and metabolic disease areas.”\nPrior to assuming the role of CEO, Murdter served as Vice President of Commercial Operations and Business Development at MBLI, and Managing Director of the Diagnostics and Research Products Division at JSR. Dr. Murdter brings more than 25 years of experience in the life sciences and clinical diagnostics sectors. She was the Chief Business Officer at NanoString Technologies and held several senior management positions in business development, strategy and marketing at Agilent Technologies. Dr. Murdter was a Senior Research Fellow in The Division of Biology at the California Institute of Technology. She received a Ph.D. in Biochemistry from the University of Maryland, and an M.B.A. from the Haas School of Business at UC Berkeley.\nAbout JSR Life Sciences Division (JLS)\nJSR Corporation conducts its global life sciences business through its JSR Life Sciences Business Division. JSR Life Sciences provides specialized materials, products and services to the academic, clinical and industry sectors, both directly and through its subsidiaries MBL International, Medical & Biological Laboratories Co. Ltd, KBI Biopharma, Inc. and Selexis SA.\nwww.jsrlifesciences.com\nAbout MBL International Corporation (MBLI)\nMBLI is a life sciences company focused on providing high quality, innovative products for life sciences research and clinical diagnostics. MBLI specializes in reagents and assays for detecting biomarkers and analyzing disease pathways. The company has more than 20 years of experience developing research reagents for immunology, cell biology and protein analysis specializing in the fields of immuno-oncology, autoimmune and metabolic diseases. MBLI also provides diagnostic products for autoimmune disease, infectious disease and virology that are used in clinical research laboratories and hospitals.\nwww.mblintl.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006423/en/\nJSR Life Sciences\nMissy Bindseil, 1-830-237-9527\nmbindseil@jsrlifesciences.com\nSource: JSR Life Sciences", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.jsrlifesciences.com&esheet=51747754&newsitemid=20180123006423&lan=en-US&anchor=www.jsrlifesciences.com&index=1&md5=f3f5592eebd81150d1c8399cbddc512e", "http://www.businesswire.com/news/home/20180123006423/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mblintl.com&esheet=51747754&newsitemid=20180123006423&lan=en-US&anchor=www.mblintl.com&index=2&md5=341b15317e3e1f4f779dbb6ccc4fb1ec"], "published": "2018-01-23T23:16:00.000+02:00", "crawled": "2018-01-24T01:56:12.046+02:00", "highlightTitle": ""}