{"organizations": [], "uuid": "57ce7a8b4a5a862abbbcfcbc91c0d07d09faba2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-qlik-announces-new-ceo.html", "country": "US", "domain_rank": 767, "title": "Qlik New CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-11T19:00:00.000+02:00", "replies_count": 0, "uuid": "57ce7a8b4a5a862abbbcfcbc91c0d07d09faba2b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-qlik-announces-new-ceo.html", "ord_in_thread": 0, "title": "Qlik New CEO", "locations": [], "entities": {"persons": [{"name": "mike capone", "sentiment": "negative"}, {"name": "capone", "sentiment": "none"}, {"name": "qlik", "sentiment": "none"}], "locations": [{"name": "pa.", "sentiment": "none"}, {"name": "radnor", "sentiment": "none"}, {"name": "qlik", "sentiment": "none"}], "organizations": [{"name": "medidata solutions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mike Capone Appointed to Accelerate Market Leadership\nRADNOR, Pa.--(BUSINESS WIRE)-- Qlik® , a leader in data analytics, today announced that its board appointed Mike Capone, former COO of Medidata Solutions (NASDAQ:MDSO), as Qlik’s new CEO. Capone brings a valuable combination of customer perspective, operational expertise, and market focus to Qlik. In addition to his extensive experience in high-growth SaaS companies, Capone possesses first-hand experience in leveraging the power of data through analytics to transform businesses and entire industries, giving him the unique background to lead Qlik’s mission to be a leader in the analytics economy.\n“I’ve seen how the smart use of data and analytics can have transformative effects on an industry, and I am excited to join a company that enables customers in every industry to re-think what’s possible,” said Mike Capone, CEO, Qlik. “Data is the currency of the future and companies who harness it best will differentiate and excel. With an ongoing investment in augmented intelligence, big data and the internet of things, coupled with its hybrid-cloud platform approach, Qlik is uniquely positioned to lead this new era.”\nDavid Murphy, Qlik’s interim CEO, will return to his prior role as a board member of Qlik. “I have been fortunate enough to meet with many of Qlik’s customers during my tenure, and have been struck by how many talk about the complete transformation that was enabled through Qlik’s platform,” said Murphy. “I know that Mike truly understands that, and is the person that can take Qlik to the next level of leadership.”\n“We are excited to have Mike join us on this mission to accelerate transformation through modern business intelligence solutions,” said Seth Boro, Qlik board member and a Thoma Bravo managing partner. “We also want to thank David Murphy for his interim leadership at the company, his continued service as a board member, and for acting as a special advisor to Mike in the near term.”\nMost recently, Capone was the COO of Medidata Solutions, a publicly-traded provider of SaaS analytics solutions to the healthcare, life sciences and pharma markets. At Medidata he played a significant role in its product development, data science, professional services and go-to-market operations. Capone was instrumental in accelerating Medidata’s strategy to provide a comprehensive cloud platform that leverages data and analytics to transform clinical trials.\nPrior to Medidata, Capone held multiple senior leadership positions at ADP, one of the world’s largest B2B cloud services providers, delivering critical services to over 600,000 companies and 39 million of their staff members worldwide. These roles included CIO, Corporate Vice President of Product Development and SVP & General Manager of ADP’s global outsourcing business. Capone brings this unique customer perspective to Qlik, along with the expertise in scaling the IT operations of a major cloud business.\nCapone was also very attracted to the deeply rooted culture of Corporate Social Responsibility at Qlik. He is on the board of the New Jersey Chapter of The Leukemia and Lymphoma Society and had previously chaired charitable foundations at both ADP and Medidata.\nAbout Qlik\nQlik® is the leading data analytics platform and the pioneer of user-driven business intelligence. Its portfolio of cloud-based and on-premise solutions meets customers’ growing needs from reporting and self-service visual analysis to guided, embedded and custom analytics, regardless of where data is located. Customers using Qlik Sense®, QlikView® and Qlik® Cloud, gain meaning out of information from multiple sources, exploring the hidden relationships within data that lead to insights that ignite good ideas. Headquartered in Radnor, Pennsylvania, Qlik does business in more than 100 countries with over 45,000 customers globally.\n© 2017 QlikTech International AB. All rights reserved. Qlik®, Qlik Sense®, QlikView®, QlikTech®, Qlik Cloud®, Qlik DataMarket®, Qlik Analytics Platform®, Qlik NPrinting™, Qlik Connectors™, Qlik GeoAnalytics™ and the QlikTech logos are trademarks of QlikTech International AB which have been registered in multiple countries. Other marks and logos mentioned herein are trademarks or registered trademarks of their respective owners.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111005717/en/\nQlik\nMedia:\nMaria Scurry, 617-658-5317\nmaria.scurry@qlik.com\nSource: Qlik", "external_links": ["http://www.businesswire.com/news/home/20180111005717/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.qlik.com&esheet=51741872&newsitemid=20180111005717&lan=en-US&anchor=Qlik%C2%AE&index=1&md5=1c71a88dc3daaac77388c65acc6e4b84"], "published": "2018-01-11T19:00:00.000+02:00", "crawled": "2018-01-11T21:49:00.000+02:00", "highlightTitle": ""}