{"organizations": [], "uuid": "1a31628314acf169a840b1e9c98f01c976dbee05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-preschoolers-education/early-enrichment-programs-may-boost-odds-poor-kids-go-to-college-idUSKBN1FI2RR", "country": "US", "domain_rank": 408, "title": "Early enrichment programs may boost odds poor kids go to college", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:42:00.000+02:00", "replies_count": 0, "uuid": "1a31628314acf169a840b1e9c98f01c976dbee05"}, "author": "", "url": "https://www.reuters.com/article/us-health-preschoolers-education/early-enrichment-programs-may-boost-odds-poor-kids-go-to-college-idUSKBN1FI2RR", "ord_in_thread": 0, "title": "Early enrichment programs may boost odds poor kids go to college", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - Low-income children who receive educational support in school and at home from preschool through third grade may be more likely to get a college degree than their peers who don’t get extra help during their early years, a U.S. study suggests.\nFor the study, researchers examined data on 1,539 minority youth in high-poverty Chicago neighborhoods who were part of a program designed to give kids small classes, engaging instruction that helps them develop self-control and good communication skills, and encourage parent involvement in education. Kids entered the program at age 3 and received help for just preschool or continuing through third grade.\nOverall, kids who went through this program completed more years of education by age 35 than the 550 children at other schools that didn’t offer the program, researchers report in JAMA Pediatrics.\n“We’ve known that early childhood education can impact adult outcomes, high school completion, reduced special education, reduced crime through enhancing school performance and better adjustment, values about education, and positive peer relations,” said senior study author Arthur Reynolds of the Institute of Child Development at the University of Minnesota in Minneapolis.\nWhat the current study adds is fresh evidence from several decades of follow-up that shows early education programs may directly impact college attendance and completion, Reynolds said by email.\nThe program in the study offered kids intensive instruction in math and reading as well as frequent educational field trips. It also encouraged parents to volunteer in classrooms and offered them job training, parenting classes, education and social services.\nThe program got results even when kids only participated during preschool. Among this group, almost 16 percent got an associate’s degree or higher, compared with 11 percent among the kids who didn’t get to participate in the program.\nWhen kids stayed in the program through third grade, the results were even better. Among this group, 19 percent of kids in the program got at least an associate’s degree, compared with 13 percent of the other children.\nWhether kids were in the program through third grade or only in preschool, they were also more likely to get a bachelor’s degree and a master’s degree.\nThe study wasn’t a controlled experiment that randomly assigned some children to participate in the program, and it wasn’t designed to prove whether or how this type of early childhood education program might directly lead to success in higher education.\nEven so, the findings offer fresh evidence that providing more years of early childhood education support may offer them the best odds of lasting academic success, said Seana Gall of the Menzies Institute for Medical Research at the University of Tasmania in Australia.\nThat’s because starting early with pre-school gives kids a chance to learn how school works, get a feel for the structure of the school day, learn to trust teachers and develop friendships, Gall, who wasn’t involved in the study, said by email.\n“Academically, early participation can boost cognitive skills that lay the foundations for learning at school,” Gall said. “Involving families probably created an environment where learning and school were valued, with this having ongoing implications for motivation and success.”\nFrom a practical standpoint, however, early preschool may not be available or affordable, but even a limited amount of preschool can still help, said Alison Cohen, a public health and education researcher at the University of California, Berkeley, who wasn’t involved in the study.\n“It is also likely that any preschool is better than no preschool in preparing children for elementary school and beyond,” Cohen said by email. “In addition to taking action for their own children, parents can also advocate for policy changes to scale up affordable, high-quality preschool options for all families in their area.”\nSOURCE: bit.ly/2DP5pXp JAMA Pediatrics, online January 29, 2018.\n ", "external_links": [], "published": "2018-01-30T00:42:00.000+02:00", "crawled": "2018-01-30T01:03:55.000+02:00", "highlightTitle": ""}