{"organizations": [], "uuid": "cd5be3ea9cee10ab9c52c7265d6bfe6b5b630085", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-ppg-to-acquire-architectural-paint-and-coatings-wholesaler-procoatings.html", "country": "US", "domain_rank": 767, "title": "PPG to Acquire Architectural Paint and Coatings Wholesaler ProCoatings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-03T00:32:00.000+02:00", "replies_count": 0, "uuid": "cd5be3ea9cee10ab9c52c7265d6bfe6b5b630085"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-ppg-to-acquire-architectural-paint-and-coatings-wholesaler-procoatings.html", "ord_in_thread": 0, "title": "PPG to Acquire Architectural Paint and Coatings Wholesaler ProCoatings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH--(BUSINESS WIRE)-- PPG (NYSE:PPG) today announced that it has reached a definitive agreement to acquire ProCoatings, a leading architectural paint and coatings wholesaler located in The Netherlands. PPG expects the transaction to close in the first quarter 2018, subject to customary closing conditions. Financial terms of the transaction were not disclosed.\nProCoatings, established in 2001, distributes a large portfolio of well-known professional paint brands through its network of 23 multi-brand stores. The company employs nearly 100 people.\n“ProCoatings is a well-managed business, providing excellent customer service to a diverse portfolio of customers in the west and north of The Netherlands,” said Jean-Marie Greindl, PPG senior vice president, global architectural coatings, and president, PPG Europe, Middle East and Africa (EMEA). “This acquisition will provide our business with even greater opportunities to support our customers and strengthen our presence in this important market.”\nPPG’S PRESENCE IN THE NETHERLANDS\nPPG is a leading global supplier of paints, coatings and specialty materials and has a deep commitment and a long history in The Netherlands, dating back nearly 300 years. Today, PPG employs nearly 1,000 people in The Netherlands and operates facilities in Tiel, Delfzijl, Amsterdam, Uithoorn, and Den Bosch.\nThrough PPG’s COLORFUL COMMUNITIES™ initiative, which transforms community spaces by providing PPG volunteers and donated PPG products, the company recently helped revitalize the facilities of the Royal Dutch Guide Dog Foundation in Amstelveen, Netherlands and the Amsta Karaad residential care facility in Amsterdam. PPG also has been a significant financial contributor to the NEMO Science Center in Amsterdam, and the company matches employee charitable contributions in The Netherlands and across Europe in addition to our North American operations.\nPPG: WE PROTECT AND BEAUTIFY THE WORLD™\nAt PPG (NYSE:PPG), we work every day to develop and deliver the paints, coatings and materials that our customers have trusted for more than 130 years. Through dedication and creativity, we solve our customers’ biggest challenges, collaborating closely to find the right path forward. With headquarters in Pittsburgh, we operate and innovate in more than 70 countries and reported net sales of $14.3 billion in 2016. We serve customers in construction, consumer products, industrial and transportation markets and aftermarkets. To learn more, visit www.ppg.com .\nForward-Looking Statements\nStatements in this news release relating to matters that are not historical facts are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 reflecting the company’s current view with respect to future events or objectives and financial or operational performance or results. The forward-looking statements contained herein include statements relating to the timing of and expected benefits of the ProCoatings transaction. Actual events may differ materially from current expectations and are subject to a number of risks and uncertainties, including the satisfaction of the conditions of the transaction and other risks related to completion of the transaction and actions related thereto, the parties’ ability to complete the transaction on the anticipated terms and schedule, including the ability to obtain regulatory approvals, PPG’s ability to achieve the expected benefits of the transaction and the other risks and uncertainties discussed in PPG’s periodic reports on Form 10-K and Form 10-Q and its current reports on Form 8-K filed with the Securities and Exchange Commission. Forward-looking statements speak only as of the date of their initial issuance, and PPG Industries does not undertake any obligation to update or revise publicly any forward-looking statement, whether as a result of new information, future events or otherwise.\nWe protect and beautify the world is a trademark and the PPG Logo is a registered trademark of PPG Industries Ohio, Inc.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005866/en/\nPPG Media Contacts:\nMark Silvey, +1-412-434-3046\nCorporate Communications\nsilvey@ppg.com\nor\nKen Armistead, +44 1924 354848\nEMEA Corporate Communications\nEMEACommunications@ppg.com\nor\nPPG Investor Contact:\nJohn Bruno, +1-412-434-3466\nInvestor Relations\njbruno@ppg.com\ninvestor.ppg.com\nSource: PPG", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ppg.com%2F&esheet=51734906&newsitemid=20180102005866&lan=en-US&anchor=www.ppg.com&index=1&md5=b0e7c95c9cec2137995f2066d1aeb4cb", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.ppg.com&esheet=51734906&lan=en-US&anchor=investor.ppg.com&index=2&md5=09c371d9d1b09d16189b4f54510cf231", "http://www.businesswire.com/news/home/20180102005866/en/"], "published": "2018-01-03T00:32:00.000+02:00", "crawled": "2018-01-03T02:09:04.000+02:00", "highlightTitle": ""}