{"organizations": [], "uuid": "923977260f3a65dc0e1e6ef88fb0c22d75a5b1fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-futures-flat-caterpillar-set-for-a-record-open-idUSL4N1P33H9", "country": "US", "domain_rank": 408, "title": "US STOCKS-Futures flat; Caterpillar set for a record open", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:45:00.000+02:00", "replies_count": 0, "uuid": "923977260f3a65dc0e1e6ef88fb0c22d75a5b1fc"}, "author": "", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-futures-flat-caterpillar-set-for-a-record-open-idUSL4N1P33H9", "ord_in_thread": 0, "title": "US STOCKS-Futures flat; Caterpillar set for a record open", "locations": [], "entities": {"persons": [{"name": "sruthi shankar  jan", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "caterpillar", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 12:45 PM / Updated an hour ago US STOCKS-Futures flat; Caterpillar set for a record open Reuters Staff \n* Futures: Dow up 3 pts, S&P off 2.25 pts, Nasdaq down 6.5 pts \nBy Sruthi Shankar \nJan 8 (Reuters) - U.S. stock futures pointed to a flat open for Wall Street on Monday, with gains in heavyweights Caterpillar and Amazon due to favorable broker recommendations offset by losses for banking stocks. \nLast week, Wall Street recorded its best start to a year in more than a decade, continuing its gains from 2017 and drawing encouragement from a lukewarm December jobs data that suggested the Federal Reserve would not be aggressive in raising interest rates in 2018. \nThe Dow gained 2.3 percent last week, the S&P 500 2.6 percent and the Nasdaq 3.4 percent. \nAt 7:22 a.m. ET (1222 GMT), Dow e-minis were up 3 points, or 0.01 percent, with 23,003 contracts changing hands. \nS&P 500 e-minis were down 2.25 points, or 0.08 percent, with 107,023 contracts traded. \nNasdaq 100 e-minis were down 6.5 points, or 0.1 percent, on volume of 20,407 contracts. \nInvestors are waiting for earnings reports to see how much companies would benefit from the recent tax cuts. The fourth quarter earnings season will kick off later this week, starting with big banks. \nAmong the early gainers were the shares of Caterpillar which climbed 1.35 percent and was set for a record open after JP Morgan upgraded the stock, saying the tax overhaul could help construction business cycle to extend into 2018. \nAmazon edged up 0.3 percent after Credit Suisse analysts hiked price target on the retailer’s stock by $25 to $1,410. \nBank of America, Goldman Sachs, JPMorgan and Wells Fargo were down between 0.13 percent and 0.40 percent. Most big U.S. lenders have estimated one-off charges to their fourth quarter earnings on account of tax cuts. \nNvidia rose 2.47 percent after the graphics chipmaker announced partnership with Uber and Volkswagen as its artificial intelligence platforms expand into technology for self-driving cars. \nCelgene gained 1.5 percent after the drugmaker agreed to acquire Impact Biomedicines for as much as $7 billion. \nPandora Media slipped about 3 percent after Morgan Stanley downgraded its stock to “equal-weight” on concerns about slowing advertising revenue in 2018. Investors will focus on speeches from Fed’s Atlanta President Raphael Bostic, San Francisco Fed chief John Williams and their Boston counterpart Eric Rosengren for their views on monetary policy. (Reporting by Sruthi Shankar in Bengaluru; Editing by Arun Koyyur)", "external_links": [], "published": "2018-01-08T14:45:00.000+02:00", "crawled": "2018-01-08T16:13:04.006+02:00", "highlightTitle": ""}