{"organizations": [], "uuid": "9300600cc6092ef61849bd8ff34814978e89dfa8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-turkey-security-journalists-lawyer/lawyer-for-jailed-journalist-says-turkey-faces-constitutional-crisis-idUSKBN1F424F", "country": "US", "domain_rank": 408, "title": "Lawyer for jailed journalist says Turkey faces 'constitutional crisis'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T00:22:00.000+02:00", "replies_count": 0, "uuid": "9300600cc6092ef61849bd8ff34814978e89dfa8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-turkey-security-journalists-lawyer/lawyer-for-jailed-journalist-says-turkey-faces-constitutional-crisis-idUSKBN1F424F", "ord_in_thread": 0, "title": "Lawyer for jailed journalist says Turkey faces 'constitutional crisis'", "locations": [], "entities": {"persons": [{"name": "altan", "sentiment": "none"}, {"name": "tayyip erdogan", "sentiment": "none"}, {"name": "sahin alpay", "sentiment": "none"}, {"name": "mehmet altan", "sentiment": "none"}, {"name": "orhan kemal cengiz", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "istanbul", "sentiment": "none"}, {"name": "alpay", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "constitutional court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISTANBUL (Reuters) - Turkey’s failure to free a journalist accused of links to a failed coup against President Tayyip Erdogan, flouting an order by the highest court, pitches the country into a constitutional crisis, a lawyer for the journalist said on Monday.\nTurkey’s Constitutional Court ruled last week that two jailed journalists, Mehmet Altan and Sahin Alpay, be released after more than a year in jail. But hours later, local penal courts moved to keep the two in detention.\nThe government says the Constitutional Court, Turkey’s highest, overstepped its limit and was acting like a “super appeals court”. The conflict is likely to deepen concern about judicial independence and press freedom that have suffered in a crackdown that has seen over 50,000 people remanded in custody.\n“This is a crisis of constitutional order in Turkey,” Altan’s lawyer, Orhan Kemal Cengiz, told Reuters.\n“There is no evidence in the court file proving that Altan and (Alpay) were indeed members of any terrorist organization....When the Constitutional Court says conditions for arrest are not met, the lower court has to release the suspects.”\nFollowing the lower courts’ decision, Altan’s legal team appealed to another penal court, which has since also ruled against the Constitution Court’s decision.\nTurkey’s Western allies, particularly in Europe, have voiced concern Erdogan is using the coup as a pretext to stifle opposition to his 15-year-long rule.\nTERRORIST ALLEGATIONS Altan and Alpay were accused of links to terrorist groups and attempting to overthrow the government in a July 2016 coup that killed more than 240 people. They deny the charges.\nAuthorities have shut about 130 media outlets since the failed coup. The Turkish Journalists’ Association says about 160 journalists are in jail, most held since the putsch.\nThe former head of the Istanbul bar has said the case shows that “not a trace of justice” remains in Turkey. Ankara says its sweeping measures are necessary, given the extent of the security threat it faces.\nTurkey’s Western allies, particularly in Europe, have voiced concern Erdogan is using the coup as a pretext to stifle dissent.\nCengiz said he would take the case to the European Court of Human Rights if Altan were not released soon.\nHe called the judiciary’s failure to act on the Constitutional Court’s ruling a “particularly concerning” violation of both the Turkey’s constitution and the European Convention on Human Rights, of which Turkey is a signatory.\nWriting by David Dolan\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T00:22:00.000+02:00", "crawled": "2018-01-16T13:15:31.048+02:00", "highlightTitle": ""}