{"organizations": [], "uuid": "04f5aef7eea8eafcded51c91e055f4e21f5e1f0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219576851&w=1200&r=LYNXMPEE040LH", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-weather/u-s-northeast-digs-out-of-blizzard-as-brutal-cold-bears-down-idINKBN1EU10F", "country": "US", "domain_rank": 408, "title": "U.S. Northeast digs out of blizzard as brutal cold bears down", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T13:20:00.000+02:00", "replies_count": 0, "uuid": "04f5aef7eea8eafcded51c91e055f4e21f5e1f0a"}, "author": "", "url": "https://in.reuters.com/article/usa-weather/u-s-northeast-digs-out-of-blizzard-as-brutal-cold-bears-down-idINKBN1EU10F", "ord_in_thread": 0, "title": "U.S. Northeast digs out of blizzard as brutal cold bears down", "locations": [], "entities": {"persons": [{"name": "scott malone", "sentiment": "none"}, {"name": "jonathan allen", "sentiment": "none"}, {"name": "grayson", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "baltimore", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "east", "sentiment": "none"}], "organizations": [{"name": "u.s. northeast", "sentiment": "negative"}, {"name": "national weather service", "sentiment": "none"}, {"name": "min read  boston/new york", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON/NEW YORK (Reuters) - Street crews dug out snow-clogged roads across the U.S. Northeast on Friday after a powerful blizzard, with temperatures set to plunge further during a brutal cold spell that has already killed at least 18 people.\nFrom Baltimore to Caribou, Maine, workers battled to clear snow and ice as wind chills were forecast to fall as low as minus 40 degrees Fahrenheit (minus 40 degrees Celsius) in some areas after sundown, according to the National Weather Service.\nIn the latest fatality blamed on the harsh conditions, a driver slid off an icy road, killing a pedestrian, early on Friday in North Charleston, South Carolina, city officials said.\n“THE DANGERS ARE REAL,” the officials warned in a Twitter message. “Huge patches of ice all over the city. Stay at home.”\nThe fierce cold will reach from New England to the Midwest and down to the Carolinas, forecasters warned, adding that low-temperature records could be broken across the region over the coming days.\nIn much of New England on Friday, the highs reached only into the single digits or teens Fahrenheit, with intense wind chills, said Dan Pydynowski, a meteorologist with private forecasting service AccuWeather.\n“It can be very dangerous,” Pydynowski said. “Any kind of exposed skin can freeze in a couple of minutes.” Wind chill describes the combined effect of wind and low temperatures on bare skin.\nThere were noticeably fewer tourists on Friday afternoon in New York City’s Times Square, which is usually thronged with visitors from countries around the world.\nArjun Shah, a 22-year-old Briton, studies in Indiana but had never visited the U.S. East Coast before. He flew in to New York City, where temperatures have been below freezing since Christmas Day, just 24 hours before the blizzard whipped in.\n“Oh it’s so bad! It’s not this bad in London,” Shah said, shivering while taking a break from snapping photos of the square. “It’s my first time experiencing minus 10 degrees C.” (14F).\nA man is pictured though a window during snow storm Grayson in New York City, New York, U.S., January 4, 2018. REUTERS/Mike Segar MULTIPLE FATALITIES The storm that swept in on Thursday with gusts of more than 70 miles per hour (113 km per hour), dumped a foot (30 cm) or more of snow throughout the region, including Boston and parts of New Jersey and Maine, before ending early Friday.\nThe harsh conditions were powered by a rapid plunge in barometric pressure that some weather forecasters called a bombogenesis, or a “bomb cyclone.”\nThe weather has been blamed for at least 18 deaths in the past few days, including four in North Carolina traffic accidents and three in Texas.\nSlideshow (3 Images) The frigid spell also had some unusual effects: Shocked iguanas fell out of trees in Florida, while wildlife officials in the state said they had rescued more than 200 cold-stunned sea turtles from freezing waters.\nChildren in Boston and Baltimore enjoyed a second day of cancelled classes, while New York schools stayed open. Schools in Newark, New Jersey, opened two hours later than normal.\nCommuters riding the railways serving New York and Boston’s suburbs endured extensive delays as crews worked to repair frozen equipment and clear snow-covered tracks.\nThursday’s storm caused a 3-foot (0.9-metre) tidal surge that flooded the area around Boston’s historic Long Wharf with icy seawater. Firefighters used an inflatable raft to rescue one motorist from a partially submerged car, authorities said.\nCommunities outside Boston, including Scituate, also experienced extensive flooding.\nNew York’s John F. Kennedy International and LaGuardia airports resumed flights on Friday after closing during whiteout conditions the day before. More than 1,300 U.S. flights were cancelled by Friday afternoon, most of them at the New York area’s three major airports and Boston Logan International Airport.\nNearly 500 members of the National Guard were activated to assist with the emergency response along the East Coast, including 200 in New York state, authorities said.\nAdditonal reporting by Brendan O'Brien in Milwaukee, Jonathan Allen and Scott DiSavino in New York, and Colleen Jenkins in Winston-Salem, North Carolina; Editing by Bill Trott and Jonathan Oatis\n ", "external_links": [], "published": "2018-01-05T13:20:00.000+02:00", "crawled": "2018-01-05T13:59:32.025+02:00", "highlightTitle": ""}