{"organizations": [], "uuid": "bdf9ecb71d443936df1eb5f35c7f363d04b175b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-territorial-bancorp-inc-declares-dividend.html", "country": "US", "domain_rank": 767, "title": "Territorial Bancorp Inc. Declares Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:40:00.000+02:00", "replies_count": 0, "uuid": "bdf9ecb71d443936df1eb5f35c7f363d04b175b4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-territorial-bancorp-inc-declares-dividend.html", "ord_in_thread": 0, "title": "Territorial Bancorp Inc. Declares Dividend", "locations": [], "entities": {"persons": [{"name": "allan kitagawa", "sentiment": "none"}], "locations": [{"name": "honolulu", "sentiment": "none"}, {"name": "honolulu", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}], "organizations": [{"name": "territorial bancorp inc", "sentiment": "negative"}, {"name": "territorial bancorp inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "the company", "sentiment": "none"}, {"name": "territorial savings bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONOLULU, Jan. 25, 2018 (GLOBE NEWSWIRE) -- Territorial Bancorp Inc. (NASDAQ:TBNK) (the “Company”), headquartered in Honolulu, Hawaii, the holding company parent of Territorial Savings Bank, announces that its Board of Directors approved a quarterly cash dividend of $0.20 per share. The dividend is expected to be paid on February 22, 2018 to stockholders of record as of February 8, 2018.\nAllan Kitagawa, Chairman and Chief Executive Officer, said, “The Company continues to perform well despite the increase in income tax expense that occurred in the fourth quarter due to changes in federal tax law. Hawaii’s economy, especially the visitor industry, continues to improve. The growth in Hawaii’s economy has allowed us to increase the size of our loan portfolio and total deposits, which in turn, has increased our net interest income. Along with this growth, the Company’s strong performance has resulted in our total assets exceeding $2 billion.”\nForward-looking statements - This press release contains forward-looking statements, which can be identified by the use of words such as “estimate,” “project,” “believe,” “intend,” “anticipate,” “plan,” “seek,” “expect,” “will,” “may” and words of similar meaning. These forward-looking statements include, but are not limited to:\n• statements of our goals, intentions and expectations;\n• statements regarding our business plans, prospects, growth and operating strategies;\n• statements regarding the asset quality of our loan and investment portfolios; and\n• estimates of our risks and future costs and benefits.\nThese forward-looking statements are based on our current beliefs and expectations and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are beyond our control. In addition, these forward-looking statements are subject to assumptions with respect to future business strategies and decisions that are subject to change. We are under no duty to and do not take any obligation to update any forward-looking statements after the date of this release.\nThe following factors, among others, could cause actual results to differ materially from the anticipated results or other expectations expressed in the forward-looking statements:\n• general economic conditions, either nationally, internationally or in our market areas, that are worse than expected;\n• competition among depository and other financial institutions;\n• inflation and changes in the interest rate environment that reduce our margins or reduce the fair value of financial instruments;\n• adverse changes in the securities markets;\n• changes in laws or government regulations or policies affecting financial institutions, including changes in regulatory fees and capital requirements;\n• our ability to enter new markets successfully and capitalize on growth opportunities;\n• our ability to successfully integrate acquired entities, if any;\n• changes in consumer spending, borrowing and savings habits;\n• changes in accounting policies and practices, as may be adopted by the bank regulatory agencies, the Financial Accounting Standards Board, the Securities and Exchange Commission and the Public Company Accounting Oversight Board;\n• changes in our organization, compensation and benefit plans;\n• changes in our financial condition or results of operations that reduce capital available to pay dividends; and\n• changes in the financial condition or future prospects of issuers of securities that we own.\nBecause of these and a wide variety of other uncertainties, our actual future results may be materially different from the results indicated by these forward-looking statements.\nContact: Walter Ida (808) 946-1400\nSource:Territorial Bancorp Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/13018f33-52c3-4b8b-8246-83085977ce98"], "published": "2018-01-26T00:40:00.000+02:00", "crawled": "2018-01-26T01:38:35.000+02:00", "highlightTitle": ""}