{"organizations": [], "uuid": "a910cca8f254b4192a03e6e4c002ef738909ea86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-emergent-biosolutions-announces-preliminary-2017-financial-results-and-provides-2018-financial-outlook.html", "country": "US", "domain_rank": 767, "title": "Emergent BioSolutions Announces Preliminary 2017 Financial Results and Provides 2018 Financial Outlook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-08T14:30:00.000+02:00", "replies_count": 0, "uuid": "a910cca8f254b4192a03e6e4c002ef738909ea86"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-emergent-biosolutions-announces-preliminary-2017-financial-results-and-provides-2018-financial-outlook.html", "ord_in_thread": 0, "title": "Emergent BioSolutions Announces Preliminary 2017 Financial Results and Provides 2018 Financial Outlook", "locations": [], "entities": {"persons": [{"name": "daniel j. abdun-nabi", "sentiment": "none"}], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "gaithersburg", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "biosolutions inc.", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GAITHERSBURG, Md., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Emergent BioSolutions Inc. (NYSE:EBS) today announced preliminary unaudited 2017 financial results and guidance for 2018.\nDaniel J. Abdun-Nabi, president and chief executive officer of Emergent BioSolutions, said, “Our exceptional financial and operational performance in 2017 builds upon Emergent’s history of growth and innovation, and demonstrates our ability to execute on a focused strategy that leverages our proven core competencies. We are excited about this momentum as we enter 2018, our 20th year in business, well-positioned for continued growth in pursuit of our 2020 growth plan goals.”\nPRELIMINARY FULL YEAR 2017 FINANCIAL RESULTS (Unaudited)\n(in millions) PRELIMINARY\n(As of 1/8/2018) Previous Guidance\n(As of 11/2/2017) Total Revenues $555 to $560 $540 to $560 BioThrax ® ~$286 $280 to $290 Pre-Tax Income $113 to $117 NA Net Income (1) $80 to $84 $70 to $80 Adjusted Net Income (1) (2) $92 to $96 $85 to $95 EBITDA (2) $160 to $164 $150 to $160 Cash ~$180 NA (1) Reflects an estimated effective tax rate that includes the expected effects of the United States Tax Cuts and Jobs Act of 2017 on the company’s 2017 income tax provision.\n(2) See “Reconciliation of Net Income to Adjusted Net Income and EBITDA” for a definition of terms and a reconciliation table.\nTotal Revenue\nFor the full year 2017, the company anticipates total revenue of $555 to $560 million, the midpoint of which represents a $69 million or 14% increase from 2016. This increase is due primarily to higher BioThrax ® (Anthrax Vaccine Adsorbed) sales of approximately $286 million versus $237 million in 2016, as well as higher Other Product sales and CMO revenue, offset by lower Contract & Grant revenue.\nNet Income (GAAP and Adjusted)\nFor the full year 2017, the company anticipates net income of $80 to $84 million, the midpoint of which represents a $20 million or 32% increase from 2016. Full year 2017 adjusted net income is anticipated to be $92 to $96 million, the midpoint of which represents a $17 million or 22% increase from 2016 (see “Reconciliation of Net Income to Adjusted Net Income and EBITDA” for a definition of terms and a reconciliation table). The year-over-year increase reflects the impact of higher product sales and CMO services revenue, lower R&D and SG&A costs, and the positive impact of a lower estimated effective tax rate due largely to the absence in 2017 of certain 2016 items attributable to the August 2016 spin-off of Aptevo Therapeutics that negatively impacted the 2016 tax provision.\nCash and Cash Equivalents\nFor the full year 2017, the company anticipates cash and cash equivalents at year end of approximately $180 million, reflecting the impact of the following that occurred during the fourth quarter of 2017:\nthe closing of the acquisitions of ACAM2000 ® , (Smallpox (Vaccinia) Vaccine, Live) and raxibacumab; and the purchase of shares of the company’s common equity pursuant to the company’s share buyback program.\nNote\nThe preliminary 2017 financial results are subject to revision and will be finalized upon completion of the company’s external audit, which is anticipated in late February 2018. Once the external audit is completed, the company may report financial results that could differ, and the differences could be material.\n2018 FINANCIAL OUTLOOK\n(in millions) Full Year 2018\n(Forecast as of 1/8/2018) Total Revenues $715 to $755 Pre-Tax Income $120 to $140 Net Income (1) $95 to $110 Adjusted Net Income (1) (2) $110 to $125 EBITDA (2) $175 to $190 (1) Reflects an estimated effective tax rate that includes the expected effects of the United States Tax Cuts and Jobs Act of 2017 on the company’s 2018 income tax provision.\n(2) See “Reconciliation of Net Income to Adjusted Net Income and EBITDA” for a definition of terms and a reconciliation table.\nFor the full year of 2018, the company outlook includes the impact of the following items:\ncontinued deliveries of BioThrax to the Strategic National Stockpile (SNS) under our follow-on procurement contract with the Centers for Disease Control and Prevention (CDC); deliveries of ACAM2000 to the SNS under the CDC procurement contract; deliveries of raxibacumab to the SNS under the procurement contract with the Biomedical Advanced Research and Development Authority (BARDA); domestic and international sales of the other medical countermeasures that comprise Other Product sales; continued expansion of our CMO services business unit; increased Contract & Grant revenue due to anticipated increased work related to development projects funded by the U.S. government; increased investment in discretionary, development projects funded by the company targeting opportunities in medical countermeasures for emerging infectious diseases; and anticipated reduced tax rate resulting from revisions to U.S. corporate tax laws.\nThe outlook for 2018 does not include estimates for potential new corporate development or other M&A transactions.\nQ1 2018\nFor the first quarter of 2018, the company anticipates total revenues of $145 to $160 million.\nRECONCILIATION OF NET INCOME TO ADJUSTED NET INCOME AND EBITDA\nThis press release contains two financial measures (Adjusted Net Income and EBITDA (Earnings Before Interest, Taxes, Depreciation and Amortization)) that are considered “non-GAAP” financial measures under applicable Securities and Exchange Commission rules and regulations. These non-GAAP financial measures should be considered supplemental to and not a substitute for financial information prepared in accordance with generally accepted accounting principles. The company’s definition of these non-GAAP measures may differ from similarly titled measures used by others. Adjusted Net Income adjusts for specified items that can be highly variable or difficult to predict, or reflect the non-cash impact of charges resulting from purchase accounting. EBITDA reflects net income excluding the impact of depreciation, amortization, interest expense and provision for income taxes. The company views these non-GAAP financial measures as a means to facilitate management’s financial and operational decision-making, including evaluation of the company’s historical operating results and comparison to competitors’ operating results. These non-GAAP financial measures reflect an additional way of viewing aspects of the company’s operations that, when viewed with GAAP results and the reconciliations to the corresponding GAAP financial measure, may provide a more complete understanding of factors and trends affecting the company’s business.\nThe determination of the amounts that are excluded from these non-GAAP financial measures are a matter of management judgment and depend upon, among other factors, the nature of the underlying expense or income amounts. Because non-GAAP financial measures exclude the effect of items that will increase or decrease the company’s reported results of operations, management strongly encourages investors to review the company’s consolidated financial statements and publicly filed reports in their entirety.\nReconciliation of Net Income to Adjusted Net Income\n($ ", "external_links": ["https://www.globenewswire.com/Tracker?data=wksZl0OKf5Qn3MFxd08BnLW8joQwUEHTL_S9ufzAgzjGFx01qud1gZ-IOxQjQyD4UH9kuQT0NnOzrujYcM2godF6Jw7p76fR9ol5gNN-TBPAihKnT1FYaQ5-Wapfo6ei", "https://www.globenewswire.com/Tracker?data=XP12j_h_IHzLEwaZarbgQ3I3Ykh998jgklPJtbJrFhOLucw-zJRebrrEvhpcoxtbwhjglsCWHvduGpp-r_JlKQ==", "https://www.globenewswire.com/Tracker?data=LxOzTY3spxkhNqEbII25wdrm3_eLj6Cz5ZMe_8mXqunaS1c8C5cDIIeN3oG0x_Vkaoj04PR0ChMp5NgvZljqCw==", "https://www.globenewswire.com/Tracker?data=wksZl0OKf5Qn3MFxd08BnLW8joQwUEHTL_S9ufzAgzhVsVGApSHfURJBleftqazU-kIOX4OSC4gSPgnuRhSTH1xZzrVh_ySTRl65CkYyLHKatTjqQqzsB-Y0ohd-52lY", "https://www.globenewswire.com/Tracker?data=__KwvhLSv6CSudzDAPWV-BSQZH62YWEjI_PcB9G9pUuSxk0LcUwlsO9iru-vyV3fEKPumJ80XdJEgzf6GmbDA9EKjl_1wMzPUgV0OxIQWYBnrD6GOui22gVHIft30d9O_TPs1maumrrPnuN6gr6StZRjAHNaZtB1wsJvFlIzAdk=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/5ec8a83c-1f63-4b2b-a68f-68e837b539a9"], "published": "2018-01-08T14:30:00.000+02:00", "crawled": "2018-01-08T15:30:15.015+02:00", "highlightTitle": ""}