{"organizations": [], "uuid": "f14dbff0febbd97b2adcc88cd5b0a8a226cf1a91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-genesco-reports-comparable-sales.html", "country": "US", "domain_rank": 767, "title": "Genesco Reports Comparable Sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:50:00.000+02:00", "replies_count": 0, "uuid": "f14dbff0febbd97b2adcc88cd5b0a8a226cf1a91"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-genesco-reports-comparable-sales.html", "ord_in_thread": 0, "title": "Genesco Reports Comparable Sales", "locations": [], "entities": {"persons": [{"name": "robert j. dennis", "sentiment": "none"}], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}], "organizations": [{"name": "genesco", "sentiment": "negative"}, {"name": "genesco inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "lids sports group", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "journeys group", "sentiment": "none"}, {"name": "johnston & murphy group", "sentiment": "none"}, {"name": "schuh group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NASHVILLE, Tenn., Jan. 8, 2018 /PRNewswire/ -- Genesco Inc. (NYSE: GCO) announced today that comparable sales, including both stores and direct sales, increased 1% for the quarter-to-date period ended January 4, 2018. Same store sales decreased 2% and sales for the Company's e-commerce businesses increased 17% on a comparable basis for that period. Comparable sales changes for each retail segment for the period were as follows:\nQuarter-to-Date (January 4, 2018)\nComparable Sales\n(Stores and Direct)\nJourneys Group\n10%\nSchuh Group\n1%\nLids Sports Group\n-14%\nJohnston & Murphy Group\n5%\nThe Company also announced that it continues to expect adjusted earnings per diluted share for the fiscal year ending February 3, 2018, in the range of $3.05 to $3.35.\nRobert J. Dennis, Chairman, President and Chief Executive Officer of Genesco, said, \"Our fourth quarter results to date continue to be the tale of two businesses. After a successful back-to-school season, Journeys' momentum built during the holidays, while Lids' challenges expanded. We also experienced a promotionally-driven holiday in the U.K. at Schuh. We still anticipate that comparable sales for the quarter will be flat to 1%, but we also expect to give up more gross margin in order to achieve those sales and end the year in an optimal inventory position. Based on quarter-to-date results and current trends, we expect adjusted earnings per share within our most recently announced guidance range for fiscal 2018, with greater confidence toward the lower end of that range.\"\nThe Company's adjusted earnings per share expectations for Fiscal 2018 do not include the non-cash goodwill impairment charge, fixed asset impairments and other charges, estimated in the range of $186.3 million to $187.4 million pretax, or $8.27 to $8.31 per share after tax, for the full fiscal year. They also do not include certain tax effects related to equity grants pursuant to the newly effective ASU 2016-09, estimated at $0.11 per share after tax. This does not include the impact of the recently enacted federal tax reform, which the Company expects will result in a fiscal year tax rate that is approximately 1% lower than previously announced. In addition, earnings do not include one-time charges related to tax reform. A reconciliation of the adjusted financial measures cited in the guidance to their corresponding measures as reported pursuant to U.S. Generally Accepted Accounting Principles is included in Schedule A to this press release.\nGenesco plans to announce its fourth quarter and fiscal year 2018 results on March 15, 2018.\nGenesco to Present at the 2018 ICR XChange Conference\nGenesco also announced that management will present at the 2018 ICR Conference on Tuesday, January 9, 2018, at 9:00 a.m. (Eastern Time). The audio portion of the presentation will be webcast live and may be accessed through the Company's internet website, http://www.genesco.com . To listen, please go to the website at least 15 minutes early to register, download and install any necessary software.\nCautionary Note Concerning Forward-Looking Statements\nThis release contains forward-looking statements, including those regarding the performance outlook for the Company and its individual businesses (including, without limitation, sales, expenses, margins, growth and earnings) and all other statements not addressing solely historical facts or present conditions. Actual results could vary materially from the expectations reflected in these statements. A number of factors could cause differences. These include adjustments to estimates and projections reflected in forward-looking statements, including the level and timing of promotional activity necessary to maintain inventories at appropriate levels; the timing and amount of non-cash asset impairments related to retail store fixed assets and intangible assets of acquired businesses; the effectiveness of the Company's omnichannel initiatives; costs associated with changes in minimum wage and overtime requirements; the effects of tax reform legislation on the Company's effective tax rate, including the potential for a significant, one-time, non-cash charge to adjust the Company's deferred tax asset; the level of chargebacks from credit card users for fraudulent purchases or other reasons; weakness in the consumer economy and retail industry; effects on local consumer demand or on the national economy related to hurricanes or natural disasters; competition in the Company's markets, including online and including competition from some of the Company's vendors in both the licensed sports and branded footwear markets; fashion trends that affect the sales or product margins of the Company's retail product offerings as well as the lack of new fashion trends that might drive business, and the Company's ability to respond to fashion shifts quickly and effectively; weakness in shopping mall traffic and challenges to the viability of malls where the Company operates stores, including weakness related to planned closings of anchor, and department and other stores and other factors, and the extent and pace of growth of online shopping; risks related to the potential for terrorist events, especially in malls and shopping districts; the imposition of tariffs on imported products; changes in buying patterns by significant wholesale customers; bankruptcies or deterioration in financial condition of significant wholesale customers or the inability of wholesale customers or consumers to obtain credit; the Company's ability to obtain from suppliers products that are in-demand on a timely basis and disruptions in product supply or distribution; unfavorable trends in fuel costs, foreign exchange rates, foreign labor and material costs, and other factors affecting the cost of products; the effects of the British decision to exit the European Union, including potential effects on consumer demand, currency exchange rates, and the supply chain; the Company's ability to continue to complete and integrate acquisitions, expand its business and diversify its product base; changes in the timing of holidays or in the onset of seasonal weather affecting period-to-period sales comparisons; the performance of athletic teams, interest in athletic teams and leagues, and the participants in major sporting events such as the Super Bowl and World Series, developments with respect to certain individual athletes, changes in partnerships between professional and collegiate sports organizations and the vendors that provide their uniforms and merchandise at retail, and other sports-related events or changes, including the timing of major sporting events, that may affect the Company's Lids Sports Group retail businesses, including period-to-period comparisons. Additional factors that could affect the Company's prospects and cause differences from expectations include the ability to build, open, staff and support additional retail stores and to renew leases in existing stores and control occupancy costs, and to conduct required remodeling or refurbishment on schedule and at expected expense levels; deterioration in the performance of individual busines", "external_links": ["http://www.journeyskidz.com/", "http://www.lids.com/", "http://www.schuh.co.uk/", "http://www.lidsclubhouse.com/", "http://www.lidslockerroom.com/", "http://www.genesco.com/", "http://www.dockersshoes.com/", "http://www.shibyjourneys.com/", "http://www.johnstonmurphy.com/", "http://www.journeys.com/", "http://www.littleburgundyshoes.com/", "http://www.trask.com/", "http://www.journeys.ca/", "http://www.prnewswire.com/news-releases/genesco-reports-comparable-sales-300578900.html", "http://www.lids.ca/"], "published": "2018-01-08T14:50:00.000+02:00", "crawled": "2018-01-08T15:34:04.001+02:00", "highlightTitle": ""}