{"organizations": [], "uuid": "2aaaa23d6c063a30263a7434e16ccac69c28cbdd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220835641&w=1200&r=LYNXMPEE090UD", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-fski-white/white-confident-of-legacy-regardless-of-pyeongchang-result-idUKKBN1EZ1NK", "country": "US", "domain_rank": 408, "title": "White confident of legacy regardless of Pyeongchang result", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:48:00.000+02:00", "replies_count": 0, "uuid": "2aaaa23d6c063a30263a7434e16ccac69c28cbdd"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-fski-white/white-confident-of-legacy-regardless-of-pyeongchang-result-idUKKBN1EZ1NK", "ord_in_thread": 0, "title": "White confident of legacy regardless of Pyeongchang result", "locations": [], "entities": {"persons": [{"name": "white", "sentiment": "none"}, {"name": "shaun white", "sentiment": "none"}, {"name": "jack tarrant", "sentiment": "none"}], "locations": [{"name": "pyeongch", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "rosa khutor", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 1:52 PM / Updated an hour ago White confident of legacy regardless of Pyeongchang result Jack Tarrant 4 Min Read \nLONDON (Reuters) - There are very few winter Olympians who have transcended their sport quite like the pioneering American Shaun White, a two-time halfpipe gold medal winner widely regarded as the greatest competitive snowboarder in history. FILE PHOTO: U.S. snowboarder Shaun White waits in line during a breakdown of the chairlift at snowboard slopestyle training for the 2014 Sochi Winter Olympics in Rosa Khutor, February 3, 2014. REUTERS/Mike Blake/File Photo \nWhite is also one of the largest personalities on the circuit with an extensive portfolio of achievements away from the snow, including playing guitar in a band, appearing in several movies and even having two video games named after him. \nThe 31-year-old’s high profile meant his failure to secure a halfpipe podium spot in Sochi four years ago reverberated around the world. According to Facebook, White was the most talked about athlete at the 2014 Games across its platforms. \nThe American regards that as the “worst thing I could have imagined”, yet in an interview with Reuters, White says he is now in a “better headspace” after rebuilding his coaching team, changing his training regime and clearing his mind since Russia. \nSpeaking about his feelings after that last run in Sochi, White believes the performance did not reflect on who he was as a rider at the time. \n“I just sat there and all I had was my thoughts. First of all, what was bothering me? And what was bothering me was that I had been in this sport for my entire life,” White told Reuters after last month’s U.S. Olympic qualifier in Breckenridge. \n“You win things and then you are expected to do it year after year, again and again, but it didn’t have the same feeling as the first time,” he added. \n”I was missing time at home, missing my family, missing being with my dog. Doing normal things. I then decided to start doing all the things I wanted to but didn’t have the time... which made me feel great. \n“When I felt great, I thought about snowboarding because that makes me feel great too. I was getting back to being excited about just riding and doing new tricks.” \nWhite credits his new support team, which includes Olympic bronze medallist Jarret “JJ” Thomas and young rider Toby Miller, with making his time on the road fun again. FILE PHOTO: U.S. snowboarder Shaun White trains on the slopestyle snowboard course during practice for the 2014 Sochi Winter Olympics in Rosa Khutor, Russia February 4, 2014. REUTERS/Dylan Martinez/File Photo \n“You have both ends of the spectrum: you have a 17-year-old who is in love with the sport and loves travelling, being on the road, and then you have JJ who is like the veteran, even more than myself. It is a nice complementary situation,” White said. OLYMPIC LEGACY \nWhite was speaking after a mixed performance at the Dew Tour event in Breckenridge in mid-December, where he finished 14th in qualifying and failed to make the final. \nThe event was the second of four qualifiers to determine the U.S. snowboarding team in Pyeongchang. A win would have almost guaranteed White a spot but he does have two further chances to qualify later in January. \nWhite admits that after Sochi he thought his legacy had been tarnished and all his previous achievements had been erased. Yet his time away from the sport has given him a fresh perspective. \n“I came home and people were still saying I was the champ, you are still the man, you can’t take away what you have done. That gave me a lot of comfort in myself,” he admitted. \n“I think that was when I realised that you can’t take away all the awards and all the things I have done.” \nWhite, who will be competing in his fourth games should he qualify for Pyeongchang, says the part of his career he was most proud of is that winning and competing never changed who he was. \nWith more attention on him than almost any other winter Olympian, White believes his legacy will last long after he retires, regardless of whether he even makes it to South Korea. \n“I think it would be great on so many levels and it would mean the world to me but I don’t think it makes or breaks my career,” stressed White, who remains hopeful of competing in Tokyo when skateboarding makes its Olympic debut in 2020. Reporting by Jack Tarrant; Editing by John O'Brien", "external_links": [], "published": "2018-01-10T15:48:00.000+02:00", "crawled": "2018-01-10T16:32:36.005+02:00", "highlightTitle": ""}