{"organizations": [], "uuid": "b21296dd56524472a782d44b1a124ade7d6b143e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-nuvasive-extends-first-of-its-kind-porous-peek-interbody-to-tlif-and-plif-procedures.html", "country": "US", "domain_rank": 767, "title": "NuVasive Extends First-Of-Its-Kind Porous PEEK Interbody To TLIF And PLIF Procedures", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.112, "site_type": "news", "published": "2018-01-04T16:30:00.000+02:00", "replies_count": 0, "uuid": "b21296dd56524472a782d44b1a124ade7d6b143e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-nuvasive-extends-first-of-its-kind-porous-peek-interbody-to-tlif-and-plif-procedures.html", "ord_in_thread": 0, "title": "NuVasive Extends First-Of-Its-Kind Porous PEEK Interbody To TLIF And PLIF Procedures", "locations": [], "entities": {"persons": [], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "vertera spine", "sentiment": "none"}], "organizations": [{"name": "nuva", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 4, 2018 /PRNewswire/ -- NuVasive, Inc. (NASDAQ: NUVA), the leader in spine technology innovation, focused on transforming spine surgery with minimally disruptive, procedurally-integrated solutions, announced today the launch of the Company's COALESCE TM Thoracolumbar Interbody Fusion Device as well as FDA 510(k) clearance for expanded indications of its COHERE® Cervical Interbody Fusion Device. The launch and updated claims follow the NuVasive September 2017 acquisition of Vertera Spine, developers of highly innovative interbody implants for spinal fusion using patented porous polyetheretherketone (PEEK) technology.\nThe NuVasive Advanced Materials Science (AMS) Portfolio includes Porous PEEK™ and Modulus® Titanium interbody implants that are engineered for enhanced osseointegration and biomechanical properties when compared to solid implants with smooth or rough surfaces. Based on animal studies, COALESCE and COHERE provide a unique three-dimensional Porous PEEK architecture to help elicit and encourage bone ingrowth. The technology used to develop these devices utilizes a proprietary processing method that introduces porous structure without compromising implant strength.\n\"Our strategy in building our AMS portfolio is to provide unprecedented, innovative technologies that enhance the surface, structure and visualization properties of these implants,\" said Gregory T. Lucier, chairman and chief executive officer of NuVasive. \"Our launch of COALESCE and the expanded clearance of COHERE and COALESCE are all part of our continued commitment to bring disruptive technology to market and investment into our comprehensive AMS portfolio, which converge to provide a better surgical experience and improve patient quality of life.\"\nCOALESCE is now commercially available for TLIF and PLIF procedures in multiple footprint, height and lordotic options, and is magnetic resonance compatible. Following its recently cleared 510(k), COALESCE indications have been expanded to include use for one or two adjacent levels in the thoracolumbar spine (T1– S1) with both autograft and allograft for treatment of degenerative disc disease and degenerative spondylolisthesis as well as multi-level degenerative scoliosis. The device previously received FDA 510(k) clearance for use in anterior, transforaminal, posterior and lateral lumbar interbody fusion procedures.\nThe expanded FDA 510(k) indications for COHERE allow it to be used at multiple levels in the cervical spine (C2 – T1) with both autograft and allograft. In addition, COHERE received a new ICD code from the Center of Medicare & Medicaid Services (CMS) in October. COHERE is the only product approved for use with the new code, signifying CMS' recognition of the innovation and potential clinical and tracking benefits of using Porous PEEK technology.\n\"Patients can gain significant pain relief and improved functional outcomes through the stabilization and fusion of the degenerated spinal motion segment,\" said Dr. Kenneth Burkus, orthopaedic surgeon at The Hughston Clinic. \"COHERE and COALESCE contribute to these outcomes by retaining the biomechanical properties necessary for intradiscal spinal applications, while helping facilitate osseointegration and bone growth. The use of these new Porous PEEK implants may enhance fusion and limit the risk of stress-shielding, subsidence and implant failure.\"\nAbout NuVasive\nNuVasive, Inc. (NASDAQ: NUVA) is the leader in spine technology innovation, focused on transforming spine surgery and beyond with minimally disruptive, procedurally-integrated solutions designed to deliver reproducible and clinically-proven surgical outcomes. The Company's portfolio includes access instruments, implantable hardware, biologics, software systems for surgical planning, navigation and imaging solutions, magnetically adjustable implant systems for spine and orthopedics, and intraoperative monitoring service offerings. With $962 million in revenues (2016), NuVasive has an approximate 2,300 person workforce in more than 40 countries serving surgeons, hospitals and patients. For more information, please visit www.nuvasive.com .\nForward-Looking Statements\nNuVasive cautions you that statements included in this news release that are not a description of historical facts are forward-looking statements that involve risks, uncertainties, assumptions and other factors which, if they do not materialize or prove correct, could cause NuVasive's results to differ materially from historical results or those expressed or implied by such forward-looking statements. The potential risks and uncertainties which contribute to the uncertain nature of these statements include, among others, risks associated with acceptance of the Company's surgical products and procedures by spine surgeons, development and acceptance of new products or product enhancements, clinical and statistical verification of the benefits achieved via the use of NuVasive's products (including the iGA® platform), the Company's ability to effectually manage inventory as it continues to release new products, its ability to recruit and retain management and key personnel, and the other risks and uncertainties described in NuVasive's news releases and periodic filings with the Securities and Exchange Commission. NuVasive's public filings with the Securities and Exchange Commission are available at www.sec.gov . NuVasive assumes no obligation to update any forward-looking statement to reflect events or circumstances arising after the date on which it was made.\nView original content with multimedia: http://www.prnewswire.com/news-releases/nuvasive-extends-first-of-its-kind-porous-peek-interbody-to-tlif-and-plif-procedures-300577365.html\nSOURCE NuVasive, Inc.", "external_links": ["http://www.nuvasive.com/", "http://www.prnewswire.com/news-releases/nuvasive-extends-first-of-its-kind-porous-peek-interbody-to-tlif-and-plif-procedures-300577365.html"], "published": "2018-01-04T16:30:00.000+02:00", "crawled": "2018-01-04T16:41:19.019+02:00", "highlightTitle": ""}