{"organizations": [], "uuid": "97d648eca48388aee727074011868d6cd7d32a2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-kemper-corporation-announces-schedule-for-fourth-quarter-earnings-call-estimates-fourth-quarter-2017-catastrophe-losses.html", "country": "US", "domain_rank": 767, "title": "Kemper Corporation Announces Schedule for Fourth Quarter Earnings Call; Estimates Fourth Quarter 2017 Catastrophe Losses", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:55:00.000+02:00", "replies_count": 0, "uuid": "97d648eca48388aee727074011868d6cd7d32a2a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-kemper-corporation-announces-schedule-for-fourth-quarter-earnings-call-estimates-fourth-quarter-2017-catastrophe-losses.html", "ord_in_thread": 0, "title": "Kemper Corporation Announces Schedule for Fourth Quarter Earnings Call; Estimates Fourth Quarter 2017 Catastrophe Losses", "locations": [], "entities": {"persons": [], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "kmpr", "sentiment": "negative"}, {"name": "kemper corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "kemper", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO--(BUSINESS WIRE)-- Kemper Corporation (NYSE: KMPR) announced today that after the markets close on Tuesday, February 13, Kemper will issue its fourth quarter 2017 earnings release and financial supplement. The company expects to file its annual report on Form 10-K with the Securities and Exchange Commission shortly thereafter. Following their publication, these documents will be available on the investor section of kemper.com .\nKemper will host its conference call to discuss fourth quarter 2017 and full year results on Wednesday, February 14, 2018 at 8:30 a.m. Eastern (7:30 a.m. Central). The conference call will be accessible via the internet and by telephone at 844.526.3041 . To listen via webcast, register online at the investor section of kemper.com at least 15 minutes prior to the webcast to install any necessary software.\nA replay of the webcast will be available online at the investor section of kemper.com .\nKemper also announced today that it estimates that its fourth quarter 2017 results will include pre-tax catastrophe losses between $49 million and $53 million, including the impacts of the California wildfires, net of reinsurance, and favorable development from re-estimates of losses from catastrophes that occurred in the first nine months of 2017.\nAbout Kemper\nThe Kemper family of companies is one of the nation’s leading insurers. With $8 billion in assets, Kemper is improving the world of insurance by offering personalized solutions for individuals, families and businesses. Kemper's businesses collectively:\nOffer insurance for home, auto, life, health and valuables Service six million policies Are represented by 20,000 agents and brokers Employ 5,550 associates dedicated to providing exceptional service Are licensed to sell insurance in 50 states and the District of Columbia\nLearn more about Kemper .\nCaution Regarding Forward-Looking Statements\nThis press release may contain or incorporate by reference information that includes or is based on forward-looking statements within the meaning of the safe-harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements give expectations or forecasts of future events, and can be identified by the fact that they relate to future actions, performance or results rather than strictly to historical or current facts.\nAny or all forward-looking statements may turn out to be wrong, and, accordingly, readers are cautioned not to place undue reliance on such statements, which speak only as of the date of this press release. Forward-looking statements involve a number of risks and uncertainties that are difficult to predict, and are not guarantees of future performance. Among the general factors that could cause actual results and financial condition to differ materially from estimated results and financial condition are those listed in periodic reports filed by Kemper with the SEC. No assurances can be given that the results and financial condition contemplated in any forward-looking statements will be achieved or will be achieved in any particular timetable. Kemper assumes no obligation to publicly correct or update any forward-looking statements as a result of events or developments subsequent to the date of this press release. The reader is advised, however, to consult any further disclosures Kemper makes on related subjects in its filings with the SEC.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005514/en/\nKemper Corporation\nInvestors\nTodd Barton, 312-661-4930\ninvestors@kemper.com\nor\nMedia\nBarbara Ciesemier, 312-661-4521\nmedia@kemper.com\nSource: Kemper Corporation", "external_links": ["http://kemper.com/", "http://www.kemper.com/", "http://www.businesswire.com/news/home/20180131005514/en/"], "published": "2018-01-31T14:55:00.000+02:00", "crawled": "2018-01-31T15:49:44.000+02:00", "highlightTitle": ""}