{"organizations": [], "uuid": "dce5bcdaa3d216026baf41a403aa11fa890dc159", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-red-oak-capital-fund-announces-fourth-quarter-return-of-12-point-11-percent.html", "country": "US", "domain_rank": 767, "title": "Red Oak Capital Fund Announces Fourth Quarter Return of 12.11%", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-25T16:35:00.000+02:00", "replies_count": 0, "uuid": "dce5bcdaa3d216026baf41a403aa11fa890dc159"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-red-oak-capital-fund-announces-fourth-quarter-return-of-12-point-11-percent.html", "ord_in_thread": 0, "title": "Red Oak Capital Fund Announces Fourth Quarter Return of 12.11%", "locations": [], "entities": {"persons": [{"name": "chip cummings", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "red oak capital group", "sentiment": "negative"}, {"name": "red oak", "sentiment": "none"}, {"name": "red oak capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 25, 2018 /PRNewswire/ -- Red Oak Capital Group (RED OAK) posted another strong quarter, announcing an annualized quarterly return of 12.11% to investors for its Red Oak Capital Fund I. This is the third straight quarter in which Red Oak has outperformed expectations, delivering an annual net yield of 11.68% for 2017.\n\"Our commercial real estate note portfolio performance remains strong,\" said Chip Cummings, Senior Managing Partner with Red Oak. \"And we added several solid acquisitions in the fourth quarter.\"\nAs a bridge-bank lender, Red Oak Capital takes advantage of short-term gaps in the traditional commercial finance markets, and specializes in the acquisition of smaller commercial real estate debt instruments. Strong growth and demand for development capital in the commercial real estate sector has led to expansion for private equity firms like Red Oak.\nOutperforming similar firms in the commercial real estate debt sector is nothing new for Red Oak Capital. In 2016, the Fund beat market averages to finish with a distributed yield of 11.90%.\nAlthough Red Oak Capital Fund I is closed to new investors, based upon its strong performance, Red Oak is preparing for the release of Red Oak Capital Income Fund II later this year. Strategically deploying technology, Red Oak Capital utilizes Fintech to streamline their investment and asset analysis process.\n\"As a Fintech company, technology is driving advances for both our investors and asset acquisitions,\" explained Cummings. \"Red Oak Capital developed Fintech technologies like machine-learning, predictive behavioral analytics and data-driven marketing to take the guess-work out of financial decisions, creating better yields with lower risk to our portfolio.\"\nUtilizing Fintech technologies allow for more thorough asset underwriting analysis, enhanced performance metrics, and reductions in both time and expense in asset evaluation and monitoring. With a Fintech approach, Red Oak Capital can provide real-time reporting and transparency to broker-dealer platforms, investors and sponsors alike.\n\"It's these types of technologies that allow us to continue to lead the market and deliver results to our investors,\" added Cummings.\nAbout Red Oak Capital Group\nThe Red Oak Capital Group is a Fintech private equity firm specializing in commercial real estate investments, and manages several Funds, including Red Oak Capital Fund I. With offices in New York and Michigan, Red Oak Capital Group was founded in 2015 to serve the capital finance and investment markets, and the principals, directors and advisory team have vast experience in the development, management, financing and syndication of commercial real estate. Additional information may be obtained directly from Red Oak by visiting www.RedOakCapitalGroup.com , or by calling (212) 457-4004.\nCONTACT:\nChip Cummings\nRed Oak Capital Group\n(616) 734-6099\nView original content with multimedia: http://www.prnewswire.com/news-releases/red-oak-capital-fund-announces-fourth-quarter-return-of-1211-300587449.html\nSOURCE Red Oak Capital Group", "external_links": ["http://www.prnewswire.com/news-releases/red-oak-capital-fund-announces-fourth-quarter-return-of-1211-300587449.html", "http://www.redoakcapitalgroup.com/"], "published": "2018-01-25T16:35:00.000+02:00", "crawled": "2018-01-25T18:15:30.012+02:00", "highlightTitle": ""}