{"organizations": [], "uuid": "d9763b6d8108134184fffc6569cc0234bf71245a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/trump3.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/trump-presidency-economy-report-card/", "country": "US", "domain_rank": 1196, "title": "Is President Trump Good or Bad for the Economy? | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.52, "site_type": "news", "published": "2018-01-22T10:49:00.000+02:00", "replies_count": 0, "uuid": "d9763b6d8108134184fffc6569cc0234bf71245a"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/22/trump-presidency-economy-report-card/", "ord_in_thread": 0, "title": "Is President Trump Good or Bad for the Economy? | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "bloomberg view", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "oval office", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "bureau of economic analysis", "sentiment": "none"}, {"name": "census bureau", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 8:49 AM EST \nWe love data here at Bloomberg View, and think facts should support opinions instead of the other way around. Now we know that’s an old-fashioned idea, and it’s one that’s been put to the test in the 12 months since President Donald Trump moved into the Oval Office . But we’re not giving up! Last year our columnists selected a range of conventional and whimsical metrics by which to judge the success of the new president. We revisit them here. Bottom line: By these measures, he’s doing better than his opponents will admit and worse than his supporters believe. Trade Deficit Up, Especially With China \nLike any president, Trump is taking credit for good economic news. He’s highlighted rising stocks and falling unemployment. But Trump also, famously, regards trade deficits as a sign of economic weakness. And for people who worry about the fact that the U.S. buys more stuff from other countries than it sells them, the news has not been so good. The latest release from the Census Bureau and the Bureau of Economic Analysis notes that the trade deficit was 12% higher from January to October 2017 than during the same period of 2016. The trade deficit with China, a particular concern of Trump, is up even more. \nThe administration could respond to these numbers by increasing its focus on imposing and threatening tariffs. Or it could ignore them. Or, finally and least likely, Trump could decide that since trade deficits are compatible with economic growth, maybe he should stop caring so much about them. Ramesh Ponnuru Second Thoughts on Canada \nA surprising amount of Americans Googled “move to Canada” in the aftermath of Trump’s victory . His inauguration inspired a lesser rush of queries. But interest in self-exiling has flatlined ever since. Could it be that everyone who was threatening to flee has already left? Probably not. During the past year, users who searched for “move to Canada” became intensely interested in a completely different topic: “How to impeach a president.” So it looks like our prospective American-Canadian expats have switched gears to a slightly less dramatic plan. And probably just as unlikely. Elaine Ou Deficit-to-GDP Reversal \nThis measure, which tracks the relationship of deficits and growth, had a bigger annual improvement under President Barack Obama than under any president since 1980, though only President Bill Clinton saw perennial deficits transformed into annual surpluses. Under Trump, the trend is reversing. The deficit-to-GDP ratio widened to 3.4% from 3% since Trump became president amid lower-than-forecast tax receipts, less-than-robust wage gains and an aging workforce. The most extensive rewrite of the U.S. tax code in more than 30 years by the Republican Congress and signed by Trump in 2017 will cost $1 trillion over 10 years, according to the nonpartisan Congressional Budget Office. Trump says that the tax cuts will eventually narrow the deficit by taking GDP growth to an unprecedented 4% annual rate in the 21st century. No studies exist that show such a leap is possible. Matthew Winkler Rust Belt Rut \nThe four Rust Belt states that gave Trump his unexpected 2016 victory have done reasonably well in the last year, showing cyclical strength but no real change in their unfortunate structural story. The unemployment rates in Pennsylvania, Ohio, Michigan, and Wisconsin have all fallen. Yet the combined labor-force growth in those states has been a meager 0.4%, suggesting that the jobs picture hasn’t improved enough to change the narrative of long-term demographic decline. \nThat kind of change will require more than presidential tweets and a corporate tax cut. Cyclical economic strength is nice and beats the alternative, but there’s still no reason to believe that the Rust Belt will prosper in 2025, any more than it did in 2015. Conor Sen Runner Up on Deregulation \nTo the delight of supporters and the fury of opponents, Trump has followed through on his pledges to loosen regulations. “The administration has instilled a faith in business executives that new regulations are not coming,” Binyamin Appelbaum and Jim Tankersley wrote recently in the New York Times . \nThe most meaningful measures of increasing regulatory burdens come from the QuantGov project, which tracks words like “shall” and “must” that create legal obligations in government manuals rather than merely counting pages. Its data show a significant slowdown in the growth of federal rules, although not an outright reversal. From Trump’s inauguration through Jan. 16, 2018, restrictions grew by about 0.6%, compared to 1.6% in 2016. \nThat doesn’t make Trump the deregulatory champ, however, and in fact puts him slightly behind Obama’s penultimate year. In 2015, restrictions grew by only 0.5%. Since 1970, the number of restrictions has dropped in only three years: 1983 (-2.19%), 1985 (-2.55%), and 1996 (-3.16%). Trump has a long way to go if he wants to beat Bill Clinton’s best year. Virginia Postrel Manufacturing Jobs Tick Up \nFactory jobs have been an obsession for Trump. And after going flat for most of 2015 and 2016, their numbers have been on the increase since last January. The gains aren’t much in the grand scheme of things — an estimated 196,000 manufacturing jobs added in 2017, compared with 4.7 million lost since the beginning of 2000 — and the biggest cause is probably the decline in the value of the dollar that began in December 2016. But tax cuts and the absence of new regulations have helped put U.S. businesses in a hopeful mood, and more manufacturing job gains seem likely. Justin Fox Perkier Paychecks \nOfficial government numbers aren’t out yet, but surveys by private companies show modest income gains for American households in early 2017. It’s way too soon to say whether Trump had anything to do with it; the trend just continues a recovery in real median household income that has been in place since 2014. Thanks to that recovery, income is now slightly higher than it was before the financial crisis. The continued slow expansion shows that Trump didn’t immediately damage the economy when he took office. But the effects of recently passed tax and health-care legislation won’t be known for a while. Noah Smith Offshore Cash Strategizing \nTrump promised to get U.S. corporations to bring back their foreign cash piles, which Moody’s estimated at $1.2 trillion at the end of 2016. Cash held by the foreign subsidiaries of U.S. multinationals — for the most part, tech and pharma ones — increased to about $1.4 trillion by the end of 2017. But that doesn’t mean Trump failed. \nThe tax overhaul he signed in December imposes a 15.5% tax on accumulated foreign profits, which is expected to bring in almost $339 billion in tax revenue between 2018 and 2027. Apple is about to pay $38 billion of that this year — and to invest billions more in the U.S. — now that its tax future is clearing up. Other companies, too, will probably invest some of their foreign cash in the U.S. \nGranted, they’ll keep booking their non-U.S. sales in lower-tax jurisdictions like Ireland. But Trump has probably done as much as he could to keep this particular promise. Leonid Bershidsky Syria’s Dead Children \nOf the 33,425 civilians killed in 2017 in the Syrian war, 2,109 were children. This is according to the Syrian Observatory for Human Rights. Last year that was the metric I thought was worth watching. Despite the military defeat of the Islamic State, the resurrection of Bashar al-Assad’s regime and an uneasy cease-fire negotiated by Secretary of State Rex Tillerson, the number of children killed in the Syrian war is not much smaller than it was in 2016. That year 2,372 children lost their lives in the conflict, out of 49,742 civilians who perished. Eli Lake Dow Plus Approval Rating \nCombining stock market performance and approval ratings provides useful (and different) information about presidential performance. The market boom under Trump is not the largest rally in history, but it’s big. We don’t know to what extent Trump’s policies are responsible for the rise, but he didn’t hurt and he probably helped. At the same time, his approval ratings are under 40%. In modern history, no president has entered his second year with such low numbers. We don’t have to accept claims about the wisdom of crowds to agree that when a president has such low approval ratings, he’s probably not doing a great job. On the stock market metric, Trump gets an A. On public approval, he gets a D. Cass R. Sunstein Washington Real Estate Woes \nA year ago, I wondered what Trump’s disruptive influence would mean for the Washington real estate market. On the one hand, he was bringing in a lot of outsiders — many wealthy — who would need to find homes. On the other hand, the liberal affluent class might decide to look for another city to gentrify. \nWhat have we learned? In some ways, what we expected: Luxury housing did very well at the start of the year, while overall home prices rose by a piddly 1.6% — a big change for Washingtonians, who have seen the median value of homes for sale climb from $390,000 in December of 2007 to $535,000 at the end of 2016. \nThe Republican tax bill Trump signed represents another rush of bad news for Washington homeowners. The District of Columbia is a high-tax jurisdiction, with a top income tax rate of 8.95%. Its property taxes are on the low side, but the high value of property has more than made up for that, and homeowners can now deduct only $10,000 in combined local and property taxes. So homeowners will now have to pay a very hefty premium for the privilege of living within the district. \nMany of us may have suspected that Trump would be bad for the value of our homes. But few of us could have suspected that the threat would come in the form of … higher taxes. We’ll just have to sit tight and see if the next year brings further Trump-induced revisions to our bottom lines. Megan McArdle Bannon Per Annum \nThe Stephen Bannon Index, measuring the media mentions of the Trump adviser as a proxy for bad news for Trump, ought to be obsolete. After all, Trump’s scruffy Svengali was given the boot in August. Besides, lots of stories with words like “Mueller” and “Russia” and “guilty plea” don’t mention Bannon at all. \nYet the Bannon Index was a reliable guide to a certain kind of bad news nonetheless. It had two big peaks and two small ones last year before exploding this January with the revelation that Bannon had deemed “treasonous” Donald Trump Jr.’s meeting with Russians offering dirt on Hillary Clinton. \nThere was a small peak at the dysfunctional start of Trump’s administration, which included a few expressions of horror in the media that Bannon had been given a spot (later rescinded) on the National Security Council. There was a big peak in April, when White House leaks about internecine warfare between Bannon and Trump’s son-in-law Jared Kushner kept reporters busy, along with a classic Trump dodge about how he really didn’t know that Bannon fellow all that well. There was another peak when Bannon was fired in August, followed by a small peak when Bannon’s preferred Senate candidate — the word “controversial” is too mousy to do him justice — managed to lose to a Democrat in Alabama, one of the nation’s most conservative states. \nWe don’t know what 2018 will bring, but the Index doesn’t lie. Bannon news is bad news for Trump. Francis Wilkinson Bad Vibes, Nationally \nThe economy is doing well, with unemployment low and the stock market surging. Islamic State has been uprooted from its strongholds in Syria and Iraq. North Korea even stopped firing off ballistic missiles for a while and launched a charm offensive instead. \nIn normal times, these positive trends would show up as positive responses to the standard poll question, “Is the nation headed in the right direction or off on the wrong track?” But there’s nothing normal about the Trump presidency and Americans aren’t happy about how their country is doing. In the NBC News/ Wall Street Journ al poll released on Friday, the public chose “wrong track” by a margin of 60% to 34%. \nThat pessimism has deepened since Trump’s inauguration, when the same polling group found that 52% of Americans thought the U.S. was on the wrong track compared to 36% who thought it was headed in the right direction. Our metrics-to-watch guide predicted that the president’s standing should be considered “in trouble” if the wrong-track figure fell below 30%. So Trump can take a tiny bit of comfort from one aspect of this otherwise awful performance: He’s not there yet. Albert R. Hunt Early Exit Index \nTrump is famously erratic, but the smart money at Ladbrokes finds the U.S. president remarkably consistent. When we checked in with Ladbrokes the week of Trump’s inauguration, it was offering inauspicious odds on the reality television star. Even before Trump put his hand on a Bible, the betting class pegged his chances of avoiding resignation or impeachment during his first term at no better than 50-50. \nIt turns out Trump is a stable bet. A year later, after tax cuts, indictments and those dismal poll numbers, not much has budged. The odds of Trump making a suspiciously early presidential departure are still about even. Francis Wilkinson \nThis column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-22T10:49:00.000+02:00", "crawled": "2018-01-22T16:43:08.010+02:00", "highlightTitle": ""}