{"organizations": [], "uuid": "c76492de5db774afecc6162c8c665932fb86dbe5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-shutdown/rpt-update-8-u-s-senators-strike-deal-to-end-government-shutdown-idUSL2N1PH1F8", "country": "US", "domain_rank": 408, "title": "RPT-UPDATE 8-U.S. senators strike deal to end government shutdown", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T03:31:00.000+02:00", "replies_count": 0, "uuid": "c76492de5db774afecc6162c8c665932fb86dbe5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-shutdown/rpt-update-8-u-s-senators-strike-deal-to-end-government-shutdown-idUSL2N1PH1F8", "ord_in_thread": 0, "title": "RPT-UPDATE 8-U.S. senators strike deal to end government shutdown", "locations": [], "entities": {"persons": [{"name": "susan cornwell", "sentiment": "negative"}, {"name": "richard cowan", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeating to fix formatting in 2nd paragraph)\nBy Susan Cornwell and Richard Cowan\nWASHINGTON, Jan 22 (Reuters) - U.S. senators struck a deal on Monday to lift a three-day government shutdown and try to end a fight between Democrats and President Donald Trump’s Republicans over immigration and border security.\nLegislation to renew federal funding to the government cleared a procedural hurdle in the Senate and was expected soon to pass votes in the Senate and House of Representatives, allowing government to re-open through Feb 8.\nTens of thousands of federal workers had begun closing down operations for lack of funding on Monday, the first weekday since the shutdown, but essential services such as security and defense operations had continued.\nSenate Democratic leader Chuck Schumer said he had come to an arrangement with Senate Majority Leader Mitch McConnell to keep the government open for the next few weeks after the Republican promised to let a bill on immigration reach the Senate floor.\nThe U.S. government cannot fully operate without funding bills that are voted in Congress regularly. Washington has been hampered by frequent threats of a shutdown in recent years as the two parties fight over spending, immigration and other issues. The last U.S. government shutdown was in 2013.\nThis shutdown, which began on the Friday’s first anniversary of Trump’s inauguration as president, undercut his self-crafted image as a dealmaker who would repair the broken culture in Washington.\nIt had forced Trump to cancel a planned weekend trip to his Mar-a-Lago estate in Florida and created uncertainty around his scheduled trip this week to the World Economic Forum in Davos, Switzerland.\nIn negotiations over the shutdown, Democrats had insisted that legislation to keep the government running include protections for young undocumented immigrants known as “Dreamers.”\nRepublicans in turn said they would not negotiate on immigration until Democrats gave them the votes needed to reopen the government.\nTRUMP EXPECTED TO SIGN Trump was expected to sign the legislation, which would give Congress more time to try to reach agreement on a long-term spending bill that would resolve issues including immigration, border security and spending caps.\nMcConnell promised to allow a fair and open immigration debate ”to consider a proposal that can actually be signed into law, a bipartisan, bicameral group is already negotiating and I look forward to completion of its work.”\nSuch a debate would occur if a deal on an immigration bill is not reached before Feb. 8, McConnell said\nDemocrats want Congress to address the issue of the Dreamers, more than 700,000 immigrants brought to the United States illegally as children.\nDemocratic Senator Heidi Heitkamp welcomed the deal.\n“You now have a commitment for a path forward for the so-called ‘Dreamers.; That’s critical. We’re going to get a vote. We’re going to regular order,” she said.\nHouse of Representatives Republicans have been told by their leaders to plan on voting on re-opening the government immediately.\nMarkets have absorbed the shutdown drama over the last week, and on Monday morning world stocks and U.S. bond markets largely shrugged off the standoff even as the dollar continued its pullback. U.S. stocks were higher, the dollar was slightly lower and benchmark treasuries yields were off highs of the day.\nBoth sides in Washington had tried to blame each other for the shutdown.\nDemocrats said Trump had not only failed to bring both sides together but made a deal more difficult by changing his position on what kind of agreement on immigration he would accept.\nTrump and Republicans accused Democrats of putting the interests of illegal immigrants ahead of U.S. military personnel and government workers.\nEarly polls showed that Trump and Republican leaders were drawing most of the blame from American voters, but some Democrats worried they would pay a higher political cost if the shutdown dragged on.\nAdditional reporting David Morgan, Ginger Gibson, Amanda Becker, Blake Brittain, Susan Heavey, Diane Bartz, Megan Davies, Lucia Mutikani, Yasmeen Abdutaleb, Patricia Zengerle; Writing by Doina Chiacu; Editing by Alistair Bell\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T03:31:00.000+02:00", "crawled": "2018-01-23T17:58:17.001+02:00", "highlightTitle": ""}