{"organizations": [], "uuid": "9308d39070477301911a924a808a3ed37af9f6b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226834937&w=1200&r=LYNXMPEE0U083", "site_section": "https://www.reuters.com/politics", "section_title": "Politics &amp; Political News | Reuters", "url": "https://www.reuters.com/article/us-usa-trump-economy-factbox/factbox-trumps-statements-on-the-u-s-economy-in-address-some-hits-some-misses-idUSKBN1FK0HS", "country": "US", "domain_rank": 408, "title": "Factbox: Trump's statements on the U.S. economy in address: some hits, some misses", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-31T13:50:00.000+02:00", "replies_count": 0, "uuid": "9308d39070477301911a924a808a3ed37af9f6b2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-trump-economy-factbox/factbox-trumps-statements-on-the-u-s-economy-in-address-some-hits-some-misses-idUSKBN1FK0HS", "ord_in_thread": 0, "title": "Factbox: Trump's statements on the U.S. economy in address: some hits, some misses", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " President Donald Trump used his State of the Union address on Tuesday in part to take credit for the strength of the U.S. economy and financial markets, something he does regularly.\nSome of his claims were spot on; some were not. Here are some of Trump’s statements about the economy, with context:\nJOBS AND UNEMPLOYMENT Trump said since the 2016 election, 2.4 million new jobs were created, a claim that has validity.\nThe economy did add an average of 171,000 positions per month in 2017. It has been doing that, however, since 2010, a record run of job creation that makes it hard to distinguish between the momentum developed under Trump and his predecessor, President Barack Obama.\nStrictly on a calendar basis, for Obama’s two presidential terms running from January 2009 through December 2016, the economy added 109,000 jobs per month. But he inherited an economic mess. The United States began losing jobs consistently in early 2008, at the end of President George W. Bush’s administration, and by the time Obama took over, it was hemorrhaging hundreds of thousands of jobs a month.\nThe recession officially ended in June 2009, and from that point to the end of Obama’s second term, job growth was 159,000 per month, less than during Trump’s first year.\nThe jobs market did not reach its low point until February 2010. From that point to the end of Obama’s second term, job growth averaged 190,000 per month, more than Trump’s first year.\nSTOCK MARKET Trump loves to discuss the success of the stock market and used his podium on Tuesday to do that again, noting it had smashed one record after another and gained trillions of dollars in value. Trump has some reason to gloat there.\nThe Dow Jones Industrial Average was around 18,000 in early November 2016, just prior to the election. It breached 20,000 the week after the inauguration, the start of a record setting rise to above 26,000 this month.\nThere is little question the change in the regulatory environment and the corporate tax cut helped fuel the rise. But the administration has received some help along the way since 2016 was the first year in many when Europe and China worked free of immediate risks to growth, and the global economy strengthened as those “headwinds” lifted.\nThe Dow Jones average has been rising, with some weak spots, since March 2009 when it bottomed out at around 6,500.\nTAX CUTS Trump touted his 2016 tax overhaul as the “biggest tax cuts and reforms in American history.”\nThe legislative package passed in December was more far-reaching than some had expected Republicans to pass, but it did not change the U.S. tax code as fundamentally as the 1986 tax reform approved under former President Ronald Reagan.\nThe Committee for a Responsible Federal Budget, a fiscal conservative group in Washington, found last year that the Trump tax cut was about the 12th-largest cut as a percentage of gross domestic product since 1918 and the 4th-largest in inflation-adjust dollars.\nCAR COMPANIES Trump noted that many car companies are building and expanding their plants in the United States, something he said the country had not seen for decades.\nThat is not the case. In the last few decades, a number of car companies have set up plants, including Subaru in Indiana in 1989, Mercedes in Alabama in 1993, BMW in South Carolina in 1994, Honda in Alabama in 2001, Hyundai in Alabama in 2005, Kia in Georgia in 2009, and Volkswagen in Tennessee in 2011.\nReporting by Jeff Mason, Howard Schneider, Damon Darlin; Editing by Kevin Drawbaugh and Alistair Bell\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T13:50:00.000+02:00", "crawled": "2018-01-31T17:58:30.000+02:00", "highlightTitle": ""}