{"organizations": [], "uuid": "9714949c29fa93da9fa623af1876c950c8098dab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-cannabis-market-sales-on-the-rise-according-to-data.html", "country": "US", "domain_rank": 767, "title": "Cannabis Market Sales on the Rise According to Data", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:00:00.000+02:00", "replies_count": 0, "uuid": "9714949c29fa93da9fa623af1876c950c8098dab"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-cannabis-market-sales-on-the-rise-according-to-data.html", "ord_in_thread": 0, "title": "Cannabis Market Sales on the Rise According to Data", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "new frontier data", "sentiment": "negative"}, {"name": "lexaria bioscience corp.", "sentiment": "none"}, {"name": "corbus pharmaceuticals holdings, inc.", "sentiment": "none"}, {"name": "canopy growth corporation", "sentiment": "none"}, {"name": "cannabis wheaton income corp.", "sentiment": "none"}, {"name": "axim biotechnologies, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, January 10, 2018 /PRNewswire/ --\nAccording to a research report by New Frontier Data, medical cannabis sales are forecast to grow to $5.3 billion in 2017, accounting for 67% of total cannabis sales. Medical sales in currently legal states are estimated to grow to $13.2 billion by 2025, at which point medical sales will account for 55% of all sales. In comparison, adult-use sales in 2017 are forecast to reach $2.6 billion, rising to $10.9 billion by 2025. A major development in the cannabis industry is California's new recreational cannabis laws, which went into effect on January 1st, 2018. New Frontier also indicates that legal cannabis sales in California alone are projected to reach $2.8 billion in 2017 and $6.6 billion by 2025, with a compound annual growth rate of 12% over the next eight years. Cannabis Wheaton Income Corp. (OTC: CBWTF), Lexaria Bioscience Corp. (OTC: LXRP), AXIM Biotechnologies, Inc. (OTC: AXIM), Corbus Pharmaceuticals Holdings, Inc. (NASDAQ: CRBP), Canopy Growth Corporation (OTC: TWMJF)\nState budget deficits may be resolved as cannabis revenue could raise a significant amount and provide states with increased capacity in their finances. New Frontier Data CEO Giadha Aguirre De Carcer said, \"During this tough economy states are looking for any way to close their budget shortfalls and it appears that cannabis may hold an answer for them. New Frontier Data looked at the potential revenues that could be generated from state cannabis taxes and found that in this year alone, states could raise nearly $750 million and triple that number by 2020. These revenues will have a meaningful impact on state programs and provide governors with much needed breathing room in their budgets.\"\nCannabis Wheaton Income Corp. (OTC: CBWTF) is also listed on the TSX Venture Exchange under the ticker symbol 'CBW'. Earlier this week the company announced that, \"as a result of strong investor demand, it has increased the size of its previously announced private placement offering of convertible debenture units to up to $100 million (the \"Offering\"). Terms of the Offering are more particularly described in the Company's news release issued on December 22, 2017.\nThe net proceeds received by the Company will be used to fund working capital and general corporate purposes, including but not limited to, financing of the Company's streaming partners pursuant to certain streaming agreements and general and administrative expenses. Subject to the satisfaction of customary closing conditions, including receipt of the approval of the TSX Venture Exchange, the Offering is expected to close on or about January 12, 2018.\nMMCAP International Inc. SPC (the \"Lead Subscriber\") and the Company have executed an amended binding term sheet with respect to the Offering, whereby the Lead Subscriber has agreed to subscribe for up to $68,000,000 million aggregate principal amount of convertible debenture units under the Offering. The Lead Subscriber is considered to be a related party of the Company for the purposes of Multilateral Instrument 61-101 - Protection of Minority Security Holders in Special Transactions (\"MI 61-101\") and Policy 5.9 - Protection of Minority Security Holders in Special Transactions of the TSX Venture Exchange, making the Offering a \"related party transaction\". Pursuant to MI 61-101, the Company has today filed a material change report providing disclosure in relation to the \"related party transaction\" on SEDAR under the Company's issuer profile at http://www.sedar.com . The Company did not file the material change report describing the increase to the size of the Offering more than 21 days prior to the expected closing date of the Offering as the definitive documentation for the Offering and the participation therein by the Lead Subscriber and any other \"related party\" of the Company were settled less than 21 days prior to the expected closing date of the Offering, and the Company wishes to close the Offering on an expedited basis for sound business reasons.\"\nLexaria Bioscience Corp. (OTCQX: LXRP) has developed and out-licenses its disruptive delivery technology that promotes healthier ingestion methods, lower overall dosing and higher effectiveness of lipophilic active molecules. On December 15, 2017, the company announced a new topical skin cream research and development (\"R&D\") program; R&D into nicotine edibles; and updates existing R&D programs. Lexaria has formulated topical cream products as an extension of its DehydraTECH™ technology, for the delivery of cannabinoids into and through the skin which may prove to have emollient benefits desired by the topical products sector. Multiple Lexaria formulations are scheduled to be laboratory tested for human skin absorption and penetration characteristics during January through March 2018. Testing will be completed at a third-party lab utilizing human skin tissue and the latest in vitro evaluative techniques to measure cannabidiol penetration in the skin. Lexaria expects to optimize formulation and manufacturing processes to develop superior-performing product designs that will potentially be available to licensees during 2018.\nAXIM Biotechnologies, Inc. (OTCQB: AXIM) focuses on the research, development and production of cannabis-based pharmaceutical, nutraceutical and cosmetic products. On November 21, 2017, the company announced clinical trial results from its first phase II pilot trial for the treatment of irritable bowel syndrome (IBS) with the company's CanChew +® CBD (cannabidiol) functional, controlled release chewing gum. Study results indicate that CanChew+® was well tolerated by the IBS patients and no significant adverse side effects were observed by any participants of the trial. All patients who participated in the study experienced decrease in their levels of pain score. On top of the overall reduction, the trend curve suggests 50% higher pain reduction when patients were on CanChew+® compared to the active placebo, which suggests that CBD content did lend to a decrease in pain score. As overall pain scores were reduced, the study also validates AXIM's use of its proprietary chewing gum delivery system.\nCorbus Pharmaceuticals Holdings, Inc. (NASDAQ: CRBP) is a Phase 3 clinical stage pharmaceutical company focused on the development and commercialization of novel therapeutics to treat rare, chronic, and serious inflammatory and fibrotic diseases. On December 22, 2017, the company announced the initiation of a Phase 2 clinical study of anabasum for the treatment of systemic lupus erythematosus (\"SLE\"). SLE is an uncommon autoimmune disease associated with significant morbidity, reduction in quality of life and a 2.4-fold increase in standard mortality rate. The disease affects primarily women of child-bearing age, with increased prevalence and morbidity among African Americans and other minority populations. Anabasum is a synthetic, oral, small-molecule, selective cannabinoid receptor type 2 (CB2) agonist that preferentially binds to CB2 expressed on activated immune cells and fibroblasts.\nCanopy Growth Corporation (OTC: TWMJF) is a world-leading diversified cannabis company, offering distinct brands and curated cannabis varieties in dried, oil and capsule forms. On November 28, 2017, the company announced it has entered into a distribution agreement with", "external_links": ["https://www.instagram.com/financialbuzz", "https://www.facebook.com/Financialbuzz/", "https://www.youtube.com/FinancialBuzzMedia", "https://twitter.com/financialbuzz"], "published": "2018-01-10T17:00:00.000+02:00", "crawled": "2018-01-10T18:50:32.013+02:00", "highlightTitle": ""}