{"organizations": [], "uuid": "8ed19bafba6ff32c0249b90588eff7e375ee9608", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 43, "shares": 43, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/08/gettyimages-836534170.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/trump-government-shutdown-military/", "country": "US", "domain_rank": 1196, "title": "Trump: Government Shutdown Would Be 'Devastating to Our Military' | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.794, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "8ed19bafba6ff32c0249b90588eff7e375ee9608"}, "author": "Natasha Bach", "url": "http://fortune.com/2018/01/19/trump-government-shutdown-military/", "ord_in_thread": 0, "title": "Trump: Government Shutdown Would Be 'Devastating to Our Military' | Fortune", "locations": [], "entities": {"persons": [{"name": "natasha bach", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "— donald j. trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "senate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Natasha Bach January 19, 2018 \nWe’ve established that a government shutdown is fairly complicated : some federal agencies are forced to close and workers are furloughed, but those in “essential” roles are permitted to continue to work. \nThis includes, of course, those working in security and law enforcement—the military among them. However, it seems that President Trump may not grasp the parameters of a government shutdown. \nOn Thursday, Trump tweeted , “A government shutdown will be devastating to our military…something the Dems care very little about!” A government shutdown will be devastating to our military…something the Dems care very little about! \n— Donald J. Trump (@realDonaldTrump) January 18, 2018 \nHe echoed this sentiment to reporters, saying, “If for any reason it shuts down, the worst thing is what happens to our military. We’re rebuilding our military. We’re making it—we’re bringing it to a level that it’s never been at. And the worst thing is for our military.” \nLuckily for Trump, and for the safety of the American people, even if the Senate doesn’t pass a continuing resolution today to avoid the looming shutdown, the military won’t suddenly be forced to drop their arms and go home. \nRead: House Acts to Avoid Shutdown but Senate Democrats Could Still Block the Measure \nAs mentioned, the law makes several exceptions in the case of government shutdown. Those working in essential roles that involve “the safety of human life or the protection of property” are permitted to continue working. What’s more, Trump himself has the authority, along with the Department of Defense, to determine which military operations are ‘necessary’ and therefore able to continue. \nThere is a catch, though. Active-duty military personnel continue working as usual in the case of a government shutdown, but their pay may be affected. The military is paid on the 1st and 15th of every month. Should the government shut down today and continue beyond Feb. 1, the military would be required to work but would not be paid until the shutdown ends or until Congress and Trump come to an agreement to cover their costs during the shutdown. \nIt will all come down to the Senate vote today, but fear not: the security of the U.S. will not be at stake no matter the outcome. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-20T12:02:43.000+02:00", "highlightTitle": ""}