{"organizations": [], "uuid": "23cd8415fd469250ee74a4a6feada92d9c4cc45f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/apple-cyber/update-1-apple-to-issue-fix-for-iphones-macs-at-risk-from-spectre-chip-flaw-idUSL1N1P002B", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Apple to issue fix for iPhones, Macs at risk from 'Spectre' chip flaw", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T03:42:00.000+02:00", "replies_count": 0, "uuid": "23cd8415fd469250ee74a4a6feada92d9c4cc45f"}, "author": "", "url": "https://www.reuters.com/article/apple-cyber/update-1-apple-to-issue-fix-for-iphones-macs-at-risk-from-spectre-chip-flaw-idUSL1N1P002B", "ord_in_thread": 0, "title": "UPDATE 1-Apple to issue fix for iPhones, Macs at risk from 'Spectre' chip flaw", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds timing details and Quote: s from experts)\nBy Stephen Nellis\nJan 4 (Reuters) - Apple Inc will release a patch for the Safari web browser on its iPhones, iPads and Macs within days, it said on Thursday, after major chipmakers disclosed flaws that leave nearly every modern computing device vulnerable to hackers.\nOn Wednesday, Alphabet Inc’s Google and other security researchers disclosed two major chip flaws, one called Meltdown affecting only Intel Corp chips and one called Spectre affecting nearly all computer chips made in the last decade. The news sparked a sell-off in Intel’s stock as investors tried to gauge the costs to the chipmaker.\nIn a statement on its website, Apple said all Mac and iOS devices are affected by both Meltdown and Spectre. But the most recent operating system updates for Mac computers, Apple TVs, iPhones and iPads protect users against the Meltdown attack and do not slow down the devices, it added, and Meltdown does not affect the Apple Watch.\nMacs and iOS devices are vulnerable to Spectre attacks through code that can run in web browsers. Apple said it would issue a patch to its Safari web browser for those devices “in the coming days.”\nShortly after the researchers disclosed the chip flaws Wednesday, Google and Microsoft Corp released statements telling users which of their products were affected. Google said its users of Android phones - more than 80 percent of the global market - were protected if they had the latest security updates.\nApple remained silent for more than a day about the fate of the hundreds of millions of users of its iPhones and iPads. Ben Johnson, co-founder and chief strategist for cyber security firm Carbon Black, said the delay in updating customers about whether Apple’s devices are at risk could affect Apple’s drive to get more business customers to adopt its hardware.\n“Something this severe gets the attention of all the employees and executives at a company, and when they go asking the IT and security people about it and security doesn’t have an answer for iPhones and iPads, it just doesn’t give a whole lot of confidence,” Johnson said. (Reporting by Stephen Nellis; Editing by Richard Chang and Cynthia Osterman)\n ", "external_links": [], "published": "2018-01-05T03:42:00.000+02:00", "crawled": "2018-01-05T04:02:42.003+02:00", "highlightTitle": ""}