{"organizations": [], "uuid": "e65fcd6fbc2a4a15cf035672aadd23559b6d5123", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-vintage-wine-estates-acquires-tamarack-cellars.html", "country": "US", "domain_rank": 767, "title": "Vintage Wine Estates acquires Tamarack Cellars", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.994, "site_type": "news", "published": "2018-01-15T21:22:00.000+02:00", "replies_count": 0, "uuid": "e65fcd6fbc2a4a15cf035672aadd23559b6d5123"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-vintage-wine-estates-acquires-tamarack-cellars.html", "ord_in_thread": 0, "title": "Vintage Wine Estates acquires Tamarack Cellars", "locations": [], "entities": {"persons": [{"name": "ron", "sentiment": "none"}, {"name": "pat roney", "sentiment": "none"}, {"name": "jamie", "sentiment": "none"}, {"name": "ron coleman", "sentiment": "none"}, {"name": "jamie coleman", "sentiment": "none"}], "locations": [{"name": "tamarack cellars santa rosa", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "tamarack", "sentiment": "none"}, {"name": "tamarack cellars", "sentiment": "none"}, {"name": "walla walla", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "vintage wine estates", "sentiment": "negative"}, {"name": "tamarack cellars", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA ROSA, Calif., Jan. 15, 2018 /PRNewswire/ -- Vintage Wine Estates announced today the acquisition of Tamarack Cellars in Walla Walla, Washington. Founded in 1998 by Ron and Jamie Coleman, Tamarack Cellars is highly regarded for its range of wines including Firehouse Red blend, Merlot and Cabernet Sauvignon, as well as a number of limited-production, single-vineyard reserve blends sourced from the state's top vineyards.\n\"Tamarack Cellars exemplifies what is so very exciting about Washington winemaking, thanks to the vision of the founder, Ron Coleman and the quality and diversity of the state's microclimates and vineyards,\" commented Pat Roney, President and CEO of Vintage Wine Estates. \"I am delighted to add Tamarack Cellars to our portfolio.\"\n\"As much as I have loved and am proud of everything we have done building Tamarack, it is with great pleasure that Jamie and I are turning things over to Vintage Wine Estates,\" said Ron Coleman. \"I've been impressed by everyone at Vintage Wine Estates, they are real pros. I feel good about the Tamarack team joining a group that is capable of and committed to making the wines Tamarack is known for. They also bring the additional tools needed to grow the brand successfully. After 20 years, leaving is bittersweet, but leaving the winery and the people who make it what it is in good hands makes it mostly sweet.\"\nLong-time Winemaker Danny Gordon will continue in his leadership role in the crafting of the wines. All Tamarack Cellars personnel have been retained to continue to deliver consistent service and guest experiences to the Tamarack customer.\nTamarack has been featured in the Wine Spectator TOP 100 three times, including twice with their Firehouse Red, which retails for under $20. Firehouse Red has received dozens of other accolades including Best Red Wine Blend under $20 three years in a row from Seattle Magazine in its annual \"Best of Washington Wine\" issue. Tamarack Cellars has received the Winery of the Year award from Wine & Spirits magazine and the single-vineyard reserve blends consistently garner scores in the mid-90s.\nThe purchase of Tamarack Cellars comes on the heels of the recent acquisition of the California brands Layer Cake, Cherry Pie and If You See Kay, a deal which closed on January 2, 2018.\nTamarack Cellars is housed in a renovated firehouse in a World War II army base in Walla Walla, hence the name of the flagship blend. Case production is approximately 25,000 cases and the purchase includes inventory, grower contracts and tasting room. Financial terms were not disclosed.\nMetis, an Exvere Company, served as the exclusive financial and transactional advisor to Tamarack Cellars.\nAbout Tamarack\nTamarack Cellars is one of Walla Walla's pioneering wineries, founded in 1998 by Ron and Jamie Coleman in a historic World War II Firehouse at the Walla Walla Airport district. Winemaker Danny Gordon recently completed his 19 th harvest at Tamarack and is known for producing high scoring wines that consistently over-deliver for their price points. Tamarack wines have been selected by the Wine Spectator for their annual list of the TOP 100 Wines in the World three times. Tamarack wines are distributed nationally in 30 states.\nAbout Vintage Wine Estates\nVintage Wine Estates is a privately held wine company owned by a group of vintner families with deep roots in the wine business. The families own a collection of winery estates and brands including Clos Pegase Winery, Cosentino Winery, Girard Winery, B.R. Cohn Winery, Swanson Vineyards, Viansa Sonoma, Windsor Vineyards, Cameron Hughes, Firesteed, Cartlidge & Browne, Sonoma Coast Vineyards, Middle Sister, Tall Dark Stranger, Pro-mis-Q-ous, Monogamy, Girl & Dragon, Purple Cowboy and a number of exclusive wine brands. Vintage Wine Estates is a majority partner in Splinter Group Spirits, producing craft Kentucky Bourbon whiskey (Straight Edge), American whiskey (Slaughter House) and Partner Vermouth and markets Clayhouse and Buried Cane wines. An industry leader across all sales channels and dedicated to providing wine consumers with a range of wines from $10 to $100+ dollars, Vintage Wine Estates produces outstanding wines from Napa, Sonoma, Mendocino and other premium California winegrowing regions and respects the way people buy their wine across all sales channels: at wineries, retail, telephone, television and Internet. www.vintagewineestates.com\nAbout Metis\nMetis, an Exvere Company, advises Pacific Northwest businesses on capital transactions including mergers, acquisitions, and recapitalizations. With offices in Seattle, Walla Walla, and the Willamette Valley, Metis offers concentrated experience and expertise in the Pacific Northwest wine, adult beverage, and hospitality industries. For more information about Metis please visit www.metisnw.com\nFor More information Contact:\nVintage Wine Estates\nMary Ann Vangrin\n707-738-0338\nmvangrin@vintagewineestates.com\nTamarack Cellars\nRon Coleman\n509-520-8949\nron@tamarackcellars.com\nView original content: http://www.prnewswire.com/news-releases/vintage-wine-estates-acquires-tamarack-cellars-300582618.html\nSOURCE Vintage Wine Estates", "external_links": ["http://www.vintagewineestates.com/", "http://www.prnewswire.com/news-releases/vintage-wine-estates-acquires-tamarack-cellars-300582618.html", "http://www.metisnw.com/"], "published": "2018-01-15T21:22:00.000+02:00", "crawled": "2018-01-15T23:00:43.000+02:00", "highlightTitle": ""}