{"organizations": [], "uuid": "0567b8f078b32ec3b6d747be56d83a35a1eacfb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 17}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104929061-GettyImages-482282647.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/claires-says-lab-results-rebut-asbestos-claims.html", "country": "US", "domain_rank": 767, "title": "Claire's says lab results rebut Asbestos claims", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.207, "site_type": "news", "published": "2018-01-05T01:34:00.000+02:00", "replies_count": 0, "uuid": "0567b8f078b32ec3b6d747be56d83a35a1eacfb0"}, "author": "Lauren Hirsch", "url": "https://www.cnbc.com/2018/01/04/claires-says-lab-results-rebut-asbestos-claims.html", "ord_in_thread": 0, "title": "Claire's says lab results rebut Asbestos claims", "locations": [], "entities": {"persons": [{"name": "claire", "sentiment": "negative"}, {"name": "mother kristi warner", "sentiment": "none"}, {"name": "chris ratcliffe", "sentiment": "none"}, {"name": "kristi warner", "sentiment": "none"}], "locations": [{"name": "rhode island", "sentiment": "none"}], "organizations": [{"name": "asbestos", "sentiment": "negative"}, {"name": "wjar-tv", "sentiment": "none"}, {"name": "merck kgaa", "sentiment": "none"}, {"name": "bloomberg | getty images  jewelry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Claire's says lab results rebut asbestos claims Jewelry store Claire's said lab results deemed its products to be free of asbestos Mother Kristi Warner last month said she sent her daughter's glitter makeup kit to a lab that found asbestos its products SHARES Chris Ratcliffe | Bloomberg | Getty Images \nJewelry store Claire's said Thursday that lab results certified its products as asbestos-free, following allegations of the toxic substance in its products last month . \n\"We are pleased to report that test results received to date from two certified independent labs confirm that the products in question are asbestos free, completely safe and meet all government requirements,\" the retailer said Thursday. \n\"We also confirmed that the talc ingredient that is used in the cosmetics was sourced from Merck KGaA and is asbestos free. Any report that suggests that the products are not safe is totally false.\" \nA report in December from WJAR-TV in Rhode Island cited Kristi Warner, who mailed her daughter's glitter makeup kit to a lab, which said it contained tremolite asbestos, a toxic, cancer-causing material. \nWarner works at the Deaton Law Firm, which focuses primarily on mass tort asbestos litigation. Warner sent the products to be tested, because her background made her aware of the potential danger of the makeup, which was a gift to her daughter, she told CNBC at the time. \nSean Fitzgerald, director of research and legal services at the Scientific Analytical Institute, which conducted those tests, frequently testifies on behalf of plaintiffs in asbestos tort litigation. He did the initial tests for free for Warner, he told CNBC. When the lab tested more products to see if asbestos results proved to be widespread, the Deaton Law Firm footed the bill, he said. \nFitzgerald told CNBC on Thursday that he stands by the results. He said some companies can use testing methods that, although approved, are not up to today's testing standards. \nTesting methods are not always black and white. Last year, Fitzgerald's testimony in an asbestos suit against Colgate-Palmolive was excluded, because the judge deemed that Fitzgerald \"[modified] and/or var[ied] from accepted methodologies,\" according to legal news website Law360. \nFitzgerald addressed the issue in the Colgate-Palmolive suit by saying his testing methods have been accepted in other courts, and each judge views testing methods differently. \nClaire's also said in its statement that it has made multiple request for detailed test data, but it has not been provided. \nFitzgerald said the detailed data is with his client, the Deaton Law Firm. Warner said that a document has been sent over to Claire's outlining testing methods. She also said the firm was still in possession of the items that had produced the asbestos positive results, so Claire's has not tested those specific products for asbestos. \nA source familiar with the situation said Claire's believes the documents sent to its lawyers were insufficient. \nJohn Deaton, who founded the East Providence, Rhode Island, law firm, could not be immediately reached for comment on Thursday.", "external_links": [], "published": "2018-01-05T01:34:00.000+02:00", "crawled": "2018-01-05T01:33:41.010+02:00", "highlightTitle": ""}