{"organizations": [], "uuid": "9bc9d6e5c9b7c6ec5b674a40ba84c82b546a09e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/rio-tinto-sec/u-s-sec-says-rio-tinto-ex-ceo-ex-cfo-must-face-fraud-case-idUSKBN1FC38X", "country": "US", "domain_rank": 408, "title": "U.S. SEC says Rio Tinto, ex-CEO, ex-CFO must face fraud case", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T10:40:00.000+02:00", "replies_count": 0, "uuid": "9bc9d6e5c9b7c6ec5b674a40ba84c82b546a09e5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/rio-tinto-sec/u-s-sec-says-rio-tinto-ex-ceo-ex-cfo-must-face-fraud-case-idUSKBN1FC38X", "ord_in_thread": 0, "title": "U.S. SEC says Rio Tinto, ex-CEO, ex-CFO must face fraud case", "locations": [], "entities": {"persons": [{"name": "rio tinto", "sentiment": "negative"}, {"name": "thomas albanese", "sentiment": "none"}, {"name": "guy elliott", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "rio tinto pl", "sentiment": "none"}, {"name": "mozambique", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "rio tinto", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "u.s. district court", "sentiment": "none"}, {"name": "anglo-australian", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - The top U.S. securities regulator on Tuesday rejected arguments by Rio Tinto Plc and two former top executives that its civil lawsuit claiming they concealed the plunging value of coal assets owned by the big Anglo-Australian mining company should be dismissed.\nIn letters filed with the U.S. District Court in Manhattan, the Securities and Exchange Commission said its complaint adequately alleged that fraud occurred, and that Rio Tinto, former Chief Executive Thomas Albanese and former Chief Financial Officer Guy Elliott intended to deceive investors.\nRio Tinto responded by referring to its statement in October that it believed the lawsuit was unwarranted and that a court or jury would reject the SEC’s claims.\nLawyers for the defendants did not immediately respond to requests for comment or had no immediate comment.\nThe SEC accused Rio Tinto of ignoring the need to write down most of the value of Mozambique coal assets it had bought for $3.7 billion in April 2011, while it was raising roughly $5.5 billion from U.S. investors.\nRio Tinto wrote off most of the value in January 2013, and sold the assets in late 2014 for just $50 million.\n“This is not simply a case about Rio Tinto’s valuation of Rio Tinto Coal Mozambique,” the SEC said in one of Tuesday’s letters.\n“Rio Tinto, Albanese, and Elliott faced enormous pressure to structure a successful deal in light of the fact that they were responsible for an earlier disastrous multibillion dollar acquisition,” the SEC said.\nThe SEC also rejected Rio Tinto’s contention that any alleged misstatements and omissions might be immaterial because the writedown was for only 3 percent of company assets.\nIt said that had Rio Tinto properly written down the assets, its net earnings for the first half of 2012 would have been reduced by more than 50 percent.\n“Accordingly, the question of materiality must be decided by a jury,” the SEC said.\nIn letters on Jan. 16 explaining why the lawsuit should be dismissed, Albanese said he acted at all times as a “reasonable” CEO would, and Elliott said he relied on a “well-tested and rigorous process” to ensure that Rio Tinto reported its financials properly.\nThe SEC case is being overseen by U.S. District Judge Analisa Torres. It is unclear when she will rule on defence motions to dismiss it.\nReporting by Jonathan Stempel in New York; Additional reporting by Sonali Paul in Melbourne; Editing by Richard Chang\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T10:40:00.000+02:00", "crawled": "2018-01-24T06:41:04.000+02:00", "highlightTitle": ""}