{"organizations": [], "uuid": "26bf709bbba069d39d32d152a978b5eefa29c8f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-global-agriculture-urbanisation/urban-farms-critical-to-combat-hunger-and-adapt-to-climate-change-idUSKBN1F01A9", "country": "US", "domain_rank": 408, "title": "Urban farms 'critical' to combat hunger and adapt to climate change", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.927, "site_type": "news", "published": "2018-01-11T19:08:00.000+02:00", "replies_count": 0, "uuid": "26bf709bbba069d39d32d152a978b5eefa29c8f2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-agriculture-urbanisation/urban-farms-critical-to-combat-hunger-and-adapt-to-climate-change-idUSKBN1F01A9", "ord_in_thread": 0, "title": "Urban farms 'critical' to combat hunger and adapt to climate change", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "rome", "sentiment": "negative"}, {"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "arizona state university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROME (Thomson Reuters Foundation) - They may look small scale, but rooftop farms, vertical gardens and allotments could prove crucial in fighting hunger in urban areas, researchers said Wednesday.\nUrban farms also increase vegetation cover - a key way to limit rising temperatures.\nThey reduce the “urban heat island effect”, where cities are often several degrees warmer than nearby rural areas due to heat trapped by dark-coloured roads and buildings, researchers said.\nUrban farms can lower the risk of flooding during heavy downpours and help to remain water in dry areas, according to a paper published in the journal Earth’s Future.\nIn developing regions, “urban agriculture may be critical to survival or a necessary adaptation to changing climate”, said the team of researchers, led by the Arizona State University and Google.\nUrban farms could supply almost the entire recommended consumption of vegetables for city dwellers, while cutting food waste and reducing emissions from the transportation of agricultural products.\nThe researchers analyzed multiple datasets in Google Earth Engine, an internet platform for processing geographical data, to derive global scale estimates.\nUrban agriculture has the potential to save energy equivalent to the use of air conditioners in nearly 9 million United States households, and to produce up to 180 million tonnes of food, they found.\nWhile this represents only about 10 percent of the global production of pulses, roots and vegetables, it provides “a partial solution”, said Matei Georgescu, associate professor at Arizona State University and co-author of the paper.\nThe U.S., China, Brazil, India, Russia, Germany and Japan have the most potential benefit from urban farming. With more than 2 million hectares, the U.S. has more urban area available than any other country.\nGeorgescu said he hopes urban planners in Africa and Asia will see the potential of urban agriculture too.\nAccording to the United Nations, two-thirds of the world’s population may live in cities by 2050, with new urban areas concentrated in Asia and Africa.\nGeorgescu also encouraged people to calculate this potential for their local areas themselves using method provided in the paper.\n“One simply has to include their own locally produced data, which might be better than the global data we had to use, and produce their own estimates,” he told the Thomson Reuters Foundation in a phone interview.\nUrban farms have become popular in recent years as governments and residents look to promote healthy eating, tackle environmental challenges and transform industrial cities.\nPittsburgh is establishing the largest urban farm in the U.S., post office workers in Paris are growing vegetables and breeding chickens on a rooftop, while a warehouse in London is farming fish and greens.\nReporting By Thin Lei Win, Editing by Jared Ferrie; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, corruption and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T19:08:00.000+02:00", "crawled": "2018-01-11T17:00:47.006+02:00", "highlightTitle": ""}