{"organizations": [], "uuid": "bdd6b92e94f77643fb4742083abb748a0f812211", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224901349&w=1200&r=LYNXMPEE0N1ZO", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-davos-meeting-state-bank-india/indias-sbi-expects-loan-demand-to-rise-with-government-spending-idUSKBN1FD2RE", "country": "US", "domain_rank": 408, "title": "India's SBI expects loan demand to rise with government spending", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.596, "site_type": "news", "published": "2018-01-25T03:11:00.000+02:00", "replies_count": 0, "uuid": "bdd6b92e94f77643fb4742083abb748a0f812211"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-meeting-state-bank-india/indias-sbi-expects-loan-demand-to-rise-with-government-spending-idUSKBN1FD2RE", "ord_in_thread": 0, "title": "India's SBI expects loan demand to rise with government spending", "locations": [], "entities": {"persons": [{"name": "kumar", "sentiment": "none"}, {"name": "rajnish kumar", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "sbi", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "state bank of india", "sentiment": "none"}, {"name": "finance ministry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland (Reuters) - Demand for loans from Indian companies is still muted but should increase following more government spending on infrastructure projects, the head of the country’s largest state-owned bank said on Wednesday.\nRajnish Kumar, who was promoted last October to chairman of the State Bank of India, also said he expected the government to strictly monitor corporate governance and other reform measures after a $33 billion capital injection to bail out the state-run banking sector.\n“I would have liked to see a much bigger project pipeline than what it is today. But there are certain sectors which are seeing investment,” Kumar said in an interview on the sidelines of the World Economic Forum in Davos, Switzerland.\n“But hopefully, the investment demand should revive now because of the government’s spend on infrastructure,” Kumar said. “So that should lead to the revival of investment demand.”\nIn recent months, the Indian finance ministry has said it wants to boost spending on sectors such as infrastructure, including ports and roads, to boost economic growth.\nThe SBI is the largest of 21 lenders that are majority owned by the Indian government and together account for more than two-thirds of the nation’s banking assets. The banks have, however, suffered more in recent years than their nimble private sector rivals after raking up record bad loans.\nState Bank of India (SBI) Chairman Rajnish Kumar attends a news conference in Mumbai, India, November 23, 2017. REUTERS/Danish Siddiqui An economic slowdown that led to stalling of large projects coupled with over-leveraged companies has hit loan growth to industries. Loan growth has recently started showing signs of a pick-up, partly due to a lower base, after falling to a 2-1/2 decade low at the end of last financial year ended March 2017.\nAmong the sectors seeing a pick-up in activity, Kumar named renewable energy, roads and housing.\n“When the government spends also then the private sector investment will follow,” Kumar said, referring to sectors such as steel and cement that would likely benefit from higher demand in roads and housing, and where plants are largely run by private sector companies.\nSeparately, India pledged on Wednesday to inject by March nearly $14 billion in 20 state-run banks, including SBI, to help the sector boost lending and tackle bad loans. Weaker banks such as IDBI Bank and Bank of India received a larger share of the recapitalization.\nKumar called it a “balancing act”, but added the next tranche of the capital allocation will be strictly based on performance of the banks against reform measures suggested by the government.\n“Message is also very loud and clear from the government that it’s not that they will continue to be supported forever,” Kumar said.\nReporting by Paritosh Bansal; Writing by Devidutta Tripathy; Editing by Adrian Croft\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T03:11:00.000+02:00", "crawled": "2018-01-25T12:57:53.000+02:00", "highlightTitle": ""}