{"organizations": [], "uuid": "d551c14b1be3aa39060487ddc943e4eb1708fc57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/01/103433402-RTX266R3.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/us-stocks-gdp-economy-trump.html", "country": "US", "domain_rank": 767, "title": "Stocks open higher on better-than-expected earnings, continuing economic growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.772, "site_type": "news", "published": "2018-01-26T16:30:00.000+02:00", "replies_count": 0, "uuid": "d551c14b1be3aa39060487ddc943e4eb1708fc57"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/26/us-stocks-gdp-economy-trump.html", "ord_in_thread": 0, "title": "Stocks open higher on better-than-expected earnings, continuing economic growth", "locations": [], "entities": {"persons": [{"name": "brendan mcdermid", "sentiment": "none"}, {"name": "nick raich", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "rockwell", "sentiment": "negative"}, {"name": "intel", "sentiment": "negative"}, {"name": "honeywell", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "commerce department", "sentiment": "none"}, {"name": "factset", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "reuters traders", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dow pops 224 points, stocks notch record close on strong earnings The Dow, S&P 500 and Nasdaq hit record highs on Friday. AbbVie, Honeywell, Intel and Rockwell are among the latest companies to report better-than expected earnings and revenue. 5 Hours Ago | 02:03 \nU.S. stocks closed sharply higher on Friday as quarterly earnings top estimates, while the economy continues to grow. \nThe Dow Jones industrial average rose 223.92 points and hit intraday and closing records. The 30-stock index finished the session at 26,616.71. \nThe S&P 500 gained 1.2 percent to 2,872.87, with tech and health care as the best-performing sectors, and also reached an all-time high. The broad index also had its biggest one-day gain since March 1, 2017. \nThe Nasdaq composite advanced 1.3 percent to close at 7,505.77 and notched record highs. It also had its best day since Jan. 2. \nThe major indexes also posted weekly gains of at least 2 percent. \nAbbVie, Honeywell, Intel and Rockwell are among the latest companies to report better-than expected earnings and revenue. \nShares of AbbVie and Honeywell rose 13.8 percent and 1.9 percent, respectively, while Intel gained 10.6 percent. Rockwell advanced 1.7 percent. \nOverall, this earnings season have been strong thus far. Of the S&P 500 companies that have reported as of Friday morning, 80 percent have reported-better-than-expected earnings while 82 percent have surpassed sales estimates, according to data from Thomson Reuters I/B/E/S. \n\"The beat rates and growth rates are as good as we have measured for these 133 companies in any earnings season over the past five years,\" said Nick Raich, CEO of The Earnings Scout, in a note. \"Most importantly, 1Q 2018 EPS estimates are rising and that is the first time we have seen aggregate S&P 500 EPS estimates going higher in any earnings season in seven years.\" Brendan McDermid | Reuters Traders work on the floor of the New York Stock Exchange. \nWall Street also digested key U.S. economic data on Friday. The Commerce Department the U.S. economy grew by 2.6 percent during the fourth quarter of 2017. Economists polled by Reuters expected a gain of 3 percent. \n\"These are disappointing numbers, no doubt, especially because 3% growth has become a sort of new normal,\" Mike Loewengart, vice president of investment strategy at E-Trade, said in a note. \" Still, 2017 was one of the best economic runs in years. ... This economy is still chugging along, especially as businesses are projecting really positive outcomes thanks to tax reform.\" \nMeanwhile, U.S. durable goods orders rose 2.9 percent in December, according to the Commerce Department. Economists expected an increase of 0.8 percent. \nElsewhere, the U.S. dollar traded 0.4 percent lower, adding to this week's losses. The greenback is down 1.5 percent for the week, following comments made by Treasury Secretary Steven Mnuchin. \nAt the World Economic Forum in Davos, Switzerland on Wednesday, Mnuchin said he welcomed a weaker U.S. dollar, adding that it would benefit the country's trade. His remarks sent the currency to its lowest levels in three years.", "external_links": [], "published": "2018-01-26T16:30:00.000+02:00", "crawled": "2018-01-26T16:31:37.002+02:00", "highlightTitle": ""}