{"organizations": [], "uuid": "15b1e9118c63b8aeeb6547edb2268315886ea4d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-755756659.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/indiana-could-become-the-6th-state-to-increase-smoking-age-to-21/", "country": "US", "domain_rank": 1196, "title": "Indiana Could Become 6th State to Raising Smoking Age to 21 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.814, "site_type": "news", "published": "2018-01-30T02:00:00.000+02:00", "replies_count": 0, "uuid": "15b1e9118c63b8aeeb6547edb2268315886ea4d0"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/30/indiana-could-become-the-6th-state-to-increase-smoking-age-to-21/", "ord_in_thread": 0, "title": "Indiana Could Become 6th State to Raising Smoking Age to 21 | Fortune", "locations": [], "entities": {"persons": [{"name": "kirsten korosec", "sentiment": "negative"}, {"name": "charlie brown of gary", "sentiment": "none"}], "locations": [{"name": "indiana", "sentiment": "none"}], "organizations": [{"name": "house public policy committee", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "indiana grocery and convenience store association", "sentiment": "none"}, {"name": "chicago tribune", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec January 30, 2018 \nIndiana lawmakers are considering raising the purchase age for tobacco products from 18 to 21 years old. If it becomes law, Indiana would be the sixth state to increase the smoking to 21. \nLegislation that would raise the purchase age has been tried and failed before. But this time, there was enough support for House Bill 1380 to pass a legislative committee this week. The House Public Policy Committee voted unanimously to increase the cigarette purchasing age from 18 to 21 years old, reported the Chicago Tribune . \nHowever, the path to a law is still littered with challenges. The bill, sponsored by Democrat Charlie Brown of Gary, will have to pass the state’s Republican-controlled House, before moving onto the Senate. Opponents to the law, which includes the Indiana Grocery and Convenience Store Association, argue young people who are old enough to vote and serve in the military should be able to make their own choices. There’s also a concern that pushing up the age requirements will shift revenue of cigarette sales to border states that allow anyone 18 and older to buy tobacco products, a move that could harm small businesses and reduce tax revenue. Supporters argue that increasing the age to 21 will reduce smoking rates, which in turn, will cut health costs for the state. \nIndiana consistently ranks lower on nationwide health rankings. More than 21% of adults use cigarettes in Indiana, according to 2016 statistics from the Center for Disease Control and Prevention. More than 11% of youth, in grades 9 through 12, smoke in the state, according to the CDC. \nResearch published last week in The BMJ , the British Medical Journal’s online publication, found that smoking just one cigarette per day—as opposed to 20, the average number in a pack—still raises your risk of heart disease and stroke. \nHeart disease is the leading cause of death for men and women in the United States, according to the CDC . \nLast year, Oregon became the fifth state to raise the legal age to buy tobacco products to 21. The law went into effect Jan. 1. California and Hawaii were the first states to pass a law that bars the sale of cigarettes and other tobacco products to people younger than 21. New Jersey and Maine followed in 2017. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-30T02:00:00.000+02:00", "crawled": "2018-01-31T16:30:23.000+02:00", "highlightTitle": ""}