{"organizations": [], "uuid": "7f09fb5544486a1c3d887a2c1740cbe3718d4a8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223258895&w=1200&r=LYNXMPEE0I0A8", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-northkorea-missiles-parade/north-korea-may-hold-military-parade-on-eve-of-olympics-analysts-say-idUSKBN1F80JF", "country": "US", "domain_rank": 408, "title": "North Korea may hold military parade on eve of Olympics, analysts say", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T08:42:00.000+02:00", "replies_count": 0, "uuid": "7f09fb5544486a1c3d887a2c1740cbe3718d4a8e"}, "author": "", "url": "https://www.reuters.com/article/us-northkorea-missiles-parade/north-korea-may-hold-military-parade-on-eve-of-olympics-analysts-say-idUSKBN1F80JF", "ord_in_thread": 0, "title": "North Korea may hold military parade on eve of Olympics, analysts say", "locations": [], "entities": {"persons": [{"name": "scott lafoy", "sentiment": "none"}, {"name": "josh smith", "sentiment": "none"}], "locations": [{"name": "north korea", "sentiment": "none"}, {"name": "u. s.", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "united nations security council", "sentiment": "none"}, {"name": "nk pro", "sentiment": "none"}, {"name": "min read  seoul", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "korean people’s army", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 6:42 AM / in 9 hours North Korea may hold military parade on eve of Olympics, analysts say Josh Smith 3 Min Read \nSEOUL (Reuters) - North Korea may be preparing to hold a military parade on the eve of next month’s winter Olympics in South Korea, analysts and diplomats say, even as the two countries have sought to mend ties. \nThe North’s continued development of nuclear weapons and intercontinental ballistic missiles in defiance of United Nations Security Council resolutions has spurred more sanctions and talk of possible military strikes by U. S. officials. \nWestern diplomats in Pyongyang have said some international defense officials received invitations to a 70th anniversary commemoration of the Korean People’s Army on Feb 8. \nRecent commercial satellite imagery shows formations of North Korean troops marching at a parade training ground, said Scott LaFoy, an analyst with the website NK Pro, which monitors North Korea. \n“The parade appears to involve 28 formations of infantry or other military personnel, a traditional military band, and possibly additional personnel,” LaFoy wrote in an analysis of the satellite imagery. \nSome military vehicles could also be involved, he added. \nIf North Korea conducts a large military demonstration on February 8, it would come a day before the opening ceremony of the Pyeongchang Winter Olympics in South Korea. \nThat event will see athletes from the two sides march under a single flag, in a demonstration of unity after kicking off official talks for the first time in two years in January. \nA display of military might by Pyongyang could threaten that fragile detente. \nThe Mirim Parade Training Ground, where the formations were spotted, is typically only very active before parades, which in past years have been used to showcase the North’s growing missile arsenal, LaFoy said. Related Coverage Russia will abide by all of its international commitments on North Korea: Kremlin \nThe planned parade appears to be smaller than last year’s massive display, and imagery shows no evidence of large vehicles of the type that might carry missiles, he said. \nOn Tuesday, Michael Spavor, director of the Paektu Cultural Exchange, which promotes business and cultural ties with the North, said on Twitter he had heard reports of such a parade, adding that his group would offer a trip for tourists to watch it. Writing by Josh Smith; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-19T08:42:00.000+02:00", "crawled": "2018-01-19T08:52:47.002+02:00", "highlightTitle": ""}