{"organizations": [], "uuid": "8d3e1688b9e1b77f4816b62bc9a87b6388b86ab1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223940882&w=1200&r=LYNXMPEE0K0U7", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-italy/mertens-keeps-napoli-top-of-serie-a-lazio-hit-five-idUKKBN1FA13S", "country": "US", "domain_rank": 408, "title": "Mertens keeps Napoli top of Serie A, Lazio hit five", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T21:36:00.000+02:00", "replies_count": 0, "uuid": "8d3e1688b9e1b77f4816b62bc9a87b6388b86ab1"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-italy/mertens-keeps-napoli-top-of-serie-a-lazio-hit-five-idUKKBN1FA13S", "ord_in_thread": 0, "title": "Mertens keeps Napoli top of Serie A, Lazio hit five", "locations": [], "entities": {"persons": [{"name": "lazio", "sentiment": "neutral"}, {"name": "mertens", "sentiment": "neutral"}, {"name": "serie a.  lazio", "sentiment": "none"}, {"name": "fabio quagliarella", "sentiment": "none"}, {"name": "franck kessie", "sentiment": "none"}, {"name": "napoli", "sentiment": "none"}, {"name": "maurizio sarri", "sentiment": "none"}, {"name": "ciro immobile", "sentiment": "none"}], "locations": [{"name": "napoli", "sentiment": "none"}, {"name": "atalanta", "sentiment": "none"}], "organizations": [{"name": "mertens", "sentiment": "neutral"}, {"name": "napoli", "sentiment": "neutral"}, {"name": "min read  milan", "sentiment": "none"}, {"name": "cagliari", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "chievo", "sentiment": "none"}, {"name": "ac milan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "coppa italia", "sentiment": "none"}, {"name": "dries mertens", "sentiment": "none"}, {"name": "juventus", "sentiment": "none"}, {"name": "sampdoria", "sentiment": "none"}, {"name": "inter milan", "sentiment": "none"}, {"name": "roma", "sentiment": "none"}, {"name": "fiorentina", "sentiment": "none"}, {"name": "genoa", "sentiment": "none"}, {"name": "atalanta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 7:36 PM / Updated an hour ago Mertens keeps Napoli top of Serie A, Lazio hit five Reuters Staff 3 Min Read \nMILAN (Reuters) - Napoli survived a tough test at Atalanta on Sunday as Dries Mertens’ second-half goal secured a 1-0 win that kept them top of Serie A. \nLazio scored five goals for the second league game in a row as they hammered Chievo 5-1 despite an injury to Serie A top-scorer Ciro Immobile while veteran Fabio Quagliarella grabbed a hat-trick in Sampdoria’s 3-1 win over Fiorentina. \nFranck Kessie scored twice to give AC Milan a 2-1 win in windy conditions at Cagliari as both teams had a player sent off. \nNapoli, who avenged their home Coppa Italia defeat by Atalanta earlier this month, lead with 54 points from 21 games, four clear of Juventus who host Genoa on Monday with Lazio third on 43. Inter Milan (42 points) host AS Roma (39) in the late game. \n“We’ve won a really difficult match against a team that always makes us suffer. I‘m very happy for us and our supporters.” Napoli coach Maurizio Sarri said. “This was a very valuable win.” \nMertens ran on to a through ball by Jose Callejon and let the ball bounce several times before scoring with a dipping half-volley over goalkeeper Etrit Berisha in the 65th minute. \nThe Belgian, who had not scored in his last nine league games, took his tally for the season to 11 as his side extended their unbeaten away record in the league to 24 games. \nLazio went ahead through Luis Alberto in the 23rd minute, were pegged back by Manuel Pucciarelli’s goal two minutes later and regained the lead through Sergej Milinkovic-Savic just after the half hour. Soccer Football - Serie A - Atalanta vs Napoli - Stadio Atleti Azzurri, Bergamo, Italy - January 21, 2018 Napoli's Marek Hamsik receives instructions from coach Maurizio Sarri REUTERS/Alberto Lingria \nImmobile, who has scored 20 league goals this season, limped off shortly afterwards. \nChievo were awarded a penalty in first-half stoppage time for a foul by Senad Lulic on Mariusz Stepinksi but the referee changed his mind after consulting the video replay system (VAR). Soccer Football - Serie A - Atalanta vs Napoli - Stadio Atleti Azzurri, Bergamo, Italy - January 21, 2018 Napoli coach Maurizio Sarri REUTERS/Alberto Lingria \nMilinkovic-Savic scored the third with a brilliant volley in the 68th minute before Bastos and Nani added two more in the final 10 minutes to floor the Flying Donkeys. \nQuagliarella opened his account against Fiorentina after half an hour, fired home the second after 60 minutes and completed his hat-trick with a close-range effort as Sampdoria moved up to sixth on 33 points. \nCarlos Sanchez scored a consolation for the visitors. \nCrotone won the relegation battle at Verona 3-0 and Bologna beat bottom club Benevento by the same score. Udinese were held 1-1 at home by SPAL and Torino’s visit to Sassuolo ended with the same scoreline. \nMilan fell behind after eight minutes at Cagliari when Nicolo Barella, later sent off for a second bookable offence, scored with a shot which bounced awkwardly in front of Gianluigi Donnarruma. \nKessie levelled from a penalty in the 35th minute and the Ivorian struck again six minutes later. Milan defender Ricardo Rodriguez was sent off in the 81st minute for two yellow cards, both for fouls on Paolo Farago. Writing by Brian Homewood in Bern,; Editing by Ed Osmond", "external_links": [], "published": "2018-01-21T21:36:00.000+02:00", "crawled": "2018-01-21T21:59:40.008+02:00", "highlightTitle": ""}