{"organizations": [], "uuid": "97889b5bb39f24f2c1b78e01168a0a2dc3440e32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-vertiv-expands-thermal-management-portfolio-with-acquisition-of-energy-labs.html", "country": "US", "domain_rank": 767, "title": "Vertiv Expands Thermal Management Portfolio With Acquisition of Energy Labs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.635, "site_type": "news", "published": "2018-01-16T16:00:00.000+02:00", "replies_count": 0, "uuid": "97889b5bb39f24f2c1b78e01168a0a2dc3440e32"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-vertiv-expands-thermal-management-portfolio-with-acquisition-of-energy-labs.html", "ord_in_thread": 0, "title": "Vertiv Expands Thermal Management Portfolio With Acquisition of Energy Labs", "locations": [], "entities": {"persons": [{"name": "vertiv", "sentiment": "none"}], "locations": [{"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "acquisition of energy labs acquisition", "sentiment": "negative"}, {"name": "energy labs", "sentiment": "none"}, {"name": "emerson network power", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Acquisition adds offerings and capabilities for cloud, colocation providers and commercial and industrial segment\nCOLUMBUS, Ohio--(BUSINESS WIRE)-- Vertiv, formerly Emerson Network Power, has acquired Energy Labs, a privately owned, U.S.-based manufacturer of custom air handling systems. The acquisition strengthens Vertiv’s leading position in the data center thermal management space and enables expansion into commercial and industrial segments with industry-leading cooling solutions.\nEnergy Labs manufactures custom air handling and modular solutions, including direct evaporative, indirect evaporative and direct expansion cooling technologies. These additions to the Vertiv portfolio significantly increase Vertiv capabilities in the commercial and industrial space, creating additional opportunities to work with universities, hospitals, airports, office buildings and other critical commercial segments where air handling systems are the preferred cooling solution. Cloud and colocation providers also are driving a robust market for these large, free-cooling air handling solutions, and this acquisition bolsters the Vertiv portfolio for these important customers.\n“This acquisition supports our growth strategy to find companies that both align with our values and bolster our current offerings,” said Vertiv CEO Rob Johnson. “Energy Labs is a perfect fit, with talented people, innovative technologies and complementary expertise that will help us continue to meet the needs of our customers, while also expanding into adjacent markets.”\nEnergy Labs is headquartered in San Diego, California and has more than 900 employees in the U.S. and Mexico. The West Coast location expands Vertiv’s footprint and increases visibility and accessibility to customers in the western U.S.\n“This is an exciting step for Energy Labs, and I look forward to working with Vertiv to expand the impact our organizations can have together,” said Ray Irani, president of Energy Labs. “The complementary nature of our portfolios and capabilities make this a natural fit for everyone involved and present a tremendous growth opportunity for the business, especially in the commercial and industrial space.”\n“This is the first acquisition under the Vertiv banner, and it is exactly the kind of additive move we feel can accelerate the company’s growth,” said Jacob Kotzubei, partner at Platinum Equity, which is the parent company for Vertiv. “We are excited for this addition to the Vertiv family and for the opportunities it presents to provide new and existing customers with an even more comprehensive product set.”\nGreif & Co., an independent, Los Angeles-based investment bank specializing in mergers and acquisitions for entrepreneurially owned companies, represented Energy Labs in this transaction.\nAbout Vertiv\nVertiv designs, builds and services critical infrastructure that enables vital applications for data centers, communication networks and commercial and industrial facilities. Formerly Emerson Network Power, Vertiv supports today’s growing mobile and cloud computing markets with a portfolio of power, thermal and infrastructure management solutions including the Chloride ® , Liebert ® , NetSure™ and Trellis™ brands. Sales in fiscal 2016 were $4.4 billion. For more information, visit VertivCo.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005440/en/\nFor Vertiv\nMark Berry, +614-383-1605\nMark.Berry@Fahlgren.com\nSource: Vertiv", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fvertivco.com%2F&esheet=51742747&newsitemid=20180116005440&lan=en-US&anchor=VertivCo.com&index=1&md5=a4d1b8b4553420c0e10fd2efb5af4190", "http://www.businesswire.com/news/home/20180116005440/en/"], "published": "2018-01-16T16:00:00.000+02:00", "crawled": "2018-01-16T16:28:59.000+02:00", "highlightTitle": ""}