{"organizations": [], "uuid": "6895f85580bc82d8c7e42146a97d0ddd0f57a467", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219491776&w=1200&r=LYNXMPEE04057", "site_section": "https://www.reuters.com/finance/currencies", "section_title": "Currency Converter, Currencies News | Reuters.com", "url": "https://www.reuters.com/article/uk-forex-poll-euro/u-s-dollar-troubles-not-over-yet-but-2018-to-be-a-better-year-reuters-poll-idUSKBN1EU0AF", "country": "US", "domain_rank": 408, "title": "U.S. dollar troubles not over yet, but 2018 to be a better year - Reuters poll", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T11:38:00.000+02:00", "replies_count": 0, "uuid": "6895f85580bc82d8c7e42146a97d0ddd0f57a467"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-forex-poll-euro/u-s-dollar-troubles-not-over-yet-but-2018-to-be-a-better-year-reuters-poll-idUSKBN1EU0AF", "ord_in_thread": 0, "title": "U.S. dollar troubles not over yet, but 2018 to be a better year - Reuters poll", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - A rough patch for the U.S. dollar, which just recorded its worst annual performance in 14 years, is forecast to ease in 2018 but is not over yet, according to a majority of foreign exchange analysts in a Reuters poll.\nThe greenback started last year on a strong footing, underpinned by newly-elected President Donald Trump’s promises to cut taxes and spend a trillion dollars on infrastructure. However, the currency fell 10 percent by end-year.\nMost currency strategists did not foresee that, with predictions made this time last year for dollar appreciation ending up among the most inaccurate start-of-year forecasts for the ensuing 12 months since the financial crisis nearly a decade ago.\nAt one point in December the dollar did pop up more than two percent as speculators bet Congress would deliver legislation for sweeping tax cuts to corporations and individuals, which was delivered at the end of the year.\nStill, the path of least resistance for the dollar is down. The euro and other major currencies are expected to make further modest gains against the dollar by year-end, according to a Reuters poll of 70 foreign exchange analysts taken Jan 2-4.\n“The dollar is going to remain on a downward trajectory through the course of the next year,” said Jeremy Stretch, head of G10 FX strategy at CIBC Capital Markets.\n“We have a market which is already discounting additional Fed tightening and the tax measures and fiscal expansion are only going to be moderately stimulatory to the economy.”\nStretch, like other analysts, is concerned about the more than 1 trillion dollars of extra borrowing over the next decade to fund the tax cuts, but does not think that is set to put direct downward pressure on the dollar at this point.\n“The fiscal story is important, but it’s what’s happening elsewhere in central bank terms I think (that is) probably more dynamic,” he said.\nBut with the Federal Reserve widely expected to deliver three interest rate increases this year, any big shift in the dollar in either direction would have to come from a significant deviation from that set path.\n“Even if the Fed does deliver the three hikes which they are currently planning, we just don’t think it will be enough to reverse the dollar weakening trend which is currently in place,” said Lee Hardman, currency economist at MUFG.\nFor now, with inflation pressures still tame, the outlook for bond yields in a December Reuters poll of fixed-income strategists showed most of them sanguine, too, expecting only about 50 basis points more added to the 10-year note this year.\nSTILL A BETTER YEAR Asked how they expected the dollar to fare against major currencies this year, a majority of the forecasters in the latest Reuters poll said it would perform better than last year - not a hard thing to do given how bad last year was.\nCurrency speculators have trimmed their net short dollar bets to their lowest since November, according to the latest data from the Commodity Futures Trading Commission for the final week of last year.\nThe euro, which also had its best run since 2003 last year, is forecast to weaken slightly over the next three to six months before moving up to trade slightly higher at $1.210 in a year’s time, up slightly from where it is now.\nThe euro zone economy is having one of its best runs since the single currency was launched, outperforming its peers. It is forecast to continue to grow at a robust pace.\nWith the European Central Bank expected to put an end to its quantitative easing programme this year, the risk is that the euro performs even better than currently predicted.\n“We think the ECB will bring QE to an end this year and then also start to soften their forward guidance over the first rate hike, which could bring expectations of a first rate hike into focus later this year and add additional momentum to the euro,” said Hardman.\nPolling by Indradip Ghosh and Shrutee Sarkar; Editing by Ross Finley and Chizu Nomiyama, Larry King\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T11:38:00.000+02:00", "crawled": "2018-01-05T09:58:03.000+02:00", "highlightTitle": ""}