{"organizations": [], "uuid": "188c7e0c645dc40db9da3c33eb5fb4116629d241", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223818405&w=1200&r=LYNXMPEE0K05Y", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-turkey-kilis/rockets-from-syria-hit-turkish-border-town-anadolu-idUKKBN1FA04B", "country": "US", "domain_rank": 408, "title": "Turkish artillery fires in northern Syria after border town hit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T10:10:00.000+02:00", "replies_count": 0, "uuid": "188c7e0c645dc40db9da3c33eb5fb4116629d241"}, "author": "", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-turkey-kilis/rockets-from-syria-hit-turkish-border-town-anadolu-idUKKBN1FA04B", "ord_in_thread": 0, "title": "Turkish artillery fires in northern Syria after border town hit", "locations": [], "entities": {"persons": [{"name": "domi", "sentiment": "negative"}, {"name": "tayyip", "sentiment": "none"}, {"name": "evans", "sentiment": "none"}, {"name": "ezgi erkoyun", "sentiment": "none"}], "locations": [{"name": "syria", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "oncupinar", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 6:23 AM / Updated 13 minutes ago Turkish forces push into Syria, battle Kurdish militia Dominic Evans 6 Min Read \nAZAZ, Syria (Reuters) - Turkey’s army and rebel allies battled U.S.-backed Kurdish militia in Syria’s Afrin province on Sunday, stepping up a two-day-old campaign against YPG fighters that has opened a new front in Syria’s civil war. \nAmid U.S. calls for restraint, Turkish artillery pounded YPG positions, while rockets fired from inside Syria slammed into two Turkish border towns, wounding dozens, according to the local governor’s office and a witness. \nTurkey began its push to clear YPG fighters from a northwestern enclave of Syria on Saturday when it launched artillery and air strikes against their positions in Afrin in what it called “Operation Olive Branch”. \nTurkey considers the YPG a terrorist organisation and has been infuriated by U.S. support for the fighters. Washington, which is backing the YPG in the battle against Islamic State in Syria, on Sunday said it was concerned about the situation. \n“Our jets took off and started bombing. And now the ground operation is underway. Now we see how the YPG ... are fleeing in Afrin,” President Tayyip Erdogan said. “We will chase them. God willing, we will complete this operation very quickly.” \nIntense Turkish artillery fire and air strikes continued to hit some villages, the YPG said, while fierce battles raged to the north and west of Afrin against Turkish forces and their rebel allies, said Birusk Hasaka, a YPG spokesman in Afrin. \nTurkey, which is backing the Free Syrian Army rebel factions in northern Syria, wants to create a 30-km (19 mile) “safe zone” in the region, broadcaster HaberTurk quoted the prime minister, Binali Yildirim, as saying. \nBut it is targeting the U.S.-supported YPG at a time Turkey’s ties with NATO ally Washington are deeply strained. \n“We urge Turkey to exercise restraint and ensure that its military operations remain limited in scope and duration and scrupulous to avoid civilian casualties,” U.S. State Department Spokeswoman Heather Nauert said. \nTurkey did advise the United States before taking action, the U.S. Defense Secretary, Jim Mattis, said on Sunday, adding “We’ll work this out”. BORDER TOWNS HIT \nThe attacks follow weeks of warnings against the YPG in Syria from Erdogan and his ministers. Russian Foreign Minister Sergei Lavrov said in an interview with Kommersant newspaper that Turkey had been infuriated by “unilateral” U.S. actions in Syria. \nTurkey has been particularly outraged by an announcement that the U.S. planned to train 30,000 personnel in parts of northeast Syria under the control of the YPG-led Syrian Democratic Forces. \nRockets fired across the border from Syria hit the Turkish town of Reyhanli, killing a Syrian national and wounding 46 people, the local governor’s office said. Another five were wounded when rockets hit the border town of Kilis, a Reuters witness said. A Turkey-backed Free Syrian Army fighter takes up position near Menagh, Syria January 21, 2018. REUTERS/Osman Orsal \nTurkey-backed Free Syrian Army rebel factions had captured a Kurdish village with no resistance and were clearing landmines, a Turkish official said. \nThe YPG said it had repelled the Turkish forces. \n“All the Turkish military’s ground attacks against Afrin have been repelled so far and they have been forced to retreat,” Nouri Mahmoudi, a YPG official, said. Since the morning, the combatants have exchanged shelling and clashed along several frontlines around Afrin, he said. \nThousands rallied against the attacks in the border town of Amuda in northwest Syria. In Turkey, police used pepper spray against pro-Kurdish protesters in Istanbul and Ankara. Slideshow (10 Images) \nTurkey said it had hit targets including hideouts used by Kurdish militants. The YPG said Turkey’s strikes killed some civilians and accused Turkey of striking civilian districts and a camp for displaced people in Afrin. \nErdogan said some of Turkey’s allies had provided the YPG with 2,000 plane shipments and 5,000 truckloads of ammunition, comments that appeared to be aimed at the United States. \nFrance called for restraint and an emergency meeting of the United Nations Security Council which will hold talks about the situation in Syria on Monday, foreign minister Jean-Yves Le Drian said. \nRussia, which backs Syrian President Bashar al-Assad in the civil war, will demand in the United Nations that Turkey halt it’s operation in Afrin, RIA news quoted a member of the Russian parliament’s security committee as saying on Saturday. TRAINING CAMP", "external_links": [], "published": "2018-01-21T10:10:00.000+02:00", "crawled": "2018-01-21T10:30:49.000+02:00", "highlightTitle": ""}