{"organizations": [], "uuid": "fb1597fc4dae94872ff65524795242c215783255", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-invesco-reports-results-for-the-year-and-three-months-ended-december-31-2017.html", "country": "US", "domain_rank": 767, "title": "Invesco Reports Results for the Year and Three Months Ended December 31, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-31T14:55:00.000+02:00", "replies_count": 0, "uuid": "fb1597fc4dae94872ff65524795242c215783255"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-invesco-reports-results-for-the-year-and-three-months-ended-december-31-2017.html", "ord_in_thread": 0, "title": "Invesco Reports Results for the Year and Three Months Ended December 31, 2017", "locations": [], "entities": {"persons": [{"name": "martin l. flanagan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "invesco", "sentiment": "negative"}, {"name": "invesco ltd.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 31, 2018 /PRNewswire/ -- Invesco Ltd. (NYSE: IVZ) today reported financial results for the year and three months ended December 31, 2017.\n\"By providing strong investment performance and outcome-oriented solutions to our clients across the globe, Invesco achieved long-term net flows of $11.5 billion for 2017, marking our ninth consecutive year of positive long-term net flows,\" said Martin L. Flanagan, president and CEO. \"Our focus on meeting client needs also helped us deliver positive results to shareholders - we achieved record EPS of $2.75 for the year and returned $471.6 million to shareholders. For the year ahead, we will continue to invest in the business and work to strengthen our competitive position by: building our comprehensive range of active, passive and alternative capabilities; advancing our ability to meet client needs; and managing our business in ways that deliver strong value to clients, shareholders and our employees.\"\n2017\n2016\n% Change\nU.S. GAAP Financial Measures\nOperating revenues\n$5,160.3\nm\n$4,734.4\nm\n9.0\n%\nOperating income\n$1,277.1\nm\n$1,176.4\nm\n8.6\n%\nOperating margin\n24.7\n%\n24.8\n%\nNet income attributable to Invesco Ltd.\n$1,127.3\nm\n$854.2\nm\n32.0\n%\nDiluted EPS\n$2.75\n$2.06\n33.5\n%\nAdjusted Financial Measures (1)\nNet revenues\n$3,754.9\nm\n$3,393.2\nm\n10.7\n%\nAdjusted operating income\n$1,480.2\nm\n$1,312.8\nm\n12.8\n%\nAdjusted operating margin\n39.4\n%\n38.7\n%\nAdjusted net income attributable to Invesco Ltd.\n$1,105.9\nm\n$924.1\nm\n19.7\n%\nAdjusted diluted EPS\n$2.70\n$2.23\n21.1\n%\nAssets Under Management\nEnding AUM\n$937.6\nbn\n$812.9\nbn\n15.3\n%\nAverage AUM\n$875.0\nbn\n$788.8\nbn\n10.9\n%\n(1) The adjusted financial measures are all non-GAAP financial measures. See the information on pages 9 through 12 for a reconciliation to their most directly comparable U.S. GAAP measures.\nQ4-17\nQ3-17\nQ4-17 vs.\nQ3-17\nQ4-16\nQ4-17 vs.\nQ4-16\nU.S. GAAP Financial Measures\nOperating revenues\n$1,375.6\nm\n$1,337.7\nm\n2.8\n%\n$1,194.7\nm\n15.1\n%\nOperating income\n$344.3\nm\n$355.3\nm\n(3.1)\n%\n$294.2\nm\n17.0\n%\nOperating margin\n25.0\n%\n26.6\n%\n24.6\n%\nNet income attributable to Invesco Ltd.\n$408.2\nm\n$267.5\nm\n52.6\n%\n$226.5\nm\n80.2\n%\nDiluted EPS\n$0.99\n$0.65\n52.3\n%\n$0.55\n80.0\n%\nAdjusted Financial Measures (1)\nNet revenues\n$1,004.9\nm\n$976.6\nm\n2.9\n%\n$863.8\nm\n16.3\n%\nAdjusted operating income\n$399.2\nm\n$397.4\nm\n0.5\n%\n$336.0\nm\n18.8\n%\nAdjusted operating margin\n39.7\n%\n40.7\n%\n38.9\n%\nAdjusted net income attributable to Invesco Ltd.\n$299.1\nm\n$291.8\nm\n2.5\n%\n$240.1\nm\n24.6\n%\nAdjusted diluted EPS\n$0.73\n$0.71\n2.8\n%\n$0.59\n23.7\n%\nAssets Under Management\nEnding AUM\n$937.6\nbn\n$917.5\nbn\n2.2\n%\n$812.9\nbn\n15.3\n%\nAverage AUM\n$930.3\nbn\n$890.8\nbn\n4.4\n%\n$809.0\nbn\n15.0\n%\n(1) The adjusted financial measures are all non-GAAP financial measures. See the information on pages 9 through 12 for a reconciliation to their most directly comparable U.S. GAAP measures.\nAssets Under Management\nTotal assets under management (AUM) at December 31, 2017, were $937.6 billion (September 30, 2017: $917.5 billion), an increase of $20.1 billion during the fourth quarter and an increase of $124.7 billion during the year. The European ETF business acquisition added $26.0 billion in AUM upon purchase. Long-term inflows were $4.4 billion and total net inflows were $2.7 billion for the fourth quarter. Long-term inflows were $11.5 billion and total net inflows were $11.3 billion for the year, as detailed below:\nQuarter\nYear\nSummary of net flows (in billions)\nQ4-17\nQ3-17\nQ4-16\n2017\n2016\nActive\n$3.6\n$3.9\n($1.9)\n$6.8\n$6.9\nPassive\n0.8\n1.3\n2.0\n4.7\n9.6\nLong-term net flows (1,2)\n4.4\n5.2\n0.1\n11.5\n16.5\nNon-management fee earning AUM (2)\n1.6\n0.9\n(0.1)\n3.0\n(6.4)\nInstitutional money market\n(3.3)\n5.4\n1.1\n(3.2)\n12.8\nTotal net flows\n$2.7\n$11.5\n$1.1\n$11.3\n$22.9\nAnnualized long-term organic growth rate (3)\n2.3\n%\n3.0\n%\n0.1\n%\n1.7\n%\n2.6\n%\n(1) Reinvested dividends and capital gains of $5.9 billion and $1.1 billion for the three months ended December 31, 2017 and\nSeptember 30, 2017 respectively, are included in long-term inflows. For previous periods, reinvested dividends and capital gains are\nincluded in market gains and losses.\n(2) As of December 31, 2017, the company changed the presentation of long-term inflows, outflows and AUM to exclude Unit Investment\nTrusts (UITs) and product leverage. All periods have been reclassified to conform to the new presentation. Non-management fee\nearning AUM includes Invesco PowerShares QQQ, UITs and product leverage.\n(3) Annualized long-term organic growth rate is calculated using long-term net flows (annualized) divided by opening long-term AUM for\nthe period. Long-term AUM excludes institutional money market and non-management fee earning AUM.\nNet market gains led to a $66.0 billion increase in AUM during 2017, compared to a $37.7 billion increase in 2016. Foreign exchange rate movements led to a $21.4 billion increase in AUM during 2017, compared to a $22.1 billion decrease in 2016. Average AUM during 2017 were $875.0 billion, compared to $788.8 billion for 2016, an increase of 10.9%.\nNet market gains led to a $14.9 billion increase in AUM during the fourth quarter, compared to a $15.0 billion increase in the third quarter 2017. Foreign exchange rate movements led to a $2.5 billion increase in AUM during the fourth quarter, compared to a $6.7 billion increase in the third quarter 2017. Average AUM during the fourth quarter were $930.3 billion, compared to $890.8 billion for the third quarter 2017, an increase of 4.4%. Further analysis is included in the supplementary schedules to this release.\nOperating Results - year ended December 31, 2017\nThis section discusses the company's full year 2017 results, as compared to 2016, and comments on significant items that have impacted the company's results as presented in accordance with U.S. GAAP. The results of the acquired European ETF business are included from the acquisition date of August 18, 2017.\nOperating revenues increased $425.9 million (9.0%) to $5,160.3 million in 2017, from $4,734.4 million in 2016, primarily due to increased investment management fees. Investment management fees increased by $353.5 million (9.4%) to $4,126.6 million in 2017, from $3,773.1 million in 2016 due to 10.9% higher average AUM. Foreign exchange rate changes decreased operating revenues by $35.3 million compared to 2016. Performance fees increased $69.0 million (155.8%) to $113.3 million in 2017 from $44.3 million in 2016, primarily related to the performance fee generated in the third quarter by Invesco's Mortgage Recovery Fund.\nOperating expenses increased $325.2 million (9.1%) to $3,883.2 million in 2017, from $3,558.0 million in 2016, primarily due to increased employee compensation and third-party distribution, service and advisory costs. Foreign exchange rate changes decreased 2017 operating expenses by $21.2 million when compared to 2016. Business optimization charges increased to $58.0 million in 2017, compared to $49.9 million in 2016. As of the end of 2017, this initiative has produced annualized run-rate expense savings of $43.8 million. These savings have helped offset acquisition and regulatory-related increases in operating expenses.\nNon-operating income and expense includes equity in earnings of unconsolidated affiliates of $44.7 million in 2017 primarily from our private equity and real estate investments as well as our Chinese joint ventures. Also included in non-operating income is other income of consolidated investment products (CIP), net of $137.3 million in 2017 as compared to $79.2 million in 2016.\nOther gains and losses, net was a gain of $51.5 million in 2017 compared to $22.9 million in 2016. The components and variances are included in the table below:\nSummary of Other gains and losses, net (in millions)\n2017\n2016\nChange\nInvestment gains/(losses)\n$24.0\n$3.1\n$20.9\nMarket valuation gains/(losses) in deferred compensation plan investments\n24.7\n11.2\n13.5\nMarket valuation gains/(losses) on acquisition-related contingent consideration\n7.6\n(7.4)\n15.0\nMarket valuation gains/(losses) on foreign exchange hedge contracts\n(21.0)\n22.0\n(43.0)\nForeign exchange gains/(losses) on intercompany loans\n4.1\n(6.0)\n10.1\nForeign exchange gain related to currency held for business acquisition\n12.1\n—\nN/A\n$51.5\n$22.9\n$16.5\nOperating Results - fourth quarter ended December 31, 2017\nThis section discusses the company's fourth quarter 2017 results, as compared to the third quarter 2017, and comments on significant items that have impacted the company's results as presented in accordance with U.S. GAAP. The results of the acquired European ETF business are included from the acquisition date of August 18, 2017.\nOperating revenues increased 2.8% to $1,375.6 million in the fourth quarter, from $1,337.7 million in the third quarter 2017. The change was primarily due to increased investment management fees. Foreign exchange rate changes increased operating revenues by $2.7 million compared to the third quarter 2017.\nInvestment management fees increased by $36.4 million (3.4%) to $1,098.7 million in the fourth quarter, from $1,062.3 million in the third quarter 2017, due to an increase of 4.4% in average AUM between the periods.\nService and distribution fees decreased $0.1 million (0.0%) to $217.5 million in the fourth quarter, from $217.6 million in the third quarter 2017.\nPerformance fees were $43.0 million in the fourth quarter, compared to $42.3 million in the third quarter 2017. Performance fees recorded in the fourth quarter arose primarily from real estate and bank loan products.\nOther revenues increased by $0.9 million (5.8%) to $16.4 million in the fourth quarter, compared to $15.5 million in the third quarter 2017, primarily resulting from increased real estate transaction fees.\nOperating expenses increased $48.9 million (5.0%) to $1,031.3 million in the fourth quarter, from $982.4 million in the third quarter 2017. Business optimization charges were $9.0 million in the fourth quarter, compared to $12.3 million in the third quarter. Foreign exchange rate changes increased fourth quarter operating expenses by $1.1 million when compared to the third quarter 2017.\nThird-party distribution, service and advisory expenses increased by $10.5 million (2.8%) to $390.9 million in the fourth quarter, from $380.4 million in the third quarter 2017, consistent with the increase in revenues resulting from the increase in retail AUM.\nEmployee compensation expenses decreased by $11.2 million (2.8%) to $381.9 million in the fourth quarter, from $393.1 million in the third quarter 2017. Staff severance costs related to business optimization were $2.8 million in the fourth quarter compared to $7.6 million in the third quarter. Third quarter compensation costs also included a $5.5 million non-cash charge related to the company's U.K. defined benefit plan. The fourth quarter also includes a decrease in variable compensation costs.\nMarketing expenses increased by $11.2 million (38.0%) to $40.7 million in the fourth quarter from $29.5 million in the third quarter 2017 reflecting marketing campaigns related to the acquired European ETF business, cross-border funds and normal seasonal increases in advertising, client events and other marketing costs.\nProperty, office and technology expenses increased $10.0 million (10.8%) to $102.8 million in the fourth quarter, from $92.8 million in the third quarter 2017 primarily related to increased outsourced administration and software costs.\nGeneral and administrative expenses increased $28.4 million (32.8%) to $115.0 million in the fourth quarter, from $86.6 million in the third quarter 2017. General and administrative expenses for the fourth quarter included $15.6 million of legal, other professional services fees and amortization related to acquisitions compared to $6.9 million in the third quarter 2017. The fourth quarter also includes increases of $9.3 million primarily related to regulatory changes and business growth initiatives, including product costs and other legal and consulting costs. Increased costs in the fourth quarter also led to an increase of $1.7 million in irrecoverable taxes as compared to the third quarter.\nEquity in earnings of unconsolidated affiliates decreased $9.3 million (72.1%) to $3.6 million in the fourth quarter from $12.9 million in the third quarter 2017 primarily due to a decrease in earnings from partnership investments. Non-operating other income and expenses in the fourth quarter also included a $44.8 million consolidated investment product (CIP) net gain comprised of market-driven gains and losses on investments held by the consolidated funds and net interest income of CIP (third quarter 2017: $31.7 million gain).\nOther gains and losses, net was a gain in the fourth quarter of $23.9 million compared to a gain of $18.9 million in the third quarter. The components and variances are included in the table below:\nSummary of Other gains and losses, net (in millions)\nQ4-17\nQ3-17\nChange\nInvestment gains/(losses)\n$12.0\n$2.1\n$9.9\nMarket valuation gains/(losses) in deferred compensation plan investments\n3.7\n6.1\n(2.4)\nMarket valuation gains/(losses) on acquisition-related contingent consideration\n7.4\n(1.6)\n9.0\nMarket valuation gains/(losses) on foreign exchange hedge contracts\n(1.1)\n(2.5)\n1.4\nForeign exchange gains/(losses) on intercompany loans\n1.9\n2.7\n(0.8)\nForeign exchange gain related to currency held for business acquisition\n—\n12.1\nN/A\n$23.9\n$18.9\n$17.1\nTaxation\nOur effective tax rate decreased to 18.8% for the year ended December 31, 2017 and to (5.8%) for the fourth quarter (year ended December 31, 2016: 28.0%; third quarter 2017: 31.0%). The decreases reflect a 9.3% rate decrease for the year and a 33.9% rate decrease for the fourth quarter as a result of a $130.7 million tax benefit related to the revaluation of deferred tax assets and liabilities following the Tax Cuts and Jobs Act (the \"2017 Tax Act\") enacted in the United States.\nThe inclusion of income from non-controlling interests decreased our effective tax rate 0.5% in 2017 and increased our effective tax rate by 0.2% in the fourth quarter (year ended December 31, 2016: decrease of 0.3%; third quarter 2017: decrease of 0.5%). Third quarter 2017 included a 3.5% rate increase as a result of Illinois tax regulation changes adopted in the quarter.\nThe impact of the 2017 Tax Act may differ from the estimate recorded this quarter due to, among other things, changes in interpretations and assumptions that company has made as well as additional regulatory guidance that may be issued.\nCapital Management\nAs of December 31, 2017, the company's cash and cash equivalents were $2,006.4 million (September 30, 2017: $1,716.3 million; December 31, 2016: $1,328.0 million), with long-term debt of $2,075.8 million (September 30, 2017: $2,075.3 million; December 31, 2016: $2,102.4 million). The credit facility balance was zero at December 31, 2017 (zero at September 30, 2017; $28.7 million at December 31, 2016).\nDividends paid in the fourth quarter were $118.9 million bringing total 2017 full-year cash dividends to $471.6 million. Today the company is announcing a fourth-quarter cash dividend of 29.0 cents per share to holders of common shares. The dividend is payable on March 2, 2018, to shareholders of record at the close of business on February 15, 2018, with an ex-dividend date of February 14, 2018.\nDue to the upcoming acquisition of Guggenheim Investments' ETF business, the company did not repurchase common shares in the open market during 2017.\nHeadcount\nAs of December 31, 2017, the company had 7,030 employees, compared to 6,994 employees as of September 30, 2017, and 6,790 at December 31, 2016.\nInvesco is an independent investment management firm dedicated to delivering an investment experience that helps people get more out of life. NYSE: IVZ; www.invesco.com .\nMembers of the investment community and general public are invited to listen to the conference call today, January 31, 2018, at 9:00 a.m. ET by dialing one of the following numbers: 1-866-803-2143 for U.S. and Canadian callers or 1-210-795-1098 for international callers. An audio replay of the conference call will be available until February 14, 2018 at 5:00 p.m. ET by calling 1-866-373-1985 for U.S. and Canadian callers or 1-203-369-0261 for international callers. A presentation highlighting the company's performance will be available during a live Webcast and on Invesco's Website at www.invesco.com .\nThis release, and comments made in the associated conference call today, may include \"forward-looking statements.\" Forward-looking statements include information concerning future results of our operations, expenses, earnings, liquidity, cash flow and capital expenditures, industry or market conditions, assets under management, geopolitical events and their potential impact on the company, acquisitions and divestitures, debt and our ability to obtain additional financing or make payments, regulatory developments, demand for and pricing of our products and other aspects of our business or general economic conditions. In addition, words such as \"believes,\" \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"estimates,\" \"projects,\" \"forecasts,\" and future or conditional verbs such as \"will,\" \"may,\" \"could,\" \"should,\" and \"would\" as well as any other statement that necessarily depends on future events, are intended to identify forward-looking statements.\nForward-looking statements are not guarantees, and they involve risks, uncertainties and assumptions. Although we make such statements based on assumptions that we believe to be reasonable, there can be no assurance that actual results will not differ materially from our expectations. We caution investors not to rely unduly on any forward-looking statements and urge you to carefully consider the risks described in our most recent Form 10-K and subsequent Forms 10-Q, filed with the Securities and Exchange Commission. You may obtain these reports from the SEC's website at www.sec.gov . We expressly disclaim any obligation to update the information in any public disclosure if any forward-looking statement later turns out to be inaccurate.\nInvesco Ltd.\nU.S. GAAP Condensed Consolidated Income Statements\n(Unaudited, in millions, other than per share amounts)\nQ4-17\nQ3-17\n% Change\nQ4-16\n% Change\nOperating revenues:\nInvestment management fees\n$1,098.7\n$1,062.3\n3.4\n%\n$946.9\n16.0\n%\nService and distribution fees\n217.5\n217.6\n—\n%\n209.1\n4.0\n%\nPerformance fees\n43.0\n42.3\n1.7\n%\n17.5\n145.7\n%\nOther\n16.4\n15.5\n5.8\n%\n21.2\n(22.6)\n%\nTotal operating revenues\n1,375.6\n1,337.7\n2.8\n%\n1,194.7\n15.1\n%\nOperating expenses:\nThird-party distribution, service and advisory\n390.9\n380.4\n2.8\n%\n349.5\n11.8\n%\nEmployee compensation\n381.9\n393.1\n(2.8)\n%\n339.0\n12.7\n%\nMarketing\n40.7\n29.5\n38.0\n%\n35.2\n15.6\n%\nProperty, office and technology\n102.8\n92.8\n10.8\n%\n85.3\n20.5\n%\nGeneral and administrative\n115.0\n86.6\n32.8\n%\n91.5\n25.7\n%\nTotal operating expenses\n1,031.3\n982.4\n5.0\n%\n900.5\n14.5\n%\nOperating income\n344.3\n355.3\n(3.1)\n%\n294.2\n17.0\n%\nOther income/(expense):\nEquity in earnings of unconsolidated affiliates\n3.6\n12.9\n(72.1)\n%\n11.4\n(68.4)\n%\nInterest and dividend income\n6.4\n2.5\n156.0\n%\n3.5\n82.9\n%\nInterest expense\n(23.6)\n(23.6)\n—\n%\n(23.5)\n0.4\n%\nOther gains and losses, net\n23.9\n18.9\n26.5\n%\n15.6\n53.2\n%\nOther income/(expense) of CIP, net\n44.8\n31.7\n41.3\n%\n9.8\n357.1\n%\nIncome before income taxes\n399.4\n397.7\n0.4\n%\n311.0\n28.4\n%\nIncome tax (provision)/benefit\n23.2\n(123.1)\nN/A\n(92.9)\nN/A\nNet income\n422.6\n274.6\n53.9\n%\n218.1\n93.8\n%\nNet (income)/loss attributable to noncontrolling interests in consolidated\nentities\n(14.4)\n(7.1)\n102.8\n%\n8.4\nN/A\nNet income attributable to Invesco Ltd.\n$408.2\n$267.5\n52.6\n%\n$226.5\n80.2\n%\nEarnings per share:\n---basic\n$1.00\n$0.65\n53.8\n%\n$0.55\n81.8\n%\n---diluted\n$0.99\n$0.65\n52.3\n%\n$0.55\n80.0\n%\nAverage shares outstanding:\n---basic\n410.0\n410.0\n—\n%\n408.6\n0.3\n%\n---diluted\n410.6\n410.5\n—\n%\n409.0\n0.4\n%\nInvesco Ltd.\nU.S. GAAP Condensed Consolidated Income Statements\n(Unaudited, in millions, other than per share amounts)\nYear ended December 31,\n2017\n2016\n% Change\nOperating revenues:\nInvestment management fees\n$4,126.6\n$3,773.1\n9.4\n%\nService and distribution fees\n852.8\n823.6\n3.5\n%\nPerformance fees\n113.3\n44.3\n155.8\n%\nOther\n67.6\n93.4\n(27.6)%\nTotal operating revenues\n5,160.3\n4,734.4\n9.0\n%\nOperating expenses:\nThird-party distribution, service and advisory\n1,486.5\n1,407.2\n5.6\n%\nEmployee compensation\n1,537.4\n1,378.8\n11.5\n%\nMarketing\n123.7\n114.8\n7.8\n%\nProperty, office and technology\n370.1\n325.7\n13.6\n%\nGeneral and administrative\n365.5\n331.5\n10.3\n%\nTotal operating expenses\n3,883.2\n3,558.0\n9.1\n%\nOperating income\n1,277.1\n1,176.4\n8.6\n%\nOther income/(expense):\nEquity in earnings of unconsolidated affiliates\n44.7\n9.3\n380.6\n%\nInterest and dividend income\n13.4\n12.2\n9.8\n%\nInterest expense\n(94.8)\n(93.4)\n1.5\n%\nOther gains and losses, net\n51.5\n22.9\n124.9\n%\nOther income/(expense) of CIP, net\n137.3\n79.2\n73.4\n%\nIncome before income taxes\n1,429.2\n1,206.6\n18.4\n%\nIncome tax provision\n(268.2)\n(338.3)\n(20.7)%\nNet income\n1,161.0\n868.3\n33.7\n%\nNet (income)/loss attributable to noncontrolling interests in consolidated entities\n(33.7)\n(14.1)\n139.0\n%\nNet income attributable to Invesco Ltd.\n$1,127.3\n$854.2\n32.0\n%\nEarnings per share:\n---basic\n$2.75\n$2.06\n33.5\n%\n---diluted\n$2.75\n$2.06\n33.5\n%\nAverage shares outstanding:\n---basic\n409.4\n414.7\n(1.3)%\n---diluted\n409.9\n415.0\n(1.2)%\nInvesco Ltd.\nNon-GAAP Information and Reconciliations\nWe utilize the following non-GAAP performance measures: net revenues (and by calculation, net revenue yield on AUM), adjusted operating income, adjusted operating margin, adjusted net income attributable to Invesco Ltd., and adjusted diluted EPS. We believe the adjusted measures provide valuable insight into our ongoing operational performance and assist in comparisons to our competitors. These measures also assist management with the establishment of operational budgets and forecasts and assist the Board of Directors and management in determining incentive compensation decisions. The most directly comparable U.S. GAAP measures are operating revenues (and by calculation, gross revenue yield on AUM), operating income, operating margin, net income attributable to Invesco Ltd., and diluted EPS.\nThe following are reconciliations of operating revenues, operating income (and by calculation, operating margin), and net income attributable to Invesco Ltd. (and by calculation, diluted EPS) on a U.S. GAAP basis to a non-GAAP basis of net revenues, adjusted operating income (and by calculation, adjusted operating margin), and adjusted net income attributable to Invesco Ltd. (and by calculation, adjusted diluted EPS). In addition, a reconciliation of adjusted operating expenses is provided below, together with reconciliations of the U.S. GAAP operating expense lines to provide further analysis of the non-GAAP adjustments. These non-GAAP measures should not be considered as substitutes for any U.S. GAAP measures and may not be comparable to other similarly titled measures of other companies. The tax effect of the reconciling items is based on the tax jurisdiction attributable to the transactions. These measures are described more fully in the company's Forms 10-K and 10-Q. Refer to these public filings for additional information about the company's non-GAAP performance measures.\nReconciliation of Operating revenue to Net revenues:\nQuarter\nYear\nin millions\nQ4-17\nQ3-17\nQ4-16\n2017\n2016\nOperating revenues, U.S. GAAP basis\n$\n1,375.6\n$\n1,337.7\n$\n1,194.7\n$\n5,160.3\n$\n4,734.4\nProportional share of revenues, net of third-party\ndistribution, service and advisory expenses, from\njoint venture investments\n13.5\n13.1\n12.6\n48.7\n43.7\nThird party distribution, service and advisory expenses\n(390.9)\n(380.4)\n(349.5)\n(1,486.5)\n(1,407.2)\nCIP\n6.7\n6.2\n6.0\n32.4\n22.3\nNet revenues\n$\n1,004.9\n$\n976.6\n$\n863.8\n$\n3,754.9\n$\n3,393.2\nReconciliation of Operating income to Adjusted operating income:\nQuarter\nYear\nin millions\nQ4-17\nQ3-17\nQ4-16\n2017\n2016\nOperating income, U.S. GAAP basis\n$\n344.3\n$\n355.3\n$\n294.2\n$\n1,277.1\n$\n1,176.4\nProportional share of net operating income from joint\nventure investments\n6.0\n5.8\n5.4\n18.4\n15.9\nCIP\n12.0\n10.4\n17.6\n42.9\n51.0\nBusiness combinations\n21.7\n8.6\n3.8\n43.8\n22.3\nCompensation expense related to market valuation changes\nin deferred compensation plans\n6.2\n5.0\n2.4\n20.3\n8.1\nBusiness optimization expenses\n9.0\n12.3\n21.0\n58.0\n49.9\nSenior executive retirement and related costs\n—\n—\n—\n19.7\n—\nVacated property lease credit\n—\n—\n0.2\n—\n(3.2)\nEmployee benefit plan termination\n—\n—\n(8.6)\n—\n(8.6)\nRegulatory-related charges\n—\n—\n—\n—\n1.0\nAdjusted operating income\n$\n399.2\n$\n397.4\n$\n336.0\n$\n1,480.2\n$\n1,312.8\nOperating margin (1)\n25.0\n%\n26.6\n%\n24.6\n%\n24.7\n%\n24.8\n%\nAdjusted operating margin (2)\n39.7\n%\n40.7\n%\n38.9\n%\n39.4\n%\n38.7\n%\nReconciliation of Net income attributable to Invesco Ltd. to Adjusted net income attributable to Invesco Ltd.:\nQuarter\nYear\nin millions\nQ4-17\nQ3-17\nQ4-16\n2017\n2016\nNet income attributable to Invesco Ltd., U.S. GAAP basis\n$\n408.2\n$\n267.5\n$\n226.5\n$\n1,127.3\n$\n854.2\nCIP\n(0.8)\n1.3\n(0.2)\n(2.3)\n(3.0)\nBusiness combinations:\nChanges in the fair value of contingent consideration\n(7.5)\n1.6\n1.1\n(19.7)\n7.4\nForeign exchange gain related to currency held for business\nacquisition\n—\n(12.1)\n—\n—\n—\nOther-than-temporary impairment\n—\n—\n—\n—\n17.8\nOther business combination-related adjustments\n21.7\n8.6\n3.8\n43.8\n22.3\nDeferred compensation plan market valuation changes and\ndividend income less compensation expense\n0.2\n(1.3)\n0.1\n(7.3)\n(4.0)\nBusiness optimization expenses\n9.0\n12.3\n21.0\n58.0\n49.9\nSenior executive retirement and related costs\n—\n—\n—\n19.7\n—\nVacated property lease credit\n—\n—\n0.2\n—\n(3.2)\nEmployee benefit plan termination\n—\n—\n(8.6)\n—\n(8.6)\nRegulatory-related charges\n—\n—\n—\n—\n1.0\nForeign exchange hedge\n(0.9)\n0.5\n(6.6)\n20.6\n(14.2)\nTaxation:\nRevaluation of deferred taxes resulting from 2017 Tax Act\n(130.7)\n—\n—\n(130.7)\n—\nTaxation on business combinations\n2.8\n4.6\n4.0\n15.2\n12.0\nTaxation on deferred compensation plan market valuation\nchanges and dividend income less compensation expense\n(0.1)\n0.6\n—\n2.7\n1.5\nTaxation on business optimization charges\n(3.1)\n(3.8)\n(7.0)\n(19.9)\n(16.2)\nTaxation on senior executive retirement and related costs\n—\n—\n—\n(5.9)\n—\nTaxation on vacated property lease credit\n—\n—\n—\n—\n0.7\nTaxation on employee benefit plan termination\n—\n—\n3.3\n—\n3.3\nTaxation on regulatory-related charges\n—\n—\n—\n—\n(1.8)\nTaxation on foreign exchange hedge\n0.3\n(0.2)\n2.5\n(7.8)\n5.0\nRetroactive state tax adjustment\n—\n12.2\n—\n12.2\n—\nAdjusted net income attributable to Invesco Ltd. (3)\n$\n299.1\n$\n291.8\n$\n240.1\n$\n1,105.9\n$\n924.1\nAverage shares outstanding - diluted\n410.6\n410.5\n409.0\n409.9\n415.0\nDiluted EPS\n$\n0.99\n$\n0.65\n$\n0.55\n$\n2.75\n$\n2.06\nAdjusted diluted EPS (4)\n$\n0.73\n$\n0.71\n$\n0.59\n$\n2.70\n$\n2.23", "external_links": ["http://www.invesco.com/"], "published": "2018-01-31T14:55:00.000+02:00", "crawled": "2018-01-31T15:48:51.004+02:00", "highlightTitle": ""}