{"organizations": [], "uuid": "2a60beb21b6a0744f6e3c58ce86cd6df98a183ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-acceleron-announces-planned-retirement-of-chief-medical-officer-dr-matthew-l-sherman.html", "country": "US", "domain_rank": 767, "title": "Acceleron Announces Planned Retirement of Chief Medical Officer, Dr. Matthew L. Sherman", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.155, "site_type": "news", "published": "2018-01-03T15:00:00.000+02:00", "replies_count": 0, "uuid": "2a60beb21b6a0744f6e3c58ce86cd6df98a183ea"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-acceleron-announces-planned-retirement-of-chief-medical-officer-dr-matthew-l-sherman.html", "ord_in_thread": 0, "title": "Acceleron Announces Planned Retirement of Chief Medical Officer, Dr. Matthew L. Sherman", "locations": [], "entities": {"persons": [{"name": "matthew l. sherman", "sentiment": "negative"}, {"name": "matt", "sentiment": "none"}, {"name": "luspatercept", "sentiment": "none"}, {"name": "sherman", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "acceleron", "sentiment": "negative"}, {"name": "acceleron pharma inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "celgene corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass.--(BUSINESS WIRE)-- Acceleron Pharma Inc. (NASDAQ:XLRN), a leading biopharmaceutical company in the discovery and development of TGF-beta therapeutics to treat serious and rare diseases, today announced the planned retirement of Executive Vice President and Chief Medical Officer Matthew L. Sherman, M.D. The retirement will be effective after the topline data release from the ongoing MEDALIST and BELIEVE Phase 3 clinical trials with luspatercept, expected to occur in the middle of this year. Luspatercept is the Company’s lead program that is being developed across multiple Phase 3 and Phase 2 clinical trials in collaboration with Celgene Corporation for the treatment of chronic anemia in hematologic disorders.\nDr. Sherman joined Acceleron in 2006 as its first Chief Medical Officer. Dr. Sherman has successfully led the clinical development of multiple internally discovered programs, most notably the Phase 1 and Phase 2 clinical trials of luspatercept.\n“I am sincerely grateful to Matt for his dedicated service to Acceleron throughout the past twelve years and for his support through my first year as CEO,” said Habib Dable, President and Chief Executive Officer of Acceleron. “Matt has provided valuable leadership and clinical development experience to Acceleron, especially in the areas of hematology and oncology. I am delighted that we will continue to benefit from Matt’s expertise in support of the anticipated process for regulatory approval of luspatercept.\"\n\"I am truly proud of our achievements at Acceleron over the last twelve years, including building an outstanding clinical development team, advancing multiple protein therapeutics into Phase 2 development and working strategically alongside our collaboration partner for the ongoing Phase 3 trials of luspatercept. I am looking forward to continuing to work on the luspatercept program. Acceleron is well-positioned for continued success and I am excited about the future of the company in all areas,\" said Dr. Sherman.\nDr. Sherman will remain on staff until the release of topline data from the MEDALIST and BELIEVE trials, and then serve in an advisory capacity for one year thereafter. The Company is now initiating a search for the position of Chief Medical Officer.\nAbout Acceleron\nAcceleron is a Cambridge-based, clinical-stage biopharmaceutical company dedicated to the discovery, development, and commercialization of therapeutics to treat serious and rare diseases. The Company's leadership in the understanding of TGF-beta biology and protein engineering generates innovative compounds that engage the body's ability to regulate cellular growth and repair.\nAcceleron focuses its research and development efforts in hematologic, neuromuscular, and pulmonary diseases. In hematology, the Company and its global collaboration partner, Celgene, are developing luspatercept for the treatment of chronic anemia in myelodysplastic syndromes, beta-thalassemia, and myelofibrosis. Acceleron is also advancing its neuromuscular franchise with two distinct Myostatin+ agents, ACE-083 and ACE-2494, and a pulmonary program with a Phase 2 trial of sotatercept planned in pulmonary arterial hypertension.\nFor more information, please visit www.acceleronpharma.com/ . Follow Acceleron on Social Media: @AcceleronPharma and LinkedIn.\nForward-Looking Statements\nThis press release contains forward-looking statements about the Company's strategy, future plans and prospects, including statements regarding the development of the Company's compounds, the timeline for clinical development and regulatory approval of the Company's compounds and the expected timing for reporting of data from ongoing clinical trials. The words \"anticipate,\" \"believe,\" \"could,\" \"estimate,\" \"expect,\" \"goal\", \"intend,\" \"may,\" \"plan,\" \"potential,\" \"project,\" \"should,\" \"target,\" \"will,\" \"would,\" and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words.\nActual results could differ materially from those included in the forward-looking statements due to various risks and uncertainties, including, but not limited to, that preclinical testing of the Company's compounds and data from clinical trials may not be predictive of the results or success of ongoing or later clinical trials, that the development of the Company's compounds will take longer and/or cost more than planned, that the Company or its collaboration partner, Celgene, will be unable to successfully complete the clinical development of the Company's compounds, that the Company or Celgene may be delayed in initiating, enrolling or completing any clinical trials, and that the Company's compounds will not receive regulatory approval or become commercially successful products. These and other risks and uncertainties are identified under the heading \"Risk Factors\" included in the Company's most recent Annual Report on Form 10-K, and other filings that the Company has made and may make with the SEC in the future.\nThe forward-looking statements contained in this press release are based on management's current views, plans, estimates, assumptions and projections with respect to future events, and the Company does not undertake and specifically disclaims any obligation to update any forward-looking statements.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103005258/en/\nAcceleron Pharma Inc.\nTodd James, IRC, 617-649-9393\nVice President, Investor Relations and Corporate Communications\nor\nCandice Ellis, 617-649-9226\nManager, Investor Relations and Corporate Communications\nor\nMedia:\nBMC Communications\nBrad Miles, 646-513-3125\nSource: Acceleron Pharma", "external_links": ["http://www.businesswire.com/news/home/20180103005258/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.acceleronpharma.com%2F&esheet=51736937&newsitemid=20180103005258&lan=en-US&anchor=www.acceleronpharma.com%2F&index=1&md5=59b2995eb15320919d78a17da6209568"], "published": "2018-01-03T15:00:00.000+02:00", "crawled": "2018-01-03T17:07:18.040+02:00", "highlightTitle": ""}