{"organizations": [], "uuid": "6bd9aa779208b938e59f194f38b147d05b266be6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226341323&w=1200&r=LYNXMPEE0S17D", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england/sanchez-set-for-united-league-debut-at-spurs-idUKKBN1FI1YE", "country": "US", "domain_rank": 408, "title": "Sanchez set for United league debut at Spurs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:04:00.000+02:00", "replies_count": 0, "uuid": "6bd9aa779208b938e59f194f38b147d05b266be6"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england/sanchez-set-for-united-league-debut-at-spurs-idUKKBN1FI1YE", "ord_in_thread": 0, "title": "Sanchez set for United league debut at Spurs", "locations": [], "entities": {"persons": [{"name": "sanchez", "sentiment": "negative"}, {"name": "rea", "sentiment": "negative"}, {"name": "anthony martial", "sentiment": "none"}, {"name": "jose mourinho", "sentiment": "none"}, {"name": "mourinho", "sentiment": "none"}, {"name": "alexis sanchez", "sentiment": "none"}, {"name": "harry kane", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "yeovil town", "sentiment": "none"}], "organizations": [{"name": "spurs neil robinson", "sentiment": "negative"}, {"name": "spurs", "sentiment": "negative"}, {"name": "united", "sentiment": "negative"}, {"name": "tottenham hotspur", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 03 PM / Updated 25 minutes ago Sanchez set for United league debut at Spurs Neil Robinson 4 Min Read \nLONDON (Reuters) - For all the talk of Manchester City’s stellar season, Manchester United have enjoyed an even happier new year with five successive wins plus the sneaky signing of Alexis Sanchez from under their neighbours’ noses. \nJose Mourinho’s team face what promises to be their toughest test of 2018 at Tottenham Hotspur on Wednesday, a game where the focus will inevitably fall on Sanchez’s league debut after his impressive start in the 4-0 FA Cup win at Yeovil Town. \n“Five victories makes a happy camp,” said Mourinho, who must decide whether to keep Sanchez on the left or bring back Anthony Martial and fit the Chilean in elsewhere. \n“The real headache is when you don’t have the good players so when you have so many injuries, you are in trouble,” said Mourinho. “When almost everybody is available and the quality is high, these are the good problems.” \nThe manager’s most pressing headache may lie in defence where he will seek to stop Harry Kane from adding to his 30 goals this season. \n“They have some of the best players in the country, a very good manager and a very difficult opponent,” Mourinho said. \nSpurs, who lag eight points behind United in fifth place, hope Christian Eriksen will return to bolster their midfield at Wembley. \nPremier League leaders City look to protect their 12-point lead at home to a West Bromwich Albion side buoyed by their unexpected 3-2 FA Cup win at Liverpool. INJURY STRUGGLES \nAlbion’s opening two goals were scored by Jay Rodriguez who is fit again and firing after a nightmare few years disrupted by injury. Rodriguez will hope to add to his tally of five goals in six games. \nLiverpool manager Juergen Klopp might wish for different opponents than Huddersfield Town on Tuesday as he looks for his side to show their ruthless streak following two embarrassing defeats in five days. \nHuddersfield are managed by Klopp’s best man and former Dortmund sidekick David Wagner, who is also hoping for a turnaround in fortunes as he looks for a first Premier League win in seven games. \n“This is personally special but the game stands on its own,” Wagner said. \nLiverpool’s other recent conquerors, Swansea City, will take plenty of momentum into the home clash with Arsenal and West Ham United play Crystal Palace on Tuesday. \nDespite recent form improvements, neither London side is yet safe as one of the most fiercely fought relegation battles of recent years continues to hot up, with more games on Wednesday pitting strugglers against each other. \nStoke City boss Paul Lambert oversees his second league game against a Watford side stewarded by Javi Gracia in his first while the south coast battle between Southampton and Brighton & Hove Albion should be equally hardfought. \nEverton manager Sam Allardyce was quick to berate the timing of this week’s fixtures, which clash with the closing of the January transfer window on Wednesday. \nAllardyce said he will spend the morning monitoring what is always a fast-moving market before turning his attention to the evening clash with Leicester City. \nChelsea host Bournemouth and Newcastle United entertain Burnley in the other games. Reporting by Neil Robinson, editing by Ed Osmond", "external_links": [], "published": "2018-01-29T18:04:00.000+02:00", "crawled": "2018-01-29T18:33:36.000+02:00", "highlightTitle": ""}