{"organizations": [], "uuid": "ae2793276d3742f15687b110330fa98c87b4f2b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 32}, "facebook": {"likes": 61, "shares": 61, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/07/02/100860580-84304482r.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/manhattan-real-estate-prices-and-sales-fell-ahead-of-tax-changes.html", "country": "US", "domain_rank": 767, "title": "Manhattan real estate prices and sales fell ahead of tax changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2018-01-03T07:00:00.000+02:00", "replies_count": 0, "uuid": "ae2793276d3742f15687b110330fa98c87b4f2b9"}, "author": "Robert Frank", "url": "https://www.cnbc.com/2018/01/02/manhattan-real-estate-prices-and-sales-fell-ahead-of-tax-changes.html", "ord_in_thread": 0, "title": "Manhattan real estate prices and sales fell ahead of tax changes", "locations": [], "entities": {"persons": [{"name": "miller samuel", "sentiment": "none"}], "locations": [{"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "millionaire survey manhattan", "sentiment": "negative"}, {"name": "manhattan", "sentiment": "negative"}, {"name": "douglas elliman real estate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Manhattan real estate sales and prices took a fall in the fourth quarter, and they're likely to slide even further this year after the new tax rules take effect.\nTotal sales volume fell 12 percent compared with the fourth quarter of last year — the lowest quarterly level in six years, according to a report from Douglas Elliman Real Estate and Miller Samuel, the appraisal firm. The average sales price in Manhattan fell below $2 million for the first time in nearly two years.\nBrokers say the declines were simply the result of uncertainty around the Republican tax plan, as buyers held off until the details of the new law became clear. They say many of those buyers have since rushed in and will help show a rebound.\nYet the luxury market in Manhattan is suffering from an expanding glut of high-end and highly priced apartments. And analysts say that while sales may rebound slightly in the first quarter of 2018, the tax law — which limits the deductibility of state and local taxes — will continue to add pressure to New York City housing prices, especially at the top.\n\"There will be an impact on prices and sales,\" said Jonathan Miller, president and CEO of Miller Samuel. \"But it may take up to a year and a half to two years to see the full impact.\"\nThe high end of the Manhattan market is showing the biggest cracks. Inventory of luxury apartments — those in the top 10 percent by price — grew by 15 percent. There is now a 17-month supply of luxury apartments in Manhattan, up from 10 months a year ago.\nAnd with giant new condo towers sprouting up in every corner of the city, those numbers are likely to grow.\nMiller said that resales — as opposed to new development — are holding up strong, with median sales prices up by 2 percent over last year. But prices for new developments fell 17 percent over last year and the number of sales are down 20 percent.\nThe number of new developments is expected to continue to rise this year and next, which will add to inventory, Miller said. While demand for \"low-end\" apartments priced at $1 million to $2 million remains strong, sales of apartments of more than $5 million will get tougher. In part, that's because the rich have more discretion on when and where to buy homes — and with the costs of owning a home in New York going up with the tax plan, apartments aimed at the rich will see the biggest price hits.\nMiller said that while buyers have already adjusted, sellers may take more time to catch up.\n\"The sellers were already recalibrating after 2015,\" he said. \"Now they will have to readjust again.\"\nWATCH: NYC real estate market tumbles in 4th quarter show chapters New York City real estate market takes a tumble in the fourth quarter 5 Hours Ago | 01:44", "external_links": [], "published": "2018-01-03T07:00:00.000+02:00", "crawled": "2018-01-03T07:08:45.176+02:00", "highlightTitle": ""}