{"organizations": [], "uuid": "55150fcef347ed33f4fa4164e77a9148dbe25a45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-stonemor-partners-l-p-reports-financial-results-for-2017-third-quarter.html", "country": "US", "domain_rank": 767, "title": "StoneMor Partners L.P. Reports Financial Results for 2017 Third Quarter", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.269, "site_type": "news", "published": "2018-01-26T14:59:00.000+02:00", "replies_count": 0, "uuid": "55150fcef347ed33f4fa4164e77a9148dbe25a45"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-stonemor-partners-l-p-reports-financial-results-for-2017-third-quarter.html", "ord_in_thread": 0, "title": "StoneMor Partners L.P. Reports Financial Results for 2017 Third Quarter", "locations": [], "entities": {"persons": [], "locations": [{"name": "ston", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "trevose", "sentiment": "none"}], "organizations": [{"name": "stonemor partners l.p. reports financial results", "sentiment": "negative"}, {"name": "stonemor partners l.p.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TREVOSE, Pa., Jan. 26, 2018 (GLOBE NEWSWIRE) -- StoneMor Partners L.P. (NYSE:STON) (“StoneMor” or the “Partnership”) today announced it has reported financial results for the third quarter 2017. Investors are encouraged to read the Partnership's quarterly report on Form 10-Q filed with the Securities and Exchange Commission (the “SEC”), which contains additional details, and can be found at www.stonemor.com .\nTHIRD QUARTER FINANCIAL PERFORMANCE\nRevenues were $84.0 million, an increase of $3.3 million over the prior year period. Year-to-date (nine month period ending September 30, 2017) revenues were $252.9 million, an increase of $15.0 million over the prior year period. The increase was primarily due to increases in the sales of cemetery and funeral home merchandise and services partially offset by a decrease in investment and other income. Year-to-date cash from operations were $24.7 million, an increase of $6.2 million over the prior year period, primarily due to the Partnerships continued focus on constructive delivery of pre-need merchandise. Net loss was $9.6 million, a decrease of $0.3 million from the prior year period. Year-to-date net loss was $29.7 million, an increase of $5.2 million over the prior year period. The increase was largely due to an increase in professional fees, litigation costs, and recruiting costs resulting from the delayed filing of our 10-K and various changes in our senior management. Losses were also impacted by increased costs associated with serviced marker orders, amortization of cemetery property as well as increases in selling expenses associated with the increase in cemetery merchandise revenues. Merchandise Trust value at September 30, 2017 reached $512.2 million, an increase of $5.1 million over the $507.1 million reported at December 31, 2016. Deferred revenue at September 30, 2017 reached $903.9 million, an increase of $37.3 million over the $866.6 million reported at December 31, 2016. The increase in deferred revenues mostly reflected increases in deferred contract revenues and deferred merchandise trust revenues.\nEXECUTIVE COMMENTARY\nPaul Grady, StoneMor’s President and Chief Executive Officer commented, “We are pleased that we are now current with SEC filings after spending 2017 focused on efforts to complete our accounting review, make the related restatement, and bring our filings current. We appreciate the patience demonstrated by our unitholders as we worked through this process. In 2017, we also needed to address the issues that adversely impacted revenues and cash flow and ultimately resulted in the Board’s decision to not pay a distribution for the second and third quarters of 2017, and we focused on improving operations across the organization and continuing with efforts to grow the salesforce. While there is still work to do across the organization and with the salesforce, encouragingly, we are seeing signs of stabilization.”\nRobert B. Hellman, Jr., Chairman of the Board of Directors of the General Partner, commented, “Eliminating the distribution for the second and third quarters of 2017 was, as we’ve said, a very difficult decision, but one we felt was necessary to preserve liquidity for the longer term health and stability of the business. We are now living within the four corners of the balance sheet, meaning all working capital, capital expenditures, and acquisitions must come out of operating cash flow. We came into 2017 with leverage a little higher and tighter than we’d like, and as the year progressed, we encountered significant non-recurring costs. The result was that our leverage was increasing modestly as the year progressed. So we took the prudent course of action.\"\nContinued Hellman, “We understand the importance of distributions to our unitholders, but distributions need to be made from a strong foundation, and we have more work to do to get there. Looking forward, we believe we should have at least $25 million of availability on our credit facility, which would translate into a leverage ratio of about 3.75. Getting to there from our current position may require a few more quarters in which we preserve our operating cash and manage our leverage by not making distributions, but we believe the long-term benefits of the added liquidity outweigh the benefits of paying a reduced distribution today.”\nTHIRD QUARTER OPERATING HIGHLIGHTS\nCemetery Operations\nCemetery revenues were $69.5 million, an increase of $2.8 million over the prior year period. Year-to-date revenues were $205.8 million, an increase of $13.0 million over the prior year period. Operating income was $8.6 million, a $1.6 million increase over the prior year period. Year-to-date cemetery operating income was $26.2 million, a $2.8 million increase over the prior year period. Preneed cemetery contracts sold were 10,411 compared to 12,795 in prior year period. Year-to-date contracts sold were 33,934 compared to 36,955 in the prior year period. The decline in preneed contracts in the third quarter and year-to-date periods were due to promotions run in the third quarter of 2016 that were not repeated in 2017. At-need cemetery contracts sold were relatively flat at 14,211 compared to 14,609 in prior year. Year-to-date at-need contracts sold were 45,070 compared to 44,845 in the prior year.\nFuneral Home Operations\nFuneral home revenues were $14.5 million, a $0.4 million increase over the prior year period. Year-to-date revenues were $47.1 million, a $1.9 million increase over the prior year period. Funeral home operating income was $1.2 million, a $1.6 million increase over the prior year period. Year-to-date, operating income was $7.3 million, a $4.9 million increase over the prior year period. Funeral calls for the third quarter were 3,902, a decline of 83 from the prior year period. Year-to-date funeral calls were 12,244, a decline of 505 from the prior year period.\nCORPORATE EXPENSES, LIQUIDITY AND CAPITAL STRUCTURE\nCorporate overhead expenses for the third quarter 2017 were $11.9 million compared to $10.1 million in the prior year period, and for the nine months ended September 30, 2017 were $39.1 million compared to $30.1 million in the prior year period. The increase was largely due to an increase in professional fees, litigation costs, and recruiting costs resulting from the delayed filing of our 10-K and various changes in our senior management. Interest expense was $6.9 million in the third quarter 2017 compared to $5.9 million in the prior year period. For the nine months ended September 30, 2017 interest expense was $20.4 million compare to $17.4 million in the prior year period. The increase was due to an increase in the weighted average outstanding balance and the weighted average interest rate on the line of credit balance outstanding for the three and nine months ended September 30, 2017 compared to prior year periods. As of September 30, 2017, the Partnership had $8.5 million of cash and cash equivalents and $307.7 million of total debt, including $142.9 million outstanding under its revolving credit facility. StoneMor’s leverage ratio pursuant to its Credit Agreement for the quarter ended September 30, 2017, was approximately 4.46 compared to a maximum allowable ratio of 4.5.\nEARNINGS CALL\nAs previously announced, StoneMor will hold a conference call to discuss its third quarter 2017 financial results on January 29, 2018 at 10:00 AM ET. Investors within the U.S. may access the conference call by calling (844) 423-9892. The conference ID is 7617709 Investors outside the U.S may access the call by dialing (716) 247-5807. StoneMor will also host a live webcast of this conference call. Investors may access the live webcast via the Investors page of the StoneMor website under Events and Presentations.\nAbout StoneMor Partners L.P.\nStoneMor Partners L.P., headquartered in Trevose, Pennsylvania, is an owner and operator of cemeteries and funeral homes in the United States, with 316 cemeteries and 97 funeral homes in 27 states and Puerto Rico.\nStoneMor is the only publicly traded death care company structured as a partnership. StoneMor’s cemetery products and services, which are sold on both a pre-need (before death) and at-need (at death) basis, include: burial lots, lawn and mausoleum crypts, burial vaults, caskets, memorials, and all services which provide for the installation of this merchandise. For additional information about StoneMor Partners L.P., please visit StoneMor’s website, and the investors section, at http://www.stonemor.com .\nCautionary Note Regarding Forward-Looking Statements\nCertain statements contained in this press release, including, but not limited to, information regarding the expected timing of future distributions and the timing of its next investor call are forward-looking statements. Generally, the words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend (including, but not limited to StoneMor’s intent to maintain or increase its distributions),” “project,” “expect,” “predict” and similar expressions identify these forward-looking statements. These statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.\nForward-looking statements are based on management’s current expectations and estimates. These statements are neither promises nor guarantees and are made subject to certain risks and uncertainties that could cause actual results to differ materially from the results stated or implied in this press release. StoneMor’s major risks are related to uncertainties associated with the cash flow from pre-need and at-need sales, trusts and financings, which may impact StoneMor’s ability to meet its financial projections, service its debt, pay distributions, and increase its distributions, as well as with StoneMor’s ability to maintain an effective system of internal control over financial reporting and disclosure controls and procedures.\nStoneMor’s additional risks and uncertainties include, but are not limited to, risks and uncertainties related to the following: uncertainties associated with future revenue, revenue growth and related cash flows; uncertainties associated with the integration or anticipated benefits of recent acquisitions or any future acquisitions; StoneMor’s ability to complete and fund additional acquisitions; the effect of economic downturns; the impact of StoneMor’s significant leverage on its operating plans; the decline in the fair value of certain equity and debt securities held in StoneMor’s trusts; StoneMor’s ability to attract, train and retain an adequate number of sales people; uncertainties associated with the volume and timing of pre-need sales of cemetery services and products; increased use of cremation; changes in the death rate; changes in the political or regulatory environments, including potential changes in tax accounting and trusting policies; StoneMor’s ability to successfully implement a strategic plan relating to achieving operating improvements, including improving sales productivity and reversing negative trends in costs of goods sold, certain expenses, cemetery billings and investment income from trusts, strong cash flows, further deleveraging and liquidity enhancement; StoneMor’s ability to successfully compete in the cemetery and funeral home industry; litigation or legal proceedings that could expose StoneMor to significant liabilities and damage StoneMor’s reputation, including but not limited to litigation and governmental investigations or proceedings arising out of or related to accounting and financial reporting matters; the effects of cyber security attacks due to StoneMor’s significant reliance on information technology; uncertainties relating to the financial condition of third-party insurance companies that fund StoneMor’s pre-need funeral contracts; and various other uncertainties associated with the death care industry and StoneMor’s operations in particular.\nWhen considering forward-looking statements, you should keep in mind the risk factors and other cautionary statements set forth in StoneMor’s Annual Report on Form 10-K and the other reports that StoneMor files with the Securities and Exchange Commission, from time to time. Except as required under applicable law, StoneMor assumes no obligation to update or revise any forward-looking statements made herein or any other forward-looking statements made by it, whether as a result of new information, future events or otherwise.\nSTONEMOR PARTNERS L.P.\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(in thousands) September 30, 2017 December 31, 2016 Assets (Unaudited) Current assets: Cash and cash equivalents $ 8,460 $ 12,570 Accounts receivable, net of allowance 77,058 77,253 Prepaid expenses 7,949 5,532 Other current assets 24,524 23,466 Total current assets 119,160 118,821 Long-term accounts receivable, net of allowance 101,094 98,886 Cemetery property 334,208 337,315 Property and equipment, net of accumulated depreciation 115,116 118,281 Merchandise trusts, restricted, at fair value 512,181 507,079 Perpetual care trusts, restricted, at fair value 338,611 333,780 Deferred selling and obtaining costs 124,137 116,890 Deferred tax assets 68 64 Goodwill 70,436 70,436 Intangible assets 63,740 65,438 Other assets 20,603 20,023 Total assets $ 1,799,354 $ 1,787,013 Liabilities and Partners' Capital Current liabilities: Accounts payable and accrued liabilities $ 47,157 $ 35,547 Accrued interest 5,159 1,571 Current portion, long-term debt 1,114 1,775 Total current liabilities 53,430 38,893 Long-term debt, net of deferred financing costs 306,572 300,351 Deferred revenues 903,853 866,633 Deferred tax liabilities 21,487 20,058 Perpetual care trust corpus 338,611 333,780 Other long-term liabilities 38,655 36,944 Total liabilities 1,662,608 1,596,659 Commitments and contingencies Partners' capital (deficit): General partner interest (2,486 ) (1,914 ) Common limited partners' interest 139,232 192,268 Total partners' capital 136,746 190,354 Total liabilities and partners' capital $ 1,799,354 $ 1,787,013 See accompanying notes to the Unaudited Condensed Consolidated Financial Statements in the Quarterly Report on Form 10-Q for the quarter ended September 30, 2017 (the “Third Quarter 10-Q”).\nSTONEMOR PARTNERS L.P.\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (UNAUDITED)\n(in thousands, except per unit data) Three Months Ended September 30, Nine Months Ended September 30, 2017 2016 2017 2016 (As restated)* (As restated)* Revenues: Cemetery: Merchandise $ 40,331 $ 38,129 $ 119,229 $ 110,239 Services 15,414 14,260 46,703 41,712 Investment and other 13,798 14,340 39,884 40,805 Funeral home: Merchandise 6,591 6,708 21,176 20,794 Services 7,900 7,336 25,940 24,373 Total revenues 84,034 80,773 252,932 237,923 Costs and Expenses: Cost of goods sold 11,910 11,721 37,472 34,483 Cemetery expense 19,984 19,926 56,805 53,267 Selling expense 17,082 16,466 49,164 47,774 General and administrative expense 9,752 9,522 29,462 27,719 Corporate overhead 11,887 10,058 39,058 30,106 Depreciation and amortization 3,186 2,927 10,032 9,147 Funeral home expenses: Merchandise 1,793 2,322 5,176 6,306 Services 5,442 6,076 16,595 18,687 Other 5,346 5,433 15,678 15,319 Total costs and expenses 86,382 84,451 259,442 242,808 Other gains (losses), net 338 (506 ) (733 ) (1,579 ) Interest expense (6,944 ) (5,934 ) (20,391 ) (17,431 ) Loss from continuing operations before income taxes (8,954 ) (10,118 ) (27,634 ) (23,895 ) Income tax benefit (expense) (622 ) 169 (2,085 ) (591 ) Net loss $ (9,576 ) $ (9,949 ) $ (29,719 ) $ (24,486 ) General partner's interest $ (99 ) $ (111 ) $ (309 ) $ 2,081 Limited partners' interest $ (9,477 ) $ (9,838 ) $ (29,410 ) $ (26,567 ) Net loss per limited partner unit (basic and diluted) $ (0.25 ) $ (0.28 ) $ (0.78 ) $ (0.77 ) Weighted average number of limited partners' units outstanding (basic and diluted) 37,958 35,470 37,945 34,287 *Refer to Note 1 in Part I, Item 1 of the Third Quarter 10-Q for further detail regarding the restatement.\nSee accompanying notes to the Unaudited Condensed Consolidated Financial Statements in the Third Quarter 10-Q.\nSTONEMOR PARTNERS L.P.\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (UNAUDITED)\n(in thousands) Nine Months Ended September 30, 2017 2016 (As restated)* Cash Flows From Operating Activities: Net loss $ (9,576 ) $ (9,949 ) Adjustments to reconcile net loss to net cash provided by operating activities: Cost of lots sold 7,823 6,773 Depreciation and amortization 10,032 9,147 Provision for cancellations 5,123 9,732 Non-cash compensation expense 656 1,468 Non-cash interest expense 3,318 2,510 Other (gains) losses, net 517 975 Changes in assets and liabilities: Accounts receivable, net of allowance (8,576 ) (18,899 ) Merchandise trust fund 44,251 (13,248 ) Other assets (5,053 ) (4,549 ) Deferred selling and obtaining costs (7,246 ) (9,819 ) Deferred revenues (12,119 ) 49,821 Deferred taxes, net 1,425 (245 ) Payables and other liabilities 14,269 9,307 Net cash provided by operating activities 24,701 18,487 Cash Flows From Investing Activities: Cash paid for capital expenditures (7,960 ) (9,655 ) Cash paid for acquisitions — (10,550 ) Proceeds from divestitures 701 — Proceeds from asset sales 401 1,896 Net cash used in investing activities (6,858 ) (18,309 ) Cash Flows From Financing Activities: Cash distributions (24,545 ) (68,062 ) Proceeds from borrowings 78,792 207,868 Repayments of debt (74,627 ) (207,700 ) Proceeds from issuance of common units, net of costs — 74,535 Cost of financing activities (1,573 ) (6,362 ) Net cash provided by (used in) financing activities (21,953 ) 279 Net increase (decrease) in cash and cash equivalents (4,110 ) 457 Cash and cash equivalents - Beginning of period 12,570 15,153 Cash and cash equivalents - End of period $ 8,460 $ 15,610 Supplemental disclosure of cash flow information: Cash paid during the period for interest $ 13,653 $ 11,434 Cash paid during the period for income taxes $ 2,884 $ 3,114 Non-cash investing and financing activities: Acquisition of assets by financing $ 2,285 $ 505 *Refer to Note 1 in Part I, Item 1 of the Third Quarter 10-Q for further detail regarding the restatement.\nSee accompanying notes to the Unaudited Condensed Consolidated Financial Statements in the Third Quarter 10-Q.\nSUPPLEMENTAL OPERATING DATA Three Months Ended September 30, Nine Months Ended September 30, 2017 2016 2017 2016 Interments performed 12,859 13,127 40,916 40,161 Interment rights sold (1) Lots 5,644 8,469 21,497 23,710 Mausoleum crypts (including pre-construction) 275 419 1,358 1,471 Niches 443 426 1,405 1,181 Net interment rights sold (1) 6,362 9,314 24,260 26,362 Number of pre-need cemetery contracts written 10,411 12,795 33,934 36,955 Number of at-need cemetery contracts written 14,211 14,609 45,070 44,845 Number of cemetery contracts written 24,622 27,404 79,004 81,800", "external_links": [], "published": "2018-01-26T14:59:00.000+02:00", "crawled": "2018-01-26T16:43:48.005+02:00", "highlightTitle": ""}