{"organizations": [], "uuid": "b0cef944ff05c2cd97999f961e5818eeea9c4f86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 44}, "facebook": {"likes": 124, "shares": 124, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219008732&w=1200&r=LYNXMPEE020E2", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-petrobras-classaction/petrobras-to-pay-2-95-billion-to-settle-u-s-class-action-over-corruption-idUSKBN1ES0L2", "country": "US", "domain_rank": 408, "title": "Petrobras to pay $2.95 bln to settle U.S. class action over corruption", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T11:37:00.000+02:00", "replies_count": 0, "uuid": "b0cef944ff05c2cd97999f961e5818eeea9c4f86"}, "author": "", "url": "https://www.reuters.com/article/us-petrobras-classaction/petrobras-to-pay-2-95-billion-to-settle-u-s-class-action-over-corruption-idUSKBN1ES0L2", "ord_in_thread": 0, "title": "Petrobras to pay $2.95 bln to settle U.S. class action over corruption", "locations": [], "entities": {"persons": [{"name": "brendan pierson", "sentiment": "none"}, {"name": "jed rakoff", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "petrobras", "sentiment": "negative"}, {"name": "petroleo brasileiro sa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Petroleo Brasileiro SA ( PETR4.SA ), Brazil’s state-controlled oil company, said on Wednesday it has agreed to pay $2.95 billion to settle a U.S. class action brought by investors who claim they lost money as a result of a corruption scandal.\nPetrobras, as the company is known, denied any wrongdoing under the deal, which is one of the largest securities class action settlements in the United States. U.S. District Judge Jed Rakoff in Manhattan must approve the accord.\nThe settlement was smaller than what many analysts anticipated and was seen as a net positive for the scandal-plagued company. Preferred shares ticked up 0.3 percent to 16.60 reais by midday, roughly in line with the country's Bovespa .BVSP equities index. U.S.-traded shares ( PBR.N ) were unchanged at $10.70.\nAnalysts at Brazilian bank BTG Pactual said the market had expected a settlement of $5 billion to $10 billion. Moody’s said in a note that if approved the fine “would remove the uncertainty related to the amount to be paid to plaintiffs.”\nThe plaintiffs were upbeat, too.\n“Simply put, this litigation and its ultimate resolution has yielded an excellent result for the class,” said Jeremy Lieberman, an attorney for the investors. He called the deal “historic” and said it was the largest ever involving a foreign securities issuer.\nInvestors had sued Petrobras after prosecutors in Brazil accused executives of accepting more than $2 billion in bribes over a decade, mainly from construction and engineering companies.\nPetrobras claimed it was itself a victim and denied wrongdoing in a securities filing on Wednesday. But its market value has plunged as its central role in a massive corruption scheme continues to be unwound by investigators.\nFor the past four years, Brazil has been rocked by the so-called “Car Wash” investigation, which has exposed billions of dollars in kickbacks to executives of state-run companies and politicians who appointed them to their jobs.\nPetrobras said it hoped the settlement would resolve all investor claims in the United States.\nThe deal does not include investors who bought non U.S.-based Petrobras securities outside the United States, according to the company.\nThe deal came days after Brazil’s securities regulator CVM formally accused eight former Petrobras executives of corruption.\nThe accusations relate to possible irregularities in the contracting process for three drilling ships, according to a legal filing by the regulator last Friday.\nAmong the accused in CVM’s filing are former Petrobras Chief Executives Officers Maria das Gracas Foster and Jose Sergio Gabrielli. Neither could be reached for comment.\nThe largest securities fraud settlements in U.S. history include $7.2 billion stemming from the collapse of Enron, $6.2 billion over an accounting scandal at WorldCom and $3.2 billion over an accounting scandal at Tyco International, according to Stanford Law School’s Securities Class Action Clearinghouse.\nReporting by Brendan Pierson in New York; Additional reporting by Gram Slattery and Flavia Bohone in Sao Paulo; Editing by Jason Neely, Susan Fenton and Jeffrey Benkoe\n ", "external_links": [], "published": "2018-01-03T11:37:00.000+02:00", "crawled": "2018-01-03T11:55:49.015+02:00", "highlightTitle": ""}