{"organizations": [], "uuid": "baf9e62464131bb6bc30a4cf1fb8b4b1d3833434", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XB600_amazon_SOC_20180118183544.jpg", "site_section": "https://www.wsj.com/news/business/transportation", "section_title": "Transportation News - Auto Industry News - Wall Street Journal - Wsj.com", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1516360596", "country": "US", "domain_rank": 387, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T14:16:00.000+02:00", "replies_count": 0, "uuid": "baf9e62464131bb6bc30a4cf1fb8b4b1d3833434"}, "author": "Paul Page", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1516360596", "ord_in_thread": 0, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "locations": [], "entities": {"persons": [{"name": "scarborough", "sentiment": "none"}, {"name": "laura stevens", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "newark", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "indianapolis", "sentiment": "none"}], "organizations": [{"name": "logistics news from - wsj", "sentiment": "negative"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "amzn", "sentiment": "none"}, {"name": "wsj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Sign up: With one click, get this newsletter delivered to your inbox .\nSorry about that Rockdale, Texas, and thanks for coming Scarborough, Maine. Amazon.com Inc. AMZN 0.20% delivered heartbreak and excitement across North America with its list of the 20 metropolitan areas the company will consider for its second headquarters, the WSJ’s Laura Stevens writes, kicking off an intense final selection in the contest for the tech giant’s investment and jobs. Pared down from a list of 238 applicants, the finalists include big cities such as New York, Boston and Chicago, sites as small as Columbus, Ohio, and Indianapolis, as well as Washington, D.C., and two of its suburbs. The decision expected this year is likely to bring the final choice luster as a hub for technology in the fast-growing e-commerce arena. The closely-watched site selection has highlighted burgeoning economies in cities such as Atlanta and Newark, N.J., and areas that have fallen short. The good news for some of the also-rans is that they landed on Amazon’s radar for future investment, including the fulfillment centers that have been adding jobs at a rapid pace.\nCanadian oil shippers appear to be on board the Keystone XL pipeline. TransCanada Corp. says it has gotten enough commitments from shippers to proceed with the controversial expansion project in 2019. The WSJ’s Vipal Monga reports the oil companies are on board to ship 500,000 barrels a day for 20 years, creating new flows to Gulf Coast refineries and bolstering oil distribution channels roiled by changes in energy markets. Some of those refiners may be more interested in Canadian crude volumes as shipments from Venezuela’s troubled drillers have waned. The pipeline investment comes as oil transport across North America has faded, hit by growing competition from natural gas and safety concerns arising from derailments in recent years. Carloads of petroleum products on U.S. railroads fell 12.2% last year, according to the Association of American Railroads, and a slight 0.7% year-over-year increase in December ended 31 straight months of declining traffic.\nThere may be only one remaining airline that’s a fan of the A380 superjumbo, but that’s enough to keep the production line alive. Emirates Airlines says it will pay $16 billion to buy up to 36 more of the double-decker planes, the WSJ’s Robert Wall reports, allowing Airbus SE to keep running a production line for a plane that’s seen a dramatic dropoff in interest in a changing aerospace business. Airlines from passenger carriers to cargo operators have been moving away from the biggest aircraft used in scheduled service. They’ve turned toward smaller jets that fit better into economic models that tout frequent flights and nimble adjustments to changing markets. Emirates will account for more than half of all A380s ordered if it exercises all options. Airbus is reducing output of the A380, however, even as the plane maker and rival Boeing Co. speed up production of the smaller planes that airlines prefer.\nGOVERNMENT & REGULATION Photo: Bloomberg News When the Chinese-registered bulk cargo ship the Xin Sheng Hai loitered in the waters off the Russian port city of Vladivostok last August, the U.S. was watching. The vessel is one of six owned or operated by Chinese companies that the U.S. tracked with satellite photographs and other intelligence moving coal illicitly from North Korea, the WSJ’s Michael R. Gordon and Chun Han Wong report. The intelligence suggests the operations were more extensive than China has admitted, and repercussions could reach deeper into the region’s shipping world. The information, including the ships identified by name, tracks ship-to-ship transfers of cargo and other elaborate tactics the vessels took in what the U.S. says were violations of United Nations sanctions against North Korea. The information depicts operations moving alongside legitimate Asian distribution channels, taking in ports and using shipping techniques such as switching beacons on and off to mislead anyone tracking the ships electronically.\nQUOTABLE\n‘ We’re here because we expected to be here and we deserve to be here. ’\n—Aisha Glover, president and chief executive of the Newark Community Economic Development Corp., on the Amazon headquarters selection.\nNumber of the Day 33% Increase since mid-October in per-container shipping rates from Shanghai to the U.S. East Coast, according to Alphaliner.\nIN OTHER NEWS Surging U.S. crude oil production this year is expected to surpass output in Saudi Arabia and rival that of Russia, the world’s largest producers. (WSJ)\nChina’s economy expanded 6.9% last year, the first growth acceleration in seven years . (WSJ)\nThe number of Americans filing applications for new unemployment benefits fell to the lowest level in nearly 45 years . (WSJ)\nNew housing starts in the U.S. tumbled 8.2% in December . (WSJ)\nFederal climate experts ranked 2017 among the three warmest years in modern times . (WSJ)\nInternational Business Machines Corp. reported higher revenue for the first time in 23 quarters and signaled continued growth . (WSJ)\nThe European Union and South Africa gave conditional approval to Qualcomm Inc.’s acquisition of NXP Semiconductors NV. (WSJ)\nPeugeot SA is using its purchase of General Motors Co.’s German unit to set the groundwork to make cars at U.S.-market standards . (WSJ)\nFleet management group Ryder System Inc. named Rajeev Ravindran chief information officer . (WSJ)\nCargill Inc. struck a joint venture pact with Puris, the largest North American producer of pea protein . (Minneapolis Star Tribune)\nVolkswagen Group plans to start exporting cars from China to Southeast Asia nations. (Automotive Logistics)\nJ.B. Hunt Transport Services Inc.’s fourth-quarter operating profit fell 25% on rising costs that included driver pay and the impact of intermodal rail congestion. (Fleet Owner)\nFast-rising truck rates are leading some agriculture buyers to shift their sourcing decisions . (The Packer)\nSouth Africa gave the final regulatory approval for the operating merger of Japan’s three big container shipping lines . (The Loadstar)\nShipping lines and port terminal operators say cargo customers are vastly overstating the use of fees and penalty charges . (American Shipper)\nNorfolk Southern Corp. is working toward a “more stable, resilient” network following recent service problems . (Reuters)\nHawaii started construction of the long-delayed Kapalama Container Terminal at Honolulu Harbor . (KHON)\nApple Inc. broke ground on a warehouse in Reno, Nev., serving a nearby data center . (Reno Gazette Journal)\nChina’s JD.com helped lead a funding round for Vietnamese online retailer Tiki. (TechCrunch)\nNortheast China’s Dandong Port defaulted on its second note payment in recent months. (Splash 24/7)\nABOUT US Paul Page is deputy editor of WSJ Logistics Report. Follow him at @PaulPage , and follow the entire WSJ Logistics Report team: @brianjbaskin , @jensmithWSJ and @EEPhillips_WSJ . Follow the WSJ Logistics Report on Twitter at @WSJLogistics .\nWrite to Paul Page at paul.page@wsj.com", "external_links": ["https://automotivelogistics.media/news/vw-seeks-boost-sales-emerging-markets-exporting-cars-china", "http://www.rgj.com/story/money/business/2018/01/17/apple-ceo-tim-cook-makes-surprise-visit-reno-facility-groundbreaking/1040598001/", "http://www.fleetowner.com/fleet-management/tax-reform-puts-money-back-jb-hunt-s-wallet", "https://twitter.com/WSJLogistics?lang=en", "http://khon2.com/2018/01/16/state-breaks-ground-on-long-awaited-kapalama-container-terminal/", "https://www.americanshipper.com/main/asd/carriers-terminals-tell-fmc-free-time-issues-are-not-a-systemic-problem--70312.aspx", "https://twitter.com/EEPhillips_WSJ?lang=en", "https://theloadstar.co.uk/ocean-network-express-cleared-april-launch-last-regulatory-barrier-cleared/", "https://twitter.com/brianjbaskin?lang=en", "https://www.agweb.com/article/industry-rethinks-freight-cost-expectations/", "http://www.startribune.com/puris-minneapolis-based-maker-of-pea-protein-and-cargill-form-joint-venture/469764313/", "https://twitter.com/PaulPage", "http://splash247.com/dandong-port-defaults-another-note-payment/", "https://www.usnews.com/news/us/articles/2018-01-18/norfolk-southern-pushing-for-more-stable-rail-service-in-2018-ceo", "https://twitter.com/jensmithWSJ", "https://techcrunch.com/2018/01/18/jd-com-tiki-indonesia/"], "published": "2018-01-19T14:16:00.000+02:00", "crawled": "2018-01-19T20:11:54.004+02:00", "highlightTitle": ""}