{"organizations": [], "uuid": "9960d2656ee161318bc5a0068f62e4b99c07c1cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225444909&w=1200&r=LYNXMPEE0P0K4", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-hna-group-sale/hna-group-sells-sydney-building-to-blackstone-for-161-million-sources-idUKKBN1FF178", "country": "US", "domain_rank": 408, "title": "HNA Group sells Sydney building to Blackstone for $161 million: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T12:26:00.000+02:00", "replies_count": 0, "uuid": "9960d2656ee161318bc5a0068f62e4b99c07c1cb"}, "author": "", "url": "https://uk.reuters.com/article/uk-hna-group-sale/hna-group-sells-sydney-building-to-blackstone-for-161-million-sources-idUKKBN1FF178", "ord_in_thread": 0, "title": "HNA Group sells Sydney building to Blackstone for $161 million: sources", "locations": [], "entities": {"persons": [{"name": "matthew miller", "sentiment": "none"}, {"name": "kane wu", "sentiment": "none"}], "locations": [{"name": "sydney", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "1 york street", "sentiment": "none"}], "organizations": [{"name": "hna group", "sentiment": "negative"}, {"name": "blackstone", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "blackstone group", "sentiment": "none"}, {"name": "hna", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 27 AM / Updated 34 minutes ago HNA Group sells Sydney building to Blackstone for $161 million: sources Kane Wu , Matthew Miller 3 Min Read \nHONG KONG (Reuters) - China’s HNA Group has reached a deal to sell a building in Sydney to Blackstone Group for about $161 million, two people with direct knowledge of the matter said, as the embattled company divests some holdings and seeks new funding. \nThis is the latest in a series of measures taken by the aviation-to-financial services conglomerate to address a liquidity crunch, triggered by a debt-fuelled $50 billion acquisition spree over the past two years. \nHNA sold an office building located in 1 York Street in Sydney to Blackstone, one source said. The group had bought the asset in 2011 for around A$117 million, the other person said. \nBoth sources, who did not want to be named as they were not authorized to speak to media, pegged the value of the deal at about A$200 million. \nBlackstone declined to comment on news of the sale, which was first reported by Bloomberg, while an HNA spokesman said the company would address the matter in a statement soon. \nAmid increased scrutiny of its opaque ownership and use of leverage, HNA has over the past few months focused on scaling-back its offshore real estate investments, which Beijing has targeted with capital controls. \nGroup CEO Adam Tan said in November the company would not invest in areas that were not backed by the central government. \nZhao Quan, a board director, told Reuters last month HNA would sell 1180 6th Avenue in New York and was reviewing its overseas assets. HNA’s property portfolio includes buildings in New York and London. \nHNA Investment Group Co announced this week that it had terminated its plan to create a real estate investment trust in Singapore. \nThe group has also walked away from anticipated deals, such as a bid to buy Value Partners Group, the Hong Kong-listed asset manager. \nWith respect to existing investments, HNA is looking to reduce exposure in some by seeking partners and selling shares. \nIt is in talks with a number of developers and private equity firms for co-investments in its multi-billion dollar Hong Kong development project, according to people familiar with the matter. The group did not immediately comment on the situation. \nThe group’s borrowing, including bank loans and bonds, surged more than a third in the first 11 months of 2017 to 637.5 billion yuan ($101 billion), a China bond market filing shows. \n($1 = 1.2424 Australian dollars) \n($1 = 6.3180 Chinese yuan renminbi) Reporting by Kane Wu; Editing by Himani Sarkar", "external_links": [], "published": "2018-01-26T12:26:00.000+02:00", "crawled": "2018-01-26T12:51:33.007+02:00", "highlightTitle": ""}