{"organizations": [], "uuid": "c680763bb7c835e7c402b78a5d1b963210081c4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 3}, "vk": {"shares": 0}, "linkedin": {"shares": 10}, "facebook": {"likes": 48, "shares": 48, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/14/104281761-IMG_0581.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/09/intel-self-driving-cars-ces-announcements.html", "country": "US", "domain_rank": 767, "title": "Intel self-driving cars CES announcements", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:24:00.000+02:00", "replies_count": 0, "uuid": "c680763bb7c835e7c402b78a5d1b963210081c4d"}, "author": "Saheli Roy Choudhury", "url": "https://www.cnbc.com/2018/01/09/intel-self-driving-cars-ces-announcements.html", "ord_in_thread": 0, "title": "Intel self-driving cars CES announcements", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Intel went big on autonomous driving on Monday, showcasing its first self-driving test car and announcing a number of tie-ups with automakers to take the technology forward. \nThe company introduced the first autonomous car in its 100-vehicle test fleet during CEO Brian Krzanich's keynote address at the industry expo CES in Las Vegas.\nGetty Images Intel Corp. Senior Vice President and CEO and Chief Technology Officer of Mobileye Amnon Shashua (L) speaks in front of a Ford Fusion with Mobileye autonomous driving technology during a keynote address by Intel Corp. The car features 12 cameras, radars, laser scanners and computing technologies from Mobileye and Intel. There are three high-resolution cameras at the front of the vehicle that allow for a 180-degree field of view and let the car's image processor see at a distance of up to 300 meters. \nMobileye, which makes software for autonomous driving, was purchased by Intel last year for about $15 billion. Back then, Intel also announced that it planned to build a fleet of 100 highly automated vehicles to test in the U.S. , Europe and Israel .\nSelf driving cars are in focus at CES this year. Start-ups, tech companies and automakers are racing to carve out their shares of the nascent market. On Sunday, Nvidia and Uber announced that the ride-hailing service will use the former's chips for an artificial intelligence computing system for a fleet of self-driving cars. \nIntel added on Monday that about two million vehicles from car makers BMW , Nissan and Volkswagen will use technology from Mobileye to build high-definition maps throughout 2018. Those maps would then be used by autonomous vehicles for navigation.\nThe U.S. firm also announced partnerships with Chinese automaker SAIC Motor and digital mapping company NavInfo to develop automated vehicles, and map roads, in China . Currently, the chip maker is also part of tech giant Baidu's open source autonomous driving project called Apollo.", "external_links": [], "published": "2018-01-09T09:24:00.000+02:00", "crawled": "2018-01-09T09:47:02.996+02:00", "highlightTitle": ""}