{"organizations": [], "uuid": "8010496b76e211aa546a5db7b68adbf4fc38501d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-churchill-downs-incorporated-announces-cash-tender-offer-for-up-to-500000000-of-its-common-stock.html", "country": "US", "domain_rank": 767, "title": "Churchill Downs Incorporated Announces Cash Tender Offer for Up to $500,000,000 of its Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.976, "site_type": "news", "published": "2018-01-10T14:00:00.000+02:00", "replies_count": 0, "uuid": "8010496b76e211aa546a5db7b68adbf4fc38501d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-churchill-downs-incorporated-announces-cash-tender-offer-for-up-to-500000000-of-its-common-stock.html", "ord_in_thread": 0, "title": "Churchill Downs Incorporated Announces Cash Tender Offer for Up to $500,000,000 of its Common Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "louisville", "sentiment": "none"}, {"name": "ky.", "sentiment": "none"}], "organizations": [{"name": "churchill downs incorporated", "sentiment": "negative"}, {"name": "churchill downs incorporated announces cash tender offer", "sentiment": "negative"}, {"name": "cdi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOUISVILLE, Ky., Jan. 10, 2018 (GLOBE NEWSWIRE) -- Churchill Downs Incorporated (“CDI”) (NASDAQ:CHDN) announces that it has commenced a cash tender offer to purchase up to $500,000,000 of shares of its common stock. The complete terms of the offer are set forth in the offer to purchase dated today and the related letter of transmittal.\nCDI is conducting the offer by means of a procedure commonly called a “modified Dutch auction.” This procedure allows shareholders to select the price, within a price range specified by CDI, and the number of shares they are willing to sell at that price (or, should a higher price be determined as the “purchase price”, such higher price). CDI is offering to purchase its common stock for cash for an aggregate purchase price up to $500,000,000, at a single per-share purchase price not greater than $265.00 and not less than $230.00 net to the tendering shareholder in cash, less any applicable withholding taxes and without interest, on the terms and subject to the conditions described in the offer to purchase and the letter of transmittal.\nCDI intends to fund the purchase of the Shares with the proceeds from the sale of Big Fish Games, Inc., which was consummated on January 9, 2018.\nThe offer will expire on the expiration date, which is 11:59 p.m., New York City time, on February 7, 2018, unless extended by CDI. Promptly after the expiration date, CDI will, on the terms and subject to the conditions described in the offer, determine the single per-share purchase price that CDI will pay, subject to “odd lot” priority, proration and conditional tender provisions, for shares properly tendered at or below the purchase price in the offer and not properly withdrawn, and accepted for payment, taking into account the number of shares tendered pursuant to the offer and the prices specified, or deemed specified, by the tendering shareholders. The offer is not conditioned on the receipt of financing or any minimum value of shares being tendered. The offer, however, is subject to other conditions. CDI may extend or amend the offer in its sole discretion, subject to applicable law. If the offer is extended, CDI will delay the acceptance of any Shares that have been tendered. CDI can also terminate the offer under certain circumstances as set forth in the Offer to Purchase.\nThe purchase price will be the lowest price per share (in increments of $1.00) of not greater than $265.00 and not less than $230.00 per share, at which shares have been properly tendered, or deemed properly tendered, and not properly withdrawn, that will enable CDI to purchase the maximum number of shares having an aggregate purchase price not exceeding $500,000,000 (or, if the offer is not fully subscribed, all shares properly tendered and not properly withdrawn).\nAll shares purchased in the offer will be purchased at the same purchase price regardless of whether the shareholder tendered at a lower price. However, because of the “odd lot” priority, proration and conditional tender provisions described in the offer to purchase, it is possible that not all of the shares tendered at or below the purchase price will be purchased if shares having an aggregate purchase price in excess of $500,000,000 are properly tendered at or below the purchase price and not properly withdrawn. No shares tendered above the purchase price will be purchased pursuant to the offer.\nTenders of shares must be made prior to the expiration of the offer and tenders may be withdrawn at any time prior to the expiration of the offer or, if not previously accepted for payment, after March 8, 2018. Shareholders wishing to tender their shares but who are unable to deliver them physically or by book-entry transfer prior to the expiration of the offer, or who are unable to make delivery of all required documents to the depositary prior to the expiration of the offer, may tender their shares by complying with the guaranteed delivery procedures set forth in the offer to purchase.\nWhile CDI’s Board of Directors has approved the offer, none of CDI, its Board of Directors, the dealer manager, the information agent or the depositary for the offer makes any recommendation to shareholders as to whether to tender or refrain from tendering their shares or as to the price or prices at which they might choose to tender their shares. Shareholders must make their own decision as to whether to tender their shares and, if so, how many shares to tender and at what price or prices. Prior to making any decision with respect to the offer, shareholders should read carefully the information in the offer to purchase and the related letter of transmittal, including the purposes and effects of the offer. Shareholders should discuss whether to tender their shares with their own brokers, if any, and their financial and tax advisors.\nThe offer materials are being sent to holders of the common stock. Holders may also obtain copies of the offer materials online at the website of the Securities and Exchange Commission at www.sec.gov as exhibits to the Tender Offer Statement on Schedule TO filed by CDI today with the SEC.\nCDI has retained J.P. Morgan Securities LLC to act as dealer manager for the offer. Georgeson LLC is acting as the information agent and American Stock Transfer & Trust Company LLC is acting as the depositary for the offer. For additional information regarding the terms of the offer, please contact: J.P. Morgan Securities LLC at (877) 371-5947 (toll free) or (212) 622-4401 (direct). Requests for documents may be directed to Georgeson LLC by telephone at (866) 628-6024 and questions regarding the offer may be directed to the information agent or to the dealer manager at their telephone numbers above.\nCDI is making the tender offer only by, and pursuant to, the terms of the offer to purchase and the letter of transmittal. Shareholders must make their own decision as to whether to tender their shares and, if so, in what amount and at what price within the specified range to tender. The tender offer is not being made to shareholders in any jurisdiction in which the making or acceptance thereof would not be in compliance with the blue sky or other laws of such jurisdiction. In any jurisdiction in which the blue sky or other laws require the tender offer to be made by a licensed broker or dealer, the tender offer will be deemed to be made on behalf of CDI by the dealer manager, or one or more registered brokers or dealers that are licensed under the laws of such jurisdiction.\nThis press release does not constitute an offer to purchase securities or a solicitation of an offer to sell any securities or an offer to sell or the solicitation of an offer to purchase any new securities, nor does it constitute an offer or solicitation in any jurisdiction in which such offer or solicitation is unlawful.\nAbout Churchill Downs Incorporated\nChurchill Downs Incorporated (CDI) (NASDAQ:CHDN), headquartered in Louisville, Ky., is an industry-leading racing, gaming and online entertainment company anchored by our iconic flagship event - The Kentucky Derby . We are a leader in brick-and-mortar casino gaming with approximately 10,000 gaming positions in eight states, and we are the largest legal online account wagering platform for horseracing in the United States, through our ownership of TwinSpires.com .\nInformation set forth in this press release contains various “forward-looking ", "external_links": ["https://www.globenewswire.com/Tracker?data=em3BGXJL-p5JLNR25n_DfDolNg7SZ-04Y7M1U9DEhPjyoQ-jsDmDzuW40vq3tPGZLyafT9SSGuIlo2Wkf_LwCA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/d53eb1d3-f58d-4e2f-bdbb-c8c9b5c95103"], "published": "2018-01-10T14:00:00.000+02:00", "crawled": "2018-01-10T16:31:41.003+02:00", "highlightTitle": ""}