{"organizations": [], "uuid": "1790f47a494eb7e303569e62f39d82e87ccf2e60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104973585-GettyImages-682320802.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/29/cyber-security-british-businesses-could-be-fined-23-point-9-million.html", "country": "US", "domain_rank": 767, "title": "Cyber security: British businesses could be fined $23.9 million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:01:00.000+02:00", "replies_count": 0, "uuid": "1790f47a494eb7e303569e62f39d82e87ccf2e60"}, "author": "Anmar Frangoul", "url": "https://www.cnbc.com/2018/01/29/cyber-security-british-businesses-could-be-fined-23-point-9-million.html", "ord_in_thread": 0, "title": "Cyber security: British businesses could be fined $23.9 million", "locations": [], "entities": {"persons": [{"name": "margot james", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "ncsc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Transport, water, energy and health businesses in Britain could be fined as much as £17 million ($23.9 million) if they don't have the \"most robust\" safeguards in place to guard against cyber-attacks.\nIn an announcement Sunday, the U.K. government said that a \"simple\" and straightforward system would be created to make it easy for businesses to report both IT failures and cyber breaches.\nFines will be issued as a last resort, the government said, and will not apply to organizations deemed to have adequately assessed the risks, taken sufficient security measures and engaged with regulators.\nThe National Cyber Security Centre (NCSC) has published guidance — based around 14 key principles — on what organizations need to do to comply with the new system. The new rules relate to the implementation of the Network and Information Systems Directive, which will apply from May 2018.\n\"We want our essential services and infrastructure to be primed and ready to tackle cyber attacks and be resilient against major disruption to services,\" Margot James, the minister for digital and the creative industries, said in a statement. \"I encourage all public and private operators in these essential sectors to take action now and consult NCSC's advice on how they can improve their cyber security.\"\nNCSC CEO Ciaran Martin said the new guidelines would give \"clear advice\" on what organizations had to do to implement what he described as essential cyber security measures. \"Network and information systems give critical support to everyday activities, so it is absolutely vital that they are as secure as possible,\" he added.\nAs the world becomes increasingly interconnected, the issue of cyber security is becoming more and more important. In 2017, a significant ransomware attack, WannaCry, hit 300,000 computers in 150 countries, according to authorities. In the U.K., dozens of National Health Service trusts were caught up in the incident.\nFollow CNBC International on Twitter and Facebook .", "external_links": ["https://www.facebook.com/cnbcinternational", "https://twitter.com/cnbci"], "published": "2018-01-29T15:01:00.000+02:00", "crawled": "2018-01-29T16:27:47.014+02:00", "highlightTitle": ""}