{"organizations": [], "uuid": "281dda303095e5bb513bca5db761917abae3a6e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-lowes-announces-three-new-appointments-to-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Lowe's Announces Three New Appointments To Board Of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-19T15:00:00.000+02:00", "replies_count": 0, "uuid": "281dda303095e5bb513bca5db761917abae3a6e4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-lowes-announces-three-new-appointments-to-board-of-directors.html", "ord_in_thread": 0, "title": "Lowe's Announces Three New Appointments To Board Of Directors", "locations": [], "entities": {"persons": [{"name": "lowe", "sentiment": "negative"}, {"name": "wardell", "sentiment": "none"}, {"name": "brian", "sentiment": "none"}, {"name": "brian c. rogers", "sentiment": "none"}, {"name": "david h. batchelder", "sentiment": "none"}, {"name": "d. e. shaw", "sentiment": "none"}, {"name": "lisa w. wardell", "sentiment": "none"}, {"name": "batchelder", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "robert a. niblock", "sentiment": "none"}, {"name": "lisa", "sentiment": "none"}], "locations": [{"name": "mooresville", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "companies, inc.", "sentiment": "neutral"}, {"name": "relational investors", "sentiment": "none"}, {"name": "adtalem global education", "sentiment": "none"}, {"name": "t. rowe price group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOORESVILLE, N.C., Jan. 19, 2018 /PRNewswire/ -- Lowe's Companies, Inc. (NYSE: LOW) announced today that it has appointed David H. Batchelder, co-founder of Relational Investors, and Lisa W. Wardell, CEO of Adtalem Global Education, to its board of directors effective March 22, 2018. The company will nominate Batchelder, Wardell and new nominee Brian C. Rogers, chairman of T. Rowe Price Group and its former chief investment officer, for election at Lowe's 2018 Annual Meeting of Shareholders.\n\"We are pleased to welcome David, Brian and Lisa as new independent directors to the Lowe's board and especially value the constructive discussions we have had with the D. E. Shaw group,\" said Robert A. Niblock, Lowe's chairman, president and CEO. \"They join Lowe's at an exciting time as we continue to drive our omni-channel strategy forward and build deeper relationships with pro customers to fulfill our purpose of helping people love where they live. The addition of these directors complements our board of directors' skills and experiences, and we are confident they will provide valuable perspectives as we continue to execute our strategy, drive profitability and enhance value for all Lowe's shareholders. We look forward to their contributions and are excited they chose Lowe's.\"\nLowe's Board regularly evaluates its composition to ensure it includes the appropriate skills, experience and perspective necessary to drive growth for all Lowe's shareholders, and with these director additions, eight directors will have joined Lowe's actively engaged board in the past five years.\n\"We appreciate Lowe's collaborative approach and are pleased to have worked together to enhance the company's board of directors,\" said Quentin Koffey, a portfolio manager at the D. E. Shaw group. \"Lowe's is an excellent company with tremendous value creation opportunities in front of it, and we believe the new directors will be significant assets to the board. We believe the refreshed board and the management team are committed to achieving outstanding performance and maximizing shareholder value.\"\nBatchelder will serve for the duration of his time as a director on the board's compensation committee, chaired by Eric C. Wiseman, former chairman and CEO of VF Corporation, and the nominating and governance committee, chaired by Lowe's Lead Director Marshall O. Larsen, former chairman and CEO of Goodrich Corporation.\nWardell will serve on the board's audit committee, chaired by Raul Alvarez, chairman of Skylark Co., and the public policy committee, chaired by Angela F. Braly, former chair and CEO of WellPoint, Inc.\nRogers' committee appointments will be determined immediately following his election to the board at the 2018 Annual Meeting of Shareholders.\nLowe's other independent directors consist of Sandra B. Cochran, president and CEO of Cracker Barrel Old Country Stores; Laurie Z. Douglas, chief information officer and chief security officer of Publix Supermarkets; Richard W. Dreiling, retired chairman and CEO of Dollar General Corporation; Robert L. Johnson, founder and chairman of the RLJ Companies; James H. Morgan, retired chairman and CEO of Krispy Kreme Doughnuts; and Bertram L. Scott, senior vice president of Population Health and Value Based Care at Novant Health.\nAs previously planned under the board's mandatory retirement policy, Robert L. Johnson will not stand for re-election at the 2018 Annual Meeting of Shareholders. Following Johnson's retirement, the Lowe's board will be composed of 13 directors, 12 of whom are independent.\nAbout David H. Batchelder\nBatchelder, 68, was a founder, principal and member of the investment committee at Relational Investors LLC from 1988 to 2015. Prior to that, he served in various executive positions at Mesa Petroleum Co., including as president and chief operating officer from 1986 to 1988. Batchelder served on several other public company boards, including The Home Depot from 2007 to 2011, ConAgra Foods from 2002 to 2007 and Mac Frugal's Bargains Close-Outs Inc. from 1990 to 1997. He received a bachelor's degree in accounting from Oklahoma State University.\nAbout Brian C. Rogers\nRogers, 62, serves as non-executive chair of T. Rowe Price Group, Inc., having retired as chief investment officer of the company in March 2017. He was elected to the T. Rowe Price board of directors in 1997 and was named board chair in 2007. As a member of the board, he has served on the U.S. equity steering, fixed income steering, international equity steering, product strategy steering, and management compensation committees, as well as the proxy committee. He joined T. Rowe Price in 1982 and served in several roles including chief investment officer from 2004 to 2017 and president of two T. Rowe Price funds. Prior to joining T. Rowe Price, Rogers worked at Bankers Trust Company. Rogers earned a bachelor's degree from Harvard College and an MBA from Harvard Business School. Rogers is in the process of receiving the necessary consents from his other boards with respect to his joining Lowe's as a board member.\nAbout Lisa W. Wardell\nWardell, 48, currently serves as president and chief executive officer of Adtalem Global Education, a role she has held since 2016. Wardell has been a member of Adtalem's board of directors since 2008 and has chaired its audit committee. Prior to her current position, she served as executive vice president and chief operating officer for The RLJ Companies for a total of 12 years, and as principal at the private equity firm Katalyst Venture Partners for four years. From 1998 to 2000, Wardell worked as a senior consultant for Accenture in the organization's communications and technology strategic services practice. Wardell earned her bachelor's degree from Vassar College, her law degree from Stanford Law School and her master's degree in finance and entrepreneurial management from the Wharton School of Business. Wardell is a member of The Business Council and the Executive Leadership Council. Among numerous recognitions, she was recently named to Savoy Magazine's Power 300: Most Influential Black Corporate Directors list (2017 and 2016) and has been recognized by Black Enterprise magazine as one of the \"300 Most Powerful Executives in Corporate America\" (2017).\nAbout Lowe's\nLowe's Companies, Inc. (NYSE: LOW) is a FORTUNE® 50 home improvement company serving more than 17 million customers a week in the United States, Canada and Mexico. With fiscal year 2016 sales of $65.0 billion, Lowe's and its related businesses operate or service more than 2,370 home improvement and hardware stores and employ over 290,000 people. Founded in 1946 and based in Mooresville, N.C., Lowe's supports the communities it serves through programs that focus on K-12 public education and community improvement projects. For more information, visit Lowes.com .\nDisclosure Regarding Forward-Looking Statements\nThis press release includes \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Statements including words such as \"believe\", \"expect\", \"anticipate\", \"plan", "external_links": ["http://www.prnewswire.com/news-releases/lowes-announces-three-new-appointments-to-board-of-directors-300585116.html"], "published": "2018-01-19T15:00:00.000+02:00", "crawled": "2018-01-19T16:01:25.004+02:00", "highlightTitle": ""}