{"organizations": [], "uuid": "9f6e64f7145f2d6a753fe528cdc0f9889ac9e61f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-saban-real-estate-acquires-midtown-sam-houston.html", "country": "US", "domain_rank": 767, "title": "Saban Real Estate Acquires Midtown Sam Houston", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.567, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "9f6e64f7145f2d6a753fe528cdc0f9889ac9e61f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-saban-real-estate-acquires-midtown-sam-houston.html", "ord_in_thread": 0, "title": "Saban Real Estate Acquires Midtown Sam Houston", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Campus Advantage Awarded Property Management Agreement\nLOS ANGELES--(BUSINESS WIRE)-- Saban Real Estate today announced its affiliate (“SRE”) has completed its acquisition of University housing complex Midtown Sam Houston. As part of the transaction, SRE will acquire the 384-bed Class A student housing property, which serves the Sam Houston State University community in Huntsville, Texas. SRE also announced Campus Advantage has been awarded property manager for the Sam Houston property.\nWith this acquisition, SRE’s portfolio will increase to more than 20,000 beds across 17 universities, making it the 2 nd largest private equity owner of off-campus, purpose-built student housing communities in the U.S.\n“We are pleased to be expanding our existing portfolio of off-campus student housing with the addition of this newly constructed, Class A property,” said Philip Han, Chief Investment Officer at Saban Real Estate. “Given its rich history in Texas and national reputation for academic excellence, we are particularly excited to enter the Sam Houston State University market, and look forward to serving the University’s student residents with a quality housing experience.”\n“Midtown Sam Houston will be a valuable addition to SRE’s student housing portfolio, and we are pleased to be working with our trusted partner, Campus Advantage, whom we are confident will provide an outstanding housing experience and supportive community for students,” said Bowen Hsu, Managing Director for Saban Real Estate. “We look forward to continuing to grow our student housing platform through this acquisition and as we pursue other opportunities in the student housing space throughout 2018.”\nSRE was represented by Walker & Dunlop ( www.walkerdunlop.com ) in securing financing from Fannie Mae. Walker & Dunlop’s team was led by Will Baker and William Shell.\nChris Epp and Chris Bancroft of FourPoint Student Housing Investments represented the seller in the transaction.\nAbout Saban Real Estate\nSaban Real Estate and its affiliates operate in three segments: Student Housing where it owns a portfolio of 30 properties containing approximately 20,000 beds; Government Office where it owns and operates a portfolio of 19 properties with over 2 million square feet leased to the US government; and lastly in the Self Storage space where it owns a portfolio of 33 properties with in excess of 19,000 storage units.\nAbout Campus Advantage\nCampus Advantage® is an Austin-based real estate firm fostering financially prosperous higher education student housing communities through its management, development, acquisition, and consulting services. Since its founding in 2003, Campus Advantage has been creating successful communities that provide rewarding living, learning, and career experiences, and as a result has become one of the fastest growing private student housing companies in the nation. The company’s asset acquisition and management strategies combined with its dedication to residence life and student development has made Campus Advantage the 6th largest student housing owner and the 7th largest manager in the United States. Learn more at www.campusadv.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005708/en/\nSaban Real Estate:\nSard Verbinnen & Co.\nKelsey Markovich/Molly Curry\nSaban-SVC@sardverb.com\nSource: Saban Real Estate", "external_links": ["http://www.businesswire.com/news/home/20180131005708/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.campusadv.com&esheet=51751506&newsitemid=20180131005708&lan=en-US&anchor=www.campusadv.com&index=2&md5=b1ba89e01a101a74529cc3afdf3c592a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.walkerdunlop.com&esheet=51751506&newsitemid=20180131005708&lan=en-US&anchor=www.walkerdunlop.com&index=1&md5=d5c0f572fa4a006ba0fb0f23a4d1876f"], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T18:50:50.005+02:00", "highlightTitle": ""}