{"organizations": [], "uuid": "20a213a623acfb3ad5bd0b83360991cb6189fe55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-agios-announces-closing-of-public-offering-and-full-exercise-of-option-to-purchase-additional-shares.html", "country": "US", "domain_rank": 767, "title": "Agios Announces Closing of Public Offering and Full Exercise of Option to Purchase Additional Shares", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:01:00.000+02:00", "replies_count": 0, "uuid": "20a213a623acfb3ad5bd0b83360991cb6189fe55"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-agios-announces-closing-of-public-offering-and-full-exercise-of-option-to-purchase-additional-shares.html", "ord_in_thread": 0, "title": "Agios Announces Closing of Public Offering and Full Exercise of Option to Purchase Additional Shares", "locations": [], "entities": {"persons": [], "locations": [{"name": "purchase additional shares cambridge", "sentiment": "none"}, {"name": "mass.", "sentiment": "none"}], "organizations": [{"name": "agios announces closing of public offering and full exercise of option", "sentiment": "negative"}, {"name": "agios pharmaceuticals, inc.", "sentiment": "neutral"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "agios", "sentiment": "none"}, {"name": "cowen and company", "sentiment": "none"}, {"name": "goldman sachs & co", "sentiment": "none"}, {"name": "suntrust robinson humphrey, inc.", "sentiment": "none"}, {"name": "rbc capital markets", "sentiment": "none"}, {"name": "j.p. morgan securities llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Agios Pharmaceuticals, Inc. (Nasdaq:AGIO) today announced the closing of its previously announced underwritten public offering of common stock, including the exercise in full by the underwriters of their option to purchase an additional 1,063,433 shares at the public offering price of $67.00 per share. The exercise of the option to purchase additional shares brought the total number of shares of common stock sold by Agios to 8,152,986 shares and increased the amount of gross proceeds raised in the offering, before underwriting discounts and estimated expenses of the offering, to approximately $546.3 million.\nJ.P. Morgan Securities LLC, Goldman Sachs & Co. LLC and Cowen and Company, LLC acted as joint book-running managers for the offering. RBC Capital Markets, LLC and SunTrust Robinson Humphrey, Inc. served as lead managers for the offering.\nThe shares were offered by Agios pursuant to an automatically effective shelf registration statement that was previously filed with the Securities and Exchange Commission (“SEC”). A prospectus supplement relating to, and describing the terms of, the offering has been filed with the SEC and is available on the SEC’s web site at www.sec.gov . Copies of the prospectus supplement and the accompanying prospectus relating to this offering can be obtained from J.P. Morgan Securities LLC, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, telephone: 866-803-9204; Goldman Sachs & Co. LLC, Attn: Prospectus Department, 200 West Street, New York, New York 10282, telephone: 866-471-2526, facsimile: 212-902-9316, e-mail: prospectus-ny@ny.email.gs.com ; or Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY 11717, Attention: Prospectus Department, or by telephone at (631) 274-2806.\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Agios Pharmaceuticals, Inc.\nAgios is focused on discovering and developing novel investigational medicines to treat cancer and rare genetic diseases through scientific leadership in the field of cellular metabolism. In addition to an active research and discovery pipeline across both therapeutic areas, Agios has an approved oncology precision medicine and multiple first-in-class investigational therapies in clinical and/or preclinical development. All Agios programs focus on genetically identified patient populations, leveraging our knowledge of metabolism, biology and genomics.\nCautionary Note Regarding Forward Looking Statements\nThis press release contains within the meaning of The Private 1995. The words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “plan,” “predict,” “project,” “would,” “could,” “potential,” “possible,” “hope” and similar expressions are intended to identify , although not all contain these identifying words. Actual results may differ materially from those projected or implied in these . Factors that may cause such a difference include, without limitation, risks and uncertainties related to the impact of general economic, industry or political conditions in the United States or internationally. You should not place undue reliance on these . Additional risks and uncertainties relating to the offering, Agios and its business can be found under the caption “Risk Factors” included in Agios’ Quarterly Report on Form 10-Q for the quarter ended September 30, 2017, Agios’ prospectus supplement filed with the SEC on January 19, 2018, and other filings that Agios may make with the SEC in the future. Any contained in this press release speak only as of the date hereof, and Agios expressly disclaims any any , whether as a result of new information, future events or otherwise.\nCONTACTS:\nKendra Adams, Senior Director, Investor & Public Relations\nKendra.Adams@agios.com\n617-844-6407\nRenee Leck, Senior Manager, Investor & Public Relations\nRenee.Leck@agios.com\n617-649-8299\nSource:Agios Pharmaceuticals, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/d8e7652d-64f4-4083-8fbc-9c91c627d91b", "https://www.globenewswire.com/Tracker?data=N6uUAzbRp0qQhlheJS4sZ83oalklU0zhCNgRx8w48zyWPus161nPJ6SBuLIqygknTvJ3c7YgHCvwzO7ULu_zJtPvCJVNW7wo-C-f6jIedlqMHTwo6qFfC1nC4HpW24Cz"], "published": "2018-01-24T00:01:00.000+02:00", "crawled": "2018-01-24T00:54:31.017+02:00", "highlightTitle": ""}